{"text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. Das war's für heute, bis zum nächsten Mal. So Leute, ich bin am Start. Und was hab ich da gerade im Chat gelesen? Der... ah, ich hab grad keinen Chat auf hier, bitte. Der 16 Sterne Mario 64 Rekord wurde gerade geknackt. Weiß jemand wo? Das würde ich mir nämlich gleich mal gerne angucken. Gucken wir mal. Speedruns. Zehner, dass es in Asiaten war. Ich glaube, ganz wenige Asiaten sind da. Wobei, ne, jedoch sind Japaner ganz schön viel am Start. Aber insgesamt ist es bei den Speedruns gar nicht so verbreitet, wie man denkt. 16 Sterne. Ah doch, okay. Das sind Japaner. Ich hab nix gesagt. Ne, vor 8 Tagen kann ich sein. Nicht der aktuelle. Wer hat das eben geschrieben? Ich hab's nur auf dem Tablet gesehen. Ich muss noch mal schnell aufs Klo, bevor ich im Stream anfange. Und hatte nur das Tablet dabei. Ich weiß jetzt nicht, wer's geschrieben hat. Gucken wir mal. 64, 16 Sterne, WR. Twitter ist da am besten für News. Twitter. Twitter kann man da immer ganz gut durchsuchen. Save einfach nur in Buckle, Puddle. Äh. Ja, wo denn? Ja, gut. Also, dann weiß ich auch nicht. Also, ich weiß nicht, wer das eben geschrieben hat, aber... Ich finde irgendwie... Ah, hier. Ah, hier. WR. Sub, 15 Minutes, 16 Sterne. Wo denn? Leute, lasst mich auch mal gucken. Okay, Leute. Wir müssen jetzt... Twitch-Detektiv. StonePanana hat's geschrieben. Ja, vielleicht weiß er auch noch, wer das hat. Twitch-Detektiv. Ne, ne, ne. Kategorie. Nein, nicht lie. Mein Gott, warum ist das Mario für uns hier? Er? Ja. News. Weiß nicht. Wenn so viel... Ey, oder? Nee, das ist irgendwas. Klips. Klips ist eine gute Idee. Klips ist eine gute Idee. Was zum... Warum ist das top viewed, wo irgendwer da Müsli futtert? Pogu, hier. Zwei Stunden. Was? First Sub? Under 15 Minutes? Da kann es ja das hier nicht sein, oder? What the fuck? Doch, das ist das. Okay, das ist es wahrscheinlich. Okay, das ist es wahrscheinlich. Also, was die hier schreiben ist natürlich kompletter Blödsinn Sub 15. Sub 20. Okay, gucken wir mal. Wo geht's los? Ah, guck mal, haben wir noch gut getroffen. Das geht ja nicht lang. Das geht halt plus 20 Minuten. Und, wat? Ah, ich hab mich verklickt. Das ist irgendein Run-Versuch davor. Okay, also wir sind hier bei 5.46. Ach, die In-Game-Time. Ah, okay, das kann natürlich sein. Also, 5.46. Und dann gehen wir mal 20 Minuten zurück. Das ist dann 5.26. So, hier so. Ah, hier geht's los. Hier geht's los. I was here. Okay, das müssen wir uns gleich mal angucken. Das müssen wir uns gleich mal angucken. 20 Minuten, eine Runde Speed. Mal gucken, es steht noch gar nicht drinnen. Oder ist es Virtual Console vielleicht? Ne. Ne, ne, ne, ne. Ah, dass es Zero Star und One Star gibt, das ist halt auch geklitscht ohne Ende. Stimmt, die müssen genau, die müssen das ja noch überprüfen, ob das auch wirklich legit ist und alles. Ja, stimmt, stimmt, stimmt. So Leute, ich muss meine VM noch anmachen, fällt mir gerade ein. Damit ich die ganzen Questions nicht verpasse. Hätte ich vorher schon machen müssen. So. Hier aus, an, ups. So, und jetzt müsst ihr hier mein Pepega Board am Start haben. Auf. Übrigens, wisst ihr was mir Vodafone geschrieben hat gestern? Wisst ihr was mir Vodafone gestern geschrieben hat? Muss ich das mal vorlesen. Ich hatte Vodafone ja das hier geschrieben. Ich hatte Vodafone ja das hier geschrieben. Wir haben gesehen, dass das ganze schon behoben ist, halt gestern 13 oder vorgestern, achten hatte ich das Ding geschrieben. Dass dafür, dass das 1330 schon behoben ist läuft es aber wirklich gut direkt, 45 Minuten Stream wieder abgebrochen. Aktuell läuft es aber bloß mit 2 MBit Upload. Wie sieht es eigentlich aktuell aus? Aktuell geht es, oder? Ja, das ist ja meistens auch nur abends. Zumindest hat Vodafone drauf geantwortet. Ich lese euch das mal vor, weil es wieder so eine typische Vodafone-Antwort ist. Genau, ich soll Bescheid sagen, wenn das Problem aktuell noch besteht. War das erste, was sie geschrieben haben, was ja schon mal total merkwürdig ist, da ich ja hier gesagt habe, nach 45 Minuten abgebrochen, aktuell läuft's wieder, aber nur mit 2M mit Upload. Also, das ist ja eindeutig, ich habe schon oft das geschrieben, eindeutig kein Problem, was 24-7 da ist, was aber alle 1-2 Stunden mal vorkommt. Und danach, danach kam die beste, danach kam die beste Antwort. Bitte versuche als erstes einen Neustart des Routers. Immer der gleiche Scheiß. Das ist... Immer der gleiche Scheiß, Alter. Nee, ey, fucks... Die können ja auch nichts machen, ich mein, was soll, was soll der Support, was soll der Support machen? Was, was, was, mein, was soll... WTF? Was soll der Supporter ja auch machen, ne? Also, ich mein, die können ja schlecht ihre Anbindung mal nebenbei einfach ausbauen, so, so, so, Hallo, Dezix, wir brauchen noch 5 Stecker mehr, weil es wahrscheinlich nicht reicht, aber das wird, das wird ja wohl kaum in 2 Minuten von irgendeinem Support-Mitarbeiter funktionieren, also kostet das hier auch ordentlich Kohle, deswegen schreiben die auch so einen Blödsinn. Full Speed Gamecube V, Dolphin Emulator, iPad, Bro, Bro, nicht Pro, Bro, iPad, Bro, Alter. Der Eichler abonniert, 9 Monate, huge. Der Eichler, bist du da sicher, dass das so ist, ja? Gibt es dazu offizielle Studien? Ich glaub, der Eichler, ich glaub das erst, wenn es da ein Video von MyLab dazu gibt. Sonst glaub ich das nicht. Oh, ist ganz schön laut heute, warum ist es so laut? Ah, weil es 40 ist. Deswegen stimmt meine Audio-Geschichte hier auch nicht. Mal gucken, ob Teams wieder den Sound lauter gestellt hat, das macht Teams ja gerne. Ihr hört mich schon, oder? Ah, ok. Wo stellt man eigentlich, jetzt Leute mal Windows 10 Frage an die Experten. Wo stelle ich die Lautstärke von meinem Mikrofon ein? Ich weiß, dass es über das alte Menü geht. Wo mache ich das offiziell in Windows 10? Wie geht das? Hier nicht. Hier drüber? Drüber auch nicht. Wie geht das? So lächerlich, warum sieht man das nicht auf den ersten Blick? Max ganz unten? Was, wo ganz unten? Hier. Der Device Properties ist wahrscheinlich das alte Menü. Oh, ne, das ist das neue Menü. Ah, excellent. Was passiert eigentlich bei Test? Test, Test, Test, Test. Ok, was auch immer. Ich hoffe es geht noch. Ich mache es immer hier drüber. Ich mache es immer hier drüber. Das alte ist so viel besser. Ich bin da ein bisschen hin und her gerissen bei Windows 10. Ich finde das neue UI an sich gar nicht so schlecht, allerdings ist halt der Funktionsumfang schlecht. Also was ich damit meine ist, ich finde rein so die Technologie von diesem Oberflächen GUI Zeug hier ganz, ganz gut. Dass das quasi so ein bisschen responsive ist und dass sich das auch ziemlich snappy und schnell und alles anfühlt. Aber was ich halt nicht mag ist, dass es so gut wie keine Optionen hat. Wozu brauche ich System-Settings, wo die wichtigsten Optionen fehlen? Der Don Gaming, das habe ich nie gemacht. Das wollte ich mal machen, ja. Dass die neue Systeme und alte nebeneinander laufen lassen ist dämlich. Ja, da gebe ich dir recht. Ich meine, es bleibt ihm ja, aber eigentlich bleibt ihm ja nichts anderes übrig, solange das hier halt zu wenig Optionen drin hat. Ich meine, vielleicht will man ja mal hier was umstellen, was halt noch nicht im neuen drin ist. Es ist halt übliche Windows-Geschichte. Ja, was auch immer. So, was gucken wir zuerst? What Battlefield 6 Needs. Nee, komm Leute, wir gucken als erstes mal. Was ist das? Warum habe ich ein Video über Akkuschrauber drin? Geil, wir gucken nachher ein Video über Akkuschrauber. Wir gucken erstmal eine Runde Battlefield-Top-Plays. Das ist zum Einstieg immer gut. Und danach gucken wir... Oder nee, komm, wir fangen mit dem... Mit was wollen wir anfangen? Wollen wir mit dem Mario 64 World-Record anfangen oder eine Runde Battlefield gucken? Warum benutzt du kein Linux? Wieso ist es doch hier? Hab ich doch ein Linux am Start. Hast du dein Rauchmelder Smart gemacht, dass die mit an... Nein, hab ich noch nicht. Das ist noch was, was ansteht. Also, wir gucken uns den Mario 64 World-Record an jetzt. Der ist erst vor einer halben Stunde oder so aufgestellt worden. Okay, wir müssen noch mal kurz vorspulen, weil das gerade abgekackt ist, wie es aussieht. What the fuck? Moment. Okay, hier geht es los. What the fuck? Kann ich den Anfang mal finden? Anfang, please. Ah, hier. Okay, hier geht es los. Okay, hier geht es los. Also, das ist erst vor ein paar Minuten aufgestellt worden, und zwar von... Ich weiß nicht, wie man die ausspricht, Miss Kiff. Der ist auch gerade noch on, hat wahrscheinlich auch durch den World-Record gerade 13.000 Viewer übelst krasser Shit. Ist wohl auch ein sehr bekannter Runner. Ich muss sagen, ich hab noch nix von ihm geguckt. Aber wie gesagt, nix von mir. Wir gucken uns das einfach nur an. Ach so, stimmt. Warum hatten sich das jetzt wieder resettet? Was ist denn das für ein Kack? Ach, hier geht es los. Hier geht es los. Okay, gucken wir uns das Ganze mal an. Wir gucken uns das Ganze mal an. Wie kriegt er rein Donated? Ist auch richtig so. Der hat es verdient. Also, wenn er sich da so reingehängt hat. Sollte ich es mit dem Chat lassen oder nicht? Sollte ich mit dem Chat oder Vollbild machen? Ich kann auch so machen. Mit Chat. Wobei, da haben wir Chat über Chat, das ist wir. Gucken wir uns das lieber so an. Ich finde es ja geil. Ich finde es ja immer noch geil, dass so viele Leute 2020 ein Spiel spielen, was, Moment, das muss ich jetzt mal nachgucken. Mario 64 Release Date. Ein Spiel, was vor 14 Jahren rausgekommen ist. Ziemlich genau, vor 14 Jahren. Das ist ja auch so Big Brain. 24 Jahre, Alter. 14 Jahre, stimmt ja, ist ja viel. 24 Jahre, kann man sich das vorstellen? Okay. 24 Jahre. Ich kann mich noch dran erinnern, wo ich das neu gekriegt habe. Richtig Boomer. Twitch Chat ist wieder am Spam. Das finde ich ja auch immer übelst nice. Ich glaube, jeder, der das das erste Mal gesehen hat, ich kann es nicht richtig zurückspulen, weil ich da irgendwie übelst lang klingeln muss. Jeder, der das zum ersten Mal gesehen hat, wird sich auch denken, fuck, man kommt über die Brücke drüber, ohne dass man mit Lakitu gehen muss. Was ist mit den Leuten los? Was macht eigentlich der zweite da im Hintergrund? Außer Dasein. Ja, ich habe auch mal eine Mario 64 Speedrun Video gemacht. Mit dem Tylo zusammen, das weiß ich noch. Der Twitch Chat, Alter, ist wieder voll am Eskalieren da. Das ist ja fast so schlimm wie im XQC Chat. Auf dem DS, ich fand die DS Variante nicht gut. Mir hat die Mario 64 auf dem DS nicht gefallen. Da haben sie zu viel geadded. Nö. Da hat er recht. Die meiste Twitch Coffee Pasta ist auch richtig dumm. Das ist übelst schwer, Leute. Das ist übertrieben schwer. Ich habe mir da mal einen Guide zu angeguckt. Normalerweise, wer das Spiel noch kennt, muss mit der Kanone hier oben die Ecke absprengen. Das ist übelst schwer. Man muss da auf dem richtigen Winkel an der richtigen Stelle runterfallen. Das Spiel fällt durch den Stern durch. Total wie, ich habe mir mal einen Guide angesehen. Das kriegt man irgendwie selbst geübt, nur zwei von zehnmal hin oder so. So, wir haben den Stream gerettet. Hey Biz, bist du stolz auf mich? Ja, du bist vorgegangen. Warum bist du stolz auf mich für das? Was? Warum bist du stolz auf mich für das? Chad, wer ist vorgegangen heute? Sag mal, sind wir wirklich sicher, dass wir das Richtige angucken? Weil ich sehe ihn hier nirgendswo in der Top-Liste drin. Hat irgendjemand eine Ahnung, ob wir uns den neuen Weltrekord angucken? Egal, weil das hier ist 15 und das andere ist 20. Ich glaube wir gucken uns nicht das Richtige an gerade. Irgendjemand hat doch geschrieben, ich glaube wir gucken uns nicht das Richtige an. Irgendjemand hat doch geschrieben, vor zehn Minuten ist das nicht das Richtige. Sub20, das ist der, der macht nur seinen PB. Okay Clips, nein nicht Clips. Genau, der hat auch 20 Minuten gebraucht. Nee, nee, nee, das ist nicht das Richtige, was wir gucken. Vielleicht hat mich auch einfach der Chad gerade gebadet. Vielleicht hat mich auch der Chad gebadet. So, da müssen wir das woanders rauskriegen. Nein, nein, nein, kein Krach machen. Raus, Clips, okay. Das kann er nicht. World First Sub15. Moment, die gucken, wie was geguckt wird. Die gucken, wie was geguckt wird. Okay, was gucken die dann? Was gucken die dann? Ah hier, das ist irgendein Livestream aus Japan. Ach jetzt kapiere ich das Ganze. Excellent. Der Knäherbär hat es hier am Start. Ja, wir gucken uns das Original an natürlich. Ah, yes, excellent. Jetzt ergibt das Sinn. Alter, wie das wieder absch... Wir müssen mal kurz an den Start zurück. Ist das eine Herzfrequenz? Sehe ich das richtig? Das ist eine Herzfrequenz vom Runner? Das ist ja auch mal neu. Reddit Post, ja danke Knäherbär. Excellent, find. Eine Herzfrequenz vom Runner. Erstmal Ruhrpuls vor 69. Okay, der ist schonmal sehr entspannt. Das ist ziemlich wenig. Wobei, ne, 69, 70 glaube ich normal. Ne, also Michael, ich glaube nicht, dass du 120 hast beim Sitzen. Ich habe mal gelesen, dass ein Profi Fahrradfahrer hat, also so ein Profi Radsportler kann teilweise bis zu 40 haben. 86, ja glaub auch. So, jetzt gibt er alles, jetzt gibt er alles, hier schon am Input-Spam. Alter, dieses Rumgeklitscht, ich finde es jedes Mal geil. Wow, RIP, Reset, Eats. Also ich glaube, was er an der Stelle probiert hat, ich habe ja auch schon ein paar Speedruns geguckt, der wollte glaube ich in das Bowser Level reinklitschen. In das erste Bowser Level. Und wo ich mich noch beim Tyler dran erinnern kann, was er erzählt hat, ist, dass einem dieses Intro, wo Peach den Brief vorliest, oder nur im Englisch, im Japanisch, liest sie den Brief ja nicht vor, dass einem das am meisten auf den Sack geht. Weil man sich das jedes Mal angucken muss. So, das müsste jetzt Teuren sein hier. Teuren, falls man das überhaupt noch sagt. Das ist in Japan normal mit der Herzfrequenz. Warum sollten Japaner denn unterschiedlichen Ruhepuls haben? Der Stellzer sagt, er hat einen Ruhepuls von 120 im Krankenhaus. Ja gut, wahrscheinlich weil du nicht ohne Grund im Krankenhaus warst. So, er ist mal dran vorbei gejumpt. Ach du meintest, dass viele in Japan den Puls zeigen. Okay. Ja, die Japaner haben da unterschiedliche Vorlieben. Das habe ich auch schon gemerkt. So, ich glaube jetzt versucht er ins erste Bowser Level rein zu klitschen. Was auch wohl funktioniert. Warum man damit anfängt, weiß ich gar nicht so genau. Ehrlich gesagt, keine Ahnung warum man damit anfängt, anstatt die normalen. Na gut, wahrscheinlich weil man sich eh durchklitschen muss, weil es schneller ist. Und man am besten vom Start direkt da reinkommt. Ich kann mich noch dran erinnern, wie vorsichtig man damals durch die Level hier gestellt ist. So nach dem Motto, Mario konnte sogar krabbeln in dem Game und keiner, ich bin da sogar langgekrochen. Und zack. Macht er jetzt Bowser noch? Ja ne oder? Wahrscheinlich. Ja, ja macht er noch. Plantera sagt er hat einen Ruhepuls von 35. Bist du Profi Radsporter? Und Bäm. Ja die ersten zwei sind easy. Die habe ich damals auch immer First Try geschafft. Das ist ja auch kein Problem. Jetzt ist euch mal aufgefallen, dass Mario in der japanischen Version einen Stern zeigt und in der deutschen Version einen Schlüssel. Erstmal Rage Quit. Ne nicht wirklich Rage Quit, absichtlich Quit. Ah, ich glaube jetzt kapiere ich es warum man das zuerst macht mit dem Bowser Level. Wahrscheinlich ist es aus dem Eingang dahin zu kommen am schnellsten und die nächsten Sterne brauchst du mindestens ein Stern dafür um rein zu kommen. Das heißt du musst das Bowser Level eh machen, dass du in ersten Stock kommst. Und die Sterne sind wahrscheinlich einfach schneller als noch hier Bom Bom Battlefield zu machen. Oder wie auch immer die erste Map heißt. Ah, das reime ich mir gerade zusammen. Ich habe mich schon lange nicht mit Mario 64 Speedruns beschäftigt. Zumindest das Spiel macht heute immer noch Bock. Und vor allem wenn man sich anguckt wie easy die Sachen eigentlich sind. Wie easy das eigentlich ist ne. Also wie es aussieht. Also wie es nicht ist aber wie es aussieht. Und man selbst hat sich damals übelst ein Ei abgebrochen teilweise. Ich meine auf dem Niveau wie der macht ist das garantiert nicht einfach. Krass. So das ist jetzt wohl noch eine relativ normale Route denke ich mal. Weil das habe ich schon vor ein paar Jahren gesehen diese Sterne in der Variante. Wobei man halt sagen muss das ich denke zumindest das es gerade bei 16 Sternen halt extrem auf die Ausführung von den einzelnen Sachen ankommt. Übrigens ja Mist erzählt man braucht den Schlüssel nicht das man den ersten Stock kommt ist ja Schwachsinn. Man braucht natürlich den Schlüssel das man ins Erdgeschoss kommt. Welches macht der jetzt? Sand links? Pyramidenstells? Mal gucken welches der macht. Die meisten springen links dann irgendwie zur Pyramide rüber ne. Genau. Genau. Und jetzt oben den. Ach ne der klitscht sich rein in die Pyramide. Und man kann direkt oben rausspringen. Easy hätte ich das damals gewusst. Es ist super gealtert das stimmt. Das stimmt. Das ist wirklich gut gealtert. Das sieht schlecht genug aus das es gut altert. Ich hoffe man versteht wie ich das meine. Sachen wie Half Life 1 die vielleicht besser ausgesehen haben sind schlechter gealtert weil die halt näher dran versucht haben realistisch zu sein. Mario 64 ist deswegen ganz gut gealtert einfach weil es nicht gut genug aussieht. Und wahrscheinlich kann ich das gar nicht richtig schätzen was er hier macht aber es sieht alles äußerst flüssig und clean aus. Also der hat da hunderde Stunden wenn nicht tausende Stunden Übung drin. So jetzt kommt oben das. Ja. Also man hört hier ab und zu von ihm was klicken. Das heißt der hat den Sound an aber der ist so big brain in game der sagt nix. 1,1900 Stunden. Ja krass. Das ist das kann ich mich noch dran erinnern das war auch das war auch für Noobs wie mich easy dies das das Bowser Rätsel Puzzle. So welcher kommt denn jetzt? Der Bulli kommt jetzt oder? Kommt jetzt der Bulli? Ne kommt nicht der Bulli. Es kommt dieses Ding dieses balancieren wo man normalerweise auf dem Holzstück balancieren muss. Ich bin mal gespannt ob man in der Route noch die Bullis macht. Da ist ja schon neun Sterne. Man braucht doch sogar 16. 16 braucht man im Keller. Und durch den restlichen Sachen klitscht man sich dann durch. Durch die Tür klitscht man sich durch. Ja jetzt machen wir doch noch den Bulli. Durch die Tür klitscht man sich durch später und durch die Treppe klitscht man sich durch. Oh stell es so ok. Das ist das und wie war es so? Jetzt kommt der Vulkan? Kommt jetzt der Vulkan? Ah so ein bisschen kann ich mich noch an die Route erinnern. Genau jetzt machst du über den Booster nicht über den Wasserfall auch. Ah das ist übelst schwer. Nicht Wasserfall über den Lavafall. 90er Puls. Fängt gleich wieder ein zu schwitzen. Das ist übelst schwer. Ich habe mal einen Stream gesehen wo das einer geübt hat. Irgendwie fünf Stunden lang und hat es nicht überhaupt bekommen. Oh jetzt hat er geflüstert gerade. Jetzt kommt der Stern da oben drauf liegt vermute ich mal. Ah ne der Nessi Stern kommt jetzt ok. Weil man sich schon durch die Decke klitschen kann weil sich Nintendo gedacht hat Yolo warum soll man da ne Wand hin bauen? Stimmt jetzt gibt es ja von Toad noch einen Stern umsonst. PC lustig ja. Schweißometer wäre auch was tolles. Genau da sollte sich so ein Sensor an die Haut packen. Stress, Stressmeter. Jetzt kommt der Stern. Ne ne jetzt kommt der Stern im Gang. Oben rechts kommt glaube ich jetzt. Hier wo man hier an die Wand springen muss und da oben rechts hin. Und jetzt hat er eigentlich auch schon. Jetzt hat er genug oder wenn er jetzt 15 hat oder hat er 14. Ne einen braucht er noch. Dann hat er 15 mit 15 kann er in diese Wasserwelt gehen. Mit 15, 16 mit der Wasserwelt und dann das zweite Bau salafel. Äh Knäherbeer ja finde ich eine gute Idee. Ich glaube das machen wir echt. Also jetzt müsste das Wasserlevel kommen oder kommt der Haas? Ne der Haas kommt. Genau man braucht ja das Bunny Ding zum durchklitschen durch die Tür. Stimmt die gehen ja gar nicht in die Wasserwelt mehr rein. Die klitschen sich durch die Tür durch und dann klitschen sie sich mit dem Hase durch die Tür zum Bowser. Doch Wasser genau. Und jetzt direkt durchschwimmen bis zum U-Boot. Ja der Soundtrack ist nice, sehr entspannt. Und hopp hopp hopp. Stern und jetzt müsste man ins Bau salafel kommen. Und das war auch schon der letzte Stern der gesammelt wird. 112er 113er Puls. Jetzt ist er aber voll dabei. Na gut er merkt jetzt ja langsam auch das es ziemlich gut läuft. Und jetzt kommen die schweren Dinger. Da läuft echt alles. Der sieht so weich aus von der Bewegung her. Der bleibt nirgendwo hängen. Endlich mal das damals gewusst dass das funktioniert. Jetzt kann man sich über die Lava rein boosten. Ja gut das kennt man schon. Das habe ich schon mal gesehen. Das sieht man auf fast jedem Run. Aber das sieht so weich aus die Bewegung von ihm. Da siehst du dass der echt sehr viel Übung hat. Ich meine es ist nicht umsonst der Weltrekordhalter der sich jetzt selbst über Booten hat. So und jetzt kann er ins Dach. Jetzt kommt glaube ich wenn ich die Route noch halbwegs richtig in Erinnerung habe. Jetzt kommt erst mal Quid. Dann geht er ins Dachgeschoss. Dann springt er durch die Decke. Also er läuft jetzt nicht die Treppe hoch. Dann springt er durch die Decke. Dann klitscht er sich mit rückwärts gespringe die nächste Treppe hoch. Genau durch die Decke springen. Jetzt zur nächsten Treppe und rückwärts die Treppe hoch klitschen. Genau was übelst schwer ist durch das Tor durch. Und jetzt noch mal rückwärts ins letzte Bowser Level. Dann sind wir schon fast am Ende vom Run. Einfach mal das halbe Game übersprungen. So was sagt eigentlich der Chat gerade? Der geht ab. Das Bowser Level ist das schwerste im Game. Also jeder der das mal casual gespielt hat vor allem wenn er neu mit Jumper Run Spielen damals war, der hat sich übelst schwer getan. Hup Hup Hup. Erstmal komplett ohne Kamera das ganze gemacht. Easy as fuck. Oh eine Sekunde verloren. MonkaS. Es gab damals sogar eine Hotline bei Nintendo wo man anrufen konnte. Jetzt geht der Puls erstmal runter und ich glaube jetzt geht der Puls bestimmt wieder hoch. Alter what the fuck. Was ist das für ein Input. What the fuck. WTF. Und noch mal gleich ein dritter Hit. Easy as fuck. Pogu. Oh jetzt geht er. I was here Pog. Jetzt rastet er aus. Jetzt rastet er aus. Jetzt ist er. Jetzt ist er. Jetzt ist er nervlich. Jetzt ist er vorbei. Jetzt ist er vorbei. Aber Sub 15. Pogouts. Massive. Er ist voll außer Pusten aber der Puls geht nicht hoch. Rigged Puls Counter. Der ist fertig. Aber kann er auch. Ich mein überlegt euch mal. 172. 172. Was geht jetzt ab. MonkaS 190. Alter. Gleiches Press F. Das ist wegen dem Kuss von Peach. Hier wir go. Das müsstest du mal in echt bringen. Das müsstest du mal in echt bringen. Kriegst irgendwann einen Schwatzer und drehst dich erstmal im Kreis und machst Victory Zeichen. Was geht denn im Hintergrund gerade ab. Krankenwagen ist unterwegs. Ja sehr nice. Also Ultra Pog. Er hat Glück dass er ordentlichen Hinterlandanschluss hat. Weil in Deutschland wäre während der Übertragung Vodafone zweimal abgekackt und niemand könnte verifizieren dass sein Run legit ist. I was here. I was here. I was here. Also da muss man echt mal sagen hier. Definitiv nicht easy clap. Sondern einfach nur clap. Ich will ein Video machen. Ah. Ähm. Ich muss mal. Was ist denn AmarecTV. Irgendwas Japanisches. Der hat es voll fertig mit dem Nervener. Was hat der eigentlich da noch. Der hat danach dann einfach nur eine halbe Stunde gechillt und sich gefreut. Falsch. Falsch. Hier. Falscher Knopf. Aber das war wirklich exzellent. Da hat Pan themur recht. Exzellent. Cool. Nice. Sehr schön. Das heißt er hat sich selbst verbessert von 15 und 430 Millisekunden auf 14 59 und sonst was. Also eine Sekunde schneller als vorher. Was auf dem Niveau schon ziemlich viel ist. Ich glaube vor ein paar Jahren haben die Leute noch erzählt hier Sub 15 ist quasi unmöglich. Aber nice. Sehr, sehr nice. Haben wir uns doch schon mal was richtig cooles anguckt. So was schauen wir uns als erstes jetzt hier an. Zeig mal her. Battlefield Top Plays. Jawoll Battlefield Top Plays. Eine Runde Battlefield Top Plays. Das geht immer. Kein einzig deutscher in der Rangliste. Es gibt nicht so viele. Es gibt nicht so viele. Hier ist einer mal. Es gibt nicht so viele deutsche Speedrunner die richtig gut sind. Es gibt in. Also es gibt ein paar. Es gibt in a link to the past gibt es ein paar die ganz gut sind. Warum hat er das jetzt nicht gefunden. Gibt es ein paar deutsche. Gernot ist ganz gut. Genau. Es gibt ein paar deutsche hier die ganz gut sind. Das ist aber eher so das was keiner mehr hier spielt den Kram. Da gibt es ein paar deutsche die ganz gut sind. Bei diesem randomizer Zeugs was auch ganz gut ist. Das sind ganz gut. Ansonsten. Weiß nicht wie viele deutsche Speedrunners es noch so gibt die da international richtig gut dabei sind. Was auch ultra nice ist wo wir gerade hier Mario 64 auf hatten. Das gucken wir uns jetzt aber nicht an. Der letzte 120. Oh guck mal der wurde nochmal überbeaten. Krass. Ich kenne nur den hier. Ich kenne nur den hier. Den hat der dann live erspielt hat. Onstream in irgendeinem Charity Event oder was das war. Oder in irgendeinem Speedrun live. Das ist ein ganz guter Speedrunner. Den hatte ich mir auch mal angeguckt. Aber 1.38 ist vielleicht ein bisschen viel. Ich wusste gar nicht dass der mittlerweile schon wieder überboten wurde. Man muss sich mal überlegen. Das ist ein Game was 24 Jahre alt ist. Und da kommen im Monats bis Tagestakt teilweise neue Platzierungen neue Matches rein. Das ist doch echt. Es hätte niemals einer gedacht. 1996 ja. Vor allem die spielen auch alle noch auf der original Plattform. Minecraft hatten dort einen deutschen in ersten Plays. Echt. Minecraft. Java Edition oder. Oder welche. All achievements. All advancements. Komisch da gibt es gar nicht so viel random seed. Der Honiglecker ist da auf Platz 1. Ah excellent. 7 Minuten 17. Moment wie spielt man Minecraft in 7 Minuten 17 durch? Und hier haben wir den RealBinex mit 24, 53. Mach den mal. Den Honiglecker. Der hat schon mal einen richtig heißen Namen. Besser als der Poggerslecker wenn er einen Weltrekord hat. Was ist das Ziel? Ich habe keinen Plassen Schimmer. Was ist denn das Ziel in Minecraft? Wie spielt man Minecraft durch? Der Honiglecker. Da ist er. Any percent. 7. März. 6. März. Ender Dragon. Okay. Okay. Wir schauen uns das jetzt mal an. Okay. Wo geht es los? Ich habe hier keinen Schimmer von Minecraft. Das wisst ihr. Easy. Erstmal easy. Erstmal auf easy stellen. Erstmal die gute alte Pixel Grafik. Nicht RTX oder komische Texture Packs oder Spinnereien. So classic und raw wie es geht. Er atmet. Wo ist der Pulsmesser? Ich kann mir keine Speedruns ohne Pulsmesser angucken. Ich will wissen wie viel Puls man hat wenn man Minecraft in 7 Minuten durch spielt. Ich brauche Pulsmesser. Also was er genau macht. Ich habe keine Ahnung. Weil ich keine Ahnung von Minecraft habe. Er rennt erst mal geradeaus. Warum auch immer. Ah er rennt geradeaus bis er ein Dorf findet. Wow. What the fuck. Speed Harvesting. Okay fahr mal. Perfekt. Was passiert gerade? Und warum haben die Striche durch den Kopf? Was passiert gerade? Ich checke. Was ist das eine Goldachs? Eine Goldachs müsste ziemlich sacken eigentlich weil Gold ziemlich weich ist. Das ist Minecraft Logik. What is happening? Die Schafe haben so ein Ding durch den Kopf. Das ist eine Debug Ausgabe oder sowas. Okay let's go. Let's go. Was auch immer. Interessant. Ich habe keine Ahnung was er gemacht hat. By the way this is the last run for today. Ich habe keine Ahnung was er gemacht hat. Er hat sich Dinger gecraftet. Was auch immer für Dinger. Stimmt. Stimmt. Janik hat recht. Das ist ein Pre Seed. Der weiß was kommt. Wahrscheinlich ist das der offizielle Runner Seed. Das ist die Hitbox bei den Schafen. Was sind das? Hähnchen? Hasen? Okay der weiß wo er hin muss. Der weiß wo er hin muss. Weil das ein bekannter Seed ist. Leute da müssen wir uns danach noch einen random Seed angucken. Ich glaube random Seed ist sogar spannender. Wir können uns aber die letzten 5 Minuten noch angucken weil er gleich vorbei ist. Den 20 Minuten random Seed gucken wir uns auch noch an. Peter. Was? Hat das irgendeinen Sinn dass er jetzt Holz einsammelt? Sticks. Guckt ihr Ocarina of Time Randomizer an? Ich gucke relativ oft A Link to the Past Randomizer aber Ocarina of Time Randomizer habe ich glaube ich noch nie geguckt. Das wird auch noch Bildchen gefahren. Aktuell ist er so ein bisschen Walking Simulator. Wahrscheinlich passiert da ziemlich viel was ich als Minecraft Noob nicht checke. Er baut Betten. Da man in anderen Dimensionen nicht schlafen kann explodieren die und damit macht er Schaden. Ah. Exzellent. Verstehe. Wer kennt das nicht? Das heißt man killt den Endgegner mit einem Bett wenn ich das so richtig verstanden habe jetzt. Exzellent Taktik. I see. Das ist richtig Sixhead. Ich glaube er hat gerade gesagt übelst gut. Bötchen. Für mich so als Minecraft Noob sieht das aus als würde er planlos geradeaus laufen. Macht er aber nicht. Sonst hätte er nicht den Weltrekord. Dungeon. Okay Looten. Das verstehe ich. Wenn ich looten kenne ich mich aus. Oh Dude. Ich hab. Just ignore the timer. Okay. Und jetzt ist er jetzt beim Endgegner schon. Okay. Ich dachte um zum Endgegner zu kommen wie gesagt ich bin der übelste Minecraft Noob. Ich dachte um zum Endgegner zu kommen muss man sich selbst ein Portal bauen. Es gibt ja irgendwie dieses netter Portal. Dann muss man irgendwie da noch das Endportal draus bauen. Was hat der da für eine Worldhack UI? Ich glaube das ist irgendein Debug Mode. Und warum greifen ihn die Endermans nicht an? Weil er sie nicht lange genug anschaut oder? Ich hab keinen blassen Schimmer. Was passiert gerade? Was passiert? Was sehe ich da gerade? Ja wenn das Bett explodiert. Ach nee. Ach. Okay. Okay. Okay. Okay. So gehts wieder. Tweet Tweet geht raus. So. Tweet ist raus. Schauen wir mal wann Vodafone drauf antwortet. Also ihr wisst ja die übliche Geschichte. Wir wollen ja Vodafone möglichst sehr abfacken. Das heißt wer auf Twitter ist und mal ne Runde liken und retweeten und vor allem kommentieren kann wäre äußerst excellent. Damit die auch wissen, dass die Leute das mitkriegen. Ganze Crack, äh Crack, Kratz. Das ist a Crap. Alter. Übelst a huge Crap. Intershit in Deutschland ist der Wahnsinn. Aber geht wieder, geht wieder. Ich glaube es tut wieder. Also es sollte jetzt gerade wieder ohne Problem funktionieren. Ich glaube als nächstes verlinken wir denen immer die Clips. Als nächstes verlinken wir denen immer die Clips. Was war der Fix? Einfach drei Minuten gewartet bis es reconnected ist. Vielleicht hat er jetzt einen anderen Server genommen oder so. Decouts, das haben wir schon. Das haben wir schon. Projektideen. Tool das automatisch Vodafone service antwittert wenn Stream laggt. Das machen wir, das programmieren wir echt. Das ist eine richtig gute Idee. Was wollte ich jetzt gerade sagen? Da ist jemand drauf. Das nächste Mal verlinken wir noch die Stream Clips. Da muss ich sicherstellen, dass ich hier immer mein Vodafone Shithaufen einblende und dann können wir den Link dann verlinken wie es laggt bzw. wie es immer wieder abbricht zwischendurch. Was sind denn das wieder für komische Trends auf Twitter Deutschland? Covididioten, Reproduktionszahl, Körperverletzung, Ansichten und Muttertag. Okay, das oben ist wieder, wir kacken uns gegenseitig an und das da unten ist wahrscheinlich der einzige sinnvolle Trend gerade auf Twitter. Trends for you. Ja, wisst ihr mal. Wisst ihr was schlimmer ist? Wenn man einstellt Trends deutschlandweit, dann trendet in letzter Zeit irgendwelche Kpop-Geschichte. Es trenden fast nur noch Kpop. Ist euch das mal auf Twitter aufgefallen? Sobald es einen Hashtag gibt, den ihr nicht kennt und ihr klickt drauf, auf einmal ist das irgendein Kpop Zeug. Oh Mann, könnt ihr eben nicht einen 4G-Router bestellen? Okay, also wir gucken, lass uns nochmal den Minecraft Weltrekord fertig gucken. Ist da gleich durch. Muss ich sagen, der war jetzt nicht so spannend ohne jetzt die Leistung des Runners schmälern zu wollen, aber ich glaube, dass bekannte Seats nicht so spannend sind im Minecraft. Oh. Ja, Klärbeer, das gucken wir uns gleich danach an. Hi Noob, acht Monate, Dankeschön. Oh, ich hab bestimmt ein paar Subs vergessen. Muss ich gleich mal kurz refreshen. Und jetzt kriegt er jetzt wieder ein Bett drunter gestellt. Warum trifft er den überhaupt? Hat das Ding so ne... ja, der haut ihm auf den Schwanz, Alter. Ist aber nicht nett. Oh mein Gott, please, please, please, bitte, bitte, bitte. Come on, brah. Ja, Hi Noob, Dankeschön für den Sub. Excellent. Exquisite Sub. Poggers Weltrekord. So, wir gucken uns jetzt mal den anderen an. Wir gucken uns den Random Seat an. Den Random Seat an. Ne, den... Hä? Ah, ich hab das falsche Minecraft auf. Random Seat. RealBenex geht 24 Minuten vor 4 Tagen. Oh, das ist richtig frisch. Das stimmt schon. Da hast du recht, Serious Max. Da hast du recht. Der Japaner, sogar der Japaner, ne? Oh, ne, ne, ne. Ne, leckt nicht. Leckt gerade nicht. Sogar der Japaner ist ultra ausgeflippt, ne? Und eben, Deutsche bekommen Weltrekord. Ah, yes, Weltrekord. Easy. So nach dem Motto. Pilzschema. Kappa HD. Ja, sehe ich auch so. 3 Monate. Huge IQ Sub. Dankeschön. So, und jetzt gucken wir uns den, der wahrscheinlich den deutlich interessanteren Run. Random Seat. 24. Minecraft, Weltrekord, Speedrun. Random Seat. Nachdem ich immer noch keine Ahnung von Minecraft habe, bin ich mal gespannt, ob ich halbwegs checke, was da abgeht. Was ist das da? Ist das, ist das World Random Generator oder was ist das? Also ich würde den gerade eben als God Seat bezeichnen. World Render, ok. Oh, Third Person. Excellent, Third Person. Leute, ich habe ein Vorschaufenster. Ich sehe, ob das Team F ist oder nicht. Ok, jetzt wird erstmal Holz abgebaut, weil Holz braucht man wahrscheinlich immer. So, das sage ich jetzt als Minecraft-Kacknoob. Holz braucht man wahrscheinlich immer, oder? Also wirklich hätte man den Seat da, hätte RNG gepasst im Nether und halt beim Trade. Hier Steinspitzhacke. Mit einem Clean End. Also wenn alles gegönnt hätte, so 24, wäre halt immer noch ultra heftig. Wie willst du sonst die Explosionbetten bauen? Richtig. Ich finde es geil, dass Minecraft Speedruns überhaupt ein Ding sind. Eigentlich richtig cool. Erstmal die ganzen Betten mitnehmen. Schon einen Zauberwald könnte ich jetzt ausspielen. Ich vermute mal, dass die Taktik ähnlich ist. Nur nachdem er jetzt nicht weiß, wo was ist, wird er wahrscheinlich mehr Material farben müssen und vielleicht auch selbst ein Portal bauen oder sowas. Im Gegensatz zu Mario 64 habe ich keinen Plastenschimmer, wie so das Routing und so in Minecraft. Das war jetzt für die Cisco-Fans, wie das in Minecraft ist. Auf was man erachtet und welche Reihenfolge macht. Was ist das für ein Viech? Das sind Steingohle oder Eisengohle. Warum gibt es gelbe und weiße Betten? Ist da ein Unterschied? Heilt man in dem einen schneller? Random. Okay, anscheinend ist es ein guter Seat. Ich glaube eh, dass Minecraft Speedruns extrem davon abhängen. Natürlich muss der Runner auch gut sein, aber wahrscheinlich ist auch extremes Seat-Glück mit dabei. Wenn du ein Seat hast, wo alles was du brauchst nebeneinander spawnst. Sollte ich glaube echt machen. Ja, mach ich safe. Da muss ich etwas, weil wenn ich gleich einen Dorf habe, 100% nein. Also ich gehe halt danach auf Dorfsuche. Also ich könnte da lang glaube ich, da kommt es aber nicht oder hier lang. Und save dahinter irgendwo auch noch. Was ist das denn? Herz93, Real Life Pencil Sharpie. Was? Du hast gerade schon einen kranken Run verpasst, der hier war auch lau. Also ein wirklich sehr kranken Run. Was? Er muss Eisen finden um ein Wassereimer zu bekommen. Mit dem Eimer kann er sich ein Höllenportal bauen. Da findet er was Routen die er für die Augen braucht um ins Ende zu kommen. Man sieht wie viel Plan ich von Minecraft habe. Aber der Chat kennt sich ja aus. Also vermute ich mal wird er jetzt einfach Zutaten suchen. Nicht dass ich es blicken würde. Was ist das da unten? Footstabs, Lava, Pop, Item, Plop. Ach das ist so ein Event Log was passiert. Ah jetzt baut er ein Portal oder? Jetzt baut er jetzt ein Portal? Oder auch nicht? Warte. Ja das gibt ein Portal. Das sieht ja fast so aus als würde ich das bauen. Nur dass er das absichtlich so macht. Ok das war das Portal. Verstehe. Ich habe gerade schon einen kranken Run gehabt. Hätte so 24 Minuten Potenzial gehabt. Normal muss er Diaz finden. Ah Diamanten ok. Normalerweise muss er Diamanten finden was 20-30 Minuten braucht. Aber mit einem Eimer kann er sich selbst bauen. Ok. Das heißt er hat nach 5 Minuten das was du normalerweise 30 Minuten verbrauchst. Die Sounds. Was ist mit den Sounds los? Er muss dann am Dorf sich Augen traden die ihm den Weg zum Portal zeigen. Ah yes excellent. Ich verstehe alles. Alles klar. Augen traden. Was passiert? Ok ich vermute mal das ist keine krasse Stratz die zum Run gehört. Sondern er farmt sich XP. Farmt er sich gerade XP? Kann das sein? Ist das XP farm? Interpretier ich das richtig oder muss er einfach die Gegner platt machen? Ach die geben Stäbe. Ruten ok. Ah nice. Eine Runde Ruten farm. Ok Stäbe um Augen zu bauen. Wer kennt es nicht? Ich bin mal gespannt von was für Augen der Chat jetzt redet. Was hat er da eigentlich für Geblumper um sich herum? Das ist von irgendeinem Trank oder von was ist das? Für den Flex. Das ist doch auch alles geplant und es ist ergeblich Random Seed. Ich meine es ist geplant was er machen muss weil er sich auskennt. Aber den Seed kennt er nicht. Die Minecraft Sounds die sind schon ein bisschen. Ja kann man machen. So ein paar Splits wären cool. Chat wo lang? Will da lang gehen glaube ich. Was bedeutet Random Seed Generator vermute ich mal. Ich vermute mal dass es halt eine Random Welt ist. Ok der Knäbär erklärt uns wieder wie es funktioniert. Knäbär schreibt er wird wohl Holz farmen um sich dann Emeralds zu trainen. Mit den Emeralds kann er sich Augen kaufen und dann ab zum Ende. Ist ja fast Overwatch ad ad spam. Ah yes. Erstmal schön. Das Pferd ist das getamed. Der Seed wäre über krass. Dutzend zwölf. Ich glaube deswegen ist es auch der Weltrekord Ram weil er Glück gehabt hat beim Seed. Der Chat wieder. Guck mal das ist ein Pilz. Da ist wieder der Pilz in die Luft gesprengt. Das gibt jetzt viel Holz oder warum sprengt er das in die Luft? Wo ist der Sinn das in die Luft zu sprengen? Einfach dass er es nicht selbst sprengt. Geht schneller. Ok dann habe ich richtig gelegen. Also einfach weil es viel Drops gibt. Ok verstehe. Erstmal eine Runde Holz looten. Ja richtig wie in echt. Wer kennt es nicht wenn der Förster in den Wald geht mit einer Box TNT. Guck mal er hat einen Apple gefunden. Erstmal eine Kartoffel reindrücken. Leute ich habe legit keine Ahnung was 90% der Items machen. Wozu muss er jetzt schlafen? Dass er Ausdauer regeneriert oder sowas. Ah keine Gegner. Ah nachts kommen Gegner aber wenn man im freien schläft in einem Bett dann machen einem die Gegner nichts und die Zeit skipt einfach. Exzellent. Die spawnen dann gar nicht. Ok es wird anscheinend jede Menge extrem viel Holz gefarmt. Sechs Steaks Poggers. Gar nicht so ausgesehen. Erstmal ein paar Hähnchen rüsten. Erstmal wieder aufs Horst drauf. Ah wir sind gleich mit der Zeit. Ich kann mich echt nicht erinnern wann ich zwei so gute Seats direkt hintereinander hatte. Ja da sind wir beim Thema wo eben im Chat jemand gemeint hat das ist schon echt krasser Zufall er sagt es ja gerade dass er selten so gute Seats hat. Die Dorfbewohner Sounds in Minecraft. Ok jetzt gibt es jede Menge Steaks. 30 Milliarden Steaks und dann Emeralds. Ok der Knäbär hat recht. Der Knäbär hat erzählt was er macht und so ist es jetzt auch gekommen. Ok es werden sich 30 Spiele an Steaks gecraftet und dann irgendwie Emeralds draus gestellt. Was auch immer da genau passiert aber jetzt hat er viele Emeralds. Mit den Emeralds gibt es Augen. Was zum Teufel für Augen ich habe in Minecraft noch nie Augen gesehen aber ich habe ja auch nicht wirklich viel in Minecraft gespielt. Die braucht er um das Portal anzumachen. Jetzt ist das wenigstens mal Minecraft. Jetzt wird wenigstens mal was gecraftet. Oder wie der Friseur immer gesagt hat mein QF. Man muss das ja besonders cool aussprechen. Mein QF. Was hat er da eben hergestellt das Goldene was war das Goldene was er da gerade gebaut hat. Und wozu braucht man Closedone. Jetzt sag nicht zum glühen. Er muss den NPC leveln. Aha ok man leveln NPCs. Das ist das Auge was der Knäbär meint. Ok ich blicke zwar nicht durch aber es ist trotzdem interessant zuzugucken. Mr. Opie ja aber da tut sich doch schon seit Jahren nichts mehr. Die Augen brauchst du dann zum aktivieren vom Portal. Spiel auch auf Normal ich darf nicht Joggen. Wenn ich einen Endermann anschaue bin ich tot. Das Pferd schwimmt auch wenn man drauf ist. Excellent. Ein Nicest Horse. Und woher weiß er jetzt wo er hin muss ich check das überhaupt nicht. Wo kriegt er jetzt die Richtung angezeigt. Was geht denn jetzt ab. Die Augen zeigen den Weg. Ja wo wo. In die Richtung in die das Auge fliegt. Ok das heißt er hat jetzt ein Auge geworfen. Das was er da gerade gemacht hat oder so. Weil ich jetzt irgendwie nicht richtig mitgekriegt hab. Und in der Richtung wo das fliegt. Oder fliegt das vor ihm her weil ich seh nix. Also so werfen wie aus dem Inventar raus werfen oder wie. Oder Item benutzen. Gute Entscheidung. Ach nur kurz ok. Es fliegt nur kurz deswegen braucht er da auch mehrere von. Ah ok das heißt er tastet sich da jetzt ran. Der wirft das mal eins. Rennt eine ganze Weile in die Richtung. Wirft da noch mal eins. Ah jetzt hab ichs gesehen. Jetzt hab ichs gesehen. Ok jetzt hat das wohl gefunden. Weil das ist nach oben geflogen. Ei auf Latan. Omega Lul. Omega Lul. Es fliegt nach oben in die Richtung vor dem Portal A. Verstehe. Excellent. Das ist einfach ein Block in der Luft. Denkt ihr es ist hier. Ach das droppt dann wieder. Kann das Pferd mehr als ein Block hoch springen oder ist es einfach nur schneller. Zwei Blöcke und schneller. Aha. Wir haben hier die richtigen Minecraft Experten im Chat. Excellent. Ah ok jetzt sieht er jetzt muss er quasi hier geradeaus in die Richtung weiter. Jetzt hab ichs glaub ich kapiert. Pro Chat. Ja. Massive Pro Chat. Sollte hier gleich sein save. Die Pferde AI buggt. Moment das Pferd ist. Ich dachte man steuert das Pferd ganz normal mit WASD jetzt wenn man drauf sitzt. Ja ist auch so. Wie kann dann die Pferde AI buggen. Aha jetzt ist er fast da. Jetzt hat er nämlich gesehen die Richtung hat sich geändert. Und woher weiß er jetzt dass es exakt da ist. Gut Glück. Ok raten. Wow Monkeys. Oh Big Brain Strats. Ich sehe ich sehe ich verstehe was er gemacht hat. Jetzt hat er es direkt gefunden. Das ist übelst Glück oder. Das ist übelst Glück dass er es jetzt direkt gefunden hat. Das ist wahrscheinlich deswegen auch weil es der Weltrekord Run ist. Moin Max alles gut bei dir. Ja alles top. Ne Jo Jein Ja was denn jetzt. Ja es ist nur unter dem Auge irgendwo. Weil er selbst gesagt. Ah und jetzt muss er das auffüllen mit den Augen. Deswegen braucht auch genau 12 und ein bisschen Reserve. Und dann was ist denn wenn man da rein teleportiert sport man dann irgendwo irgendwo random in dieser anderen Dimensions Welt. Ja aber die ist nicht so groß ne. Das ist wahrscheinlich bloß eine Plattform mit Drache drauf. Ich habe gesehen es gibt auch irgendeinen dass der Drache gar nicht der Endgegner ist sondern es gibt dann auch irgendwelche noch. Habe ich letztendlich in irgendeinem Stream gesehen dass es jetzt auch irgendwelche Ender Ender Villages gibt oder sowas. Biggest Minecraft Noob ja sage ich doch ich habe keine Ahnung davon. Das ist neu ok. Geht direkt. Er spielt es auf eine ältere Version. Ok wahrscheinlich weil es irgendwelche Klitsch nicht mehr gibt auf der Neue. So und jetzt kommt gleich der Betten-Klitsch wieder. Ich gönn dich. Hallo? Please? Na trifft nicht. Na aim. Warum kann ich dich nicht treffen? Huge Na. Kannst du mir mal erklären? Einfach erstmal Flying Cheat anmachen und hochfliegen. Easy. Ich greif dich nicht. Jetzt aber. Und das bei einem Weltrekord. Ja daran sieht man, dass das Seed wohl extrem glücklich war auch. Jetzt kommt der Betten-Klitsch. Oh das zieht aber richtig viel Energie ab. Der Drache macht auch nicht so wirklich was oder? Ist das schwer normalerweise? Ist das ein schwieriger Bosskampf oder eher so easy as fuck, wenn man erstmal da ist? Was macht das Bett denn? Das Bett scheint zu explodieren, weil man hier nicht schlafen kann. So hab ich das vorhin verstanden. Nee, ich mein wie schwer der Kampf normalerweise ist, wenn man da legit hingeht oder normal hingeht. Der Drache ist easy, okay. Also normalerweise hast du wahrscheinlich auch gescheite Waffen, gescheite Rüstung und alles. Wahrscheinlich sind die Endermans schwieriger drum herum. Warum hat er eigentlich unendlich Pfeile? Oder hat er nicht unendlich Pfeile? Hat er nicht, er hat einfach nur viele. Der Drache produziert Pixel. Jetzt erstmal wieder runter auf den Schwanz hauen und eats. Easy. Ja, nice run. Ich weiß es nicht zu würdigen, weil ich keine Ahnung von dem Game hab. Okay, kann das sein, dass sich irgendwie Deutsche bei einem Weltrekord nie freuen? Ah, gut, geschafft. Okay. Oder ist ihm vielleicht auch gar nicht klar, dass das ein Weltrekord ist. Okay. Welche Effizienz? Mir erscheint so. Ja, nice. Also Speedrun hier von Binex. Ich weiß nicht, ob sich mein Kampf auf Speedruns interessiert. Mal eben mal vorbeigucken, wahrscheinlich hat er noch mehr. Sehr nice. Was sagt denn Unity Media eigentlich? Die sagen gar nichts, die gehen wieder auf Tauchstation. Okay, der Weltrekord ist halt das mindeste, genau. Hast du das Video von Kugelmagnet Eddy gesehen zum Thema Battlefield 6, Battlefield 5? Nee, soll man das gucken? Kugelmagnet. Ich gucke wenig deutsche Videos, muss ich ja dazu sagen. Das da? Oder welches, meinst du? Okay. Tach. Ai, was geht? Den KLS Song? Nein, den hab ich noch nicht gehört. Es gibt auch ein paar Sachen, die will ich nicht hören. Vor allem, warum muss der jetzt auch noch singen? Es hat ja nicht schon gereicht, dass er nicht mit seinem Fitnesszeug die Leute gescampt hat. Es muss auch noch singen. Egal, wir gucken jetzt das Video an. Kein Battlefield 5 Content mehr. Ich fühle mich verarscht. Battlefield 5 Dice EA Rant. Okay. Ist laut genug? Ich denke schon, oder? Ja, und der Patch-Trailer sah auch übelst räudig aus. Es gibt keine Amis, korrigiert mich, wenn ich falsch liege, Leute. Es gibt keine Amis, es gibt kein D-Day, es gibt eigentlich fast nichts, was man mit dem zweiten Weltkrieg verbindet. In dem Spiel. Keine Russen. Stimmt, Amis gibt es, keine Russen gibt es. So rum war das. Russen gibt es nicht. Keine Russen, keine Ostfront. Kein D-Day, nichts, was du mit dem zweiten Weltkrieg verbinden würdest. Ach so, stellt so. KLS ist jemand, das kann ich mir nicht angucken. Da läuft mein Gehirn aus. Aber ich mag es trotzdem nicht. Und wo man von Anfang an mit Content-Hippen dran war. Ja, ja. Ja, ihr gerade recht. Die haben sich, die haben sich ja auch selbst gebated. Ich erinnere nur mal an den ehemaligen DICE-Chef, der noch gesagt hat, er weiß nicht, wie er seiner Tochter erklären soll, dass es keine weiblichen Soldaten gibt. Und wem das nicht gefällt, dann soll das Spiel nicht kaufen. Das ist so ein Ultra-Marketing-Fail gewesen, dass der überhaupt, wie der es überhaupt in die Position geschafft hat, ist mir nicht klar. Die waren einfach unfähig, die waren unfähig, die waren unfähig. Ja, genau. Das habe ich auch schon oft gesagt, der erste Trailer war so extrem fail, vor allem, weil sie vorher eine halbe Stunde erzählt haben, wie realistisch, wie authentisch, wie mit Veteranen zusammengearbeitet, blablabla, was sie alles haben. Und dann kommt der Trailer mit der Frau, mit der Krallenhand, mit der Kriegsbemalung, mit dem schwarzen Soldaten, mit dem Katana auf dem Rücken, mit dem Panzer, der durch die Wand fährt, was nichts, aber auch gar nichts mit dem zu tun hatten, was die ursprünglich erzählt haben. Das stimmt. Kennt ihr das doch, wo Snoop Dogg Battlefield 1 gespielt hat? Ja, das war geil. Das hat richtig wehgetan beim Zugucken. Der hat die ganze Zeit einfach nur im Graben gesessen und ist von links nach rechts gelaufen. Da habe ich mich so weggepisst. Das ist richtig. Das ist richtig, ja. Ja, also Trailer an sich ist letztendlich nicht das Problem. Was für einen Trailer ist eher das Problem gewesen? Ja. Ja, richtig, richtig. Ja, das stimmt. In Rush. In Rush vor allem. Das war ja in Battlefield 4 leider nie so gut. Im spielerischen, finde ich persönlich, ist Battlefield 4 in fast jeder Belange mittlerweile einfach besser. Und warum? Weil sie einen Public Test Server eingerichtet haben, ein CTE, Community Test Environment. Dort testet man verschiedene Sachen. Und wer keine Lust auf ewige Experimente und sich ein permanent verendetes Spiel hat, der hat halt nicht auf dem Test Server gespielt, sondern auf dem Live Server. Und wenn auf dem Test Server sich herausgestellt hat, dass die Community sagt, ja, das ist cool, das ist eine gute Änderung, das können wir machen, dann wird es umgesetzt. So wurde Battlefield 4 zu einem der besten Spiele, wenn nicht sogar dem besten Spiel der letzten Jahre. Vor allem, vor allem, weil sie sich halt auch Gedanken gemacht haben und was an dem Spiel geschraubt haben und nicht so planlose Änderungen, wie ich es teilweise in Battlefield 5 mitgekriegt habe. Time to kill runter, Time to kill hoch, Time to kill runter, Time to kill wieder hoch und solche komischen Dinger. Das hat in Battlefield 4, was ja auch einen katastrophalen Start hatte, einfach strukturierter und sinnvoller gewirkt. Also meiner Meinung nach ist Battlefield 4 eins der besten Spiele, auch immer noch. Battlefield 1 hat auch Test Server gehabt. Battlefield Hardline hat Test Server gehabt. Man weiß die Dinger funktionieren und bringen was. Und was macht man bei Battlefield 5? Man patch die Time to kill viermal hin und her. Und das auf dem Live Server. Ich habe es nicht gespielt, aber der Aufschrei war so groß, dass sogar ich den mitgekriegt habe. Ich habe es nicht gespielt, aber der Aufschrei war so groß, dass sogar ich den mitgekriegt habe. Und ich habe es nicht gespielt, aber der Aufschrei war so groß, dass sogar ich den mitgekriegt habe. Und ich habe es nicht gespielt. Als das Pacific Update rauskam, war das Spiel gerade dabei wieder interessant zu werden. Und das sehe nicht nur ich so. Es gab so viele Leute, die wieder Bock auf Battlefield hatten. Das Spiel war gerade dabei wieder richtig interessant zu werden. Und genau in dem Moment sagen sie, wir ändern nochmal die komplette Time to kill und verlängern die einfach mal. Und das über Monate. Ja, das ist auch eine Sache, die ich mitgekriegt habe, dass die unglaublich langsam waren, was das Ganze anbelangt. Auf der einen Seite hier auf Service Game und Dauer Content und Dauer Support und Update und sonst was machen. Und dann langsamer sein mit Patches als Blizzard bei Overwatch. Monate blieb die Time to kill, wie sie war. Alle. Also klar, es gibt Ausnahmen. Und wenn ihr da draußen einer von den Leuten seid, die sagt, mir gefiel das besser, das ist völlig okay. Aber der große Teil der Community hat gesagt, das ist Schrott. Das wollen wir nicht. Macht es zurück. Das war vorher gut. Das Spiel ist jetzt gut. Lasst es so. Nein, es wird durchgezogen. Und was ist das Ende vom Lied jetzt gewesen? Nach Monaten wurde die Time to kill wieder so hingepatcht, wie sie davor war. Monatelang Zeit verschwendet für nichts. Wie bescheuert kann man sein? Und anstatt dass diese Zeit für vernünftigen Content oder richtige Patches gemacht wurde, wurde sie einfach vergeudet und jetzt merken sie, wir werden wohl nicht fertig. Ja, das ist schwer zu sagen. Also muss ich sagen, für uns als Außensteher sieht das so aus. Ich glaube nicht, dass sie da sinnlos rumgehampelt haben den ganzen Tag und sich denken, ja, wir machen jetzt mal hier, wir machen jetzt mal da, die wenn da schon einen gewissen Plan gehabt haben, der halt nach außen hin nicht aufgegangen ist. Also ich glaube nicht, dass DICE wirklich Zeit vergeudet hat im eigentlichen Sinne, dass sie sinnlose Sachen aus ihrer Sicht oder dass sie sinnlose Sachen gemacht haben. Die haben das schon für den besten Weg gehalten. Das war halt für'n Arsch, ne? Oh, Rage Mode. Jetzt ist Rage Mode activated hier, ich seh's schon. Bad Company 2, Poggers. Fuck it, was soll's, Digga. Jetzt ist Battlefield 1 auch wieder interessant, auch wenn es spielerisch vielleicht meiner Meinung nach nicht so gut ist wie Battlefield 5, dass wenigstens fertig gemacht worden. Da gab's wenigstens Maps und Content und das ist ein fertiges, polishedes Game. Also ich find's eine absolute Frechheit nach der ganzen Misere zu sagen, oh, machen wir halt einfach gar nichts mehr, was soll's. Es ist ein Live Service Game versprochen worden und die Leute haben das Spiel gekauft in dem Wissen, das was jetzt drin ist, ist nicht alles, was ich für die Markt bekomme, die ich ausgegeben hab. Aber das ist ein schönes Beispiel dafür, wie's gehen kann und das muss jedem klar sein im Endeffekt, wenn man sich jetzt was kauft für Versprechen, die abgegeben werden. Das ist das Gleiche, es ist in ähnlicher Form das, wie wenn du Sachen vorbestellst. Wenn du Sachen vorbestellst und jetzt schon deine Kohle gibst, ist es fast genau das Gleiche. Du bestellst die Sachen vor mit dem Versprechen, dann kommt das, was du haben willst, was absolut nicht klar ist. Vor allem in der heutigen Zeit nicht klar ist, wo teilweise Spiele rausgeschissen werden, in einem Zustand, wo du dich fragst, hat das mal einer selbst von denen Probe gespielt? Und anstatt, dass es überhaupt irgendwann mal Spaß gemacht hat, wurde es hin und her kaputtgepatcht und Sachen, wo man sich fragt, wieso ist das eigentlich immer noch ein Bug, die werden einfach nicht gefixt. Mal ganz abgesehen davon, von den immer noch total katastrophalen Menüs, die nicht funktionieren, ewigen Anzeigebugs, dass man manchmal einfach nicht mehr spawnen kann, weil die Maus nicht funktioniert. Was sind das für Fehler? Nö, lieber 20 mal die Time to Kill Patchen. Sehr sinnvoll. Also für mich war der Gipfel der Dämlichkeit dann erreicht, als sie dann Firestorm rausgebracht haben. Firestorm ist für mich einer der besten Battle Royales, die bisher rauskam. Habe ich von vielen, ohne Scheiß, ich habe es nie gespielt, habe ich von vielen Leuten schon gehört, aber das ist total untergegangen, Firestorm. Du hattest keine Legs, die Hitrack hat gut funktioniert, das Plattensystem hat auch gut funktioniert, Warzone hat es übernommen von Firestorm. Es war ein sauguter Battle Royale, aber kein Mensch kauft sich für Battle Royale Battlefield, das macht keiner. Ja, Free to Play. Das hätten sie wirklich Free to Play machen müssen, ja. 60 Euro ein Battle Royale Spiel. Das gibt Free to Play Alternativen, das gibt Early Access Alternativen, die günstig sind. Warum sollte irgendwer einen Vollpreis für Firestorm ausgeben? Und selbst wenn es komplett gerechtfertigt wäre, die Leute, die haben im Kopf, das ist ein Spielegenre, da gibt es hier was, was ich fast sofort ein Puppe gebe, also Spiele, die im Endeffekt nichts kosten und ok, bei PUBG, bei PUBG musst du immer noch kaufen. Und das kriegen die Leute einfach nicht in den Kopf rein zu sagen, ah ja, ich kaufe mir jetzt einen Battlefield, um Battle Royale zu spielen, egal wie gut das ist. Aber das hätten die Free to Play machen müssen, das wäre die einzige Chance gewesen. Ja, Warzone ist umsonst, ich weiß, deswegen funktioniert es ja auch so gut. Nicht nur, dass sie den guten Battle Royale hinter einer Paywall versteckt haben, obendrauf bringt Electronic Arts, der eigene Publisher, zur quasi selben Zeit, eins der besten Free to Play Battle Royales raus, das es gibt nämlich Apex Legends. Wie bescheuert kann denn Timing und Planung bitte sein? Natürlich kaufe einfach noch Battlefield, egal wie gut das Battle Royale ist, wenn ein Free to Play Battle Royale-Hype am Start ist, wie er seinesgleichen sucht. Was ist das für ein dämlicher Scheiß? Apex hat aber auch ein bisschen verkackt, wenn man sich die Viewerzahlen anguckt. Die ganzen Apex-Leute spielen jetzt Valorant. Ein Free to Play Battle Royale hätte Firestorm sein können und Firestorm hat die meisten Elemente, die Warzone hat. Firestorm hätte locker diesen Hype, den Warzone jetzt hat, auch haben können. Ja, Free to Play. Richtig, sehe ich genau so. Das habe ich damals gesagt und ich sage es heute und sie sollten es immer noch machen. Sie sollten immer noch ein Battlefield Battle Royale rausbringen, was Free to Play ist. Vier Monate Mauni, Dankeschön. Big Brain-Zap. Und auch da, für mich einfach die totale Sabotage. Also das wirkt wie Sabotage. Wie kann man denn von dem eigenen Publisher... Was ist das für eine Entscheidung? Die wissen genau, wann... Das ist eine Stonks-Entscheidung. ...Games rauskommen. Die wissen genau, wann der Battle Royale-Modus rauskommt. Die wissen genau, wann Apex Legends rauskommt. Und was macht die? Ihr sagt sich auch, weißt du was, Titanfall haben wir so oft zwischen zwei großen Releases gepackt. Wahrscheinlich war das einfach eine Wiedergutmachung. Vielleicht haben sie einfach nur gedacht, weißt du was, jetzt muss Battlefield mal jetzt an die Fratze kriegen. Aber was ist das bitte für eine Geschäftslogik? Also für mich ist das klar, Battlefield 5 ist für mich in dem Moment gestorben. Ganz ehrlich, ich habe viele Sachen habe ich noch in Anführungszeichen verteidigt oder gerechtfertigt. Habe gesagt, passt auf Leute, dafür ist aber das und das. Das Spiel als solches ist auch gut. Es gibt viele Dinge, die stören mich nach wie vor nicht. Dieser ganze Hate, den das Spiel abgekriegt hat, meiner Meinung nach nicht gerechtfertigt. Einfach eine CTE einrichten, wo die Sachen getestet werden können, das Spiel als solches laufen lassen und fucking Content bringen, wie versprochen. Aber ich wette mit euch, es lag darin, dass kaum einer was gekauft hat, weil es ja auch kaum was zu kaufen gab. Wären da ein paar geile Skins bei gewesen, die man sich für ein paar Euro hätte kaufen können, hätte ich vielleicht auch reingecashed. Aber das einzige, wofür man wirklich echt Geld hätte ausgeben können, waren Elite-Skins und die haben mich einfach nicht interessiert. Aber das ist doch nicht meine Schuld. Das passt dann aber wieder nicht zusammen. Also wenn es ein Vollpreisspiel ist, dann erwarte ich auch keinen Ingame-Shop. Aber ich weiß, das ist in der heutigen Zeit ja schon komplett utopisch, sowas anzunehmen. Natürlich haben Vollpreisspiele auch Ingame. Guck dir WoW an. WoW, Alter. WTF, Corona. World of Warcraft ist das schlimmste Game, was mittlerweile Monitarisierung angeht, ohne Scheiß. Du musst das Game kaufen. Du musst, keine Ahnung, wahrscheinlich das neueste Addon noch kaufen. Du musst einen Monatsbetrag bezahlen und du hast Ingame-Cash-Shops. WTF, was ist mit Blizzard los? WoW ist wirklich alles. WoW ist Pay2Play... Nee, warte mal, was gibt es da alles? Buy2Play, Pay2Play, Pay2... Ach fragt mich nicht, alles, alles. Es hat alle Formen drinne. Möglich, ich habe es nicht großartig gespielt. Ganz schön große Downtime für einen Battlefield, oder? Jetzt endlich fertig raus. Es bringt sonst nichts. Dann richtet gleich ein Testserver ein. Sofort Day 1. Und dann testet ihr dort alle Änderungen, die ihr plant. Und dann hört ihr auf die Community. Nee, du kannst hier im Ingame-Shop einen Levelboost kaufen. Das ist schonmal was. Die arbeiten eigentlich gut mit der Community zusammen. Aber irgendwas hat sich da geändert. Wahrscheinlich wurde da die Besetzung geändert oder was. Es sind andere Leute am Werk, andere Leute, die die Entscheidungen fällen. Aber wer auch immer das verkackt hat, schönen Dank auch. Ich kann nur sagen, ich habe keinen Bock mehr auf Battlefield 5. Ich werde jetzt nicht mehr zocken, weil ich absolut keinen Sinn darin sehe, ein Spiel zu spielen, was so verkehrt lief, was so verkackt wurde. Und je mehr Leute das jetzt noch spielen, desto schlimmer wird es, weil die werden jetzt sehen, oh Mensch, die Leute kommen. Also ganz ehrlich, noch eine Message an alle, die jetzt noch gerne aktiv Battlefield 5 spielen, spielt es bitte. Versteht sich falsch, ist eure Entscheidung. Aber tut mir den Gefallen und gebt keinen müden Cent mehr in diesem Shop aus. Denn dieses Spiel hat es nicht verdient, mehr als den Kaufpreis zu bekommen. Tut mir leid, ich habe auch hunderte Stunden da reingesteckt in das Spiel, habe auch hunderte Spielspaßstunden damit gehabt. Ich habe den Kauf nicht bereut, aber ich bereue es auch nicht, im Shop nicht eine Mark ausgegeben zu haben. Bäm. Ist ja gerade auf dir draufgefallen. Wie eine heiße Kartoffel. Und das geht mir mega auf den Sender. Und jetzt bin ich gespannt, was ihr davon haltet. Ballert es mir in die Kommentare. Und wenn ihr wollt, lasst gerne noch eine Bewertung da. Das hilft mir natürlich ungemein und euch kostet es nur einen Klick. Danke und tschüss. Ja, kann ich auch vollziehen. Wie gesagt, ich bin ja jemand, der das Spiel nicht wirklich gespielt. Ich habe es nur so aus der Eferne alles mitbekommen. Voll für'n Arsch. Der Clown Fanatiker sagt im Chat, seine Hoffnung wäre, dass dieser Lootbox Track einfach als Glücksspiel verboten wird. Ist ja in immer mehr Ländern so. Würde fast alle Spiele besser machen, würde auch die Langzeitmotivation steigen, weil man einfach sich etwas ergrinden muss. Das Problem, was ich darin sehe, werden Lootboxen und sowas verboten werden. Also ich finde das erstmal gar keine schlechte Idee, solche extreme Glücksspiel-Mechaniken zu verbieten. Aber das wird nicht dazu führen, dass das verschwindet. Die werden einfach die Sachen geschickt um Schiffen. Habt ihr das mitbekommen? Haben wir das in Frankreich und CSGO mit dem Scanner? Da siehst du mal, wie es laufen kann. Also ich glaube, das war in Frankreich. Und ich versuche das mal so wiederzugeben, so gut ich das aus dem Kopf wiedergeben kann. In Frankreich haben sie verboten, dass du Lootboxen Zufallsinhalte, also dass du nicht weißt, was in der Lootbox drinne ist. Also sprich, dass es insofern halt zufällig ist, dass du halt nicht weißt, bevor du Geld ausgibst, was du bekommst. Also was haben sie gemacht bei CSGO in Frankreich? Du musstest dir einen Scanner kaufen und mit diesem Scanner konntest du quasi Lootboxen vorher scannen und du wusstest schon, was drinne ist, bevor du dafür Geld ausgibst. Die Sache ist nur die. Und warum es schlimmer ist als die ursprüngliche Variante, du kannst die Lootbox nicht verwerfen. Also du kannst nicht sagen, ich habe jetzt diese Box gescannt, der Inhalt gefällt mir nicht, ich mache die nächste Box. Das geht nicht. Du musst die Box öffnen, dass du weitermachen kannst. Also im Prinzip ist es eigentlich überhaupt kein Unterschied. Nur, dass sie sich jetzt rausreden können, also vom Gesetz her sagt, wir dürfen keine zufälligen Inhalte anbieten und wir bieten jetzt keine zufälligen Inhalte an, aber trotzdem kannst du die nicht mehr kaufen. Also eigentlich noch größerer Scam. Nur mit dem Zusatz, du musst einen Scanner kaufen. Na gut, den Scanner, warum es den Scanner überhaupt zu kaufen gibt ist, dass du dir keine neuen Accounts erstellst. Dass es sich nicht lohnt neue Accounts erstellen, weil du musst ja Geld ausgeben. Da war der richtige Stonksmann am Start. Das ist richtig gut eigentlich. Da war der Gaben Pöks persönlich wahrscheinlich am Start. Als ich dachte, aha, jetzt lasst mal die Franzosen noch ein bisschen mehr scammen. Also, dann sieht man, dass das reine Verbieten von Nutboxen überhaupt nichts bringt. Das ist schon high IQ, das ist massive IQ. What Battlefield 6 needs Wir haben schon so viele Battlefield Videos angeguckt. Ich habe noch ein paar andere Battlefield Videos, die wir gucken könnten. Passt ja gerade thematisch dazu. Wir können uns einmal das neue von Levelcap angucken, was er der Meinung ist, was Battlefield 6 braucht. Da bin ich sogar mal gespannt, was er sagt. Wir hätten noch ein Top Place oder wir scheißen erstmal auf Battlefield und gucken was anderes an. Wenn als nächstes Bad Company 3 kommen sollte, mache ich mir Sorgen, dass es die verkacken. MRP67 sehe ich genauso. Ich glaube erstens mittlerweile auch nicht mehr dran, dass Bad Company 3 kommt. Und ich denke auch, wenn sie es rausbringen sollten, dann ist es verkackt, dann werden sie es verkacken. Hat eigentlich Wodafone geantwortet mittlerweile. Schaut mal, da kommt der Chat. Der Chat schlägt auch auf Twitter zu. Ich sehe es schon. Ups. Ok. Ja willkommen im Club. Die Woder von Hackermans sind am Start. Aber wahrscheinlich kriege ich jetzt wieder als Antwort bitte nochmal den Router neu starten. Ok, also was haben wir als nächstes? Was können wir sonst noch so angucken? Windows 98 PC. Battlefield. Gucken wir vielleicht zum Schluss noch ein bisschen Battlefield. Was Festplatten Backup auf VHS? Was ist mit AOL passiert? Warum habe ich ein Akkuschrauber Video auf? Ich glaube ich weiß warum ich ein Akkuschrauber Video auf habe, weil ich den Vorgänger Akkuschrauber habe. Warte mal. Genau ich habe mir das Video gebookt, weil ich den Vorgänger habe, weil ich wissen wollte, ob es sich lohnt das abzukraden. Aber lohnt sich wahrscheinlich nicht denke ich mal. Den habe ich mir vor einer Weile mal gekauft. Das ist ja mein aktueller Akkuschrauber. Und jetzt gibt es ja anscheinend den da. Was ist eigentlich preislich der Unterschied? 115 Euro. Ok, das ist der ohne Bohrer. 135 kostet 157 Euro. Ja, also da würde ich mir wahrscheinlich jetzt den kaufen, wenn ich mir jetzt neu kaufe. Aber lohnt sich ja nicht. Warum sollte ich das jetzt nochmal neu kaufen? Mich interessiert ja mal was da rausgekommen ist jetzt. Niemals beim Akkuschrauber. Hä? Was meinste Churok? Twitch Zuschauer schreibt, ich verstehe nicht warum Wodafone so ein Dreck ist. Jeder der dort ist beschwert sich und läuft schon lange so. Anscheinend gibt es noch genug Geld. Der neue Akkuschrauber hat jetzt Lootboxen für Bits. Das wärs doch mal. Das wärs doch mal. Es ist ein Akkuschrauber, wenn der alte noch geht lohnt sich eigentlich nie ein Upgrade. Denke ich auch. Ich will mal gucken was rauskommt am Ende. Was er sagt. Ich kenne die Videos von ihm. Der erzählt erst mal eine halbe Stunde was. Das ist ziemlich uninteressant. Nur die erste Hälfte meistens. Ich will einfach nur mal die Tests sehen. Ok. Längenvergleich. Längenvergleich. Alter Akkuschrauber, neuer Akkuschrauber. Aha. Das ist wahrscheinlich der neue. Das ist der alte. Ne. Doch. Das ist der alte, das ist der neu. Aber das ist einer mit Bohrfunktion. Kann man nicht so wirklich. Wenn man das hier wegnimmt, dann ja. Größenunterschied ist nicht. Der wiegt die Dinge am Anfang immer. Zeige mal. Wiegt er die? Wiegt er die auch? Wiegen? Waage? Wo ist die Waage? Ok. Unterschied. Hat ein bisschen mehr Power. Dreht sich ein bisschen schneller. Ist ein bisschen kürzer. Ah hier. Ok. Unterschied. Also der wiegt ungefähr einen Kilo, den ich jetzt habe. Wir haben hier nur rund 900 Gramm. Ja, nur 900 Gramm. Das ist doch echt Wahnsinn. Jetzt schauen wir uns mal die etwas ältere Generation an. Hier zwar mit Schlagwerk, aber trotzdem. Ja, das merkt man ein bisschen, aber großartig. Na ja. Ok. Ich will die Tests. Ich will die Tests sehen. Tests. Beste. Excellent. Tests. Tests muss ich mir angucken. Vom Akkuschrauber. Hey. Xox. Xos. Sagt. Hab letztens den Vodafone-Support angerufen, weil mir über WLAN immer wieder Verbindungsabbrüche haben. Ins WLAN klappt. Über Kabel geht es auch. Nur WLAN ist kaputt. Fazit des Support-Menschen. Es kann nicht an der Fritzbox liegen, die wir von denen mieten. Es muss daran liegen, dass 2,4 und 5 Gigahertz WLAN dasselbe SSID haben. Das haben die mir auch erzählt. Das haben die mir auch erzählt. Genau das Gleiche haben die mir auch erzählt. Nur mit dem Unterschied. Nur mit dem Unterschied. Ich verwende das WLAN von der Connectbox gar nicht. Ich verwende weder das WLAN von der Connectbox noch von der Fritzbox. Bei mir ist eine Connectbox. Ich verwende das gar nicht von denen. Das ist so die random Bullshit-Antwort von denen. Kurz das Fazit. Was sagt er zum Akkuschrauber? Eiche? Oh, Eiche. Eiche. Und hier haben wir Fichte. Excellent Slow-Motion-Bohren. Ah, yes. Ich gucke sowas gern. Ich finde das entspannend zuzuschauen, wie Löcher in Holz gefräst werden. So, jetzt nehmen wir hier den 35er. Ah, jetzt der 35er. Excellent. So Bohrer habe ich überhaupt nicht. Scheiße, Scheiße, Scheiße, Scheiße. Aber für so einen kleinen 2-Volt-Akkuschrauber ist das schon nice. Jetzt geht es also ans Bohren. Zeig mal, wie gebohrt wird. Trotzdem möchte ich euch zeigen, wie er sich schlägt. Hier einmal in Puroton und einmal sogar in Kaltzahnstein. Was ist denn so eine Hauswand in der Regel? Ich habe keine Ahnung. Ich vermute mal auch, dass wir sowas hier haben in der Wand. Moin, Sebaro. Ah, yes. Okay, das heißt, ich könnte auch mal ein Loch damit in die Wand bohren. Excellent Slow-Motion-Bohrung. Das ganze hier ist ja ein Akkuschrauber und jetzt kommen wir auch endlich zum Thema. Ah, guck mal da, den Vera-Bithalter. Den habe ich auch. Da hier, das Teil. Excellent. Excellent Teil ist das, der Vera-Bithalter. Schrauben. Wir haben hier wie immer die übliche 20 cm. What the fuck? Die Schraube ist so groß wie sein Kopf. Ich glaube, ich habe noch nie so eine fette Schraube irgendwo reingeschraubt. Die üblichen Schrauben. Teilgewindeschraube und 20 cm Vollgewinde. Hätte ich nicht als Heimwerker eingeschätzt. Heimwerkern in Form von irgendwelchen Regalen bauen, da bin ich auch nicht so scharf drauf. Da mache ich, was gemacht werden muss. Aber für mein ganzes Heimautomatisierungsträuch ist es halt auch ab und zu mal erforderlich, dass man ein paar Sachen macht. Schrauben für ein 12V-Gerät. Excellent-Bithalter, kann ich nur empfehlen. Na, geht auch gut rein. Gibs ihm. Oh, es geht sogar wieder raus. Das heißt, der hat noch genug Power. Wenn das Ding so voll am Limit ist von der Leistung, dann kriegst du meistens die Schrauben nicht wieder rausgedreht. Aber da hat wohl ein bisschen Reserve. Oh, jetzt kommt die fette, jetzt kommt die fette. Ja, aber gerade so. Und ob die wieder rausgeht? Oh, nice. So, jetzt haben wir gesehen, wie er schraubt. Der schraubt ordentlich. Die ist immer noch ein bisschen heiß. Die 20cm-Schraube, Vollgewinde, hat er ohne Probleme in das Holz reingeschraubt. Ja, ich glaube, das würde meiner nicht schaffen. Ich glaube, das würde meiner nicht schaffen. Aber ganz ehrlich, ich schraube solche Schrauben auch nicht rein. Reicht schon. Kommt noch im Test? Okay, nice. Quanta Costa, 150 Euro. Der alte, den alten kriegst du für 115 gerade. Aber sag mal so, den alten kann ich wirklich empfehlen. Das hier ist der alte, genau, das ist der, den ich hab. Auch dieses, auch genau dieses Set hier mit diesem Standardzeug dabei. Ich glaube, es gibt zwei Akkus dabei. Den kann ich echt empfehlen. Wenn man ab und zu mal was bohren muss, aber hauptsächlich quasi braucht, um entweder irgendwo Löcher rein, also irgendwelche 3D-Drucker oder so irgendwie Löcher reinzumachen oder mal irgendwo eine Kamera an die Wand zu machen oder hauptsächlich Sachen irgendwie schraubt. Das Ding kann man echt empfehlen, das ist nicht schlecht. Das Ding ist wirklich nicht übel. Das, das, das kann man, kann man, kann man empfehlen. Aber gucken wir mal, wo er vorhin geantwortet hat. Ah, yes, nein. Hehehehe, ja, es kann schon sein. So, ähm, Xeroxino, neun Monate schon. Ja, anscheinend, aber dankeschön. Huge subscription. Dankeschön, nice. Gut, jetzt haben wir uns sogar nochmal ein Akkuschrauber-Video angeguckt. Excellent, excellent, excellent. Building a better Windows 98 PC. Leute, ich brauche ein bisschen, ein bisschen, ein bisschen, äh, Computer-Nostalgie-Zeug. Das müssen wir uns jetzt angucken. Windows 98 Rechner. Außerdem gucke ich Videos von ihm gern. Wahrscheinlich, weil er so Oldschool-Kram macht. Und wir spulen ein bisschen vor, 30 Minuten ist ganz schön hart. Das sieht, das sieht übelst kaputt aus, das Ding. Also übelst, übelst verstaubt. Ah, excellent, ja. Ah, jetzt kriege ich mir die Teile gezeigt, was reinkommt. Ein Bot, der checkt, ob da Vodaporn-Support geantwortet hat. Ah, das ist eine gute Idee. Oh, das ist richtig gut. Also wir machen ein Tool, das automatisch Vodaporn-Service anfindet, wenn er Streamlinks. Und eine Notification postet, wenn der Support antwortet. Und, was ganz wichtig ist, was wir auch noch brauchen, automatisch das Vodaporn-Shit-Emote aufmacht. Ganz exzellent, exquisit wichtig. 3,5. Habt ihr noch sowas? Gibt es noch irgendjemand von euch, der wirklich den Diskettenlaufwerk hat, was funktioniert? Ich glaube nämlich, dass die aktuellen Gehäuse dafür gar keinen Einschub mehr haben, oder? Hier, ok. Haben die dafür überhaupt noch einen Einschub? Ne, gibt nix mehr, keinen Einschub mehr. Habt ihr noch die Install-Disketten für Windows 98? Oh, Poggers. Ich hab noch ein Windows 98-Lizenz-Handbuch mit Sticker und Zeug drauf. Ein Standard-Black-Drive. Aber ich werde einen hier benutzen. Nein, das ist ein CD-ROM-Drive. Also, ich wollte einen DVD-ROM aus meiner Storage holen. Ich weiß, dass ich ein paar habe. Die Zeit, wo man so CD-Laufwerke hat, damals ging es darum, wer hatte das schnellste CD-Laufwerk. Da kamen die ersten an, so nach dem Motto, ich hab einen 20-fach, ich hab einen 24-fach, ich hab einen 32-fach, ich hab einen 48-fach, ich hab einen 52-fach, ich hab einen 72-fach CD-Laufwerk. Ich weiß gar nicht, was das schnellste war. 72, oder? Oder 52? 72? Ja, 72-fach. 360? Also, ich glaube, das Schnellste für die Normalsterblichen war 52-fach. Worauf bezieht sich die 72-Dana 72-mal schneller als einfach? Einfach ist das, womit du Audio-CDs abspielst. Was kann Blu-Ray? Keine Ahnung. Ich will das von innen sehen. Ah, ein Noctua-Lüfter. Das ist aber nicht 1998. 1998 hatten wir die billigsten China-Lüfter. Oder einen Zahl- oder, nee, später hatten wir einen Zahlmann-Lüfter. Das war ein Pubst-Kühler, hatte man damals, richtig. Ist das ein SD-Kartenleser, oder was soll das sein? Ihhh, was ist das für ein Ding? SD-Karten, IDE, SD-Kartenleser, what the fuck, was es alles gibt? Kompaktflash. Datech gibt es heute noch. Oder ist es was Neues? Als Netzteile noch oben im Gehäuse verbaut waren, ja. Ich wusste gar nicht, dass das Standard ist mittlerweile. Die meisten, zwei, drei Rechner hatten das alle unten verbaut, aber ich dachte, das ist nur in etwas teureren Gehäusen. Die meisten haben es noch oben. So was gibt es? Moment, es gibt einen SD-Karten und Mikro-USB zu SSI-Adapter? Meine Güte. Warum waren die früher oben? Ich glaube, es ist eher die Frage, warum hat man die runter gemacht? Ich glaube, die haben einfach angefangen mit Netzteil oben, bis dann irgendwann auch eine auf die Idee gekommen ist, lass sie unten reinbauen. Direkt mal eine bestellen, die Technik kommt, um zu bleiben. Auch gleich mal ordern. Sound-Karte? Oh, exzellent, ein Sound-Plaster. 64 Gold, okay, die hatten so, das ist eine ESA-Karte. Das ist noch Pre-PCI-Steckplätze. Waren die schon immer so gelb oder sind die jetzt einfach so gelb geworden mit der Zeit? Gold Edition, das könnte tatsächlich sein. Was ist das denn eigentlich für dicke grüne Kabelschläuche? Eigentlich eine richtig gute Idee für die damalige Zeit, weil damals hattest du ja keine modularen Netzteile und die Rechner, die waren alle zugehonken mit IDE und Power-Kabel. Man muss aber echt mal sagen, dadurch, dass die Noctur-Lüfter so hässlich aussehen, passen die Zimt-Kabelschläuche sehr gut an. Die sehen fast aus wie 1998, nur dass sie neu sind. Die sehen fast aus wie 1998, nur dass sie neu sind. Oh, yes, exzellent, exzellent Werbung. Doch noch Noctur-Lüfter gibt es mittlerweile auch in schwarz. Diese ollen Dinger. Okay, das ist ein halbwegs neues Gehäuse, aber es sieht wirklich aus wie ein Gehäuse von 1995. Nur eins muss man sagen, das Gehäuse sieht deutlich weniger scharfkantig aus wie 1995 Gehäuse. Die Gehäuse damals, du hast dich geschnitten an den Ecken, die waren wirklich ziemlich schlecht. Die Gehäuse damals waren absoluter Bullshit. Stimmt, du hast recht, und den Kram hier muss man nicht rausbrechen, sowohl da als auch da. Bei vielen Gehäusen damals war es so, dass teilweise so ein Schutzding hier bei den Slots dahinter war und hier vorne an den Laufwerkschächten, dass es dort nicht zum Rausschrauben war, sondern dass man ein Stück Metall rausbrechen musste. Und da hattest du das Problem, wenn du das einmal rausgebrochen hast und dann an der Stelle keine Karte mehr oder kein Laufwerk mehr haben wolltest, dann hast du da einfach ein Loch im Gehäuse gehabt. Und ich habe damals dann einfach halt einen Laufwerk reingeschoben, obwohl ich sie nicht gebraucht habe, weil halt, ne? Weil ein Loch im Gehäuse doof aussieht. Und die Gehäuse haben damals so unglaublich Staub angesammelt. Heute hast du ja bei einem guten Gehäuse, wie beispielsweise bei so einem Fractal Design Air, wo sind die jetzt? Air 5, 6, 7, hast du vorne ja einen ordentlichen Staubfilter und sowas drin. Und wenn du darauf achtest, dass mehr Luft aus dem Gehäuse rausgeht als reingeht, Schwachsinn, dass mehr Luft in das Gehäuse reingeht, wie rausgeht, dann kriegst du auch kaum Staub drinne. Also musst du einfach gucken, dass immer ein bisschen Überdruck quasi im Gehäuse ist. Die sind definitiv nicht von 98. Ich habe keine Signature Tan und Brown, aber egal, es ist gut, diese zu haben. Einfach hinten was zu kleben. Das funktioniert, klar funktioniert das, sonst nicht funktionieren. Leute, Überdruck, das ist jetzt vielleicht ein bisschen zu viel gesagt gewesen. Einfach gucken, dass mehr Lüfter Sachen reinziehen als rauspusten. Oder war es umgedreht? Dass mehr Lüfter rausziehen als reinpusten. Nee, nee, nee, wenn mehr Lüfter reinziehen, dann kommt Staub rein. Ach, scheiß drauf, was auch immer, wurscht. Er meinte mehr Lüfter rauspusten. Ach, was weiß ich. Scheiß drauf, das wichtigste ist, einen Staubfilter vorne dran zu haben am Gehäuse, dort wo die Lüfter sind, die reinziehen. Ich habe ohne Scheiß seit ich die Fractal Design Gehäuse habe, ich habe die letzten drei PCs nicht einmal sauber gemacht und die sind alle komplett rein innen drinne. Das funktioniert. Die Luftfilter sind echt gut, die Staubfilter. Very convenient, the case that I'm replacing does have a slide out back portion for the motherboard, but this is a little different, that's really awesome. Also so Dinge, so advanced Sachen hatten die Gehäuse damals nicht. Die Gehäuse damals musstest du erstmal eine Zerrung im Rücken holen, wenn du da den Rechner zusammengebaut hast. Put it together, I guess on here and then slide it on to place. I like this already. Let's go ahead and get everything out of this one, all the components that I want to keep anyway. Put them in here and get Windows 98 going with some games. Yeah, it's disassembly time. Ja, und die Gehäuse damals, da hat der Herz93 recht, die hast du teilweise richtige Probleme gehabt auseinander zu kriegen. Vor allem die Front vom PC, die Front vom Gehäuse, die du teilweise aufmachen musstest, wenn du neue Laufwerke einbaust. Das war ein Riesenakt manchmal. Welches Fractal Design hast du? Einen R4, einen R5 und einen R6 glaube? Oder was habe ich? Moment, ich sag's dir, was ich hab. FPS, Selbstbaurechner, ich hab doch hier... ... ... Ja, das hab ich gerade. Grad das R5. Davor hatte ich auch schon zweimal Fractal Design, weil beste. In schwarz, ja. In schwarz mit der Klappe vorne dran und einem Fenster nebendran. ... Oh, Zeitraffer, Zeitraffer steck so an. Was'n das? Was'n das, was da rausguckt? Ist das das Ende, das Ende von einem, was ist denn das? Das Ende von einem 5 Zoll des Kettenlaufwerk? ... Ja, ne, er hat Mundgeruch, bester Name. Würde ich auch so sehen, ja. Das ist das Ende von so einem 5 Zoll des Kettenlaufwerk. Via Chipsets, ne, das ist genauso wie es keine Nvidia Chipsets mehr gibt. Ja, diese unterschiedlich gefärbten IDE-Konnektoren, da kann ich mich auch noch dran erinnern. Wo es dann hieß, ja, hier musst du die Festplatte dran machen und hier machst du das CD-Laufwerk dran. Da musstest du die Sache auch nicht ordentlich jumpern, sondern es hat einfach funktioniert. So, die gute alte Parallelport ist auch noch am Start. Schöne Dip-Switches noch auf dem Mainboard. Vertakt einstellen. Es gab ja mal eine Zeit, da hat man seine CPU übertaktet, indem man so einen Switch auf dem Mainboard geswitcht hat. Und das Bios konnte man rausstopfen. Ja, stimmt, das gab es auch noch. Und da sind wir wieder. Eine leichte Kasse wieder. Naja, meistens lassen wir sie da rein, denn ich weiß nicht, was ich mit diesem machen werde. Irgendwas, irgendwann. Ja. Was? Das ist ein AGP, oder? Das ist ein AGP-Slot. Sehe ich das richtig? Also, was ist denn das da oben? Also, das ist ein AGP. Das ist PCI. Was ist denn das da oben? Ein umgedrehter PCI? Einen falsch rum halblängen PCI? Ist das für eine interne PCI-Karte, die man nicht rausführen will, oder was? Ich habe keine Ahnung, was das ist. Kein Plan. Der erste, was heute standard ist, glaube ich nicht. Ich glaube nicht, dass es ein PCI-Express ist. Es sieht aus wie ein PCI-Express, aber PCI-Express auf einem Board mit einem ESA-Anschluss, sowas gibt es nicht. Ein PCI-Express plus ein ESA-Port, das sind 20 Jahre dazwischen, das glaube ich nicht. Ich gebe dir aber recht, dass es aussieht wie PCI-Express. Aber das könnte ein PCI sein. Einfach einen kurzen PCI falsch rum, oder was auch immer. Exzellent, jetzt passt es. Was hat er denn für einen Schraubendreher? Was ist denn das? Ah, erkennt man nicht. Oh, eine Voodoo 3. Poggers. Wenn man sich überlegt, der ganze Shit ist heute einfach alles on Board, bis auf die Grafikkarte. Kein Wunder, dass die Boards heute alle nur noch so kurz sind hier. Der ganze Kram ist ja alles on Board. Aber ich weiß nicht, wie es euch da geht. Ich will das nicht wieder so haben. Ich finde das besser, wie es heute ist. Ich will das nie wieder so haben. Ich verspüre, wenn ich so was in einem Video sehe und so einen Rechner mit vielen Steckkarten drin sehe, ich spüre eine gewisse Begeisterung, innerlich, wenn ich so was sehe. Ich will das auf keinen Fall mehr so haben. Das ist deutlich angenehmer, wie das heute so ist. Nice, that is an awesome setup. We don't even have it installed in the case yet. Big Brain Einführung. Es passt alles. Das glaube ich ihm. Es ist eigentlich komplett sinnlos, sich so einen Rechner zu bauen, fällt mir gerade mal ein. Wozu? Aber es geht. PC-Speaker muss sein. PC-Speaker muss sein. Ohne PC-Speaker geht das gar nicht. Wobei PC-Speaker kann man schlecht da machen. So viel Platz in dem Gehäuse, das ist nicht normal für die damalige Zeit. Normalerweise waren die Gehäuse vollgestopft mit irgendwelchen Kabel noch. Let's get them installed. This is such a cool case. This is not sponsored. I really like this. Listen to this. Was gibt das? Gehäuse ASMR. So I think I'm going to put this here. The screw goes right here. Okay, well, I guess that's what this little contraption is for. Das war damals auch gang und gäbe, dass man die ganzen Cages rausschrauben musste. Und teilweise richtig ätzend, wenn du was ändern wolltest und erstmal alles andere abschöpseln musstest, dass du das Case rausschrauben kannst. Ach, wird schon halten. Das wird schon halten. Also ja, komm das hält schon ab. Excellent. Excellent Montage-Skills. Was ist das? Das Kettenlaufwerk? Guck mal, damals konntest du theoretisch, wenn du wolltest, sogar noch selbst Teile auslöten. Ich hab keinerlei persönlichen Bezug so richtig zu 5 Zoll Kettenlaufwerken. Das war ein ganz kurzes, ganz kurz so vor meiner Zeit. Stream laggt, Leute. Stream laggt. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Yes. Excellent. Okay. So, jetzt sollte es wieder funktionieren, ne? Das ist so lächerlich in Deutschland. Ey, das ist der Wahnsinn. Ne, das hat sich jetzt wieder eingekriegt. Die Chat-Kommentare sind live, wenn ihr refresht wieder. Das passt. Excellent. Also, wie gesagt, ich werde jetzt jeden Ausfall an Vodafone twitteren. Oh, oh, oh, Leute. Monkeys. Es hat geleckt. Ich hab's gesehen. Die plotten mich irgendwann, dann kriegen die auch irgendwann kein Geld mehr. Okay, gucken wir weiter. Kündigung schon raus, ne? Ich muss ja auch erstmal, dass ich kündigen kann, also, dass ich schneller kündigen kann, muss ich auch erstmal eine Weile zeigen, dass es Probleme gibt. Wahrscheinlich muss ich doch irgendwann auch offiziell dazu auffordern, Abhilfe zu schaffen, was auch immer. Coupa-Big-Plan-Idee. Warum hat er so viele Diskettenlaufwerke? Ach ne, das ist das Compact-Flash-Ding. Also 5 Zoll Diskettenlaufwerk, 3,5 Zoll Diskettenlaufwerk und eine Compact-Flash. Was'n Ding hier? Oh, RIP. Moment, wo will der damit überhaupt hin? Ah, SCSI-Card. Ja, da muss es da unten irgendwie falsche rum einbauen. Oder aber, was man damals auch ganz gerne gemacht hat, wenn die Kabel einfach nur so einen Zentimeter zu kurz waren, man hat die halt so weit gebogen und gezogen, dass sie teilweise so scharfkantige Ecken drin hatten, dass sie theoretisch fast schon nicht mal funktionieren konnten, aber es ging trotzdem irgendwie. Hast du jetzt eigentlich da endlich deine SSD geändert? Ja, natürlich, daran wird's liegen. Na klar hab ich die geändert. Felix sagt, muss mich bei mir zwischen 1 Gigabit Vodafone und 25 MB Telekom entscheiden. Ja, ist bei mir ähnlich, nur, dass ich theoretisch den Luxus habe, 250 MB VDSL zu bekommen. Also das wäre dann gar kein so großer Verlust. Kind of annoying having this here because I can't see what I'm doing. For now I guess I'm just gonna take this out and just dangle it over there a little bit closer. Ironic. I got this thing so I wouldn't have to dangle anything and here I am gonna be dangling things again, dang it. Yeah, whatever. Was? Was gibt das, wenn's fertig? Excellent. Kabelogik. Hängt ein bisschen nebendran. Oh, ein Pentium 3. Das war aber für die Zeit schon sehr advanced. Und dieser Sound von den Kettenlaufwerken, wenn das Ding startet. Und immer nicht zu vergessen, und das machen die Computer teilweise heute noch, dieser Post-Beep. Erinnern euch euch noch manche an den Post-Beep, dass das Ding gebootet hat? Dann hat's gemacht, am Diskettenlaufwerk, und dann hat's irgendwann gemacht, und dann war fertig. Dann hat's gebootet. Ja, hier, da war der Post-Beep. Ja, hier, da war der Post-Beep. Ich guck mir so, ich weiß nicht, ob das wirklich aus Nostalgiegründen ist, weil es ist jetzt nicht so, dass ich sagen würde, ich will das wieder so haben. Also ich find das mit der Technik, wie das heute ist, viel, viel besser, als es damals gewesen ist. Also auch, dass alles onboard ist und dass die Gehäuse ordentlich sind und alles. Aber so gewisse, es freut mich, wenn ich ein altes Mainboard mit fünf Einsteckkarten sehe. Oder auch wenn ich ein 3,5 Zolles Kettenlaufwerk sehe. Irgendwie freut mich das so innerlich. Ich kann nicht beschreiben, woran das liegt, aber irgendwie gefällt mir das. Und ich will es auf keinen Fall wieder so haben. Ah, das ist so eine typisch schöne Windows UI, wo jeder sofort versteht, was das ist. Sehe ich das richtig, dass der Windows von der SD-Karte, von der Flash-Karte bootet, anstatt seine Festplatte einzubauen? Ist vielleicht gar nicht schlecht, ist bestimmt besser als eine Festplatte. So eine Pegel-Spiele, dafür brauch ich mir noch das 98. Insomniac Dude, gebe ich dir recht, PC-Welt ist teilweise echt, echt cringe. Und allein schon, dass das Ding Höllenmaschine heißt, ist auch ziemlich cringe. Stimmt, damals hat es noch Interrupt. Stimmt, damals hat es noch Interrupt, Adressenkonflikte und sowas mit Einschubkarten. Und soll ich einfach mal erzählen, die Linux-Community damals, weil ich flame ja da immer ganz gerne immer ein bisschen auch dagegen. Ihr wisst, dass ich mein Geld mit Linux verdiene und auch ansonsten viel unter Linux mache. Das ist nicht besonder, dass wir hier extra immer einen Linux-Fall im Laufen haben mit Zeug. Aber das ist wieder so ein typisches Beispiel gewesen, dass manchmal Sachen unsinnig lange dauern, gerade was Linux angeht und bei vielen Open-Source-Projekten. Als die angefangen haben bei, äh, unter Mac und unter Windows zu sagen, ok, manuelles Zuweisen von Interrupts und Adressen und so ist für'n Arsch, kannst du eigentlich keinem zumuten. Und langsam aber sicher angefangen haben, wo es da ein bisschen mehr Richtung USB ging, bisschen mehr Richtung Plug and Play, automatische Adressenzuweisungen und sowas ging, haben die unter Linux damals gesagt, den Scheiß braucht keiner. Man muss, man sollte, also wer Adresszuweisungen, IRQ-Geschichten nicht versteht, sollte keinen Rechner verwenden. Das wollen wir nicht in Linux haben. Das haben die ernsthaft damals erzählt, ja. Wo man halt auch wieder sieht, dass da sehr viele Pepega-Leute dabei sind. Die wollten das wirklich manuell konfigurieren müssen. Nicht die Option haben, es manuell zu konfigurieren, die wollten, dass man es manuell konfigurieren muss, weil nur das der einzig richtige Weg ist. Und so Sachen hast du heute noch, wo sie Zeug nicht gebacken bekommen. Oh, ein halbes Gigabyte RAM. Ein halbes Gigabyte RAM, das ist ja schon massive. Ah, gut, kann man mitleben. Joystick-Port, das habe ich ja schon wieder komplett verdrängt, dass damals Soundkarten-Joystick-Ports dran haben. Ich habe bis heute nicht verstanden, warum ausgerechnet die Soundkarten-IO-Ports noch dran hatten für Joystick. Michael GZ. Und, braucht kein Midi. Midi, Alter. Midi. Mehr Ahi als Midi. Oh, exzellent. Das wäre besser hier. Ich höre keinen Unterschied. Ich höre keinen Unterschied. Exzellent. Okay, ich glaube das Interessante von den Videos vorbei. Unreal Tournament. Ich will Unreal Tournament spielen. Ich glaube, dass es leht. Wenn es leht, dann stürzt es ab, oder wie ging das nochmal? Das waren noch Zeug. Das waren Memes, bevor es Memes hieß. Nein, ich kenne ihn nicht. Exzellent Video. Ich gucke mir gerne so ein bisschen Nostalgiestells an. So, das ist mein aktueller Rechner. Den wollte ich mir sicherlich angucken. Was haben wir sonst noch zu tun? IoT, Backdoor, Kamera. Best Burger I've ever made. Leute, es ist bald Zeit fürs Mittagessen. Es ist 13.10 Uhr. Wir können uns entweder das Köpfen von der neuen Intel CPU angucken, oder wir gucken uns den Burger an. Hekules Beats heißt er heute. Ja, ja, ja, ja. Wir gucken uns aber kein 26 Minuten Video an. Ich will einfach nur mal sehen, wie er die CPU köpft. Ah, exzellent. Hier geht es los. Ich will sehen, wie die CPU geköpft wird. Ah, jetzt da. Ah, hier zeigt das. Ich habe ja schon ein paar Mal erzählt, wie sehr ich geschwitzt habe bei dem 8700K. Alter, mit der Rasierklinge. Alter, das tut mir weh, wenn ich das sehe. Hilfe! Gleich ist die CPU rippt, ey. Morka! Es! Ach nee, das ist der Heatspreader. Das ist okay, da kann man rumkratzen. Okay, wir kriegen gar nicht gezeigt, wie die CPU geköpft wird. Das ist GBated Video. Okay, dann ist ja langweilig. Okay, der beste Burger. Okay, der beste Burger. Alter, 22 Minuten will der Burger machen. Was ist da los? 2.0. Also ich dich. Kurze Frage, was bringt CPU Köpfen? Naja, wenn man das so wie Intel macht und Wärmeleitpaste zwischen Heatspreader und CPU macht und die nicht verlötet miteinander, dann hat man ziemlich schlechte Wärmeableitung von der CPU zum Heatspreader. Also Heatspreader ist der Deckel von der CPU. Also wenn du so ein CPU in der Hand hältst, das Metall, was oben drauf ist, ist der Heatspreader, ist der Deckel von diesem ganzen Case. Und Intel hat da zwischen Wärmeleitpaste geschmiert, zwischen innen der CPU an sich und dem Deckel. Und normalerweise wird das verlötet und dann ist die Wärmeübertragung wunderbar. Und wenn du das köpfst, heißt im Endeffekt, du machst den Deckel ab, machst die Wärmeleitpaste raus, die dazwischen ist und machst irgendeine Flüssigmetallmischung oder so dazwischen, die besser die Wärme leitet. Und das bringt extrem, extrem wirklich richtig viel. Also ich hab mein 8700K geköpft, weil ich ihn übertacken wollte und wir haben es im Stream gemacht, müsste man sich raussuchen. Und der ist jetzt glaube ich 20 Grad 15 oder 20 Grad kühler, das bringt wirklich massiv viel. 20 Grad. Ja, Zeig, bester Burger. Exzellent. Hä? Mach hinne. Ich will den Burger sehen. Was ist denn was ist mit den Lose? Wo gehts denn los? Wo gehts hier los mit Burger? Warte mal kurz. So. Ich geh mir jetzt auch was zu essen holen. Ich bin gleich wieder da. So. Ich bin wieder am Start. Ich esse jetzt was nebenbei. Was macht der denn da? Gewürzgurken schnüppeln. Also Leute, ich hab jetzt ein paar Nudeln mit Lachs drinne. Easy. Ich futter mal kurz meine Nudeln. Ah, der schmeckt richtig gut. Aber der ist ganz schön langsam oder? Ich will doch keine halbe Stunde gucken wie er seine Soße macht. Ich will den Burger sehen. Ich will den Burger sehen. Jetzt macht er das Hackfleisch noch selbst oder was? Der macht jetzt sogar das Hackfleisch selbst. Wir gucken gleich Barbecue Pit Boys noch ne Runde hinten ran. Oh, das ist nichts für Veganer heute. Ich will den Burger sehen. Wo ist der Burger? Jetzt, jetzt wird gebrutzelt. Exzellent. Da ist ein Stück Finger mit drin. Gorgeous. Okay, der macht das schon mal richtig. Eins haben wir ja bei den Barbecue Pit Boys gelernt. Man macht alles mit seinem Messer. Also Löffel oder sonst was ist verpönt. Gabel, Löffel, man muss alles mit dem Messer machen. Mit der Machete, stimmt. Die Juicers. Also für die Barbecue Pit Boys wäre das jetzt ein bisschen wenig Fleisch. Da muss der Burger mindestens so dick sein wie das Brötchen hier unten. Das wäre für die voll fast schon vegan. Okay, okay, geht. Wir müssen noch ne Runde das Original gucken. Tequila Burger. Meinst du, dass durch die neuen Konsolen 4K, 120, 144 Hertzmonitore erschwinglicher werden? Die sind doch schon, also 4K 144. Nee, ich glaube nicht, dass das in nächster Zeit Standard wird. Nachdem ich nicht so der Alkoholtrinker bin, ich habe gar kein Favorite Tequila. Zumindest wenn ich es machen würde, würde ich definitiv keinen Lidl Schnaps nehmen, weil das ist bei allem abartig. Also wer mal probiert hat den Unterschied zwischen einem ordentlichen Whisky und einem Lidl Whisky, da sind Welten dazwischen. Der Lidl Whisky schmeckt schon, nicht nach Chemie, aber schmeckt schon fast, wie soll man das beschreiben? So, als möchte man es gar nicht schmecken. Und wenn man irgendwie was halbwegs ordentliches hat, dann schmeckt das relativ süß und gut eigentlich. Oh, es gibt das was fertig ist. Oh, das ist doch totaler Matsch danach. Das sind überhaupt keine eingelegten Jules. Moment, jetzt habe ich nicht zugeguckt. Warum hat er seine Hand auf dem Fleisch liegen? Einfach nur so? Corona. Erstmal anstecken alles. Da muss alles mit dem Küchenbeil machen. So gehört sich das. Moment, was ist das? Fett? Nee. Frischkäse? Ich habe jetzt nicht zugehört. Was ist das gewesen? Cream Cheese. Ah, so etwas Frischkäse. Die Sounds, die er immer dabei macht. Es muss klatschen. Erstmal schön rein. Die Musik im Hintergrund. Denk dran. Indirect, Opposite to Hot Coal. Was ist das für eine änglische Pumpe, Alter? Mal gucken, was am Ende rauskommt. Der macht alles mit seinem Beil. Na klar sind das Amis. Mehr Ami kann man nicht sein wie der Channel. Das ist Kokona pur. Sie muss liegt dabei. Was? Ich habe nicht zugehört. Ich habe gegessen. Er hat einen Löffel genommen? Ernsthaft? Also Löffel ist nicht erlaubt. Dieses eingelegte Chipszeug ist so eklig. Ich habe gedacht, die Dinger werden noch mal frittiert oder irgendwas. Aber die bleiben so lapperig auf dem Burger drauf. Das ist nichts für mich. Die meisten Sachen finde ich ja geil, würde ich auch mal gerne machen. Aber das glaube ich nichts für mich. Ich würde das Ding sofort futtern ohne die Chips. Nächstes. Was haben wir sonst noch? Ich brauche jetzt irgendwas. Ich versuche eigentlich schon mal was zu essen. Was ist das? Was ist das? Mayonnaise? Ohne hat man ein richtiges Messer. Warum macht er das nicht mit seiner Machete? Ich habe es gesehen. Und bei meinem Glück bin ich derjenige, der das Ding mit Schale kriegt. Ich habe es gesehen. Und bei meinem Glück bin ich derjenige, der das Ding mit Schale kriegt. Ich habe es gesehen. Und bei meinem Glück bin ich derjenige, der das Ding mit Schale kriegt. Ich habe es gesehen. Und bei meinem Glück bin ich derjenige, der das Ding mit Schale kriegt. Brotzel, Brotzel, Brotzel. Ich finde, da ist ein bisschen wenig Fett. Da müsste noch ein bisschen mehr Fett hinkommen. Ja, so muss man das machen. Schön mit der Machete das Brotspielen. Es sieht wirklich ein bisschen aus wie KFC. Wir könnten es viel schneller machen, aber wir mögen es so machen. Schau dir das an. Wir machen das. Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst. Was ist das? Schmeckt wirklich gut. Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst. Ach nee, Moment, ich muss ja heute gucken. Das gucken wir jetzt nicht. Die denken, wir scheißen da drauf. Meinst du, der Support ist 24? Wir können das ja mal kurz überprüfen. Ja, vor 43 Minuten. Die sind am Start. Die haben wahrscheinlich keinen Bock mehr auf meine Gespamme, aber ich werde die jeden Tag voll spammen. Und umso mehr Leute mitmachen, das ganze hier noch zu liken, retweeten und vor allem noch sinnloses Zeugs drauf zu posten. Umso besser. Umso besser. Dann kriegen die das nämlich mit, dass das auch viele Leute mitkriegen, dass das scheiße läuft bei ihnen. Das letzte, was sie geschrieben haben, ist, ich soll das Modem neu starten. War wieder. Ich will nicht wissen, wie oft ich den letzten Tag über ein Modem neu gestartet habe. Ach Leute, ich glaube wir machen jetzt Schluss. Wie wäre es mit einem Python-Bot mit Twitter, Api? Ja, sowas in der Richtung. Sowas habe ich mir schon überlegt. Ich glaube wir machen jetzt Schluss, Leute. Ich muss nämlich mal übelst dringend aufs Klo und ich muss dann auch mein Essen fertig essen. Das kriege ich gerade irgendwie nicht im Stream gescheit hin, außer wir gucken noch eine halbe Stunde Essensvideos. Haben sie das Gerät schon mal neu gestartet? Oh ja, das kommt ja jedes Mal. Wir sehen uns beim nächsten Stream, Leute. Fragen sind nicht verloren. Also falls ich heute irgendwas nicht beantwortet habe, ist ja alles hier in meinem Stream-Midlock-Tool dabei. Wir sehen uns beim nächsten Stream, Leute. Macht's gut, bis dann.", "segments": [{"id": 1, "start": 0.0, "end": 5.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 2, "start": 30.0, "end": 35.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 3, "start": 60.0, "end": 65.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 4, "start": 90.0, "end": 95.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 5, "start": 120.0, "end": 125.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 6, "start": 150.0, "end": 155.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 7, "start": 180.0, "end": 185.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 8, "start": 210.0, "end": 215.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 9, "start": 215.0, "end": 242.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 10, "start": 245.0, "end": 250.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 11, "start": 275.0, "end": 280.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 12, "start": 305.0, "end": 310.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 13, "start": 335.0, "end": 340.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 14, "start": 365.0, "end": 370.0, "text": "So Leute, ich bin am Start. Und was hab ich da gerade im Chat gelesen?"}, {"id": 15, "start": 370.0, "end": 375.0, "text": "Der... ah, ich hab grad keinen Chat auf hier, bitte."}, {"id": 16, "start": 375.0, "end": 380.0, "text": "Der 16 Sterne Mario 64 Rekord wurde gerade geknackt."}, {"id": 17, "start": 380.0, "end": 385.0, "text": "Weiß jemand wo? Das würde ich mir nämlich gleich mal gerne angucken."}, {"id": 18, "start": 385.0, "end": 390.0, "text": "Gucken wir mal."}, {"id": 19, "start": 390.0, "end": 395.0, "text": "Speedruns."}, {"id": 20, "start": 404.0, "end": 409.0, "text": "Zehner, dass es in Asiaten war. Ich glaube, ganz wenige Asiaten sind da."}, {"id": 21, "start": 409.0, "end": 414.0, "text": "Wobei, ne, jedoch sind Japaner ganz schön viel am Start."}, {"id": 22, "start": 414.0, "end": 419.0, "text": "Aber insgesamt ist es bei den Speedruns gar nicht so verbreitet, wie man denkt."}, {"id": 23, "start": 419.0, "end": 424.0, "text": "16 Sterne. Ah doch, okay."}, {"id": 24, "start": 424.0, "end": 429.0, "text": "Das sind Japaner. Ich hab nix gesagt. Ne, vor 8 Tagen kann ich sein."}, {"id": 25, "start": 429.0, "end": 433.0, "text": "Nicht der aktuelle. Wer hat das eben geschrieben?"}, {"id": 26, "start": 433.0, "end": 438.0, "text": "Ich hab's nur auf dem Tablet gesehen. Ich muss noch mal schnell aufs Klo, bevor ich im Stream anfange."}, {"id": 27, "start": 438.0, "end": 443.0, "text": "Und hatte nur das Tablet dabei."}, {"id": 28, "start": 443.0, "end": 447.0, "text": "Ich weiß jetzt nicht, wer's geschrieben hat. Gucken wir mal."}, {"id": 29, "start": 447.0, "end": 452.0, "text": "64, 16 Sterne, WR. Twitter ist da am besten für News."}, {"id": 30, "start": 452.0, "end": 457.0, "text": "Twitter. Twitter kann man da immer ganz gut durchsuchen."}, {"id": 31, "start": 470.0, "end": 475.0, "text": "Save einfach nur in Buckle, Puddle."}, {"id": 32, "start": 475.0, "end": 480.0, "text": "Äh."}, {"id": 33, "start": 480.0, "end": 485.0, "text": "Ja, wo denn?"}, {"id": 34, "start": 485.0, "end": 490.0, "text": "Ja, gut. Also, dann weiß ich auch nicht. Also, ich weiß nicht, wer das eben geschrieben hat, aber..."}, {"id": 35, "start": 490.0, "end": 495.0, "text": "Ich finde irgendwie..."}, {"id": 36, "start": 495.0, "end": 500.0, "text": "Ah, hier."}, {"id": 37, "start": 500.0, "end": 505.0, "text": "Ah, hier. WR."}, {"id": 38, "start": 505.0, "end": 510.0, "text": "Sub, 15 Minutes, 16 Sterne. Wo denn?"}, {"id": 39, "start": 510.0, "end": 515.0, "text": "Leute, lasst mich auch mal gucken."}, {"id": 40, "start": 515.0, "end": 520.0, "text": "Okay, Leute. Wir müssen jetzt..."}, {"id": 41, "start": 520.0, "end": 525.0, "text": "Twitch-Detektiv."}, {"id": 42, "start": 525.0, "end": 530.0, "text": "StonePanana hat's geschrieben. Ja, vielleicht weiß er auch noch, wer das hat."}, {"id": 43, "start": 530.0, "end": 535.0, "text": "Twitch-Detektiv."}, {"id": 44, "start": 535.0, "end": 540.0, "text": "Ne, ne, ne. Kategorie."}, {"id": 45, "start": 540.0, "end": 545.0, "text": "Nein, nicht lie. Mein Gott, warum ist das Mario für uns hier?"}, {"id": 46, "start": 545.0, "end": 550.0, "text": "Er?"}, {"id": 47, "start": 550.0, "end": 555.0, "text": "Ja."}, {"id": 48, "start": 555.0, "end": 560.0, "text": "News."}, {"id": 49, "start": 560.0, "end": 565.0, "text": "Weiß nicht."}, {"id": 50, "start": 565.0, "end": 570.0, "text": "Wenn so viel..."}, {"id": 51, "start": 570.0, "end": 575.0, "text": "Ey, oder?"}, {"id": 52, "start": 575.0, "end": 580.0, "text": "Nee, das ist irgendwas."}, {"id": 53, "start": 580.0, "end": 585.0, "text": "Klips. Klips ist eine gute Idee. Klips ist eine gute Idee."}, {"id": 54, "start": 585.0, "end": 590.0, "text": "Was zum..."}, {"id": 55, "start": 590.0, "end": 595.0, "text": "Warum ist das top viewed, wo irgendwer da Müsli futtert? Pogu, hier."}, {"id": 56, "start": 595.0, "end": 600.0, "text": "Zwei Stunden."}, {"id": 57, "start": 600.0, "end": 605.0, "text": "Was? First Sub?"}, {"id": 58, "start": 605.0, "end": 610.0, "text": "Under 15 Minutes? Da kann es ja das hier nicht sein, oder?"}, {"id": 59, "start": 610.0, "end": 615.0, "text": "What the fuck? Doch, das ist das."}, {"id": 60, "start": 615.0, "end": 620.0, "text": "Okay, das ist es wahrscheinlich."}, {"id": 61, "start": 620.0, "end": 625.0, "text": "Okay, das ist es wahrscheinlich."}, {"id": 62, "start": 625.0, "end": 630.0, "text": "Also, was die hier schreiben ist natürlich kompletter Blödsinn Sub 15."}, {"id": 63, "start": 630.0, "end": 635.0, "text": "Sub 20."}, {"id": 64, "start": 635.0, "end": 640.0, "text": "Okay, gucken wir mal. Wo geht's los?"}, {"id": 65, "start": 640.0, "end": 645.0, "text": "Ah, guck mal, haben wir noch gut getroffen. Das geht ja nicht lang. Das geht halt plus 20 Minuten."}, {"id": 66, "start": 645.0, "end": 650.0, "text": "Und, wat?"}, {"id": 67, "start": 650.0, "end": 655.0, "text": "Ah, ich hab mich verklickt. Das ist irgendein Run-Versuch davor."}, {"id": 68, "start": 655.0, "end": 660.0, "text": "Okay, also wir sind hier bei 5.46."}, {"id": 69, "start": 660.0, "end": 665.0, "text": "Ach, die In-Game-Time. Ah, okay, das kann natürlich sein."}, {"id": 70, "start": 665.0, "end": 670.0, "text": "Also, 5.46."}, {"id": 71, "start": 670.0, "end": 675.0, "text": "Und dann gehen wir mal 20 Minuten zurück. Das ist dann 5.26."}, {"id": 72, "start": 675.0, "end": 680.0, "text": "So, hier so. Ah, hier geht's los."}, {"id": 73, "start": 680.0, "end": 685.0, "text": "Hier geht's los."}, {"id": 74, "start": 685.0, "end": 690.0, "text": "I was here. Okay, das müssen wir uns gleich mal angucken."}, {"id": 75, "start": 690.0, "end": 695.0, "text": "Das müssen wir uns gleich mal angucken."}, {"id": 76, "start": 695.0, "end": 700.0, "text": "20 Minuten, eine Runde Speed. Mal gucken, es steht noch gar nicht drinnen."}, {"id": 77, "start": 700.0, "end": 705.0, "text": "Oder ist es Virtual Console vielleicht?"}, {"id": 78, "start": 712.0, "end": 717.0, "text": "Ne."}, {"id": 79, "start": 717.0, "end": 722.0, "text": "Ne, ne, ne, ne."}, {"id": 80, "start": 722.0, "end": 727.0, "text": "Ah, dass es Zero Star und One Star gibt, das ist halt auch geklitscht ohne Ende."}, {"id": 81, "start": 727.0, "end": 732.0, "text": "Stimmt, die müssen genau, die müssen das ja noch überprüfen, ob das auch wirklich legit ist und alles."}, {"id": 82, "start": 732.0, "end": 737.0, "text": "Ja, stimmt, stimmt, stimmt. So Leute, ich muss meine VM noch anmachen, fällt mir gerade ein."}, {"id": 83, "start": 742.0, "end": 747.0, "text": "Damit ich die ganzen Questions nicht verpasse."}, {"id": 84, "start": 747.0, "end": 758.0, "text": "Hätte ich vorher schon machen müssen."}, {"id": 85, "start": 758.0, "end": 763.0, "text": "So."}, {"id": 86, "start": 763.0, "end": 768.0, "text": "Hier aus, an, ups."}, {"id": 87, "start": 768.0, "end": 773.0, "text": "So, und jetzt müsst ihr hier mein Pepega Board am Start haben."}, {"id": 88, "start": 773.0, "end": 777.0, "text": "Auf."}, {"id": 89, "start": 777.0, "end": 789.0, "text": "Übrigens, wisst ihr was mir Vodafone geschrieben hat gestern?"}, {"id": 90, "start": 789.0, "end": 792.0, "text": "Wisst ihr was mir Vodafone gestern geschrieben hat? Muss ich das mal vorlesen."}, {"id": 91, "start": 792.0, "end": 797.0, "text": "Ich hatte Vodafone ja das hier geschrieben."}, {"id": 92, "start": 797.0, "end": 800.0, "text": "Ich hatte Vodafone ja das hier geschrieben."}, {"id": 93, "start": 800.0, "end": 805.0, "text": "Wir haben gesehen, dass das ganze schon behoben ist, halt gestern 13 oder vorgestern, achten hatte ich das Ding geschrieben."}, {"id": 94, "start": 805.0, "end": 811.0, "text": "Dass dafür, dass das 1330 schon behoben ist läuft es aber wirklich gut direkt, 45 Minuten Stream wieder abgebrochen."}, {"id": 95, "start": 811.0, "end": 816.0, "text": "Aktuell läuft es aber bloß mit 2 MBit Upload. Wie sieht es eigentlich aktuell aus? Aktuell geht es, oder?"}, {"id": 96, "start": 823.0, "end": 826.0, "text": "Ja, das ist ja meistens auch nur abends."}, {"id": 97, "start": 826.0, "end": 833.76, "text": "Zumindest hat Vodafone drauf geantwortet. Ich lese euch das mal vor, weil es wieder so eine typische Vodafone-Antwort ist."}, {"id": 98, "start": 841.0, "end": 844.44, "text": "Genau, ich soll Bescheid sagen, wenn das Problem aktuell noch besteht."}, {"id": 99, "start": 845.02, "end": 850.22, "text": "War das erste, was sie geschrieben haben, was ja schon mal total merkwürdig ist, da ich ja hier gesagt habe,"}, {"id": 100, "start": 851.24, "end": 855.16, "text": "nach 45 Minuten abgebrochen, aktuell läuft's wieder, aber nur mit 2M mit Upload."}, {"id": 101, "start": 855.16, "end": 860.64, "text": "Also, das ist ja eindeutig, ich habe schon oft das geschrieben, eindeutig kein Problem, was 24-7 da ist,"}, {"id": 102, "start": 860.64, "end": 863.64, "text": "was aber alle 1-2 Stunden mal vorkommt."}, {"id": 103, "start": 865.32, "end": 869.3, "text": "Und danach, danach kam die beste, danach kam die beste Antwort."}, {"id": 104, "start": 869.3, "end": 872.94, "text": "Bitte versuche als erstes einen Neustart des Routers."}, {"id": 105, "start": 877.16, "end": 879.16, "text": "Immer der gleiche Scheiß."}, {"id": 106, "start": 879.16, "end": 881.16, "text": "Das ist..."}, {"id": 107, "start": 884.36, "end": 886.36, "text": "Immer der gleiche Scheiß, Alter."}, {"id": 108, "start": 888.24, "end": 890.24, "text": "Nee, ey, fucks..."}, {"id": 109, "start": 890.84, "end": 895.16, "text": "Die können ja auch nichts machen, ich mein, was soll, was soll der Support, was soll der Support machen?"}, {"id": 110, "start": 901.76, "end": 903.76, "text": "Was, was, was, mein, was soll... WTF?"}, {"id": 111, "start": 903.76, "end": 913.76, "text": "Was soll der Supporter ja auch machen, ne? Also, ich mein, die können ja schlecht ihre Anbindung mal nebenbei einfach ausbauen, so, so, so,"}, {"id": 112, "start": 913.76, "end": 924.76, "text": "Hallo, Dezix, wir brauchen noch 5 Stecker mehr, weil es wahrscheinlich nicht reicht, aber das wird, das wird ja wohl kaum in 2 Minuten von irgendeinem Support-Mitarbeiter funktionieren,"}, {"id": 113, "start": 924.76, "end": 939.76, "text": "also kostet das hier auch ordentlich Kohle, deswegen schreiben die auch so einen Blödsinn. Full Speed Gamecube V, Dolphin Emulator, iPad, Bro, Bro, nicht Pro, Bro, iPad, Bro, Alter."}, {"id": 114, "start": 940.76, "end": 944.76, "text": "Der Eichler abonniert, 9 Monate, huge."}, {"id": 115, "start": 944.76, "end": 951.76, "text": "Der Eichler, bist du da sicher, dass das so ist, ja? Gibt es dazu offizielle Studien?"}, {"id": 116, "start": 956.76, "end": 963.76, "text": "Ich glaub, der Eichler, ich glaub das erst, wenn es da ein Video von MyLab dazu gibt. Sonst glaub ich das nicht."}, {"id": 117, "start": 963.76, "end": 977.76, "text": "Oh, ist ganz schön laut heute, warum ist es so laut? Ah, weil es 40 ist. Deswegen stimmt meine Audio-Geschichte hier auch nicht."}, {"id": 118, "start": 977.76, "end": 989.76, "text": "Mal gucken, ob Teams wieder den Sound lauter gestellt hat, das macht Teams ja gerne."}, {"id": 119, "start": 993.76, "end": 1002.76, "text": "Ihr hört mich schon, oder? Ah, ok. Wo stellt man eigentlich, jetzt Leute mal Windows 10 Frage an die Experten."}, {"id": 120, "start": 1002.76, "end": 1016.76, "text": "Wo stelle ich die Lautstärke von meinem Mikrofon ein? Ich weiß, dass es über das alte Menü geht. Wo mache ich das offiziell in Windows 10?"}, {"id": 121, "start": 1016.76, "end": 1037.76, "text": "Wie geht das? Hier nicht. Hier drüber? Drüber auch nicht. Wie geht das? So lächerlich, warum sieht man das nicht auf den ersten Blick?"}, {"id": 122, "start": 1046.76, "end": 1064.76, "text": "Max ganz unten? Was, wo ganz unten? Hier. Der Device Properties ist wahrscheinlich das alte Menü. Oh, ne, das ist das neue Menü. Ah, excellent."}, {"id": 123, "start": 1064.76, "end": 1081.76, "text": "Was passiert eigentlich bei Test? Test, Test, Test, Test. Ok, was auch immer. Ich hoffe es geht noch. Ich mache es immer hier drüber."}, {"id": 124, "start": 1081.76, "end": 1093.76, "text": "Ich mache es immer hier drüber. Das alte ist so viel besser. Ich bin da ein bisschen hin und her gerissen bei Windows 10."}, {"id": 125, "start": 1094.76, "end": 1100.76, "text": "Ich finde das neue UI an sich gar nicht so schlecht, allerdings ist halt der Funktionsumfang schlecht."}, {"id": 126, "start": 1100.76, "end": 1114.76, "text": "Also was ich damit meine ist, ich finde rein so die Technologie von diesem Oberflächen GUI Zeug hier ganz, ganz gut. Dass das quasi so ein bisschen responsive ist und dass sich das auch ziemlich snappy und schnell und alles anfühlt."}, {"id": 127, "start": 1114.76, "end": 1130.76, "text": "Aber was ich halt nicht mag ist, dass es so gut wie keine Optionen hat. Wozu brauche ich System-Settings, wo die wichtigsten Optionen fehlen?"}, {"id": 128, "start": 1130.76, "end": 1143.76, "text": "Der Don Gaming, das habe ich nie gemacht. Das wollte ich mal machen, ja. Dass die neue Systeme und alte nebeneinander laufen lassen ist dämlich. Ja, da gebe ich dir recht."}, {"id": 129, "start": 1144.76, "end": 1148.76, "text": "Ich meine, es bleibt ihm ja, aber eigentlich bleibt ihm ja nichts anderes übrig, solange das hier halt zu wenig Optionen drin hat."}, {"id": 130, "start": 1148.76, "end": 1162.76, "text": "Ich meine, vielleicht will man ja mal hier was umstellen, was halt noch nicht im neuen drin ist. Es ist halt übliche Windows-Geschichte. Ja, was auch immer."}, {"id": 131, "start": 1162.76, "end": 1177.76, "text": "So, was gucken wir zuerst? What Battlefield 6 Needs. Nee, komm Leute, wir gucken als erstes mal. Was ist das? Warum habe ich ein Video über Akkuschrauber drin?"}, {"id": 132, "start": 1177.76, "end": 1191.76, "text": "Geil, wir gucken nachher ein Video über Akkuschrauber. Wir gucken erstmal eine Runde Battlefield-Top-Plays. Das ist zum Einstieg immer gut. Und danach gucken wir... Oder nee, komm, wir fangen mit dem... Mit was wollen wir anfangen?"}, {"id": 133, "start": 1191.76, "end": 1206.76, "text": "Wollen wir mit dem Mario 64 World-Record anfangen oder eine Runde Battlefield gucken? Warum benutzt du kein Linux? Wieso ist es doch hier? Hab ich doch ein Linux am Start."}, {"id": 134, "start": 1206.76, "end": 1222.76, "text": "Hast du dein Rauchmelder Smart gemacht, dass die mit an... Nein, hab ich noch nicht. Das ist noch was, was ansteht. Also, wir gucken uns den Mario 64 World-Record an jetzt. Der ist erst vor einer halben Stunde oder so aufgestellt worden."}, {"id": 135, "start": 1222.76, "end": 1235.76, "text": "Okay, wir müssen noch mal kurz vorspulen, weil das gerade abgekackt ist, wie es aussieht. What the fuck? Moment."}, {"id": 136, "start": 1252.76, "end": 1267.76, "text": "Okay, hier geht es los. What the fuck? Kann ich den Anfang mal finden? Anfang, please. Ah, hier. Okay, hier geht es los."}, {"id": 137, "start": 1267.76, "end": 1283.76, "text": "Okay, hier geht es los. Also, das ist erst vor ein paar Minuten aufgestellt worden, und zwar von... Ich weiß nicht, wie man die ausspricht, Miss Kiff. Der ist auch gerade noch on, hat wahrscheinlich auch durch den World-Record gerade 13.000 Viewer übelst krasser Shit."}, {"id": 138, "start": 1283.76, "end": 1296.76, "text": "Ist wohl auch ein sehr bekannter Runner. Ich muss sagen, ich hab noch nix von ihm geguckt. Aber wie gesagt, nix von mir. Wir gucken uns das einfach nur an."}, {"id": 139, "start": 1296.76, "end": 1319.76, "text": "Ach so, stimmt. Warum hatten sich das jetzt wieder resettet? Was ist denn das für ein Kack? Ach, hier geht es los. Hier geht es los. Okay, gucken wir uns das Ganze mal an."}, {"id": 140, "start": 1319.76, "end": 1347.76, "text": "Wir gucken uns das Ganze mal an. Wie kriegt er rein Donated? Ist auch richtig so. Der hat es verdient. Also, wenn er sich da so reingehängt hat. Sollte ich es mit dem Chat lassen oder nicht? Sollte ich mit dem Chat oder Vollbild machen?"}, {"id": 141, "start": 1350.76, "end": 1360.76, "text": "Ich kann auch so machen. Mit Chat. Wobei, da haben wir Chat über Chat, das ist wir. Gucken wir uns das lieber so an."}, {"id": 142, "start": 1360.76, "end": 1377.76, "text": "Ich finde es ja geil. Ich finde es ja immer noch geil, dass so viele Leute 2020 ein Spiel spielen, was, Moment, das muss ich jetzt mal nachgucken. Mario 64 Release Date."}, {"id": 143, "start": 1377.76, "end": 1399.76, "text": "Ein Spiel, was vor 14 Jahren rausgekommen ist. Ziemlich genau, vor 14 Jahren. Das ist ja auch so Big Brain. 24 Jahre, Alter. 14 Jahre, stimmt ja, ist ja viel. 24 Jahre, kann man sich das vorstellen?"}, {"id": 144, "start": 1399.76, "end": 1410.76, "text": "Okay. 24 Jahre. Ich kann mich noch dran erinnern, wo ich das neu gekriegt habe. Richtig Boomer."}, {"id": 145, "start": 1410.76, "end": 1435.76, "text": "Twitch Chat ist wieder am Spam. Das finde ich ja auch immer übelst nice. Ich glaube, jeder, der das das erste Mal gesehen hat, ich kann es nicht richtig zurückspulen, weil ich da irgendwie übelst lang klingeln muss."}, {"id": 146, "start": 1435.76, "end": 1446.76, "text": "Jeder, der das zum ersten Mal gesehen hat, wird sich auch denken, fuck, man kommt über die Brücke drüber, ohne dass man mit Lakitu gehen muss."}, {"id": 147, "start": 1452.76, "end": 1461.76, "text": "Was ist mit den Leuten los? Was macht eigentlich der zweite da im Hintergrund? Außer Dasein."}, {"id": 148, "start": 1461.76, "end": 1467.76, "text": "Ja, ich habe auch mal eine Mario 64 Speedrun Video gemacht. Mit dem Tylo zusammen, das weiß ich noch."}, {"id": 149, "start": 1471.76, "end": 1474.76, "text": "Der Twitch Chat, Alter, ist wieder voll am Eskalieren da."}, {"id": 150, "start": 1474.76, "end": 1486.76, "text": "Das ist ja fast so schlimm wie im XQC Chat."}, {"id": 151, "start": 1504.76, "end": 1517.76, "text": "Auf dem DS, ich fand die DS Variante nicht gut. Mir hat die Mario 64 auf dem DS nicht gefallen. Da haben sie zu viel geadded."}, {"id": 152, "start": 1535.76, "end": 1536.76, "text": "Nö."}, {"id": 153, "start": 1543.76, "end": 1549.76, "text": "Da hat er recht. Die meiste Twitch Coffee Pasta ist auch richtig dumm."}, {"id": 154, "start": 1549.76, "end": 1567.76, "text": "Das ist übelst schwer, Leute. Das ist übertrieben schwer. Ich habe mir da mal einen Guide zu angeguckt. Normalerweise, wer das Spiel noch kennt, muss mit der Kanone hier oben die Ecke absprengen."}, {"id": 155, "start": 1567.76, "end": 1577.76, "text": "Das ist übelst schwer. Man muss da auf dem richtigen Winkel an der richtigen Stelle runterfallen. Das Spiel fällt durch den Stern durch."}, {"id": 156, "start": 1577.76, "end": 1597.76, "text": "Total wie, ich habe mir mal einen Guide angesehen. Das kriegt man irgendwie selbst geübt, nur zwei von zehnmal hin oder so."}, {"id": 157, "start": 1607.76, "end": 1609.76, "text": "So, wir haben den Stream gerettet."}, {"id": 158, "start": 1611.76, "end": 1613.76, "text": "Hey Biz, bist du stolz auf mich?"}, {"id": 159, "start": 1613.76, "end": 1615.76, "text": "Ja, du bist vorgegangen."}, {"id": 160, "start": 1616.76, "end": 1618.76, "text": "Warum bist du stolz auf mich für das?"}, {"id": 161, "start": 1618.76, "end": 1619.76, "text": "Was?"}, {"id": 162, "start": 1619.76, "end": 1621.76, "text": "Warum bist du stolz auf mich für das?"}, {"id": 163, "start": 1621.76, "end": 1622.76, "text": "Chad, wer ist vorgegangen heute?"}, {"id": 164, "start": 1622.76, "end": 1644.76, "text": "Sag mal, sind wir wirklich sicher, dass wir das Richtige angucken? Weil ich sehe ihn hier nirgendswo in der Top-Liste drin."}, {"id": 165, "start": 1645.76, "end": 1648.76, "text": "Hat irgendjemand eine Ahnung, ob wir uns den neuen Weltrekord angucken?"}, {"id": 166, "start": 1648.76, "end": 1660.76, "text": "Egal, weil das hier ist 15 und das andere ist 20. Ich glaube wir gucken uns nicht das Richtige an gerade."}, {"id": 167, "start": 1660.76, "end": 1681.76, "text": "Irgendjemand hat doch geschrieben, ich glaube wir gucken uns nicht das Richtige an. Irgendjemand hat doch geschrieben, vor zehn Minuten ist das nicht das Richtige."}, {"id": 168, "start": 1681.76, "end": 1691.76, "text": "Sub20, das ist der, der macht nur seinen PB. Okay Clips, nein nicht Clips."}, {"id": 169, "start": 1696.76, "end": 1704.76, "text": "Genau, der hat auch 20 Minuten gebraucht. Nee, nee, nee, das ist nicht das Richtige, was wir gucken. Vielleicht hat mich auch einfach der Chad gerade gebadet."}, {"id": 170, "start": 1704.76, "end": 1718.76, "text": "Vielleicht hat mich auch der Chad gebadet. So, da müssen wir das woanders rauskriegen."}, {"id": 171, "start": 1718.76, "end": 1734.76, "text": "Nein, nein, nein, kein Krach machen. Raus, Clips, okay. Das kann er nicht."}, {"id": 172, "start": 1734.76, "end": 1756.76, "text": "World First Sub15. Moment, die gucken, wie was geguckt wird. Die gucken, wie was geguckt wird. Okay, was gucken die dann?"}, {"id": 173, "start": 1756.76, "end": 1771.76, "text": "Was gucken die dann? Ah hier, das ist irgendein Livestream aus Japan. Ach jetzt kapiere ich das Ganze. Excellent."}, {"id": 174, "start": 1771.76, "end": 1788.76, "text": "Der Knäherbär hat es hier am Start. Ja, wir gucken uns das Original an natürlich. Ah, yes, excellent. Jetzt ergibt das Sinn."}, {"id": 175, "start": 1788.76, "end": 1807.76, "text": "Alter, wie das wieder absch... Wir müssen mal kurz an den Start zurück. Ist das eine Herzfrequenz? Sehe ich das richtig? Das ist eine Herzfrequenz vom Runner?"}, {"id": 176, "start": 1807.76, "end": 1828.76, "text": "Das ist ja auch mal neu. Reddit Post, ja danke Knäherbär. Excellent, find. Eine Herzfrequenz vom Runner. Erstmal Ruhrpuls vor 69. Okay, der ist schonmal sehr entspannt."}, {"id": 177, "start": 1828.76, "end": 1840.76, "text": "Das ist ziemlich wenig. Wobei, ne, 69, 70 glaube ich normal. Ne, also Michael, ich glaube nicht, dass du 120 hast beim Sitzen."}, {"id": 178, "start": 1840.76, "end": 1858.76, "text": "Ich habe mal gelesen, dass ein Profi Fahrradfahrer hat, also so ein Profi Radsportler kann teilweise bis zu 40 haben."}, {"id": 179, "start": 1858.76, "end": 1878.76, "text": "86, ja glaub auch. So, jetzt gibt er alles, jetzt gibt er alles, hier schon am Input-Spam. Alter, dieses Rumgeklitscht, ich finde es jedes Mal geil."}, {"id": 180, "start": 1878.76, "end": 1891.76, "text": "Wow, RIP, Reset, Eats. Also ich glaube, was er an der Stelle probiert hat, ich habe ja auch schon ein paar Speedruns geguckt, der wollte glaube ich in das Bowser Level reinklitschen."}, {"id": 181, "start": 1892.76, "end": 1906.76, "text": "In das erste Bowser Level. Und wo ich mich noch beim Tyler dran erinnern kann, was er erzählt hat, ist, dass einem dieses Intro, wo Peach den Brief vorliest, oder nur im Englisch, im Japanisch,"}, {"id": 182, "start": 1906.76, "end": 1919.76, "text": "liest sie den Brief ja nicht vor, dass einem das am meisten auf den Sack geht. Weil man sich das jedes Mal angucken muss. So, das müsste jetzt Teuren sein hier."}, {"id": 183, "start": 1920.76, "end": 1932.76, "text": "Teuren, falls man das überhaupt noch sagt. Das ist in Japan normal mit der Herzfrequenz. Warum sollten Japaner denn unterschiedlichen Ruhepuls haben?"}, {"id": 184, "start": 1932.76, "end": 1940.76, "text": "Der Stellzer sagt, er hat einen Ruhepuls von 120 im Krankenhaus. Ja gut, wahrscheinlich weil du nicht ohne Grund im Krankenhaus warst."}, {"id": 185, "start": 1949.76, "end": 1958.76, "text": "So, er ist mal dran vorbei gejumpt. Ach du meintest, dass viele in Japan den Puls zeigen. Okay."}, {"id": 186, "start": 1958.76, "end": 1963.76, "text": "Ja, die Japaner haben da unterschiedliche Vorlieben. Das habe ich auch schon gemerkt."}, {"id": 187, "start": 1966.76, "end": 1976.76, "text": "So, ich glaube jetzt versucht er ins erste Bowser Level rein zu klitschen. Was auch wohl funktioniert. Warum man damit anfängt, weiß ich gar nicht so genau."}, {"id": 188, "start": 1976.76, "end": 1990.76, "text": "Ehrlich gesagt, keine Ahnung warum man damit anfängt, anstatt die normalen. Na gut, wahrscheinlich weil man sich eh durchklitschen muss, weil es schneller ist. Und man am besten vom Start direkt da reinkommt."}, {"id": 189, "start": 1990.76, "end": 2013.76, "text": "Ich kann mich noch dran erinnern, wie vorsichtig man damals durch die Level hier gestellt ist. So nach dem Motto, Mario konnte sogar krabbeln in dem Game und keiner, ich bin da sogar langgekrochen."}, {"id": 190, "start": 2013.76, "end": 2033.76, "text": "Und zack. Macht er jetzt Bowser noch? Ja ne oder? Wahrscheinlich. Ja, ja macht er noch. Plantera sagt er hat einen Ruhepuls von 35. Bist du Profi Radsporter?"}, {"id": 191, "start": 2033.76, "end": 2045.76, "text": "Und Bäm. Ja die ersten zwei sind easy. Die habe ich damals auch immer First Try geschafft. Das ist ja auch kein Problem."}, {"id": 192, "start": 2045.76, "end": 2064.76, "text": "Jetzt ist euch mal aufgefallen, dass Mario in der japanischen Version einen Stern zeigt und in der deutschen Version einen Schlüssel."}, {"id": 193, "start": 2064.76, "end": 2074.76, "text": "Erstmal Rage Quit. Ne nicht wirklich Rage Quit, absichtlich Quit."}, {"id": 194, "start": 2074.76, "end": 2094.76, "text": "Ah, ich glaube jetzt kapiere ich es warum man das zuerst macht mit dem Bowser Level. Wahrscheinlich ist es aus dem Eingang dahin zu kommen am schnellsten und die nächsten Sterne brauchst du mindestens ein Stern dafür um rein zu kommen. Das heißt du musst das Bowser Level eh machen, dass du in ersten Stock kommst."}, {"id": 195, "start": 2094.76, "end": 2103.76, "text": "Und die Sterne sind wahrscheinlich einfach schneller als noch hier Bom Bom Battlefield zu machen. Oder wie auch immer die erste Map heißt."}, {"id": 196, "start": 2103.76, "end": 2118.76, "text": "Ah, das reime ich mir gerade zusammen. Ich habe mich schon lange nicht mit Mario 64 Speedruns beschäftigt."}, {"id": 197, "start": 2118.76, "end": 2134.76, "text": "Zumindest das Spiel macht heute immer noch Bock. Und vor allem wenn man sich anguckt wie easy die Sachen eigentlich sind. Wie easy das eigentlich ist ne. Also wie es aussieht. Also wie es nicht ist aber wie es aussieht."}, {"id": 198, "start": 2134.76, "end": 2149.76, "text": "Und man selbst hat sich damals übelst ein Ei abgebrochen teilweise. Ich meine auf dem Niveau wie der macht ist das garantiert nicht einfach."}, {"id": 199, "start": 2149.76, "end": 2164.76, "text": "Krass. So das ist jetzt wohl noch eine relativ normale Route denke ich mal. Weil das habe ich schon vor ein paar Jahren gesehen diese Sterne in der Variante."}, {"id": 200, "start": 2165.76, "end": 2175.76, "text": "Wobei man halt sagen muss das ich denke zumindest das es gerade bei 16 Sternen halt extrem auf die Ausführung von den einzelnen Sachen ankommt."}, {"id": 201, "start": 2175.76, "end": 2185.76, "text": "Übrigens ja Mist erzählt man braucht den Schlüssel nicht das man den ersten Stock kommt ist ja Schwachsinn. Man braucht natürlich den Schlüssel das man ins Erdgeschoss kommt."}, {"id": 202, "start": 2186.76, "end": 2191.76, "text": "Welches macht der jetzt? Sand links? Pyramidenstells?"}, {"id": 203, "start": 2192.76, "end": 2201.76, "text": "Mal gucken welches der macht. Die meisten springen links dann irgendwie zur Pyramide rüber ne. Genau."}, {"id": 204, "start": 2201.76, "end": 2215.76, "text": "Genau. Und jetzt oben den. Ach ne der klitscht sich rein in die Pyramide. Und man kann direkt oben rausspringen. Easy hätte ich das damals gewusst."}, {"id": 205, "start": 2215.76, "end": 2230.76, "text": "Es ist super gealtert das stimmt. Das stimmt. Das ist wirklich gut gealtert. Das sieht schlecht genug aus das es gut altert. Ich hoffe man versteht wie ich das meine."}, {"id": 206, "start": 2231.76, "end": 2242.76, "text": "Sachen wie Half Life 1 die vielleicht besser ausgesehen haben sind schlechter gealtert weil die halt näher dran versucht haben realistisch zu sein. Mario 64 ist deswegen ganz gut gealtert einfach weil es nicht gut genug aussieht."}, {"id": 207, "start": 2242.76, "end": 2250.76, "text": "Und wahrscheinlich kann ich das gar nicht richtig schätzen was er hier macht aber es sieht alles äußerst flüssig und clean aus."}, {"id": 208, "start": 2250.76, "end": 2271.76, "text": "Also der hat da hunderde Stunden wenn nicht tausende Stunden Übung drin. So jetzt kommt oben das. Ja. Also man hört hier ab und zu von ihm was klicken."}, {"id": 209, "start": 2271.76, "end": 2285.76, "text": "Das heißt der hat den Sound an aber der ist so big brain in game der sagt nix. 1,1900 Stunden. Ja krass."}, {"id": 210, "start": 2285.76, "end": 2300.76, "text": "Das ist das kann ich mich noch dran erinnern das war auch das war auch für Noobs wie mich easy dies das das Bowser Rätsel Puzzle."}, {"id": 211, "start": 2300.76, "end": 2324.76, "text": "So welcher kommt denn jetzt? Der Bulli kommt jetzt oder? Kommt jetzt der Bulli? Ne kommt nicht der Bulli. Es kommt dieses Ding dieses balancieren wo man normalerweise auf dem Holzstück balancieren muss."}, {"id": 212, "start": 2324.76, "end": 2344.76, "text": "Ich bin mal gespannt ob man in der Route noch die Bullis macht. Da ist ja schon neun Sterne. Man braucht doch sogar 16. 16 braucht man im Keller."}, {"id": 213, "start": 2344.76, "end": 2354.76, "text": "Und durch den restlichen Sachen klitscht man sich dann durch. Durch die Tür klitscht man sich durch. Ja jetzt machen wir doch noch den Bulli. Durch die Tür klitscht man sich durch später und durch die Treppe klitscht man sich durch."}, {"id": 214, "start": 2354.76, "end": 2382.76, "text": "Oh stell es so ok. Das ist das und wie war es so? Jetzt kommt der Vulkan? Kommt jetzt der Vulkan? Ah so ein bisschen kann ich mich noch an die Route erinnern."}, {"id": 215, "start": 2382.76, "end": 2394.76, "text": "Genau jetzt machst du über den Booster nicht über den Wasserfall auch. Ah das ist übelst schwer. Nicht Wasserfall über den Lavafall. 90er Puls."}, {"id": 216, "start": 2395.76, "end": 2404.76, "text": "Fängt gleich wieder ein zu schwitzen. Das ist übelst schwer. Ich habe mal einen Stream gesehen wo das einer geübt hat. Irgendwie fünf Stunden lang und hat es nicht überhaupt bekommen."}, {"id": 217, "start": 2404.76, "end": 2430.76, "text": "Oh jetzt hat er geflüstert gerade. Jetzt kommt der Stern da oben drauf liegt vermute ich mal. Ah ne der Nessi Stern kommt jetzt ok. Weil man sich schon durch die Decke klitschen kann weil sich Nintendo gedacht hat Yolo warum soll man da ne Wand hin bauen?"}, {"id": 218, "start": 2430.76, "end": 2452.76, "text": "Stimmt jetzt gibt es ja von Toad noch einen Stern umsonst. PC lustig ja. Schweißometer wäre auch was tolles. Genau da sollte sich so ein Sensor an die Haut packen."}, {"id": 219, "start": 2452.76, "end": 2469.76, "text": "Stress, Stressmeter. Jetzt kommt der Stern. Ne ne jetzt kommt der Stern im Gang. Oben rechts kommt glaube ich jetzt. Hier wo man hier an die Wand springen muss und da oben rechts hin."}, {"id": 220, "start": 2469.76, "end": 2488.76, "text": "Und jetzt hat er eigentlich auch schon. Jetzt hat er genug oder wenn er jetzt 15 hat oder hat er 14. Ne einen braucht er noch. Dann hat er 15 mit 15 kann er in diese Wasserwelt gehen. Mit 15, 16 mit der Wasserwelt und dann das zweite Bau salafel."}, {"id": 221, "start": 2488.76, "end": 2499.76, "text": "Äh Knäherbeer ja finde ich eine gute Idee. Ich glaube das machen wir echt."}, {"id": 222, "start": 2499.76, "end": 2522.76, "text": "Also jetzt müsste das Wasserlevel kommen oder kommt der Haas? Ne der Haas kommt. Genau man braucht ja das Bunny Ding zum durchklitschen durch die Tür."}, {"id": 223, "start": 2522.76, "end": 2533.76, "text": "Stimmt die gehen ja gar nicht in die Wasserwelt mehr rein. Die klitschen sich durch die Tür durch und dann klitschen sie sich mit dem Hase durch die Tür zum Bowser."}, {"id": 224, "start": 2533.76, "end": 2561.76, "text": "Doch Wasser genau. Und jetzt direkt durchschwimmen bis zum U-Boot. Ja der Soundtrack ist nice, sehr entspannt."}, {"id": 225, "start": 2561.76, "end": 2579.76, "text": "Und hopp hopp hopp. Stern und jetzt müsste man ins Bau salafel kommen. Und das war auch schon der letzte Stern der gesammelt wird."}, {"id": 226, "start": 2579.76, "end": 2594.76, "text": "112er 113er Puls. Jetzt ist er aber voll dabei. Na gut er merkt jetzt ja langsam auch das es ziemlich gut läuft. Und jetzt kommen die schweren Dinger."}, {"id": 227, "start": 2594.76, "end": 2612.76, "text": "Da läuft echt alles. Der sieht so weich aus von der Bewegung her. Der bleibt nirgendwo hängen."}, {"id": 228, "start": 2612.76, "end": 2623.76, "text": "Endlich mal das damals gewusst dass das funktioniert. Jetzt kann man sich über die Lava rein boosten. Ja gut das kennt man schon. Das habe ich schon mal gesehen."}, {"id": 229, "start": 2624.76, "end": 2633.76, "text": "Das sieht man auf fast jedem Run. Aber das sieht so weich aus die Bewegung von ihm. Da siehst du dass der echt sehr viel Übung hat."}, {"id": 230, "start": 2633.76, "end": 2641.76, "text": "Ich meine es ist nicht umsonst der Weltrekordhalter der sich jetzt selbst über Booten hat."}, {"id": 231, "start": 2663.76, "end": 2673.76, "text": "So und jetzt kann er ins Dach. Jetzt kommt glaube ich wenn ich die Route noch halbwegs richtig in Erinnerung habe. Jetzt kommt erst mal Quid."}, {"id": 232, "start": 2674.76, "end": 2680.76, "text": "Dann geht er ins Dachgeschoss. Dann springt er durch die Decke. Also er läuft jetzt nicht die Treppe hoch. Dann springt er durch die Decke."}, {"id": 233, "start": 2681.76, "end": 2690.76, "text": "Dann klitscht er sich mit rückwärts gespringe die nächste Treppe hoch. Genau durch die Decke springen. Jetzt zur nächsten Treppe und rückwärts die Treppe hoch klitschen."}, {"id": 234, "start": 2690.76, "end": 2695.76, "text": "Genau was übelst schwer ist durch das Tor durch."}, {"id": 235, "start": 2700.76, "end": 2709.76, "text": "Und jetzt noch mal rückwärts ins letzte Bowser Level. Dann sind wir schon fast am Ende vom Run. Einfach mal das halbe Game übersprungen."}, {"id": 236, "start": 2709.76, "end": 2733.76, "text": "So was sagt eigentlich der Chat gerade? Der geht ab. Das Bowser Level ist das schwerste im Game. Also jeder der das mal casual gespielt hat vor allem wenn er neu mit Jumper Run Spielen damals war, der hat sich übelst schwer getan."}, {"id": 237, "start": 2733.76, "end": 2753.76, "text": "Hup Hup Hup. Erstmal komplett ohne Kamera das ganze gemacht. Easy as fuck. Oh eine Sekunde verloren. MonkaS. Es gab damals sogar eine Hotline bei Nintendo wo man anrufen konnte."}, {"id": 238, "start": 2753.76, "end": 2777.76, "text": "Jetzt geht der Puls erstmal runter und ich glaube jetzt geht der Puls bestimmt wieder hoch. Alter what the fuck. Was ist das für ein Input. What the fuck. WTF. Und noch mal gleich ein dritter Hit. Easy as fuck."}, {"id": 239, "start": 2777.76, "end": 2804.76, "text": "Pogu. Oh jetzt geht er. I was here Pog. Jetzt rastet er aus. Jetzt rastet er aus."}, {"id": 240, "start": 2807.76, "end": 2821.76, "text": "Jetzt ist er. Jetzt ist er. Jetzt ist er nervlich. Jetzt ist er vorbei. Jetzt ist er vorbei. Aber Sub 15. Pogouts. Massive."}, {"id": 241, "start": 2821.76, "end": 2843.76, "text": "Er ist voll außer Pusten aber der Puls geht nicht hoch. Rigged Puls Counter."}, {"id": 242, "start": 2843.76, "end": 2857.76, "text": "Der ist fertig. Aber kann er auch. Ich mein überlegt euch mal. 172. 172. Was geht jetzt ab."}, {"id": 243, "start": 2857.76, "end": 2872.76, "text": "MonkaS 190. Alter. Gleiches Press F."}, {"id": 244, "start": 2887.76, "end": 2890.76, "text": "Das ist wegen dem Kuss von Peach."}, {"id": 245, "start": 2890.76, "end": 2914.76, "text": "Hier wir go. Das müsstest du mal in echt bringen. Das müsstest du mal in echt bringen. Kriegst irgendwann einen Schwatzer und drehst dich erstmal im Kreis und machst Victory Zeichen."}, {"id": 246, "start": 2920.76, "end": 2924.76, "text": "Was geht denn im Hintergrund gerade ab."}, {"id": 247, "start": 2951.76, "end": 2954.76, "text": "Krankenwagen ist unterwegs."}, {"id": 248, "start": 2954.76, "end": 2963.76, "text": "Ja sehr nice. Also Ultra Pog."}, {"id": 249, "start": 2963.76, "end": 2989.76, "text": "Er hat Glück dass er ordentlichen Hinterlandanschluss hat. Weil in Deutschland wäre während der Übertragung Vodafone zweimal abgekackt und niemand könnte verifizieren dass sein Run legit ist."}, {"id": 250, "start": 2994.76, "end": 2997.76, "text": "I was here. I was here. I was here."}, {"id": 251, "start": 3001.76, "end": 3009.76, "text": "Also da muss man echt mal sagen hier. Definitiv nicht easy clap. Sondern einfach nur clap."}, {"id": 252, "start": 3009.76, "end": 3023.76, "text": "Ich will ein Video machen. Ah. Ähm. Ich muss mal. Was ist denn AmarecTV. Irgendwas Japanisches."}, {"id": 253, "start": 3027.76, "end": 3029.76, "text": "Der hat es voll fertig mit dem Nervener."}, {"id": 254, "start": 3031.76, "end": 3033.76, "text": "Was hat der eigentlich da noch."}, {"id": 255, "start": 3033.76, "end": 3038.76, "text": "Der hat danach dann einfach nur eine halbe Stunde gechillt und sich gefreut."}, {"id": 256, "start": 3041.76, "end": 3045.76, "text": "Falsch. Falsch. Hier. Falscher Knopf."}, {"id": 257, "start": 3047.76, "end": 3052.76, "text": "Aber das war wirklich exzellent. Da hat Pan themur recht. Exzellent."}, {"id": 258, "start": 3055.76, "end": 3058.76, "text": "Cool. Nice. Sehr schön."}, {"id": 259, "start": 3058.76, "end": 3075.76, "text": "Das heißt er hat sich selbst verbessert von 15 und 430 Millisekunden auf 14 59 und sonst was. Also eine Sekunde schneller als vorher. Was auf dem Niveau schon ziemlich viel ist."}, {"id": 260, "start": 3075.76, "end": 3087.76, "text": "Ich glaube vor ein paar Jahren haben die Leute noch erzählt hier Sub 15 ist quasi unmöglich. Aber nice. Sehr, sehr nice."}, {"id": 261, "start": 3088.76, "end": 3093.76, "text": "Haben wir uns doch schon mal was richtig cooles anguckt. So was schauen wir uns als erstes jetzt hier an. Zeig mal her."}, {"id": 262, "start": 3094.76, "end": 3099.76, "text": "Battlefield Top Plays. Jawoll Battlefield Top Plays. Eine Runde Battlefield Top Plays. Das geht immer."}, {"id": 263, "start": 3099.76, "end": 3106.76, "text": "Kein einzig deutscher in der Rangliste. Es gibt nicht so viele. Es gibt nicht so viele. Hier ist einer mal."}, {"id": 264, "start": 3107.76, "end": 3118.76, "text": "Es gibt nicht so viele deutsche Speedrunner die richtig gut sind. Es gibt in. Also es gibt ein paar. Es gibt in a link to the past gibt es ein paar die ganz gut sind."}, {"id": 265, "start": 3118.76, "end": 3127.76, "text": "Warum hat er das jetzt nicht gefunden. Gibt es ein paar deutsche. Gernot ist ganz gut. Genau. Es gibt ein paar deutsche hier die ganz gut sind."}, {"id": 266, "start": 3128.76, "end": 3138.76, "text": "Das ist aber eher so das was keiner mehr hier spielt den Kram. Da gibt es ein paar deutsche die ganz gut sind. Bei diesem randomizer Zeugs was auch ganz gut ist."}, {"id": 267, "start": 3138.76, "end": 3147.76, "text": "Das sind ganz gut. Ansonsten. Weiß nicht wie viele deutsche Speedrunners es noch so gibt die da international richtig gut dabei sind."}, {"id": 268, "start": 3150.76, "end": 3156.76, "text": "Was auch ultra nice ist wo wir gerade hier Mario 64 auf hatten. Das gucken wir uns jetzt aber nicht an."}, {"id": 269, "start": 3156.76, "end": 3170.76, "text": "Der letzte 120. Oh guck mal der wurde nochmal überbeaten. Krass. Ich kenne nur den hier. Ich kenne nur den hier. Den hat der dann live erspielt hat. Onstream in irgendeinem Charity Event oder was das war."}, {"id": 270, "start": 3171.76, "end": 3175.76, "text": "Oder in irgendeinem Speedrun live. Das ist ein ganz guter Speedrunner."}, {"id": 271, "start": 3175.76, "end": 3185.76, "text": "Den hatte ich mir auch mal angeguckt. Aber 1.38 ist vielleicht ein bisschen viel. Ich wusste gar nicht dass der mittlerweile schon wieder überboten wurde."}, {"id": 272, "start": 3186.76, "end": 3190.76, "text": "Man muss sich mal überlegen. Das ist ein Game was 24 Jahre alt ist."}, {"id": 273, "start": 3190.76, "end": 3205.76, "text": "Und da kommen im Monats bis Tagestakt teilweise neue Platzierungen neue Matches rein. Das ist doch echt. Es hätte niemals einer gedacht."}, {"id": 274, "start": 3205.76, "end": 3222.76, "text": "1996 ja. Vor allem die spielen auch alle noch auf der original Plattform."}, {"id": 275, "start": 3222.76, "end": 3237.76, "text": "Minecraft hatten dort einen deutschen in ersten Plays. Echt. Minecraft. Java Edition oder. Oder welche."}, {"id": 276, "start": 3237.76, "end": 3251.76, "text": "All achievements. All advancements. Komisch da gibt es gar nicht so viel random seed."}, {"id": 277, "start": 3252.76, "end": 3265.76, "text": "Der Honiglecker ist da auf Platz 1. Ah excellent. 7 Minuten 17. Moment wie spielt man Minecraft in 7 Minuten 17 durch?"}, {"id": 278, "start": 3265.76, "end": 3280.76, "text": "Und hier haben wir den RealBinex mit 24, 53. Mach den mal. Den Honiglecker. Der hat schon mal einen richtig heißen Namen."}, {"id": 279, "start": 3281.76, "end": 3287.76, "text": "Besser als der Poggerslecker wenn er einen Weltrekord hat."}, {"id": 280, "start": 3287.76, "end": 3296.76, "text": "Was ist das Ziel? Ich habe keinen Plassen Schimmer. Was ist denn das Ziel in Minecraft? Wie spielt man Minecraft durch?"}, {"id": 281, "start": 3297.76, "end": 3306.76, "text": "Der Honiglecker. Da ist er. Any percent. 7. März. 6. März. Ender Dragon. Okay. Okay. Wir schauen uns das jetzt mal an."}, {"id": 282, "start": 3306.76, "end": 3320.76, "text": "Okay. Wo geht es los? Ich habe hier keinen Schimmer von Minecraft. Das wisst ihr. Easy. Erstmal easy. Erstmal auf easy stellen."}, {"id": 283, "start": 3320.76, "end": 3335.76, "text": "Erstmal die gute alte Pixel Grafik. Nicht RTX oder komische Texture Packs oder Spinnereien. So classic und raw wie es geht."}, {"id": 284, "start": 3335.76, "end": 3349.76, "text": "Er atmet. Wo ist der Pulsmesser? Ich kann mir keine Speedruns ohne Pulsmesser angucken. Ich will wissen wie viel Puls man hat wenn man Minecraft in 7 Minuten durch spielt."}, {"id": 285, "start": 3349.76, "end": 3367.76, "text": "Ich brauche Pulsmesser. Also was er genau macht. Ich habe keine Ahnung. Weil ich keine Ahnung von Minecraft habe. Er rennt erst mal geradeaus. Warum auch immer."}, {"id": 286, "start": 3367.76, "end": 3386.76, "text": "Ah er rennt geradeaus bis er ein Dorf findet. Wow. What the fuck. Speed Harvesting. Okay fahr mal. Perfekt. Was passiert gerade?"}, {"id": 287, "start": 3386.76, "end": 3402.76, "text": "Und warum haben die Striche durch den Kopf? Was passiert gerade? Ich checke. Was ist das eine Goldachs? Eine Goldachs müsste ziemlich sacken eigentlich weil Gold ziemlich weich ist."}, {"id": 288, "start": 3402.76, "end": 3416.76, "text": "Das ist Minecraft Logik. What is happening? Die Schafe haben so ein Ding durch den Kopf. Das ist eine Debug Ausgabe oder sowas."}, {"id": 289, "start": 3416.76, "end": 3434.76, "text": "Okay let's go. Let's go. Was auch immer. Interessant. Ich habe keine Ahnung was er gemacht hat. By the way this is the last run for today. Ich habe keine Ahnung was er gemacht hat. Er hat sich Dinger gecraftet. Was auch immer für Dinger."}, {"id": 290, "start": 3434.76, "end": 3451.76, "text": "Stimmt. Stimmt. Janik hat recht. Das ist ein Pre Seed. Der weiß was kommt. Wahrscheinlich ist das der offizielle Runner Seed. Das ist die Hitbox bei den Schafen."}, {"id": 291, "start": 3451.76, "end": 3477.76, "text": "Was sind das? Hähnchen? Hasen? Okay der weiß wo er hin muss. Der weiß wo er hin muss. Weil das ein bekannter Seed ist. Leute da müssen wir uns danach noch einen random Seed angucken."}, {"id": 292, "start": 3477.76, "end": 3483.76, "text": "Ich glaube random Seed ist sogar spannender. Wir können uns aber die letzten 5 Minuten noch angucken weil er gleich vorbei ist."}, {"id": 293, "start": 3484.76, "end": 3491.76, "text": "Den 20 Minuten random Seed gucken wir uns auch noch an. Peter."}, {"id": 294, "start": 3491.76, "end": 3505.76, "text": "Was? Hat das irgendeinen Sinn dass er jetzt Holz einsammelt?"}, {"id": 295, "start": 3505.76, "end": 3520.76, "text": "Sticks. Guckt ihr Ocarina of Time Randomizer an? Ich gucke relativ oft A Link to the Past Randomizer aber Ocarina of Time Randomizer habe ich glaube ich noch nie geguckt."}, {"id": 296, "start": 3520.76, "end": 3541.76, "text": "Das wird auch noch Bildchen gefahren. Aktuell ist er so ein bisschen Walking Simulator. Wahrscheinlich passiert da ziemlich viel was ich als Minecraft Noob nicht checke."}, {"id": 297, "start": 3541.76, "end": 3552.76, "text": "Er baut Betten. Da man in anderen Dimensionen nicht schlafen kann explodieren die und damit macht er Schaden."}, {"id": 298, "start": 3552.76, "end": 3573.76, "text": "Ah. Exzellent. Verstehe. Wer kennt das nicht? Das heißt man killt den Endgegner mit einem Bett wenn ich das so richtig verstanden habe jetzt. Exzellent Taktik."}, {"id": 299, "start": 3573.76, "end": 3585.76, "text": "I see. Das ist richtig Sixhead. Ich glaube er hat gerade gesagt übelst gut. Bötchen."}, {"id": 300, "start": 3586.76, "end": 3601.76, "text": "Für mich so als Minecraft Noob sieht das aus als würde er planlos geradeaus laufen. Macht er aber nicht. Sonst hätte er nicht den Weltrekord."}, {"id": 301, "start": 3601.76, "end": 3623.76, "text": "Dungeon. Okay Looten. Das verstehe ich. Wenn ich looten kenne ich mich aus."}, {"id": 302, "start": 3623.76, "end": 3637.76, "text": "Oh Dude. Ich hab. Just ignore the timer."}, {"id": 303, "start": 3637.76, "end": 3652.76, "text": "Okay. Und jetzt ist er jetzt beim Endgegner schon."}, {"id": 304, "start": 3652.76, "end": 3667.76, "text": "Okay. Ich dachte um zum Endgegner zu kommen wie gesagt ich bin der übelste Minecraft Noob."}, {"id": 305, "start": 3668.76, "end": 3677.76, "text": "Ich dachte um zum Endgegner zu kommen muss man sich selbst ein Portal bauen."}, {"id": 306, "start": 3677.76, "end": 3684.76, "text": "Es gibt ja irgendwie dieses netter Portal. Dann muss man irgendwie da noch das Endportal draus bauen."}, {"id": 307, "start": 3685.76, "end": 3692.76, "text": "Was hat der da für eine Worldhack UI? Ich glaube das ist irgendein Debug Mode. Und warum greifen ihn die Endermans nicht an?"}, {"id": 308, "start": 3693.76, "end": 3702.76, "text": "Weil er sie nicht lange genug anschaut oder? Ich hab keinen blassen Schimmer. Was passiert gerade?"}, {"id": 309, "start": 3702.76, "end": 3717.76, "text": "Was passiert? Was sehe ich da gerade?"}, {"id": 310, "start": 3717.76, "end": 3735.76, "text": "Ja wenn das Bett explodiert."}, {"id": 311, "start": 3735.76, "end": 3747.76, "text": "Ach nee."}, {"id": 312, "start": 3747.76, "end": 3775.76, "text": "Ach."}, {"id": 313, "start": 3775.76, "end": 3797.76, "text": "Okay."}, {"id": 314, "start": 3797.76, "end": 3825.76, "text": "Okay."}, {"id": 315, "start": 3825.76, "end": 3852.76, "text": "Okay."}, {"id": 316, "start": 3852.76, "end": 3880.76, "text": "Okay."}, {"id": 317, "start": 3880.76, "end": 3905.76, "text": "So gehts wieder."}, {"id": 318, "start": 3905.76, "end": 3933.76, "text": "Tweet Tweet geht raus."}, {"id": 319, "start": 3933.76, "end": 3952.76, "text": "So. Tweet ist raus. Schauen wir mal wann Vodafone drauf antwortet."}, {"id": 320, "start": 3952.76, "end": 3970.76, "text": "Also ihr wisst ja die übliche Geschichte. Wir wollen ja Vodafone möglichst sehr abfacken. Das heißt wer auf Twitter ist und mal ne Runde liken und retweeten und vor allem kommentieren kann wäre äußerst excellent."}, {"id": 321, "start": 3970.76, "end": 3980.76, "text": "Damit die auch wissen, dass die Leute das mitkriegen. Ganze Crack, äh Crack, Kratz."}, {"id": 322, "start": 3981.76, "end": 3986.76, "text": "Das ist a Crap. Alter. Übelst a huge Crap."}, {"id": 323, "start": 3986.76, "end": 4000.76, "text": "Intershit in Deutschland ist der Wahnsinn. Aber geht wieder, geht wieder. Ich glaube es tut wieder. Also es sollte jetzt gerade wieder ohne Problem funktionieren."}, {"id": 324, "start": 4000.76, "end": 4018.76, "text": "Ich glaube als nächstes verlinken wir denen immer die Clips. Als nächstes verlinken wir denen immer die Clips. Was war der Fix? Einfach drei Minuten gewartet bis es reconnected ist."}, {"id": 325, "start": 4019.76, "end": 4022.76, "text": "Vielleicht hat er jetzt einen anderen Server genommen oder so."}, {"id": 326, "start": 4022.76, "end": 4036.76, "text": "Decouts, das haben wir schon. Das haben wir schon. Projektideen. Tool das automatisch Vodafone service antwittert wenn Stream laggt. Das machen wir, das programmieren wir echt. Das ist eine richtig gute Idee."}, {"id": 327, "start": 4036.76, "end": 4057.76, "text": "Was wollte ich jetzt gerade sagen? Da ist jemand drauf. Das nächste Mal verlinken wir noch die Stream Clips."}, {"id": 328, "start": 4057.76, "end": 4067.76, "text": "Da muss ich sicherstellen, dass ich hier immer mein Vodafone Shithaufen einblende und dann können wir den Link dann verlinken wie es laggt bzw. wie es immer wieder abbricht zwischendurch."}, {"id": 329, "start": 4068.76, "end": 4085.76, "text": "Was sind denn das wieder für komische Trends auf Twitter Deutschland? Covididioten, Reproduktionszahl, Körperverletzung, Ansichten und Muttertag."}, {"id": 330, "start": 4085.76, "end": 4093.76, "text": "Okay, das oben ist wieder, wir kacken uns gegenseitig an und das da unten ist wahrscheinlich der einzige sinnvolle Trend gerade auf Twitter."}, {"id": 331, "start": 4094.76, "end": 4106.76, "text": "Trends for you. Ja, wisst ihr mal. Wisst ihr was schlimmer ist? Wenn man einstellt Trends deutschlandweit, dann trendet in letzter Zeit irgendwelche Kpop-Geschichte."}, {"id": 332, "start": 4106.76, "end": 4119.76, "text": "Es trenden fast nur noch Kpop. Ist euch das mal auf Twitter aufgefallen? Sobald es einen Hashtag gibt, den ihr nicht kennt und ihr klickt drauf, auf einmal ist das irgendein Kpop Zeug."}, {"id": 333, "start": 4119.76, "end": 4137.76, "text": "Oh Mann, könnt ihr eben nicht einen 4G-Router bestellen?"}, {"id": 334, "start": 4137.76, "end": 4150.76, "text": "Okay, also wir gucken, lass uns nochmal den Minecraft Weltrekord fertig gucken. Ist da gleich durch."}, {"id": 335, "start": 4151.76, "end": 4160.76, "text": "Muss ich sagen, der war jetzt nicht so spannend ohne jetzt die Leistung des Runners schmälern zu wollen, aber ich glaube, dass bekannte Seats nicht so spannend sind im Minecraft."}, {"id": 336, "start": 4160.76, "end": 4171.76, "text": "Oh. Ja, Klärbeer, das gucken wir uns gleich danach an. Hi Noob, acht Monate, Dankeschön. Oh, ich hab bestimmt ein paar Subs vergessen. Muss ich gleich mal kurz refreshen."}, {"id": 337, "start": 4172.76, "end": 4184.76, "text": "Und jetzt kriegt er jetzt wieder ein Bett drunter gestellt. Warum trifft er den überhaupt? Hat das Ding so ne... ja, der haut ihm auf den Schwanz, Alter."}, {"id": 338, "start": 4184.76, "end": 4199.76, "text": "Ist aber nicht nett. Oh mein Gott, please, please, please, bitte, bitte, bitte. Come on, brah."}, {"id": 339, "start": 4200.76, "end": 4212.76, "text": "Ja, Hi Noob, Dankeschön für den Sub. Excellent. Exquisite Sub. Poggers Weltrekord. So, wir gucken uns jetzt mal den anderen an. Wir gucken uns den Random Seat an."}, {"id": 340, "start": 4212.76, "end": 4222.76, "text": "Den Random Seat an. Ne, den... Hä? Ah, ich hab das falsche Minecraft auf. Random Seat."}, {"id": 341, "start": 4222.76, "end": 4245.76, "text": "RealBenex geht 24 Minuten vor 4 Tagen. Oh, das ist richtig frisch. Das stimmt schon. Da hast du recht, Serious Max. Da hast du recht. Der Japaner, sogar der Japaner, ne? Oh, ne, ne, ne."}, {"id": 342, "start": 4245.76, "end": 4259.76, "text": "Ne, leckt nicht. Leckt gerade nicht. Sogar der Japaner ist ultra ausgeflippt, ne? Und eben, Deutsche bekommen Weltrekord. Ah, yes, Weltrekord. Easy. So nach dem Motto."}, {"id": 343, "start": 4259.76, "end": 4285.76, "text": "Pilzschema. Kappa HD. Ja, sehe ich auch so. 3 Monate. Huge IQ Sub. Dankeschön. So, und jetzt gucken wir uns den, der wahrscheinlich den deutlich interessanteren Run."}, {"id": 344, "start": 4285.76, "end": 4302.76, "text": "Random Seat. 24. Minecraft, Weltrekord, Speedrun. Random Seat. Nachdem ich immer noch keine Ahnung von Minecraft habe, bin ich mal gespannt, ob ich halbwegs checke, was da abgeht."}, {"id": 345, "start": 4302.76, "end": 4321.76, "text": "Was ist das da? Ist das, ist das World Random Generator oder was ist das?"}, {"id": 346, "start": 4321.76, "end": 4337.76, "text": "Also ich würde den gerade eben als God Seat bezeichnen. World Render, ok. Oh, Third Person. Excellent, Third Person."}, {"id": 347, "start": 4337.76, "end": 4358.76, "text": "Leute, ich habe ein Vorschaufenster. Ich sehe, ob das Team F ist oder nicht. Ok, jetzt wird erstmal Holz abgebaut, weil Holz braucht man wahrscheinlich immer."}, {"id": 348, "start": 4358.76, "end": 4373.76, "text": "So, das sage ich jetzt als Minecraft-Kacknoob. Holz braucht man wahrscheinlich immer, oder? Also wirklich hätte man den Seat da, hätte RNG gepasst im Nether und halt beim Trade."}, {"id": 349, "start": 4373.76, "end": 4389.76, "text": "Hier Steinspitzhacke. Mit einem Clean End. Also wenn alles gegönnt hätte, so 24, wäre halt immer noch ultra heftig."}, {"id": 350, "start": 4390.76, "end": 4395.76, "text": "Wie willst du sonst die Explosionbetten bauen? Richtig."}, {"id": 351, "start": 4395.76, "end": 4407.76, "text": "Ich finde es geil, dass Minecraft Speedruns überhaupt ein Ding sind. Eigentlich richtig cool."}, {"id": 352, "start": 4407.76, "end": 4435.76, "text": "Erstmal die ganzen Betten mitnehmen. Schon einen Zauberwald könnte ich jetzt ausspielen."}, {"id": 353, "start": 4435.76, "end": 4443.76, "text": "Ich vermute mal, dass die Taktik ähnlich ist. Nur nachdem er jetzt nicht weiß, wo was ist, wird er wahrscheinlich mehr Material farben müssen und vielleicht auch selbst ein Portal bauen oder sowas."}, {"id": 354, "start": 4444.76, "end": 4455.76, "text": "Im Gegensatz zu Mario 64 habe ich keinen Plastenschimmer, wie so das Routing und so in Minecraft. Das war jetzt für die Cisco-Fans, wie das in Minecraft ist."}, {"id": 355, "start": 4456.76, "end": 4461.76, "text": "Auf was man erachtet und welche Reihenfolge macht. Was ist das für ein Viech?"}, {"id": 356, "start": 4461.76, "end": 4481.76, "text": "Das sind Steingohle oder Eisengohle. Warum gibt es gelbe und weiße Betten? Ist da ein Unterschied? Heilt man in dem einen schneller?"}, {"id": 357, "start": 4481.76, "end": 4496.76, "text": "Random. Okay, anscheinend ist es ein guter Seat. Ich glaube eh, dass Minecraft Speedruns extrem davon abhängen."}, {"id": 358, "start": 4497.76, "end": 4506.76, "text": "Natürlich muss der Runner auch gut sein, aber wahrscheinlich ist auch extremes Seat-Glück mit dabei. Wenn du ein Seat hast, wo alles was du brauchst nebeneinander spawnst."}, {"id": 359, "start": 4506.76, "end": 4522.76, "text": "Sollte ich glaube echt machen. Ja, mach ich safe."}, {"id": 360, "start": 4522.76, "end": 4537.76, "text": "Da muss ich etwas, weil wenn ich gleich einen Dorf habe, 100% nein. Also ich gehe halt danach auf Dorfsuche. Also ich könnte da lang glaube ich, da kommt es aber nicht oder hier lang."}, {"id": 361, "start": 4538.76, "end": 4544.76, "text": "Und save dahinter irgendwo auch noch. Was ist das denn? Herz93, Real Life Pencil Sharpie. Was?"}, {"id": 362, "start": 4544.76, "end": 4559.76, "text": "Du hast gerade schon einen kranken Run verpasst, der hier war auch lau. Also ein wirklich sehr kranken Run."}, {"id": 363, "start": 4559.76, "end": 4574.76, "text": "Was? Er muss Eisen finden um ein Wassereimer zu bekommen. Mit dem Eimer kann er sich ein Höllenportal bauen. Da findet er was Routen die er für die Augen braucht um ins Ende zu kommen."}, {"id": 364, "start": 4574.76, "end": 4593.76, "text": "Man sieht wie viel Plan ich von Minecraft habe. Aber der Chat kennt sich ja aus. Also vermute ich mal wird er jetzt einfach Zutaten suchen. Nicht dass ich es blicken würde."}, {"id": 365, "start": 4593.76, "end": 4607.76, "text": "Was ist das da unten? Footstabs, Lava, Pop, Item, Plop. Ach das ist so ein Event Log was passiert. Ah jetzt baut er ein Portal oder? Jetzt baut er jetzt ein Portal?"}, {"id": 366, "start": 4607.76, "end": 4627.76, "text": "Oder auch nicht? Warte. Ja das gibt ein Portal."}, {"id": 367, "start": 4627.76, "end": 4643.76, "text": "Das sieht ja fast so aus als würde ich das bauen. Nur dass er das absichtlich so macht. Ok das war das Portal. Verstehe."}, {"id": 368, "start": 4643.76, "end": 4657.76, "text": "Ich habe gerade schon einen kranken Run gehabt. Hätte so 24 Minuten Potenzial gehabt. Normal muss er Diaz finden. Ah Diamanten ok."}, {"id": 369, "start": 4657.76, "end": 4672.76, "text": "Normalerweise muss er Diamanten finden was 20-30 Minuten braucht. Aber mit einem Eimer kann er sich selbst bauen. Ok."}, {"id": 370, "start": 4672.76, "end": 4696.76, "text": "Das heißt er hat nach 5 Minuten das was du normalerweise 30 Minuten verbrauchst."}, {"id": 371, "start": 4696.76, "end": 4714.76, "text": "Die Sounds. Was ist mit den Sounds los?"}, {"id": 372, "start": 4714.76, "end": 4735.76, "text": "Er muss dann am Dorf sich Augen traden die ihm den Weg zum Portal zeigen. Ah yes excellent. Ich verstehe alles. Alles klar. Augen traden."}, {"id": 373, "start": 4735.76, "end": 4745.76, "text": "Was passiert? Ok ich vermute mal das ist keine krasse Stratz die zum Run gehört. Sondern er farmt sich XP. Farmt er sich gerade XP? Kann das sein?"}, {"id": 374, "start": 4746.76, "end": 4752.76, "text": "Ist das XP farm? Interpretier ich das richtig oder muss er einfach die Gegner platt machen?"}, {"id": 375, "start": 4752.76, "end": 4772.76, "text": "Ach die geben Stäbe. Ruten ok. Ah nice. Eine Runde Ruten farm. Ok Stäbe um Augen zu bauen. Wer kennt es nicht?"}, {"id": 376, "start": 4772.76, "end": 4781.76, "text": "Ich bin mal gespannt von was für Augen der Chat jetzt redet. Was hat er da eigentlich für Geblumper um sich herum?"}, {"id": 377, "start": 4781.76, "end": 4806.76, "text": "Das ist von irgendeinem Trank oder von was ist das? Für den Flex. Das ist doch auch alles geplant und es ist ergeblich Random Seed. Ich meine es ist geplant was er machen muss weil er sich auskennt. Aber den Seed kennt er nicht."}, {"id": 378, "start": 4811.76, "end": 4825.76, "text": "Die Minecraft Sounds die sind schon ein bisschen. Ja kann man machen. So ein paar Splits wären cool."}, {"id": 379, "start": 4825.76, "end": 4853.76, "text": "Chat wo lang? Will da lang gehen glaube ich. Was bedeutet Random Seed Generator vermute ich mal. Ich vermute mal dass es halt eine Random Welt ist."}, {"id": 380, "start": 4853.76, "end": 4867.76, "text": "Ok der Knäbär erklärt uns wieder wie es funktioniert. Knäbär schreibt er wird wohl Holz farmen um sich dann Emeralds zu trainen. Mit den Emeralds kann er sich Augen kaufen und dann ab zum Ende."}, {"id": 381, "start": 4867.76, "end": 4885.76, "text": "Ist ja fast Overwatch ad ad spam. Ah yes. Erstmal schön. Das Pferd ist das getamed."}, {"id": 382, "start": 4885.76, "end": 4904.76, "text": "Der Seed wäre über krass. Dutzend zwölf. Ich glaube deswegen ist es auch der Weltrekord Ram weil er Glück gehabt hat beim Seed."}, {"id": 383, "start": 4904.76, "end": 4919.76, "text": "Der Chat wieder. Guck mal das ist ein Pilz. Da ist wieder der Pilz in die Luft gesprengt."}, {"id": 384, "start": 4919.76, "end": 4934.76, "text": "Das gibt jetzt viel Holz oder warum sprengt er das in die Luft? Wo ist der Sinn das in die Luft zu sprengen?"}, {"id": 385, "start": 4934.76, "end": 4948.76, "text": "Einfach dass er es nicht selbst sprengt. Geht schneller. Ok dann habe ich richtig gelegen. Also einfach weil es viel Drops gibt."}, {"id": 386, "start": 4949.76, "end": 4955.76, "text": "Ok verstehe."}, {"id": 387, "start": 4955.76, "end": 4970.76, "text": "Erstmal eine Runde Holz looten. Ja richtig wie in echt. Wer kennt es nicht wenn der Förster in den Wald geht mit einer Box TNT."}, {"id": 388, "start": 4970.76, "end": 4992.76, "text": "Guck mal er hat einen Apple gefunden."}, {"id": 389, "start": 4992.76, "end": 5006.76, "text": "Erstmal eine Kartoffel reindrücken. Leute ich habe legit keine Ahnung was 90% der Items machen."}, {"id": 390, "start": 5006.76, "end": 5021.76, "text": "Wozu muss er jetzt schlafen? Dass er Ausdauer regeneriert oder sowas."}, {"id": 391, "start": 5021.76, "end": 5036.76, "text": "Ah keine Gegner. Ah nachts kommen Gegner aber wenn man im freien schläft in einem Bett dann machen einem die Gegner nichts und die Zeit skipt einfach."}, {"id": 392, "start": 5036.76, "end": 5051.76, "text": "Exzellent."}, {"id": 393, "start": 5051.76, "end": 5066.76, "text": "Die spawnen dann gar nicht. Ok es wird anscheinend jede Menge extrem viel Holz gefarmt."}, {"id": 394, "start": 5066.76, "end": 5087.76, "text": "Sechs Steaks Poggers. Gar nicht so ausgesehen."}, {"id": 395, "start": 5087.76, "end": 5099.76, "text": "Erstmal ein paar Hähnchen rüsten."}, {"id": 396, "start": 5099.76, "end": 5116.76, "text": "Erstmal wieder aufs Horst drauf."}, {"id": 397, "start": 5116.76, "end": 5129.76, "text": "Ah wir sind gleich mit der Zeit. Ich kann mich echt nicht erinnern wann ich zwei so gute Seats direkt hintereinander hatte."}, {"id": 398, "start": 5129.76, "end": 5145.76, "text": "Ja da sind wir beim Thema wo eben im Chat jemand gemeint hat das ist schon echt krasser Zufall er sagt es ja gerade dass er selten so gute Seats hat."}, {"id": 399, "start": 5145.76, "end": 5163.76, "text": "Die Dorfbewohner Sounds in Minecraft."}, {"id": 400, "start": 5163.76, "end": 5184.76, "text": "Ok jetzt gibt es jede Menge Steaks. 30 Milliarden Steaks und dann Emeralds. Ok der Knäbär hat recht."}, {"id": 401, "start": 5184.76, "end": 5198.76, "text": "Der Knäbär hat erzählt was er macht und so ist es jetzt auch gekommen."}, {"id": 402, "start": 5199.76, "end": 5212.76, "text": "Ok es werden sich 30 Spiele an Steaks gecraftet und dann irgendwie Emeralds draus gestellt. Was auch immer da genau passiert aber jetzt hat er viele Emeralds."}, {"id": 403, "start": 5212.76, "end": 5220.76, "text": "Mit den Emeralds gibt es Augen. Was zum Teufel für Augen ich habe in Minecraft noch nie Augen gesehen aber ich habe ja auch nicht wirklich viel in Minecraft gespielt."}, {"id": 404, "start": 5220.76, "end": 5247.76, "text": "Die braucht er um das Portal anzumachen."}, {"id": 405, "start": 5247.76, "end": 5254.76, "text": "Jetzt ist das wenigstens mal Minecraft. Jetzt wird wenigstens mal was gecraftet."}, {"id": 406, "start": 5255.76, "end": 5261.76, "text": "Oder wie der Friseur immer gesagt hat mein QF. Man muss das ja besonders cool aussprechen."}, {"id": 407, "start": 5261.76, "end": 5278.76, "text": "Mein QF. Was hat er da eben hergestellt das Goldene was war das Goldene was er da gerade gebaut hat."}, {"id": 408, "start": 5278.76, "end": 5294.76, "text": "Und wozu braucht man Closedone. Jetzt sag nicht zum glühen."}, {"id": 409, "start": 5294.76, "end": 5309.76, "text": "Er muss den NPC leveln. Aha ok man leveln NPCs. Das ist das Auge was der Knäbär meint."}, {"id": 410, "start": 5309.76, "end": 5323.76, "text": "Ok ich blicke zwar nicht durch aber es ist trotzdem interessant zuzugucken."}, {"id": 411, "start": 5323.76, "end": 5338.76, "text": "Mr. Opie ja aber da tut sich doch schon seit Jahren nichts mehr."}, {"id": 412, "start": 5339.76, "end": 5351.76, "text": "Die Augen brauchst du dann zum aktivieren vom Portal."}, {"id": 413, "start": 5351.76, "end": 5366.76, "text": "Spiel auch auf Normal ich darf nicht Joggen. Wenn ich einen Endermann anschaue bin ich tot."}, {"id": 414, "start": 5367.76, "end": 5373.76, "text": "Das Pferd schwimmt auch wenn man drauf ist. Excellent. Ein Nicest Horse."}, {"id": 415, "start": 5373.76, "end": 5381.76, "text": "Und woher weiß er jetzt wo er hin muss ich check das überhaupt nicht. Wo kriegt er jetzt die Richtung angezeigt."}, {"id": 416, "start": 5382.76, "end": 5388.76, "text": "Was geht denn jetzt ab. Die Augen zeigen den Weg. Ja wo wo."}, {"id": 417, "start": 5389.76, "end": 5398.76, "text": "In die Richtung in die das Auge fliegt."}, {"id": 418, "start": 5398.76, "end": 5403.76, "text": "Ok das heißt er hat jetzt ein Auge geworfen. Das was er da gerade gemacht hat oder so."}, {"id": 419, "start": 5404.76, "end": 5408.76, "text": "Weil ich jetzt irgendwie nicht richtig mitgekriegt hab. Und in der Richtung wo das fliegt."}, {"id": 420, "start": 5409.76, "end": 5415.76, "text": "Oder fliegt das vor ihm her weil ich seh nix. Also so werfen wie aus dem Inventar raus werfen oder wie."}, {"id": 421, "start": 5416.76, "end": 5421.76, "text": "Oder Item benutzen. Gute Entscheidung. Ach nur kurz ok."}, {"id": 422, "start": 5421.76, "end": 5429.76, "text": "Es fliegt nur kurz deswegen braucht er da auch mehrere von."}, {"id": 423, "start": 5430.76, "end": 5434.76, "text": "Ah ok das heißt er tastet sich da jetzt ran. Der wirft das mal eins."}, {"id": 424, "start": 5435.76, "end": 5438.76, "text": "Rennt eine ganze Weile in die Richtung. Wirft da noch mal eins."}, {"id": 425, "start": 5439.76, "end": 5443.76, "text": "Ah jetzt hab ichs gesehen. Jetzt hab ichs gesehen. Ok jetzt hat das wohl gefunden."}, {"id": 426, "start": 5444.76, "end": 5449.76, "text": "Weil das ist nach oben geflogen."}, {"id": 427, "start": 5449.76, "end": 5456.76, "text": "Ei auf Latan. Omega Lul."}, {"id": 428, "start": 5457.76, "end": 5466.76, "text": "Omega Lul."}, {"id": 429, "start": 5467.76, "end": 5471.76, "text": "Es fliegt nach oben in die Richtung vor dem Portal A. Verstehe. Excellent."}, {"id": 430, "start": 5472.76, "end": 5476.76, "text": "Das ist einfach ein Block in der Luft."}, {"id": 431, "start": 5476.76, "end": 5483.76, "text": "Denkt ihr es ist hier."}, {"id": 432, "start": 5484.76, "end": 5494.76, "text": "Ach das droppt dann wieder."}, {"id": 433, "start": 5494.76, "end": 5508.76, "text": "Kann das Pferd mehr als ein Block hoch springen oder ist es einfach nur schneller."}, {"id": 434, "start": 5509.76, "end": 5513.76, "text": "Zwei Blöcke und schneller. Aha. Wir haben hier die richtigen Minecraft Experten im Chat."}, {"id": 435, "start": 5514.76, "end": 5521.76, "text": "Excellent. Ah ok jetzt sieht er jetzt muss er quasi hier geradeaus in die Richtung weiter."}, {"id": 436, "start": 5521.76, "end": 5527.76, "text": "Jetzt hab ichs glaub ich kapiert."}, {"id": 437, "start": 5528.76, "end": 5538.76, "text": "Pro Chat. Ja. Massive Pro Chat."}, {"id": 438, "start": 5539.76, "end": 5542.76, "text": "Sollte hier gleich sein save."}, {"id": 439, "start": 5542.76, "end": 5557.76, "text": "Die Pferde AI buggt. Moment das Pferd ist. Ich dachte man steuert das Pferd ganz normal mit WASD jetzt wenn man drauf sitzt."}, {"id": 440, "start": 5557.76, "end": 5574.76, "text": "Ja ist auch so. Wie kann dann die Pferde AI buggen."}, {"id": 441, "start": 5575.76, "end": 5582.76, "text": "Aha jetzt ist er fast da. Jetzt hat er nämlich gesehen die Richtung hat sich geändert."}, {"id": 442, "start": 5582.76, "end": 5592.76, "text": "Und woher weiß er jetzt dass es exakt da ist."}, {"id": 443, "start": 5593.76, "end": 5598.76, "text": "Gut Glück. Ok raten."}, {"id": 444, "start": 5599.76, "end": 5607.76, "text": "Wow Monkeys. Oh Big Brain Strats."}, {"id": 445, "start": 5607.76, "end": 5616.76, "text": "Ich sehe ich sehe ich verstehe was er gemacht hat. Jetzt hat er es direkt gefunden. Das ist übelst Glück oder."}, {"id": 446, "start": 5617.76, "end": 5620.76, "text": "Das ist übelst Glück dass er es jetzt direkt gefunden hat."}, {"id": 447, "start": 5621.76, "end": 5625.76, "text": "Das ist wahrscheinlich deswegen auch weil es der Weltrekord Run ist."}, {"id": 448, "start": 5626.76, "end": 5633.76, "text": "Moin Max alles gut bei dir. Ja alles top. Ne Jo Jein Ja was denn jetzt."}, {"id": 449, "start": 5633.76, "end": 5639.76, "text": "Ja es ist nur unter dem Auge irgendwo."}, {"id": 450, "start": 5640.76, "end": 5646.76, "text": "Weil er selbst gesagt. Ah und jetzt muss er das auffüllen mit den Augen."}, {"id": 451, "start": 5647.76, "end": 5660.76, "text": "Deswegen braucht auch genau 12 und ein bisschen Reserve."}, {"id": 452, "start": 5660.76, "end": 5669.76, "text": "Und dann was ist denn wenn man da rein teleportiert sport man dann irgendwo irgendwo random in dieser anderen Dimensions Welt."}, {"id": 453, "start": 5670.76, "end": 5679.76, "text": "Ja aber die ist nicht so groß ne. Das ist wahrscheinlich bloß eine Plattform mit Drache drauf."}, {"id": 454, "start": 5680.76, "end": 5686.76, "text": "Ich habe gesehen es gibt auch irgendeinen dass der Drache gar nicht der Endgegner ist sondern es gibt dann auch irgendwelche noch."}, {"id": 455, "start": 5686.76, "end": 5692.76, "text": "Habe ich letztendlich in irgendeinem Stream gesehen dass es jetzt auch irgendwelche Ender Ender Villages gibt oder sowas."}, {"id": 456, "start": 5699.76, "end": 5704.76, "text": "Biggest Minecraft Noob ja sage ich doch ich habe keine Ahnung davon. Das ist neu ok."}, {"id": 457, "start": 5704.76, "end": 5711.76, "text": "Geht direkt."}, {"id": 458, "start": 5712.76, "end": 5724.76, "text": "Er spielt es auf eine ältere Version. Ok wahrscheinlich weil es irgendwelche Klitsch nicht mehr gibt auf der Neue."}, {"id": 459, "start": 5724.76, "end": 5733.96, "text": "So und jetzt kommt gleich der Betten-Klitsch wieder."}, {"id": 460, "start": 5733.96, "end": 5739.96, "text": "Ich gönn dich."}, {"id": 461, "start": 5739.96, "end": 5742.96, "text": "Hallo?"}, {"id": 462, "start": 5742.96, "end": 5745.96, "text": "Please?"}, {"id": 463, "start": 5745.96, "end": 5750.96, "text": "Na trifft nicht."}, {"id": 464, "start": 5750.96, "end": 5755.96, "text": "Na aim."}, {"id": 465, "start": 5755.96, "end": 5760.96, "text": "Warum kann ich dich nicht treffen?"}, {"id": 466, "start": 5760.96, "end": 5765.96, "text": "Huge Na."}, {"id": 467, "start": 5765.96, "end": 5768.96, "text": "Kannst du mir mal erklären?"}, {"id": 468, "start": 5768.96, "end": 5773.96, "text": "Einfach erstmal Flying Cheat anmachen und hochfliegen. Easy."}, {"id": 469, "start": 5773.96, "end": 5782.96, "text": "Ich greif dich nicht."}, {"id": 470, "start": 5782.96, "end": 5788.96, "text": "Jetzt aber."}, {"id": 471, "start": 5788.96, "end": 5795.96, "text": "Und das bei einem Weltrekord. Ja daran sieht man, dass das Seed wohl extrem glücklich war auch."}, {"id": 472, "start": 5795.96, "end": 5800.96, "text": "Jetzt kommt der Betten-Klitsch."}, {"id": 473, "start": 5800.96, "end": 5810.96, "text": "Oh das zieht aber richtig viel Energie ab."}, {"id": 474, "start": 5810.96, "end": 5821.96, "text": "Der Drache macht auch nicht so wirklich was oder?"}, {"id": 475, "start": 5821.96, "end": 5827.96, "text": "Ist das schwer normalerweise?"}, {"id": 476, "start": 5827.96, "end": 5833.96, "text": "Ist das ein schwieriger Bosskampf oder eher so easy as fuck, wenn man erstmal da ist?"}, {"id": 477, "start": 5833.96, "end": 5837.96, "text": "Was macht das Bett denn? Das Bett scheint zu explodieren, weil man hier nicht schlafen kann."}, {"id": 478, "start": 5837.96, "end": 5846.96, "text": "So hab ich das vorhin verstanden."}, {"id": 479, "start": 5846.96, "end": 5851.96, "text": "Nee, ich mein wie schwer der Kampf normalerweise ist, wenn man da legit hingeht oder normal hingeht."}, {"id": 480, "start": 5851.96, "end": 5854.96, "text": "Der Drache ist easy, okay."}, {"id": 481, "start": 5854.96, "end": 5863.96, "text": "Also normalerweise hast du wahrscheinlich auch gescheite Waffen, gescheite Rüstung und alles."}, {"id": 482, "start": 5863.96, "end": 5869.96, "text": "Wahrscheinlich sind die Endermans schwieriger drum herum."}, {"id": 483, "start": 5869.96, "end": 5879.96, "text": "Warum hat er eigentlich unendlich Pfeile? Oder hat er nicht unendlich Pfeile?"}, {"id": 484, "start": 5879.96, "end": 5893.96, "text": "Hat er nicht, er hat einfach nur viele."}, {"id": 485, "start": 5893.96, "end": 5900.96, "text": "Der Drache produziert Pixel."}, {"id": 486, "start": 5900.96, "end": 5911.96, "text": "Jetzt erstmal wieder runter auf den Schwanz hauen und eats."}, {"id": 487, "start": 5911.96, "end": 5919.96, "text": "Easy."}, {"id": 488, "start": 5919.96, "end": 5925.96, "text": "Ja, nice run. Ich weiß es nicht zu würdigen, weil ich keine Ahnung von dem Game hab."}, {"id": 489, "start": 5925.96, "end": 5934.96, "text": "Okay, kann das sein, dass sich irgendwie Deutsche bei einem Weltrekord nie freuen?"}, {"id": 490, "start": 5934.96, "end": 5939.96, "text": "Ah, gut, geschafft. Okay."}, {"id": 491, "start": 5939.96, "end": 5943.96, "text": "Oder ist ihm vielleicht auch gar nicht klar, dass das ein Weltrekord ist."}, {"id": 492, "start": 5943.96, "end": 5950.96, "text": "Okay."}, {"id": 493, "start": 5950.96, "end": 5956.96, "text": "Welche Effizienz? Mir erscheint so. Ja, nice. Also Speedrun hier von Binex."}, {"id": 494, "start": 5956.96, "end": 5958.96, "text": "Ich weiß nicht, ob sich mein Kampf auf Speedruns interessiert."}, {"id": 495, "start": 5958.96, "end": 5962.96, "text": "Mal eben mal vorbeigucken, wahrscheinlich hat er noch mehr."}, {"id": 496, "start": 5962.96, "end": 5969.96, "text": "Sehr nice. Was sagt denn Unity Media eigentlich?"}, {"id": 497, "start": 5969.96, "end": 5976.96, "text": "Die sagen gar nichts, die gehen wieder auf Tauchstation."}, {"id": 498, "start": 5976.96, "end": 5986.96, "text": "Okay, der Weltrekord ist halt das mindeste, genau."}, {"id": 499, "start": 5986.96, "end": 5990.96, "text": "Hast du das Video von Kugelmagnet Eddy gesehen zum Thema Battlefield 6, Battlefield 5?"}, {"id": 500, "start": 5990.96, "end": 5999.96, "text": "Nee, soll man das gucken? Kugelmagnet."}, {"id": 501, "start": 5999.96, "end": 6005.96, "text": "Ich gucke wenig deutsche Videos, muss ich ja dazu sagen."}, {"id": 502, "start": 6005.96, "end": 6017.96, "text": "Das da? Oder welches, meinst du?"}, {"id": 503, "start": 6017.96, "end": 6028.96, "text": "Okay. Tach. Ai, was geht?"}, {"id": 504, "start": 6028.96, "end": 6034.96, "text": "Den KLS Song? Nein, den hab ich noch nicht gehört. Es gibt auch ein paar Sachen, die will ich nicht hören."}, {"id": 505, "start": 6034.96, "end": 6040.96, "text": "Vor allem, warum muss der jetzt auch noch singen?"}, {"id": 506, "start": 6040.96, "end": 6044.96, "text": "Es hat ja nicht schon gereicht, dass er nicht mit seinem Fitnesszeug die Leute gescampt hat."}, {"id": 507, "start": 6044.96, "end": 6047.96, "text": "Es muss auch noch singen."}, {"id": 508, "start": 6047.96, "end": 6050.96, "text": "Egal, wir gucken jetzt das Video an. Kein Battlefield 5 Content mehr."}, {"id": 509, "start": 6050.96, "end": 6054.96, "text": "Ich fühle mich verarscht. Battlefield 5 Dice EA Rant."}, {"id": 510, "start": 6054.96, "end": 6061.96, "text": "Okay."}, {"id": 511, "start": 6061.96, "end": 6068.96, "text": "Ist laut genug? Ich denke schon, oder?"}, {"id": 512, "start": 6068.96, "end": 6085.96, "text": "Ja, und der Patch-Trailer sah auch übelst räudig aus."}, {"id": 513, "start": 6085.96, "end": 6091.96, "text": "Es gibt keine Amis, korrigiert mich, wenn ich falsch liege, Leute."}, {"id": 514, "start": 6091.96, "end": 6104.96, "text": "Es gibt keine Amis, es gibt kein D-Day, es gibt eigentlich fast nichts, was man mit dem zweiten Weltkrieg verbindet."}, {"id": 515, "start": 6104.96, "end": 6109.96, "text": "In dem Spiel."}, {"id": 516, "start": 6109.96, "end": 6116.96, "text": "Keine Russen. Stimmt, Amis gibt es, keine Russen gibt es. So rum war das. Russen gibt es nicht. Keine Russen, keine Ostfront."}, {"id": 517, "start": 6116.96, "end": 6124.96, "text": "Kein D-Day, nichts, was du mit dem zweiten Weltkrieg verbinden würdest."}, {"id": 518, "start": 6124.96, "end": 6131.96, "text": "Ach so, stellt so."}, {"id": 519, "start": 6131.96, "end": 6134.96, "text": "KLS ist jemand, das kann ich mir nicht angucken."}, {"id": 520, "start": 6134.96, "end": 6158.96, "text": "Da läuft mein Gehirn aus."}, {"id": 521, "start": 6158.96, "end": 6168.96, "text": "Aber ich mag es trotzdem nicht."}, {"id": 522, "start": 6168.96, "end": 6178.96, "text": "Und wo man von Anfang an mit Content-Hippen dran war."}, {"id": 523, "start": 6178.96, "end": 6200.96, "text": "Ja, ja."}, {"id": 524, "start": 6200.96, "end": 6205.96, "text": "Ja, ihr gerade recht."}, {"id": 525, "start": 6205.96, "end": 6208.96, "text": "Die haben sich, die haben sich ja auch selbst gebated."}, {"id": 526, "start": 6208.96, "end": 6216.96, "text": "Ich erinnere nur mal an den ehemaligen DICE-Chef, der noch gesagt hat, er weiß nicht, wie er seiner Tochter erklären soll, dass es keine weiblichen Soldaten gibt."}, {"id": 527, "start": 6216.96, "end": 6219.96, "text": "Und wem das nicht gefällt, dann soll das Spiel nicht kaufen."}, {"id": 528, "start": 6219.96, "end": 6231.96, "text": "Das ist so ein Ultra-Marketing-Fail gewesen, dass der überhaupt, wie der es überhaupt in die Position geschafft hat, ist mir nicht klar."}, {"id": 529, "start": 6231.96, "end": 6239.96, "text": "Die waren einfach unfähig, die waren unfähig, die waren unfähig."}, {"id": 530, "start": 6239.96, "end": 6245.96, "text": "Ja, genau."}, {"id": 531, "start": 6245.96, "end": 6262.96, "text": "Das habe ich auch schon oft gesagt, der erste Trailer war so extrem fail, vor allem, weil sie vorher eine halbe Stunde erzählt haben, wie realistisch, wie authentisch, wie mit Veteranen zusammengearbeitet, blablabla, was sie alles haben."}, {"id": 532, "start": 6262.96, "end": 6279.96, "text": "Und dann kommt der Trailer mit der Frau, mit der Krallenhand, mit der Kriegsbemalung, mit dem schwarzen Soldaten, mit dem Katana auf dem Rücken, mit dem Panzer, der durch die Wand fährt, was nichts, aber auch gar nichts mit dem zu tun hatten, was die ursprünglich erzählt haben."}, {"id": 533, "start": 6279.96, "end": 6299.96, "text": "Das stimmt."}, {"id": 534, "start": 6299.96, "end": 6303.96, "text": "Kennt ihr das doch, wo Snoop Dogg Battlefield 1 gespielt hat?"}, {"id": 535, "start": 6303.96, "end": 6315.96, "text": "Ja, das war geil. Das hat richtig wehgetan beim Zugucken. Der hat die ganze Zeit einfach nur im Graben gesessen und ist von links nach rechts gelaufen."}, {"id": 536, "start": 6315.96, "end": 6320.96, "text": "Da habe ich mich so weggepisst."}, {"id": 537, "start": 6320.96, "end": 6345.96, "text": "Das ist richtig. Das ist richtig, ja."}, {"id": 538, "start": 6345.96, "end": 6364.96, "text": "Ja, also Trailer an sich ist letztendlich nicht das Problem. Was für einen Trailer ist eher das Problem gewesen?"}, {"id": 539, "start": 6364.96, "end": 6382.96, "text": "Ja."}, {"id": 540, "start": 6382.96, "end": 6406.96, "text": "Ja, richtig, richtig."}, {"id": 541, "start": 6406.96, "end": 6426.96, "text": "Ja, das stimmt."}, {"id": 542, "start": 6426.96, "end": 6442.96, "text": "In Rush. In Rush vor allem. Das war ja in Battlefield 4 leider nie so gut."}, {"id": 543, "start": 6442.96, "end": 6462.96, "text": "Im spielerischen, finde ich persönlich, ist Battlefield 4 in fast jeder Belange mittlerweile einfach besser. Und warum? Weil sie einen Public Test Server eingerichtet haben, ein CTE, Community Test Environment. Dort testet man verschiedene Sachen. Und wer keine Lust auf ewige Experimente und sich ein permanent verendetes Spiel hat, der hat halt nicht auf dem Test Server gespielt, sondern auf dem Live Server."}, {"id": 544, "start": 6462.96, "end": 6475.96, "text": "Und wenn auf dem Test Server sich herausgestellt hat, dass die Community sagt, ja, das ist cool, das ist eine gute Änderung, das können wir machen, dann wird es umgesetzt. So wurde Battlefield 4 zu einem der besten Spiele, wenn nicht sogar dem besten Spiel der letzten Jahre."}, {"id": 545, "start": 6475.96, "end": 6499.96, "text": "Vor allem, vor allem, weil sie sich halt auch Gedanken gemacht haben und was an dem Spiel geschraubt haben und nicht so planlose Änderungen, wie ich es teilweise in Battlefield 5 mitgekriegt habe. Time to kill runter, Time to kill hoch, Time to kill runter, Time to kill wieder hoch und solche komischen Dinger. Das hat in Battlefield 4, was ja auch einen katastrophalen Start hatte, einfach strukturierter und sinnvoller gewirkt."}, {"id": 546, "start": 6499.96, "end": 6517.96, "text": "Also meiner Meinung nach ist Battlefield 4 eins der besten Spiele, auch immer noch. Battlefield 1 hat auch Test Server gehabt. Battlefield Hardline hat Test Server gehabt. Man weiß die Dinger funktionieren und bringen was. Und was macht man bei Battlefield 5? Man patch die Time to kill viermal hin und her. Und das auf dem Live Server."}, {"id": 547, "start": 6517.96, "end": 6533.96, "text": "Ich habe es nicht gespielt, aber der Aufschrei war so groß, dass sogar ich den mitgekriegt habe."}, {"id": 548, "start": 6533.96, "end": 6548.96, "text": "Ich habe es nicht gespielt, aber der Aufschrei war so groß, dass sogar ich den mitgekriegt habe. Und ich habe es nicht gespielt, aber der Aufschrei war so groß, dass sogar ich den mitgekriegt habe. Und ich habe es nicht gespielt."}, {"id": 549, "start": 6548.96, "end": 6568.96, "text": "Als das Pacific Update rauskam, war das Spiel gerade dabei wieder interessant zu werden. Und das sehe nicht nur ich so. Es gab so viele Leute, die wieder Bock auf Battlefield hatten. Das Spiel war gerade dabei wieder richtig interessant zu werden. Und genau in dem Moment sagen sie, wir ändern nochmal die komplette Time to kill und verlängern die einfach mal. Und das über Monate."}, {"id": 550, "start": 6568.96, "end": 6581.96, "text": "Ja, das ist auch eine Sache, die ich mitgekriegt habe, dass die unglaublich langsam waren, was das Ganze anbelangt. Auf der einen Seite hier auf Service Game und Dauer Content und Dauer Support und Update und sonst was machen. Und dann langsamer sein mit Patches als Blizzard bei Overwatch."}, {"id": 551, "start": 6581.96, "end": 6609.96, "text": "Monate blieb die Time to kill, wie sie war. Alle. Also klar, es gibt Ausnahmen. Und wenn ihr da draußen einer von den Leuten seid, die sagt, mir gefiel das besser, das ist völlig okay. Aber der große Teil der Community hat gesagt, das ist Schrott. Das wollen wir nicht. Macht es zurück. Das war vorher gut. Das Spiel ist jetzt gut. Lasst es so. Nein, es wird durchgezogen. Und was ist das Ende vom Lied jetzt gewesen? Nach Monaten wurde die Time to kill wieder so hingepatcht, wie sie davor war. Monatelang Zeit verschwendet für nichts."}, {"id": 552, "start": 6609.96, "end": 6620.96, "text": "Wie bescheuert kann man sein? Und anstatt dass diese Zeit für vernünftigen Content oder richtige Patches gemacht wurde, wurde sie einfach vergeudet und jetzt merken sie, wir werden wohl nicht fertig."}, {"id": 553, "start": 6620.96, "end": 6648.96, "text": "Ja, das ist schwer zu sagen. Also muss ich sagen, für uns als Außensteher sieht das so aus. Ich glaube nicht, dass sie da sinnlos rumgehampelt haben den ganzen Tag und sich denken, ja, wir machen jetzt mal hier, wir machen jetzt mal da, die wenn da schon einen gewissen Plan gehabt haben, der halt nach außen hin nicht aufgegangen ist. Also ich glaube nicht, dass DICE wirklich Zeit vergeudet hat im eigentlichen Sinne, dass sie sinnlose Sachen aus ihrer Sicht oder dass sie sinnlose Sachen gemacht haben. Die haben das schon für den besten Weg gehalten."}, {"id": 554, "start": 6648.96, "end": 6651.96, "text": "Das war halt für'n Arsch, ne?"}, {"id": 555, "start": 6651.96, "end": 6662.96, "text": "Oh, Rage Mode. Jetzt ist Rage Mode activated hier, ich seh's schon."}, {"id": 556, "start": 6662.96, "end": 6676.96, "text": "Bad Company 2, Poggers."}, {"id": 557, "start": 6676.96, "end": 6689.96, "text": "Fuck it, was soll's, Digga. Jetzt ist Battlefield 1 auch wieder interessant, auch wenn es spielerisch vielleicht meiner Meinung nach nicht so gut ist wie Battlefield 5, dass wenigstens fertig gemacht worden. Da gab's wenigstens Maps und Content und das ist ein fertiges, polishedes Game."}, {"id": 558, "start": 6689.96, "end": 6705.96, "text": "Also ich find's eine absolute Frechheit nach der ganzen Misere zu sagen, oh, machen wir halt einfach gar nichts mehr, was soll's. Es ist ein Live Service Game versprochen worden und die Leute haben das Spiel gekauft in dem Wissen, das was jetzt drin ist, ist nicht alles, was ich für die Markt bekomme, die ich ausgegeben hab."}, {"id": 559, "start": 6705.96, "end": 6717.96, "text": "Aber das ist ein schönes Beispiel dafür, wie's gehen kann und das muss jedem klar sein im Endeffekt, wenn man sich jetzt was kauft für Versprechen, die abgegeben werden."}, {"id": 560, "start": 6717.96, "end": 6736.96, "text": "Das ist das Gleiche, es ist in ähnlicher Form das, wie wenn du Sachen vorbestellst. Wenn du Sachen vorbestellst und jetzt schon deine Kohle gibst, ist es fast genau das Gleiche. Du bestellst die Sachen vor mit dem Versprechen, dann kommt das, was du haben willst, was absolut nicht klar ist."}, {"id": 561, "start": 6736.96, "end": 6747.96, "text": "Vor allem in der heutigen Zeit nicht klar ist, wo teilweise Spiele rausgeschissen werden, in einem Zustand, wo du dich fragst, hat das mal einer selbst von denen Probe gespielt?"}, {"id": 562, "start": 6747.96, "end": 6772.96, "text": "Und anstatt, dass es überhaupt irgendwann mal Spaß gemacht hat, wurde es hin und her kaputtgepatcht und Sachen, wo man sich fragt, wieso ist das eigentlich immer noch ein Bug, die werden einfach nicht gefixt. Mal ganz abgesehen davon, von den immer noch total katastrophalen Menüs, die nicht funktionieren, ewigen Anzeigebugs, dass man manchmal einfach nicht mehr spawnen kann, weil die Maus nicht funktioniert. Was sind das für Fehler? Nö, lieber 20 mal die Time to Kill Patchen. Sehr sinnvoll."}, {"id": 563, "start": 6772.96, "end": 6781.96, "text": "Also für mich war der Gipfel der Dämlichkeit dann erreicht, als sie dann Firestorm rausgebracht haben. Firestorm ist für mich einer der besten Battle Royales, die bisher rauskam."}, {"id": 564, "start": 6781.96, "end": 6788.96, "text": "Habe ich von vielen, ohne Scheiß, ich habe es nie gespielt, habe ich von vielen Leuten schon gehört, aber das ist total untergegangen, Firestorm."}, {"id": 565, "start": 6788.96, "end": 6804.96, "text": "Du hattest keine Legs, die Hitrack hat gut funktioniert, das Plattensystem hat auch gut funktioniert, Warzone hat es übernommen von Firestorm. Es war ein sauguter Battle Royale, aber kein Mensch kauft sich für Battle Royale Battlefield, das macht keiner."}, {"id": 566, "start": 6804.96, "end": 6808.96, "text": "Ja, Free to Play. Das hätten sie wirklich Free to Play machen müssen, ja."}, {"id": 567, "start": 6808.96, "end": 6821.96, "text": "60 Euro ein Battle Royale Spiel. Das gibt Free to Play Alternativen, das gibt Early Access Alternativen, die günstig sind. Warum sollte irgendwer einen Vollpreis für Firestorm ausgeben?"}, {"id": 568, "start": 6821.96, "end": 6838.96, "text": "Und selbst wenn es komplett gerechtfertigt wäre, die Leute, die haben im Kopf, das ist ein Spielegenre, da gibt es hier was, was ich fast sofort ein Puppe gebe, also Spiele, die im Endeffekt nichts kosten und ok, bei PUBG, bei PUBG musst du immer noch kaufen."}, {"id": 569, "start": 6838.96, "end": 6845.96, "text": "Und das kriegen die Leute einfach nicht in den Kopf rein zu sagen, ah ja, ich kaufe mir jetzt einen Battlefield, um Battle Royale zu spielen, egal wie gut das ist."}, {"id": 570, "start": 6845.96, "end": 6853.96, "text": "Aber das hätten die Free to Play machen müssen, das wäre die einzige Chance gewesen. Ja, Warzone ist umsonst, ich weiß, deswegen funktioniert es ja auch so gut."}, {"id": 571, "start": 6853.96, "end": 6868.96, "text": "Nicht nur, dass sie den guten Battle Royale hinter einer Paywall versteckt haben, obendrauf bringt Electronic Arts, der eigene Publisher, zur quasi selben Zeit, eins der besten Free to Play Battle Royales raus, das es gibt nämlich Apex Legends."}, {"id": 572, "start": 6868.96, "end": 6882.96, "text": "Wie bescheuert kann denn Timing und Planung bitte sein? Natürlich kaufe einfach noch Battlefield, egal wie gut das Battle Royale ist, wenn ein Free to Play Battle Royale-Hype am Start ist, wie er seinesgleichen sucht. Was ist das für ein dämlicher Scheiß?"}, {"id": 573, "start": 6882.96, "end": 6889.96, "text": "Apex hat aber auch ein bisschen verkackt, wenn man sich die Viewerzahlen anguckt. Die ganzen Apex-Leute spielen jetzt Valorant."}, {"id": 574, "start": 6889.96, "end": 6900.96, "text": "Ein Free to Play Battle Royale hätte Firestorm sein können und Firestorm hat die meisten Elemente, die Warzone hat. Firestorm hätte locker diesen Hype, den Warzone jetzt hat, auch haben können."}, {"id": 575, "start": 6900.96, "end": 6903.96, "text": "Ja, Free to Play. Richtig, sehe ich genau so."}, {"id": 576, "start": 6903.96, "end": 6910.96, "text": "Das habe ich damals gesagt und ich sage es heute und sie sollten es immer noch machen. Sie sollten immer noch ein Battlefield Battle Royale rausbringen, was Free to Play ist."}, {"id": 577, "start": 6910.96, "end": 6914.96, "text": "Vier Monate Mauni, Dankeschön. Big Brain-Zap."}, {"id": 578, "start": 6914.96, "end": 6921.96, "text": "Und auch da, für mich einfach die totale Sabotage. Also das wirkt wie Sabotage. Wie kann man denn von dem eigenen Publisher..."}, {"id": 579, "start": 6921.96, "end": 6924.96, "text": "Was ist das für eine Entscheidung? Die wissen genau, wann..."}, {"id": 580, "start": 6924.96, "end": 6927.96, "text": "Das ist eine Stonks-Entscheidung."}, {"id": 581, "start": 6927.96, "end": 6933.96, "text": "...Games rauskommen. Die wissen genau, wann der Battle Royale-Modus rauskommt. Die wissen genau, wann Apex Legends rauskommt. Und was macht die?"}, {"id": 582, "start": 6933.96, "end": 6941.96, "text": "Ihr sagt sich auch, weißt du was, Titanfall haben wir so oft zwischen zwei großen Releases gepackt. Wahrscheinlich war das einfach eine Wiedergutmachung."}, {"id": 583, "start": 6941.96, "end": 6947.96, "text": "Vielleicht haben sie einfach nur gedacht, weißt du was, jetzt muss Battlefield mal jetzt an die Fratze kriegen. Aber was ist das bitte für eine Geschäftslogik?"}, {"id": 584, "start": 6947.96, "end": 6955.96, "text": "Also für mich ist das klar, Battlefield 5 ist für mich in dem Moment gestorben. Ganz ehrlich, ich habe viele Sachen habe ich noch in Anführungszeichen verteidigt oder gerechtfertigt."}, {"id": 585, "start": 6955.96, "end": 6961.96, "text": "Habe gesagt, passt auf Leute, dafür ist aber das und das. Das Spiel als solches ist auch gut. Es gibt viele Dinge, die stören mich nach wie vor nicht."}, {"id": 586, "start": 6961.96, "end": 6965.96, "text": "Dieser ganze Hate, den das Spiel abgekriegt hat, meiner Meinung nach nicht gerechtfertigt."}, {"id": 587, "start": 6965.96, "end": 6974.96, "text": "Einfach eine CTE einrichten, wo die Sachen getestet werden können, das Spiel als solches laufen lassen und fucking Content bringen, wie versprochen."}, {"id": 588, "start": 6974.96, "end": 6980.96, "text": "Aber ich wette mit euch, es lag darin, dass kaum einer was gekauft hat, weil es ja auch kaum was zu kaufen gab."}, {"id": 589, "start": 6980.96, "end": 6985.96, "text": "Wären da ein paar geile Skins bei gewesen, die man sich für ein paar Euro hätte kaufen können, hätte ich vielleicht auch reingecashed."}, {"id": 590, "start": 6985.96, "end": 6992.96, "text": "Aber das einzige, wofür man wirklich echt Geld hätte ausgeben können, waren Elite-Skins und die haben mich einfach nicht interessiert. Aber das ist doch nicht meine Schuld."}, {"id": 591, "start": 6992.96, "end": 6997.96, "text": "Das passt dann aber wieder nicht zusammen. Also wenn es ein Vollpreisspiel ist, dann erwarte ich auch keinen Ingame-Shop."}, {"id": 592, "start": 6997.96, "end": 7002.96, "text": "Aber ich weiß, das ist in der heutigen Zeit ja schon komplett utopisch, sowas anzunehmen."}, {"id": 593, "start": 7002.96, "end": 7007.96, "text": "Natürlich haben Vollpreisspiele auch Ingame. Guck dir WoW an. WoW, Alter."}, {"id": 594, "start": 7007.96, "end": 7016.96, "text": "WTF, Corona. World of Warcraft ist das schlimmste Game, was mittlerweile Monitarisierung angeht, ohne Scheiß."}, {"id": 595, "start": 7016.96, "end": 7022.96, "text": "Du musst das Game kaufen. Du musst, keine Ahnung, wahrscheinlich das neueste Addon noch kaufen."}, {"id": 596, "start": 7022.96, "end": 7029.96, "text": "Du musst einen Monatsbetrag bezahlen und du hast Ingame-Cash-Shops."}, {"id": 597, "start": 7032.96, "end": 7035.96, "text": "WTF, was ist mit Blizzard los?"}, {"id": 598, "start": 7035.96, "end": 7047.96, "text": "WoW ist wirklich alles. WoW ist Pay2Play... Nee, warte mal, was gibt es da alles?"}, {"id": 599, "start": 7047.96, "end": 7074.96, "text": "Buy2Play, Pay2Play, Pay2... Ach fragt mich nicht, alles, alles. Es hat alle Formen drinne."}, {"id": 600, "start": 7074.96, "end": 7088.96, "text": "Möglich, ich habe es nicht großartig gespielt. Ganz schön große Downtime für einen Battlefield, oder?"}, {"id": 601, "start": 7088.96, "end": 7094.96, "text": "Jetzt endlich fertig raus. Es bringt sonst nichts. Dann richtet gleich ein Testserver ein. Sofort Day 1."}, {"id": 602, "start": 7094.96, "end": 7098.96, "text": "Und dann testet ihr dort alle Änderungen, die ihr plant. Und dann hört ihr auf die Community."}, {"id": 603, "start": 7098.96, "end": 7103.96, "text": "Nee, du kannst hier im Ingame-Shop einen Levelboost kaufen. Das ist schonmal was."}, {"id": 604, "start": 7103.96, "end": 7107.96, "text": "Die arbeiten eigentlich gut mit der Community zusammen. Aber irgendwas hat sich da geändert."}, {"id": 605, "start": 7107.96, "end": 7112.96, "text": "Wahrscheinlich wurde da die Besetzung geändert oder was. Es sind andere Leute am Werk, andere Leute, die die Entscheidungen fällen."}, {"id": 606, "start": 7112.96, "end": 7118.96, "text": "Aber wer auch immer das verkackt hat, schönen Dank auch. Ich kann nur sagen, ich habe keinen Bock mehr auf Battlefield 5."}, {"id": 607, "start": 7118.96, "end": 7125.96, "text": "Ich werde jetzt nicht mehr zocken, weil ich absolut keinen Sinn darin sehe, ein Spiel zu spielen, was so verkehrt lief, was so verkackt wurde."}, {"id": 608, "start": 7125.96, "end": 7131.96, "text": "Und je mehr Leute das jetzt noch spielen, desto schlimmer wird es, weil die werden jetzt sehen, oh Mensch, die Leute kommen."}, {"id": 609, "start": 7131.96, "end": 7136.96, "text": "Also ganz ehrlich, noch eine Message an alle, die jetzt noch gerne aktiv Battlefield 5 spielen, spielt es bitte."}, {"id": 610, "start": 7136.96, "end": 7141.96, "text": "Versteht sich falsch, ist eure Entscheidung. Aber tut mir den Gefallen und gebt keinen müden Cent mehr in diesem Shop aus."}, {"id": 611, "start": 7141.96, "end": 7145.96, "text": "Denn dieses Spiel hat es nicht verdient, mehr als den Kaufpreis zu bekommen."}, {"id": 612, "start": 7145.96, "end": 7151.96, "text": "Tut mir leid, ich habe auch hunderte Stunden da reingesteckt in das Spiel, habe auch hunderte Spielspaßstunden damit gehabt."}, {"id": 613, "start": 7151.96, "end": 7155.96, "text": "Ich habe den Kauf nicht bereut, aber ich bereue es auch nicht, im Shop nicht eine Mark ausgegeben zu haben."}, {"id": 614, "start": 7155.96, "end": 7158.96, "text": "Bäm. Ist ja gerade auf dir draufgefallen."}, {"id": 615, "start": 7158.96, "end": 7162.96, "text": "Wie eine heiße Kartoffel. Und das geht mir mega auf den Sender."}, {"id": 616, "start": 7162.96, "end": 7165.96, "text": "Und jetzt bin ich gespannt, was ihr davon haltet. Ballert es mir in die Kommentare."}, {"id": 617, "start": 7165.96, "end": 7170.96, "text": "Und wenn ihr wollt, lasst gerne noch eine Bewertung da. Das hilft mir natürlich ungemein und euch kostet es nur einen Klick."}, {"id": 618, "start": 7170.96, "end": 7171.96, "text": "Danke und tschüss."}, {"id": 619, "start": 7171.96, "end": 7173.96, "text": "Ja, kann ich auch vollziehen."}, {"id": 620, "start": 7173.96, "end": 7176.96, "text": "Wie gesagt, ich bin ja jemand, der das Spiel nicht wirklich gespielt."}, {"id": 621, "start": 7176.96, "end": 7180.96, "text": "Ich habe es nur so aus der Eferne alles mitbekommen. Voll für'n Arsch."}, {"id": 622, "start": 7184.96, "end": 7191.96, "text": "Der Clown Fanatiker sagt im Chat, seine Hoffnung wäre, dass dieser Lootbox Track einfach als Glücksspiel verboten wird."}, {"id": 623, "start": 7191.96, "end": 7193.96, "text": "Ist ja in immer mehr Ländern so."}, {"id": 624, "start": 7193.96, "end": 7198.96, "text": "Würde fast alle Spiele besser machen, würde auch die Langzeitmotivation steigen,"}, {"id": 625, "start": 7198.96, "end": 7201.96, "text": "weil man einfach sich etwas ergrinden muss."}, {"id": 626, "start": 7201.96, "end": 7204.96, "text": "Das Problem, was ich darin sehe,"}, {"id": 627, "start": 7204.96, "end": 7207.96, "text": "werden Lootboxen und sowas verboten werden."}, {"id": 628, "start": 7207.96, "end": 7215.96, "text": "Also ich finde das erstmal gar keine schlechte Idee, solche extreme Glücksspiel-Mechaniken zu verbieten."}, {"id": 629, "start": 7215.96, "end": 7218.96, "text": "Aber das wird nicht dazu führen, dass das verschwindet."}, {"id": 630, "start": 7218.96, "end": 7223.96, "text": "Die werden einfach die Sachen geschickt um Schiffen."}, {"id": 631, "start": 7223.96, "end": 7225.96, "text": "Habt ihr das mitbekommen?"}, {"id": 632, "start": 7225.96, "end": 7229.96, "text": "Haben wir das in Frankreich und CSGO mit dem Scanner?"}, {"id": 633, "start": 7229.96, "end": 7232.96, "text": "Da siehst du mal, wie es laufen kann."}, {"id": 634, "start": 7234.96, "end": 7237.96, "text": "Also ich glaube, das war in Frankreich."}, {"id": 635, "start": 7237.96, "end": 7242.96, "text": "Und ich versuche das mal so wiederzugeben, so gut ich das aus dem Kopf wiedergeben kann."}, {"id": 636, "start": 7242.96, "end": 7250.96, "text": "In Frankreich haben sie verboten, dass du Lootboxen Zufallsinhalte, also dass du nicht weißt, was in der Lootbox drinne ist."}, {"id": 637, "start": 7250.96, "end": 7259.96, "text": "Also sprich, dass es insofern halt zufällig ist, dass du halt nicht weißt, bevor du Geld ausgibst, was du bekommst."}, {"id": 638, "start": 7259.96, "end": 7265.96, "text": "Also was haben sie gemacht bei CSGO in Frankreich?"}, {"id": 639, "start": 7265.96, "end": 7273.96, "text": "Du musstest dir einen Scanner kaufen und mit diesem Scanner konntest du quasi Lootboxen vorher scannen"}, {"id": 640, "start": 7273.96, "end": 7278.96, "text": "und du wusstest schon, was drinne ist, bevor du dafür Geld ausgibst."}, {"id": 641, "start": 7278.96, "end": 7280.96, "text": "Die Sache ist nur die."}, {"id": 642, "start": 7280.96, "end": 7289.96, "text": "Und warum es schlimmer ist als die ursprüngliche Variante, du kannst die Lootbox nicht verwerfen."}, {"id": 643, "start": 7289.96, "end": 7298.96, "text": "Also du kannst nicht sagen, ich habe jetzt diese Box gescannt, der Inhalt gefällt mir nicht, ich mache die nächste Box."}, {"id": 644, "start": 7298.96, "end": 7304.96, "text": "Das geht nicht. Du musst die Box öffnen, dass du weitermachen kannst."}, {"id": 645, "start": 7304.96, "end": 7308.96, "text": "Also im Prinzip ist es eigentlich überhaupt kein Unterschied."}, {"id": 646, "start": 7308.96, "end": 7316.96, "text": "Nur, dass sie sich jetzt rausreden können, also vom Gesetz her sagt, wir dürfen keine zufälligen Inhalte anbieten"}, {"id": 647, "start": 7316.96, "end": 7320.96, "text": "und wir bieten jetzt keine zufälligen Inhalte an, aber trotzdem kannst du die nicht mehr kaufen."}, {"id": 648, "start": 7320.96, "end": 7326.96, "text": "Also eigentlich noch größerer Scam."}, {"id": 649, "start": 7326.96, "end": 7330.96, "text": "Nur mit dem Zusatz, du musst einen Scanner kaufen."}, {"id": 650, "start": 7330.96, "end": 7336.96, "text": "Na gut, den Scanner, warum es den Scanner überhaupt zu kaufen gibt ist, dass du dir keine neuen Accounts erstellst."}, {"id": 651, "start": 7336.96, "end": 7341.96, "text": "Dass es sich nicht lohnt neue Accounts erstellen, weil du musst ja Geld ausgeben."}, {"id": 652, "start": 7341.96, "end": 7344.96, "text": "Da war der richtige Stonksmann am Start."}, {"id": 653, "start": 7344.96, "end": 7350.96, "text": "Das ist richtig gut eigentlich."}, {"id": 654, "start": 7350.96, "end": 7356.96, "text": "Da war der Gaben Pöks persönlich wahrscheinlich am Start."}, {"id": 655, "start": 7356.96, "end": 7363.96, "text": "Als ich dachte, aha, jetzt lasst mal die Franzosen noch ein bisschen mehr scammen."}, {"id": 656, "start": 7363.96, "end": 7371.96, "text": "Also, dann sieht man, dass das reine Verbieten von Nutboxen überhaupt nichts bringt."}, {"id": 657, "start": 7371.96, "end": 7382.96, "text": "Das ist schon high IQ, das ist massive IQ."}, {"id": 658, "start": 7382.96, "end": 7393.96, "text": "What Battlefield 6 needs"}, {"id": 659, "start": 7393.96, "end": 7396.96, "text": "Wir haben schon so viele Battlefield Videos angeguckt."}, {"id": 660, "start": 7396.96, "end": 7401.96, "text": "Ich habe noch ein paar andere Battlefield Videos, die wir gucken könnten. Passt ja gerade thematisch dazu."}, {"id": 661, "start": 7401.96, "end": 7407.96, "text": "Wir können uns einmal das neue von Levelcap angucken, was er der Meinung ist, was Battlefield 6 braucht."}, {"id": 662, "start": 7407.96, "end": 7409.96, "text": "Da bin ich sogar mal gespannt, was er sagt."}, {"id": 663, "start": 7409.96, "end": 7416.96, "text": "Wir hätten noch ein Top Place oder wir scheißen erstmal auf Battlefield und gucken was anderes an."}, {"id": 664, "start": 7416.96, "end": 7420.96, "text": "Wenn als nächstes Bad Company 3 kommen sollte, mache ich mir Sorgen, dass es die verkacken."}, {"id": 665, "start": 7420.96, "end": 7423.96, "text": "MRP67 sehe ich genauso."}, {"id": 666, "start": 7423.96, "end": 7429.96, "text": "Ich glaube erstens mittlerweile auch nicht mehr dran, dass Bad Company 3 kommt."}, {"id": 667, "start": 7429.96, "end": 7440.96, "text": "Und ich denke auch, wenn sie es rausbringen sollten, dann ist es verkackt, dann werden sie es verkacken."}, {"id": 668, "start": 7440.96, "end": 7447.96, "text": "Hat eigentlich Wodafone geantwortet mittlerweile."}, {"id": 669, "start": 7447.96, "end": 7469.96, "text": "Schaut mal, da kommt der Chat."}, {"id": 670, "start": 7469.96, "end": 7471.96, "text": "Der Chat schlägt auch auf Twitter zu."}, {"id": 671, "start": 7471.96, "end": 7485.96, "text": "Ich sehe es schon."}, {"id": 672, "start": 7485.96, "end": 7486.96, "text": "Ups."}, {"id": 673, "start": 7486.96, "end": 7497.96, "text": "Ok."}, {"id": 674, "start": 7497.96, "end": 7501.96, "text": "Ja willkommen im Club."}, {"id": 675, "start": 7501.96, "end": 7505.96, "text": "Die Woder von Hackermans sind am Start."}, {"id": 676, "start": 7505.96, "end": 7510.96, "text": "Aber wahrscheinlich kriege ich jetzt wieder als Antwort bitte nochmal den Router neu starten."}, {"id": 677, "start": 7510.96, "end": 7513.96, "text": "Ok, also was haben wir als nächstes? Was können wir sonst noch so angucken?"}, {"id": 678, "start": 7513.96, "end": 7515.96, "text": "Windows 98 PC."}, {"id": 679, "start": 7515.96, "end": 7519.96, "text": "Battlefield. Gucken wir vielleicht zum Schluss noch ein bisschen Battlefield."}, {"id": 680, "start": 7519.96, "end": 7523.96, "text": "Was Festplatten Backup auf VHS?"}, {"id": 681, "start": 7523.96, "end": 7527.96, "text": "Was ist mit AOL passiert?"}, {"id": 682, "start": 7527.96, "end": 7537.96, "text": "Warum habe ich ein Akkuschrauber Video auf?"}, {"id": 683, "start": 7537.96, "end": 7545.96, "text": "Ich glaube ich weiß warum ich ein Akkuschrauber Video auf habe, weil ich den Vorgänger Akkuschrauber habe."}, {"id": 684, "start": 7545.96, "end": 7550.96, "text": "Warte mal."}, {"id": 685, "start": 7550.96, "end": 7560.96, "text": "Genau ich habe mir das Video gebookt, weil ich den Vorgänger habe, weil ich wissen wollte, ob es sich lohnt das abzukraden."}, {"id": 686, "start": 7560.96, "end": 7565.96, "text": "Aber lohnt sich wahrscheinlich nicht denke ich mal."}, {"id": 687, "start": 7565.96, "end": 7570.96, "text": "Den habe ich mir vor einer Weile mal gekauft. Das ist ja mein aktueller Akkuschrauber."}, {"id": 688, "start": 7570.96, "end": 7575.96, "text": "Und jetzt gibt es ja anscheinend den da. Was ist eigentlich preislich der Unterschied?"}, {"id": 689, "start": 7575.96, "end": 7580.96, "text": "115 Euro."}, {"id": 690, "start": 7580.96, "end": 7585.96, "text": "Ok, das ist der ohne Bohrer."}, {"id": 691, "start": 7585.96, "end": 7588.96, "text": "135 kostet 157 Euro."}, {"id": 692, "start": 7588.96, "end": 7591.96, "text": "Ja, also da würde ich mir wahrscheinlich jetzt den kaufen, wenn ich mir jetzt neu kaufe."}, {"id": 693, "start": 7591.96, "end": 7596.96, "text": "Aber lohnt sich ja nicht. Warum sollte ich das jetzt nochmal neu kaufen?"}, {"id": 694, "start": 7596.96, "end": 7601.96, "text": "Mich interessiert ja mal was da rausgekommen ist jetzt."}, {"id": 695, "start": 7601.96, "end": 7608.96, "text": "Niemals beim Akkuschrauber. Hä? Was meinste Churok?"}, {"id": 696, "start": 7608.96, "end": 7615.96, "text": "Twitch Zuschauer schreibt, ich verstehe nicht warum Wodafone so ein Dreck ist. Jeder der dort ist beschwert sich und läuft schon lange so."}, {"id": 697, "start": 7615.96, "end": 7626.96, "text": "Anscheinend gibt es noch genug Geld."}, {"id": 698, "start": 7626.96, "end": 7631.96, "text": "Der neue Akkuschrauber hat jetzt Lootboxen für Bits."}, {"id": 699, "start": 7631.96, "end": 7634.96, "text": "Das wärs doch mal."}, {"id": 700, "start": 7634.96, "end": 7639.96, "text": "Das wärs doch mal."}, {"id": 701, "start": 7639.96, "end": 7644.96, "text": "Es ist ein Akkuschrauber, wenn der alte noch geht lohnt sich eigentlich nie ein Upgrade. Denke ich auch."}, {"id": 702, "start": 7644.96, "end": 7648.96, "text": "Ich will mal gucken was rauskommt am Ende. Was er sagt."}, {"id": 703, "start": 7648.96, "end": 7658.96, "text": "Ich kenne die Videos von ihm. Der erzählt erst mal eine halbe Stunde was. Das ist ziemlich uninteressant."}, {"id": 704, "start": 7658.96, "end": 7661.96, "text": "Nur die erste Hälfte meistens."}, {"id": 705, "start": 7661.96, "end": 7666.96, "text": "Ich will einfach nur mal die Tests sehen. Ok. Längenvergleich."}, {"id": 706, "start": 7666.96, "end": 7668.96, "text": "Längenvergleich."}, {"id": 707, "start": 7668.96, "end": 7671.96, "text": "Alter Akkuschrauber, neuer Akkuschrauber."}, {"id": 708, "start": 7671.96, "end": 7673.96, "text": "Aha."}, {"id": 709, "start": 7673.96, "end": 7677.96, "text": "Das ist wahrscheinlich der neue."}, {"id": 710, "start": 7677.96, "end": 7679.96, "text": "Das ist der alte. Ne. Doch."}, {"id": 711, "start": 7679.96, "end": 7682.96, "text": "Das ist der alte, das ist der neu. Aber das ist einer mit Bohrfunktion."}, {"id": 712, "start": 7682.96, "end": 7685.96, "text": "Kann man nicht so wirklich. Wenn man das hier wegnimmt, dann ja."}, {"id": 713, "start": 7685.96, "end": 7690.96, "text": "Größenunterschied ist nicht. Der wiegt die Dinge am Anfang immer. Zeige mal."}, {"id": 714, "start": 7690.96, "end": 7696.96, "text": "Wiegt er die? Wiegt er die auch? Wiegen? Waage? Wo ist die Waage?"}, {"id": 715, "start": 7696.96, "end": 7703.96, "text": "Ok. Unterschied. Hat ein bisschen mehr Power. Dreht sich ein bisschen schneller."}, {"id": 716, "start": 7703.96, "end": 7706.96, "text": "Ist ein bisschen kürzer."}, {"id": 717, "start": 7706.96, "end": 7708.96, "text": "Ah hier. Ok. Unterschied."}, {"id": 718, "start": 7708.96, "end": 7711.96, "text": "Also der wiegt ungefähr einen Kilo, den ich jetzt habe."}, {"id": 719, "start": 7711.96, "end": 7715.96, "text": "Wir haben hier nur rund 900 Gramm. Ja, nur 900 Gramm."}, {"id": 720, "start": 7715.96, "end": 7717.96, "text": "Das ist doch echt Wahnsinn."}, {"id": 721, "start": 7717.96, "end": 7719.96, "text": "Jetzt schauen wir uns mal die etwas ältere Generation an."}, {"id": 722, "start": 7719.96, "end": 7722.96, "text": "Hier zwar mit Schlagwerk, aber trotzdem."}, {"id": 723, "start": 7722.96, "end": 7726.96, "text": "Ja, das merkt man ein bisschen, aber großartig. Na ja."}, {"id": 724, "start": 7726.96, "end": 7730.96, "text": "Ok. Ich will die Tests. Ich will die Tests sehen. Tests. Beste."}, {"id": 725, "start": 7730.96, "end": 7732.96, "text": "Excellent."}, {"id": 726, "start": 7732.96, "end": 7735.96, "text": "Tests. Tests muss ich mir angucken. Vom Akkuschrauber."}, {"id": 727, "start": 7735.96, "end": 7738.96, "text": "Hey. Xox. Xos. Sagt."}, {"id": 728, "start": 7738.96, "end": 7745.96, "text": "Hab letztens den Vodafone-Support angerufen, weil mir über WLAN immer wieder Verbindungsabbrüche haben."}, {"id": 729, "start": 7745.96, "end": 7748.96, "text": "Ins WLAN klappt. Über Kabel geht es auch."}, {"id": 730, "start": 7748.96, "end": 7751.96, "text": "Nur WLAN ist kaputt. Fazit des Support-Menschen."}, {"id": 731, "start": 7751.96, "end": 7754.96, "text": "Es kann nicht an der Fritzbox liegen, die wir von denen mieten."}, {"id": 732, "start": 7754.96, "end": 7761.96, "text": "Es muss daran liegen, dass 2,4 und 5 Gigahertz WLAN dasselbe SSID haben."}, {"id": 733, "start": 7761.96, "end": 7764.96, "text": "Das haben die mir auch erzählt."}, {"id": 734, "start": 7764.96, "end": 7766.96, "text": "Das haben die mir auch erzählt."}, {"id": 735, "start": 7766.96, "end": 7769.96, "text": "Genau das Gleiche haben die mir auch erzählt."}, {"id": 736, "start": 7769.96, "end": 7772.96, "text": "Nur mit dem Unterschied. Nur mit dem Unterschied."}, {"id": 737, "start": 7772.96, "end": 7777.96, "text": "Ich verwende das WLAN von der Connectbox gar nicht."}, {"id": 738, "start": 7777.96, "end": 7782.96, "text": "Ich verwende weder das WLAN von der Connectbox noch von der Fritzbox."}, {"id": 739, "start": 7782.96, "end": 7787.96, "text": "Bei mir ist eine Connectbox. Ich verwende das gar nicht von denen."}, {"id": 740, "start": 7787.96, "end": 7791.96, "text": "Das ist so die random Bullshit-Antwort von denen."}, {"id": 741, "start": 7791.96, "end": 7794.96, "text": "Kurz das Fazit. Was sagt er zum Akkuschrauber?"}, {"id": 742, "start": 7794.96, "end": 7795.96, "text": "Eiche?"}, {"id": 743, "start": 7795.96, "end": 7797.96, "text": "Oh, Eiche."}, {"id": 744, "start": 7797.96, "end": 7799.96, "text": "Eiche."}, {"id": 745, "start": 7799.96, "end": 7802.96, "text": "Und hier haben wir Fichte."}, {"id": 746, "start": 7802.96, "end": 7810.96, "text": "Excellent Slow-Motion-Bohren."}, {"id": 747, "start": 7810.96, "end": 7811.96, "text": "Ah, yes."}, {"id": 748, "start": 7811.96, "end": 7813.96, "text": "Ich gucke sowas gern."}, {"id": 749, "start": 7813.96, "end": 7818.96, "text": "Ich finde das entspannend zuzuschauen, wie Löcher in Holz gefräst werden."}, {"id": 750, "start": 7818.96, "end": 7821.96, "text": "So, jetzt nehmen wir hier den 35er."}, {"id": 751, "start": 7821.96, "end": 7824.96, "text": "Ah, jetzt der 35er. Excellent."}, {"id": 752, "start": 7824.96, "end": 7830.96, "text": "So Bohrer habe ich überhaupt nicht."}, {"id": 753, "start": 7830.96, "end": 7835.96, "text": "Scheiße, Scheiße, Scheiße, Scheiße."}, {"id": 754, "start": 7835.96, "end": 7842.96, "text": "Aber für so einen kleinen 2-Volt-Akkuschrauber ist das schon nice."}, {"id": 755, "start": 7842.96, "end": 7844.96, "text": "Jetzt geht es also ans Bohren."}, {"id": 756, "start": 7844.96, "end": 7850.96, "text": "Zeig mal, wie gebohrt wird."}, {"id": 757, "start": 7850.96, "end": 7852.96, "text": "Trotzdem möchte ich euch zeigen, wie er sich schlägt."}, {"id": 758, "start": 7852.96, "end": 7857.96, "text": "Hier einmal in Puroton und einmal sogar in Kaltzahnstein."}, {"id": 759, "start": 7857.96, "end": 7864.96, "text": "Was ist denn so eine Hauswand in der Regel?"}, {"id": 760, "start": 7864.96, "end": 7873.96, "text": "Ich habe keine Ahnung. Ich vermute mal auch, dass wir sowas hier haben in der Wand."}, {"id": 761, "start": 7873.96, "end": 7877.96, "text": "Moin, Sebaro. Ah, yes."}, {"id": 762, "start": 7877.96, "end": 7886.96, "text": "Okay, das heißt, ich könnte auch mal ein Loch damit in die Wand bohren."}, {"id": 763, "start": 7886.96, "end": 7900.96, "text": "Excellent Slow-Motion-Bohrung."}, {"id": 764, "start": 7900.96, "end": 7904.96, "text": "Das ganze hier ist ja ein Akkuschrauber und jetzt kommen wir auch endlich zum Thema."}, {"id": 765, "start": 7904.96, "end": 7907.96, "text": "Ah, guck mal da, den Vera-Bithalter. Den habe ich auch."}, {"id": 766, "start": 7907.96, "end": 7910.96, "text": "Da hier, das Teil. Excellent."}, {"id": 767, "start": 7910.96, "end": 7913.96, "text": "Excellent Teil ist das, der Vera-Bithalter."}, {"id": 768, "start": 7913.96, "end": 7917.96, "text": "Schrauben. Wir haben hier wie immer die übliche 20 cm."}, {"id": 769, "start": 7917.96, "end": 7925.96, "text": "What the fuck? Die Schraube ist so groß wie sein Kopf."}, {"id": 770, "start": 7925.96, "end": 7929.96, "text": "Ich glaube, ich habe noch nie so eine fette Schraube irgendwo reingeschraubt."}, {"id": 771, "start": 7929.96, "end": 7933.96, "text": "Die üblichen Schrauben."}, {"id": 772, "start": 7933.96, "end": 7938.96, "text": "Teilgewindeschraube und 20 cm Vollgewinde."}, {"id": 773, "start": 7938.96, "end": 7941.96, "text": "Hätte ich nicht als Heimwerker eingeschätzt."}, {"id": 774, "start": 7941.96, "end": 7948.96, "text": "Heimwerkern in Form von irgendwelchen Regalen bauen, da bin ich auch nicht so scharf drauf."}, {"id": 775, "start": 7948.96, "end": 7950.96, "text": "Da mache ich, was gemacht werden muss."}, {"id": 776, "start": 7950.96, "end": 7958.96, "text": "Aber für mein ganzes Heimautomatisierungsträuch ist es halt auch ab und zu mal erforderlich, dass man ein paar Sachen macht."}, {"id": 777, "start": 7958.96, "end": 7962.96, "text": "Schrauben für ein 12V-Gerät."}, {"id": 778, "start": 7962.96, "end": 7968.96, "text": "Excellent-Bithalter, kann ich nur empfehlen."}, {"id": 779, "start": 7968.96, "end": 7972.96, "text": "Na, geht auch gut rein."}, {"id": 780, "start": 7972.96, "end": 7976.96, "text": "Gibs ihm."}, {"id": 781, "start": 7976.96, "end": 7978.96, "text": "Oh, es geht sogar wieder raus."}, {"id": 782, "start": 7978.96, "end": 7980.96, "text": "Das heißt, der hat noch genug Power."}, {"id": 783, "start": 7980.96, "end": 7991.96, "text": "Wenn das Ding so voll am Limit ist von der Leistung, dann kriegst du meistens die Schrauben nicht wieder rausgedreht."}, {"id": 784, "start": 7991.96, "end": 7997.96, "text": "Aber da hat wohl ein bisschen Reserve."}, {"id": 785, "start": 7997.96, "end": 8005.96, "text": "Oh, jetzt kommt die fette, jetzt kommt die fette."}, {"id": 786, "start": 8005.96, "end": 8009.96, "text": "Ja, aber gerade so."}, {"id": 787, "start": 8009.96, "end": 8011.96, "text": "Und ob die wieder rausgeht?"}, {"id": 788, "start": 8011.96, "end": 8017.96, "text": "Oh, nice."}, {"id": 789, "start": 8017.96, "end": 8019.96, "text": "So, jetzt haben wir gesehen, wie er schraubt."}, {"id": 790, "start": 8019.96, "end": 8021.96, "text": "Der schraubt ordentlich."}, {"id": 791, "start": 8021.96, "end": 8023.96, "text": "Die ist immer noch ein bisschen heiß."}, {"id": 792, "start": 8023.96, "end": 8030.96, "text": "Die 20cm-Schraube, Vollgewinde, hat er ohne Probleme in das Holz reingeschraubt."}, {"id": 793, "start": 8030.96, "end": 8034.96, "text": "Ja, ich glaube, das würde meiner nicht schaffen."}, {"id": 794, "start": 8034.96, "end": 8036.96, "text": "Ich glaube, das würde meiner nicht schaffen."}, {"id": 795, "start": 8036.96, "end": 8040.96, "text": "Aber ganz ehrlich, ich schraube solche Schrauben auch nicht rein."}, {"id": 796, "start": 8040.96, "end": 8042.96, "text": "Reicht schon."}, {"id": 797, "start": 8042.96, "end": 8046.96, "text": "Kommt noch im Test?"}, {"id": 798, "start": 8046.96, "end": 8048.96, "text": "Okay, nice."}, {"id": 799, "start": 8048.96, "end": 8050.96, "text": "Quanta Costa, 150 Euro."}, {"id": 800, "start": 8050.96, "end": 8058.96, "text": "Der alte, den alten kriegst du für 115 gerade."}, {"id": 801, "start": 8058.96, "end": 8060.96, "text": "Aber sag mal so, den alten kann ich wirklich empfehlen."}, {"id": 802, "start": 8060.96, "end": 8065.96, "text": "Das hier ist der alte, genau, das ist der, den ich hab."}, {"id": 803, "start": 8065.96, "end": 8069.96, "text": "Auch dieses, auch genau dieses Set hier mit diesem Standardzeug dabei."}, {"id": 804, "start": 8069.96, "end": 8071.96, "text": "Ich glaube, es gibt zwei Akkus dabei."}, {"id": 805, "start": 8071.96, "end": 8073.96, "text": "Den kann ich echt empfehlen."}, {"id": 806, "start": 8073.96, "end": 8079.96, "text": "Wenn man ab und zu mal was bohren muss, aber hauptsächlich quasi braucht,"}, {"id": 807, "start": 8079.96, "end": 8084.96, "text": "um entweder irgendwo Löcher rein, also irgendwelche 3D-Drucker oder so irgendwie Löcher reinzumachen"}, {"id": 808, "start": 8084.96, "end": 8089.96, "text": "oder mal irgendwo eine Kamera an die Wand zu machen oder hauptsächlich Sachen irgendwie schraubt."}, {"id": 809, "start": 8089.96, "end": 8092.96, "text": "Das Ding kann man echt empfehlen, das ist nicht schlecht."}, {"id": 810, "start": 8092.96, "end": 8095.96, "text": "Das Ding ist wirklich nicht übel."}, {"id": 811, "start": 8095.96, "end": 8106.96, "text": "Das, das, das kann man, kann man, kann man empfehlen."}, {"id": 812, "start": 8106.96, "end": 8113.96, "text": "Aber gucken wir mal, wo er vorhin geantwortet hat."}, {"id": 813, "start": 8113.96, "end": 8120.96, "text": "Ah, yes, nein."}, {"id": 814, "start": 8120.96, "end": 8124.96, "text": "Hehehehe, ja, es kann schon sein."}, {"id": 815, "start": 8124.96, "end": 8128.96, "text": "So, ähm, Xeroxino, neun Monate schon."}, {"id": 816, "start": 8128.96, "end": 8130.96, "text": "Ja, anscheinend, aber dankeschön."}, {"id": 817, "start": 8130.96, "end": 8136.96, "text": "Huge subscription."}, {"id": 818, "start": 8136.96, "end": 8138.96, "text": "Dankeschön, nice."}, {"id": 819, "start": 8138.96, "end": 8141.96, "text": "Gut, jetzt haben wir uns sogar nochmal ein Akkuschrauber-Video angeguckt."}, {"id": 820, "start": 8141.96, "end": 8144.96, "text": "Excellent, excellent, excellent."}, {"id": 821, "start": 8144.96, "end": 8148.96, "text": "Building a better Windows 98 PC."}, {"id": 822, "start": 8148.96, "end": 8153.96, "text": "Leute, ich brauche ein bisschen, ein bisschen, ein bisschen, äh, Computer-Nostalgie-Zeug."}, {"id": 823, "start": 8153.96, "end": 8155.96, "text": "Das müssen wir uns jetzt angucken."}, {"id": 824, "start": 8155.96, "end": 8163.96, "text": "Windows 98 Rechner."}, {"id": 825, "start": 8163.96, "end": 8166.96, "text": "Außerdem gucke ich Videos von ihm gern."}, {"id": 826, "start": 8166.96, "end": 8173.96, "text": "Wahrscheinlich, weil er so Oldschool-Kram macht."}, {"id": 827, "start": 8173.96, "end": 8177.96, "text": "Und wir spulen ein bisschen vor, 30 Minuten ist ganz schön hart."}, {"id": 828, "start": 8177.96, "end": 8182.96, "text": "Das sieht, das sieht übelst kaputt aus, das Ding."}, {"id": 829, "start": 8182.96, "end": 8199.96, "text": "Also übelst, übelst verstaubt."}, {"id": 830, "start": 8199.96, "end": 8210.96, "text": "Ah, excellent, ja."}, {"id": 831, "start": 8210.96, "end": 8218.96, "text": "Ah, jetzt kriege ich mir die Teile gezeigt, was reinkommt."}, {"id": 832, "start": 8218.96, "end": 8220.96, "text": "Ein Bot, der checkt, ob da Vodaporn-Support geantwortet hat."}, {"id": 833, "start": 8220.96, "end": 8222.96, "text": "Ah, das ist eine gute Idee."}, {"id": 834, "start": 8222.96, "end": 8224.96, "text": "Oh, das ist richtig gut."}, {"id": 835, "start": 8224.96, "end": 8229.96, "text": "Also wir machen ein Tool, das automatisch Vodaporn-Service anfindet, wenn er Streamlinks."}, {"id": 836, "start": 8229.96, "end": 8237.96, "text": "Und eine Notification postet, wenn der Support antwortet."}, {"id": 837, "start": 8237.96, "end": 8245.96, "text": "Und, was ganz wichtig ist, was wir auch noch brauchen, automatisch das Vodaporn-Shit-Emote aufmacht."}, {"id": 838, "start": 8245.96, "end": 8253.96, "text": "Ganz exzellent, exquisit wichtig."}, {"id": 839, "start": 8253.96, "end": 8256.96, "text": "3,5."}, {"id": 840, "start": 8256.96, "end": 8258.96, "text": "Habt ihr noch sowas?"}, {"id": 841, "start": 8258.96, "end": 8266.96, "text": "Gibt es noch irgendjemand von euch, der wirklich den Diskettenlaufwerk hat, was funktioniert?"}, {"id": 842, "start": 8266.96, "end": 8282.96, "text": "Ich glaube nämlich, dass die aktuellen Gehäuse dafür gar keinen Einschub mehr haben, oder?"}, {"id": 843, "start": 8282.96, "end": 8284.96, "text": "Hier, ok."}, {"id": 844, "start": 8284.96, "end": 8291.96, "text": "Haben die dafür überhaupt noch einen Einschub?"}, {"id": 845, "start": 8291.96, "end": 8296.96, "text": "Ne, gibt nix mehr, keinen Einschub mehr."}, {"id": 846, "start": 8296.96, "end": 8298.96, "text": "Habt ihr noch die Install-Disketten für Windows 98?"}, {"id": 847, "start": 8298.96, "end": 8300.96, "text": "Oh, Poggers."}, {"id": 848, "start": 8300.96, "end": 8310.96, "text": "Ich hab noch ein Windows 98-Lizenz-Handbuch mit Sticker und Zeug drauf."}, {"id": 849, "start": 8310.96, "end": 8313.96, "text": "Ein Standard-Black-Drive."}, {"id": 850, "start": 8313.96, "end": 8317.96, "text": "Aber ich werde einen hier benutzen."}, {"id": 851, "start": 8317.96, "end": 8320.96, "text": "Nein, das ist ein CD-ROM-Drive."}, {"id": 852, "start": 8320.96, "end": 8325.96, "text": "Also, ich wollte einen DVD-ROM aus meiner Storage holen."}, {"id": 853, "start": 8325.96, "end": 8327.96, "text": "Ich weiß, dass ich ein paar habe."}, {"id": 854, "start": 8327.96, "end": 8340.96, "text": "Die Zeit, wo man so CD-Laufwerke hat, damals ging es darum, wer hatte das schnellste CD-Laufwerk."}, {"id": 855, "start": 8340.96, "end": 8347.96, "text": "Da kamen die ersten an, so nach dem Motto, ich hab einen 20-fach, ich hab einen 24-fach, ich hab einen 32-fach, ich hab einen 48-fach, ich hab einen 52-fach, ich hab einen 72-fach CD-Laufwerk."}, {"id": 856, "start": 8347.96, "end": 8349.96, "text": "Ich weiß gar nicht, was das schnellste war."}, {"id": 857, "start": 8349.96, "end": 8359.96, "text": "72, oder? Oder 52?"}, {"id": 858, "start": 8359.96, "end": 8366.96, "text": "72?"}, {"id": 859, "start": 8366.96, "end": 8368.96, "text": "Ja, 72-fach."}, {"id": 860, "start": 8368.96, "end": 8371.96, "text": "360?"}, {"id": 861, "start": 8371.96, "end": 8385.96, "text": "Also, ich glaube, das Schnellste für die Normalsterblichen war 52-fach."}, {"id": 862, "start": 8385.96, "end": 8390.96, "text": "Worauf bezieht sich die 72-Dana 72-mal schneller als einfach?"}, {"id": 863, "start": 8390.96, "end": 8397.96, "text": "Einfach ist das, womit du Audio-CDs abspielst."}, {"id": 864, "start": 8397.96, "end": 8415.96, "text": "Was kann Blu-Ray? Keine Ahnung."}, {"id": 865, "start": 8415.96, "end": 8418.96, "text": "Ich will das von innen sehen."}, {"id": 866, "start": 8418.96, "end": 8427.96, "text": "Ah, ein Noctua-Lüfter. Das ist aber nicht 1998. 1998 hatten wir die billigsten China-Lüfter."}, {"id": 867, "start": 8427.96, "end": 8443.96, "text": "Oder einen Zahl- oder, nee, später hatten wir einen Zahlmann-Lüfter."}, {"id": 868, "start": 8443.96, "end": 8455.96, "text": "Das war ein Pubst-Kühler, hatte man damals, richtig."}, {"id": 869, "start": 8455.96, "end": 8460.96, "text": "Ist das ein SD-Kartenleser, oder was soll das sein?"}, {"id": 870, "start": 8460.96, "end": 8463.96, "text": "Ihhh, was ist das für ein Ding?"}, {"id": 871, "start": 8463.96, "end": 8488.96, "text": "SD-Karten, IDE, SD-Kartenleser, what the fuck, was es alles gibt?"}, {"id": 872, "start": 8488.96, "end": 8497.96, "text": "Kompaktflash."}, {"id": 873, "start": 8497.96, "end": 8506.96, "text": "Datech gibt es heute noch. Oder ist es was Neues?"}, {"id": 874, "start": 8506.96, "end": 8511.96, "text": "Als Netzteile noch oben im Gehäuse verbaut waren, ja."}, {"id": 875, "start": 8511.96, "end": 8514.96, "text": "Ich wusste gar nicht, dass das Standard ist mittlerweile."}, {"id": 876, "start": 8514.96, "end": 8520.96, "text": "Die meisten, zwei, drei Rechner hatten das alle unten verbaut, aber ich dachte, das ist nur in etwas teureren Gehäusen."}, {"id": 877, "start": 8520.96, "end": 8541.96, "text": "Die meisten haben es noch oben."}, {"id": 878, "start": 8541.96, "end": 8553.96, "text": "So was gibt es? Moment, es gibt einen SD-Karten und Mikro-USB zu SSI-Adapter?"}, {"id": 879, "start": 8553.96, "end": 8569.96, "text": "Meine Güte."}, {"id": 880, "start": 8569.96, "end": 8576.96, "text": "Warum waren die früher oben? Ich glaube, es ist eher die Frage, warum hat man die runter gemacht?"}, {"id": 881, "start": 8576.96, "end": 8588.96, "text": "Ich glaube, die haben einfach angefangen mit Netzteil oben, bis dann irgendwann auch eine auf die Idee gekommen ist, lass sie unten reinbauen."}, {"id": 882, "start": 8588.96, "end": 8595.96, "text": "Direkt mal eine bestellen, die Technik kommt, um zu bleiben."}, {"id": 883, "start": 8595.96, "end": 8604.96, "text": "Auch gleich mal ordern."}, {"id": 884, "start": 8604.96, "end": 8608.96, "text": "Sound-Karte? Oh, exzellent, ein Sound-Plaster."}, {"id": 885, "start": 8608.96, "end": 8615.96, "text": "64 Gold, okay, die hatten so, das ist eine ESA-Karte."}, {"id": 886, "start": 8615.96, "end": 8625.96, "text": "Das ist noch Pre-PCI-Steckplätze."}, {"id": 887, "start": 8625.96, "end": 8630.96, "text": "Waren die schon immer so gelb oder sind die jetzt einfach so gelb geworden mit der Zeit?"}, {"id": 888, "start": 8630.96, "end": 8655.96, "text": "Gold Edition, das könnte tatsächlich sein."}, {"id": 889, "start": 8655.96, "end": 8660.96, "text": "Was ist das denn eigentlich für dicke grüne Kabelschläuche?"}, {"id": 890, "start": 8660.96, "end": 8670.96, "text": "Eigentlich eine richtig gute Idee für die damalige Zeit, weil damals hattest du ja keine modularen Netzteile und die Rechner, die waren alle zugehonken mit IDE und Power-Kabel."}, {"id": 891, "start": 8670.96, "end": 8685.96, "text": "Man muss aber echt mal sagen, dadurch, dass die Noctur-Lüfter so hässlich aussehen, passen die Zimt-Kabelschläuche sehr gut an."}, {"id": 892, "start": 8685.96, "end": 8700.96, "text": "Die sehen fast aus wie 1998, nur dass sie neu sind."}, {"id": 893, "start": 8700.96, "end": 8715.96, "text": "Die sehen fast aus wie 1998, nur dass sie neu sind."}, {"id": 894, "start": 8715.96, "end": 8743.96, "text": "Oh, yes, exzellent, exzellent Werbung."}, {"id": 895, "start": 8743.96, "end": 8750.96, "text": "Doch noch Noctur-Lüfter gibt es mittlerweile auch in schwarz."}, {"id": 896, "start": 8750.96, "end": 8758.96, "text": "Diese ollen Dinger. Okay, das ist ein halbwegs neues Gehäuse, aber es sieht wirklich aus wie ein Gehäuse von 1995."}, {"id": 897, "start": 8758.96, "end": 8768.96, "text": "Nur eins muss man sagen, das Gehäuse sieht deutlich weniger scharfkantig aus wie 1995 Gehäuse."}, {"id": 898, "start": 8768.96, "end": 8773.96, "text": "Die Gehäuse damals, du hast dich geschnitten an den Ecken, die waren wirklich ziemlich schlecht."}, {"id": 899, "start": 8773.96, "end": 8801.96, "text": "Die Gehäuse damals waren absoluter Bullshit."}, {"id": 900, "start": 8801.96, "end": 8815.96, "text": "Stimmt, du hast recht, und den Kram hier muss man nicht rausbrechen, sowohl da als auch da."}, {"id": 901, "start": 8815.96, "end": 8824.96, "text": "Bei vielen Gehäusen damals war es so, dass teilweise so ein Schutzding hier bei den Slots dahinter war und hier vorne an den Laufwerkschächten,"}, {"id": 902, "start": 8824.96, "end": 8828.96, "text": "dass es dort nicht zum Rausschrauben war, sondern dass man ein Stück Metall rausbrechen musste."}, {"id": 903, "start": 8828.96, "end": 8834.96, "text": "Und da hattest du das Problem, wenn du das einmal rausgebrochen hast und dann an der Stelle keine Karte mehr oder kein Laufwerk mehr haben wolltest,"}, {"id": 904, "start": 8834.96, "end": 8838.96, "text": "dann hast du da einfach ein Loch im Gehäuse gehabt."}, {"id": 905, "start": 8838.96, "end": 8845.96, "text": "Und ich habe damals dann einfach halt einen Laufwerk reingeschoben, obwohl ich sie nicht gebraucht habe, weil halt, ne?"}, {"id": 906, "start": 8845.96, "end": 8848.96, "text": "Weil ein Loch im Gehäuse doof aussieht."}, {"id": 907, "start": 8848.96, "end": 8852.96, "text": "Und die Gehäuse haben damals so unglaublich Staub angesammelt."}, {"id": 908, "start": 8852.96, "end": 8858.96, "text": "Heute hast du ja bei einem guten Gehäuse, wie beispielsweise bei so einem Fractal Design Air, wo sind die jetzt? Air 5, 6, 7,"}, {"id": 909, "start": 8858.96, "end": 8861.96, "text": "hast du vorne ja einen ordentlichen Staubfilter und sowas drin."}, {"id": 910, "start": 8861.96, "end": 8866.96, "text": "Und wenn du darauf achtest, dass mehr Luft aus dem Gehäuse rausgeht als reingeht,"}, {"id": 911, "start": 8866.96, "end": 8874.96, "text": "Schwachsinn, dass mehr Luft in das Gehäuse reingeht, wie rausgeht, dann kriegst du auch kaum Staub drinne."}, {"id": 912, "start": 8874.96, "end": 8882.96, "text": "Also musst du einfach gucken, dass immer ein bisschen Überdruck quasi im Gehäuse ist."}, {"id": 913, "start": 8889.96, "end": 8894.96, "text": "Die sind definitiv nicht von 98."}, {"id": 914, "start": 8894.96, "end": 8900.96, "text": "Ich habe keine Signature Tan und Brown, aber egal, es ist gut, diese zu haben."}, {"id": 915, "start": 8924.96, "end": 8927.96, "text": "Einfach hinten was zu kleben."}, {"id": 916, "start": 8929.96, "end": 8933.96, "text": "Das funktioniert, klar funktioniert das, sonst nicht funktionieren."}, {"id": 917, "start": 8936.96, "end": 8940.96, "text": "Leute, Überdruck, das ist jetzt vielleicht ein bisschen zu viel gesagt gewesen."}, {"id": 918, "start": 8940.96, "end": 8946.96, "text": "Einfach gucken, dass mehr Lüfter Sachen reinziehen als rauspusten."}, {"id": 919, "start": 8948.96, "end": 8951.96, "text": "Oder war es umgedreht?"}, {"id": 920, "start": 8951.96, "end": 8959.96, "text": "Dass mehr Lüfter rausziehen als reinpusten."}, {"id": 921, "start": 8959.96, "end": 8963.96, "text": "Nee, nee, nee, wenn mehr Lüfter reinziehen, dann kommt Staub rein."}, {"id": 922, "start": 8967.96, "end": 8971.96, "text": "Ach, scheiß drauf, was auch immer, wurscht."}, {"id": 923, "start": 8974.96, "end": 8977.96, "text": "Er meinte mehr Lüfter rauspusten."}, {"id": 924, "start": 8977.96, "end": 8979.96, "text": "Ach, was weiß ich."}, {"id": 925, "start": 8979.96, "end": 8984.96, "text": "Scheiß drauf, das wichtigste ist, einen Staubfilter vorne dran zu haben am Gehäuse, dort wo die Lüfter sind, die reinziehen."}, {"id": 926, "start": 8991.96, "end": 8994.96, "text": "Ich habe ohne Scheiß seit ich die Fractal Design Gehäuse habe,"}, {"id": 927, "start": 8994.96, "end": 9002.96, "text": "ich habe die letzten drei PCs nicht einmal sauber gemacht und die sind alle komplett rein innen drinne."}, {"id": 928, "start": 9002.96, "end": 9009.96, "text": "Das funktioniert."}, {"id": 929, "start": 9009.96, "end": 9014.96, "text": "Die Luftfilter sind echt gut, die Staubfilter."}, {"id": 930, "start": 9014.96, "end": 9023.96, "text": "Very convenient, the case that I'm replacing does have a slide out back portion for the motherboard,"}, {"id": 931, "start": 9023.96, "end": 9027.96, "text": "but this is a little different, that's really awesome."}, {"id": 932, "start": 9027.96, "end": 9031.96, "text": "Also so Dinge, so advanced Sachen hatten die Gehäuse damals nicht."}, {"id": 933, "start": 9031.96, "end": 9039.96, "text": "Die Gehäuse damals musstest du erstmal eine Zerrung im Rücken holen, wenn du da den Rechner zusammengebaut hast."}, {"id": 934, "start": 9039.96, "end": 9044.96, "text": "Put it together, I guess on here and then slide it on to place."}, {"id": 935, "start": 9044.96, "end": 9047.96, "text": "I like this already."}, {"id": 936, "start": 9047.96, "end": 9052.96, "text": "Let's go ahead and get everything out of this one, all the components that I want to keep anyway."}, {"id": 937, "start": 9052.96, "end": 9056.96, "text": "Put them in here and get Windows 98 going with some games."}, {"id": 938, "start": 9056.96, "end": 9059.96, "text": "Yeah, it's disassembly time."}, {"id": 939, "start": 9059.96, "end": 9068.96, "text": "Ja, und die Gehäuse damals, da hat der Herz93 recht, die hast du teilweise richtige Probleme gehabt auseinander zu kriegen."}, {"id": 940, "start": 9068.96, "end": 9078.96, "text": "Vor allem die Front vom PC, die Front vom Gehäuse, die du teilweise aufmachen musstest, wenn du neue Laufwerke einbaust."}, {"id": 941, "start": 9078.96, "end": 9083.96, "text": "Das war ein Riesenakt manchmal."}, {"id": 942, "start": 9083.96, "end": 9090.96, "text": "Welches Fractal Design hast du? Einen R4, einen R5 und einen R6 glaube?"}, {"id": 943, "start": 9090.96, "end": 9093.96, "text": "Oder was habe ich? Moment, ich sag's dir, was ich hab."}, {"id": 944, "start": 9093.96, "end": 9098.96, "text": "FPS, Selbstbaurechner, ich hab doch hier..."}, {"id": 945, "start": 9098.96, "end": 9104.96, "text": "..."}, {"id": 946, "start": 9104.96, "end": 9108.96, "text": "..."}, {"id": 947, "start": 9108.96, "end": 9111.96, "text": "Ja, das hab ich gerade."}, {"id": 948, "start": 9116.96, "end": 9119.96, "text": "Grad das R5."}, {"id": 949, "start": 9119.96, "end": 9127.96, "text": "Davor hatte ich auch schon zweimal Fractal Design, weil beste."}, {"id": 950, "start": 9132.96, "end": 9139.96, "text": "In schwarz, ja. In schwarz mit der Klappe vorne dran und einem Fenster nebendran."}, {"id": 951, "start": 9139.96, "end": 9146.96, "text": "..."}, {"id": 952, "start": 9146.96, "end": 9152.96, "text": "Oh, Zeitraffer, Zeitraffer steck so an. Was'n das? Was'n das, was da rausguckt?"}, {"id": 953, "start": 9152.96, "end": 9161.96, "text": "Ist das das Ende, das Ende von einem, was ist denn das? Das Ende von einem 5 Zoll des Kettenlaufwerk?"}, {"id": 954, "start": 9161.96, "end": 9167.96, "text": "..."}, {"id": 955, "start": 9167.96, "end": 9172.96, "text": "Ja, ne, er hat Mundgeruch, bester Name. Würde ich auch so sehen, ja."}, {"id": 956, "start": 9172.96, "end": 9175.96, "text": "Das ist das Ende von so einem 5 Zoll des Kettenlaufwerk."}, {"id": 957, "start": 9175.96, "end": 9181.96, "text": "Via Chipsets, ne, das ist genauso wie es keine Nvidia Chipsets mehr gibt."}, {"id": 958, "start": 9181.96, "end": 9187.96, "text": "Ja, diese unterschiedlich gefärbten IDE-Konnektoren, da kann ich mich auch noch dran erinnern."}, {"id": 959, "start": 9187.96, "end": 9192.96, "text": "Wo es dann hieß, ja, hier musst du die Festplatte dran machen und hier machst du das CD-Laufwerk dran."}, {"id": 960, "start": 9192.96, "end": 9198.96, "text": "Da musstest du die Sache auch nicht ordentlich jumpern, sondern es hat einfach funktioniert."}, {"id": 961, "start": 9204.96, "end": 9209.96, "text": "So, die gute alte Parallelport ist auch noch am Start. Schöne Dip-Switches noch auf dem Mainboard."}, {"id": 962, "start": 9209.96, "end": 9212.96, "text": "Vertakt einstellen."}, {"id": 963, "start": 9212.96, "end": 9218.96, "text": "Es gab ja mal eine Zeit, da hat man seine CPU übertaktet, indem man so einen Switch auf dem Mainboard geswitcht hat."}, {"id": 964, "start": 9229.96, "end": 9234.96, "text": "Und das Bios konnte man rausstopfen. Ja, stimmt, das gab es auch noch."}, {"id": 965, "start": 9234.96, "end": 9240.96, "text": "Und da sind wir wieder. Eine leichte Kasse wieder."}, {"id": 966, "start": 9240.96, "end": 9244.96, "text": "Naja, meistens lassen wir sie da rein, denn ich weiß nicht, was ich mit diesem machen werde."}, {"id": 967, "start": 9244.96, "end": 9264.96, "text": "Irgendwas, irgendwann. Ja."}, {"id": 968, "start": 9274.96, "end": 9282.96, "text": "Was? Das ist ein AGP, oder? Das ist ein AGP-Slot. Sehe ich das richtig?"}, {"id": 969, "start": 9282.96, "end": 9291.96, "text": "Also, was ist denn das da oben?"}, {"id": 970, "start": 9291.96, "end": 9296.96, "text": "Also, das ist ein AGP. Das ist PCI. Was ist denn das da oben?"}, {"id": 971, "start": 9296.96, "end": 9306.96, "text": "Ein umgedrehter PCI? Einen falsch rum halblängen PCI?"}, {"id": 972, "start": 9306.96, "end": 9312.96, "text": "Ist das für eine interne PCI-Karte, die man nicht rausführen will, oder was?"}, {"id": 973, "start": 9312.96, "end": 9317.96, "text": "Ich habe keine Ahnung, was das ist."}, {"id": 974, "start": 9317.96, "end": 9322.96, "text": "Kein Plan."}, {"id": 975, "start": 9322.96, "end": 9328.96, "text": "Der erste, was heute standard ist, glaube ich nicht. Ich glaube nicht, dass es ein PCI-Express ist."}, {"id": 976, "start": 9328.96, "end": 9337.96, "text": "Es sieht aus wie ein PCI-Express, aber PCI-Express auf einem Board mit einem ESA-Anschluss, sowas gibt es nicht."}, {"id": 977, "start": 9337.96, "end": 9348.96, "text": "Ein PCI-Express plus ein ESA-Port, das sind 20 Jahre dazwischen, das glaube ich nicht."}, {"id": 978, "start": 9348.96, "end": 9353.96, "text": "Ich gebe dir aber recht, dass es aussieht wie PCI-Express."}, {"id": 979, "start": 9353.96, "end": 9379.96, "text": "Aber das könnte ein PCI sein. Einfach einen kurzen PCI falsch rum, oder was auch immer."}, {"id": 980, "start": 9379.96, "end": 9384.96, "text": "Exzellent, jetzt passt es."}, {"id": 981, "start": 9384.96, "end": 9392.96, "text": "Was hat er denn für einen Schraubendreher? Was ist denn das?"}, {"id": 982, "start": 9392.96, "end": 9396.96, "text": "Ah, erkennt man nicht."}, {"id": 983, "start": 9396.96, "end": 9408.96, "text": "Oh, eine Voodoo 3. Poggers."}, {"id": 984, "start": 9408.96, "end": 9428.96, "text": "Wenn man sich überlegt, der ganze Shit ist heute einfach alles on Board, bis auf die Grafikkarte."}, {"id": 985, "start": 9428.96, "end": 9439.96, "text": "Kein Wunder, dass die Boards heute alle nur noch so kurz sind hier. Der ganze Kram ist ja alles on Board."}, {"id": 986, "start": 9439.96, "end": 9448.96, "text": "Aber ich weiß nicht, wie es euch da geht. Ich will das nicht wieder so haben."}, {"id": 987, "start": 9448.96, "end": 9453.96, "text": "Ich finde das besser, wie es heute ist. Ich will das nie wieder so haben."}, {"id": 988, "start": 9453.96, "end": 9459.96, "text": "Ich verspüre, wenn ich so was in einem Video sehe und so einen Rechner mit vielen Steckkarten drin sehe,"}, {"id": 989, "start": 9459.96, "end": 9466.96, "text": "ich spüre eine gewisse Begeisterung, innerlich, wenn ich so was sehe."}, {"id": 990, "start": 9466.96, "end": 9474.96, "text": "Ich will das auf keinen Fall mehr so haben. Das ist deutlich angenehmer, wie das heute so ist."}, {"id": 991, "start": 9474.96, "end": 9486.96, "text": "Nice, that is an awesome setup. We don't even have it installed in the case yet."}, {"id": 992, "start": 9486.96, "end": 9506.96, "text": "Big Brain Einführung."}, {"id": 993, "start": 9506.96, "end": 9517.96, "text": "Es passt alles. Das glaube ich ihm. Es ist eigentlich komplett sinnlos, sich so einen Rechner zu bauen, fällt mir gerade mal ein. Wozu?"}, {"id": 994, "start": 9517.96, "end": 9526.96, "text": "Aber es geht."}, {"id": 995, "start": 9526.96, "end": 9537.96, "text": "PC-Speaker muss sein. PC-Speaker muss sein. Ohne PC-Speaker geht das gar nicht."}, {"id": 996, "start": 9537.96, "end": 9542.96, "text": "Wobei PC-Speaker kann man schlecht da machen."}, {"id": 997, "start": 9542.96, "end": 9557.96, "text": "So viel Platz in dem Gehäuse, das ist nicht normal für die damalige Zeit. Normalerweise waren die Gehäuse vollgestopft mit irgendwelchen Kabel noch."}, {"id": 998, "start": 9557.96, "end": 9575.96, "text": "Let's get them installed. This is such a cool case. This is not sponsored. I really like this. Listen to this. Was gibt das? Gehäuse ASMR."}, {"id": 999, "start": 9575.96, "end": 9591.96, "text": "So I think I'm going to put this here. The screw goes right here. Okay, well, I guess that's what this little contraption is for."}, {"id": 1000, "start": 9591.96, "end": 9609.96, "text": "Das war damals auch gang und gäbe, dass man die ganzen Cages rausschrauben musste. Und teilweise richtig ätzend, wenn du was ändern wolltest und erstmal alles andere abschöpseln musstest, dass du das Case rausschrauben kannst."}, {"id": 1001, "start": 9609.96, "end": 9632.96, "text": "Ach, wird schon halten. Das wird schon halten. Also ja, komm das hält schon ab."}, {"id": 1002, "start": 9632.96, "end": 9644.96, "text": "Excellent. Excellent Montage-Skills."}, {"id": 1003, "start": 9644.96, "end": 9664.96, "text": "Was ist das? Das Kettenlaufwerk? Guck mal, damals konntest du theoretisch, wenn du wolltest, sogar noch selbst Teile auslöten."}, {"id": 1004, "start": 9664.96, "end": 9674.96, "text": "Ich hab keinerlei persönlichen Bezug so richtig zu 5 Zoll Kettenlaufwerken. Das war ein ganz kurzes, ganz kurz so vor meiner Zeit."}, {"id": 1005, "start": 9674.96, "end": 9703.96, "text": "Stream laggt, Leute. Stream laggt."}, {"id": 1006, "start": 9704.96, "end": 9719.96, "text": "Okay."}, {"id": 1007, "start": 9719.96, "end": 9734.96, "text": "Okay."}, {"id": 1008, "start": 9734.96, "end": 9749.96, "text": "Okay."}, {"id": 1009, "start": 9749.96, "end": 9764.96, "text": "Okay."}, {"id": 1010, "start": 9764.96, "end": 9779.96, "text": "Okay."}, {"id": 1011, "start": 9779.96, "end": 9807.96, "text": "Okay."}, {"id": 1012, "start": 9807.96, "end": 9822.96, "text": "Okay."}, {"id": 1013, "start": 9822.96, "end": 9847.96, "text": "Okay."}, {"id": 1014, "start": 9847.96, "end": 9854.96, "text": "Yes. Excellent."}, {"id": 1015, "start": 9877.96, "end": 9905.96, "text": "Okay."}, {"id": 1016, "start": 9905.96, "end": 9915.96, "text": "So, jetzt sollte es wieder funktionieren, ne?"}, {"id": 1017, "start": 9915.96, "end": 9931.96, "text": "Das ist so lächerlich in Deutschland. Ey, das ist der Wahnsinn."}, {"id": 1018, "start": 9931.96, "end": 9953.96, "text": "Ne, das hat sich jetzt wieder eingekriegt. Die Chat-Kommentare sind live, wenn ihr refresht wieder. Das passt."}, {"id": 1019, "start": 9953.96, "end": 9962.96, "text": "Excellent."}, {"id": 1020, "start": 9962.96, "end": 9990.96, "text": "Also, wie gesagt, ich werde jetzt jeden Ausfall an Vodafone twitteren."}, {"id": 1021, "start": 9990.96, "end": 9998.96, "text": "Oh, oh, oh, Leute. Monkeys. Es hat geleckt. Ich hab's gesehen."}, {"id": 1022, "start": 9998.96, "end": 10018.96, "text": "Die plotten mich irgendwann, dann kriegen die auch irgendwann kein Geld mehr."}, {"id": 1023, "start": 10018.96, "end": 10030.96, "text": "Okay, gucken wir weiter."}, {"id": 1024, "start": 10030.96, "end": 10054.96, "text": "Kündigung schon raus, ne? Ich muss ja auch erstmal, dass ich kündigen kann, also, dass ich schneller kündigen kann, muss ich auch erstmal eine Weile zeigen, dass es Probleme gibt. Wahrscheinlich muss ich doch irgendwann auch offiziell dazu auffordern, Abhilfe zu schaffen, was auch immer."}, {"id": 1025, "start": 10054.96, "end": 10067.96, "text": "Coupa-Big-Plan-Idee."}, {"id": 1026, "start": 10067.96, "end": 10085.96, "text": "Warum hat er so viele Diskettenlaufwerke? Ach ne, das ist das Compact-Flash-Ding. Also 5 Zoll Diskettenlaufwerk, 3,5 Zoll Diskettenlaufwerk und eine Compact-Flash. Was'n Ding hier?"}, {"id": 1027, "start": 10085.96, "end": 10099.96, "text": "Oh, RIP. Moment, wo will der damit überhaupt hin? Ah, SCSI-Card. Ja, da muss es da unten irgendwie falsche rum einbauen."}, {"id": 1028, "start": 10099.96, "end": 10118.96, "text": "Oder aber, was man damals auch ganz gerne gemacht hat, wenn die Kabel einfach nur so einen Zentimeter zu kurz waren, man hat die halt so weit gebogen und gezogen, dass sie teilweise so scharfkantige Ecken drin hatten, dass sie theoretisch fast schon nicht mal funktionieren konnten, aber es ging trotzdem irgendwie."}, {"id": 1029, "start": 10118.96, "end": 10146.96, "text": "Hast du jetzt eigentlich da endlich deine SSD geändert? Ja, natürlich, daran wird's liegen. Na klar hab ich die geändert."}, {"id": 1030, "start": 10146.96, "end": 10164.96, "text": "Felix sagt, muss mich bei mir zwischen 1 Gigabit Vodafone und 25 MB Telekom entscheiden. Ja, ist bei mir ähnlich, nur, dass ich theoretisch den Luxus habe, 250 MB VDSL zu bekommen. Also das wäre dann gar kein so großer Verlust."}, {"id": 1031, "start": 10164.96, "end": 10177.96, "text": "Kind of annoying having this here because I can't see what I'm doing. For now I guess I'm just gonna take this out and just dangle it over there a little bit closer. Ironic."}, {"id": 1032, "start": 10177.96, "end": 10186.96, "text": "I got this thing so I wouldn't have to dangle anything and here I am gonna be dangling things again, dang it. Yeah, whatever. Was? Was gibt das, wenn's fertig?"}, {"id": 1033, "start": 10186.96, "end": 10203.96, "text": "Excellent. Kabelogik. Hängt ein bisschen nebendran. Oh, ein Pentium 3. Das war aber für die Zeit schon sehr advanced."}, {"id": 1034, "start": 10203.96, "end": 10217.96, "text": "Und dieser Sound von den Kettenlaufwerken, wenn das Ding startet. Und immer nicht zu vergessen, und das machen die Computer teilweise heute noch, dieser Post-Beep."}, {"id": 1035, "start": 10217.96, "end": 10233.96, "text": "Erinnern euch euch noch manche an den Post-Beep, dass das Ding gebootet hat? Dann hat's gemacht, am Diskettenlaufwerk, und dann hat's irgendwann gemacht, und dann war fertig. Dann hat's gebootet."}, {"id": 1036, "start": 10233.96, "end": 10248.96, "text": "Ja, hier, da war der Post-Beep."}, {"id": 1037, "start": 10248.96, "end": 10264.96, "text": "Ja, hier, da war der Post-Beep."}, {"id": 1038, "start": 10264.96, "end": 10289.96, "text": "Ich guck mir so, ich weiß nicht, ob das wirklich aus Nostalgiegründen ist, weil es ist jetzt nicht so, dass ich sagen würde, ich will das wieder so haben."}, {"id": 1039, "start": 10289.96, "end": 10297.96, "text": "Also ich find das mit der Technik, wie das heute ist, viel, viel besser, als es damals gewesen ist. Also auch, dass alles onboard ist und dass die Gehäuse ordentlich sind und alles."}, {"id": 1040, "start": 10297.96, "end": 10311.96, "text": "Aber so gewisse, es freut mich, wenn ich ein altes Mainboard mit fünf Einsteckkarten sehe. Oder auch wenn ich ein 3,5 Zolles Kettenlaufwerk sehe. Irgendwie freut mich das so innerlich."}, {"id": 1041, "start": 10311.96, "end": 10318.96, "text": "Ich kann nicht beschreiben, woran das liegt, aber irgendwie gefällt mir das. Und ich will es auf keinen Fall wieder so haben."}, {"id": 1042, "start": 10318.96, "end": 10342.96, "text": "Ah, das ist so eine typisch schöne Windows UI, wo jeder sofort versteht, was das ist."}, {"id": 1043, "start": 10342.96, "end": 10369.96, "text": "Sehe ich das richtig, dass der Windows von der SD-Karte, von der Flash-Karte bootet, anstatt seine Festplatte einzubauen? Ist vielleicht gar nicht schlecht, ist bestimmt besser als eine Festplatte."}, {"id": 1044, "start": 10369.96, "end": 10376.96, "text": "So eine Pegel-Spiele, dafür brauch ich mir noch das 98."}, {"id": 1045, "start": 10376.96, "end": 10389.96, "text": "Insomniac Dude, gebe ich dir recht, PC-Welt ist teilweise echt, echt cringe. Und allein schon, dass das Ding Höllenmaschine heißt, ist auch ziemlich cringe."}, {"id": 1046, "start": 10389.96, "end": 10417.96, "text": "Stimmt, damals hat es noch Interrupt."}, {"id": 1047, "start": 10417.96, "end": 10423.96, "text": "Stimmt, damals hat es noch Interrupt, Adressenkonflikte und sowas mit Einschubkarten."}, {"id": 1048, "start": 10423.96, "end": 10431.96, "text": "Und soll ich einfach mal erzählen, die Linux-Community damals, weil ich flame ja da immer ganz gerne immer ein bisschen auch dagegen."}, {"id": 1049, "start": 10431.96, "end": 10435.96, "text": "Ihr wisst, dass ich mein Geld mit Linux verdiene und auch ansonsten viel unter Linux mache."}, {"id": 1050, "start": 10435.96, "end": 10451.96, "text": "Das ist nicht besonder, dass wir hier extra immer einen Linux-Fall im Laufen haben mit Zeug. Aber das ist wieder so ein typisches Beispiel gewesen, dass manchmal Sachen unsinnig lange dauern, gerade was Linux angeht und bei vielen Open-Source-Projekten."}, {"id": 1051, "start": 10451.96, "end": 10476.96, "text": "Als die angefangen haben bei, äh, unter Mac und unter Windows zu sagen, ok, manuelles Zuweisen von Interrupts und Adressen und so ist für'n Arsch, kannst du eigentlich keinem zumuten. Und langsam aber sicher angefangen haben, wo es da ein bisschen mehr Richtung USB ging, bisschen mehr Richtung Plug and Play, automatische Adressenzuweisungen und sowas ging, haben die unter Linux damals gesagt, den Scheiß braucht keiner."}, {"id": 1052, "start": 10476.96, "end": 10488.96, "text": "Man muss, man sollte, also wer Adresszuweisungen, IRQ-Geschichten nicht versteht, sollte keinen Rechner verwenden. Das wollen wir nicht in Linux haben. Das haben die ernsthaft damals erzählt, ja."}, {"id": 1053, "start": 10488.96, "end": 10514.96, "text": "Wo man halt auch wieder sieht, dass da sehr viele Pepega-Leute dabei sind. Die wollten das wirklich manuell konfigurieren müssen. Nicht die Option haben, es manuell zu konfigurieren, die wollten, dass man es manuell konfigurieren muss, weil nur das der einzig richtige Weg ist. Und so Sachen hast du heute noch, wo sie Zeug nicht gebacken bekommen."}, {"id": 1054, "start": 10518.96, "end": 10535.96, "text": "Oh, ein halbes Gigabyte RAM. Ein halbes Gigabyte RAM, das ist ja schon massive."}, {"id": 1055, "start": 10548.96, "end": 10553.96, "text": "Ah, gut, kann man mitleben."}, {"id": 1056, "start": 10553.96, "end": 10582.96, "text": "Joystick-Port, das habe ich ja schon wieder komplett verdrängt, dass damals Soundkarten-Joystick-Ports dran haben. Ich habe bis heute nicht verstanden, warum ausgerechnet die Soundkarten-IO-Ports noch dran hatten für Joystick."}, {"id": 1057, "start": 10582.96, "end": 10594.96, "text": "Michael GZ."}, {"id": 1058, "start": 10594.96, "end": 10602.96, "text": "Und, braucht kein Midi. Midi, Alter."}, {"id": 1059, "start": 10602.96, "end": 10605.96, "text": "Midi."}, {"id": 1060, "start": 10605.96, "end": 10612.96, "text": "Mehr Ahi als Midi."}, {"id": 1061, "start": 10612.96, "end": 10628.96, "text": "Oh, exzellent."}, {"id": 1062, "start": 10628.96, "end": 10653.96, "text": "Das wäre besser hier."}, {"id": 1063, "start": 10653.96, "end": 10663.96, "text": "Ich höre keinen Unterschied."}, {"id": 1064, "start": 10663.96, "end": 10668.96, "text": "Ich höre keinen Unterschied."}, {"id": 1065, "start": 10668.96, "end": 10683.96, "text": "Exzellent."}, {"id": 1066, "start": 10683.96, "end": 10689.96, "text": "Okay, ich glaube das Interessante von den Videos vorbei."}, {"id": 1067, "start": 10689.96, "end": 10692.96, "text": "Unreal Tournament."}, {"id": 1068, "start": 10692.96, "end": 10696.96, "text": "Ich will Unreal Tournament spielen."}, {"id": 1069, "start": 10696.96, "end": 10699.96, "text": "Ich glaube, dass es leht."}, {"id": 1070, "start": 10699.96, "end": 10707.96, "text": "Wenn es leht, dann stürzt es ab, oder wie ging das nochmal?"}, {"id": 1071, "start": 10707.96, "end": 10721.96, "text": "Das waren noch Zeug. Das waren Memes, bevor es Memes hieß."}, {"id": 1072, "start": 10721.96, "end": 10728.96, "text": "Nein, ich kenne ihn nicht. Exzellent Video."}, {"id": 1073, "start": 10728.96, "end": 10733.96, "text": "Ich gucke mir gerne so ein bisschen Nostalgiestells an."}, {"id": 1074, "start": 10733.96, "end": 10737.96, "text": "So, das ist mein aktueller Rechner. Den wollte ich mir sicherlich angucken."}, {"id": 1075, "start": 10737.96, "end": 10742.96, "text": "Was haben wir sonst noch zu tun? IoT, Backdoor, Kamera."}, {"id": 1076, "start": 10742.96, "end": 10745.96, "text": "Best Burger I've ever made."}, {"id": 1077, "start": 10745.96, "end": 10750.96, "text": "Leute, es ist bald Zeit fürs Mittagessen. Es ist 13.10 Uhr."}, {"id": 1078, "start": 10750.96, "end": 10756.96, "text": "Wir können uns entweder das Köpfen von der neuen Intel CPU angucken,"}, {"id": 1079, "start": 10756.96, "end": 10767.96, "text": "oder wir gucken uns den Burger an."}, {"id": 1080, "start": 10767.96, "end": 10772.96, "text": "Hekules Beats heißt er heute. Ja, ja, ja, ja."}, {"id": 1081, "start": 10772.96, "end": 10776.96, "text": "Wir gucken uns aber kein 26 Minuten Video an. Ich will einfach nur mal sehen, wie er die CPU köpft."}, {"id": 1082, "start": 10776.96, "end": 10781.96, "text": "Ah, exzellent. Hier geht es los."}, {"id": 1083, "start": 10781.96, "end": 10784.96, "text": "Ich will sehen, wie die CPU geköpft wird."}, {"id": 1084, "start": 10784.96, "end": 10788.96, "text": "Ah, jetzt da."}, {"id": 1085, "start": 10788.96, "end": 10792.96, "text": "Ah, hier zeigt das."}, {"id": 1086, "start": 10792.96, "end": 10798.96, "text": "Ich habe ja schon ein paar Mal erzählt, wie sehr ich geschwitzt habe bei dem 8700K."}, {"id": 1087, "start": 10798.96, "end": 10804.96, "text": "Alter, mit der Rasierklinge. Alter, das tut mir weh, wenn ich das sehe."}, {"id": 1088, "start": 10804.96, "end": 10808.96, "text": "Hilfe! Gleich ist die CPU rippt, ey."}, {"id": 1089, "start": 10808.96, "end": 10814.96, "text": "Morka! Es!"}, {"id": 1090, "start": 10814.96, "end": 10831.96, "text": "Ach nee, das ist der Heatspreader. Das ist okay, da kann man rumkratzen."}, {"id": 1091, "start": 10831.96, "end": 10835.96, "text": "Okay, wir kriegen gar nicht gezeigt, wie die CPU geköpft wird."}, {"id": 1092, "start": 10835.96, "end": 10839.96, "text": "Das ist GBated Video. Okay, dann ist ja langweilig."}, {"id": 1093, "start": 10839.96, "end": 10841.96, "text": "Okay, der beste Burger. Okay, der beste Burger."}, {"id": 1094, "start": 10841.96, "end": 10846.96, "text": "Alter, 22 Minuten will der Burger machen."}, {"id": 1095, "start": 10846.96, "end": 10857.96, "text": "Was ist da los?"}, {"id": 1096, "start": 10857.96, "end": 10863.96, "text": "2.0."}, {"id": 1097, "start": 10863.96, "end": 10873.96, "text": "Also ich dich."}, {"id": 1098, "start": 10873.96, "end": 10876.96, "text": "Kurze Frage, was bringt CPU Köpfen?"}, {"id": 1099, "start": 10876.96, "end": 10884.96, "text": "Naja, wenn man das so wie Intel macht und Wärmeleitpaste zwischen Heatspreader und CPU macht"}, {"id": 1100, "start": 10884.96, "end": 10891.96, "text": "und die nicht verlötet miteinander, dann hat man ziemlich schlechte Wärmeableitung von der CPU zum Heatspreader."}, {"id": 1101, "start": 10891.96, "end": 10893.96, "text": "Also Heatspreader ist der Deckel von der CPU."}, {"id": 1102, "start": 10893.96, "end": 10902.96, "text": "Also wenn du so ein CPU in der Hand hältst, das Metall, was oben drauf ist, ist der Heatspreader, ist der Deckel von diesem ganzen Case."}, {"id": 1103, "start": 10902.96, "end": 10909.96, "text": "Und Intel hat da zwischen Wärmeleitpaste geschmiert, zwischen innen der CPU an sich und dem Deckel."}, {"id": 1104, "start": 10909.96, "end": 10916.96, "text": "Und normalerweise wird das verlötet und dann ist die Wärmeübertragung wunderbar."}, {"id": 1105, "start": 10916.96, "end": 10923.96, "text": "Und wenn du das köpfst, heißt im Endeffekt, du machst den Deckel ab, machst die Wärmeleitpaste raus, die dazwischen ist"}, {"id": 1106, "start": 10923.96, "end": 10927.96, "text": "und machst irgendeine Flüssigmetallmischung oder so dazwischen, die besser die Wärme leitet."}, {"id": 1107, "start": 10927.96, "end": 10933.96, "text": "Und das bringt extrem, extrem wirklich richtig viel."}, {"id": 1108, "start": 10933.96, "end": 10946.96, "text": "Also ich hab mein 8700K geköpft, weil ich ihn übertacken wollte und wir haben es im Stream gemacht, müsste man sich raussuchen."}, {"id": 1109, "start": 10946.96, "end": 10953.96, "text": "Und der ist jetzt glaube ich 20 Grad 15 oder 20 Grad kühler, das bringt wirklich massiv viel. 20 Grad."}, {"id": 1110, "start": 10953.96, "end": 10962.96, "text": "Ja, Zeig, bester Burger. Exzellent."}, {"id": 1111, "start": 10970.96, "end": 10974.96, "text": "Hä? Mach hinne. Ich will den Burger sehen."}, {"id": 1112, "start": 10974.96, "end": 10991.96, "text": "Was ist denn was ist mit den Lose? Wo gehts denn los? Wo gehts hier los mit Burger?"}, {"id": 1113, "start": 10991.96, "end": 11005.96, "text": "Warte mal kurz."}, {"id": 1114, "start": 11005.96, "end": 11020.96, "text": "So. Ich geh mir jetzt auch was zu essen holen."}, {"id": 1115, "start": 11020.96, "end": 11035.96, "text": "Ich bin gleich wieder da."}, {"id": 1116, "start": 11050.96, "end": 11069.96, "text": "So. Ich bin wieder am Start. Ich esse jetzt was nebenbei."}, {"id": 1117, "start": 11069.96, "end": 11075.96, "text": "Was macht der denn da? Gewürzgurken schnüppeln."}, {"id": 1118, "start": 11075.96, "end": 11084.96, "text": "Also Leute, ich hab jetzt ein paar Nudeln mit Lachs drinne. Easy."}, {"id": 1119, "start": 11084.96, "end": 11089.96, "text": "Ich futter mal kurz meine Nudeln."}, {"id": 1120, "start": 11089.96, "end": 11097.96, "text": "Ah, der schmeckt richtig gut."}, {"id": 1121, "start": 11097.96, "end": 11106.96, "text": "Aber der ist ganz schön langsam oder? Ich will doch keine halbe Stunde gucken wie er seine Soße macht."}, {"id": 1122, "start": 11106.96, "end": 11117.96, "text": "Ich will den Burger sehen. Ich will den Burger sehen."}, {"id": 1123, "start": 11117.96, "end": 11122.96, "text": "Jetzt macht er das Hackfleisch noch selbst oder was?"}, {"id": 1124, "start": 11122.96, "end": 11128.96, "text": "Der macht jetzt sogar das Hackfleisch selbst. Wir gucken gleich Barbecue Pit Boys noch ne Runde hinten ran."}, {"id": 1125, "start": 11128.96, "end": 11135.96, "text": "Oh, das ist nichts für Veganer heute."}, {"id": 1126, "start": 11135.96, "end": 11144.96, "text": "Ich will den Burger sehen. Wo ist der Burger? Jetzt, jetzt wird gebrutzelt."}, {"id": 1127, "start": 11144.96, "end": 11156.96, "text": "Exzellent."}, {"id": 1128, "start": 11156.96, "end": 11184.96, "text": "Da ist ein Stück Finger mit drin."}, {"id": 1129, "start": 11184.96, "end": 11192.96, "text": "Gorgeous."}, {"id": 1130, "start": 11192.96, "end": 11197.96, "text": "Okay, der macht das schon mal richtig. Eins haben wir ja bei den Barbecue Pit Boys gelernt."}, {"id": 1131, "start": 11197.96, "end": 11207.96, "text": "Man macht alles mit seinem Messer. Also Löffel oder sonst was ist verpönt. Gabel, Löffel, man muss alles mit dem Messer machen."}, {"id": 1132, "start": 11207.96, "end": 11221.96, "text": "Mit der Machete, stimmt."}, {"id": 1133, "start": 11221.96, "end": 11238.96, "text": "Die Juicers."}, {"id": 1134, "start": 11238.96, "end": 11255.96, "text": "Also für die Barbecue Pit Boys wäre das jetzt ein bisschen wenig Fleisch. Da muss der Burger mindestens so dick sein wie das Brötchen hier unten."}, {"id": 1135, "start": 11255.96, "end": 11264.96, "text": "Das wäre für die voll fast schon vegan."}, {"id": 1136, "start": 11264.96, "end": 11274.96, "text": "Okay, okay, geht. Wir müssen noch ne Runde das Original gucken."}, {"id": 1137, "start": 11274.96, "end": 11301.96, "text": "Tequila Burger. Meinst du, dass durch die neuen Konsolen 4K, 120, 144 Hertzmonitore erschwinglicher werden? Die sind doch schon, also 4K 144. Nee, ich glaube nicht, dass das in nächster Zeit Standard wird."}, {"id": 1138, "start": 11301.96, "end": 11329.96, "text": "Nachdem ich nicht so der Alkoholtrinker bin,"}, {"id": 1139, "start": 11329.96, "end": 11344.96, "text": "ich habe gar kein Favorite Tequila. Zumindest wenn ich es machen würde, würde ich definitiv keinen Lidl Schnaps nehmen, weil das ist bei allem abartig."}, {"id": 1140, "start": 11344.96, "end": 11363.96, "text": "Also wer mal probiert hat den Unterschied zwischen einem ordentlichen Whisky und einem Lidl Whisky, da sind Welten dazwischen. Der Lidl Whisky schmeckt schon, nicht nach Chemie, aber schmeckt schon fast, wie soll man das beschreiben?"}, {"id": 1141, "start": 11363.96, "end": 11385.96, "text": "So, als möchte man es gar nicht schmecken. Und wenn man irgendwie was halbwegs ordentliches hat, dann schmeckt das relativ süß und gut eigentlich."}, {"id": 1142, "start": 11385.96, "end": 11410.96, "text": "Oh, es gibt das was fertig ist. Oh, das ist doch totaler Matsch danach."}, {"id": 1143, "start": 11410.96, "end": 11438.96, "text": "Das sind überhaupt keine eingelegten Jules."}, {"id": 1144, "start": 11438.96, "end": 11460.96, "text": "Moment, jetzt habe ich nicht zugeguckt. Warum hat er seine Hand auf dem Fleisch liegen? Einfach nur so?"}, {"id": 1145, "start": 11460.96, "end": 11474.96, "text": "Corona. Erstmal anstecken alles."}, {"id": 1146, "start": 11474.96, "end": 11491.96, "text": "Da muss alles mit dem Küchenbeil machen. So gehört sich das. Moment, was ist das? Fett? Nee. Frischkäse? Ich habe jetzt nicht zugehört. Was ist das gewesen?"}, {"id": 1147, "start": 11491.96, "end": 11505.96, "text": "Cream Cheese. Ah, so etwas Frischkäse."}, {"id": 1148, "start": 11505.96, "end": 11521.96, "text": "Die Sounds, die er immer dabei macht. Es muss klatschen."}, {"id": 1149, "start": 11521.96, "end": 11547.96, "text": "Erstmal schön rein. Die Musik im Hintergrund."}, {"id": 1150, "start": 11547.96, "end": 11573.96, "text": "Denk dran. Indirect, Opposite to Hot Coal."}, {"id": 1151, "start": 11573.96, "end": 11587.96, "text": "Was ist das für eine änglische Pumpe, Alter?"}, {"id": 1152, "start": 11587.96, "end": 11613.96, "text": "Mal gucken, was am Ende rauskommt."}, {"id": 1153, "start": 11613.96, "end": 11619.96, "text": "Der macht alles mit seinem Beil."}, {"id": 1154, "start": 11619.96, "end": 11626.96, "text": "Na klar sind das Amis. Mehr Ami kann man nicht sein wie der Channel."}, {"id": 1155, "start": 11626.96, "end": 11634.96, "text": "Das ist Kokona pur."}, {"id": 1156, "start": 11634.96, "end": 11648.96, "text": "Sie muss liegt dabei."}, {"id": 1157, "start": 11648.96, "end": 11672.96, "text": "Was? Ich habe nicht zugehört. Ich habe gegessen. Er hat einen Löffel genommen? Ernsthaft?"}, {"id": 1158, "start": 11672.96, "end": 11679.96, "text": "Also Löffel ist nicht erlaubt."}, {"id": 1159, "start": 11679.96, "end": 11696.96, "text": "Dieses eingelegte Chipszeug ist so eklig."}, {"id": 1160, "start": 11696.96, "end": 11703.96, "text": "Ich habe gedacht, die Dinger werden noch mal frittiert oder irgendwas. Aber die bleiben so lapperig auf dem Burger drauf."}, {"id": 1161, "start": 11703.96, "end": 11727.96, "text": "Das ist nichts für mich. Die meisten Sachen finde ich ja geil, würde ich auch mal gerne machen. Aber das glaube ich nichts für mich."}, {"id": 1162, "start": 11727.96, "end": 11737.96, "text": "Ich würde das Ding sofort futtern ohne die Chips."}, {"id": 1163, "start": 11737.96, "end": 11764.96, "text": "Nächstes. Was haben wir sonst noch? Ich brauche jetzt irgendwas."}, {"id": 1164, "start": 11764.96, "end": 11771.96, "text": "Ich versuche eigentlich schon mal was zu essen."}, {"id": 1165, "start": 11771.96, "end": 11792.96, "text": "Was ist das? Was ist das? Mayonnaise?"}, {"id": 1166, "start": 11792.96, "end": 11819.96, "text": "Ohne hat man ein richtiges Messer. Warum macht er das nicht mit seiner Machete?"}, {"id": 1167, "start": 11819.96, "end": 11840.96, "text": "Ich habe es gesehen. Und bei meinem Glück bin ich derjenige, der das Ding mit Schale kriegt."}, {"id": 1168, "start": 11840.96, "end": 11850.96, "text": "Ich habe es gesehen. Und bei meinem Glück bin ich derjenige, der das Ding mit Schale kriegt."}, {"id": 1169, "start": 11870.96, "end": 11890.96, "text": "Ich habe es gesehen. Und bei meinem Glück bin ich derjenige, der das Ding mit Schale kriegt."}, {"id": 1170, "start": 11890.96, "end": 11910.96, "text": "Ich habe es gesehen. Und bei meinem Glück bin ich derjenige, der das Ding mit Schale kriegt."}, {"id": 1171, "start": 11910.96, "end": 11930.96, "text": "Brotzel, Brotzel, Brotzel."}, {"id": 1172, "start": 11940.96, "end": 11960.96, "text": "Ich finde, da ist ein bisschen wenig Fett. Da müsste noch ein bisschen mehr Fett hinkommen."}, {"id": 1173, "start": 11960.96, "end": 11980.96, "text": "Ja, so muss man das machen. Schön mit der Machete das Brotspielen. Es sieht wirklich ein bisschen aus wie KFC."}, {"id": 1174, "start": 11980.96, "end": 12002.96, "text": "Wir könnten es viel schneller machen, aber wir mögen es so machen. Schau dir das an."}, {"id": 1175, "start": 12002.96, "end": 12010.96, "text": "Wir machen das."}, {"id": 1176, "start": 12010.96, "end": 12016.96, "text": "Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst."}, {"id": 1177, "start": 12016.96, "end": 12032.96, "text": "Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst."}, {"id": 1178, "start": 12032.96, "end": 12046.96, "text": "Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst."}, {"id": 1179, "start": 12046.96, "end": 12070.96, "text": "Was ist das? Schmeckt wirklich gut."}, {"id": 1180, "start": 12070.96, "end": 12090.96, "text": "Du kannst es so machen, wie du willst. Du kannst es so machen, wie du willst."}, {"id": 1181, "start": 12090.96, "end": 12104.96, "text": "Ach nee, Moment, ich muss ja heute gucken."}, {"id": 1182, "start": 12104.96, "end": 12120.96, "text": "Das gucken wir jetzt nicht. Die denken, wir scheißen da drauf."}, {"id": 1183, "start": 12120.96, "end": 12134.96, "text": "Meinst du, der Support ist 24? Wir können das ja mal kurz überprüfen. Ja, vor 43 Minuten."}, {"id": 1184, "start": 12134.96, "end": 12148.96, "text": "Die sind am Start. Die haben wahrscheinlich keinen Bock mehr auf meine Gespamme, aber ich werde die jeden Tag voll spammen."}, {"id": 1185, "start": 12148.96, "end": 12156.96, "text": "Und umso mehr Leute mitmachen, das ganze hier noch zu liken, retweeten und vor allem noch sinnloses Zeugs drauf zu posten."}, {"id": 1186, "start": 12156.96, "end": 12170.96, "text": "Umso besser. Umso besser. Dann kriegen die das nämlich mit, dass das auch viele Leute mitkriegen, dass das scheiße läuft bei ihnen."}, {"id": 1187, "start": 12170.96, "end": 12180.96, "text": "Das letzte, was sie geschrieben haben, ist, ich soll das Modem neu starten. War wieder."}, {"id": 1188, "start": 12180.96, "end": 12194.96, "text": "Ich will nicht wissen, wie oft ich den letzten Tag über ein Modem neu gestartet habe."}, {"id": 1189, "start": 12194.96, "end": 12206.96, "text": "Ach Leute, ich glaube wir machen jetzt Schluss. Wie wäre es mit einem Python-Bot mit Twitter, Api?"}, {"id": 1190, "start": 12206.96, "end": 12212.96, "text": "Ja, sowas in der Richtung. Sowas habe ich mir schon überlegt."}, {"id": 1191, "start": 12212.96, "end": 12224.96, "text": "Ich glaube wir machen jetzt Schluss, Leute. Ich muss nämlich mal übelst dringend aufs Klo und ich muss dann auch mein Essen fertig essen."}, {"id": 1192, "start": 12224.96, "end": 12230.96, "text": "Das kriege ich gerade irgendwie nicht im Stream gescheit hin, außer wir gucken noch eine halbe Stunde Essensvideos."}, {"id": 1193, "start": 12230.96, "end": 12238.96, "text": "Haben sie das Gerät schon mal neu gestartet? Oh ja, das kommt ja jedes Mal."}, {"id": 1194, "start": 12238.96, "end": 12248.96, "text": "Wir sehen uns beim nächsten Stream, Leute. Fragen sind nicht verloren. Also falls ich heute irgendwas nicht beantwortet habe, ist ja alles hier in meinem Stream-Midlock-Tool dabei."}, {"id": 1195, "start": 12248.96, "end": 12268.96, "text": "Wir sehen uns beim nächsten Stream, Leute. Macht's gut, bis dann."}]}