{"text": "Das war's für heute.Ich hoffe, dass ich euch gefallen habe.Wenn ihr mehr von uns sehen wollt,dann schreibt mir in die Kommentare,was ihr noch mehr von uns sehen wollt.Vielen Dank für's Zuschauen.Vielen Dank für's Zuschauen.Vielen Dank für's Zuschauen.Vielen Dank für's Zuschauen.Schreibt mir in die Kommentare, was ihr noch mehr von uns sehen wollt.Wenn ihr mehr von uns sehen wollt,dann schreibt mir in die Kommentare,was ihr noch mehr von uns sehen wollt.Ich habe mich gemutet. Ah, excellent. Wunder mich schon. Oh, nee, ich glaube ich habe einenWackelkontakt. Kann das sein? Oh. Monk... Monka... Monarch S. Wackelkontakt. Wackelkontaktin meinem kack Verlängerungskabel. Was ist denn da los? Das geht aber nicht. Verlängerungskabelbrauche ich. Dankeschön für den Sub Martin. Huge Big Brain Sub. Du hattest gerade einenRauschen. Jetzt haben wir wieder gut, oder? Wieso gibt es nicht mal einen Linux hier?Es gibt gar keine. Ich mauze. Oh, ich habe die Umfrage vom letzten Mal noch offen. Wo davonist es gar nicht abgekackt? Ah, gleich wieder am Start. So. Ja, ich glaube ich habe irgendwie...Entweder bin ich mal zu viel mit dem Stuhl über das Kabel gerollt, wo ich eigentlichaufpasse, dass es nicht so oft passiert, oder das Verlängerungskabel kackt wirklich ab.Man weiß es nicht. Ah, Axi, stimmt, wollte ich noch machen, ja. Du hast recht, ich habenämlich das Repo angelegt. Ich habe nämlich das Repo angelegt und dann habe ich nichtsreingepusht. Stimmt, komm mal da. Warum hat das jemand geforkt? Da ist nichts drinnen.Sascha, warum hast du das geforkt? Da ist nichts drinnen. Ja, mache ich, habe ich ganzvergessen. Hab ich komplett vergessen. Ja, habe ich wirklich ernsthaft komplett vergessen.Leute, ich habe nur Stream angemacht, weil ich so lange nicht mehr gestreamt habe. Ichhabe nämlich heute mal geguckt und habe festgestellt, es ist schon wieder vier Tage. Hab ich euchjetzt Mist erzählt? Aber ich bilde mir ein, das war aber nicht gesehen, um vier Tage.Jaja. Ah, stimmt. Und mittlerweile sieht übrigens auch Twitch anders aus. Das ist voll MonkaS.Da findest du nichts hier. Da findest du nichts. Wie kommst du denn? Wie kommt man jetzt aufdie Videos? Irgendwie so, oder? Ah, excellent, verstehe. Und wozu hat das jetzt hier so einenhässlichen Rand, Alter? Das ist ein Cancer Layout. Was ist das denn? Das sieht da megahässlich aus, Alter. Ja, nee, ich wusste das. Ich hatte es ja vorhin auch schon gefunden.Nee, guck mal hier. Vier Tage, sag ich doch. Deswegen, Valorant Key, nö. Gibt's diejetzt oder was? Gibt's die jetzt? Kriegt jetzt jeder eine Valorant Key? Ich hab mirjetzt überlegt, ob ich mir eine Valorant Key besorgen soll oder nicht. Aber ich habgedacht, ich fahr noch mal ein bisschen. Ach, das ist Mario Kart Musik, ja. Bisschen laut.Hä? Warum hab ich denn die IRK auf? Oh, die Emotes sind noch ein bisschen klein. Besser.Ja, ich pushe da nachher was rein. Genau, nachdem ich festgestellt hab, der letzte Streamist, wie gesagt, jetzt schon wieder vier Tage her, bin ich extra mal online gekommen.Eigentlich wollte ich heute Abend gar nicht online kommen, sondern weiter ein bisschenModern Warfare spielen. Ich bin ja in den letzten drei Tage übelst am Modern Warfaregrinden. Allerdings zum größten Teil Warzone und ein bisschen Tour-en-Tout. Allerdings,muss ich sagen, der normale Multiplayer ist richtig scheiße. Ich hab jetzt ja ein paarmal einen normalen Multiplayer gespielt zum Waffen anlocken und das Einzige, was in diesemSpiel halbwegs erträglich ist, sind die Spielmodi, die noch schlechter sind. Ist schwierig zuerklären, aber normalerweise hab ich ja in Call of Duty am liebsten Free-for-all undein bisschen, vielleicht ein bisschen Team Bestmensch dominieren. Am liebsten hab icheigentlich Free-for-all gespielt. Allerdings ist jeder normale Spielmodus in Modern Warfareso extrem krass passives Ecken abamen, dass du dir fast schon vorkommst, als bist du irgendwiein CS und deswegen spiel ich am liebsten, um Waffen zu anlocken, einfach stinknormales,wie heißt diese Playlist, Shipment und Rust und Shoot House und sowas. Das ist zwar eigentlichrichtiger Müll, aber es ist deutlich erträglicher als der normale Multiplayer, einfach weiles total hirnlos respawn, ballern, respawn, respawn, ballern, ballern, respawn ist. Dernormale Multiplayer regt auf. Genau, so siehts aus. Ne, der normale Multiplayer ist wirklichMüll, finde ich. So und was allerdings Spaß macht, was ich nicht erwartet hätte ist,Tour and Tour macht Spaß. Ich hab gestern irgendwie 12 Runden oder so gespielt, nichteinmal verloren, was allerdings an meine Mitspieler lag und nicht an mir. Und Warzone macht auchSpaß, wobei ich sagen muss, dass mir Solo Warzone nicht so wahnsinnig Spaß macht. SoloWarzone krankt so ein bisschen da dran, wie der normale Multiplayer. Autsch, vor meinArm verdreht irgendwie. Krankt so ein bisschen wie der normale Multiplayer, dass es haltextremes rumgeschimmelt ist. Und ich hab halt kein Bock, 20 Minuten zu spielen und 5 Gegnerzu sehen. Man kann natürlich auch krass auf Kills spielen, das geht auch, allerdingsist es dann halt sehr random. Mal machst du 11 Kills in irgendwie 5 Minuten oder 3Minuten oder so und mal ein bisschen direkt down. Also es ist schwierig, also am meistenBock macht Warzone mit mehreren Leuten. Ich bräuchte irgendeinen, der mich mal ein bisschencoacht in dem Game. Ohne Scheiß. Also mal observed, geguckt, wie ich spiele und mirdann ein paar Tipps gibt. Weil so holt man schneller auf, dass man jetzt einfach 2 Monatehinten dran ist mit Game üben. Frag den Patrick, der krasse Warzone-Owner mit 6 Kills. 11 Killswar so ein Beispiel. Das war glaube ich das Game mit den höchsten Kills, was ich bisherhatte, war 11 Kills auf, die Map ist immer die gleiche oder? Warzone ist immer die gleicheMap, oder? Da bin ich in der Mitte abgesprungen auf dem Teil der Map, der aussieht wie dieGround War Map. Es ist schwierig Warzone Call of Duty Modern Warfare Maps zu beschreiben,die sind, in dem Game sehen die alle irgendwie so hingeklatscht aus. Und in diesen Industriehäusern,da ging es halt übelst ab. Ich habe übrigens Subs übersehen, glaube ich. Dom PC 5 Monate,excellent Subscription, huge. Dankeschön für den Sub und wen haben wir hier noch? DenArrow, OD, Twitch Prime. Wahnsinn. Big Brain Subscribers bitte. Ähm, Matt, da verlerntman aber nichts. Er schreibt gerade, er schreibt hier gerade, ähm, habe ich es eigentlichhier mitgeloggt? Ne. Er schreibt gleich, ich soll ein Video hochladen, dann kommen ja relativschnell die Experten, die mir sagen, was ich falsch mache. Das ist ungefähr wie, alsowenn man auf YouTube Kommentare hört, was man in seinem Gameplay verbessern soll, dannist das ungefähr so, wie wenn man sich, ähm, bei MMOs an Reddit orientiert. Das ist so,das gibt so ein paar Dinge, die gehen immer nach hinten los. Die YouTube Comments sindeinfach nur Bullshit von Leuten, die selbst keine Ahnung haben, in 90% der Fälle. Und,ähm, Leute, die MMOs spielen und auf Reddit rumspammen dazu, was OP ist und was schlechtist und sonst was sacken einfach nur in dem Game meistens. Was eigentlich gerade so fürTrends auf GitHub. Zum Beispiel, es gibt ein richtig gutes Beispiel, warum Reddit sackt,also in dem Fall, warum Reddit voller Noobs ist. Ich hab die letzte Season Path of Exilegespielt, als Ultra Noob. Ich hab das Spiel gespielt, ein bisschen, als es rausgekommenist, auch mit dem Frisör zusammen. Und danach hab ich ewig nicht mehr gespielt. So. LetzteSeason hab ich mir bis ein paar Builds durchgelesen, hab relativ schnell den Build identifiziert,der absolut Noobstyle für jeden Volldeb zu spielen ist und hab angefangen. Und ich habnebenbei immer ein bisschen Forum und Reddit gelesen und ich dachte am Anfang, ich brauchein Build, was maximal so 5-6 Chaos Orbs kostet, weil ein Build, was viel kostet, ist keinrichtiges Build und so. Totaler Schwachsinn. Reddit, Alter. Reddit. Feels Reddit, man.Totaler Bullshit. Ähm, ich hab dann gespielt und ich hatte, glaub ich, schon, als ich imEndgame angekommen bin, 20 Chaos Orbs oder so. Es ist total hingeklebt. Reddit. Redditist einfach nur voller Kacknoobs. Real Reno sagt, hey, du bist doch dieser Commentary-Typ,den ich vor ein paar Jahren mal gefeiert hab. Das kann ich, das weiß ich nicht, ob ichdas bin. Möglich wär's. Also wenn du den hier meinst, wenn du den hier meinst, ähm,dann bin ich das nicht. Ich hör mich nur ähnlich an. Den Keks hab ich nur geklaut,ja. Na, ich war halt ziemlicher Max-Fanboy und dann hab ich den Keks leicht abgeändertund auch auf Twitch genommen. So, also was trendet denn heute auf GitHub? Was gibt'sdenn da Schönes? Mr. Whip, warum hast du denn, warum hast du denn dieses Video jetztrausgesucht? Das ist ja uralt. Guck mal, was er hier für ein Video rausgefischt hat. Ja,ja, Achtung, Achtung. Kennt das noch jemand? Ja, 2011. Lass das gemeinsam, nein, das konntenwir nicht gemeinsam. Das ist eine, es ist zwei Stunden. What the fuck? Was haben wir dennbitte schon zwei Stunden gelabert, ey? 1200 Comments, Alter. Ich muss euch was ekligeserzählen, Leute. Ich weiß nicht, ob mir's wirklich nicht gut, ob mir's irgendwie einbisschen übel ist oder ob das nur so eingebildet ist. Und zwar, ich hab vorhin, äh, bevorich Stream angemacht hab, hab ich in der Küche unten gesessen, hab ein Brötchen gefuttertund hab halt ein Glas Wasser eingeschränkt, Glas Wasser ausgedrungen. Ich trinke, also,ich trinke immer alles auf einmal. Also, ich schütte, ich mach das Glas von unten bisoben voll und dann mach ich das ganze Glas weg. Also, selten mal mit absetzen zwischendurch.So, und während ich das so leer trinke, ne, dann hebt man das Glas immer weiter nach obenund während ich das so leer trinke, kann man ja so durch das Glas durchschauen. Undich trinke das so und ich denke mir auf der Rückseite, vom Glas hängt was. So, dann trinkeich weiter, trinke ich weiter und sehe, hä, warum hängt auf diesem komischen Stück Dreckoder so unten am Glas, warum sind da Blasen drauf. Trinke ich weiter und stell fest, äh,der Dreck ist innen im Glas drinne. Da hab ich halt, hab ich halt abgesetzt und da warunten, unten am Boden vom Glas, war so ein daumennagelgroßer Stück Schleim. Ich habkeine Ahnung, was es ist. Sah übelst eklig aus. Da hab ich natürlich nicht weitergeschirrtund gleich weggeschirrt, aber es war schon eklig, ja. Und ich hab keine Ahnung, wasich da, was ich da im Glas drinne hab. Ja, aber ich hab meinen Mundschutz auf. Leute,genauso eklig wie der Chat jetzt tut, war das auch. Deswegen trinkt man aus der Flasche,das geht nicht. Ich kann nicht, ich kann nicht ähm aus der Flasche trinken. Geht nicht,also geht wirklich nicht, weil ich hab keine Flasche, ich hab keine Flasche im eigentlichenSinn. Ich hab sowas hier. Soda Club Sprudler. Sowas da hab ich. Allerdings mit solchen,solche Plastikflaschen hier. Da kann man nicht raustrinken aus den Flaschen. Aus demWasserhahn, alter. Nee, Wasser, ich trink, ich mag kein stilles Wasser. Das muss ich,muss gespudelt sein. Und mittlerweile, ich hab, ich hab das ja schon, keine Ahnung,15 Jahre oder so. Wir haben das lange, dieses Zeug schon hier. Und also solche Geräte undich hab mich so an den Geschmack gewöhnt von unserem Leitungswasser hier, dass mirjedes andere Wasser gar nicht mehr schmeckt. Und das ekligste Wasser finde ich ist, wartemal, ist das Haccia, das grüne? Ist das grüne Wasser Haccia? Nee. Äh nee, Bad, Bad, FilblerQuelle oder so gibt's da noch? Das da. Ur- Quelle. Ey, das schmeckt total eklig. Ach,was ist der Name? Bad Filbler Ur- Quelle. Dann lieber noch die Rheinfels Quelle, fallsihr noch einer auf YouTube kennt. Das schmeckt eklig. Schmeckt so, als wäre da irgendwieSalz reingemischt oder irgendwas. Hanauer Leitungswasser, beste. Sei euch. Monkabär,Monack Ess. Das Wasser in Deutschland ist so gut, kann man immer trinken, das stimmt.Wie heißt dieses Wasser nochmal? Was die destillieren und danach wieder Salz und Zeugszusetzen, dass es immer gleich schmeckt? Da gibt's irgend so ein Markenwasser, wo dieWasser destillieren und danach wieder umwandeln. Überkinger? Was zum Geier ist Überkinger?Hört sich an wie irgendeine spanische Pornseite. Nee, hab ich noch nie gehört. Was? Fiji?Hab ich auch noch nie gehört. Ist das das? Das könnte das sein, ja. Ja, ich glaub dasist das. Ich glaub das ist das. Das könnte das wirklich sein. Nee, oder? Nee, nee, dasist es nicht, nein. Es könnte Apollinaris sein, was ich meine. Ich bin mir aber nichterkannt, ich aus total bescheuert. Total bescheuert erstmal. Der Kommentator ist da, Ruby. Alsowas trendet denn aktuell gerade so auf GitHub? Zeig mal her. Deno, ja das wollten wir unsauch mal im Stream angucken. Ich hab die Existenzberechtigung noch nicht so ganz verstanden ehrlich gesagtvon Deno, weil das wichtigste an Javascript sind eigentlich die 30 Milliarden Pakete diees gibt. Wenn ich die alle nicht verwenden kann, warum soll ich dann Deno verwenden?Das verstehe ich noch nicht. Naja, gut. Dann trendet noch irgendwelche Corona Simulationen.Ey, ich sag ja in letzter Zeit wenig über Corona und sonst was. Ich rant immer immerzwei Minuten und so, aber ich muss jetzt mal was loswerden, weil aktuell, wenn man aufTwitter guckt, ne? Schauen wir mal. Twitter Trends. Ach nee. Ah nee, es trendet geradeirgendwelche AfD-Geschichten. Okay, das kommt auch zu abwechselnd immer mal wieder. Genau,also es trendet ja total oft auf Twitter gerade irgendwelche Verschwörungsgeschichten unddann Leute, die sich lächerlich machen über Verschwörungsleute. Dann gibt es welche,die sagen, wir sind besorgt wegen Corona-Maßnahmen. Dann gibt es Leute, die posten an ihr, wieheißt das? Covid-Idioten. Ihr seid ja alle total bescheuert. Also quasi jeder versuchtmal wieder die Welt zu verbessern auf Twitter. Und was dabei total untergeht, ist, ähm,ich muss mal kurz überlegen, wie ich das am besten ausdrücke. Also was da komplettuntergeht, ist, dass es durchaus von allen beteiligten Parteien, also Parteien macheich jetzt Leute, unterschiedliche Gruppierungen, die an diesen Sachen da beteiligt sind, dassalle die ein oder anderen sinnvollen Punkte haben. Allerdings, sobald du zum Beispielauf Twitter schreibst, was ist denn gerade angesagt, ja hier Freiheit wird wegen Coronaeingeschränkt, hast du gleich die Leute, die dann übelst drauf abgehen, Max, du willstdas Leute verrecken, oder wenn du umgedreht schreibst, ich glaube, ich hab ja gepostet,man kann den Leuten schlicht und ergreifend nicht trauen, sich an Maßnahmen zu halten,deswegen wird es wahrscheinlich wieder hochgehen. Da kamen auch schon die ersten, die gesagthaben, das hat doch alles nichts gebracht, Shutdown umsonst, ganze Maßnahmen umsonst,wir werden verarscht. Also sprich, egal was du sagst, die andere Seite springt immer komplettdrauf, was halt total untergeht ist, dass alle Seiten, wenn man mal genau guckt, schon sinnvollePunkte haben und ein Punkt, wo ich da an sich bin, dass der viel zu wenig angesprochenwird ist, da wirst du aber auch schon wieder gesteinigt auf Twitter, wenn du das schreibst,oder? Ich sehe die Einschränkungen der Grundrechte in Deutschland auch kritisch, aber ich sagnicht, dass es unsinnig ist. Man muss sich mal überlegen, wie man, also man könnte dasviel besser an die Leute kommunizieren, warum man Sachen macht, und das vermisse ich einbisschen. Zum Beispiel, wenn man jetzt sagt, Leute, bleiben wir mal bei einem ganz einfachenBeispiel, wenn man sagt, Leute, alle Eisdielen müssen dicht machen, weil Corona. So, dannist das erstmal, man stellt die Leute vor vollendete Tatsachen und sagt, weil Corona,die Sache ist bloß die, weil Corona ist keine sinnvolle Begründung. Man müsste, und daswürde auch den ganzen Verschwörungstheorien vorbeugen, und das würde auch, das würdesehr viele Sachen vorbeugen, wenn man die Maßnahmen, die man trifft, ordentlich erklärt.Also sprich, wenn man sagt, ja, wir haben jetzt ABC-Maßnahmen beschlossen, und wirhaben diese Maßnahmen beschlossen aus diesen und diesen Gründen, wir haben uns überlegt,was man sonst noch machen kann. Uns ist bewusst, dass man zum Beispiel hier schon stark indie Grundrechte eingreift, aber wir sind zu dem Schluss gekommen, das geht nicht anders,weil so und so, wir haben uns die und die Punkte überlegt, aber die funktionieren aus diesenGründen nicht, deswegen müssen wir es so machen. So, und wenn man das machen würde,dann würden das auch vielen Sachen vorbeugen. Glaubst du, dass die Leute so eine lange Aufmerksamkeitsparen haben? Na, wenn die Leute so doof sind, mal zwei Minuten sich das anzugucken, da habensie halt gelitten, aber es würden allen anderen total den Wind aus den Segeln nehmen. Die,die sich das geben, denken, selbst das glaube ich nicht. Nachdenken ist nicht so verbreitet.Das müsste man erklären. Dann nimmst du komplett den anderen Seiten auch den Wind aus den Segeln,dann kommt keiner mehr an und erzählt, dass irgendwie Bill Gates die Leute zwangsimpfenwill und mit Mikrochips versorgen will und sonst was und das im Deckmantel der Corona-Maßnahmenund bla und sonst was. Man muss, wenn man Entscheidungen trifft, das ist jetzt nichtnur so von oben, von der Regierung herab, man muss eigentlich immer, wenn man Entscheidungentrifft, die Auswirkungen auf Leute haben, muss man die erklären können. Wenn man dieerklären kann, dann ist die Chance relativ gut, dass die Leute es zumindest nachvollziehenkönnen, warum was passiert und man überzeugt Leute viel einfacher damit, wenn man ihnenerklärt, warum man was macht, als wenn man ihnen einfach sagt, wir machen das und soist es. Seit wann interessieren sich Verschwörungstheoretiker für Fakten? Es interessieren sich relativviele Leute für Fakten, die Hardcore-Verschwörungstheoretiker vielleicht nicht, allerdings sind das jaLeute, die werden ja nicht als Verschwörungstheoretiker geboren. Es gibt ein paar Leute, die der Meinungsind, dass Obamas Bodyguard ein Exenmensch ist oder sowas oder dass die Erde flach istoder dass Bill Gates uns Mikrochippen will oder sowas, aber es werden auch Leute miteiner Zeit zu Verschwörungstheoretikern, weil sie überzeugt werden, dass da was dran seinmuss und wenn du auf der anderen Seite die Sachen besser erklärst, nimmst du deneneinen kompletten Wind aus den Segeln. Naja, das vermisse ich so ein bisschen, bei vielenSachen, man muss das ordentlich erklären, nur wenn man Sachen ordentlich erklärt, kannman Leute davon überzeugen. Kobold, oh hör mal auf ey. Alter Kobold, aber wir machennoch einen Kobold-Stream. Heute ist ja nur aus der Reihe Stream. Eigentlich, ich wargerade einkaufen, eigentlich hab ich noch ein paar Waffen-Attachments frei, dann habich gesagt, nee ich hab schon 4 Tage nicht mehr gestreamt, ich muss jetzt ne Runde streamen.Dann geh ich halt wieder, mach was willst. Du musst aber, Moment, Patrick, ich seh gerade,du musst noch subscriben. So als Obermod, wie geht das ey. Hast du schon was zu Kot gesagt,ja hab ich. Nein, also Leute, keiner, ich hab grad gesagt, man muss Sachen erklärenund keiner muss subscriben, ich banne niemand, der nicht subscribt. Oh ClocksHD ist da. Ohbei, vielleicht doch. Und weißt ja nicht. Ja nee, ich sehs doch, du hast doch diesenFirst Subscription. Ich glaube, das ist damit dabei irgendwie. Oder auch nicht, ach wasauch immer, ist wurscht. Hast du schon was zu Kot gesagt, ja, dass der Multiplayer scheißeist, aber Warzone und 2versus2 ganz gut ist. Der Kommentator, das stimmt nicht, du hast5 Monate subscribt. Fehlt da nicht noch was? Fehlt da nicht noch was? Geht das nicht nochweiter? Ich glaub, das ist nur die halbe Copypasta. Oh glaubt mir, ich kenne viele Twitch Copypastas.Ach Leute, wir müssen übrigens noch was machen. Äh, warte mal. No Happy Meal for10 Monate, dankeschön. Excellent Subscription. Leute, wir müssen jetzt mal was checken. Machden Virgin-Check. Das ist auch so total dämliche Copypasta, die ich letztens gefunden hab. Dasist richtig dumm, oder? So. Okay, ich wollte mir ja gucken, was gerade auf Github trendet.Ähm, das haben wir, Java Zeugs, Igitt. Hör mal auf, muss das jetzt sein? Wow, juckt michüberhaupt nicht. Facebook, IOS, SDK, die machen von nix halt, oder? Was ist das? SuperMario 64 decompiled. Ach, das kenn ich, das haben wir uns doch schon mal angeguckt. Ichglaube, die haben es mittlerweile sogar geschafft, dass ein komplettes laufiges Game rauskommt.Was ist das? A new bootable USB-Solution. Was ist das? Äh, ein USB-Stick? Create bootableUSB-Drive. Hä? Das ist ja so absolut nichts Neues, oder? Da kann man USB-Sticks machenmit Images drauf. Ja gut, es macht dann einen fertigen USB-Stick mit einem schönen Menü.Das ist eigentlich ganz nett. Das kann man bestimmt mal brauchen, das speichere ich mir.Wobei man sagen muss, ich glaube, ich hab schon seit einem Jahr nicht mehr normalenRechner oder länger normalen Rechner vom USB-Stick gebootet. Moment, was? Augmented RealityCopy und Paste. Ah, irgendwelches VR Zeug. Das ist so eine typische JavaScript-Geschichtewieder. Es gibt ja noch nicht genug Bundler und Minifier für JavaScript. Jetzt gibt esauch noch einen Go. Das ist eine typische JavaScript-Geschichte. Ich glaube, es vergehtkein Tag, wo nicht 10 neue, gehypte JavaScript-Libraries rauskommen. Viel Spaß beim Einkaufen, ja. Vielleichtfinden sie irgendwie ein Kobold-Buch. Wobei, ich glaube, im Edeka haben die sowas nicht.Frag doch mal im Edeka ein Kobold-Buch. Die denken dann, ja, ist das eine Zutat? Irgendwiewas zum Kochen? Ich weiß nicht, wie lange ich da bin. Ich kann es euch nicht sagen.Ich habe nämlich überhaupt nichts vor hier im Stream, geschweige denn. Irgendwas, ichhabe Lust gesehen. Leute, vier Tage habe ich immer gestreamt. Da wird es mal echt wiederZeit. Was sollen denn die Leute hier machen auf Twitch, wenn ich nicht streame? Der Michael5 Billiarden ist bestimmt schon wieder seit drei Tagen im Chat und denkt sich, wann gehtes denn los? Es gibt eine neue Node-Library, um Chrome zu automatisieren. Warum soll ichjetzt Chrome nochmal automatisieren? Ach, das ist ein Browser-Automatisierungstool,was Chrome und Firefox und WebKit automatisiert. Okay, das ist wahrscheinlich nicht schlecht.Warzone-Onstream kann ich gar nicht, weil... Okay, kann ich doch. Machen wir aber nicht.E-Mail-Leak. Das ist die gleiche E-Mail, die kennt ihr alle. Die geht auch für Donationsund Subscriptions und alles. Da ist kein Leak. Die steht sogar irgendwo hier in den About,im Channel irgendwo unter About. Die ist nicht secret. Kein Leak. Chat. Aber wenn ihr wollt,ist es meinetwegen Leak, wenn ihr euch besser fühlt. Fuck, Alter. Scheiße. E-Mail-Adressegeleakt. OMG. Donations sind doch aus. Ja, Donations sind aber nur aus, weil der Donation-Linkverbackt war. Übrigens habt ihr mitgekriegt, dass in Overwatch jetzt total viele Pros abspringen,die keinen Bock mehr auf das Game haben und lieber Valorant spielen. Darklyde drei Monateabonniert hat. Dankeschön. Massive Subscription. Also Overwatch ist jetzt ziemlich, ziemlichdead. Ich frag mich, was die in ihrer Leak machen. Die haben ein komplettes Team. Einesder besten Teams überhaupt. Haben die komplett gekickt in der Overwatch-Leak. Ich weiß nicht,was da los ist. Diese ganze Overwatch-Leak-Geschichte war von Anfang an kompletter Crap. Komplettergestellter Fake-Hype, zusammengeschustert von Leuten, die vom E-Sport keinen Plastenschimmerhaben. Und das zeigt sich jetzt. Und das rächt sich jetzt. Max, du hast dich im Battle.netLauncher gespielt. Oh fuck, Alter. In der Suppe im Battle.net Launcher, im Fernseh.Jetzt vorbei. Da ist er. Los geht's mit Warzone-Coaching. Easy. Das ist echt was. Das würde ich sogarstreamen. Muss ich mal gucken, ob ich irgendeinen guten Spieler finde, der mich mal ordentlichcoachen kann in Warzone, dass ich meinen zweieinhalb Monaten Rückstand ein bisschen aufhole mitGame-Knowledge. Keine bekannten Leute. Die besten Spieler sind eh nicht welche, dieman groß kennt. OWL war doch toll. Vor allem als Parals rauskamen, sie meinten das voll...Die Overwatch-Maps. Das ist so ein Ding. Leute, mir fällt gerade was ein. Overwatch-Maps sindscheiße. Modern Warfare-Maps sind scheiße. Und seit ein paar Jahren ist Blizzard und Activisionganz dicke. Da stimmt doch was nicht. Da kann doch was nicht stimmen. Ich würde sagen,die sind hier wirklich auf der Spur. BigBrain, ja. Kann man ein Mean-Bot eigentlich ohne weiteresselbst benutzen? Ne, das ist nicht auf GitHub. Das ist nur eine uralte Version auf GitHub,aber die funktioniert. Und was hat wohl Bill Gates damit zu tun? Ich glaube, Bill Gateshat in den Sound-Files der Spiele versteckte Botschaften hinterlassen, die die Leute schondarauf einstimmen sollen bzw. den Widerstand brechen sollen, unbewusst gegen Chip-Implantate.Ich glaube, wir sind hier wirklich was großem auf der Spur. So. What? Kannst du eine Twitch-E-Grill-Tierlistemachen? Ne, ich gucke kaum weibliche Streamer. Keine Ahnung, wer die besten oder hottestenoder was auch immer besten Twitch-Grills sind. Keine Ahnung. Einzige Belegrate, ich glaube,einzige Streamerin, der ich followe und schon seit Jahren. Ich weiß aber auch ehrlich gesagtgar nicht, warum ich da angefangen habe zu followen, ist Miramizu, das jemand kennt.Und ich gucke nicht oft, aber die ist nicht blöd. Also die Leute, die tun immer so nachdem Motto, alter Mädel, wie du dich hier gibst im Stream und bla bla bla, die tun immer sooft moralisch, aber rhetorisch outet die teilweise schon ganz schön. So die ganzen Flamer-Spastenim Chat. Also die ist auf jeden Fall nicht blöd. Oh nein Max, warum? Aber da bin ichda falsch in der Liste für zu machen. Hat sich schon die IHK gemeldet? Achso, ne, ichglaube nicht, dass es irgendjemand interessiert bei der IHK. Ja, mache ich nachher, macheich nachher. Keck W. Müsstest du dann nicht doppelt das, das ist eine interessante Frage,da wollte ich letztes Mal was dazu sagen. Ich habe ja mein Netzwerks Setup erklärtdas letzte Mal, so mit Fritzbox für ZIP und VoIP, den Mikrotik Router und davor die Connectboxvon Vodafone. Da hatte jemand gefragt, müsstest du dann nicht doppelt natt machen, wenn aufder Fritzbox vor dem Mikrotik auch ZIP laufen soll? Ne, muss ich nicht, weil beide hängenja an der Connectbox dran, also es ist nicht so, dass mein kompletter Traffic durch dieFritzbox gehen würde. Was E-Grill oder E-Boil zum, das kann ich nicht aufmachen, je nachdemwas das für eine Seite ist. Das traue ich mich nicht aufzumachen. Heute ein speziellesVorhaben, ja das spezielle Vorhaben ist, dass ich nach vier Tagen mal wieder online kommeim Stream. Ansonsten nix. Eigentlich wollte ich heute gar nicht online kommen. Stand Vodafone?Naja, also die letzten Tage hat es funktioniert. Ich könnte mir vorstellen, dass die zweiteNachricht die ich gekriegt habe, so wie vermutet, wirklich von irgendeinem Social Media ManagementTyp gekommen ist, weil die hat sich so überhaupt nicht nach einem Support Mitarbeiter angehört,die zweite Message. Hab ich euch ja vorgelesen. Ich weiß, ich kann es noch mal vorlesen fürdie, die nicht dabei waren. Und wahrscheinlich haben die das jetzt gefixt. Wahrscheinlichbin ich in irgendeine Liste gerutscht. Größer gleich 10k Follower auf Twitter, auf YouTubeund sonst was, bitte fixen. Weil die erste Nachricht, die ich gekriegt habe, wir habenhier extra schon eine Liste für Vodafone ausreden. Vodafone ausreden. Erst war die WLAN SSIDdoppelt. Modem Werte, schlechte Einstrahlung, Modem Neustarten, es gibt Probleme mit derConnectbox deutschlandweit, die sind jetzt behoben, Modem Neustarten, Modem Neustarten,Großraumstörungen im Raum Hanau, Frankfurt. Und danach habe ich die Nachricht gekriegt.Danach habe ich die Nachricht gekriegt. Einmal vom Support. Hallo, wir sind diesbezüglichinformiert und arbeiten gerade daran, die Störungen zu beheben. Und eine Viertelstundespäter, das war nach dem dritten oder vierten Tag in Folge, wo wir Probleme haben, wo ichjeden Abend rumgespammt habe auf Twitter, habe ich dann eine Nachricht gekriegt, diesich so überhaupt gar nicht nach Support liest. Und zwar, vielen Dank für deine Nachricht.Tut mir leid zu lesen, dass dein Stream beeinträchtigt ist. Leider gibt es da im Moment eine Großstörungin deinem Anschlussbereich. Die Technik arbeitet mit Hochdruck an der Behebung, das solltebald erledigt sein. Bitte hab noch etwas Geduld. Wenn alles wieder läuft, kannst du uns gernewieder schreiben, dann können wir uns um eine entsprechende Gutschrift kümmern. Ich wünschedir einen schönen Tag, liebe Grüße. Das klingt so null nach den Support-Nachrichtenvon vorher. Ich habe so irgendwie die Gefühl, dass das irgendein Social Media ManagementTyp ist. Und er hat sich jetzt gedacht, oh fuck, der spammt jetzt jeden Abend, wie scheißewir sind. Vielleicht sollten wir das mal fixen. Hast du schon das Drama wegen dem neuen Twitch-Consilmitbekommen? Ne, ich habe das Drama mitgenommen um die Corona-Warn-App. Da drehen die Leutewieder ab. Wo ist das denn? Die sind wieder am diskutieren in der Corona-Warn-App. Dasist also auf dem GitHub-Repo von der deutschen Corona-Warn-App sind sie gerade wieder amdiskutieren, ob es nicht Leute beleidigt, wenn man eher sie und Anrede nicht gendergerechtverwendet. Das ist natürlich das allergrößte Problem, was man bei einer Corona-Warnung-Apphat. Ob die Gender-Bezeichnungen richtig sind. Logischerweise, was könnte bei so einer Corona-Appsonst wichtig sein? Nicht Warp, Warn. Wie heißt denn das Repo noch mal Leute? Corona-Warn-Appist das Ding. Auf GitHub, genau. Wo ist der GitHub-Link? Ja. Ich mache mal Achtung Leute,Augenwarnung. Wenn du hier guckst, was hier Closed ist. Was da wieder diskutiert wird.Wenn du hier suchst. Geschlechtssensitive Sprache in deutschen Dokumenten. Oh mein Gott,das ist unglaublich für eine Corona-App. Das geht nicht. Alter, die drehen echt alleab. Naja, also immer. Es ist egal. Da habe ich mir gedacht, wenn wir echt keine Problemehaben bei einer Corona-Warn-App, als dass die gender-korrekte Bezeichnung drin ist,dann weiß ich auch nicht. Hattest du in deiner 4 HE-Kiste Hardware oder Software-Rate? Wennja, wählst du ZFS-Rate 1. Was hat jemand eben gefragt, ob ich irgendwelches Twitch-Dramamitbekommen habe? Hast du schon das Drama um den neuen Twitch-Conceal mitbekommen?Moment, was ist das? Hä? Was soll das sein? Moment.was hat das jetzt mit Twitch? Was hat das jetzt mit Twitch-Skandal zu tun? Hä?Wo ist das jetzt? Verstehe ich nicht. Hä? Es gibt Sachen, die verstehe ich nicht. Hä?Wie ist bei dem neuen Twitch-Safety-Advisor-Conceal? Was ist ein Twitch-Safety-Advisory-Conceal?Okay. Ich sehe schon, in welche Richtung das führt. Ich weiß nicht, ob ich mir das jetztgeben will. Ich weiß nicht, ob ich dazu im Stream wieder was sagen soll. Okay. Ich ahneschon, in welche Richtung das geht, aber mal gucken. Wir sind ja aktuell gerade überallsehr drauf bedacht, dass sich auch ja keiner in irgendeiner Art und Weise mehr gekränktfühlt, was im Endeffekt darauf rausläuft, dass noch mehr Leute als vorher, aber haltvielleicht andere. Also sogar auf Deutsch. Okay. Die Sicherheit und Gesundheit unsererCommunity hat für Twitch oberste Priorität. Ist auch schön. Wir freuen uns deshalb heutedie Gründung des Twitch-Sicherheitsbeirats anzukündigen, der in Zukunft das Wachstumunserer Community unterstützen würde. Also wenn ich an das Thema Sicherheitsbeirat denke,das Erste, was mir in Sinn kommt, ist sowas wie Account-Sicherheit oder dass man schaut,dass die Leute nicht so sehr scammen und debaten können mit Short-Uls und solche Geschichten.Das klingt für mich jetzt erstmal nach Sicherheitsbeirat. So. Der Sicherheitsbeirat wird informierenund Entscheidungen von Twitch anleiten, indem er seine Erfahrungen und Expertise sowie seinGlauben an die Mission von Twitch einbringt. Den Satz habe ich nicht verstanden. Was? DerSicherheitsbeirat wird informieren und Entscheidungen von Twitch anleiten? Was ist eigentlich hiermit den Buchstaben los, wenn man die markiert? Indem er seine Erfahrungen und Expertisesowie sein Glauben an die Mission von Twitch einbringt. Den Satz verstehe ich nicht. Wirklichlow-brain. Ich verstehe den Satz nicht. Ok, machen wir mal weiter. Communities dabei zuunterstützen, zusammen etwas zu erschaffen. Das ist bestimmt aus dem Englischen übersetzt.Der Satz leuchtet mir nicht so ganz ein, aber ok. Vielleicht bin ich einfach zu low IQdafür. Der Rat wird unter anderem bei vollen Themen beraten. Entwurf neu richtigen undAktualisierung bestellen. Das ist doch nicht verkehrt. Also ich meine, inwieweit ihr jetztwas zu sagen habt, ist mal fraglich. Letztendlich wird Twitch nach wie vor sagen, wir machendie Sachen so, wie wir sie machen wollen. Aber Leute, ich kann nicht beurteilen, werda am Start ist und welche Expertise die Leute haben. Nur mal auch für die Idee gesprochen,ist das doch eigentlich gar nicht schlecht, so eine Art Gremium aus erfahrenen Streamernund Leuten zu haben, die sich halt auskennen, was quasi die Twitch-Community so mag undhaben will und dass du sich dann kurz schließt mit Twitch, wenn es um Regeländerungen geht.Das klingt doch jetzt erstmal gar nicht so blöd. Ich meine, da könnte man zum Beispieldann auch mal wirklich den ein oder anderen Kontroversen reinsetzen, der schon öftersich mal in die Brennnesseln gesetzt hat, so einen wie XQC zum Beispiel, der schon öftmalsdrunter, weiß ich, es war ja oftmals auch zu Recht, aber auch schon ein bisschen drunterzu leiden hatte, dass manche Sachen sehr schwammig sind. Ich erinnere nur mal an diese ganzeGeschichte mit, wenn man tryhard postet, wäre das racist und sowas. Ich finde, so Sachenkönnte man schon klarer in Richtlinien regeln. Wobei das auch so ein Zusammenspiel aus OverwatchLeague und Twitch am Ende gewesen ist. Ich meine, das reine Benutzen eines offiziellenEmotes, ohne Text, ohne Kontext, was auch immer rein, das benutzt eines Emotes, kannja wohl kaum großartig racist sein. Das ist ja nicht umsonst ein offizielles Twitch-Emote.Wenn jetzt einer hergeht und einen Hakenkreuz in Bella Twitch TV macht, das ist mal wiederwas ganz anderes, aber wir reden ja über offizielle Twitch-Emotes. So, Entwicklungvon Produkten und Funktionen zur Erhöhung von Sicherheit und Moderation. Klingt dochauch sinnvoll. Förderung, gesunder Streaming und Work-Life-Balance-Gewohnheiten. Schutzder Interessen von Randgruppen. Das ist halt, wo man sich immer auf dünnem Eis bewegt.Man muss bei dieser ganzen Sache immer gucken, also ich bin rein für die Sache, bin ich volldafür. Man muss allerdings immer gucken, dass es nicht ins komplette Gegenteil umschlägt.Zum Beispiel, so nach dem Motto, wir sind jetzt alle Feministen, deswegen sind jetztauf einmal alle Männer trash. Dann hat man im Prinzip, außer dass man das einmal geflippthat, so wer jetzt trash ist und wer jetzt Hate abbekommt, hat man einfach einmal umgedreht.Das ist ja auch nicht Sinn und Zweck der Sachen. Also Schutz von Interessen von Randgruppen,klar, immer. Allerdings muss man halt gucken, dass nicht andere komplett ins Abseits dadurchwieder geraten. Das ist halt, das ist schwierig. Das ist auch so ein Thema, wo man es nie allenrecht machen kann. Okay, also diese Gruppe besteht aus Online-Sicherheitsexperten undTwitch-Creator. Ich denke bei Sicherheitsexperten, gerade bei Online-Sicherheitsexperten wirklichan Security. Und ich habe halt das Gefühl jetzt, so wie ich das lese, und bei so wasist Gefühl immer das Allerwichtigste. Ich habe das Gefühl, den geht es bei Sicherheiteher so um Safe in Form von, es wird nicht gehated, es wird nicht geflamed, es ist,wir haben uns alle lieb, wohlfühlen und sowas. Die meinen mit Sicherheit, glaube ich, garnicht IT-Security. Safe Spaces, genau wie es das immer auf Englisch nennen. Also dieseGruppe besteht aus Online-Sicherheitsexperten, richtig, richtig nice Musik, und Twitch-Creator,die ein tiefer gehendes Verständnis von Twitch, sowie dessen Inhalt und seiner Kombi, dasist doch gut. Beim Zusammenstellen dieses, ich bin mal gespannt, wer da alles drinneist. Beim Zusammenstellen dieses Rates haben wir darauf geachtet, sowohl Experten mit einerexternen Perspektive, als auch Twitch-Streamer mit einem tiefen Verständnis, wozu brauchtman da externe Experten? Das geht doch um Twitch-Content, oder? Man fragt die Leute,die Twitch-Content machen. Mit einem tiefen Verständnis für die einzigartigen Herausforderungenund Ansichten eines Creators, bla, bla, bla, bla. Jedes Mitglied dieses Rates, ähm, Moment,jedes Mitglied dieses wurde sorgfältig ausgeholt, wobei die Vertrautheit mit der Twitch-Communityund der relevante persönliche und berufliche Erfahrungsschatz berücksichtigt wurde. Wirfreuen uns sehr, mit dieser talentierten Gruppe zusammenzuarbeiten und besten Ort fürAufbau und halt eine Community zu machen. Die Gründung des Sicherheitsbeirats ist nureiner der Maßnahmen, die wir im Namen von Vertrauen und Sicherheit vornehmen. Wir investierenweiterhin in... Okay, wer ist da dabei? Kenn ich nicht. Keine Ahnung, wer das ist. Äh,den kenn ich. Den kenn ich, da hab ich sogar ein paar Streams geguckt, aber zu wenig, dassich da irgendwas drüber aussagen könnte. Kenn ich nicht. Kenn ich auch nicht. Ah, dasist, wo wir das Video eben gesehen haben. Kenn ich auch nicht. Keine Ahnung. Kenn ichauch nicht. Kenn ich auch nicht. Den kenn ich! Das ist ein Path of Exile-Streamer. Den guckich gerne. Okay. Okay, halt mal fest, ich kenne, ich kenne zwei Leute. Das heißt jetztnix, mir nur aufgefallen. So, ich kenne, ich kenne, ich kenne zwei Leute, ähm, aus der,aus der Liste. Ähm, gut, zu sagen, haben sie natürlich nix, letztendlich. Aber, malganz ehrlich, wie war es denn bisher auf Twitch? Oder wie ist es denn, wie ist es denn aufallen, ich sag mal auf nahezu, auf allen mir bekannten Plattformen wie Twitch oder YouTubeoder was haben wir denn da sonst noch, äh, Facebook, Gaming, keine Ahnung, Mixer, wases nicht alles gibt, ja. Es ist doch auf allen so, dass du letztendlich als Creator auf gedeihund verderbender Plattform ausgeliefert bist. So, und das Twitch jetzt nicht sagt, wir nehmenda irgendeinen Beirat an sieben schwierigen Leuten, die dann auch noch quasi ein festesVeto-Recht haben, kann ich verstehen. Ist doch, äh, das wäre doch aus Sicht von Twitch überhauptnicht, überhaupt nicht anzustreben. So, und natürlich nimmt man sich jetzt auch Leute,die, äh, mit denen man wohl gut auskommt. Aber auf der anderen Seite, wo, wo genau istdenn jetzt der Shitstorm bei der ganzen Geschichte, den verstehe ich doch nicht so genau. Hastdu schon mitbekommen, dass Facebook Giphy gekauft hat? Nee. Also ich verstehe, also wo, wo genauist, warum, wo ist da jetzt denn jetzt der Beef? Ich glaube, die Leute sind wegen dieser Transgender-Personenmad, warum? Die haben sie doch nicht mehr alle. Man darf auf alle Leute sauer sein. Ja, dasist okay berechtigt, wenn sie irgendwas gesagt haben, was einen anpisst, äh, was einen anpisst,kann man sauer sein. Aber ich meine nur, weil er, oder sie, weiß nicht, wie, wie man sieeher ihn jetzt richtig nennt, weil das ist ja schmierig, deswegen sag ich jetzt mal sie,ähm, und nur weil sie, keine Ahnung, bunte Haare hat, warum sollte man auf jemanden sauersein? Es ergibt überhaupt keinen Sinn. Die können echt alle machen, was sie wollen undwenn einer heute sagt, er wäre gerne nen Fahrrad, kann er das meinetwegen machen. Man solltenur nicht davon ausgehen, dass es auf jeden Fall die restliche Welt dann sofort versteht,aber ansonsten, ey, jeder, jeder, jeder, jeder will. Ähm, also warum man sich jetzt da drüberaufregt? Okay, warte mal, Reddit, Twitch, worüber regen sich denn jetzt auf? Gar nicht,oder? Oh, oh, das ist schlecht. Die dürfen IRC nicht entfernen. Das ist viel schlimmer.Die dürfen IRC nicht entfernen. Dann geht mein Chatlogger nicht mehr, wenn die IRC entfernen.Mein Chatlogger basiert auf der, dass der Twitch Chat über IRC erreichbar ist. Achso,okay, sie entfernen paar IRC Features, das müsste immer noch funktionieren. Wieso benutztdu nicht BRC, wenn die IRC entfernen? Excellent. Warum man jetzt da dran rumdoktern muss, versteheich allerdings trotzdem nicht. Also ich sehe hier ehrlich gesagt kein Geflame über denSicherheitsrat. Okay, anscheinend das hier. Nee, nee, ich will mich damit gar nicht weiterbeschäftigen. Es ist wie auf YouTube, eigentlich ist mir scheißegal, was die Plattform macht.Ich stelle hier meinen Content zur Verfügung im Endeffekt, weil ich hier die Leute am bestenerreichen kann und wir haben ja auch hier den besten, der besten, Moment, aber ansonstenist mir das vollkommen egal, was die Plattform macht. Wenn ihr nicht gerade komplett geisteskrankeDinge beschließen, sodass ich keinen Bock mehr drauf habe, hier zu streamen, ist mirdas ziemlich egal. Du musst erstmal die Basics machen, ja. Wie spricht man es richtig aus?Basics, ich kann das nicht aussprechen. Wie spricht man Basics richtig aus? Die Basics.Du musst mal die Basics machen. Basics, ne? Musst die Basics. Ist das Schwäbisch? Dasist bestimmt Schwäbisch. Schwäbisch ist hessisch, das ist doch nicht hessisch. Das ist nichthessisch. Also ich weiß, wie sich hessisch anhört, aber die Basics sagt hier keiner.Was sagt keiner hier, die Basics? Stuttgarter Dialekt, ja das ist Schwäbisch, ja. Wie findestdu San Diego Spongebos? Keine Ahnung. Ich kenne mich im deutschen Hip-Hop-Segment nichtaus. Aber ich kann was zum schwedischen Dialekt sagen. Auf die Gefahr hin, dass jetzt einpaar Leute schenkig sind, aber ich muss euch auch erklären warum. Ich mag schwäbischenDialekt nicht. Das liegt daran, weil mein erster Arbeitgeber, der Provider, wo ich meineAusbildung gemacht habe, die kam aus Ulm und die haben alle Schwäbisch geredet unddas war ein echt komischer Laden. Also ich habe nichts gegen Schwaben, aber immer wennich einen Schwäbisch reden höre, dann muss ich daran denken. Ja, wenn dich fragt, sageinfach Beste. Ich sag selten Beste zu was, was ich gar nicht kenne. Weil im Zweifelsfallist es nicht Beste, sondern zack. Oh ne, ne Korok das kenne ich noch. Oh nein, das kenneich noch. Das ist das Zwischenshow, die immer im ersten Programm läuft. In Hessen laufenim zweiten sind Mainzelmännchen, im ersten ist Onkel Otto und im Schwäbischen ist esdieser Affe und der Esel im Fernsehprogramm. Das kann ich mich daran erinnern. Ich warja manchmal über Nacht dort in Ulm und da habe ich auch ein bisschen Fernsehen gegucktund da kamen diese komischen Zwischeneinspieler mit dem Esel und dem Affe immer. Das hier,das hier. Da denke ich mit Horror dran. Das erinnert mich an Zeiten wo ich mich nichtgerne dran erinnere. Ansonsten muss ich sagen, wo wir gerade bei Dialekten sind, es gab jamal eine Abstimmung, dass ich glaube sächsisch oder so, wäre der unsexiest Dialekt oderder dummste Dialekt oder so. Ich muss ja sagen, dass ich irgendwo sächsisch noch ganz gutfinde. Vielleicht weil ich den Fabian und den Karsten kenne, aber die reden ja beidenicht so richtig krass sächsisch. Da habe ich keine Schmerzen mit. Also das ist der einzigeDialekt der mir wirklich auf den Keks geht, ist schwemisch. Und eben weil ich da persönlicheErfahrung mit habe. Ansonsten ist mir das eigentlich vollkommen wurscht, ob es jetzteiner bayerisch labert, sächsisch, irgendwie norddeutsches Zeug oder sonst wie. Was ichgeil finde, also eine Sache die mir aufgefallen ist an sächsisch, ich war ja auch schon dreiviermal oder so in Dresden, dass im Osten sagen total viele Leute immer Nü, so wiewir hier sagen ach oder hä oder was sagen die Nü. Aber so langgezogen, so Nü. Ich kannes nicht nachmachen, Nü, Nü, Nü. Ich kann es nicht nachmachen, aber ihr wisst wahrscheinlichwas ich meine. In Hessen sagt man Hä. Hä geht für alles. Nü gibt es nur in Dresden,sonst nirgends. Ok. Ja. So genau kenne ich mich da nicht aus. So gibt es ja noch einpaar sinnvolle Fragen. Max kannst du mir sagen was W-Pad ist? W-Pad das hört sich an wiewenn man Leerzeichen auffüllt, aber ich glaube nicht, dass das damit gemeint ist. Man paddetLeerzeichen, Whitespaces oder so. Keine Ahnung. Was hältst du denn von Deno bisher? Wie gesagtich habe mir ein paar Webcasts dazu angeguckt. Ich sehe die Vorteile gegenüber Node.js, allerdingswas ich nicht verstehe ist warum man das verwenden sollte. Das wichtigste in einem ganzen Ökosystemvon Node.js ist doch dass es so viele Pakete gibt und die gibt es für Deno nicht. VoiceChat abgeschafft weil es diskriminierend ist. Da der blödsinn ausfasst. Mittlerweilesind es so viele Leute im Chat, dass du diewitzigen Situationen von einem Pipega-Chat hast wie früher. Früher hast du irgendwastotal hirnverbranntes gepostet und da haben die Leute noch darauf reagiert im Chat oderumgedreht. Du hast auf was dummes reagiert was Leute im Chat geschrieben haben aber dasgeht mittlerweile nicht mehr. Mittlerweile spammen die Leute einfach nur 150 ZeichenEmotes am Stück oder machen Donations. Wer es kennt weiß was ich meine. Total hängengeblieben.Deswegen kann ich mir das nicht mehr angucken. Ansonsten muss man sagen XQC hat schon Twitchganz schön seinen Stempel aufgedrückt. Also viele Sprüche und viele Ausdrücke ist quasimittlerweile fast gang und gäbe auf Twitch. Z.B. Go a Garn. A Garnel. TriHead7, ja jetztauch sowas. Genau. Wie gehts dem Fabian? Dem gehts gut. Der spielt Mobile Games. Du hastdir erwähnt, dass du bei einer Bank arbeitest. Kennst du Star Money? Ja, kenne ich. Habenwir aber nicht. Das ist doch eher was wo man daheim sein Rechnungswesen Zeug machen kann.Wann kommt der Staubsauger Minecraft Let's Play? Das funktioniert nicht so richtig. Gibtkeine grafische Ausgabe auf dem Ding. Auch nicht über SSH. Das läuft nicht. Wenn derFriseur Mobile Games spielt kann es ihm nicht gut gehen. Doch tatsächlich. Der findet dassuper. Ich weiß auch nicht was da los ist. Hast du schon die neue Tech Demo von der neuenUnreal Engine angesehen? Nö. Es gibt eine neue Unreal Engine. Echt? Unreal Engine 5Demo. Ok, gucken wir uns mal an. Die neue Tech Demo ist geisteskrank. Ach, Badri, dubist ja noch da. Huge Poggers. Leute, ich hab ein Problem. Ich muss mal aufs Klo. Wasmacht man da? Ich mach euch den Pepega Song an. Ihr dürft euch jetzt das Aquarium undden Zug angucken und ich mach 5 Minuten Pause und geh aufs Klo. Aber das allerwichtigsteChat. Dass ihr nicht irgendwie auf die Idee kommt, jetzt während ich weg bin, XQC Chat2.0 zu machen. Außer Anygifters im Chat. Die dürfen natürlich. Geh ich jetzt aufmein Handy und mach mein Chat auf. Ich sehe euch. Ich sehe euch. Sonst bin ich in 5 Minutenwieder da. Ich mach vielleicht noch mal kurz ein Overlay. Text. Kurz auf Klo. Perfekt.So, ich bin gleich wieder da. Gleich wieder am Start. Oder wie man jetzt sagen würde,der Bruder muss groß.So, Chat. Ich hab alles gesehen. Jetzt werd ich erstmal 20 Leute bannen. Okay, also Unreal5 Tech Reveal. Unreal Engine 5 Revealed. Bekommst du viele Nudes von Fans geschenkt? Ich kannmich vor Dickpicks kaum noch retten. AvgText. Mal gucken ob unsere Bandbreite richtig eingestelltist. Ja, sehr gut. Die Musik soll ich vielleicht mal ausmachen. Nix League. Der Chat. So einfachkann ich nicht gebadet werden. Es ist weder IP League noch StreamKey League. Okay. UnrealEngine 5 Revealed. Schauen wir uns das doch mal an. Bisschen lauter, hm? Oh, oui, oui.Oh. Kap. Oh, Zeitschirr. Sitzen die nicht viel zu nahe? Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja.Sitzen die nicht viel zu nahe beieinander? Und ganz ohne Maske? Oh, ZBrush. Ja. Ja. Ja.Okay. Das ist interessant. Was es auf einer PS5 läuft. Auf der anderen Seite, wenn mansich die Specks angeguckt hat, da geht es bei mir wenigstens ein bisschen vorwärts wiedermit Hardware in Konsolen. Ist nicht mehr so enttäuschend wie bei der Xbox One und beider PS4 zur Release. Okay. Ich mache auch mal die unten mal die Leiste weg. Ist dasPartner 2? Oh, die Beleuchtung sieht schon geil aus. Das sieht, das sieht schon wirklich,wirklich gut aus. Also, das sieht wirklich gut aus. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja.Das sieht wirklich gut aus. Guckt euch das mal an. Ich meine, guckt mal. Denkt euchmal die Overlays weg. Ja. Denkt euch mal die Overlays weg. Und sowas. Also, das hier könnteohne Probleme. Okay. Wenn man sich das Gras anguckt und es pixelt und so. Ja. Okay. Wennjemand zu einem sagen würde, sag mir mal, ob das Foto echt ist oder 3D gerendert, dannwürdest du sagen, ja, okay, vielleicht 3D gerendert. Aber wenn dir das Foto einer Kontextlos zeigen würde. Also, ich glaube nicht, dass es direkt einem ins Auge springen würde.Na, das Gras erkennt man schon. Aber mal angenommen, mal angenommen, es würde eucheine Landschaftsaufnahme zeigen und da würde das dazwischen liegen. Also, das sieht schonganz gut aus. Was? Der Stream pixelt echt jetzt? Allzu viel sollte da eigentlich garnicht mal pixeln. Aber okay, wahrscheinlich halt das übliche. Es könnte, na gut, dieKompression ist natürlich ein bisschen schlechter. Die sieht hier auf YouTube schon besser aus,stimmt. Was ich cool fände, ein FPS-Counter. Ach, Chat, ich glaube euch kein Wort. Boah,gut face. Okay. Wisst ihr woran mich das erinnert? Hat irgendjemand dieses Unlimited-Detail-Videogesehen vor ein paar Jahren? Kennt das noch jemand? Unlimited-Detail, wo bis heute nichtsrausgekommen ist? 16 times the details, genau. Oh man. Chat, meine Güte, wie ich hier mitmich ist da nix aus. Zumal ich höre es ja selbst, ich spiele mich ja selbst wieder ein.Der Chat ist heute hart am Dauer debaten. Echtzeit, okay.Also die Belichtung sieht wirklich extrem gut aus. Ich weiß das wahrscheinlich gar nichtrichtig zu schätzen, aber es sieht wirklich sehr nice aus. Ist wirklich schon mal jemandso gesprungen? Das frage ich mich bei. Ich weiß, hat mit der Grafik überhaupt nichtszu tun, ja. Das ist genauso wie in Uncharted. Fünf Meter gesprungen, hingehauen und dannan einem Arm da gehauen und sich gedacht easy, easy as fuck. Ich hänge hier an einem Armrum. Ich gucke jetzt erstmal kurz entspannt nach unten und dann mache ich bam, hochziehen.Gar kein Problem. Als wird hier durchgestalzt, hä?Jetzt muss ich mir nochmal angucken. Wie sieht denn das Licht auf der Haut aus beim Durchlaufen?Das sieht ziemlich gut aus. Das sieht ziemlich gut aus. Ich mein, das sieht, das sieht wirklichsehr nah an dem aus, wie ich mir das vorstellen würde, wie es halt aussieht.Ich hab ne Vorschau. Am Wasser habe ich jetzt nicht so viel erkannt. Das Wasser sah eherso aus, als haben sie drauf, passt nicht so 100% zur Animation. Aber Wasser ist dochheute schon ziemlich real. Was? Das ist doch nicht anstrengend. Vor allem,woran kehrtet sie denn? Bitte schön. Das ist cool, dass sowas dabei ist. Da kann quasijetzt auch jeder dahergelaufene Typ nen Assassin's Creed Asset Flip machen.PC Lustig sagt, aber was davon dann wirklich in Games ankommt, das ist doch bei Unrealbisher immer ziemlich gut. Alles auch in Games angekommen. Wenn man sich die Unreal Demosanguckt, 3, 4, 5. Ich überleg grad, was waren die Unreal Demo 4? An die 3 kann ich micherinnern. Das war dieser Samarita. Der Typ, der die Leute rumboxt. Was war denn der Unreal4 Trailer nochmal? War doch dieses Zimmer. Wir gucken uns danach nochmal den Unreal 4Trailer an. Ich kann mich an den Unreal 4 Trailer nicht mehr erinnern. Ich kann michdoch an den Unreal 3 Trailer erinnern. Wow, ein Michael-5-Spieler an. Ah, habt ihr gesehen,wie es glänzt? Das ist cool.Und was haben die von der Hardware drinnen? Ach nee, es ist ja PS5, haben sie ja gesagt.Normaler PS5.Das ist alles AMD, ja.Ich denke mal, das sind eher 30 FPS. Ich glaube nicht, dass das mit 60 läuft. Es istauch nicht wirklich zu erkennen, weil das Video halt selbst nur mit 30 ist. Was füreine Grafikkarte ist vergleichbar mit einer PS5? Oh, ich habe es immer richtig im Kopf.Ich glaube, eine 2070 oder so, ne? So um den Dreh um eine 2070, glaube, war das. Kannauch sein, dass ich jetzt komplett falsch liege. Ich kriege es auch im Kopf nicht mehr richtigzusammen. Portal 3, confirmed. Ezio-Style, nee, doch nicht. Eher, eher. Alles klar. Anthem,eher Anthem-Style. Ach, das ist das Anthem, wie Mastern, wo sie alle vorgehen. Und durchPortal und Schnitt, nee, doch nicht. Wieso ist sie nicht einfach vorher hochgeflogen,sagt Maurice? Naja, weil sie da noch nicht das Level Up hatte, was sie erst oben gekriegthat. Dieses, dieses Kletzerding. Ultranice. Ultranice. Wie gesagt, ich bin, ich kennemich mit 3D-Programmierzeug und Grafik null aus. Ich habe da nur Absolut-Basic. Das Einzige,was ich bisher mal OpenGL wirklich from scratch, raw-mäßig programmiert habe, ist die T-Kanne.Die T-Kanne mit OpenGL. Die Basic-T-Kanne. Das sind ungefähr so 50 Zeilen oder so. DieOpenGL-T-Kanne ist das Einzige, was ich hier programmiert habe. So richtig low-level 3D.Und was ist mit Lull-3D? Äh, das, genau, das ist die Annual-4-Demo. Richtig, richtig,richtig. Ich erinnere mich, das ist, ja, genau, dieses, dieses Flammending. Ja. Moment.Jetzt brauchen wir eine höhere Auflösung. What? Ah. Und denkt dran, es ist 7 Jahre her,was wir jetzt sehen. 7 Jahre. Stimmt, ja, jetzt kann ich mich wieder an die Annual-4-Demoerinnern. Klettert da jetzt nicht auch gleich jemand? Ne, das war wieder was anderes. Dasist der Typ auf dem Thron, genau. Na, 7 Jahre ist ja heutzutage Hardware-technisch nichtmehr das, wie es vor, wie 7 Jahre vor 7 Jahren war. Also, es hat sich schon einiges getan,das sind 7 Jahre, aber es ist jetzt nicht so, wie die 7 Jahre davor. Aber man erkenntdas schon. Patrick, das ist doch wurscht, selbst, selbst wenn sich das, wenn sich dasweiterentwickelt auf den CPUs. Du kannst heute ohne Probleme noch mit einem Rechner, der4-5 Jahre alt ist, halbwegs spielen und probier das die 7 Jahre davor mal aus. Fand die 5erauch besser aus Big Brain Chat heute wieder am Start. Wollen wir uns noch die 3er anguckendann? Da hat sich noch mehr getan. Und ich sag euch Leute, ihr findet wahrscheinlichdie 5er auch besser als die 3er, aber der 3er Trailer ist der beste. Ah, damals hatman richtig gesagt, boah, die ganzen Partikel und sonst was. Ah, da hat sich schon einigesgetan. Das ist für die PS4. Aber der Trailer ist für alle gleich. Oh, ein KS. So, aberder 3er Trailer ist der beste. Ich mein, das ist ein Riesenunterschied, wie es aussieht,ja. Aber der Trailer von der Unreal 3 Engine war am besten bisher. Mal gucken, ob wir dasin ordentlicher Auflösung irgendwie finden. Ja. Ist der beste Trailer, finde ich, vondem wir sehen. Denkt dran, das sind die Games, also Unreal 3 war ja auf PS3 und Xbox 360,die Engine schlechthin, ne, da war ja irgendwie gefühlt 60% der Games war Unreal 3. Wobeidas hier garantiert nicht auf der Xbox gelaufen ist. Äh, Unreal 3 kam, was weiß ich, vor10 Jahren oder so. Aber der Trailer ist am besten. Was auch immer er da macht.Warum auch immer er an der Kette geschweißt hat.Wieso da?Bam in your faceAhSie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.Sie sind in der Nähe.das 5 echtes gameplay ist ist cool ja das stimmt also rein aber von der von der vonder aufmachung her wie das geschnitten ist wie das gemacht hat finde ich den 3er immernoch am besten holy shit was war das denn unreal 1 unreal engine 1 ich glaube das ist auch daserste mal dass man so wirklich den engine trailer hatte den gameplay engine trailersansonsten haben die halt immer einen trailer gemacht in form von halt so einem filmchenwas angeblich halt in echtzeit gelaufen ist hast du die unreal demo oft ja haben wir unsgerade angeguckt moment was es gibt es gibt telekom unterwäsche kam ist das safe aufzumachenja was jetzt was das wenn ich das häkchen weg mache ist das häkchen immer noch dagebadet grüßes mann scam scam ja ist mir doch vollkommen egal weiter love magenta connectedunderwear oh mann for men for women for for kids ok jetzt jetzt wirds aber jetzt wirdsaber gefährlich telekom ja love magenta connected andere entwickelt intelligenteunterwäsche die das smartphone vorüber gehen zum schweigen bringen ok das heißt wenn sichzwei leute die diese unterwäsche tragen nähern oder was und dann dann schaltet das smartphoneab bluetooth funktion das habe ich schon mal gesehen das haben uns doch schon mal angegucktkann man auf der seite htps zertifikate verschenken krelax ich habe keine ahnung was du meinstalso was bekommt man eine love magenta stofftasche mit kordelzug aha mit magenta dna hoffe ichunterhosen herren boxershorts ein damenslip hüftige passform zwei love chips was einschwachsinn auf lager ich hätte mich auch gewundert wenn das ausverkauft wäre max willnur den damenslip richtig das war ich da wieder typ auf dem einen foto als corona maske oderals als atemschutzmaske verwendet haben wir tatsächlich dem kumpel zum geburtstag geschenktsagt der blobs rusher exzellent wie gehts tscheko ja was die gerade treibt weiß ich aber dergehts gut tscheko gehts gut tscheko glaube mit k zumindest guckt sie kritisch auf demfoto ja was es nicht alles gibt telekom unterwäsche interessant ja aber gegucktdass man mikro angeblich aus ist das hatten wir schon wünschst du dir das mehr arbeitgebernach der krise auf dem zu bleiben mit home office das ist eine sehr gute frage ich glaubedass das passieren wird ja es ist vollkommen egal ob ich mir das wünsche oder nicht ichgehe davon aus dass das passieren wird ich gehe ich von aus ja zumal ja auch viele unternehmenjetzt erst angefangen haben quasi digitale infrastruktur zur bereit bereit zu stellendass es überhaupt möglich ist der chat wieder lowbrane chat gerade ja aber es wäre auf jedenfall cool wenn sich das mehr durchsetzt also wie gesagt ich gehe da fest von aus zumales ja auch noch eine weile dauern wird bis das so wieder alles falls überhaupt das maljeweils wieder normal wird keine prime subs chat bleibt dumm sieht heute wirklich so ausja heute ist heute ist mal abwechslungsweise kein high IQ chat da heute ist wirklich ichhab ich hab noch nicht mal ich hab noch nicht mal ein emote dafür weil normalerweise istder chat der chat ist normalerweise immer schon ziemlich big brain aber heute weiß ich nichtwas mit dem chat los ist david 3 sagt bei mir bleibt home office solange bis der mindestabstandnicht mehr benötigt wird bei uns ist auch noch home office angesagt liegt an 5g oh stimmt5g ausbau geht ja immer weiter und all bill gates 5g und bill gates bestimmt für meinentwitch chat verantwortlich gehe ich auch von aus ich hatte ja schon immer den eindruckdass mit dem chat was nicht stimmt ok der flur ist nicht mal 1,5 meter breit also beiuns auf der arbeit ist jetzt so wir kriegen masken gestellt von der firma wir haben allerdingsunsere masken erst eine woche später bekommen als gedacht weil das jetzt kein witz weiles normale masken nicht getan haben wir mussten uns erst masken mit unserem firmen logo draufdrucken lassen weil immer das heißt wir haben jetzt quasi paar kisten mit masken wo dasfirmen logo drauf ist ganz wichtig man braucht unbedingt atemschutzmasken mit firmen logowenigstens ffp 2 fragt kein schimmer also wir wer ins büro geht da kriegt eine maskegestellt und bei uns ist pflicht dass man die maske an hat sobald man seinen arbeitsplatzbzw das büro verlässt also sprich wenn man auf den flur geht aufs klo in die kirchesonst muss die maske anziehen und wer mittagessen will der muss sich vorher anmelden und sagenwann er kommt und dann kann es sich entweder unten hinsetzen oder ihm mitnehmen oder michael50 billionen fragt was ich stehe vor einer schwierigen entscheidung also ich habe zweiangebote für eine ausbildung erstens fachkraft für lagerlogistik aber bekomme im erstenausbildung ist ja schon knapp ein k muss aber tatsächlich arbeiten das soll als azubi durchausvorkommen ja fachinformatiker für andere für anwendungsentwicklung aber da bekommeich im ersten jahr das was gefällt dir denn vom inhalt her besser scheiß mal auf das gelddu kommst mit beidem gehalt nicht über die runden was sagt dir denn mehr zu aber generellnicht so nice da bin ich ganz bei dir ja aber die meisten leute werden wahrscheinlich nichtdrumherum kommen was gefällt dir denn besser scheiß auf das geld also du kommst mit einemk im prinzip genauso weit wie mit 600 nehme ich gar nicht chill seit einem jahr zu hausewarum sollte ich arbeiten ja dann mach doch nix dann bleib einfach weiter daheimals fahrinforter immer nach der ausbildung mehr verdienen alsals fachkraft für lagerlogistik ich habe ehrlich gesagt keine ahnung ich würde aber von ausgehenich habe ein manjaru analog zu deinem einrichtung setup meine status leisten sie das gucke ichmir garantiert nicht im stream an das gucke ich mir erst mal auf der anderen seite andu hast den image font nicht installiert ja du hast den image font nicht installiert dumusst dir dann immer in meinem fall ist es ein emoji font du musst dir den emoji fontinstallieren emoji von oder sowas du musst den image font installieren joy pixels joypixels muss den zählen geht dann geht deine leiste woher kommt der schlechte ruf von javada muss ich dich jetzt muss ich dich aber fragen meinst du woher der schlechte ruf kommt warumich immer über java lästere oder meinst oder hast du das gehört irgendwo also warumich über java lästere hat eigentlich keinen tieferen grund außer dass ich gerne überjava lästere ich kann das es liegt nicht daran dass java irgendwie unbenutzbar und totalscheiße wäre java ist ganz okay man kann schon sachen in java machen ansonsten kommtdaher dass halt früher viele scheiß java programme gab auch noch aus zeiten wo es javaapplets gab falls ich noch irgendeiner über an an java applets erinnern kann an anwendungendie halt ewig laden scheiße aussehen und irgendwie sich einfach crappy anfühlen aberman darf nicht vergessen dass gerade im finanzsektor die meisten backends in java sind also sprichwenn ihr auf die seite von eurer bank geht ist die chance dass das da java im hintergrundläuft relativ hoch also man kann mit java ohne probleme gescheite sachen machen undaußerdem muss man das trennen man muss java die programmiersprache trennen von der runtimean sich weil die java runtime wenn man eine ordentliche sprache nimmt ist sicherlich ganzgut ich weiß nicht wieso der direkte vergleich aussehen würde jvm versus dotnet core keineahnung dafür mache ich zu wenig mit java aber ich denke mal so viel schlechter oderbesser wie auch immer wird wenn er beide seiten während beide seiten werden sich wahrscheinlichnicht viel nicht viel nehmen alte hp switches mit java applets sind das schlimmste ja meinmanagement interface hier auf der serverkiste ist noch in java applets ganz abartig warumjava wäre z plus plus nicht leistungsfähiger ja doch wäre es schöner wäre es nicht alsowenn wenn was noch hässlicher als java ist dann ist es z plus plus aber du findest einfachdeutlich mehr programmierer die verstehen oder zumindest nicht so viel scheiße bauenkönnen für java als für z plus plus und wenn die komplexität steigt würde ich sagenhat java trotzdem noch einen vorteil gegenüber z plus plus gerade im bereich wenn es sichersein soll oder zumindest schwerer zu exploiten wenn es um finanzgeschichten geht also dukannst ja quasi in java keine overflows im eigentlichen sinne produzieren in z plus plusist das easy aber ich denke weil der größte faktor ist dass im java im finanzsektor etabliertist und dass du halt recht einfach java programmierer findest wohingegen fähige z plus plus programmiererist deutlich schwieriger bist du aus dem perlzeit alter nein später perlzeit alterwar war noch ein bisschen vor mir man sagt auch die einzige right only spracheso gut easy money easy lifebei mir ist es ja so ich kriege ich gehe vier tage die wochenwoche arbeiten also ichverdiene da ganz gut wir haben es letztes mal angeguckt ich sehe dass ich da im geld schwimmevon oder so aber das ist schon ganz ok dazu kommt noch ein bisschen youtube bisschen reflinkbisschen twitch und nachdem ich halt auch jemand bin der kaum geld ausgibt wird esauch gerade nur mehr aber man weiß nie wofür man es braucht also ich mache das gegenteildavon ich kaufe mir einfach immer wenn ich was haben will kaufe ich es mir ansonstengebe ich kaum geld aus hast du den bachelor gemacht nee so das hat auf fack jetzt habeich was gelöscht was denn hast du große ziele im leben ja ich will mal mehr abos auf youtubeich will mal 300.000 abos auf youtube schaffen dazu müsste ich aber videos machen fährstso gerne den urlaub ich bin früher gerne in urlaub gefahren bin auch früher relativviel geflogen den urlaub aber ich glaube die letzten zehn jahre oder so schon war ichbis auf ein paar kleinere ausflüge nicht mehr lange weg fliegen in 2020 ja ich meine nichtgerade jetzt wäre die ganze corona geschichten keine ahnung kann sein kann sein dass wirdamit auch werben aber die ganzen werbesprüche kannst du eh vergessen ich meine was solldas denn heißen 100 virenscanner 150 firewalls was was soll uns das überhaupt sagen ergibtüberhaupt keinen sinn ja knäher mehr kann man kann man machen weiß aber nicht ob dasgerade so die gute idee ist das ist halt so typisch typischer marketing bullshit circa100 virenscanner 150 firewalls also ich bezweifle dass es 100 virenscanner irgendwie sicherermachen als nur nur dann voll und wenn der traffic wirklich durch 150 firewalls durchmuss dann frage ich mich was sie für eine architektur habenich habe nicht gesagt dass ich mehr videos mache ich habe gesagt ich verspreche erstgar nicht dass ich mehr videos mache keine prime subs chat bleibt um mehr low brain chatheute any primers der blobsrascher schreibt habe heute meinen ersten richtigen job bekommendanke dafür das ist schön wenn das falls ich damit was zu tun habe wahrscheinlichliegt erst einmal hauptsächlich an dir dass du die überzeugt hast habe mich damals vondeinen videos inspirieren lassen was mit informatik zu machen sobald erstes galt kommt gibt'sspende ganz paar subs giften excellent dann ist das ist das chat auch nicht so low braindann ist endlich wieder high iq chat angesagt oh jack 690 zehn monate in folge massive subscriptiones geht es geht auf wer chat ich glaube der chat muss nicht dumm ins bett gehen heuteabendwie high iq bin ich du bist erst ein monat abonnent du bist noch ganz ganz du bist nochnicht high iq das kommt noch das das braucht seine zeit aber du musst dabei bleiben sonstwird das nie was also chat also also wenn die subscription monate iq werden dann werdenwir alle auf dem stand von irgendeinem nordsee krebs das geht ja nicht über zwölf monatevorbei geht ja nicht über zwölf monate drüber oder zehn monate zehn monate glaubedas ist das ist wahrscheinlich noch nicht mal so nordsee krebs was ist das für einsorgen ist es luigi's luigi's menschen nee es soll super mario du wirst nicht gehasstvom chat der chat kann sowas gar nicht das ist support auf oder kundensupport auf odervorniveau selbst alle beauty youtuber auf youtube zusammen haben ja warum streamst dueigentlich in 48 fps ja die fragen kommt öfters das liegt einfach daran weil 48 fps flüssigersind als 30 allerdings fürs einzelne bild mehr von der bitrate übrig bleibt wie bei60 das sieht besser aus und flüssiger ist quasi das beste aus beiden welten flüssigerund besserwas schreibt er hier ich regel mich täglich über die leute auf die nicht am ball bleibendie sind dann meistens auch noch sehr laut oh ja da gibt es viele von die würden amliebsten noch mit dotnet 3.5 entwickeln mit noch nicht immer vier sondern wenn schon35 und dort net core ist böse weil neu ja hast du in allen bereichen jetzt mal unabhängigvon dort net bei uns gibt es auch leute wo ich mich frage ob die die letzten die letztenfünf jahre irgendwie geschlafen haben zum beispiel noch nicht mal erklären könnenwas oder grob der unterschied ist zwischen dem container oder vm oder man ist expertefür email systeme aber kriegt kein smtb richtig konfiguriert oder was haben wir haben so vielewir haben so viele experten in anführungsstriche das ist ja so ein thema wenn ich damit anfangenhöre ich gar nicht mehr auf wir haben so viele experten wo ich mich frage in was die expertesind allerdings höchstwahrscheinlich nicht in dem wofür man sie eingekauft hatcaptain peng schreibt ich habe jetzt gar nicht in chat geguckt ich habe die ganze zeitnur mein tool geguckt schreibt ich studiere informatik und muss mich langsam entscheidenin welche richtung ich mich orientieren will datenverarbeitung aka big data und webentwicklungoder spiele und spiele design und spiele programmierung da kann ich dir nicht helfenbei da kann ich die entscheidung kann ich dir glaube ich nichts nichts gutes dazu ratenalso wenn ihr also v-skatze gefällt beides gleich gleich beides gleich gleich gut ja weildas was du im studium da lernst ist jetzt ja nicht unbedingt das was du später was duspäter 100 prozentig machen wirst keine ahnung keine ahnung da kann ich wirklich nichtszu sagen was hältst du von macbooks ich finde ich finde die meiste apple hardware eigentlichganz gut allerdings viel zu teuer und auch viel zu eingeschränkt ich würde auch mitmac os nicht klarkommen als main betriebssystem wenn ich von windows weg könnte würde ichlinux verwenden allerdings kann ich von windows nicht weg also kann ich auch kein mac verwendenund wenn auf mac installieren kann ich mir auch gleich irgendwas anderes zusammenbauenhabe ich mir auch habe ich hier vorgenommen ja dass wir in nächster zeit auch ein bisschengit magic zusammen machen ist ich das ist aus irgendeiner dummen rtl sendung wenn ichdoch zusammen krieg piss dich alle ist das ist das das hier noch wo sagt er piss dichalle piss dich alle genau piss dich alle das ist so dummpiss dich alle das können wir das können wir echt hinzufügen ja das ist gut ok erstmalrunterladen erstmal fünf schmalier verzeichnis wechsel youtube dl und dann als als welchesformat müssen wir das runterladen als hier m4a meinetwegen ne 140 halbwegs guter qualirunterladen so und jetzt ffm pack input piss dich alde output piss dich waff explore pissdich all piss dich waff ja da ist es doch piss dich aldo perfekt so dann machen wirdas mal hier rein piss dich aldo ja funktioniert sehr gut so langsam aber sicher haben wirdie essentials haben wir drinnen youtube dl funktioniert bei dir oft nicht bei mir machter also ich weiß es immer doof verantwortung nach dem motto ja ich habe keine problemeaber ich habe glaube ich noch nicht ein video nicht runterladen können mit youtube dl einfachmal einfach mal updaten die das aber so wenn du eine alte version hast backt das öftersrum aber das ist ein programm was erstaunlich wenig probleme macht hast du auf rocket beansgesehen die machen eine sendung wo sie programmieren für einschneid das habe ich nicht gesehenzeigt mal wo ist das wo ist das das da wo ist der editor wo ist der ich muss ich mussden editor sehen hier wie es coach okay oh big bra gut jeder fängt mal so an wahnsinndas kriegt man aber auch nach dem ersten tutorial gebacken das war es gibt es da noch mehrseine playlist zuso seit über 14 tagen keine ah doch es war zwei tagen okay was machen sie sonst nochso programmieren jetzt werden bisschen javascript funktion gemacht okay was ich ja was ich jaschon wieder bisschen grinch grinch ich finde ist man sollte den leuten gar nicht beibringendeutsche variable namen zu verwenden zu verwenden man sollte gleich sagen nenn den kram ordentlichund die korrekte variante in javascript wäre an der stelle sogar kebab case also zweiteminus zahl ja und das heißt wirklich kebab case wobei bei variable namen bin ich mirgar nicht sicher variablen variablen in javascript auch kebab kein ach keine ahnung meine variablenamen sind eh viel besser so was wie temp oder i oder blub ich meine bindestrich habeich anders gesagt ich meine bindestrich also ihr kennt meine variable namen die sind eindeutigsuperior die sind excellent die machen die machen kein kalt die rechnen sachen zusammenaber in dem tempo weitermachen wollen kommt das dauert ganz schön lang bis da was ordentlichesrauskommt am ende ich bin eine zeichenkette massive let us aktiviert gleich true das istfalse was jetzt bin ich mal gespannt jetzt bin ich mal gespannt ob es den leuten gleichordentlich zeigen jetzt bin ich mal gespannt ob es den leuten gleich ordentlich zeigenoder ob es oder wie sie es if schreiben falls sie überhaupt ein if machen weil die meistennoobs die meisten noobs schreiben if ist aktiviert gleich gleich true das ist auch im kopferstmal irgendwie das logische das kann man schon zeigen dass man das so schreiben kannaber danach sollte man den auch gleich zeigen dass man das gleich gleich true einfach weglässtweil es kommt das gleiche raus warum ist es denn kein konst ja man kann es ja auch gleichübertreiben wann wann kommt das if es gibt es in den overflow ne oder ach ja was gibtokay was jetzt bin ich mal gespannt was da rauskommt if zweite gleich gleichnull meine augen meine augen warum denn in notepad es ist gar kein notepad ist das notepad plusplus den notepad 2 mod ist das sogar nicht dass das existiert oh jetzt wird erstmalnoch js installiert ah die verbindung ist abgebrochen ok deutschland deutschland undinternet mark zu notepad plus plus nicht doch das ist ok das kann man verwenden wenn manwas braucht was wirklich schnell startet und man nicht auf wie es kaut warten kann ja aberich finde es gut dass sie sowas machen die haben eine gewisse reichweite ich finde esimmer schön wenn mehr leute sich für das thema interessieren unter dem schritt kannes ja nur mehr nur mir zugute kommen dann schlagen vielleicht ein paar mehr leute beimir im stream auf und werden teil des was aber sehr unwahrscheinlich ist dass einervon dem rocket beans video bei mir jetzt auf twitch aufschlägt außerdem machen wir garkein programmierzeug was magst du notepad plus plus nicht gar nichts also die habe ichgerade schon mal antworten ist kann man verwenden hast du die clipboard history an nein habeich nicht an oder doch mehr gibt es nicht ich habe die clipboard history anhörst du spezielle musik beim programmieren ja mache ich es kommt ein bisschen drauf analso ich habe da so zwei zwei betriebsmodis nennen wir es mal so ich habe einmal die sachewo ich mich sehr auf einzelne probleme konzentrieren muss die kompliziert sind dann mache ich meistensentweder sowas hier an irgendwie sowas da collection mix 2019 oder sowas sowas hierdas finde ich eigentlich ganz entspannt sowas manchmal mache ich auch irgendwelche klassikan das ist aber wenn ich mich auf einzelne sachen konzentrieren muss und und die kompliziertsind dann mache ich meistens so an und wenn ich eher so im generellen architektur modebin wo ich mir wo ich mir so gedanken mache was ich so was braucht man da vielleicht fürklassen welche technik nimmt man da da habe ich entweder gar nichts an oder zeugs wasich sonst auch höre lautsprecher oder immer kopfhörer eigentlich immer kopfhörer deswegendas ist auch der der moment wo ich da die die super bequemen kopfhörer anziehe dieich euch letztens mal gezeigt habe und ich dachte schon max hört heavy metal beim programmierenda bei so normalen architektursachen oder wo ich einfach nur ein bisschen nachdenkeund gucke wie man es machen könnte da läuft das normale zeug was ich sonst so höre alsodas kann dann alles mögliche sein das kann dann das kann dann bis zu bis zu dem hiergehen es kann dann bis zu dem hier gehen any bangers aber das ist nicht die richtigeprogrammieren musik das übelst geil dass man einer der besten dass das ist dasrichtig um sql zu programmieren leute das ist das beste für cobalt mit dem tag programmiertvor in feil da das kannst du nicht im tag programmieren ja für sql ist das sicherlichauch sehr nice ich mein für dba ist für datenbank admins der beste titel schlechthin oder ichhoffe das nimmt kein datenbank admins ernst hier alles vorbei flash komplett dd def nullstr drop table genau alles weg ich fand für so esoterische sprache wie brainfuck wärees vielleicht auch nicht schlecht habe ich schon mal gesagt dass dass der dass die musikecht gut ist es ist nicht jedermanns sache aber wenn man auf so vikinger zeug steht istdas einer der besten songs überhaupt all die meistens stehen ja nicht auf vikinger sachenund solche dinger die meisten hören sich lieber keine ahnung aporet an oder so oderwas auch immer da gerade angesagt ist der refreuer ist halt so nice die würd ich mirgerne nochmal mal dasRyulive gesehen enttäuschenlass mich mal ratenich rate mal was dich enttäuscht hatdu kannst mir sagen ob das stimmtich vermute mal, dass manhier verstehst du noch halbwegs wasich denke maldass man livevocal mäßiggesang mäßignichts checktund es auch nicht harmonisch dazu passtich weiß nicht ob dagesang gut hinkommt livedas könnte ich mir vorstellen dass es ein bisschenproblematisch istansonstenwas hat dir denn nicht gefallenwacken fällt aus, ja stimmtdie gamescom fällt auch ausbei dem genre kommt es aufgesang an jaso blöds klingt jawas hältst du von alestormoder sind die piratesja die haben auch ein paar coole sachenaber da habe ichnichts neueresgehört bishervon denenalso was die in den letzten jahren gemacht haben keine ahnungweiß nichtgamescom findet digital stattda bin ich ja mal gespannt wenn wir in deutschlandeine messe rein digital ausrichten wollenda habe ich ja so meine bedenkendass dasgut funktioniertwir sind ja was digital angehtvorne mit dabei immervon unten betrachtetdas erste was passieren wird ist wenn die gamescomder gamescom stream online gehterstmal monka smoke geht erstmal nicht mehrgenau erstmalwegsodas haben wir jetzt ausführlich beantwortetkennst du dich mit kabelnetzen aus neinkeine ahnungmerkel wavezum teufel ist merkel waveneewatdas ist irgendein trollversuchden ich nicht checkealles auf masterforcene das ist nicht was ich unter gitmagic verstehen würdeoh jetzt ist hier big brain timevom flow 690 angesagtwarum steht da so viel kek w im chatwobei da nur einmal kek w vorkommtwas hältst du vor microsoft surfacefinde ich gutfinde ich gutwir haben auf der arbeitein paar surfacewie heißen die books tabletsund auch diesesurface bildschirmedie sind wirklich nicesag nichts böses dann sind wir sauerne finde ich gutdein professor nennt seine getter setzerund geberexquisiteder mag alles auf deutschsetzer und geberwarum geber und nicht holeraber das istja mein wenn er da drauf stehthabe neulich in production codetatsächlich die variable tempund danach die variable temp temp verwendetich mach das laufendauch wenn es nicht schön aussiehtmanchmal wenn du in bestehendesachen was rein quetschen musstwarum nichtalso temp tempkommt selten voraber bei mir heißt esmeistens so die erste variableist tmp und dann hab ich noch ne tempund eventuell noch ne blubich glaube das sind so meinevielleicht noch ii ist auch noch dabeiich glaub diese kombi sind meinewameistverwendetenvariable namentmp temp blub und ine e verwende ich nichtnach i kommt immer jahwir verstehen unsja klarich hab selten sonested schleifen dass ich 3variablen für brauchedas sind so meinemeist benutzten variablenundund mittlerweile ist das schlimme meineteststrings ist oftmals der daist kein witzwenn ihr es bei uns sehen könntetes gibt ein paar scriptsund ein paar sachen wo als defaulttext keqw drin stehtkeqw sorrykequuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu", "segments": [{"id": 1, "start": 60.0, "end": 62.0, "text": "Das war's für heute."}, {"id": 2, "start": 62.0, "end": 64.0, "text": "Ich hoffe, dass ich euch gefallen habe."}, {"id": 3, "start": 64.0, "end": 66.0, "text": "Wenn ihr mehr von uns sehen wollt,"}, {"id": 4, "start": 66.0, "end": 68.0, "text": "dann schreibt mir in die Kommentare,"}, {"id": 5, "start": 68.0, "end": 70.0, "text": "was ihr noch mehr von uns sehen wollt."}, {"id": 6, "start": 70.0, "end": 94.0, "text": "Vielen Dank für's Zuschauen."}, {"id": 7, "start": 100.0, "end": 102.0, "text": "Vielen Dank für's Zuschauen."}, {"id": 8, "start": 130.0, "end": 132.0, "text": "Vielen Dank für's Zuschauen."}, {"id": 9, "start": 160.0, "end": 162.0, "text": "Vielen Dank für's Zuschauen."}, {"id": 10, "start": 190.0, "end": 192.0, "text": "Schreibt mir in die Kommentare, was ihr noch mehr von uns sehen wollt."}, {"id": 11, "start": 192.0, "end": 194.0, "text": "Wenn ihr mehr von uns sehen wollt,"}, {"id": 12, "start": 194.0, "end": 196.0, "text": "dann schreibt mir in die Kommentare,"}, {"id": 13, "start": 196.0, "end": 198.0, "text": "was ihr noch mehr von uns sehen wollt."}, {"id": 14, "start": 228.0, "end": 244.64, "text": "Ich habe mich gemutet. Ah, excellent. Wunder mich schon. Oh, nee, ich glaube ich habe einen"}, {"id": 15, "start": 244.64, "end": 255.72, "text": "Wackelkontakt. Kann das sein? Oh. Monk... Monka... Monarch S. Wackelkontakt. Wackelkontakt"}, {"id": 16, "start": 255.72, "end": 264.48, "text": "in meinem kack Verlängerungskabel. Was ist denn da los? Das geht aber nicht. Verlängerungskabel"}, {"id": 17, "start": 264.48, "end": 278.16, "text": "brauche ich. Dankeschön für den Sub Martin. Huge Big Brain Sub. Du hattest gerade einen"}, {"id": 18, "start": 278.16, "end": 286.44, "text": "Rauschen. Jetzt haben wir wieder gut, oder? Wieso gibt es nicht mal einen Linux hier?"}, {"id": 19, "start": 286.44, "end": 291.6, "text": "Es gibt gar keine. Ich mauze. Oh, ich habe die Umfrage vom letzten Mal noch offen. Wo davon"}, {"id": 20, "start": 291.6, "end": 313.82, "text": "ist es gar nicht abgekackt? Ah, gleich wieder am Start. So. Ja, ich glaube ich habe irgendwie..."}, {"id": 21, "start": 313.82, "end": 318.6, "text": "Entweder bin ich mal zu viel mit dem Stuhl über das Kabel gerollt, wo ich eigentlich"}, {"id": 22, "start": 318.6, "end": 322.76, "text": "aufpasse, dass es nicht so oft passiert, oder das Verlängerungskabel kackt wirklich ab."}, {"id": 23, "start": 322.76, "end": 333.92, "text": "Man weiß es nicht. Ah, Axi, stimmt, wollte ich noch machen, ja. Du hast recht, ich habe"}, {"id": 24, "start": 333.92, "end": 342.6, "text": "nämlich das Repo angelegt. Ich habe nämlich das Repo angelegt und dann habe ich nichts"}, {"id": 25, "start": 342.6, "end": 351.64, "text": "reingepusht. Stimmt, komm mal da. Warum hat das jemand geforkt? Da ist nichts drinnen."}, {"id": 26, "start": 351.64, "end": 365.96, "text": "Sascha, warum hast du das geforkt? Da ist nichts drinnen. Ja, mache ich, habe ich ganz"}, {"id": 27, "start": 365.96, "end": 383.32, "text": "vergessen. Hab ich komplett vergessen. Ja, habe ich wirklich ernsthaft komplett vergessen."}, {"id": 28, "start": 383.32, "end": 390.28, "text": "Leute, ich habe nur Stream angemacht, weil ich so lange nicht mehr gestreamt habe. Ich"}, {"id": 29, "start": 390.28, "end": 396.24, "text": "habe nämlich heute mal geguckt und habe festgestellt, es ist schon wieder vier Tage. Hab ich euch"}, {"id": 30, "start": 396.24, "end": 399.72, "text": "jetzt Mist erzählt? Aber ich bilde mir ein, das war aber nicht gesehen, um vier Tage."}, {"id": 31, "start": 399.72, "end": 406.32, "text": "Jaja. Ah, stimmt. Und mittlerweile sieht übrigens auch Twitch anders aus. Das ist voll MonkaS."}, {"id": 32, "start": 406.32, "end": 414.12, "text": "Da findest du nichts hier. Da findest du nichts. Wie kommst du denn? Wie kommt man jetzt auf"}, {"id": 33, "start": 414.12, "end": 423.24, "text": "die Videos? Irgendwie so, oder? Ah, excellent, verstehe. Und wozu hat das jetzt hier so einen"}, {"id": 34, "start": 423.24, "end": 435.32, "text": "hässlichen Rand, Alter? Das ist ein Cancer Layout. Was ist das denn? Das sieht da mega"}, {"id": 35, "start": 435.32, "end": 443.68, "text": "hässlich aus, Alter. Ja, nee, ich wusste das. Ich hatte es ja vorhin auch schon gefunden."}, {"id": 36, "start": 443.68, "end": 453.84, "text": "Nee, guck mal hier. Vier Tage, sag ich doch. Deswegen, Valorant Key, nö. Gibt's die"}, {"id": 37, "start": 453.84, "end": 459.24, "text": "jetzt oder was? Gibt's die jetzt? Kriegt jetzt jeder eine Valorant Key? Ich hab mir"}, {"id": 38, "start": 459.24, "end": 463.72, "text": "jetzt überlegt, ob ich mir eine Valorant Key besorgen soll oder nicht. Aber ich hab"}, {"id": 39, "start": 463.72, "end": 474.2, "text": "gedacht, ich fahr noch mal ein bisschen. Ach, das ist Mario Kart Musik, ja. Bisschen laut."}, {"id": 40, "start": 474.2, "end": 502.36, "text": "Hä? Warum hab ich denn die IRK auf? Oh, die Emotes sind noch ein bisschen klein. Besser."}, {"id": 41, "start": 502.36, "end": 509.4, "text": "Ja, ich pushe da nachher was rein. Genau, nachdem ich festgestellt hab, der letzte Stream"}, {"id": 42, "start": 509.4, "end": 515.76, "text": "ist, wie gesagt, jetzt schon wieder vier Tage her, bin ich extra mal online gekommen."}, {"id": 43, "start": 515.76, "end": 518.96, "text": "Eigentlich wollte ich heute Abend gar nicht online kommen, sondern weiter ein bisschen"}, {"id": 44, "start": 518.96, "end": 523.84, "text": "Modern Warfare spielen. Ich bin ja in den letzten drei Tage übelst am Modern Warfare"}, {"id": 45, "start": 523.84, "end": 538.52, "text": "grinden. Allerdings zum größten Teil Warzone und ein bisschen Tour-en-Tout. Allerdings,"}, {"id": 46, "start": 538.52, "end": 542.32, "text": "muss ich sagen, der normale Multiplayer ist richtig scheiße. Ich hab jetzt ja ein paar"}, {"id": 47, "start": 542.32, "end": 546.68, "text": "mal einen normalen Multiplayer gespielt zum Waffen anlocken und das Einzige, was in diesem"}, {"id": 48, "start": 546.68, "end": 552.0, "text": "Spiel halbwegs erträglich ist, sind die Spielmodi, die noch schlechter sind. Ist schwierig zu"}, {"id": 49, "start": 552.0, "end": 555.8, "text": "erklären, aber normalerweise hab ich ja in Call of Duty am liebsten Free-for-all und"}, {"id": 50, "start": 555.8, "end": 559.68, "text": "ein bisschen, vielleicht ein bisschen Team Bestmensch dominieren. Am liebsten hab ich"}, {"id": 51, "start": 559.68, "end": 567.4, "text": "eigentlich Free-for-all gespielt. Allerdings ist jeder normale Spielmodus in Modern Warfare"}, {"id": 52, "start": 567.4, "end": 575.28, "text": "so extrem krass passives Ecken abamen, dass du dir fast schon vorkommst, als bist du irgendwie"}, {"id": 53, "start": 575.28, "end": 584.4, "text": "in CS und deswegen spiel ich am liebsten, um Waffen zu anlocken, einfach stinknormales,"}, {"id": 54, "start": 584.4, "end": 596.2, "text": "wie heißt diese Playlist, Shipment und Rust und Shoot House und sowas. Das ist zwar eigentlich"}, {"id": 55, "start": 596.2, "end": 601.64, "text": "richtiger Müll, aber es ist deutlich erträglicher als der normale Multiplayer, einfach weil"}, {"id": 56, "start": 601.64, "end": 609.6, "text": "es total hirnlos respawn, ballern, respawn, respawn, ballern, ballern, respawn ist. Der"}, {"id": 57, "start": 609.6, "end": 622.44, "text": "normale Multiplayer regt auf. Genau, so siehts aus. Ne, der normale Multiplayer ist wirklich"}, {"id": 58, "start": 622.44, "end": 632.12, "text": "Müll, finde ich. So und was allerdings Spaß macht, was ich nicht erwartet hätte ist,"}, {"id": 59, "start": 632.12, "end": 637.72, "text": "Tour and Tour macht Spaß. Ich hab gestern irgendwie 12 Runden oder so gespielt, nicht"}, {"id": 60, "start": 637.72, "end": 646.12, "text": "einmal verloren, was allerdings an meine Mitspieler lag und nicht an mir. Und Warzone macht auch"}, {"id": 61, "start": 646.12, "end": 651.72, "text": "Spaß, wobei ich sagen muss, dass mir Solo Warzone nicht so wahnsinnig Spaß macht. Solo"}, {"id": 62, "start": 651.72, "end": 663.48, "text": "Warzone krankt so ein bisschen da dran, wie der normale Multiplayer. Autsch, vor mein"}, {"id": 63, "start": 663.48, "end": 669.44, "text": "Arm verdreht irgendwie. Krankt so ein bisschen wie der normale Multiplayer, dass es halt"}, {"id": 64, "start": 669.44, "end": 677.8, "text": "extremes rumgeschimmelt ist. Und ich hab halt kein Bock, 20 Minuten zu spielen und 5 Gegner"}, {"id": 65, "start": 677.8, "end": 688.72, "text": "zu sehen. Man kann natürlich auch krass auf Kills spielen, das geht auch, allerdings"}, {"id": 66, "start": 688.72, "end": 695.12, "text": "ist es dann halt sehr random. Mal machst du 11 Kills in irgendwie 5 Minuten oder 3"}, {"id": 67, "start": 695.12, "end": 704.4, "text": "Minuten oder so und mal ein bisschen direkt down. Also es ist schwierig, also am meisten"}, {"id": 68, "start": 704.4, "end": 711.52, "text": "Bock macht Warzone mit mehreren Leuten. Ich bräuchte irgendeinen, der mich mal ein bisschen"}, {"id": 69, "start": 711.52, "end": 720.36, "text": "coacht in dem Game. Ohne Scheiß. Also mal observed, geguckt, wie ich spiele und mir"}, {"id": 70, "start": 720.36, "end": 727.48, "text": "dann ein paar Tipps gibt. Weil so holt man schneller auf, dass man jetzt einfach 2 Monate"}, {"id": 71, "start": 727.48, "end": 741.24, "text": "hinten dran ist mit Game üben. Frag den Patrick, der krasse Warzone-Owner mit 6 Kills. 11 Kills"}, {"id": 72, "start": 741.24, "end": 746.68, "text": "war so ein Beispiel. Das war glaube ich das Game mit den höchsten Kills, was ich bisher"}, {"id": 73, "start": 746.68, "end": 758.96, "text": "hatte, war 11 Kills auf, die Map ist immer die gleiche oder? Warzone ist immer die gleiche"}, {"id": 74, "start": 758.96, "end": 764.88, "text": "Map, oder? Da bin ich in der Mitte abgesprungen auf dem Teil der Map, der aussieht wie die"}, {"id": 75, "start": 764.88, "end": 771.32, "text": "Ground War Map. Es ist schwierig Warzone Call of Duty Modern Warfare Maps zu beschreiben,"}, {"id": 76, "start": 771.32, "end": 780.2, "text": "die sind, in dem Game sehen die alle irgendwie so hingeklatscht aus. Und in diesen Industriehäusern,"}, {"id": 77, "start": 780.2, "end": 785.96, "text": "da ging es halt übelst ab. Ich habe übrigens Subs übersehen, glaube ich. Dom PC 5 Monate,"}, {"id": 78, "start": 785.96, "end": 793.56, "text": "excellent Subscription, huge. Dankeschön für den Sub und wen haben wir hier noch? Den"}, {"id": 79, "start": 793.56, "end": 814.72, "text": "Arrow, OD, Twitch Prime. Wahnsinn. Big Brain Subscribers bitte. Ähm, Matt, da verlernt"}, {"id": 80, "start": 814.72, "end": 821.2, "text": "man aber nichts. Er schreibt gerade, er schreibt hier gerade, ähm, habe ich es eigentlich"}, {"id": 81, "start": 821.2, "end": 826.04, "text": "hier mitgeloggt? Ne. Er schreibt gleich, ich soll ein Video hochladen, dann kommen ja relativ"}, {"id": 82, "start": 826.04, "end": 833.12, "text": "schnell die Experten, die mir sagen, was ich falsch mache. Das ist ungefähr wie, also"}, {"id": 83, "start": 833.12, "end": 838.0, "text": "wenn man auf YouTube Kommentare hört, was man in seinem Gameplay verbessern soll, dann"}, {"id": 84, "start": 838.0, "end": 851.6, "text": "ist das ungefähr so, wie wenn man sich, ähm, bei MMOs an Reddit orientiert. Das ist so,"}, {"id": 85, "start": 851.6, "end": 857.28, "text": "das gibt so ein paar Dinge, die gehen immer nach hinten los. Die YouTube Comments sind"}, {"id": 86, "start": 857.28, "end": 862.88, "text": "einfach nur Bullshit von Leuten, die selbst keine Ahnung haben, in 90% der Fälle. Und,"}, {"id": 87, "start": 862.88, "end": 868.48, "text": "ähm, Leute, die MMOs spielen und auf Reddit rumspammen dazu, was OP ist und was schlecht"}, {"id": 88, "start": 868.48, "end": 872.12, "text": "ist und sonst was sacken einfach nur in dem Game meistens. Was eigentlich gerade so für"}, {"id": 89, "start": 872.12, "end": 880.84, "text": "Trends auf GitHub. Zum Beispiel, es gibt ein richtig gutes Beispiel, warum Reddit sackt,"}, {"id": 90, "start": 880.84, "end": 886.08, "text": "also in dem Fall, warum Reddit voller Noobs ist. Ich hab die letzte Season Path of Exile"}, {"id": 91, "start": 886.08, "end": 890.84, "text": "gespielt, als Ultra Noob. Ich hab das Spiel gespielt, ein bisschen, als es rausgekommen"}, {"id": 92, "start": 890.84, "end": 896.52, "text": "ist, auch mit dem Frisör zusammen. Und danach hab ich ewig nicht mehr gespielt. So. Letzte"}, {"id": 93, "start": 896.52, "end": 904.0, "text": "Season hab ich mir bis ein paar Builds durchgelesen, hab relativ schnell den Build identifiziert,"}, {"id": 94, "start": 904.0, "end": 910.72, "text": "der absolut Noobstyle für jeden Volldeb zu spielen ist und hab angefangen. Und ich hab"}, {"id": 95, "start": 910.72, "end": 914.96, "text": "nebenbei immer ein bisschen Forum und Reddit gelesen und ich dachte am Anfang, ich brauch"}, {"id": 96, "start": 914.96, "end": 922.16, "text": "ein Build, was maximal so 5-6 Chaos Orbs kostet, weil ein Build, was viel kostet, ist kein"}, {"id": 97, "start": 922.16, "end": 928.84, "text": "richtiges Build und so. Totaler Schwachsinn. Reddit, Alter. Reddit. Feels Reddit, man."}, {"id": 98, "start": 928.84, "end": 935.2, "text": "Totaler Bullshit. Ähm, ich hab dann gespielt und ich hatte, glaub ich, schon, als ich im"}, {"id": 99, "start": 935.2, "end": 942.96, "text": "Endgame angekommen bin, 20 Chaos Orbs oder so. Es ist total hingeklebt. Reddit. Reddit"}, {"id": 100, "start": 942.96, "end": 955.48, "text": "ist einfach nur voller Kacknoobs. Real Reno sagt, hey, du bist doch dieser Commentary-Typ,"}, {"id": 101, "start": 955.48, "end": 960.48, "text": "den ich vor ein paar Jahren mal gefeiert hab. Das kann ich, das weiß ich nicht, ob ich"}, {"id": 102, "start": 960.48, "end": 969.6, "text": "das bin. Möglich wär's. Also wenn du den hier meinst, wenn du den hier meinst, ähm,"}, {"id": 103, "start": 969.6, "end": 988.76, "text": "dann bin ich das nicht. Ich hör mich nur ähnlich an. Den Keks hab ich nur geklaut,"}, {"id": 104, "start": 988.76, "end": 994.4, "text": "ja. Na, ich war halt ziemlicher Max-Fanboy und dann hab ich den Keks leicht abgeändert"}, {"id": 105, "start": 994.4, "end": 1006.96, "text": "und auch auf Twitch genommen. So, also was trendet denn heute auf GitHub? Was gibt's"}, {"id": 106, "start": 1006.96, "end": 1019.4, "text": "denn da Schönes? Mr. Whip, warum hast du denn, warum hast du denn dieses Video jetzt"}, {"id": 107, "start": 1019.4, "end": 1028.04, "text": "rausgesucht? Das ist ja uralt. Guck mal, was er hier für ein Video rausgefischt hat. Ja,"}, {"id": 108, "start": 1028.04, "end": 1043.96, "text": "ja, Achtung, Achtung. Kennt das noch jemand? Ja, 2011. Lass das gemeinsam, nein, das konnten"}, {"id": 109, "start": 1043.96, "end": 1056.4, "text": "wir nicht gemeinsam. Das ist eine, es ist zwei Stunden. What the fuck? Was haben wir denn"}, {"id": 110, "start": 1056.4, "end": 1074.84, "text": "bitte schon zwei Stunden gelabert, ey? 1200 Comments, Alter. Ich muss euch was ekliges"}, {"id": 111, "start": 1074.84, "end": 1079.16, "text": "erzählen, Leute. Ich weiß nicht, ob mir's wirklich nicht gut, ob mir's irgendwie ein"}, {"id": 112, "start": 1079.16, "end": 1083.96, "text": "bisschen übel ist oder ob das nur so eingebildet ist. Und zwar, ich hab vorhin, äh, bevor"}, {"id": 113, "start": 1083.96, "end": 1088.04, "text": "ich Stream angemacht hab, hab ich in der Küche unten gesessen, hab ein Brötchen gefuttert"}, {"id": 114, "start": 1088.04, "end": 1095.52, "text": "und hab halt ein Glas Wasser eingeschränkt, Glas Wasser ausgedrungen. Ich trinke, also,"}, {"id": 115, "start": 1095.52, "end": 1101.04, "text": "ich trinke immer alles auf einmal. Also, ich schütte, ich mach das Glas von unten bis"}, {"id": 116, "start": 1101.04, "end": 1107.88, "text": "oben voll und dann mach ich das ganze Glas weg. Also, selten mal mit absetzen zwischendurch."}, {"id": 117, "start": 1107.88, "end": 1115.32, "text": "So, und während ich das so leer trinke, ne, dann hebt man das Glas immer weiter nach oben"}, {"id": 118, "start": 1115.32, "end": 1121.64, "text": "und während ich das so leer trinke, kann man ja so durch das Glas durchschauen. Und"}, {"id": 119, "start": 1121.64, "end": 1131.64, "text": "ich trinke das so und ich denke mir auf der Rückseite, vom Glas hängt was. So, dann trinke"}, {"id": 120, "start": 1131.64, "end": 1138.28, "text": "ich weiter, trinke ich weiter und sehe, hä, warum hängt auf diesem komischen Stück Dreck"}, {"id": 121, "start": 1138.28, "end": 1143.92, "text": "oder so unten am Glas, warum sind da Blasen drauf. Trinke ich weiter und stell fest, äh,"}, {"id": 122, "start": 1143.92, "end": 1149.96, "text": "der Dreck ist innen im Glas drinne. Da hab ich halt, hab ich halt abgesetzt und da war"}, {"id": 123, "start": 1149.96, "end": 1159.32, "text": "unten, unten am Boden vom Glas, war so ein daumennagelgroßer Stück Schleim. Ich hab"}, {"id": 124, "start": 1159.32, "end": 1174.08, "text": "keine Ahnung, was es ist. Sah übelst eklig aus. Da hab ich natürlich nicht weitergeschirrt"}, {"id": 125, "start": 1174.08, "end": 1178.28, "text": "und gleich weggeschirrt, aber es war schon eklig, ja. Und ich hab keine Ahnung, was"}, {"id": 126, "start": 1178.28, "end": 1194.16, "text": "ich da, was ich da im Glas drinne hab. Ja, aber ich hab meinen Mundschutz auf. Leute,"}, {"id": 127, "start": 1194.16, "end": 1205.72, "text": "genauso eklig wie der Chat jetzt tut, war das auch. Deswegen trinkt man aus der Flasche,"}, {"id": 128, "start": 1205.72, "end": 1216.2, "text": "das geht nicht. Ich kann nicht, ich kann nicht ähm aus der Flasche trinken. Geht nicht,"}, {"id": 129, "start": 1216.2, "end": 1220.2, "text": "also geht wirklich nicht, weil ich hab keine Flasche, ich hab keine Flasche im eigentlichen"}, {"id": 130, "start": 1220.2, "end": 1233.72, "text": "Sinn. Ich hab sowas hier. Soda Club Sprudler. Sowas da hab ich. Allerdings mit solchen,"}, {"id": 131, "start": 1233.72, "end": 1244.64, "text": "solche Plastikflaschen hier. Da kann man nicht raustrinken aus den Flaschen. Aus dem"}, {"id": 132, "start": 1244.64, "end": 1251.68, "text": "Wasserhahn, alter. Nee, Wasser, ich trink, ich mag kein stilles Wasser. Das muss ich,"}, {"id": 133, "start": 1251.68, "end": 1258.08, "text": "muss gespudelt sein. Und mittlerweile, ich hab, ich hab das ja schon, keine Ahnung,"}, {"id": 134, "start": 1258.08, "end": 1266.32, "text": "15 Jahre oder so. Wir haben das lange, dieses Zeug schon hier. Und also solche Geräte und"}, {"id": 135, "start": 1266.32, "end": 1271.84, "text": "ich hab mich so an den Geschmack gewöhnt von unserem Leitungswasser hier, dass mir"}, {"id": 136, "start": 1271.84, "end": 1278.0, "text": "jedes andere Wasser gar nicht mehr schmeckt. Und das ekligste Wasser finde ich ist, warte"}, {"id": 137, "start": 1278.0, "end": 1289.04, "text": "mal, ist das Haccia, das grüne? Ist das grüne Wasser Haccia? Nee. Äh nee, Bad, Bad, Filbler"}, {"id": 138, "start": 1289.04, "end": 1302.96, "text": "Quelle oder so gibt's da noch? Das da. Ur- Quelle. Ey, das schmeckt total eklig. Ach,"}, {"id": 139, "start": 1302.96, "end": 1308.6, "text": "was ist der Name? Bad Filbler Ur- Quelle. Dann lieber noch die Rheinfels Quelle, falls"}, {"id": 140, "start": 1308.6, "end": 1315.52, "text": "ihr noch einer auf YouTube kennt. Das schmeckt eklig. Schmeckt so, als wäre da irgendwie"}, {"id": 141, "start": 1315.52, "end": 1325.8, "text": "Salz reingemischt oder irgendwas. Hanauer Leitungswasser, beste. Sei euch. Monkabär,"}, {"id": 142, "start": 1325.8, "end": 1335.12, "text": "Monack Ess. Das Wasser in Deutschland ist so gut, kann man immer trinken, das stimmt."}, {"id": 143, "start": 1335.12, "end": 1343.08, "text": "Wie heißt dieses Wasser nochmal? Was die destillieren und danach wieder Salz und Zeugs"}, {"id": 144, "start": 1343.08, "end": 1349.32, "text": "zusetzen, dass es immer gleich schmeckt? Da gibt's irgend so ein Markenwasser, wo die"}, {"id": 145, "start": 1349.32, "end": 1356.92, "text": "Wasser destillieren und danach wieder umwandeln. Überkinger? Was zum Geier ist Überkinger?"}, {"id": 146, "start": 1356.92, "end": 1367.2, "text": "Hört sich an wie irgendeine spanische Pornseite. Nee, hab ich noch nie gehört. Was? Fiji?"}, {"id": 147, "start": 1367.2, "end": 1380.2, "text": "Hab ich auch noch nie gehört. Ist das das? Das könnte das sein, ja. Ja, ich glaub das"}, {"id": 148, "start": 1380.2, "end": 1398.44, "text": "ist das. Ich glaub das ist das. Das könnte das wirklich sein. Nee, oder? Nee, nee, das"}, {"id": 149, "start": 1398.44, "end": 1404.68, "text": "ist es nicht, nein. Es könnte Apollinaris sein, was ich meine. Ich bin mir aber nicht"}, {"id": 150, "start": 1404.68, "end": 1416.84, "text": "erkannt, ich aus total bescheuert. Total bescheuert erstmal. Der Kommentator ist da, Ruby. Also"}, {"id": 151, "start": 1416.84, "end": 1421.52, "text": "was trendet denn aktuell gerade so auf GitHub? Zeig mal her. Deno, ja das wollten wir uns"}, {"id": 152, "start": 1421.52, "end": 1427.2, "text": "auch mal im Stream angucken. Ich hab die Existenzberechtigung noch nicht so ganz verstanden ehrlich gesagt"}, {"id": 153, "start": 1427.2, "end": 1433.2, "text": "von Deno, weil das wichtigste an Javascript sind eigentlich die 30 Milliarden Pakete die"}, {"id": 154, "start": 1433.2, "end": 1438.4, "text": "es gibt. Wenn ich die alle nicht verwenden kann, warum soll ich dann Deno verwenden?"}, {"id": 155, "start": 1438.4, "end": 1445.48, "text": "Das verstehe ich noch nicht. Naja, gut. Dann trendet noch irgendwelche Corona Simulationen."}, {"id": 156, "start": 1445.48, "end": 1452.4, "text": "Ey, ich sag ja in letzter Zeit wenig über Corona und sonst was. Ich rant immer immer"}, {"id": 157, "start": 1452.4, "end": 1457.32, "text": "zwei Minuten und so, aber ich muss jetzt mal was loswerden, weil aktuell, wenn man auf"}, {"id": 158, "start": 1457.32, "end": 1466.36, "text": "Twitter guckt, ne? Schauen wir mal. Twitter Trends. Ach nee. Ah nee, es trendet gerade"}, {"id": 159, "start": 1466.36, "end": 1477.16, "text": "irgendwelche AfD-Geschichten. Okay, das kommt auch zu abwechselnd immer mal wieder. Genau,"}, {"id": 160, "start": 1477.16, "end": 1485.12, "text": "also es trendet ja total oft auf Twitter gerade irgendwelche Verschwörungsgeschichten und"}, {"id": 161, "start": 1485.12, "end": 1492.28, "text": "dann Leute, die sich lächerlich machen über Verschwörungsleute. Dann gibt es welche,"}, {"id": 162, "start": 1492.28, "end": 1497.16, "text": "die sagen, wir sind besorgt wegen Corona-Maßnahmen. Dann gibt es Leute, die posten an ihr, wie"}, {"id": 163, "start": 1497.16, "end": 1504.6, "text": "heißt das? Covid-Idioten. Ihr seid ja alle total bescheuert. Also quasi jeder versucht"}, {"id": 164, "start": 1504.6, "end": 1520.76, "text": "mal wieder die Welt zu verbessern auf Twitter. Und was dabei total untergeht, ist, ähm,"}, {"id": 165, "start": 1520.76, "end": 1525.04, "text": "ich muss mal kurz überlegen, wie ich das am besten ausdrücke. Also was da komplett"}, {"id": 166, "start": 1525.04, "end": 1533.04, "text": "untergeht, ist, dass es durchaus von allen beteiligten Parteien, also Parteien mache"}, {"id": 167, "start": 1533.04, "end": 1539.28, "text": "ich jetzt Leute, unterschiedliche Gruppierungen, die an diesen Sachen da beteiligt sind, dass"}, {"id": 168, "start": 1539.28, "end": 1547.84, "text": "alle die ein oder anderen sinnvollen Punkte haben. Allerdings, sobald du zum Beispiel"}, {"id": 169, "start": 1547.84, "end": 1554.48, "text": "auf Twitter schreibst, was ist denn gerade angesagt, ja hier Freiheit wird wegen Corona"}, {"id": 170, "start": 1554.48, "end": 1558.6, "text": "eingeschränkt, hast du gleich die Leute, die dann übelst drauf abgehen, Max, du willst"}, {"id": 171, "start": 1558.6, "end": 1566.36, "text": "das Leute verrecken, oder wenn du umgedreht schreibst, ich glaube, ich hab ja gepostet,"}, {"id": 172, "start": 1566.36, "end": 1569.52, "text": "man kann den Leuten schlicht und ergreifend nicht trauen, sich an Maßnahmen zu halten,"}, {"id": 173, "start": 1569.52, "end": 1572.72, "text": "deswegen wird es wahrscheinlich wieder hochgehen. Da kamen auch schon die ersten, die gesagt"}, {"id": 174, "start": 1572.72, "end": 1577.72, "text": "haben, das hat doch alles nichts gebracht, Shutdown umsonst, ganze Maßnahmen umsonst,"}, {"id": 175, "start": 1577.72, "end": 1585.04, "text": "wir werden verarscht. Also sprich, egal was du sagst, die andere Seite springt immer komplett"}, {"id": 176, "start": 1585.04, "end": 1592.8, "text": "drauf, was halt total untergeht ist, dass alle Seiten, wenn man mal genau guckt, schon sinnvolle"}, {"id": 177, "start": 1592.8, "end": 1597.92, "text": "Punkte haben und ein Punkt, wo ich da an sich bin, dass der viel zu wenig angesprochen"}, {"id": 178, "start": 1597.92, "end": 1602.64, "text": "wird ist, da wirst du aber auch schon wieder gesteinigt auf Twitter, wenn du das schreibst,"}, {"id": 179, "start": 1602.64, "end": 1615.64, "text": "oder? Ich sehe die Einschränkungen der Grundrechte in Deutschland auch kritisch, aber ich sag"}, {"id": 180, "start": 1615.64, "end": 1626.68, "text": "nicht, dass es unsinnig ist. Man muss sich mal überlegen, wie man, also man könnte das"}, {"id": 181, "start": 1626.68, "end": 1632.68, "text": "viel besser an die Leute kommunizieren, warum man Sachen macht, und das vermisse ich ein"}, {"id": 182, "start": 1632.68, "end": 1637.04, "text": "bisschen. Zum Beispiel, wenn man jetzt sagt, Leute, bleiben wir mal bei einem ganz einfachen"}, {"id": 183, "start": 1637.04, "end": 1647.0, "text": "Beispiel, wenn man sagt, Leute, alle Eisdielen müssen dicht machen, weil Corona. So, dann"}, {"id": 184, "start": 1647.0, "end": 1652.28, "text": "ist das erstmal, man stellt die Leute vor vollendete Tatsachen und sagt, weil Corona,"}, {"id": 185, "start": 1652.28, "end": 1659.04, "text": "die Sache ist bloß die, weil Corona ist keine sinnvolle Begründung. Man müsste, und das"}, {"id": 186, "start": 1659.04, "end": 1664.44, "text": "würde auch den ganzen Verschwörungstheorien vorbeugen, und das würde auch, das würde"}, {"id": 187, "start": 1664.44, "end": 1669.08, "text": "sehr viele Sachen vorbeugen, wenn man die Maßnahmen, die man trifft, ordentlich erklärt."}, {"id": 188, "start": 1669.08, "end": 1677.4, "text": "Also sprich, wenn man sagt, ja, wir haben jetzt ABC-Maßnahmen beschlossen, und wir"}, {"id": 189, "start": 1677.4, "end": 1682.52, "text": "haben diese Maßnahmen beschlossen aus diesen und diesen Gründen, wir haben uns überlegt,"}, {"id": 190, "start": 1682.52, "end": 1689.76, "text": "was man sonst noch machen kann. Uns ist bewusst, dass man zum Beispiel hier schon stark in"}, {"id": 191, "start": 1689.76, "end": 1695.32, "text": "die Grundrechte eingreift, aber wir sind zu dem Schluss gekommen, das geht nicht anders,"}, {"id": 192, "start": 1695.32, "end": 1699.48, "text": "weil so und so, wir haben uns die und die Punkte überlegt, aber die funktionieren aus diesen"}, {"id": 193, "start": 1699.48, "end": 1705.96, "text": "Gründen nicht, deswegen müssen wir es so machen. So, und wenn man das machen würde,"}, {"id": 194, "start": 1705.96, "end": 1710.76, "text": "dann würden das auch vielen Sachen vorbeugen. Glaubst du, dass die Leute so eine lange Aufmerksamkeit"}, {"id": 195, "start": 1710.76, "end": 1714.36, "text": "sparen haben? Na, wenn die Leute so doof sind, mal zwei Minuten sich das anzugucken, da haben"}, {"id": 196, "start": 1714.36, "end": 1723.08, "text": "sie halt gelitten, aber es würden allen anderen total den Wind aus den Segeln nehmen. Die,"}, {"id": 197, "start": 1723.08, "end": 1727.72, "text": "die sich das geben, denken, selbst das glaube ich nicht. Nachdenken ist nicht so verbreitet."}, {"id": 198, "start": 1727.72, "end": 1735.72, "text": "Das müsste man erklären. Dann nimmst du komplett den anderen Seiten auch den Wind aus den Segeln,"}, {"id": 199, "start": 1735.72, "end": 1740.68, "text": "dann kommt keiner mehr an und erzählt, dass irgendwie Bill Gates die Leute zwangsimpfen"}, {"id": 200, "start": 1740.68, "end": 1745.6, "text": "will und mit Mikrochips versorgen will und sonst was und das im Deckmantel der Corona-Maßnahmen"}, {"id": 201, "start": 1745.6, "end": 1752.2, "text": "und bla und sonst was. Man muss, wenn man Entscheidungen trifft, das ist jetzt nicht"}, {"id": 202, "start": 1752.2, "end": 1758.24, "text": "nur so von oben, von der Regierung herab, man muss eigentlich immer, wenn man Entscheidungen"}, {"id": 203, "start": 1758.24, "end": 1763.24, "text": "trifft, die Auswirkungen auf Leute haben, muss man die erklären können. Wenn man die"}, {"id": 204, "start": 1763.24, "end": 1769.04, "text": "erklären kann, dann ist die Chance relativ gut, dass die Leute es zumindest nachvollziehen"}, {"id": 205, "start": 1769.04, "end": 1774.64, "text": "können, warum was passiert und man überzeugt Leute viel einfacher damit, wenn man ihnen"}, {"id": 206, "start": 1774.64, "end": 1779.44, "text": "erklärt, warum man was macht, als wenn man ihnen einfach sagt, wir machen das und so"}, {"id": 207, "start": 1779.44, "end": 1789.0, "text": "ist es. Seit wann interessieren sich Verschwörungstheoretiker für Fakten? Es interessieren sich relativ"}, {"id": 208, "start": 1789.0, "end": 1794.92, "text": "viele Leute für Fakten, die Hardcore-Verschwörungstheoretiker vielleicht nicht, allerdings sind das ja"}, {"id": 209, "start": 1794.92, "end": 1801.6, "text": "Leute, die werden ja nicht als Verschwörungstheoretiker geboren. Es gibt ein paar Leute, die der Meinung"}, {"id": 210, "start": 1801.6, "end": 1806.96, "text": "sind, dass Obamas Bodyguard ein Exenmensch ist oder sowas oder dass die Erde flach ist"}, {"id": 211, "start": 1806.96, "end": 1813.4, "text": "oder dass Bill Gates uns Mikrochippen will oder sowas, aber es werden auch Leute mit"}, {"id": 212, "start": 1813.4, "end": 1821.12, "text": "einer Zeit zu Verschwörungstheoretikern, weil sie überzeugt werden, dass da was dran sein"}, {"id": 213, "start": 1821.12, "end": 1828.56, "text": "muss und wenn du auf der anderen Seite die Sachen besser erklärst, nimmst du denen"}, {"id": 214, "start": 1828.56, "end": 1843.24, "text": "einen kompletten Wind aus den Segeln. Naja, das vermisse ich so ein bisschen, bei vielen"}, {"id": 215, "start": 1843.24, "end": 1846.56, "text": "Sachen, man muss das ordentlich erklären, nur wenn man Sachen ordentlich erklärt, kann"}, {"id": 216, "start": 1846.56, "end": 1854.8, "text": "man Leute davon überzeugen. Kobold, oh hör mal auf ey. Alter Kobold, aber wir machen"}, {"id": 217, "start": 1854.8, "end": 1861.34, "text": "noch einen Kobold-Stream. Heute ist ja nur aus der Reihe Stream. Eigentlich, ich war"}, {"id": 218, "start": 1861.34, "end": 1867.4, "text": "gerade einkaufen, eigentlich hab ich noch ein paar Waffen-Attachments frei, dann hab"}, {"id": 219, "start": 1867.4, "end": 1870.56, "text": "ich gesagt, nee ich hab schon 4 Tage nicht mehr gestreamt, ich muss jetzt ne Runde streamen."}, {"id": 220, "start": 1870.56, "end": 1891.64, "text": "Dann geh ich halt wieder, mach was willst. Du musst aber, Moment, Patrick, ich seh gerade,"}, {"id": 221, "start": 1891.64, "end": 1904.48, "text": "du musst noch subscriben. So als Obermod, wie geht das ey. Hast du schon was zu Kot gesagt,"}, {"id": 222, "start": 1904.48, "end": 1911.6, "text": "ja hab ich. Nein, also Leute, keiner, ich hab grad gesagt, man muss Sachen erklären"}, {"id": 223, "start": 1911.6, "end": 1920.08, "text": "und keiner muss subscriben, ich banne niemand, der nicht subscribt. Oh ClocksHD ist da. Oh"}, {"id": 224, "start": 1920.08, "end": 1939.08, "text": "bei, vielleicht doch. Und weißt ja nicht. Ja nee, ich sehs doch, du hast doch diesen"}, {"id": 225, "start": 1939.08, "end": 1948.56, "text": "First Subscription. Ich glaube, das ist damit dabei irgendwie. Oder auch nicht, ach was"}, {"id": 226, "start": 1948.56, "end": 1961.6, "text": "auch immer, ist wurscht. Hast du schon was zu Kot gesagt, ja, dass der Multiplayer scheiße"}, {"id": 227, "start": 1961.6, "end": 1969.36, "text": "ist, aber Warzone und 2versus2 ganz gut ist. Der Kommentator, das stimmt nicht, du hast"}, {"id": 228, "start": 1969.36, "end": 1990.52, "text": "5 Monate subscribt. Fehlt da nicht noch was? Fehlt da nicht noch was? Geht das nicht noch"}, {"id": 229, "start": 1990.52, "end": 2003.12, "text": "weiter? Ich glaub, das ist nur die halbe Copypasta. Oh glaubt mir, ich kenne viele Twitch Copypastas."}, {"id": 230, "start": 2003.12, "end": 2032.24, "text": "Ach Leute, wir müssen übrigens noch was machen. Äh, warte mal. No Happy Meal for"}, {"id": 231, "start": 2032.24, "end": 2050.8, "text": "10 Monate, dankeschön. Excellent Subscription. Leute, wir müssen jetzt mal was checken. Mach"}, {"id": 232, "start": 2050.8, "end": 2063.76, "text": "den Virgin-Check. Das ist auch so total dämliche Copypasta, die ich letztens gefunden hab. Das"}, {"id": 233, "start": 2063.76, "end": 2087.44, "text": "ist richtig dumm, oder? So. Okay, ich wollte mir ja gucken, was gerade auf Github trendet."}, {"id": 234, "start": 2087.44, "end": 2106.12, "text": "Ähm, das haben wir, Java Zeugs, Igitt. Hör mal auf, muss das jetzt sein? Wow, juckt mich"}, {"id": 235, "start": 2106.12, "end": 2119.0, "text": "überhaupt nicht. Facebook, IOS, SDK, die machen von nix halt, oder? Was ist das? Super"}, {"id": 236, "start": 2119.0, "end": 2126.28, "text": "Mario 64 decompiled. Ach, das kenn ich, das haben wir uns doch schon mal angeguckt. Ich"}, {"id": 237, "start": 2126.28, "end": 2130.12, "text": "glaube, die haben es mittlerweile sogar geschafft, dass ein komplettes laufiges Game rauskommt."}, {"id": 238, "start": 2130.12, "end": 2154.0, "text": "Was ist das? A new bootable USB-Solution. Was ist das? Äh, ein USB-Stick? Create bootable"}, {"id": 239, "start": 2154.0, "end": 2164.44, "text": "USB-Drive. Hä? Das ist ja so absolut nichts Neues, oder? Da kann man USB-Sticks machen"}, {"id": 240, "start": 2164.44, "end": 2169.08, "text": "mit Images drauf. Ja gut, es macht dann einen fertigen USB-Stick mit einem schönen Menü."}, {"id": 241, "start": 2169.08, "end": 2173.16, "text": "Das ist eigentlich ganz nett. Das kann man bestimmt mal brauchen, das speichere ich mir."}, {"id": 242, "start": 2173.16, "end": 2179.72, "text": "Wobei man sagen muss, ich glaube, ich hab schon seit einem Jahr nicht mehr normalen"}, {"id": 243, "start": 2179.72, "end": 2191.68, "text": "Rechner oder länger normalen Rechner vom USB-Stick gebootet. Moment, was? Augmented Reality"}, {"id": 244, "start": 2191.68, "end": 2204.04, "text": "Copy und Paste. Ah, irgendwelches VR Zeug. Das ist so eine typische JavaScript-Geschichte"}, {"id": 245, "start": 2204.04, "end": 2213.48, "text": "wieder. Es gibt ja noch nicht genug Bundler und Minifier für JavaScript. Jetzt gibt es"}, {"id": 246, "start": 2213.48, "end": 2222.88, "text": "auch noch einen Go. Das ist eine typische JavaScript-Geschichte. Ich glaube, es vergeht"}, {"id": 247, "start": 2222.88, "end": 2233.48, "text": "kein Tag, wo nicht 10 neue, gehypte JavaScript-Libraries rauskommen. Viel Spaß beim Einkaufen, ja. Vielleicht"}, {"id": 248, "start": 2233.48, "end": 2242.72, "text": "finden sie irgendwie ein Kobold-Buch. Wobei, ich glaube, im Edeka haben die sowas nicht."}, {"id": 249, "start": 2242.72, "end": 2249.84, "text": "Frag doch mal im Edeka ein Kobold-Buch. Die denken dann, ja, ist das eine Zutat? Irgendwie"}, {"id": 250, "start": 2249.84, "end": 2256.76, "text": "was zum Kochen? Ich weiß nicht, wie lange ich da bin. Ich kann es euch nicht sagen."}, {"id": 251, "start": 2256.76, "end": 2260.56, "text": "Ich habe nämlich überhaupt nichts vor hier im Stream, geschweige denn. Irgendwas, ich"}, {"id": 252, "start": 2260.56, "end": 2263.8, "text": "habe Lust gesehen. Leute, vier Tage habe ich immer gestreamt. Da wird es mal echt wieder"}, {"id": 253, "start": 2263.8, "end": 2268.76, "text": "Zeit. Was sollen denn die Leute hier machen auf Twitch, wenn ich nicht streame? Der Michael"}, {"id": 254, "start": 2268.76, "end": 2274.2, "text": "5 Billiarden ist bestimmt schon wieder seit drei Tagen im Chat und denkt sich, wann geht"}, {"id": 255, "start": 2274.2, "end": 2289.8, "text": "es denn los? Es gibt eine neue Node-Library, um Chrome zu automatisieren. Warum soll ich"}, {"id": 256, "start": 2289.8, "end": 2297.04, "text": "jetzt Chrome nochmal automatisieren? Ach, das ist ein Browser-Automatisierungstool,"}, {"id": 257, "start": 2297.04, "end": 2302.32, "text": "was Chrome und Firefox und WebKit automatisiert. Okay, das ist wahrscheinlich nicht schlecht."}, {"id": 258, "start": 2302.32, "end": 2323.0, "text": "Warzone-Onstream kann ich gar nicht, weil... Okay, kann ich doch. Machen wir aber nicht."}, {"id": 259, "start": 2323.0, "end": 2333.16, "text": "E-Mail-Leak. Das ist die gleiche E-Mail, die kennt ihr alle. Die geht auch für Donations"}, {"id": 260, "start": 2333.16, "end": 2339.68, "text": "und Subscriptions und alles. Da ist kein Leak. Die steht sogar irgendwo hier in den About,"}, {"id": 261, "start": 2339.68, "end": 2360.12, "text": "im Channel irgendwo unter About. Die ist nicht secret. Kein Leak. Chat. Aber wenn ihr wollt,"}, {"id": 262, "start": 2360.12, "end": 2367.24, "text": "ist es meinetwegen Leak, wenn ihr euch besser fühlt. Fuck, Alter. Scheiße. E-Mail-Adresse"}, {"id": 263, "start": 2367.24, "end": 2379.96, "text": "geleakt. OMG. Donations sind doch aus. Ja, Donations sind aber nur aus, weil der Donation-Link"}, {"id": 264, "start": 2379.96, "end": 2395.48, "text": "verbackt war. Übrigens habt ihr mitgekriegt, dass in Overwatch jetzt total viele Pros abspringen,"}, {"id": 265, "start": 2395.48, "end": 2400.6, "text": "die keinen Bock mehr auf das Game haben und lieber Valorant spielen. Darklyde drei Monate"}, {"id": 266, "start": 2400.6, "end": 2414.32, "text": "abonniert hat. Dankeschön. Massive Subscription. Also Overwatch ist jetzt ziemlich, ziemlich"}, {"id": 267, "start": 2414.32, "end": 2420.4, "text": "dead. Ich frag mich, was die in ihrer Leak machen. Die haben ein komplettes Team. Eines"}, {"id": 268, "start": 2420.4, "end": 2427.64, "text": "der besten Teams überhaupt. Haben die komplett gekickt in der Overwatch-Leak. Ich weiß nicht,"}, {"id": 269, "start": 2427.64, "end": 2438.28, "text": "was da los ist. Diese ganze Overwatch-Leak-Geschichte war von Anfang an kompletter Crap. Kompletter"}, {"id": 270, "start": 2438.28, "end": 2443.68, "text": "gestellter Fake-Hype, zusammengeschustert von Leuten, die vom E-Sport keinen Plastenschimmer"}, {"id": 271, "start": 2443.68, "end": 2450.44, "text": "haben. Und das zeigt sich jetzt. Und das rächt sich jetzt. Max, du hast dich im Battle.net"}, {"id": 272, "start": 2450.44, "end": 2456.96, "text": "Launcher gespielt. Oh fuck, Alter. In der Suppe im Battle.net Launcher, im Fernseh."}, {"id": 273, "start": 2456.96, "end": 2470.6, "text": "Jetzt vorbei. Da ist er. Los geht's mit Warzone-Coaching. Easy. Das ist echt was. Das würde ich sogar"}, {"id": 274, "start": 2470.6, "end": 2477.04, "text": "streamen. Muss ich mal gucken, ob ich irgendeinen guten Spieler finde, der mich mal ordentlich"}, {"id": 275, "start": 2477.04, "end": 2482.28, "text": "coachen kann in Warzone, dass ich meinen zweieinhalb Monaten Rückstand ein bisschen aufhole mit"}, {"id": 276, "start": 2482.28, "end": 2497.2, "text": "Game-Knowledge. Keine bekannten Leute. Die besten Spieler sind eh nicht welche, die"}, {"id": 277, "start": 2497.2, "end": 2505.8, "text": "man groß kennt. OWL war doch toll. Vor allem als Parals rauskamen, sie meinten das voll..."}, {"id": 278, "start": 2505.8, "end": 2519.72, "text": "Die Overwatch-Maps. Das ist so ein Ding. Leute, mir fällt gerade was ein. Overwatch-Maps sind"}, {"id": 279, "start": 2519.72, "end": 2526.92, "text": "scheiße. Modern Warfare-Maps sind scheiße. Und seit ein paar Jahren ist Blizzard und Activision"}, {"id": 280, "start": 2526.92, "end": 2537.36, "text": "ganz dicke. Da stimmt doch was nicht. Da kann doch was nicht stimmen. Ich würde sagen,"}, {"id": 281, "start": 2537.36, "end": 2556.8, "text": "die sind hier wirklich auf der Spur. BigBrain, ja. Kann man ein Mean-Bot eigentlich ohne weiteres"}, {"id": 282, "start": 2556.8, "end": 2561.2, "text": "selbst benutzen? Ne, das ist nicht auf GitHub. Das ist nur eine uralte Version auf GitHub,"}, {"id": 283, "start": 2561.2, "end": 2571.68, "text": "aber die funktioniert. Und was hat wohl Bill Gates damit zu tun? Ich glaube, Bill Gates"}, {"id": 284, "start": 2571.68, "end": 2583.0, "text": "hat in den Sound-Files der Spiele versteckte Botschaften hinterlassen, die die Leute schon"}, {"id": 285, "start": 2583.0, "end": 2593.64, "text": "darauf einstimmen sollen bzw. den Widerstand brechen sollen, unbewusst gegen Chip-Implantate."}, {"id": 286, "start": 2593.64, "end": 2621.64, "text": "Ich glaube, wir sind hier wirklich was großem auf der Spur. So. What? Kannst du eine Twitch-E-Grill-Tierliste"}, {"id": 287, "start": 2621.64, "end": 2630.76, "text": "machen? Ne, ich gucke kaum weibliche Streamer. Keine Ahnung, wer die besten oder hottesten"}, {"id": 288, "start": 2630.76, "end": 2652.12, "text": "oder was auch immer besten Twitch-Grills sind. Keine Ahnung. Einzige Belegrate, ich glaube,"}, {"id": 289, "start": 2652.12, "end": 2657.48, "text": "einzige Streamerin, der ich followe und schon seit Jahren. Ich weiß aber auch ehrlich gesagt"}, {"id": 290, "start": 2657.48, "end": 2664.76, "text": "gar nicht, warum ich da angefangen habe zu followen, ist Miramizu, das jemand kennt."}, {"id": 291, "start": 2664.76, "end": 2677.2, "text": "Und ich gucke nicht oft, aber die ist nicht blöd. Also die Leute, die tun immer so nach"}, {"id": 292, "start": 2677.2, "end": 2684.28, "text": "dem Motto, alter Mädel, wie du dich hier gibst im Stream und bla bla bla, die tun immer so"}, {"id": 293, "start": 2684.28, "end": 2693.2, "text": "oft moralisch, aber rhetorisch outet die teilweise schon ganz schön. So die ganzen Flamer-Spasten"}, {"id": 294, "start": 2693.2, "end": 2703.72, "text": "im Chat. Also die ist auf jeden Fall nicht blöd. Oh nein Max, warum? Aber da bin ich"}, {"id": 295, "start": 2703.72, "end": 2718.16, "text": "da falsch in der Liste für zu machen. Hat sich schon die IHK gemeldet? Achso, ne, ich"}, {"id": 296, "start": 2718.16, "end": 2724.84, "text": "glaube nicht, dass es irgendjemand interessiert bei der IHK. Ja, mache ich nachher, mache"}, {"id": 297, "start": 2724.84, "end": 2744.08, "text": "ich nachher. Keck W. Müsstest du dann nicht doppelt das, das ist eine interessante Frage,"}, {"id": 298, "start": 2744.08, "end": 2747.12, "text": "da wollte ich letztes Mal was dazu sagen. Ich habe ja mein Netzwerks Setup erklärt"}, {"id": 299, "start": 2747.12, "end": 2752.44, "text": "das letzte Mal, so mit Fritzbox für ZIP und VoIP, den Mikrotik Router und davor die Connectbox"}, {"id": 300, "start": 2752.44, "end": 2756.72, "text": "von Vodafone. Da hatte jemand gefragt, müsstest du dann nicht doppelt natt machen, wenn auf"}, {"id": 301, "start": 2756.72, "end": 2763.48, "text": "der Fritzbox vor dem Mikrotik auch ZIP laufen soll? Ne, muss ich nicht, weil beide hängen"}, {"id": 302, "start": 2763.48, "end": 2767.0, "text": "ja an der Connectbox dran, also es ist nicht so, dass mein kompletter Traffic durch die"}, {"id": 303, "start": 2767.0, "end": 2778.96, "text": "Fritzbox gehen würde. Was E-Grill oder E-Boil zum, das kann ich nicht aufmachen, je nachdem"}, {"id": 304, "start": 2778.96, "end": 2802.28, "text": "was das für eine Seite ist. Das traue ich mich nicht aufzumachen. Heute ein spezielles"}, {"id": 305, "start": 2802.28, "end": 2806.48, "text": "Vorhaben, ja das spezielle Vorhaben ist, dass ich nach vier Tagen mal wieder online komme"}, {"id": 306, "start": 2806.48, "end": 2823.24, "text": "im Stream. Ansonsten nix. Eigentlich wollte ich heute gar nicht online kommen. Stand Vodafone?"}, {"id": 307, "start": 2823.24, "end": 2829.32, "text": "Naja, also die letzten Tage hat es funktioniert. Ich könnte mir vorstellen, dass die zweite"}, {"id": 308, "start": 2829.32, "end": 2836.12, "text": "Nachricht die ich gekriegt habe, so wie vermutet, wirklich von irgendeinem Social Media Management"}, {"id": 309, "start": 2836.12, "end": 2840.52, "text": "Typ gekommen ist, weil die hat sich so überhaupt nicht nach einem Support Mitarbeiter angehört,"}, {"id": 310, "start": 2840.52, "end": 2843.92, "text": "die zweite Message. Hab ich euch ja vorgelesen. Ich weiß, ich kann es noch mal vorlesen für"}, {"id": 311, "start": 2843.92, "end": 2850.84, "text": "die, die nicht dabei waren. Und wahrscheinlich haben die das jetzt gefixt. Wahrscheinlich"}, {"id": 312, "start": 2850.84, "end": 2857.2, "text": "bin ich in irgendeine Liste gerutscht. Größer gleich 10k Follower auf Twitter, auf YouTube"}, {"id": 313, "start": 2857.2, "end": 2862.44, "text": "und sonst was, bitte fixen. Weil die erste Nachricht, die ich gekriegt habe, wir haben"}, {"id": 314, "start": 2862.44, "end": 2872.16, "text": "hier extra schon eine Liste für Vodafone ausreden. Vodafone ausreden. Erst war die WLAN SSID"}, {"id": 315, "start": 2872.16, "end": 2877.76, "text": "doppelt. Modem Werte, schlechte Einstrahlung, Modem Neustarten, es gibt Probleme mit der"}, {"id": 316, "start": 2877.76, "end": 2881.6, "text": "Connectbox deutschlandweit, die sind jetzt behoben, Modem Neustarten, Modem Neustarten,"}, {"id": 317, "start": 2881.6, "end": 2886.44, "text": "Großraumstörungen im Raum Hanau, Frankfurt. Und danach habe ich die Nachricht gekriegt."}, {"id": 318, "start": 2886.44, "end": 2891.44, "text": "Danach habe ich die Nachricht gekriegt. Einmal vom Support. Hallo, wir sind diesbezüglich"}, {"id": 319, "start": 2891.44, "end": 2895.56, "text": "informiert und arbeiten gerade daran, die Störungen zu beheben. Und eine Viertelstunde"}, {"id": 320, "start": 2895.56, "end": 2900.52, "text": "später, das war nach dem dritten oder vierten Tag in Folge, wo wir Probleme haben, wo ich"}, {"id": 321, "start": 2900.52, "end": 2904.96, "text": "jeden Abend rumgespammt habe auf Twitter, habe ich dann eine Nachricht gekriegt, die"}, {"id": 322, "start": 2904.96, "end": 2910.8, "text": "sich so überhaupt gar nicht nach Support liest. Und zwar, vielen Dank für deine Nachricht."}, {"id": 323, "start": 2910.8, "end": 2917.72, "text": "Tut mir leid zu lesen, dass dein Stream beeinträchtigt ist. Leider gibt es da im Moment eine Großstörung"}, {"id": 324, "start": 2917.72, "end": 2922.28, "text": "in deinem Anschlussbereich. Die Technik arbeitet mit Hochdruck an der Behebung, das sollte"}, {"id": 325, "start": 2922.28, "end": 2926.62, "text": "bald erledigt sein. Bitte hab noch etwas Geduld. Wenn alles wieder läuft, kannst du uns gerne"}, {"id": 326, "start": 2926.62, "end": 2930.28, "text": "wieder schreiben, dann können wir uns um eine entsprechende Gutschrift kümmern. Ich wünsche"}, {"id": 327, "start": 2930.28, "end": 2934.36, "text": "dir einen schönen Tag, liebe Grüße. Das klingt so null nach den Support-Nachrichten"}, {"id": 328, "start": 2934.36, "end": 2939.76, "text": "von vorher. Ich habe so irgendwie die Gefühl, dass das irgendein Social Media Management"}, {"id": 329, "start": 2939.76, "end": 2944.92, "text": "Typ ist. Und er hat sich jetzt gedacht, oh fuck, der spammt jetzt jeden Abend, wie scheiße"}, {"id": 330, "start": 2944.92, "end": 2951.36, "text": "wir sind. Vielleicht sollten wir das mal fixen. Hast du schon das Drama wegen dem neuen Twitch-Consil"}, {"id": 331, "start": 2951.36, "end": 2960.36, "text": "mitbekommen? Ne, ich habe das Drama mitgenommen um die Corona-Warn-App. Da drehen die Leute"}, {"id": 332, "start": 2960.36, "end": 2969.04, "text": "wieder ab. Wo ist das denn? Die sind wieder am diskutieren in der Corona-Warn-App. Das"}, {"id": 333, "start": 2969.04, "end": 2974.0, "text": "ist also auf dem GitHub-Repo von der deutschen Corona-Warn-App sind sie gerade wieder am"}, {"id": 334, "start": 2974.0, "end": 2985.04, "text": "diskutieren, ob es nicht Leute beleidigt, wenn man eher sie und Anrede nicht gendergerecht"}, {"id": 335, "start": 2985.04, "end": 2990.16, "text": "verwendet. Das ist natürlich das allergrößte Problem, was man bei einer Corona-Warnung-App"}, {"id": 336, "start": 2990.16, "end": 2996.92, "text": "hat. Ob die Gender-Bezeichnungen richtig sind. Logischerweise, was könnte bei so einer Corona-App"}, {"id": 337, "start": 2996.92, "end": 3024.32, "text": "sonst wichtig sein? Nicht Warp, Warn. Wie heißt denn das Repo noch mal Leute? Corona-Warn-App"}, {"id": 338, "start": 3024.32, "end": 3043.6, "text": "ist das Ding. Auf GitHub, genau. Wo ist der GitHub-Link? Ja. Ich mache mal Achtung Leute,"}, {"id": 339, "start": 3043.6, "end": 3058.88, "text": "Augenwarnung. Wenn du hier guckst, was hier Closed ist. Was da wieder diskutiert wird."}, {"id": 340, "start": 3058.88, "end": 3072.56, "text": "Wenn du hier suchst. Geschlechtssensitive Sprache in deutschen Dokumenten. Oh mein Gott,"}, {"id": 341, "start": 3072.56, "end": 3084.84, "text": "das ist unglaublich für eine Corona-App. Das geht nicht. Alter, die drehen echt alle"}, {"id": 342, "start": 3084.84, "end": 3105.16, "text": "ab. Naja, also immer. Es ist egal. Da habe ich mir gedacht, wenn wir echt keine Probleme"}, {"id": 343, "start": 3105.16, "end": 3110.44, "text": "haben bei einer Corona-Warn-App, als dass die gender-korrekte Bezeichnung drin ist,"}, {"id": 344, "start": 3110.44, "end": 3116.8, "text": "dann weiß ich auch nicht. Hattest du in deiner 4 HE-Kiste Hardware oder Software-Rate? Wenn"}, {"id": 345, "start": 3116.8, "end": 3126.16, "text": "ja, wählst du ZFS-Rate 1. Was hat jemand eben gefragt, ob ich irgendwelches Twitch-Drama"}, {"id": 346, "start": 3126.16, "end": 3130.72, "text": "mitbekommen habe? Hast du schon das Drama um den neuen Twitch-Conceal mitbekommen?"}, {"id": 347, "start": 3130.72, "end": 3141.76, "text": "Moment, was ist das? Hä? Was soll das sein? Moment."}, {"id": 348, "start": 2153.66, "end": 3190.28, "text": "was hat das jetzt mit Twitch? Was hat das jetzt mit Twitch-Skandal zu tun? Hä?"}, {"id": 349, "start": 3190.28, "end": 3217.52, "text": "Wo ist das jetzt? Verstehe ich nicht. Hä? Es gibt Sachen, die verstehe ich nicht. Hä?"}, {"id": 350, "start": 3217.52, "end": 3232.48, "text": "Wie ist bei dem neuen Twitch-Safety-Advisor-Conceal? Was ist ein Twitch-Safety-Advisory-Conceal?"}, {"id": 351, "start": 3232.48, "end": 3239.0, "text": "Okay. Ich sehe schon, in welche Richtung das führt. Ich weiß nicht, ob ich mir das jetzt"}, {"id": 352, "start": 3239.0, "end": 3246.28, "text": "geben will. Ich weiß nicht, ob ich dazu im Stream wieder was sagen soll. Okay. Ich ahne"}, {"id": 353, "start": 3246.28, "end": 3253.24, "text": "schon, in welche Richtung das geht, aber mal gucken. Wir sind ja aktuell gerade überall"}, {"id": 354, "start": 3253.24, "end": 3258.28, "text": "sehr drauf bedacht, dass sich auch ja keiner in irgendeiner Art und Weise mehr gekränkt"}, {"id": 355, "start": 3258.28, "end": 3264.8, "text": "fühlt, was im Endeffekt darauf rausläuft, dass noch mehr Leute als vorher, aber halt"}, {"id": 356, "start": 3264.8, "end": 3277.48, "text": "vielleicht andere. Also sogar auf Deutsch. Okay. Die Sicherheit und Gesundheit unserer"}, {"id": 357, "start": 3277.48, "end": 3284.18, "text": "Community hat für Twitch oberste Priorität. Ist auch schön. Wir freuen uns deshalb heute"}, {"id": 358, "start": 3284.18, "end": 3290.68, "text": "die Gründung des Twitch-Sicherheitsbeirats anzukündigen, der in Zukunft das Wachstum"}, {"id": 359, "start": 3290.68, "end": 3297.8, "text": "unserer Community unterstützen würde. Also wenn ich an das Thema Sicherheitsbeirat denke,"}, {"id": 360, "start": 3297.8, "end": 3304.12, "text": "das Erste, was mir in Sinn kommt, ist sowas wie Account-Sicherheit oder dass man schaut,"}, {"id": 361, "start": 3304.12, "end": 3309.0, "text": "dass die Leute nicht so sehr scammen und debaten können mit Short-Uls und solche Geschichten."}, {"id": 362, "start": 3309.0, "end": 3316.04, "text": "Das klingt für mich jetzt erstmal nach Sicherheitsbeirat. So. Der Sicherheitsbeirat wird informieren"}, {"id": 363, "start": 3316.04, "end": 3321.84, "text": "und Entscheidungen von Twitch anleiten, indem er seine Erfahrungen und Expertise sowie sein"}, {"id": 364, "start": 3321.84, "end": 3327.64, "text": "Glauben an die Mission von Twitch einbringt. Den Satz habe ich nicht verstanden. Was? Der"}, {"id": 365, "start": 3327.64, "end": 3335.0, "text": "Sicherheitsbeirat wird informieren und Entscheidungen von Twitch anleiten? Was ist eigentlich hier"}, {"id": 366, "start": 3335.0, "end": 3341.04, "text": "mit den Buchstaben los, wenn man die markiert? Indem er seine Erfahrungen und Expertise"}, {"id": 367, "start": 3341.04, "end": 3346.24, "text": "sowie sein Glauben an die Mission von Twitch einbringt. Den Satz verstehe ich nicht. Wirklich"}, {"id": 368, "start": 3346.24, "end": 3350.68, "text": "low-brain. Ich verstehe den Satz nicht. Ok, machen wir mal weiter. Communities dabei zu"}, {"id": 369, "start": 3350.68, "end": 3358.04, "text": "unterstützen, zusammen etwas zu erschaffen. Das ist bestimmt aus dem Englischen übersetzt."}, {"id": 370, "start": 3358.04, "end": 3362.72, "text": "Der Satz leuchtet mir nicht so ganz ein, aber ok. Vielleicht bin ich einfach zu low IQ"}, {"id": 371, "start": 3362.72, "end": 3369.48, "text": "dafür. Der Rat wird unter anderem bei vollen Themen beraten. Entwurf neu richtigen und"}, {"id": 372, "start": 3369.48, "end": 3377.96, "text": "Aktualisierung bestellen. Das ist doch nicht verkehrt. Also ich meine, inwieweit ihr jetzt"}, {"id": 373, "start": 3377.96, "end": 3382.92, "text": "was zu sagen habt, ist mal fraglich. Letztendlich wird Twitch nach wie vor sagen, wir machen"}, {"id": 374, "start": 3382.92, "end": 3392.16, "text": "die Sachen so, wie wir sie machen wollen. Aber Leute, ich kann nicht beurteilen, wer"}, {"id": 375, "start": 3392.16, "end": 3399.6, "text": "da am Start ist und welche Expertise die Leute haben. Nur mal auch für die Idee gesprochen,"}, {"id": 376, "start": 3399.6, "end": 3407.0, "text": "ist das doch eigentlich gar nicht schlecht, so eine Art Gremium aus erfahrenen Streamern"}, {"id": 377, "start": 3407.0, "end": 3413.6, "text": "und Leuten zu haben, die sich halt auskennen, was quasi die Twitch-Community so mag und"}, {"id": 378, "start": 3413.6, "end": 3417.76, "text": "haben will und dass du sich dann kurz schließt mit Twitch, wenn es um Regeländerungen geht."}, {"id": 379, "start": 3417.76, "end": 3425.04, "text": "Das klingt doch jetzt erstmal gar nicht so blöd. Ich meine, da könnte man zum Beispiel"}, {"id": 380, "start": 3425.04, "end": 3431.08, "text": "dann auch mal wirklich den ein oder anderen Kontroversen reinsetzen, der schon öfter"}, {"id": 381, "start": 3431.08, "end": 3440.36, "text": "sich mal in die Brennnesseln gesetzt hat, so einen wie XQC zum Beispiel, der schon öftmals"}, {"id": 382, "start": 3440.36, "end": 3446.08, "text": "drunter, weiß ich, es war ja oftmals auch zu Recht, aber auch schon ein bisschen drunter"}, {"id": 383, "start": 3446.08, "end": 3451.12, "text": "zu leiden hatte, dass manche Sachen sehr schwammig sind. Ich erinnere nur mal an diese ganze"}, {"id": 384, "start": 3451.12, "end": 3458.48, "text": "Geschichte mit, wenn man tryhard postet, wäre das racist und sowas. Ich finde, so Sachen"}, {"id": 385, "start": 3458.48, "end": 3463.92, "text": "könnte man schon klarer in Richtlinien regeln. Wobei das auch so ein Zusammenspiel aus Overwatch"}, {"id": 386, "start": 3463.92, "end": 3474.2, "text": "League und Twitch am Ende gewesen ist. Ich meine, das reine Benutzen eines offiziellen"}, {"id": 387, "start": 3474.2, "end": 3479.88, "text": "Emotes, ohne Text, ohne Kontext, was auch immer rein, das benutzt eines Emotes, kann"}, {"id": 388, "start": 3479.88, "end": 3486.04, "text": "ja wohl kaum großartig racist sein. Das ist ja nicht umsonst ein offizielles Twitch-Emote."}, {"id": 389, "start": 3486.04, "end": 3494.24, "text": "Wenn jetzt einer hergeht und einen Hakenkreuz in Bella Twitch TV macht, das ist mal wieder"}, {"id": 390, "start": 3494.24, "end": 3502.44, "text": "was ganz anderes, aber wir reden ja über offizielle Twitch-Emotes. So, Entwicklung"}, {"id": 391, "start": 3502.44, "end": 3506.08, "text": "von Produkten und Funktionen zur Erhöhung von Sicherheit und Moderation. Klingt doch"}, {"id": 392, "start": 3506.08, "end": 3516.16, "text": "auch sinnvoll. Förderung, gesunder Streaming und Work-Life-Balance-Gewohnheiten. Schutz"}, {"id": 393, "start": 3516.16, "end": 3526.68, "text": "der Interessen von Randgruppen. Das ist halt, wo man sich immer auf dünnem Eis bewegt."}, {"id": 394, "start": 3526.68, "end": 3534.84, "text": "Man muss bei dieser ganzen Sache immer gucken, also ich bin rein für die Sache, bin ich voll"}, {"id": 395, "start": 3534.84, "end": 3540.8, "text": "dafür. Man muss allerdings immer gucken, dass es nicht ins komplette Gegenteil umschlägt."}, {"id": 396, "start": 3540.8, "end": 3548.12, "text": "Zum Beispiel, so nach dem Motto, wir sind jetzt alle Feministen, deswegen sind jetzt"}, {"id": 397, "start": 3548.12, "end": 3555.88, "text": "auf einmal alle Männer trash. Dann hat man im Prinzip, außer dass man das einmal geflippt"}, {"id": 398, "start": 3555.88, "end": 3561.92, "text": "hat, so wer jetzt trash ist und wer jetzt Hate abbekommt, hat man einfach einmal umgedreht."}, {"id": 399, "start": 3561.92, "end": 3572.24, "text": "Das ist ja auch nicht Sinn und Zweck der Sachen. Also Schutz von Interessen von Randgruppen,"}, {"id": 400, "start": 3572.24, "end": 3577.96, "text": "klar, immer. Allerdings muss man halt gucken, dass nicht andere komplett ins Abseits dadurch"}, {"id": 401, "start": 3577.96, "end": 3581.8, "text": "wieder geraten. Das ist halt, das ist schwierig. Das ist auch so ein Thema, wo man es nie allen"}, {"id": 402, "start": 3581.8, "end": 3592.32, "text": "recht machen kann. Okay, also diese Gruppe besteht aus Online-Sicherheitsexperten und"}, {"id": 403, "start": 3592.32, "end": 3597.32, "text": "Twitch-Creator. Ich denke bei Sicherheitsexperten, gerade bei Online-Sicherheitsexperten wirklich"}, {"id": 404, "start": 3597.32, "end": 3604.48, "text": "an Security. Und ich habe halt das Gefühl jetzt, so wie ich das lese, und bei so was"}, {"id": 405, "start": 3604.48, "end": 3610.06, "text": "ist Gefühl immer das Allerwichtigste. Ich habe das Gefühl, den geht es bei Sicherheit"}, {"id": 406, "start": 3610.06, "end": 3617.12, "text": "eher so um Safe in Form von, es wird nicht gehated, es wird nicht geflamed, es ist,"}, {"id": 407, "start": 3617.12, "end": 3621.28, "text": "wir haben uns alle lieb, wohlfühlen und sowas. Die meinen mit Sicherheit, glaube ich, gar"}, {"id": 408, "start": 3621.28, "end": 3632.52, "text": "nicht IT-Security. Safe Spaces, genau wie es das immer auf Englisch nennen. Also diese"}, {"id": 409, "start": 3632.52, "end": 3639.04, "text": "Gruppe besteht aus Online-Sicherheitsexperten, richtig, richtig nice Musik, und Twitch-Creator,"}, {"id": 410, "start": 3639.04, "end": 3642.88, "text": "die ein tiefer gehendes Verständnis von Twitch, sowie dessen Inhalt und seiner Kombi, das"}, {"id": 411, "start": 3642.88, "end": 3647.64, "text": "ist doch gut. Beim Zusammenstellen dieses, ich bin mal gespannt, wer da alles drinne"}, {"id": 412, "start": 3647.64, "end": 3656.56, "text": "ist. Beim Zusammenstellen dieses Rates haben wir darauf geachtet, sowohl Experten mit einer"}, {"id": 413, "start": 3656.56, "end": 3663.2, "text": "externen Perspektive, als auch Twitch-Streamer mit einem tiefen Verständnis, wozu braucht"}, {"id": 414, "start": 3663.2, "end": 3668.36, "text": "man da externe Experten? Das geht doch um Twitch-Content, oder? Man fragt die Leute,"}, {"id": 415, "start": 3668.36, "end": 3674.12, "text": "die Twitch-Content machen. Mit einem tiefen Verständnis für die einzigartigen Herausforderungen"}, {"id": 416, "start": 3674.12, "end": 3683.76, "text": "und Ansichten eines Creators, bla, bla, bla, bla. Jedes Mitglied dieses Rates, ähm, Moment,"}, {"id": 417, "start": 3683.76, "end": 3687.6, "text": "jedes Mitglied dieses wurde sorgfältig ausgeholt, wobei die Vertrautheit mit der Twitch-Community"}, {"id": 418, "start": 3687.6, "end": 3693.32, "text": "und der relevante persönliche und berufliche Erfahrungsschatz berücksichtigt wurde. Wir"}, {"id": 419, "start": 3693.32, "end": 3696.8, "text": "freuen uns sehr, mit dieser talentierten Gruppe zusammenzuarbeiten und besten Ort für"}, {"id": 420, "start": 3696.8, "end": 3701.76, "text": "Aufbau und halt eine Community zu machen. Die Gründung des Sicherheitsbeirats ist nur"}, {"id": 421, "start": 3701.76, "end": 3706.16, "text": "einer der Maßnahmen, die wir im Namen von Vertrauen und Sicherheit vornehmen. Wir investieren"}, {"id": 422, "start": 3706.16, "end": 3717.92, "text": "weiterhin in... Okay, wer ist da dabei? Kenn ich nicht. Keine Ahnung, wer das ist. Äh,"}, {"id": 423, "start": 3717.92, "end": 3724.08, "text": "den kenn ich. Den kenn ich, da hab ich sogar ein paar Streams geguckt, aber zu wenig, dass"}, {"id": 424, "start": 3724.08, "end": 3732.88, "text": "ich da irgendwas drüber aussagen könnte. Kenn ich nicht. Kenn ich auch nicht. Ah, das"}, {"id": 425, "start": 3732.88, "end": 3739.28, "text": "ist, wo wir das Video eben gesehen haben. Kenn ich auch nicht. Keine Ahnung. Kenn ich"}, {"id": 426, "start": 3739.28, "end": 3746.84, "text": "auch nicht. Kenn ich auch nicht. Den kenn ich! Das ist ein Path of Exile-Streamer. Den guck"}, {"id": 427, "start": 3746.84, "end": 3762.48, "text": "ich gerne. Okay. Okay, halt mal fest, ich kenne, ich kenne zwei Leute. Das heißt jetzt"}, {"id": 428, "start": 3762.48, "end": 3768.2, "text": "nix, mir nur aufgefallen. So, ich kenne, ich kenne, ich kenne zwei Leute, ähm, aus der,"}, {"id": 429, "start": 3768.2, "end": 3780.68, "text": "aus der Liste. Ähm, gut, zu sagen, haben sie natürlich nix, letztendlich. Aber, mal"}, {"id": 430, "start": 3780.68, "end": 3786.36, "text": "ganz ehrlich, wie war es denn bisher auf Twitch? Oder wie ist es denn, wie ist es denn auf"}, {"id": 431, "start": 3786.36, "end": 3793.0, "text": "allen, ich sag mal auf nahezu, auf allen mir bekannten Plattformen wie Twitch oder YouTube"}, {"id": 432, "start": 3793.0, "end": 3799.6, "text": "oder was haben wir denn da sonst noch, äh, Facebook, Gaming, keine Ahnung, Mixer, was"}, {"id": 433, "start": 3799.6, "end": 3808.36, "text": "es nicht alles gibt, ja. Es ist doch auf allen so, dass du letztendlich als Creator auf gedeih"}, {"id": 434, "start": 3808.36, "end": 3821.92, "text": "und verderbender Plattform ausgeliefert bist. So, und das Twitch jetzt nicht sagt, wir nehmen"}, {"id": 435, "start": 3821.92, "end": 3835.12, "text": "da irgendeinen Beirat an sieben schwierigen Leuten, die dann auch noch quasi ein festes"}, {"id": 436, "start": 3835.12, "end": 3843.52, "text": "Veto-Recht haben, kann ich verstehen. Ist doch, äh, das wäre doch aus Sicht von Twitch überhaupt"}, {"id": 437, "start": 3843.52, "end": 3851.92, "text": "nicht, überhaupt nicht anzustreben. So, und natürlich nimmt man sich jetzt auch Leute,"}, {"id": 438, "start": 3851.92, "end": 3856.44, "text": "die, äh, mit denen man wohl gut auskommt. Aber auf der anderen Seite, wo, wo genau ist"}, {"id": 439, "start": 3856.44, "end": 3862.84, "text": "denn jetzt der Shitstorm bei der ganzen Geschichte, den verstehe ich doch nicht so genau. Hast"}, {"id": 440, "start": 3862.84, "end": 3875.44, "text": "du schon mitbekommen, dass Facebook Giphy gekauft hat? Nee. Also ich verstehe, also wo, wo genau"}, {"id": 441, "start": 3875.44, "end": 3893.68, "text": "ist, warum, wo ist da jetzt denn jetzt der Beef? Ich glaube, die Leute sind wegen dieser Transgender-Personen"}, {"id": 442, "start": 3893.68, "end": 3904.88, "text": "mad, warum? Die haben sie doch nicht mehr alle. Man darf auf alle Leute sauer sein. Ja, das"}, {"id": 443, "start": 3904.88, "end": 3909.76, "text": "ist okay berechtigt, wenn sie irgendwas gesagt haben, was einen anpisst, äh, was einen anpisst,"}, {"id": 444, "start": 3909.76, "end": 3917.76, "text": "kann man sauer sein. Aber ich meine nur, weil er, oder sie, weiß nicht, wie, wie man sie"}, {"id": 445, "start": 3917.76, "end": 3923.92, "text": "eher ihn jetzt richtig nennt, weil das ist ja schmierig, deswegen sag ich jetzt mal sie,"}, {"id": 446, "start": 3923.92, "end": 3933.04, "text": "ähm, und nur weil sie, keine Ahnung, bunte Haare hat, warum sollte man auf jemanden sauer"}, {"id": 447, "start": 3933.04, "end": 3960.2, "text": "sein? Es ergibt überhaupt keinen Sinn. Die können echt alle machen, was sie wollen und"}, {"id": 448, "start": 3960.2, "end": 3966.4, "text": "wenn einer heute sagt, er wäre gerne nen Fahrrad, kann er das meinetwegen machen. Man sollte"}, {"id": 449, "start": 3966.4, "end": 3971.36, "text": "nur nicht davon ausgehen, dass es auf jeden Fall die restliche Welt dann sofort versteht,"}, {"id": 450, "start": 3971.36, "end": 3989.84, "text": "aber ansonsten, ey, jeder, jeder, jeder, jeder will. Ähm, also warum man sich jetzt da drüber"}, {"id": 451, "start": 3989.84, "end": 4002.52, "text": "aufregt? Okay, warte mal, Reddit, Twitch, worüber regen sich denn jetzt auf? Gar nicht,"}, {"id": 452, "start": 4002.52, "end": 4013.04, "text": "oder? Oh, oh, das ist schlecht. Die dürfen IRC nicht entfernen. Das ist viel schlimmer."}, {"id": 453, "start": 4013.04, "end": 4033.56, "text": "Die dürfen IRC nicht entfernen. Dann geht mein Chatlogger nicht mehr, wenn die IRC entfernen."}, {"id": 454, "start": 4033.56, "end": 4059.88, "text": "Mein Chatlogger basiert auf der, dass der Twitch Chat über IRC erreichbar ist. Achso,"}, {"id": 455, "start": 4059.88, "end": 4083.84, "text": "okay, sie entfernen paar IRC Features, das müsste immer noch funktionieren. Wieso benutzt"}, {"id": 456, "start": 4083.84, "end": 4094.04, "text": "du nicht BRC, wenn die IRC entfernen? Excellent. Warum man jetzt da dran rumdoktern muss, verstehe"}, {"id": 457, "start": 4094.04, "end": 4097.76, "text": "ich allerdings trotzdem nicht. Also ich sehe hier ehrlich gesagt kein Geflame über den"}, {"id": 458, "start": 4097.76, "end": 4116.56, "text": "Sicherheitsrat. Okay, anscheinend das hier. Nee, nee, ich will mich damit gar nicht weiter"}, {"id": 459, "start": 4116.56, "end": 4120.4, "text": "beschäftigen. Es ist wie auf YouTube, eigentlich ist mir scheißegal, was die Plattform macht."}, {"id": 460, "start": 4120.4, "end": 4127.52, "text": "Ich stelle hier meinen Content zur Verfügung im Endeffekt, weil ich hier die Leute am besten"}, {"id": 461, "start": 4127.52, "end": 4136.4, "text": "erreichen kann und wir haben ja auch hier den besten, der besten, Moment, aber ansonsten"}, {"id": 462, "start": 4136.4, "end": 4141.32, "text": "ist mir das vollkommen egal, was die Plattform macht. Wenn ihr nicht gerade komplett geisteskranke"}, {"id": 463, "start": 4141.32, "end": 4144.12, "text": "Dinge beschließen, sodass ich keinen Bock mehr drauf habe, hier zu streamen, ist mir"}, {"id": 464, "start": 4144.12, "end": 4152.16, "text": "das ziemlich egal. Du musst erstmal die Basics machen, ja. Wie spricht man es richtig aus?"}, {"id": 465, "start": 4152.16, "end": 4159.84, "text": "Basics, ich kann das nicht aussprechen. Wie spricht man Basics richtig aus? Die Basics."}, {"id": 466, "start": 4159.84, "end": 4174.16, "text": "Du musst mal die Basics machen. Basics, ne? Musst die Basics. Ist das Schwäbisch? Das"}, {"id": 467, "start": 4174.16, "end": 4182.56, "text": "ist bestimmt Schwäbisch. Schwäbisch ist hessisch, das ist doch nicht hessisch. Das ist nicht"}, {"id": 468, "start": 4182.56, "end": 4189.76, "text": "hessisch. Also ich weiß, wie sich hessisch anhört, aber die Basics sagt hier keiner."}, {"id": 469, "start": 4189.76, "end": 4212.64, "text": "Was sagt keiner hier, die Basics? Stuttgarter Dialekt, ja das ist Schwäbisch, ja. Wie findest"}, {"id": 470, "start": 4212.64, "end": 4225.92, "text": "du San Diego Spongebos? Keine Ahnung. Ich kenne mich im deutschen Hip-Hop-Segment nicht"}, {"id": 471, "start": 4225.92, "end": 4241.2, "text": "aus. Aber ich kann was zum schwedischen Dialekt sagen. Auf die Gefahr hin, dass jetzt ein"}, {"id": 472, "start": 4241.2, "end": 4246.36, "text": "paar Leute schenkig sind, aber ich muss euch auch erklären warum. Ich mag schwäbischen"}, {"id": 473, "start": 4246.36, "end": 4256.76, "text": "Dialekt nicht. Das liegt daran, weil mein erster Arbeitgeber, der Provider, wo ich meine"}, {"id": 474, "start": 4256.76, "end": 4264.92, "text": "Ausbildung gemacht habe, die kam aus Ulm und die haben alle Schwäbisch geredet und"}, {"id": 475, "start": 4264.92, "end": 4271.2, "text": "das war ein echt komischer Laden. Also ich habe nichts gegen Schwaben, aber immer wenn"}, {"id": 476, "start": 4271.2, "end": 4290.4, "text": "ich einen Schwäbisch reden höre, dann muss ich daran denken. Ja, wenn dich fragt, sag"}, {"id": 477, "start": 4290.4, "end": 4296.4, "text": "einfach Beste. Ich sag selten Beste zu was, was ich gar nicht kenne. Weil im Zweifelsfall"}, {"id": 478, "start": 4296.4, "end": 4322.08, "text": "ist es nicht Beste, sondern zack. Oh ne, ne Korok das kenne ich noch. Oh nein, das kenne"}, {"id": 479, "start": 4322.08, "end": 4333.16, "text": "ich noch. Das ist das Zwischenshow, die immer im ersten Programm läuft. In Hessen laufen"}, {"id": 480, "start": 4333.16, "end": 4338.2, "text": "im zweiten sind Mainzelmännchen, im ersten ist Onkel Otto und im Schwäbischen ist es"}, {"id": 481, "start": 4338.2, "end": 4343.8, "text": "dieser Affe und der Esel im Fernsehprogramm. Das kann ich mich daran erinnern. Ich war"}, {"id": 482, "start": 4343.8, "end": 4347.28, "text": "ja manchmal über Nacht dort in Ulm und da habe ich auch ein bisschen Fernsehen geguckt"}, {"id": 483, "start": 4347.28, "end": 4351.92, "text": "und da kamen diese komischen Zwischeneinspieler mit dem Esel und dem Affe immer. Das hier,"}, {"id": 484, "start": 4351.92, "end": 4367.36, "text": "das hier. Da denke ich mit Horror dran. Das erinnert mich an Zeiten wo ich mich nicht"}, {"id": 485, "start": 4367.36, "end": 4379.8, "text": "gerne dran erinnere. Ansonsten muss ich sagen, wo wir gerade bei Dialekten sind, es gab ja"}, {"id": 486, "start": 4379.8, "end": 4387.36, "text": "mal eine Abstimmung, dass ich glaube sächsisch oder so, wäre der unsexiest Dialekt oder"}, {"id": 487, "start": 4387.36, "end": 4403.36, "text": "der dummste Dialekt oder so. Ich muss ja sagen, dass ich irgendwo sächsisch noch ganz gut"}, {"id": 488, "start": 4403.36, "end": 4410.0, "text": "finde. Vielleicht weil ich den Fabian und den Karsten kenne, aber die reden ja beide"}, {"id": 489, "start": 4410.0, "end": 4416.64, "text": "nicht so richtig krass sächsisch. Da habe ich keine Schmerzen mit. Also das ist der einzige"}, {"id": 490, "start": 4416.64, "end": 4420.88, "text": "Dialekt der mir wirklich auf den Keks geht, ist schwemisch. Und eben weil ich da persönliche"}, {"id": 491, "start": 4420.88, "end": 4424.08, "text": "Erfahrung mit habe. Ansonsten ist mir das eigentlich vollkommen wurscht, ob es jetzt"}, {"id": 492, "start": 4424.08, "end": 4437.48, "text": "einer bayerisch labert, sächsisch, irgendwie norddeutsches Zeug oder sonst wie. Was ich"}, {"id": 493, "start": 4437.48, "end": 4448.08, "text": "geil finde, also eine Sache die mir aufgefallen ist an sächsisch, ich war ja auch schon drei"}, {"id": 494, "start": 4448.08, "end": 4458.52, "text": "viermal oder so in Dresden, dass im Osten sagen total viele Leute immer Nü, so wie"}, {"id": 495, "start": 4458.52, "end": 4470.24, "text": "wir hier sagen ach oder hä oder was sagen die Nü. Aber so langgezogen, so Nü. Ich kann"}, {"id": 496, "start": 4470.24, "end": 4475.48, "text": "es nicht nachmachen, Nü, Nü, Nü. Ich kann es nicht nachmachen, aber ihr wisst wahrscheinlich"}, {"id": 497, "start": 4475.48, "end": 4504.76, "text": "was ich meine. In Hessen sagt man Hä. Hä geht für alles. Nü gibt es nur in Dresden,"}, {"id": 498, "start": 4504.76, "end": 4513.8, "text": "sonst nirgends. Ok. Ja. So genau kenne ich mich da nicht aus. So gibt es ja noch ein"}, {"id": 499, "start": 4513.8, "end": 4524.18, "text": "paar sinnvolle Fragen. Max kannst du mir sagen was W-Pad ist? W-Pad das hört sich an wie"}, {"id": 500, "start": 4524.18, "end": 4533.48, "text": "wenn man Leerzeichen auffüllt, aber ich glaube nicht, dass das damit gemeint ist. Man paddet"}, {"id": 501, "start": 4533.48, "end": 4545.88, "text": "Leerzeichen, Whitespaces oder so. Keine Ahnung. Was hältst du denn von Deno bisher? Wie gesagt"}, {"id": 502, "start": 4545.88, "end": 4552.16, "text": "ich habe mir ein paar Webcasts dazu angeguckt. Ich sehe die Vorteile gegenüber Node.js, allerdings"}, {"id": 503, "start": 4552.16, "end": 4557.84, "text": "was ich nicht verstehe ist warum man das verwenden sollte. Das wichtigste in einem ganzen Ökosystem"}, {"id": 504, "start": 4557.84, "end": 4567.0, "text": "von Node.js ist doch dass es so viele Pakete gibt und die gibt es für Deno nicht. Voice"}, {"id": 505, "start": 4567.0, "end": 4591.56, "text": "Chat abgeschafft weil es diskriminierend ist. Da der blödsinn ausfasst. Mittlerweile"}, {"id": 506, "start": 4591.56, "end": 4608.48, "text": "sind es so viele Leute im Chat, dass du die"}, {"id": 507, "start": 4608.48, "end": 4631.2, "text": "witzigen Situationen von einem Pipega-Chat hast wie früher. Früher hast du irgendwas"}, {"id": 508, "start": 4631.2, "end": 4635.72, "text": "total hirnverbranntes gepostet und da haben die Leute noch darauf reagiert im Chat oder"}, {"id": 509, "start": 4635.72, "end": 4639.68, "text": "umgedreht. Du hast auf was dummes reagiert was Leute im Chat geschrieben haben aber das"}, {"id": 510, "start": 4639.68, "end": 4643.96, "text": "geht mittlerweile nicht mehr. Mittlerweile spammen die Leute einfach nur 150 Zeichen"}, {"id": 511, "start": 4643.96, "end": 4656.36, "text": "Emotes am Stück oder machen Donations. Wer es kennt weiß was ich meine. Total hängengeblieben."}, {"id": 512, "start": 4656.36, "end": 4668.76, "text": "Deswegen kann ich mir das nicht mehr angucken. Ansonsten muss man sagen XQC hat schon Twitch"}, {"id": 513, "start": 4668.76, "end": 4674.88, "text": "ganz schön seinen Stempel aufgedrückt. Also viele Sprüche und viele Ausdrücke ist quasi"}, {"id": 514, "start": 4674.88, "end": 4704.2, "text": "mittlerweile fast gang und gäbe auf Twitch. Z.B. Go a Garn. A Garnel. TriHead7, ja jetzt"}, {"id": 515, "start": 4704.2, "end": 4716.96, "text": "auch sowas. Genau. Wie gehts dem Fabian? Dem gehts gut. Der spielt Mobile Games. Du hast"}, {"id": 516, "start": 4716.96, "end": 4725.08, "text": "dir erwähnt, dass du bei einer Bank arbeitest. Kennst du Star Money? Ja, kenne ich. Haben"}, {"id": 517, "start": 4725.08, "end": 4733.56, "text": "wir aber nicht. Das ist doch eher was wo man daheim sein Rechnungswesen Zeug machen kann."}, {"id": 518, "start": 4733.56, "end": 4739.04, "text": "Wann kommt der Staubsauger Minecraft Let's Play? Das funktioniert nicht so richtig. Gibt"}, {"id": 519, "start": 4739.04, "end": 4752.92, "text": "keine grafische Ausgabe auf dem Ding. Auch nicht über SSH. Das läuft nicht. Wenn der"}, {"id": 520, "start": 4752.92, "end": 4756.72, "text": "Friseur Mobile Games spielt kann es ihm nicht gut gehen. Doch tatsächlich. Der findet das"}, {"id": 521, "start": 4756.72, "end": 4761.84, "text": "super. Ich weiß auch nicht was da los ist. Hast du schon die neue Tech Demo von der neuen"}, {"id": 522, "start": 4761.84, "end": 4771.48, "text": "Unreal Engine angesehen? Nö. Es gibt eine neue Unreal Engine. Echt? Unreal Engine 5"}, {"id": 523, "start": 4771.48, "end": 4781.68, "text": "Demo. Ok, gucken wir uns mal an. Die neue Tech Demo ist geisteskrank. Ach, Badri, du"}, {"id": 524, "start": 4781.68, "end": 4791.12, "text": "bist ja noch da. Huge Poggers. Leute, ich hab ein Problem. Ich muss mal aufs Klo. Was"}, {"id": 525, "start": 4791.12, "end": 4806.96, "text": "macht man da? Ich mach euch den Pepega Song an. Ihr dürft euch jetzt das Aquarium und"}, {"id": 526, "start": 4806.96, "end": 4812.32, "text": "den Zug angucken und ich mach 5 Minuten Pause und geh aufs Klo. Aber das allerwichtigste"}, {"id": 527, "start": 4812.32, "end": 4821.52, "text": "Chat. Dass ihr nicht irgendwie auf die Idee kommt, jetzt während ich weg bin, XQC Chat"}, {"id": 528, "start": 4821.52, "end": 4831.04, "text": "2.0 zu machen. Außer Anygifters im Chat. Die dürfen natürlich. Geh ich jetzt auf"}, {"id": 529, "start": 4831.04, "end": 4842.96, "text": "mein Handy und mach mein Chat auf. Ich sehe euch. Ich sehe euch. Sonst bin ich in 5 Minuten"}, {"id": 530, "start": 4842.96, "end": 4861.28, "text": "wieder da. Ich mach vielleicht noch mal kurz ein Overlay. Text. Kurz auf Klo. Perfekt."}, {"id": 531, "start": 4861.28, "end": 4870.72, "text": "So, ich bin gleich wieder da. Gleich wieder am Start. Oder wie man jetzt sagen würde,"}, {"id": 532, "start": 4870.72, "end": 4874.64, "text": "der Bruder muss groß."}, {"id": 533, "start": 5200.72, "end": 5226.44, "text": "So, Chat. Ich hab alles gesehen. Jetzt werd ich erstmal 20 Leute bannen. Okay, also Unreal"}, {"id": 534, "start": 5226.44, "end": 5243.56, "text": "5 Tech Reveal. Unreal Engine 5 Revealed. Bekommst du viele Nudes von Fans geschenkt? Ich kann"}, {"id": 535, "start": 5243.56, "end": 5261.0, "text": "mich vor Dickpicks kaum noch retten. AvgText. Mal gucken ob unsere Bandbreite richtig eingestellt"}, {"id": 536, "start": 5261.0, "end": 5273.6, "text": "ist. Ja, sehr gut. Die Musik soll ich vielleicht mal ausmachen. Nix League. Der Chat. So einfach"}, {"id": 537, "start": 5273.6, "end": 5291.44, "text": "kann ich nicht gebadet werden. Es ist weder IP League noch StreamKey League. Okay. Unreal"}, {"id": 538, "start": 5291.44, "end": 5312.48, "text": "Engine 5 Revealed. Schauen wir uns das doch mal an. Bisschen lauter, hm? Oh, oui, oui."}, {"id": 539, "start": 5312.48, "end": 5341.64, "text": "Oh. Kap. Oh, Zeitschirr. Sitzen die nicht viel zu nahe? Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja."}, {"id": 540, "start": 5341.64, "end": 5370.0, "text": "Sitzen die nicht viel zu nahe beieinander? Und ganz ohne Maske? Oh, ZBrush. Ja. Ja. Ja."}, {"id": 541, "start": 5370.0, "end": 5385.52, "text": "Okay. Das ist interessant. Was es auf einer PS5 läuft. Auf der anderen Seite, wenn man"}, {"id": 542, "start": 5385.52, "end": 5390.76, "text": "sich die Specks angeguckt hat, da geht es bei mir wenigstens ein bisschen vorwärts wieder"}, {"id": 543, "start": 5390.76, "end": 5397.84, "text": "mit Hardware in Konsolen. Ist nicht mehr so enttäuschend wie bei der Xbox One und bei"}, {"id": 544, "start": 5397.84, "end": 5409.4, "text": "der PS4 zur Release. Okay. Ich mache auch mal die unten mal die Leiste weg. Ist das"}, {"id": 545, "start": 5409.4, "end": 5428.28, "text": "Partner 2? Oh, die Beleuchtung sieht schon geil aus. Das sieht, das sieht schon wirklich,"}, {"id": 546, "start": 5428.28, "end": 5438.56, "text": "wirklich gut aus. Also, das sieht wirklich gut aus. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja."}, {"id": 547, "start": 5438.56, "end": 5443.68, "text": "Das sieht wirklich gut aus. Guckt euch das mal an. Ich meine, guckt mal. Denkt euch"}, {"id": 548, "start": 5443.68, "end": 5453.56, "text": "mal die Overlays weg. Ja. Denkt euch mal die Overlays weg. Und sowas. Also, das hier könnte"}, {"id": 549, "start": 5453.56, "end": 5459.28, "text": "ohne Probleme. Okay. Wenn man sich das Gras anguckt und es pixelt und so. Ja. Okay. Wenn"}, {"id": 550, "start": 5459.28, "end": 5464.44, "text": "jemand zu einem sagen würde, sag mir mal, ob das Foto echt ist oder 3D gerendert, dann"}, {"id": 551, "start": 5464.44, "end": 5471.12, "text": "würdest du sagen, ja, okay, vielleicht 3D gerendert. Aber wenn dir das Foto einer Kontext"}, {"id": 552, "start": 5471.12, "end": 5481.0, "text": "los zeigen würde. Also, ich glaube nicht, dass es direkt einem ins Auge springen würde."}, {"id": 553, "start": 5481.0, "end": 5490.16, "text": "Na, das Gras erkennt man schon. Aber mal angenommen, mal angenommen, es würde euch"}, {"id": 554, "start": 5490.16, "end": 5500.8, "text": "eine Landschaftsaufnahme zeigen und da würde das dazwischen liegen. Also, das sieht schon"}, {"id": 555, "start": 5500.8, "end": 5508.28, "text": "ganz gut aus. Was? Der Stream pixelt echt jetzt? Allzu viel sollte da eigentlich gar"}, {"id": 556, "start": 5508.28, "end": 5520.8, "text": "nicht mal pixeln. Aber okay, wahrscheinlich halt das übliche. Es könnte, na gut, die"}, {"id": 557, "start": 5520.8, "end": 5524.72, "text": "Kompression ist natürlich ein bisschen schlechter. Die sieht hier auf YouTube schon besser aus,"}, {"id": 558, "start": 5524.72, "end": 5551.36, "text": "stimmt. Was ich cool fände, ein FPS-Counter. Ach, Chat, ich glaube euch kein Wort. Boah,"}, {"id": 559, "start": 5551.36, "end": 5569.8, "text": "gut face. Okay. Wisst ihr woran mich das erinnert? Hat irgendjemand dieses Unlimited-Detail-Video"}, {"id": 560, "start": 5569.8, "end": 5581.84, "text": "gesehen vor ein paar Jahren? Kennt das noch jemand? Unlimited-Detail, wo bis heute nichts"}, {"id": 561, "start": 5581.84, "end": 5601.16, "text": "rausgekommen ist? 16 times the details, genau. Oh man. Chat, meine Güte, wie ich hier mit"}, {"id": 562, "start": 5601.16, "end": 5614.24, "text": "mich ist da nix aus. Zumal ich höre es ja selbst, ich spiele mich ja selbst wieder ein."}, {"id": 563, "start": 5614.24, "end": 5640.2, "text": "Der Chat ist heute hart am Dauer debaten. Echtzeit, okay."}, {"id": 564, "start": 5640.2, "end": 5656.8, "text": "Also die Belichtung sieht wirklich extrem gut aus. Ich weiß das wahrscheinlich gar nicht"}, {"id": 565, "start": 5656.8, "end": 5667.6, "text": "richtig zu schätzen, aber es sieht wirklich sehr nice aus. Ist wirklich schon mal jemand"}, {"id": 566, "start": 5667.6, "end": 5672.4, "text": "so gesprungen? Das frage ich mich bei. Ich weiß, hat mit der Grafik überhaupt nichts"}, {"id": 567, "start": 5672.4, "end": 5680.56, "text": "zu tun, ja. Das ist genauso wie in Uncharted. Fünf Meter gesprungen, hingehauen und dann"}, {"id": 568, "start": 5680.56, "end": 5688.04, "text": "an einem Arm da gehauen und sich gedacht easy, easy as fuck. Ich hänge hier an einem Arm"}, {"id": 569, "start": 5688.04, "end": 5694.44, "text": "rum. Ich gucke jetzt erstmal kurz entspannt nach unten und dann mache ich bam, hochziehen."}, {"id": 570, "start": 5694.44, "end": 5718.0, "text": "Gar kein Problem. Als wird hier durchgestalzt, hä?"}, {"id": 571, "start": 5718.0, "end": 5732.12, "text": "Jetzt muss ich mir nochmal angucken. Wie sieht denn das Licht auf der Haut aus beim Durchlaufen?"}, {"id": 572, "start": 5732.12, "end": 5746.0, "text": "Das sieht ziemlich gut aus. Das sieht ziemlich gut aus. Ich mein, das sieht, das sieht wirklich"}, {"id": 573, "start": 5746.0, "end": 5750.6, "text": "sehr nah an dem aus, wie ich mir das vorstellen würde, wie es halt aussieht."}, {"id": 574, "start": 5776.0, "end": 5791.76, "text": "Ich hab ne Vorschau. Am Wasser habe ich jetzt nicht so viel erkannt. Das Wasser sah eher"}, {"id": 575, "start": 5791.76, "end": 5798.36, "text": "so aus, als haben sie drauf, passt nicht so 100% zur Animation. Aber Wasser ist doch"}, {"id": 576, "start": 5798.36, "end": 5827.2, "text": "heute schon ziemlich real. Was? Das ist doch nicht anstrengend. Vor allem,"}, {"id": 577, "start": 5827.2, "end": 5842.48, "text": "woran kehrtet sie denn? Bitte schön. Das ist cool, dass sowas dabei ist. Da kann quasi"}, {"id": 578, "start": 5842.48, "end": 5848.76, "text": "jetzt auch jeder dahergelaufene Typ nen Assassin's Creed Asset Flip machen."}, {"id": 579, "start": 5848.76, "end": 5865.96, "text": "PC Lustig sagt, aber was davon dann wirklich in Games ankommt, das ist doch bei Unreal"}, {"id": 580, "start": 5865.96, "end": 5872.4, "text": "bisher immer ziemlich gut. Alles auch in Games angekommen. Wenn man sich die Unreal Demos"}, {"id": 581, "start": 5872.4, "end": 5878.74, "text": "anguckt, 3, 4, 5. Ich überleg grad, was waren die Unreal Demo 4? An die 3 kann ich mich"}, {"id": 582, "start": 5878.74, "end": 5887.08, "text": "erinnern. Das war dieser Samarita. Der Typ, der die Leute rumboxt. Was war denn der Unreal"}, {"id": 583, "start": 5887.08, "end": 5898.0, "text": "4 Trailer nochmal? War doch dieses Zimmer. Wir gucken uns danach nochmal den Unreal 4"}, {"id": 584, "start": 5898.0, "end": 5902.12, "text": "Trailer an. Ich kann mich an den Unreal 4 Trailer nicht mehr erinnern. Ich kann mich"}, {"id": 585, "start": 5902.12, "end": 5928.56, "text": "doch an den Unreal 3 Trailer erinnern. Wow, ein Michael-5-Spieler an. Ah, habt ihr gesehen,"}, {"id": 586, "start": 5928.56, "end": 5934.0, "text": "wie es glänzt? Das ist cool."}, {"id": 587, "start": 5958.56, "end": 5981.92, "text": "Und was haben die von der Hardware drinnen? Ach nee, es ist ja PS5, haben sie ja gesagt."}, {"id": 588, "start": 5981.92, "end": 6011.68, "text": "Normaler PS5."}, {"id": 589, "start": 6011.68, "end": 6039.0, "text": "Das ist alles AMD, ja."}, {"id": 590, "start": 6039.0, "end": 6057.72, "text": "Ich denke mal, das sind eher 30 FPS. Ich glaube nicht, dass das mit 60 läuft. Es ist"}, {"id": 591, "start": 6057.72, "end": 6064.96, "text": "auch nicht wirklich zu erkennen, weil das Video halt selbst nur mit 30 ist. Was für"}, {"id": 592, "start": 6064.96, "end": 6069.72, "text": "eine Grafikkarte ist vergleichbar mit einer PS5? Oh, ich habe es immer richtig im Kopf."}, {"id": 593, "start": 6069.72, "end": 6079.24, "text": "Ich glaube, eine 2070 oder so, ne? So um den Dreh um eine 2070, glaube, war das. Kann"}, {"id": 594, "start": 6079.24, "end": 6082.52, "text": "auch sein, dass ich jetzt komplett falsch liege. Ich kriege es auch im Kopf nicht mehr richtig"}, {"id": 595, "start": 6082.52, "end": 6106.24, "text": "zusammen. Portal 3, confirmed. Ezio-Style, nee, doch nicht. Eher, eher. Alles klar. Anthem,"}, {"id": 596, "start": 6106.24, "end": 6116.56, "text": "eher Anthem-Style. Ach, das ist das Anthem, wie Mastern, wo sie alle vorgehen. Und durch"}, {"id": 597, "start": 6116.56, "end": 6138.56, "text": "Portal und Schnitt, nee, doch nicht. Wieso ist sie nicht einfach vorher hochgeflogen,"}, {"id": 598, "start": 6138.56, "end": 6143.24, "text": "sagt Maurice? Naja, weil sie da noch nicht das Level Up hatte, was sie erst oben gekriegt"}, {"id": 599, "start": 6143.24, "end": 6161.84, "text": "hat. Dieses, dieses Kletzerding. Ultranice. Ultranice. Wie gesagt, ich bin, ich kenne"}, {"id": 600, "start": 6161.84, "end": 6168.36, "text": "mich mit 3D-Programmierzeug und Grafik null aus. Ich habe da nur Absolut-Basic. Das Einzige,"}, {"id": 601, "start": 6168.36, "end": 6173.72, "text": "was ich bisher mal OpenGL wirklich from scratch, raw-mäßig programmiert habe, ist die T-Kanne."}, {"id": 602, "start": 6173.72, "end": 6186.44, "text": "Die T-Kanne mit OpenGL. Die Basic-T-Kanne. Das sind ungefähr so 50 Zeilen oder so. Die"}, {"id": 603, "start": 6186.44, "end": 6191.76, "text": "OpenGL-T-Kanne ist das Einzige, was ich hier programmiert habe. So richtig low-level 3D."}, {"id": 604, "start": 6191.76, "end": 6203.72, "text": "Und was ist mit Lull-3D? Äh, das, genau, das ist die Annual-4-Demo. Richtig, richtig,"}, {"id": 605, "start": 6203.72, "end": 6217.44, "text": "richtig. Ich erinnere mich, das ist, ja, genau, dieses, dieses Flammending. Ja. Moment."}, {"id": 606, "start": 6217.44, "end": 6235.36, "text": "Jetzt brauchen wir eine höhere Auflösung. What? Ah. Und denkt dran, es ist 7 Jahre her,"}, {"id": 607, "start": 6235.36, "end": 6248.6, "text": "was wir jetzt sehen. 7 Jahre. Stimmt, ja, jetzt kann ich mich wieder an die Annual-4-Demo"}, {"id": 608, "start": 6248.6, "end": 6260.52, "text": "erinnern. Klettert da jetzt nicht auch gleich jemand? Ne, das war wieder was anderes. Das"}, {"id": 609, "start": 6260.52, "end": 6276.52, "text": "ist der Typ auf dem Thron, genau. Na, 7 Jahre ist ja heutzutage Hardware-technisch nicht"}, {"id": 610, "start": 6276.52, "end": 6290.16, "text": "mehr das, wie es vor, wie 7 Jahre vor 7 Jahren war. Also, es hat sich schon einiges getan,"}, {"id": 611, "start": 6290.16, "end": 6301.0, "text": "das sind 7 Jahre, aber es ist jetzt nicht so, wie die 7 Jahre davor. Aber man erkennt"}, {"id": 612, "start": 6301.0, "end": 6316.96, "text": "das schon. Patrick, das ist doch wurscht, selbst, selbst wenn sich das, wenn sich das"}, {"id": 613, "start": 6316.96, "end": 6323.2, "text": "weiterentwickelt auf den CPUs. Du kannst heute ohne Probleme noch mit einem Rechner, der"}, {"id": 614, "start": 6323.2, "end": 6337.0, "text": "4-5 Jahre alt ist, halbwegs spielen und probier das die 7 Jahre davor mal aus. Fand die 5er"}, {"id": 615, "start": 6337.0, "end": 6347.36, "text": "auch besser aus Big Brain Chat heute wieder am Start. Wollen wir uns noch die 3er angucken"}, {"id": 616, "start": 6347.36, "end": 6352.68, "text": "dann? Da hat sich noch mehr getan. Und ich sag euch Leute, ihr findet wahrscheinlich"}, {"id": 617, "start": 6352.68, "end": 6378.4, "text": "die 5er auch besser als die 3er, aber der 3er Trailer ist der beste. Ah, damals hat"}, {"id": 618, "start": 6378.4, "end": 6394.16, "text": "man richtig gesagt, boah, die ganzen Partikel und sonst was. Ah, da hat sich schon einiges"}, {"id": 619, "start": 6394.16, "end": 6423.0, "text": "getan. Das ist für die PS4. Aber der Trailer ist für alle gleich. Oh, ein KS. So, aber"}, {"id": 620, "start": 6423.0, "end": 6431.24, "text": "der 3er Trailer ist der beste. Ich mein, das ist ein Riesenunterschied, wie es aussieht,"}, {"id": 621, "start": 6431.24, "end": 6436.4, "text": "ja. Aber der Trailer von der Unreal 3 Engine war am besten bisher. Mal gucken, ob wir das"}, {"id": 622, "start": 6436.4, "end": 6445.92, "text": "in ordentlicher Auflösung irgendwie finden. Ja. Ist der beste Trailer, finde ich, von"}, {"id": 623, "start": 6445.92, "end": 6459.8, "text": "dem wir sehen. Denkt dran, das sind die Games, also Unreal 3 war ja auf PS3 und Xbox 360,"}, {"id": 624, "start": 6459.8, "end": 6471.88, "text": "die Engine schlechthin, ne, da war ja irgendwie gefühlt 60% der Games war Unreal 3. Wobei"}, {"id": 625, "start": 6471.88, "end": 6478.12, "text": "das hier garantiert nicht auf der Xbox gelaufen ist. Äh, Unreal 3 kam, was weiß ich, vor"}, {"id": 626, "start": 6478.12, "end": 6505.2, "text": "10 Jahren oder so. Aber der Trailer ist am besten. Was auch immer er da macht."}, {"id": 627, "start": 6505.2, "end": 6528.28, "text": "Warum auch immer er an der Kette geschweißt hat."}, {"id": 628, "start": 6528.28, "end": 6544.4, "text": "Wieso da?"}, {"id": 629, "start": 6544.4, "end": 6564.96, "text": "Bam in your face"}, {"id": 630, "start": 6564.96, "end": 6577.72, "text": "Ah"}, {"id": 631, "start": 6577.72, "end": 6579.72, "text": "Sie sind in der Nähe."}, {"id": 632, "start": 6579.72, "end": 6581.72, "text": "Sie sind in der Nähe."}, {"id": 633, "start": 6581.72, "end": 6583.72, "text": "Sie sind in der Nähe."}, {"id": 634, "start": 6583.72, "end": 6585.72, "text": "Sie sind in der Nähe."}, {"id": 635, "start": 6589.72, "end": 6591.72, "text": "Sie sind in der Nähe."}, {"id": 636, "start": 6591.72, "end": 6613.72, "text": "Sie sind in der Nähe."}, {"id": 637, "start": 6621.72, "end": 6623.72, "text": "Sie sind in der Nähe."}, {"id": 638, "start": 6623.72, "end": 6625.72, "text": "Sie sind in der Nähe."}, {"id": 639, "start": 6625.72, "end": 6627.72, "text": "Sie sind in der Nähe."}, {"id": 640, "start": 6627.72, "end": 6629.72, "text": "Sie sind in der Nähe."}, {"id": 641, "start": 6639.72, "end": 6641.72, "text": "Sie sind in der Nähe."}, {"id": 642, "start": 6641.72, "end": 6643.72, "text": "Sie sind in der Nähe."}, {"id": 643, "start": 6647.72, "end": 6649.72, "text": "Sie sind in der Nähe."}, {"id": 644, "start": 6649.72, "end": 6667.4, "text": "das 5 echtes gameplay ist ist cool ja das stimmt also rein aber von der von der von"}, {"id": 645, "start": 6667.4, "end": 6670.64, "text": "der aufmachung her wie das geschnitten ist wie das gemacht hat finde ich den 3er immer"}, {"id": 646, "start": 6670.64, "end": 6693.32, "text": "noch am besten holy shit was war das denn unreal 1 unreal engine 1 ich glaube das ist auch das"}, {"id": 647, "start": 6693.32, "end": 6699.6, "text": "erste mal dass man so wirklich den engine trailer hatte den gameplay engine trailers"}, {"id": 648, "start": 6699.6, "end": 6703.16, "text": "ansonsten haben die halt immer einen trailer gemacht in form von halt so einem filmchen"}, {"id": 649, "start": 6703.16, "end": 6709.44, "text": "was angeblich halt in echtzeit gelaufen ist hast du die unreal demo oft ja haben wir uns"}, {"id": 650, "start": 6709.44, "end": 6717.12, "text": "gerade angeguckt moment was es gibt es gibt telekom unterwäsche kam ist das safe aufzumachen"}, {"id": 651, "start": 6717.12, "end": 6730.64, "text": "ja was jetzt was das wenn ich das häkchen weg mache ist das häkchen immer noch da"}, {"id": 652, "start": 6730.64, "end": 6751.12, "text": "gebadet grüßes mann scam scam ja ist mir doch vollkommen egal weiter love magenta connected"}, {"id": 653, "start": 6751.12, "end": 6763.4, "text": "underwear oh mann for men for women for for kids ok jetzt jetzt wirds aber jetzt wirds"}, {"id": 654, "start": 6763.4, "end": 6778.14, "text": "aber gefährlich telekom ja love magenta connected andere entwickelt intelligente"}, {"id": 655, "start": 6778.14, "end": 6785.68, "text": "unterwäsche die das smartphone vorüber gehen zum schweigen bringen ok das heißt wenn sich"}, {"id": 656, "start": 6785.68, "end": 6790.88, "text": "zwei leute die diese unterwäsche tragen nähern oder was und dann dann schaltet das smartphone"}, {"id": 657, "start": 6790.88, "end": 6809.4, "text": "ab bluetooth funktion das habe ich schon mal gesehen das haben uns doch schon mal angeguckt"}, {"id": 658, "start": 6809.4, "end": 6818.36, "text": "kann man auf der seite htps zertifikate verschenken krelax ich habe keine ahnung was du meinst"}, {"id": 659, "start": 6818.36, "end": 6828.48, "text": "also was bekommt man eine love magenta stofftasche mit kordelzug aha mit magenta dna hoffe ich"}, {"id": 660, "start": 6828.48, "end": 6840.88, "text": "unterhosen herren boxershorts ein damenslip hüftige passform zwei love chips was ein"}, {"id": 661, "start": 6840.88, "end": 6847.76, "text": "schwachsinn auf lager ich hätte mich auch gewundert wenn das ausverkauft wäre max will"}, {"id": 662, "start": 6847.76, "end": 6855.12, "text": "nur den damenslip richtig das war ich da wieder typ auf dem einen foto als corona maske oder"}, {"id": 663, "start": 6855.12, "end": 6865.84, "text": "als als atemschutzmaske verwendet haben wir tatsächlich dem kumpel zum geburtstag geschenkt"}, {"id": 664, "start": 6865.84, "end": 6878.28, "text": "sagt der blobs rusher exzellent wie gehts tscheko ja was die gerade treibt weiß ich aber der"}, {"id": 665, "start": 6878.28, "end": 6890.72, "text": "gehts gut tscheko gehts gut tscheko glaube mit k zumindest guckt sie kritisch auf dem"}, {"id": 666, "start": 6890.72, "end": 6902.12, "text": "foto ja was es nicht alles gibt telekom unterwäsche interessant ja aber geguckt"}, {"id": 667, "start": 6902.12, "end": 6921.56, "text": "dass man mikro angeblich aus ist das hatten wir schon wünschst du dir das mehr arbeitgeber"}, {"id": 668, "start": 6921.56, "end": 6929.64, "text": "nach der krise auf dem zu bleiben mit home office das ist eine sehr gute frage ich glaube"}, {"id": 669, "start": 6929.64, "end": 6934.12, "text": "dass das passieren wird ja es ist vollkommen egal ob ich mir das wünsche oder nicht ich"}, {"id": 670, "start": 6934.12, "end": 6944.12, "text": "gehe davon aus dass das passieren wird ich gehe ich von aus ja zumal ja auch viele unternehmen"}, {"id": 671, "start": 6944.12, "end": 6949.84, "text": "jetzt erst angefangen haben quasi digitale infrastruktur zur bereit bereit zu stellen"}, {"id": 672, "start": 6949.84, "end": 6971.96, "text": "dass es überhaupt möglich ist der chat wieder lowbrane chat gerade ja aber es wäre auf jeden"}, {"id": 673, "start": 6971.96, "end": 6978.36, "text": "fall cool wenn sich das mehr durchsetzt also wie gesagt ich gehe da fest von aus zumal"}, {"id": 674, "start": 6978.36, "end": 6984.64, "text": "es ja auch noch eine weile dauern wird bis das so wieder alles falls überhaupt das mal"}, {"id": 675, "start": 6984.64, "end": 6992.24, "text": "jeweils wieder normal wird keine prime subs chat bleibt dumm sieht heute wirklich so aus"}, {"id": 676, "start": 6992.24, "end": 6999.4, "text": "ja heute ist heute ist mal abwechslungsweise kein high IQ chat da heute ist wirklich ich"}, {"id": 677, "start": 6999.4, "end": 7004.04, "text": "hab ich hab noch nicht mal ich hab noch nicht mal ein emote dafür weil normalerweise ist"}, {"id": 678, "start": 7004.04, "end": 7008.48, "text": "der chat der chat ist normalerweise immer schon ziemlich big brain aber heute weiß ich nicht"}, {"id": 679, "start": 7008.48, "end": 7019.28, "text": "was mit dem chat los ist david 3 sagt bei mir bleibt home office solange bis der mindestabstand"}, {"id": 680, "start": 7019.28, "end": 7028.52, "text": "nicht mehr benötigt wird bei uns ist auch noch home office angesagt liegt an 5g oh stimmt"}, {"id": 681, "start": 7028.52, "end": 7037.32, "text": "5g ausbau geht ja immer weiter und all bill gates 5g und bill gates bestimmt für meinen"}, {"id": 682, "start": 7037.32, "end": 7043.44, "text": "twitch chat verantwortlich gehe ich auch von aus ich hatte ja schon immer den eindruck"}, {"id": 683, "start": 7043.44, "end": 7062.12, "text": "dass mit dem chat was nicht stimmt ok der flur ist nicht mal 1,5 meter breit also bei"}, {"id": 684, "start": 7062.12, "end": 7070.28, "text": "uns auf der arbeit ist jetzt so wir kriegen masken gestellt von der firma wir haben allerdings"}, {"id": 685, "start": 7070.28, "end": 7079.24, "text": "unsere masken erst eine woche später bekommen als gedacht weil das jetzt kein witz weil"}, {"id": 686, "start": 7079.24, "end": 7084.88, "text": "es normale masken nicht getan haben wir mussten uns erst masken mit unserem firmen logo drauf"}, {"id": 687, "start": 7084.88, "end": 7096.04, "text": "drucken lassen weil immer das heißt wir haben jetzt quasi paar kisten mit masken wo das"}, {"id": 688, "start": 7096.04, "end": 7102.44, "text": "firmen logo drauf ist ganz wichtig man braucht unbedingt atemschutzmasken mit firmen logo"}, {"id": 689, "start": 7102.44, "end": 7109.04, "text": "wenigstens ffp 2 fragt kein schimmer also wir wer ins büro geht da kriegt eine maske"}, {"id": 690, "start": 7109.04, "end": 7115.32, "text": "gestellt und bei uns ist pflicht dass man die maske an hat sobald man seinen arbeitsplatz"}, {"id": 691, "start": 7115.32, "end": 7120.84, "text": "bzw das büro verlässt also sprich wenn man auf den flur geht aufs klo in die kirche"}, {"id": 692, "start": 7120.84, "end": 7127.72, "text": "sonst muss die maske anziehen und wer mittagessen will der muss sich vorher anmelden und sagen"}, {"id": 693, "start": 7127.72, "end": 7138.48, "text": "wann er kommt und dann kann es sich entweder unten hinsetzen oder ihm mitnehmen oder michael"}, {"id": 694, "start": 7138.48, "end": 7147.84, "text": "50 billionen fragt was ich stehe vor einer schwierigen entscheidung also ich habe zwei"}, {"id": 695, "start": 7147.84, "end": 7156.24, "text": "angebote für eine ausbildung erstens fachkraft für lagerlogistik aber bekomme im ersten"}, {"id": 696, "start": 7156.24, "end": 7165.44, "text": "ausbildung ist ja schon knapp ein k muss aber tatsächlich arbeiten das soll als azubi durchaus"}, {"id": 697, "start": 7165.44, "end": 7171.84, "text": "vorkommen ja fachinformatiker für andere für anwendungsentwicklung aber da bekomme"}, {"id": 698, "start": 7171.84, "end": 7177.8, "text": "ich im ersten jahr das was gefällt dir denn vom inhalt her besser scheiß mal auf das geld"}, {"id": 699, "start": 7177.8, "end": 7189.4, "text": "du kommst mit beidem gehalt nicht über die runden was sagt dir denn mehr zu aber generell"}, {"id": 700, "start": 7189.4, "end": 7194.12, "text": "nicht so nice da bin ich ganz bei dir ja aber die meisten leute werden wahrscheinlich nicht"}, {"id": 701, "start": 7194.12, "end": 7203.48, "text": "drumherum kommen was gefällt dir denn besser scheiß auf das geld also du kommst mit einem"}, {"id": 702, "start": 7203.48, "end": 7213.16, "text": "k im prinzip genauso weit wie mit 600 nehme ich gar nicht chill seit einem jahr zu hause"}, {"id": 703, "start": 7213.16, "end": 7217.92, "text": "warum sollte ich arbeiten ja dann mach doch nix dann bleib einfach weiter daheim"}, {"id": 704, "start": 7217.92, "end": 7247.84, "text": "als fahrinforter immer nach der ausbildung mehr verdienen als"}, {"id": 705, "start": 7247.84, "end": 7254.0, "text": "als fachkraft für lagerlogistik ich habe ehrlich gesagt keine ahnung ich würde aber von ausgehen"}, {"id": 706, "start": 7254.0, "end": 7268.6, "text": "ich habe ein manjaru analog zu deinem einrichtung setup meine status leisten sie das gucke ich"}, {"id": 707, "start": 7268.6, "end": 7272.04, "text": "mir garantiert nicht im stream an das gucke ich mir erst mal auf der anderen seite an"}, {"id": 708, "start": 7272.04, "end": 7280.56, "text": "du hast den image font nicht installiert ja du hast den image font nicht installiert du"}, {"id": 709, "start": 7280.56, "end": 7288.32, "text": "musst dir dann immer in meinem fall ist es ein emoji font du musst dir den emoji font"}, {"id": 710, "start": 7288.32, "end": 7305.12, "text": "installieren emoji von oder sowas du musst den image font installieren joy pixels joy"}, {"id": 711, "start": 7305.12, "end": 7317.72, "text": "pixels muss den zählen geht dann geht deine leiste woher kommt der schlechte ruf von java"}, {"id": 712, "start": 7317.72, "end": 7321.84, "text": "da muss ich dich jetzt muss ich dich aber fragen meinst du woher der schlechte ruf kommt warum"}, {"id": 713, "start": 7321.84, "end": 7328.76, "text": "ich immer über java lästere oder meinst oder hast du das gehört irgendwo also warum"}, {"id": 714, "start": 7328.76, "end": 7333.32, "text": "ich über java lästere hat eigentlich keinen tieferen grund außer dass ich gerne über"}, {"id": 715, "start": 7333.32, "end": 7338.4, "text": "java lästere ich kann das es liegt nicht daran dass java irgendwie unbenutzbar und total"}, {"id": 716, "start": 7338.4, "end": 7348.16, "text": "scheiße wäre java ist ganz okay man kann schon sachen in java machen ansonsten kommt"}, {"id": 717, "start": 7348.16, "end": 7355.04, "text": "daher dass halt früher viele scheiß java programme gab auch noch aus zeiten wo es java"}, {"id": 718, "start": 7355.04, "end": 7361.32, "text": "applets gab falls ich noch irgendeiner über an an java applets erinnern kann an anwendungen"}, {"id": 719, "start": 7361.32, "end": 7367.12, "text": "die halt ewig laden scheiße aussehen und irgendwie sich einfach crappy anfühlen aber"}, {"id": 720, "start": 7367.12, "end": 7374.64, "text": "man darf nicht vergessen dass gerade im finanzsektor die meisten backends in java sind also sprich"}, {"id": 721, "start": 7374.64, "end": 7378.84, "text": "wenn ihr auf die seite von eurer bank geht ist die chance dass das da java im hintergrund"}, {"id": 722, "start": 7378.84, "end": 7388.76, "text": "läuft relativ hoch also man kann mit java ohne probleme gescheite sachen machen und"}, {"id": 723, "start": 7388.76, "end": 7393.88, "text": "außerdem muss man das trennen man muss java die programmiersprache trennen von der runtime"}, {"id": 724, "start": 7393.88, "end": 7403.52, "text": "an sich weil die java runtime wenn man eine ordentliche sprache nimmt ist sicherlich ganz"}, {"id": 725, "start": 7403.52, "end": 7411.56, "text": "gut ich weiß nicht wieso der direkte vergleich aussehen würde jvm versus dotnet core keine"}, {"id": 726, "start": 7411.56, "end": 7416.44, "text": "ahnung dafür mache ich zu wenig mit java aber ich denke mal so viel schlechter oder"}, {"id": 727, "start": 7416.44, "end": 7420.04, "text": "besser wie auch immer wird wenn er beide seiten während beide seiten werden sich wahrscheinlich"}, {"id": 728, "start": 7420.04, "end": 7425.44, "text": "nicht viel nicht viel nehmen alte hp switches mit java applets sind das schlimmste ja mein"}, {"id": 729, "start": 7425.44, "end": 7433.68, "text": "management interface hier auf der serverkiste ist noch in java applets ganz abartig warum"}, {"id": 730, "start": 7433.68, "end": 7440.44, "text": "java wäre z plus plus nicht leistungsfähiger ja doch wäre es schöner wäre es nicht also"}, {"id": 731, "start": 7440.44, "end": 7445.52, "text": "wenn wenn was noch hässlicher als java ist dann ist es z plus plus aber du findest einfach"}, {"id": 732, "start": 7445.52, "end": 7449.96, "text": "deutlich mehr programmierer die verstehen oder zumindest nicht so viel scheiße bauen"}, {"id": 733, "start": 7449.96, "end": 7457.44, "text": "können für java als für z plus plus und wenn die komplexität steigt würde ich sagen"}, {"id": 734, "start": 7457.44, "end": 7463.2, "text": "hat java trotzdem noch einen vorteil gegenüber z plus plus gerade im bereich wenn es sicher"}, {"id": 735, "start": 7463.2, "end": 7472.64, "text": "sein soll oder zumindest schwerer zu exploiten wenn es um finanzgeschichten geht also du"}, {"id": 736, "start": 7472.64, "end": 7477.04, "text": "kannst ja quasi in java keine overflows im eigentlichen sinne produzieren in z plus plus"}, {"id": 737, "start": 7477.04, "end": 7486.72, "text": "ist das easy aber ich denke weil der größte faktor ist dass im java im finanzsektor etabliert"}, {"id": 738, "start": 7486.72, "end": 7495.76, "text": "ist und dass du halt recht einfach java programmierer findest wohingegen fähige z plus plus programmierer"}, {"id": 739, "start": 7495.76, "end": 7507.16, "text": "ist deutlich schwieriger bist du aus dem perlzeit alter nein später perlzeit alter"}, {"id": 740, "start": 7507.16, "end": 7514.84, "text": "war war noch ein bisschen vor mir man sagt auch die einzige right only sprache"}, {"id": 741, "start": 7514.84, "end": 7528.92, "text": "so gut easy money easy life"}, {"id": 742, "start": 7528.92, "end": 7540.08, "text": "bei mir ist es ja so ich kriege ich gehe vier tage die wochenwoche arbeiten also ich"}, {"id": 743, "start": 7540.08, "end": 7545.04, "text": "verdiene da ganz gut wir haben es letztes mal angeguckt ich sehe dass ich da im geld schwimme"}, {"id": 744, "start": 7545.04, "end": 7549.48, "text": "von oder so aber das ist schon ganz ok dazu kommt noch ein bisschen youtube bisschen reflink"}, {"id": 745, "start": 7549.48, "end": 7555.28, "text": "bisschen twitch und nachdem ich halt auch jemand bin der kaum geld ausgibt wird es"}, {"id": 746, "start": 7555.28, "end": 7561.72, "text": "auch gerade nur mehr aber man weiß nie wofür man es braucht also ich mache das gegenteil"}, {"id": 747, "start": 7561.72, "end": 7568.12, "text": "davon ich kaufe mir einfach immer wenn ich was haben will kaufe ich es mir ansonsten"}, {"id": 748, "start": 7568.12, "end": 7574.84, "text": "gebe ich kaum geld aus hast du den bachelor gemacht nee so das hat auf fack jetzt habe"}, {"id": 749, "start": 7574.84, "end": 7586.52, "text": "ich was gelöscht was denn hast du große ziele im leben ja ich will mal mehr abos auf youtube"}, {"id": 750, "start": 7586.52, "end": 7594.56, "text": "ich will mal 300.000 abos auf youtube schaffen dazu müsste ich aber videos machen fährst"}, {"id": 751, "start": 7594.56, "end": 7599.52, "text": "so gerne den urlaub ich bin früher gerne in urlaub gefahren bin auch früher relativ"}, {"id": 752, "start": 7599.52, "end": 7609.92, "text": "viel geflogen den urlaub aber ich glaube die letzten zehn jahre oder so schon war ich"}, {"id": 753, "start": 7609.92, "end": 7621.8, "text": "bis auf ein paar kleinere ausflüge nicht mehr lange weg fliegen in 2020 ja ich meine nicht"}, {"id": 754, "start": 7621.8, "end": 7636.4, "text": "gerade jetzt wäre die ganze corona geschichten keine ahnung kann sein kann sein dass wir"}, {"id": 755, "start": 7636.4, "end": 7640.24, "text": "damit auch werben aber die ganzen werbesprüche kannst du eh vergessen ich meine was soll"}, {"id": 756, "start": 7640.24, "end": 7646.6, "text": "das denn heißen 100 virenscanner 150 firewalls was was soll uns das überhaupt sagen ergibt"}, {"id": 757, "start": 7646.6, "end": 7656.48, "text": "überhaupt keinen sinn ja knäher mehr kann man kann man machen weiß aber nicht ob das"}, {"id": 758, "start": 7656.48, "end": 7664.76, "text": "gerade so die gute idee ist das ist halt so typisch typischer marketing bullshit circa"}, {"id": 759, "start": 7664.76, "end": 7670.64, "text": "100 virenscanner 150 firewalls also ich bezweifle dass es 100 virenscanner irgendwie sicherer"}, {"id": 760, "start": 7670.64, "end": 7678.44, "text": "machen als nur nur dann voll und wenn der traffic wirklich durch 150 firewalls durch"}, {"id": 761, "start": 7678.44, "end": 7689.64, "text": "muss dann frage ich mich was sie für eine architektur haben"}, {"id": 762, "start": 7689.64, "end": 7693.92, "text": "ich habe nicht gesagt dass ich mehr videos mache ich habe gesagt ich verspreche erst"}, {"id": 763, "start": 7693.92, "end": 7704.32, "text": "gar nicht dass ich mehr videos mache keine prime subs chat bleibt um mehr low brain chat"}, {"id": 764, "start": 7704.32, "end": 7730.52, "text": "heute any primers der blobsrascher schreibt habe heute meinen ersten richtigen job bekommen"}, {"id": 765, "start": 7730.52, "end": 7734.52, "text": "danke dafür das ist schön wenn das falls ich damit was zu tun habe wahrscheinlich"}, {"id": 766, "start": 7734.52, "end": 7739.12, "text": "liegt erst einmal hauptsächlich an dir dass du die überzeugt hast habe mich damals von"}, {"id": 767, "start": 7739.12, "end": 7745.16, "text": "deinen videos inspirieren lassen was mit informatik zu machen sobald erstes galt kommt gibt's"}, {"id": 768, "start": 7745.16, "end": 7751.64, "text": "spende ganz paar subs giften excellent dann ist das ist das chat auch nicht so low brain"}, {"id": 769, "start": 7751.64, "end": 7759.76, "text": "dann ist endlich wieder high iq chat angesagt oh jack 690 zehn monate in folge massive subscription"}, {"id": 770, "start": 7759.76, "end": 7764.92, "text": "es geht es geht auf wer chat ich glaube der chat muss nicht dumm ins bett gehen heute"}, {"id": 771, "start": 7764.92, "end": 7765.92, "text": "abend"}, {"id": 772, "start": 7765.92, "end": 7779.28, "text": "wie high iq bin ich du bist erst ein monat abonnent du bist noch ganz ganz du bist noch"}, {"id": 773, "start": 7779.28, "end": 7793.56, "text": "nicht high iq das kommt noch das das braucht seine zeit aber du musst dabei bleiben sonst"}, {"id": 774, "start": 7793.56, "end": 7804.92, "text": "wird das nie was also chat also also wenn die subscription monate iq werden dann werden"}, {"id": 775, "start": 7804.92, "end": 7812.0, "text": "wir alle auf dem stand von irgendeinem nordsee krebs das geht ja nicht über zwölf monate"}, {"id": 776, "start": 7812.0, "end": 7821.52, "text": "vorbei geht ja nicht über zwölf monate drüber oder zehn monate zehn monate glaube"}, {"id": 777, "start": 7821.52, "end": 7827.48, "text": "das ist das ist wahrscheinlich noch nicht mal so nordsee krebs was ist das für ein"}, {"id": 778, "start": 7827.48, "end": 7840.16, "text": "sorgen ist es luigi's luigi's menschen nee es soll super mario du wirst nicht gehasst"}, {"id": 779, "start": 7840.16, "end": 7848.84, "text": "vom chat der chat kann sowas gar nicht das ist support auf oder kundensupport auf oder"}, {"id": 780, "start": 7848.84, "end": 7863.88, "text": "vorniveau selbst alle beauty youtuber auf youtube zusammen haben ja warum streamst du"}, {"id": 781, "start": 7863.88, "end": 7871.28, "text": "eigentlich in 48 fps ja die fragen kommt öfters das liegt einfach daran weil 48 fps flüssiger"}, {"id": 782, "start": 7871.28, "end": 7879.08, "text": "sind als 30 allerdings fürs einzelne bild mehr von der bitrate übrig bleibt wie bei"}, {"id": 783, "start": 7879.08, "end": 7886.84, "text": "60 das sieht besser aus und flüssiger ist quasi das beste aus beiden welten flüssiger"}, {"id": 784, "start": 7886.84, "end": 7907.16, "text": "und besser"}, {"id": 785, "start": 7907.16, "end": 7913.92, "text": "was schreibt er hier ich regel mich täglich über die leute auf die nicht am ball bleiben"}, {"id": 786, "start": 7913.92, "end": 7918.12, "text": "die sind dann meistens auch noch sehr laut oh ja da gibt es viele von die würden am"}, {"id": 787, "start": 7918.12, "end": 7922.24, "text": "liebsten noch mit dotnet 3.5 entwickeln mit noch nicht immer vier sondern wenn schon"}, {"id": 788, "start": 7922.24, "end": 7932.44, "text": "35 und dort net core ist böse weil neu ja hast du in allen bereichen jetzt mal unabhängig"}, {"id": 789, "start": 7932.44, "end": 7943.28, "text": "von dort net bei uns gibt es auch leute wo ich mich frage ob die die letzten die letzten"}, {"id": 790, "start": 7943.28, "end": 7950.88, "text": "fünf jahre irgendwie geschlafen haben zum beispiel noch nicht mal erklären können"}, {"id": 791, "start": 7950.88, "end": 7956.56, "text": "was oder grob der unterschied ist zwischen dem container oder vm oder man ist experte"}, {"id": 792, "start": 7956.56, "end": 7965.44, "text": "für email systeme aber kriegt kein smtb richtig konfiguriert oder was haben wir haben so viele"}, {"id": 793, "start": 7965.44, "end": 7970.76, "text": "wir haben so viele experten in anführungsstriche das ist ja so ein thema wenn ich damit anfangen"}, {"id": 794, "start": 7970.76, "end": 7974.64, "text": "höre ich gar nicht mehr auf wir haben so viele experten wo ich mich frage in was die experte"}, {"id": 795, "start": 7974.64, "end": 7989.08, "text": "sind allerdings höchstwahrscheinlich nicht in dem wofür man sie eingekauft hat"}, {"id": 796, "start": 7989.08, "end": 7992.04, "text": "captain peng schreibt ich habe jetzt gar nicht in chat geguckt ich habe die ganze zeit"}, {"id": 797, "start": 7992.04, "end": 7997.2, "text": "nur mein tool geguckt schreibt ich studiere informatik und muss mich langsam entscheiden"}, {"id": 798, "start": 7997.2, "end": 8003.56, "text": "in welche richtung ich mich orientieren will datenverarbeitung aka big data und webentwicklung"}, {"id": 799, "start": 8003.56, "end": 8014.08, "text": "oder spiele und spiele design und spiele programmierung da kann ich dir nicht helfen"}, {"id": 800, "start": 8014.08, "end": 8021.12, "text": "bei da kann ich die entscheidung kann ich dir glaube ich nichts nichts gutes dazu raten"}, {"id": 801, "start": 8021.12, "end": 8027.48, "text": "also wenn ihr also v-skatze gefällt beides gleich gleich beides gleich gleich gut ja weil"}, {"id": 802, "start": 8027.48, "end": 8031.76, "text": "das was du im studium da lernst ist jetzt ja nicht unbedingt das was du später was du"}, {"id": 803, "start": 8031.76, "end": 8050.28, "text": "später 100 prozentig machen wirst keine ahnung keine ahnung da kann ich wirklich nichts"}, {"id": 804, "start": 8050.28, "end": 8060.52, "text": "zu sagen was hältst du von macbooks ich finde ich finde die meiste apple hardware eigentlich"}, {"id": 805, "start": 8060.52, "end": 8068.24, "text": "ganz gut allerdings viel zu teuer und auch viel zu eingeschränkt ich würde auch mit"}, {"id": 806, "start": 8068.24, "end": 8073.44, "text": "mac os nicht klarkommen als main betriebssystem wenn ich von windows weg könnte würde ich"}, {"id": 807, "start": 8073.44, "end": 8077.16, "text": "linux verwenden allerdings kann ich von windows nicht weg also kann ich auch kein mac verwenden"}, {"id": 808, "start": 8077.16, "end": 8083.16, "text": "und wenn auf mac installieren kann ich mir auch gleich irgendwas anderes zusammenbauen"}, {"id": 809, "start": 8083.16, "end": 8092.28, "text": "habe ich mir auch habe ich hier vorgenommen ja dass wir in nächster zeit auch ein bisschen"}, {"id": 810, "start": 8092.28, "end": 8102.8, "text": "git magic zusammen machen ist ich das ist aus irgendeiner dummen rtl sendung wenn ich"}, {"id": 811, "start": 8102.8, "end": 8117.44, "text": "doch zusammen krieg piss dich alle ist das ist das das hier noch wo sagt er piss dich"}, {"id": 812, "start": 8117.44, "end": 8142.4, "text": "alle piss dich alle genau piss dich alle das ist so dumm"}, {"id": 813, "start": 8142.4, "end": 8156.6, "text": "piss dich alle das können wir das können wir echt hinzufügen ja das ist gut ok erstmal"}, {"id": 814, "start": 8156.6, "end": 8167.68, "text": "runterladen erstmal fünf schmalier verzeichnis wechsel youtube dl und dann als als welches"}, {"id": 815, "start": 8167.68, "end": 8181.68, "text": "format müssen wir das runterladen als hier m4a meinetwegen ne 140 halbwegs guter quali"}, {"id": 816, "start": 8181.68, "end": 8200.04, "text": "runterladen so und jetzt ffm pack input piss dich alde output piss dich waff explore piss"}, {"id": 817, "start": 8200.04, "end": 8212.2, "text": "dich all piss dich waff ja da ist es doch piss dich aldo perfekt so dann machen wir"}, {"id": 818, "start": 8212.2, "end": 8222.24, "text": "das mal hier rein piss dich aldo ja funktioniert sehr gut so langsam aber sicher haben wir"}, {"id": 819, "start": 8222.24, "end": 8237.92, "text": "die essentials haben wir drinnen youtube dl funktioniert bei dir oft nicht bei mir macht"}, {"id": 820, "start": 8237.92, "end": 8241.72, "text": "er also ich weiß es immer doof verantwortung nach dem motto ja ich habe keine probleme"}, {"id": 821, "start": 8241.72, "end": 8248.4, "text": "aber ich habe glaube ich noch nicht ein video nicht runterladen können mit youtube dl einfach"}, {"id": 822, "start": 8248.4, "end": 8253.44, "text": "mal einfach mal updaten die das aber so wenn du eine alte version hast backt das öfters"}, {"id": 823, "start": 8253.44, "end": 8268.36, "text": "rum aber das ist ein programm was erstaunlich wenig probleme macht hast du auf rocket beans"}, {"id": 824, "start": 8268.36, "end": 8272.38, "text": "gesehen die machen eine sendung wo sie programmieren für einschneid das habe ich nicht gesehen"}, {"id": 825, "start": 8272.38, "end": 8296.16, "text": "zeigt mal wo ist das wo ist das das da wo ist der editor wo ist der ich muss ich muss"}, {"id": 826, "start": 8296.16, "end": 8318.72, "text": "den editor sehen hier wie es coach okay oh big bra gut jeder fängt mal so an wahnsinn"}, {"id": 827, "start": 8318.72, "end": 8333.44, "text": "das kriegt man aber auch nach dem ersten tutorial gebacken das war es gibt es da noch mehr"}, {"id": 828, "start": 8333.44, "end": 8360.84, "text": "seine playlist zu"}, {"id": 829, "start": 8360.84, "end": 8373.96, "text": "so seit über 14 tagen keine ah doch es war zwei tagen okay was machen sie sonst noch"}, {"id": 830, "start": 8373.96, "end": 8385.96, "text": "so programmieren jetzt werden bisschen javascript funktion gemacht okay was ich ja was ich ja"}, {"id": 831, "start": 8385.96, "end": 8393.88, "text": "schon wieder bisschen grinch grinch ich finde ist man sollte den leuten gar nicht beibringen"}, {"id": 832, "start": 8393.88, "end": 8402.76, "text": "deutsche variable namen zu verwenden zu verwenden man sollte gleich sagen nenn den kram ordentlich"}, {"id": 833, "start": 8402.76, "end": 8414.36, "text": "und die korrekte variante in javascript wäre an der stelle sogar kebab case also zweite"}, {"id": 834, "start": 8414.36, "end": 8425.36, "text": "minus zahl ja und das heißt wirklich kebab case wobei bei variable namen bin ich mir"}, {"id": 835, "start": 8425.36, "end": 8438.08, "text": "gar nicht sicher variablen variablen in javascript auch kebab kein ach keine ahnung meine variable"}, {"id": 836, "start": 8438.08, "end": 8449.44, "text": "namen sind eh viel besser so was wie temp oder i oder blub ich meine bindestrich habe"}, {"id": 837, "start": 8449.44, "end": 8454.96, "text": "ich anders gesagt ich meine bindestrich also ihr kennt meine variable namen die sind eindeutig"}, {"id": 838, "start": 8454.96, "end": 8471.48, "text": "superior die sind excellent die machen die machen kein kalt die rechnen sachen zusammen"}, {"id": 839, "start": 8471.48, "end": 8476.2, "text": "aber in dem tempo weitermachen wollen kommt das dauert ganz schön lang bis da was ordentliches"}, {"id": 840, "start": 8476.2, "end": 8492.2, "text": "rauskommt am ende ich bin eine zeichenkette massive let us aktiviert gleich true das ist"}, {"id": 841, "start": 8492.2, "end": 8514.76, "text": "false was jetzt bin ich mal gespannt jetzt bin ich mal gespannt ob es den leuten gleich"}, {"id": 842, "start": 8514.76, "end": 8524.68, "text": "ordentlich zeigen jetzt bin ich mal gespannt ob es den leuten gleich ordentlich zeigen"}, {"id": 843, "start": 8524.68, "end": 8530.4, "text": "oder ob es oder wie sie es if schreiben falls sie überhaupt ein if machen weil die meisten"}, {"id": 844, "start": 8530.4, "end": 8538.56, "text": "noobs die meisten noobs schreiben if ist aktiviert gleich gleich true das ist auch im kopf"}, {"id": 845, "start": 8538.56, "end": 8545.76, "text": "erstmal irgendwie das logische das kann man schon zeigen dass man das so schreiben kann"}, {"id": 846, "start": 8545.76, "end": 8550.16, "text": "aber danach sollte man den auch gleich zeigen dass man das gleich gleich true einfach weglässt"}, {"id": 847, "start": 8550.16, "end": 8556.48, "text": "weil es kommt das gleiche raus warum ist es denn kein konst ja man kann es ja auch gleich"}, {"id": 848, "start": 8556.48, "end": 8577.92, "text": "übertreiben wann wann kommt das if es gibt es in den overflow ne oder ach ja was gibt"}, {"id": 849, "start": 8577.92, "end": 8607.88, "text": "okay was jetzt bin ich mal gespannt was da rauskommt if zweite gleich gleich"}, {"id": 850, "start": 8607.88, "end": 8628.44, "text": "null meine augen meine augen warum denn in notepad es ist gar kein notepad ist das notepad plus"}, {"id": 851, "start": 8628.44, "end": 8644.96, "text": "plus den notepad 2 mod ist das sogar nicht dass das existiert oh jetzt wird erstmal"}, {"id": 852, "start": 8644.96, "end": 8657.44, "text": "noch js installiert ah die verbindung ist abgebrochen ok deutschland deutschland und"}, {"id": 853, "start": 8657.44, "end": 8665.76, "text": "internet mark zu notepad plus plus nicht doch das ist ok das kann man verwenden wenn man"}, {"id": 854, "start": 8665.76, "end": 8676.4, "text": "was braucht was wirklich schnell startet und man nicht auf wie es kaut warten kann ja aber"}, {"id": 855, "start": 8676.4, "end": 8680.48, "text": "ich finde es gut dass sie sowas machen die haben eine gewisse reichweite ich finde es"}, {"id": 856, "start": 8680.48, "end": 8687.0, "text": "immer schön wenn mehr leute sich für das thema interessieren unter dem schritt kann"}, {"id": 857, "start": 8687.0, "end": 8690.92, "text": "es ja nur mehr nur mir zugute kommen dann schlagen vielleicht ein paar mehr leute bei"}, {"id": 858, "start": 8690.92, "end": 8696.52, "text": "mir im stream auf und werden teil des was aber sehr unwahrscheinlich ist dass einer"}, {"id": 859, "start": 8696.52, "end": 8702.84, "text": "von dem rocket beans video bei mir jetzt auf twitch aufschlägt außerdem machen wir gar"}, {"id": 860, "start": 8702.84, "end": 8708.84, "text": "kein programmierzeug was magst du notepad plus plus nicht gar nichts also die habe ich"}, {"id": 861, "start": 8708.84, "end": 8727.0, "text": "gerade schon mal antworten ist kann man verwenden hast du die clipboard history an nein habe"}, {"id": 862, "start": 8727.0, "end": 8749.12, "text": "ich nicht an oder doch mehr gibt es nicht ich habe die clipboard history an"}, {"id": 863, "start": 8757.0, "end": 8771.0, "text": "hörst du spezielle musik beim programmieren ja mache ich es kommt ein bisschen drauf an"}, {"id": 864, "start": 8771.0, "end": 8783.52, "text": "also ich habe da so zwei zwei betriebsmodis nennen wir es mal so ich habe einmal die sache"}, {"id": 865, "start": 8783.52, "end": 8797.08, "text": "wo ich mich sehr auf einzelne probleme konzentrieren muss die kompliziert sind dann mache ich meistens"}, {"id": 866, "start": 8797.08, "end": 8813.8, "text": "entweder sowas hier an irgendwie sowas da collection mix 2019 oder sowas sowas hier"}, {"id": 867, "start": 8813.8, "end": 8821.4, "text": "das finde ich eigentlich ganz entspannt sowas manchmal mache ich auch irgendwelche klassik"}, {"id": 868, "start": 8821.4, "end": 8827.68, "text": "an das ist aber wenn ich mich auf einzelne sachen konzentrieren muss und und die kompliziert"}, {"id": 869, "start": 8827.68, "end": 8832.52, "text": "sind dann mache ich meistens so an und wenn ich eher so im generellen architektur mode"}, {"id": 870, "start": 8832.52, "end": 8840.16, "text": "bin wo ich mir wo ich mir so gedanken mache was ich so was braucht man da vielleicht für"}, {"id": 871, "start": 8840.16, "end": 8850.16, "text": "klassen welche technik nimmt man da da habe ich entweder gar nichts an oder zeugs was"}, {"id": 872, "start": 8850.16, "end": 8858.96, "text": "ich sonst auch höre lautsprecher oder immer kopfhörer eigentlich immer kopfhörer deswegen"}, {"id": 873, "start": 8858.96, "end": 8862.68, "text": "das ist auch der der moment wo ich da die die super bequemen kopfhörer anziehe die"}, {"id": 874, "start": 8862.68, "end": 8871.2, "text": "ich euch letztens mal gezeigt habe und ich dachte schon max hört heavy metal beim programmieren"}, {"id": 875, "start": 8871.2, "end": 8875.36, "text": "da bei so normalen architektursachen oder wo ich einfach nur ein bisschen nachdenke"}, {"id": 876, "start": 8875.36, "end": 8880.0, "text": "und gucke wie man es machen könnte da läuft das normale zeug was ich sonst so höre also"}, {"id": 877, "start": 8880.0, "end": 8894.24, "text": "das kann dann alles mögliche sein das kann dann das kann dann bis zu bis zu dem hier"}, {"id": 878, "start": 8894.24, "end": 8910.84, "text": "gehen es kann dann bis zu dem hier gehen any bangers aber das ist nicht die richtige"}, {"id": 879, "start": 8910.84, "end": 8930.04, "text": "programmieren musik das übelst geil dass man einer der besten dass das ist das"}, {"id": 880, "start": 8930.04, "end": 8950.36, "text": "richtig um sql zu programmieren leute das ist das beste für cobalt mit dem tag programmiert"}, {"id": 881, "start": 8950.36, "end": 8964.04, "text": "vor in feil da das kannst du nicht im tag programmieren ja für sql ist das sicherlich"}, {"id": 882, "start": 8964.04, "end": 8974.32, "text": "auch sehr nice ich mein für dba ist für datenbank admins der beste titel schlechthin oder ich"}, {"id": 883, "start": 8974.32, "end": 8986.24, "text": "hoffe das nimmt kein datenbank admins ernst hier alles vorbei flash komplett dd def null"}, {"id": 884, "start": 8986.24, "end": 8999.64, "text": "str drop table genau alles weg ich fand für so esoterische sprache wie brainfuck wäre"}, {"id": 885, "start": 8999.64, "end": 9007.64, "text": "es vielleicht auch nicht schlecht habe ich schon mal gesagt dass dass der dass die musik"}, {"id": 886, "start": 9007.64, "end": 9013.52, "text": "echt gut ist es ist nicht jedermanns sache aber wenn man auf so vikinger zeug steht ist"}, {"id": 887, "start": 9013.52, "end": 9022.24, "text": "das einer der besten songs überhaupt all die meistens stehen ja nicht auf vikinger sachen"}, {"id": 888, "start": 9022.24, "end": 9030.12, "text": "und solche dinger die meisten hören sich lieber keine ahnung aporet an oder so oder"}, {"id": 889, "start": 9030.12, "end": 9053.12, "text": "was auch immer da gerade angesagt ist der refreuer ist halt so nice die würd ich mir"}, {"id": 890, "start": 9053.12, "end": 9059.4, "text": "gerne nochmal mal das"}, {"id": 891, "start": 9059.4, "end": 9080.24, "text": "Ryu"}, {"id": 892, "start": 9080.24, "end": 9082.24, "text": "live gesehen enttäuschen"}, {"id": 893, "start": 9082.24, "end": 9084.24, "text": "lass mich mal raten"}, {"id": 894, "start": 9084.24, "end": 9086.24, "text": "ich rate mal was dich enttäuscht hat"}, {"id": 895, "start": 9086.24, "end": 9088.24, "text": "du kannst mir sagen ob das stimmt"}, {"id": 896, "start": 9088.24, "end": 9090.24, "text": "ich vermute mal, dass man"}, {"id": 897, "start": 9090.24, "end": 9092.24, "text": "hier verstehst du noch halbwegs was"}, {"id": 898, "start": 9092.24, "end": 9094.24, "text": "ich denke mal"}, {"id": 899, "start": 9094.24, "end": 9096.24, "text": "dass man live"}, {"id": 900, "start": 9096.24, "end": 9098.24, "text": "vocal mäßig"}, {"id": 901, "start": 9098.24, "end": 9100.24, "text": "gesang mäßig"}, {"id": 902, "start": 9100.24, "end": 9102.24, "text": "nichts checkt"}, {"id": 903, "start": 9102.24, "end": 9104.24, "text": "und es auch nicht harmonisch dazu passt"}, {"id": 904, "start": 9104.24, "end": 9106.24, "text": "ich weiß nicht ob da"}, {"id": 905, "start": 9106.24, "end": 9108.24, "text": "gesang gut hinkommt live"}, {"id": 906, "start": 9108.24, "end": 9110.24, "text": "das könnte ich mir vorstellen dass es ein bisschen"}, {"id": 907, "start": 9110.24, "end": 9112.24, "text": "problematisch ist"}, {"id": 908, "start": 9112.24, "end": 9114.24, "text": "ansonsten"}, {"id": 909, "start": 9114.24, "end": 9116.24, "text": "was hat dir denn nicht gefallen"}, {"id": 910, "start": 9116.24, "end": 9118.24, "text": "wacken fällt aus, ja stimmt"}, {"id": 911, "start": 9120.24, "end": 9122.24, "text": "die gamescom fällt auch aus"}, {"id": 912, "start": 9124.24, "end": 9126.24, "text": "bei dem genre kommt es auf"}, {"id": 913, "start": 9126.24, "end": 9128.24, "text": "gesang an ja"}, {"id": 914, "start": 9128.24, "end": 9146.24, "text": "so blöds klingt ja"}, {"id": 915, "start": 9146.24, "end": 9148.24, "text": "was hältst du von alestorm"}, {"id": 916, "start": 9148.24, "end": 9150.24, "text": "oder sind die pirates"}, {"id": 917, "start": 9150.24, "end": 9152.24, "text": "ja die haben auch ein paar coole sachen"}, {"id": 918, "start": 9152.24, "end": 9154.24, "text": "aber da habe ich"}, {"id": 919, "start": 9154.24, "end": 9156.24, "text": "nichts neueres"}, {"id": 920, "start": 9156.24, "end": 9158.24, "text": "gehört bisher"}, {"id": 921, "start": 9158.24, "end": 9160.24, "text": "von denen"}, {"id": 922, "start": 9160.24, "end": 9162.24, "text": "also was die in den letzten jahren gemacht haben keine ahnung"}, {"id": 923, "start": 9162.24, "end": 9164.24, "text": "weiß nicht"}, {"id": 924, "start": 9170.24, "end": 9172.24, "text": "gamescom findet digital statt"}, {"id": 925, "start": 9172.24, "end": 9174.24, "text": "da bin ich ja mal gespannt wenn wir in deutschland"}, {"id": 926, "start": 9174.24, "end": 9176.24, "text": "eine messe rein digital ausrichten wollen"}, {"id": 927, "start": 9180.24, "end": 9182.24, "text": "da habe ich ja so meine bedenken"}, {"id": 928, "start": 9182.24, "end": 9184.24, "text": "dass das"}, {"id": 929, "start": 9184.24, "end": 9186.24, "text": "gut funktioniert"}, {"id": 930, "start": 9186.24, "end": 9188.24, "text": "wir sind ja was digital angeht"}, {"id": 931, "start": 9188.24, "end": 9190.24, "text": "vorne mit dabei immer"}, {"id": 932, "start": 9192.24, "end": 9194.24, "text": "von unten betrachtet"}, {"id": 933, "start": 9196.24, "end": 9198.24, "text": "das erste was passieren wird ist wenn die gamescom"}, {"id": 934, "start": 9198.24, "end": 9200.24, "text": "der gamescom stream online geht"}, {"id": 935, "start": 9200.24, "end": 9202.24, "text": "erstmal monka smoke geht erstmal nicht mehr"}, {"id": 936, "start": 9202.24, "end": 9204.24, "text": "genau erstmal"}, {"id": 937, "start": 9204.24, "end": 9206.24, "text": "weg"}, {"id": 938, "start": 9206.24, "end": 9208.24, "text": "so"}, {"id": 939, "start": 9214.24, "end": 9216.24, "text": "das haben wir jetzt ausführlich beantwortet"}, {"id": 940, "start": 9216.24, "end": 9218.24, "text": "kennst du dich mit kabelnetzen aus nein"}, {"id": 941, "start": 9218.24, "end": 9220.24, "text": "keine ahnung"}, {"id": 942, "start": 9220.24, "end": 9222.24, "text": "merkel wave"}, {"id": 943, "start": 9222.24, "end": 9224.24, "text": "zum teufel ist merkel wave"}, {"id": 944, "start": 9224.24, "end": 9238.24, "text": "nee"}, {"id": 945, "start": 9238.24, "end": 9240.24, "text": "wat"}, {"id": 946, "start": 9240.24, "end": 9242.24, "text": "das ist irgendein trollversuch"}, {"id": 947, "start": 9242.24, "end": 9254.24, "text": "den ich nicht checke"}, {"id": 948, "start": 9254.24, "end": 9256.24, "text": "alles auf masterforce"}, {"id": 949, "start": 9256.24, "end": 9272.24, "text": "ne das ist nicht was ich unter gitmagic verstehen würde"}, {"id": 950, "start": 9272.24, "end": 9274.24, "text": "oh jetzt ist hier big brain time"}, {"id": 951, "start": 9274.24, "end": 9276.24, "text": "vom flow 690 angesagt"}, {"id": 952, "start": 9280.24, "end": 9282.24, "text": "warum steht da so viel kek w im chat"}, {"id": 953, "start": 9282.24, "end": 9296.24, "text": "wobei da nur einmal kek w vorkommt"}, {"id": 954, "start": 9296.24, "end": 9298.24, "text": "was hältst du vor microsoft surface"}, {"id": 955, "start": 9306.24, "end": 9308.24, "text": "finde ich gut"}, {"id": 956, "start": 9308.24, "end": 9310.24, "text": "finde ich gut"}, {"id": 957, "start": 9310.24, "end": 9312.24, "text": "wir haben auf der arbeit"}, {"id": 958, "start": 9312.24, "end": 9314.24, "text": "ein paar surface"}, {"id": 959, "start": 9314.24, "end": 9316.24, "text": "wie heißen die books tablets"}, {"id": 960, "start": 9316.24, "end": 9318.24, "text": "und auch diese"}, {"id": 961, "start": 9318.24, "end": 9320.24, "text": "surface bildschirme"}, {"id": 962, "start": 9320.24, "end": 9322.24, "text": "die sind wirklich nice"}, {"id": 963, "start": 9322.24, "end": 9324.24, "text": "sag nichts böses dann sind wir sauer"}, {"id": 964, "start": 9326.24, "end": 9328.24, "text": "ne finde ich gut"}, {"id": 965, "start": 9334.24, "end": 9336.24, "text": "dein professor nennt seine getter setzer"}, {"id": 966, "start": 9336.24, "end": 9338.24, "text": "und geber"}, {"id": 967, "start": 9338.24, "end": 9340.24, "text": "exquisite"}, {"id": 968, "start": 9340.24, "end": 9342.24, "text": "der mag alles auf deutsch"}, {"id": 969, "start": 9342.24, "end": 9344.24, "text": "setzer und geber"}, {"id": 970, "start": 9344.24, "end": 9346.24, "text": "warum geber und nicht holer"}, {"id": 971, "start": 9346.24, "end": 9348.24, "text": "aber das ist"}, {"id": 972, "start": 9348.24, "end": 9350.24, "text": "ja mein wenn er da drauf steht"}, {"id": 973, "start": 9358.24, "end": 9360.24, "text": "habe neulich in production code"}, {"id": 974, "start": 9360.24, "end": 9362.24, "text": "tatsächlich die variable temp"}, {"id": 975, "start": 9362.24, "end": 9364.24, "text": "und danach die variable temp temp verwendet"}, {"id": 976, "start": 9364.24, "end": 9366.24, "text": "ich mach das laufend"}, {"id": 977, "start": 9366.24, "end": 9368.24, "text": "auch wenn es nicht schön aussieht"}, {"id": 978, "start": 9368.24, "end": 9370.24, "text": "manchmal wenn du in bestehende"}, {"id": 979, "start": 9370.24, "end": 9372.24, "text": "sachen was rein quetschen musst"}, {"id": 980, "start": 9372.24, "end": 9374.24, "text": "warum nicht"}, {"id": 981, "start": 9374.24, "end": 9376.24, "text": "also temp temp"}, {"id": 982, "start": 9376.24, "end": 9378.24, "text": "kommt selten vor"}, {"id": 983, "start": 9378.24, "end": 9380.24, "text": "aber bei mir heißt es"}, {"id": 984, "start": 9380.24, "end": 9382.24, "text": "meistens so die erste variable"}, {"id": 985, "start": 9382.24, "end": 9384.24, "text": "ist tmp und dann hab ich noch ne temp"}, {"id": 986, "start": 9384.24, "end": 9386.24, "text": "und eventuell noch ne blub"}, {"id": 987, "start": 9386.24, "end": 9388.24, "text": "ich glaube das sind so meine"}, {"id": 988, "start": 9388.24, "end": 9390.24, "text": "vielleicht noch i"}, {"id": 989, "start": 9390.24, "end": 9392.24, "text": "i ist auch noch dabei"}, {"id": 990, "start": 9392.24, "end": 9394.24, "text": "ich glaub diese kombi sind meine"}, {"id": 991, "start": 9394.24, "end": 9396.24, "text": "wa"}, {"id": 992, "start": 9396.24, "end": 9398.24, "text": "meistverwendeten"}, {"id": 993, "start": 9398.24, "end": 9400.24, "text": "variable namen"}, {"id": 994, "start": 9400.24, "end": 9402.24, "text": "tmp temp blub und i"}, {"id": 995, "start": 9402.24, "end": 9404.24, "text": "ne e verwende ich nicht"}, {"id": 996, "start": 9404.24, "end": 9406.24, "text": "nach i kommt immer j"}, {"id": 997, "start": 9408.24, "end": 9410.24, "text": "ah"}, {"id": 998, "start": 9410.24, "end": 9412.24, "text": "wir verstehen uns"}, {"id": 999, "start": 9414.24, "end": 9416.24, "text": "ja klar"}, {"id": 1000, "start": 9416.24, "end": 9418.24, "text": "ich hab selten so"}, {"id": 1001, "start": 9418.24, "end": 9420.24, "text": "nested schleifen dass ich 3"}, {"id": 1002, "start": 9420.24, "end": 9422.24, "text": "variablen für brauche"}, {"id": 1003, "start": 9422.24, "end": 9424.24, "text": "das sind so meine"}, {"id": 1004, "start": 9424.24, "end": 9426.24, "text": "meist benutzten variablen"}, {"id": 1005, "start": 9426.24, "end": 9428.24, "text": "und"}, {"id": 1006, "start": 9428.24, "end": 9430.24, "text": "und mittlerweile ist das schlimme meine"}, {"id": 1007, "start": 9430.24, "end": 9432.24, "text": "teststrings ist oftmals der da"}, {"id": 1008, "start": 9432.24, "end": 9434.24, "text": "ist kein witz"}, {"id": 1009, "start": 9434.24, "end": 9436.24, "text": "wenn ihr es bei uns sehen könntet"}, {"id": 1010, "start": 9436.24, "end": 9438.24, "text": "es gibt ein paar scripts"}, {"id": 1011, "start": 9438.24, "end": 9440.24, "text": "und ein paar sachen wo als default"}, {"id": 1012, "start": 9440.24, "end": 9442.24, "text": "text keqw drin steht"}, {"id": 1013, "start": 9442.24, "end": 9444.24, "text": "keqw sorry"}, {"id": 1014, "start": 9444.24, "end": 9446.24, "text": "keq"}, {"id": 1015, "start": 9446.24, "end": 9452.24, "text": "u"}, {"id": 1016, "start": 9452.24, "end": 9454.24, "text": "u"}, {"id": 1017, "start": 9454.24, "end": 9456.24, "text": "u"}, {"id": 1018, "start": 9456.24, "end": 9458.24, "text": "u"}, {"id": 1019, "start": 9458.24, "end": 9460.24, "text": "u"}, {"id": 1020, "start": 9460.24, "end": 9462.24, "text": "u"}, {"id": 1021, "start": 9462.24, "end": 9464.24, "text": "u"}, {"id": 1022, "start": 9464.24, "end": 9466.24, "text": "u"}, {"id": 1023, "start": 9466.24, "end": 9468.24, "text": "u"}, {"id": 1024, "start": 9468.24, "end": 9470.24, "text": "u"}, {"id": 1025, "start": 9470.24, "end": 9472.24, "text": "u"}, {"id": 1026, "start": 9472.24, "end": 9474.24, "text": "u"}, {"id": 1027, "start": 9474.24, "end": 9476.24, "text": "u"}, {"id": 1028, "start": 9476.24, "end": 9478.24, "text": "u"}, {"id": 1029, "start": 9478.24, "end": 9480.24, "text": "u"}, {"id": 1030, "start": 9480.24, "end": 9482.24, "text": "u"}, {"id": 1031, "start": 9482.24, "end": 9484.24, "text": "u"}, {"id": 1032, "start": 9484.24, "end": 9486.24, "text": "u"}, {"id": 1033, "start": 9486.24, "end": 9488.24, "text": "u"}, {"id": 1034, "start": 9488.24, "end": 9490.24, "text": "u"}, {"id": 1035, "start": 9490.24, "end": 9492.24, "text": "u"}, {"id": 1036, "start": 9494.24, "end": 9496.24, "text": "u"}, {"id": 1037, "start": 9496.24, "end": 9498.24, "text": "u"}, {"id": 1038, "start": 9498.24, "end": 9500.24, "text": "u"}, {"id": 1039, "start": 9500.24, "end": 9502.24, "text": "u"}, {"id": 1040, "start": 9502.24, "end": 9504.24, "text": "u"}, {"id": 1041, "start": 9504.24, "end": 9506.24, "text": "u"}, {"id": 1042, "start": 9506.24, "end": 9508.24, "text": "u"}, {"id": 1043, "start": 9508.24, "end": 9510.24, "text": "u"}, {"id": 1044, "start": 9510.24, "end": 9512.24, "text": "u"}, {"id": 1045, "start": 9512.24, "end": 9514.24, "text": "u"}, {"id": 1046, "start": 9514.24, "end": 9516.24, "text": "u"}, {"id": 1047, "start": 9516.24, "end": 9518.24, "text": "u"}, {"id": 1048, "start": 9518.24, "end": 9520.24, "text": "u"}, {"id": 1049, "start": 9522.24, "end": 9524.24, "text": "u"}, {"id": 1050, "start": 9524.24, "end": 9526.24, "text": "u"}, {"id": 1051, "start": 9526.24, "end": 9528.24, "text": "u"}, {"id": 1052, "start": 9528.24, "end": 9530.24, "text": "u"}, {"id": 1053, "start": 9530.24, "end": 9532.24, "text": "u"}, {"id": 1054, "start": 9532.24, "end": 9534.24, "text": "u"}, {"id": 1055, "start": 9534.24, "end": 9536.24, "text": "u"}, {"id": 1056, "start": 9536.24, "end": 9538.24, "text": "u"}, {"id": 1057, "start": 9538.24, "end": 9540.24, "text": "u"}, {"id": 1058, "start": 9540.24, "end": 9542.24, "text": "u"}, {"id": 1059, "start": 9542.24, "end": 9544.24, "text": "u"}, {"id": 1060, "start": 9544.24, "end": 9546.24, "text": "u"}, {"id": 1061, "start": 9546.24, "end": 9548.24, "text": "u"}, {"id": 1062, "start": 9550.24, "end": 9552.24, "text": "u"}, {"id": 1063, "start": 9552.24, "end": 9554.24, "text": "u"}, {"id": 1064, "start": 9554.24, "end": 9556.24, "text": "u"}, {"id": 1065, "start": 9556.24, "end": 9558.24, "text": "u"}, {"id": 1066, "start": 9558.24, "end": 9560.24, "text": "u"}, {"id": 1067, "start": 9560.24, "end": 9562.24, "text": "u"}, {"id": 1068, "start": 9562.24, "end": 9564.24, "text": "u"}, {"id": 1069, "start": 9564.24, "end": 9568.24, "text": "u"}, {"id": 1070, "start": 9568.24, "end": 9570.24, "text": "u"}, {"id": 1071, "start": 9570.24, "end": 9572.24, "text": "u"}, {"id": 1072, "start": 9572.24, "end": 9574.24, "text": "u"}, {"id": 1073, "start": 9574.24, "end": 9576.24, "text": "u"}, {"id": 1074, "start": 9576.24, "end": 9578.24, "text": "u"}, {"id": 1075, "start": 9578.24, "end": 9580.24, "text": "u"}, {"id": 1076, "start": 9580.24, "end": 9582.24, "text": "u"}, {"id": 1077, "start": 9582.24, "end": 9584.24, "text": "u"}, {"id": 1078, "start": 9584.24, "end": 9586.24, "text": "u"}, {"id": 1079, "start": 9586.24, "end": 9588.24, "text": "u"}, {"id": 1080, "start": 9588.24, "end": 9590.24, "text": "u"}, {"id": 1081, "start": 9590.24, "end": 9592.24, "text": "u"}, {"id": 1082, "start": 9592.24, "end": 9594.24, "text": "u"}, {"id": 1083, "start": 9594.24, "end": 9596.24, "text": "u"}, {"id": 1084, "start": 9596.24, "end": 9598.24, "text": "u"}, {"id": 1085, "start": 9598.24, "end": 9600.24, "text": "u"}, {"id": 1086, "start": 9600.24, "end": 9602.24, "text": "u"}, {"id": 1087, "start": 9602.24, "end": 9604.24, "text": "u"}, {"id": 1088, "start": 9604.24, "end": 9606.24, "text": "u"}, {"id": 1089, "start": 9606.24, "end": 9608.24, "text": "u"}, {"id": 1090, "start": 9608.24, "end": 9610.24, "text": "u"}, {"id": 1091, "start": 9610.24, "end": 9612.24, "text": "u"}, {"id": 1092, "start": 9612.24, "end": 9620.24, "text": "u"}, {"id": 1093, "start": 9620.24, "end": 9622.24, "text": "u"}, {"id": 1094, "start": 9622.24, "end": 9624.24, "text": "u"}, {"id": 1095, "start": 9624.24, "end": 9626.24, "text": "u"}, {"id": 1096, "start": 9626.24, "end": 9628.24, "text": "u"}, {"id": 1097, "start": 9628.24, "end": 9630.24, "text": "u"}, {"id": 1098, "start": 9630.24, "end": 9632.24, "text": "u"}, {"id": 1099, "start": 9632.24, "end": 9634.24, "text": "u"}, {"id": 1100, "start": 9634.24, "end": 9636.24, "text": "u"}, {"id": 1101, "start": 9636.24, "end": 9638.24, "text": "u"}, {"id": 1102, "start": 9638.24, "end": 9640.24, "text": "u"}, {"id": 1103, "start": 9640.24, "end": 9642.24, "text": "u"}, {"id": 1104, "start": 9642.24, "end": 9644.24, "text": "u"}, {"id": 1105, "start": 9644.24, "end": 9646.24, "text": "u"}, {"id": 1106, "start": 9646.24, "end": 9648.24, "text": "u"}, {"id": 1107, "start": 9648.24, "end": 9650.24, "text": "u"}, {"id": 1108, "start": 9650.24, "end": 9652.24, "text": "u"}, {"id": 1109, "start": 9652.24, "end": 9654.24, "text": "u"}, {"id": 1110, "start": 9654.24, "end": 9656.24, "text": "u"}, {"id": 1111, "start": 9656.24, "end": 9658.24, "text": "u"}, {"id": 1112, "start": 9658.24, "end": 9660.24, "text": "u"}, {"id": 1113, "start": 9660.24, "end": 9662.24, "text": "u"}, {"id": 1114, "start": 9662.24, "end": 9664.24, "text": "u"}, {"id": 1115, "start": 9664.24, "end": 9666.24, "text": "u"}, {"id": 1116, "start": 9666.24, "end": 9674.24, "text": "u"}, {"id": 1117, "start": 9674.24, "end": 9676.24, "text": "u"}, {"id": 1118, "start": 9676.24, "end": 9678.24, "text": "u"}, {"id": 1119, "start": 9678.24, "end": 9680.24, "text": "u"}, {"id": 1120, "start": 9680.24, "end": 9682.24, "text": "u"}, {"id": 1121, "start": 9682.24, "end": 9684.24, "text": "u"}, {"id": 1122, "start": 9684.24, "end": 9686.24, "text": "u"}, {"id": 1123, "start": 9686.24, "end": 9688.24, "text": "u"}, {"id": 1124, "start": 9688.24, "end": 9690.24, "text": "u"}, {"id": 1125, "start": 9690.24, "end": 9692.24, "text": "u"}, {"id": 1126, "start": 9692.24, "end": 9694.24, "text": "u"}, {"id": 1127, "start": 9694.24, "end": 9696.24, "text": "u"}, {"id": 1128, "start": 9696.24, "end": 9698.24, "text": "u"}, {"id": 1129, "start": 9700.24, "end": 9702.24, "text": "u"}, {"id": 1130, "start": 9702.24, "end": 9704.24, "text": "u"}, {"id": 1131, "start": 9704.24, "end": 9706.24, "text": "u"}, {"id": 1132, "start": 9706.24, "end": 9708.24, "text": "u"}, {"id": 1133, "start": 9708.24, "end": 9710.24, "text": "u"}, {"id": 1134, "start": 9710.24, "end": 9712.24, "text": "u"}, {"id": 1135, "start": 9712.24, "end": 9714.24, "text": "u"}, {"id": 1136, "start": 9714.24, "end": 9716.24, "text": "u"}, {"id": 1137, "start": 9716.24, "end": 9718.24, "text": "u"}, {"id": 1138, "start": 9718.24, "end": 9720.24, "text": "u"}, {"id": 1139, "start": 9720.24, "end": 9722.24, "text": "u"}, {"id": 1140, "start": 9722.24, "end": 9724.24, "text": "u"}, {"id": 1141, "start": 9724.24, "end": 9726.24, "text": "u"}, {"id": 1142, "start": 9726.24, "end": 9728.24, "text": "u"}, {"id": 1143, "start": 9728.24, "end": 9730.24, "text": "u"}, {"id": 1144, "start": 9732.24, "end": 9734.24, "text": "u"}, {"id": 1145, "start": 9734.24, "end": 9736.24, "text": "u"}, {"id": 1146, "start": 9736.24, "end": 9738.24, "text": "u"}, {"id": 1147, "start": 9738.24, "end": 9740.24, "text": "u"}, {"id": 1148, "start": 9740.24, "end": 9742.24, "text": "u"}, {"id": 1149, "start": 9742.24, "end": 9744.24, "text": "u"}, {"id": 1150, "start": 9744.24, "end": 9746.24, "text": "u"}, {"id": 1151, "start": 9746.24, "end": 9748.24, "text": "u"}, {"id": 1152, "start": 9748.24, "end": 9750.24, "text": "u"}, {"id": 1153, "start": 9750.24, "end": 9752.24, "text": "u"}, {"id": 1154, "start": 9752.24, "end": 9754.24, "text": "u"}, {"id": 1155, "start": 9754.24, "end": 9756.24, "text": "u"}, {"id": 1156, "start": 9756.24, "end": 9758.24, "text": "u"}, {"id": 1157, "start": 9758.24, "end": 9760.24, "text": "u"}, {"id": 1158, "start": 9760.24, "end": 9762.24, "text": "u"}, {"id": 1159, "start": 9762.24, "end": 9764.24, "text": "u"}, {"id": 1160, "start": 9764.24, "end": 9766.24, "text": "u"}, {"id": 1161, "start": 9766.24, "end": 9768.24, "text": "u"}, {"id": 1162, "start": 9770.24, "end": 9772.24, "text": "u"}, {"id": 1163, "start": 9772.24, "end": 9774.24, "text": "u"}, {"id": 1164, "start": 9774.24, "end": 9776.24, "text": "u"}, {"id": 1165, "start": 9776.24, "end": 9778.24, "text": "u"}, {"id": 1166, "start": 9778.24, "end": 9780.24, "text": "u"}, {"id": 1167, "start": 9780.24, "end": 9782.24, "text": "u"}, {"id": 1168, "start": 9782.24, "end": 9784.24, "text": "u"}, {"id": 1169, "start": 9784.24, "end": 9786.24, "text": "u"}, {"id": 1170, "start": 9786.24, "end": 9788.24, "text": "u"}, {"id": 1171, "start": 9788.24, "end": 9790.24, "text": "u"}, {"id": 1172, "start": 9790.24, "end": 9792.24, "text": "u"}, {"id": 1173, "start": 9792.24, "end": 9794.24, "text": "u"}, {"id": 1174, "start": 9794.24, "end": 9796.24, "text": "u"}, {"id": 1175, "start": 9796.24, "end": 9798.24, "text": "u"}, {"id": 1176, "start": 9798.24, "end": 9800.24, "text": "u"}, {"id": 1177, "start": 9802.24, "end": 9804.24, "text": "u"}, {"id": 1178, "start": 9804.24, "end": 9806.24, "text": "u"}, {"id": 1179, "start": 9806.24, "end": 9808.24, "text": "u"}, {"id": 1180, "start": 9808.24, "end": 9810.24, "text": "u"}, {"id": 1181, "start": 9810.24, "end": 9812.24, "text": "u"}, {"id": 1182, "start": 9812.24, "end": 9814.24, "text": "u"}, {"id": 1183, "start": 9814.24, "end": 9816.24, "text": "u"}, {"id": 1184, "start": 9816.24, "end": 9818.24, "text": "u"}, {"id": 1185, "start": 9818.24, "end": 9820.24, "text": "u"}, {"id": 1186, "start": 9820.24, "end": 9822.24, "text": "u"}, {"id": 1187, "start": 9822.24, "end": 9824.24, "text": "u"}, {"id": 1188, "start": 9824.24, "end": 9826.24, "text": "u"}, {"id": 1189, "start": 9826.24, "end": 9828.24, "text": "u"}, {"id": 1190, "start": 9828.24, "end": 9830.24, "text": "u"}, {"id": 1191, "start": 9830.24, "end": 9832.24, "text": "u"}, {"id": 1192, "start": 9832.24, "end": 9840.24, "text": "u"}, {"id": 1193, "start": 9840.24, "end": 9842.24, "text": "u"}, {"id": 1194, "start": 9842.24, "end": 9844.24, "text": "u"}, {"id": 1195, "start": 9844.24, "end": 9846.24, "text": "u"}, {"id": 1196, "start": 9846.24, "end": 9848.24, "text": "u"}, {"id": 1197, "start": 9848.24, "end": 9850.24, "text": "u"}, {"id": 1198, "start": 9850.24, "end": 9852.24, "text": "u"}, {"id": 1199, "start": 9852.24, "end": 9854.24, "text": "u"}, {"id": 1200, "start": 9854.24, "end": 9856.24, "text": "u"}, {"id": 1201, "start": 9856.24, "end": 9858.24, "text": "u"}, {"id": 1202, "start": 9858.24, "end": 9860.24, "text": "u"}, {"id": 1203, "start": 9860.24, "end": 9862.24, "text": "u"}, {"id": 1204, "start": 9862.24, "end": 9864.24, "text": "u"}, {"id": 1205, "start": 9864.24, "end": 9866.24, "text": "u"}, {"id": 1206, "start": 9866.24, "end": 9868.24, "text": "u"}, {"id": 1207, "start": 9868.24, "end": 9870.24, "text": "u"}, {"id": 1208, "start": 9870.24, "end": 9872.24, "text": "u"}, {"id": 1209, "start": 9872.24, "end": 9874.24, "text": "u"}, {"id": 1210, "start": 9874.24, "end": 9876.24, "text": "u"}, {"id": 1211, "start": 9876.24, "end": 9878.24, "text": "u"}, {"id": 1212, "start": 9878.24, "end": 9880.24, "text": "u"}, {"id": 1213, "start": 9880.24, "end": 9882.24, "text": "u"}, {"id": 1214, "start": 9882.24, "end": 9884.24, "text": "u"}, {"id": 1215, "start": 9884.24, "end": 9886.24, "text": "u"}, {"id": 1216, "start": 9886.24, "end": 9894.24, "text": "u"}, {"id": 1217, "start": 9894.24, "end": 9896.24, "text": "u"}, {"id": 1218, "start": 9896.24, "end": 9898.24, "text": "u"}, {"id": 1219, "start": 9898.24, "end": 9900.24, "text": "u"}, {"id": 1220, "start": 9900.24, "end": 9902.24, "text": "u"}, {"id": 1221, "start": 9902.24, "end": 9904.24, "text": "u"}, {"id": 1222, "start": 9904.24, "end": 9906.24, "text": "u"}, {"id": 1223, "start": 9906.24, "end": 9908.24, "text": "u"}, {"id": 1224, "start": 9908.24, "end": 9910.24, "text": "u"}, {"id": 1225, "start": 9910.24, "end": 9912.24, "text": "u"}, {"id": 1226, "start": 9912.24, "end": 9914.24, "text": "u"}, {"id": 1227, "start": 9914.24, "end": 9916.24, "text": "u"}, {"id": 1228, "start": 9916.24, "end": 9918.24, "text": "u"}, {"id": 1229, "start": 9918.24, "end": 9920.24, "text": "u"}, {"id": 1230, "start": 9920.24, "end": 9922.24, "text": "u"}, {"id": 1231, "start": 9922.24, "end": 9924.24, "text": "u"}, {"id": 1232, "start": 9924.24, "end": 9926.24, "text": "u"}, {"id": 1233, "start": 9926.24, "end": 9928.24, "text": "u"}, {"id": 1234, "start": 9928.24, "end": 9930.24, "text": "u"}, {"id": 1235, "start": 9930.24, "end": 9932.24, "text": "u"}, {"id": 1236, "start": 9934.24, "end": 9936.24, "text": "u"}, {"id": 1237, "start": 9936.24, "end": 9938.24, "text": "u"}, {"id": 1238, "start": 9938.24, "end": 9940.24, "text": "u"}, {"id": 1239, "start": 9940.24, "end": 9942.24, "text": "u"}, {"id": 1240, "start": 9942.24, "end": 9944.24, "text": "u"}, {"id": 1241, "start": 9944.24, "end": 9946.24, "text": "u"}, {"id": 1242, "start": 9946.24, "end": 9948.24, "text": "u"}, {"id": 1243, "start": 9948.24, "end": 9950.24, "text": "u"}, {"id": 1244, "start": 9950.24, "end": 9952.24, "text": "u"}, {"id": 1245, "start": 9952.24, "end": 9954.24, "text": "u"}, {"id": 1246, "start": 9954.24, "end": 9956.24, "text": "u"}, {"id": 1247, "start": 9956.24, "end": 9958.24, "text": "u"}, {"id": 1248, "start": 9958.24, "end": 9960.24, "text": "u"}, {"id": 1249, "start": 9960.24, "end": 9962.24, "text": "u"}, {"id": 1250, "start": 9962.24, "end": 9964.24, "text": "u"}, {"id": 1251, "start": 9966.24, "end": 9968.24, "text": "u"}, {"id": 1252, "start": 9968.24, "end": 9970.24, "text": "u"}, {"id": 1253, "start": 9970.24, "end": 9972.24, "text": "u"}, {"id": 1254, "start": 9972.24, "end": 9974.24, "text": "u"}, {"id": 1255, "start": 9974.24, "end": 9976.24, "text": "u"}, {"id": 1256, "start": 9976.24, "end": 9978.24, "text": "u"}, {"id": 1257, "start": 9978.24, "end": 9980.24, "text": "u"}, {"id": 1258, "start": 9980.24, "end": 9982.24, "text": "u"}, {"id": 1259, "start": 9984.24, "end": 9986.24, "text": "u"}, {"id": 1260, "start": 9986.24, "end": 9988.24, "text": "u"}, {"id": 1261, "start": 9988.24, "end": 9990.24, "text": "u"}, {"id": 1262, "start": 9990.24, "end": 9992.24, "text": "u"}, {"id": 1263, "start": 9992.24, "end": 9994.24, "text": "u"}, {"id": 1264, "start": 9994.24, "end": 9996.24, "text": "u"}, {"id": 1265, "start": 9996.24, "end": 9998.24, "text": "u"}, {"id": 1266, "start": 9998.24, "end": 10000.24, "text": "u"}, {"id": 1267, "start": 10000.24, "end": 10002.24, "text": "u"}, {"id": 1268, "start": 10002.24, "end": 10004.24, "text": "u"}, {"id": 1269, "start": 10004.24, "end": 10006.24, "text": "u"}, {"id": 1270, "start": 10006.24, "end": 10008.24, "text": "u"}, {"id": 1271, "start": 10008.24, "end": 10010.24, "text": "u"}, {"id": 1272, "start": 10010.24, "end": 10012.24, "text": "u"}, {"id": 1273, "start": 10012.24, "end": 10014.24, "text": "u"}, {"id": 1274, "start": 10014.24, "end": 10016.24, "text": "u"}, {"id": 1275, "start": 10018.24, "end": 10020.24, "text": "u"}, {"id": 1276, "start": 10020.24, "end": 10022.24, "text": "u"}, {"id": 1277, "start": 10022.24, "end": 10024.24, "text": "u"}, {"id": 1278, "start": 10024.24, "end": 10026.24, "text": "u"}, {"id": 1279, "start": 10026.24, "end": 10028.24, "text": "u"}, {"id": 1280, "start": 10028.24, "end": 10030.24, "text": "u"}, {"id": 1281, "start": 10030.24, "end": 10032.24, "text": "u"}, {"id": 1282, "start": 10032.24, "end": 10034.24, "text": "u"}, {"id": 1283, "start": 10034.24, "end": 10036.24, "text": "u"}, {"id": 1284, "start": 10036.24, "end": 10038.24, "text": "u"}, {"id": 1285, "start": 10038.24, "end": 10040.24, "text": "u"}, {"id": 1286, "start": 10040.24, "end": 10042.24, "text": "u"}, {"id": 1287, "start": 10042.24, "end": 10044.24, "text": "u"}, {"id": 1288, "start": 10044.24, "end": 10046.24, "text": "u"}, {"id": 1289, "start": 10046.24, "end": 10048.24, "text": "u"}, {"id": 1290, "start": 10048.24, "end": 10050.24, "text": "u"}, {"id": 1291, "start": 10050.24, "end": 10052.24, "text": "u"}, {"id": 1292, "start": 10052.24, "end": 10058.24, "text": "u"}, {"id": 1293, "start": 10058.24, "end": 10060.24, "text": "u"}, {"id": 1294, "start": 10060.24, "end": 10062.24, "text": "u"}, {"id": 1295, "start": 10062.24, "end": 10064.24, "text": "u"}, {"id": 1296, "start": 10064.24, "end": 10066.24, "text": "u"}, {"id": 1297, "start": 10066.24, "end": 10068.24, "text": "u"}, {"id": 1298, "start": 10068.24, "end": 10070.24, "text": "u"}, {"id": 1299, "start": 10070.24, "end": 10072.24, "text": "u"}, {"id": 1300, "start": 10072.24, "end": 10074.24, "text": "u"}, {"id": 1301, "start": 10074.24, "end": 10076.24, "text": "u"}, {"id": 1302, "start": 10076.24, "end": 10078.24, "text": "u"}, {"id": 1303, "start": 10078.24, "end": 10080.24, "text": "u"}, {"id": 1304, "start": 10080.24, "end": 10082.24, "text": "u"}, {"id": 1305, "start": 10082.24, "end": 10084.24, "text": "u"}, {"id": 1306, "start": 10084.24, "end": 10086.24, "text": "u"}, {"id": 1307, "start": 10086.24, "end": 10088.24, "text": "u"}, {"id": 1308, "start": 10088.24, "end": 10090.24, "text": "u"}, {"id": 1309, "start": 10090.24, "end": 10092.24, "text": "u"}, {"id": 1310, "start": 10094.24, "end": 10096.24, "text": "u"}, {"id": 1311, "start": 10096.24, "end": 10098.24, "text": "u"}, {"id": 1312, "start": 10098.24, "end": 10100.24, "text": "u"}, {"id": 1313, "start": 10100.24, "end": 10102.24, "text": "u"}, {"id": 1314, "start": 10102.24, "end": 10104.24, "text": "u"}, {"id": 1315, "start": 10104.24, "end": 10106.24, "text": "u"}, {"id": 1316, "start": 10106.24, "end": 10108.24, "text": "u"}, {"id": 1317, "start": 10108.24, "end": 10110.24, "text": "u"}, {"id": 1318, "start": 10110.24, "end": 10112.24, "text": "u"}, {"id": 1319, "start": 10112.24, "end": 10114.24, "text": "u"}, {"id": 1320, "start": 10114.24, "end": 10116.24, "text": "u"}, {"id": 1321, "start": 10118.24, "end": 10120.24, "text": "u"}, {"id": 1322, "start": 10120.24, "end": 10122.24, "text": "u"}, {"id": 1323, "start": 10122.24, "end": 10124.24, "text": "u"}, {"id": 1324, "start": 10124.24, "end": 10126.24, "text": "u"}, {"id": 1325, "start": 10126.24, "end": 10128.24, "text": "u"}, {"id": 1326, "start": 10128.24, "end": 10130.24, "text": "u"}, {"id": 1327, "start": 10130.24, "end": 10132.24, "text": "u"}, {"id": 1328, "start": 10132.24, "end": 10134.24, "text": "u"}, {"id": 1329, "start": 10134.24, "end": 10136.24, "text": "u"}]}