{"text": "Das war's für heute.Bis zum nächsten Mal.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Microsoft, please. Mal gucken, ob uns Microsoft wieder enttäuscht, weil wirprobieren heute WinUI 3.0 aus. Das kam vorgestern raus, erst im Review, da warteich ja schon seit der Ankündigung drauf, weil es die erste gescheite Sache seit15 Jahren ist, die Microsoft für Desktop-Anwendungen rausgebracht hat oderrausbringen wird oder denkt, rauszubringen, was auch immer. Aber ich muss erst malmal Streaming-Recher noch anmachen, also den zweiten, wo ich dann Vorschau habeund alles. Deswegen seht ihr euch jetzt hier selbst im Chat. Ja, und zwar das hier,guckt mal, WinUI 3.0, Review, Bre-View heißt ja Bre-View. Wir sind ja hier bekanntdafür, dass wir besonders exzellent exquisit korrekt immer alles aufEnglisch aussprechen. So, Vorschau läuft. Vorschau läuft, wenn wir den ganzen Crap hierausmachen. Leute, ich muss mir gleich noch ein neues T-Shirt anziehen, ich kommegerade von draußen, ich war hier, stellt euch mal vor, stellt euch das mal vor, ichwar im Wald. Guckt euch das mal an. Das ist mal richtigMonkaS. Guckt euch das mal an.Ja, in der Sonne. Ja, Monarch, richtig, Monarch S. Das ist das beste E-Mode dafür. Alleeinmal Monarch S. Das habe ich doch gar nicht drinne. Monarch S, das brauchen wirnoch. Monarch S und zwar Transparent. Das haben wir nicht. Ah, Monarch S Transparent,exzellent. Gibt es das vielleicht auch in groß? Ah, meinetwegen, Safe Image. Monarch S, dasbrauchen wir noch, ganz, ganz wichtig.Monarch S, all das ist ein scheiß aufgelöstes GIF, äh, JIF, JPEG, JPG, was auchimmer. Google suche Dark Mode, keine Ahnung, das ist hier der Dark, der Dark Reader, aberes gab irgendwie auch die Möglichkeit, glaube ich, mittlerweile, Chrome Native irgendwieauf Dark Mode zu schalten. Zumindest, was wir uns heute angucken, ist das hier, gucktmal hier, exzellent. Poggers, Five Head. Ähm, Leute, hat jemand von euch mal versucht,ihr Bild, Bild 2020, Webcast, sich anzugucken. Ich bin dafür zu dumm, ich kriege das nichtgebacken. Wenn man sich das hier anguckt und sagt, hier Sessions, Session Catalog, da gibtes nämlich den Talk von einer halben Stunde zum neuen WinUI und, ähm, ah, das da? Oh,wo ist der Talk? Der war doch schon. Wo ist er? Warum soll ich mich registrieren? Versteheich nicht. Das, das kapier ich nicht. Nee, nee, nee, Adplog, glaube ich nicht. Nö.Der Talk war schon, ich bin da einfach zu small brain für. Daddy Khan zwei Monate,vier Monate? Nee, Moment. Monarch S. Vier Monate und zwei Monate in Folge. Ah, exzellent,exzellent. Kein echter Gamer. Ja, ist so. Aber im Prinzip ziemlich, ähm, so Leute, ähm,wir müssen jetzt jetzt, wow, wow, wow, wow, wow, hier, hier stimmt, äh, hier stimmt derDark Mode aber mal gar nicht an. What the fuck? Das sieht überhaupt, okay. Was auch immer.Oh, okay. Äh, also. Ah gut, warum nicht, machen wir da. Aber das Ding, das Ding kannman in Dark Mode stellen. Die Microsoft-Seite kann man, ich weiß, dass das geht. Ich habdie nämlich bei mir auf dem Desktop auch im Dark Mode. Man kann die Microsoft-Hilfe-Seiteirgendwie in Dark Mode stellen. Wo war das nochmal? Irgendwo ging, das ging, das ging,ich weiß, dass das ging. Ja, hier, theme. Dark, exzellent. So, und das probier mal aus,Leute. Ähm, ich muss ja aber kurz mal schnell ein neues T-Shirt anziehen, weil ich binnoch etwas, äh, Monarch-S. Gleich wieder am Start.So, wieder am Start. So Leute, und wenn wir hier fertig sind, so in zwei Stunden oderso, mal gucken, so 13 Uhr rum, oder vielleicht 13.3, mal gucken, wann es losgeht, ähm,dann, ähm, und uns mit danach ist, dann machen wir Warzone-Stream Only-Only-Wins. Heute wirdnur gewonnen. Hast du schon die neuen Features von C-Shop 9 angesehen? Wir haben uns einpaar Previews angeguckt, ja. Ähm, mir ist aber jetzt nix so richtig, eine Sache fandich richtig cool, aber ich komm grad nicht mehr drauf, was das war. Eins fand ich megapraktisch. Was war das denn noch mal? Ähm, was war das denn hier noch mal? Das da wares nicht. Das war es, glaub ich, auch nicht. Equality. Das war ganz nice, aber es gabdoch noch was anderes. Das war auch ganz cool. Parameter-Null-Checking. Ja, das war cool,aber das war klar, dass so was in der Richtung kommt. Lambda-Discords fand ich sehr praktisch,dass es jetzt endlich offiziell drin ist. Ähm, was war das denn? Irgendwas anderesfand ich ultra praktisch, aber ich hab vergessen was. Ja. Init-Only-Properties, ok, das istganz nett. Aber ist das schon Final? Oder sind das noch, ähm, wie heißt es, so RFC-mäßig?Oder ist das schon Final? Ahm, ähm, Records? Propositional? Hm. Wow! Wow, ok, ok, ok, ok,wow, ok. Das ist eigentlich ganz cool. Das ist dann eher so Richtung Go sieht das ausfast schon. Nee, nee, nee, nee, nee, nee. Go braucht ja auch eine Main-Function. Hier,das ist cool, das ist cool. Improved-Pattern-Matching ist cool. Ähm, das ist sehr, das ist sehrnice, dass man jetzt quasi das abkürzen kann und sich das New-Point sparen kann. Ähm,hier müssen wir uns echt mal im Detail angucken. Alter, Wald. So, ähm, also was brauchen wirdenn dafür, dass wir den Kram ausprobieren können? Das ist mal zur Erklärung was dasGanze ist. Ähm, ich verstehe gar nicht warum das nicht mehr Hype auslöst. Das Ding istseit 15 Jahren das erste UI, neue UI für Windows, was man verwenden kann richtig. Dasletzte UI was man sinnvoll verwenden kann war WPF. Danach kam WinRT, UWP, haste nichtgesehen, geschiss. Das konnte man nicht richtig verwenden. Das Problem, um das nochmal kurzzu recapen, ähm, was das Problem an UWP ist, äh, der neue Package Manager für Windows,den schreibe ich mir mal auf, den wollte ich mir auch nochmal angucken, genau. Stream-Ideehatten wir doch hier irgendwo so eine, so, also, ähm, äh, Windows Package Manager, äh,9.0, C Sharp 9.0. Genau, um nochmal kurz zu erklären was das Problem an der ganzen Geschichtewar, warum Windows UI so gesagt hat und warum, warum die meisten Windows-Software heute keinerichtige Windows-Software ist, sondern eher so eine Mischung aus entweder Electron, alsoin Browser oder Qt oder sonst was. Das liegt daran, das letzte, ich glaube 2006 hat MicrosoftUWP rausgebracht und danach kam nix mehr. Nach UWP kam WinRT und UWP und Crap. Und dasProblem an UWP war, ähm, dass du heute eigentlich immer noch nicht UWP richtig verwenden kannst.Also meistens, UWP und WinRT ist so ein zusammenhängendes Ding, also sprich, jedes Programmwas du machst hat, hat ne Sandbox drum herum. Was schonmal scheiße ist, ja. Es gibt Möglichkeiten,dass man das quasi sich rappt, da braucht man quasi, muss man den Prozess starten, derdann auf alles zugreifen kann und so, mega wirkt. Und das hauptsächlich Problem an UWP-Anwendungist die, die Verteilung von den Anwendungen. Also sprich, man hat die eine Möglichkeit,das hier über den Microsoft Store zu machen, aber das ist ja nur wirklich, was anderesfällt mir zum Microsoft Store nicht mehr ein. Also niemand möchte wirklich auf den MicrosoftStore angewiesen sein. Und das ist die eine Möglichkeit, UWP-Anwendungen zu verteilen.Die andere Möglichkeit ist, UWP-Anwendungen über den eigenen Installer zu verteilen.Das ist ja kein Ding, da sind ja die Windows Leute dran gewöhnt. Windows Leute mögenja Installer, Setup, Exe und sonst was. So, das Problem ist jetzt, du brauchst ein Codesigning-Zertifikatum UWP-Anwendungen beziehungsweise um die selbst verteilen zu können. Und niemand, der einfachmal so Anwendungen entwickelt und nicht gerade in irgendeiner größeren Firma arbeitet,die die Anwendung entwickelt, kauft sich ein Codesigning-Zertifikat. Das kostet 300 Euroim Jahr über den Daumen gepeilt und nur das dafür, dass ich dann Windows-Anwendungen machenkann. Es hat noch ein paar andere Probleme, aber voll für den Arsch. So, und was Microsoftmit WinUI 3 macht, ist endlich seit 15 Jahren. Ohne Scheiße. Die letzten 15 Jahre war Microsoftso. Mit WinUI 3 ist Microsoft hoffentlich wieder so. Die haben ihre GUI-Geschichte vonUWP genommen. Also das da ist zum Beispiel eine UWP-Anwendung. Ist jetzt ein scheißBeispiel, weil der Taschenrechner ist abartig hässlich. Wir können uns auch mal den Kalenderangucken. Das ist auch eine UWP-Anwendung, die sieht ein bisschen schöner aus. Alsodie haben ihre GUI-Geschichte genommen und haben gesagt, okay, wir erlauben jetzt auchganz normale Windows-Anwendungen mit dieser Oberfläche. So, und das ist im Endeffekt,was hinter WinUI 3.0 steckt. So, jetzt müssen wir nur noch gucken, wie man den Kram installiertkriegt. Getting started. Wahrscheinlich müssen wir jetzt erst das halbe Internet installieren,weil es Microsoft ist. Also was brauchen wir? To use WinUI 4 Desktop Project. Make surethat you have Windows Version 13 Pro... Haben wir bestimmt, oder? Wo sieht man das überhaupt,was für eine Windows-Version man hat? WinFair, CMD. War das da WinFair? Excellent, habenwir. Das haben wir schon mal. Oh, okay. Soll ich noch ein Wishl Studio... Sind die dasWahnsinns? Ich hab Wishl Studio 17 drauf. 17 können wir mal remove. 17 können wir malremove. 17, remove, remove. Piss dich alle. 17 können wir mal. Wobei... Ah, ich hab genugPlatz für einen Dritter, easy. Okay, ähm... Nee, Moment, was? Install Wishl Studio 16.7Brifue 1. See? Wishl Studio Brifue muss ich installieren, okay? Community. Alles klar.Das geht relativ schnell, nachdem sich Vodafone jetzt ja eingekriegt hat. Piss dich alle!Äh, wie ist Community? 1, 2, 3, 4, 5, 6. Excellent Passwort. Wishl Studio Installer...Ja. Nicht Community. So, also das, was wir installieren. Ähm, dann brauchen wir... Was?Man muss.NET 5, Brifue 4, 32-Bit und 64-Bit installieren, okay? Ah, yes, excellent. Machenwir, machen wir alles. Ähm,.NET Desktop Development, UWP Development, wir installieren mal den...Oh, 14 Gigabyte, was ist da los? So ein Verarsch, ey. Was für ein Workload müssen wir installieren?Okay,.NET Desktop Development müssen wir auf jeden Fall installieren. Ich glaub, UWPkönnen wir, können wir uns... Blend brauchen wir nicht. Entity Framework Tools brauchenwir auch nicht. Profiler, Just-In-Time-Debugger. Was brauchen da auf einmal so viel Speicherplatz?Eben war es, eben, eben war es doch noch angeblich 14, 14G. Hä? Habt, wo, wo ist das jetzt sovor einmal hin? Hä? Hä? What the fuck? Ist die Größenberechnung im Arsch oder so? Kanndas sein? Ah, Blend brauchen wir nicht. Install while downloading. Ah, install, gut, gehtja schnell. Max, bist du bereits geleakt? Ich bin schon 20.000 Mal geleakt. Ich binin der Suppe geleakt, ich bin im Fernseher geleakt, ich bin in der Verpackung geleakt,ich bin überall geleakt. Okay. PopOS hat mir nicht gefallen. Haben wir im Stream ausprobiert.So, also den müssen wir installieren. BrickView 1. Ich hau mir jetzt einfach mal die ganzenCrap drauf. Oh Leute, kann das sein, dass die, dass ihr nix seht? Kann das sein, dassihr nix seht? Nee, oder? Ihr seht was? Ja, meine Vorschau, meine Vorschau spackt geraderichtig rum. Die ist, meine Vorschau ist hier. Monarch S. Ich glaube ich weiß woran das liegt.Windows hat bestimmt mal wieder die Soundsettings umgestellt. Das macht Windows nämlich gerne.Ja, okay, geht. Nein, geht nicht. Okay, also anscheinend sind die Soundsettings doch richtig.Woher kommt das? Ja, das ist neu. Okay. Während der Kram installiert. Close. Jetzt müssenwir das noch installieren. Wir haben wahrscheinlich jetzt erstmal 40 MB Microsoft Crap draufinstalliert. Install. Und nebenbei nicht vergessen mal die OBS-Stats aufzumachen, dass nixabkackt. Seit ich VoiceMeter verwende, forscht mir Windows nicht mehr rein, okay. Jetzt hatteich auch mal eine ganze Weile drauf, vielleicht soll ich das wieder installieren. VoiceMetors.Okay, das ist auch klar installiert. Das haben wir auch erzählt. Also, Visual Studio habenwir drauf..NET Core 5. Briefview haben wir. Oh, das heißt ja nicht mal Core. Sorry Leute..NET 5. Die wollen ja die Leute verwirren. Also, nur mal zur Erklärung..NET 5 ist eigentlich.NET Core 5, beziehungsweise eigentlich.NET Core 4. Sie haben es jetzt allerdings das Coregestrichen.NET 5 genannt. Und nicht zu verwechseln mit dem.NET Framework 4.8. Man könnte jadenken, dass.NET 5 der Nachfolger des.NET Framework 4.8 ist. Aber das stimmt nicht..NET5 ist eigentlich.NET Core 4 und hat mit.NET Framework 4.8 nichts zu tun. Exzellent MicrosoftLogik. Beste. Microsoft Benahmung, die haben es drauf. Was will er machen? Ich will WinUI3 ausprobieren. Okay, ich glaube, wir haben noch nicht alles installiert. So, bla, bla,bla, bla, bla, bla, bla. Download WinUI Briefview 1 Physics. Ah, das ist eine Visual StudioExtension. Ah, schon eine ganze Bewertung. Wir sehen ja Absolut Bleeding Edge heute dabei.Und was kann WinUI? WinUI ist quasi die GUI-Technologie, die unter den ganzen neuen Windows-Anwendungendrunter steckt, mit dem großen Unterschied, dass man keine UVP-Anwendung mehr machen muss,sondern so eine ganz normale Win32-Anwendung machen kann und dementsprechend darauf daskomplette System zugreifen kann. Also ich habe mir überlegt, was wir heute ausprobierenist. Wir gucken, ob wir Files auflisten können. Das ist da quasi Absolut Noob-Style. Danngucken wir, ob wir einen GIF abgespielt bekommen, weil ich habe die Hoffnung, dass ich damiteine besseres GIF-Wiedergabe hinbekomme als mit meiner UVP-Anwendung. Und als letztesprobieren wir dann auch Screenshots anzeigen. Also quasi Desktop-Capture. Desktop-Capturemit und dann in den Fenster rein. Mal gucken. So. Physics Installer. Exzellent. Und fürwelches Visual Studio installiert er das jetzt? Das wird in C-Sharp gebastelt. Visual StudioPreview. Exzellent. Perfekt. Ja in F-Sharp kannst du das auch machen, aber da sitzenwir morgen noch. Hast du morgen frei? Ja. Was installiert der dann da für 30 MilliardenSachen? Aber. 20 MB Download und erstmal eine halbe Stunde installieren. Ach nee, der installiertdie UVP-Geschichte. Was auch immer. Microsoft, mach einfach. Mach einfach. Vollkommen. Wieviel Festplattenplatz habe ich denn eigentlich noch? Ah, 53G. Das soll... Moment. Ich hatte80 davor. Hat das wirklich 30 GB gefressen gerade? Sehe ich das richtig? What the fuck?Was haben die mir denn da draufgehauen? Ist da schon die nächste Win-House-Version mitvorinstalliert? Genau, wie in Modern Warfare Update. Keg Triple U. Also wenn das Keg Wist, dann ist dann Keg Triple U ist dann... Oh, das war Payne's Champ-Witz, Alter. MonarchS. So, also jetzt haben wir das installiert. Ich glaube, das war es danach. Wenn der Kramdurch ist, so in 20 Stunden, dann... Was installiert der da eigentlich alles? Leute, guckt euchmal den Verbraucher an. Es geht immer weiter runter. Gleich ist die Festplatte voll. KegW. Das brauchen wir auch noch als Emote. Gibt's das transparent? Gibt's das transparent?Keg W. Nein, ich brauche Keg W als... Warum tauche ich unter Keg W auf? Okay. Okay,okay. Aha. Was ist denn das beste Keg W emote? Der da? Ne. Das ist übelste low quality emote.Das müssen wir anderweitig. Ich brauche ein ordentliches, hochaufgelöstes Keg W. Wiesieht es denn aus mit Pause-Champ? Gibt's das ordentlich hochaufgelöst? Ah, exellent,das brauchen wir. Pause-Champ. In der Zeit, wo Visual Studio hier am installen... Ach,du Scheiße, was macht... 50,7... Was installiert mir das alles? Monkeys. Ich glaube, ich musserst mal Festplattenplatz freigeben, klar. Pause. Was? Pause-Champ. Was? Oh, oh, eshat sich selbst aufgeräumt wieder. Ich habe gedacht, 80 Gigabyte reichen für eine Briefview,Leute. Ich weiß, das ist ziemlich blöd gewesen, aber ich habe gedacht, 80G sind genug. Habensich eigentlich Leute bei dem Geschlechts-Tweet über Telekom beschwerten? Ne, ne. Wir beobachtendich Windows-Installer. Der Windows-Installer wird genau beobachtet. Was macht das Dingdenn da? Das installiert mir glaube ich wirklich irgendwie... Vielleicht hätte ich das besserin einer VM machen sollen. Das installiert mir da wirklich 30 Millionen Sachen drauf.Ich hoffe, man kann das ordentlich deinstallieren wieder. 50. Wir haben jetzt ziemlich genau30 Gigabyte verbraucht schon. Stimmt, wir haben keinen Pause-Champ drin. Warum habenwir das nicht? Das haben wir gleich, Leute. Franger-Faces-Z. E-Modes. Haben wir gleich,haben wir gleich, Leute. Gleich ist Pause-Champ drinnen. Pause-Champ. Oh, edit. Oh, istdas drinne, Leute. Kann sein, dass ihr Refreshen müsst. Es kann auch sein, dass es eine Weiledauert bis es gesyncht ist, aber ich habe es in FFZ eingefügt. Also Leute, die FFZhaben und den Chat Refreshen sollten es jetzt eigentlich gleich sehen. Pause-Champ. Ichhätte jetzt nicht gedacht, dass der da... Wir gucken mal mit dem Prozess-Explorer, wasdas Ding da macht. Nehradorn-Stufe 1 für 10 Monate. Exzellent. Exzellent-Subscription.Na ja, so wirklich viel machen tut er nicht, ne? Na gut, während er installiert, habe ichmal eine andere Frage an euch, Chat. Das ist bestimmt so der typische Microsoft-Installer.Der macht jetzt so und gleich... Ich habe eine andere Frage an euch. Und zwar, meinMousepad ist übelst im Arsch. Also aktuell habe ich ja das da als Mousepad. Das Ding.Ne, das... Was haben die denn alles für Mousepads? Hiro Plus, Taito, Kanga. Kanga ist... Hier,das da habe ich aktuell. Und eine G403. So, ich bin jetzt gerade am Überlegen. Ah, Chat-Big-Brain-Empfehlungsehe ich hier gerade. Was ist mit der Handballen-Auflage? Dies ist auch nicht schlecht, oder? Naja, zumindest...Was will das denn? Zumindest habe ich mir jetzt überlegt, ob ich von diesem Rocket Hero undder G403, ob ich nicht umsteigen soll auf eine G Pro Wireless. Also quasi... Leute, was istda der Unterschied? Was ist da der Unterschied? Außer 10 Euro. Deutsches Mouse-Layout. Ichhabe echt keine Ahnung, was der Unterschied zwischen den zwei Dingern ist. Ah, die eineist nicht auf Lager. Und die andere schon. Ah, verstehe. Big-Brain. Okay, also ich überlege,ob ich mir das hier holen soll. Und ein... Wie heißt das andere? G903. Ne, ne. Äh, äh.Wie heißt das? Wie heißt das Auflademaus-Pad nochmal? EU-Version bei einer Maus? Die deutscheVersion ist breiter. Ne. Hä? Das ist eine Maus. Deutsches Maus-Layout. Ähm... Die Verpackung.Achso. Ah, gut. Okay, als... Okay, wie hieß dieses Wireless-Charging-Ding nochmal? Charging-Maus-Pad.Das da, genau. So, und ich habe mir überlegt, ob ich mir jetzt nicht die Kombi hier kaufe.G-Bro? Bro? Und, äh, ein G-Powerplay. Wie groß ist das? Das ist nice, so. Okay, hastdu das, Tribolon? Ähm... Wie groß ist denn das? 27x32. Das müsste ziemlich so groß seinwie das, was ich aktuell auch habe. Aktuell habe ich das hier. Das ist noch ein bisschenälter. Ähm, wie groß ist das? 35x25, ja. Ey, das ist ziemlich genauso groß wie meinaktuelles Maus-Pad, ne? 27x32. 35x5. Ich glaube, das sind einfach nur die Abmaße irgendwieanders. Wobei, das ist eher hoch als breit, kann das sein? Ist das eher hoch als breit?Auf der anderen Seite, man kann es ja drehen, wie man will. Man kann es ja drehen, wie manwill. Es spricht doch eigentlich überhaupt nichts dagegen, wenn ich das hoch kann drehe.Also sprich, wenn ich das hier am rechten Schreibtischrand nehme. Ich kann es ja drehen,wie ich lustig bin. Ich muss das ja nicht hochkant legen, ne? Also so wird es ja gegendie Richtung Monitor zeigen. Oh, wir sind fertig. Exzellent, wir haben es geschafft.Das G ist gedreht. Ja, das juckt mich ehrlich gesagt überhaupt nicht. Jurok ruft die Polizei.Da guckt einer, äh, Dings hier. Wie heißt er? Slap Like, wie heißt er? Davy, Davy 405?Der Bass, der Bass-Typ. Slap Like, der sagt auch immer I'm calling the police. Davy 504,genau, ja, so. Ok, wir sind fertig. Also wahrscheinlich hole ich mir die Kombi. Ich meine, ein bisschengrößeres Mousepad wäre schon nicht schlecht. Da könnte ich meine Sensitivity vielleichtnoch einen Ticken runterstellen. Aber die Kombi aus, ähm, Wireless und Wireless Chargingist irgendwie schon cool. Was nicht so cool ist, muss man auch ehrlich gesagt mal sagen,ich meine 240 Euro für ein Maus und ein Mauspad ist schon mal echt eine Hausnummer, ne? Mussman die oft aufladen? Ne, das Mauspad lädt ja auf. Deswegen ist es eigentlich wahrscheinlichganz praktisch. Oder aber vielleicht lohnt es sich auch mit einem normalen Mauspad undwenn man die nur einmal alle drei Monate aufladen muss oder so, dann hm. Na gut, also wir habenalles installiert, dann gucken wir uns das ganze doch jetzt mal an. Ja Kio-kun, keineAhnung ob sich das lohnt, das müssen wir erstmal gucken. Wofür gibst du denn sonstkein Geld aus? Ja gar nicht eigentlich. Die Logitech Mäuse sind viel zu schwer. Das anderewas ich mir überlegt hab, ist das hier. Ähm, aber die musste die importieren, das ist auchfür den Arsch. Äh, äh, wo gibts denn die Mäuse? Ach keine Ahnung. Die ist doch, dieG Pro ist doch relativ leicht, oder? Guck mal. Was wiegt denn die? 80 Gramm, so. Ne G403,was wiegt ne G403? Moment, ne 80 Gramm ist mit Verpackung, ne? 80 Gramm ist mit Verpackung.Da müssen wir mal bei Logitech gucken. Äh, wait, wait. Äh, also 87 Gramm und die, alterLogitech, wo kann man suchen bei euch? G Pro Wireless? Die da wahrscheinlich, ne? Wiegtwas? Nein, ich will nicht Subscribern. Höchstens, höchstens auf Twitch, aber nicht bei Logitech.Wiegt 80. Ähm, ist sogar noch ein bisschen leichter als meine G403. Wie viel wiegt dennne Finalmouse? Was, warte mal. Pro Settings. Was hat ein Scream? Was hat ein Scream vonne Maus? Der hat glaub ich ne Finalmouse. Das sind die, das hier. Finalmouse UltralightSunset. Mal gucken, was das Ding wiegt. Ähm, steht das da irgendwo vielleicht? So ein bisschenHardware-Informationen zu? Gibt's nicht. Das ist overrated. Hardware-Informationen brauchtman nicht. Äh, nein. Die wiegt bestimmt nicht 227 Gramm. Der, der bearded Bob. Aha. What?67 Gramm. Da hätten sie es auch 69 Gramm machen können, oder? Ich mein, wenn schon,wenn man mal die, die Möglichkeit hat, der hätte man das auch gleich richtig machenkönnen. Okay. Also, auf geht's. Ähm, jetzt müssen wir uns den Guide kurz angucken.Also. Getting started. Create WinUI 3 in Desktop App. Ähm, okay, es gibt anscheinendneue Vorlagen. Create New Project. WinUI. Win, Windows Runtime Component. UWP. Nein.Wir wollen eine Desktop Anwendung. WinUI in Desktop. Packaged. Nein, nein, nein, ich willnix. Ich will nix. Packaged. Plank App. Packaged. Okay. Language. C-Sharp. Ich will kein UWP.Class Library. Packaged. Hä? Nein, ich will das nicht über den Microsoft Store machen.Ich will ne stinknormale, publische Win32 WinUI Anwendung. Ich will nix sideloaden. Ich willnix über den Store. Wollt ihr mich veräppeln? Gibt's das nicht? Dann wird der Scheiß sofortinstalliert. Ich will das nicht über den Store machen. Das ist doch grad der Witzdaran. Okay. Probiert, probiert. Plank App. Nee, das ist, Plank App ist UWP. Wir wollenkeine UWP. Wir wollen, wir wollen ne Win32 Desktop. Okay, es gibt, das ist das Einzige.Na schauen wir mal. Okay, Create. Nein. Ich will kein UWP Shit. Geh weg. Was soll ichmit diesem verschissenen UWP kack? Das ist doch grad der Witz an dem, dass man den UWPScheiß nicht mehr braucht. Ja, MSIX ist aber kacke. Da braucht man wieder irgendwelcheCodesigning Certificates, dass man das ausführen kann. Okay, das probieren wir jetzt mal aus.Vielleicht ist das ja auch alles nur. What? Alter, Microsoft, wollt ihr mich verarschen?Ich will kein Store und ich will kein Site. Ich will ne beschissene, stinknormale Windows-Anwendung,die ich anklicken kann und starten. Ist das euer Ernst? Ihr wollt mir noch nicht wirklicherzählen, ihr habt den ganzen Aufwand gemacht, dafür, dass ich immer noch den gleichen Scheiß-Limitierung,okay, nicht alle, aber was, die ganze Zertifikatsgeschichte hab, die bei UWP sackt. Das wollt ihr mirnoch nicht wirklich erzählen, Microsoft, oder? Okay, wir starten das Ding mal. He didn'tknow. Ja, als wüsstest du's. Ja, starten, please. Was? Was? Ist das euer Ernst? Ichsoll wirklich den UWP-Scheiß noch machen, oder was? Nee, nee, also man muss den Developer-Modeanmachen, dafür, dass man sideloaden kann. Ich will nicht sideloaden, ich will eine ganznormale, stinknormale Win32-Anwendung machen. Okay, vielleicht kriegen wir den Kram selbstirgendwie gestartet. Wo ist, wo ist mein Main? Wo ist mein Main? Hier. So, wir gibaten dasjetzt. Wir gibaten das jetzt. Also, WSB, wir gibaten das jetzt. Create New Project, Console,so kann man die.NET Core-Version auswählen. Okay, create. Wir bauen das jetzt nach, ohneden ganzen UWP-Crap, das geht aber wahrscheinlich nicht. Okay, Moment, erst mal Dark Mode, DarkMode. Wie geht? Äh, Moment, ich hab schon lang kein Whistlestudio mehr auf gehabt, woging das jetzt hier? Dark, Theme. Wo ist das nochmal versteckt in Whistlestudio? Was, Direktam Anfang? General? Ah, Dark. Ah, yes, okay, viel besser. Okay, viel besser. Gucken wirmal, ob wir jetzt die Konsolen-Anwendung starten können. Excellent. Es ist ein.NET 5, okay,dann, wir bauen das jetzt einfach nach, so. So, jetzt muss man natürlich irgendwas verlinken,dass das funktioniert. Was muss man hier referenzieren? Dependencies, Packages, Microsoft WinUI. Gehtdas Panuget, oder wie kann man das jetzt hier ver... WinUI? Wie kann man den Kram jetzthier auswählen? Ja, excellent. Ja, den will ich haben. Microsoft WinUI heißt der Kram.Alter, Windows, Windows, please. Ich, ich werd garantiert keine UVP-Anwendung machen,die... Also, ich werd keine Win32-Anwendung machen, die, die UVP zeugt... Ah, Microsoft,das tut doch weh. Okay, ähm, wie kriegen wir denn Kram jetzt hin? Add? Add reference?Nee. Fuck, wie kriegt man hier überhaupt wieder normale... Reference? Ah, okay. Browse?Browse? Add? Nee, äh, build? Nate? Waaah! Include? Limp? Aha! Excellent! Da ist es.Okay, jetzt haben wir das ge-edit. Oh, geht mir das schon wieder auf den Sack. Ich habschon wieder keinen Bock mehr auf den, auf den Microsoft Crap, Alter. Ah, jetzt müssenwir Windows, Windows müssen wir include. Windows SDK müssen wir include. Wo, wo, wogibt's das her? Microsoft Windows SDK net. Wo kriegt man das her? Warum genau sollteman das statt Qt verwenden? Ja gar nicht, wenn das so scheiße ist, wie es hier aussieht.Okay, welche Version ist das? 6, 2, 3, preview? Okay, install, excellent. Kannst du nichteinfach das Startprojekt ändern? Ja, das ist eine gute Idee, das probieren wir mal aus,Kleil. Hat das jetzt installiert? Ah, excellent. Ha! Es startet schon mal, okay. So, und jetztmuss ich gucken, wie ich die Anwendung starte. Äh, wo, wo ist denn mein Main? Wo ist dennhier mein Main? Wo ist denn, wo ist denn hier Main, Main Window? App? Wo ist denn hiermein Main? Wo ist denn hier der Einstieg überhaupt? Wie geht denn das? Wie startet der, den Kramüberhaupt? Es muss doch irgendwo eine Main geben, was den Kram lädt, oder nicht? Hm.Das wird ja auf den UWP Package Plot Check gesetzt. Ich habe keine Ahnung, wie der Kramfunktioniert. Ich weiß nur, dass ich ein Codesigning Zertifikat dafür brauche für 300 Euro imJahr, und Microsoft kann mich mal am Arsch lecken. Ähm, wie wird denn der Kram gestartet hierüberhaupt jetzt? App, App Application? Das Main, wo ist der Kram? Äh, als Startprojekt,wurscht. Achso, hier oben meinste. Ähm, App 1. Das startet nix. Äh, RealRenax, doch,kannst du? Kannst du? Du musst, du musst irgendwie unten links bei der Windows 10 Installationmusst du irgendwie auf, auf, man muss irgendwas, irgendwas anklicken. Ähm, und, und ich, wirhaben es in der VM gemacht, kriegst du mal. Okay. Aber irgendwo muss doch ein Main, irgendwomuss doch mal ein Main sein. Irgendwo muss doch Main. Warum ist denn der Scheiß so kompliziert?Current Project, Main. Ah, this is the first line of other. Ah, Logical Equivalent toMain. Okay. Okay, denn Main, Main gibt's nicht. Okay, okay, okay. Window. Okay, okay. Kannman sagen, New, Window. Geht so was? Window. Und dann muss ich aber irgendwie erstmalApplication, Application Run machen. Application. Ich, ich probier einfach mal rum. Ich hab ApplicationRun. Nee, Start. Start so. Boah, fuck man, ich hab keinen Schimmer, wie das funktioniert.Wie startet man den Kram? Wie? Ich hab legit keine Ahnung, wie man den Kram startet. Ichvermute ja fast, das geht nur mit diesem ganzen UWP-Shit. Das ärgert mich. App. Ah,okay, man muss, man muss anscheinend. Ah, kann das sein, dass man sich ne eigene Klassevon dem App machen muss? Und dann was passiert? Setz mal nen Breakpoint. Das juckt den überhauptnicht. Äh, wenn man das, wenn man das als Startprojekt hat, mag er nicht. Der macht,der macht gar nix, Alter. Der, der macht gar nix. Der sollte eigentlich das hier starten,macht er aber nicht. Okay, also, sagen wir mal hier. Application. Application. Und dannne? Callback. Was muss der da callbacken? Was muss der da callbacken? Wie sowas? Okay,ich hab keine Ahnung, was da jetzt passiert. Kann Universal Studios mal formatieren, richtig?Class not registered. Okay, das ist okay, das leuchtet ein. Das muss man wahrscheinlichim Application starten machen. Ah, what? Das geht ohne den UWP-Shit nicht. Das geht mit,ich sag mal, wo ist denn da der Sinn von? Das versteh ich null, äh. Guckt mal, dasganze Zeug, angeblich, angeblich geht das ohne diesen ganzen UWP und Microsoft StoreShit. Aber dass es funktioniert, brauch ich UWP und Microsoft Store Shit. Wo ist dennda der Sinn dahinter? Okay, warte mal, wir machen nochmal ein neues Projekt. Renewal.Plank App, UWP. Nein, wollen wir schonmal nicht. Ich will kein UWP. Okay, C++, was gibt'sda? Plank App Desktop. Das ist genau der gleiche Mist. Was war? DLL, aber das brauch ich janicht. Okay, wind github, github, wind ui. Das, das macht mich schon wieder fertig, ja.Ja, ja. Ja, genau das.was? Ich will keine Packaged App. Für eine Packaged App brauch ich dieses, dieseshässliche, brauch ich ein hässliches Codesigning Zertifikat. Was macht Microsoft denn da wiederfür Dinger? Wo ist denn das Problem, Microsoft? Ihr bringt ein neues UI Framework raus, woich einfach eine App, wo ich einfach, ich sag schon eine App, wo ich einfach eine Anwendungerstellen kann, ohne irgendwas anderes. Issue 2179. Hatt ich das gerade? Nee. Ja, usemir nur wieder aus UWP. Not using, genau. Ja, genau, genau. Ja, schön, aber wir habenjetzt ja das Preview. Das ist, es ist Schwachsinn, es stimmt überhaupt nicht, was ihr da schreibt,Microsoft. Ich will kein UWP. Krieg, krieg Anfälle. Ich krieg echt Anfälle. Das istdas ganze UWP Shit. Wobei, ich sag mal, an sich, an sich ist es okay, dass es diese UWPim Windows Store Geschichten gibt. Für Sachen, für Leute, die die verwenden wollen, istdas okay. Aber ich will eine stinknormale Windows Anwendung, ohne 30 Milliarden Sachenvor allem, ohne 300 Euro Codesigning Zertifikat im Jahr. Also das Problem ist ja, nur malum euch das nochmal zu verdeutlichen, so. Man braucht, dass man diese Anwendung startenkann. Also ich zeige es euch mal, wenn man die starten will. Sagt ihr mir ja immer, aktiviereden Developer Mode. Das ist glaube ich, ja, das war eben Pokémon Musik. Oder ist dasjetzt immer noch? Kann sein. Das davor war glaube ich. So, der sagt hier, ich soll meineDeveloper, den Developer Account aktivieren, damit ich Apps sideloaden kann. So. Das gehtbei mir lokal auf der Kiste, weil da stellt sich ein selbstsigniertes Zertifikat aus.Das Problem ist jetzt, wenn ich das programmiere und ihr ladet euch das runter und wollt esbei euch starten, dann geht es nicht. Es geht nur, wenn ihr vorher mein Zertifikat bei euchin den Trust Store importiert, dass euer Windows dann der Anwendung vertraut. Das macht keinnormaler Anwender. Der denkt, Alter, was will der Typ von mir? Zumal du Adminrechte dafürbrauchst. Du brauchst ja sogar Adminrechte dafür. Also du hast aktuell die Auswahl, duholst dir den Code Signing Zertifikat für 300 Euro im Jahr, dass du Windows Anwendungmachen darfst in Zukunft. Moderne. Oder aber, du machst es über den Microsoft Store. Wasein Bullshit Microsoft. Alter. Oh Gott. Die kriegen, jetzt machen sie einmal was Gescheitesseit 15 Jahren und dann funktioniert es nicht. Kuluki97, neun Monate, dankeschön. ExzellenzSubscription. Ich glaube, ich habe jede Menge Subscribers überszenen, oder? Ich muss malnachgucken. Ich gehe jetzt Warzone spielen, Kleine. Nee, jetzt noch nicht. Erst in einerStunde oder eineinhalb Stunden. Lerado hat auch Subscribed, dankeschön. Der Dekan auch.Exzellenz Subscriptions. Macht die Microsofts Sache nicht besser. Okay, also die Briefviewist explizit für Win32 Anwendungen. Das schreiben sie hier, guckt. Ich will keine Packaged App.Geht mir nicht auf den Sack. Ich will es nicht Packaged haben. Genau das hier, genaudas. Das, was er schreibt. Der einzige Unterschied, den ich aktuell sehe, zwischen der UWP WinUI3 Anwendung und einer Win32 WinUI Anwendung ist, dass man keine Sandbox hat. Aber dieganzen anderen Scheiß, also der hauptsächliche Scheiß, nämlich ein Codesigning Zertifikatoder den Microsoft Store, braucht man immer noch. Komplett useless wasted, Alter. Derganze Aufwand ist voll von Arsch. Kosta2570, Stufe 1, dankeschön. Exzellenz Subscription.So, wie lösche ich den Kram jetzt wieder? Weg. Wie lösche ich den überhaupt wieder?Fickt euch, ey. Ich habe mich da so drauf gefreut, dass man endlich im Jahr 2020 malwieder ordentliche Windows Desktop Anwendungen machen kann. Ne, geht nicht. Man könnte ja,man könnte ja auf die Idee kommen, die wollen gerade, dass alles nur noch in Elektron gebasteltwird. Da gibt es auch einen Tipp von Microsoft. Ja, welchen denn? Der Tipp von Microsoft ist,man kann in den Browser, oder was? Codesigning ist doch dafür gut. Ja, natürlich, natürlichist Codesigning seine Anwendungszwecke, aber so als 0815 normaler Entwickler, der daheimsitzt und irgendwas bastelt, ich kauf mir kein 300 Euro Codesigning Zertifikat. Seh ichüberhaupt nicht ein. Und man braucht den Scheiß ja überhaupt nicht. Es ist komplett unsinnig.Man bräuchte einfach einen richtigen Paketmanager. Und nicht diesen Windows Store Crap. Ja,unter Anstellungsfunktion ist das auch wunderbar. Du hast entweder den offiziellen Package Manager,oder du hast die User Repos, wo du halt sagen musst, okay, ich traue dem User. Und das Pakethat halt, wenn du es runterlädst, hat das Ding halt eine MD5-Sommer oder eine Hash-Wertdrüber. Du weißt, du hast das Richtige runtergeladen und gut ist. Ich kaufe mir doch kein CodesigningZertifikat, dass ich das Windows Anwendung machen kann. Ja, den Package Manager gibt's,da sind sie gerade dabei, ich weiß. Aber bis das dann überhaupt richtig funktioniert,wird schon mal, ach das wird doch nichts. Ey echt, bei Microsoft ist echt alle Hoffnungenverloren manchmal. Ja, Flow 96 macht das. Als WPF-App kannst du das nicht verpacken.Du kannst ja schlecht zwei Mainloops laufen lassen, einmal für WPF und einmal für WinUI,das wird ja so nicht funktionieren. Aber anscheinend kann man keine Constant-Applicationsverstanden. Codespaces, ja ich hab mich für die Beta eingetragen, ich weiß nicht, obdas schon raus ist. Okay, man merkt vielleicht ein bisschen, dass ich angepisst bin überdie Microsoft-Geschichte hier. Newst. Wie sie hier einfach Scheiße erzählt habenin diesem Issue. So nach dem Motto Ja, es kommt da mit der Briefview. Schwachsinn, kommtes, kommt es, es. Mhm.Wie hieß das Issue noch mal von dem anderen Typ, was wir eben aufhatten?Sonst probier doch den Package Manager aus. Ja, das machen wir, den Package Manager,das können wir uns echt angucken. Hat jemand, hat jemand mal einen aktuellen... wobei. Ja.Genau, so ist es. Genau, sie haben seit 20 Jahren nichts ordentlich modernes mehr rausgebracht,was man sinnvoll verwenden kann. Das ist, es ist so lächerlich. Erstmal abvoten,erstmal abvoten. Ich will jetzt abvoten. Ich bin nicht eingeloggt. Frag ich muss abvoten.Bin ich, bin ich im anderen Browser eingeloggt? Okay, ich muss es abvoten. Ah, easy. Ha! Dahat er, da hat er geabvotet. Oh Mann. Microsoft, Microsoft, Alter. Nee, nee, ich fasse es nicht.Okay, bei der Gelegenheit können wir das letzte Wishlist Studio mal updaten, das schadet nichts.Was war denn das letzte Sinnvolle, was die rausgebracht haben? Wishlist Studio Code?Nee, GUI-mäßig, GUI-mäßig war das letzte Sinnvolle, was sie rausgebracht haben, WPF.2006 oder so. Ja. WPF war das letzte Sinnvolle, was sie rausgebracht haben.Was sie ja dann irgendwie haben sterben lassen für WinRT und Zeug.Okay, vielleicht ist das gar nicht so schlimm, wie ich denke. Vielleicht ist das gar nichtso schlimm, weil vielleicht kommt das ja noch. Unpackaged Apps, vielleicht, vielleicht kommtdas ja noch. Ansonsten, ansonsten macht vielleicht irgendein Community-Mensch was, der das Bildirgendwie, der das vereinfacht, weil aktuell habe ich noch nicht mal eine Ahnung, wie ichden Kram überhaupt starten soll, ehrlich gesagt. Das muss gehen, ansonsten ist daskomplette Totgeburt, Alter. Ja, Henry, Qt ist wirklich das Einzige, washalbwegs geht, ja, leider. Also aktuell hast du ja Cross-Plattform im Prinzip, so richtigDesktop, auf dem Desktop, ja. Cross-Plattform hast du die Auswahl, Elektron oder Qt, daswar's. Das sind eigentlich die zwei Sachen. Für mich, ich habe es ja schon öfters gesagt,für mich sind die zwei Kriterien, woran man sieht, ob man mit einem Cross-Plattform GUIFramework quasi alles Mögliche machen kann, sind zwei Sachen, wo man nachgucken muss,wo die meisten Sachen fehlen, und zwar gibt es einen Webview, einen ordentlichen Webviewfür HTML-Zeug und gibt es die Möglichkeit, 3D-Content einzubinden, also nicht mit 3D-Content,GPU-Accelerated-Content, also sprich, gibt es einen OpenGL-Widget oder einen DirectX-Widget,das sind so die zwei Sachen. Wenn es die gibt, dann taugt das wahrscheinlich was.WX-Widgets C++, habe ich mir vor einer Weile mal anguckt, sah irgendwie ziemlich wir ausund auch wenig, wenig Tutorials und aktuelle Sachen. Außerdem, das Schlimme ist ja, daskommt ja dabei, dass Qt selber C++ ist. Ja, es gibt ganz gute Python Bindings, was jetztauch nicht für GUI-Anwendungen unbedingt so meine erste Wahl wäre. Die C-Sharp-Bindings,die es gibt, sind mittlerweile ganz ok, allerdings unvollständig, die haben nur QML. Und dieIDE-Integration ist dumm. Hier, das, warte mal, was war das überhaupt genau? Das isteigentlich ganz gut mittlerweile, leider ist die IDE-Integration, als ich das letzte Malausprobiert habe, nicht gut gewesen. Das Problem war, dass man das Frontend in Qt-Creator bastelnmuss und den Rest bastelt man in Visual Studio, weil der Qt-Creator natürlich keine.NETC-Sharp-Completionund alles hat und dann muss man immer hin und her schalten und das eine funktioniertdann mit dem anderen nicht richtig und es ist wir auf jeden Fall, es ist nicht schön,es ist nicht schön. Qt kann man nehmen, weil, also vor allem mit QML, also die neue Qt-Variante,wir reden jetzt nicht von, wie heißt das, Qt-Widgets, das alte, also da rede ich jetztnicht von, ich rede nur von dem neuen, das kann man Cross-Plattform wirklich nehmen,weil das sieht Cross-Plattform auch gleich aus. Die malen ja ihre Widgets komplett selbstund ich sage ja auch immer, ein ordentliches GUI-Framework muss die Controls selber malen,ansonsten bist du immer darauf beschränkt, den kleinsten gemeinsamen Nenner aller Betriebssystemezu nehmen. Das soll gleich aussehen, weil du hast das Problem, wenn das nicht gleichaussieht, dann hast du so ein Geschiss wie beispielsweise bei Xamarin, Xamarin, Xamarin,wie auch immer man das ausspricht, dass die ganzen Controls nichts können, weil die guckenmüssen, dass das, was sie implementieren an ihren Controls, überall funktioniert. Dasist das einzig wahre, dass die ihre Controls selber malen. Natürlich sieht es dann Macnicht aus wie Mac und Windows nicht aus wie Windows und Linux nicht aus wie Linux, sondernes sieht eben aus wie, ja wahrscheinlich wie eine Web-Anwendung zum größten Teil, bloßweil es keine Web-Anwendung ist. Den C++-Hate, naja, ich habe mich ja schon öfters überC++ ausgelassen. Es gibt so viele ekliche Sachen an C++. Man kann die auch selber malenund es auf jedem System so aussehen lassen. Ja, dann hast du aber das Problem, dass eshalt nie so hundertprozentig passt. Entweder die einfachere Variante ist, du machst quasieinen eigenen Style, der dann halt überall gleich aussieht, ansonsten kannst du nur versuchen,die Sachen nachzubauen. Das wird nie so hundertprozentig funktionieren. Es gibt ja auch Windows-Skinsfür Qt-Caps früher, die sahen halt scheiße aus, oder Mac-Skins oder sonst was. Ja, dasist das. Also ich finde den Ansatz, wie du das mit Electron hast, eigentlich ganz sinnvoll,oder wie sie es in QML machen. C++ ist eklig. Zum Beispiel, mein Lieblingsbeispiel, warumC++ kacke ist, oder was sich zumindest das Standard-Cremium denkt, ist, warum gibt esin C++, im C++-String, warum gibt es kein To-Upper? Gibt es nicht. Ich meine alleinschon, dass das Internet voll ist mit 206 Freestyles, wie ich in String To-Upper kaste,oder nicht kaste, To-Upper mache, in C++, dass sie teilweise empfehlen, man soll Boostfür eine Boost-String-Implementierung dafür verwenden. Ich weiß, dass es das hier gibt,aber, also, ich sage es mal ganz ehrlich, guckt euch das mal an. Ich meine, ernsthaft, einfucking String To-Upper, ist das euer Ernst, C++-Cremium? Was ist mit euch los? Was istdas Problem, bitte schön an String, oder was auch immer hier, Upper, oder so. Das istdoch hässlich wie die Nacht, das hier. Warum ist das nicht in der Standard-String-Klassedrin? Das ist so ein Ding, wo ich mich an vielen Stellen in C++ frage, warum ist das so inkonsistentund warum ist so einfache Sachen so kompliziert? Genauso, dass es drei oder vier verschiedeneVarianten gibt, wie du Iterator machst. Spread the Beast, 11 Monate lang, schön, exzellent.Was genau macht das? Costa, das ist genau die richtige Frage. Weil ganz ehrlich, wasgenau macht das eigentlich? Und vor allem, wie scheiße lesbar ist das denn? Also wasdas macht, ist, es macht dieses hier, also Test-String, macht es zu Test-String nur inGroßbuchstaben. Der loopt quasi über jeden einzelnen Character in diesem String drinnenund printet ihn dann quasi in Groß. Also schau mal, komplett wir. Dazu kommt ja nocheinmal die Geschichte, dass das nur funktioniert, wenn es ein poplicher ASCII-String ist. Machtmal, wir haben es doch letztens probiert, macht mal UTF-8, oder Schwachsinn, nicht UTF-8,macht mal Unicode-Strings in C++. Alter, das ist Brechreiz, kompletter Brechreiz. Weilder Witz ist ja, wenn es eine gute Implementierung ist, dann kann es mir erstmal scheißegalsein, ob das intern UTF-8 ist, UTF-16, UTF-32 oder UTF-69. Ich will mich da ehrlich gesagtüberhaupt nicht mit beschäftigen müssen. Bei.NET ist es teilweise auch schon ein bisschenfragwürdig..NET verwendet historisch gesehen, glaube ich, UTF-16 oder irgendein Vorgängervon UTF-16 für ihre Strings. Das ist zu 90% ok. Es wird eklig, wenn du 4-byte-Characterhast wie Emojis zum Beispiel. Dann wird es schon im Handling ein bisschen abartig, ja.Aber in C++ ist es schon mal komplett wir. Quai, 5 Monate, danke schön. Hab ich vielleichtschon vorher gelesen, aber nochmal. Huge Subscription. Scrusix, 3 Monate, auch nochmalam Start, exzellent. Die Standard muss noch verbessert werden, dafür gibt es halt Boosts.Ja, leider, leider. Ich weiß nicht, was die seit den letzten 15 Jahren machen im C++-Cremium,dass die so einfache Sachen in der Standard-Library nicht drin haben. Zumal das Problem ja ist,mit Boost, wenn du zum Beispiel irgendeinen Arduino oder einen ESP bastelst, da ist haltaußer Standard-Library nichts. Da ist mit Boost nichts. Max, wie machst du Emojis toupper? Gar nicht. To upper machst du logischerweise nur normale Characters. Ja, genau, in.NETist das einfacher mit den Encodings. Ja. Und es gibt noch, wie gesagt, es gibt noch zig,zig, zig andere. Ich meine, manche meine Standard-Lieblingstage ist halt über C++ zuflammen. Was haben die sich zum Beispiel mit ihrer Lambda-Syntax gedacht? Ugly, genau,ugly as fuck. Guck mal, wenn die erste Autovervollständigung bei Google ist C++ Lambda-Syntax ugly, dassagt doch schon mal alles aus. Ey, oh, wenn ich das schon sehe. Das ist auch so was, wasmich in C++ abfuckt. Diese Iterator-Geschichte, die total inkonsistent ist. War es denn, wares denn so schwer, war es denn so schwer, eine Array-Klasse zu machen oder eine List-Klasseoder eine Vector-Klasse, die eine Sort-Methode hat? Warum, warum, warum kann man, warum kannman in C++ nicht? Übrigens im Qt-Vector, in der Qt-List kann man das machen. Die habendas nämlich ordentlich gemacht und nicht wie die Kack-Standard-Library das macht. So,warum, warum kann ich, warum kann ich in C++ nicht sowas hier machen? Ist das zu kompliziertoder ist das zu einfach für C++-Leute, sagen die, oh nee, also das kann man schon ziemlichgut lesen. Das ist keine gute Idee, das müssen wir anders machen. So, und was machen diein C++ stattdessen? In C++ kommt dann Standard-Sort-V-Beginn-V-End. Ah, frag mich nicht wie der Kramüberhaupt, wie geht denn das überhaupt in C++ richtig? Ja, haben wir hier eben ein Beispiel?What the fuck, Alter, was ist das denn? Ist das euer Ernst? Kann man, kann man direkt,kann man direkt so machen? Geht das mittlerweile? Ich glaube, das wäre ja schonmal ein Anfang,wenn das funktioniert. Nee, nee, geht nicht. Ja, ich mein, was, was, was ist, was ist losmit denen? Ja, das ist, wenn man nur, wenn man nur hier Range sortieren will. Ja, Rangesist auch so ein Ding, ich könnte echt Stunden über C++ mich aufregen, aber ich mein sowashier, was, was, was denkt man sich dabei denn? C++-Standard-Clip ist cancer. F, nee. Dazukommt auch ne Sache, die in C++ einfach absoluter Crap ist, wo sie jetzt mit C++ 20 oder, nee,wie heißt denn, 0x oder so, nee, wie heißt denn das überhaupt? Also das neue C++, mankann sich ja in C++ noch nicht immer merken, wie die Standards heißen, also das neue, wasjetzt rauskommt, dass man in C++ immer noch mit Header-Files rumhantiert. Es ist im Jahr2020 kompletter Witz, dass man solche Dinger hier braucht überhaupt in Header-Files noch,dass der Compiler nicht verreckt beim Compilen. Aber das ist nicht der Compiler, das ist wahrscheinlichder Linker vorher. Das ist nicht verreckt beim Compiler, dass ich so einen Kack überhaupteinfügen muss. Wo sind wir denn 2020? So, C++ braucht heute noch diese dämliche Unterscheidungvon Header-Files und Programm-Code-Files anstatt, dass man es machen würde, wie jede andereProgrammiersprache, die glaube ich in den letzten 10 Jahren, 15 Jahren, was auch immerrausgekommen ist, die ein halbwegs modernes, gescheites Modulsystem haben oder in irgendeinerArt und Weise Metadata haben, wo der ganze Kram drin steht. Kann man Visual Studio CodeProgramme kompilieren und ausführen? Klar, wenn du einen Compiler hast, kann er ja hier.Ups, warum habe ich das jetzt gestoppt? So. Warum? Verstehe ich nicht, warum das immernoch so ein Ding ist. Ich finde es gerade Amazon, wie du dich so aufrückst zu 10++, da kannstdich ja auch übelst aufregen. Es gibt übrigens auch keinen. Dadurch, dass die immer nochdieses komische Konstrukt von Pre-Processor, Header-Files und Includes verwenden, alsowenn C++-Programme kompiliert werden, dann machen die es ja aktuell so, die Includenquasi alles in einen Riesen-File und dann kompilieren sie es. Das ist ja alles nur Copy-Paste,diese ganzen Include-Header-Geschichten. Dadurch, dass sie das immer noch machen und kein gescheitesModulsystem haben, kein gescheites Repo haben oder irgendwo, irgendwie eine Möglichkeit,dass du sagst, ja, mein Programm exportiert die und die Funktion, dass du irgendein Metadata-Filehast, was auch immer, halt irgendein ordentliches Modulsystem, hast du auch keinen ordentlichenPackage-Manager für C++. Jede Programmiersprache, die irgendwie in letzter Zeit rausgekommenist, hat eine halbwegs sinnvolle Möglichkeit, Dependencies aufzulösen und Module bzw. Librarieszu installieren, die man braucht, die man dann auch gescheit gemanagt hat. In C++ istes wie 1917 Header-Files Copy-Pasten von GitHub. Ja, ich weiß, es gibt ein paar Versuche,aber nichts hat sich durchgesetzt. Aber C++ ist nicht in letzter Zeit rausgekommen. Doch,die sind seit, glaub, was war die erste moderne C++-Version? Zehn? Dreizehn? Elf, elf, genau.So, die erste halbwegs moderne C++-Elf und die sagen seitdem, dass modern C++ quasi nichtsmehr mit Oldschools C++ zu tun hat. Also, die heben das, die stellen das so weiter vorund die sagen es auch selbst, C++ ist eine neue Sprache. Mittlerweile. Und C++, vor allem,wenn man halt ein Gremium hat, was da jetzt schon zehn Jahre dran arbeitet, neue Sachenmacht, C++ muss sich da auch am Standard mit modernen Sprachen messen können. Oder daskönnen sie nicht. Ich mein, so ein Package-Manager. Und ich mein, damit nicht diese Community-Geschichten,sondern ein offizieller Package-Manager und ein offizielles Repo und ein offiziellesDependency-Management-Tool. Ja, sowas, wie es Jam ist bei Ruby, wie es NPM suckt, aberauch NPM ist für Node oder Cargo Rust. Rust macht das richtig gut. Rust ist eine Sache,die kann man sehr schön mit C und C++ vergleichen. Rust hat alles das gemacht, was man von einermodernen Sprache erwarten würde, um es dem User möglichst einfach zu machen. Wenn duRust installierst, dann kriegst du einen Package-Manager und ein Projekt-Management-Tool und ein Projektverwaltungstoolmit Cargo dabei. Du installierst Rust, du hast Cargo-Commando-Zeilen-Tool, damit kannst duneue Apps anlegen und du kannst gleichermaßen neue Dependencies auflösen und alles. Wunderbar.Top. Und das könnten die in C++ auch machen, das ist überhaupt kein Problem, aber siemachen es nicht. Die können das ja auch meinetwegen rückwärts kompatibel lassen, da sprichtja überhaupt nichts dagegen. Man muss ja nicht die alten Sachen rausschmeißen, um neue Sachenzu supporten, außer es widerspricht sich. Da müsste man sich das mal angucken. Alleinschauen,ich war jetzt gerade bei der Lambda-Syntax von C++. Die ist so unglaublich eklig. Alsodie Lambda-Syntax von C++ ist sowas hier. Ich hoffe, ich krieg's jetzt überhaupt richtigaus dem Kopf. Er macht erst einmal eckige Klammer, dann macht man geschweifte Klammerfür Funktionsaufruf und dann macht man den Body für die Funktion. Also dann hier machtman dann sowas wie hier Printf. Also, das da ist quasi die eigentliche Logik, die ausgeführtwird. So, und das hier ist, wo man angeben muss, sprich, welche Variablen man captchernwill. Es reicht in C++ nicht, wenn ich jetzt hier zum Beispiel sage, ich hab hier obensowas wie, keine Ahnung, int a. So, wenn ich das hier mache zum Beispiel, das reichtin C++ nur manchmal, nur manchmal, ansonsten gibt's merkwürdige Compiler Errors. Ich müsstedas hier, glaube ich, irgendwie angeben oben dann. Oder ich glaube, ich muss sogar sagen,dass ich nur eine Reference zu a will oder sowas. Also, ganz merkwürdige Geschichte.Meistens funktioniert's allerdings so. Und was ich bei der C++-Lambda-Syntax richtigeklig finde ist, warum hat man mal wieder Zeichen genommen, die in der Sprache schonan zig anderen Stellen verwendet werden? Warum hat man nicht, ich mein, ich bin keinJavaScript, ich bin kein JavaScript-Freund, ja. Aber in JavaScript würdest du zum Beispielhier sowas machen. Oder nehmen wir die C-Syntax, die finde ich auch ganz schick. In C++könntest du sowas hier machen zum Beispiel. Das ist aber wahrscheinlich wieder für C++zu lesbar. Da hat das C++-Cremium gesagt, ah, fuck, also wenn das hier jeder lesen kann,dann brauchen wir keine Experten mehr. Und wer soll uns da noch Geld bezahlen, wenn dasjeder lesen kann? Das geht nicht. Ja, und die etwas längere Variante in C-Sharp wäredann das hier. So. Das ist Discard, den kann man übrigens auch weglassen, wenn man keineParameter hat. Dann hätte man sowas. Das ist doch wunderbar lesbar, das ist doch top,da kann man sich überhaupt nicht drüber beschweren. Aber nicht so in C++. Vielleicht leuchtetmir nicht ein. Aber genug der ganze, wir wollten uns glaube ich noch den.NET-Paketmanagerangucken. Was sind eigentlich Variablen? Oh, das ist jetzt aber, das ist jetzt ziemlichbasic von den C++ Sachen. Variablen sind Speicher, man könnte es eigentlich im PrinzipSpeicher mit einem Namen dran. Das ist eine Variable. Arbeitsspeicher mit einem Label dran.Ja, aber wie gesagt, es gibt zig, zig Varianten, wo ich mich über C++ aufregen kann. Dassdas Ding zum Beispiel keinen gescheinen Inam-Support hat. Aber wir hören jetzt auf mit C++. Genug,genug C++. Wir wollen uns den Package Manager von Windows mal angucken. Windows PackageManager Review. 19. Mai. You are going to be able to win get. Die hatten sowas dochschon mal. Ich habe sogar mal ein Video dazu gemacht. One get hieß das Ding. Und warumgibt es da jetzt schon wieder 50 verschiedene Package Manager von Microsoft? Na gut. Winwin. Das Problem, was ich sehe, ist, muss ich jetzt mal sagen, warum ich glaube, dassauch wieder nicht sich das Ganze durchsetzen wird, ist, Microsoft, es reicht nicht, einenPackage Manager in Windows auszuliefern. Man braucht auch offizielle Repositories dafür.Einen Package Manager allein bringt gar nichts. Guckt euch in C++ an. Für C++ gibt es auch4-5 verschiedene Package Manager. Verwendet keiner, weil es kein offizielles Plast Repositorygibt. Und das muss es von Microsoft geben. Okay, probieren wir das Ganze mal aus. Winget CLI. Ich glaube, das probieren wir mal an unserer Windows VM aus. Wir haben schongenug rumgebastelt. Haben wir überhaupt noch eine Windows VM? Wir haben keine WindowsVM mehr. Na gut, dann haben wir es jetzt hier. Übrigens, was ich verwende als Package Manageraktuell ist halt der hier. Der ist ziemlich gut, finde ich. Ist ziemlich gut. Das Problemdabei ist halt auch, es ist kein offizielles Repository. Es ist kein offizielles Repository,das heißt, da kannst du dir relativ schnell, das wird von, keine Ahnung, 1-2-3 Leuten maintained,da fängst du dir halt relativ schnell, vielleicht mal, wenn die nicht aufpassen, ein Virus einund das sollte damit nicht passieren mit einem offiziellen Package Manager. Oh. Windows 10ist ein Insider-Build. Wir müssen noch eine VM installieren, Leute. Okay, easy. Oh, wiespricht man das denn aus? Hulien? Okay. Become an Insider, excellent. Machen wir. Da istes wieder. Da ist es wieder. Man kann das einfach runterladen. Win. Win CLI. Excellent.Patrick will Hulien mieten, okay. Ihr Patrick, Mieteser. Oh, die sind alle so glücklichimmer auf den, oh, Leute, was ist da los? Das geht aber nicht. Die sind viel zu dichtbeieinander. Okay, wir haben Hulien gemietet. Release. Aha. AppXBundle. Ja, wo wir geradewieder bei dreckigen UWP-Packages wären. Die halten alle die Luft an. Ja, genau. Wahrscheinlich.Ja, stimmt. Irgendwie habe ich keinen Bock, den Kram zu installieren, aber mir offen Systemjetzt. Oh, was sagt denn der Windows Store? Der Windows-Store sagt, es gibt Updates.Habe ich das gerade richtig gesehen? Habe ich das gerade oben links? Oben links war dochgerade irgendwas mit Updates drin, oder? Stand da nicht gerade drei Updates? Ja, hier, guckmal. Stand da nicht oben irgendwas drei Updates gerade und ich habe es nicht gesehen? DieXbox Game Bar, your phone. Was, mein Phone? Ich kann mein Phone upgraden, das ist ja poggers.Und der 3D-Viewer, ja. Dazu kann ich nur sagen, und gleich wieder weg damit.Ok, Microsoft Desktop App Installer. Leute, irgendwie ist es mir dazu, eine Windows-VMzu installieren für den Kram. Ich weiß auch nicht. Kennt ihr schon, ich zeige ihn immerwieder gerne. Ich zeige ihn immer wieder gerne, den ISO-Download-Hack. Passt mal auf,mal gucken, ob der noch geht. Ihr seht ja hier. Chat, nicht spoilern, nicht spoilern,weil das verdirbt immer den Effekt, ja. Excellent Trick. Also, man sieht ja hier, wenn man Windows10 ISO runterladen will, geht das nicht. Man kann dieses Tool runterladen, um dann, dasssich selbst ein ISO zu erzeugen. Ich zeige euch jetzt mal was, was man machen kann. Ihrgeht einfach hier drauf und sagt Developer Mode und dann stellt ihr um auf irgendwieein Mobile-Gerät, sagen wir jetzt irgendwie keine Ahnung, ein iPhone 6 oder sowas. Dannaktualisiert ihr die Seite und ISO-Download. Fertig, das war's. Easy. Easy as fuck. Easyas fuck. Jetzt können wir uns ISO runterladen. Bestätigen. Exellent. Englisch. International.Bestätigen. Sehr spät. Schon geil, oder? Das ist schon geil. Ja, und dann macht ihrdie Developer-Tools aus. Ihr könnt auch die Developer-Tools ausmachen, dann bleibt dieSeite offen. Und ihr seht, kaum sind die Developer-Tools aus, geht's wieder nicht mehr. Geht's wiedernicht mehr. Microsoft-Mitarbeiter hassen diesen Trick. Wie behemmert ist das eigentlich?Costa, es ist gar nicht so behemmert, weil, überleg dir mal, du bist ein User, der nochkein Windows hat. Wenn du noch kein Windows hast, kannst du ja auch nicht das Windows-Toolrunterladen, um dir ein ISO zu erstellen. Also, die Seite schaltet halt um, sobald siedenkt, du bist kein Windows-User. Ist eigentlich ganz logisch, weil als nicht Windows-User brauchstdu ja das Windows-ISO, um Windows installieren zu können. Also, ganz so low-brain ist esvon Microsoft gar nicht, aber ich finde es trotzdem ziemlich fail. Frage für einenFreund, gibt es eine UDP-Porn-App? Wozu ist das Übertragungsprotokoll für eine Porn-Appwichtig? Brauchst du Echtzeit-VR-Porn, da TCP ist bloated? Okay, wir installieren unsmal eine Windows-VM-Com. Scheiß drauf, machen wir mal. Schadet ja nix. New, Virtual Machine,Custom. Geht ja auch schnell, dauert 5 Minuten oder so. Custom, Windows 10. Ja, meinetwegen.Auch gut. 3 Cores, auch gut. 4096, ja, 5G-RAM, auch gut. Nutt, excellent, excellent, excellent,excellent. Single-File, 60, ja, 40G reichen auch. Excellent, excellent, excellent, alles,alles exquisite, excellent. Jetzt dreht er, jetzt dreht er durch. So, printer raus, Soundkarteraus, da kommt Cortana gar nicht auf die Idee uns voll zu texten gleich. So, save. Die CD,ist das ISO fertig? Nee, 40 Sekunden. ADB-Push, excellent, big-break-chat. UEFI einstellen,ja, warum nicht? Haben wir doch gerade gemacht. Oder muss man das noch mal machen vorher?Nee. Me-Came, 6 Monate, Dankeschön. Poggers. Chat, ich verteile mal wieder ein Gratis-Sub,und zwar, wir machen das ja ab und zu, gleich geht's los. Ihr müsst wieder erraten, abererst wenn ich sag, dass es losgeht, ihr müsst wieder erraten, bei wieviel Subs ich geradebin. Aber vorher muss ich erstmal wieder einstellen. Oh, mein FFZ ist kaputt. Mein FFZ ist kaputt.Leute, es geht noch nicht los.Chat, ich muss nämlich erstmal einstellen, dass ich im Chat möglichst viel sehe. Ichweiß, ihr spammt schon gerne, ne? Wo steht denn das in FFZ, dass ich die History einstellenkann? Hier Chat, Chat, Kanal, Chat, okay, Inline, Raum, Erscheinung, okay, Breite, Schriftgröße,ich brauche die Chat-History, wie kann man die verhalten, verhalten? Nee. Wie kann manden FFZ, ah hier, Länge des Chat-Verlaufs, 5000, das sollte doch eigentlich reichen,oder? Chat, das sollte eigentlich reichen. Also, okay, los geht's. Ihr müsst jetzt raten,wieviel Subs ich gerade habe, sobald ich das hier reinpoiste. So, jetzt. Okay. Drei, zwei,eins, stopp. Okay, also schauen wir mal. Richtige Antwort wäre 201 gewesen. Hat jemand 201?Neonominus hat glaube 201, sehe ich das richtig? Und Kawaii Shocks hat auch 201. Der eine,du weißt schon 201, oi oi oi. Okay, habt ihr gut gemacht, Leute. Dann kriegt ihr jetztein paar Abos, wenn es funktioniert. Kommen wir mal, gucken wir mal, ob das klappt. Gehtdas jetzt? Ah, excellent, nice. Funktioniert. Der Neonominus kriegt auch ein. Ihr habt echtGlück, alle, die die keine Abos haben, gewinnen. Die, die Abos haben, gewinnen gerade nichtmehr. Das ist gut, weil ich habe immer noch keine Ahnung, was ich machen soll, wenn maleiner gewinnt, der schon ein Abo hat. Der wird dann hochgestuft, der wird dann auf dienächste Tierstufe upgraded oder so, keine Ahnung. Aber ganz einfach abgesehen, das bringtja eh nix, weil ich von meinen 22 Emote Slots oder so immer noch keine, keine, keine Emotesbei Pfeiffer gekauft habe. Dabei habe ich eine Riesenliste mit Emote Ideen. Schon ganzschön, ganz schön. Monarch, Monarch S. So, da habt ihr eine Runde Subs. Exzellent.Das ist der Neonominus, hast Glück gehabt. Und das Schöne ist, wer das hier regelmäßigverfolgt, der kann sogar sich ziemlich gut ableiten, wie viel Subs ich gerade habe, weilso sehr schwanken wird das wahrscheinlich gar nicht. Wo hast du die WinUI 3 DLL gefunden?Im Ordner von dem Testprojekt, was man mit den Standardvorlagen anlegen kann. So, jetztmüssten es 204 Subs sein, wenn ich richtig lege. Aber das Schöne ist, ich kriege jadie Hälfte wieder, wenn ich, nee 205. Habe ich was übersehen? Habe ich, habe ich wasübersehen? Ach hier, x stürzt, was? x stürze dx, zwei Monate. Dankeschön, habe ich garnicht gesehen. Exzellent. Huge IQ Sub. Und davor hat McCame resubbed, auch ganz schön.Sehr schön. Neonominus steht bei mir überhaupt nicht drin. Aber du hast schon eine. Ja,keine Ahnung. Ja, aber die Twitch Tracker stimmen nicht. Zumindest nicht was Subs angeht.Also ich habe gerade 5 Euro ausgegeben und davon bekomme ich 2,50 Euro wieder. Das lohntsich natürlich richtig. Ach und steuern, klar. Any key. Win-win. Ja Twitch freut sich.Okay, Language, Englisch, Time Currency, German. Keyboard, German. So, German no dead key gibtes hier nicht. Install. Exzellent. I don't have a product key. Brauchen wir dafür auchnicht. Wir installieren Windows 10, Bro. Was ist eigentlich IBM German, so ein uralt Tastaturlayout.Weiß nicht was der Unterschied ist zwischen German und i-German IBM. Können wir guckenwährend wir installiert. Difference IBM German und German. IBM Keyboard German undGerman. Ah, caps lock ignoriert die Zahlen, okay. Wusste ich gar nicht. Für mich istno dead key nur wichtig, was man unter Windows nicht richtig einstellen kann, dass der Kramhier richtig funktioniert. Ja, so sieht es aus. Exz, Windows Installation, läuft sehrschön. Haben wir Frametrops? Keine Frametrops Leute, obwohl davon scheinen richtig gut zufunktionieren gerade. Dafür funktioniert es bei meinem Warzone beziehungsweise COD Mitspielernicht. Der hat jetzt auch rumgestellt auf Vodafone, bei ihm spackts jetzt übelst rum.Aber es haben ihm auch DualStack Lite aufs Auge gedrückt glaube ich. Vodafone, VodafonePhone. DualStack Lite, größte Shit ever. So, ähm, ausreichend rumgeflagert, jetztbist du VIP Traffic. Jetzt mal ganz ohne Witz, das ist kein Zufall. Es ist kein, ich kannmir nicht vorstellen, dass es Zufall ist, dass, ähm, in dem ab dem Moment, wo der SocialMedia Typ vermute ich mal von Vodafone geantwortet hat, dass es ab dann geht. Das kann ich mirnicht vorstellen. Der Zufall ist zu groß. Die haben gesehen, der Typ, dem gucken 20.000Leute zu, also auf Twitter 20.000 Follower auf Twitter und der flamet uns jeden Abendan öffentlich. Das ist scheiße, das geht nicht. Das müssen wir anders machen und schongehts. Was halt eigentlich total für mich gut ist, aber insgesamt ziemlich scheiße,wenn man sich überlegt, dass dadurch es bei allen anderen ja auch nicht besser wird,sondern marginal schlechter dadurch, dass es bei mir besser ist, es müsste halt überall,man müsste sich halt überall wenigstens drauf verlassen können, dass ein Provider ebenseinen Job erledigt und es kann ja nicht sein, dass man sich freuen muss, wenn es mal eineWoche funktioniert. Es sollte die Ausnahme sein, es sollte immer funktionieren und mal,mal kanns Probleme haben, aber bei mir war es mit Vodafone ja so, es hat mal funktioniertund die Ausnahme war eigentlich, die Regel war, dass es nicht funktioniert hat. Die Musikist voll MonkaS gerade. Das war Luigi's Mansion, oder? War das Luigi's Mansion Musik? Ok, guckenwir mal meine Twitch-Statistik an, während Windows installiert. Oh, es gibt bei mir auchgleich Mittagessen und danach muss ich Warzone grinden. Vertress, wann wollt man anfangen?Also 13 Uhr gibt es bei mir Mittagessen, aber es geht schnell. Also wir können dann anfangen,wenn ihr wollt. Ich arbeite bei 1&1, wenn du günstiges DSL brauchst, HMU. Was ist dennHMU? Hau mich um? Nee, was ist HMU? Hit me up! Ah, nicht hau mich um. Wann immer ich will,so, ja dann. Ja, dann geh ich jetzt danach im Stream essen und dann gehts los. Leute,frage mal an euch. Ich weiß, die meisten Leute sind hier, weil sie Technik-Kram sehen wollen,sowas wie heute hier. Leider war heute eher Microsoft und C++ Frame. Soll ich danachunser Warzone Zeug streamen soern? Heute ist auch nur Windstream. Also heute verlierenwir auch nicht. Ist es correct? Yes, is right. Keyboard-Layout, nein, nein, nein, nein.Wollt ihr mich veräppeln? Das ist gar nicht das richtige Keyboard-Layout. Ich hab docheben schon das richtige Keyboard-Layout ausgewählt. Haben ja noch nie verloren. Nee. Und ichbin auch noch nie sinnlos gestorben irgendwo. Nein. Zum Glück haben wir die Soundkarte ausgebautsonst käme Cortana wieder an Start. Hi, I'm Cortana. Was ist das? Moment, was ist das?Loll. Ach du Scheiße. Ach du Scheiße.actuallyeineOkay, das war recht aufwendig das parallel zu Setup.Personal use, next, achja jetzt haben wir das Problem hier Offline Account muss mananklicken.Wir hatten doch eben jemanden im Chat der gefragt hat wie man Windows jetzt Offlineaktivieren muss.Offline Account, da muss man zweimal sagen ja ich weiß, ich weiß, limited experience,ich weiß, ich weiß, ja es ist mir klar, so Tests, 1, 2, 3, 4, 5, 6, excellent Passwort,das geht mit der Home Version noch, oh weiß ich nicht, weiß ich nicht, Security Question,Chat Name, Security Question 2, Nickname und what is first name for your oldest cousin,ganz, ganz klar, cute chat, fuck, no, nein, nein, nein, nein, nein, nein, nein, nein,nein, nein, nein, nein, nein, nein, nein, achja, die Installation ist wirklich absolutfailbar Windows immer, du musst erstmal eine halbe Stunde auf Ich will nicht klicken,das haben die bewusst gemacht garantiert die die hoffen dass die leute sagen ja diefault settings akzeptieren so nach dem motto das schneller geht total hängen gebliebenbis gleich also ich gehe jetzt was essen gleich wenn ich hier fertig bin 13 uhr kurz nach13 uhr dann esse ich schnell was und dann gucken wir dann gucken wir dann gleich also irgendwieso 13 30 oder so geht es los mit control alt entf kann man skippen ja aber aber nicht abernicht hier drin oder wie sendet man überhaupt control alt entf ich mache stream aus dannspiele ich mich kurz am abend da mache ich dann später stream wieder an was gibt es zuessen so hollandaise mit kartoffel und spargel und schinken so weiter jetzt müssen wir erstmalfor ever tools installieren edge ja ich dich man k.s. weg typical install so ok also wieist das ding jetzt win get win get kann man ausprobieren ok die windows vm höbe ich mirmal auf wir brauchen immer mal eine windows vm und zum sachen ausprobieren ok epilepsiewarnung es ist nicht mal standard chrome edge stimmt es ist es ist alter alter richtig echteredge was ziemlich bescheuert ist dass es noch die fault ist weil der wird auch gar keinerichtigen security updates mehr kriegen machen snapshot sehr gut excellent der chat heutewieder massive so also die erste amtshandlung was man mit edge macht wissen wir ja alleoder oder oder alternativ auch oder alternativ auch firefox oder opera gaming ja wie oftsoll ich das noch machen except run ach nee moment es ist schon da ja den brechen wirjetzt ab als läuft ja schon ok also win get müssen wir installieren yes ach nee wir habenes doch schon ja ja ok was auch immer also github wie ist das win get win get cli okrelease das da brauche wir ja das hier ist das übrigens der uv dieser komische uvp installerglaube ich und die sache ist halt die du brauchst halt ein kurz ein zertifikat dafür das istdas was mich vorhin auch so genervt hat dass es immer noch microsoft nicht auf die reihegekriegt hataha ok schön dass hier die hälfte wieder installiert wird so was ja ja ok und und undjetzt wie geht das jetzt win get ah cool ok also was kann man jetzt machen win get searchok also was haben wir da win get search gibt es auch so was wie list alles anzeigen needas wäre zu das geht ja nett naja das ist ja das nette drinne search also was searchenwir mal firefox oh und visual studio code ist auch am start vim sogar vim ist da okprobieren wir install und dann muss man wahrscheinlich mal visual studio code weil microsoft gernesachen mit lehrzeichen macht der kann keine dependencies das heißt der installiert einfachimmer alles oder was ja gut kann ich mit leben nice endlich mal was gescheites von microsofthier so probieren wir noch was anderes aus was haben wir noch search firefox mal guckenwin get install firefox gibt es hier schon was ah please refine the input muss ich dannsagen minus version vielleicht so was oder die id vielleicht die id oh das ist einegute id firefox add das wäre eine coole syntax wenn die funktionieren würde ok kannman sowas hier machen help install nee ähm weder kommandozeilen bedienung des todes sovielleicht nee ok da gehts schon los install ah komm mal da hinten steht doch was kannman kann man krepp ane ist ja windows crack weh feinst ist es unter windows ne für installationfirefox win get install minus minus id oh jetzt wirds big brain time was und dann minusv ok das ist ähm komplizierter als ich gedacht habschein wieder deutlich komplizierter zu sein als man so erwarten mag ah ok okahja also kann man den version angeben ok firefox 57.0 meine fresse microsoft kriegtja überhaupt irgendwas hinals minus e was ist denn minus e exakt ok ok ah big brain moment root warum brauchich root um firefox zu installieren ok jetzt ist die nächste frage kann man auchwieder deinstallieren remove nee äh was ist uninstall wie lösche ich denn was uninstallmuss doch gehen bin get remove was was ah microsoftoh das tut ja weh warum ich hab grad echt mein kopf gegen so ein plastikding geklopptäh warum macht man paket manager der kein uninstall support hatoh mein güt microsoft was ist denn mit euch los was ist denn losfeature request uninstall feature request für ein paket manager wo du einen featurerequest aufmachen musst dass er sachen entfernen kann ist kein paket manageralso ich muss mal ich muss meinen kopf noch ein bisschen gegen das plastik schlagenmicrosoft ich weiß ich weiß echt nicht was mit euch los ist ist doch nicht gedacht benutztzu werden nur eine preview ja ernsthaft das erste was ich in paket manager einbau istinstall remove search ich kann auch keine preview variante von was rausbringen was dasist das kann man nicht mal unfertig nennen was was nicht mal angefangen wurde zu programmierenda stand eine begründung ich kann echt okay im moment hallo windows komm an brah ich darfes nicht mehr starten es ist broken es ist kaputt oh jetzt jetzt gehts wow oh haben wirdas jetzt okay okay ich starte ich starte es noch mal ich starte es noch mal okay okaydie begründung die begründung muss was haben ja ja ja dafür ist ein paket manager dawie aber kann schokolade hier nicht deinstallieren das wäre auch übelst fail heilig sieben monatexcellent subscription moment moment ich kann aber doch jetzt auch hier hingehen und sagenremove remove firefox warum kann man das da das kamen wenn ich das von hand über einewindows funktion machen kann dann kann ich das doch auch machen über eine komando zeileoder nicht und ganz ehrlich dann muss das microsoft da muss das microsoft forcierendann müsste ich sagen ja okay damit ihr in unser offizielles repo reinkommt braucht ihrein uninstall switch der funktioniert ganz einfach und wer sich nicht dran hält kommtnicht in das offizielle repo rein dementsprechend müssen sie das aber auch als die beste lösungzum software installieren pushen weil ansonsten sagen alle wieder hersteller scheiß uns nochdrauf was microsoft macht gestern was schreibt real relax schreibt gestern wurde bei unsin der online vorlesung github als facebook der informatiker bezeichnet ja das ist genausowie sie alle spiele die schwer sind sagen sie das ist das dark souls der jump and runsund sowas es gibt so ein paar dämliche sprüche also es gibt hier garantiert aber das istnever going to happen okay mal ich muss es dauernden ich muss es dauernden ich braucheich brauche wir brauchen auf github github brauche ich ein cacw emote so ich habe gewartetja das ist von mir wo blows reacted mit confused ja genau scoop kann das ja auch ich kann jaüber über den sort party package kann das ja auch das ist das ist basic basic functionalitywhich is perfect ja ja natürlich eindeutig ohne den remove was ist ein package managerohne remove an ich muss essen das essen fertig krieg gerade schon nachrichten geschicktdas ist fail ist das fail ich ich bin heute ist echt ein stream ohne scheiß ich bin megaenttäuscht von dem ganzen shit von microsoft erstens win ui komplett unusable useless crapmit dem ganzen uwp und code signing zertifikat restriktion sie es immer noch gibt und microsoftgehört github doch doch und jetzt kann der offizielle paket manager eine sache wo ichseit 100 jahren schon sage dass microsoft sowas mal für windows machen müsste kannich mal pakete remove was ein schwachsinn okay leute dankeschön dass ihr dabei gewesenseid gibt es irgendjemand den wir raiden können ich bin in wahrscheinlich später in einerhalben stunde stunde oder so bin ich wieder on und wir machen dann wie es ist wir streamenwortel und auldwins heute auldwins auldwins sonst sonst nix ne gibt keinen den man hostenkann so wirklich den ich kenne der es auch bräuchte ne okay leute also wir sehen unsecht enttäuschende enttäuschende microsoft stream bis später machs gut", "segments": [{"id": 1, "start": 30.0, "end": 32.0, "text": "Das war's für heute."}, {"id": 2, "start": 32.0, "end": 34.0, "text": "Bis zum nächsten Mal."}, {"id": 3, "start": 34.0, "end": 61.0, "text": "Das war's für heute."}, {"id": 4, "start": 61.0, "end": 63.0, "text": "Das war's für heute."}, {"id": 5, "start": 63.0, "end": 90.0, "text": "Das war's für heute."}, {"id": 6, "start": 90.0, "end": 115.0, "text": "Das war's für heute."}, {"id": 7, "start": 115.0, "end": 117.0, "text": "Das war's für heute."}, {"id": 8, "start": 117.0, "end": 122.84, "text": "Microsoft, please. Mal gucken, ob uns Microsoft wieder enttäuscht, weil wir"}, {"id": 9, "start": 122.84, "end": 128.52, "text": "probieren heute WinUI 3.0 aus. Das kam vorgestern raus, erst im Review, da warte"}, {"id": 10, "start": 128.52, "end": 134.52, "text": "ich ja schon seit der Ankündigung drauf, weil es die erste gescheite Sache seit"}, {"id": 11, "start": 134.52, "end": 139.8, "text": "15 Jahren ist, die Microsoft für Desktop-Anwendungen rausgebracht hat oder"}, {"id": 12, "start": 139.8, "end": 145.44, "text": "rausbringen wird oder denkt, rauszubringen, was auch immer. Aber ich muss erst mal"}, {"id": 13, "start": 145.44, "end": 148.32, "text": "mal Streaming-Recher noch anmachen, also den zweiten, wo ich dann Vorschau habe"}, {"id": 14, "start": 148.32, "end": 154.64, "text": "und alles. Deswegen seht ihr euch jetzt hier selbst im Chat. Ja, und zwar das hier,"}, {"id": 15, "start": 154.64, "end": 162.84, "text": "guckt mal, WinUI 3.0, Review, Bre-View heißt ja Bre-View. Wir sind ja hier bekannt"}, {"id": 16, "start": 162.84, "end": 170.92, "text": "dafür, dass wir besonders exzellent exquisit korrekt immer alles auf"}, {"id": 17, "start": 170.92, "end": 181.72, "text": "Englisch aussprechen. So, Vorschau läuft. Vorschau läuft, wenn wir den ganzen Crap hier"}, {"id": 18, "start": 181.72, "end": 185.84, "text": "ausmachen. Leute, ich muss mir gleich noch ein neues T-Shirt anziehen, ich komme"}, {"id": 19, "start": 185.84, "end": 190.52, "text": "gerade von draußen, ich war hier, stellt euch mal vor, stellt euch das mal vor, ich"}, {"id": 20, "start": 190.52, "end": 197.16, "text": "war im Wald. Guckt euch das mal an. Das ist mal richtig"}, {"id": 21, "start": 197.16, "end": 203.12, "text": "MonkaS. Guckt euch das mal an."}, {"id": 22, "start": 205.12, "end": 219.68, "text": "Ja, in der Sonne. Ja, Monarch, richtig, Monarch S. Das ist das beste E-Mode dafür. Alle"}, {"id": 23, "start": 219.68, "end": 231.4, "text": "einmal Monarch S. Das habe ich doch gar nicht drinne. Monarch S, das brauchen wir"}, {"id": 24, "start": 231.4, "end": 238.76, "text": "noch. Monarch S und zwar Transparent. Das haben wir nicht. Ah, Monarch S Transparent,"}, {"id": 25, "start": 238.76, "end": 252.08, "text": "exzellent. Gibt es das vielleicht auch in groß? Ah, meinetwegen, Safe Image. Monarch S, das"}, {"id": 26, "start": 252.08, "end": 255.72, "text": "brauchen wir noch, ganz, ganz wichtig."}, {"id": 27, "start": 257.88, "end": 266.68, "text": "Monarch S, all das ist ein scheiß aufgelöstes GIF, äh, JIF, JPEG, JPG, was auch"}, {"id": 28, "start": 266.68, "end": 275.8, "text": "immer. Google suche Dark Mode, keine Ahnung, das ist hier der Dark, der Dark Reader, aber"}, {"id": 29, "start": 275.8, "end": 279.44, "text": "es gab irgendwie auch die Möglichkeit, glaube ich, mittlerweile, Chrome Native irgendwie"}, {"id": 30, "start": 279.44, "end": 283.32, "text": "auf Dark Mode zu schalten. Zumindest, was wir uns heute angucken, ist das hier, guckt"}, {"id": 31, "start": 283.32, "end": 291.6, "text": "mal hier, exzellent. Poggers, Five Head. Ähm, Leute, hat jemand von euch mal versucht,"}, {"id": 32, "start": 291.6, "end": 297.48, "text": "ihr Bild, Bild 2020, Webcast, sich anzugucken. Ich bin dafür zu dumm, ich kriege das nicht"}, {"id": 33, "start": 297.48, "end": 301.92, "text": "gebacken. Wenn man sich das hier anguckt und sagt, hier Sessions, Session Catalog, da gibt"}, {"id": 34, "start": 301.92, "end": 310.8, "text": "es nämlich den Talk von einer halben Stunde zum neuen WinUI und, ähm, ah, das da? Oh,"}, {"id": 35, "start": 310.8, "end": 320.48, "text": "wo ist der Talk? Der war doch schon. Wo ist er? Warum soll ich mich registrieren? Verstehe"}, {"id": 36, "start": 320.48, "end": 334.4, "text": "ich nicht. Das, das kapier ich nicht. Nee, nee, nee, Adplog, glaube ich nicht. Nö."}, {"id": 37, "start": 334.4, "end": 340.36, "text": "Der Talk war schon, ich bin da einfach zu small brain für. Daddy Khan zwei Monate,"}, {"id": 38, "start": 340.36, "end": 347.64, "text": "vier Monate? Nee, Moment. Monarch S. Vier Monate und zwei Monate in Folge. Ah, exzellent,"}, {"id": 39, "start": 347.64, "end": 366.08, "text": "exzellent. Kein echter Gamer. Ja, ist so. Aber im Prinzip ziemlich, ähm, so Leute, ähm,"}, {"id": 40, "start": 366.08, "end": 369.96, "text": "wir müssen jetzt jetzt, wow, wow, wow, wow, wow, hier, hier stimmt, äh, hier stimmt der"}, {"id": 41, "start": 369.96, "end": 384.8, "text": "Dark Mode aber mal gar nicht an. What the fuck? Das sieht überhaupt, okay. Was auch immer."}, {"id": 42, "start": 384.8, "end": 394.28, "text": "Oh, okay. Äh, also. Ah gut, warum nicht, machen wir da. Aber das Ding, das Ding kann"}, {"id": 43, "start": 394.28, "end": 398.4, "text": "man in Dark Mode stellen. Die Microsoft-Seite kann man, ich weiß, dass das geht. Ich hab"}, {"id": 44, "start": 398.4, "end": 402.12, "text": "die nämlich bei mir auf dem Desktop auch im Dark Mode. Man kann die Microsoft-Hilfe-Seite"}, {"id": 45, "start": 402.12, "end": 409.96, "text": "irgendwie in Dark Mode stellen. Wo war das nochmal? Irgendwo ging, das ging, das ging,"}, {"id": 46, "start": 409.96, "end": 420.08, "text": "ich weiß, dass das ging. Ja, hier, theme. Dark, exzellent. So, und das probier mal aus,"}, {"id": 47, "start": 420.08, "end": 424.36, "text": "Leute. Ähm, ich muss ja aber kurz mal schnell ein neues T-Shirt anziehen, weil ich bin"}, {"id": 48, "start": 424.36, "end": 429.12, "text": "noch etwas, äh, Monarch-S. Gleich wieder am Start."}, {"id": 49, "start": 514.36, "end": 529.16, "text": "So, wieder am Start. So Leute, und wenn wir hier fertig sind, so in zwei Stunden oder"}, {"id": 50, "start": 529.16, "end": 536.52, "text": "so, mal gucken, so 13 Uhr rum, oder vielleicht 13.3, mal gucken, wann es losgeht, ähm,"}, {"id": 51, "start": 536.52, "end": 547.88, "text": "dann, ähm, und uns mit danach ist, dann machen wir Warzone-Stream Only-Only-Wins. Heute wird"}, {"id": 52, "start": 547.88, "end": 552.08, "text": "nur gewonnen. Hast du schon die neuen Features von C-Shop 9 angesehen? Wir haben uns ein"}, {"id": 53, "start": 552.08, "end": 557.04, "text": "paar Previews angeguckt, ja. Ähm, mir ist aber jetzt nix so richtig, eine Sache fand"}, {"id": 54, "start": 557.04, "end": 563.64, "text": "ich richtig cool, aber ich komm grad nicht mehr drauf, was das war. Eins fand ich mega"}, {"id": 55, "start": 563.64, "end": 575.08, "text": "praktisch. Was war das denn noch mal? Ähm, was war das denn hier noch mal? Das da war"}, {"id": 56, "start": 575.08, "end": 587.56, "text": "es nicht. Das war es, glaub ich, auch nicht. Equality. Das war ganz nice, aber es gab"}, {"id": 57, "start": 587.56, "end": 596.88, "text": "doch noch was anderes. Das war auch ganz cool. Parameter-Null-Checking. Ja, das war cool,"}, {"id": 58, "start": 596.88, "end": 601.2, "text": "aber das war klar, dass so was in der Richtung kommt. Lambda-Discords fand ich sehr praktisch,"}, {"id": 59, "start": 601.2, "end": 607.64, "text": "dass es jetzt endlich offiziell drin ist. Ähm, was war das denn? Irgendwas anderes"}, {"id": 60, "start": 607.64, "end": 617.84, "text": "fand ich ultra praktisch, aber ich hab vergessen was. Ja. Init-Only-Properties, ok, das ist"}, {"id": 61, "start": 617.84, "end": 627.28, "text": "ganz nett. Aber ist das schon Final? Oder sind das noch, ähm, wie heißt es, so RFC-mäßig?"}, {"id": 62, "start": 627.28, "end": 655.08, "text": "Oder ist das schon Final? Ahm, ähm, Records? Propositional? Hm. Wow! Wow, ok, ok, ok, ok,"}, {"id": 63, "start": 655.08, "end": 662.64, "text": "wow, ok. Das ist eigentlich ganz cool. Das ist dann eher so Richtung Go sieht das aus"}, {"id": 64, "start": 662.64, "end": 668.2, "text": "fast schon. Nee, nee, nee, nee, nee, nee. Go braucht ja auch eine Main-Function. Hier,"}, {"id": 65, "start": 668.2, "end": 677.0, "text": "das ist cool, das ist cool. Improved-Pattern-Matching ist cool. Ähm, das ist sehr, das ist sehr"}, {"id": 66, "start": 677.0, "end": 685.08, "text": "nice, dass man jetzt quasi das abkürzen kann und sich das New-Point sparen kann. Ähm,"}, {"id": 67, "start": 685.08, "end": 692.64, "text": "hier müssen wir uns echt mal im Detail angucken. Alter, Wald. So, ähm, also was brauchen wir"}, {"id": 68, "start": 692.64, "end": 696.08, "text": "denn dafür, dass wir den Kram ausprobieren können? Das ist mal zur Erklärung was das"}, {"id": 69, "start": 696.08, "end": 702.72, "text": "Ganze ist. Ähm, ich verstehe gar nicht warum das nicht mehr Hype auslöst. Das Ding ist"}, {"id": 70, "start": 702.72, "end": 712.44, "text": "seit 15 Jahren das erste UI, neue UI für Windows, was man verwenden kann richtig. Das"}, {"id": 71, "start": 712.44, "end": 718.6, "text": "letzte UI was man sinnvoll verwenden kann war WPF. Danach kam WinRT, UWP, haste nicht"}, {"id": 72, "start": 718.6, "end": 722.72, "text": "gesehen, geschiss. Das konnte man nicht richtig verwenden. Das Problem, um das nochmal kurz"}, {"id": 73, "start": 722.72, "end": 730.72, "text": "zu recapen, ähm, was das Problem an UWP ist, äh, der neue Package Manager für Windows,"}, {"id": 74, "start": 730.72, "end": 736.16, "text": "den schreibe ich mir mal auf, den wollte ich mir auch nochmal angucken, genau. Stream-Idee"}, {"id": 75, "start": 736.16, "end": 744.04, "text": "hatten wir doch hier irgendwo so eine, so, also, ähm, äh, Windows Package Manager, äh,"}, {"id": 76, "start": 744.04, "end": 749.6, "text": "9.0, C Sharp 9.0. Genau, um nochmal kurz zu erklären was das Problem an der ganzen Geschichte"}, {"id": 77, "start": 749.6, "end": 756.96, "text": "war, warum Windows UI so gesagt hat und warum, warum die meisten Windows-Software heute keine"}, {"id": 78, "start": 756.96, "end": 761.16, "text": "richtige Windows-Software ist, sondern eher so eine Mischung aus entweder Electron, also"}, {"id": 79, "start": 761.16, "end": 766.32, "text": "in Browser oder Qt oder sonst was. Das liegt daran, das letzte, ich glaube 2006 hat Microsoft"}, {"id": 80, "start": 766.32, "end": 774.0, "text": "UWP rausgebracht und danach kam nix mehr. Nach UWP kam WinRT und UWP und Crap. Und das"}, {"id": 81, "start": 774.0, "end": 783.28, "text": "Problem an UWP war, ähm, dass du heute eigentlich immer noch nicht UWP richtig verwenden kannst."}, {"id": 82, "start": 783.28, "end": 788.92, "text": "Also meistens, UWP und WinRT ist so ein zusammenhängendes Ding, also sprich, jedes Programm"}, {"id": 83, "start": 788.92, "end": 795.0, "text": "was du machst hat, hat ne Sandbox drum herum. Was schonmal scheiße ist, ja. Es gibt Möglichkeiten,"}, {"id": 84, "start": 795.0, "end": 799.36, "text": "dass man das quasi sich rappt, da braucht man quasi, muss man den Prozess starten, der"}, {"id": 85, "start": 799.36, "end": 804.72, "text": "dann auf alles zugreifen kann und so, mega wirkt. Und das hauptsächlich Problem an UWP-Anwendung"}, {"id": 86, "start": 804.72, "end": 810.56, "text": "ist die, die Verteilung von den Anwendungen. Also sprich, man hat die eine Möglichkeit,"}, {"id": 87, "start": 810.56, "end": 818.52, "text": "das hier über den Microsoft Store zu machen, aber das ist ja nur wirklich, was anderes"}, {"id": 88, "start": 818.52, "end": 823.16, "text": "fällt mir zum Microsoft Store nicht mehr ein. Also niemand möchte wirklich auf den Microsoft"}, {"id": 89, "start": 823.16, "end": 828.2, "text": "Store angewiesen sein. Und das ist die eine Möglichkeit, UWP-Anwendungen zu verteilen."}, {"id": 90, "start": 828.2, "end": 833.4, "text": "Die andere Möglichkeit ist, UWP-Anwendungen über den eigenen Installer zu verteilen."}, {"id": 91, "start": 833.4, "end": 839.56, "text": "Das ist ja kein Ding, da sind ja die Windows Leute dran gewöhnt. Windows Leute mögen"}, {"id": 92, "start": 839.56, "end": 846.76, "text": "ja Installer, Setup, Exe und sonst was. So, das Problem ist jetzt, du brauchst ein Codesigning-Zertifikat"}, {"id": 93, "start": 846.76, "end": 853.14, "text": "um UWP-Anwendungen beziehungsweise um die selbst verteilen zu können. Und niemand, der einfach"}, {"id": 94, "start": 853.14, "end": 856.68, "text": "mal so Anwendungen entwickelt und nicht gerade in irgendeiner größeren Firma arbeitet,"}, {"id": 95, "start": 856.68, "end": 860.64, "text": "die die Anwendung entwickelt, kauft sich ein Codesigning-Zertifikat. Das kostet 300 Euro"}, {"id": 96, "start": 860.64, "end": 865.24, "text": "im Jahr über den Daumen gepeilt und nur das dafür, dass ich dann Windows-Anwendungen machen"}, {"id": 97, "start": 865.24, "end": 869.24, "text": "kann. Es hat noch ein paar andere Probleme, aber voll für den Arsch. So, und was Microsoft"}, {"id": 98, "start": 869.24, "end": 874.68, "text": "mit WinUI 3 macht, ist endlich seit 15 Jahren. Ohne Scheiße. Die letzten 15 Jahre war Microsoft"}, {"id": 99, "start": 874.68, "end": 882.24, "text": "so. Mit WinUI 3 ist Microsoft hoffentlich wieder so. Die haben ihre GUI-Geschichte von"}, {"id": 100, "start": 882.24, "end": 889.72, "text": "UWP genommen. Also das da ist zum Beispiel eine UWP-Anwendung. Ist jetzt ein scheiß"}, {"id": 101, "start": 889.72, "end": 895.04, "text": "Beispiel, weil der Taschenrechner ist abartig hässlich. Wir können uns auch mal den Kalender"}, {"id": 102, "start": 895.04, "end": 899.28, "text": "angucken. Das ist auch eine UWP-Anwendung, die sieht ein bisschen schöner aus. Also"}, {"id": 103, "start": 899.28, "end": 904.68, "text": "die haben ihre GUI-Geschichte genommen und haben gesagt, okay, wir erlauben jetzt auch"}, {"id": 104, "start": 904.68, "end": 910.96, "text": "ganz normale Windows-Anwendungen mit dieser Oberfläche. So, und das ist im Endeffekt,"}, {"id": 105, "start": 910.96, "end": 917.64, "text": "was hinter WinUI 3.0 steckt. So, jetzt müssen wir nur noch gucken, wie man den Kram installiert"}, {"id": 106, "start": 917.64, "end": 925.12, "text": "kriegt. Getting started. Wahrscheinlich müssen wir jetzt erst das halbe Internet installieren,"}, {"id": 107, "start": 925.12, "end": 930.72, "text": "weil es Microsoft ist. Also was brauchen wir? To use WinUI 4 Desktop Project. Make sure"}, {"id": 108, "start": 930.72, "end": 939.48, "text": "that you have Windows Version 13 Pro... Haben wir bestimmt, oder? Wo sieht man das überhaupt,"}, {"id": 109, "start": 939.48, "end": 946.4, "text": "was für eine Windows-Version man hat? WinFair, CMD. War das da WinFair? Excellent, haben"}, {"id": 110, "start": 946.4, "end": 959.4, "text": "wir. Das haben wir schon mal. Oh, okay. Soll ich noch ein Wishl Studio... Sind die das"}, {"id": 111, "start": 959.4, "end": 966.32, "text": "Wahnsinns? Ich hab Wishl Studio 17 drauf. 17 können wir mal remove. 17 können wir mal"}, {"id": 112, "start": 966.32, "end": 979.4, "text": "remove. 17, remove, remove. Piss dich alle. 17 können wir mal. Wobei... Ah, ich hab genug"}, {"id": 113, "start": 979.4, "end": 988.48, "text": "Platz für einen Dritter, easy. Okay, ähm... Nee, Moment, was? Install Wishl Studio 16.7"}, {"id": 114, "start": 988.48, "end": 997.76, "text": "Brifue 1. See? Wishl Studio Brifue muss ich installieren, okay? Community. Alles klar."}, {"id": 115, "start": 997.76, "end": 1005.76, "text": "Das geht relativ schnell, nachdem sich Vodafone jetzt ja eingekriegt hat. Piss dich alle!"}, {"id": 116, "start": 1005.76, "end": 1015.12, "text": "Äh, wie ist Community? 1, 2, 3, 4, 5, 6. Excellent Passwort. Wishl Studio Installer..."}, {"id": 117, "start": 1015.12, "end": 1037.64, "text": "Ja. Nicht Community. So, also das, was wir installieren. Ähm, dann brauchen wir... Was?"}, {"id": 118, "start": 1037.64, "end": 1045.64, "text": "Man muss.NET 5, Brifue 4, 32-Bit und 64-Bit installieren, okay? Ah, yes, excellent. Machen"}, {"id": 119, "start": 1045.64, "end": 1052.04, "text": "wir, machen wir alles. Ähm,.NET Desktop Development, UWP Development, wir installieren mal den..."}, {"id": 120, "start": 1052.04, "end": 1058.44, "text": "Oh, 14 Gigabyte, was ist da los? So ein Verarsch, ey. Was für ein Workload müssen wir installieren?"}, {"id": 121, "start": 1058.44, "end": 1065.72, "text": "Okay,.NET Desktop Development müssen wir auf jeden Fall installieren. Ich glaub, UWP"}, {"id": 122, "start": 1065.72, "end": 1070.44, "text": "können wir, können wir uns... Blend brauchen wir nicht. Entity Framework Tools brauchen"}, {"id": 123, "start": 1070.44, "end": 1077.88, "text": "wir auch nicht. Profiler, Just-In-Time-Debugger. Was brauchen da auf einmal so viel Speicherplatz?"}, {"id": 124, "start": 1077.88, "end": 1086.08, "text": "Eben war es, eben, eben war es doch noch angeblich 14, 14G. Hä? Habt, wo, wo ist das jetzt so"}, {"id": 125, "start": 1086.08, "end": 1098.24, "text": "vor einmal hin? Hä? Hä? What the fuck? Ist die Größenberechnung im Arsch oder so? Kann"}, {"id": 126, "start": 1098.24, "end": 1108.16, "text": "das sein? Ah, Blend brauchen wir nicht. Install while downloading. Ah, install, gut, geht"}, {"id": 127, "start": 1108.16, "end": 1114.4, "text": "ja schnell. Max, bist du bereits geleakt? Ich bin schon 20.000 Mal geleakt. Ich bin"}, {"id": 128, "start": 1114.4, "end": 1119.24, "text": "in der Suppe geleakt, ich bin im Fernseher geleakt, ich bin in der Verpackung geleakt,"}, {"id": 129, "start": 1119.24, "end": 1131.92, "text": "ich bin überall geleakt. Okay. PopOS hat mir nicht gefallen. Haben wir im Stream ausprobiert."}, {"id": 130, "start": 1131.92, "end": 1141.48, "text": "So, also den müssen wir installieren. BrickView 1. Ich hau mir jetzt einfach mal die ganzen"}, {"id": 131, "start": 1141.48, "end": 1146.84, "text": "Crap drauf. Oh Leute, kann das sein, dass die, dass ihr nix seht? Kann das sein, dass"}, {"id": 132, "start": 1146.84, "end": 1159.36, "text": "ihr nix seht? Nee, oder? Ihr seht was? Ja, meine Vorschau, meine Vorschau spackt gerade"}, {"id": 133, "start": 1159.36, "end": 1172.36, "text": "richtig rum. Die ist, meine Vorschau ist hier. Monarch S. Ich glaube ich weiß woran das liegt."}, {"id": 134, "start": 1172.36, "end": 1176.12, "text": "Windows hat bestimmt mal wieder die Soundsettings umgestellt. Das macht Windows nämlich gerne."}, {"id": 135, "start": 1176.12, "end": 1191.76, "text": "Ja, okay, geht. Nein, geht nicht. Okay, also anscheinend sind die Soundsettings doch richtig."}, {"id": 136, "start": 1191.76, "end": 1206.16, "text": "Woher kommt das? Ja, das ist neu. Okay. Während der Kram installiert. Close. Jetzt müssen"}, {"id": 137, "start": 1206.16, "end": 1209.08, "text": "wir das noch installieren. Wir haben wahrscheinlich jetzt erstmal 40 MB Microsoft Crap drauf"}, {"id": 138, "start": 1209.08, "end": 1220.0, "text": "installiert. Install. Und nebenbei nicht vergessen mal die OBS-Stats aufzumachen, dass nix"}, {"id": 139, "start": 1220.0, "end": 1229.44, "text": "abkackt. Seit ich VoiceMeter verwende, forscht mir Windows nicht mehr rein, okay. Jetzt hatte"}, {"id": 140, "start": 1229.44, "end": 1234.48, "text": "ich auch mal eine ganze Weile drauf, vielleicht soll ich das wieder installieren. VoiceMetors."}, {"id": 141, "start": 1234.48, "end": 1239.8, "text": "Okay, das ist auch klar installiert. Das haben wir auch erzählt. Also, Visual Studio haben"}, {"id": 142, "start": 1239.8, "end": 1245.76, "text": "wir drauf..NET Core 5. Briefview haben wir. Oh, das heißt ja nicht mal Core. Sorry Leute."}, {"id": 143, "start": 1245.76, "end": 1253.56, "text": ".NET 5. Die wollen ja die Leute verwirren. Also, nur mal zur Erklärung..NET 5 ist eigentlich"}, {"id": 144, "start": 1253.56, "end": 1260.28, "text": ".NET Core 5, beziehungsweise eigentlich.NET Core 4. Sie haben es jetzt allerdings das Core"}, {"id": 145, "start": 1260.28, "end": 1268.4, "text": "gestrichen.NET 5 genannt. Und nicht zu verwechseln mit dem.NET Framework 4.8. Man könnte ja"}, {"id": 146, "start": 1268.4, "end": 1276.08, "text": "denken, dass.NET 5 der Nachfolger des.NET Framework 4.8 ist. Aber das stimmt nicht..NET"}, {"id": 147, "start": 1276.08, "end": 1283.44, "text": "5 ist eigentlich.NET Core 4 und hat mit.NET Framework 4.8 nichts zu tun. Exzellent Microsoft"}, {"id": 148, "start": 1283.44, "end": 1291.6, "text": "Logik. Beste. Microsoft Benahmung, die haben es drauf. Was will er machen? Ich will WinUI"}, {"id": 149, "start": 1291.6, "end": 1298.68, "text": "3 ausprobieren. Okay, ich glaube, wir haben noch nicht alles installiert. So, bla, bla,"}, {"id": 150, "start": 1298.68, "end": 1310.4, "text": "bla, bla, bla, bla, bla. Download WinUI Briefview 1 Physics. Ah, das ist eine Visual Studio"}, {"id": 151, "start": 1310.4, "end": 1315.44, "text": "Extension. Ah, schon eine ganze Bewertung. Wir sehen ja Absolut Bleeding Edge heute dabei."}, {"id": 152, "start": 1315.44, "end": 1325.84, "text": "Und was kann WinUI? WinUI ist quasi die GUI-Technologie, die unter den ganzen neuen Windows-Anwendungen"}, {"id": 153, "start": 1325.84, "end": 1331.44, "text": "drunter steckt, mit dem großen Unterschied, dass man keine UVP-Anwendung mehr machen muss,"}, {"id": 154, "start": 1331.44, "end": 1335.64, "text": "sondern so eine ganz normale Win32-Anwendung machen kann und dementsprechend darauf das"}, {"id": 155, "start": 1335.64, "end": 1339.44, "text": "komplette System zugreifen kann. Also ich habe mir überlegt, was wir heute ausprobieren"}, {"id": 156, "start": 1339.44, "end": 1345.44, "text": "ist. Wir gucken, ob wir Files auflisten können. Das ist da quasi Absolut Noob-Style. Dann"}, {"id": 157, "start": 1345.44, "end": 1351.64, "text": "gucken wir, ob wir einen GIF abgespielt bekommen, weil ich habe die Hoffnung, dass ich damit"}, {"id": 158, "start": 1351.64, "end": 1361.32, "text": "eine besseres GIF-Wiedergabe hinbekomme als mit meiner UVP-Anwendung. Und als letztes"}, {"id": 159, "start": 1361.32, "end": 1367.76, "text": "probieren wir dann auch Screenshots anzeigen. Also quasi Desktop-Capture. Desktop-Capture"}, {"id": 160, "start": 1367.76, "end": 1382.04, "text": "mit und dann in den Fenster rein. Mal gucken. So. Physics Installer. Exzellent. Und für"}, {"id": 161, "start": 1382.04, "end": 1389.2, "text": "welches Visual Studio installiert er das jetzt? Das wird in C-Sharp gebastelt. Visual Studio"}, {"id": 162, "start": 1389.2, "end": 1395.52, "text": "Preview. Exzellent. Perfekt. Ja in F-Sharp kannst du das auch machen, aber da sitzen"}, {"id": 163, "start": 1395.52, "end": 1409.6, "text": "wir morgen noch. Hast du morgen frei? Ja. Was installiert der dann da für 30 Milliarden"}, {"id": 164, "start": 1409.6, "end": 1425.8, "text": "Sachen? Aber. 20 MB Download und erstmal eine halbe Stunde installieren. Ach nee, der installiert"}, {"id": 165, "start": 1425.8, "end": 1432.08, "text": "die UVP-Geschichte. Was auch immer. Microsoft, mach einfach. Mach einfach. Vollkommen. Wie"}, {"id": 166, "start": 1432.08, "end": 1439.64, "text": "viel Festplattenplatz habe ich denn eigentlich noch? Ah, 53G. Das soll... Moment. Ich hatte"}, {"id": 167, "start": 1439.64, "end": 1451.2, "text": "80 davor. Hat das wirklich 30 GB gefressen gerade? Sehe ich das richtig? What the fuck?"}, {"id": 168, "start": 1451.2, "end": 1455.24, "text": "Was haben die mir denn da draufgehauen? Ist da schon die nächste Win-House-Version mit"}, {"id": 169, "start": 1455.24, "end": 1470.24, "text": "vorinstalliert? Genau, wie in Modern Warfare Update. Keg Triple U. Also wenn das Keg W"}, {"id": 170, "start": 1470.24, "end": 1485.24, "text": "ist, dann ist dann Keg Triple U ist dann... Oh, das war Payne's Champ-Witz, Alter. Monarch"}, {"id": 171, "start": 1485.24, "end": 1490.92, "text": "S. So, also jetzt haben wir das installiert. Ich glaube, das war es danach. Wenn der Kram"}, {"id": 172, "start": 1490.92, "end": 1506.44, "text": "durch ist, so in 20 Stunden, dann... Was installiert der da eigentlich alles? Leute, guckt euch"}, {"id": 173, "start": 1506.44, "end": 1522.0, "text": "mal den Verbraucher an. Es geht immer weiter runter. Gleich ist die Festplatte voll. Keg"}, {"id": 174, "start": 1522.0, "end": 1536.96, "text": "W. Das brauchen wir auch noch als Emote. Gibt's das transparent? Gibt's das transparent?"}, {"id": 175, "start": 1536.96, "end": 1565.0, "text": "Keg W. Nein, ich brauche Keg W als... Warum tauche ich unter Keg W auf? Okay. Okay,"}, {"id": 176, "start": 1565.0, "end": 1591.04, "text": "okay. Aha. Was ist denn das beste Keg W emote? Der da? Ne. Das ist übelste low quality emote."}, {"id": 177, "start": 1591.04, "end": 1598.08, "text": "Das müssen wir anderweitig. Ich brauche ein ordentliches, hochaufgelöstes Keg W. Wie"}, {"id": 178, "start": 1598.08, "end": 1606.44, "text": "sieht es denn aus mit Pause-Champ? Gibt's das ordentlich hochaufgelöst? Ah, exellent,"}, {"id": 179, "start": 1606.44, "end": 1613.4, "text": "das brauchen wir. Pause-Champ. In der Zeit, wo Visual Studio hier am installen... Ach,"}, {"id": 180, "start": 1613.4, "end": 1624.48, "text": "du Scheiße, was macht... 50,7... Was installiert mir das alles? Monkeys. Ich glaube, ich muss"}, {"id": 181, "start": 1624.48, "end": 1649.2, "text": "erst mal Festplattenplatz freigeben, klar. Pause. Was? Pause-Champ. Was? Oh, oh, es"}, {"id": 182, "start": 1649.2, "end": 1662.96, "text": "hat sich selbst aufgeräumt wieder. Ich habe gedacht, 80 Gigabyte reichen für eine Briefview,"}, {"id": 183, "start": 1662.96, "end": 1676.0, "text": "Leute. Ich weiß, das ist ziemlich blöd gewesen, aber ich habe gedacht, 80G sind genug. Haben"}, {"id": 184, "start": 1676.0, "end": 1685.56, "text": "sich eigentlich Leute bei dem Geschlechts-Tweet über Telekom beschwerten? Ne, ne. Wir beobachten"}, {"id": 185, "start": 1685.56, "end": 1699.32, "text": "dich Windows-Installer. Der Windows-Installer wird genau beobachtet. Was macht das Ding"}, {"id": 186, "start": 1699.32, "end": 1706.0, "text": "denn da? Das installiert mir glaube ich wirklich irgendwie... Vielleicht hätte ich das besser"}, {"id": 187, "start": 1706.0, "end": 1710.04, "text": "in einer VM machen sollen. Das installiert mir da wirklich 30 Millionen Sachen drauf."}, {"id": 188, "start": 1710.04, "end": 1731.16, "text": "Ich hoffe, man kann das ordentlich deinstallieren wieder. 50. Wir haben jetzt ziemlich genau"}, {"id": 189, "start": 1731.16, "end": 1736.88, "text": "30 Gigabyte verbraucht schon. Stimmt, wir haben keinen Pause-Champ drin. Warum haben"}, {"id": 190, "start": 1736.88, "end": 1749.44, "text": "wir das nicht? Das haben wir gleich, Leute. Franger-Faces-Z. E-Modes. Haben wir gleich,"}, {"id": 191, "start": 1749.44, "end": 1764.52, "text": "haben wir gleich, Leute. Gleich ist Pause-Champ drinnen. Pause-Champ. Oh, edit. Oh, ist"}, {"id": 192, "start": 1764.52, "end": 1770.52, "text": "das drinne, Leute. Kann sein, dass ihr Refreshen müsst. Es kann auch sein, dass es eine Weile"}, {"id": 193, "start": 1770.52, "end": 1776.68, "text": "dauert bis es gesyncht ist, aber ich habe es in FFZ eingefügt. Also Leute, die FFZ"}, {"id": 194, "start": 1776.68, "end": 1785.84, "text": "haben und den Chat Refreshen sollten es jetzt eigentlich gleich sehen. Pause-Champ. Ich"}, {"id": 195, "start": 1785.84, "end": 1790.84, "text": "hätte jetzt nicht gedacht, dass der da... Wir gucken mal mit dem Prozess-Explorer, was"}, {"id": 196, "start": 1790.84, "end": 1801.88, "text": "das Ding da macht. Nehradorn-Stufe 1 für 10 Monate. Exzellent. Exzellent-Subscription."}, {"id": 197, "start": 1801.88, "end": 1813.64, "text": "Na ja, so wirklich viel machen tut er nicht, ne? Na gut, während er installiert, habe ich"}, {"id": 198, "start": 1813.64, "end": 1819.16, "text": "mal eine andere Frage an euch, Chat. Das ist bestimmt so der typische Microsoft-Installer."}, {"id": 199, "start": 1819.16, "end": 1833.24, "text": "Der macht jetzt so und gleich... Ich habe eine andere Frage an euch. Und zwar, mein"}, {"id": 200, "start": 1833.24, "end": 1842.84, "text": "Mousepad ist übelst im Arsch. Also aktuell habe ich ja das da als Mousepad. Das Ding."}, {"id": 201, "start": 1842.84, "end": 1854.12, "text": "Ne, das... Was haben die denn alles für Mousepads? Hiro Plus, Taito, Kanga. Kanga ist... Hier,"}, {"id": 202, "start": 1854.12, "end": 1869.2, "text": "das da habe ich aktuell. Und eine G403. So, ich bin jetzt gerade am Überlegen. Ah, Chat-Big-Brain-Empfehlung"}, {"id": 203, "start": 1869.2, "end": 1893.28, "text": "sehe ich hier gerade. Was ist mit der Handballen-Auflage? Dies ist auch nicht schlecht, oder? Naja, zumindest..."}, {"id": 204, "start": 1893.28, "end": 1901.48, "text": "Was will das denn? Zumindest habe ich mir jetzt überlegt, ob ich von diesem Rocket Hero und"}, {"id": 205, "start": 1901.48, "end": 1920.0, "text": "der G403, ob ich nicht umsteigen soll auf eine G Pro Wireless. Also quasi... Leute, was ist"}, {"id": 206, "start": 1920.0, "end": 1945.48, "text": "da der Unterschied? Was ist da der Unterschied? Außer 10 Euro. Deutsches Mouse-Layout. Ich"}, {"id": 207, "start": 1945.48, "end": 1955.4, "text": "habe echt keine Ahnung, was der Unterschied zwischen den zwei Dingern ist. Ah, die eine"}, {"id": 208, "start": 1955.4, "end": 1972.16, "text": "ist nicht auf Lager. Und die andere schon. Ah, verstehe. Big-Brain. Okay, also ich überlege,"}, {"id": 209, "start": 1972.16, "end": 1979.36, "text": "ob ich mir das hier holen soll. Und ein... Wie heißt das andere? G903. Ne, ne. Äh, äh."}, {"id": 210, "start": 1979.36, "end": 1994.0, "text": "Wie heißt das? Wie heißt das Auflademaus-Pad nochmal? EU-Version bei einer Maus? Die deutsche"}, {"id": 211, "start": 1994.0, "end": 2014.76, "text": "Version ist breiter. Ne. Hä? Das ist eine Maus. Deutsches Maus-Layout. Ähm... Die Verpackung."}, {"id": 212, "start": 2014.76, "end": 2030.2, "text": "Achso. Ah, gut. Okay, als... Okay, wie hieß dieses Wireless-Charging-Ding nochmal? Charging-Maus-Pad."}, {"id": 213, "start": 2030.2, "end": 2038.56, "text": "Das da, genau. So, und ich habe mir überlegt, ob ich mir jetzt nicht die Kombi hier kaufe."}, {"id": 214, "start": 2038.56, "end": 2051.32, "text": "G-Bro? Bro? Und, äh, ein G-Powerplay. Wie groß ist das? Das ist nice, so. Okay, hast"}, {"id": 215, "start": 2051.32, "end": 2065.72, "text": "du das, Tribolon? Ähm... Wie groß ist denn das? 27x32. Das müsste ziemlich so groß sein"}, {"id": 216, "start": 2065.72, "end": 2073.88, "text": "wie das, was ich aktuell auch habe. Aktuell habe ich das hier. Das ist noch ein bisschen"}, {"id": 217, "start": 2073.88, "end": 2082.84, "text": "älter. Ähm, wie groß ist das? 35x25, ja. Ey, das ist ziemlich genauso groß wie mein"}, {"id": 218, "start": 2082.84, "end": 2094.16, "text": "aktuelles Maus-Pad, ne? 27x32. 35x5. Ich glaube, das sind einfach nur die Abmaße irgendwie"}, {"id": 219, "start": 2094.16, "end": 2103.68, "text": "anders. Wobei, das ist eher hoch als breit, kann das sein? Ist das eher hoch als breit?"}, {"id": 220, "start": 2103.68, "end": 2113.44, "text": "Auf der anderen Seite, man kann es ja drehen, wie man will. Man kann es ja drehen, wie man"}, {"id": 221, "start": 2113.44, "end": 2117.12, "text": "will. Es spricht doch eigentlich überhaupt nichts dagegen, wenn ich das hoch kann drehe."}, {"id": 222, "start": 2117.12, "end": 2128.76, "text": "Also sprich, wenn ich das hier am rechten Schreibtischrand nehme. Ich kann es ja drehen,"}, {"id": 223, "start": 2128.76, "end": 2135.32, "text": "wie ich lustig bin. Ich muss das ja nicht hochkant legen, ne? Also so wird es ja gegen"}, {"id": 224, "start": 2135.32, "end": 2139.04, "text": "die Richtung Monitor zeigen. Oh, wir sind fertig. Exzellent, wir haben es geschafft."}, {"id": 225, "start": 2139.04, "end": 2147.6, "text": "Das G ist gedreht. Ja, das juckt mich ehrlich gesagt überhaupt nicht. Jurok ruft die Polizei."}, {"id": 226, "start": 2147.6, "end": 2162.0, "text": "Da guckt einer, äh, Dings hier. Wie heißt er? Slap Like, wie heißt er? Davy, Davy 405?"}, {"id": 227, "start": 2162.0, "end": 2172.16, "text": "Der Bass, der Bass-Typ. Slap Like, der sagt auch immer I'm calling the police. Davy 504,"}, {"id": 228, "start": 2172.16, "end": 2179.04, "text": "genau, ja, so. Ok, wir sind fertig. Also wahrscheinlich hole ich mir die Kombi. Ich meine, ein bisschen"}, {"id": 229, "start": 2179.04, "end": 2183.6, "text": "größeres Mousepad wäre schon nicht schlecht. Da könnte ich meine Sensitivity vielleicht"}, {"id": 230, "start": 2183.6, "end": 2190.56, "text": "noch einen Ticken runterstellen. Aber die Kombi aus, ähm, Wireless und Wireless Charging"}, {"id": 231, "start": 2190.56, "end": 2196.12, "text": "ist irgendwie schon cool. Was nicht so cool ist, muss man auch ehrlich gesagt mal sagen,"}, {"id": 232, "start": 2196.12, "end": 2205.16, "text": "ich meine 240 Euro für ein Maus und ein Mauspad ist schon mal echt eine Hausnummer, ne? Muss"}, {"id": 233, "start": 2205.16, "end": 2210.16, "text": "man die oft aufladen? Ne, das Mauspad lädt ja auf. Deswegen ist es eigentlich wahrscheinlich"}, {"id": 234, "start": 2210.16, "end": 2215.8, "text": "ganz praktisch. Oder aber vielleicht lohnt es sich auch mit einem normalen Mauspad und"}, {"id": 235, "start": 2215.8, "end": 2222.4, "text": "wenn man die nur einmal alle drei Monate aufladen muss oder so, dann hm. Na gut, also wir haben"}, {"id": 236, "start": 2222.4, "end": 2230.72, "text": "alles installiert, dann gucken wir uns das ganze doch jetzt mal an. Ja Kio-kun, keine"}, {"id": 237, "start": 2230.72, "end": 2234.36, "text": "Ahnung ob sich das lohnt, das müssen wir erstmal gucken. Wofür gibst du denn sonst"}, {"id": 238, "start": 2234.36, "end": 2241.84, "text": "kein Geld aus? Ja gar nicht eigentlich. Die Logitech Mäuse sind viel zu schwer. Das andere"}, {"id": 239, "start": 2241.84, "end": 2251.24, "text": "was ich mir überlegt hab, ist das hier. Ähm, aber die musste die importieren, das ist auch"}, {"id": 240, "start": 2251.24, "end": 2262.16, "text": "für den Arsch. Äh, äh, wo gibts denn die Mäuse? Ach keine Ahnung. Die ist doch, die"}, {"id": 241, "start": 2262.16, "end": 2271.44, "text": "G Pro ist doch relativ leicht, oder? Guck mal. Was wiegt denn die? 80 Gramm, so. Ne G403,"}, {"id": 242, "start": 2271.44, "end": 2277.44, "text": "was wiegt ne G403? Moment, ne 80 Gramm ist mit Verpackung, ne? 80 Gramm ist mit Verpackung."}, {"id": 243, "start": 2277.44, "end": 2300.56, "text": "Da müssen wir mal bei Logitech gucken. Äh, wait, wait. Äh, also 87 Gramm und die, alter"}, {"id": 244, "start": 2300.56, "end": 2315.32, "text": "Logitech, wo kann man suchen bei euch? G Pro Wireless? Die da wahrscheinlich, ne? Wiegt"}, {"id": 245, "start": 2315.32, "end": 2322.28, "text": "was? Nein, ich will nicht Subscribern. Höchstens, höchstens auf Twitch, aber nicht bei Logitech."}, {"id": 246, "start": 2322.28, "end": 2332.8, "text": "Wiegt 80. Ähm, ist sogar noch ein bisschen leichter als meine G403. Wie viel wiegt denn"}, {"id": 247, "start": 2332.8, "end": 2338.96, "text": "ne Finalmouse? Was, warte mal. Pro Settings. Was hat ein Scream? Was hat ein Scream von"}, {"id": 248, "start": 2338.96, "end": 2344.64, "text": "ne Maus? Der hat glaub ich ne Finalmouse. Das sind die, das hier. Finalmouse Ultralight"}, {"id": 249, "start": 2344.64, "end": 2353.8, "text": "Sunset. Mal gucken, was das Ding wiegt. Ähm, steht das da irgendwo vielleicht? So ein bisschen"}, {"id": 250, "start": 2353.8, "end": 2358.52, "text": "Hardware-Informationen zu? Gibt's nicht. Das ist overrated. Hardware-Informationen braucht"}, {"id": 251, "start": 2358.52, "end": 2379.84, "text": "man nicht. Äh, nein. Die wiegt bestimmt nicht 227 Gramm. Der, der bearded Bob. Aha. What?"}, {"id": 252, "start": 2379.84, "end": 2386.56, "text": "67 Gramm. Da hätten sie es auch 69 Gramm machen können, oder? Ich mein, wenn schon,"}, {"id": 253, "start": 2386.56, "end": 2390.6, "text": "wenn man mal die, die Möglichkeit hat, der hätte man das auch gleich richtig machen"}, {"id": 254, "start": 2390.6, "end": 2401.72, "text": "können. Okay. Also, auf geht's. Ähm, jetzt müssen wir uns den Guide kurz angucken."}, {"id": 255, "start": 2401.72, "end": 2411.96, "text": "Also. Getting started. Create WinUI 3 in Desktop App. Ähm, okay, es gibt anscheinend"}, {"id": 256, "start": 2411.96, "end": 2425.16, "text": "neue Vorlagen. Create New Project. WinUI. Win, Windows Runtime Component. UWP. Nein."}, {"id": 257, "start": 2425.16, "end": 2431.32, "text": "Wir wollen eine Desktop Anwendung. WinUI in Desktop. Packaged. Nein, nein, nein, ich will"}, {"id": 258, "start": 2431.32, "end": 2442.88, "text": "nix. Ich will nix. Packaged. Plank App. Packaged. Okay. Language. C-Sharp. Ich will kein UWP."}, {"id": 259, "start": 2442.88, "end": 2452.72, "text": "Class Library. Packaged. Hä? Nein, ich will das nicht über den Microsoft Store machen."}, {"id": 260, "start": 2452.72, "end": 2461.68, "text": "Ich will ne stinknormale, publische Win32 WinUI Anwendung. Ich will nix sideloaden. Ich will"}, {"id": 261, "start": 2461.68, "end": 2469.12, "text": "nix über den Store. Wollt ihr mich veräppeln? Gibt's das nicht? Dann wird der Scheiß sofort"}, {"id": 262, "start": 2469.12, "end": 2483.08, "text": "installiert. Ich will das nicht über den Store machen. Das ist doch grad der Witz"}, {"id": 263, "start": 2483.08, "end": 2502.96, "text": "daran. Okay. Probiert, probiert. Plank App. Nee, das ist, Plank App ist UWP. Wir wollen"}, {"id": 264, "start": 2502.96, "end": 2521.0, "text": "keine UWP. Wir wollen, wir wollen ne Win32 Desktop. Okay, es gibt, das ist das Einzige."}, {"id": 265, "start": 2521.0, "end": 2532.08, "text": "Na schauen wir mal. Okay, Create. Nein. Ich will kein UWP Shit. Geh weg. Was soll ich"}, {"id": 266, "start": 2532.08, "end": 2537.36, "text": "mit diesem verschissenen UWP kack? Das ist doch grad der Witz an dem, dass man den UWP"}, {"id": 267, "start": 2537.36, "end": 2544.6, "text": "Scheiß nicht mehr braucht. Ja, MSIX ist aber kacke. Da braucht man wieder irgendwelche"}, {"id": 268, "start": 2544.6, "end": 2553.92, "text": "Codesigning Certificates, dass man das ausführen kann. Okay, das probieren wir jetzt mal aus."}, {"id": 269, "start": 2553.92, "end": 2566.36, "text": "Vielleicht ist das ja auch alles nur. What? Alter, Microsoft, wollt ihr mich verarschen?"}, {"id": 270, "start": 2566.36, "end": 2575.28, "text": "Ich will kein Store und ich will kein Site. Ich will ne beschissene, stinknormale Windows-Anwendung,"}, {"id": 271, "start": 2575.28, "end": 2582.6, "text": "die ich anklicken kann und starten. Ist das euer Ernst? Ihr wollt mir noch nicht wirklich"}, {"id": 272, "start": 2582.6, "end": 2587.8, "text": "erzählen, ihr habt den ganzen Aufwand gemacht, dafür, dass ich immer noch den gleichen Scheiß-Limitierung,"}, {"id": 273, "start": 2587.8, "end": 2595.72, "text": "okay, nicht alle, aber was, die ganze Zertifikatsgeschichte hab, die bei UWP sackt. Das wollt ihr mir"}, {"id": 274, "start": 2595.72, "end": 2617.36, "text": "noch nicht wirklich erzählen, Microsoft, oder? Okay, wir starten das Ding mal. He didn't"}, {"id": 275, "start": 2617.36, "end": 2640.48, "text": "know. Ja, als wüsstest du's. Ja, starten, please. Was? Was? Ist das euer Ernst? Ich"}, {"id": 276, "start": 2640.48, "end": 2650.8, "text": "soll wirklich den UWP-Scheiß noch machen, oder was? Nee, nee, also man muss den Developer-Mode"}, {"id": 277, "start": 2650.8, "end": 2656.76, "text": "anmachen, dafür, dass man sideloaden kann. Ich will nicht sideloaden, ich will eine ganz"}, {"id": 278, "start": 2656.76, "end": 2665.56, "text": "normale, stinknormale Win32-Anwendung machen. Okay, vielleicht kriegen wir den Kram selbst"}, {"id": 279, "start": 2665.56, "end": 2675.76, "text": "irgendwie gestartet. Wo ist, wo ist mein Main? Wo ist mein Main? Hier. So, wir gibaten das"}, {"id": 280, "start": 2675.76, "end": 2698.08, "text": "jetzt. Wir gibaten das jetzt. Also, WSB, wir gibaten das jetzt. Create New Project, Console,"}, {"id": 281, "start": 2698.08, "end": 2706.0, "text": "so kann man die.NET Core-Version auswählen. Okay, create. Wir bauen das jetzt nach, ohne"}, {"id": 282, "start": 2706.0, "end": 2711.6, "text": "den ganzen UWP-Crap, das geht aber wahrscheinlich nicht. Okay, Moment, erst mal Dark Mode, Dark"}, {"id": 283, "start": 2711.6, "end": 2716.92, "text": "Mode. Wie geht? Äh, Moment, ich hab schon lang kein Whistlestudio mehr auf gehabt, wo"}, {"id": 284, "start": 2716.92, "end": 2737.96, "text": "ging das jetzt hier? Dark, Theme. Wo ist das nochmal versteckt in Whistlestudio? Was, Direkt"}, {"id": 285, "start": 2737.96, "end": 2753.4, "text": "am Anfang? General? Ah, Dark. Ah, yes, okay, viel besser. Okay, viel besser. Gucken wir"}, {"id": 286, "start": 2753.4, "end": 2762.64, "text": "mal, ob wir jetzt die Konsolen-Anwendung starten können. Excellent. Es ist ein.NET 5, okay,"}, {"id": 287, "start": 2762.64, "end": 2769.6, "text": "dann, wir bauen das jetzt einfach nach, so. So, jetzt muss man natürlich irgendwas verlinken,"}, {"id": 288, "start": 2769.6, "end": 2789.32, "text": "dass das funktioniert. Was muss man hier referenzieren? Dependencies, Packages, Microsoft WinUI. Geht"}, {"id": 289, "start": 2789.32, "end": 2809.28, "text": "das Panuget, oder wie kann man das jetzt hier ver... WinUI? Wie kann man den Kram jetzt"}, {"id": 290, "start": 2809.28, "end": 2836.16, "text": "hier auswählen? Ja, excellent. Ja, den will ich haben. Microsoft WinUI heißt der Kram."}, {"id": 291, "start": 2836.16, "end": 2854.36, "text": "Alter, Windows, Windows, please. Ich, ich werd garantiert keine UVP-Anwendung machen,"}, {"id": 292, "start": 2854.36, "end": 2860.88, "text": "die... Also, ich werd keine Win32-Anwendung machen, die, die UVP zeugt... Ah, Microsoft,"}, {"id": 293, "start": 2860.88, "end": 2870.92, "text": "das tut doch weh. Okay, ähm, wie kriegen wir denn Kram jetzt hin? Add? Add reference?"}, {"id": 294, "start": 2870.92, "end": 2880.12, "text": "Nee. Fuck, wie kriegt man hier überhaupt wieder normale... Reference? Ah, okay. Browse?"}, {"id": 295, "start": 2880.12, "end": 2896.76, "text": "Browse? Add? Nee, äh, build? Nate? Waaah! Include? Limp? Aha! Excellent! Da ist es."}, {"id": 296, "start": 2896.76, "end": 2909.96, "text": "Okay, jetzt haben wir das ge-edit. Oh, geht mir das schon wieder auf den Sack. Ich hab"}, {"id": 297, "start": 2909.96, "end": 2916.24, "text": "schon wieder keinen Bock mehr auf den, auf den Microsoft Crap, Alter. Ah, jetzt müssen"}, {"id": 298, "start": 2916.24, "end": 2926.04, "text": "wir Windows, Windows müssen wir include. Windows SDK müssen wir include. Wo, wo, wo"}, {"id": 299, "start": 2926.04, "end": 2944.8, "text": "gibt's das her? Microsoft Windows SDK net. Wo kriegt man das her? Warum genau sollte"}, {"id": 300, "start": 2944.8, "end": 2948.68, "text": "man das statt Qt verwenden? Ja gar nicht, wenn das so scheiße ist, wie es hier aussieht."}, {"id": 301, "start": 2948.68, "end": 2961.88, "text": "Okay, welche Version ist das? 6, 2, 3, preview? Okay, install, excellent. Kannst du nicht"}, {"id": 302, "start": 2961.88, "end": 2969.0, "text": "einfach das Startprojekt ändern? Ja, das ist eine gute Idee, das probieren wir mal aus,"}, {"id": 303, "start": 2969.0, "end": 2977.84, "text": "Kleil. Hat das jetzt installiert? Ah, excellent. Ha! Es startet schon mal, okay. So, und jetzt"}, {"id": 304, "start": 2977.84, "end": 2982.96, "text": "muss ich gucken, wie ich die Anwendung starte. Äh, wo, wo ist denn mein Main? Wo ist denn"}, {"id": 305, "start": 2982.96, "end": 2993.6, "text": "hier mein Main? Wo ist denn, wo ist denn hier Main, Main Window? App? Wo ist denn hier"}, {"id": 306, "start": 2993.6, "end": 3000.44, "text": "mein Main? Wo ist denn hier der Einstieg überhaupt? Wie geht denn das? Wie startet der, den Kram"}, {"id": 307, "start": 3000.44, "end": 3016.68, "text": "überhaupt? Es muss doch irgendwo eine Main geben, was den Kram lädt, oder nicht? Hm."}, {"id": 308, "start": 3016.68, "end": 3021.28, "text": "Das wird ja auf den UWP Package Plot Check gesetzt. Ich habe keine Ahnung, wie der Kram"}, {"id": 309, "start": 3021.28, "end": 3025.56, "text": "funktioniert. Ich weiß nur, dass ich ein Codesigning Zertifikat dafür brauche für 300 Euro im"}, {"id": 310, "start": 3025.56, "end": 3031.64, "text": "Jahr, und Microsoft kann mich mal am Arsch lecken. Ähm, wie wird denn der Kram gestartet hier"}, {"id": 311, "start": 3031.64, "end": 3056.88, "text": "überhaupt jetzt? App, App Application? Das Main, wo ist der Kram? Äh, als Startprojekt,"}, {"id": 312, "start": 3056.88, "end": 3083.36, "text": "wurscht. Achso, hier oben meinste. Ähm, App 1. Das startet nix. Äh, RealRenax, doch,"}, {"id": 313, "start": 3083.36, "end": 3093.6, "text": "kannst du? Kannst du? Du musst, du musst irgendwie unten links bei der Windows 10 Installation"}, {"id": 314, "start": 3093.6, "end": 3100.32, "text": "musst du irgendwie auf, auf, man muss irgendwas, irgendwas anklicken. Ähm, und, und ich, wir"}, {"id": 315, "start": 3100.32, "end": 3105.24, "text": "haben es in der VM gemacht, kriegst du mal. Okay. Aber irgendwo muss doch ein Main, irgendwo"}, {"id": 316, "start": 3105.24, "end": 3114.68, "text": "muss doch mal ein Main sein. Irgendwo muss doch Main. Warum ist denn der Scheiß so kompliziert?"}, {"id": 317, "start": 3114.68, "end": 3123.8, "text": "Current Project, Main. Ah, this is the first line of other. Ah, Logical Equivalent to"}, {"id": 318, "start": 3123.8, "end": 3140.48, "text": "Main. Okay. Okay, denn Main, Main gibt's nicht. Okay, okay, okay. Window. Okay, okay. Kann"}, {"id": 319, "start": 3140.48, "end": 3146.4, "text": "man sagen, New, Window. Geht so was? Window. Und dann muss ich aber irgendwie erstmal"}, {"id": 320, "start": 3146.4, "end": 3153.92, "text": "Application, Application Run machen. Application. Ich, ich probier einfach mal rum. Ich hab Application"}, {"id": 321, "start": 3153.92, "end": 3162.72, "text": "Run. Nee, Start. Start so. Boah, fuck man, ich hab keinen Schimmer, wie das funktioniert."}, {"id": 322, "start": 3162.72, "end": 3181.44, "text": "Wie startet man den Kram? Wie? Ich hab legit keine Ahnung, wie man den Kram startet. Ich"}, {"id": 323, "start": 3181.44, "end": 3209.96, "text": "vermute ja fast, das geht nur mit diesem ganzen UWP-Shit. Das ärgert mich. App. Ah,"}, {"id": 324, "start": 3209.96, "end": 3220.64, "text": "okay, man muss, man muss anscheinend. Ah, kann das sein, dass man sich ne eigene Klasse"}, {"id": 325, "start": 3220.64, "end": 3237.12, "text": "von dem App machen muss? Und dann was passiert? Setz mal nen Breakpoint. Das juckt den überhaupt"}, {"id": 326, "start": 3237.12, "end": 3242.8, "text": "nicht. Äh, wenn man das, wenn man das als Startprojekt hat, mag er nicht. Der macht,"}, {"id": 327, "start": 3242.8, "end": 3253.28, "text": "der macht gar nix, Alter. Der, der macht gar nix. Der sollte eigentlich das hier starten,"}, {"id": 328, "start": 3253.28, "end": 3263.08, "text": "macht er aber nicht. Okay, also, sagen wir mal hier. Application. Application. Und dann"}, {"id": 329, "start": 3263.08, "end": 3283.32, "text": "ne? Callback. Was muss der da callbacken? Was muss der da callbacken? Wie sowas? Okay,"}, {"id": 330, "start": 3283.32, "end": 3294.24, "text": "ich hab keine Ahnung, was da jetzt passiert. Kann Universal Studios mal formatieren, richtig?"}, {"id": 331, "start": 3294.24, "end": 3298.04, "text": "Class not registered. Okay, das ist okay, das leuchtet ein. Das muss man wahrscheinlich"}, {"id": 332, "start": 3298.04, "end": 3320.2, "text": "im Application starten machen. Ah, what? Das geht ohne den UWP-Shit nicht. Das geht mit,"}, {"id": 333, "start": 3320.2, "end": 3328.56, "text": "ich sag mal, wo ist denn da der Sinn von? Das versteh ich null, äh. Guckt mal, das"}, {"id": 334, "start": 3328.56, "end": 3334.16, "text": "ganze Zeug, angeblich, angeblich geht das ohne diesen ganzen UWP und Microsoft Store"}, {"id": 335, "start": 3334.16, "end": 3340.12, "text": "Shit. Aber dass es funktioniert, brauch ich UWP und Microsoft Store Shit. Wo ist denn"}, {"id": 336, "start": 3340.12, "end": 3344.64, "text": "da der Sinn dahinter? Okay, warte mal, wir machen nochmal ein neues Projekt. Renewal."}, {"id": 337, "start": 3344.64, "end": 3360.72, "text": "Plank App, UWP. Nein, wollen wir schonmal nicht. Ich will kein UWP. Okay, C++, was gibt's"}, {"id": 338, "start": 3360.72, "end": 3379.08, "text": "da? Plank App Desktop. Das ist genau der gleiche Mist. Was war? DLL, aber das brauch ich ja"}, {"id": 339, "start": 3379.08, "end": 3401.72, "text": "nicht. Okay, wind github, github, wind ui. Das, das macht mich schon wieder fertig, ja."}, {"id": 340, "start": 3401.72, "end": 3420.32, "text": "Ja, ja. Ja, genau das."}, {"id": 341, "start": 2424.66, "end": 3448.04, "text": "was? Ich will keine Packaged App. Für eine Packaged App brauch ich dieses, dieses"}, {"id": 342, "start": 3448.04, "end": 3466.52, "text": "hässliche, brauch ich ein hässliches Codesigning Zertifikat. Was macht Microsoft denn da wieder"}, {"id": 343, "start": 3466.52, "end": 3483.84, "text": "für Dinger? Wo ist denn das Problem, Microsoft? Ihr bringt ein neues UI Framework raus, wo"}, {"id": 344, "start": 3483.84, "end": 3487.24, "text": "ich einfach eine App, wo ich einfach, ich sag schon eine App, wo ich einfach eine Anwendung"}, {"id": 345, "start": 3487.24, "end": 3503.68, "text": "erstellen kann, ohne irgendwas anderes. Issue 2179. Hatt ich das gerade? Nee. Ja, use"}, {"id": 346, "start": 3503.68, "end": 3526.12, "text": "mir nur wieder aus UWP. Not using, genau. Ja, genau, genau. Ja, schön, aber wir haben"}, {"id": 347, "start": 3526.12, "end": 3531.4, "text": "jetzt ja das Preview. Das ist, es ist Schwachsinn, es stimmt überhaupt nicht, was ihr da schreibt,"}, {"id": 348, "start": 3531.4, "end": 3550.2, "text": "Microsoft. Ich will kein UWP. Krieg, krieg Anfälle. Ich krieg echt Anfälle. Das ist"}, {"id": 349, "start": 3550.2, "end": 3557.84, "text": "das ganze UWP Shit. Wobei, ich sag mal, an sich, an sich ist es okay, dass es diese UWP"}, {"id": 350, "start": 3557.84, "end": 3562.64, "text": "im Windows Store Geschichten gibt. Für Sachen, für Leute, die die verwenden wollen, ist"}, {"id": 351, "start": 3562.64, "end": 3571.6, "text": "das okay. Aber ich will eine stinknormale Windows Anwendung, ohne 30 Milliarden Sachen"}, {"id": 352, "start": 3571.6, "end": 3578.2, "text": "vor allem, ohne 300 Euro Codesigning Zertifikat im Jahr. Also das Problem ist ja, nur mal"}, {"id": 353, "start": 3578.2, "end": 3583.88, "text": "um euch das nochmal zu verdeutlichen, so. Man braucht, dass man diese Anwendung starten"}, {"id": 354, "start": 3583.88, "end": 3589.6, "text": "kann. Also ich zeige es euch mal, wenn man die starten will. Sagt ihr mir ja immer, aktiviere"}, {"id": 355, "start": 3589.6, "end": 3593.44, "text": "den Developer Mode. Das ist glaube ich, ja, das war eben Pokémon Musik. Oder ist das"}, {"id": 356, "start": 3593.44, "end": 3600.28, "text": "jetzt immer noch? Kann sein. Das davor war glaube ich. So, der sagt hier, ich soll meine"}, {"id": 357, "start": 3600.28, "end": 3606.96, "text": "Developer, den Developer Account aktivieren, damit ich Apps sideloaden kann. So. Das geht"}, {"id": 358, "start": 3606.96, "end": 3611.96, "text": "bei mir lokal auf der Kiste, weil da stellt sich ein selbstsigniertes Zertifikat aus."}, {"id": 359, "start": 3611.96, "end": 3617.04, "text": "Das Problem ist jetzt, wenn ich das programmiere und ihr ladet euch das runter und wollt es"}, {"id": 360, "start": 3617.04, "end": 3627.08, "text": "bei euch starten, dann geht es nicht. Es geht nur, wenn ihr vorher mein Zertifikat bei euch"}, {"id": 361, "start": 3627.08, "end": 3631.96, "text": "in den Trust Store importiert, dass euer Windows dann der Anwendung vertraut. Das macht kein"}, {"id": 362, "start": 3631.96, "end": 3637.12, "text": "normaler Anwender. Der denkt, Alter, was will der Typ von mir? Zumal du Adminrechte dafür"}, {"id": 363, "start": 3637.12, "end": 3643.4, "text": "brauchst. Du brauchst ja sogar Adminrechte dafür. Also du hast aktuell die Auswahl, du"}, {"id": 364, "start": 3643.4, "end": 3649.56, "text": "holst dir den Code Signing Zertifikat für 300 Euro im Jahr, dass du Windows Anwendung"}, {"id": 365, "start": 3649.56, "end": 3655.64, "text": "machen darfst in Zukunft. Moderne. Oder aber, du machst es über den Microsoft Store. Was"}, {"id": 366, "start": 3655.64, "end": 3662.56, "text": "ein Bullshit Microsoft. Alter. Oh Gott. Die kriegen, jetzt machen sie einmal was Gescheites"}, {"id": 367, "start": 3662.56, "end": 3671.8, "text": "seit 15 Jahren und dann funktioniert es nicht. Kuluki97, neun Monate, dankeschön. Exzellenz"}, {"id": 368, "start": 3671.8, "end": 3675.24, "text": "Subscription. Ich glaube, ich habe jede Menge Subscribers überszenen, oder? Ich muss mal"}, {"id": 369, "start": 3675.24, "end": 3684.52, "text": "nachgucken. Ich gehe jetzt Warzone spielen, Kleine. Nee, jetzt noch nicht. Erst in einer"}, {"id": 370, "start": 3684.52, "end": 3697.8, "text": "Stunde oder eineinhalb Stunden. Lerado hat auch Subscribed, dankeschön. Der Dekan auch."}, {"id": 371, "start": 3697.8, "end": 3707.08, "text": "Exzellenz Subscriptions. Macht die Microsofts Sache nicht besser. Okay, also die Briefview"}, {"id": 372, "start": 3707.08, "end": 3723.52, "text": "ist explizit für Win32 Anwendungen. Das schreiben sie hier, guckt. Ich will keine Packaged App."}, {"id": 373, "start": 3723.52, "end": 3734.52, "text": "Geht mir nicht auf den Sack. Ich will es nicht Packaged haben. Genau das hier, genau"}, {"id": 374, "start": 3734.52, "end": 3756.36, "text": "das. Das, was er schreibt. Der einzige Unterschied, den ich aktuell sehe, zwischen der UWP WinUI"}, {"id": 375, "start": 3756.36, "end": 3763.72, "text": "3 Anwendung und einer Win32 WinUI Anwendung ist, dass man keine Sandbox hat. Aber die"}, {"id": 376, "start": 3763.72, "end": 3770.32, "text": "ganzen anderen Scheiß, also der hauptsächliche Scheiß, nämlich ein Codesigning Zertifikat"}, {"id": 377, "start": 3770.32, "end": 3779.2, "text": "oder den Microsoft Store, braucht man immer noch. Komplett useless wasted, Alter. Der"}, {"id": 378, "start": 3779.2, "end": 3787.16, "text": "ganze Aufwand ist voll von Arsch. Kosta2570, Stufe 1, dankeschön. Exzellenz Subscription."}, {"id": 379, "start": 3787.16, "end": 3805.44, "text": "So, wie lösche ich den Kram jetzt wieder? Weg. Wie lösche ich den überhaupt wieder?"}, {"id": 380, "start": 3805.44, "end": 3826.04, "text": "Fickt euch, ey. Ich habe mich da so drauf gefreut, dass man endlich im Jahr 2020 mal"}, {"id": 381, "start": 3826.04, "end": 3831.64, "text": "wieder ordentliche Windows Desktop Anwendungen machen kann. Ne, geht nicht. Man könnte ja,"}, {"id": 382, "start": 3831.64, "end": 3836.24, "text": "man könnte ja auf die Idee kommen, die wollen gerade, dass alles nur noch in Elektron gebastelt"}, {"id": 383, "start": 3836.24, "end": 3853.04, "text": "wird. Da gibt es auch einen Tipp von Microsoft. Ja, welchen denn? Der Tipp von Microsoft ist,"}, {"id": 384, "start": 3853.04, "end": 3861.56, "text": "man kann in den Browser, oder was? Codesigning ist doch dafür gut. Ja, natürlich, natürlich"}, {"id": 385, "start": 3861.56, "end": 3868.2, "text": "ist Codesigning seine Anwendungszwecke, aber so als 0815 normaler Entwickler, der daheim"}, {"id": 386, "start": 3868.2, "end": 3874.2, "text": "sitzt und irgendwas bastelt, ich kauf mir kein 300 Euro Codesigning Zertifikat. Seh ich"}, {"id": 387, "start": 3874.2, "end": 3879.4, "text": "überhaupt nicht ein. Und man braucht den Scheiß ja überhaupt nicht. Es ist komplett unsinnig."}, {"id": 388, "start": 3879.4, "end": 3887.6, "text": "Man bräuchte einfach einen richtigen Paketmanager. Und nicht diesen Windows Store Crap. Ja,"}, {"id": 389, "start": 3887.6, "end": 3891.88, "text": "unter Anstellungsfunktion ist das auch wunderbar. Du hast entweder den offiziellen Package Manager,"}, {"id": 390, "start": 3891.88, "end": 3895.48, "text": "oder du hast die User Repos, wo du halt sagen musst, okay, ich traue dem User. Und das Paket"}, {"id": 391, "start": 3895.48, "end": 3900.84, "text": "hat halt, wenn du es runterlädst, hat das Ding halt eine MD5-Sommer oder eine Hash-Wert"}, {"id": 392, "start": 3900.84, "end": 3907.68, "text": "drüber. Du weißt, du hast das Richtige runtergeladen und gut ist. Ich kaufe mir doch kein Codesigning"}, {"id": 393, "start": 3907.68, "end": 3917.68, "text": "Zertifikat, dass ich das Windows Anwendung machen kann. Ja, den Package Manager gibt's,"}, {"id": 394, "start": 3917.68, "end": 3922.6, "text": "da sind sie gerade dabei, ich weiß. Aber bis das dann überhaupt richtig funktioniert,"}, {"id": 395, "start": 3922.6, "end": 3927.76, "text": "wird schon mal, ach das wird doch nichts. Ey echt, bei Microsoft ist echt alle Hoffnungen"}, {"id": 396, "start": 3927.76, "end": 3945.6, "text": "verloren manchmal. Ja, Flow 96 macht das. Als WPF-App kannst du das nicht verpacken."}, {"id": 397, "start": 3945.6, "end": 3953.16, "text": "Du kannst ja schlecht zwei Mainloops laufen lassen, einmal für WPF und einmal für WinUI,"}, {"id": 398, "start": 3953.16, "end": 3956.72, "text": "das wird ja so nicht funktionieren. Aber anscheinend kann man keine Constant-Applications"}, {"id": 399, "start": 3956.72, "end": 3960.52, "text": "verstanden. Codespaces, ja ich hab mich für die Beta eingetragen, ich weiß nicht, ob"}, {"id": 400, "start": 3960.52, "end": 3968.56, "text": "das schon raus ist. Okay, man merkt vielleicht ein bisschen, dass ich angepisst bin über"}, {"id": 401, "start": 3968.56, "end": 3992.36, "text": "die Microsoft-Geschichte hier. Newst. Wie sie hier einfach Scheiße erzählt haben"}, {"id": 402, "start": 3992.36, "end": 3996.72, "text": "in diesem Issue. So nach dem Motto Ja, es kommt da mit der Briefview. Schwachsinn, kommt"}, {"id": 403, "start": 3996.72, "end": 4010.08, "text": "es, kommt es, es. Mhm."}, {"id": 404, "start": 4010.08, "end": 4033.44, "text": "Wie hieß das Issue noch mal von dem anderen Typ, was wir eben aufhatten?"}, {"id": 405, "start": 4033.44, "end": 4041.68, "text": "Sonst probier doch den Package Manager aus. Ja, das machen wir, den Package Manager,"}, {"id": 406, "start": 4041.68, "end": 4064.56, "text": "das können wir uns echt angucken. Hat jemand, hat jemand mal einen aktuellen... wobei. Ja."}, {"id": 407, "start": 4064.56, "end": 4078.24, "text": "Genau, so ist es. Genau, sie haben seit 20 Jahren nichts ordentlich modernes mehr rausgebracht,"}, {"id": 408, "start": 4078.24, "end": 4083.0, "text": "was man sinnvoll verwenden kann. Das ist, es ist so lächerlich. Erstmal abvoten,"}, {"id": 409, "start": 4083.0, "end": 4089.2, "text": "erstmal abvoten. Ich will jetzt abvoten. Ich bin nicht eingeloggt. Frag ich muss abvoten."}, {"id": 410, "start": 4089.2, "end": 4112.72, "text": "Bin ich, bin ich im anderen Browser eingeloggt? Okay, ich muss es abvoten. Ah, easy. Ha! Da"}, {"id": 411, "start": 4112.72, "end": 4126.92, "text": "hat er, da hat er geabvotet. Oh Mann. Microsoft, Microsoft, Alter. Nee, nee, ich fasse es nicht."}, {"id": 412, "start": 4126.92, "end": 4132.12, "text": "Okay, bei der Gelegenheit können wir das letzte Wishlist Studio mal updaten, das schadet nichts."}, {"id": 413, "start": 4132.12, "end": 4138.52, "text": "Was war denn das letzte Sinnvolle, was die rausgebracht haben? Wishlist Studio Code?"}, {"id": 414, "start": 4138.52, "end": 4143.2, "text": "Nee, GUI-mäßig, GUI-mäßig war das letzte Sinnvolle, was sie rausgebracht haben, WPF."}, {"id": 415, "start": 4143.2, "end": 4159.8, "text": "2006 oder so. Ja. WPF war das letzte Sinnvolle, was sie rausgebracht haben."}, {"id": 416, "start": 4159.8, "end": 4172.08, "text": "Was sie ja dann irgendwie haben sterben lassen für WinRT und Zeug."}, {"id": 417, "start": 4172.08, "end": 4186.0, "text": "Okay, vielleicht ist das gar nicht so schlimm, wie ich denke. Vielleicht ist das gar nicht"}, {"id": 418, "start": 4186.0, "end": 4192.56, "text": "so schlimm, weil vielleicht kommt das ja noch. Unpackaged Apps, vielleicht, vielleicht kommt"}, {"id": 419, "start": 4192.56, "end": 4201.4, "text": "das ja noch. Ansonsten, ansonsten macht vielleicht irgendein Community-Mensch was, der das Bild"}, {"id": 420, "start": 4201.4, "end": 4205.04, "text": "irgendwie, der das vereinfacht, weil aktuell habe ich noch nicht mal eine Ahnung, wie ich"}, {"id": 421, "start": 4205.04, "end": 4215.2, "text": "den Kram überhaupt starten soll, ehrlich gesagt. Das muss gehen, ansonsten ist das"}, {"id": 422, "start": 4215.2, "end": 4222.96, "text": "komplette Totgeburt, Alter. Ja, Henry, Qt ist wirklich das Einzige, was"}, {"id": 423, "start": 4222.96, "end": 4231.56, "text": "halbwegs geht, ja, leider. Also aktuell hast du ja Cross-Plattform im Prinzip, so richtig"}, {"id": 424, "start": 4231.56, "end": 4237.44, "text": "Desktop, auf dem Desktop, ja. Cross-Plattform hast du die Auswahl, Elektron oder Qt, das"}, {"id": 425, "start": 4237.44, "end": 4250.04, "text": "war's. Das sind eigentlich die zwei Sachen. Für mich, ich habe es ja schon öfters gesagt,"}, {"id": 426, "start": 4250.04, "end": 4255.04, "text": "für mich sind die zwei Kriterien, woran man sieht, ob man mit einem Cross-Plattform GUI"}, {"id": 427, "start": 4255.04, "end": 4261.08, "text": "Framework quasi alles Mögliche machen kann, sind zwei Sachen, wo man nachgucken muss,"}, {"id": 428, "start": 4261.08, "end": 4267.4, "text": "wo die meisten Sachen fehlen, und zwar gibt es einen Webview, einen ordentlichen Webview"}, {"id": 429, "start": 4267.4, "end": 4273.6, "text": "für HTML-Zeug und gibt es die Möglichkeit, 3D-Content einzubinden, also nicht mit 3D-Content,"}, {"id": 430, "start": 4273.6, "end": 4280.68, "text": "GPU-Accelerated-Content, also sprich, gibt es einen OpenGL-Widget oder einen DirectX-Widget,"}, {"id": 431, "start": 4280.68, "end": 4284.28, "text": "das sind so die zwei Sachen. Wenn es die gibt, dann taugt das wahrscheinlich was."}, {"id": 432, "start": 4284.28, "end": 4298.84, "text": "WX-Widgets C++, habe ich mir vor einer Weile mal anguckt, sah irgendwie ziemlich wir aus"}, {"id": 433, "start": 4298.84, "end": 4307.08, "text": "und auch wenig, wenig Tutorials und aktuelle Sachen. Außerdem, das Schlimme ist ja, das"}, {"id": 434, "start": 4307.08, "end": 4313.76, "text": "kommt ja dabei, dass Qt selber C++ ist. Ja, es gibt ganz gute Python Bindings, was jetzt"}, {"id": 435, "start": 4313.76, "end": 4320.68, "text": "auch nicht für GUI-Anwendungen unbedingt so meine erste Wahl wäre. Die C-Sharp-Bindings,"}, {"id": 436, "start": 4320.68, "end": 4327.6, "text": "die es gibt, sind mittlerweile ganz ok, allerdings unvollständig, die haben nur QML. Und die"}, {"id": 437, "start": 4327.6, "end": 4335.6, "text": "IDE-Integration ist dumm. Hier, das, warte mal, was war das überhaupt genau? Das ist"}, {"id": 438, "start": 4335.6, "end": 4339.36, "text": "eigentlich ganz gut mittlerweile, leider ist die IDE-Integration, als ich das letzte Mal"}, {"id": 439, "start": 4339.36, "end": 4348.64, "text": "ausprobiert habe, nicht gut gewesen. Das Problem war, dass man das Frontend in Qt-Creator basteln"}, {"id": 440, "start": 4348.64, "end": 4354.64, "text": "muss und den Rest bastelt man in Visual Studio, weil der Qt-Creator natürlich keine.NETC-Sharp-Completion"}, {"id": 441, "start": 4354.64, "end": 4359.68, "text": "und alles hat und dann muss man immer hin und her schalten und das eine funktioniert"}, {"id": 442, "start": 4359.68, "end": 4364.0, "text": "dann mit dem anderen nicht richtig und es ist wir auf jeden Fall, es ist nicht schön,"}, {"id": 443, "start": 4364.0, "end": 4374.36, "text": "es ist nicht schön. Qt kann man nehmen, weil, also vor allem mit QML, also die neue Qt-Variante,"}, {"id": 444, "start": 4374.36, "end": 4381.16, "text": "wir reden jetzt nicht von, wie heißt das, Qt-Widgets, das alte, also da rede ich jetzt"}, {"id": 445, "start": 4381.16, "end": 4385.28, "text": "nicht von, ich rede nur von dem neuen, das kann man Cross-Plattform wirklich nehmen,"}, {"id": 446, "start": 4385.28, "end": 4391.36, "text": "weil das sieht Cross-Plattform auch gleich aus. Die malen ja ihre Widgets komplett selbst"}, {"id": 447, "start": 4391.36, "end": 4396.32, "text": "und ich sage ja auch immer, ein ordentliches GUI-Framework muss die Controls selber malen,"}, {"id": 448, "start": 4396.32, "end": 4402.76, "text": "ansonsten bist du immer darauf beschränkt, den kleinsten gemeinsamen Nenner aller Betriebssysteme"}, {"id": 449, "start": 4402.76, "end": 4408.16, "text": "zu nehmen. Das soll gleich aussehen, weil du hast das Problem, wenn das nicht gleich"}, {"id": 450, "start": 4408.16, "end": 4413.8, "text": "aussieht, dann hast du so ein Geschiss wie beispielsweise bei Xamarin, Xamarin, Xamarin,"}, {"id": 451, "start": 4413.8, "end": 4418.16, "text": "wie auch immer man das ausspricht, dass die ganzen Controls nichts können, weil die gucken"}, {"id": 452, "start": 4418.16, "end": 4424.92, "text": "müssen, dass das, was sie implementieren an ihren Controls, überall funktioniert. Das"}, {"id": 453, "start": 4424.92, "end": 4429.72, "text": "ist das einzig wahre, dass die ihre Controls selber malen. Natürlich sieht es dann Mac"}, {"id": 454, "start": 4429.72, "end": 4433.44, "text": "nicht aus wie Mac und Windows nicht aus wie Windows und Linux nicht aus wie Linux, sondern"}, {"id": 455, "start": 4433.44, "end": 4437.72, "text": "es sieht eben aus wie, ja wahrscheinlich wie eine Web-Anwendung zum größten Teil, bloß"}, {"id": 456, "start": 4437.72, "end": 4447.12, "text": "weil es keine Web-Anwendung ist. Den C++-Hate, naja, ich habe mich ja schon öfters über"}, {"id": 457, "start": 4447.12, "end": 4454.72, "text": "C++ ausgelassen. Es gibt so viele ekliche Sachen an C++. Man kann die auch selber malen"}, {"id": 458, "start": 4454.72, "end": 4459.36, "text": "und es auf jedem System so aussehen lassen. Ja, dann hast du aber das Problem, dass es"}, {"id": 459, "start": 4459.36, "end": 4464.64, "text": "halt nie so hundertprozentig passt. Entweder die einfachere Variante ist, du machst quasi"}, {"id": 460, "start": 4464.64, "end": 4472.64, "text": "einen eigenen Style, der dann halt überall gleich aussieht, ansonsten kannst du nur versuchen,"}, {"id": 461, "start": 4472.64, "end": 4477.8, "text": "die Sachen nachzubauen. Das wird nie so hundertprozentig funktionieren. Es gibt ja auch Windows-Skins"}, {"id": 462, "start": 4477.8, "end": 4484.88, "text": "für Qt-Caps früher, die sahen halt scheiße aus, oder Mac-Skins oder sonst was. Ja, das"}, {"id": 463, "start": 4484.88, "end": 4490.52, "text": "ist das. Also ich finde den Ansatz, wie du das mit Electron hast, eigentlich ganz sinnvoll,"}, {"id": 464, "start": 4490.52, "end": 4504.52, "text": "oder wie sie es in QML machen. C++ ist eklig. Zum Beispiel, mein Lieblingsbeispiel, warum"}, {"id": 465, "start": 4504.52, "end": 4510.64, "text": "C++ kacke ist, oder was sich zumindest das Standard-Cremium denkt, ist, warum gibt es"}, {"id": 466, "start": 4510.64, "end": 4522.92, "text": "in C++, im C++-String, warum gibt es kein To-Upper? Gibt es nicht. Ich meine allein"}, {"id": 467, "start": 4522.92, "end": 4527.56, "text": "schon, dass das Internet voll ist mit 206 Freestyles, wie ich in String To-Upper kaste,"}, {"id": 468, "start": 4527.56, "end": 4532.56, "text": "oder nicht kaste, To-Upper mache, in C++, dass sie teilweise empfehlen, man soll Boost"}, {"id": 469, "start": 4532.56, "end": 4539.56, "text": "für eine Boost-String-Implementierung dafür verwenden. Ich weiß, dass es das hier gibt,"}, {"id": 470, "start": 4539.56, "end": 4546.92, "text": "aber, also, ich sage es mal ganz ehrlich, guckt euch das mal an. Ich meine, ernsthaft, ein"}, {"id": 471, "start": 4546.92, "end": 4558.92, "text": "fucking String To-Upper, ist das euer Ernst, C++-Cremium? Was ist mit euch los? Was ist"}, {"id": 472, "start": 4558.92, "end": 4569.08, "text": "das Problem, bitte schön an String, oder was auch immer hier, Upper, oder so. Das ist"}, {"id": 473, "start": 4569.08, "end": 4573.76, "text": "doch hässlich wie die Nacht, das hier. Warum ist das nicht in der Standard-String-Klasse"}, {"id": 474, "start": 4573.76, "end": 4578.84, "text": "drin? Das ist so ein Ding, wo ich mich an vielen Stellen in C++ frage, warum ist das so inkonsistent"}, {"id": 475, "start": 4578.84, "end": 4586.16, "text": "und warum ist so einfache Sachen so kompliziert? Genauso, dass es drei oder vier verschiedene"}, {"id": 476, "start": 4586.16, "end": 4598.56, "text": "Varianten gibt, wie du Iterator machst. Spread the Beast, 11 Monate lang, schön, exzellent."}, {"id": 477, "start": 4598.56, "end": 4605.16, "text": "Was genau macht das? Costa, das ist genau die richtige Frage. Weil ganz ehrlich, was"}, {"id": 478, "start": 4605.16, "end": 4612.6, "text": "genau macht das eigentlich? Und vor allem, wie scheiße lesbar ist das denn? Also was"}, {"id": 479, "start": 4612.6, "end": 4620.04, "text": "das macht, ist, es macht dieses hier, also Test-String, macht es zu Test-String nur in"}, {"id": 480, "start": 4620.04, "end": 4627.08, "text": "Großbuchstaben. Der loopt quasi über jeden einzelnen Character in diesem String drinnen"}, {"id": 481, "start": 4627.08, "end": 4635.44, "text": "und printet ihn dann quasi in Groß. Also schau mal, komplett wir. Dazu kommt ja noch"}, {"id": 482, "start": 4635.44, "end": 4644.0, "text": "einmal die Geschichte, dass das nur funktioniert, wenn es ein poplicher ASCII-String ist. Macht"}, {"id": 483, "start": 4644.0, "end": 4650.88, "text": "mal, wir haben es doch letztens probiert, macht mal UTF-8, oder Schwachsinn, nicht UTF-8,"}, {"id": 484, "start": 4650.88, "end": 4659.28, "text": "macht mal Unicode-Strings in C++. Alter, das ist Brechreiz, kompletter Brechreiz. Weil"}, {"id": 485, "start": 4659.28, "end": 4664.52, "text": "der Witz ist ja, wenn es eine gute Implementierung ist, dann kann es mir erstmal scheißegal"}, {"id": 486, "start": 4664.52, "end": 4672.84, "text": "sein, ob das intern UTF-8 ist, UTF-16, UTF-32 oder UTF-69. Ich will mich da ehrlich gesagt"}, {"id": 487, "start": 4672.84, "end": 4677.52, "text": "überhaupt nicht mit beschäftigen müssen. Bei.NET ist es teilweise auch schon ein bisschen"}, {"id": 488, "start": 4677.52, "end": 4682.96, "text": "fragwürdig..NET verwendet historisch gesehen, glaube ich, UTF-16 oder irgendein Vorgänger"}, {"id": 489, "start": 4682.96, "end": 4692.16, "text": "von UTF-16 für ihre Strings. Das ist zu 90% ok. Es wird eklig, wenn du 4-byte-Character"}, {"id": 490, "start": 4692.16, "end": 4699.68, "text": "hast wie Emojis zum Beispiel. Dann wird es schon im Handling ein bisschen abartig, ja."}, {"id": 491, "start": 4699.68, "end": 4708.36, "text": "Aber in C++ ist es schon mal komplett wir. Quai, 5 Monate, danke schön. Hab ich vielleicht"}, {"id": 492, "start": 4708.36, "end": 4714.64, "text": "schon vorher gelesen, aber nochmal. Huge Subscription. Scrusix, 3 Monate, auch nochmal"}, {"id": 493, "start": 4714.64, "end": 4720.64, "text": "am Start, exzellent. Die Standard muss noch verbessert werden, dafür gibt es halt Boosts."}, {"id": 494, "start": 4720.64, "end": 4725.28, "text": "Ja, leider, leider. Ich weiß nicht, was die seit den letzten 15 Jahren machen im C++-Cremium,"}, {"id": 495, "start": 4725.28, "end": 4729.0, "text": "dass die so einfache Sachen in der Standard-Library nicht drin haben. Zumal das Problem ja ist,"}, {"id": 496, "start": 4729.0, "end": 4734.04, "text": "mit Boost, wenn du zum Beispiel irgendeinen Arduino oder einen ESP bastelst, da ist halt"}, {"id": 497, "start": 4734.04, "end": 4739.8, "text": "außer Standard-Library nichts. Da ist mit Boost nichts. Max, wie machst du Emojis to"}, {"id": 498, "start": 4739.8, "end": 4759.12, "text": "upper? Gar nicht. To upper machst du logischerweise nur normale Characters. Ja, genau, in.NET"}, {"id": 499, "start": 4759.12, "end": 4770.52, "text": "ist das einfacher mit den Encodings. Ja. Und es gibt noch, wie gesagt, es gibt noch zig,"}, {"id": 500, "start": 4770.52, "end": 4775.68, "text": "zig, zig andere. Ich meine, manche meine Standard-Lieblingstage ist halt über C++ zu"}, {"id": 501, "start": 4775.68, "end": 4785.08, "text": "flammen. Was haben die sich zum Beispiel mit ihrer Lambda-Syntax gedacht? Ugly, genau,"}, {"id": 502, "start": 4785.08, "end": 4795.84, "text": "ugly as fuck. Guck mal, wenn die erste Autovervollständigung bei Google ist C++ Lambda-Syntax ugly, das"}, {"id": 503, "start": 4795.84, "end": 4811.36, "text": "sagt doch schon mal alles aus. Ey, oh, wenn ich das schon sehe. Das ist auch so was, was"}, {"id": 504, "start": 4811.36, "end": 4818.16, "text": "mich in C++ abfuckt. Diese Iterator-Geschichte, die total inkonsistent ist. War es denn, war"}, {"id": 505, "start": 4818.16, "end": 4826.6, "text": "es denn so schwer, war es denn so schwer, eine Array-Klasse zu machen oder eine List-Klasse"}, {"id": 506, "start": 4826.6, "end": 4833.16, "text": "oder eine Vector-Klasse, die eine Sort-Methode hat? Warum, warum, warum kann man, warum kann"}, {"id": 507, "start": 4833.16, "end": 4841.24, "text": "man in C++ nicht? Übrigens im Qt-Vector, in der Qt-List kann man das machen. Die haben"}, {"id": 508, "start": 4841.24, "end": 4848.32, "text": "das nämlich ordentlich gemacht und nicht wie die Kack-Standard-Library das macht. So,"}, {"id": 509, "start": 4848.32, "end": 4862.36, "text": "warum, warum kann ich, warum kann ich in C++ nicht sowas hier machen? Ist das zu kompliziert"}, {"id": 510, "start": 4862.36, "end": 4868.84, "text": "oder ist das zu einfach für C++-Leute, sagen die, oh nee, also das kann man schon ziemlich"}, {"id": 511, "start": 4868.84, "end": 4872.76, "text": "gut lesen. Das ist keine gute Idee, das müssen wir anders machen. So, und was machen die"}, {"id": 512, "start": 4872.76, "end": 4884.96, "text": "in C++ stattdessen? In C++ kommt dann Standard-Sort-V-Beginn-V-End. Ah, frag mich nicht wie der Kram"}, {"id": 513, "start": 4884.96, "end": 4890.52, "text": "überhaupt, wie geht denn das überhaupt in C++ richtig? Ja, haben wir hier eben ein Beispiel?"}, {"id": 514, "start": 4890.52, "end": 4906.12, "text": "What the fuck, Alter, was ist das denn? Ist das euer Ernst? Kann man, kann man direkt,"}, {"id": 515, "start": 4906.12, "end": 4915.2, "text": "kann man direkt so machen? Geht das mittlerweile? Ich glaube, das wäre ja schonmal ein Anfang,"}, {"id": 516, "start": 4915.2, "end": 4944.56, "text": "wenn das funktioniert. Nee, nee, geht nicht. Ja, ich mein, was, was, was ist, was ist los"}, {"id": 517, "start": 4944.56, "end": 4953.76, "text": "mit denen? Ja, das ist, wenn man nur, wenn man nur hier Range sortieren will. Ja, Ranges"}, {"id": 518, "start": 4953.76, "end": 4957.72, "text": "ist auch so ein Ding, ich könnte echt Stunden über C++ mich aufregen, aber ich mein sowas"}, {"id": 519, "start": 4957.72, "end": 4970.84, "text": "hier, was, was, was denkt man sich dabei denn? C++-Standard-Clip ist cancer. F, nee. Dazu"}, {"id": 520, "start": 4970.84, "end": 4979.28, "text": "kommt auch ne Sache, die in C++ einfach absoluter Crap ist, wo sie jetzt mit C++ 20 oder, nee,"}, {"id": 521, "start": 4979.28, "end": 4986.48, "text": "wie heißt denn, 0x oder so, nee, wie heißt denn das überhaupt? Also das neue C++, man"}, {"id": 522, "start": 4986.48, "end": 4990.4, "text": "kann sich ja in C++ noch nicht immer merken, wie die Standards heißen, also das neue, was"}, {"id": 523, "start": 4990.4, "end": 4997.68, "text": "jetzt rauskommt, dass man in C++ immer noch mit Header-Files rumhantiert. Es ist im Jahr"}, {"id": 524, "start": 4997.68, "end": 5005.04, "text": "2020 kompletter Witz, dass man solche Dinger hier braucht überhaupt in Header-Files noch,"}, {"id": 525, "start": 5005.04, "end": 5010.0, "text": "dass der Compiler nicht verreckt beim Compilen. Aber das ist nicht der Compiler, das ist wahrscheinlich"}, {"id": 526, "start": 5010.0, "end": 5013.88, "text": "der Linker vorher. Das ist nicht verreckt beim Compiler, dass ich so einen Kack überhaupt"}, {"id": 527, "start": 5013.88, "end": 5023.56, "text": "einfügen muss. Wo sind wir denn 2020? So, C++ braucht heute noch diese dämliche Unterscheidung"}, {"id": 528, "start": 5023.56, "end": 5030.8, "text": "von Header-Files und Programm-Code-Files anstatt, dass man es machen würde, wie jede andere"}, {"id": 529, "start": 5030.8, "end": 5034.44, "text": "Programmiersprache, die glaube ich in den letzten 10 Jahren, 15 Jahren, was auch immer"}, {"id": 530, "start": 5034.44, "end": 5040.32, "text": "rausgekommen ist, die ein halbwegs modernes, gescheites Modulsystem haben oder in irgendeiner"}, {"id": 531, "start": 5040.32, "end": 5048.8, "text": "Art und Weise Metadata haben, wo der ganze Kram drin steht. Kann man Visual Studio Code"}, {"id": 532, "start": 5048.8, "end": 5053.84, "text": "Programme kompilieren und ausführen? Klar, wenn du einen Compiler hast, kann er ja hier."}, {"id": 533, "start": 5053.84, "end": 5063.36, "text": "Ups, warum habe ich das jetzt gestoppt? So. Warum? Verstehe ich nicht, warum das immer"}, {"id": 534, "start": 5063.36, "end": 5071.16, "text": "noch so ein Ding ist. Ich finde es gerade Amazon, wie du dich so aufrückst zu 10++, da kannst"}, {"id": 535, "start": 5071.16, "end": 5080.36, "text": "dich ja auch übelst aufregen. Es gibt übrigens auch keinen. Dadurch, dass die immer noch"}, {"id": 536, "start": 5080.36, "end": 5091.76, "text": "dieses komische Konstrukt von Pre-Processor, Header-Files und Includes verwenden, also"}, {"id": 537, "start": 5091.76, "end": 5095.92, "text": "wenn C++-Programme kompiliert werden, dann machen die es ja aktuell so, die Includen"}, {"id": 538, "start": 5095.92, "end": 5103.6, "text": "quasi alles in einen Riesen-File und dann kompilieren sie es. Das ist ja alles nur Copy-Paste,"}, {"id": 539, "start": 5103.6, "end": 5111.08, "text": "diese ganzen Include-Header-Geschichten. Dadurch, dass sie das immer noch machen und kein gescheites"}, {"id": 540, "start": 5111.08, "end": 5117.4, "text": "Modulsystem haben, kein gescheites Repo haben oder irgendwo, irgendwie eine Möglichkeit,"}, {"id": 541, "start": 5117.4, "end": 5122.6, "text": "dass du sagst, ja, mein Programm exportiert die und die Funktion, dass du irgendein Metadata-File"}, {"id": 542, "start": 5122.6, "end": 5127.08, "text": "hast, was auch immer, halt irgendein ordentliches Modulsystem, hast du auch keinen ordentlichen"}, {"id": 543, "start": 5127.08, "end": 5132.16, "text": "Package-Manager für C++. Jede Programmiersprache, die irgendwie in letzter Zeit rausgekommen"}, {"id": 544, "start": 5132.16, "end": 5142.92, "text": "ist, hat eine halbwegs sinnvolle Möglichkeit, Dependencies aufzulösen und Module bzw. Libraries"}, {"id": 545, "start": 5142.92, "end": 5147.72, "text": "zu installieren, die man braucht, die man dann auch gescheit gemanagt hat. In C++ ist"}, {"id": 546, "start": 5147.72, "end": 5158.84, "text": "es wie 1917 Header-Files Copy-Pasten von GitHub. Ja, ich weiß, es gibt ein paar Versuche,"}, {"id": 547, "start": 5158.84, "end": 5164.16, "text": "aber nichts hat sich durchgesetzt. Aber C++ ist nicht in letzter Zeit rausgekommen. Doch,"}, {"id": 548, "start": 5164.16, "end": 5181.36, "text": "die sind seit, glaub, was war die erste moderne C++-Version? Zehn? Dreizehn? Elf, elf, genau."}, {"id": 549, "start": 5181.36, "end": 5189.4, "text": "So, die erste halbwegs moderne C++-Elf und die sagen seitdem, dass modern C++ quasi nichts"}, {"id": 550, "start": 5189.4, "end": 5195.64, "text": "mehr mit Oldschools C++ zu tun hat. Also, die heben das, die stellen das so weiter vor"}, {"id": 551, "start": 5195.64, "end": 5203.08, "text": "und die sagen es auch selbst, C++ ist eine neue Sprache. Mittlerweile. Und C++, vor allem,"}, {"id": 552, "start": 5203.08, "end": 5206.92, "text": "wenn man halt ein Gremium hat, was da jetzt schon zehn Jahre dran arbeitet, neue Sachen"}, {"id": 553, "start": 5206.92, "end": 5214.52, "text": "macht, C++ muss sich da auch am Standard mit modernen Sprachen messen können. Oder das"}, {"id": 554, "start": 5214.52, "end": 5224.56, "text": "können sie nicht. Ich mein, so ein Package-Manager. Und ich mein, damit nicht diese Community-Geschichten,"}, {"id": 555, "start": 5224.56, "end": 5229.56, "text": "sondern ein offizieller Package-Manager und ein offizielles Repo und ein offizielles"}, {"id": 556, "start": 5229.56, "end": 5238.4, "text": "Dependency-Management-Tool. Ja, sowas, wie es Jam ist bei Ruby, wie es NPM suckt, aber"}, {"id": 557, "start": 5238.4, "end": 5246.76, "text": "auch NPM ist für Node oder Cargo Rust. Rust macht das richtig gut. Rust ist eine Sache,"}, {"id": 558, "start": 5246.76, "end": 5252.96, "text": "die kann man sehr schön mit C und C++ vergleichen. Rust hat alles das gemacht, was man von einer"}, {"id": 559, "start": 5252.96, "end": 5257.76, "text": "modernen Sprache erwarten würde, um es dem User möglichst einfach zu machen. Wenn du"}, {"id": 560, "start": 5257.76, "end": 5267.2, "text": "Rust installierst, dann kriegst du einen Package-Manager und ein Projekt-Management-Tool und ein Projektverwaltungstool"}, {"id": 561, "start": 5267.2, "end": 5272.84, "text": "mit Cargo dabei. Du installierst Rust, du hast Cargo-Commando-Zeilen-Tool, damit kannst du"}, {"id": 562, "start": 5272.84, "end": 5280.48, "text": "neue Apps anlegen und du kannst gleichermaßen neue Dependencies auflösen und alles. Wunderbar."}, {"id": 563, "start": 5280.48, "end": 5285.08, "text": "Top. Und das könnten die in C++ auch machen, das ist überhaupt kein Problem, aber sie"}, {"id": 564, "start": 5285.08, "end": 5293.16, "text": "machen es nicht. Die können das ja auch meinetwegen rückwärts kompatibel lassen, da spricht"}, {"id": 565, "start": 5293.16, "end": 5297.84, "text": "ja überhaupt nichts dagegen. Man muss ja nicht die alten Sachen rausschmeißen, um neue Sachen"}, {"id": 566, "start": 5297.84, "end": 5303.2, "text": "zu supporten, außer es widerspricht sich. Da müsste man sich das mal angucken. Alleinschauen,"}, {"id": 567, "start": 5303.2, "end": 5314.4, "text": "ich war jetzt gerade bei der Lambda-Syntax von C++. Die ist so unglaublich eklig. Also"}, {"id": 568, "start": 5314.4, "end": 5319.32, "text": "die Lambda-Syntax von C++ ist sowas hier. Ich hoffe, ich krieg's jetzt überhaupt richtig"}, {"id": 569, "start": 5319.32, "end": 5324.08, "text": "aus dem Kopf. Er macht erst einmal eckige Klammer, dann macht man geschweifte Klammer"}, {"id": 570, "start": 5324.08, "end": 5328.24, "text": "für Funktionsaufruf und dann macht man den Body für die Funktion. Also dann hier macht"}, {"id": 571, "start": 5328.24, "end": 5336.52, "text": "man dann sowas wie hier Printf. Also, das da ist quasi die eigentliche Logik, die ausgeführt"}, {"id": 572, "start": 5336.52, "end": 5342.44, "text": "wird. So, und das hier ist, wo man angeben muss, sprich, welche Variablen man captchern"}, {"id": 573, "start": 5342.44, "end": 5346.92, "text": "will. Es reicht in C++ nicht, wenn ich jetzt hier zum Beispiel sage, ich hab hier oben"}, {"id": 574, "start": 5346.92, "end": 5354.08, "text": "sowas wie, keine Ahnung, int a. So, wenn ich das hier mache zum Beispiel, das reicht"}, {"id": 575, "start": 5354.08, "end": 5358.6, "text": "in C++ nur manchmal, nur manchmal, ansonsten gibt's merkwürdige Compiler Errors. Ich müsste"}, {"id": 576, "start": 5358.6, "end": 5362.68, "text": "das hier, glaube ich, irgendwie angeben oben dann. Oder ich glaube, ich muss sogar sagen,"}, {"id": 577, "start": 5362.68, "end": 5367.44, "text": "dass ich nur eine Reference zu a will oder sowas. Also, ganz merkwürdige Geschichte."}, {"id": 578, "start": 5367.44, "end": 5373.72, "text": "Meistens funktioniert's allerdings so. Und was ich bei der C++-Lambda-Syntax richtig"}, {"id": 579, "start": 5373.72, "end": 5382.16, "text": "eklig finde ist, warum hat man mal wieder Zeichen genommen, die in der Sprache schon"}, {"id": 580, "start": 5382.16, "end": 5393.92, "text": "an zig anderen Stellen verwendet werden? Warum hat man nicht, ich mein, ich bin kein"}, {"id": 581, "start": 5393.92, "end": 5399.32, "text": "JavaScript, ich bin kein JavaScript-Freund, ja. Aber in JavaScript würdest du zum Beispiel"}, {"id": 582, "start": 5399.32, "end": 5403.68, "text": "hier sowas machen. Oder nehmen wir die C-Syntax, die finde ich auch ganz schick. In C++"}, {"id": 583, "start": 5403.68, "end": 5411.44, "text": "könntest du sowas hier machen zum Beispiel. Das ist aber wahrscheinlich wieder für C++"}, {"id": 584, "start": 5411.44, "end": 5417.08, "text": "zu lesbar. Da hat das C++-Cremium gesagt, ah, fuck, also wenn das hier jeder lesen kann,"}, {"id": 585, "start": 5417.08, "end": 5420.52, "text": "dann brauchen wir keine Experten mehr. Und wer soll uns da noch Geld bezahlen, wenn das"}, {"id": 586, "start": 5420.52, "end": 5426.84, "text": "jeder lesen kann? Das geht nicht. Ja, und die etwas längere Variante in C-Sharp wäre"}, {"id": 587, "start": 5426.84, "end": 5432.2, "text": "dann das hier. So. Das ist Discard, den kann man übrigens auch weglassen, wenn man keine"}, {"id": 588, "start": 5432.2, "end": 5437.24, "text": "Parameter hat. Dann hätte man sowas. Das ist doch wunderbar lesbar, das ist doch top,"}, {"id": 589, "start": 5437.24, "end": 5446.28, "text": "da kann man sich überhaupt nicht drüber beschweren. Aber nicht so in C++. Vielleicht leuchtet"}, {"id": 590, "start": 5446.28, "end": 5453.4, "text": "mir nicht ein. Aber genug der ganze, wir wollten uns glaube ich noch den.NET-Paketmanager"}, {"id": 591, "start": 5453.4, "end": 5464.08, "text": "angucken. Was sind eigentlich Variablen? Oh, das ist jetzt aber, das ist jetzt ziemlich"}, {"id": 592, "start": 5464.08, "end": 5470.28, "text": "basic von den C++ Sachen. Variablen sind Speicher, man könnte es eigentlich im Prinzip"}, {"id": 593, "start": 5470.28, "end": 5483.92, "text": "Speicher mit einem Namen dran. Das ist eine Variable. Arbeitsspeicher mit einem Label dran."}, {"id": 594, "start": 5483.92, "end": 5497.6, "text": "Ja, aber wie gesagt, es gibt zig, zig Varianten, wo ich mich über C++ aufregen kann. Dass"}, {"id": 595, "start": 5497.6, "end": 5502.68, "text": "das Ding zum Beispiel keinen gescheinen Inam-Support hat. Aber wir hören jetzt auf mit C++. Genug,"}, {"id": 596, "start": 5502.68, "end": 5509.84, "text": "genug C++. Wir wollen uns den Package Manager von Windows mal angucken. Windows Package"}, {"id": 597, "start": 5509.84, "end": 5520.16, "text": "Manager Review. 19. Mai. You are going to be able to win get. Die hatten sowas doch"}, {"id": 598, "start": 5520.16, "end": 5537.32, "text": "schon mal. Ich habe sogar mal ein Video dazu gemacht. One get hieß das Ding. Und warum"}, {"id": 599, "start": 5537.32, "end": 5543.68, "text": "gibt es da jetzt schon wieder 50 verschiedene Package Manager von Microsoft? Na gut. Win"}, {"id": 600, "start": 5543.68, "end": 5551.04, "text": "win. Das Problem, was ich sehe, ist, muss ich jetzt mal sagen, warum ich glaube, dass"}, {"id": 601, "start": 5551.04, "end": 5557.92, "text": "auch wieder nicht sich das Ganze durchsetzen wird, ist, Microsoft, es reicht nicht, einen"}, {"id": 602, "start": 5557.92, "end": 5562.56, "text": "Package Manager in Windows auszuliefern. Man braucht auch offizielle Repositories dafür."}, {"id": 603, "start": 5562.56, "end": 5570.28, "text": "Einen Package Manager allein bringt gar nichts. Guckt euch in C++ an. Für C++ gibt es auch"}, {"id": 604, "start": 5570.28, "end": 5577.08, "text": "4-5 verschiedene Package Manager. Verwendet keiner, weil es kein offizielles Plast Repository"}, {"id": 605, "start": 5577.08, "end": 5583.28, "text": "gibt. Und das muss es von Microsoft geben. Okay, probieren wir das Ganze mal aus. Win"}, {"id": 606, "start": 5583.28, "end": 5588.72, "text": "get CLI. Ich glaube, das probieren wir mal an unserer Windows VM aus. Wir haben schon"}, {"id": 607, "start": 5588.72, "end": 5601.92, "text": "genug rumgebastelt. Haben wir überhaupt noch eine Windows VM? Wir haben keine Windows"}, {"id": 608, "start": 5601.92, "end": 5609.44, "text": "VM mehr. Na gut, dann haben wir es jetzt hier. Übrigens, was ich verwende als Package Manager"}, {"id": 609, "start": 5609.44, "end": 5618.12, "text": "aktuell ist halt der hier. Der ist ziemlich gut, finde ich. Ist ziemlich gut. Das Problem"}, {"id": 610, "start": 5618.12, "end": 5624.8, "text": "dabei ist halt auch, es ist kein offizielles Repository. Es ist kein offizielles Repository,"}, {"id": 611, "start": 5624.8, "end": 5631.12, "text": "das heißt, da kannst du dir relativ schnell, das wird von, keine Ahnung, 1-2-3 Leuten maintained,"}, {"id": 612, "start": 5631.12, "end": 5635.8, "text": "da fängst du dir halt relativ schnell, vielleicht mal, wenn die nicht aufpassen, ein Virus ein"}, {"id": 613, "start": 5635.8, "end": 5646.76, "text": "und das sollte damit nicht passieren mit einem offiziellen Package Manager. Oh. Windows 10"}, {"id": 614, "start": 5646.76, "end": 5654.76, "text": "ist ein Insider-Build. Wir müssen noch eine VM installieren, Leute. Okay, easy. Oh, wie"}, {"id": 615, "start": 5654.76, "end": 5665.6, "text": "spricht man das denn aus? Hulien? Okay. Become an Insider, excellent. Machen wir. Da ist"}, {"id": 616, "start": 5665.6, "end": 5690.24, "text": "es wieder. Da ist es wieder. Man kann das einfach runterladen. Win. Win CLI. Excellent."}, {"id": 617, "start": 5690.24, "end": 5696.48, "text": "Patrick will Hulien mieten, okay. Ihr Patrick, Mieteser. Oh, die sind alle so glücklich"}, {"id": 618, "start": 5696.48, "end": 5704.88, "text": "immer auf den, oh, Leute, was ist da los? Das geht aber nicht. Die sind viel zu dicht"}, {"id": 619, "start": 5704.88, "end": 5732.2, "text": "beieinander. Okay, wir haben Hulien gemietet. Release. Aha. AppXBundle. Ja, wo wir gerade"}, {"id": 620, "start": 5732.2, "end": 5740.84, "text": "wieder bei dreckigen UWP-Packages wären. Die halten alle die Luft an. Ja, genau. Wahrscheinlich."}, {"id": 621, "start": 5740.84, "end": 5746.52, "text": "Ja, stimmt. Irgendwie habe ich keinen Bock, den Kram zu installieren, aber mir offen System"}, {"id": 622, "start": 5746.52, "end": 5751.32, "text": "jetzt. Oh, was sagt denn der Windows Store? Der Windows-Store sagt, es gibt Updates."}, {"id": 623, "start": 5751.32, "end": 5756.96, "text": "Habe ich das gerade richtig gesehen? Habe ich das gerade oben links? Oben links war doch"}, {"id": 624, "start": 5756.96, "end": 5764.68, "text": "gerade irgendwas mit Updates drin, oder? Stand da nicht gerade drei Updates? Ja, hier, guck"}, {"id": 625, "start": 5764.68, "end": 5771.56, "text": "mal. Stand da nicht oben irgendwas drei Updates gerade und ich habe es nicht gesehen? Die"}, {"id": 626, "start": 5771.56, "end": 5778.72, "text": "Xbox Game Bar, your phone. Was, mein Phone? Ich kann mein Phone upgraden, das ist ja poggers."}, {"id": 627, "start": 5778.72, "end": 5785.6, "text": "Und der 3D-Viewer, ja. Dazu kann ich nur sagen, und gleich wieder weg damit."}, {"id": 628, "start": 5785.6, "end": 5793.24, "text": "Ok, Microsoft Desktop App Installer. Leute, irgendwie ist es mir dazu, eine Windows-VM"}, {"id": 629, "start": 5793.24, "end": 5797.56, "text": "zu installieren für den Kram. Ich weiß auch nicht. Kennt ihr schon, ich zeige ihn immer"}, {"id": 630, "start": 5797.56, "end": 5807.76, "text": "wieder gerne. Ich zeige ihn immer wieder gerne, den ISO-Download-Hack. Passt mal auf,"}, {"id": 631, "start": 5807.76, "end": 5812.84, "text": "mal gucken, ob der noch geht. Ihr seht ja hier. Chat, nicht spoilern, nicht spoilern,"}, {"id": 632, "start": 5812.84, "end": 5819.84, "text": "weil das verdirbt immer den Effekt, ja. Excellent Trick. Also, man sieht ja hier, wenn man Windows"}, {"id": 633, "start": 5819.84, "end": 5826.88, "text": "10 ISO runterladen will, geht das nicht. Man kann dieses Tool runterladen, um dann, dass"}, {"id": 634, "start": 5826.88, "end": 5830.04, "text": "sich selbst ein ISO zu erzeugen. Ich zeige euch jetzt mal was, was man machen kann. Ihr"}, {"id": 635, "start": 5830.04, "end": 5837.28, "text": "geht einfach hier drauf und sagt Developer Mode und dann stellt ihr um auf irgendwie"}, {"id": 636, "start": 5837.28, "end": 5842.92, "text": "ein Mobile-Gerät, sagen wir jetzt irgendwie keine Ahnung, ein iPhone 6 oder sowas. Dann"}, {"id": 637, "start": 5842.92, "end": 5853.64, "text": "aktualisiert ihr die Seite und ISO-Download. Fertig, das war's. Easy. Easy as fuck. Easy"}, {"id": 638, "start": 5853.64, "end": 5864.68, "text": "as fuck. Jetzt können wir uns ISO runterladen. Bestätigen. Exellent. Englisch. International."}, {"id": 639, "start": 5864.68, "end": 5876.32, "text": "Bestätigen. Sehr spät. Schon geil, oder? Das ist schon geil. Ja, und dann macht ihr"}, {"id": 640, "start": 5876.32, "end": 5879.64, "text": "die Developer-Tools aus. Ihr könnt auch die Developer-Tools ausmachen, dann bleibt die"}, {"id": 641, "start": 5879.64, "end": 5887.76, "text": "Seite offen. Und ihr seht, kaum sind die Developer-Tools aus, geht's wieder nicht mehr. Geht's wieder"}, {"id": 642, "start": 5887.76, "end": 5894.96, "text": "nicht mehr. Microsoft-Mitarbeiter hassen diesen Trick. Wie behemmert ist das eigentlich?"}, {"id": 643, "start": 5894.96, "end": 5902.28, "text": "Costa, es ist gar nicht so behemmert, weil, überleg dir mal, du bist ein User, der noch"}, {"id": 644, "start": 5902.28, "end": 5908.28, "text": "kein Windows hat. Wenn du noch kein Windows hast, kannst du ja auch nicht das Windows-Tool"}, {"id": 645, "start": 5908.28, "end": 5913.56, "text": "runterladen, um dir ein ISO zu erstellen. Also, die Seite schaltet halt um, sobald sie"}, {"id": 646, "start": 5913.56, "end": 5919.24, "text": "denkt, du bist kein Windows-User. Ist eigentlich ganz logisch, weil als nicht Windows-User brauchst"}, {"id": 647, "start": 5919.24, "end": 5926.96, "text": "du ja das Windows-ISO, um Windows installieren zu können. Also, ganz so low-brain ist es"}, {"id": 648, "start": 5926.96, "end": 5936.16, "text": "von Microsoft gar nicht, aber ich finde es trotzdem ziemlich fail. Frage für einen"}, {"id": 649, "start": 5936.16, "end": 5944.16, "text": "Freund, gibt es eine UDP-Porn-App? Wozu ist das Übertragungsprotokoll für eine Porn-App"}, {"id": 650, "start": 5944.16, "end": 5963.52, "text": "wichtig? Brauchst du Echtzeit-VR-Porn, da TCP ist bloated? Okay, wir installieren uns"}, {"id": 651, "start": 5963.52, "end": 5973.16, "text": "mal eine Windows-VM-Com. Scheiß drauf, machen wir mal. Schadet ja nix. New, Virtual Machine,"}, {"id": 652, "start": 5973.16, "end": 5987.04, "text": "Custom. Geht ja auch schnell, dauert 5 Minuten oder so. Custom, Windows 10. Ja, meinetwegen."}, {"id": 653, "start": 5987.04, "end": 6003.64, "text": "Auch gut. 3 Cores, auch gut. 4096, ja, 5G-RAM, auch gut. Nutt, excellent, excellent, excellent,"}, {"id": 654, "start": 6003.64, "end": 6011.4, "text": "excellent. Single-File, 60, ja, 40G reichen auch. Excellent, excellent, excellent, alles,"}, {"id": 655, "start": 6011.4, "end": 6020.8, "text": "alles exquisite, excellent. Jetzt dreht er, jetzt dreht er durch. So, printer raus, Soundkarte"}, {"id": 656, "start": 6020.8, "end": 6032.28, "text": "raus, da kommt Cortana gar nicht auf die Idee uns voll zu texten gleich. So, save. Die CD,"}, {"id": 657, "start": 6032.28, "end": 6049.04, "text": "ist das ISO fertig? Nee, 40 Sekunden. ADB-Push, excellent, big-break-chat. UEFI einstellen,"}, {"id": 658, "start": 6049.04, "end": 6062.36, "text": "ja, warum nicht? Haben wir doch gerade gemacht. Oder muss man das noch mal machen vorher?"}, {"id": 659, "start": 6062.36, "end": 6089.4, "text": "Nee. Me-Came, 6 Monate, Dankeschön. Poggers. Chat, ich verteile mal wieder ein Gratis-Sub,"}, {"id": 660, "start": 6089.4, "end": 6101.12, "text": "und zwar, wir machen das ja ab und zu, gleich geht's los. Ihr müsst wieder erraten, aber"}, {"id": 661, "start": 6101.12, "end": 6106.12, "text": "erst wenn ich sag, dass es losgeht, ihr müsst wieder erraten, bei wieviel Subs ich gerade"}, {"id": 662, "start": 6106.12, "end": 6117.64, "text": "bin. Aber vorher muss ich erstmal wieder einstellen. Oh, mein FFZ ist kaputt. Mein FFZ ist kaputt."}, {"id": 663, "start": 6117.64, "end": 6142.04, "text": "Leute, es geht noch nicht los."}, {"id": 664, "start": 6142.04, "end": 6161.12, "text": "Chat, ich muss nämlich erstmal einstellen, dass ich im Chat möglichst viel sehe. Ich"}, {"id": 665, "start": 6161.12, "end": 6171.56, "text": "weiß, ihr spammt schon gerne, ne? Wo steht denn das in FFZ, dass ich die History einstellen"}, {"id": 666, "start": 6171.56, "end": 6197.88, "text": "kann? Hier Chat, Chat, Kanal, Chat, okay, Inline, Raum, Erscheinung, okay, Breite, Schriftgröße,"}, {"id": 667, "start": 6197.88, "end": 6207.8, "text": "ich brauche die Chat-History, wie kann man die verhalten, verhalten? Nee. Wie kann man"}, {"id": 668, "start": 6207.8, "end": 6211.76, "text": "den FFZ, ah hier, Länge des Chat-Verlaufs, 5000, das sollte doch eigentlich reichen,"}, {"id": 669, "start": 6211.76, "end": 6223.92, "text": "oder? Chat, das sollte eigentlich reichen. Also, okay, los geht's. Ihr müsst jetzt raten,"}, {"id": 670, "start": 6223.92, "end": 6253.04, "text": "wieviel Subs ich gerade habe, sobald ich das hier reinpoiste. So, jetzt. Okay. Drei, zwei,"}, {"id": 671, "start": 6253.04, "end": 6264.12, "text": "eins, stopp. Okay, also schauen wir mal. Richtige Antwort wäre 201 gewesen. Hat jemand 201?"}, {"id": 672, "start": 6264.12, "end": 6276.64, "text": "Neonominus hat glaube 201, sehe ich das richtig? Und Kawaii Shocks hat auch 201. Der eine,"}, {"id": 673, "start": 6276.64, "end": 6297.4, "text": "du weißt schon 201, oi oi oi. Okay, habt ihr gut gemacht, Leute. Dann kriegt ihr jetzt"}, {"id": 674, "start": 6297.4, "end": 6317.96, "text": "ein paar Abos, wenn es funktioniert. Kommen wir mal, gucken wir mal, ob das klappt. Geht"}, {"id": 675, "start": 6317.96, "end": 6329.0, "text": "das jetzt? Ah, excellent, nice. Funktioniert. Der Neonominus kriegt auch ein. Ihr habt echt"}, {"id": 676, "start": 6329.0, "end": 6334.12, "text": "Glück, alle, die die keine Abos haben, gewinnen. Die, die Abos haben, gewinnen gerade nicht"}, {"id": 677, "start": 6334.12, "end": 6337.88, "text": "mehr. Das ist gut, weil ich habe immer noch keine Ahnung, was ich machen soll, wenn mal"}, {"id": 678, "start": 6337.88, "end": 6341.6, "text": "einer gewinnt, der schon ein Abo hat. Der wird dann hochgestuft, der wird dann auf die"}, {"id": 679, "start": 6341.6, "end": 6348.2, "text": "nächste Tierstufe upgraded oder so, keine Ahnung. Aber ganz einfach abgesehen, das bringt"}, {"id": 680, "start": 6348.2, "end": 6355.88, "text": "ja eh nix, weil ich von meinen 22 Emote Slots oder so immer noch keine, keine, keine Emotes"}, {"id": 681, "start": 6355.88, "end": 6362.8, "text": "bei Pfeiffer gekauft habe. Dabei habe ich eine Riesenliste mit Emote Ideen. Schon ganz"}, {"id": 682, "start": 6362.8, "end": 6372.6, "text": "schön, ganz schön. Monarch, Monarch S. So, da habt ihr eine Runde Subs. Exzellent."}, {"id": 683, "start": 6372.6, "end": 6386.96, "text": "Das ist der Neonominus, hast Glück gehabt. Und das Schöne ist, wer das hier regelmäßig"}, {"id": 684, "start": 6386.96, "end": 6396.2, "text": "verfolgt, der kann sogar sich ziemlich gut ableiten, wie viel Subs ich gerade habe, weil"}, {"id": 685, "start": 6396.2, "end": 6407.6, "text": "so sehr schwanken wird das wahrscheinlich gar nicht. Wo hast du die WinUI 3 DLL gefunden?"}, {"id": 686, "start": 6407.6, "end": 6415.52, "text": "Im Ordner von dem Testprojekt, was man mit den Standardvorlagen anlegen kann. So, jetzt"}, {"id": 687, "start": 6415.52, "end": 6421.96, "text": "müssten es 204 Subs sein, wenn ich richtig lege. Aber das Schöne ist, ich kriege ja"}, {"id": 688, "start": 6421.96, "end": 6426.0, "text": "die Hälfte wieder, wenn ich, nee 205. Habe ich was übersehen? Habe ich, habe ich was"}, {"id": 689, "start": 6426.0, "end": 6441.84, "text": "übersehen? Ach hier, x stürzt, was? x stürze dx, zwei Monate. Dankeschön, habe ich gar"}, {"id": 690, "start": 6441.84, "end": 6459.36, "text": "nicht gesehen. Exzellent. Huge IQ Sub. Und davor hat McCame resubbed, auch ganz schön."}, {"id": 691, "start": 6459.36, "end": 6470.08, "text": "Sehr schön. Neonominus steht bei mir überhaupt nicht drin. Aber du hast schon eine. Ja,"}, {"id": 692, "start": 6470.08, "end": 6481.8, "text": "keine Ahnung. Ja, aber die Twitch Tracker stimmen nicht. Zumindest nicht was Subs angeht."}, {"id": 693, "start": 6481.8, "end": 6495.44, "text": "Also ich habe gerade 5 Euro ausgegeben und davon bekomme ich 2,50 Euro wieder. Das lohnt"}, {"id": 694, "start": 6495.44, "end": 6515.08, "text": "sich natürlich richtig. Ach und steuern, klar. Any key. Win-win. Ja Twitch freut sich."}, {"id": 695, "start": 6515.08, "end": 6533.56, "text": "Okay, Language, Englisch, Time Currency, German. Keyboard, German. So, German no dead key gibt"}, {"id": 696, "start": 6533.56, "end": 6545.64, "text": "es hier nicht. Install. Exzellent. I don't have a product key. Brauchen wir dafür auch"}, {"id": 697, "start": 6545.64, "end": 6556.88, "text": "nicht. Wir installieren Windows 10, Bro. Was ist eigentlich IBM German, so ein uralt Tastaturlayout."}, {"id": 698, "start": 6556.88, "end": 6563.56, "text": "Weiß nicht was der Unterschied ist zwischen German und i-German IBM. Können wir gucken"}, {"id": 699, "start": 6563.56, "end": 6574.12, "text": "während wir installiert. Difference IBM German und German. IBM Keyboard German und"}, {"id": 700, "start": 6574.12, "end": 6602.56, "text": "German. Ah, caps lock ignoriert die Zahlen, okay. Wusste ich gar nicht. Für mich ist"}, {"id": 701, "start": 6602.56, "end": 6610.24, "text": "no dead key nur wichtig, was man unter Windows nicht richtig einstellen kann, dass der Kram"}, {"id": 702, "start": 6610.24, "end": 6623.74, "text": "hier richtig funktioniert. Ja, so sieht es aus. Exz, Windows Installation, läuft sehr"}, {"id": 703, "start": 6623.74, "end": 6629.4, "text": "schön. Haben wir Frametrops? Keine Frametrops Leute, obwohl davon scheinen richtig gut zu"}, {"id": 704, "start": 6629.4, "end": 6635.84, "text": "funktionieren gerade. Dafür funktioniert es bei meinem Warzone beziehungsweise COD Mitspieler"}, {"id": 705, "start": 6635.84, "end": 6640.04, "text": "nicht. Der hat jetzt auch rumgestellt auf Vodafone, bei ihm spackts jetzt übelst rum."}, {"id": 706, "start": 6640.04, "end": 6650.76, "text": "Aber es haben ihm auch DualStack Lite aufs Auge gedrückt glaube ich. Vodafone, Vodafone"}, {"id": 707, "start": 6650.76, "end": 6673.88, "text": "Phone. DualStack Lite, größte Shit ever. So, ähm, ausreichend rumgeflagert, jetzt"}, {"id": 708, "start": 6673.88, "end": 6680.92, "text": "bist du VIP Traffic. Jetzt mal ganz ohne Witz, das ist kein Zufall. Es ist kein, ich kann"}, {"id": 709, "start": 6680.92, "end": 6688.4, "text": "mir nicht vorstellen, dass es Zufall ist, dass, ähm, in dem ab dem Moment, wo der Social"}, {"id": 710, "start": 6688.4, "end": 6696.04, "text": "Media Typ vermute ich mal von Vodafone geantwortet hat, dass es ab dann geht. Das kann ich mir"}, {"id": 711, "start": 6696.04, "end": 6702.92, "text": "nicht vorstellen. Der Zufall ist zu groß. Die haben gesehen, der Typ, dem gucken 20.000"}, {"id": 712, "start": 6702.92, "end": 6709.36, "text": "Leute zu, also auf Twitter 20.000 Follower auf Twitter und der flamet uns jeden Abend"}, {"id": 713, "start": 6709.36, "end": 6714.96, "text": "an öffentlich. Das ist scheiße, das geht nicht. Das müssen wir anders machen und schon"}, {"id": 714, "start": 6714.96, "end": 6723.52, "text": "gehts. Was halt eigentlich total für mich gut ist, aber insgesamt ziemlich scheiße,"}, {"id": 715, "start": 6723.52, "end": 6730.72, "text": "wenn man sich überlegt, dass dadurch es bei allen anderen ja auch nicht besser wird,"}, {"id": 716, "start": 6730.72, "end": 6735.24, "text": "sondern marginal schlechter dadurch, dass es bei mir besser ist, es müsste halt überall,"}, {"id": 717, "start": 6735.24, "end": 6739.6, "text": "man müsste sich halt überall wenigstens drauf verlassen können, dass ein Provider eben"}, {"id": 718, "start": 6739.6, "end": 6743.2, "text": "seinen Job erledigt und es kann ja nicht sein, dass man sich freuen muss, wenn es mal eine"}, {"id": 719, "start": 6743.2, "end": 6747.84, "text": "Woche funktioniert. Es sollte die Ausnahme sein, es sollte immer funktionieren und mal,"}, {"id": 720, "start": 6747.84, "end": 6753.04, "text": "mal kanns Probleme haben, aber bei mir war es mit Vodafone ja so, es hat mal funktioniert"}, {"id": 721, "start": 6753.04, "end": 6774.2, "text": "und die Ausnahme war eigentlich, die Regel war, dass es nicht funktioniert hat. Die Musik"}, {"id": 722, "start": 6774.2, "end": 6792.6, "text": "ist voll MonkaS gerade. Das war Luigi's Mansion, oder? War das Luigi's Mansion Musik? Ok, gucken"}, {"id": 723, "start": 6792.6, "end": 6799.6, "text": "wir mal meine Twitch-Statistik an, während Windows installiert. Oh, es gibt bei mir auch"}, {"id": 724, "start": 6799.6, "end": 6805.24, "text": "gleich Mittagessen und danach muss ich Warzone grinden. Vertress, wann wollt man anfangen?"}, {"id": 725, "start": 6805.24, "end": 6817.0, "text": "Also 13 Uhr gibt es bei mir Mittagessen, aber es geht schnell. Also wir können dann anfangen,"}, {"id": 726, "start": 6817.0, "end": 6836.68, "text": "wenn ihr wollt. Ich arbeite bei 1&1, wenn du günstiges DSL brauchst, HMU. Was ist denn"}, {"id": 727, "start": 6836.68, "end": 6864.48, "text": "HMU? Hau mich um? Nee, was ist HMU? Hit me up! Ah, nicht hau mich um. Wann immer ich will,"}, {"id": 728, "start": 6864.48, "end": 6872.08, "text": "so, ja dann. Ja, dann geh ich jetzt danach im Stream essen und dann gehts los. Leute,"}, {"id": 729, "start": 6872.08, "end": 6876.68, "text": "frage mal an euch. Ich weiß, die meisten Leute sind hier, weil sie Technik-Kram sehen wollen,"}, {"id": 730, "start": 6876.68, "end": 6883.56, "text": "sowas wie heute hier. Leider war heute eher Microsoft und C++ Frame. Soll ich danach"}, {"id": 731, "start": 6883.56, "end": 6888.88, "text": "unser Warzone Zeug streamen soern? Heute ist auch nur Windstream. Also heute verlieren"}, {"id": 732, "start": 6888.88, "end": 6902.88, "text": "wir auch nicht. Ist es correct? Yes, is right. Keyboard-Layout, nein, nein, nein, nein."}, {"id": 733, "start": 6902.88, "end": 6906.72, "text": "Wollt ihr mich veräppeln? Das ist gar nicht das richtige Keyboard-Layout. Ich hab doch"}, {"id": 734, "start": 6906.72, "end": 6918.28, "text": "eben schon das richtige Keyboard-Layout ausgewählt. Haben ja noch nie verloren. Nee. Und ich"}, {"id": 735, "start": 6918.28, "end": 6928.68, "text": "bin auch noch nie sinnlos gestorben irgendwo. Nein. Zum Glück haben wir die Soundkarte ausgebaut"}, {"id": 736, "start": 6928.68, "end": 6957.04, "text": "sonst käme Cortana wieder an Start. Hi, I'm Cortana. Was ist das? Moment, was ist das?"}, {"id": 737, "start": 6957.04, "end": 6975.04, "text": "Loll. Ach du Scheiße. Ach du Scheiße."}, {"id": 738, "start": 6975.04, "end": 6985.96, "text": "actually"}, {"id": 739, "start": 6985.96, "end": 6999.24, "text": "eine"}, {"id": 740, "start": 6999.24, "end": 7010.52, "text": "Okay, das war recht aufwendig das parallel zu Setup."}, {"id": 741, "start": 7010.52, "end": 7021.64, "text": "Personal use, next, achja jetzt haben wir das Problem hier Offline Account muss man"}, {"id": 742, "start": 7021.64, "end": 7022.64, "text": "anklicken."}, {"id": 743, "start": 7022.64, "end": 7025.34, "text": "Wir hatten doch eben jemanden im Chat der gefragt hat wie man Windows jetzt Offline"}, {"id": 744, "start": 7025.34, "end": 7026.34, "text": "aktivieren muss."}, {"id": 745, "start": 7026.34, "end": 7030.8, "text": "Offline Account, da muss man zweimal sagen ja ich weiß, ich weiß, limited experience,"}, {"id": 746, "start": 7030.8, "end": 7045.28, "text": "ich weiß, ich weiß, ja es ist mir klar, so Tests, 1, 2, 3, 4, 5, 6, excellent Passwort,"}, {"id": 747, "start": 7045.28, "end": 7049.52, "text": "das geht mit der Home Version noch, oh weiß ich nicht, weiß ich nicht, Security Question,"}, {"id": 748, "start": 7049.52, "end": 7059.96, "text": "Chat Name, Security Question 2, Nickname und what is first name for your oldest cousin,"}, {"id": 749, "start": 7059.96, "end": 7078.76, "text": "ganz, ganz klar, cute chat, fuck, no, nein, nein, nein, nein, nein, nein, nein, nein,"}, {"id": 750, "start": 7078.76, "end": 7096.76, "text": "nein, nein, nein, nein, nein, nein, nein, achja, die Installation ist wirklich absolut"}, {"id": 751, "start": 7096.76, "end": 7101.68, "text": "failbar Windows immer, du musst erstmal eine halbe Stunde auf Ich will nicht klicken,"}, {"id": 752, "start": 7101.68, "end": 7114.06, "text": "das haben die bewusst gemacht garantiert die die hoffen dass die leute sagen ja die"}, {"id": 753, "start": 7114.06, "end": 7118.6, "text": "fault settings akzeptieren so nach dem motto das schneller geht total hängen geblieben"}, {"id": 754, "start": 7118.6, "end": 7128.88, "text": "bis gleich also ich gehe jetzt was essen gleich wenn ich hier fertig bin 13 uhr kurz nach"}, {"id": 755, "start": 7128.88, "end": 7136.16, "text": "13 uhr dann esse ich schnell was und dann gucken wir dann gucken wir dann gleich also irgendwie"}, {"id": 756, "start": 7136.16, "end": 7147.56, "text": "so 13 30 oder so geht es los mit control alt entf kann man skippen ja aber aber nicht aber"}, {"id": 757, "start": 7147.56, "end": 7160.08, "text": "nicht hier drin oder wie sendet man überhaupt control alt entf ich mache stream aus dann"}, {"id": 758, "start": 7160.08, "end": 7163.76, "text": "spiele ich mich kurz am abend da mache ich dann später stream wieder an was gibt es zu"}, {"id": 759, "start": 7163.76, "end": 7172.2, "text": "essen so hollandaise mit kartoffel und spargel und schinken so weiter jetzt müssen wir erstmal"}, {"id": 760, "start": 7172.2, "end": 7200.56, "text": "for ever tools installieren edge ja ich dich man k.s. weg typical install so ok also wie"}, {"id": 761, "start": 7200.56, "end": 7205.92, "text": "ist das ding jetzt win get win get kann man ausprobieren ok die windows vm höbe ich mir"}, {"id": 762, "start": 7205.92, "end": 7216.12, "text": "mal auf wir brauchen immer mal eine windows vm und zum sachen ausprobieren ok epilepsie"}, {"id": 763, "start": 7216.12, "end": 7226.04, "text": "warnung es ist nicht mal standard chrome edge stimmt es ist es ist alter alter richtig echter"}, {"id": 764, "start": 7226.04, "end": 7230.8, "text": "edge was ziemlich bescheuert ist dass es noch die fault ist weil der wird auch gar keine"}, {"id": 765, "start": 7230.8, "end": 7242.08, "text": "richtigen security updates mehr kriegen machen snapshot sehr gut excellent der chat heute"}, {"id": 766, "start": 7242.08, "end": 7257.64, "text": "wieder massive so also die erste amtshandlung was man mit edge macht wissen wir ja alle"}, {"id": 767, "start": 7257.64, "end": 7278.12, "text": "oder oder oder alternativ auch oder alternativ auch firefox oder opera gaming ja wie oft"}, {"id": 768, "start": 7278.12, "end": 7293.04, "text": "soll ich das noch machen except run ach nee moment es ist schon da ja den brechen wir"}, {"id": 769, "start": 7293.04, "end": 7306.4, "text": "jetzt ab als läuft ja schon ok also win get müssen wir installieren yes ach nee wir haben"}, {"id": 770, "start": 7306.4, "end": 7319.92, "text": "es doch schon ja ja ok was auch immer also github wie ist das win get win get cli ok"}, {"id": 771, "start": 7319.92, "end": 7343.52, "text": "release das da brauche wir ja das hier ist das übrigens der uv dieser komische uvp installer"}, {"id": 772, "start": 7343.52, "end": 7350.12, "text": "glaube ich und die sache ist halt die du brauchst halt ein kurz ein zertifikat dafür das ist"}, {"id": 773, "start": 7350.12, "end": 7352.88, "text": "das was mich vorhin auch so genervt hat dass es immer noch microsoft nicht auf die reihe"}, {"id": 774, "start": 7352.88, "end": 7381.8, "text": "gekriegt hat"}, {"id": 775, "start": 7381.8, "end": 7399.52, "text": "aha ok schön dass hier die hälfte wieder installiert wird so was ja ja ok und und und"}, {"id": 776, "start": 7399.52, "end": 7414.96, "text": "jetzt wie geht das jetzt win get ah cool ok also was kann man jetzt machen win get search"}, {"id": 777, "start": 7414.96, "end": 7421.68, "text": "ok also was haben wir da win get search gibt es auch so was wie list alles anzeigen nee"}, {"id": 778, "start": 7421.68, "end": 7430.92, "text": "das wäre zu das geht ja nett naja das ist ja das nette drinne search also was searchen"}, {"id": 779, "start": 7430.92, "end": 7444.64, "text": "wir mal firefox oh und visual studio code ist auch am start vim sogar vim ist da ok"}, {"id": 780, "start": 7444.64, "end": 7451.64, "text": "probieren wir install und dann muss man wahrscheinlich mal visual studio code weil microsoft gerne"}, {"id": 781, "start": 7451.64, "end": 7460.04, "text": "sachen mit lehrzeichen macht der kann keine dependencies das heißt der installiert einfach"}, {"id": 782, "start": 7460.04, "end": 7474.6, "text": "immer alles oder was ja gut kann ich mit leben nice endlich mal was gescheites von microsoft"}, {"id": 783, "start": 7474.6, "end": 7483.32, "text": "hier so probieren wir noch was anderes aus was haben wir noch search firefox mal gucken"}, {"id": 784, "start": 7483.32, "end": 7499.4, "text": "win get install firefox gibt es hier schon was ah please refine the input muss ich dann"}, {"id": 785, "start": 7499.4, "end": 7519.48, "text": "sagen minus version vielleicht so was oder die id vielleicht die id oh das ist eine"}, {"id": 786, "start": 7519.48, "end": 7541.6, "text": "gute id firefox add das wäre eine coole syntax wenn die funktionieren würde ok kann"}, {"id": 787, "start": 7541.6, "end": 7561.8, "text": "man sowas hier machen help install nee ähm weder kommandozeilen bedienung des todes so"}, {"id": 788, "start": 7561.8, "end": 7586.56, "text": "vielleicht nee ok da gehts schon los install ah komm mal da hinten steht doch was kann"}, {"id": 789, "start": 7586.56, "end": 7606.84, "text": "man kann man krepp ane ist ja windows crack weh feinst ist es unter windows ne für installation"}, {"id": 790, "start": 7606.84, "end": 7618.52, "text": "firefox win get install minus minus id oh jetzt wirds big brain time was und dann minus"}, {"id": 791, "start": 7618.52, "end": 7640.68, "text": "v ok das ist ähm komplizierter als ich gedacht hab"}, {"id": 792, "start": 7640.68, "end": 7669.56, "text": "schein wieder deutlich komplizierter zu sein als man so erwarten mag ah ok ok"}, {"id": 793, "start": 7669.56, "end": 7689.48, "text": "ahja also kann man den version angeben ok firefox 57.0 meine fresse microsoft kriegt"}, {"id": 794, "start": 7689.48, "end": 7711.2, "text": "ja überhaupt irgendwas hin"}, {"id": 795, "start": 7711.2, "end": 7727.08, "text": "als minus e was ist denn minus e exakt ok ok ah big brain moment root warum brauch"}, {"id": 796, "start": 7727.08, "end": 7741.24, "text": "ich root um firefox zu installieren ok jetzt ist die nächste frage kann man auch"}, {"id": 797, "start": 7741.24, "end": 7767.12, "text": "wieder deinstallieren remove nee äh was ist uninstall wie lösche ich denn was uninstall"}, {"id": 798, "start": 7767.12, "end": 7797.0, "text": "muss doch gehen bin get remove was was ah microsoft"}, {"id": 799, "start": 7797.0, "end": 7810.32, "text": "oh das tut ja weh warum ich hab grad echt mein kopf gegen so ein plastikding gekloppt"}, {"id": 800, "start": 7810.32, "end": 7815.88, "text": "äh warum macht man paket manager der kein uninstall support hat"}, {"id": 801, "start": 7815.88, "end": 7842.68, "text": "oh mein güt microsoft was ist denn mit euch los was ist denn los"}, {"id": 802, "start": 7842.68, "end": 7852.32, "text": "feature request uninstall feature request für ein paket manager wo du einen feature"}, {"id": 803, "start": 7852.32, "end": 7859.04, "text": "request aufmachen musst dass er sachen entfernen kann ist kein paket manager"}, {"id": 804, "start": 7859.04, "end": 7875.12, "text": "also ich muss mal ich muss meinen kopf noch ein bisschen gegen das plastik schlagen"}, {"id": 805, "start": 7875.12, "end": 7889.76, "text": "microsoft ich weiß ich weiß echt nicht was mit euch los ist ist doch nicht gedacht benutzt"}, {"id": 806, "start": 7889.76, "end": 7896.84, "text": "zu werden nur eine preview ja ernsthaft das erste was ich in paket manager einbau ist"}, {"id": 807, "start": 7896.84, "end": 7905.56, "text": "install remove search ich kann auch keine preview variante von was rausbringen was das"}, {"id": 808, "start": 7905.56, "end": 7911.04, "text": "ist das kann man nicht mal unfertig nennen was was nicht mal angefangen wurde zu programmieren"}, {"id": 809, "start": 7911.04, "end": 7930.32, "text": "da stand eine begründung ich kann echt okay im moment hallo windows komm an brah ich darf"}, {"id": 810, "start": 7930.32, "end": 7951.16, "text": "es nicht mehr starten es ist broken es ist kaputt oh jetzt jetzt gehts wow oh haben wir"}, {"id": 811, "start": 7951.16, "end": 7965.4, "text": "das jetzt okay okay ich starte ich starte es noch mal ich starte es noch mal okay okay"}, {"id": 812, "start": 7965.4, "end": 7977.88, "text": "die begründung die begründung muss was haben ja ja ja dafür ist ein paket manager da"}, {"id": 813, "start": 7977.88, "end": 7993.36, "text": "wie aber kann schokolade hier nicht deinstallieren das wäre auch übelst fail heilig sieben monat"}, {"id": 814, "start": 7993.36, "end": 8014.04, "text": "excellent subscription moment moment ich kann aber doch jetzt auch hier hingehen und sagen"}, {"id": 815, "start": 8014.04, "end": 8021.92, "text": "remove remove firefox warum kann man das da das kamen wenn ich das von hand über eine"}, {"id": 816, "start": 8021.92, "end": 8029.24, "text": "windows funktion machen kann dann kann ich das doch auch machen über eine komando zeile"}, {"id": 817, "start": 8029.24, "end": 8035.68, "text": "oder nicht und ganz ehrlich dann muss das microsoft da muss das microsoft forcieren"}, {"id": 818, "start": 8035.68, "end": 8041.4, "text": "dann müsste ich sagen ja okay damit ihr in unser offizielles repo reinkommt braucht ihr"}, {"id": 819, "start": 8041.4, "end": 8049.8, "text": "ein uninstall switch der funktioniert ganz einfach und wer sich nicht dran hält kommt"}, {"id": 820, "start": 8049.8, "end": 8056.2, "text": "nicht in das offizielle repo rein dementsprechend müssen sie das aber auch als die beste lösung"}, {"id": 821, "start": 8056.2, "end": 8061.48, "text": "zum software installieren pushen weil ansonsten sagen alle wieder hersteller scheiß uns noch"}, {"id": 822, "start": 8061.48, "end": 8075.76, "text": "drauf was microsoft macht gestern was schreibt real relax schreibt gestern wurde bei uns"}, {"id": 823, "start": 8075.76, "end": 8083.12, "text": "in der online vorlesung github als facebook der informatiker bezeichnet ja das ist genauso"}, {"id": 824, "start": 8083.12, "end": 8088.0, "text": "wie sie alle spiele die schwer sind sagen sie das ist das dark souls der jump and runs"}, {"id": 825, "start": 8088.0, "end": 8095.2, "text": "und sowas es gibt so ein paar dämliche sprüche also es gibt hier garantiert aber das ist"}, {"id": 826, "start": 8095.2, "end": 8100.16, "text": "never going to happen okay mal ich muss es dauernden ich muss es dauernden ich brauche"}, {"id": 827, "start": 8100.16, "end": 8110.72, "text": "ich brauche wir brauchen auf github github brauche ich ein cacw emote so ich habe gewartet"}, {"id": 828, "start": 8110.72, "end": 8124.44, "text": "ja das ist von mir wo blows reacted mit confused ja genau scoop kann das ja auch ich kann ja"}, {"id": 829, "start": 8124.44, "end": 8131.44, "text": "über über den sort party package kann das ja auch das ist das ist basic basic functionality"}, {"id": 830, "start": 8131.44, "end": 8137.72, "text": "which is perfect ja ja natürlich eindeutig ohne den remove was ist ein package manager"}, {"id": 831, "start": 8137.72, "end": 8141.08, "text": "ohne remove an ich muss essen das essen fertig krieg gerade schon nachrichten geschickt"}, {"id": 832, "start": 8141.08, "end": 8156.0, "text": "das ist fail ist das fail ich ich bin heute ist echt ein stream ohne scheiß ich bin mega"}, {"id": 833, "start": 8156.0, "end": 8164.56, "text": "enttäuscht von dem ganzen shit von microsoft erstens win ui komplett unusable useless crap"}, {"id": 834, "start": 8164.56, "end": 8173.2, "text": "mit dem ganzen uwp und code signing zertifikat restriktion sie es immer noch gibt und microsoft"}, {"id": 835, "start": 8173.2, "end": 8179.68, "text": "gehört github doch doch und jetzt kann der offizielle paket manager eine sache wo ich"}, {"id": 836, "start": 8179.68, "end": 8184.52, "text": "seit 100 jahren schon sage dass microsoft sowas mal für windows machen müsste kann"}, {"id": 837, "start": 8184.52, "end": 8188.96, "text": "ich mal pakete remove was ein schwachsinn okay leute dankeschön dass ihr dabei gewesen"}, {"id": 838, "start": 8188.96, "end": 8196.24, "text": "seid gibt es irgendjemand den wir raiden können ich bin in wahrscheinlich später in einer"}, {"id": 839, "start": 8196.24, "end": 8202.72, "text": "halben stunde stunde oder so bin ich wieder on und wir machen dann wie es ist wir streamen"}, {"id": 840, "start": 8202.72, "end": 8217.24, "text": "wortel und auldwins heute auldwins auldwins sonst sonst nix ne gibt keinen den man hosten"}, {"id": 841, "start": 8217.24, "end": 8227.68, "text": "kann so wirklich den ich kenne der es auch bräuchte ne okay leute also wir sehen uns"}, {"id": 842, "start": 8227.68, "end": 8247.56, "text": "echt enttäuschende enttäuschende microsoft stream bis später machs gut"}]}