{"text": "Pock! So Leute, ich geh mal kurz was zu trinken holen, dann geht's los. Wir gucken uns heute... Dann bin ich ziemlich laut, oder? Hat Teams wieder an meinem Sound rumgestellt? Teams macht ja so Sachen öfters mal. Poggeurs? Was ist eigentlich Poggeurs auf Französisch? Poggeurs? Ähm... Ähm... Nee, passt. Lautstärke. Exzellent. xFatal137 12 Monate. Wahnsinniger High IQ Subscriber. So Leute, ich geh mal ganz kurz was zu trinken holen, dann bin ich am Start. Was wir uns heute angucken ist... Es gibt seit gestern, oder seit vorgestern, eigentlich seit vorgestern... Eine neue Beta-Firmware für den Raspberry Pi 4, wo man endlich... Und da warte ich schon eine ganze Weile drauf... Wo man endlich von einer SSD booten kann, beziehungsweise wo man... Okay, das stimmt ja nicht so ganz. Wo man endlich von USB booten kann, was im Endeffekt heißt. Man kann von einer SSD booten. Ein Vormittagstream, ja klar. Ich hab frei, ich muss nichts machen heute. Ich kann ja auch nichts dafür. Wenn heute die Leute schaffen gehen müssen. Frag mich nicht warum, einfach so. Heute Warzone, wir haben gestern glaube 10 Stunden Warzone gespielt. Und wir haben nur gewonnen. Easy. Das ist mit vorausgekommen, ja das ist ganz neu. Das ist ganz neu. Er chatte sich nicht ganz einig, ob Kappa oder nicht Kappa, ja. Monarch S. Ich muss kurz was zu drehen holen, ich bin gleich wieder da. Auf gehts, probieren wir das ganze mal aus. Das kann entweder schnell gehen oder langsam gehen oder gar nicht gehen. Mal gucken wie das funktioniert. Ich hab auch schon mal eine Stunde Sport gemacht. Eigentlich gar keinen Witz und gar keinen Cup. Ich hab wirklich schon eine Stunde Sport gemacht. Das heißt ich bin sogar jetzt relativ wach. Was schon für die Uhrzeit nicht unbedingt selbstverständlich ist bei mir. Also was ich gelesen hab ist. Man kann jetzt seit vorgestern mit der neuen Beta filmen. Das heißt wir müssen auf jeden Fall erstmal mit SSD installieren das ganze. Und nachdem wir es mit SSD installiert haben, müssen wir Firma Upgrade machen. Und nachdem wir Firma Upgrade gemacht haben irgendwie auf der SSD das ganze dann drauf haben. Keine Ahnung wie es genau funktioniert. Im Zweifelsfall haben wir gar keine Ahnung wie es funktioniert. Ich hab gesehen, dass einer der besten Technik YouTube Channels dazu auch schon ein Video gemacht hat. Also sprich wenn wir gar keine Ahnung haben wie es funktioniert. Dann gucken wir uns das hier einfach an wie das klappt. Aber die haben hier auch so eine Mini Anleitung drinne wie es funktioniert. Und zwar macht man eine ganz normale Installation auf der SD Karte. Dann macht man einen Firmware Upgrade. Nico doch gilt für alle. Die älteren Raspberry Pies können alle schon USB Boot. Der einzige Raspberry Pi der keinen USB Boot kann ist glaube ich der Raspberry Pi 1. Der ist 0, beim 0 bin ich aber gar nicht sicher. Also der 3er kann es auf jeden Fall. Der 4er, der 4er kommt plus nicht. Was total wirr ist. Alle anderen vorher konnten es mehr oder weniger aber der 4er kann es nicht. So also genau. Danach also man installiert erstmal ganz normales SD Karten Image. Dann macht man Firmware Upgrade. Das ist ja der Befehl wo sie immer davor waren. Den sollte man nicht verwenden. Aber diesmal ist es halt absichtlich. Diesmal mal absichtlich den Firmware Upgrade. Danach müssen wir irgendwie einen Beta Bootloader selecten. Was ich ja immer geil finde an diesen Anleitungen ist. Dass die wichtigste, also der wichtigste Punkt in diesem ganzen How To ist nicht beschrieben. Das ist wieder so richtig High IQ Big Brain. Der wichtigste Punkt ist nicht beschrieben. Select Beta Bootloader. Alles klar? Okay und nachdem wir wie auch immer geartet den Beta Bootloader selected haben. Müssen wir Raspberry Pi EEPROM Update minus D minus F. Ist ja ganz klar. Ich glaube die Parameter muss ich nicht erklären. Die sind offensichtlich die weiß eh jeder oder? Ist glaube ich jedem klar. Muss man nicht ins Detail gehen. Also wer das nicht weiß, das weiß ich auch nicht. Ähm. Okay. New Configuration Settings are required. Okay dann schreibt er das. Also ich vermute mal, dass das sowas hier heißt. Ich habe ehrlich gesagt keine Ahnung. Also ich habe echt keinen Plan was das heißt. Ich vermute mal, dass das Force ist. Überschreiben. Und das hier ist D. Keine Ahnung wovor das steht. Okay. Danach Rebootet man. Nochmal von der SD Karte. So und danach macht man die SD Karte raus. Und dann können wir von USB booten. Wie auch immer es genau funktioniert. Ich habe echt keine Ahnung. Aber wenn wir keine Ahnung haben. Und es auch gar nicht funktioniert. Dann gucken wir uns das Video hier zu an. Weil der macht immer echt gute Videos. Sonst kann es nicht so komplizierter. Wenn das Video plus drei Minuten lang geht. Genau. Exzellent. Exzellent. Okay also als erstes brauchen wir das allerneueste. Raspian. Warum habe ich schon wieder so wenig Platz hier drauf? Warum ist das immer meine? Warte mal die ganze Scheiße mal zumachen. Den brauchen wir auch wichtig. Den müssen wir auflassen. Testgit. Ich glaube das können wir mal löschen. Das brauchen wir. Das haben wir nicht. Das waren irgendwelche Testgeschichten. Weg damit. Weg damit. Weg damit. Weg weg weg damit. Auch weg damit. Okay wunderbar. Ich glaube ich habe hier noch jede Menge Downloads drin. Die ich immer löschen kann. Hier. Ich habe noch ein altes Raspian Image. In Lineage haben wir hier noch drauf. Google App. Apps. Twitch. Das ist das was der Inder für uns programmiert hat. Hier haben wir noch ein Raspian Image. Kann alles weg. Das ist Trash. Also wer sich fragt was das hier ist. Was das macht. Ich habe mein RM. Hab ich ersetzt durch das Kommando Trash. Was genau das macht. Was es unter Windows auch macht. Also sprich. Ne wie ging das. Ich kenne die Option gar nicht mehr. Ah Trashlist war es. Genau. Da kann man sich anzeigen lassen. Was für Sachen im Papierkorb sind. Weil ich habe schon öfters mal. Mit hier sowas. Aus Versehen in meinem Heimatverzeichnis Sachen gelöscht. Die ich noch gerne behalten hätte. Deswegen. Habe ich jetzt den Kram da aliast. Okay. Raspian Downloads. Raspian Downloads. Was. Raspian. Ich kann nicht schreiben. Wir brauchen das Allerneueste. Oh guck mal. Es gibt jetzt sogar für Ubuntu gibt es. So. Wir wollen allerdings nicht. Wir wollen das Light ISO. Wo ist es denn. Häh. Bin ich jetzt blöd. Wo ist der Download hin. Was. Wo ist der Download hin. Ah hier. Man muss erst auf die Unterseite gehen. Das ist auch exquisite gut durchdacht. So hier Downloads. Gut SD Karte. Wo habe ich meine SD Karte. Die steckt wahrscheinlich Raspberry Pi noch drinnen. Komm mal her. Raspberry Pi. Komm her. Ja hier ist die SD Karte noch drin. Das ist Twilight Princess Musik Soundtrack. Na. Ja. Das ist eines der besten. Eines der besten Stücke aus dem ganzen Soundtrack hier. Richtig Poggers. Wo habe ich eigentlich noch Twitch. Twitch Streaming Server auf. Und warum habe ich mein Telefon noch am Start als Bild. Geil. Kann man vielleicht mal alles gebrauchen. NoSkiller abonniert Twitch Prime. Dankeschön. Excellent Subscription. Leaked. OMG. Ich habe schon so viel geleaked. Langsam könnte man. Man könnte den Max Leak Puzzle machen. Wer puzzelt alle Leaks zusammen. Musst du heute nicht arbeiten. Nee nee. Muss ich nicht. Ja. Wahrscheinlich. Muss ich mal gleich ausprobieren. Dann werden wir es soweit haben. Hat das jetzt runtergeladen. Da. Passt. Wo ist mein SD Kartenleser. Hier. SD Kartenleser. SD Karte rein. Zack. Hier. Das können wir raus machen. So. SD Kartenleser rein. Ist das schon drin. Ja. Perfekt. Edge. Ohr. Und erstmal das Ding. Auf die SD Karte. Die Ideen. Oder was heißt Ideen. Etchen. Da ist es. Zack. So. Das flasht jetzt. So. Ähm. So wie ich das verstanden habe. Wir müssen das Ding jetzt erstmal flashen. Auf die SD Karte. Und den Raspberry Pi mit der SD Karte starten. Und danach einen Firmware Update machen. So weit so gut. So weit so einfach noch. Brückentag. Brückentag. Envoblo. Also ja. Mein Chef. Hat. Hat. Hat gesagt. Ich muss. Urlaub nehmen. Jetzt ohne Scheiß. Das ist nicht so das ich gesagt habe. Ich will. Ich muss. Und dann habe ich natürlich gesagt. Ja gut. Dann nehme ich den Tag der sich anbietet. Nehme ich jetzt das Ding hier. Da hat man am meisten davon. Nehme nehme. Nehme nicht zwangsurlaub in dem Sinn. Bei uns ist es so. Bei uns ist ja wieder Kurzarbeit noch sonst was. Aber die haben jetzt gesagt. Und das kann ich nachvollziehen. Es gibt zwar genug bei uns die sich darüber aufregen. Aber ich kann es nachvollziehen. Die haben gesagt okay. Die Leute. Warte mal. Ich war ein bisschen weniger. Ein bisschen weniger hektische Musik grade. Ja. Beste. Ähm. Das kann ich nachvollziehen. Die haben bei uns jetzt gesagt. Okay. Falls diese Corona Geschichte jetzt. Gegen Ende des Jahres wieder vorbei ist. oder alle Beschränkungen aufgehoben sind, werden die letzten 2-3 Monate im Jahr alle ihren Urlaub nehmen. Deswegen haben die gesagt, ok, man soll jetzt schon 80% oder mindestens 80% seines Jahresurlaubs verplanen, dass man sicherstellt, dass immer genug Leute da sind. Das kann ich verstehen, das klingt einleuchtend, ja. Und ich hab ja schon fast alles verplant, bis auf 2 Tage. Deswegen hat er jetzt gesagt, ich muss jetzt die 2 Tage noch irgendwo eintragen. Dann habe ich gesagt, ja gut, dann nehme ich nächste Woche Freitag, also heute. Und, ähm, was ist das eigentlich? Hessen? Feiertage? Ich muss mal gucken, was ich da noch anbiete. Das ist alles schon vorbei. Das war jetzt gerade gestern. Montag. Montag ist ein scheiß Feiertag. Donnerstag. Exzellent. Dann nehme ich mir am 12.06. wieder Urlaub. Und Tag der Deutschen. Jetzt auch noch Samstag. Das ist aber, die fallen aber, die fallen aber dieses Jahr echt schlecht. Weihnachten fällt auch nicht allzu gut. Lass mal überlegen, wie ist denn das dann? Weihnachten, also 24. ist bei uns eh frei. Das heißt, Donnerstag frei, Freitag frei, Samstag. Ok, Samstag ist verschenkt. Silvester. Silvester ist immer dann, wenn 24. ist, oder? Also 31. ist immer dann 7 Tage, logischerweise nach. Ok, also Silvester ist dann auch an einem. Donnerstag, das heißt, das fällt doch eigentlich ganz gut. Das ist nur Samstag verschenkt diesmal. Bei mir ist halt doof, was Sachen, die auf Montag fallen. Und Montag fallen halt immer Ostern und Pfingsten. Immer. Das ist halt für mich schlecht. Also Feiertage, die auf Montag fallen, ist für mich halt verschenkt. Das ist halt doof, ne? Warum? Weil ich Montags nicht arbeite. Das heißt, wenn Montags Feiertage sind, ist halt kacke. Und Feiertage Samstags ist halt auch für jeden schlecht. Ich finde auch Ostermontag sollte lieber Dienstag sein. Ja, warum nicht? Ich mein, sollte es halt den Osterdienstag umnennen. Was interessiert mich, ob da Jesus angeblich irgendwie auferstanden ist oder so. Who cares? Wichtiger ist, dass ich nicht arbeiten muss. Was juckt mich der Rest, Alter? Deswegen in letzter Zeit waren auch irgendwelche Diskussionen wieder, ob man nicht einen Feiertag machen sollte. Ich glaube, wann war das jetzt? War doch erst letztens irgendwann, wo sie gesagt haben, wir sollen einen Feiertag machen da, wo Deutschland den Zweiten Weltkrieg verloren hat oder so was. Da habe ich gesagt, ohne Scheiß, macht. Immer, immer, umso mehr Feiertage, umso besser. Mich interessiert die historische oder religiöse oder was auch immer Bedeutung. Ehrlich gesagt relativ wenig, Hauptsache, ich muss nicht arbeiten. Die könnten auch sagen, heute ist Tag der USB-Sticks und das ist so eine bedeutende Technologie, dass es einen Feiertag gibt, da sage ich, Alter, USB-Sticks beste, Hauptsache Feiertag. Hauptsache, ich muss nicht arbeiten, der Rest ist mir eigentlich vollkommen wurscht. So, hat das jetzt geflasht? Ja, successfully. In Berlin war doch Weltfrauentag ein Feiertag? Ja, unbedingt. Also ich bin ja schon immer Feminist gewesen, das heißt, wir sollten das deutschlandweit auch bekommen. Also ich bin immer dafür, für mehr Feiertage. So, jetzt haben wir das geflasht. Also ohne Scheiß, wenn wir einen Feiertag kriegen, wenn es Weltfrauentag ist, dann bin ich auch ein Tag Feminist, das ist auch okay. Das sage ich dann, wir brauchen Frauenquote, wir brauchen alles, alles. Gender, Paygap, alles, alles. An dem Tag bin ich für alles, Hauptsache, ich muss nicht arbeiten gehen. So, SD-Karte ist geflasht, ziehen wir das mal raus. Oh, ich hätte vielleicht noch einen Sync machen sollen. Das war jetzt eine doofe Idee, ich muss den USB-Stick noch mal reinmachen, weil ich habe auch vergessen, SSH einzuschalten. Das Big, Small Brain war das von mir. Small Brain. Small Brain, also. Was man ja immer machen muss, nachdem man, das kann man, das ist eine Sache, die kann man sich wirklich bemerken, nachdem man eine Raspberry Pi Image geflasht hat oder eine Micro SD-Karte geflasht hat mit dem aktuellen Raspberry-Image, muss man die immer noch einmal mounten. SD-B1 ist es. Und man muss die immer noch einmal mounten. SD-B1 ist es. Und man muss, das hier ist die Boot-Partition vom Raspberry, man muss eine Datei anlegen, die SSH heißt. So, und dann, und dann muss man das nicht so machen, wie ich macht, dann unmountet man das wieder, macht man einen Sync hinterher, dass es auch geschrieben ist, und dann zieht man den USB-Stick wieder raus. Und dann hat man eine SD-Karte, wo SSH gestartet ist. Ansonsten ist nämlich kacke, man kann sich nicht einloggen. Nee, WLAN brauche ich nicht, ich mache ein paar Kabel dran. Ich habe auch gerade überlegt, ob ich das WLAN machen soll, also ich mache ein paar Kabel dran, wenn ich Kabel finde. So, dann mache ich jetzt erst einmal die Micro SD-Karte in den Raspberry rein. Und dann machen wir hier mal die ersten beiden Schritte, gucken, ob das funktioniert. Ach, habe ich, real redact habe ich das so herum gesagt. Wie gesagt, ich bin für alles, solange wir einen Feiertag kriegen, der Rest ist mir vollkommen egal. Boah, ai, das ist aber ganz schön. Oje. Leute, ich habe hier ziemlich einen Kabelsalat fabriziert gerade, wartet mal. Huge Kabelsalat. Zum Glück habe ich hier die zwei Rechner neben mir stehen, da habe ich quasi noch so einen halben Extra-Tisch, wo Kabel rumliegen können. So, okay. Also, Raspberry Pi am Start. Ah, SD-Karten-Slot pusten, man weiß ja nie. Könnt ihr euch noch an den Stream erinnern? Oh, die SD-Karte ist kaputt. Oh, Leute, die SD-Karte hat ein Loch. Oder ein, nein, nicht wirklich ein Loch, so ein... So, von den Kontakten unten hat einer ein Loch. Wie hast du, ich weiß nicht. Vielleicht war die schon so. Okay, wir probieren mal trotzdem, ob es funktioniert. Ja, SD-Karten-Einführungs-ASMA. Warum passt denn das nicht? Ah, falsch rum. So, okay, SD-Karte ist drin. Ich stapsel mal kurz den Raspberry Pi an, ich muss mal kurz aufstehen, eine Netzwerkkabel holen, dann bin ich gleich wieder am Start. Okay, er läuft. Er läuft. Er läuft, jetzt muss ich nur noch auf meinen Rauder gucken, was das Ding für eine DRCP-IP kriegt. Rauder. Wieder, Max hat kein Spare-Netzwerkkabel, dauerhaft eine, ja, doch. Aber das hängt hinter dem Schreibtisch runter, deswegen muss ich da immer aufstehen, weil das hängt sich jedes Mal um irgendwie. So, DRCP-Server, DRCP-Lieses, Raspberry. Na, wo ist er denn? Raspberry? Äh, der Raspberry meldet sich irgendwie nicht? Warum nicht? Sag, bloß die SD-Karte ist jetzt kaputt, ey. Ich krieg Anfälle. Sag, bloß die SD-Karte ist kaputt. Es müsste ja eine 2. Oh, ey, muss das jetzt echt sein? Die resize doch immer erst, ja, deswegen warte ich ja noch. Mit der, was geht jetzt ab? Hi, hi, hi. Amazon-Tablets holen sich DRCP-Adressen, ne, aber irgendwie. Hi. Ne, das Ding holst du keine IP, was ist denn das für ein Kack? Die SD-Karte blinkt auch total wie ein, äh, ich glaub, die SD-Karte ist kaputt. Ah, ne, guck mal da. Ne, doch, oder? Ist das der, ist das der? Nee. Fuck, man, ich glaub, die SD-Karte ist echt im Arsch. providerein diffe ne fuck man ich glaube die sd karte ist echt im arsch na super grandios ok neue sd karte also ich gucke jetzt nochmal die die die sache durch dynamic dynamic fuck alter hier ich habe zwei sachen die sind dynamic das eine ist der desktop der kann es ja nicht sein amazon tablet und meine linux vm ah ok je fehler sd karte hast du auf reserve genug ich habe allein schon drei stück noch hier auf dem schreibtisch liegen wirklich genug genug ähm ich mach hier nochmal aus und nochmal an vielleicht vielleicht bringt das ja was ok netzwerk kabel also netzwerk karte kriegt auf jeden fall sync das ist schon mal gut ha man warum ist die musik jetzt so laut monka hat die amazon nicht mal aus für die ganze kiste mit sd karten geschickt doch ok leute ich glaube die sd karte ist kaputt ja dann next next sd karte ich hab hier noch ein paar ich hab hier noch ein paar die sieht auch nicht kaputt aus das ist schon mal gut die sieht ganz aus im vergleich zu der anderen sd karte ne der meldet sich echt nicht der raspberry ist rib der ist im arsch na toll der bootet nicht ich habe übrigens immer noch kein mini hdmi bestellt ne das heißt wir können uns jetzt auch die ausgabe gar nicht angucken ok ok ok dann machen wir eine neue sd karte alles klar wo ist mein sd karten reader hier dann machen wir eine neue sd karte wenn die kaputt ist ist natürlich ganz toll das ausgerechnet die sd karte ich jetzt erwische kaputt ist connect vm etcher noch mal das ganze geht ja schnell jetzt ist es auch eine 32 g sd karte flash lassen wir mal eine minute lang flaschen ok ja ich gucke noch mal ich gucke noch mal in die dlcp rein ob da irgendwas irgendwas kommt was nach raspberry pi aussieht ne das ist meistens relativ einfach zu erkennen wenn sich raspberry pi registriert man erstens heißt das ding raspberry pi als dhcp name und es ist einer der wenigen dynamischen ip also sprich ich habe hier das meiste kriegt er bei mir über dhcp die ip allerdings nicht dynamisch aus dem pool sondern die sind fest zugewiesen wie kann man eigentlich das können wir jetzt eigentlich doch mal machen wie kann man eigentlich ein pie config static ip machen auf der sd karte habe ich noch nie gemacht ich weiß wie man wlan einrichtet und so autos set up static ip geht das überhaupt wenn man wohlgemerkt wenn man noch nicht drauf kommt wenn man drauf kommt weiß ich wie das funktioniert auf der sd karte will ich das mal machen jetzt die musik wieder zu leise die können sich echt nicht entscheiden okay um sd karte wie geht das setting static ip address from sd karte bevor boot natürlich muss irgendwie gehen ok also der hat echt ein problem mit der mit seinen soundlautstärke in diesem musikding die hätte man ein bisschen anpassen sollen dass sie alle gleich laut sind ah ok excellent was auch immer wir haben eine neue passt zack ok sd karte ist geflasht wir mounten die sd karte def sd sd b1 ist wahrscheinlich auch machen einmal touch ssh an mounten das ganze sünden den spaß und stöpseln es noch mal in den raspberry pi rein und hoffen dass es jetzt funktioniert man sieht das immer ganz gut aus vom raspberry pi funktioniert wenn er beim starten anfängt wird mit der sd karte zu blinken dann klappt es meistens ok und angeschaltet zack ok der blinkt schon mal der blinkt schon mal das schon mal gut der blinkt schon mal wild ja das sieht besser aus das sieht besser aus der blinkt wie verrückt der resize jetzt erstmal die karte und danach sollte er buten sich eine dhcp adresse holen da ist er da ist er die sd karte war echt kaputt hatte ich auch selten dass die sd karte komplett im arsch ist so da sind wir ssh pie et es raspberry da sind wir ok sie domino sie ok also was müssen wir jetzt machen wo sind verstehen geblieben die anleitung brauchen wir könnte man monka es ausblenden die anleitung brauche also börn haben wir gemacht wir haben der sd karte raspberry update ok das heißt vorher machen wir erst mal ab update erst mal neueste sachen abrufen man weiß ja nie wir rufen mal die neuesten sachen ab wir machen auch mal einen update ich meine es ist jetzt ziemlich bescheuert ein update zu machen aber ich will mal sicherstellen dass die dass die befehle und das ganze was wir verwenden auch wirklich am aktuellsten stand ist wir werden ja eh später das betriebssystem von der sd karte nicht verwenden aber mal gucken siehst du eigentlich monka es und die anderen emotes auf deinem schirm ja ja ja guck hier ich habe hier mein dashboard und wenn ich mal hier hier ist er jetzt kann sogar durchklicken guck hier ich sehe die deswegen habe ich den kram ja auch programmiert deswegen habe ich das ist eine der sachen der gründe warum ich den kram programmiert habe dass ich die emotes selber sehe also sprich ich sehe die maus selbst und ich kann die ja auch hier rum muven und so was mit der maus ist ja also das war einer der gründe warum ich den kram programmiert haben was hast du mit dem paye geplant mit dem jetzt speziell gar nichts mit dem probiere ich jetzt einfach nur aus ob auf dem paye usb bude funktioniert die anderen sind ja schon im einsatz das gibt auch keinen grund die durch also die die ich habe gibt es keinen grund die durch den raspberry pie 4 aktuell zu ersetzen der der grund warum ich das so programmiert habe ist ja auch dass ich die maus selber sehe und halt nicht vergesse sie wieder auszublenden so was wirst du das mit tun auf win ui 3 programmieren hatte ich tatsächlich vor bis gestern und gestern habe ich festgestellt die haben immer noch obwohl es eine normale 32 anwendung ist uwp krab als abhängigkeit mit drinne da werde ich das nicht machen wir sind eine paus im einsatz wir haben ich hab doch hier irgendwo ein textdokument wo das alles drin steht wo wir was haben also ich habe eine kamera fürs hoftor weil die frage kommt öfters deswegen da bin ich schon habe ich schon was vorbereitet ich bin mir nur nicht sicher ob da alles drin steht also ich habe eine kamera fürs hoftor das sind paus 0 die heizungsstatistik die kennt er wahrscheinlich noch wie ist das noch mal hier grafana genau das ist die heizungsstatistik die wird auch mit raspberry pie 0 ausgelesen da kann ich dann so sachen sehen wie wassertemperatur in der heizung kesseltemperatur von der heizung ob das ding ein fehlercode hat ob der brenner gerade an ist man sieht es ist relativ warm und dementsprechend muss der brenner halt kaum angehen man sieht die abgastemperatur und ob die pumpe gerade pumpt also sprich wenn das einer keine ahnung wenn die spülmaschine angeht oder so dann sieht man es hier man kann auch rein zoomen und sich das ganze noch ein bisschen genauer angucken wenn man da scharf drauf ist ja das ist der eine raspberry pie im keller der sammelt die infos von der heizung der hat noch ein temperatur und luftfeuchtigkeit sensor dran das könnte ich eigentlich auch mal hier rein machen fällt mir gerade ein der misst auch noch die luftfeuchtigkeit im keller weil die ist immer viel zu hoch was für eine heizung hast du denn ich habe eine veto wiesmann veto denn 22f oder so ich weiß nicht genau ich glaube wie to dennst 22f ja so eine hier so und das ist ein bisschen trickreich die infos aus dem raspberry pie rauszukriegen und ich habe dann wir haben dann im haben sogar im stream gemacht glaube ein prometo als exporter programmiert der quasi die heizung statistik exportiert und grafana ruft das ganze dann ab so dann habe ich den pie 3 als octopie für den 3d drucker oh mir fällt gerade ein der mesh wollte noch irgendwas 3d gedrucktes haben ob ich hat mich gefragt ob ich ihm das nicht drucken kann ganz ganz verdrängt muss ich muss ich mal anschmeißen später dann habe ich noch ein odroid hc2 laufen das ist zwar kein raspberry aber sowas ähnliches der macht fernsehaufnahme und serienaufnahme mit tv head und darüber guckt man auch fernseh der hat eine 2 terabyte platte dran das reicht das mal für aufnahmen dann gibt es auch ein pie 3 als unify controller und als frontend für die webcams das haben wir auch zusammen im stream ein bisschen programmiert die webcam frontend geschichte so und dann habe ich noch was sind es aber keine raspberries das sind die esp 32 dies hier am start hab wie gesagt einmal als einmal am stromzähler unten im keller also sprich einmal für für stromverbrauch insgesamt und stromverbrauch für den ersten stock da wo auch mein arbeitszimmer und alles ist dann habe ich ein draußen an der tür hängen für die boden feuchtigkeitssensoren auf dem balkon in den in den flan in den blumen töpfen dann habe ich am hoftor einen für schalter der guckt ob das hoftor auf und zu geht briefkasten kommt noch einer der funktioniert noch nicht der guckt ob im briefkasten was drin ist und wann zuletzt was eingeworfen wurde und in bodenfeuchtigkeitssensor der über laura die datenschickt zum auswerten war nicht wieder gießen muss exzellent das ist alles was ich da im einsatz habe so hat er jetzt eigentlich geupdatet alles ja fertig sehr schön wir rebooten mal sicher ist sicher man weiß ja nie das mit dem boden sensor will ich auch mal machen für spät schreibt captain peng also ich kann dir folgendes empfehlen ich würde keine boden feuchtigkeitssensor selbst machen mit einem esp 32 das lohnt sich gar nicht weil wenn du auf auf bengut gehst also die seite mit dem best besten namen was damit überhaupt nichts zu tun hat beide wei und man nach nie flora sucht und wenn du glück hast findest du ganz gute angebote für diese low energy bluetooth bodenfeuchtigkeitssensoren die sind ganz gut die halten über einen jahr mit einer batterie oder fast zwei jahre mit einer batterie und die sind schöner und billiger als du dir das selbst bauen kannst musst du meinen deal abwarten ich glaube ich habe die damals für elf dollar das stück gekriegt habe ich gleich mal zehn stücke kauft und dafür ist halt der eine der eine esp 32 der per bluetooth guckt und die daten von den dingern ausliest ist einfacher als selbst zu machen so ok ist der palme da da raspberri hallo ich habe mich vertappt ist very excellent ok ssh copy id macht man immer ganz am anfang weil dann muss man kein passwort eingeben sudo und jetzt machen wir das was in der anleitung drin steht nämlich ein update beim jetzt sollte die betafirme updaten um wo ist du leicht zu präsent yes so während der update das dauert jetzt zwei drei minuten gucken wir mal was es für fragen gegeben hat das neue wtf verhindert probleme wo da fack war da fack ich habe es ich habe es nicht verstanden big brain joke wie gesagt mit dem paar habe ich jetzt außer zum ausprobieren gar nichts geplant ja das hatten wir schon sehe ich auch alles ja amazon amazon hatte mir mal eine kiste sd karten aus versehen geschickt also ich habe ich habe irgendwie drei stück bestellt und ich habe auch drei stück bekommen bloß dass irgendwie noch eine kiste dabei war mit 20 sd karten drin ich weiß nicht ob das mit mir gut gemeint hat der amazon lagermann oder ob die sich einfach vertan haben ich habe einfach nix gesagt weil ich denke mir ich bestell so viel bei amazon die haben so viel schon an mir verdient da werden sie das verkraften wahrscheinlich verursacht das auch wenn ich mich da melde mehr probleme die zurück zu schicken als sonst was was das für ein erstes e3 wm e3 wm mit hier knobb knobb terminale ist fertig reboot ist needed aber schnell die fragen noch fertig plops russia vier monate exquisite high IQ subscription gucken dass ich nix vergessen habe an subs der no skiller dankeschön falls sie noch nicht gesehen habe poggers so das ist e3 status rast nennt sich das ganze ok reboot reboot machen wir reboot müssen wir auch machen börn respire update ok so haben wir alles gemacht und jetzt ist es halt total vage beschrieben select beta bootloader und wie und wie selekte ich den beta bootloader so eine geile anleitung total obvius alles aber die wichtigste stelle wie das eigentliche geht steht nicht dabei ok das steht aber mit sicherheit irgendwo hier im forum drinnen da müssen wir einfach mal aha ok ok ok etc default api eeprom update from critical to beta what ok erst mal gucken ob dieses programm da überhaupt drauf ist das sind typische anleitung von programmieren ja das sind typische anleitung von leuten die selbst schon 20 mal gemacht haben und eigentlich keine ahnung haben was man da nicht verstehen kann ok ach guck mal hier jetzt zeigt er was an so also was was soll man jetzt machen ich bin ich bin was etc default respire pro update vom critical to beta hallo excellent richt pepega copy paste er kein wimp drauf erste mal erste mal das allerwichtigste installieren und t-max man weiß ja nie was man so braucht die musik ist übel stressig gerade ich meine so so wahnsinnig world first boss clear ist das jetzt hier auch gar nicht richtig ok hat es installiert also da steht critical bringt jetzt mal wim heck leute wim heck was meint ihr ist der schnellste weg im wim dieses dieses critical warum habe ich überhaupt maus mode an wie geht was meint ihr ist der schnellste weg dieses critical hier zu ersetzen durch beta was fällt was fallen euch dafür krasse wim hacks ein also ich bin der meinung das hier ist der schnellste mit einem seht könnte man das auch machen ja also die schnellste variante meiner meinung nach ist wenn man die datei aufmacht dann ist man hier ganz vorne an der zeile also die die noob die noob variante ist das hier die geht aber das ist nicht schön was man machen kann ist öffnen so öffnen und dann sagt man change inner anführungszeichen dann geht da nämlich direkt zum nächsten zur nächsten stelle wo anführungszeichen findet löscht von anführungszeichen zu anführungszeichen und geht direkt in insert mode da kann man beta reinschreiben und drückt escape und speichern und gut ist also ci muss man eingeben ci anführungszeichen ok und wie geht es jetzt weiter ah guck mal da hat es glaube ich schon gemacht kann das sein ok was soll man jetzt machen select use select beta bootload das haben wir gerade gemacht dass bei palmer to update it ok hä was ist für eine anleitung new configuration settings are required was eine krepp anleitung was ist das ziel das ziel ist dass der raspberry pi von usb booted in dem fall von der ssd ohne dass man eine sd karte drin haben muss sondern wir gucken uns jetzt die musik die geht da voll ab wir gucken uns jetzt doch mal das video dazu an das geht ja nur drei minuten wir gucken uns mal an der macht echt gute videos und er hat das passende bild dazu wie das funktioniert und genau die gleiche sd karte das ist ein das ist natürlich ist ein schweizer off also es sagt sogar noch am anfang schweizer akzent ok das muss ich noch machen das muss ich mir aufschreiben also was ich jetzt noch machen muss ist notepad weil weil windows also ich muss noch mal also dd dd auf ssd muss ich noch machen also das image muss noch mal auf die sd karte drauf da sind wir gerade haben wir gemacht haben wir gemacht haben wir auch gemacht haben wir auch gemacht oder ist auch ist auch schon drauf ok doch ist drauf ist drauf ok haben wir das das das das das haben wir auch schon gemacht nano ok jetzt jetzt jetzt wird spannend das ist das was ich nicht checken was ich machen muss was afterwards reboot what the fuck woher soll man wissen was das richtige ist wo wie soll man auf diesen befehl kommen wenn er nirgends wo steht ist ja leute chat ist doch logisch so voll klar ok also dann machen wir das mal minus d was lip lip obs firmware was war das lip firmware raspberry pi bootloader beta und dann piep piep rom 20 15 und wir haben auch 20 ane 20 15 bin aha ok aha hat er gemacht und jetzt reboot na if you want to check the bootloader version you can do this with this command machen wir mal machen wir mal vc gen cmd und an was bootloader version wartet mal kurz ein bisschen gedudel anmachen bootloader version yes it is may 15 ane ich habe noch nicht rebooted na reboot erst mal die bunde erst mal die bunde das sind völlig normale befehle die man täglich benutzt nach der easy killer ein bisschen kryptisch muss es ja sein die es kommt die passende link to the past musik der boot nicht mehr ah monka hoh ich habe ich gedacht er wurde nicht mehr dass man sich 2020 fragen muss ob usb wird überhaupt support ich frage mich auf was mit den losses beim raspberry 3 funktioniert es ohne probleme ok vc gen bootloader version ah ok version and with this command bootloader config bootloader config ok was auch immer ich da hier bootorder ist glaube ich wichtig das habe ich in der anleitung auch noch gesehen bootorder 0xf was heißt was ist denn das in dezimal auch guck mal das kann er knopterminal mittlerweile 3,0 was an die 3905 ist das ok excellent wollte ich schon immer mal wissen es war eine bootloader bootloader order 3905 ist check if bootorder equals 0xf41 ja ist es ist for putting from usb and one is booting from the sd card ok moment was booting from the sd card moment was das habe ich nicht kapiert check if bootorder equals 0xf41 for is for putting from usb das heißt er probiert zuerst usb und dann sd karte deswegen hat das eben auch länger gedauert one is putting from 11 core sagte erklärt das aber übelst nice ohne mist das ist einer der besten channels auf youtube den es gibt zu diesem thema wer sich für microcontroller zeug interessiert oder auch für raspberry pi geschichten aber sich die videos von ihm anguckt kann ich wirklich nur empfehlen den zu abonnieren der ist wirklich gut und er erklärt die sachen auch immer sehr auf den punkt gebracht und genau ohne großartig rumzuschwätzen richtig gut gucke ich gucke ich schon lang das den kann man wirklich empfehlen um die sd card also er bootet zuerst per usb und dann von der sd karte was natürlich auch richtig gut passt weil er soll zuerst von usb und wenn usb nicht geht soll er sd karte buten das heißt deswegen hat es eben auch so lange gedauert bis er gebootet hat now we are done with the raspberry and can go on with the new ssd das müssen wir noch machen auf to copy all dot 11 dot date files from our sd card into the boot directory of our new ssd ok ja gut das krieg ich gebacken das krieg ich gebacken gut das heißt ich muss jetzt erst einmal meine sd karte erst einmal meine sd karte wo meine meine meine ssd wo habe ich meine ssd ssd monka ssd hier ssd und mein usb 3 ssd sata adapter so usb sata adapter geht ran falsch rum weil man so die immer falsch rum dran macht heute mal keine facecam ja kein leak heute ok sd karte zack connect ja ja ist ja gut so sd karte ist auf sdb ja gut passt ja ls blk sdb xfs ist da drauf ok wie groß ist die sd karte 240 240 g ok die musik stübel ist nice ich glaube das ist mario kart oder ist das mario kart ach ne mario odyssey so was muss ich damit jetzt machen kann man mit ätcher einfach auch sd ssd action geht das habe ich noch nie probiert anscheinend anscheinend ok das ist eine ssd nicht ja sd ssd das ist eine ssd das ist eine sandisk ssd plus irgendwas das ist nicht die sd karte das ist die ssd ok dann flaschen wir das mal da drauf flash yes das geht aber schön schnell so schnell müsste man eine micro sd karte flaschen ok das heißt wir haben jetzt eine sd karte die stöpseln wir an den raspberry pi dran und kopieren jetzt gleich dinger rüber gut machen wir das ist schon fertig geht das schnell fdisk zwei partitionen drauf raspberry pi gedöns ok zynk dann gehen wir auf die raspberry pi und stöpseln die sd karte jetzt an den raspberry pi dran an usb 3 natürlich sonst wäre das ganze ein bisschen blöd gucken wir mal ob er es erkannt hat sda ja das ist kukier fdisk def sda da ist die ssd 250 g immer noch kein neuen pc gekauft nee ja ersetzt wenn ich jetzt gerade sd karte sache man durch ssd ich kann nicht reden ok das das kriegen wir gebacken mal gucken ob das überhaupt da ist ja def sda 1 mount nach mnt alles klar und was soll ich jetzt kopieren ja vom boot vom boot zudings ok also alles vom boot nicht alles vom boot elf ist das nicht ist elf nicht irgendwelches efi gedöns captain seeker ja die sind top beste mit den besten videos es gibt ok also boot sternche sternche punkt dat wollen wir mal kopieren und slash boot sternche punkt was elf ok und das alles nach mnt machen wir so haben wir es haben wir es jetzt ja ok passt ist alles da und dat dat falls auch dat falls elf falls denn da und jetzt von die sd karte zu die ssd haben wir gemacht shut down remove die st oh jetzt wirds ernst leute jetzt wirds ernst ob das funktioniert was mal quatsch elf ist nicht efi elf ist es ist ja ja ist das linux binary zeug hab es irgendwie kategorisch klar wie die durcheinander gepackt ok you mount hat er auch gesagt dass man you mounten soll gut jetzt bin ich ja mal gespannt ob es funktioniert leute meint ihr das tut ok power off du kannst die sd karte doch drin lassen ist auch die richtige reinfolge drin hast du eigentlich recht ja aber ich machs mal ohne sd karte ich mache mal die sd karte raus ich probiere es echt mal aus mal gucken ob das funktioniert also chat geht oder geht nicht also mocha smoke oder nicht mocha smoke was meint ihr so probieren maus er blinkt er blinkt da ist er ich habe es euch gleich gesagt es funktioniert wir haben ja kein ssh zugang weil ssh nicht eingeschaltet ist da müssen wir die sd karte noch mal rein machen noch mal von der sd karte buten ok das müssen wir noch mal noch mal noch mal neu buten na na bob bist ja richtig dumm ok ok ausschalten noch mal sd ssd nein sd karte noch mal rein und passen die sd karte jetzt nicht mehr was ist das ah jetzt so usb raus usb raus dass er auch sicher von der sd karte bootet anschalten ich könnte es auch an den pc stecken ja ja ich könnte es auch an den pc stecken macht überhaupt keinen unterschied wäre vielleicht sogar einfacher gewesen so booten wir von der sd karte das müsste jetzt ja kurz dauern weil er nicht checkt von was er booten soll und jetzt erstmal wenn er keine usb ssd karte findet bootet er von der sd karte ah da ist er exzellent zack jetzt sind wir wieder mit der sd karte drauf guckt die f-h da guckt der root was ist das naja zumindest ist die sd karte eindeutig macht hell nicht ok jetzt machen wir die sd ssd karte die ssd wieder dran meine göhe sagen hier def sda sagen mount ist nach mnt da sind wir wieder das ist jetzt die ssd worauf wir sind und hier machen wir jetzt eine datei die ssh heißt sync und jetzt gucken wir ob das rebooten funktioniert wir müssen ja die ssd die sd karte gar nicht mehr raus machen ich glaube man kann ssh nur beim ersten boot auf dem weg deaktivieren aktivieren ok das wäre das wäre dumm aber was wir machen können ist wie aktiviert man den kram manuell werden wir jetzt gleich sehen reboot activate ssh raspian ich müsste der raspi konfig kann ich ja nicht verwenden ich bin ja nicht im laufenden system drinne ich müsste da irgendwie ch ch change root oder irgendwas machen drauf ssh exzellent da sind wir wieder oh ne wir sind von der sd karte wir sind von der sd karte leute wir sind von der sd karte anscheinend kann man die sd karte doch nicht drin lassen anscheinend anscheinend kann man das doch nicht drin lassen ne moment warte mal ich bin verwirrt was ist das für ein schwachsinn wir haben gebootet von der sd karte jetzt guckt euch mal wir haben gebootet von der sd karte aber unser root ist gemontet von der nein wir haben gebootet von der ssd aber unser root ist gemontet von der sd karte das ist definitiv nicht wie wir es haben wollen das ist irgendwie falsch ok power off und sd karte raus ist er aus jawoll strom aus sd karte raus zack anschalten das coole ist man sieht auch gleich ob es funktioniert weil er grün blinkt so mal gucken ob das mit ssh jetzt klappt ansonsten muss ich den kram nochmal neu flaschen da habe ich ja wieder bock drauf gebootet von der ssd das sieht man weil er so merkwürdig blinkt ja ah excellent ah man warum geht das nicht muss ich jetzt den scheiß echt man muss doch im nachhinein den kram irgendwie aktivieren können ok was war es raspberry pi wie aktiviert man den kram nachträglich wie ne ne ne ne das das ding ist gerade auf wie wie macht man wie aktiviert man den service man müsste irgendwelche system d dinger um um linken oder so tastatur und bildschirm anschließen ich habe eine idee wir machen jetzt big brain play leute ich versuchte es jetzt ohne monitor zu tippen ja change root müssten wir machen wahrscheinlich ja ja ja denke ich auch ich war ich war ich mache ich versuch es mal zu tippen mit der tastatur ohne dass ich was sehe oder bin ich mal ok system ctl enable wie geht das unter ssd wer das klappt ist big brain nein nein ok ok big brain also ich schließe jetzt mal meine meine tastatur an an den raspberry gar nichts ich sehe gar nichts ok tastatur ist dran ich muss mich erstmal einloggen genau hi enter raspberry enter sudo-i enter system ctl enable sshd system ctl start sshd ob das jetzt funktioniert hat also ich bin ja mal gespannt ob das jetzt ich kann nicht enter drücken aber big brain play ha oh ist es ist es englisches tastatur leer auch du scheiße ok leute change root wir change root nicht gebacken das kriege ich nicht blind das kriege ich nicht blind getippt das kriege ich nicht blind getippt faka ne hat nicht funktioniert laut key de ne ne ne ne komm leute wir starten nochmal neu von der sd karte wir starten nochmal neu von der sd karte ok a lesbian da bin ich ja mal gespannt ob das jetzt ob das jetzt genau oder warum kann man das warum kann man das nur einmal aktivieren über das mount wahrscheinlich falls vorm resize ist ist das doof ok also was haben da jetzt alles ja den da brauchen wir also mount ja mount das da nach mnt so und wie change root wie wie ging das nochmal das mache ich so selten nicht einfach so oder oder einfach so ging das einfach so ne oder doch da müssen wir irgendwelche befehle angeben stem ctl enable sshd oh ne so funktioniert das schonmal gar nicht oh gott was ein scheiß was what warum kann man das ist inne was ok was auch immer wie macht man das da drin boot options ne wo steht denn das drunter überhaupt interface options ah ssh yes ok und das ganze probieren wir jetzt mal mit ja yes ob das jetzt funktioniert hat ne oder das das hat jetzt nicht funktioniert leute das kann es kann man sich erzählen prepare for ssh without screen to enable ssh oh ist das boot ssh on your boot ne gibts nicht was auch immer ok ob das jetzt funktioniert hat was ich da gemacht habe copy was ne das funktioniert immer nein das funktioniert nicht ssh in der bootpartition das funktioniert wohl anscheinend nur einmalig bevor er die platte resized hat ok das ist wieder war wieder die die einfachste sache ist wieder das komplizierteste ok mal gucken ob das jetzt funktioniert an was wir gemacht haben ich mein wir haben wir haben wir haben unser root gewechselt auf auf das von der ssd karte von der ssd platte ich bin jetzt geneigt dazu das mal zu probieren ich bin jetzt echt geneigt das mal zu zu probieren komm mal weil ich war mir jetzt update dann geht das auch auf die ssd und nicht und nicht auf meine micro sd karte ups ich sollte vielleicht nicht so viel enter drücken ein frisches drauflatschen wäre doch lange ja das stimmt aber probieren wir probieren mal was ob jetzt hier unser root wirklich auf also dd wir gucken jetzt mal wie schnell das ist und ob das die ssd ist oder mikro sd also auch immer block size gleich 4096 quatsch progress nee ah fuck wie ging das status dd status kann ich mir immer nicht merke status progress so rum ok das ist auf jeden fall das ist auf jeden fall die ssd auf die wir gerade schreiben nicht die micro sd karte bei der geschwindigkeit das auf jeden fall die ssd das war nicht die schnellste ssd aber die micro sd ist definitiv nicht so schnell so ok ich riebute mal ob das jetzt funktioniert ich meine kann sein dass es klappt kann nicht sein pie enable ssh headless yep headless raspberry pie config ich war ein system ctl sollte ja eigentlich tun aber max irgendwie nicht sehr sehr merkwürdig nun gut ja ich ich hoffe das hat jetzt funktioniert probieren wir mal aus poff was ah jetzt poff warum kopiert er nicht einfach die ssh datei den boot oder weil die platte schon re-sized ist und anscheinend das nicht mehr funktioniert nachdem sie schon re-sized ist also das funktioniert wohl nach dem ersten boot nicht mehr ich meine ich könnte die ssd einfach neu flaschen das würde würde natürlich funktionieren aber ich will mal gucken ob ich sie nicht so irgendwie gebacken kriegt weil ich habe echt kein schimmer wie man das macht ich könnte die ich könnte die sachen selbst verlinken die unit selbst verlinken irgendwie ok booted er booted er booted monka boot das brauche aber ganz schön lang jetzt brauche aber ganz schön lang was ist hier los warum braucht er jetzt so lang zu booten what rip warum muss jetzt das problem hallo wo ist denn jetzt das problem also dass er jetzt auf einmal nicht mehr booten kann kann ich mir nur nicht vorstellen ne ne die ip hat sich nicht geändert ich hab grad nachgeguckt das war auch das erste was ich gedacht habe dass ich die ip geändert hat aber der hat keine der hat sich keine neue ip geholt monka s ok ich mach nochmal aus und nochmal an vielleicht war ich zu schnell wenn nicht flashe ich halt den kram nochmal meinetwegen ja das können wir übrigens sogar vom raspberry pi selbst machen ne der mag nicht mehr booten von der sd card what the fuck warum ok es hat funktioniert was wir gemacht haben es hat funktioniert wie ging das noch mal option ignore no strict strict no ne ah fuck ich vergess immer wieder kram funktioniert dass man eben sagen kann scheiß drauf na gut da sind wir leute da sind wir excellent hat alles funktioniert siehste haben wir alles richtig gemacht ca root auf die ssd raspberry pi config und funktioniert ok sehr gut sehr gut sehr gut so wir laufen komplett von der sd karte ihr seht es ist auch keine micro sd karte mehr drin wir sind direkt komplett von ssd über usb gebooted huge so jetzt machen wir das system erst mal update mach ich jetzt kaputt wenn ich das jetzt noch mal upgrade wie war das kommando nochmal für den 40 gen bootloader 40 gen cmd bootloader version bootloader version ok wir sind korrekt ab upgrade das sollte jetzt viel schneller gehen weil es dann über die ssd geht ja boah leute das flutscht so schnell ab der raspberry pi und die updaten sind das flutscht und die ssd ist auch schon nicht sonderlich schnell habt ihr eben gesehen billige ziemlich billige ssd worum geht es dass wir den raspberry pi 4 endlich komplett von usb bzw von ssd booten kann ohne dass eine micro sd karte drin sein muss so schnell sieht man selten in raspberry pi updaten das machen wir tatsächlich mal danach wobei zeitzonen kann man auch über raspberry pi config setzen glaube und keine tot und keine toten micro sd karte auch ja so sehr schön wo setzt man lokalisation options time zone europe germany anni berlin date 1248 sehr gut was hast du denn für problem wenn lan kabel eingesteckt ist hat der pi 4 eigentlich immer noch fake gigabit srnet nee das ist besser angebunden jetzt können wir mal ausprobieren iperf hier machen wir mal bin aber gigabit dran iperf minus s war das glaube ich und ja guck gigabit passt ziemlich gut 939 mbit in beide richtungen das ist das ist ziemlich gigabitig maximum maximum bei gigabit ist glaube ich 1250 mbit max theoretisches maximum aber das ist schon ok das ist schon ok so wie war der befehl für du machst auf der einen seite machst du iperf minus s für den server und auf der anderen seite machst du minus c für klein du kannst auch reverse glaube ich irgendwie sagen dass er es anders rum dann testet reverse ah minus groß r war das jetzt teste das umgedreht jetzt teste das quasi von dem zu dem vor allem von dem zu dem getestet aber ich sehe das eigentlich kein großer unterschied zwischendrin hat aber ein paar retries was auch immer er da rumspackt ich weiß es nicht im lokalen netzwerk sollte der eigentlich keine retries brauchen und wir desmond sieben monate exzellent vorher hat er keine retries gebraucht oder ok in die eine richtung braucht er keine retries also von von mir zum raspberry pi keine retries vom raspberry pi zu mir retry was auch immer scheiß drauf es funktioniert es ist gigabit es ist relativ schnell so was ich jetzt noch probieren wollte wenn ich den upgrade und restart ob das dann noch funktioniert weil ja doch bootloaderversion passt ist eigentlich alles gut reboot gucken ob es noch tut dankeschön für den sub huge kann das sein dass der manchmal spinnt wenn man ihn rebootet ich bin begeistert und es war relativ einfach muss man sagen aber auch nur dank dem video hier die offizielle anleitung ist absoluter crap ich mein guck mal wie viel sachen in diesem video drin waren was in der offiziellen anleitung nicht drinne steht also bestes bestes wird der raspberry pi eignet sich für nass nicht sondern nicht gut auch der vierer nicht trotz gigabit und usb 3 eignet sich der vierer nicht gut für den nass budget nass ja das ist aber schon sehr budget das ist aber schon sehr budget in raspberry pi als nass da ist fast alles andere besser als raspberry pi sogar die hier sind ganz gut als budget nass die hier sind ganz gut als budget nass da passt sogar eine 3,5 zoll festplatte rein die dinger sind ganz gut als budget nass kein rate nö aber bei einem budget nass reden wir ja auch nicht von rate bei einem budget nass sonst wäre es ja kein budget nass mehr weil für alles andere ist der raspberry pi 4 auch nicht richtig gut das das das große problem bei einem nass und raspberry pi 4 ist dass die gespart haben bei den crypto extensions von der cpu die cpu hätte eigentlich die cpu hätte eigentlich crypto extensions aber die haben sich gedacht nö brauchen wir nicht und ohne die crypto extensions von der cpu ist halt jegliche verschlüsselung saumäßig langsam krypt setup benchmark ich kann es euch mal zeigen wie langsam benchmark wie ging das noch mal was einfach krypt setup benchmark als kosten ja ist für mich aber als anwender wurscht ich weiß nicht klar warum sie es gespart haben aber es ist halt kacke retopie ja habe ich mir schon aufgeschrieben so wir lassen jetzt mal den benchmark laufen man sieht es viel zu langsam ja das hier ist das wichtige oder auch das hier und man sieht man kriegt maximal 64 64 beziehungsweise 85 mb die sekunde die co decrypted also sprich man kann das nicht als nass verwenden weil man darf nicht vergessen das hier verwendet jetzt 100 prozent cpu und wenn du das ding als nass verwendet kommt ja noch dabei du brauchst auf die auf die ssd braucht auch noch mal 30 40 prozent cpu last du brauchst ein samba server von windows drauf zuzugreifen da braucht auch noch mal ordentlich was das heißt realistisch gesehen verschlüsselung entschlüsselung legte so bei 50 mb vielleicht so ach ich glaube nicht dass die die lizenzen für die für die crypto extensions das jetzt so ins unermessliche getrieben haben ich meine die nehmen ja auch relativ viel ab ich habe keine ahnung ehrlich gesagt wie groß die lizenzgebühren sind ist mir aber wurscht also den raspberry pi kannst du halt aus diesem grund nicht als nass gebrauchen machst du eigentlich deinen versand tracker noch mal weiter ich glaube nicht ich glaube nicht das ding das ding ist total unfertig also es geht um das ding hier versand track so ich hatte mal so was gebastelt wo man quasi versand dienstleister unabhängig seine bestellung tracken konnte und der hat sich die sachen halt automatisch aus dem email postfach rausgepasst sprich man hat immer erkannt wann pakete kommen auch wenn man sie nicht manuell hinzugefügt hat aber ich habe selbst grad nicht im einsatz und es hat sich auch als nicht so nicht so praktisch rausgestellt für mich wie ich mir das gedacht habe ich weiß nicht ob ich da ja sascha verwendest du das weil wie gesagt amazon habe ich ja immer noch nicht eingebaut obwohl amazon problemlos möglich sein sollte gibt schon parcel app ja aber die parcel app kann nicht alles das die parcel app die kann auch glaube email postfächer passen aber manche sachen erkennt sie nicht und es und es kostet was und irgendwas war ich kann mich ich kann mich noch ich kann mich ich kann mich nicht mehr dran erinnern es hatte seinen grund warum ich das nachgebaut habe ach ja klar ich weiß warum ich nachgebaut habe weil ich das ja in meine heim automatisierung integrieren wollte und das kann ich mit der parcel app natürlich vergessen ich wollte dann auch irgendwelche webhooks einbauen dass man das ding bescheid sagen kann und auf meinem dashboard anzeigen kann dhl kommt heute oder ups kommt heute vielleicht mache ich vielleicht mache ich auch mal weiter dran dann müssen wir aber wahrscheinlich das frontend neu basteln weil das ist mit ural view version wie sieht deine boot konfig jetzt aus genauso wie vorher wie heißt die datei nach der man da konf hier kommt euch mal wie schnell das geht mit der ssd kommt mal hier achtung install flupp das ist fast so schnell wie lokal mit der ssd ist das so schnell weiß ich ob ssh da irgendwo drin steht nee gar nicht so wie vorher ich habe ein ch root einen change root gemacht auf meine ssd und habe dann über raspberry konfig den kram aktiviert aktivist haben gut konfig vc woodloader konfig so wie vorher also hat also nix kaputt gemacht also das hat ausgesprochen hat ausgesprochen gut funktioniert muss ich sagen nachdem der kram jetzt tut neuer standard 0xf41 ja anscheinend bedeutet das ja dass er erst booted von usb und dann von der mikro sd karte was aber ein bisschen doof ist man kann die mikro sd karte nicht drinnen lassen weil er dann das root von der mikro sd karte nimmt da weiß ich nicht wie man ihm das abgewöhnt vielleicht warte mal etc fs tab mal gucken ach was auch immer das schöne ist man braucht auch gar keine mikro sd karte mehr das ist eigentlich der sinn davon und das ist nice das ist poggers nice was der grün was der riesen vorteil davon ist auch keine sd karten mehr die kaputt gehen sd karten also vor allem mikro sd karten sind nicht bekannt dafür dass sie sonderlich haltbar sind die einzigen die wirklich richtig gut sind was das angeht ist samsung mikro sd endurance die dinger sind richtig gut aber die sind halt auch ganz schön teuer ich mein 22 dollar 23 euro hier für ne für ne mikro sd ist schon ganz schön aber die sind wirklich gut also wenn ich kisten hätte habe ich auch in meinem raspberry unify controller drin also wenn ich kisten hätte wo ich wirklich sicher gehen will dass mir die mikro sd karte nicht verreckt dann würde ich die nehmen wtf wusste nicht dass du streamst omega null ja wie hast du es denn jetzt gefunden also wie gesagt die kann ich die endurance mikro sds kann ich nur empfehlen alternativ wenn ihr euch das jetzt mal so anguckt ihr habt hier für 22 für 23 euro ne mikro sd karte die zumindest von der vom weißt es vom wirlöffel und vom vom vom halt wie es kaputt geht ziemlich ziemlich gut was aushält aber wenn man sich anguckt wenn ihr eine kleine ssd kauft also zum beispiel ja wieder hier ssd eine kleine guckt euch das mal an da kriegt ihr nämlich schon für 20 euro mehr für 15 euro mehr für 15 euro mehr kriegt ihr dann nämlich schon 240 gigabyte also wenn man so weit könnte man könnte sich fast überlegen mehr ssd zu nehmen anstatt eine sd karte also bespricht wenn man zur auswahl hat 23 euro für eine 64 g durable mikro sd oder man nimmt einfach direkt ne ssd für 40 euro ja vorgeschlagenes streams nice echt ich bin in vorgeschlagenes streams drin das ist ja ja exzellent was man hier natürlich noch braucht muss man auch gestimmt muss man auch dabei rechnen man braucht noch nen sata auf usb das funktioniert natürlich sonst sonst nicht gibt es eigentlich noch 128 gibt es eigentlich noch die klein guck mal du kriegst für weniger für weniger als die ssd als die mikro sd karte kostet kriegst du 120 g sata ssd und da fährst du auf jeden fall besser mit allerdings da passt noch nicht mal modern warfare drauf das ist richtig schau dir mal samsung flash usb stick das ding welchen meinste na ob der so viel besser ist als die mikro sd karte weiß ich nicht weiß ich was die da reinbauen aber man sieht eine sache eindeutig dadurch man hat viel mehr auswahl man hat viel mehr auswahl jetzt man kann sagen ich scheiß drauf und eben einfach eine billige mikro sd man kann sagen ok ist mir ein bisschen wichtiger ich nehme die endurance variante mikro sd oder aber du gehst gleich auf usb boot und sagst ich nehme 128 g ssd die billige ist als die mikro sd endurance mit einem adapter ein bisschen mehr oder nimmst nen usb stick mit flash technik und sowas also richtig gut man hat wenn hat viel mehr auswahl jetzt und wenn es ein wichtig ist dass der raspberry pi nicht verreckt beim stromausfall dann ist es mit usb boot auf jeden fall besser man kann natürlich auch sagen ich scheiß komplett drauf sascha ich wollte es nämlich gerade sagen man kann auch sagen ich scheiß komplett drauf und nimmt einfach wenn man speicherplatz braucht nimmt einfach irgendwie eine zwei terabyte festplatte das geht natürlich jetzt auch und das gute ist dass es auch über usb 3 booted weil ich zeige es euch noch mal es ist relativ geschwind wie gesagt die ssd die sackt ja also das ist es gibt deutlich schnellere ssd als dieses ding da bei einer festplatte braucht ein zusätzliches netzteil ja bei manchen ich glaube manche 2,5 zoll platten müssten vielleicht auch gehen gucken wie viel stromaus so einem usb vom raspberry pi ziehen kann also die ssd ist jetzt nicht super super schnell ja easykiller sagt ich traue mich erst dran wenn die einrichtung idiotensicher ist du kannst ja nichts kaputt machen im zweifelsfall flasht du deine sd karte neu kaputt gehen kann dabei ja nix die ssd ist schon echt langsam oder wie heißt dein text to speech von einem miem tool das ist irgendein was weiß ich auch unkopflich das ist irgendein koreanischer oder japanischer text to speech service gewesen der das hier machen kann hier wo sei ich der sebaro was ist das denn was ist das denn für ein big brain name ah das ist ein raspberry pi gehäuse das ist ein ziemlich stabiles raspberry pi gehäuse kann man das hutschiene montieren ah das ist das ist die jaja ok ja das aber kein usb 3 das ist doof usb 3 beste und wahrscheinlich auch kein richtiges gigabit oder geht ja um stabil ja gut wenn es wenn es denn hier stabil geht und den rest nicht dann ist das vielleicht was das ist der pi ramriegel habe ich mich noch null mit beschäftigt poe ist natürlich praktisch poe ist ja immer so ein bisschen hack mäßig gewesen beim raspberry pi ich weiß gar nicht wie man beim pi 4 richtiges poe macht oh leute ich muss mir essen bestellen was bestelle ich mir denn also ich bestelle mir auf jeden fall heute döner beziehungsweise irgendwas türkisches weil freitags bestelle ich meistens irgendwelche bei bei so einem dönerladen hier um die ecke freitags bietet sich da immer anführe so also köfte köfte spieß also was ich normalerweise nehme ist dünner teller salat und reis oder dünner teller salat und pomfret aber es gibt ja auch noch zig andere das problem ist ich kann euch das jetzt nicht zeigen weil dann dann lieg ich quasi den dönerladen um die ecke so also wie gesagt dünner teller ist das normale was ich bestell allerdings so ein piede döner würde ich mir auch vor das ist ja kein döner passt ja nicht also sprich dieses schiff genau mit dünner vielleicht auch das ist auch sehr nice habe ich heute schon eine ganze weile nicht mehr gehabt das könnte ich mir vielleicht auch mal wieder eins eins holen oder das hier wo ich keine ahnung habe wie man das ausspricht wie spricht man das aus wie spricht man das aussprache ah ne ich habe gar keinen sound hier lama tun okay probieren wir mal aussprache pronunciation oh das kann ich das ist mir zu kompliziert lachmar tun also lach eher wie lachen wie dem auch sei eigentlich geht es mir nicht so sehr darum dass ich es richtig ausspreche sondern dass es schmeckt da haben die hier zu bieten auch wieder mit dünnerfleisch oder mit käse und dünnerfleisch vielleicht auch noch mal auch nicht schlecht mal wieder ein iran habe ich noch da iran muss ich nicht mit bestellen ich habe das problem bei iran ich habe mich da mittlerweile so dran gewöhnt dass ich nicht mal merke wie salzig das ist und ich den eindruck habe ich trinke quasi yoghurt übertrieben gesagt das heißt mir schmecken jetzt die irans die so extrem salzig sind am besten weil ich das normale salzige nicht mehr als salzig empfinde das wahrscheinlich habe ich zu viel getrunken von ist das beste was gibt ja vielleicht bestelle ich mir echt echt hier so ein aber einer aber da ist nicht viel dran oder ich meine ich glaube nicht dass ich da von einem satt werde das wird gefüllt und gerollt ja gut wenn ich mir mit dünnerfleisch bestelle dann ist ja schon gefüllt na ja das ist doch das ist doch ordentliche portion so was ist doch eine ganz gute portion aber dünner also am liebsten er sich bei dem eigentlich bestellen wieder den dünner teller da weiß ich wie viel das ist dünner teller ist bei dem richtig gut das ist eine riesen box alter es ist eine riesen box nee so sieht das so ungefähr sieht das sieht das bei denen aus das ist eine riesen box er sieht sieht bloß dass bei dem der salat nur so eine kleine so eine kleine box kriegt und der rest ist reis und dünnerfleisch oder pommes frites und und dünnerfleisch und was ich soße das ist richtig für den für den richtig echten kokona style super dünner teller ah guck mal halb der hälfte und so viel grün wer braucht grün reis dünnerfleisch reicht mir oder pommes frites eins von beiden ich bin mir noch nicht sicher was ich dabei nehme ich esse beides gern pommes frites ja dann kokona soll ich bestell ich bestell mal nebenbei chat ich bestell mal kurz nebenbei so hast du was vor mit den keksen zu machen du kannst damit chatnachrichten hervorheben und und dinger machen das ist die standardsache die in twitch halt drinne ist ok ich bestell mir dünner teller dünner teller teller dünner teller und heute mit das mal gucken ich habe zur auswahl mit joghurtsoße mit knoblauchsoße mit scharfer knoblauchsoße ich würde sagen mit scharfer knoblauchsoße beilage mit pommes frites mit reis ohne beilage nach ohne beilage ist blöd weil der koste auch nicht weniger mit reis mit pommes frites mit reis mit pommes frites mit pommes frites mehr kokona ups jetzt habe ich die seite zugemacht nicht gut dünner dünner reispommes excellent knoblauchsoße scharf mit pommes frites 8 euro ok oh Mist ich darf das ja nicht mehr bei leferando bestellen warum ist das immer so kompliziert bestellen taxe hier oder über leferando ist nämlich der mindest bestellwert zu hoch die wenn ich das allerdings direkt über die webseite vom shop bestelle vom vom dünnerladen bestelle dann ist es lustigerweise billiger aber wahrscheinlich weil er halt die gebühren sonst abdrücken muss an leferando ok dünner teller da ist es zack noch mal ich glaube ich muss echt gucken dass hier nichts leake der chat chat wartet schon darauf dass wieder geliegt wird knoblauchsoße scharf einmal pommes frites bestätigen jetzt bestellen jawoll excellent zur kasse geben sie eine telefonnummer an ok telefonnummer zur kasse jawoll paypal excellent paypal jawoll zack check out keine handynummer hinterlegen nervt jetzt nicht rum paypal 9,17 us dollar warum rechnet paypal meine bestellung in us dollar um den dank für ihre bestellung ihre bestellung war erfolgreich ihre bestellung wird in ungefähr 30 minuten geliefert sehr gut also leute halbe stunde zeit haben wir noch coconut clap ja kann ich überhaupt coconut clap machen fast ich habe kein bild ok ja was machen wir jetzt noch eine halbe stunde ne ich esse nicht im stream vor allem den dünner teller kann ich im stream essen warte mal ganz kurz wir müssen jetzt nur darauf achten ob es klingelt im hintergrund leute kannst du bitte pulse 180 am trifft reich auf oh nee oder ich glaube das ist nicht das richtige für mich so was anzugucken da soll lieber unge drauf reaktion oder so wie würdest du in c sharp zwei ordner aber wir können auch mal gucken was es für fragen gibt genau wie würdest du in c sharp zwei ordner mit unterverzeichnissen vergleichen also welche dateien gelöscht oder hinzugefügt worden willst du einfach nur wissen ob die ordner gleich sind der inhalt gleich ist oder willst du willst du einen diff quasi also wenn du und wie detailliert soll der diff sein also wenn du wenn du nur wissen willst welche dateien unterschiedlich sind würde ich das mit irgendwelchen c sharp hat doch hat doch set types oder sets set genau warum sieht die seite so abartig aus okay dann würde ich das wahrscheinlich damit machen irgendwie also ich würde ich würde eine liste ich würde mir eine liste generieren also nur mal nur mal so jetzt was was mir so spontan einfällt ich würde mir also wenn ich selbst machen müsste als erstes würde ich natürlich gucken gibt es nicht eine ordentliche library für diffs für c sharp gibt es garantiert aber angenommen ich muss das von hand machen dann würde ich mir die verzeichnisse würde ich mir die inhalt von den verzeichnissen auflisten jeweils einmal in einem also in zwei hashsets speichern und dann gucken was schnittmenge ist und sowas genau contains union overlaps also du machst jetzt du machst jetzt zwei mengen zwei hashsets mengen und machst dann schnittmenge teilmenge was auch immer alles von und das müsste dann relativ gut gehen rauszubekommen welche dateien fehlen auf der einen seite und welche mehr sind und welche gleich sind das müsste mit zwei hashsets relativ easy funktionieren natürlich kannst du das auch manuell machen einfach zwei schleifen machen du kannst auch du kannst auch dass irgendwie die link queries machen und sagst dann contains any oder so aber ich finde mal so prinzipiell dass das so mit zwei hashsets und die mit irgendwelchen mengen operationen vergleichen klingt das erst mal am sinnigsten wie nimmst du mit dem odroid tv sendung auf hiermit omg its mode das kommt drauf an was du dir da für einen typ bastelst den du in die sets machst wenn es einfach nur das string vom filename ist dann natürlich nicht wenn es ein custom typ ist mit custom vergleich wie heißt das comparator compare linksbums mit custom typ vergleich funktionen dann kannst du das auch mit einem eigenen typ machen wo endungsdatum mime type und alles drin ist ach welcome to c-sharp nein das wollten wir uns echt mal angucken genau also odroid nehme ich mit tv her darauf da ist tv her darauf wir haben uns im stream zusammen den neuen neuen körner für das odroid ding kompiliert wo meine tv tv karte unterstützt wurde und dann haben wir tv installiert und auf meinem nvidia schild tv habe ich ein kodi drauf und das kodi hat dann die macht die verbindung zum tv headend ich habe da auch seit einem jahr oder so nichts mehr dran gemacht und es funktioniert einfach das ist immer gut so kannst du frag einen milliardär auf youtube gucken kann ich machen allerdings nicht jetzt sondern das schreibe ich mir auf für aufwachen videos für den aufwachen stream am sondag hast du schon das neue schild tv gesehen ja sieht aus wie eine e-zigarette habe ich schon gesehen in der letzten halbzeit könnte man gett repos pushen ich bin nicht eingeloggt auf github hier und das meme tool pushe ich eh so nicht in der in der art und weise geiler war so ein stream gestern hast du geklagt hast du kugeln was ist das darf ich das auf machen die seite ja go xlr multiple usb audio device in winner so you can control your app volumes oh das ist gut das ist gut oh das ist cool hey das ist echt cool das gefällt mir das ist nice was kosten das ist auch auf deutsch bei toman kannst du den kaufen perfekt nice das ist gut das gefällt mir richtig was kosten das gefällt mir echt gibt es auch bei amazon regular das ist der dicke ok das scheint sehr angesagt zu sein das gefällt mir echt gut das ding das muss ich mir aufschreiben das wäre ich mir vielleicht wirklich zulegen könnte auch die hälfte kosten ja könnte könnte schon könnten sie mir auch die könnten mir auch einfach ein schenken easy aber finde es gefällt mir das hat was stimmt ja das muss ich echt noch pushen bin ich hier auf github eingeloggt sein wie ist mein github password moment ich gucke mal nach github hier Okay, das da, wollten wir pushen, Pusherino, gut, dann pushen wir das mal. Wo hatten wir das, Documents, Platform, IO, Projects, CACW, natürlich bester Name dafür. So, ich muss jetzt gucken, dass ich nicht alles adde. Secrets, Secrets adden wir schon mal nicht, ja. Geht, warum auch immer. Oh, ich kacke, wo habe ich das Secrets da drinnen committed. MonkaS, warum mache ich denn so was. Erstmal will das Git Repo löschen hier, weg damit. Okay, get in it. Okay, ich lösche das jetzt einfach mal. Oder wir machen Git Ignore, Git Ignore, oh jetzt wird's advanced, Leute, Source, oh nee, nee, nee, nee, nee, Leute, das ist mir zu riesig, zu risikoreich, Source, Secrets, ich glaube in den Secrets steht überhaupt nichts drinnen, was es noch gibt, ne. So, also, Git Ignore, ja, perfekt, Source, Secret soll auch Ignored werden. Git Status, okay, Git Add, alles, nee, VS Code soll auch Ignored werden, alles, komplett VS Code soll Ignored werden, alles, okay, Source Test, okay, das ist in Ordnung, das wird alles rein, Git Add, Git, Git Status, okay, es ist kein Secrets drinnen, exellent, es hat schon mal funktioniert, aber Include soll er eigentlich auch nicht reinmachen, oder? Ach, was auch immer, ich mache das Projekt gerade noch mal auf. Ist das überhaupt das, was wir haben wollten, ja, ja, ne, Update, ja, ja, geh mal weg, ja, ich push einfach mal so, wie es ist, könnt ihr euch raussuchen, ich glaube das hier, ich glaube der Admin Server war das, war das Wichtige, okay, Secrets ist Ignored, das ist schon mal sehr poggers, okay, dann, Git Status, dann brauchen wir die Repo hier, SSH können wir in dem Fall glaube ich gar nicht verwenden, Git Commit, Init, habe ich überhaupt meinen richtigen Account hier eingestellt, nein, Max at Localhost, exellent, beste, Git Remote at Origin, das da, Git Remote, okay, Git Push Origin Master, Username Wublords at gmx.de und wie war mein Passwort noch mal, das weiß ich doch jetzt aus dem Kopfnummer, muss ich noch mal nachgucken, Chat, hier, Leak, Leak Potentials, ähm, ja, ja, ja, ja, ja, ja, was, achso, ja ist gut, weil wir da schon ein Readme gemacht haben, ja, wir überbügeln So, ist gepusht. Na, dafür habe ich noch keine authorized keys, ich bin ja auch hier gerade eingeloggt als max and local host. So, da ist es. Also, wer es haben wollte hat es jetzt. Ja, test gibt es nix, source ist auch die secrets nicht drinne. So, hier habt ihr alles, genau. Die IP-Config, hier ist der ganze Kram für, das müsst ihr natürlich anpassen, dann wer es auch immer verwenden will. Also sprich der NTP-Server wird ja bei euch nicht so aussehen, aber hier oben ist ja alles definiert. Hier kommt die Zeitzone rein, hier kommt der NTP-Server rein, hier kommt der Hausname für den ESP rein, hier oben die IPs und alles. Hier unten müsst ihr eigentlich gar nichts mehr anpassen. Das funktioniert einfach alles. Gut, hier ist noch ein bisschen Logik drinne, wo ich weiter gebastelt habe im Stream, das könnt ihr rausschmeißen. Also sprich die Logik hier irgendwie für Klingelsensor und sowas. Das eigentlich Wichtige für das Update über HTTPS ist hier drinne. Gibt es hier diese Admin-Server-Klasse? Ne, der Namespace-Admin-Server, das ist absolut eklig, das C++. Also absolut nicht, wie sagt man hier, C++ wie man es machen sollte, aber C++ wie man es machen sollte ist ja auch kacke. So und hier ist alles drin. Also genau, jetzt könnt ihr euch angucken. Und der macht beim Start auch ein Self-Signed-Certificate, dann das funktioniert. Genau, Update ist hier IP vom ESP, unter diese url-update kann man neue Firmware hochladen. Hier kriegt man irgendwelche Statistiksachen, glaube ich, zurückgeliefert, wie Zeit und Firmwaregröße und sowas. Und hier kann man das Ding neu starten. Wenn ihr Basic Auth braucht, kann ja auch sein, müsst ihr selbst einbauen oder vielleicht mache ich das noch mal in dem Stream Basic Auth einbauen. Ja und was ich mal echt machen muss ist, ich glaube Two-Factor-Authentifizierung auf GitHub mal anschalten. Falls ich mal hier echt mal irgendwann mein Passwort leake, das wäre ziemlich doof. Ich komm grad, wo macht man das überhaupt? Wo macht man Two-Factor-Authentifizierung an in GitHub? Your Profile, Settings hier, Security, Account. Okay. Ich hab keine Ahnung, wie man Two-Factor-Authentifizierung anmacht. Security Log, ah hier Two-Factor, Enable Two-Factor Authentication. Okay, mach ich später, wenn ich fertig bin mit dem Stream. Hab ich. So, sehr gut. Ich würd sagen, jetzt kommt, es hat geklingelt, wirklich. Der Chat wieder. So ist es. Gut, also, Kram ist gepusht auf GitHub, da. Da. Sehr gut, sehr gut. Okay, ähm. Ups, ich, ich sign mich mal wieder out. Ja hab ich doch. Da, genau dafür, genau dafür ist das Projekt doch da. Hier, dafür sind auch die Fotos da, die ich hier habe. Ähm, das ist, das ist die, das ist die Gegensprechanlage vom Telefon, äh, vom, von, äh, die Türgegensprechanlage. Und so sieht die von hinten aus. Und das ist, äh, der kleine Mini-ESP32, der da drinnen hängt. Und guckt, ob es geklingelt hat. Ja, weil der noch nicht dran ist. Das geht grad nicht. Der liegt noch hier neben mir. Der ist noch nicht drinnen. Wann hab ich ein Essen bestellt, Leute? Wann hatte ich ein Essen bestellt? Kurz nach 13 Uhr, ne? So 13.10 Uhr in dem Dreh. Ich guck grad mal in meine E-Mails. Oh, es hat geklingelt. Hab das gehört. Es hat geklingelt. ne? So, Chat. Ich geh jetzt essen. Ich geh jetzt futtern. Wir sehen uns im nächsten Stream. Hat ja heute ausnahmsweise mal echt gut funktioniert. Alles geklappt. Wir waren ziemlich, ziemlich, äh, wenig sidetracked worden heute. Und ich geh jetzt was essen. Also wir sehen uns im nächsten Stream. Bis dann. Heute Wars on vielleicht. Mal schauen. Bis dann, CO. Alles gut.", "segments": [{"id": 1, "start": 120.0, "end": 144.84, "text": "Pock!"}, {"id": 2, "start": 174.84, "end": 180.84, "text": "So Leute, ich geh mal kurz was zu trinken holen, dann geht's los."}, {"id": 3, "start": 180.84, "end": 182.84, "text": "Wir gucken uns heute..."}, {"id": 4, "start": 182.84, "end": 184.84, "text": "Dann bin ich ziemlich laut, oder?"}, {"id": 5, "start": 184.84, "end": 187.84, "text": "Hat Teams wieder an meinem Sound rumgestellt?"}, {"id": 6, "start": 187.84, "end": 190.84, "text": "Teams macht ja so Sachen öfters mal."}, {"id": 7, "start": 190.84, "end": 192.84, "text": "Poggeurs?"}, {"id": 8, "start": 192.84, "end": 196.84, "text": "Was ist eigentlich Poggeurs auf Französisch?"}, {"id": 9, "start": 196.84, "end": 198.84, "text": "Poggeurs?"}, {"id": 10, "start": 198.84, "end": 204.84, "text": "Ähm..."}, {"id": 11, "start": 204.84, "end": 206.84, "text": "Ähm..."}, {"id": 12, "start": 206.84, "end": 209.84, "text": "Nee, passt. Lautstärke."}, {"id": 13, "start": 209.84, "end": 211.84, "text": "Exzellent."}, {"id": 14, "start": 211.84, "end": 214.84, "text": "xFatal137 12 Monate."}, {"id": 15, "start": 214.84, "end": 220.84, "text": "Wahnsinniger High IQ Subscriber."}, {"id": 16, "start": 220.84, "end": 223.84, "text": "So Leute, ich geh mal ganz kurz was zu trinken holen, dann bin ich am Start."}, {"id": 17, "start": 223.84, "end": 225.84, "text": "Was wir uns heute angucken ist..."}, {"id": 18, "start": 225.84, "end": 229.84, "text": "Es gibt seit gestern, oder seit vorgestern, eigentlich seit vorgestern..."}, {"id": 19, "start": 229.84, "end": 234.84, "text": "Eine neue Beta-Firmware für den Raspberry Pi 4, wo man endlich..."}, {"id": 20, "start": 234.84, "end": 236.84, "text": "Und da warte ich schon eine ganze Weile drauf..."}, {"id": 21, "start": 236.84, "end": 239.84, "text": "Wo man endlich von einer SSD booten kann, beziehungsweise wo man..."}, {"id": 22, "start": 239.84, "end": 241.84, "text": "Okay, das stimmt ja nicht so ganz."}, {"id": 23, "start": 241.84, "end": 244.84, "text": "Wo man endlich von USB booten kann, was im Endeffekt heißt."}, {"id": 24, "start": 244.84, "end": 246.84, "text": "Man kann von einer SSD booten."}, {"id": 25, "start": 246.84, "end": 248.84, "text": "Ein Vormittagstream, ja klar."}, {"id": 26, "start": 248.84, "end": 254.84, "text": "Ich hab frei, ich muss nichts machen heute."}, {"id": 27, "start": 254.84, "end": 256.84, "text": "Ich kann ja auch nichts dafür."}, {"id": 28, "start": 256.84, "end": 261.84, "text": "Wenn heute die Leute schaffen gehen müssen."}, {"id": 29, "start": 261.84, "end": 269.84, "text": "Frag mich nicht warum, einfach so."}, {"id": 30, "start": 269.84, "end": 273.84, "text": "Heute Warzone, wir haben gestern glaube 10 Stunden Warzone gespielt."}, {"id": 31, "start": 273.84, "end": 278.84, "text": "Und wir haben nur gewonnen."}, {"id": 32, "start": 278.84, "end": 287.84, "text": "Easy."}, {"id": 33, "start": 287.84, "end": 290.84, "text": "Das ist mit vorausgekommen, ja das ist ganz neu."}, {"id": 34, "start": 290.84, "end": 294.84, "text": "Das ist ganz neu."}, {"id": 35, "start": 294.84, "end": 303.84, "text": "Er chatte sich nicht ganz einig, ob Kappa oder nicht Kappa, ja."}, {"id": 36, "start": 303.84, "end": 305.84, "text": "Monarch S."}, {"id": 37, "start": 305.84, "end": 308.84, "text": "Ich muss kurz was zu drehen holen, ich bin gleich wieder da."}, {"id": 38, "start": 365.84, "end": 379.84, "text": "Auf gehts, probieren wir das ganze mal aus."}, {"id": 39, "start": 379.84, "end": 383.84, "text": "Das kann entweder schnell gehen oder langsam gehen oder gar nicht gehen."}, {"id": 40, "start": 383.84, "end": 388.84, "text": "Mal gucken wie das funktioniert."}, {"id": 41, "start": 388.84, "end": 391.84, "text": "Ich hab auch schon mal eine Stunde Sport gemacht."}, {"id": 42, "start": 391.84, "end": 397.84, "text": "Eigentlich gar keinen Witz und gar keinen Cup."}, {"id": 43, "start": 397.84, "end": 399.84, "text": "Ich hab wirklich schon eine Stunde Sport gemacht."}, {"id": 44, "start": 399.84, "end": 401.84, "text": "Das heißt ich bin sogar jetzt relativ wach."}, {"id": 45, "start": 401.84, "end": 404.84, "text": "Was schon für die Uhrzeit nicht unbedingt selbstverständlich ist bei mir."}, {"id": 46, "start": 404.84, "end": 409.84, "text": "Also was ich gelesen hab ist."}, {"id": 47, "start": 409.84, "end": 415.84, "text": "Man kann jetzt seit vorgestern mit der neuen Beta filmen."}, {"id": 48, "start": 415.84, "end": 418.84, "text": "Das heißt wir müssen auf jeden Fall erstmal mit SSD installieren das ganze."}, {"id": 49, "start": 418.84, "end": 428.84, "text": "Und nachdem wir es mit SSD installiert haben, müssen wir Firma Upgrade machen."}, {"id": 50, "start": 428.84, "end": 434.84, "text": "Und nachdem wir Firma Upgrade gemacht haben irgendwie auf der SSD das ganze dann drauf haben."}, {"id": 51, "start": 434.84, "end": 435.84, "text": "Keine Ahnung wie es genau funktioniert."}, {"id": 52, "start": 435.84, "end": 439.84, "text": "Im Zweifelsfall haben wir gar keine Ahnung wie es funktioniert."}, {"id": 53, "start": 439.84, "end": 447.84, "text": "Ich hab gesehen, dass einer der besten Technik YouTube Channels dazu auch schon ein Video gemacht hat."}, {"id": 54, "start": 447.84, "end": 450.84, "text": "Also sprich wenn wir gar keine Ahnung haben wie es funktioniert."}, {"id": 55, "start": 450.84, "end": 453.84, "text": "Dann gucken wir uns das hier einfach an wie das klappt."}, {"id": 56, "start": 453.84, "end": 456.84, "text": "Aber die haben hier auch so eine Mini Anleitung drinne wie es funktioniert."}, {"id": 57, "start": 456.84, "end": 461.84, "text": "Und zwar macht man eine ganz normale Installation auf der SD Karte."}, {"id": 58, "start": 461.84, "end": 464.84, "text": "Dann macht man einen Firmware Upgrade."}, {"id": 59, "start": 464.84, "end": 466.84, "text": "Nico doch gilt für alle."}, {"id": 60, "start": 466.84, "end": 469.84, "text": "Die älteren Raspberry Pies können alle schon USB Boot."}, {"id": 61, "start": 469.84, "end": 476.84, "text": "Der einzige Raspberry Pi der keinen USB Boot kann ist glaube ich der Raspberry Pi 1."}, {"id": 62, "start": 476.84, "end": 480.84, "text": "Der ist 0, beim 0 bin ich aber gar nicht sicher."}, {"id": 63, "start": 480.84, "end": 482.84, "text": "Also der 3er kann es auf jeden Fall."}, {"id": 64, "start": 482.84, "end": 484.84, "text": "Der 4er, der 4er kommt plus nicht."}, {"id": 65, "start": 484.84, "end": 485.84, "text": "Was total wirr ist."}, {"id": 66, "start": 485.84, "end": 489.84, "text": "Alle anderen vorher konnten es mehr oder weniger aber der 4er kann es nicht."}, {"id": 67, "start": 489.84, "end": 490.84, "text": "So also genau."}, {"id": 68, "start": 490.84, "end": 494.84, "text": "Danach also man installiert erstmal ganz normales SD Karten Image."}, {"id": 69, "start": 494.84, "end": 496.84, "text": "Dann macht man Firmware Upgrade."}, {"id": 70, "start": 496.84, "end": 498.84, "text": "Das ist ja der Befehl wo sie immer davor waren."}, {"id": 71, "start": 498.84, "end": 500.84, "text": "Den sollte man nicht verwenden."}, {"id": 72, "start": 500.84, "end": 502.84, "text": "Aber diesmal ist es halt absichtlich."}, {"id": 73, "start": 502.84, "end": 504.84, "text": "Diesmal mal absichtlich den Firmware Upgrade."}, {"id": 74, "start": 504.84, "end": 507.84, "text": "Danach müssen wir irgendwie einen Beta Bootloader selecten."}, {"id": 75, "start": 507.84, "end": 511.84, "text": "Was ich ja immer geil finde an diesen Anleitungen ist."}, {"id": 76, "start": 511.84, "end": 523.84, "text": "Dass die wichtigste, also der wichtigste Punkt in diesem ganzen How To ist nicht beschrieben."}, {"id": 77, "start": 523.84, "end": 529.84, "text": "Das ist wieder so richtig High IQ Big Brain."}, {"id": 78, "start": 529.84, "end": 531.84, "text": "Der wichtigste Punkt ist nicht beschrieben."}, {"id": 79, "start": 531.84, "end": 533.84, "text": "Select Beta Bootloader."}, {"id": 80, "start": 533.84, "end": 534.84, "text": "Alles klar?"}, {"id": 81, "start": 534.84, "end": 538.84, "text": "Okay und nachdem wir wie auch immer geartet den Beta Bootloader selected haben."}, {"id": 82, "start": 538.84, "end": 543.84, "text": "Müssen wir Raspberry Pi EEPROM Update minus D minus F."}, {"id": 83, "start": 543.84, "end": 545.84, "text": "Ist ja ganz klar."}, {"id": 84, "start": 545.84, "end": 547.84, "text": "Ich glaube die Parameter muss ich nicht erklären."}, {"id": 85, "start": 547.84, "end": 550.84, "text": "Die sind offensichtlich die weiß eh jeder oder?"}, {"id": 86, "start": 552.84, "end": 553.84, "text": "Ist glaube ich jedem klar."}, {"id": 87, "start": 553.84, "end": 555.84, "text": "Muss man nicht ins Detail gehen."}, {"id": 88, "start": 555.84, "end": 558.84, "text": "Also wer das nicht weiß, das weiß ich auch nicht."}, {"id": 89, "start": 558.84, "end": 559.84, "text": "Ähm."}, {"id": 90, "start": 562.84, "end": 563.84, "text": "Okay."}, {"id": 91, "start": 563.84, "end": 565.84, "text": "New Configuration Settings are required."}, {"id": 92, "start": 565.84, "end": 566.84, "text": "Okay dann schreibt er das."}, {"id": 93, "start": 566.84, "end": 568.84, "text": "Also ich vermute mal, dass das sowas hier heißt."}, {"id": 94, "start": 568.84, "end": 569.84, "text": "Ich habe ehrlich gesagt keine Ahnung."}, {"id": 95, "start": 569.84, "end": 571.84, "text": "Also ich habe echt keinen Plan was das heißt."}, {"id": 96, "start": 571.84, "end": 572.84, "text": "Ich vermute mal, dass das Force ist."}, {"id": 97, "start": 572.84, "end": 573.84, "text": "Überschreiben."}, {"id": 98, "start": 574.84, "end": 576.84, "text": "Und das hier ist D."}, {"id": 99, "start": 579.84, "end": 581.84, "text": "Keine Ahnung wovor das steht."}, {"id": 100, "start": 581.84, "end": 582.84, "text": "Okay."}, {"id": 101, "start": 582.84, "end": 583.84, "text": "Danach Rebootet man."}, {"id": 102, "start": 583.84, "end": 585.84, "text": "Nochmal von der SD Karte."}, {"id": 103, "start": 585.84, "end": 589.84, "text": "So und danach macht man die SD Karte raus."}, {"id": 104, "start": 590.84, "end": 593.84, "text": "Und dann können wir von USB booten."}, {"id": 105, "start": 594.84, "end": 595.84, "text": "Wie auch immer es genau funktioniert."}, {"id": 106, "start": 595.84, "end": 597.84, "text": "Ich habe echt keine Ahnung."}, {"id": 107, "start": 597.84, "end": 599.84, "text": "Aber wenn wir keine Ahnung haben."}, {"id": 108, "start": 599.84, "end": 600.84, "text": "Und es auch gar nicht funktioniert."}, {"id": 109, "start": 600.84, "end": 602.84, "text": "Dann gucken wir uns das Video hier zu an."}, {"id": 110, "start": 602.84, "end": 603.84, "text": "Weil der macht immer echt gute Videos."}, {"id": 111, "start": 603.84, "end": 604.84, "text": "Sonst kann es nicht so komplizierter."}, {"id": 112, "start": 604.84, "end": 606.84, "text": "Wenn das Video plus drei Minuten lang geht."}, {"id": 113, "start": 606.84, "end": 607.84, "text": "Genau."}, {"id": 114, "start": 607.84, "end": 608.84, "text": "Exzellent."}, {"id": 115, "start": 608.84, "end": 609.84, "text": "Exzellent."}, {"id": 116, "start": 611.84, "end": 614.84, "text": "Okay also als erstes brauchen wir das allerneueste."}, {"id": 117, "start": 614.84, "end": 615.84, "text": "Raspian."}, {"id": 118, "start": 615.84, "end": 618.84, "text": "Warum habe ich schon wieder so wenig Platz hier drauf?"}, {"id": 119, "start": 618.84, "end": 619.84, "text": "Warum ist das immer meine?"}, {"id": 120, "start": 619.84, "end": 621.84, "text": "Warte mal die ganze Scheiße mal zumachen."}, {"id": 121, "start": 621.84, "end": 622.84, "text": "Den brauchen wir auch wichtig."}, {"id": 122, "start": 622.84, "end": 623.84, "text": "Den müssen wir auflassen."}, {"id": 123, "start": 626.84, "end": 627.84, "text": "Testgit."}, {"id": 124, "start": 627.84, "end": 628.84, "text": "Ich glaube das können wir mal löschen."}, {"id": 125, "start": 628.84, "end": 629.84, "text": "Das brauchen wir."}, {"id": 126, "start": 629.84, "end": 630.84, "text": "Das haben wir nicht."}, {"id": 127, "start": 630.84, "end": 631.84, "text": "Das waren irgendwelche Testgeschichten."}, {"id": 128, "start": 631.84, "end": 632.84, "text": "Weg damit."}, {"id": 129, "start": 633.84, "end": 634.84, "text": "Weg damit."}, {"id": 130, "start": 635.84, "end": 636.84, "text": "Weg damit."}, {"id": 131, "start": 636.84, "end": 638.84, "text": "Weg weg weg damit."}, {"id": 132, "start": 639.84, "end": 640.84, "text": "Auch weg damit."}, {"id": 133, "start": 640.84, "end": 641.84, "text": "Okay wunderbar."}, {"id": 134, "start": 641.84, "end": 643.84, "text": "Ich glaube ich habe hier noch jede Menge Downloads drin."}, {"id": 135, "start": 643.84, "end": 644.84, "text": "Die ich immer löschen kann."}, {"id": 136, "start": 646.84, "end": 647.84, "text": "Hier."}, {"id": 137, "start": 647.84, "end": 649.84, "text": "Ich habe noch ein altes Raspian Image."}, {"id": 138, "start": 649.84, "end": 651.84, "text": "In Lineage haben wir hier noch drauf."}, {"id": 139, "start": 652.84, "end": 653.84, "text": "Google App."}, {"id": 140, "start": 653.84, "end": 654.84, "text": "Apps."}, {"id": 141, "start": 654.84, "end": 655.84, "text": "Twitch."}, {"id": 142, "start": 655.84, "end": 657.84, "text": "Das ist das was der Inder für uns programmiert hat."}, {"id": 143, "start": 658.84, "end": 660.84, "text": "Hier haben wir noch ein Raspian Image."}, {"id": 144, "start": 660.84, "end": 661.84, "text": "Kann alles weg."}, {"id": 145, "start": 661.84, "end": 662.84, "text": "Das ist Trash."}, {"id": 146, "start": 662.84, "end": 663.84, "text": "Also wer sich fragt was das hier ist."}, {"id": 147, "start": 663.84, "end": 664.84, "text": "Was das macht."}, {"id": 148, "start": 664.84, "end": 666.84, "text": "Ich habe mein RM."}, {"id": 149, "start": 666.84, "end": 669.84, "text": "Hab ich ersetzt durch das Kommando Trash."}, {"id": 150, "start": 669.84, "end": 670.84, "text": "Was genau das macht."}, {"id": 151, "start": 670.84, "end": 672.84, "text": "Was es unter Windows auch macht."}, {"id": 152, "start": 672.84, "end": 673.84, "text": "Also sprich."}, {"id": 153, "start": 675.84, "end": 676.84, "text": "Ne wie ging das."}, {"id": 154, "start": 677.84, "end": 679.84, "text": "Ich kenne die Option gar nicht mehr."}, {"id": 155, "start": 681.84, "end": 682.84, "text": "Ah Trashlist war es."}, {"id": 156, "start": 682.84, "end": 683.84, "text": "Genau."}, {"id": 157, "start": 683.84, "end": 684.84, "text": "Da kann man sich anzeigen lassen."}, {"id": 158, "start": 684.84, "end": 685.84, "text": "Was für Sachen im Papierkorb sind."}, {"id": 159, "start": 685.84, "end": 687.84, "text": "Weil ich habe schon öfters mal."}, {"id": 160, "start": 687.84, "end": 688.84, "text": "Mit hier sowas."}, {"id": 161, "start": 688.84, "end": 690.84, "text": "Aus Versehen in meinem Heimatverzeichnis Sachen gelöscht."}, {"id": 162, "start": 690.84, "end": 692.84, "text": "Die ich noch gerne behalten hätte."}, {"id": 163, "start": 692.84, "end": 693.84, "text": "Deswegen."}, {"id": 164, "start": 694.84, "end": 696.84, "text": "Habe ich jetzt den Kram da aliast."}, {"id": 165, "start": 697.84, "end": 698.84, "text": "Okay."}, {"id": 166, "start": 698.84, "end": 700.84, "text": "Raspian Downloads."}, {"id": 167, "start": 700.84, "end": 701.84, "text": "Raspian Downloads."}, {"id": 168, "start": 704.84, "end": 705.84, "text": "Was."}, {"id": 169, "start": 705.84, "end": 706.84, "text": "Raspian."}, {"id": 170, "start": 706.84, "end": 707.84, "text": "Ich kann nicht schreiben."}, {"id": 171, "start": 708.84, "end": 710.84, "text": "Wir brauchen das Allerneueste."}, {"id": 172, "start": 710.84, "end": 711.84, "text": "Oh guck mal."}, {"id": 173, "start": 711.84, "end": 714.84, "text": "Es gibt jetzt sogar für Ubuntu gibt es."}, {"id": 174, "start": 717.84, "end": 718.84, "text": "So."}, {"id": 175, "start": 718.84, "end": 720.84, "text": "Wir wollen allerdings nicht."}, {"id": 176, "start": 720.84, "end": 722.84, "text": "Wir wollen das Light ISO."}, {"id": 177, "start": 722.84, "end": 723.84, "text": "Wo ist es denn."}, {"id": 178, "start": 723.84, "end": 728.84, "text": "Häh."}, {"id": 179, "start": 734.84, "end": 735.84, "text": "Bin ich jetzt blöd."}, {"id": 180, "start": 735.84, "end": 736.84, "text": "Wo ist der Download hin."}, {"id": 181, "start": 740.84, "end": 741.84, "text": "Was."}, {"id": 182, "start": 741.84, "end": 750.84, "text": "Wo ist der Download hin."}, {"id": 183, "start": 754.84, "end": 755.84, "text": "Ah hier."}, {"id": 184, "start": 756.84, "end": 758.84, "text": "Man muss erst auf die Unterseite gehen."}, {"id": 185, "start": 758.84, "end": 763.84, "text": "Das ist auch exquisite gut durchdacht."}, {"id": 186, "start": 764.84, "end": 765.84, "text": "So hier Downloads."}, {"id": 187, "start": 768.84, "end": 769.84, "text": "Gut SD Karte."}, {"id": 188, "start": 769.84, "end": 771.84, "text": "Wo habe ich meine SD Karte."}, {"id": 189, "start": 771.84, "end": 773.84, "text": "Die steckt wahrscheinlich Raspberry Pi noch drinnen."}, {"id": 190, "start": 774.84, "end": 775.84, "text": "Komm mal her."}, {"id": 191, "start": 775.84, "end": 776.84, "text": "Raspberry Pi."}, {"id": 192, "start": 776.84, "end": 777.84, "text": "Komm her."}, {"id": 193, "start": 777.84, "end": 779.84, "text": "Ja hier ist die SD Karte noch drin."}, {"id": 194, "start": 780.84, "end": 783.84, "text": "Das ist Twilight Princess Musik Soundtrack."}, {"id": 195, "start": 784.84, "end": 785.84, "text": "Na."}, {"id": 196, "start": 785.84, "end": 786.84, "text": "Ja."}, {"id": 197, "start": 786.84, "end": 787.84, "text": "Das ist eines der besten."}, {"id": 198, "start": 787.84, "end": 789.84, "text": "Eines der besten Stücke aus dem ganzen Soundtrack hier."}, {"id": 199, "start": 790.84, "end": 792.84, "text": "Richtig Poggers."}, {"id": 200, "start": 794.84, "end": 795.84, "text": "Wo habe ich eigentlich noch Twitch."}, {"id": 201, "start": 795.84, "end": 797.84, "text": "Twitch Streaming Server auf."}, {"id": 202, "start": 797.84, "end": 800.84, "text": "Und warum habe ich mein Telefon noch am Start als Bild."}, {"id": 203, "start": 801.84, "end": 802.84, "text": "Geil."}, {"id": 204, "start": 802.84, "end": 803.84, "text": "Kann man vielleicht mal alles gebrauchen."}, {"id": 205, "start": 805.84, "end": 806.84, "text": "NoSkiller abonniert Twitch Prime."}, {"id": 206, "start": 806.84, "end": 807.84, "text": "Dankeschön."}, {"id": 207, "start": 807.84, "end": 808.84, "text": "Excellent Subscription."}, {"id": 208, "start": 814.84, "end": 815.84, "text": "Leaked."}, {"id": 209, "start": 815.84, "end": 816.84, "text": "OMG."}, {"id": 210, "start": 816.84, "end": 817.84, "text": "Ich habe schon so viel geleaked."}, {"id": 211, "start": 818.84, "end": 819.84, "text": "Langsam könnte man."}, {"id": 212, "start": 819.84, "end": 821.84, "text": "Man könnte den Max Leak Puzzle machen."}, {"id": 213, "start": 821.84, "end": 826.84, "text": "Wer puzzelt alle Leaks zusammen."}, {"id": 214, "start": 827.84, "end": 828.84, "text": "Musst du heute nicht arbeiten."}, {"id": 215, "start": 828.84, "end": 829.84, "text": "Nee nee."}, {"id": 216, "start": 829.84, "end": 830.84, "text": "Muss ich nicht."}, {"id": 217, "start": 833.84, "end": 834.84, "text": "Ja."}, {"id": 218, "start": 834.84, "end": 835.84, "text": "Wahrscheinlich."}, {"id": 219, "start": 835.84, "end": 836.84, "text": "Muss ich mal gleich ausprobieren."}, {"id": 220, "start": 836.84, "end": 837.84, "text": "Dann werden wir es soweit haben."}, {"id": 221, "start": 838.84, "end": 839.84, "text": "Hat das jetzt runtergeladen."}, {"id": 222, "start": 839.84, "end": 840.84, "text": "Da."}, {"id": 223, "start": 840.84, "end": 841.84, "text": "Passt."}, {"id": 224, "start": 841.84, "end": 843.84, "text": "Wo ist mein SD Kartenleser."}, {"id": 225, "start": 843.84, "end": 844.84, "text": "Hier."}, {"id": 226, "start": 846.84, "end": 847.84, "text": "SD Kartenleser."}, {"id": 227, "start": 847.84, "end": 848.84, "text": "SD Karte rein."}, {"id": 228, "start": 848.84, "end": 850.84, "text": "Zack."}, {"id": 229, "start": 852.84, "end": 853.84, "text": "Hier."}, {"id": 230, "start": 853.84, "end": 854.84, "text": "Das können wir raus machen."}, {"id": 231, "start": 862.84, "end": 863.84, "text": "So."}, {"id": 232, "start": 863.84, "end": 864.84, "text": "SD Kartenleser rein."}, {"id": 233, "start": 864.84, "end": 865.84, "text": "Ist das schon drin."}, {"id": 234, "start": 865.84, "end": 866.84, "text": "Ja."}, {"id": 235, "start": 866.84, "end": 867.84, "text": "Perfekt."}, {"id": 236, "start": 867.84, "end": 868.84, "text": "Edge."}, {"id": 237, "start": 868.84, "end": 869.84, "text": "Ohr."}, {"id": 238, "start": 870.84, "end": 871.84, "text": "Und erstmal das Ding."}, {"id": 239, "start": 871.84, "end": 872.84, "text": "Auf die SD Karte."}, {"id": 240, "start": 872.84, "end": 873.84, "text": "Die Ideen."}, {"id": 241, "start": 874.84, "end": 875.84, "text": "Oder was heißt Ideen."}, {"id": 242, "start": 875.84, "end": 878.84, "text": "Etchen."}, {"id": 243, "start": 879.84, "end": 880.84, "text": "Da ist es."}, {"id": 244, "start": 880.84, "end": 881.84, "text": "Zack."}, {"id": 245, "start": 881.84, "end": 882.84, "text": "So."}, {"id": 246, "start": 882.84, "end": 883.84, "text": "Das flasht jetzt."}, {"id": 247, "start": 883.84, "end": 884.84, "text": "So."}, {"id": 248, "start": 884.84, "end": 885.84, "text": "Ähm."}, {"id": 249, "start": 885.84, "end": 886.84, "text": "So wie ich das verstanden habe."}, {"id": 250, "start": 886.84, "end": 887.84, "text": "Wir müssen das Ding jetzt erstmal flashen."}, {"id": 251, "start": 887.84, "end": 888.84, "text": "Auf die SD Karte."}, {"id": 252, "start": 888.84, "end": 891.84, "text": "Und den Raspberry Pi mit der SD Karte starten."}, {"id": 253, "start": 891.84, "end": 893.84, "text": "Und danach einen Firmware Update machen."}, {"id": 254, "start": 893.84, "end": 894.84, "text": "So weit so gut."}, {"id": 255, "start": 894.84, "end": 895.84, "text": "So weit so einfach noch."}, {"id": 256, "start": 895.84, "end": 897.84, "text": "Brückentag."}, {"id": 257, "start": 902.84, "end": 903.84, "text": "Brückentag."}, {"id": 258, "start": 903.84, "end": 904.84, "text": "Envoblo."}, {"id": 259, "start": 904.84, "end": 905.84, "text": "Also ja."}, {"id": 260, "start": 905.84, "end": 906.84, "text": "Mein Chef."}, {"id": 261, "start": 906.84, "end": 907.84, "text": "Hat."}, {"id": 262, "start": 907.84, "end": 908.84, "text": "Hat."}, {"id": 263, "start": 908.84, "end": 909.84, "text": "Hat gesagt."}, {"id": 264, "start": 909.84, "end": 910.84, "text": "Ich muss."}, {"id": 265, "start": 910.84, "end": 911.84, "text": "Urlaub nehmen."}, {"id": 266, "start": 911.84, "end": 912.84, "text": "Jetzt ohne Scheiß."}, {"id": 267, "start": 912.84, "end": 913.84, "text": "Das ist nicht so das ich gesagt habe."}, {"id": 268, "start": 913.84, "end": 914.84, "text": "Ich will."}, {"id": 269, "start": 914.84, "end": 915.84, "text": "Ich muss."}, {"id": 270, "start": 915.84, "end": 920.84, "text": "Und dann habe ich natürlich gesagt."}, {"id": 271, "start": 920.84, "end": 921.84, "text": "Ja gut."}, {"id": 272, "start": 921.84, "end": 922.84, "text": "Dann nehme ich den Tag der sich anbietet."}, {"id": 273, "start": 922.84, "end": 923.84, "text": "Nehme ich jetzt das Ding hier."}, {"id": 274, "start": 923.84, "end": 924.84, "text": "Da hat man am meisten davon."}, {"id": 275, "start": 924.84, "end": 925.84, "text": "Nehme nehme."}, {"id": 276, "start": 925.84, "end": 927.84, "text": "Nehme nicht zwangsurlaub in dem Sinn."}, {"id": 277, "start": 927.84, "end": 928.84, "text": "Bei uns ist es so."}, {"id": 278, "start": 928.84, "end": 930.84, "text": "Bei uns ist ja wieder Kurzarbeit noch sonst was."}, {"id": 279, "start": 930.84, "end": 931.84, "text": "Aber die haben jetzt gesagt."}, {"id": 280, "start": 931.84, "end": 933.84, "text": "Und das kann ich nachvollziehen."}, {"id": 281, "start": 933.84, "end": 935.84, "text": "Es gibt zwar genug bei uns die sich darüber aufregen."}, {"id": 282, "start": 935.84, "end": 936.84, "text": "Aber ich kann es nachvollziehen."}, {"id": 283, "start": 936.84, "end": 937.84, "text": "Die haben gesagt okay."}, {"id": 284, "start": 937.84, "end": 938.84, "text": "Die Leute."}, {"id": 285, "start": 938.84, "end": 939.84, "text": "Warte mal."}, {"id": 286, "start": 939.84, "end": 940.84, "text": "Ich war ein bisschen weniger."}, {"id": 287, "start": 940.84, "end": 941.84, "text": "Ein bisschen weniger hektische Musik grade."}, {"id": 288, "start": 941.84, "end": 942.84, "text": "Ja."}, {"id": 289, "start": 942.84, "end": 943.84, "text": "Beste."}, {"id": 290, "start": 943.84, "end": 944.84, "text": "Ähm."}, {"id": 291, "start": 944.84, "end": 945.84, "text": "Das kann ich nachvollziehen."}, {"id": 292, "start": 945.84, "end": 946.84, "text": "Die haben bei uns jetzt gesagt."}, {"id": 293, "start": 946.84, "end": 947.84, "text": "Okay."}, {"id": 294, "start": 947.84, "end": 949.84, "text": "Falls diese Corona Geschichte jetzt."}, {"id": 295, "start": 949.84, "end": 952.84, "text": "Gegen Ende des Jahres wieder vorbei ist."}, {"id": 296, "start": 952.84, "end": 957.84, "text": "oder alle Beschränkungen aufgehoben sind, werden die letzten 2-3 Monate im Jahr alle ihren Urlaub nehmen."}, {"id": 297, "start": 957.84, "end": 964.84, "text": "Deswegen haben die gesagt, ok, man soll jetzt schon 80% oder mindestens 80% seines Jahresurlaubs verplanen,"}, {"id": 298, "start": 964.84, "end": 967.84, "text": "dass man sicherstellt, dass immer genug Leute da sind."}, {"id": 299, "start": 967.84, "end": 970.84, "text": "Das kann ich verstehen, das klingt einleuchtend, ja."}, {"id": 300, "start": 970.84, "end": 973.84, "text": "Und ich hab ja schon fast alles verplant, bis auf 2 Tage."}, {"id": 301, "start": 973.84, "end": 976.84, "text": "Deswegen hat er jetzt gesagt, ich muss jetzt die 2 Tage noch irgendwo eintragen."}, {"id": 302, "start": 976.84, "end": 979.84, "text": "Dann habe ich gesagt, ja gut, dann nehme ich nächste Woche Freitag, also heute."}, {"id": 303, "start": 979.84, "end": 983.84, "text": "Und, ähm, was ist das eigentlich? Hessen? Feiertage?"}, {"id": 304, "start": 983.84, "end": 986.84, "text": "Ich muss mal gucken, was ich da noch anbiete."}, {"id": 305, "start": 986.84, "end": 988.84, "text": "Das ist alles schon vorbei."}, {"id": 306, "start": 988.84, "end": 991.84, "text": "Das war jetzt gerade gestern."}, {"id": 307, "start": 998.84, "end": 1001.84, "text": "Montag. Montag ist ein scheiß Feiertag."}, {"id": 308, "start": 1001.84, "end": 1003.84, "text": "Donnerstag. Exzellent."}, {"id": 309, "start": 1003.84, "end": 1009.84, "text": "Dann nehme ich mir am 12.06. wieder Urlaub."}, {"id": 310, "start": 1019.84, "end": 1021.84, "text": "Und Tag der Deutschen. Jetzt auch noch Samstag."}, {"id": 311, "start": 1021.84, "end": 1026.84, "text": "Das ist aber, die fallen aber, die fallen aber dieses Jahr echt schlecht."}, {"id": 312, "start": 1026.84, "end": 1029.84, "text": "Weihnachten fällt auch nicht allzu gut."}, {"id": 313, "start": 1029.84, "end": 1033.84, "text": "Lass mal überlegen, wie ist denn das dann?"}, {"id": 314, "start": 1033.84, "end": 1036.84, "text": "Weihnachten, also 24. ist bei uns eh frei."}, {"id": 315, "start": 1036.84, "end": 1038.84, "text": "Das heißt, Donnerstag frei, Freitag frei, Samstag."}, {"id": 316, "start": 1038.84, "end": 1041.84, "text": "Ok, Samstag ist verschenkt."}, {"id": 317, "start": 1043.84, "end": 1048.84, "text": "Silvester. Silvester ist immer dann, wenn 24. ist, oder?"}, {"id": 318, "start": 1048.84, "end": 1051.84, "text": "Also 31. ist immer dann 7 Tage, logischerweise nach."}, {"id": 319, "start": 1051.84, "end": 1054.84, "text": "Ok, also Silvester ist dann auch an einem."}, {"id": 320, "start": 1054.84, "end": 1057.84, "text": "Donnerstag, das heißt, das fällt doch eigentlich ganz gut."}, {"id": 321, "start": 1057.84, "end": 1059.84, "text": "Das ist nur Samstag verschenkt diesmal."}, {"id": 322, "start": 1059.84, "end": 1062.84, "text": "Bei mir ist halt doof, was Sachen, die auf Montag fallen."}, {"id": 323, "start": 1062.84, "end": 1065.84, "text": "Und Montag fallen halt immer Ostern und Pfingsten. Immer."}, {"id": 324, "start": 1065.84, "end": 1067.84, "text": "Das ist halt für mich schlecht."}, {"id": 325, "start": 1067.84, "end": 1071.84, "text": "Also Feiertage, die auf Montag fallen, ist für mich halt verschenkt."}, {"id": 326, "start": 1073.84, "end": 1075.84, "text": "Das ist halt doof, ne?"}, {"id": 327, "start": 1079.84, "end": 1081.84, "text": "Warum? Weil ich Montags nicht arbeite."}, {"id": 328, "start": 1081.84, "end": 1085.84, "text": "Das heißt, wenn Montags Feiertage sind, ist halt kacke."}, {"id": 329, "start": 1085.84, "end": 1089.84, "text": "Und Feiertage Samstags ist halt auch für jeden schlecht."}, {"id": 330, "start": 1095.84, "end": 1098.84, "text": "Ich finde auch Ostermontag sollte lieber Dienstag sein."}, {"id": 331, "start": 1098.84, "end": 1103.84, "text": "Ja, warum nicht? Ich mein, sollte es halt den Osterdienstag umnennen."}, {"id": 332, "start": 1103.84, "end": 1108.84, "text": "Was interessiert mich, ob da Jesus angeblich irgendwie auferstanden ist oder so."}, {"id": 333, "start": 1108.84, "end": 1111.84, "text": "Who cares? Wichtiger ist, dass ich nicht arbeiten muss."}, {"id": 334, "start": 1111.84, "end": 1115.84, "text": "Was juckt mich der Rest, Alter?"}, {"id": 335, "start": 1115.84, "end": 1119.84, "text": "Deswegen in letzter Zeit waren auch irgendwelche Diskussionen wieder,"}, {"id": 336, "start": 1119.84, "end": 1121.84, "text": "ob man nicht einen Feiertag machen sollte."}, {"id": 337, "start": 1121.84, "end": 1125.84, "text": "Ich glaube, wann war das jetzt? War doch erst letztens irgendwann,"}, {"id": 338, "start": 1125.84, "end": 1127.84, "text": "wo sie gesagt haben, wir sollen einen Feiertag machen da,"}, {"id": 339, "start": 1127.84, "end": 1129.84, "text": "wo Deutschland den Zweiten Weltkrieg verloren hat oder so was."}, {"id": 340, "start": 1129.84, "end": 1131.84, "text": "Da habe ich gesagt, ohne Scheiß, macht."}, {"id": 341, "start": 1131.84, "end": 1134.84, "text": "Immer, immer, umso mehr Feiertage, umso besser."}, {"id": 342, "start": 1134.84, "end": 1139.84, "text": "Mich interessiert die historische oder religiöse oder was auch immer Bedeutung."}, {"id": 343, "start": 1139.84, "end": 1143.84, "text": "Ehrlich gesagt relativ wenig, Hauptsache, ich muss nicht arbeiten."}, {"id": 344, "start": 1143.84, "end": 1148.84, "text": "Die könnten auch sagen, heute ist Tag der USB-Sticks"}, {"id": 345, "start": 1148.84, "end": 1151.84, "text": "und das ist so eine bedeutende Technologie, dass es einen Feiertag gibt,"}, {"id": 346, "start": 1151.84, "end": 1155.84, "text": "da sage ich, Alter, USB-Sticks beste, Hauptsache Feiertag."}, {"id": 347, "start": 1155.84, "end": 1159.84, "text": "Hauptsache, ich muss nicht arbeiten, der Rest ist mir eigentlich vollkommen wurscht."}, {"id": 348, "start": 1161.84, "end": 1165.84, "text": "So, hat das jetzt geflasht? Ja, successfully."}, {"id": 349, "start": 1165.84, "end": 1169.84, "text": "In Berlin war doch Weltfrauentag ein Feiertag? Ja, unbedingt."}, {"id": 350, "start": 1169.84, "end": 1171.84, "text": "Also ich bin ja schon immer Feminist gewesen,"}, {"id": 351, "start": 1171.84, "end": 1173.84, "text": "das heißt, wir sollten das deutschlandweit auch bekommen."}, {"id": 352, "start": 1175.84, "end": 1179.84, "text": "Also ich bin immer dafür, für mehr Feiertage."}, {"id": 353, "start": 1181.84, "end": 1183.84, "text": "So, jetzt haben wir das geflasht."}, {"id": 354, "start": 1185.84, "end": 1187.84, "text": "Also ohne Scheiß, wenn wir einen Feiertag kriegen,"}, {"id": 355, "start": 1187.84, "end": 1191.84, "text": "wenn es Weltfrauentag ist, dann bin ich auch ein Tag Feminist, das ist auch okay."}, {"id": 356, "start": 1191.84, "end": 1195.84, "text": "Das sage ich dann, wir brauchen Frauenquote, wir brauchen alles, alles."}, {"id": 357, "start": 1195.84, "end": 1197.84, "text": "Gender, Paygap, alles, alles."}, {"id": 358, "start": 1197.84, "end": 1201.84, "text": "An dem Tag bin ich für alles, Hauptsache, ich muss nicht arbeiten gehen."}, {"id": 359, "start": 1201.84, "end": 1205.84, "text": "So, SD-Karte ist geflasht, ziehen wir das mal raus."}, {"id": 360, "start": 1205.84, "end": 1209.84, "text": "Oh, ich hätte vielleicht noch einen Sync machen sollen."}, {"id": 361, "start": 1211.84, "end": 1214.84, "text": "Das war jetzt eine doofe Idee, ich muss den USB-Stick noch mal reinmachen,"}, {"id": 362, "start": 1214.84, "end": 1217.84, "text": "weil ich habe auch vergessen, SSH einzuschalten."}, {"id": 363, "start": 1217.84, "end": 1221.84, "text": "Das Big, Small Brain war das von mir."}, {"id": 364, "start": 1221.84, "end": 1223.84, "text": "Small Brain."}, {"id": 365, "start": 1224.84, "end": 1226.84, "text": "Small Brain, also."}, {"id": 366, "start": 1226.84, "end": 1229.84, "text": "Was man ja immer machen muss, nachdem man, das kann man,"}, {"id": 367, "start": 1229.84, "end": 1231.84, "text": "das ist eine Sache, die kann man sich wirklich bemerken,"}, {"id": 368, "start": 1231.84, "end": 1233.84, "text": "nachdem man eine Raspberry Pi Image geflasht hat"}, {"id": 369, "start": 1233.84, "end": 1238.84, "text": "oder eine Micro SD-Karte geflasht hat mit dem aktuellen Raspberry-Image,"}, {"id": 370, "start": 1238.84, "end": 1241.84, "text": "muss man die immer noch einmal mounten."}, {"id": 371, "start": 1241.84, "end": 1243.84, "text": "SD-B1 ist es."}, {"id": 372, "start": 1243.84, "end": 1245.84, "text": "Und man muss die immer noch einmal mounten."}, {"id": 373, "start": 1245.84, "end": 1247.84, "text": "SD-B1 ist es."}, {"id": 374, "start": 1247.84, "end": 1250.84, "text": "Und man muss, das hier ist die Boot-Partition vom Raspberry,"}, {"id": 375, "start": 1250.84, "end": 1253.84, "text": "man muss eine Datei anlegen, die SSH heißt."}, {"id": 376, "start": 1253.84, "end": 1256.84, "text": "So, und dann, und dann muss man das nicht so machen, wie ich macht,"}, {"id": 377, "start": 1256.84, "end": 1259.84, "text": "dann unmountet man das wieder, macht man einen Sync hinterher,"}, {"id": 378, "start": 1259.84, "end": 1262.84, "text": "dass es auch geschrieben ist, und dann zieht man den USB-Stick wieder raus."}, {"id": 379, "start": 1262.84, "end": 1265.84, "text": "Und dann hat man eine SD-Karte, wo SSH gestartet ist."}, {"id": 380, "start": 1265.84, "end": 1268.84, "text": "Ansonsten ist nämlich kacke, man kann sich nicht einloggen."}, {"id": 381, "start": 1268.84, "end": 1272.84, "text": "Nee, WLAN brauche ich nicht, ich mache ein paar Kabel dran."}, {"id": 382, "start": 1272.84, "end": 1275.84, "text": "Ich habe auch gerade überlegt, ob ich das WLAN machen soll,"}, {"id": 383, "start": 1275.84, "end": 1279.84, "text": "also ich mache ein paar Kabel dran, wenn ich Kabel finde."}, {"id": 384, "start": 1279.84, "end": 1284.84, "text": "So, dann mache ich jetzt erst einmal die Micro SD-Karte in den Raspberry rein."}, {"id": 385, "start": 1284.84, "end": 1287.84, "text": "Und dann machen wir hier mal die ersten beiden Schritte,"}, {"id": 386, "start": 1287.84, "end": 1290.84, "text": "gucken, ob das funktioniert."}, {"id": 387, "start": 1292.84, "end": 1295.84, "text": "Ach, habe ich, real redact habe ich das so herum gesagt."}, {"id": 388, "start": 1295.84, "end": 1298.84, "text": "Wie gesagt, ich bin für alles, solange wir einen Feiertag kriegen,"}, {"id": 389, "start": 1298.84, "end": 1300.84, "text": "der Rest ist mir vollkommen egal."}, {"id": 390, "start": 1300.84, "end": 1303.84, "text": "Boah, ai, das ist aber ganz schön."}, {"id": 391, "start": 1304.84, "end": 1305.84, "text": "Oje."}, {"id": 392, "start": 1305.84, "end": 1310.84, "text": "Leute, ich habe hier ziemlich einen Kabelsalat fabriziert gerade, wartet mal."}, {"id": 393, "start": 1312.84, "end": 1314.84, "text": "Huge Kabelsalat."}, {"id": 394, "start": 1314.84, "end": 1316.84, "text": "Zum Glück habe ich hier die zwei Rechner neben mir stehen,"}, {"id": 395, "start": 1316.84, "end": 1319.84, "text": "da habe ich quasi noch so einen halben Extra-Tisch,"}, {"id": 396, "start": 1319.84, "end": 1321.84, "text": "wo Kabel rumliegen können."}, {"id": 397, "start": 1321.84, "end": 1322.84, "text": "So, okay."}, {"id": 398, "start": 1322.84, "end": 1325.84, "text": "Also, Raspberry Pi am Start."}, {"id": 399, "start": 1325.84, "end": 1330.84, "text": "Ah, SD-Karten-Slot pusten, man weiß ja nie."}, {"id": 400, "start": 1330.84, "end": 1332.84, "text": "Könnt ihr euch noch an den Stream erinnern?"}, {"id": 401, "start": 1332.84, "end": 1334.84, "text": "Oh, die SD-Karte ist kaputt."}, {"id": 402, "start": 1334.84, "end": 1340.84, "text": "Oh, Leute, die SD-Karte hat ein Loch."}, {"id": 403, "start": 1344.84, "end": 1347.84, "text": "Oder ein, nein, nicht wirklich ein Loch, so ein..."}, {"id": 404, "start": 1347.84, "end": 1353.84, "text": "So, von den Kontakten unten hat einer ein Loch."}, {"id": 405, "start": 1356.84, "end": 1358.84, "text": "Wie hast du, ich weiß nicht."}, {"id": 406, "start": 1358.84, "end": 1360.84, "text": "Vielleicht war die schon so."}, {"id": 407, "start": 1362.84, "end": 1365.84, "text": "Okay, wir probieren mal trotzdem, ob es funktioniert."}, {"id": 408, "start": 1365.84, "end": 1375.84, "text": "Ja, SD-Karten-Einführungs-ASMA."}, {"id": 409, "start": 1385.84, "end": 1387.84, "text": "Warum passt denn das nicht?"}, {"id": 410, "start": 1387.84, "end": 1389.84, "text": "Ah, falsch rum."}, {"id": 411, "start": 1392.84, "end": 1394.84, "text": "So, okay, SD-Karte ist drin."}, {"id": 412, "start": 1394.84, "end": 1396.84, "text": "Ich stapsel mal kurz den Raspberry Pi an,"}, {"id": 413, "start": 1396.84, "end": 1398.84, "text": "ich muss mal kurz aufstehen, eine Netzwerkkabel holen,"}, {"id": 414, "start": 1398.84, "end": 1424.84, "text": "dann bin ich gleich wieder am Start."}, {"id": 415, "start": 1424.84, "end": 1431.84, "text": "Okay, er läuft. Er läuft."}, {"id": 416, "start": 1431.84, "end": 1435.84, "text": "Er läuft, jetzt muss ich nur noch auf meinen Rauder gucken,"}, {"id": 417, "start": 1435.84, "end": 1438.84, "text": "was das Ding für eine DRCP-IP kriegt."}, {"id": 418, "start": 1440.84, "end": 1442.84, "text": "Rauder."}, {"id": 419, "start": 1449.84, "end": 1451.84, "text": "Wieder, Max hat kein Spare-Netzwerkkabel,"}, {"id": 420, "start": 1451.84, "end": 1453.84, "text": "dauerhaft eine, ja, doch."}, {"id": 421, "start": 1453.84, "end": 1455.84, "text": "Aber das hängt hinter dem Schreibtisch runter,"}, {"id": 422, "start": 1455.84, "end": 1457.84, "text": "deswegen muss ich da immer aufstehen,"}, {"id": 423, "start": 1457.84, "end": 1459.84, "text": "weil das hängt sich jedes Mal um irgendwie."}, {"id": 424, "start": 1460.84, "end": 1465.84, "text": "So, DRCP-Server, DRCP-Lieses, Raspberry."}, {"id": 425, "start": 1467.84, "end": 1470.84, "text": "Na, wo ist er denn?"}, {"id": 426, "start": 1470.84, "end": 1478.84, "text": "Raspberry?"}, {"id": 427, "start": 1501.84, "end": 1508.84, "text": "Äh, der Raspberry meldet sich irgendwie nicht?"}, {"id": 428, "start": 1512.84, "end": 1514.84, "text": "Warum nicht?"}, {"id": 429, "start": 1514.84, "end": 1516.84, "text": "Sag, bloß die SD-Karte ist jetzt kaputt, ey."}, {"id": 430, "start": 1516.84, "end": 1518.84, "text": "Ich krieg Anfälle."}, {"id": 431, "start": 1518.84, "end": 1522.84, "text": "Sag, bloß die SD-Karte ist kaputt."}, {"id": 432, "start": 1525.84, "end": 1527.84, "text": "Es müsste ja eine 2."}, {"id": 433, "start": 1527.84, "end": 1532.84, "text": "Oh, ey, muss das jetzt echt sein?"}, {"id": 434, "start": 1532.84, "end": 1536.84, "text": "Die resize doch immer erst, ja, deswegen warte ich ja noch."}, {"id": 435, "start": 1546.84, "end": 1548.84, "text": "Mit der, was geht jetzt ab?"}, {"id": 436, "start": 1548.84, "end": 1550.84, "text": "Hi, hi, hi."}, {"id": 437, "start": 1550.84, "end": 1554.84, "text": "Amazon-Tablets holen sich DRCP-Adressen,"}, {"id": 438, "start": 1554.84, "end": 1556.84, "text": "ne, aber irgendwie."}, {"id": 439, "start": 1562.84, "end": 1564.84, "text": "Hi."}, {"id": 440, "start": 1568.84, "end": 1572.84, "text": "Ne, das Ding holst du keine IP, was ist denn das für ein Kack?"}, {"id": 441, "start": 1572.84, "end": 1576.84, "text": "Die SD-Karte blinkt auch total wie ein, äh,"}, {"id": 442, "start": 1576.84, "end": 1580.84, "text": "ich glaub, die SD-Karte ist kaputt."}, {"id": 443, "start": 1588.84, "end": 1590.84, "text": "Ah, ne, guck mal da."}, {"id": 444, "start": 1590.84, "end": 1593.84, "text": "Ne, doch, oder?"}, {"id": 445, "start": 1593.84, "end": 1598.84, "text": "Ist das der, ist das der?"}, {"id": 446, "start": 1598.84, "end": 1600.84, "text": "Nee."}, {"id": 447, "start": 1600.84, "end": 1602.84, "text": "Fuck, man, ich glaub, die SD-Karte ist echt im Arsch."}, {"id": 448, "start": 1602.84, "end": 1618.84, "text": "providerein diffe"}, {"id": 449, "start": 1618.84, "end": 1626.8, "text": "ne fuck man ich glaube die sd karte ist echt im arsch na super grandios ok neue sd karte"}, {"id": 450, "start": 1626.8, "end": 1633.08, "text": "also ich gucke jetzt nochmal die die die sache durch dynamic dynamic"}, {"id": 451, "start": 1633.08, "end": 1636.28, "text": "fuck alter"}, {"id": 452, "start": 1636.28, "end": 1644.76, "text": "hier ich habe zwei sachen die sind dynamic das eine ist der desktop der kann es ja nicht sein"}, {"id": 453, "start": 1644.76, "end": 1649.4, "text": "amazon tablet und meine linux vm"}, {"id": 454, "start": 1649.4, "end": 1650.4, "text": "ah"}, {"id": 455, "start": 1650.4, "end": 1659.4, "text": "ok"}, {"id": 456, "start": 1659.4, "end": 1662.76, "text": "je fehler sd karte hast du auf reserve genug ich habe allein schon drei stück noch hier"}, {"id": 457, "start": 1662.76, "end": 1667.64, "text": "auf dem schreibtisch liegen wirklich genug genug ähm ich mach hier nochmal aus und nochmal"}, {"id": 458, "start": 1667.64, "end": 1669.24, "text": "an vielleicht vielleicht bringt das ja was"}, {"id": 459, "start": 1669.24, "end": 1677.8, "text": "ok netzwerk kabel also netzwerk karte kriegt auf jeden fall sync das ist schon mal gut"}, {"id": 460, "start": 1677.8, "end": 1684.28, "text": "ha man"}, {"id": 461, "start": 1684.28, "end": 1688.04, "text": "warum ist die musik jetzt so laut"}, {"id": 462, "start": 1688.04, "end": 1704.04, "text": "monka"}, {"id": 463, "start": 1704.04, "end": 1707.52, "text": "hat die amazon nicht mal aus für die ganze kiste mit sd karten geschickt doch"}, {"id": 464, "start": 1707.52, "end": 1712.32, "text": "ok leute ich glaube die sd karte ist kaputt"}, {"id": 465, "start": 1712.32, "end": 1722.52, "text": "ja dann next next sd karte ich hab hier noch ein paar"}, {"id": 466, "start": 1722.52, "end": 1726.16, "text": "ich hab hier noch ein paar die sieht auch nicht kaputt aus das ist schon mal gut"}, {"id": 467, "start": 1726.16, "end": 1730.24, "text": "die sieht ganz aus im vergleich zu der anderen sd karte"}, {"id": 468, "start": 1730.24, "end": 1750.08, "text": "ne der meldet sich echt nicht der raspberry ist rib der ist im arsch na toll"}, {"id": 469, "start": 1750.08, "end": 1754.76, "text": "der bootet nicht ich habe übrigens immer noch kein mini hdmi bestellt"}, {"id": 470, "start": 1754.76, "end": 1760.28, "text": "ne das heißt wir können uns jetzt auch die ausgabe gar nicht angucken"}, {"id": 471, "start": 1760.28, "end": 1774.48, "text": "ok ok ok dann machen wir eine neue sd karte alles klar wo ist mein sd karten reader hier"}, {"id": 472, "start": 1774.48, "end": 1785.6, "text": "dann machen wir eine neue sd karte wenn die kaputt ist ist natürlich ganz toll"}, {"id": 473, "start": 1785.6, "end": 1793.36, "text": "das ausgerechnet die sd karte ich jetzt erwische kaputt ist connect vm etcher"}, {"id": 474, "start": 1793.36, "end": 1801.24, "text": "noch mal das ganze geht ja schnell jetzt ist es auch eine 32 g sd karte flash"}, {"id": 475, "start": 1801.24, "end": 1814.6, "text": "lassen wir mal eine minute lang flaschen ok ja ich gucke noch mal ich gucke noch"}, {"id": 476, "start": 1814.6, "end": 1821.64, "text": "mal in die dlcp rein ob da irgendwas irgendwas kommt was nach raspberry pi"}, {"id": 477, "start": 1821.64, "end": 1827.52, "text": "aussieht ne das ist meistens relativ einfach zu erkennen wenn sich raspberry"}, {"id": 478, "start": 1827.52, "end": 1836.72, "text": "pi registriert man erstens heißt das ding raspberry pi als dhcp name und es"}, {"id": 479, "start": 1836.72, "end": 1841.04, "text": "ist einer der wenigen dynamischen ip also sprich ich habe hier das meiste kriegt"}, {"id": 480, "start": 1841.04, "end": 1845.04, "text": "er bei mir über dhcp die ip allerdings nicht dynamisch aus dem pool sondern die"}, {"id": 481, "start": 1845.04, "end": 1848.92, "text": "sind fest zugewiesen wie kann man eigentlich das können wir jetzt eigentlich"}, {"id": 482, "start": 1848.92, "end": 1853.8, "text": "doch mal machen wie kann man eigentlich ein pie config static ip machen auf der"}, {"id": 483, "start": 1853.8, "end": 1860.36, "text": "sd karte habe ich noch nie gemacht ich weiß wie man wlan einrichtet und so"}, {"id": 484, "start": 1860.96, "end": 1866.04, "text": "autos set up static ip geht das überhaupt"}, {"id": 485, "start": 1866.4, "end": 1870.64, "text": "wenn man wohlgemerkt wenn man noch nicht drauf kommt wenn man drauf kommt weiß"}, {"id": 486, "start": 1870.64, "end": 1876.4, "text": "ich wie das funktioniert auf der sd karte will ich das mal machen"}, {"id": 487, "start": 1879.32, "end": 1883.68, "text": "jetzt die musik wieder zu leise die können sich echt nicht entscheiden"}, {"id": 488, "start": 1883.68, "end": 1897.12, "text": "okay um sd karte wie geht das setting static ip address from sd karte"}, {"id": 489, "start": 1897.12, "end": 1899.76, "text": "bevor boot"}, {"id": 490, "start": 1902.88, "end": 1906.32, "text": "natürlich muss irgendwie gehen"}, {"id": 491, "start": 1906.32, "end": 1916.16, "text": "ok also der hat echt ein problem mit der mit seinen soundlautstärke in diesem"}, {"id": 492, "start": 1916.16, "end": 1919.32, "text": "musikding die hätte man ein bisschen anpassen sollen dass sie alle gleich"}, {"id": 493, "start": 1919.32, "end": 1921.84, "text": "laut sind"}, {"id": 494, "start": 1921.84, "end": 1949.32, "text": "ah ok excellent was auch immer wir haben eine neue passt zack ok sd karte ist"}, {"id": 495, "start": 1949.32, "end": 1957.16, "text": "geflasht wir mounten die sd karte def sd sd b1 ist wahrscheinlich auch machen"}, {"id": 496, "start": 1957.16, "end": 1963.92, "text": "einmal touch ssh an mounten das ganze sünden den spaß und stöpseln es noch"}, {"id": 497, "start": 1963.92, "end": 1969.36, "text": "mal in den raspberry pi rein und hoffen dass es jetzt funktioniert man sieht"}, {"id": 498, "start": 1969.36, "end": 1972.92, "text": "das immer ganz gut aus vom raspberry pi funktioniert wenn er beim starten"}, {"id": 499, "start": 1972.92, "end": 1985.8, "text": "anfängt wird mit der sd karte zu blinken dann klappt es meistens"}, {"id": 500, "start": 1985.8, "end": 1991.12, "text": "ok und angeschaltet zack"}, {"id": 501, "start": 1996.4, "end": 2000.24, "text": "ok der blinkt schon mal der blinkt schon mal das schon mal gut"}, {"id": 502, "start": 2000.24, "end": 2006.6, "text": "der blinkt schon mal wild ja das sieht besser aus"}, {"id": 503, "start": 2020.48, "end": 2024.8, "text": "das sieht besser aus der blinkt wie verrückt der resize jetzt erstmal die"}, {"id": 504, "start": 2024.8, "end": 2028.88, "text": "karte und danach sollte er buten sich eine dhcp adresse holen da ist er da ist"}, {"id": 505, "start": 2028.88, "end": 2035.08, "text": "er die sd karte war echt kaputt hatte ich auch selten dass die sd karte"}, {"id": 506, "start": 2035.08, "end": 2046.68, "text": "komplett im arsch ist so da sind wir ssh pie et es raspberry da sind wir ok"}, {"id": 507, "start": 2046.68, "end": 2052.8, "text": "sie domino sie ok"}, {"id": 508, "start": 2052.8, "end": 2059.8, "text": "also was müssen wir jetzt machen wo sind verstehen geblieben die anleitung"}, {"id": 509, "start": 2059.8, "end": 2065.84, "text": "brauchen wir könnte man monka es ausblenden die anleitung brauche also"}, {"id": 510, "start": 2065.84, "end": 2070.16, "text": "börn haben wir gemacht wir haben der sd karte raspberry update ok das heißt"}, {"id": 511, "start": 2070.16, "end": 2074.76, "text": "vorher machen wir erst mal ab update erst mal neueste sachen abrufen man weiß"}, {"id": 512, "start": 2074.76, "end": 2080.28, "text": "ja nie wir rufen mal die neuesten sachen ab wir machen auch mal einen update ich"}, {"id": 513, "start": 2080.28, "end": 2084.68, "text": "meine es ist jetzt ziemlich bescheuert ein update zu machen aber ich will mal"}, {"id": 514, "start": 2084.68, "end": 2089.0, "text": "sicherstellen dass die dass die befehle und das ganze was wir verwenden auch"}, {"id": 515, "start": 2089.0, "end": 2092.96, "text": "wirklich am aktuellsten stand ist wir werden ja eh später das betriebssystem"}, {"id": 516, "start": 2092.96, "end": 2100.48, "text": "von der sd karte nicht verwenden aber mal gucken siehst du eigentlich monka es"}, {"id": 517, "start": 2100.48, "end": 2112.36, "text": "und die anderen emotes auf deinem schirm ja ja ja guck hier ich habe hier mein"}, {"id": 518, "start": 2112.36, "end": 2116.6, "text": "dashboard und wenn ich mal hier hier ist er jetzt kann sogar durchklicken"}, {"id": 519, "start": 2116.6, "end": 2119.84, "text": "guck hier ich sehe die deswegen habe ich den kram ja auch"}, {"id": 520, "start": 2119.84, "end": 2124.24, "text": "programmiert deswegen habe ich das ist eine der sachen der gründe warum ich"}, {"id": 521, "start": 2124.24, "end": 2130.08, "text": "den kram programmiert habe dass ich die emotes selber sehe also sprich ich sehe"}, {"id": 522, "start": 2130.08, "end": 2133.24, "text": "die maus selbst und ich kann die ja auch hier rum muven und so was mit der maus"}, {"id": 523, "start": 2133.24, "end": 2138.52, "text": "ist ja also das war einer der gründe warum ich den kram programmiert haben"}, {"id": 524, "start": 2138.52, "end": 2143.0, "text": "was hast du mit dem paye geplant mit dem jetzt speziell gar nichts mit dem"}, {"id": 525, "start": 2143.0, "end": 2149.76, "text": "probiere ich jetzt einfach nur aus ob auf dem paye usb bude funktioniert die"}, {"id": 526, "start": 2149.76, "end": 2153.24, "text": "anderen sind ja schon im einsatz das gibt auch keinen grund die durch also die"}, {"id": 527, "start": 2153.24, "end": 2156.08, "text": "die ich habe gibt es keinen grund die durch den raspberry pie 4 aktuell zu"}, {"id": 528, "start": 2156.08, "end": 2158.4, "text": "ersetzen"}, {"id": 529, "start": 2158.4, "end": 2164.16, "text": "der der grund warum ich das so programmiert habe ist ja auch dass ich"}, {"id": 530, "start": 2164.16, "end": 2167.52, "text": "die maus selber sehe und halt nicht vergesse sie wieder auszublenden so was"}, {"id": 531, "start": 2167.52, "end": 2171.56, "text": "wirst du das mit tun auf win ui 3 programmieren hatte ich tatsächlich"}, {"id": 532, "start": 2171.56, "end": 2175.92, "text": "vor bis gestern und gestern habe ich festgestellt die haben immer noch obwohl"}, {"id": 533, "start": 2175.92, "end": 2181.12, "text": "es eine normale 32 anwendung ist uwp krab als abhängigkeit mit drinne da"}, {"id": 534, "start": 2181.12, "end": 2192.04, "text": "werde ich das nicht machen wir sind eine paus im einsatz wir haben ich hab doch"}, {"id": 535, "start": 2192.04, "end": 2195.92, "text": "hier irgendwo ein textdokument wo das alles drin steht wo wir was haben also"}, {"id": 536, "start": 2195.92, "end": 2201.16, "text": "ich habe eine kamera fürs hoftor weil die frage kommt öfters deswegen da bin"}, {"id": 537, "start": 2201.16, "end": 2204.4, "text": "ich schon habe ich schon was vorbereitet ich bin mir nur nicht sicher ob da alles"}, {"id": 538, "start": 2204.4, "end": 2208.16, "text": "drin steht also ich habe eine kamera fürs hoftor das sind paus 0 die"}, {"id": 539, "start": 2208.16, "end": 2213.36, "text": "heizungsstatistik die kennt er wahrscheinlich noch"}, {"id": 540, "start": 2215.92, "end": 2223.8, "text": "wie ist das noch mal hier grafana genau das ist die heizungsstatistik die wird"}, {"id": 541, "start": 2223.8, "end": 2227.16, "text": "auch mit raspberry pie 0 ausgelesen da kann ich dann so sachen sehen wie"}, {"id": 542, "start": 2227.16, "end": 2232.28, "text": "wassertemperatur in der heizung kesseltemperatur von der heizung ob das"}, {"id": 543, "start": 2232.28, "end": 2235.88, "text": "ding ein fehlercode hat ob der brenner gerade an ist man sieht es ist relativ"}, {"id": 544, "start": 2235.88, "end": 2240.16, "text": "warm und dementsprechend muss der brenner halt kaum angehen man sieht die"}, {"id": 545, "start": 2240.16, "end": 2245.2, "text": "abgastemperatur und ob die pumpe gerade pumpt also sprich wenn das einer keine"}, {"id": 546, "start": 2245.2, "end": 2247.96, "text": "ahnung wenn die spülmaschine angeht oder so dann sieht man es hier man kann auch"}, {"id": 547, "start": 2247.96, "end": 2250.44, "text": "rein zoomen und sich das ganze noch ein bisschen genauer angucken wenn man da"}, {"id": 548, "start": 2250.44, "end": 2256.28, "text": "scharf drauf ist ja das ist der eine raspberry pie im keller der sammelt die"}, {"id": 549, "start": 2256.28, "end": 2260.44, "text": "infos von der heizung der hat noch ein temperatur und luftfeuchtigkeit sensor"}, {"id": 550, "start": 2260.44, "end": 2263.68, "text": "dran das könnte ich eigentlich auch mal hier rein machen fällt mir gerade ein"}, {"id": 551, "start": 2263.68, "end": 2267.44, "text": "der misst auch noch die luftfeuchtigkeit im keller weil die ist immer viel zu"}, {"id": 552, "start": 2267.44, "end": 2272.28, "text": "hoch was für eine heizung hast du denn ich habe eine veto wiesmann veto denn"}, {"id": 553, "start": 2272.28, "end": 2275.8, "text": "22f oder so"}, {"id": 554, "start": 2277.36, "end": 2280.68, "text": "ich weiß nicht genau ich glaube"}, {"id": 555, "start": 2281.84, "end": 2288.36, "text": "wie to dennst 22f ja so eine hier"}, {"id": 556, "start": 2288.36, "end": 2294.56, "text": "so und das ist ein bisschen trickreich die infos aus dem raspberry pie"}, {"id": 557, "start": 2294.56, "end": 2298.44, "text": "rauszukriegen und ich habe dann wir haben dann im haben sogar im stream"}, {"id": 558, "start": 2298.44, "end": 2303.24, "text": "gemacht glaube ein prometo als exporter programmiert der quasi die heizung"}, {"id": 559, "start": 2303.24, "end": 2307.76, "text": "statistik exportiert und grafana ruft das ganze dann ab so dann habe ich den"}, {"id": 560, "start": 2307.76, "end": 2314.8, "text": "pie 3 als octopie für den 3d drucker oh mir fällt gerade ein der mesh wollte"}, {"id": 561, "start": 2314.8, "end": 2317.84, "text": "noch irgendwas 3d gedrucktes haben ob ich hat mich gefragt ob ich ihm das"}, {"id": 562, "start": 2317.84, "end": 2320.84, "text": "nicht drucken kann ganz ganz verdrängt muss ich muss ich mal"}, {"id": 563, "start": 2320.84, "end": 2326.36, "text": "anschmeißen später dann habe ich noch ein odroid hc2 laufen das ist zwar kein"}, {"id": 564, "start": 2326.36, "end": 2332.56, "text": "raspberry aber sowas ähnliches der macht fernsehaufnahme und"}, {"id": 565, "start": 2332.96, "end": 2337.16, "text": "serienaufnahme mit tv head und darüber guckt man auch fernseh der hat eine"}, {"id": 566, "start": 2337.16, "end": 2341.0, "text": "2 terabyte platte dran das reicht das mal für aufnahmen dann gibt es auch ein pie 3"}, {"id": 567, "start": 2341.0, "end": 2349.56, "text": "als unify controller und als frontend für die webcams das haben wir auch"}, {"id": 568, "start": 2349.56, "end": 2352.4, "text": "zusammen im stream ein bisschen programmiert die webcam frontend"}, {"id": 569, "start": 2352.4, "end": 2359.4, "text": "geschichte so und dann habe ich noch was sind es aber keine raspberries das sind"}, {"id": 570, "start": 2359.4, "end": 2364.56, "text": "die esp 32 dies hier am start hab wie gesagt einmal als einmal am stromzähler"}, {"id": 571, "start": 2364.56, "end": 2368.96, "text": "unten im keller also sprich einmal für für stromverbrauch"}, {"id": 572, "start": 2368.96, "end": 2371.88, "text": "insgesamt und stromverbrauch für den ersten stock da wo auch mein arbeitszimmer"}, {"id": 573, "start": 2371.88, "end": 2377.84, "text": "und alles ist dann habe ich ein draußen an der tür hängen für die boden"}, {"id": 574, "start": 2377.84, "end": 2383.48, "text": "feuchtigkeitssensoren auf dem balkon in den in den flan in den blumen töpfen"}, {"id": 575, "start": 2383.48, "end": 2389.36, "text": "dann habe ich am hoftor einen für schalter der guckt ob das hoftor auf und"}, {"id": 576, "start": 2389.36, "end": 2392.76, "text": "zu geht briefkasten kommt noch einer der funktioniert noch nicht der guckt ob im"}, {"id": 577, "start": 2392.76, "end": 2396.24, "text": "briefkasten was drin ist und wann zuletzt was eingeworfen wurde und in"}, {"id": 578, "start": 2396.24, "end": 2402.04, "text": "bodenfeuchtigkeitssensor der über laura die datenschickt zum auswerten war nicht"}, {"id": 579, "start": 2402.04, "end": 2407.12, "text": "wieder gießen muss exzellent das ist alles was ich da im einsatz"}, {"id": 580, "start": 2407.12, "end": 2416.84, "text": "habe so hat er jetzt eigentlich geupdatet alles ja fertig sehr schön wir"}, {"id": 581, "start": 2416.84, "end": 2421.76, "text": "rebooten mal sicher ist sicher man weiß ja nie"}, {"id": 582, "start": 2421.76, "end": 2426.36, "text": "das mit dem boden sensor will ich auch mal machen für spät schreibt captain"}, {"id": 583, "start": 2426.36, "end": 2430.12, "text": "peng also ich kann dir folgendes empfehlen ich würde keine boden"}, {"id": 584, "start": 2430.12, "end": 2434.12, "text": "feuchtigkeitssensor selbst machen mit einem esp 32 das lohnt sich gar nicht"}, {"id": 585, "start": 2434.12, "end": 2441.12, "text": "weil wenn du auf auf bengut gehst also die seite mit dem best besten namen was"}, {"id": 586, "start": 2441.12, "end": 2446.92, "text": "damit überhaupt nichts zu tun hat beide wei und man nach nie flora sucht und wenn"}, {"id": 587, "start": 2446.92, "end": 2454.36, "text": "du glück hast findest du ganz gute angebote für diese low energy bluetooth"}, {"id": 588, "start": 2454.36, "end": 2458.74, "text": "bodenfeuchtigkeitssensoren die sind ganz gut die halten über einen jahr mit einer"}, {"id": 589, "start": 2458.74, "end": 2463.92, "text": "batterie oder fast zwei jahre mit einer batterie und die sind schöner und"}, {"id": 590, "start": 2463.92, "end": 2467.36, "text": "billiger als du dir das selbst bauen kannst musst du meinen deal abwarten ich"}, {"id": 591, "start": 2467.36, "end": 2470.44, "text": "glaube ich habe die damals für elf dollar das stück gekriegt habe ich"}, {"id": 592, "start": 2470.44, "end": 2476.9, "text": "gleich mal zehn stücke kauft und dafür ist halt der eine der eine esp 32 der"}, {"id": 593, "start": 2476.9, "end": 2481.12, "text": "per bluetooth guckt und die daten von den dingern ausliest ist einfacher als"}, {"id": 594, "start": 2481.12, "end": 2489.52, "text": "selbst zu machen so ok ist der palme da da raspberri"}, {"id": 595, "start": 2489.52, "end": 2501.32, "text": "hallo ich habe mich vertappt ist very excellent ok ssh copy id macht man"}, {"id": 596, "start": 2501.32, "end": 2503.98, "text": "immer ganz am anfang weil dann muss man kein passwort eingeben"}, {"id": 597, "start": 2503.98, "end": 2510.4, "text": "sudo und jetzt machen wir das was in der anleitung drin steht nämlich ein update"}, {"id": 598, "start": 2510.4, "end": 2513.2, "text": "beim"}, {"id": 599, "start": 2514.68, "end": 2518.48, "text": "jetzt sollte die betafirme updaten"}, {"id": 600, "start": 2518.48, "end": 2537.72, "text": "um wo ist du leicht zu präsent yes so während der update das dauert jetzt zwei"}, {"id": 601, "start": 2537.72, "end": 2542.6, "text": "drei minuten gucken wir mal was es für fragen gegeben hat das neue wtf"}, {"id": 602, "start": 2542.6, "end": 2550.96, "text": "verhindert probleme wo da fack war da fack ich habe es ich habe es nicht"}, {"id": 603, "start": 2550.96, "end": 2557.52, "text": "verstanden big brain joke wie gesagt mit dem paar habe ich jetzt außer zum"}, {"id": 604, "start": 2557.52, "end": 2562.28, "text": "ausprobieren gar nichts geplant ja das hatten wir schon sehe ich auch"}, {"id": 605, "start": 2562.28, "end": 2569.92, "text": "alles ja amazon amazon hatte mir mal eine kiste sd karten aus versehen"}, {"id": 606, "start": 2569.92, "end": 2573.84, "text": "geschickt also ich habe ich habe irgendwie drei stück bestellt und ich"}, {"id": 607, "start": 2573.84, "end": 2576.88, "text": "habe auch drei stück bekommen bloß dass irgendwie noch eine kiste dabei war mit"}, {"id": 608, "start": 2576.88, "end": 2581.76, "text": "20 sd karten drin ich weiß nicht ob das mit mir gut gemeint hat der amazon"}, {"id": 609, "start": 2581.76, "end": 2586.88, "text": "lagermann oder ob die sich einfach vertan haben"}, {"id": 610, "start": 2586.88, "end": 2593.16, "text": "ich habe einfach nix gesagt weil ich denke mir ich bestell so viel bei amazon"}, {"id": 611, "start": 2593.16, "end": 2598.36, "text": "die haben so viel schon an mir verdient da werden sie das verkraften wahrscheinlich"}, {"id": 612, "start": 2598.36, "end": 2601.64, "text": "verursacht das auch wenn ich mich da melde mehr probleme die zurück zu"}, {"id": 613, "start": 2601.64, "end": 2605.96, "text": "schicken als sonst was"}, {"id": 614, "start": 2609.4, "end": 2620.8, "text": "was das für ein erstes e3 wm e3 wm mit hier knobb knobb terminale ist fertig"}, {"id": 615, "start": 2620.8, "end": 2624.52, "text": "reboot ist needed aber schnell die fragen noch fertig"}, {"id": 616, "start": 2624.52, "end": 2630.92, "text": "plops russia vier monate exquisite high IQ subscription gucken dass ich nix"}, {"id": 617, "start": 2630.92, "end": 2633.96, "text": "vergessen habe an subs"}, {"id": 618, "start": 2640.08, "end": 2642.92, "text": "der no skiller dankeschön falls sie noch nicht gesehen habe"}, {"id": 619, "start": 2642.92, "end": 2658.52, "text": "poggers so das ist e3 status rast nennt sich das ganze"}, {"id": 620, "start": 2661.32, "end": 2665.56, "text": "ok reboot reboot machen wir reboot müssen wir auch machen"}, {"id": 621, "start": 2665.56, "end": 2671.8, "text": "börn respire update ok so haben wir alles gemacht und jetzt ist es halt total"}, {"id": 622, "start": 2671.8, "end": 2676.92, "text": "vage beschrieben select beta bootloader"}, {"id": 623, "start": 2677.72, "end": 2680.92, "text": "und wie"}, {"id": 624, "start": 2683.8, "end": 2691.0, "text": "und wie selekte ich den beta bootloader so eine geile anleitung total obvius"}, {"id": 625, "start": 2691.0, "end": 2698.08, "text": "alles aber die wichtigste stelle wie das eigentliche geht steht nicht dabei ok"}, {"id": 626, "start": 2698.08, "end": 2702.52, "text": "das steht aber mit sicherheit irgendwo hier im forum drinnen da müssen wir"}, {"id": 627, "start": 2702.52, "end": 2708.24, "text": "einfach mal aha ok ok ok"}, {"id": 628, "start": 2712.16, "end": 2721.0, "text": "etc default api eeprom update from critical to beta"}, {"id": 629, "start": 2721.0, "end": 2729.64, "text": "what ok erst mal gucken ob dieses programm da überhaupt drauf ist das sind"}, {"id": 630, "start": 2729.64, "end": 2732.64, "text": "typische anleitung von programmieren ja das sind typische anleitung von leuten"}, {"id": 631, "start": 2732.64, "end": 2735.76, "text": "die selbst schon 20 mal gemacht haben und eigentlich keine ahnung haben was man"}, {"id": 632, "start": 2735.76, "end": 2739.96, "text": "da nicht verstehen kann ok"}, {"id": 633, "start": 2740.24, "end": 2745.64, "text": "ach guck mal hier jetzt zeigt er was an so also was was soll man jetzt machen"}, {"id": 634, "start": 2745.64, "end": 2750.44, "text": "ich bin ich bin was etc default respire pro update vom critical"}, {"id": 635, "start": 2750.44, "end": 2762.36, "text": "to beta hallo excellent richt pepega copy paste er"}, {"id": 636, "start": 2762.36, "end": 2767.8, "text": "kein wimp drauf erste mal erste mal das allerwichtigste installieren und"}, {"id": 637, "start": 2767.8, "end": 2771.56, "text": "t-max man weiß ja nie was man so braucht"}, {"id": 638, "start": 2771.56, "end": 2783.48, "text": "die musik ist übel stressig gerade ich meine so so wahnsinnig world first boss"}, {"id": 639, "start": 2783.48, "end": 2792.32, "text": "clear ist das jetzt hier auch gar nicht richtig ok hat es installiert also da"}, {"id": 640, "start": 2792.32, "end": 2798.44, "text": "steht critical bringt jetzt mal wim heck leute wim heck was meint ihr ist der"}, {"id": 641, "start": 2798.44, "end": 2804.48, "text": "schnellste weg im wim dieses dieses critical warum habe ich überhaupt maus"}, {"id": 642, "start": 2804.48, "end": 2812.36, "text": "mode an wie geht was meint ihr ist der schnellste weg dieses critical hier zu"}, {"id": 643, "start": 2812.36, "end": 2821.84, "text": "ersetzen durch beta was fällt was fallen euch dafür krasse wim hacks ein also ich"}, {"id": 644, "start": 2821.84, "end": 2836.56, "text": "bin der meinung das hier ist der schnellste mit einem seht könnte man"}, {"id": 645, "start": 2836.56, "end": 2843.8, "text": "das auch machen ja also die schnellste variante meiner meinung nach ist wenn man"}, {"id": 646, "start": 2843.8, "end": 2848.68, "text": "die datei aufmacht dann ist man hier ganz vorne an der zeile also die die noob"}, {"id": 647, "start": 2848.68, "end": 2857.32, "text": "die noob variante ist das hier die geht aber das ist nicht schön was man machen"}, {"id": 648, "start": 2857.32, "end": 2864.6, "text": "kann ist öffnen so öffnen und dann sagt man change inner anführungszeichen"}, {"id": 649, "start": 2864.6, "end": 2867.96, "text": "dann geht da nämlich direkt zum nächsten zur nächsten stelle wo"}, {"id": 650, "start": 2867.96, "end": 2875.12, "text": "anführungszeichen findet löscht von anführungszeichen zu anführungszeichen"}, {"id": 651, "start": 2875.12, "end": 2879.56, "text": "und geht direkt in insert mode da kann man beta reinschreiben und drückt escape"}, {"id": 652, "start": 2879.56, "end": 2887.6, "text": "und speichern und gut ist also ci muss man eingeben ci anführungszeichen"}, {"id": 653, "start": 2887.6, "end": 2891.8, "text": "ok und wie geht es jetzt weiter"}, {"id": 654, "start": 2891.8, "end": 2910.6, "text": "ah guck mal da hat es glaube ich schon gemacht kann das sein ok was soll man"}, {"id": 655, "start": 2910.6, "end": 2914.72, "text": "jetzt machen select use select beta bootload das haben wir gerade gemacht"}, {"id": 656, "start": 2914.72, "end": 2923.2, "text": "dass bei palmer to update it ok"}, {"id": 657, "start": 2923.2, "end": 2931.2, "text": "hä"}, {"id": 658, "start": 2937.2, "end": 2944.2, "text": "was ist für eine anleitung"}, {"id": 659, "start": 2944.2, "end": 2960.6, "text": "new configuration settings are required was eine krepp anleitung was ist das ziel"}, {"id": 660, "start": 2960.6, "end": 2969.64, "text": "das ziel ist dass der raspberry pi von usb booted in dem fall von der ssd ohne"}, {"id": 661, "start": 2969.64, "end": 2973.6, "text": "dass man eine sd karte drin haben muss sondern wir gucken uns jetzt die musik"}, {"id": 662, "start": 2973.6, "end": 2979.32, "text": "die geht da voll ab wir gucken uns jetzt doch mal das video dazu an das geht ja"}, {"id": 663, "start": 2979.32, "end": 2983.48, "text": "nur drei minuten wir gucken uns mal an der macht echt gute videos und er hat"}, {"id": 664, "start": 2983.48, "end": 2986.56, "text": "das passende bild dazu"}, {"id": 665, "start": 2986.56, "end": 3001.44, "text": "wie das funktioniert und genau die gleiche sd karte"}, {"id": 666, "start": 3001.44, "end": 3025.28, "text": "das ist ein das ist natürlich ist ein schweizer off also es sagt sogar noch am"}, {"id": 667, "start": 3025.28, "end": 3038.52, "text": "anfang schweizer akzent"}, {"id": 668, "start": 3038.52, "end": 3043.52, "text": "ok das muss ich noch machen das muss ich mir aufschreiben also was ich jetzt noch"}, {"id": 669, "start": 3043.52, "end": 3051.16, "text": "machen muss ist notepad weil weil windows also ich muss noch mal also dd dd auf"}, {"id": 670, "start": 3051.16, "end": 3055.56, "text": "ssd muss ich noch machen also das image muss noch mal auf die sd karte drauf"}, {"id": 671, "start": 3055.56, "end": 3065.84, "text": "da sind wir gerade haben wir gemacht haben wir gemacht haben wir auch gemacht"}, {"id": 672, "start": 3065.84, "end": 3090.8, "text": "haben wir auch gemacht oder ist auch ist auch schon drauf ok doch ist drauf ist"}, {"id": 673, "start": 3090.8, "end": 3101.52, "text": "drauf ok haben wir das das das das das haben wir auch schon gemacht"}, {"id": 674, "start": 3101.52, "end": 3115.6, "text": "nano ok jetzt jetzt jetzt wird spannend das ist das was ich nicht checken was ich"}, {"id": 675, "start": 3115.6, "end": 3121.12, "text": "machen muss was"}, {"id": 676, "start": 3124.64, "end": 3130.36, "text": "afterwards reboot what the fuck woher soll man wissen was das richtige ist"}, {"id": 677, "start": 3130.36, "end": 3134.96, "text": "wo wie soll man auf diesen befehl kommen wenn er nirgends wo steht ist ja leute"}, {"id": 678, "start": 3134.96, "end": 3141.32, "text": "chat ist doch logisch so voll klar ok also dann machen wir das mal minus d was"}, {"id": 679, "start": 3141.32, "end": 3154.2, "text": "lip lip obs firmware was war das lip firmware raspberry pi bootloader beta"}, {"id": 680, "start": 3154.2, "end": 3168.36, "text": "und dann piep piep rom 20 15 und wir haben auch 20 ane 20 15 bin aha ok"}, {"id": 681, "start": 3168.36, "end": 3173.6, "text": "aha hat er gemacht und jetzt reboot na if you want to check the bootloader"}, {"id": 682, "start": 3173.6, "end": 3180.6, "text": "version you can do this with this command machen wir mal machen wir mal vc gen cmd"}, {"id": 683, "start": 3180.6, "end": 3185.68, "text": "und an was bootloader version"}, {"id": 684, "start": 3185.68, "end": 3195.92, "text": "wartet mal kurz ein bisschen gedudel anmachen bootloader version yes it is"}, {"id": 685, "start": 3195.92, "end": 3198.92, "text": "may 15"}, {"id": 686, "start": 3200.36, "end": 3204.84, "text": "ane ich habe noch nicht rebooted na reboot erst mal die bunde erst mal die"}, {"id": 687, "start": 3204.84, "end": 3211.0, "text": "bunde das sind völlig normale befehle die man täglich benutzt nach der easy"}, {"id": 688, "start": 3211.0, "end": 3216.48, "text": "killer ein bisschen kryptisch muss es ja sein"}, {"id": 689, "start": 3216.48, "end": 3244.36, "text": "die es kommt die passende link to the past musik der boot nicht mehr"}, {"id": 690, "start": 3244.36, "end": 3256.8, "text": "ah monka hoh ich habe ich gedacht er wurde nicht mehr"}, {"id": 691, "start": 3264.8, "end": 3270.64, "text": "dass man sich 2020 fragen muss ob usb wird überhaupt support ich frage mich"}, {"id": 692, "start": 3270.64, "end": 3278.36, "text": "auf was mit den losses beim raspberry 3 funktioniert es ohne probleme ok vc gen"}, {"id": 693, "start": 3278.36, "end": 3288.2, "text": "bootloader version ah ok version and with this command bootloader config"}, {"id": 694, "start": 3288.2, "end": 3296.4, "text": "bootloader config ok was auch immer ich da hier bootorder ist glaube ich"}, {"id": 695, "start": 3296.4, "end": 3303.16, "text": "wichtig das habe ich in der anleitung auch noch gesehen bootorder 0xf was"}, {"id": 696, "start": 3303.16, "end": 3306.16, "text": "heißt was ist denn das in dezimal auch guck mal das kann er knopterminal"}, {"id": 697, "start": 3306.16, "end": 3310.56, "text": "mittlerweile 3,0 was"}, {"id": 698, "start": 3314.68, "end": 3320.92, "text": "an die 3905 ist das ok excellent wollte ich schon immer mal wissen"}, {"id": 699, "start": 3320.92, "end": 3329.48, "text": "es war eine bootloader bootloader order 3905 ist"}, {"id": 700, "start": 3329.48, "end": 3338.04, "text": "check if bootorder equals 0xf41 ja ist es ist for putting from usb and one is"}, {"id": 701, "start": 3338.04, "end": 3347.04, "text": "booting from the sd card ok moment was booting from the sd card moment was das"}, {"id": 702, "start": 3347.04, "end": 3353.96, "text": "habe ich nicht kapiert check if bootorder equals 0xf41 for is for"}, {"id": 703, "start": 3353.96, "end": 3361.44, "text": "putting from usb das heißt er probiert zuerst usb und dann sd karte deswegen"}, {"id": 704, "start": 3361.44, "end": 3366.88, "text": "hat das eben auch länger gedauert one is putting from 11 core sagte erklärt"}, {"id": 705, "start": 3366.88, "end": 3370.6, "text": "das aber übelst nice ohne mist das ist einer der besten channels auf youtube"}, {"id": 706, "start": 3370.6, "end": 3374.48, "text": "den es gibt zu diesem thema wer sich für microcontroller zeug"}, {"id": 707, "start": 3374.48, "end": 3380.64, "text": "interessiert oder auch für raspberry pi geschichten aber sich die videos von"}, {"id": 708, "start": 3380.64, "end": 3383.6, "text": "ihm anguckt kann ich wirklich nur empfehlen den zu abonnieren der ist"}, {"id": 709, "start": 3383.6, "end": 3387.08, "text": "wirklich gut und er erklärt die sachen auch immer sehr auf den punkt gebracht"}, {"id": 710, "start": 3387.08, "end": 3391.88, "text": "und genau ohne großartig rumzuschwätzen richtig gut gucke ich gucke ich schon"}, {"id": 711, "start": 3391.88, "end": 3398.08, "text": "lang das den kann man wirklich empfehlen um die sd card also er bootet zuerst per"}, {"id": 712, "start": 3398.08, "end": 3406.8, "text": "usb und dann von der sd karte was natürlich auch richtig gut passt weil"}, {"id": 713, "start": 3406.8, "end": 3411.08, "text": "er soll zuerst von usb und wenn usb nicht geht soll er sd karte buten das"}, {"id": 714, "start": 3411.08, "end": 3413.72, "text": "heißt deswegen hat es eben auch so lange gedauert bis er gebootet hat"}, {"id": 715, "start": 3413.72, "end": 3419.4, "text": "now we are done with the raspberry and can go on with the new ssd das müssen"}, {"id": 716, "start": 3419.4, "end": 3426.72, "text": "wir noch machen auf to copy all dot 11 dot date files from our sd card into the"}, {"id": 717, "start": 3426.72, "end": 3433.44, "text": "boot directory of our new ssd ok ja gut das krieg ich gebacken das krieg ich"}, {"id": 718, "start": 3433.44, "end": 3439.24, "text": "gebacken gut das heißt ich muss jetzt erst einmal meine sd karte erst einmal"}, {"id": 719, "start": 3439.24, "end": 3448.44, "text": "meine sd karte wo meine meine meine ssd wo habe ich meine ssd ssd monka ssd"}, {"id": 720, "start": 3448.44, "end": 3459.76, "text": "hier ssd und mein usb 3 ssd sata adapter"}, {"id": 721, "start": 3467.16, "end": 3473.96, "text": "so usb sata adapter geht ran falsch rum weil man so die immer falsch rum dran"}, {"id": 722, "start": 3473.96, "end": 3491.72, "text": "macht heute mal keine facecam ja kein leak heute ok sd karte zack connect"}, {"id": 723, "start": 3491.72, "end": 3509.12, "text": "ja ja ist ja gut so sd karte ist auf sdb ja gut passt ja ls blk"}, {"id": 724, "start": 3509.12, "end": 3525.96, "text": "sdb xfs ist da drauf ok wie groß ist die sd karte 240 240 g ok die musik"}, {"id": 725, "start": 3525.96, "end": 3540.8, "text": "stübel ist nice ich glaube das ist mario kart oder ist das mario kart ach ne mario odyssey"}, {"id": 726, "start": 3540.8, "end": 3563.92, "text": "so was muss ich damit jetzt machen kann man mit ätcher einfach auch sd ssd"}, {"id": 727, "start": 3563.92, "end": 3576.64, "text": "action geht das habe ich noch nie probiert anscheinend anscheinend ok"}, {"id": 728, "start": 3578.16, "end": 3588.24, "text": "das ist eine ssd nicht ja sd ssd das ist eine ssd das ist eine sandisk ssd plus"}, {"id": 729, "start": 3588.24, "end": 3595.84, "text": "irgendwas das ist nicht die sd karte das ist die ssd ok dann flaschen wir das mal"}, {"id": 730, "start": 3595.84, "end": 3604.32, "text": "da drauf flash yes das geht aber schön schnell"}, {"id": 731, "start": 3604.32, "end": 3622.4, "text": "so schnell müsste man eine micro sd karte flaschen ok das heißt wir haben"}, {"id": 732, "start": 3622.4, "end": 3626.16, "text": "jetzt eine sd karte die stöpseln wir an den raspberry pi dran und kopieren jetzt"}, {"id": 733, "start": 3626.16, "end": 3641.12, "text": "gleich dinger rüber gut machen wir das ist schon fertig geht das schnell fdisk zwei"}, {"id": 734, "start": 3641.12, "end": 3650.64, "text": "partitionen drauf raspberry pi gedöns ok zynk dann gehen wir auf die raspberry pi"}, {"id": 735, "start": 3650.64, "end": 3658.72, "text": "und stöpseln die sd karte jetzt an den raspberry pi dran an usb 3 natürlich"}, {"id": 736, "start": 3658.72, "end": 3666.24, "text": "sonst wäre das ganze ein bisschen blöd gucken wir mal ob er es erkannt hat sda ja"}, {"id": 737, "start": 3666.24, "end": 3675.92, "text": "das ist kukier fdisk def sda da ist die ssd 250 g immer noch kein neuen pc"}, {"id": 738, "start": 3675.92, "end": 3682.08, "text": "gekauft nee ja ersetzt wenn ich jetzt gerade sd karte sache man durch ssd ich"}, {"id": 739, "start": 3682.08, "end": 3699.32, "text": "kann nicht reden ok das das kriegen wir gebacken mal gucken ob das überhaupt da"}, {"id": 740, "start": 3699.32, "end": 3708.64, "text": "ist ja def sda 1 mount nach mnt alles klar und was soll ich jetzt kopieren"}, {"id": 741, "start": 3708.64, "end": 3723.92, "text": "ja vom boot vom boot zudings ok also alles vom boot nicht alles vom boot elf ist"}, {"id": 742, "start": 3723.92, "end": 3733.52, "text": "das nicht ist elf nicht irgendwelches efi gedöns captain seeker ja die sind top"}, {"id": 743, "start": 3733.52, "end": 3742.0, "text": "beste mit den besten videos es gibt ok also boot sternche sternche punkt dat"}, {"id": 744, "start": 3742.0, "end": 3750.88, "text": "wollen wir mal kopieren und slash boot sternche punkt was elf ok und das alles"}, {"id": 745, "start": 3750.88, "end": 3765.88, "text": "nach mnt machen wir so haben wir es haben wir es jetzt ja ok passt ist alles da und"}, {"id": 746, "start": 3765.88, "end": 3771.92, "text": "dat dat falls auch dat falls elf falls denn da und jetzt von die sd karte zu"}, {"id": 747, "start": 3771.92, "end": 3782.36, "text": "die ssd haben wir gemacht shut down remove die st oh jetzt wirds ernst leute jetzt wirds ernst ob"}, {"id": 748, "start": 3782.36, "end": 3788.12, "text": "das funktioniert was mal quatsch elf ist nicht efi elf ist es ist ja ja ist das"}, {"id": 749, "start": 3788.12, "end": 3791.12, "text": "linux binary zeug hab es irgendwie kategorisch klar wie die durcheinander"}, {"id": 750, "start": 3791.12, "end": 3795.56, "text": "gepackt ok you mount hat er auch gesagt dass man"}, {"id": 751, "start": 3795.56, "end": 3805.6, "text": "you mounten soll gut jetzt bin ich ja mal gespannt ob es funktioniert leute meint"}, {"id": 752, "start": 3805.6, "end": 3814.44, "text": "ihr das tut ok power off du kannst die sd karte doch drin lassen ist auch die"}, {"id": 753, "start": 3814.44, "end": 3825.96, "text": "richtige reinfolge drin hast du eigentlich recht ja aber ich machs mal ohne sd karte ich"}, {"id": 754, "start": 3825.96, "end": 3829.04, "text": "mache mal die sd karte raus ich probiere es echt mal aus mal gucken ob das funktioniert"}, {"id": 755, "start": 3829.04, "end": 3840.48, "text": "also chat geht oder geht nicht also mocha smoke oder nicht mocha smoke was meint ihr so probieren"}, {"id": 756, "start": 3840.48, "end": 3863.52, "text": "maus er blinkt er blinkt"}, {"id": 757, "start": 3870.48, "end": 3899.32, "text": "da ist er"}, {"id": 758, "start": 3900.48, "end": 3923.36, "text": "ich habe es euch gleich gesagt es funktioniert wir haben ja kein ssh zugang weil ssh nicht"}, {"id": 759, "start": 3923.36, "end": 3943.76, "text": "eingeschaltet ist da müssen wir die sd karte noch mal rein machen noch mal von der sd karte"}, {"id": 760, "start": 3943.76, "end": 3955.4, "text": "buten ok das müssen wir noch mal noch mal noch mal neu buten na na bob bist ja richtig"}, {"id": 761, "start": 3955.4, "end": 3976.32, "text": "dumm ok ok ausschalten noch mal sd ssd nein sd karte noch mal rein und passen die sd karte"}, {"id": 762, "start": 3976.32, "end": 3985.2, "text": "jetzt nicht mehr was ist das ah jetzt so usb raus usb raus dass er auch sicher von der sd"}, {"id": 763, "start": 3985.2, "end": 3993.36, "text": "karte bootet anschalten ich könnte es auch an den pc stecken ja ja ich könnte es auch"}, {"id": 764, "start": 3993.36, "end": 3999.2, "text": "an den pc stecken macht überhaupt keinen unterschied wäre vielleicht sogar einfacher"}, {"id": 765, "start": 3999.2, "end": 4009.96, "text": "gewesen so booten wir von der sd karte das müsste jetzt ja kurz dauern weil er nicht"}, {"id": 766, "start": 4009.96, "end": 4014.72, "text": "checkt von was er booten soll und jetzt erstmal wenn er keine usb ssd karte findet bootet"}, {"id": 767, "start": 4014.72, "end": 4021.92, "text": "er von der sd karte ah da ist er exzellent zack jetzt sind wir wieder mit der sd karte"}, {"id": 768, "start": 4021.92, "end": 4038.16, "text": "drauf guckt die f-h da guckt der root was ist das naja zumindest ist die sd karte eindeutig"}, {"id": 769, "start": 4038.16, "end": 4049.56, "text": "macht hell nicht ok jetzt machen wir die sd ssd karte die ssd wieder dran meine göhe"}, {"id": 770, "start": 4049.56, "end": 4057.08, "text": "sagen hier def sda sagen mount ist nach mnt da sind wir wieder das ist jetzt die ssd worauf"}, {"id": 771, "start": 4057.08, "end": 4065.32, "text": "wir sind und hier machen wir jetzt eine datei die ssh heißt sync und jetzt gucken wir ob"}, {"id": 772, "start": 4065.32, "end": 4071.0, "text": "das rebooten funktioniert wir müssen ja die ssd die sd karte gar nicht mehr raus machen"}, {"id": 773, "start": 4071.0, "end": 4075.56, "text": "ich glaube man kann ssh nur beim ersten boot auf dem weg deaktivieren aktivieren ok das"}, {"id": 774, "start": 4075.56, "end": 4085.92, "text": "wäre das wäre dumm aber was wir machen können ist wie aktiviert man den kram manuell werden"}, {"id": 775, "start": 4085.92, "end": 4107.24, "text": "wir jetzt gleich sehen reboot activate ssh raspian ich müsste der raspi konfig kann ich"}, {"id": 776, "start": 4107.24, "end": 4117.36, "text": "ja nicht verwenden ich bin ja nicht im laufenden system drinne ich müsste da irgendwie ch ch"}, {"id": 777, "start": 4117.36, "end": 4124.84, "text": "change root oder irgendwas machen drauf ssh exzellent da sind wir wieder oh ne wir sind"}, {"id": 778, "start": 4124.84, "end": 4132.92, "text": "von der sd karte wir sind von der sd karte leute wir sind von der sd karte anscheinend"}, {"id": 779, "start": 4132.92, "end": 4141.28, "text": "kann man die sd karte doch nicht drin lassen anscheinend anscheinend kann man das doch"}, {"id": 780, "start": 4141.28, "end": 4158.28, "text": "nicht drin lassen ne moment warte mal ich bin verwirrt was ist das für ein schwachsinn"}, {"id": 781, "start": 4158.28, "end": 4163.0, "text": "wir haben gebootet von der sd karte jetzt guckt euch mal wir haben gebootet von der"}, {"id": 782, "start": 4163.0, "end": 4168.92, "text": "sd karte aber unser root ist gemontet von der nein wir haben gebootet von der ssd aber"}, {"id": 783, "start": 4168.92, "end": 4183.84, "text": "unser root ist gemontet von der sd karte das ist definitiv nicht wie wir es haben wollen"}, {"id": 784, "start": 4183.84, "end": 4195.68, "text": "das ist irgendwie falsch ok power off und sd karte raus ist er aus jawoll strom aus"}, {"id": 785, "start": 4195.68, "end": 4204.0, "text": "sd karte raus zack anschalten das coole ist man sieht auch gleich ob es funktioniert weil"}, {"id": 786, "start": 4204.0, "end": 4208.4, "text": "er grün blinkt so mal gucken ob das mit ssh jetzt klappt ansonsten muss ich den kram"}, {"id": 787, "start": 4208.4, "end": 4217.04, "text": "nochmal neu flaschen da habe ich ja wieder bock drauf gebootet von der ssd das sieht"}, {"id": 788, "start": 4217.04, "end": 4234.2, "text": "man weil er so merkwürdig blinkt ja ah excellent ah man warum geht das nicht muss ich jetzt"}, {"id": 789, "start": 4234.2, "end": 4247.64, "text": "den scheiß echt man muss doch im nachhinein den kram irgendwie aktivieren können ok was"}, {"id": 790, "start": 4247.64, "end": 4258.6, "text": "war es raspberry pi wie aktiviert man den kram nachträglich wie ne ne ne ne das das"}, {"id": 791, "start": 4258.6, "end": 4263.08, "text": "ding ist gerade auf wie wie macht man wie aktiviert man den service man müsste irgendwelche system"}, {"id": 792, "start": 4263.08, "end": 4270.96, "text": "d dinger um um linken oder so tastatur und bildschirm anschließen ich habe eine idee"}, {"id": 793, "start": 4270.96, "end": 4275.4, "text": "wir machen jetzt big brain play leute ich versuchte es jetzt ohne monitor zu tippen"}, {"id": 794, "start": 4275.4, "end": 4285.92, "text": "ja change root müssten wir machen wahrscheinlich ja ja ja denke ich auch ich war ich war ich"}, {"id": 795, "start": 4285.92, "end": 4291.12, "text": "mache ich versuch es mal zu tippen mit der tastatur ohne dass ich was sehe oder bin ich"}, {"id": 796, "start": 4291.12, "end": 4308.44, "text": "mal ok system ctl enable wie geht das unter ssd wer das klappt ist big brain nein nein"}, {"id": 797, "start": 4308.44, "end": 4322.04, "text": "ok ok big brain also ich schließe jetzt mal meine meine tastatur an an den raspberry"}, {"id": 798, "start": 4322.04, "end": 4341.44, "text": "gar nichts ich sehe gar nichts ok tastatur ist dran ich muss mich erstmal einloggen genau"}, {"id": 799, "start": 4341.44, "end": 4364.32, "text": "hi enter raspberry enter sudo-i enter system ctl enable sshd system ctl start sshd ob das"}, {"id": 800, "start": 4364.32, "end": 4372.6, "text": "jetzt funktioniert hat also ich bin ja mal gespannt ob das jetzt ich kann nicht enter"}, {"id": 801, "start": 4372.6, "end": 4393.92, "text": "drücken aber big brain play ha oh ist es ist es englisches tastatur leer auch du scheiße"}, {"id": 802, "start": 4393.92, "end": 4405.04, "text": "ok leute change root wir change root nicht gebacken das kriege ich nicht blind das kriege"}, {"id": 803, "start": 4405.04, "end": 4413.16, "text": "ich nicht blind getippt das kriege ich nicht blind getippt faka ne hat nicht funktioniert"}, {"id": 804, "start": 4413.16, "end": 4432.28, "text": "laut key de ne ne ne ne komm leute wir starten nochmal neu von der sd karte wir starten nochmal"}, {"id": 805, "start": 4432.28, "end": 4461.2, "text": "neu von der sd karte ok a lesbian da bin ich ja mal gespannt ob das jetzt ob das jetzt"}, {"id": 806, "start": 4461.2, "end": 4474.88, "text": "genau oder warum kann man das warum kann man das nur einmal aktivieren über das mount"}, {"id": 807, "start": 4474.88, "end": 4484.84, "text": "wahrscheinlich falls vorm resize ist ist das doof ok also was haben da jetzt alles ja den"}, {"id": 808, "start": 4484.84, "end": 4503.84, "text": "da brauchen wir also mount ja mount das da nach mnt so und wie change root wie wie ging"}, {"id": 809, "start": 4503.84, "end": 4517.56, "text": "das nochmal das mache ich so selten nicht einfach so oder oder einfach so ging das einfach"}, {"id": 810, "start": 4517.56, "end": 4544.6, "text": "so ne oder doch da müssen wir irgendwelche befehle angeben stem ctl enable sshd oh ne"}, {"id": 811, "start": 4544.6, "end": 4559.12, "text": "so funktioniert das schonmal gar nicht oh gott was ein scheiß was what warum kann man"}, {"id": 812, "start": 4559.12, "end": 4588.92, "text": "das ist inne was ok was auch immer wie macht man das da drin boot options ne wo steht denn"}, {"id": 813, "start": 4588.92, "end": 4610.64, "text": "das drunter überhaupt interface options ah ssh yes ok und das ganze probieren wir jetzt"}, {"id": 814, "start": 4610.64, "end": 4627.64, "text": "mal mit ja yes ob das jetzt funktioniert hat ne oder das das hat jetzt nicht funktioniert"}, {"id": 815, "start": 4627.64, "end": 4649.04, "text": "leute das kann es kann man sich erzählen prepare for ssh without screen to enable ssh oh ist"}, {"id": 816, "start": 4649.04, "end": 4672.16, "text": "das boot ssh on your boot ne gibts nicht was auch immer ok ob das jetzt funktioniert hat"}, {"id": 817, "start": 4672.16, "end": 4689.0, "text": "was ich da gemacht habe copy was ne das funktioniert immer nein das funktioniert nicht ssh in"}, {"id": 818, "start": 4689.0, "end": 4694.04, "text": "der bootpartition das funktioniert wohl anscheinend nur einmalig bevor er die platte resized hat"}, {"id": 819, "start": 4694.04, "end": 4715.64, "text": "ok das ist wieder war wieder die die einfachste sache ist wieder das komplizierteste ok mal"}, {"id": 820, "start": 4715.64, "end": 4720.52, "text": "gucken ob das jetzt funktioniert an was wir gemacht haben ich mein wir haben wir haben"}, {"id": 821, "start": 4720.52, "end": 4748.08, "text": "wir haben unser root gewechselt auf auf das von der ssd karte von der ssd platte ich bin"}, {"id": 822, "start": 4748.08, "end": 4759.92, "text": "jetzt geneigt dazu das mal zu probieren ich bin jetzt echt geneigt das mal zu zu probieren"}, {"id": 823, "start": 4759.92, "end": 4769.12, "text": "komm mal weil ich war mir jetzt update dann geht das auch auf die ssd und nicht und nicht"}, {"id": 824, "start": 4769.12, "end": 4779.24, "text": "auf meine micro sd karte ups ich sollte vielleicht nicht so viel enter drücken ein frisches"}, {"id": 825, "start": 4779.24, "end": 4784.2, "text": "drauflatschen wäre doch lange ja das stimmt aber probieren wir probieren mal was ob jetzt"}, {"id": 826, "start": 4784.2, "end": 4790.52, "text": "hier unser root wirklich auf also dd wir gucken jetzt mal wie schnell das ist und ob das die"}, {"id": 827, "start": 4790.52, "end": 4807.76, "text": "ssd ist oder mikro sd also auch immer block size gleich 4096 quatsch progress nee ah fuck"}, {"id": 828, "start": 4807.76, "end": 4819.92, "text": "wie ging das status dd status kann ich mir immer nicht merke status progress so rum"}, {"id": 829, "start": 4819.92, "end": 4829.8, "text": "ok das ist auf jeden fall das ist auf jeden fall die ssd auf die wir gerade schreiben"}, {"id": 830, "start": 4829.8, "end": 4834.76, "text": "nicht die micro sd karte bei der geschwindigkeit das auf jeden fall die ssd das war nicht"}, {"id": 831, "start": 4834.76, "end": 4845.0, "text": "die schnellste ssd aber die micro sd ist definitiv nicht so schnell so ok ich riebute mal ob"}, {"id": 832, "start": 4845.0, "end": 4856.76, "text": "das jetzt funktioniert ich meine kann sein dass es klappt kann nicht sein pie enable"}, {"id": 833, "start": 4856.76, "end": 4869.8, "text": "ssh headless yep headless raspberry pie config ich war ein system ctl sollte ja eigentlich"}, {"id": 834, "start": 4869.8, "end": 4883.04, "text": "tun aber max irgendwie nicht sehr sehr merkwürdig nun gut ja ich ich hoffe das hat jetzt funktioniert"}, {"id": 835, "start": 4883.04, "end": 4896.12, "text": "probieren wir mal aus poff was ah jetzt poff warum kopiert er nicht einfach die ssh datei"}, {"id": 836, "start": 4896.12, "end": 4900.84, "text": "den boot oder weil die platte schon re-sized ist und anscheinend das nicht mehr funktioniert"}, {"id": 837, "start": 4900.84, "end": 4907.52, "text": "nachdem sie schon re-sized ist also das funktioniert wohl nach dem ersten boot nicht mehr ich meine"}, {"id": 838, "start": 4907.52, "end": 4916.72, "text": "ich könnte die ssd einfach neu flaschen das würde würde natürlich funktionieren aber"}, {"id": 839, "start": 4916.72, "end": 4920.64, "text": "ich will mal gucken ob ich sie nicht so irgendwie gebacken kriegt weil ich habe echt kein schimmer"}, {"id": 840, "start": 4920.64, "end": 4928.08, "text": "wie man das macht ich könnte die ich könnte die sachen selbst verlinken die unit selbst"}, {"id": 841, "start": 4928.08, "end": 4943.4, "text": "verlinken irgendwie ok booted er booted er booted monka boot"}, {"id": 842, "start": 4943.4, "end": 4963.8, "text": "das brauche aber ganz schön lang jetzt brauche aber ganz schön lang was ist hier los"}, {"id": 843, "start": 4963.8, "end": 4974.88, "text": "warum braucht er jetzt so lang zu booten"}, {"id": 844, "start": 4974.88, "end": 4996.08, "text": "what rip warum muss jetzt das problem"}, {"id": 845, "start": 4996.08, "end": 5017.2, "text": "hallo wo ist denn jetzt das problem also dass er jetzt auf einmal nicht mehr booten kann"}, {"id": 846, "start": 5017.2, "end": 5020.72, "text": "kann ich mir nur nicht vorstellen ne ne die ip hat sich nicht geändert ich hab grad nachgeguckt"}, {"id": 847, "start": 5020.72, "end": 5026.56, "text": "das war auch das erste was ich gedacht habe dass ich die ip geändert hat aber der hat"}, {"id": 848, "start": 5026.56, "end": 5051.44, "text": "keine der hat sich keine neue ip geholt monka s"}, {"id": 849, "start": 5051.44, "end": 5061.24, "text": "ok ich mach nochmal aus und nochmal an vielleicht war ich zu schnell"}, {"id": 850, "start": 5061.24, "end": 5066.56, "text": "wenn nicht flashe ich halt den kram nochmal meinetwegen ja das können wir übrigens sogar"}, {"id": 851, "start": 5066.56, "end": 5067.92, "text": "vom raspberry pi selbst machen"}, {"id": 852, "start": 5067.92, "end": 5084.6, "text": "ne der mag nicht mehr booten von der sd card what the fuck warum"}, {"id": 853, "start": 5084.6, "end": 5099.96, "text": "ok es hat funktioniert was wir gemacht haben es hat funktioniert wie ging das noch mal"}, {"id": 854, "start": 5099.96, "end": 5114.96, "text": "option ignore no strict strict no ne ah fuck ich vergess immer wieder kram funktioniert"}, {"id": 855, "start": 5114.96, "end": 5130.92, "text": "dass man eben sagen kann scheiß drauf na gut"}, {"id": 856, "start": 5130.92, "end": 5141.28, "text": "da sind wir leute da sind wir excellent hat alles funktioniert siehste haben wir alles"}, {"id": 857, "start": 5141.28, "end": 5147.24, "text": "richtig gemacht ca root auf die ssd raspberry pi config und funktioniert"}, {"id": 858, "start": 5147.24, "end": 5175.64, "text": "ok sehr gut sehr gut sehr gut"}, {"id": 859, "start": 5175.64, "end": 5186.56, "text": "so wir laufen komplett von der sd karte ihr seht es ist auch keine micro sd karte mehr"}, {"id": 860, "start": 5186.56, "end": 5193.56, "text": "drin wir sind direkt komplett von ssd über usb gebooted huge so jetzt machen wir das"}, {"id": 861, "start": 5193.56, "end": 5208.28, "text": "system erst mal update mach ich jetzt kaputt wenn ich das jetzt noch mal upgrade wie war"}, {"id": 862, "start": 5208.28, "end": 5225.56, "text": "das kommando nochmal für den 40 gen bootloader 40 gen cmd bootloader version bootloader version"}, {"id": 863, "start": 5225.56, "end": 5232.28, "text": "ok wir sind korrekt ab upgrade das sollte jetzt viel schneller gehen weil es dann über"}, {"id": 864, "start": 5232.28, "end": 5240.24, "text": "die ssd geht ja boah leute das flutscht so schnell ab der raspberry pi und die updaten"}, {"id": 865, "start": 5240.24, "end": 5259.16, "text": "sind das flutscht und die ssd ist auch schon nicht sonderlich"}, {"id": 866, "start": 5259.16, "end": 5264.6, "text": "schnell habt ihr eben gesehen billige ziemlich billige ssd worum geht es dass wir den raspberry"}, {"id": 867, "start": 5264.6, "end": 5272.44, "text": "pi 4 endlich komplett von usb bzw von ssd booten kann ohne dass eine micro sd karte"}, {"id": 868, "start": 5272.44, "end": 5290.28, "text": "drin sein muss so schnell sieht man selten in raspberry pi updaten das machen wir tatsächlich"}, {"id": 869, "start": 5290.28, "end": 5297.84, "text": "mal danach wobei zeitzonen kann man auch über raspberry pi config setzen glaube und keine"}, {"id": 870, "start": 5297.84, "end": 5305.52, "text": "tot und keine toten micro sd karte auch ja so sehr schön"}, {"id": 871, "start": 5305.52, "end": 5329.16, "text": "wo setzt man lokalisation options time zone europe germany anni berlin"}, {"id": 872, "start": 5329.16, "end": 5336.36, "text": "date 1248 sehr gut"}, {"id": 873, "start": 5336.36, "end": 5353.12, "text": "was hast du denn für problem wenn lan kabel eingesteckt ist hat der pi 4 eigentlich immer"}, {"id": 874, "start": 5353.12, "end": 5359.64, "text": "noch fake gigabit srnet nee das ist besser angebunden jetzt können wir mal ausprobieren"}, {"id": 875, "start": 5359.64, "end": 5386.32, "text": "iperf hier machen wir mal bin aber gigabit dran iperf minus s war das glaube ich und"}, {"id": 876, "start": 5386.32, "end": 5392.72, "text": "ja guck gigabit passt ziemlich gut"}, {"id": 877, "start": 5392.72, "end": 5409.76, "text": "939 mbit in beide richtungen das ist das ist ziemlich gigabitig maximum maximum bei gigabit"}, {"id": 878, "start": 5409.76, "end": 5421.68, "text": "ist glaube ich 1250 mbit"}, {"id": 879, "start": 5421.68, "end": 5426.76, "text": "max theoretisches maximum aber das ist schon ok"}, {"id": 880, "start": 5426.76, "end": 5435.88, "text": "das ist schon ok so wie war der befehl für du machst auf der einen seite machst du iperf"}, {"id": 881, "start": 5435.88, "end": 5439.92, "text": "minus s für den server und auf der anderen seite machst du minus c für klein du kannst"}, {"id": 882, "start": 5439.92, "end": 5447.12, "text": "auch reverse glaube ich irgendwie sagen dass er es anders rum dann testet"}, {"id": 883, "start": 5447.12, "end": 5457.72, "text": "reverse ah minus groß r war das"}, {"id": 884, "start": 5457.72, "end": 5461.96, "text": "jetzt teste das umgedreht jetzt teste das quasi von dem zu dem vor allem von dem zu"}, {"id": 885, "start": 5461.96, "end": 5466.52, "text": "dem getestet aber ich sehe das eigentlich kein großer unterschied zwischendrin hat"}, {"id": 886, "start": 5466.52, "end": 5472.84, "text": "aber ein paar retries was auch immer er da rumspackt ich weiß es nicht im lokalen netzwerk"}, {"id": 887, "start": 5472.84, "end": 5483.4, "text": "sollte der eigentlich keine retries brauchen"}, {"id": 888, "start": 5483.4, "end": 5500.44, "text": "und wir desmond sieben monate exzellent vorher hat er keine retries gebraucht oder ok in"}, {"id": 889, "start": 5500.44, "end": 5506.36, "text": "die eine richtung braucht er keine retries also von von mir zum raspberry pi keine retries"}, {"id": 890, "start": 5506.36, "end": 5511.56, "text": "vom raspberry pi zu mir retry was auch immer scheiß drauf es funktioniert es ist gigabit"}, {"id": 891, "start": 5511.56, "end": 5518.36, "text": "es ist relativ schnell so was ich jetzt noch probieren wollte wenn ich den upgrade und"}, {"id": 892, "start": 5518.36, "end": 5526.72, "text": "restart ob das dann noch funktioniert weil ja doch bootloaderversion passt ist eigentlich"}, {"id": 893, "start": 5526.72, "end": 5529.24, "text": "alles gut reboot gucken ob es noch tut"}, {"id": 894, "start": 5529.24, "end": 5556.12, "text": "dankeschön für den sub huge kann das sein dass der manchmal spinnt wenn man ihn rebootet"}, {"id": 895, "start": 5556.12, "end": 5578.92, "text": "ich bin begeistert und es war relativ einfach muss man sagen aber auch nur dank dem video"}, {"id": 896, "start": 5578.92, "end": 5584.32, "text": "hier die offizielle anleitung ist absoluter crap ich mein guck mal wie viel sachen in"}, {"id": 897, "start": 5584.32, "end": 5592.72, "text": "diesem video drin waren was in der offiziellen anleitung nicht drinne steht also bestes bestes"}, {"id": 898, "start": 5592.72, "end": 5599.64, "text": "wird der raspberry pi eignet sich für nass nicht sondern nicht gut auch der vierer nicht"}, {"id": 899, "start": 5599.64, "end": 5621.08, "text": "trotz gigabit und usb 3 eignet sich der vierer nicht gut für den nass"}, {"id": 900, "start": 5621.08, "end": 5627.04, "text": "budget nass ja das ist aber schon sehr budget das ist aber schon sehr budget in raspberry"}, {"id": 901, "start": 5627.04, "end": 5634.44, "text": "pi als nass da ist fast alles andere besser als raspberry pi sogar die hier sind ganz"}, {"id": 902, "start": 5634.44, "end": 5649.24, "text": "gut als budget nass die hier sind ganz gut als budget nass da passt sogar eine 3,5 zoll"}, {"id": 903, "start": 5649.24, "end": 5653.64, "text": "festplatte rein die dinger sind ganz gut als budget nass"}, {"id": 904, "start": 5653.64, "end": 5662.16, "text": "kein rate nö aber bei einem budget nass reden wir ja auch nicht von rate bei einem budget"}, {"id": 905, "start": 5662.16, "end": 5668.56, "text": "nass sonst wäre es ja kein budget nass mehr weil für alles andere ist der raspberry pi"}, {"id": 906, "start": 5668.56, "end": 5675.36, "text": "4 auch nicht richtig gut das das das große problem bei einem nass und"}, {"id": 907, "start": 5675.36, "end": 5681.0, "text": "raspberry pi 4 ist dass die gespart haben bei den crypto extensions von der cpu die"}, {"id": 908, "start": 5681.0, "end": 5694.24, "text": "cpu hätte eigentlich die cpu hätte eigentlich crypto extensions aber die haben sich gedacht"}, {"id": 909, "start": 5694.24, "end": 5700.44, "text": "nö brauchen wir nicht und ohne die crypto extensions von der cpu ist halt jegliche verschlüsselung"}, {"id": 910, "start": 5700.44, "end": 5711.2, "text": "saumäßig langsam krypt setup benchmark ich kann es euch mal zeigen wie langsam benchmark"}, {"id": 911, "start": 5711.2, "end": 5728.36, "text": "wie ging das noch mal was einfach krypt setup benchmark"}, {"id": 912, "start": 5728.36, "end": 5734.0, "text": "als kosten ja ist für mich aber als anwender wurscht ich weiß nicht klar warum sie es"}, {"id": 913, "start": 5734.0, "end": 5740.48, "text": "gespart haben aber es ist halt kacke"}, {"id": 914, "start": 5740.48, "end": 5742.6, "text": "retopie ja habe ich mir schon aufgeschrieben"}, {"id": 915, "start": 5742.6, "end": 5759.76, "text": "so wir lassen jetzt mal den benchmark laufen man sieht es viel zu langsam ja das hier ist"}, {"id": 916, "start": 5759.76, "end": 5769.96, "text": "das wichtige oder auch das hier und man sieht man kriegt maximal 64 64 beziehungsweise 85"}, {"id": 917, "start": 5769.96, "end": 5776.72, "text": "mb die sekunde die co decrypted also sprich man kann das nicht als nass verwenden weil"}, {"id": 918, "start": 5776.72, "end": 5781.44, "text": "man darf nicht vergessen das hier verwendet jetzt 100 prozent cpu und wenn du das ding"}, {"id": 919, "start": 5781.44, "end": 5787.84, "text": "als nass verwendet kommt ja noch dabei du brauchst auf die auf die ssd braucht auch"}, {"id": 920, "start": 5787.84, "end": 5793.08, "text": "noch mal 30 40 prozent cpu last du brauchst ein samba server von windows drauf zuzugreifen"}, {"id": 921, "start": 5793.08, "end": 5799.0, "text": "da braucht auch noch mal ordentlich was das heißt realistisch gesehen verschlüsselung"}, {"id": 922, "start": 5799.0, "end": 5810.24, "text": "entschlüsselung legte so bei 50 mb vielleicht so ach ich glaube nicht dass die die lizenzen"}, {"id": 923, "start": 5810.24, "end": 5814.56, "text": "für die für die crypto extensions das jetzt so ins unermessliche getrieben haben ich"}, {"id": 924, "start": 5814.56, "end": 5817.4, "text": "meine die nehmen ja auch relativ viel ab ich habe keine ahnung ehrlich gesagt wie groß"}, {"id": 925, "start": 5817.4, "end": 5823.4, "text": "die lizenzgebühren sind ist mir aber wurscht also den raspberry pi kannst du halt aus diesem"}, {"id": 926, "start": 5823.4, "end": 5829.64, "text": "grund nicht als nass gebrauchen machst du eigentlich deinen versand tracker noch mal"}, {"id": 927, "start": 5829.64, "end": 5839.36, "text": "weiter ich glaube nicht ich glaube nicht das ding das ding ist total unfertig also es geht"}, {"id": 928, "start": 5839.36, "end": 5849.28, "text": "um das ding hier versand track so ich hatte mal so was gebastelt wo man quasi versand"}, {"id": 929, "start": 5849.28, "end": 5856.56, "text": "dienstleister unabhängig seine bestellung tracken konnte und der hat sich die sachen"}, {"id": 930, "start": 5856.56, "end": 5863.62, "text": "halt automatisch aus dem email postfach rausgepasst sprich man hat immer erkannt wann pakete"}, {"id": 931, "start": 5863.62, "end": 5869.48, "text": "kommen auch wenn man sie nicht manuell hinzugefügt hat aber ich habe selbst grad nicht im einsatz"}, {"id": 932, "start": 5869.48, "end": 5879.8, "text": "und es hat sich auch als nicht so nicht so praktisch rausgestellt für mich wie ich mir"}, {"id": 933, "start": 5879.8, "end": 5884.96, "text": "das gedacht habe ich weiß nicht ob ich da ja sascha verwendest du das weil wie gesagt"}, {"id": 934, "start": 5884.96, "end": 5891.88, "text": "amazon habe ich ja immer noch nicht eingebaut obwohl amazon problemlos möglich sein sollte"}, {"id": 935, "start": 5891.88, "end": 5898.28, "text": "gibt schon parcel app ja aber die parcel app kann nicht alles das die parcel app die"}, {"id": 936, "start": 5898.28, "end": 5905.44, "text": "kann auch glaube email postfächer passen aber manche sachen erkennt sie nicht und es"}, {"id": 937, "start": 5905.44, "end": 5912.76, "text": "und es kostet was und irgendwas war ich kann mich ich kann mich noch ich kann mich ich"}, {"id": 938, "start": 5912.76, "end": 5916.44, "text": "kann mich nicht mehr dran erinnern es hatte seinen grund warum ich das nachgebaut habe"}, {"id": 939, "start": 5916.44, "end": 5921.36, "text": "ach ja klar ich weiß warum ich nachgebaut habe weil ich das ja in meine heim automatisierung"}, {"id": 940, "start": 5921.36, "end": 5927.12, "text": "integrieren wollte und das kann ich mit der parcel app natürlich vergessen ich wollte"}, {"id": 941, "start": 5927.12, "end": 5932.92, "text": "dann auch irgendwelche webhooks einbauen dass man das ding bescheid sagen kann und auf"}, {"id": 942, "start": 5932.92, "end": 5941.32, "text": "meinem dashboard anzeigen kann dhl kommt heute oder ups kommt heute vielleicht mache ich"}, {"id": 943, "start": 5941.32, "end": 5946.64, "text": "vielleicht mache ich auch mal weiter dran dann müssen wir aber wahrscheinlich das frontend"}, {"id": 944, "start": 5946.64, "end": 5957.16, "text": "neu basteln weil das ist mit ural view version wie sieht deine boot konfig jetzt aus genauso"}, {"id": 945, "start": 5957.16, "end": 5968.8, "text": "wie vorher wie heißt die datei nach der man da konf hier kommt euch mal wie schnell das"}, {"id": 946, "start": 5968.8, "end": 5975.92, "text": "geht mit der ssd kommt mal hier achtung install flupp das ist fast so schnell wie lokal mit"}, {"id": 947, "start": 5975.92, "end": 5981.96, "text": "der ssd ist das so schnell weiß ich ob ssh da irgendwo drin steht nee gar nicht so wie"}, {"id": 948, "start": 5981.96, "end": 5988.96, "text": "vorher ich habe ein ch root einen change root gemacht auf meine ssd und habe dann über"}, {"id": 949, "start": 5988.96, "end": 6002.8, "text": "raspberry konfig den kram aktiviert aktivist haben gut konfig vc woodloader konfig so wie"}, {"id": 950, "start": 6002.8, "end": 6021.68, "text": "vorher also hat also nix kaputt gemacht also das hat ausgesprochen hat ausgesprochen"}, {"id": 951, "start": 6021.68, "end": 6034.16, "text": "gut funktioniert muss ich sagen nachdem der kram jetzt tut neuer standard 0xf41 ja anscheinend"}, {"id": 952, "start": 6034.16, "end": 6041.32, "text": "bedeutet das ja dass er erst booted von usb und dann von der mikro sd karte was aber"}, {"id": 953, "start": 6041.32, "end": 6044.8, "text": "ein bisschen doof ist man kann die mikro sd karte nicht drinnen lassen weil er dann"}, {"id": 954, "start": 6044.8, "end": 6049.2, "text": "das root von der mikro sd karte nimmt da weiß ich nicht wie man ihm das abgewöhnt"}, {"id": 955, "start": 6049.2, "end": 6068.36, "text": "vielleicht warte mal etc fs tab mal gucken ach was auch immer das schöne ist man braucht"}, {"id": 956, "start": 6068.36, "end": 6073.84, "text": "auch gar keine mikro sd karte mehr das ist eigentlich der sinn davon und das ist nice"}, {"id": 957, "start": 6073.84, "end": 6080.72, "text": "das ist poggers nice was der grün was der riesen vorteil davon ist auch keine sd karten"}, {"id": 958, "start": 6080.72, "end": 6085.44, "text": "mehr die kaputt gehen sd karten also vor allem mikro sd karten sind nicht bekannt dafür"}, {"id": 959, "start": 6085.44, "end": 6093.2, "text": "dass sie sonderlich haltbar sind die einzigen die wirklich richtig gut sind was das angeht"}, {"id": 960, "start": 6093.2, "end": 6109.92, "text": "ist samsung mikro sd endurance die dinger sind richtig gut aber die sind halt auch ganz"}, {"id": 961, "start": 6109.92, "end": 6122.4, "text": "schön teuer ich mein 22 dollar 23 euro hier für ne für ne mikro sd ist schon ganz schön"}, {"id": 962, "start": 6122.4, "end": 6126.36, "text": "aber die sind wirklich gut also wenn ich kisten hätte habe ich auch in meinem raspberry unify"}, {"id": 963, "start": 6126.36, "end": 6130.32, "text": "controller drin also wenn ich kisten hätte wo ich wirklich sicher gehen will dass mir"}, {"id": 964, "start": 6130.32, "end": 6138.84, "text": "die mikro sd karte nicht verreckt dann würde ich die nehmen wtf wusste nicht dass du streamst"}, {"id": 965, "start": 6138.84, "end": 6153.24, "text": "omega null ja wie hast du es denn jetzt gefunden also wie gesagt die kann ich die endurance"}, {"id": 966, "start": 6153.24, "end": 6161.72, "text": "mikro sds kann ich nur empfehlen alternativ wenn ihr euch das jetzt mal so anguckt ihr"}, {"id": 967, "start": 6161.72, "end": 6170.16, "text": "habt hier für 22 für 23 euro ne mikro sd karte die zumindest von der vom weißt es"}, {"id": 968, "start": 6170.16, "end": 6176.24, "text": "vom wirlöffel und vom vom vom halt wie es kaputt geht ziemlich ziemlich gut was aushält"}, {"id": 969, "start": 6176.24, "end": 6181.52, "text": "aber wenn man sich anguckt wenn ihr eine kleine ssd kauft also zum beispiel ja wieder hier"}, {"id": 970, "start": 6181.52, "end": 6193.2, "text": "ssd eine kleine guckt euch das mal an da kriegt ihr nämlich schon für 20 euro mehr für"}, {"id": 971, "start": 6193.2, "end": 6199.32, "text": "15 euro mehr für 15 euro mehr kriegt ihr dann nämlich schon 240 gigabyte also wenn"}, {"id": 972, "start": 6199.32, "end": 6204.96, "text": "man so weit könnte man könnte sich fast überlegen mehr ssd zu nehmen anstatt eine sd karte also"}, {"id": 973, "start": 6204.96, "end": 6212.96, "text": "bespricht wenn man zur auswahl hat 23 euro für eine 64 g durable mikro sd oder man nimmt"}, {"id": 974, "start": 6212.96, "end": 6226.36, "text": "einfach direkt ne ssd für 40 euro ja vorgeschlagenes streams nice echt ich bin in vorgeschlagenes"}, {"id": 975, "start": 6226.36, "end": 6237.4, "text": "streams drin das ist ja ja exzellent was man hier natürlich noch braucht muss man auch"}, {"id": 976, "start": 6237.4, "end": 6244.64, "text": "gestimmt muss man auch dabei rechnen man braucht noch nen sata auf usb das funktioniert natürlich"}, {"id": 977, "start": 6244.64, "end": 6252.56, "text": "sonst sonst nicht gibt es eigentlich noch 128 gibt es eigentlich noch die klein guck"}, {"id": 978, "start": 6252.56, "end": 6258.96, "text": "mal du kriegst für weniger für weniger als die ssd als die mikro sd karte kostet kriegst"}, {"id": 979, "start": 6258.96, "end": 6269.48, "text": "du 120 g sata ssd und da fährst du auf jeden fall besser mit allerdings da passt noch nicht"}, {"id": 980, "start": 6269.48, "end": 6283.88, "text": "mal modern warfare drauf das ist richtig schau dir mal samsung flash usb stick das ding"}, {"id": 981, "start": 6283.88, "end": 6298.56, "text": "welchen meinste na ob der so viel besser ist als die mikro sd karte weiß ich nicht weiß"}, {"id": 982, "start": 6298.56, "end": 6307.24, "text": "ich was die da reinbauen aber man sieht eine sache eindeutig dadurch man hat viel mehr"}, {"id": 983, "start": 6307.24, "end": 6312.28, "text": "auswahl man hat viel mehr auswahl jetzt man kann sagen ich scheiß drauf und eben einfach"}, {"id": 984, "start": 6312.28, "end": 6317.0, "text": "eine billige mikro sd man kann sagen ok ist mir ein bisschen wichtiger ich nehme die endurance"}, {"id": 985, "start": 6317.0, "end": 6325.08, "text": "variante mikro sd oder aber du gehst gleich auf usb boot und sagst ich nehme 128 g ssd"}, {"id": 986, "start": 6325.08, "end": 6331.0, "text": "die billige ist als die mikro sd endurance mit einem adapter ein bisschen mehr oder nimmst"}, {"id": 987, "start": 6331.0, "end": 6336.16, "text": "nen usb stick mit flash technik und sowas also richtig gut man hat wenn hat viel mehr"}, {"id": 988, "start": 6336.16, "end": 6343.04, "text": "auswahl jetzt und wenn es ein wichtig ist dass der raspberry pi nicht verreckt beim stromausfall"}, {"id": 989, "start": 6343.04, "end": 6347.08, "text": "dann ist es mit usb boot auf jeden fall besser man kann natürlich auch sagen ich scheiß"}, {"id": 990, "start": 6347.08, "end": 6351.12, "text": "komplett drauf sascha ich wollte es nämlich gerade sagen man kann auch sagen ich scheiß"}, {"id": 991, "start": 6351.12, "end": 6356.6, "text": "komplett drauf und nimmt einfach wenn man speicherplatz braucht nimmt einfach irgendwie"}, {"id": 992, "start": 6356.6, "end": 6362.52, "text": "eine zwei terabyte festplatte das geht natürlich jetzt auch und das gute ist dass es auch"}, {"id": 993, "start": 6362.52, "end": 6369.8, "text": "über usb 3 booted weil ich zeige es euch noch mal"}, {"id": 994, "start": 6369.8, "end": 6376.4, "text": "es ist relativ geschwind wie gesagt die ssd die sackt ja"}, {"id": 995, "start": 6376.4, "end": 6379.16, "text": "also das ist es gibt deutlich schnellere ssd als dieses ding da"}, {"id": 996, "start": 6379.16, "end": 6387.2, "text": "bei einer festplatte braucht ein zusätzliches netzteil ja bei manchen ich glaube manche"}, {"id": 997, "start": 6387.2, "end": 6393.6, "text": "2,5 zoll platten müssten vielleicht auch gehen gucken wie viel stromaus so einem usb"}, {"id": 998, "start": 6393.6, "end": 6403.04, "text": "vom raspberry pi ziehen kann also die ssd ist jetzt nicht super super schnell ja easykiller"}, {"id": 999, "start": 6403.04, "end": 6407.12, "text": "sagt ich traue mich erst dran wenn die einrichtung idiotensicher ist du kannst ja nichts kaputt"}, {"id": 1000, "start": 6407.12, "end": 6410.88, "text": "machen im zweifelsfall flasht du deine sd karte neu kaputt gehen kann dabei ja nix"}, {"id": 1001, "start": 6410.88, "end": 6429.32, "text": "die ssd ist schon echt langsam oder"}, {"id": 1002, "start": 6429.32, "end": 6434.48, "text": "wie heißt dein text to speech von einem miem tool das ist irgendein was weiß ich auch"}, {"id": 1003, "start": 6434.48, "end": 6441.08, "text": "unkopflich das ist irgendein koreanischer oder japanischer text to speech service gewesen"}, {"id": 1004, "start": 6441.08, "end": 6453.36, "text": "der das hier machen kann hier wo sei ich der sebaro"}, {"id": 1005, "start": 6453.36, "end": 6480.4, "text": "was ist das denn"}, {"id": 1006, "start": 6480.4, "end": 6490.4, "text": "was ist das denn für ein big brain name"}, {"id": 1007, "start": 6490.4, "end": 6498.6, "text": "ah das ist ein raspberry pi gehäuse"}, {"id": 1008, "start": 6498.6, "end": 6510.88, "text": "das ist ein ziemlich stabiles raspberry pi gehäuse kann man das hutschiene montieren"}, {"id": 1009, "start": 6510.88, "end": 6530.84, "text": "ah das ist das ist die jaja ok ja das aber kein usb 3 das ist doof usb 3 beste und wahrscheinlich"}, {"id": 1010, "start": 6530.84, "end": 6539.36, "text": "auch kein richtiges gigabit oder geht ja um stabil ja gut wenn es wenn es denn hier stabil"}, {"id": 1011, "start": 6539.36, "end": 6548.0, "text": "geht und den rest nicht dann ist das vielleicht was das ist der pi ramriegel habe ich mich"}, {"id": 1012, "start": 6548.0, "end": 6553.48, "text": "noch null mit beschäftigt poe ist natürlich praktisch poe ist ja immer so ein bisschen"}, {"id": 1013, "start": 6553.48, "end": 6558.04, "text": "hack mäßig gewesen beim raspberry pi ich weiß gar nicht wie man beim pi 4 richtiges"}, {"id": 1014, "start": 6558.04, "end": 6566.72, "text": "poe macht oh leute ich muss mir essen bestellen was bestelle ich mir denn also ich bestelle"}, {"id": 1015, "start": 6566.72, "end": 6576.08, "text": "mir auf jeden fall heute döner beziehungsweise irgendwas türkisches weil freitags bestelle"}, {"id": 1016, "start": 6576.08, "end": 6586.28, "text": "ich meistens irgendwelche bei bei so einem dönerladen hier um die ecke freitags bietet"}, {"id": 1017, "start": 6586.28, "end": 6596.92, "text": "sich da immer anführe so also köfte köfte spieß also was ich normalerweise nehme ist"}, {"id": 1018, "start": 6596.92, "end": 6605.48, "text": "dünner teller salat und reis oder dünner teller salat und pomfret aber es gibt ja auch noch"}, {"id": 1019, "start": 6605.48, "end": 6608.76, "text": "zig andere das problem ist ich kann euch das jetzt nicht zeigen weil dann dann lieg ich"}, {"id": 1020, "start": 6608.76, "end": 6619.08, "text": "quasi den dönerladen um die ecke so also wie gesagt dünner teller ist das normale was"}, {"id": 1021, "start": 6619.08, "end": 6626.96, "text": "ich bestell allerdings so ein piede döner würde ich mir auch vor das ist ja kein döner"}, {"id": 1022, "start": 6626.96, "end": 6641.24, "text": "passt ja nicht also sprich dieses schiff genau mit dünner vielleicht auch das ist auch sehr"}, {"id": 1023, "start": 6641.24, "end": 6649.8, "text": "nice habe ich heute schon eine ganze weile nicht mehr gehabt das könnte ich mir vielleicht"}, {"id": 1024, "start": 6649.8, "end": 6665.24, "text": "auch mal wieder eins eins holen oder das hier wo ich keine ahnung habe wie man das ausspricht"}, {"id": 1025, "start": 6665.24, "end": 6674.92, "text": "wie spricht man das aus wie spricht man das aussprache ah ne ich habe gar keinen sound"}, {"id": 1026, "start": 6674.92, "end": 6681.48, "text": "hier lama tun okay probieren wir mal aussprache pronunciation"}, {"id": 1027, "start": 6681.48, "end": 6702.2, "text": "oh das kann ich das ist mir zu kompliziert lachmar tun also lach eher wie lachen wie"}, {"id": 1028, "start": 6702.2, "end": 6705.04, "text": "dem auch sei eigentlich geht es mir nicht so sehr darum dass ich es richtig ausspreche"}, {"id": 1029, "start": 6705.04, "end": 6713.36, "text": "sondern dass es schmeckt da haben die hier zu bieten auch wieder mit dünnerfleisch oder"}, {"id": 1030, "start": 6713.36, "end": 6722.08, "text": "mit käse und dünnerfleisch vielleicht auch noch mal auch nicht schlecht mal wieder ein"}, {"id": 1031, "start": 6722.08, "end": 6734.28, "text": "iran habe ich noch da iran muss ich nicht mit bestellen"}, {"id": 1032, "start": 6734.28, "end": 6739.44, "text": "ich habe das problem bei iran ich habe mich da mittlerweile so dran gewöhnt dass ich nicht"}, {"id": 1033, "start": 6739.44, "end": 6745.0, "text": "mal merke wie salzig das ist und ich den eindruck habe ich trinke quasi yoghurt übertrieben"}, {"id": 1034, "start": 6745.0, "end": 6750.2, "text": "gesagt das heißt mir schmecken jetzt die irans die so extrem salzig sind am besten"}, {"id": 1035, "start": 6750.2, "end": 6754.32, "text": "weil ich das normale salzige nicht mehr als salzig empfinde das wahrscheinlich habe ich"}, {"id": 1036, "start": 6754.32, "end": 6760.88, "text": "zu viel getrunken von ist das beste was gibt ja vielleicht bestelle ich mir echt echt"}, {"id": 1037, "start": 6760.88, "end": 6767.04, "text": "hier so ein aber einer aber da ist nicht viel dran oder ich meine ich glaube nicht dass"}, {"id": 1038, "start": 6767.04, "end": 6786.36, "text": "ich da von einem satt werde das wird gefüllt und gerollt ja gut wenn"}, {"id": 1039, "start": 6786.36, "end": 6795.72, "text": "ich mir mit dünnerfleisch bestelle dann ist ja schon gefüllt na ja das ist doch das ist"}, {"id": 1040, "start": 6795.72, "end": 6808.08, "text": "doch ordentliche portion so was ist doch eine ganz gute portion aber dünner also am liebsten"}, {"id": 1041, "start": 6808.08, "end": 6811.0, "text": "er sich bei dem eigentlich bestellen wieder den dünner teller da weiß ich wie viel das"}, {"id": 1042, "start": 6811.0, "end": 6818.16, "text": "ist dünner teller ist bei dem richtig gut das ist eine riesen box alter es ist eine riesen"}, {"id": 1043, "start": 6818.16, "end": 6824.04, "text": "box nee so sieht das so ungefähr sieht das sieht das bei denen aus das ist eine riesen"}, {"id": 1044, "start": 6824.04, "end": 6829.6, "text": "box er sieht sieht bloß dass bei dem der salat nur so eine kleine so eine kleine box kriegt"}, {"id": 1045, "start": 6829.6, "end": 6833.36, "text": "und der rest ist reis und dünnerfleisch oder pommes frites und und dünnerfleisch und was"}, {"id": 1046, "start": 6833.36, "end": 6844.24, "text": "ich soße das ist richtig für den für den richtig echten kokona style super dünner"}, {"id": 1047, "start": 6844.24, "end": 6852.16, "text": "teller ah guck mal halb der hälfte und so viel grün wer braucht grün reis dünnerfleisch"}, {"id": 1048, "start": 6852.16, "end": 6857.8, "text": "reicht mir oder pommes frites eins von beiden ich bin mir noch nicht sicher was ich dabei"}, {"id": 1049, "start": 6857.8, "end": 6879.28, "text": "nehme ich esse beides gern pommes frites ja dann kokona soll ich bestell ich bestell"}, {"id": 1050, "start": 6879.28, "end": 6890.12, "text": "mal nebenbei chat ich bestell mal kurz nebenbei so hast du was vor mit den keksen zu machen"}, {"id": 1051, "start": 6890.12, "end": 6895.12, "text": "du kannst damit chatnachrichten hervorheben und und dinger machen das ist die standardsache"}, {"id": 1052, "start": 6895.12, "end": 6904.64, "text": "die in twitch halt drinne ist ok ich bestell mir dünner teller dünner teller teller dünner"}, {"id": 1053, "start": 6904.64, "end": 6911.16, "text": "teller und heute mit das mal gucken ich habe zur auswahl mit joghurtsoße mit knoblauchsoße"}, {"id": 1054, "start": 6911.16, "end": 6923.08, "text": "mit scharfer knoblauchsoße ich würde sagen mit scharfer knoblauchsoße beilage mit pommes"}, {"id": 1055, "start": 6923.08, "end": 6928.08, "text": "frites mit reis ohne beilage nach ohne beilage ist blöd weil der koste auch nicht weniger"}, {"id": 1056, "start": 6928.08, "end": 6936.52, "text": "mit reis mit pommes frites mit reis mit pommes frites mit pommes frites mehr kokona"}, {"id": 1057, "start": 6936.52, "end": 6949.08, "text": "ups jetzt habe ich die seite zugemacht nicht gut dünner dünner reispommes excellent knoblauchsoße"}, {"id": 1058, "start": 6949.08, "end": 6956.8, "text": "scharf mit pommes frites 8 euro ok oh Mist ich darf das ja nicht mehr bei leferando bestellen"}, {"id": 1059, "start": 6956.8, "end": 6966.96, "text": "warum ist das immer so kompliziert bestellen taxe hier oder über leferando ist nämlich"}, {"id": 1060, "start": 6966.96, "end": 6972.92, "text": "der mindest bestellwert zu hoch die wenn ich das allerdings direkt über die webseite vom"}, {"id": 1061, "start": 6972.92, "end": 6980.32, "text": "shop bestelle vom vom dünnerladen bestelle dann ist es lustigerweise billiger aber wahrscheinlich"}, {"id": 1062, "start": 6980.32, "end": 6994.08, "text": "weil er halt die gebühren sonst abdrücken muss an leferando ok dünner teller da ist"}, {"id": 1063, "start": 6994.08, "end": 7004.56, "text": "es zack noch mal ich glaube ich muss echt gucken dass hier nichts leake der chat chat"}, {"id": 1064, "start": 7004.56, "end": 7016.32, "text": "wartet schon darauf dass wieder geliegt wird knoblauchsoße scharf einmal pommes frites"}, {"id": 1065, "start": 7016.32, "end": 7036.72, "text": "bestätigen jetzt bestellen jawoll excellent zur kasse geben sie eine telefonnummer an"}, {"id": 1066, "start": 7036.72, "end": 7058.36, "text": "ok telefonnummer zur kasse jawoll paypal excellent paypal"}, {"id": 1067, "start": 6059.66, "end": 7079.84, "text": "jawoll zack check out keine handynummer hinterlegen nervt jetzt nicht rum"}, {"id": 1068, "start": 7079.84, "end": 7093.84, "text": "paypal 9,17 us dollar warum rechnet paypal meine bestellung in us dollar um"}, {"id": 1069, "start": 7093.84, "end": 7099.84, "text": "den dank für ihre bestellung ihre bestellung war erfolgreich ihre bestellung wird in ungefähr"}, {"id": 1070, "start": 7099.84, "end": 7112.24, "text": "30 minuten geliefert sehr gut also leute halbe stunde zeit haben wir noch coconut clap ja"}, {"id": 1071, "start": 7112.24, "end": 7123.88, "text": "kann ich überhaupt coconut clap machen fast ich habe kein bild ok ja was machen wir jetzt"}, {"id": 1072, "start": 7123.88, "end": 7129.52, "text": "noch eine halbe stunde ne ich esse nicht im stream vor allem den dünner teller kann"}, {"id": 1073, "start": 7129.52, "end": 7156.12, "text": "ich im stream essen warte mal ganz kurz"}, {"id": 1074, "start": 7156.12, "end": 7165.44, "text": "wir müssen jetzt nur darauf achten ob es klingelt im hintergrund leute kannst du bitte"}, {"id": 1075, "start": 7165.44, "end": 7171.24, "text": "pulse 180 am trifft reich auf oh nee oder ich glaube das ist nicht das richtige für"}, {"id": 1076, "start": 7171.24, "end": 7180.56, "text": "mich so was anzugucken da soll lieber unge drauf reaktion oder so wie würdest du in"}, {"id": 1077, "start": 7180.56, "end": 7186.32, "text": "c sharp zwei ordner aber wir können auch mal gucken was es für fragen gibt genau wie würdest"}, {"id": 1078, "start": 7186.32, "end": 7191.68, "text": "du in c sharp zwei ordner mit unterverzeichnissen vergleichen also welche dateien gelöscht"}, {"id": 1079, "start": 7191.68, "end": 7198.0, "text": "oder hinzugefügt worden willst du einfach nur wissen ob die ordner gleich sind der inhalt"}, {"id": 1080, "start": 7198.0, "end": 7209.08, "text": "gleich ist oder willst du willst du einen diff quasi also wenn du und wie detailliert"}, {"id": 1081, "start": 7209.08, "end": 7213.6, "text": "soll der diff sein also wenn du wenn du nur wissen willst welche dateien unterschiedlich"}, {"id": 1082, "start": 7213.6, "end": 7223.0, "text": "sind würde ich das mit irgendwelchen c sharp hat doch hat doch set types oder sets"}, {"id": 1083, "start": 7223.0, "end": 7246.12, "text": "set genau warum sieht die seite so abartig aus"}, {"id": 1084, "start": 7246.12, "end": 7254.72, "text": "okay dann würde ich das wahrscheinlich damit machen irgendwie also ich würde ich würde"}, {"id": 1085, "start": 7254.72, "end": 7259.92, "text": "eine liste ich würde mir eine liste generieren also nur mal nur mal so jetzt was was mir"}, {"id": 1086, "start": 7259.92, "end": 7263.64, "text": "so spontan einfällt ich würde mir also wenn ich selbst machen müsste als erstes würde"}, {"id": 1087, "start": 7263.64, "end": 7268.68, "text": "ich natürlich gucken gibt es nicht eine ordentliche library für diffs für c sharp gibt es garantiert"}, {"id": 1088, "start": 7268.68, "end": 7274.44, "text": "aber angenommen ich muss das von hand machen dann würde ich mir die verzeichnisse würde"}, {"id": 1089, "start": 7274.44, "end": 7280.2, "text": "ich mir die inhalt von den verzeichnissen auflisten jeweils einmal in einem also in"}, {"id": 1090, "start": 7280.2, "end": 7292.04, "text": "zwei hashsets speichern und dann gucken was schnittmenge ist und sowas genau contains"}, {"id": 1091, "start": 7292.04, "end": 7298.24, "text": "union overlaps also du machst jetzt du machst jetzt zwei mengen zwei hashsets mengen und"}, {"id": 1092, "start": 7298.24, "end": 7303.84, "text": "machst dann schnittmenge teilmenge was auch immer alles von und das müsste dann relativ"}, {"id": 1093, "start": 7303.84, "end": 7311.44, "text": "gut gehen rauszubekommen welche dateien fehlen auf der einen seite und welche mehr sind und"}, {"id": 1094, "start": 7311.44, "end": 7323.12, "text": "welche gleich sind das müsste mit zwei hashsets relativ easy funktionieren natürlich kannst"}, {"id": 1095, "start": 7323.12, "end": 7334.52, "text": "du das auch manuell machen einfach zwei schleifen machen du kannst auch du kannst auch dass"}, {"id": 1096, "start": 7334.52, "end": 7338.96, "text": "irgendwie die link queries machen und sagst dann contains any oder so aber ich finde mal"}, {"id": 1097, "start": 7338.96, "end": 7345.04, "text": "so prinzipiell dass das so mit zwei hashsets und die mit irgendwelchen mengen operationen"}, {"id": 1098, "start": 7345.04, "end": 7354.04, "text": "vergleichen klingt das erst mal am sinnigsten wie nimmst du mit dem odroid tv sendung auf"}, {"id": 1099, "start": 7354.04, "end": 7364.48, "text": "hiermit omg its mode das kommt drauf an was du dir da für einen typ bastelst den du in"}, {"id": 1100, "start": 7364.48, "end": 7369.32, "text": "die sets machst wenn es einfach nur das string vom filename ist dann natürlich nicht wenn"}, {"id": 1101, "start": 7369.32, "end": 7380.64, "text": "es ein custom typ ist mit custom vergleich wie heißt das comparator compare linksbums"}, {"id": 1102, "start": 7380.64, "end": 7386.1, "text": "mit custom typ vergleich funktionen dann kannst du das auch mit einem eigenen typ machen wo"}, {"id": 1103, "start": 7386.1, "end": 7392.6, "text": "endungsdatum mime type und alles drin ist ach welcome to c-sharp nein das wollten wir uns"}, {"id": 1104, "start": 7392.6, "end": 7401.36, "text": "echt mal angucken genau also odroid nehme ich mit tv her darauf da ist tv her darauf"}, {"id": 1105, "start": 7401.36, "end": 7407.92, "text": "wir haben uns im stream zusammen den neuen neuen körner für das odroid ding kompiliert"}, {"id": 1106, "start": 7407.92, "end": 7417.96, "text": "wo meine tv tv karte unterstützt wurde und dann haben wir tv installiert und auf meinem"}, {"id": 1107, "start": 7417.96, "end": 7425.72, "text": "nvidia schild tv habe ich ein kodi drauf und das kodi hat dann die macht die verbindung"}, {"id": 1108, "start": 7425.72, "end": 7431.36, "text": "zum tv headend ich habe da auch seit einem jahr oder so nichts mehr dran gemacht und"}, {"id": 1109, "start": 7431.36, "end": 7450.68, "text": "es funktioniert einfach das ist immer gut so kannst du frag einen milliardär auf youtube"}, {"id": 1110, "start": 7450.68, "end": 7469.36, "text": "gucken kann ich machen allerdings nicht jetzt sondern das schreibe ich mir auf für aufwachen"}, {"id": 1111, "start": 7469.36, "end": 7478.92, "text": "videos für den aufwachen stream am sondag hast du schon das neue schild tv gesehen ja"}, {"id": 1112, "start": 7478.92, "end": 7485.88, "text": "sieht aus wie eine e-zigarette habe ich schon gesehen in der letzten halbzeit könnte man"}, {"id": 1113, "start": 7485.88, "end": 7495.72, "text": "gett repos pushen ich bin nicht eingeloggt auf github hier und das meme tool pushe ich"}, {"id": 1114, "start": 7495.72, "end": 7512.88, "text": "eh so nicht in der in der art und weise geiler war so ein stream gestern hast du geklagt hast"}, {"id": 1115, "start": 7512.88, "end": 7539.66, "text": "du kugeln was ist das darf ich das auf machen die seite ja go xlr"}, {"id": 1116, "start": 7539.66, "end": 7552.38, "text": "multiple usb audio device in winner so you can control your app volumes oh das ist gut"}, {"id": 1117, "start": 7552.38, "end": 7566.56, "text": "das ist gut oh das ist cool hey das ist echt cool"}, {"id": 1118, "start": 7566.56, "end": 7577.02, "text": "das gefällt mir das ist nice was kosten das ist auch auf deutsch"}, {"id": 1119, "start": 7577.02, "end": 7593.38, "text": "bei toman kannst du den kaufen perfekt nice das ist gut das gefällt mir richtig was kosten"}, {"id": 1120, "start": 7593.38, "end": 7607.46, "text": "das gefällt mir echt gibt es auch bei amazon"}, {"id": 1121, "start": 7607.46, "end": 7629.1, "text": "regular das ist der dicke ok das scheint sehr angesagt zu sein das gefällt mir echt gut das"}, {"id": 1122, "start": 7629.1, "end": 7634.7, "text": "ding das muss ich mir aufschreiben das wäre ich mir vielleicht wirklich zulegen könnte auch die"}, {"id": 1123, "start": 7634.7, "end": 7640.38, "text": "hälfte kosten ja könnte könnte schon könnten sie mir auch die könnten mir auch einfach ein"}, {"id": 1124, "start": 7640.38, "end": 7659.9, "text": "schenken easy aber finde es gefällt mir das hat was stimmt ja das muss ich echt noch pushen"}, {"id": 1125, "start": 7659.9, "end": 7683.02, "text": "bin ich hier auf github eingeloggt sein wie ist mein github password moment ich gucke mal"}, {"id": 1126, "start": 7683.02, "end": 7693.18, "text": "nach github"}, {"id": 1127, "start": 7693.18, "end": 7711.04, "text": "hier"}, {"id": 1128, "start": 7711.04, "end": 7738.68, "text": "Okay, das da, wollten wir pushen, Pusherino, gut, dann pushen wir das mal."}, {"id": 1129, "start": 7738.68, "end": 7747.92, "text": "Wo hatten wir das, Documents, Platform, IO, Projects, CACW, natürlich bester Name dafür."}, {"id": 1130, "start": 7747.92, "end": 7751.28, "text": "So, ich muss jetzt gucken, dass ich nicht alles adde."}, {"id": 1131, "start": 7751.28, "end": 7756.2, "text": "Secrets, Secrets adden wir schon mal nicht, ja."}, {"id": 1132, "start": 7756.2, "end": 7763.16, "text": "Geht, warum auch immer."}, {"id": 1133, "start": 7763.16, "end": 7767.88, "text": "Oh, ich kacke, wo habe ich das Secrets da drinnen committed."}, {"id": 1134, "start": 7767.88, "end": 7771.32, "text": "MonkaS, warum mache ich denn so was."}, {"id": 1135, "start": 7771.32, "end": 7775.84, "text": "Erstmal will das Git Repo löschen hier, weg damit."}, {"id": 1136, "start": 7775.84, "end": 7791.68, "text": "Okay, get in it."}, {"id": 1137, "start": 7791.68, "end": 7800.28, "text": "Okay, ich lösche das jetzt einfach mal."}, {"id": 1138, "start": 7800.28, "end": 7815.36, "text": "Oder wir machen Git Ignore, Git Ignore, oh jetzt wird's advanced, Leute, Source, oh nee,"}, {"id": 1139, "start": 7815.36, "end": 7820.2, "text": "nee, nee, nee, nee, Leute, das ist mir zu riesig, zu risikoreich, Source, Secrets, ich"}, {"id": 1140, "start": 7820.2, "end": 7826.48, "text": "glaube in den Secrets steht überhaupt nichts drinnen, was es noch gibt, ne."}, {"id": 1141, "start": 7826.48, "end": 7849.64, "text": "So, also, Git Ignore, ja, perfekt, Source, Secret soll auch Ignored werden."}, {"id": 1142, "start": 7849.64, "end": 7860.92, "text": "Git Status, okay, Git Add, alles, nee, VS Code soll auch Ignored werden, alles, komplett"}, {"id": 1143, "start": 7860.92, "end": 7873.2, "text": "VS Code soll Ignored werden, alles, okay, Source Test, okay, das ist in Ordnung, das"}, {"id": 1144, "start": 7873.2, "end": 7887.32, "text": "wird alles rein, Git Add, Git, Git Status, okay, es ist kein Secrets drinnen, exellent,"}, {"id": 1145, "start": 7887.32, "end": 7893.52, "text": "es hat schon mal funktioniert, aber Include soll er eigentlich auch nicht reinmachen,"}, {"id": 1146, "start": 7893.52, "end": 7894.52, "text": "oder?"}, {"id": 1147, "start": 7894.52, "end": 7898.28, "text": "Ach, was auch immer, ich mache das Projekt gerade noch mal auf."}, {"id": 1148, "start": 7898.28, "end": 7914.44, "text": "Ist das überhaupt das, was wir haben wollten, ja, ja, ne, Update, ja, ja, geh mal weg, ja,"}, {"id": 1149, "start": 7914.44, "end": 7919.68, "text": "ich push einfach mal so, wie es ist, könnt ihr euch raussuchen, ich glaube das hier,"}, {"id": 1150, "start": 7919.68, "end": 7924.32, "text": "ich glaube der Admin Server war das, war das Wichtige, okay, Secrets ist Ignored, das ist"}, {"id": 1151, "start": 7924.32, "end": 7936.12, "text": "schon mal sehr poggers, okay, dann, Git Status, dann brauchen wir die Repo hier, SSH können"}, {"id": 1152, "start": 7936.12, "end": 7943.76, "text": "wir in dem Fall glaube ich gar nicht verwenden, Git Commit, Init, habe ich überhaupt meinen"}, {"id": 1153, "start": 7943.76, "end": 7949.96, "text": "richtigen Account hier eingestellt, nein, Max at Localhost, exellent, beste, Git Remote"}, {"id": 1154, "start": 7949.96, "end": 7967.64, "text": "at Origin, das da, Git Remote, okay, Git Push Origin Master, Username Wublords at gmx.de"}, {"id": 1155, "start": 7967.64, "end": 7970.88, "text": "und wie war mein Passwort noch mal, das weiß ich doch jetzt aus dem Kopfnummer, muss ich"}, {"id": 1156, "start": 7970.88, "end": 7996.52, "text": "noch mal nachgucken, Chat, hier, Leak, Leak Potentials, ähm, ja, ja, ja, ja, ja, ja,"}, {"id": 1157, "start": 7996.52, "end": 8014.02, "text": "was, achso, ja ist gut, weil wir da schon ein Readme gemacht haben, ja, wir überbügeln"}, {"id": 1158, "start": 8014.02, "end": 8030.82, "text": "So, ist gepusht."}, {"id": 1159, "start": 8030.82, "end": 8038.22, "text": "Na, dafür habe ich noch keine authorized keys, ich bin ja auch hier gerade eingeloggt"}, {"id": 1160, "start": 8038.22, "end": 8049.26, "text": "als max and local host. So, da ist es. Also, wer es haben wollte hat es jetzt."}, {"id": 1161, "start": 8049.26, "end": 8060.02, "text": "Ja, test gibt es nix, source ist auch die secrets nicht drinne."}, {"id": 1162, "start": 8060.02, "end": 8073.22, "text": "So, hier habt ihr alles, genau. Die IP-Config, hier ist der ganze Kram für,"}, {"id": 1163, "start": 8073.22, "end": 8078.42, "text": "das müsst ihr natürlich anpassen, dann wer es auch immer verwenden will."}, {"id": 1164, "start": 8078.42, "end": 8082.1, "text": "Also sprich der NTP-Server wird ja bei euch nicht so aussehen, aber hier oben ist ja alles"}, {"id": 1165, "start": 8082.1, "end": 8086.34, "text": "definiert. Hier kommt die Zeitzone rein, hier kommt der NTP-Server rein, hier kommt der Hausname für"}, {"id": 1166, "start": 8086.34, "end": 8091.5, "text": "den ESP rein, hier oben die IPs und alles. Hier unten müsst ihr eigentlich gar nichts mehr anpassen."}, {"id": 1167, "start": 8091.5, "end": 8096.18, "text": "Das funktioniert einfach alles. Gut, hier ist noch ein bisschen Logik drinne, wo ich weiter"}, {"id": 1168, "start": 8096.18, "end": 8099.5, "text": "gebastelt habe im Stream, das könnt ihr rausschmeißen. Also sprich die Logik hier"}, {"id": 1169, "start": 8099.5, "end": 8104.46, "text": "irgendwie für Klingelsensor und sowas. Das eigentlich Wichtige für das Update über HTTPS"}, {"id": 1170, "start": 8104.46, "end": 8110.62, "text": "ist hier drinne. Gibt es hier diese Admin-Server-Klasse? Ne, der Namespace-Admin-Server,"}, {"id": 1171, "start": 8110.62, "end": 8117.94, "text": "das ist absolut eklig, das C++. Also absolut nicht, wie sagt man hier, C++ wie man es machen sollte,"}, {"id": 1172, "start": 8117.94, "end": 8127.62, "text": "aber C++ wie man es machen sollte ist ja auch kacke. So und hier ist alles drin. Also genau,"}, {"id": 1173, "start": 8127.62, "end": 8135.06, "text": "jetzt könnt ihr euch angucken. Und der macht beim Start auch ein Self-Signed-Certificate,"}, {"id": 1174, "start": 8135.06, "end": 8142.74, "text": "dann das funktioniert. Genau, Update ist hier IP vom ESP, unter diese url-update kann man neue"}, {"id": 1175, "start": 8142.74, "end": 8147.02, "text": "Firmware hochladen. Hier kriegt man irgendwelche Statistiksachen, glaube ich, zurückgeliefert,"}, {"id": 1176, "start": 8147.02, "end": 8153.34, "text": "wie Zeit und Firmwaregröße und sowas. Und hier kann man das Ding neu starten. Wenn ihr Basic"}, {"id": 1177, "start": 8153.34, "end": 8158.54, "text": "Auth braucht, kann ja auch sein, müsst ihr selbst einbauen oder vielleicht mache ich das noch mal"}, {"id": 1178, "start": 8158.54, "end": 8167.24, "text": "in dem Stream Basic Auth einbauen. Ja und was ich mal echt machen muss ist, ich glaube"}, {"id": 1179, "start": 8167.24, "end": 8174.78, "text": "Two-Factor-Authentifizierung auf GitHub mal anschalten. Falls ich mal hier echt mal irgendwann"}, {"id": 1180, "start": 8174.78, "end": 8194.82, "text": "mein Passwort leake, das wäre ziemlich doof. Ich komm grad, wo macht man das überhaupt? Wo"}, {"id": 1181, "start": 8194.82, "end": 8218.54, "text": "macht man Two-Factor-Authentifizierung an in GitHub? Your Profile, Settings hier, Security,"}, {"id": 1182, "start": 8218.54, "end": 8239.42, "text": "Account. Okay. Ich hab keine Ahnung, wie man Two-Factor-Authentifizierung anmacht. Security Log,"}, {"id": 1183, "start": 8239.42, "end": 8249.46, "text": "ah hier Two-Factor, Enable Two-Factor Authentication. Okay, mach ich später, wenn ich fertig bin mit dem Stream."}, {"id": 1184, "start": 8249.46, "end": 8273.9, "text": "Hab ich. So, sehr gut. Ich würd sagen, jetzt kommt, es hat geklingelt, wirklich."}, {"id": 1185, "start": 8273.9, "end": 8300.38, "text": "Der Chat wieder. So ist es."}, {"id": 1186, "start": 8300.38, "end": 8316.18, "text": "Gut, also, Kram ist gepusht auf GitHub, da."}, {"id": 1187, "start": 8316.18, "end": 8337.78, "text": "Da."}, {"id": 1188, "start": 8337.78, "end": 8352.34, "text": "Sehr gut, sehr gut. Okay, ähm. Ups, ich, ich sign mich mal wieder out."}, {"id": 1189, "start": 8352.34, "end": 8372.06, "text": "Ja hab ich doch. Da, genau dafür, genau dafür ist das Projekt doch da. Hier, dafür sind"}, {"id": 1190, "start": 8372.06, "end": 8379.54, "text": "auch die Fotos da, die ich hier habe. Ähm, das ist, das ist die, das ist die Gegensprechanlage"}, {"id": 1191, "start": 8379.54, "end": 8385.86, "text": "vom Telefon, äh, vom, von, äh, die Türgegensprechanlage. Und so sieht die von hinten aus. Und das"}, {"id": 1192, "start": 8385.86, "end": 8395.98, "text": "ist, äh, der kleine Mini-ESP32, der da drinnen hängt. Und guckt, ob es geklingelt hat. Ja,"}, {"id": 1193, "start": 8395.98, "end": 8404.22, "text": "weil der noch nicht dran ist. Das geht grad nicht. Der liegt noch hier neben mir. Der"}, {"id": 1194, "start": 8404.22, "end": 8422.98, "text": "ist noch nicht drinnen. Wann hab ich ein Essen bestellt, Leute?"}, {"id": 1195, "start": 8422.98, "end": 8437.98, "text": "Wann hatte ich ein Essen bestellt? Kurz nach 13 Uhr, ne? So 13.10 Uhr in dem Dreh."}, {"id": 1196, "start": 8437.98, "end": 8455.46, "text": "Ich guck grad mal in meine E-Mails. Oh, es hat geklingelt. Hab das gehört. Es hat geklingelt."}, {"id": 1197, "start": 7460.92, "end": 8497.46, "text": "ne? So, Chat. Ich geh jetzt essen."}, {"id": 1198, "start": 8497.46, "end": 8505.66, "text": "Ich geh jetzt futtern. Wir sehen uns im nächsten Stream. Hat ja heute ausnahmsweise mal echt"}, {"id": 1199, "start": 8505.66, "end": 8514.86, "text": "gut funktioniert. Alles geklappt. Wir waren ziemlich, ziemlich, äh, wenig sidetracked"}, {"id": 1200, "start": 8514.86, "end": 8519.14, "text": "worden heute. Und ich geh jetzt was essen. Also wir sehen uns im nächsten Stream. Bis"}, {"id": 1201, "start": 8519.14, "end": 8531.66, "text": "dann. Heute Wars on vielleicht. Mal schauen. Bis dann, CO. Alles gut."}]}