{"text": "soleute kleiner stream aus der reihe bis zum mittagessen also ungefähr eine stunde oderso ich muss mal übrigens die bitrate hoch stellen weil sonst sieht battlefield 3 richtig kacke ausdas ganze mit macht excellent schein machen die das mit also mal schauen wie das gleich ausschautpoggers hütsch vielleicht noch ein bisschen hoch so gebe ich mir einen 64 mann server odergebe ich mir erst mal 32 mann server ich gebe mir mal 64 mann server scheiß drauf easy das wirdeh grausam 64 mann ist immer asu monkaS nicht sagen massive monkaS was q fuck 5 mann q wasmit den losser dann machen wir eine runde demawentpeak auch ok oder demawentpeak geht immer hallo leutemoin also ich bin bis 13 Uhr ungefähr an so soll ich eine runde battlefield spielen nachdemich die letzten wochen quasi fast nur warzone gespielt habe und festgestellt habe das warzonedas game auch nicht wirklich besser macht sondern nur halbwegs erträglich muss ich mal all schoolbattlefields wobei so all school ist es jetzt ja nicht ist jetzt kein battlefield 1942 oder soaus bis sie lauter leute ich glaube ist viel zu laut ne viel zu laut viel zu lau noch ein bisschenda ist er immer noch ein bisschen laut oder auch kann das sein dass man das game gar nichtsieht moment das game sieht man nicht da muss ich erst mal video fullscreen off back jetztjetzt sieht man was ne sieht man was leute doch jetzt sieht man was exzellentjetzt sieht man wieder nix jetzt sieht man wieder was ok das kann sich nicht so ganzentscheiden aber was auch immer ihr müsst mal sagen lautstärke bis sie laut oder vermute ichmal geht zu laut ja denke ich auch glaube auch dass zu laut ist leiser und nintendo musik mussmal kurz aus was hier los adi die stellzten auf dem dach rum dach stellzer watt wett für 6 alterhuge suppression ist glaube ich immer noch ein ticken lauter wir sind wahrscheinlicheine runde reingejohnt wo wir gnadenlos auf den sack kriegen ja guter start jetzt mussdie lautstärke halbwegs gehen denke ich sehen wir gleich erst erst mal die runde hier beendenweil fail direkt squad amok haben wir gebrauchen das ding kann man eigentlich also wenn manein halbwegs gutes quad hat na kann man diese base nicht verlieren also es sei denn die gegner sindhalt extrem viel besser was sie wahrscheinlich in dem fall sind aber diese base ist so extremschwer einzunehmen das kamer kann man gar nicht verlieren aber ihr werdet wohl aberwerdet gleich sehen wie man es doch verlieren kann spielst du leider aktuell schon ja so jetztkönnen die gegner durch jetzt stellst du uns mal hier lang der beste spot das beste spot zubringen ist hier immer so bei euch hier beste bester spot excellent spot da kann man nämlichdie leute hier aus der tür rausguckt und vorne weg bashen wenn denn was kommt aber legen wirschon an einem mini pack hin na erst mal erst mal schön abcampen das ganze istwie das das war doch gegner fack warumauf fack da ist einer kleiner umgekippt was warum steht er auch mit so einem komischenzum komischen auto darum camp fpsa das ist rush defender was willst du machenrush defender was da machst du nix vielleicht gehen wir mal also ich hab das gefühl unsereleute haben es nicht so so wirklich mit die fänden jolo okay hat funktioniert noch malschon dreieckig die sandsäcke ich komme gerade vom sport ich weiß es klaut mir keiner aber ichhabe gerade eineinhalb stunden in anführungsstrichen fitness gemacht sport keck w ich weiß eigentlichkeck weight die haben kein bock zu sterben der panzer ich glaube ich sollte engineer ichglaube ich soll engineer rein join der panzer steht glaube hinter uns und best uns reinoder vorne ist ja mal davon ist ja monka korona guck mal ich glaube es nicht auchleute der panzer unser panzer panz man steht davor jetzt wird es echt schwierigfack hätte funktionieren kann was ist beliebt denn 2020 battlefield 4 auf jeden fall battlefield 4auf jeden fall battlefield 4 haben wir diffused okay sehr gut sehr gut also die base kann maneigentlich nicht verlieren wenn man das halbwegs sinnvoll spielt wir wissen ja wie das dass esnicht so einfach ist ok hier ist schlecht das panz man ok die sind die sind ganz geil auf linksdie sind die sind ganz ganz scharf hier auf die linke seite da war doch hier wo ist erin den kollegen so nicht so nicht guckt euch an ich kann es sich darüber retten die außenmich wenn ich darüber gehe der hat kein bock mehr meine sense ist komisch komisch eingestelltgerade ohne hinter uns hinter uns ich muss ja weg auto wir machen jetzt wir machen denhuge play leute massive massive play warum kommt dann ein perfekter panzeronly battlefield leute only battlefield zu geil zu geil so was gibt solche momenten kriegst dueinfach die gibts einfach nur battlefield ich habe sie gar nicht mehr so viel muni ich hoffeich hoffe das schneiber tut da oben trifft mich nicht sonst habe ich echt ein problemok ich dachte die base kann man kaum verlieren was richtig macht man kanneine muni brauchen camp fps am start leute oder der panzer also hier ist optimale optimalepose den holen wir jetzt also ich bin ja nicht ganz selbstlos rübergegangen sondern ja kollegeso nicht hier wirds aber ganz schön voll jetzt gerade hier ist bester spot hier istecht bester spot auf der ganzen map wenn man reinkommt sag euch leute bester spot aufder ganzen map leider gibt es keine ordentlichen rush maps mehr in den in den nächsten battlefieldsauch in einem auto das auto fährt durch dass ich das ist schon mal schlecht wenn keinermehr hinten ist wir sind ausgestiegen der ist hier durch der ist hier rein ok wir wartenjetzt einfach mal bis die gegner angestellts kommen ok den holen wir nein nein nein neinlass mich lass mich in ruhe weg weg wir machen jetzt stellts stellts rangestellts da untenhitten die mich nie da unten hitten die mich nie was die haben gelegt wie haben die dasgemacht wie sind die überhaupt durchgekommen ok ich muss weg weil die kommen gleich vonvorne das ist ja leute ich sag es euch die waren schon an der linken seite am start wirkönnen hier nicht weg und wenn da einer rauskommt alter lasst euch doch mal blicken oh shit okhab ich mal einer geflankt keiner diffuse pepe hans ja mehr als leute killen kann ich nichtob wir das squad wechseln nicht das squad die sind die sind eigentlich ganz ok kommmal her letzten mal mal an 490 ich spiele jetzt erstmal das womit ich klarkommen weilich das gelb kaum gespielt habe und mit dem 416 habe ich auf jeden fall am meisten überok wir müssen rüber wir müssen rüber ich versuche den kram mal zu diffusen ah shitda kommt es dann richtig ran zum diffusen hat keine bock aber b ist sau schwer einzunehmenja eigentlich man kann das eigentlich kaum verlieren wo sind wo sind der dude what thefuck wo ist der denn ich blick nicht durch wo sind wir dann ah moment wir sind wir sindbei uns im spawn die kommen jetzt auch von rechts klein können ich werden die sind immerja die sind immer team feed ja aber massive team feed wir sind ja auch an der letztenwir sind ja quasi an dieser base erst reingejointed vergiss es wir kriegen grad hardcore auf densack und da steht der panzer vielleicht können mit unserem panzer ein bisschen ok ich probiersich probiers leute ich probiers jolo ich probiers ah shit die stehen links dahinter spawn trapna auf dem event peak nicht so sehr auf dem event peak ist spawn trap nicht so extremdenn hier los alter wir stellten uns mal da um die eck er weiß es er weiß es kommtmit der pistole rum rex beste beste waffe wie lange man kann bettel viel dreimal langemit den meisten zuschauen weltweit ja ist ja auch kein kunst kommen machen wir denden big brain engineer machen wir mal ist hinter uns was ok ich habe dich mal wir habenwir haben die eigentlich schon gelegt mal dumme frage panzer du bist du gehst in diefalsche richtung naa mit dem ding panz panz mann was ist los jetzt hat er keinen bob mehrjetzt jetzt jetzt hat er jetzt hat er keine lust mehr hat es gedacht fack steig aus ichmach nix mehr wann spielst du bett company 2 ich hab die letzten tage mal bett company2 gespielt so jetzt erste runde mal richtig mit dabei hier ich hab letzten tage mal bettcompany 2 gespielt gibt es noch weiß ich auch mal das online sehen kann ich glaubenicht oder doch der surfer name trump versus putin versus merkel merkel versus mackroffversus johnson alles klar ja da habe ich jetzt öfters mal drauf gespielt rush noob welcomedas ist übrigens jebait noob welcome das stimmt überhaupt nicht das spiel plus zumgrößten halb gute leute desperados 3 nie habe ich mir nicht angeguckt so jetzt ersterichtige runde hier 6464 waren wir auf dem dem event pigoli server anscheinend anscheinendbeste eine der besten rush maps ja huge okay wir haben squad explosives in ist quad ammosquad cover ist total underrated gewesen so big brain big brain plays von anfang an bockauf squad klar warum nicht bist du attacker man konnte da nicht drüber hüpfen wir machenjetzt big brain play ich zeige aber battlefield please wo ging der weg hier noch mal hin mankonnte ja den übelsten big brain weglegen gehen als ohne big brain play excellentna ich sag doch big brain plays am start wir müssen von hinten gucken dass sie nichtrankommen sehe gegner big brain play leute ich sags euch massiveweggeschnetzelt hier wie warum stirbt er nicht es ist lebensoppressionwov achtung nein team mate please kill was boosted golf okay ich komme rüber aber abernur offene squad weil ansonsten ist kacke kann man richtig spawn squad golf join daist er der metal tat san excellent oh wir haben hier die huge huge posi aber wenn wirnur ein m com kriegen dann erinnert euch dran wer hat's wer hat's wer hat's geholt wer hat'sgeholt das m com ha ha ha der blöder blöder pilote da ist der ist richtig fail geflogenna ja auch fack ich wollte eigentlich minipack schmeißen da ist er monka monka monka monkas giga das game ist zu easy für max ja wenn man sich die stats anguckt eindeutig gucktmal da 2k 10 1 easy und sogar gerätzt hier poggers streckt mal deinen kopf raus alterich kann nicht raus leute ich kann hier nicht raus auf gar keinen fall kann ich hier rauswenn ich hier rausgehe bin ich dead dead as fack okay gehen wir rüber gehen wir rübergucken wo sie entschärfen wollen ich glaube die haben keinen bock zu zu diffusen hiergerade 2 easy 2 easy kriegen wir den heli noch mal raus patrick dankeschön für denzapp ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha haso wir machen jetzt nächste aber wir dürfen noch gar nicht ich will den heli rausschießenbitte kipp heli heli heli heli heli komm her der mag nicht der heli wird geschrecktder heli mann dann hier noch dankeschön für den zapp der heli mann damit hat er damitnicht gerechnet ja ich bin mit sich kann sicher wo sie rumstelsen die guten hier den fallmüssen wir hier den den den flank push machen bring ich gehe normalerweise lieber rechtsrum weil rechts kann man in die base stelsen ohne dass es einer checkt lasst mich reinin die map gatschi bus gatschi bus au au au ich was hier los was ist hier los warumwarum schießt ihr denn auf mich ich finde das nicht fair dass sie dass die zurückschießenehrlich gesagt das gehört sich nicht das ich sage euch leute der heli mann der helimann will noch mal gehaunt werden von mir achte unten kommt gleich einer rum wenn mannicht ganz sicher von wurde wo sind sie denn gleich gleich wieder rechts einer am startsehe schon aber das müssten die eigentlich erwischen ich kann hier gerade nicht wegich will ja gar nicht so lange rumsitzen aber was willst du machen heli heli ich sag euchden heli mann wir kriegen den klein wieder der heli mann nein nein heli mann heli mannich dich rausschießen nicht du mich heli mann komm her oh ja ja ja ja heli mann ichsehe nix ich sehe nix ich muss weg ich hab hier ist mir zu monka s gerade ok ok ok wirmachen den retz train nice midi pack gucken dass rechts nix steht die stehen nämlichimmer ganz gerne auf dem berg au sag mal von wo kommen denn die ganzen nades hier geflogenja ist ja mal gut jetzt ok was auch immer hier gerade los ist alter da ist was dran skokmusics aber es fangen nicht wieder alle anzuspielen ok ich mache jetzt mal ein big brain flankaber die sehen mich wahrscheinlich aber probieren zwar wir probieren zwar big brain flank ichretz dich erstmal da oben nein nein nein nein nein nein nein nein nein nein nein du kannstdu siehst mich gar nicht du siehst mich gar nicht alter du siehst mich gar nicht du siehstmich gar nicht wo liegt der denn da das ist ja mal total am arsch der weltich höre irgendwo unter uns was ach shit kinder kommen jetzt schlecht durch das gamemit nem gescheiten netcode ja es ist teilweise schon ein bisschen fragwürdig wie man getroffenwird und trifft ja ok jolo jetzt jetzt jetzt jetzt jetzt jetzt jetzt achtsung ach shitoder der heli auch noch man kann nämlich richtig gut rechts in die base in die base reinich glaube es spielt jetzt jemand den heli der weiß was er macht das ist ziemlich doofok kann ich jetzt nein ich kann meinen flank immer noch nicht machen mit dem heli der heliist massiv massiv op jetzt haben wir hier die richtigen krassen movement leute am startauch guckt euch mal was ist mit den gegnern wieder los die haben nur drauf gewartet dassjemand das game streamt wahrscheinlich dass jetzt hier wieder mit dem halben klaren reinkönnen echt zwar irgendwas habs gesehen der heli mann ach so das den kann man damit janicht heilen hier ist ja nur nur nate gespamme ok wie kommen wir hier jetzt rein ich kommhier nämlich überhaupt nicht weiter also wir kommen hier kein meter vor ein bisschen smokevielleicht ich glaube ich nehme jetzt echt so ein heli raus also wenn wir den heli nichtrunterkriegen geht hier nix das ist doch nicht normal wir kommen kein meter vorwärts da machstdu nix wir nehmen die noob jetzt wird runter gestingert klar will der road killen hierok so wie ich das sehe komme ich echt nicht vorwärts gerade ja ist klar da ist zu weniggepusche der heli typ am anfang ein bisschen smoke wäre auch nicht verkehrt gibt ja leutedie treffen sowas ich hatte es aber schon mal also sobald man sobald man das game streamtkommen die mega krassen gegner direkt drauf als haben die nur drauf gewartet erste baseging und jetzt ist hier huge keine chanceecht zwar was links links links ich geier den jetzt mit irgendein stinger runter oderso aber das kannst du nicht machen der macht das der macht das clever der weiß halt auchwie man heli fliegt da kannst du eigentlich fast kannst eigentlich fast knicken am bestenwar eigentlich rechts rum zu gehen also ist noch zu weit weg hallo spotten gibt's nichtwird nicht gespottet kann man eigentlich auch die drohen habe ich schon nie ausprobiertob man die runter geiern kann den typ treffe ich mit der pg nichthallo lasst mich in ruhe ich muss den heli runter geiernbloß den heli runter geierne da kannst du eigentlich nix kurz schaltest dagegen machen der wartet auch wieder bisdu übrigens auch gegen den berg da machst du nix ne hast du keine chance also ja dasso muss das auch machen aber es krass sobald man das game anfängt zu streamen kommen dieultrakrassen gegner anstarten letztens hier off stream gespielt irgendwie 75 20 oder sonstwas und jetzt ist hier irgendwie übels tryhard mode angesagt die gegner team an level 100level 100 100 100 100 100abe wo ist die hexe was man braucht genau kannste kannst nichtsOh wir haben gelegt, Porgas!Wir haben gelegt, okay ich hoffe die drehen jetzt um und man kann rein.Okay, okay, okay, gucken wir mal.Okay, okay Achtung, huge play, warte jetzt ab, ich glaube, ich glaube das war der Weghier.Ich glaube das war der Weg, ich bin mir da nicht ganz sicher.Habt ihr den big brain flank gesehen Leute?Alter, wo gings denn hier nochmal rein?Oh shit, weggeschneiberte!Aber so geht das, ich hoffe die sind noch dran, wir haben spawn biegen, äh warum kannich nicht bei unserem mensch da vorne spawnen, gerry code, warum kann ich nicht bei gerrycode spawnen oder bei ihm hier, warum kann ich nicht bei ihm hier spawnen, was soll dasdenn, spawnschneiber gerry code, gerry code ist tot, gerry code, nein gerry code, vonsowas für seit und alles, ich glaube wir haben es gleich, ey haben wir es, huge, massive,weißt du, okay, gucken wo die dudes rum, rumhampeln, ahhh fast, aber wir haben auch viele tickets,also man hat es ja an der defense gesehen vorhin, ich glaube ich bin noch nie hier unten durchgelaufen wirklich, das habe ich, ich kenne gar nicht das gewölbe hier drunter, guckenwir mal, kann man da rein, lul, was ein glück, dass da gerade so ein typ noch rausgestelltkommt, hier midi pack, next, so jetzt haben wir helis, ich hole euch leute, ich hole euch,ich muss aber erstmal hoch, ach nee der ist auf den felsen gefallen, so beste, bestewech, links, rechts, wir gehen jetzt mal rechts, ganz rechts, oh wir sind ein bisschen früh,hier ist ein spawn beacon gewesen, hier sitzt einer auf dem berg, wie die wissen wieder,wo war der, ah hier, oder, aber der rechte flank ist meistens am besten, jetzt only inbattlefield, ja nachdem es in battlefield 3, nachdem es in battlefield 1 und 5 ja irgendwie6 mal so richtig geile moments gab, muss man halt auch mal wieder das olle ausbuddeln,aber wo sind die gegner, nichts zu sehen, war da vorne was, ich hole dich, da war nochmehr, da war noch mehr, exellent, von der seite kommt da was, schauen wir mal hier, ahder lebt, nee der lebt nicht mehr, was ist denn hier los, alter, ist ja gut, übertreibtsnicht, übertreibts, battlefield please, battlefield, battlefield lasst mich, battlefield, ich habihn gesehen. Nein, nein, nein, nein, nein, nein, nein, nein, nein. Ah, shit. Das istder Moment, Piek, ja. Brandenburg-Russ. Okay. Brandenburg-Russ. Der hat eine gute Posehier. Excellent. Hab noch mal nix. Okay, big brain, big brain play. Nein, nein, nein,nein, lass mich in Ruhe. Okay, alle weg anscheinend. What, what, what? Wo ist der? Okay, jetztkommt die schwerste Base, Leute. Das ist mit Abstand die schwerste Base, finde ich, aufder Map, die nächste. Also entweder kriegst du die schnell oder nur mit sehr viel Grind.Gibt auch keine richtig big brain Wege, die man hier nehmen kann. Guckt, ja, das war doof.Hätte ich gleich wieder weg. Noch, noch mal, noch mal. Ich komm da raus, ich komm da raus.Nee, ich komm nicht raus. Aber so viel ist da gar nicht drin. Mit dem Heli von hintenrein fliegen. Oh ja, das Heli von hinten rein ist tatsächlich huge. Sind wir schondurch? Gary Cote, Alter. Alter, Gary Cote. Gary, nein. Ich seh nix. Ich seh nix. Hierist nix zu sehen. Wir haben schon gearmt? Was ist hier los? Die nehmen Rush ja richtigernst. Big brain Rush. Oh, huge flank. Poggers flank. Äh, alles tot, kann das sein? Allestot? Lull. Guck mal, ob hier was herkommt. Ich seh nix, Panzman. Jetzt, nee, das wardie schwerste Base auf der ganzen Map. Wobei die letzte auch schwer sein kann, aber esgeht. Also das ist eigentlich die schwerste. Ja, ja, ist gut hier. Will ich abfackeln?Nicht abfackeln. Abfackeln, unerwünscht. Ok, auf geht's. Let's go, Panzer. Ok, jetztgegnerischer Panzer. Ich hab leider, ich bin leider kein Engineer. Das ist das Dove dabei.Äh, keinen Sinn. Ich kann leider nix machen, Panzer. Alter, Panzer, lass mich vor. Ah,jetzt, ich will mich jebaiten. You got jebaited. You got jebaited. Je, je, je, je, jebaited.Je, je, je, je, jebaited. Ok, die Gegner sind gar nicht doof. Normalerweise pushen die immerwie verrückt. Machen die nicht, was auf der Base auch tödlich ist, wenn das halbe Teamvorne Richtung spawn stirbt. Also die Gegner sind tatsächlich eher medium sized brain anstattslow brain. Aber big brain reicht's definitiv noch nicht. Äh. Ok, ich bin jetzt hier.What? Lull. Ok, ich weiß nicht wo Gegner sind, aber wir chargeen da jetzt einfach rein.Yolo. Hier ist was drin. Hier ist was drin gewesen. Oder auch nicht. Wow. Wir haben,wir packen das ja easy. Was ist hier los? Easy win. Soll das Robert Bowling darstellen?Er hat schon ein bisschen was, ne? Kann eigentlich Battlefield 3 borderless fullscreen? Weilsonst sieht man ja gar nicht die Emotes. Easy clap. GG. So. Ich überleg grad ob ich nichtden Server wechsle, weil. Nochmal Damavent Peak. Nochmal Damavent Peak muss nicht sein.Ich war doch auf dem Damavent Peak. Oder war ich auf dem Rush Classics? Ne, ich warauf Damavent Peak only, ne? Gucken wir mal. Ah ne, nochmal Damavent Peak muss nicht sein.Machen wir mal dicht. Und gehen hier mal auf. Rush Classics Sand Crossing. Exzellent. Wobeiich auch mal Bock hab auf 16 vs 16. Wir probieren mal 16 vs 16 aus. Das ist nicht ganz so chaotisch.Aber es ist Firestorm. Auf Firestorm hab ich eigentlich auch keinen Bock. Mal gucken wieweit die Runde ist. Exclusive Fullscreen ist auch deprecated. Was der totaler Schwachsinnist, weil das das beste ist, was du eigentlich machen kannst. Mit dieser ganze Windows-Windows-Managergeduldens rausgeschmissen. So, wie sind die Fender? An welcher Base? Ist das die letzte?Ne, das ist die erste. Ich bin verwirrt grade. Firestorm, das ist die erste Base, ne? Bythe way, unpopuläre Meinung. Unpopuläre Meinung, Firestorm suckt. Ich mag Firestormnicht. Kackmap. Der ist tot, hm? Was macht der da? Was machtder da oben? Ok, der Chat gibt mir recht. Oder auch nicht, geteilter Meinung der Chat.Ich mag Firestorm nicht. Ich glaub Firestorm ist gut für Leute, die das mögen mit Chatsrumzufliegen. Aber die Runde sollte gleich vorbei sein, wenn sie es jetzt nicht dochnoch irgendwie hinkriegen. Alles klar. Conquest-Map, ja Conquest. Da sitzt er auf dem Silo obendrauf.Nein, nein, nein Leute, nicht liegen, nicht liegen, please nicht liegen. Ich will, dassdie Runde vorbei ist. Ich hab keinen Bock auf Firestorm. Oh, da kommt links irgendwas,ne? What the fuck, was ist hier los? Ich hol den Pantsman. Ich glaub die sind... Wo kommtder her? Einfach mal random so, spawn. Wir retten einfach ein bisschen und gut ist. Waswillst du machen, ne? Hinten fährt der Pantsman rum. Irgendwo rechts liegt ein Schneiber,der Typ, der mich vorhin weggeschneibert hat. Wir überwachen jetzt einfach B und in 13Tickets ist die Map vorbei. Moment, da springt was runter. Hallo, game please. Sniper, Sniper.Wo ist er denn? Sniper. Woah, hab mich nicht gesehen. Da war ich, kein Komrade. Am bestenwaren die Sound-Samples, finde ich immer noch in Bad Company 2. Oh, oh, oh. Okay, ich bleibjetzt einfach hier liegen, easy. Das sind so Sachen, so geile Sachen, wo einfach malneben die Enchanted-Chat-Crasht, das gibt's echt nur in Battlefield. Huge BattlefieldMoments. Ey, was soll ich denn hier machen? Ah gut, easy win. Gut. Und jetzt, bless RNG.Kein Firestorm mehr. Ich will auch Firestorm als Attacker nicht spielen. Ich will was ordentliches.So, Sand-Crossing, Bazaar, Metro, Demo-Vent-Peak. Na, Demo-Vent-Peak hatten wir ja erst. Stehtdie Map nicht im Chat? Ja, man kann den Chat leider im Endscreen nicht mal aufmachen.Nose-Hair kommt jetzt. Nose-Hair ist auch eine absolut underrated Rush-Map. Nose-Hair. CaspianBorder gefällt mir auch nicht. Caspian Border und Firestorm. So die Maps, wo so die Battlefield-Veteranenzur damaligen Zeit gesagt haben, oh ja, die einzigen richtigen Battlefield-Maps mag ichnicht. Och na, komm, mach da. Chat hat mich gebaitet. Chat hat gesagt, es kommt ergeblichwas anderes. Hast du noch Kontakt zu Kaboom? Selten mal, ja. Mal gucken, ob ich noch Panzerfahren kann. Ich bezweifle es ja, dass ich noch Panzer fahren kann. Äh, Leute, wie hatman... Secondary? Ah ja, okay. Das wird jetzt echt Fail. Easy, easy. Unser Chat-Menschmacht das schon, denke ich. Ah, ah, ah. Bam! What? Okay, der hat Glück gehabt. Der hatecht Glück gehabt, dass er da durchgekommen ist. Huge Glück. Okay, ich kann Panzer fahrennicht mehr. Ich kann Panzer fahren nicht mehr. Guck mal, wie sehr ich verkacke. Sehtihr das? Wie krass ich am Verkacken bin. Habt ihr das gesehen? Jutschverkacksohr. Verkack-FPS.Das ist übrigens quasi nahezu instant death, wenn man hier drauf lang läuft. Aber irgendwieinteressiert es gerade keinen. Weiß ich auch nicht, warum die das nicht interessiert,dass ich jetzt lang gelaufen bin. Das Spiel sieht immer noch erstaunlich gut aus. Ja,das ist korrekt. Jut-jut-jut-jut-jup-baited. Jut-jut-jut-jut-jup-baited. Jut-jut-jut-jut-jup-baited.Oh, turn on hier. MonkaS. Wahnsinn. Manchmal läuft's, ne? Ich leg dir den Midi-Pack. Ah,du hast schon einen Midi-Pack. Jut-jut-jut-jut-jup-baited. Ah, gehst du weg da oben? Ah, Suppression,ne? MonkaS-Suppression. Ah, Scheiße von der Seite. Oh, ein Rätsel. Exzellent. Exzellent.Du wirst jetzt gar nicht so genau von wo. Kann ich dich rätseln? Nein, kann ich nicht.So, hier oben können sie mich nicht hitten, gescheit. Ich würd euch ja rätseln, ne?Aber ich komm hier hin. Aha, aha, aha. Och ma, da stehen sie rum, da stehen sie rum.Da stehen sie einfach rum, ganze Game, auf dem Dach. Oh, nice, was ist denn hier los?Oh, what? Crown, bist du aus dem Stream? Du warst ja auch im letzten Setzen-Server da,das ist ja nice. THX. Nicer Support. Ist nix zu meckern. Aha, so geht's nicht hier.Sterben, please. Sterben, please. Oh, oh, die, ne, die saß. Das war gut hier. Dassder die da von unten getroffen hat, ich hab grad das liegt. Moment, was? Bad luck? Bad,bad luck? Okay, Moment, an was bin ich genau gestorben? An, an was? Kann mir das jemanderklären? Nice, danke. Kann mir das irgendjemand erklären, woran ich grade gestorben bin?Gestolpert, ja. Ich glaub's auch. Monka, stolpert. Okay, wir müssen gucken, dass sie nicht diffusenkönnen. Ich, ich, ich, ich aim das jetzt hier einfach. Nein, nein, nein, nein. Ah, wir habendie Base. Exzellent. Manchmal versteht man die Battlefield-Logik nicht, ne? Okay. Nein,nein, nein, Panzer, Panzer, Panzer wegbleiben. Panzer, gehst du fort. War da oben was? Oh,der ist so low. Ein Hit noch, dann wär er down gewesen. Na, scheiß drauf, wir geheneinfach. Let's go. By the way, das ist normale Ticketanzahl. Nein, das ist normale Ticketanzahl.Was, der Panzer kann dich nicht sehen, wenn du dich nicht bewegst. Das ist so wie, sowie der T-Rex aus Jurassic Park, oder wie? Oh, der geht ab hier, Mauskrone. Oh, oh, oh.TKX. Okay, ich camp das jetzt hier mal ab. Na, ey, what? What? Das glaub ich jetzt nicht,dass es, dass es ein Jet war, der mich da drin aus der Mauer, ey, ist klar, ey, Alter,ey, ist klar, Leute, ist natürlich, natürlich. Streamsniper. Aber meine Teammates sind jaübelst big brain, also die gehen ja voll ab. Die sind huge. Okay, ich blicke hier nichtdurch, was hier passiert gerade. Ich möchte einfach nur, Battlefield, ich will einfachnur durchs Fenster springen. Kann ich dich retzen? Ich guck mal, ob ich den holen kann.Der ist draußen. Oh nein. Ah, Battlefield. Nein, der ist drin. Nein. Ich hab's versucht.Ich hab's versucht. Oh, da waren Gegner. Noch mehr Gegner. Okay, jetzt big brain flank.Huge, massive flank. What the? Ah, gibt's ja net. Sauerei. Hätte ich mich vielleichtvorher mal heilen sollen. Haben wir die, die Base haben wir auch schon. Mein Team ist,ist, also die sind ja, die sind ja Poggers. Poggers, Koggers, Zoggers, Alter. Die gehenja hier durch wie nix. Okay, let's go. Oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh,oh, oh, oh, oh, oh, oh, oh, oh, oh. Jetzt Pusherino. Oh, da kommt einfach mal, einfach mal Panzer.Ohohoho hemisphere fill the FacebookIst ich frage mich grade war es in battlefile 3 nicht auch so dass man schneller gelaufen ist wenn man den den dv2 introduces cool earnımote 4 dabei hatteAlles klarAlso in Bad Company 2 bin ich mir ziemlich sicher, dass man schneller gelaufen ist, wennman den Defi draus hatte.Mit Pistol, mit, in dem Game, ich bin mir nicht sicher ob mit Pistol, nee ich glaubdas machte keinen Unterschied.Aber ich glaub mit, mit Defi ist man ein Ticken schneller.Das bilde ich mir zumindest ein.Aber wie viele da oben sind?Links?Ah!Die holen wir jetzt, die werden jetzt geschreckt.Next, okay den holen wir, oh da war ein Gegner, haha Noob Gegner alter, oh, oh, oh, oh, ooooh!Was mit den Gegnern los, wollen die sich grad von mir erschrecken lassen oder was?Denken die sich, oh da Max der muss mich mal bashen, ich hab da schon seit 5 Jahren draufgewartet, dass der, dass der Max mich bashet, anders kann ich mir das grad nicht erklärenwas mit den Gegnern los ist.Ah, shit, shit, shit, shit, nice, Monka ist, das ist ja anstrengend grad, letzte Base,können sie es mal wieder voll wissen, oh Leute gleich gibt es Mittagessen, dann ist der Spaßschon wieder vorbei.Äh, alles klar Battlefield, alles klar, alles klar.So ein geiler Panz-Panz-Man wäre gut, so ein geiler Panz-Man-Fahrer, streck deinen Kopfraus, streck deinen Kopf raus, Kopf, please, Kopf, Kopf, okay, dann gehen wir mal.Wo, wo, wo, wo war der denn jetzt, ich hab nix gesehen, habt ihr den gesehen, wir habenalles gecheckt, jede Ecke aber nix da, war der ganz in der Ecke, kann das sein, dassder komplett, ganz, ganz in der Ecke war, oh ich kann da jetzt nicht hin, oh shit, okayich bleib liegen, ihr könnt bei mir spawnen Leute, wenn ihr wollt, Alter, Alter, ich kannda nicht vor, ich krieg auf den Sack, wenn ich da vorgehe, ich krieg huge auf den Sack,nein, lasst ihr mich in Ruhe, ihr Kackschneiber, Kackschneibers, geht ihr fort, das war unfair,ich hab den durch die Wand gesehen, Alter, jetzt geht er ab, jetzt geht er ab, vollePurle, volle Purle, ran, ran, ran, ran, ran, ran, ran, run lege henne, lege henne, du L embarrassed,nein ich wollt gerade um die Ecke, die werdenDe, die kriegen gerade echt auf den Sack.MonkaS hier, was ist hier los? Drei Spieler haben Gegner direkt vor einemWas ist mit den Gegnern los, Alter?Füße, Füße, ich seh Gegner Füße und ich seh PanzerEasy easy easy, man muss sagen ich hab auch ein saumäßig gutes Team, ne? Also GG, TeamsTeam, Teams, Teams mit Z. So eine Runde können wir vielleicht noch machen,danach muss ich essen, je nachdem was essen kommt. Döner-Pide-Lammer-JunNee, was erzähl ich für'n Schwachsinn, das hab ich gestern gegessen. Big Brain, Alter.Jetzt hab ich Frikadellen mit Kartoffeln gibt's heute. Wenn das Game schon deinHirn komplett kaputt macht. Döner-Pide-Lammer-Jun war gestern, heute ist Kartoffeln mitFrikadellen. Fünf Kopf, ja. Eigentlich schon, eigentlich schon sechs Kopf.Eigentlich ist das war das schon eher so. Übrigens, ich muss mal schauen, ich habnichts mitgekriegt im Chat, auch keine Subscri- Och nee, please, jetzt nicht so ne Kackmap nochhinten drauf. Ich weiß unpopuläre Meinung, ja. Ähm, ich glaub ich hab nixübersehen. Tribulan hat subscribt, acht Monate dankeschön.Exzellent. Schwellst du immer, essen oder kocht wer für dich, mal so, mal so. Mal so,mal so. Na gut, dann spielen wir jetzt halt nochmal ne Runde Caspian Border. Wie hieß das Ding aufdeutsch? War das Kaspische Grenze? Haben sie es so normal übersetzt? Einfach mal auf den Helisprayen, weil man hittet schon mal was. Moment, der Heli ist da hinten abgestiegen, die kommenhier klar um die Ecke. Nee, der ist gestorben. Der Heli ist gestorben. Oder sind die hier,ich seh nix. Da bin ich mir jetzt nicht so ganz sicher. Oh, da kommt ein Panzer und ein Auto.Oder auch nicht. Ah, Moment, wo... Oh, oh, oh, oh, oh, oh, ich war weg Gegner, ich war noch weg.Habe ich auch mal gesagt, dass ich die Map nicht mag?LullOh, oh, oh, oh, oh, oh, oh, oh, ich habe Schiss leiderMoment, dass ich da überhaupt was hitte, ich, ich spraye einfach random auf Gegner draufäh, nope, jop, den Rest kriege ich leider nicht mehr raus, jetzt kannste knickenPanzer, hoffentlich sprengt er nicht das Ding hier in die LuftHallo ich will dich markieren TankOkay, nein, ist nicht, ist nicht erlaubt, ich darf ihn nicht retzen, nicht mal Warzone,ja, ja, Warzone, ich hab die letzten Wochen Warzone gespielt und ich muss mal wiederwas spielen, wo ich normal, wo ich mich nicht über das Game aufrege.Oh, die sind an A, A, A, A, A und hinter uns auch, der Heli Mann, steht hier hinteneiner, nein, nein, bewegen, bewegen, bewegen, bewegen, bewegen, bewegen, oh, das war knappMonka S, aber, aber, richtig Monka Giga war das, Monka Giga Deluxe, der Heli Mann, derHeli Mann ist nervig, aber alle Heli-Mans sind nervig in Battlefield, also vor allem Heli-Mans,die wissen, Heli-Mans, die wissen was sie machen, Heli-Mans, okay, ich bleib jetzt einfachhier sitzen.Übrigens, Defender wird, äh, retzen total underrated, die sagen, ja, du hast ja endlichTickets zum Respawn, aber das war noch kein Battlefield, so, gerade als Defender bistdu darauf angewiesen, dass du am Objective bist, wenn was ist und nicht erst drei Kilometerlaufen musst, also auch wenn du keine Tickets hast, weil natürlich ist bei, ist als Attackerauch wichtig, dass man, dass man, what the hell ist hier los, ey, ich weiß nicht vonwo hier was ist, ich hab echt keinen Plan, aber mein Team macht das schon, Team ist gut,sagt man selten in Battlefield, ich weiß, oh nice, guckt mal, ich wäre sogar gerätzt,guckt euch das mal an, nein, ja aber leider nicht lang, elef77, weil gleich ist Essenda, da muss ich, muss ich auf, ich hätte ja gern noch mal eine Map gespielt, auf dieich Bock hab, ach, wir haben die Fused, exellent, und wir smokeen uns ein, auch gut, erstmalin, in, irgendwo, irgendwo in die Luft spotten und gucken, ob was abgeht, drüben geht auchnix, oh Jett, Jett, nix wie weg, ok mal gucken, ob wir die irgendwie geflankt kriegen, alter,was ist hier, übertreibt es halt, so Sachen hatte ich in Battlefield 1 und Battlefield5 nie, wo du so wirklich gedacht hast, was ist denn hier los, um nicht drum herum, ich,ich mache jetzt übrigens hier die, die, die runtergeier Deluxe Geschichte, ok oder auchnicht, runtergeiern Deluxe machen wir jetzt, erstmal verstecken bis er vorbei ist, jetztruntergeiern Deluxe, hallo, Flairs geht weg, das Ding hatte nicht so eine große Range ne,ich spiele selten, ich kenne die Range nicht, die Range nicht, hallo, hallo, jetzt, oh nee,jetzt hat er auch geflährt, oh, oh, oh, oh, bam, null, nein, nein, nein, nein, nein, nein,nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, ich magdie Map nicht, wir haben es verloren, ich glaube es nicht, Jett, Jett, Jett, Jett, Jett, Jett,ich bin gebadet, Maxi spielt dieses Game immer noch geil, du kannst nichts sagen, der wirdjetzt einfach klanlos runtergegeiert, ok, Game, alles klar, wenn es nicht trifft, dannLul, ha ha, oh, oh, oh, die Waffe macht keinen Damage.Ah, ich wollte mir, ich wollte mir das Medikit holen von dem ohne Wiederbeleben.Oh, das ist ein bisschen viel. Vielleicht sollte ich die Engineer-Geschichte doch sein lassenund das spielen, was ich kann. Und Bashen.Das ist die schlechte, ja die ist Kacke. Aber ich mag halt die MP5 an sich und deswegen,deswegen spiele ich die ganz gern, aber die sackt auch richtig. M4 beim Engineer ist beispielsweiseecht zu gebrauchen.Battlefield 3 Remake Gerüchte. Ich vermute ja wirklich, dass da was dran ist. Ich weißaber nicht, ob es wirklich ein Battlefield 3 wird, weil die müssen die Zeit überbrückenbis Battlefield 6. Den bleibt nichts anderes übrig. Die haben Battlefield 5 viel zu frühabgesägt, also viel früher als sie letztendlich vorhatten.Was ist denn das? Ah, die Drohnen-Stells. Viel früher als sie eigentlich vorhattenund dementsprechend. Was? What? Wie haben die das denn jetzt so schnell gekriegt?Konnte man das Haus kaputt machen, wo das Objective drin war? Das dachte, das ging nurin Bad Company 2. Oh, rechts war noch einer. Ob der Down ist da rechts? Hoffe ich mal.Anscheinend, ich kriege nichts gespottet. Deswegen glaube ich, die Chance, dass wireinen Remaster Battlefield kriegen Ende des Jahres, ist gar nicht mal so gering. Ist derDude auf dem Dach? What the fuck? Ich bin aber trotzdem der Meinung, Battlefield 3 brauchtkein Remaster. Ich meine, wozu braucht das Game ein Remaster? Ist doch alles da. Ichchecke nicht, wo die Gegner gerade sind. Das ist wirklich kein Big Brain Plays von denGegnern. Ich habe keine Ahnung, wo irgendwas abgeht. Geiler ist, die anderen sehen dienicht. Besserer Netcode. Ich mag das eigentlich, ich finde das eigentlich ganz gut. Du hasthalt das Problem manchmal, ja das stimmt schon, dass die Leute halt, was ist denn hier losda? Durchfliegen, ja, oder durch. Hinter uns, hinter uns, hinter uns. Nein, nein, nein, nein.Na fuck, ich hätte ihn fast erwischt. Fast hätte ich ihn gehabt noch. Habt ihr das gesehen?Ganz knappe Geschichte. Ja, Xbox stimmt, auf der Xbox kannst du natürlich nicht spielen.Die 360 Variante kannst du knicken. Habe ich schon mal gesagt, außer die letzten 20mal, in den letzten 5 Minuten, dass ich die Map nicht mag? Ich sag's nochmal, ich magkeineWir verpissen uns mal hier kurz.Oh ne, gemessert, da wird er gemessert.Ja das, wenn die nur den Singleplayer remastern, wäre das mal absolut Lowbrainer, richtig Lowbrainer.Ich glaub die sind schon am Start hier teilweise.Ja, im Teppichmesser.So wie sie es in MW2 gemacht haben, erstmal Singleplayer remastern.Wahrscheinlich weil es der geringste Aufwand war, keine Ahnung.Hab ich da grad Gegner gesehen auf der Map rechts außen?Kann das sein?Kann das sein, dass ich da Gegner sehe?Nein, nein, nein, nein, ach mann, warum, den hätte ich jetzt erwischen, der geht jetztlegen, der macht jetzt lege Henne.Oh, excellent, excellent, ok ich komm mit vor, das Sounds Master, das Saurus, das SaurusMaster, nicht das Saurus, Saurus.Truckus Saurus Rex, kennt das noch jemand aus der World Company 2 Kampagne, diesen MonsterTruck?Der Truckus, oh meine Güte ey, der Truckus Saurus Rex, ok Leute, die machen uns, diemachen uns platt, jetzt ist die Munition alle, jetzt ist die Munition alle, oh, oh, what,ok, alles klar, ja, Map, please, ich muss mal kurz gucken, ob das Essen fertig ist, binich gleich wieder am Start, so, Essen ist noch nicht am Start, ich muss mal kurz gucken,ob das Essen fertig ist, ich muss mal kurz schauen, ob das Essen fertig ist, ich musskurze sache die runden waren aber trotzdem cool auch wenn wir zwei mapsgespielt haben auf die ich überhaupt keinen bock hattefirestorm und claspion border die nervigsten maps überhaupt für michmal gucken vielleicht spielen wir nachher weiter bis denn cu machts gut", "segments": [{"id": 1, "start": 0.0, "end": 29.16, "text": "so"}, {"id": 2, "start": 29.16, "end": 35.64, "text": "leute kleiner stream aus der reihe bis zum mittagessen also ungefähr eine stunde oder"}, {"id": 3, "start": 35.64, "end": 42.04, "text": "so ich muss mal übrigens die bitrate hoch stellen weil sonst sieht battlefield 3 richtig kacke aus"}, {"id": 4, "start": 42.04, "end": 56.56, "text": "das ganze mit macht excellent schein machen die das mit also mal schauen wie das gleich ausschaut"}, {"id": 5, "start": 56.56, "end": 72.2, "text": "poggers hütsch vielleicht noch ein bisschen hoch so gebe ich mir einen 64 mann server oder"}, {"id": 6, "start": 72.2, "end": 80.96, "text": "gebe ich mir erst mal 32 mann server ich gebe mir mal 64 mann server scheiß drauf easy das wird"}, {"id": 7, "start": 80.96, "end": 100.28, "text": "eh grausam 64 mann ist immer asu monkaS nicht sagen massive monkaS was q fuck 5 mann q was"}, {"id": 8, "start": 100.28, "end": 111.12, "text": "mit den losser dann machen wir eine runde demawentpeak auch ok oder demawentpeak geht immer hallo leute"}, {"id": 9, "start": 111.12, "end": 119.16, "text": "moin also ich bin bis 13 Uhr ungefähr an so soll ich eine runde battlefield spielen nachdem"}, {"id": 10, "start": 119.16, "end": 124.28, "text": "ich die letzten wochen quasi fast nur warzone gespielt habe und festgestellt habe das warzone"}, {"id": 11, "start": 124.28, "end": 130.16, "text": "das game auch nicht wirklich besser macht sondern nur halbwegs erträglich muss ich mal all school"}, {"id": 12, "start": 130.16, "end": 134.12, "text": "battlefields wobei so all school ist es jetzt ja nicht ist jetzt kein battlefield 1942 oder so"}, {"id": 13, "start": 134.12, "end": 144.16, "text": "aus bis sie lauter leute ich glaube ist viel zu laut ne viel zu laut viel zu lau noch ein bisschen"}, {"id": 14, "start": 144.16, "end": 156.04, "text": "da ist er immer noch ein bisschen laut oder auch kann das sein dass man das game gar nicht"}, {"id": 15, "start": 156.04, "end": 164.4, "text": "sieht moment das game sieht man nicht da muss ich erst mal video fullscreen off back jetzt"}, {"id": 16, "start": 164.4, "end": 175.12, "text": "jetzt sieht man was ne sieht man was leute doch jetzt sieht man was exzellent"}, {"id": 17, "start": 175.12, "end": 182.76, "text": "jetzt sieht man wieder nix jetzt sieht man wieder was ok das kann sich nicht so ganz"}, {"id": 18, "start": 182.76, "end": 188.4, "text": "entscheiden aber was auch immer ihr müsst mal sagen lautstärke bis sie laut oder vermute ich"}, {"id": 19, "start": 188.4, "end": 203.76, "text": "mal geht zu laut ja denke ich auch glaube auch dass zu laut ist leiser und nintendo musik muss"}, {"id": 20, "start": 203.76, "end": 219.04, "text": "mal kurz aus was hier los adi die stellzten auf dem dach rum dach stellzer watt wett für 6 alter"}, {"id": 21, "start": 219.04, "end": 235.76, "text": "huge suppression ist glaube ich immer noch ein ticken lauter wir sind wahrscheinlich"}, {"id": 22, "start": 235.76, "end": 249.6, "text": "eine runde reingejohnt wo wir gnadenlos auf den sack kriegen ja guter start jetzt muss"}, {"id": 23, "start": 249.6, "end": 254.88, "text": "die lautstärke halbwegs gehen denke ich sehen wir gleich erst erst mal die runde hier beenden"}, {"id": 24, "start": 254.88, "end": 262.24, "text": "weil fail direkt squad amok haben wir gebrauchen das ding kann man eigentlich also wenn man"}, {"id": 25, "start": 262.24, "end": 269.12, "text": "ein halbwegs gutes quad hat na kann man diese base nicht verlieren also es sei denn die gegner sind"}, {"id": 26, "start": 269.12, "end": 274.2, "text": "halt extrem viel besser was sie wahrscheinlich in dem fall sind aber diese base ist so extrem"}, {"id": 27, "start": 274.2, "end": 281.92, "text": "schwer einzunehmen das kamer kann man gar nicht verlieren aber ihr werdet wohl aber"}, {"id": 28, "start": 281.92, "end": 288.84, "text": "werdet gleich sehen wie man es doch verlieren kann spielst du leider aktuell schon ja so jetzt"}, {"id": 29, "start": 288.84, "end": 302.0, "text": "können die gegner durch jetzt stellst du uns mal hier lang der beste spot das beste spot zu"}, {"id": 30, "start": 302.0, "end": 309.12, "text": "bringen ist hier immer so bei euch hier beste bester spot excellent spot da kann man nämlich"}, {"id": 31, "start": 309.12, "end": 315.32, "text": "die leute hier aus der tür rausguckt und vorne weg bashen wenn denn was kommt aber legen wir"}, {"id": 32, "start": 315.32, "end": 323.2, "text": "schon an einem mini pack hin na erst mal erst mal schön abcampen das ganze ist"}, {"id": 33, "start": 328.44, "end": 330.88, "text": "wie das das war doch gegner fack warum"}, {"id": 34, "start": 335.08, "end": 341.68, "text": "auf fack da ist einer kleiner umgekippt was warum steht er auch mit so einem komischen"}, {"id": 35, "start": 341.68, "end": 346.56, "text": "zum komischen auto darum camp fpsa das ist rush defender was willst du machen"}, {"id": 36, "start": 346.56, "end": 355.8, "text": "rush defender was da machst du nix vielleicht gehen wir mal also ich hab das gefühl unsere"}, {"id": 37, "start": 355.8, "end": 365.36, "text": "leute haben es nicht so so wirklich mit die fänden jolo okay hat funktioniert noch mal"}, {"id": 38, "start": 365.36, "end": 375.6, "text": "schon dreieckig die sandsäcke ich komme gerade vom sport ich weiß es klaut mir keiner aber ich"}, {"id": 39, "start": 375.6, "end": 389.96, "text": "habe gerade eineinhalb stunden in anführungsstrichen fitness gemacht sport keck w ich weiß eigentlich"}, {"id": 40, "start": 389.96, "end": 399.88, "text": "keck weight die haben kein bock zu sterben der panzer ich glaube ich sollte engineer ich"}, {"id": 41, "start": 399.88, "end": 408.72, "text": "glaube ich soll engineer rein join der panzer steht glaube hinter uns und best uns rein"}, {"id": 42, "start": 408.72, "end": 422.36, "text": "oder vorne ist ja mal davon ist ja monka korona guck mal ich glaube es nicht auch"}, {"id": 43, "start": 422.36, "end": 428.8, "text": "leute der panzer unser panzer panz man steht davor jetzt wird es echt schwierig"}, {"id": 44, "start": 428.8, "end": 437.48, "text": "fack hätte funktionieren kann was ist beliebt denn 2020 battlefield 4 auf jeden fall battlefield 4"}, {"id": 45, "start": 437.48, "end": 446.6, "text": "auf jeden fall battlefield 4 haben wir diffused okay sehr gut sehr gut also die base kann man"}, {"id": 46, "start": 446.6, "end": 454.24, "text": "eigentlich nicht verlieren wenn man das halbwegs sinnvoll spielt wir wissen ja wie das dass es"}, {"id": 47, "start": 454.24, "end": 476.64, "text": "nicht so einfach ist ok hier ist schlecht das panz man ok die sind die sind ganz geil auf links"}, {"id": 48, "start": 476.64, "end": 485.0, "text": "die sind die sind ganz ganz scharf hier auf die linke seite da war doch hier wo ist er"}, {"id": 49, "start": 485.0, "end": 499.56, "text": "in den kollegen so nicht so nicht guckt euch an ich kann es sich darüber retten die außen"}, {"id": 50, "start": 499.56, "end": 512.76, "text": "mich wenn ich darüber gehe der hat kein bock mehr meine sense ist komisch komisch eingestellt"}, {"id": 51, "start": 512.76, "end": 522.52, "text": "gerade ohne hinter uns hinter uns ich muss ja weg auto wir machen jetzt wir machen den"}, {"id": 52, "start": 522.52, "end": 532.44, "text": "huge play leute massive massive play warum kommt dann ein perfekter panzer"}, {"id": 53, "start": 532.44, "end": 554.96, "text": "only battlefield leute only battlefield zu geil zu geil so was gibt solche momenten kriegst du"}, {"id": 54, "start": 554.96, "end": 567.52, "text": "einfach die gibts einfach nur battlefield ich habe sie gar nicht mehr so viel muni ich hoffe"}, {"id": 55, "start": 567.52, "end": 571.32, "text": "ich hoffe das schneiber tut da oben trifft mich nicht sonst habe ich echt ein problem"}, {"id": 56, "start": 571.32, "end": 589.48, "text": "ok ich dachte die base kann man kaum verlieren was richtig macht man kann"}, {"id": 57, "start": 589.48, "end": 605.56, "text": "eine muni brauchen camp fps am start leute oder der panzer also hier ist optimale optimale"}, {"id": 58, "start": 605.56, "end": 619.48, "text": "pose den holen wir jetzt also ich bin ja nicht ganz selbstlos rübergegangen sondern ja kollege"}, {"id": 59, "start": 619.48, "end": 626.48, "text": "so nicht hier wirds aber ganz schön voll jetzt gerade hier ist bester spot hier ist"}, {"id": 60, "start": 626.48, "end": 634.16, "text": "echt bester spot auf der ganzen map wenn man reinkommt sag euch leute bester spot auf"}, {"id": 61, "start": 634.16, "end": 640.12, "text": "der ganzen map leider gibt es keine ordentlichen rush maps mehr in den in den nächsten battlefields"}, {"id": 62, "start": 640.12, "end": 645.12, "text": "auch in einem auto das auto fährt durch dass ich das ist schon mal schlecht wenn keiner"}, {"id": 63, "start": 645.12, "end": 657.72, "text": "mehr hinten ist wir sind ausgestiegen der ist hier durch der ist hier rein ok wir warten"}, {"id": 64, "start": 657.72, "end": 672.08, "text": "jetzt einfach mal bis die gegner angestellts kommen ok den holen wir nein nein nein nein"}, {"id": 65, "start": 672.08, "end": 687.96, "text": "lass mich lass mich in ruhe weg weg wir machen jetzt stellts stellts rangestellts da unten"}, {"id": 66, "start": 687.96, "end": 696.16, "text": "hitten die mich nie da unten hitten die mich nie was die haben gelegt wie haben die das"}, {"id": 67, "start": 696.16, "end": 704.04, "text": "gemacht wie sind die überhaupt durchgekommen ok ich muss weg weil die kommen gleich von"}, {"id": 68, "start": 704.04, "end": 718.72, "text": "vorne das ist ja leute ich sag es euch die waren schon an der linken seite am start wir"}, {"id": 69, "start": 718.72, "end": 731.12, "text": "können hier nicht weg und wenn da einer rauskommt alter lasst euch doch mal blicken oh shit ok"}, {"id": 70, "start": 731.12, "end": 738.12, "text": "hab ich mal einer geflankt keiner diffuse pepe hans ja mehr als leute killen kann ich nicht"}, {"id": 71, "start": 738.12, "end": 749.04, "text": "ob wir das squad wechseln nicht das squad die sind die sind eigentlich ganz ok komm"}, {"id": 72, "start": 749.04, "end": 757.2, "text": "mal her letzten mal mal an 490 ich spiele jetzt erstmal das womit ich klarkommen weil"}, {"id": 73, "start": 757.2, "end": 765.92, "text": "ich das gelb kaum gespielt habe und mit dem 416 habe ich auf jeden fall am meisten über"}, {"id": 74, "start": 765.92, "end": 784.56, "text": "ok wir müssen rüber wir müssen rüber ich versuche den kram mal zu diffusen ah shit"}, {"id": 75, "start": 784.56, "end": 789.96, "text": "da kommt es dann richtig ran zum diffusen hat keine bock aber b ist sau schwer einzunehmen"}, {"id": 76, "start": 789.96, "end": 800.56, "text": "ja eigentlich man kann das eigentlich kaum verlieren wo sind wo sind der dude what the"}, {"id": 77, "start": 800.56, "end": 808.6, "text": "fuck wo ist der denn ich blick nicht durch wo sind wir dann ah moment wir sind wir sind"}, {"id": 78, "start": 808.6, "end": 814.84, "text": "bei uns im spawn die kommen jetzt auch von rechts klein können ich werden die sind immer"}, {"id": 79, "start": 814.84, "end": 826.88, "text": "ja die sind immer team feed ja aber massive team feed wir sind ja auch an der letzten"}, {"id": 80, "start": 826.88, "end": 833.08, "text": "wir sind ja quasi an dieser base erst reingejointed vergiss es wir kriegen grad hardcore auf den"}, {"id": 81, "start": 833.08, "end": 842.2, "text": "sack und da steht der panzer vielleicht können mit unserem panzer ein bisschen ok ich probiers"}, {"id": 82, "start": 842.2, "end": 851.52, "text": "ich probiers leute ich probiers jolo ich probiers ah shit die stehen links dahinter spawn trap"}, {"id": 83, "start": 851.52, "end": 862.64, "text": "na auf dem event peak nicht so sehr auf dem event peak ist spawn trap nicht so extrem"}, {"id": 84, "start": 862.64, "end": 875.08, "text": "denn hier los alter wir stellten uns mal da um die eck er weiß es er weiß es kommt"}, {"id": 85, "start": 875.08, "end": 885.44, "text": "mit der pistole rum rex beste beste waffe wie lange man kann bettel viel dreimal lange"}, {"id": 86, "start": 885.44, "end": 894.64, "text": "mit den meisten zuschauen weltweit ja ist ja auch kein kunst kommen machen wir den"}, {"id": 87, "start": 894.64, "end": 915.4, "text": "den big brain engineer machen wir mal ist hinter uns was ok ich habe dich mal wir haben"}, {"id": 88, "start": 915.4, "end": 925.28, "text": "wir haben die eigentlich schon gelegt mal dumme frage panzer du bist du gehst in die"}, {"id": 89, "start": 925.28, "end": 945.52, "text": "falsche richtung naa mit dem ding panz panz mann was ist los jetzt hat er keinen bob mehr"}, {"id": 90, "start": 945.52, "end": 949.56, "text": "jetzt jetzt jetzt hat er jetzt hat er keine lust mehr hat es gedacht fack steig aus ich"}, {"id": 91, "start": 949.56, "end": 955.36, "text": "mach nix mehr wann spielst du bett company 2 ich hab die letzten tage mal bett company"}, {"id": 92, "start": 955.36, "end": 960.76, "text": "2 gespielt so jetzt erste runde mal richtig mit dabei hier ich hab letzten tage mal bett"}, {"id": 93, "start": 960.76, "end": 969.56, "text": "company 2 gespielt gibt es noch weiß ich auch mal das online sehen kann ich glaube"}, {"id": 94, "start": 969.56, "end": 982.84, "text": "nicht oder doch der surfer name trump versus putin versus merkel merkel versus mackroff"}, {"id": 95, "start": 982.84, "end": 992.04, "text": "versus johnson alles klar ja da habe ich jetzt öfters mal drauf gespielt rush noob welcome"}, {"id": 96, "start": 992.04, "end": 995.96, "text": "das ist übrigens jebait noob welcome das stimmt überhaupt nicht das spiel plus zum"}, {"id": 97, "start": 995.96, "end": 1002.92, "text": "größten halb gute leute desperados 3 nie habe ich mir nicht angeguckt so jetzt erste"}, {"id": 98, "start": 1002.92, "end": 1011.52, "text": "richtige runde hier 6464 waren wir auf dem dem event pigoli server anscheinend anscheinend"}, {"id": 99, "start": 1011.52, "end": 1030.64, "text": "beste eine der besten rush maps ja huge okay wir haben squad explosives in ist quad ammo"}, {"id": 100, "start": 1030.64, "end": 1039.2, "text": "squad cover ist total underrated gewesen so big brain big brain plays von anfang an bock"}, {"id": 101, "start": 1039.2, "end": 1047.32, "text": "auf squad klar warum nicht bist du attacker man konnte da nicht drüber hüpfen wir machen"}, {"id": 102, "start": 1047.32, "end": 1056.48, "text": "jetzt big brain play ich zeige aber battlefield please wo ging der weg hier noch mal hin man"}, {"id": 103, "start": 1056.48, "end": 1077.88, "text": "konnte ja den übelsten big brain weglegen gehen als ohne big brain play excellent"}, {"id": 104, "start": 1077.88, "end": 1101.84, "text": "na ich sag doch big brain plays am start wir müssen von hinten gucken dass sie nicht"}, {"id": 105, "start": 1101.84, "end": 1124.52, "text": "rankommen sehe gegner big brain play leute ich sags euch massive"}, {"id": 106, "start": 1124.52, "end": 1135.68, "text": "weggeschnetzelt hier wie warum stirbt er nicht es ist lebensoppression"}, {"id": 107, "start": 1135.68, "end": 1157.0, "text": "wov achtung nein team mate please kill was boosted golf okay ich komme rüber aber aber"}, {"id": 108, "start": 1157.0, "end": 1165.16, "text": "nur offene squad weil ansonsten ist kacke kann man richtig spawn squad golf join da"}, {"id": 109, "start": 1165.16, "end": 1180.68, "text": "ist er der metal tat san excellent oh wir haben hier die huge huge posi aber wenn wir"}, {"id": 110, "start": 1180.68, "end": 1186.8, "text": "nur ein m com kriegen dann erinnert euch dran wer hat's wer hat's wer hat's geholt wer hat's"}, {"id": 111, "start": 1186.8, "end": 1203.12, "text": "geholt das m com ha ha ha der blöder blöder pilote da ist der ist richtig fail geflogen"}, {"id": 112, "start": 1203.12, "end": 1231.16, "text": "na ja auch fack ich wollte eigentlich minipack schmeißen da ist er monka monka monka monka"}, {"id": 113, "start": 1231.16, "end": 1238.2, "text": "s giga das game ist zu easy für max ja wenn man sich die stats anguckt eindeutig guckt"}, {"id": 114, "start": 1238.2, "end": 1252.12, "text": "mal da 2k 10 1 easy und sogar gerätzt hier poggers streckt mal deinen kopf raus alter"}, {"id": 115, "start": 1252.12, "end": 1255.8, "text": "ich kann nicht raus leute ich kann hier nicht raus auf gar keinen fall kann ich hier raus"}, {"id": 116, "start": 1255.8, "end": 1273.56, "text": "wenn ich hier rausgehe bin ich dead dead as fack okay gehen wir rüber gehen wir rüber"}, {"id": 117, "start": 1273.56, "end": 1286.32, "text": "gucken wo sie entschärfen wollen ich glaube die haben keinen bock zu zu diffusen hier"}, {"id": 118, "start": 1286.32, "end": 1295.24, "text": "gerade 2 easy 2 easy kriegen wir den heli noch mal raus patrick dankeschön für den"}, {"id": 119, "start": 1295.24, "end": 1308.12, "text": "zapp ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha"}, {"id": 120, "start": 1308.12, "end": 1314.48, "text": "so wir machen jetzt nächste aber wir dürfen noch gar nicht ich will den heli rausschießen"}, {"id": 121, "start": 1314.48, "end": 1331.8, "text": "bitte kipp heli heli heli heli heli komm her der mag nicht der heli wird geschreckt"}, {"id": 122, "start": 1331.8, "end": 1351.6, "text": "der heli mann dann hier noch dankeschön für den zapp der heli mann damit hat er damit"}, {"id": 123, "start": 1351.6, "end": 1362.88, "text": "nicht gerechnet ja ich bin mit sich kann sicher wo sie rumstelsen die guten hier den fall"}, {"id": 124, "start": 1362.88, "end": 1367.96, "text": "müssen wir hier den den den flank push machen bring ich gehe normalerweise lieber rechts"}, {"id": 125, "start": 1367.96, "end": 1378.64, "text": "rum weil rechts kann man in die base stelsen ohne dass es einer checkt lasst mich rein"}, {"id": 126, "start": 1378.64, "end": 1391.28, "text": "in die map gatschi bus gatschi bus au au au ich was hier los was ist hier los warum"}, {"id": 127, "start": 1391.28, "end": 1398.26, "text": "warum schießt ihr denn auf mich ich finde das nicht fair dass sie dass die zurückschießen"}, {"id": 128, "start": 1398.26, "end": 1408.6, "text": "ehrlich gesagt das gehört sich nicht das ich sage euch leute der heli mann der heli"}, {"id": 129, "start": 1408.6, "end": 1424.48, "text": "mann will noch mal gehaunt werden von mir achte unten kommt gleich einer rum wenn man"}, {"id": 130, "start": 1424.48, "end": 1439.04, "text": "nicht ganz sicher von wurde wo sind sie denn gleich gleich wieder rechts einer am start"}, {"id": 131, "start": 1439.04, "end": 1447.28, "text": "sehe schon aber das müssten die eigentlich erwischen ich kann hier gerade nicht weg"}, {"id": 132, "start": 1447.28, "end": 1453.96, "text": "ich will ja gar nicht so lange rumsitzen aber was willst du machen heli heli ich sag euch"}, {"id": 133, "start": 1453.96, "end": 1465.76, "text": "den heli mann wir kriegen den klein wieder der heli mann nein nein heli mann heli mann"}, {"id": 134, "start": 1465.76, "end": 1478.0, "text": "ich dich rausschießen nicht du mich heli mann komm her oh ja ja ja ja heli mann ich"}, {"id": 135, "start": 1478.0, "end": 1487.48, "text": "sehe nix ich sehe nix ich muss weg ich hab hier ist mir zu monka s gerade ok ok ok wir"}, {"id": 136, "start": 1487.48, "end": 1494.2, "text": "machen den retz train nice midi pack gucken dass rechts nix steht die stehen nämlich"}, {"id": 137, "start": 1494.2, "end": 1501.0, "text": "immer ganz gerne auf dem berg au sag mal von wo kommen denn die ganzen nades hier geflogen"}, {"id": 138, "start": 1501.0, "end": 1520.72, "text": "ja ist ja mal gut jetzt ok was auch immer hier gerade los ist alter da ist was dran skok"}, {"id": 139, "start": 1520.72, "end": 1534.52, "text": "musics aber es fangen nicht wieder alle anzuspielen ok ich mache jetzt mal ein big brain flank"}, {"id": 140, "start": 1534.52, "end": 1538.24, "text": "aber die sehen mich wahrscheinlich aber probieren zwar wir probieren zwar big brain flank ich"}, {"id": 141, "start": 1538.24, "end": 1546.88, "text": "retz dich erstmal da oben nein nein nein nein nein nein nein nein nein nein nein du kannst"}, {"id": 142, "start": 1546.88, "end": 1552.2, "text": "du siehst mich gar nicht du siehst mich gar nicht alter du siehst mich gar nicht du siehst"}, {"id": 143, "start": 1552.2, "end": 1569.16, "text": "mich gar nicht wo liegt der denn da das ist ja mal total am arsch der welt"}, {"id": 144, "start": 1569.16, "end": 1592.64, "text": "ich höre irgendwo unter uns was ach shit kinder kommen jetzt schlecht durch das game"}, {"id": 145, "start": 1592.64, "end": 1599.84, "text": "mit nem gescheiten netcode ja es ist teilweise schon ein bisschen fragwürdig wie man getroffen"}, {"id": 146, "start": 1599.84, "end": 1614.88, "text": "wird und trifft ja ok jolo jetzt jetzt jetzt jetzt jetzt jetzt jetzt achtsung ach shit"}, {"id": 147, "start": 1614.88, "end": 1623.88, "text": "oder der heli auch noch man kann nämlich richtig gut rechts in die base in die base rein"}, {"id": 148, "start": 1623.88, "end": 1628.88, "text": "ich glaube es spielt jetzt jemand den heli der weiß was er macht das ist ziemlich doof"}, {"id": 149, "start": 1628.88, "end": 1657.8, "text": "ok kann ich jetzt nein ich kann meinen flank immer noch nicht machen mit dem heli der heli"}, {"id": 150, "start": 1657.8, "end": 1664.44, "text": "ist massiv massiv op jetzt haben wir hier die richtigen krassen movement leute am start"}, {"id": 151, "start": 1664.44, "end": 1673.64, "text": "auch guckt euch mal was ist mit den gegnern wieder los die haben nur drauf gewartet dass"}, {"id": 152, "start": 1673.64, "end": 1676.8, "text": "jemand das game streamt wahrscheinlich dass jetzt hier wieder mit dem halben klaren rein"}, {"id": 153, "start": 1676.8, "end": 1698.16, "text": "können echt zwar irgendwas habs gesehen der heli mann ach so das den kann man damit ja"}, {"id": 154, "start": 1698.16, "end": 1718.16, "text": "nicht heilen hier ist ja nur nur nate gespamme ok wie kommen wir hier jetzt rein ich komm"}, {"id": 155, "start": 1718.16, "end": 1729.6, "text": "hier nämlich überhaupt nicht weiter also wir kommen hier kein meter vor ein bisschen smoke"}, {"id": 156, "start": 1729.6, "end": 1757.44, "text": "vielleicht ich glaube ich nehme jetzt echt so ein heli raus also wenn wir den heli nicht"}, {"id": 157, "start": 1757.44, "end": 1777.76, "text": "runterkriegen geht hier nix das ist doch nicht normal wir kommen kein meter vorwärts da machst"}, {"id": 158, "start": 1777.76, "end": 1802.44, "text": "du nix wir nehmen die noob jetzt wird runter gestingert klar will der road killen hier"}, {"id": 159, "start": 1802.44, "end": 1824.12, "text": "ok so wie ich das sehe komme ich echt nicht vorwärts gerade ja ist klar da ist zu wenig"}, {"id": 160, "start": 1824.12, "end": 1848.28, "text": "gepusche der heli typ am anfang ein bisschen smoke wäre auch nicht verkehrt gibt ja leute"}, {"id": 161, "start": 1848.28, "end": 1863.12, "text": "die treffen sowas ich hatte es aber schon mal also sobald man sobald man das game streamt"}, {"id": 162, "start": 1863.12, "end": 1869.2, "text": "kommen die mega krassen gegner direkt drauf als haben die nur drauf gewartet erste base"}, {"id": 163, "start": 1869.2, "end": 1880.72, "text": "ging und jetzt ist hier huge keine chance"}, {"id": 164, "start": 1880.72, "end": 1909.52, "text": "echt zwar was links links links ich geier den jetzt mit irgendein stinger runter oder"}, {"id": 165, "start": 1909.52, "end": 1913.88, "text": "so aber das kannst du nicht machen der macht das der macht das clever der weiß halt auch"}, {"id": 166, "start": 1913.88, "end": 1923.48, "text": "wie man heli fliegt da kannst du eigentlich fast kannst eigentlich fast knicken am besten"}, {"id": 167, "start": 1923.48, "end": 1929.56, "text": "war eigentlich rechts rum zu gehen also ist noch zu weit weg hallo spotten gibt's nicht"}, {"id": 168, "start": 1929.56, "end": 1946.44, "text": "wird nicht gespottet kann man eigentlich auch die drohen habe ich schon nie ausprobiert"}, {"id": 169, "start": 1946.44, "end": 1958.64, "text": "ob man die runter geiern kann den typ treffe ich mit der pg nicht"}, {"id": 170, "start": 1976.44, "end": 2001.88, "text": "hallo lasst mich in ruhe ich muss den heli runter geiern"}, {"id": 171, "start": 2001.88, "end": 2024.76, "text": "bloß den heli runter geier"}, {"id": 172, "start": 2024.76, "end": 2038.72, "text": "ne da kannst du eigentlich nix kurz schaltest dagegen machen der wartet auch wieder bis"}, {"id": 173, "start": 2038.72, "end": 2054.2, "text": "du übrigens auch gegen den berg da machst du nix ne hast du keine chance also ja das"}, {"id": 174, "start": 2054.2, "end": 2064.2, "text": "so muss das auch machen aber es krass sobald man das game anfängt zu streamen kommen die"}, {"id": 175, "start": 2064.2, "end": 2074.12, "text": "ultrakrassen gegner anstarten letztens hier off stream gespielt irgendwie 75 20 oder sonst"}, {"id": 176, "start": 2074.12, "end": 2079.0, "text": "was und jetzt ist hier irgendwie übels tryhard mode angesagt die gegner team an level 100"}, {"id": 177, "start": 2079.0, "end": 2100.42, "text": "level 100 100 100 100 100abe wo ist die hexe was man braucht genau kannste kannst nichts"}, {"id": 178, "start": 2100.42, "end": 2105.82, "text": "Oh wir haben gelegt, Porgas!"}, {"id": 179, "start": 2105.82, "end": 2112.54, "text": "Wir haben gelegt, okay ich hoffe die drehen jetzt um und man kann rein."}, {"id": 180, "start": 2112.54, "end": 2115.54, "text": "Okay, okay, okay, gucken wir mal."}, {"id": 181, "start": 2115.54, "end": 2134.34, "text": "Okay, okay Achtung, huge play, warte jetzt ab, ich glaube, ich glaube das war der Weg"}, {"id": 182, "start": 2134.34, "end": 2135.34, "text": "hier."}, {"id": 183, "start": 2135.34, "end": 2136.78, "text": "Ich glaube das war der Weg, ich bin mir da nicht ganz sicher."}, {"id": 184, "start": 2136.78, "end": 2154.9, "text": "Habt ihr den big brain flank gesehen Leute?"}, {"id": 185, "start": 2154.9, "end": 2167.94, "text": "Alter, wo gings denn hier nochmal rein?"}, {"id": 186, "start": 2167.94, "end": 2183.74, "text": "Oh shit, weggeschneiberte!"}, {"id": 187, "start": 2183.74, "end": 2189.22, "text": "Aber so geht das, ich hoffe die sind noch dran, wir haben spawn biegen, äh warum kann"}, {"id": 188, "start": 2189.22, "end": 2195.98, "text": "ich nicht bei unserem mensch da vorne spawnen, gerry code, warum kann ich nicht bei gerry"}, {"id": 189, "start": 2195.98, "end": 2199.58, "text": "code spawnen oder bei ihm hier, warum kann ich nicht bei ihm hier spawnen, was soll das"}, {"id": 190, "start": 2199.58, "end": 2227.22, "text": "denn, spawnschneiber gerry code, gerry code ist tot, gerry code, nein gerry code, von"}, {"id": 191, "start": 2227.22, "end": 2241.46, "text": "sowas für seit und alles, ich glaube wir haben es gleich, ey haben wir es, huge, massive,"}, {"id": 192, "start": 2241.46, "end": 2260.26, "text": "weißt du, okay, gucken wo die dudes rum, rumhampeln, ahhh fast, aber wir haben auch viele tickets,"}, {"id": 193, "start": 2260.26, "end": 2274.86, "text": "also man hat es ja an der defense gesehen vorhin, ich glaube ich bin noch nie hier unten durch"}, {"id": 194, "start": 2274.86, "end": 2285.38, "text": "gelaufen wirklich, das habe ich, ich kenne gar nicht das gewölbe hier drunter, gucken"}, {"id": 195, "start": 2285.38, "end": 2290.42, "text": "wir mal, kann man da rein, lul, was ein glück, dass da gerade so ein typ noch rausgestellt"}, {"id": 196, "start": 2290.42, "end": 2300.94, "text": "kommt, hier midi pack, next, so jetzt haben wir helis, ich hole euch leute, ich hole euch,"}, {"id": 197, "start": 2300.94, "end": 2311.38, "text": "ich muss aber erstmal hoch, ach nee der ist auf den felsen gefallen, so beste, beste"}, {"id": 198, "start": 2311.38, "end": 2323.38, "text": "wech, links, rechts, wir gehen jetzt mal rechts, ganz rechts, oh wir sind ein bisschen früh,"}, {"id": 199, "start": 2323.38, "end": 2337.22, "text": "hier ist ein spawn beacon gewesen, hier sitzt einer auf dem berg, wie die wissen wieder,"}, {"id": 200, "start": 2337.22, "end": 2354.26, "text": "wo war der, ah hier, oder, aber der rechte flank ist meistens am besten, jetzt only in"}, {"id": 201, "start": 2354.26, "end": 2364.3, "text": "battlefield, ja nachdem es in battlefield 3, nachdem es in battlefield 1 und 5 ja irgendwie"}, {"id": 202, "start": 2364.3, "end": 2374.1, "text": "6 mal so richtig geile moments gab, muss man halt auch mal wieder das olle ausbuddeln,"}, {"id": 203, "start": 2374.1, "end": 2401.62, "text": "aber wo sind die gegner, nichts zu sehen, war da vorne was, ich hole dich, da war noch"}, {"id": 204, "start": 2401.62, "end": 2418.58, "text": "mehr, da war noch mehr, exellent, von der seite kommt da was, schauen wir mal hier, ah"}, {"id": 205, "start": 2418.58, "end": 2425.46, "text": "der lebt, nee der lebt nicht mehr, was ist denn hier los, alter, ist ja gut, übertreibts"}, {"id": 206, "start": 2425.46, "end": 2443.18, "text": "nicht, übertreibts, battlefield please, battlefield, battlefield lasst mich, battlefield, ich hab"}, {"id": 207, "start": 2443.18, "end": 2456.14, "text": "ihn gesehen. Nein, nein, nein, nein, nein, nein, nein, nein, nein. Ah, shit. Das ist"}, {"id": 208, "start": 2456.14, "end": 2470.22, "text": "der Moment, Piek, ja. Brandenburg-Russ. Okay. Brandenburg-Russ. Der hat eine gute Pose"}, {"id": 209, "start": 2470.22, "end": 2488.66, "text": "hier. Excellent. Hab noch mal nix. Okay, big brain, big brain play. Nein, nein, nein,"}, {"id": 210, "start": 2488.66, "end": 2516.02, "text": "nein, lass mich in Ruhe. Okay, alle weg anscheinend. What, what, what? Wo ist der? Okay, jetzt"}, {"id": 211, "start": 2516.02, "end": 2521.94, "text": "kommt die schwerste Base, Leute. Das ist mit Abstand die schwerste Base, finde ich, auf"}, {"id": 212, "start": 2521.94, "end": 2527.74, "text": "der Map, die nächste. Also entweder kriegst du die schnell oder nur mit sehr viel Grind."}, {"id": 213, "start": 2527.74, "end": 2539.22, "text": "Gibt auch keine richtig big brain Wege, die man hier nehmen kann. Guckt, ja, das war doof."}, {"id": 214, "start": 2539.22, "end": 2544.98, "text": "Hätte ich gleich wieder weg. Noch, noch mal, noch mal. Ich komm da raus, ich komm da raus."}, {"id": 215, "start": 2544.98, "end": 2551.18, "text": "Nee, ich komm nicht raus. Aber so viel ist da gar nicht drin. Mit dem Heli von hinten"}, {"id": 216, "start": 2551.18, "end": 2558.06, "text": "rein fliegen. Oh ja, das Heli von hinten rein ist tatsächlich huge. Sind wir schon"}, {"id": 217, "start": 2558.06, "end": 2580.38, "text": "durch? Gary Cote, Alter. Alter, Gary Cote. Gary, nein. Ich seh nix. Ich seh nix. Hier"}, {"id": 218, "start": 2580.38, "end": 2595.62, "text": "ist nix zu sehen. Wir haben schon gearmt? Was ist hier los? Die nehmen Rush ja richtig"}, {"id": 219, "start": 2595.62, "end": 2612.58, "text": "ernst. Big brain Rush. Oh, huge flank. Poggers flank. Äh, alles tot, kann das sein? Alles"}, {"id": 220, "start": 2612.58, "end": 2626.22, "text": "tot? Lull. Guck mal, ob hier was herkommt. Ich seh nix, Panzman. Jetzt, nee, das war"}, {"id": 221, "start": 2626.22, "end": 2633.46, "text": "die schwerste Base auf der ganzen Map. Wobei die letzte auch schwer sein kann, aber es"}, {"id": 222, "start": 2633.46, "end": 2639.02, "text": "geht. Also das ist eigentlich die schwerste. Ja, ja, ist gut hier. Will ich abfackeln?"}, {"id": 223, "start": 2639.02, "end": 2667.38, "text": "Nicht abfackeln. Abfackeln, unerwünscht. Ok, auf geht's. Let's go, Panzer. Ok, jetzt"}, {"id": 224, "start": 2667.38, "end": 2672.34, "text": "gegnerischer Panzer. Ich hab leider, ich bin leider kein Engineer. Das ist das Dove dabei."}, {"id": 225, "start": 2672.34, "end": 2682.18, "text": "Äh, keinen Sinn. Ich kann leider nix machen, Panzer. Alter, Panzer, lass mich vor. Ah,"}, {"id": 226, "start": 2682.18, "end": 2698.1, "text": "jetzt, ich will mich jebaiten. You got jebaited. You got jebaited. Je, je, je, je, jebaited."}, {"id": 227, "start": 2698.1, "end": 2714.9, "text": "Je, je, je, je, jebaited. Ok, die Gegner sind gar nicht doof. Normalerweise pushen die immer"}, {"id": 228, "start": 2714.9, "end": 2719.06, "text": "wie verrückt. Machen die nicht, was auf der Base auch tödlich ist, wenn das halbe Team"}, {"id": 229, "start": 2719.06, "end": 2728.7, "text": "vorne Richtung spawn stirbt. Also die Gegner sind tatsächlich eher medium sized brain anstatt"}, {"id": 230, "start": 2728.7, "end": 2753.18, "text": "slow brain. Aber big brain reicht's definitiv noch nicht. Äh. Ok, ich bin jetzt hier."}, {"id": 231, "start": 2753.18, "end": 2772.5, "text": "What? Lull. Ok, ich weiß nicht wo Gegner sind, aber wir chargeen da jetzt einfach rein."}, {"id": 232, "start": 2772.5, "end": 2794.18, "text": "Yolo. Hier ist was drin. Hier ist was drin gewesen. Oder auch nicht. Wow. Wir haben,"}, {"id": 233, "start": 2794.18, "end": 2803.38, "text": "wir packen das ja easy. Was ist hier los? Easy win. Soll das Robert Bowling darstellen?"}, {"id": 234, "start": 2803.38, "end": 2814.5, "text": "Er hat schon ein bisschen was, ne? Kann eigentlich Battlefield 3 borderless fullscreen? Weil"}, {"id": 235, "start": 2814.5, "end": 2832.98, "text": "sonst sieht man ja gar nicht die Emotes. Easy clap. GG. So. Ich überleg grad ob ich nicht"}, {"id": 236, "start": 2832.98, "end": 2846.5, "text": "den Server wechsle, weil. Nochmal Damavent Peak. Nochmal Damavent Peak muss nicht sein."}, {"id": 237, "start": 2846.5, "end": 2853.06, "text": "Ich war doch auf dem Damavent Peak. Oder war ich auf dem Rush Classics? Ne, ich war"}, {"id": 238, "start": 2853.06, "end": 2866.5, "text": "auf Damavent Peak only, ne? Gucken wir mal. Ah ne, nochmal Damavent Peak muss nicht sein."}, {"id": 239, "start": 2866.5, "end": 2879.22, "text": "Machen wir mal dicht. Und gehen hier mal auf. Rush Classics Sand Crossing. Exzellent. Wobei"}, {"id": 240, "start": 2879.22, "end": 2886.74, "text": "ich auch mal Bock hab auf 16 vs 16. Wir probieren mal 16 vs 16 aus. Das ist nicht ganz so chaotisch."}, {"id": 241, "start": 2886.74, "end": 2894.06, "text": "Aber es ist Firestorm. Auf Firestorm hab ich eigentlich auch keinen Bock. Mal gucken wie"}, {"id": 242, "start": 2894.06, "end": 2903.7, "text": "weit die Runde ist. Exclusive Fullscreen ist auch deprecated. Was der totaler Schwachsinn"}, {"id": 243, "start": 2903.7, "end": 2909.7, "text": "ist, weil das das beste ist, was du eigentlich machen kannst. Mit dieser ganze Windows-Windows-Manager"}, {"id": 244, "start": 2909.7, "end": 2914.54, "text": "geduldens rausgeschmissen. So, wie sind die Fender? An welcher Base? Ist das die letzte?"}, {"id": 245, "start": 2914.54, "end": 2925.5, "text": "Ne, das ist die erste. Ich bin verwirrt grade. Firestorm, das ist die erste Base, ne? By"}, {"id": 246, "start": 2925.5, "end": 2935.86, "text": "the way, unpopuläre Meinung. Unpopuläre Meinung, Firestorm suckt. Ich mag Firestorm"}, {"id": 247, "start": 2935.86, "end": 2965.66, "text": "nicht. Kackmap. Der ist tot, hm? Was macht der da? Was macht"}, {"id": 248, "start": 2965.66, "end": 2973.18, "text": "der da oben? Ok, der Chat gibt mir recht. Oder auch nicht, geteilter Meinung der Chat."}, {"id": 249, "start": 2973.18, "end": 2979.3, "text": "Ich mag Firestorm nicht. Ich glaub Firestorm ist gut für Leute, die das mögen mit Chats"}, {"id": 250, "start": 2979.3, "end": 2993.02, "text": "rumzufliegen. Aber die Runde sollte gleich vorbei sein, wenn sie es jetzt nicht doch"}, {"id": 251, "start": 2993.02, "end": 3009.94, "text": "noch irgendwie hinkriegen. Alles klar. Conquest-Map, ja Conquest. Da sitzt er auf dem Silo obendrauf."}, {"id": 252, "start": 3009.94, "end": 3026.34, "text": "Nein, nein, nein Leute, nicht liegen, nicht liegen, please nicht liegen. Ich will, dass"}, {"id": 253, "start": 3026.34, "end": 3034.06, "text": "die Runde vorbei ist. Ich hab keinen Bock auf Firestorm. Oh, da kommt links irgendwas,"}, {"id": 254, "start": 3034.06, "end": 3049.62, "text": "ne? What the fuck, was ist hier los? Ich hol den Pantsman. Ich glaub die sind... Wo kommt"}, {"id": 255, "start": 3049.62, "end": 3060.34, "text": "der her? Einfach mal random so, spawn. Wir retten einfach ein bisschen und gut ist. Was"}, {"id": 256, "start": 3060.34, "end": 3065.78, "text": "willst du machen, ne? Hinten fährt der Pantsman rum. Irgendwo rechts liegt ein Schneiber,"}, {"id": 257, "start": 3065.78, "end": 3070.02, "text": "der Typ, der mich vorhin weggeschneibert hat. Wir überwachen jetzt einfach B und in 13"}, {"id": 258, "start": 3070.02, "end": 3084.9, "text": "Tickets ist die Map vorbei. Moment, da springt was runter. Hallo, game please. Sniper, Sniper."}, {"id": 259, "start": 3084.9, "end": 3112.9, "text": "Wo ist er denn? Sniper. Woah, hab mich nicht gesehen. Da war ich, kein Komrade. Am besten"}, {"id": 260, "start": 3112.9, "end": 3125.98, "text": "waren die Sound-Samples, finde ich immer noch in Bad Company 2. Oh, oh, oh. Okay, ich bleib"}, {"id": 261, "start": 3125.98, "end": 3130.26, "text": "jetzt einfach hier liegen, easy. Das sind so Sachen, so geile Sachen, wo einfach mal"}, {"id": 262, "start": 3130.26, "end": 3138.98, "text": "neben die Enchanted-Chat-Crasht, das gibt's echt nur in Battlefield. Huge Battlefield"}, {"id": 263, "start": 3138.98, "end": 3159.46, "text": "Moments. Ey, was soll ich denn hier machen? Ah gut, easy win. Gut. Und jetzt, bless RNG."}, {"id": 264, "start": 3159.46, "end": 3164.54, "text": "Kein Firestorm mehr. Ich will auch Firestorm als Attacker nicht spielen. Ich will was ordentliches."}, {"id": 265, "start": 3164.54, "end": 3182.06, "text": "So, Sand-Crossing, Bazaar, Metro, Demo-Vent-Peak. Na, Demo-Vent-Peak hatten wir ja erst. Steht"}, {"id": 266, "start": 3182.06, "end": 3185.88, "text": "die Map nicht im Chat? Ja, man kann den Chat leider im Endscreen nicht mal aufmachen."}, {"id": 267, "start": 3185.88, "end": 3197.66, "text": "Nose-Hair kommt jetzt. Nose-Hair ist auch eine absolut underrated Rush-Map. Nose-Hair. Caspian"}, {"id": 268, "start": 3197.66, "end": 3204.34, "text": "Border gefällt mir auch nicht. Caspian Border und Firestorm. So die Maps, wo so die Battlefield-Veteranen"}, {"id": 269, "start": 3204.34, "end": 3207.82, "text": "zur damaligen Zeit gesagt haben, oh ja, die einzigen richtigen Battlefield-Maps mag ich"}, {"id": 270, "start": 3207.82, "end": 3213.34, "text": "nicht. Och na, komm, mach da. Chat hat mich gebaitet. Chat hat gesagt, es kommt ergeblich"}, {"id": 271, "start": 3213.34, "end": 3224.06, "text": "was anderes. Hast du noch Kontakt zu Kaboom? Selten mal, ja. Mal gucken, ob ich noch Panzer"}, {"id": 272, "start": 3224.06, "end": 3232.54, "text": "fahren kann. Ich bezweifle es ja, dass ich noch Panzer fahren kann. Äh, Leute, wie hat"}, {"id": 273, "start": 3232.54, "end": 3245.94, "text": "man... Secondary? Ah ja, okay. Das wird jetzt echt Fail. Easy, easy. Unser Chat-Mensch"}, {"id": 274, "start": 3245.94, "end": 3253.08, "text": "macht das schon, denke ich. Ah, ah, ah. Bam! What? Okay, der hat Glück gehabt. Der hat"}, {"id": 275, "start": 3253.08, "end": 3266.54, "text": "echt Glück gehabt, dass er da durchgekommen ist. Huge Glück. Okay, ich kann Panzer fahren"}, {"id": 276, "start": 3266.54, "end": 3280.34, "text": "nicht mehr. Ich kann Panzer fahren nicht mehr. Guck mal, wie sehr ich verkacke. Seht"}, {"id": 277, "start": 3280.34, "end": 3294.62, "text": "ihr das? Wie krass ich am Verkacken bin. Habt ihr das gesehen? Jutschverkacksohr. Verkack-FPS."}, {"id": 278, "start": 3294.62, "end": 3301.66, "text": "Das ist übrigens quasi nahezu instant death, wenn man hier drauf lang läuft. Aber irgendwie"}, {"id": 279, "start": 3301.66, "end": 3309.54, "text": "interessiert es gerade keinen. Weiß ich auch nicht, warum die das nicht interessiert,"}, {"id": 280, "start": 3309.54, "end": 3314.26, "text": "dass ich jetzt lang gelaufen bin. Das Spiel sieht immer noch erstaunlich gut aus. Ja,"}, {"id": 281, "start": 3314.26, "end": 3323.18, "text": "das ist korrekt. Jut-jut-jut-jut-jup-baited. Jut-jut-jut-jut-jup-baited. Jut-jut-jut-jut-jup-baited."}, {"id": 282, "start": 3323.18, "end": 3333.82, "text": "Oh, turn on hier. MonkaS. Wahnsinn. Manchmal läuft's, ne? Ich leg dir den Midi-Pack. Ah,"}, {"id": 283, "start": 3333.82, "end": 3360.06, "text": "du hast schon einen Midi-Pack. Jut-jut-jut-jut-jup-baited. Ah, gehst du weg da oben? Ah, Suppression,"}, {"id": 284, "start": 3360.06, "end": 3373.1, "text": "ne? MonkaS-Suppression. Ah, Scheiße von der Seite. Oh, ein Rätsel. Exzellent. Exzellent."}, {"id": 285, "start": 3373.1, "end": 3380.42, "text": "Du wirst jetzt gar nicht so genau von wo. Kann ich dich rätseln? Nein, kann ich nicht."}, {"id": 286, "start": 3380.42, "end": 3387.7, "text": "So, hier oben können sie mich nicht hitten, gescheit. Ich würd euch ja rätseln, ne?"}, {"id": 287, "start": 3387.7, "end": 3400.34, "text": "Aber ich komm hier hin. Aha, aha, aha. Och ma, da stehen sie rum, da stehen sie rum."}, {"id": 288, "start": 3400.34, "end": 3408.62, "text": "Da stehen sie einfach rum, ganze Game, auf dem Dach. Oh, nice, was ist denn hier los?"}, {"id": 289, "start": 3408.62, "end": 3414.46, "text": "Oh, what? Crown, bist du aus dem Stream? Du warst ja auch im letzten Setzen-Server da,"}, {"id": 290, "start": 3414.46, "end": 3444.22, "text": "das ist ja nice. THX. Nicer Support. Ist nix zu meckern. Aha, so geht's nicht hier."}, {"id": 291, "start": 3444.22, "end": 3459.9, "text": "Sterben, please. Sterben, please. Oh, oh, die, ne, die saß. Das war gut hier. Dass"}, {"id": 292, "start": 3459.9, "end": 3466.86, "text": "der die da von unten getroffen hat, ich hab grad das liegt. Moment, was? Bad luck? Bad,"}, {"id": 293, "start": 3466.86, "end": 3479.58, "text": "bad luck? Okay, Moment, an was bin ich genau gestorben? An, an was? Kann mir das jemand"}, {"id": 294, "start": 3479.58, "end": 3487.06, "text": "erklären? Nice, danke. Kann mir das irgendjemand erklären, woran ich grade gestorben bin?"}, {"id": 295, "start": 3487.06, "end": 3509.14, "text": "Gestolpert, ja. Ich glaub's auch. Monka, stolpert. Okay, wir müssen gucken, dass sie nicht diffusen"}, {"id": 296, "start": 3509.14, "end": 3523.1, "text": "können. Ich, ich, ich, ich aim das jetzt hier einfach. Nein, nein, nein, nein. Ah, wir haben"}, {"id": 297, "start": 3523.1, "end": 3540.38, "text": "die Base. Exzellent. Manchmal versteht man die Battlefield-Logik nicht, ne? Okay. Nein,"}, {"id": 298, "start": 3540.38, "end": 3556.26, "text": "nein, nein, Panzer, Panzer, Panzer wegbleiben. Panzer, gehst du fort. War da oben was? Oh,"}, {"id": 299, "start": 3556.26, "end": 3560.7, "text": "der ist so low. Ein Hit noch, dann wär er down gewesen. Na, scheiß drauf, wir gehen"}, {"id": 300, "start": 3560.7, "end": 3574.02, "text": "einfach. Let's go. By the way, das ist normale Ticketanzahl. Nein, das ist normale Ticketanzahl."}, {"id": 301, "start": 3574.02, "end": 3580.22, "text": "Was, der Panzer kann dich nicht sehen, wenn du dich nicht bewegst. Das ist so wie, so"}, {"id": 302, "start": 3580.22, "end": 3593.54, "text": "wie der T-Rex aus Jurassic Park, oder wie? Oh, der geht ab hier, Mauskrone. Oh, oh, oh."}, {"id": 303, "start": 3593.54, "end": 3612.78, "text": "TKX. Okay, ich camp das jetzt hier mal ab. Na, ey, what? What? Das glaub ich jetzt nicht,"}, {"id": 304, "start": 3612.78, "end": 3617.22, "text": "dass es, dass es ein Jet war, der mich da drin aus der Mauer, ey, ist klar, ey, Alter,"}, {"id": 305, "start": 3617.22, "end": 3626.14, "text": "ey, ist klar, Leute, ist natürlich, natürlich. Streamsniper. Aber meine Teammates sind ja"}, {"id": 306, "start": 3626.14, "end": 3643.38, "text": "übelst big brain, also die gehen ja voll ab. Die sind huge. Okay, ich blicke hier nicht"}, {"id": 307, "start": 3643.38, "end": 3646.46, "text": "durch, was hier passiert gerade. Ich möchte einfach nur, Battlefield, ich will einfach"}, {"id": 308, "start": 3646.46, "end": 3654.22, "text": "nur durchs Fenster springen. Kann ich dich retzen? Ich guck mal, ob ich den holen kann."}, {"id": 309, "start": 3654.22, "end": 3667.7, "text": "Der ist draußen. Oh nein. Ah, Battlefield. Nein, der ist drin. Nein. Ich hab's versucht."}, {"id": 310, "start": 3667.7, "end": 3681.42, "text": "Ich hab's versucht. Oh, da waren Gegner. Noch mehr Gegner. Okay, jetzt big brain flank."}, {"id": 311, "start": 3681.42, "end": 3696.06, "text": "Huge, massive flank. What the? Ah, gibt's ja net. Sauerei. Hätte ich mich vielleicht"}, {"id": 312, "start": 3696.06, "end": 3704.94, "text": "vorher mal heilen sollen. Haben wir die, die Base haben wir auch schon. Mein Team ist,"}, {"id": 313, "start": 3704.94, "end": 3713.94, "text": "ist, also die sind ja, die sind ja Poggers. Poggers, Koggers, Zoggers, Alter. Die gehen"}, {"id": 314, "start": 3713.94, "end": 3734.82, "text": "ja hier durch wie nix. Okay, let's go. Oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh,"}, {"id": 315, "start": 3734.82, "end": 3761.34, "text": "oh, oh, oh, oh, oh, oh, oh, oh, oh. Jetzt Pusherino. Oh, da kommt einfach mal, einfach mal Panzer."}, {"id": 316, "start": 3762.24, "end": 3766.1, "text": "Ohohoho hemisphere fill the Facebook"}, {"id": 317, "start": 3767.22, "end": 3774.44, "text": "Ist ich frage mich grade war es in battlefile 3 nicht auch so dass man schneller gelaufen ist wenn man den den dv"}, {"id": 318, "start": 3775.9, "end": 3780.66, "text": "2 introduces cool earnımote 4 dabei hatte"}, {"id": 319, "start": 3783.98, "end": 3785.98, "text": "Alles klar"}, {"id": 320, "start": 3785.98, "end": 3790.9, "text": "Also in Bad Company 2 bin ich mir ziemlich sicher, dass man schneller gelaufen ist, wenn"}, {"id": 321, "start": 3790.9, "end": 3791.9, "text": "man den Defi draus hatte."}, {"id": 322, "start": 3791.9, "end": 3800.9, "text": "Mit Pistol, mit, in dem Game, ich bin mir nicht sicher ob mit Pistol, nee ich glaub"}, {"id": 323, "start": 3800.9, "end": 3802.14, "text": "das machte keinen Unterschied."}, {"id": 324, "start": 3802.14, "end": 3821.66, "text": "Aber ich glaub mit, mit Defi ist man ein Ticken schneller."}, {"id": 325, "start": 3821.66, "end": 3837.14, "text": "Das bilde ich mir zumindest ein."}, {"id": 326, "start": 3837.14, "end": 3838.14, "text": "Aber wie viele da oben sind?"}, {"id": 327, "start": 3838.14, "end": 3839.14, "text": "Links?"}, {"id": 328, "start": 3839.14, "end": 3840.14, "text": "Ah!"}, {"id": 329, "start": 3840.14, "end": 3861.3, "text": "Die holen wir jetzt, die werden jetzt geschreckt."}, {"id": 330, "start": 3861.3, "end": 3882.78, "text": "Next, okay den holen wir, oh da war ein Gegner, haha Noob Gegner alter, oh, oh, oh, oh, ooooh!"}, {"id": 331, "start": 3882.78, "end": 3887.34, "text": "Was mit den Gegnern los, wollen die sich grad von mir erschrecken lassen oder was?"}, {"id": 332, "start": 3887.34, "end": 3890.74, "text": "Denken die sich, oh da Max der muss mich mal bashen, ich hab da schon seit 5 Jahren drauf"}, {"id": 333, "start": 3890.74, "end": 3895.78, "text": "gewartet, dass der, dass der Max mich bashet, anders kann ich mir das grad nicht erklären"}, {"id": 334, "start": 3895.78, "end": 3897.02, "text": "was mit den Gegnern los ist."}, {"id": 335, "start": 3897.02, "end": 3919.82, "text": "Ah, shit, shit, shit, shit, nice, Monka ist, das ist ja anstrengend grad, letzte Base,"}, {"id": 336, "start": 3919.82, "end": 3924.82, "text": "können sie es mal wieder voll wissen, oh Leute gleich gibt es Mittagessen, dann ist der Spaß"}, {"id": 337, "start": 3924.82, "end": 3925.82, "text": "schon wieder vorbei."}, {"id": 338, "start": 3925.82, "end": 3949.7, "text": "Äh, alles klar Battlefield, alles klar, alles klar."}, {"id": 339, "start": 3949.7, "end": 3965.66, "text": "So ein geiler Panz-Panz-Man wäre gut, so ein geiler Panz-Man-Fahrer, streck deinen Kopf"}, {"id": 340, "start": 3965.66, "end": 3977.46, "text": "raus, streck deinen Kopf raus, Kopf, please, Kopf, Kopf, okay, dann gehen wir mal."}, {"id": 341, "start": 3977.46, "end": 3999.9, "text": "Wo, wo, wo, wo war der denn jetzt, ich hab nix gesehen, habt ihr den gesehen, wir haben"}, {"id": 342, "start": 3999.9, "end": 4004.86, "text": "alles gecheckt, jede Ecke aber nix da, war der ganz in der Ecke, kann das sein, dass"}, {"id": 343, "start": 4004.86, "end": 4033.62, "text": "der komplett, ganz, ganz in der Ecke war, oh ich kann da jetzt nicht hin, oh shit, okay"}, {"id": 344, "start": 4033.62, "end": 4051.14, "text": "ich bleib liegen, ihr könnt bei mir spawnen Leute, wenn ihr wollt, Alter, Alter, ich kann"}, {"id": 345, "start": 4051.14, "end": 4062.98, "text": "da nicht vor, ich krieg auf den Sack, wenn ich da vorgehe, ich krieg huge auf den Sack,"}, {"id": 346, "start": 4062.98, "end": 4083.7, "text": "nein, lasst ihr mich in Ruhe, ihr Kackschneiber, Kackschneibers, geht ihr fort, das war unfair,"}, {"id": 347, "start": 4083.7, "end": 4106.78, "text": "ich hab den durch die Wand gesehen, Alter, jetzt geht er ab, jetzt geht er ab, volle"}, {"id": 348, "start": 4106.78, "end": 4116.46, "text": "Purle, volle Purle, ran, ran, ran, ran, ran, ran, ran, run lege henne, lege henne, du L embarrassed,"}, {"id": 349, "start": 4116.46, "end": 4127.38, "text": "nein ich wollt gerade um die Ecke, die werdenDe, die kriegen gerade echt auf den Sack."}, {"id": 350, "start": 4127.38, "end": 4131.16, "text": "MonkaS hier, was ist hier los? Drei Spieler haben Gegner direkt vor einem"}, {"id": 351, "start": 4134.1, "end": 4136.1, "text": "Was ist mit den Gegnern los, Alter?"}, {"id": 352, "start": 4136.1, "end": 4150.02, "text": "Füße, Füße, ich seh Gegner Füße und ich seh Panzer"}, {"id": 353, "start": 4150.02, "end": 4169.78, "text": "Easy easy easy, man muss sagen ich hab auch ein saumäßig gutes Team, ne? Also GG, Teams"}, {"id": 354, "start": 4169.78, "end": 4177.26, "text": "Team, Teams, Teams mit Z. So eine Runde können wir vielleicht noch machen,"}, {"id": 355, "start": 4177.26, "end": 4183.22, "text": "danach muss ich essen, je nachdem was essen kommt. Döner-Pide-Lammer-Jun"}, {"id": 356, "start": 4183.22, "end": 4195.02, "text": "Nee, was erzähl ich für'n Schwachsinn, das hab ich gestern gegessen. Big Brain, Alter."}, {"id": 357, "start": 4195.02, "end": 4203.94, "text": "Jetzt hab ich Frikadellen mit Kartoffeln gibt's heute. Wenn das Game schon dein"}, {"id": 358, "start": 4203.94, "end": 4210.02, "text": "Hirn komplett kaputt macht. Döner-Pide-Lammer-Jun war gestern, heute ist Kartoffeln mit"}, {"id": 359, "start": 4210.02, "end": 4215.22, "text": "Frikadellen. Fünf Kopf, ja. Eigentlich schon, eigentlich schon sechs Kopf."}, {"id": 360, "start": 4218.86, "end": 4223.5, "text": "Eigentlich ist das war das schon eher so. Übrigens, ich muss mal schauen, ich hab"}, {"id": 361, "start": 4223.5, "end": 4228.02, "text": "nichts mitgekriegt im Chat, auch keine Subscri- Och nee, please, jetzt nicht so ne Kackmap noch"}, {"id": 362, "start": 4228.02, "end": 4238.3, "text": "hinten drauf. Ich weiß unpopuläre Meinung, ja. Ähm, ich glaub ich hab nix"}, {"id": 363, "start": 4238.3, "end": 4240.74, "text": "übersehen. Tribulan hat subscribt, acht Monate dankeschön."}, {"id": 364, "start": 4240.74, "end": 4249.14, "text": "Exzellent. Schwellst du immer, essen oder kocht wer für dich, mal so, mal so. Mal so,"}, {"id": 365, "start": 4249.14, "end": 4270.3, "text": "mal so. Na gut, dann spielen wir jetzt halt nochmal ne Runde Caspian Border. Wie hieß das Ding auf"}, {"id": 366, "start": 4270.3, "end": 4281.02, "text": "deutsch? War das Kaspische Grenze? Haben sie es so normal übersetzt? Einfach mal auf den Heli"}, {"id": 367, "start": 4281.02, "end": 4289.26, "text": "sprayen, weil man hittet schon mal was. Moment, der Heli ist da hinten abgestiegen, die kommen"}, {"id": 368, "start": 4289.26, "end": 4293.98, "text": "hier klar um die Ecke. Nee, der ist gestorben. Der Heli ist gestorben. Oder sind die hier,"}, {"id": 369, "start": 4293.98, "end": 4302.38, "text": "ich seh nix. Da bin ich mir jetzt nicht so ganz sicher. Oh, da kommt ein Panzer und ein Auto."}, {"id": 370, "start": 4302.38, "end": 4324.34, "text": "Oder auch nicht. Ah, Moment, wo... Oh, oh, oh, oh, oh, oh, ich war weg Gegner, ich war noch weg."}, {"id": 371, "start": 4324.34, "end": 4329.24, "text": "Habe ich auch mal gesagt, dass ich die Map nicht mag?"}, {"id": 372, "start": 4329.24, "end": 4333.34, "text": "Lull"}, {"id": 373, "start": 4333.34, "end": 4348.08, "text": "Oh, oh, oh, oh, oh, oh, oh, oh, ich habe Schiss leider"}, {"id": 374, "start": 4348.08, "end": 4357.86, "text": "Moment, dass ich da überhaupt was hitte, ich, ich spraye einfach random auf Gegner drauf"}, {"id": 375, "start": 4357.86, "end": 4369.26, "text": "äh, nope, jop, den Rest kriege ich leider nicht mehr raus, jetzt kannste knicken"}, {"id": 376, "start": 4369.26, "end": 4385.26, "text": "Panzer, hoffentlich sprengt er nicht das Ding hier in die Luft"}, {"id": 377, "start": 4385.26, "end": 4387.26, "text": "Hallo ich will dich markieren Tank"}, {"id": 378, "start": 4387.26, "end": 4399.26, "text": "Okay, nein, ist nicht, ist nicht erlaubt, ich darf ihn nicht retzen, nicht mal Warzone,"}, {"id": 379, "start": 4399.26, "end": 4404.34, "text": "ja, ja, Warzone, ich hab die letzten Wochen Warzone gespielt und ich muss mal wieder"}, {"id": 380, "start": 4404.34, "end": 4407.34, "text": "was spielen, wo ich normal, wo ich mich nicht über das Game aufrege."}, {"id": 381, "start": 4407.34, "end": 4430.14, "text": "Oh, die sind an A, A, A, A, A und hinter uns auch, der Heli Mann, steht hier hinten"}, {"id": 382, "start": 4430.14, "end": 4443.94, "text": "einer, nein, nein, bewegen, bewegen, bewegen, bewegen, bewegen, bewegen, oh, das war knapp"}, {"id": 383, "start": 4443.94, "end": 4458.5, "text": "Monka S, aber, aber, richtig Monka Giga war das, Monka Giga Deluxe, der Heli Mann, der"}, {"id": 384, "start": 4458.5, "end": 4464.62, "text": "Heli Mann ist nervig, aber alle Heli-Mans sind nervig in Battlefield, also vor allem Heli-Mans,"}, {"id": 385, "start": 4464.62, "end": 4476.1, "text": "die wissen, Heli-Mans, die wissen was sie machen, Heli-Mans, okay, ich bleib jetzt einfach"}, {"id": 386, "start": 4476.1, "end": 4477.1, "text": "hier sitzen."}, {"id": 387, "start": 4477.1, "end": 4487.38, "text": "Übrigens, Defender wird, äh, retzen total underrated, die sagen, ja, du hast ja endlich"}, {"id": 388, "start": 4487.38, "end": 4490.9, "text": "Tickets zum Respawn, aber das war noch kein Battlefield, so, gerade als Defender bist"}, {"id": 389, "start": 4490.9, "end": 4495.22, "text": "du darauf angewiesen, dass du am Objective bist, wenn was ist und nicht erst drei Kilometer"}, {"id": 390, "start": 4495.22, "end": 4499.62, "text": "laufen musst, also auch wenn du keine Tickets hast, weil natürlich ist bei, ist als Attacker"}, {"id": 391, "start": 4499.62, "end": 4522.98, "text": "auch wichtig, dass man, dass man, what the hell ist hier los, ey, ich weiß nicht von"}, {"id": 392, "start": 4522.98, "end": 4530.1, "text": "wo hier was ist, ich hab echt keinen Plan, aber mein Team macht das schon, Team ist gut,"}, {"id": 393, "start": 4530.1, "end": 4536.5, "text": "sagt man selten in Battlefield, ich weiß, oh nice, guckt mal, ich wäre sogar gerätzt,"}, {"id": 394, "start": 4536.5, "end": 4546.66, "text": "guckt euch das mal an, nein, ja aber leider nicht lang, elef77, weil gleich ist Essen"}, {"id": 395, "start": 4546.66, "end": 4553.66, "text": "da, da muss ich, muss ich auf, ich hätte ja gern noch mal eine Map gespielt, auf die"}, {"id": 396, "start": 4553.66, "end": 4567.26, "text": "ich Bock hab, ach, wir haben die Fused, exellent, und wir smokeen uns ein, auch gut, erstmal"}, {"id": 397, "start": 4567.26, "end": 4571.74, "text": "in, in, irgendwo, irgendwo in die Luft spotten und gucken, ob was abgeht, drüben geht auch"}, {"id": 398, "start": 4571.74, "end": 4599.34, "text": "nix, oh Jett, Jett, nix wie weg, ok mal gucken, ob wir die irgendwie geflankt kriegen, alter,"}, {"id": 399, "start": 4599.34, "end": 4608.54, "text": "was ist hier, übertreibt es halt, so Sachen hatte ich in Battlefield 1 und Battlefield"}, {"id": 400, "start": 4608.54, "end": 4613.46, "text": "5 nie, wo du so wirklich gedacht hast, was ist denn hier los, um nicht drum herum, ich,"}, {"id": 401, "start": 4613.46, "end": 4622.1, "text": "ich mache jetzt übrigens hier die, die, die runtergeier Deluxe Geschichte, ok oder auch"}, {"id": 402, "start": 4622.1, "end": 4632.46, "text": "nicht, runtergeiern Deluxe machen wir jetzt, erstmal verstecken bis er vorbei ist, jetzt"}, {"id": 403, "start": 4632.46, "end": 4647.18, "text": "runtergeiern Deluxe, hallo, Flairs geht weg, das Ding hatte nicht so eine große Range ne,"}, {"id": 404, "start": 4647.18, "end": 4665.3, "text": "ich spiele selten, ich kenne die Range nicht, die Range nicht, hallo, hallo, jetzt, oh nee,"}, {"id": 405, "start": 4665.3, "end": 4688.26, "text": "jetzt hat er auch geflährt, oh, oh, oh, oh, bam, null, nein, nein, nein, nein, nein, nein,"}, {"id": 406, "start": 4688.26, "end": 4697.66, "text": "nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, ich mag"}, {"id": 407, "start": 4697.66, "end": 4711.94, "text": "die Map nicht, wir haben es verloren, ich glaube es nicht, Jett, Jett, Jett, Jett, Jett, Jett,"}, {"id": 408, "start": 4711.94, "end": 4733.04, "text": "ich bin gebadet, Maxi spielt dieses Game immer noch geil, du kannst nichts sagen, der wird"}, {"id": 409, "start": 4733.04, "end": 4741.92, "text": "jetzt einfach klanlos runtergegeiert, ok, Game, alles klar, wenn es nicht trifft, dann"}, {"id": 410, "start": 4741.92, "end": 4770.24, "text": "Lul, ha ha, oh, oh, oh, die Waffe macht keinen Damage."}, {"id": 411, "start": 4770.24, "end": 4775.8, "text": "Ah, ich wollte mir, ich wollte mir das Medikit holen von dem ohne Wiederbeleben."}, {"id": 412, "start": 4775.8, "end": 4781.52, "text": "Oh, das ist ein bisschen viel. Vielleicht sollte ich die Engineer-Geschichte doch sein lassen"}, {"id": 413, "start": 4781.52, "end": 4786.04, "text": "und das spielen, was ich kann. Und Bashen."}, {"id": 414, "start": 4786.04, "end": 4796.08, "text": "Das ist die schlechte, ja die ist Kacke. Aber ich mag halt die MP5 an sich und deswegen,"}, {"id": 415, "start": 4796.08, "end": 4804.0, "text": "deswegen spiele ich die ganz gern, aber die sackt auch richtig. M4 beim Engineer ist beispielsweise"}, {"id": 416, "start": 4804.0, "end": 4805.24, "text": "echt zu gebrauchen."}, {"id": 417, "start": 4805.24, "end": 4816.12, "text": "Battlefield 3 Remake Gerüchte. Ich vermute ja wirklich, dass da was dran ist. Ich weiß"}, {"id": 418, "start": 4816.12, "end": 4819.6, "text": "aber nicht, ob es wirklich ein Battlefield 3 wird, weil die müssen die Zeit überbrücken"}, {"id": 419, "start": 4819.6, "end": 4824.72, "text": "bis Battlefield 6. Den bleibt nichts anderes übrig. Die haben Battlefield 5 viel zu früh"}, {"id": 420, "start": 4824.72, "end": 4828.0, "text": "abgesägt, also viel früher als sie letztendlich vorhatten."}, {"id": 421, "start": 4828.0, "end": 4835.6, "text": "Was ist denn das? Ah, die Drohnen-Stells. Viel früher als sie eigentlich vorhatten"}, {"id": 422, "start": 4835.6, "end": 4843.68, "text": "und dementsprechend. Was? What? Wie haben die das denn jetzt so schnell gekriegt?"}, {"id": 423, "start": 4843.68, "end": 4852.88, "text": "Konnte man das Haus kaputt machen, wo das Objective drin war? Das dachte, das ging nur"}, {"id": 424, "start": 4852.88, "end": 4870.16, "text": "in Bad Company 2. Oh, rechts war noch einer. Ob der Down ist da rechts? Hoffe ich mal."}, {"id": 425, "start": 4870.16, "end": 4875.72, "text": "Anscheinend, ich kriege nichts gespottet. Deswegen glaube ich, die Chance, dass wir"}, {"id": 426, "start": 4875.72, "end": 4884.36, "text": "einen Remaster Battlefield kriegen Ende des Jahres, ist gar nicht mal so gering. Ist der"}, {"id": 427, "start": 4884.36, "end": 4896.96, "text": "Dude auf dem Dach? What the fuck? Ich bin aber trotzdem der Meinung, Battlefield 3 braucht"}, {"id": 428, "start": 4896.96, "end": 4915.04, "text": "kein Remaster. Ich meine, wozu braucht das Game ein Remaster? Ist doch alles da. Ich"}, {"id": 429, "start": 4915.04, "end": 4918.44, "text": "checke nicht, wo die Gegner gerade sind. Das ist wirklich kein Big Brain Plays von den"}, {"id": 430, "start": 4918.44, "end": 4922.04, "text": "Gegnern. Ich habe keine Ahnung, wo irgendwas abgeht. Geiler ist, die anderen sehen die"}, {"id": 431, "start": 4922.04, "end": 4929.28, "text": "nicht. Besserer Netcode. Ich mag das eigentlich, ich finde das eigentlich ganz gut. Du hast"}, {"id": 432, "start": 4929.28, "end": 4936.08, "text": "halt das Problem manchmal, ja das stimmt schon, dass die Leute halt, was ist denn hier los"}, {"id": 433, "start": 4936.08, "end": 4961.08, "text": "da? Durchfliegen, ja, oder durch. Hinter uns, hinter uns, hinter uns. Nein, nein, nein, nein."}, {"id": 434, "start": 4961.08, "end": 4968.88, "text": "Na fuck, ich hätte ihn fast erwischt. Fast hätte ich ihn gehabt noch. Habt ihr das gesehen?"}, {"id": 435, "start": 4968.88, "end": 4974.48, "text": "Ganz knappe Geschichte. Ja, Xbox stimmt, auf der Xbox kannst du natürlich nicht spielen."}, {"id": 436, "start": 4974.48, "end": 4981.4, "text": "Die 360 Variante kannst du knicken. Habe ich schon mal gesagt, außer die letzten 20"}, {"id": 437, "start": 4981.4, "end": 4992.0, "text": "mal, in den letzten 5 Minuten, dass ich die Map nicht mag? Ich sag's nochmal, ich mag"}, {"id": 438, "start": 4992.0, "end": 5010.74, "text": "keine"}, {"id": 439, "start": 5010.74, "end": 5031.66, "text": "Wir verpissen uns mal hier kurz."}, {"id": 440, "start": 5031.66, "end": 5047.94, "text": "Oh ne, gemessert, da wird er gemessert."}, {"id": 441, "start": 5047.94, "end": 5058.42, "text": "Ja das, wenn die nur den Singleplayer remastern, wäre das mal absolut Lowbrainer, richtig Lowbrainer."}, {"id": 442, "start": 5058.42, "end": 5063.38, "text": "Ich glaub die sind schon am Start hier teilweise."}, {"id": 443, "start": 5063.38, "end": 5068.58, "text": "Ja, im Teppichmesser."}, {"id": 444, "start": 5068.58, "end": 5075.5, "text": "So wie sie es in MW2 gemacht haben, erstmal Singleplayer remastern."}, {"id": 445, "start": 5075.5, "end": 5079.06, "text": "Wahrscheinlich weil es der geringste Aufwand war, keine Ahnung."}, {"id": 446, "start": 5079.06, "end": 5082.26, "text": "Hab ich da grad Gegner gesehen auf der Map rechts außen?"}, {"id": 447, "start": 5082.26, "end": 5084.54, "text": "Kann das sein?"}, {"id": 448, "start": 5084.54, "end": 5086.22, "text": "Kann das sein, dass ich da Gegner sehe?"}, {"id": 449, "start": 5086.22, "end": 5095.9, "text": "Nein, nein, nein, nein, ach mann, warum, den hätte ich jetzt erwischen, der geht jetzt"}, {"id": 450, "start": 5095.9, "end": 5097.34, "text": "legen, der macht jetzt lege Henne."}, {"id": 451, "start": 5097.34, "end": 5112.38, "text": "Oh, excellent, excellent, ok ich komm mit vor, das Sounds Master, das Saurus, das Saurus"}, {"id": 452, "start": 5112.38, "end": 5117.3, "text": "Master, nicht das Saurus, Saurus."}, {"id": 453, "start": 5117.3, "end": 5122.5, "text": "Truckus Saurus Rex, kennt das noch jemand aus der World Company 2 Kampagne, diesen Monster"}, {"id": 454, "start": 5122.5, "end": 5123.5, "text": "Truck?"}, {"id": 455, "start": 5123.5, "end": 5137.02, "text": "Der Truckus, oh meine Güte ey, der Truckus Saurus Rex, ok Leute, die machen uns, die"}, {"id": 456, "start": 5137.02, "end": 5164.38, "text": "machen uns platt, jetzt ist die Munition alle, jetzt ist die Munition alle, oh, oh, what,"}, {"id": 457, "start": 5164.38, "end": 5171.7, "text": "ok, alles klar, ja, Map, please, ich muss mal kurz gucken, ob das Essen fertig ist, bin"}, {"id": 458, "start": 5171.7, "end": 5201.46, "text": "ich gleich wieder am Start, so, Essen ist noch nicht am Start, ich muss mal kurz gucken,"}, {"id": 459, "start": 5201.46, "end": 5230.34, "text": "ob das Essen fertig ist, ich muss mal kurz schauen, ob das Essen fertig ist, ich muss"}, {"id": 460, "start": 5230.34, "end": 5233.02, "text": "kurze sache die runden waren aber trotzdem cool auch wenn wir zwei maps"}, {"id": 461, "start": 5233.02, "end": 5234.78, "text": "gespielt haben auf die ich überhaupt keinen bock hatte"}, {"id": 462, "start": 5234.78, "end": 5239.66, "text": "firestorm und claspion border die nervigsten maps überhaupt für mich"}, {"id": 463, "start": 5239.66, "end": 5260.98, "text": "mal gucken vielleicht spielen wir nachher weiter bis denn cu machts gut"}]}