{"text": "So Leute, auf gehts, kurz Klimaanlage einschalten, ziemlich ganz schön warm, 23 Grad ist ok,aktuell ist 26 Grad hier im Arbeitszimmer, 23 Grad ist wunderbar, exzellent.Was ist denn hier los? Der Umole sagt, er ist fast am sterben, weil seine Daten verschlüsselt wurden,warum wurden denn seine Daten verschlüsselt? Wer hatte heute auch Prüfung? Das letzte Malhatten relativ viele Prüfungen, wie es heute aussieht, das ist eine gute Frage. Prüfungenin was denn? Auch Fachinformatiker, Systemintegration, Anwendungsentwicklung oderirgendwas anderes, eventuell sogar Informatikkaufmann oder sowas. So was einschenken,aha, Baden-Württemberg. In my home country Baden-Württemberg we say we are all sitting in one boat.Als erstes muss ich jetzt immer an Baden-Württemberg dran denken muss.Gibt es den eigentlich noch? So einen geilen Digital-Kommissar.Chat, ich habe heute echt meinen Augen nicht getraut, als ich das gelesen habe. Schaut mal.Ja, ich habe meinen Augen heute nicht getraut. Es gibt jetzt den Windows Defender für Linux.Ist das nicht kostenpflichtig? Keine Ahnung, ich hoffe nicht. Wenn es was kostet, könnenwir es nicht ausprobieren. So, und da habe ich mir mal Gedanken drüber gemacht. Warum eigentlich?Und ich bin zu dem Schluss gekommen, das ist gar nicht so dumm. Warum ist das gar nicht so dumm?Weil es viele Leute gibt, die Fileserver für Windows-Dateien bereitstellen und da ist so einWindows Defender nicht übel. Also wir werden jetzt folgendes ausprobieren. Wir installierenuns mal ein aktuelles Ubuntu, weil es gibt es hier für Ubuntu, Susie, Debian, CentOS. Wirinstallieren jetzt ein aktuelles Ubuntu oder besser Jubuntu. Installieren den Windows Defenderdrauf, checken mal, ob das eine Zip-Bombe erkennt, ob das vielleicht sogar ein Skript mit Fork-Bombeirgendwie meldet. Mal schauen. Dann probieren wir mal ein paar oldschool Viren-Samples aus,ob es das erkennt. Und dann probieren wir mal was Sinnvolles, nämlich wir machen einen Samba-Serverund schauen, ob der Windows-Dateien erkennt, die ich über Samba draufschreibe. Weil dafür wäredas wirklich sehr sinnvoll. So doof es erstmal klingt, Windows Defender für Linux. Klingt jaerstmal total hängen geblieben, ne? Aber wenn du ein Fileserver für Windows hast, und wie vieleLeute haben in irgendeiner Firma Fileserver stehen und die Leute schieben reinweise irgendwelchenExcel-Kram da drauf oder irgendwelche Word-Dokumente, PDFs, alle möglichen Krams. Bei uns derFileserver auf der Arbeit ist zur Hälfte voll mit irgendwelchen sinnlosen PowerPoint-Präsentationen.Und wenn dort irgendwelche Viren drin sind oder wenn Leute irgendwelche Zip-Files drauflegen,was auch immer, dort ab und zu mal zu scannen, ob da jemand sinnvoll virenbefallende Dateienablegt oder gar absichtlich irgendwelche Viren draufliegt, ist gar nicht doof. Oh,ich hab noch den Excited-Counter drin, den müssen wir wegmachen. Ja, excellent chat.Ich glaube, das ist gar nicht so blöd. Das werden wir mal ausprobieren, ob das funktioniert.So wie ich die Microsoft-Geschichten allerdings kenne, funktioniert die Hälfte nicht von dem,was ich für selbstverständlich halte. Ich erinnere nochmal an den Paketmanager von Microsoft,der nicht Pakete deinstallieren kann. Wer erinnert sich noch dran? Ich meine, wozubrauche ich einen Paketmanager, der Sachen nicht deinstallieren kann? Das ist Microsoft-Logik.EndoFunctionZero, ja wahrscheinlich erkennt er die. Also ich gehe davon aus, dass er die erkennt.So, da haben wir mal das aktuelle runter. Nehmen wir ein Ubuntu-Server-Installer. Ichwill den Alternate-Installer. Wo ist der Alternate-Installer? Der Server-Installersackt. Live-Server-Installer, das ist übelst. Wo ist das Alternate-Image? Ich rede nicht von dem Hardware-Versand. Wo ist das Alternate-Server?Gibt es dafür nicht Klamm-AV? Ja, aber Klamm-AV würde ich nur nehmen, wenn es sonst gar nichts gibt.Ich will nicht, ich will den Alternate-Server-Installer. Wo ist er denn? Bin ich jetzt blöd? Wo ist er?Wo ist denn jetzt das aktuelle Ubuntu-LTS-Server? Der Oldschool-Installer. Der Live-Installer, ich finde das sackt richtig.Gibt es das nicht mehr? Ah, hier doch ein Network-Installer. Mein Live-Installer? Nein, ich will den ganz normalen.Bin ich jetzt total besch... Gibt es das nicht mehr? Ah, Moment, Moment, Moment.Alle Images hier. Das hatte ich doch gerade. Nee, Moment. Das gibt es nicht mehr. Kann das sein, dass es das nicht mehr gibt?Es gab doch immer noch den ganz normalen... Also ich will nicht den Live-Server-Installer haben, ich will den ganz normalen Server-Installer haben.Okay, mal 18.04. Vielleicht gibt es das nicht mehr.Ist das ein anderes? Ist das der Net-Installer? Ach. Das... Seit wann denn das?Seit wann haben sie das denn gemacht? Nein, nein, nicht den Live-Installer.Die haben keine Alternate-Installer mehr. Die gab es doch noch. Wir haben doch letzten Session 18.04 Alternate-Dings installiert.Bin ich jetzt total wirr. Wo ist das hin?2012. Nee, der Live-Installer... Okay, wir probieren den Live-Installer aus. Aber der Live-Installer sackt übelst.Okay, probieren wir mal. Vielleicht ist der jetzt besser. Vielleicht ist der jetzt besser als davor. Ja. Probieren wir mal. Machen wir. Machen wir einfach. Ist egal.Wir brauchen den Download-Ordner noch ein Ubuntu-Image. Jubantu. Die Windows ISO löschen wir mal. Die brauchen wir jetzt nicht. Und verbrauchen nur Platz.So, gut. Ich mache mal meine Frage mit Logtool an, weil ansonsten vergesse ich wieder die Hälfte. Leaked. Es ist ja kein Recording-Ordner.Äh, alles klar. Sonst nimm doch Debian. Nee, ich will schon einen Ubuntu-Server, aber ich frage mich, wo der Alternate-Installer hin ist.Kannst du bei Gelegenheit nochmal erzählen, was man als DevOps eigentlich im Vergleich zu normalen Programmieren macht?Naja, man macht halt mehr Ops. Noch zusätzlich. Man kümmert sich zum Beispiel um Versionsverwaltung von Software, um irgendwelche automatisierten Server-Config, Paket-Updates, automatisierte Build-Pipelines.Nachdem das jetzt noch nicht so alt ist, und da jeder ein bisschen was anderes darunter versteht, ist das schwierig zu erklären. Ich habe mal ein Video gemacht bei mir auf YouTube, wo ich erkläre, was ich zum Beispiel den ganzen Tag mache.Okay. Exzellent. So, ist der Download fertig? Hallo? Ah. Äh. Moment, wie viel verschiebt man den Gramm nochmal auf den unterschiedlichen Desktops so?Windows-Logik. Bei I3 ist es ganz einfach. Shift, Windows-Taste, 1, 2, 3, 4, zack, verschoben. Easy as fuck, aber unter Windows muss man das mit der Maus machen.Monkais. Easy as fuck.Ja, Container-Zeug ist auch gerade voll angesagt. Ja, richtig.Äh, Taste ist doch gut, da kannst du dich ausruhen. Du musst jetzt nicht mehr vortäuschen, als dass du da großartig was machst.Der Desktop, der sieht so aus, weil der Chat die ganzen Bildchen haben will. An mir liegt es doch nicht. Das liegt wie immer alles am...Lull. Demnächst.Was haltet ihr vom neuen GitHub-Design? Ich habe das noch gar nicht gesehen. Wie sieht denn das neue GitHub aus?Das sieht immer noch genauso aus. Ich erkenne da keinen Unterschied.Lull.Ah, doch. Es sieht anders aus, tatsächlich.Die machen das richtig mit dem Redesign. Das Redesign sieht fast genauso aus wie das alte, nur dass es jetzt hier oben durchgängig ist. Und so muss es auch machen. Wenn du so diese kompletten Redesign-Geschichten machst, so wie das Twitter und YouTube ab und zu machen, fuckst du nur die Leute ab.Windows-Defender. Ja, tatsächlich gibt es das jetzt für Linux. Ich finde das okay. Es sieht fast noch genauso aus wie vorher. Du hast hier oben ein bisschen mehr Platz, das finde ich ganz praktisch. Und ansonsten ist es sehr dezent, das Redesign.Finde ich gut. Passt. Ich hätte mir vielleicht ein bisschen bessere Abgrenzungen gewünscht. Dieses Hellblau auf Weiß, das sticht jetzt nicht sonderlich heraus. Und auch die dünne Schrift auf den Buttons. Also ich finde, man hätte das ein bisschen lesbarer machen können, das Ganze. Aber es geht schon in Ordnung. Ich meine, im Endeffekt kann ich den Kram einfach ein bisschen größer machen und gut ist.Dann passt es wieder. Das scale auch besser auf breiten Bildschirmen. Finde ich ganz gut. Also so musst du Redesigns machen. Kleine Häppchen und dann nicht zu sehr vom Original weg, sonst fuckt es die Leute übelst ab.Und so sieht das doch ganz praktisch aus. So, dann legen wir uns mal eine Ubuntu VM an und gucken wir mal, ob der neue Installer taugt. Custom, Workstation, Installer haben wir später. Linux, Ubuntu 64. Das Ganze installieren wir unter E. Machen neuen Folder, keine Ahnung.Ubuntu. 3 CPU Kerne sollte reichen. 4096 sollte auch reichen. Das bridgeen wir mal, weil ich will nachher gucken, ob man da vom Netzwerk drauf zugreifen kann.Hat GitHub einen Darkmode? Ehrlich gesagt keine Ahnung. Ich habe Darkreader drin. Aber mittlerweile haben sehr viele einen Darkmode. Mich würde nicht wundern, wenn GitHub auch einen Darkmode hätte.Übrigens, also was wir jetzt testen ist, wie gesagt, wir probieren den Windows Defender mal unter Ubuntu aus. Dann installieren wir einen Samba Server, gucken, ob der Windows Viren auf einem Dateiserver, auf einem Falschserver findet.Das dürfte so eines der Hauptanwendungszwecke eigentlich sein für Windows Defender oder die Windows Defender unter Linux. Und zum Schluss testen wir mal, aber eher so just for fun, ob Windows Defender unter WSL unter Windows läuft.Da bin ich mal gespannt. Was für einen Darkreader hast du, der der Darkreader heißt?Ich werde Windows Defender unter Windows über WSL laufen zu lassen. Das ist natürlich schon Next Level.CD, ISO Image, Download, Tempkeck. Warum steht da Tempkeck drin? Das haben wir in einem Stream mal 10 Minuten gemacht. Downloads, Ubuntu Server, Live Installer. Fertig mit Download. Ja, ist er. Excellent.Ach ja, und der Drucker muss weg. Finish.I finished Installing. So wie gesagt, ich habe als er neu war den Live Installer ausprobiert und der hat mir überhaupt nicht gefallen. Der ging mir voll auf den Sack. Deswegen habe ich immer den Alternate Installer verwendet und den gibt es jetzt anscheinend nicht mehr.Was zum Geier passiert da überhaupt gerade im Hintergrund? Cloud Init.Wie gesagt, als Darkreader habe ich das Ding, was sich Darkreader nennt. Hat GitHub Dark Mode. Weiß ich, ob die sowas offiziell haben.Naja, scheint nicht.Ok, das ist immer noch so ungewohnt auf jeden Fall. Ok, Englisch. Update to new Installer.Der Installer kann sich live updaten. Das ist natürlich schon mal Big Brain. Braucht man für den Defender auf Linux nicht eine Subscription? Das wäre ziemlich fail, da können wir es nämlich nicht ausprobieren.Download freigegeben.Moment, brauchen wir da wirklich eine Free Trial? Das können wir machen. Wir machen eine Trial.Ist auch ok.Wait, was ist das wieder für ein Satz?Wir machen uns einfach einen Microsoft Fake Account und Gutes. Juckt mich da nicht.Wir werden es gleich sehen.Wo kann ich es denn downloaden überhaupt?Oder besser gesagt, wie installiere ich es überhaupt?How to get started? Microsoft requires Microsoft Defender ATP for Server License.To get started.Manual Deployment. Ja, das probieren wir dann aus.Ja, und wo kann man sich registrieren? Das ist schon wieder typisch Microsoft. Microsoft verwirrend gemacht, Alter.Kostenlose Testversion anfordern.Muss das noch ein Mensch angucken oder was?Das ist die falsche. Das ist nicht die richtige Ten Minute Mail.Das ist die bessere Ten Minute Mail.Das zeigt man ja. First Name. Max Wobels. Das Phone. Null.Company Name. Null. Job Title. Ich bin System Solution Architekt.United States, Germany. Gehen wir mal richtig an. Number of PCs 1. What other security optional? Microsoft. Macht, macht was er wollte.Was? Was? 4 J M W D H J X K D. Alles klar.Was? Nein.Das ist nicht euer Ernst, oder?Ok Leute, Stream zu Ende.Die wollen das echt noch von Hand machen. Ist das euer Ernst?Ach du Scheiße.Jetzt weiß ich auch warum ich Microsoft Zeug nicht gerne verwende.Fuck.Ja.Dann gehe ich jetzt Path of Exile spielen, Leute.Funktioniert nicht, was wir vorhaben.Tja. Microsoft. Dann nicht.Schubandu. Weg damit.Remove.Tja. Microsoft. Dann nicht.Ich hätte euch jetzt die Chance gegeben, dass das funktioniert.Ob die Chance gegeben, euch mal angucke, wie es funktioniert. Aber. Hallo.Ah. Exzellent. Microsoft.Ähm. Na mal gucken, vielleicht sind sie auch schneller.Ja, keine Chance.Streamtitel ändern? Nee. Auf was?Ich hab großartig irgendwelche Big Brain Sachen, da hab ich heute echt keinen Bock mehr drauf, was zu machen.Platter Webseine.Vielleicht ist er schief.Windows, Leute.Welche NAS-Distro kannst du empfehlen?Ehrlich gesagt gar keine.Ich hab die meisten ausprobiert von FreeNAS bis äh.Wie heißt das so? Rock Store und alle möglichen Sachen.Dann fahre ich immer noch von Hand. Installiert.Das geht mir jetzt voll. Warum ist Microsoft denn wieder so scheiße?Ich mein, warum lassen sie das die Leute nicht einfach mal ausprobieren?Es ist ja nicht so, als wartet die Welt jetzt drauf, dass es Microsoft Windows Defender für Linux gibt.Tja.Ja, aber Sebaro, da braucht man eine Lizenz dafür.Bei uns installiert man es unter Ubuntu.Hier, installieren Sie den öffentlichen Microsoft-PGP-Schlüssel. Blablabla.Ja.Onboard Linux Server Machines. Was ist das für ein Schwachsinn?Kennste schon Excellent Solutions? Nein, kenn ich nicht.Also man installiert das und dann muss man irgendwelche...Das wird jetzt wieder so voll unlinux-mäßig gemacht, was Microsoft da treibt.Ah, ist das kacke. Nö. Dann war es voll für'n Arsch.Dann können wir uns das heute im Stream nicht machen, wenn wir uns da registrieren müssen.Leute, ich geh jetzt Path of Exile spielen. Das ist mir zu dumm, Microsoft. Hab ich keinen Bock drauf.Ich weiß auch nicht, was ich sonst heute machen soll. Ich hab mir nix überlegt, großartig.Nee, Path of Exile spiele ich nicht im Stream. Das ist langweilig und außerdem weiß ich selbst teilweise nicht, was ich treibe.Also es sei denn, irgendjemand hätte eine super zündende Idee, was wir machen könnten.Aber mir fällt gerade für heute nix ein. Ich hab jetzt auch nicht so wahnsinnig viel Big-Prain-Kapazität, um da jetzt komplizierte Sachen neu zu machen.Äh, RTX Voice. Hab ich halt keinen Bock drauf.Nein, POE Stream ist nicht. WordPress? Nein, nein, nein.Egal, Leute. Ich geh auf. Bis denn. See you.", "segments": [{"id": 1, "start": 120.0, "end": 139.68, "text": "So Leute, auf gehts, kurz Klimaanlage einschalten, ziemlich ganz schön warm, 23 Grad ist ok,"}, {"id": 2, "start": 139.68, "end": 145.28, "text": "aktuell ist 26 Grad hier im Arbeitszimmer, 23 Grad ist wunderbar, exzellent."}, {"id": 3, "start": 145.28, "end": 155.72, "text": "Was ist denn hier los? Der Umole sagt, er ist fast am sterben, weil seine Daten verschlüsselt wurden,"}, {"id": 4, "start": 155.72, "end": 169.0, "text": "warum wurden denn seine Daten verschlüsselt? Wer hatte heute auch Prüfung? Das letzte Mal"}, {"id": 5, "start": 169.0, "end": 173.08, "text": "hatten relativ viele Prüfungen, wie es heute aussieht, das ist eine gute Frage. Prüfungen"}, {"id": 6, "start": 173.08, "end": 177.16, "text": "in was denn? Auch Fachinformatiker, Systemintegration, Anwendungsentwicklung oder"}, {"id": 7, "start": 177.16, "end": 193.88, "text": "irgendwas anderes, eventuell sogar Informatikkaufmann oder sowas. So was einschenken,"}, {"id": 8, "start": 193.88, "end": 203.0, "text": "aha, Baden-Württemberg. In my home country Baden-Württemberg we say we are all sitting in one boat."}, {"id": 9, "start": 203.0, "end": 208.56, "text": "Als erstes muss ich jetzt immer an Baden-Württemberg dran denken muss."}, {"id": 10, "start": 208.56, "end": 215.0, "text": "Gibt es den eigentlich noch? So einen geilen Digital-Kommissar."}, {"id": 11, "start": 215.0, "end": 231.04, "text": "Chat, ich habe heute echt meinen Augen nicht getraut, als ich das gelesen habe. Schaut mal."}, {"id": 12, "start": 231.04, "end": 255.0, "text": "Ja, ich habe meinen Augen heute nicht getraut. Es gibt jetzt den Windows Defender für Linux."}, {"id": 13, "start": 255.0, "end": 271.96, "text": "Ist das nicht kostenpflichtig? Keine Ahnung, ich hoffe nicht. Wenn es was kostet, können"}, {"id": 14, "start": 271.96, "end": 281.32, "text": "wir es nicht ausprobieren. So, und da habe ich mir mal Gedanken drüber gemacht. Warum eigentlich?"}, {"id": 15, "start": 281.32, "end": 288.04, "text": "Und ich bin zu dem Schluss gekommen, das ist gar nicht so dumm. Warum ist das gar nicht so dumm?"}, {"id": 16, "start": 288.04, "end": 294.68, "text": "Weil es viele Leute gibt, die Fileserver für Windows-Dateien bereitstellen und da ist so ein"}, {"id": 17, "start": 294.68, "end": 300.12, "text": "Windows Defender nicht übel. Also wir werden jetzt folgendes ausprobieren. Wir installieren"}, {"id": 18, "start": 300.12, "end": 307.4, "text": "uns mal ein aktuelles Ubuntu, weil es gibt es hier für Ubuntu, Susie, Debian, CentOS. Wir"}, {"id": 19, "start": 307.4, "end": 317.04, "text": "installieren jetzt ein aktuelles Ubuntu oder besser Jubuntu. Installieren den Windows Defender"}, {"id": 20, "start": 317.04, "end": 323.8, "text": "drauf, checken mal, ob das eine Zip-Bombe erkennt, ob das vielleicht sogar ein Skript mit Fork-Bombe"}, {"id": 21, "start": 323.8, "end": 329.8, "text": "irgendwie meldet. Mal schauen. Dann probieren wir mal ein paar oldschool Viren-Samples aus,"}, {"id": 22, "start": 329.8, "end": 338.24, "text": "ob es das erkennt. Und dann probieren wir mal was Sinnvolles, nämlich wir machen einen Samba-Server"}, {"id": 23, "start": 338.24, "end": 345.24, "text": "und schauen, ob der Windows-Dateien erkennt, die ich über Samba draufschreibe. Weil dafür wäre"}, {"id": 24, "start": 345.24, "end": 350.52, "text": "das wirklich sehr sinnvoll. So doof es erstmal klingt, Windows Defender für Linux. Klingt ja"}, {"id": 25, "start": 350.52, "end": 354.76, "text": "erstmal total hängen geblieben, ne? Aber wenn du ein Fileserver für Windows hast, und wie viele"}, {"id": 26, "start": 354.76, "end": 359.12, "text": "Leute haben in irgendeiner Firma Fileserver stehen und die Leute schieben reinweise irgendwelchen"}, {"id": 27, "start": 359.12, "end": 365.36, "text": "Excel-Kram da drauf oder irgendwelche Word-Dokumente, PDFs, alle möglichen Krams. Bei uns der"}, {"id": 28, "start": 365.36, "end": 369.28, "text": "Fileserver auf der Arbeit ist zur Hälfte voll mit irgendwelchen sinnlosen PowerPoint-Präsentationen."}, {"id": 29, "start": 369.28, "end": 378.92, "text": "Und wenn dort irgendwelche Viren drin sind oder wenn Leute irgendwelche Zip-Files drauflegen,"}, {"id": 30, "start": 378.92, "end": 386.64, "text": "was auch immer, dort ab und zu mal zu scannen, ob da jemand sinnvoll virenbefallende Dateien"}, {"id": 31, "start": 386.64, "end": 392.48, "text": "ablegt oder gar absichtlich irgendwelche Viren draufliegt, ist gar nicht doof. Oh,"}, {"id": 32, "start": 392.48, "end": 398.36, "text": "ich hab noch den Excited-Counter drin, den müssen wir wegmachen. Ja, excellent chat."}, {"id": 33, "start": 398.36, "end": 404.24, "text": "Ich glaube, das ist gar nicht so blöd. Das werden wir mal ausprobieren, ob das funktioniert."}, {"id": 34, "start": 404.24, "end": 411.32, "text": "So wie ich die Microsoft-Geschichten allerdings kenne, funktioniert die Hälfte nicht von dem,"}, {"id": 35, "start": 411.32, "end": 415.68, "text": "was ich für selbstverständlich halte. Ich erinnere nochmal an den Paketmanager von Microsoft,"}, {"id": 36, "start": 415.68, "end": 421.2, "text": "der nicht Pakete deinstallieren kann. Wer erinnert sich noch dran? Ich meine, wozu"}, {"id": 37, "start": 421.2, "end": 426.72, "text": "brauche ich einen Paketmanager, der Sachen nicht deinstallieren kann? Das ist Microsoft-Logik."}, {"id": 38, "start": 426.72, "end": 441.48, "text": "EndoFunctionZero, ja wahrscheinlich erkennt er die. Also ich gehe davon aus, dass er die erkennt."}, {"id": 39, "start": 441.48, "end": 453.36, "text": "So, da haben wir mal das aktuelle runter. Nehmen wir ein Ubuntu-Server-Installer. Ich"}, {"id": 40, "start": 453.36, "end": 461.92, "text": "will den Alternate-Installer. Wo ist der Alternate-Installer? Der Server-Installer"}, {"id": 41, "start": 461.92, "end": 474.52, "text": "sackt. Live-Server-Installer, das ist übelst. Wo ist das Alternate-Image? Ich rede nicht von dem Hardware-Versand. Wo ist das Alternate-Server?"}, {"id": 42, "start": 474.52, "end": 486.28, "text": "Gibt es dafür nicht Klamm-AV? Ja, aber Klamm-AV würde ich nur nehmen, wenn es sonst gar nichts gibt."}, {"id": 43, "start": 486.28, "end": 500.44, "text": "Ich will nicht, ich will den Alternate-Server-Installer. Wo ist er denn? Bin ich jetzt blöd? Wo ist er?"}, {"id": 44, "start": 500.44, "end": 522.88, "text": "Wo ist denn jetzt das aktuelle Ubuntu-LTS-Server? Der Oldschool-Installer. Der Live-Installer, ich finde das sackt richtig."}, {"id": 45, "start": 522.88, "end": 542.56, "text": "Gibt es das nicht mehr? Ah, hier doch ein Network-Installer. Mein Live-Installer? Nein, ich will den ganz normalen."}, {"id": 46, "start": 542.56, "end": 554.56, "text": "Bin ich jetzt total besch... Gibt es das nicht mehr? Ah, Moment, Moment, Moment."}, {"id": 47, "start": 572.56, "end": 588.56, "text": "Alle Images hier. Das hatte ich doch gerade. Nee, Moment. Das gibt es nicht mehr. Kann das sein, dass es das nicht mehr gibt?"}, {"id": 48, "start": 588.56, "end": 610.16, "text": "Es gab doch immer noch den ganz normalen... Also ich will nicht den Live-Server-Installer haben, ich will den ganz normalen Server-Installer haben."}, {"id": 49, "start": 610.16, "end": 626.16, "text": "Okay, mal 18.04. Vielleicht gibt es das nicht mehr."}, {"id": 50, "start": 626.16, "end": 650.16, "text": "Ist das ein anderes? Ist das der Net-Installer? Ach. Das... Seit wann denn das?"}, {"id": 51, "start": 650.16, "end": 676.16, "text": "Seit wann haben sie das denn gemacht? Nein, nein, nicht den Live-Installer."}, {"id": 52, "start": 676.16, "end": 684.16, "text": "Die haben keine Alternate-Installer mehr. Die gab es doch noch. Wir haben doch letzten Session 18.04 Alternate-Dings installiert."}, {"id": 53, "start": 684.16, "end": 698.16, "text": "Bin ich jetzt total wirr. Wo ist das hin?"}, {"id": 54, "start": 698.16, "end": 708.16, "text": "2012. Nee, der Live-Installer... Okay, wir probieren den Live-Installer aus. Aber der Live-Installer sackt übelst."}, {"id": 55, "start": 708.16, "end": 720.16, "text": "Okay, probieren wir mal. Vielleicht ist der jetzt besser. Vielleicht ist der jetzt besser als davor. Ja. Probieren wir mal. Machen wir. Machen wir einfach. Ist egal."}, {"id": 56, "start": 720.16, "end": 734.16, "text": "Wir brauchen den Download-Ordner noch ein Ubuntu-Image. Jubantu. Die Windows ISO löschen wir mal. Die brauchen wir jetzt nicht. Und verbrauchen nur Platz."}, {"id": 57, "start": 734.16, "end": 746.16, "text": "So, gut. Ich mache mal meine Frage mit Logtool an, weil ansonsten vergesse ich wieder die Hälfte. Leaked. Es ist ja kein Recording-Ordner."}, {"id": 58, "start": 746.16, "end": 760.16, "text": "Äh, alles klar. Sonst nimm doch Debian. Nee, ich will schon einen Ubuntu-Server, aber ich frage mich, wo der Alternate-Installer hin ist."}, {"id": 59, "start": 760.16, "end": 766.16, "text": "Kannst du bei Gelegenheit nochmal erzählen, was man als DevOps eigentlich im Vergleich zu normalen Programmieren macht?"}, {"id": 60, "start": 766.16, "end": 783.16, "text": "Naja, man macht halt mehr Ops. Noch zusätzlich. Man kümmert sich zum Beispiel um Versionsverwaltung von Software, um irgendwelche automatisierten Server-Config, Paket-Updates, automatisierte Build-Pipelines."}, {"id": 61, "start": 783.16, "end": 808.16, "text": "Nachdem das jetzt noch nicht so alt ist, und da jeder ein bisschen was anderes darunter versteht, ist das schwierig zu erklären. Ich habe mal ein Video gemacht bei mir auf YouTube, wo ich erkläre, was ich zum Beispiel den ganzen Tag mache."}, {"id": 62, "start": 808.16, "end": 822.16, "text": "Okay. Exzellent. So, ist der Download fertig? Hallo? Ah. Äh. Moment, wie viel verschiebt man den Gramm nochmal auf den unterschiedlichen Desktops so?"}, {"id": 63, "start": 822.16, "end": 832.16, "text": "Windows-Logik. Bei I3 ist es ganz einfach. Shift, Windows-Taste, 1, 2, 3, 4, zack, verschoben. Easy as fuck, aber unter Windows muss man das mit der Maus machen."}, {"id": 64, "start": 832.16, "end": 838.16, "text": "Monkais. Easy as fuck."}, {"id": 65, "start": 838.16, "end": 845.16, "text": "Ja, Container-Zeug ist auch gerade voll angesagt. Ja, richtig."}, {"id": 66, "start": 845.16, "end": 861.16, "text": "Äh, Taste ist doch gut, da kannst du dich ausruhen. Du musst jetzt nicht mehr vortäuschen, als dass du da großartig was machst."}, {"id": 67, "start": 861.16, "end": 870.16, "text": "Der Desktop, der sieht so aus, weil der Chat die ganzen Bildchen haben will. An mir liegt es doch nicht. Das liegt wie immer alles am..."}, {"id": 68, "start": 870.16, "end": 877.16, "text": "Lull. Demnächst."}, {"id": 69, "start": 877.16, "end": 883.16, "text": "Was haltet ihr vom neuen GitHub-Design? Ich habe das noch gar nicht gesehen. Wie sieht denn das neue GitHub aus?"}, {"id": 70, "start": 883.16, "end": 899.16, "text": "Das sieht immer noch genauso aus. Ich erkenne da keinen Unterschied."}, {"id": 71, "start": 899.16, "end": 913.16, "text": "Lull."}, {"id": 72, "start": 913.16, "end": 926.16, "text": "Ah, doch. Es sieht anders aus, tatsächlich."}, {"id": 73, "start": 926.16, "end": 946.16, "text": "Die machen das richtig mit dem Redesign. Das Redesign sieht fast genauso aus wie das alte, nur dass es jetzt hier oben durchgängig ist. Und so muss es auch machen. Wenn du so diese kompletten Redesign-Geschichten machst, so wie das Twitter und YouTube ab und zu machen, fuckst du nur die Leute ab."}, {"id": 74, "start": 946.16, "end": 965.16, "text": "Windows-Defender. Ja, tatsächlich gibt es das jetzt für Linux. Ich finde das okay. Es sieht fast noch genauso aus wie vorher. Du hast hier oben ein bisschen mehr Platz, das finde ich ganz praktisch. Und ansonsten ist es sehr dezent, das Redesign."}, {"id": 75, "start": 965.16, "end": 989.16, "text": "Finde ich gut. Passt. Ich hätte mir vielleicht ein bisschen bessere Abgrenzungen gewünscht. Dieses Hellblau auf Weiß, das sticht jetzt nicht sonderlich heraus. Und auch die dünne Schrift auf den Buttons. Also ich finde, man hätte das ein bisschen lesbarer machen können, das Ganze. Aber es geht schon in Ordnung. Ich meine, im Endeffekt kann ich den Kram einfach ein bisschen größer machen und gut ist."}, {"id": 76, "start": 989.16, "end": 1004.16, "text": "Dann passt es wieder. Das scale auch besser auf breiten Bildschirmen. Finde ich ganz gut. Also so musst du Redesigns machen. Kleine Häppchen und dann nicht zu sehr vom Original weg, sonst fuckt es die Leute übelst ab."}, {"id": 77, "start": 1004.16, "end": 1025.16, "text": "Und so sieht das doch ganz praktisch aus. So, dann legen wir uns mal eine Ubuntu VM an und gucken wir mal, ob der neue Installer taugt. Custom, Workstation, Installer haben wir später. Linux, Ubuntu 64. Das Ganze installieren wir unter E. Machen neuen Folder, keine Ahnung."}, {"id": 78, "start": 1025.16, "end": 1045.16, "text": "Ubuntu. 3 CPU Kerne sollte reichen. 4096 sollte auch reichen. Das bridgeen wir mal, weil ich will nachher gucken, ob man da vom Netzwerk drauf zugreifen kann."}, {"id": 79, "start": 1045.16, "end": 1055.16, "text": "Hat GitHub einen Darkmode? Ehrlich gesagt keine Ahnung. Ich habe Darkreader drin. Aber mittlerweile haben sehr viele einen Darkmode. Mich würde nicht wundern, wenn GitHub auch einen Darkmode hätte."}, {"id": 80, "start": 1055.16, "end": 1066.16, "text": "Übrigens, also was wir jetzt testen ist, wie gesagt, wir probieren den Windows Defender mal unter Ubuntu aus. Dann installieren wir einen Samba Server, gucken, ob der Windows Viren auf einem Dateiserver, auf einem Falschserver findet."}, {"id": 81, "start": 1066.16, "end": 1084.16, "text": "Das dürfte so eines der Hauptanwendungszwecke eigentlich sein für Windows Defender oder die Windows Defender unter Linux. Und zum Schluss testen wir mal, aber eher so just for fun, ob Windows Defender unter WSL unter Windows läuft."}, {"id": 82, "start": 1084.16, "end": 1095.16, "text": "Da bin ich mal gespannt. Was für einen Darkreader hast du, der der Darkreader heißt?"}, {"id": 83, "start": 1095.16, "end": 1103.16, "text": "Ich werde Windows Defender unter Windows über WSL laufen zu lassen. Das ist natürlich schon Next Level."}, {"id": 84, "start": 1103.16, "end": 1122.16, "text": "CD, ISO Image, Download, Tempkeck. Warum steht da Tempkeck drin? Das haben wir in einem Stream mal 10 Minuten gemacht. Downloads, Ubuntu Server, Live Installer. Fertig mit Download. Ja, ist er. Excellent."}, {"id": 85, "start": 1122.16, "end": 1136.16, "text": "Ach ja, und der Drucker muss weg. Finish."}, {"id": 86, "start": 1136.16, "end": 1155.16, "text": "I finished Installing. So wie gesagt, ich habe als er neu war den Live Installer ausprobiert und der hat mir überhaupt nicht gefallen. Der ging mir voll auf den Sack. Deswegen habe ich immer den Alternate Installer verwendet und den gibt es jetzt anscheinend nicht mehr."}, {"id": 87, "start": 1155.16, "end": 1163.16, "text": "Was zum Geier passiert da überhaupt gerade im Hintergrund? Cloud Init."}, {"id": 88, "start": 1163.16, "end": 1172.16, "text": "Wie gesagt, als Darkreader habe ich das Ding, was sich Darkreader nennt. Hat GitHub Dark Mode. Weiß ich, ob die sowas offiziell haben."}, {"id": 89, "start": 1172.16, "end": 1178.16, "text": "Naja, scheint nicht."}, {"id": 90, "start": 1178.16, "end": 1195.16, "text": "Ok, das ist immer noch so ungewohnt auf jeden Fall. Ok, Englisch. Update to new Installer."}, {"id": 91, "start": 1195.16, "end": 1208.16, "text": "Der Installer kann sich live updaten. Das ist natürlich schon mal Big Brain. Braucht man für den Defender auf Linux nicht eine Subscription? Das wäre ziemlich fail, da können wir es nämlich nicht ausprobieren."}, {"id": 92, "start": 1208.16, "end": 1217.16, "text": "Download freigegeben."}, {"id": 93, "start": 1217.16, "end": 1227.16, "text": "Moment, brauchen wir da wirklich eine Free Trial? Das können wir machen. Wir machen eine Trial."}, {"id": 94, "start": 1227.16, "end": 1232.16, "text": "Ist auch ok."}, {"id": 95, "start": 1232.16, "end": 1247.16, "text": "Wait, was ist das wieder für ein Satz?"}, {"id": 96, "start": 1247.16, "end": 1256.16, "text": "Wir machen uns einfach einen Microsoft Fake Account und Gutes. Juckt mich da nicht."}, {"id": 97, "start": 1256.16, "end": 1262.16, "text": "Wir werden es gleich sehen."}, {"id": 98, "start": 1262.16, "end": 1271.16, "text": "Wo kann ich es denn downloaden überhaupt?"}, {"id": 99, "start": 1271.16, "end": 1277.16, "text": "Oder besser gesagt, wie installiere ich es überhaupt?"}, {"id": 100, "start": 1277.16, "end": 1286.16, "text": "How to get started? Microsoft requires Microsoft Defender ATP for Server License."}, {"id": 101, "start": 1286.16, "end": 1296.16, "text": "To get started."}, {"id": 102, "start": 1296.16, "end": 1306.16, "text": "Manual Deployment. Ja, das probieren wir dann aus."}, {"id": 103, "start": 1306.16, "end": 1316.16, "text": "Ja, und wo kann man sich registrieren? Das ist schon wieder typisch Microsoft. Microsoft verwirrend gemacht, Alter."}, {"id": 104, "start": 1316.16, "end": 1327.16, "text": "Kostenlose Testversion anfordern."}, {"id": 105, "start": 1327.16, "end": 1337.16, "text": "Muss das noch ein Mensch angucken oder was?"}, {"id": 106, "start": 1337.16, "end": 1344.16, "text": "Das ist die falsche. Das ist nicht die richtige Ten Minute Mail."}, {"id": 107, "start": 1344.16, "end": 1348.16, "text": "Das ist die bessere Ten Minute Mail."}, {"id": 108, "start": 1348.16, "end": 1358.16, "text": "Das zeigt man ja. First Name. Max Wobels. Das Phone. Null."}, {"id": 109, "start": 1358.16, "end": 1368.16, "text": "Company Name. Null. Job Title. Ich bin System Solution Architekt."}, {"id": 110, "start": 1368.16, "end": 1379.16, "text": "United States, Germany. Gehen wir mal richtig an. Number of PCs 1. What other security optional? Microsoft. Macht, macht was er wollte."}, {"id": 111, "start": 1379.16, "end": 1388.16, "text": "Was? Was? 4 J M W D H J X K D. Alles klar."}, {"id": 112, "start": 1388.16, "end": 1395.16, "text": "Was? Nein."}, {"id": 113, "start": 1395.16, "end": 1400.16, "text": "Das ist nicht euer Ernst, oder?"}, {"id": 114, "start": 1400.16, "end": 1404.16, "text": "Ok Leute, Stream zu Ende."}, {"id": 115, "start": 1404.16, "end": 1408.16, "text": "Die wollen das echt noch von Hand machen. Ist das euer Ernst?"}, {"id": 116, "start": 1408.16, "end": 1412.16, "text": "Ach du Scheiße."}, {"id": 117, "start": 1412.16, "end": 1436.16, "text": "Jetzt weiß ich auch warum ich Microsoft Zeug nicht gerne verwende."}, {"id": 118, "start": 1436.16, "end": 1442.16, "text": "Fuck."}, {"id": 119, "start": 1442.16, "end": 1444.16, "text": "Ja."}, {"id": 120, "start": 1444.16, "end": 1447.16, "text": "Dann gehe ich jetzt Path of Exile spielen, Leute."}, {"id": 121, "start": 1447.16, "end": 1458.16, "text": "Funktioniert nicht, was wir vorhaben."}, {"id": 122, "start": 1458.16, "end": 1463.16, "text": "Tja. Microsoft. Dann nicht."}, {"id": 123, "start": 1463.16, "end": 1467.16, "text": "Schubandu. Weg damit."}, {"id": 124, "start": 1467.16, "end": 1471.16, "text": "Remove."}, {"id": 125, "start": 1471.16, "end": 1474.16, "text": "Tja. Microsoft. Dann nicht."}, {"id": 126, "start": 1474.16, "end": 1478.16, "text": "Ich hätte euch jetzt die Chance gegeben, dass das funktioniert."}, {"id": 127, "start": 1478.16, "end": 1484.16, "text": "Ob die Chance gegeben, euch mal angucke, wie es funktioniert. Aber. Hallo."}, {"id": 128, "start": 1484.16, "end": 1488.16, "text": "Ah. Exzellent. Microsoft."}, {"id": 129, "start": 1488.16, "end": 1494.16, "text": "Ähm. Na mal gucken, vielleicht sind sie auch schneller."}, {"id": 130, "start": 1494.16, "end": 1496.16, "text": "Ja, keine Chance."}, {"id": 131, "start": 1496.16, "end": 1500.16, "text": "Streamtitel ändern? Nee. Auf was?"}, {"id": 132, "start": 1500.16, "end": 1507.16, "text": "Ich hab großartig irgendwelche Big Brain Sachen, da hab ich heute echt keinen Bock mehr drauf, was zu machen."}, {"id": 133, "start": 1507.16, "end": 1515.16, "text": "Platter Webseine."}, {"id": 134, "start": 1515.16, "end": 1523.16, "text": "Vielleicht ist er schief."}, {"id": 135, "start": 1523.16, "end": 1530.16, "text": "Windows, Leute."}, {"id": 136, "start": 1530.16, "end": 1533.16, "text": "Welche NAS-Distro kannst du empfehlen?"}, {"id": 137, "start": 1533.16, "end": 1535.16, "text": "Ehrlich gesagt gar keine."}, {"id": 138, "start": 1535.16, "end": 1539.16, "text": "Ich hab die meisten ausprobiert von FreeNAS bis äh."}, {"id": 139, "start": 1539.16, "end": 1543.16, "text": "Wie heißt das so? Rock Store und alle möglichen Sachen."}, {"id": 140, "start": 1543.16, "end": 1551.16, "text": "Dann fahre ich immer noch von Hand. Installiert."}, {"id": 141, "start": 1551.16, "end": 1555.16, "text": "Das geht mir jetzt voll. Warum ist Microsoft denn wieder so scheiße?"}, {"id": 142, "start": 1555.16, "end": 1558.16, "text": "Ich mein, warum lassen sie das die Leute nicht einfach mal ausprobieren?"}, {"id": 143, "start": 1558.16, "end": 1572.16, "text": "Es ist ja nicht so, als wartet die Welt jetzt drauf, dass es Microsoft Windows Defender für Linux gibt."}, {"id": 144, "start": 1572.16, "end": 1582.16, "text": "Tja."}, {"id": 145, "start": 1582.16, "end": 1597.16, "text": "Ja, aber Sebaro, da braucht man eine Lizenz dafür."}, {"id": 146, "start": 1597.16, "end": 1606.16, "text": "Bei uns installiert man es unter Ubuntu."}, {"id": 147, "start": 1606.16, "end": 1614.16, "text": "Hier, installieren Sie den öffentlichen Microsoft-PGP-Schlüssel. Blablabla."}, {"id": 148, "start": 1614.16, "end": 1624.16, "text": "Ja."}, {"id": 149, "start": 1624.16, "end": 1632.16, "text": "Onboard Linux Server Machines. Was ist das für ein Schwachsinn?"}, {"id": 150, "start": 1632.16, "end": 1638.16, "text": "Kennste schon Excellent Solutions? Nein, kenn ich nicht."}, {"id": 151, "start": 1638.16, "end": 1643.16, "text": "Also man installiert das und dann muss man irgendwelche..."}, {"id": 152, "start": 1643.16, "end": 1655.16, "text": "Das wird jetzt wieder so voll unlinux-mäßig gemacht, was Microsoft da treibt."}, {"id": 153, "start": 1655.16, "end": 1660.16, "text": "Ah, ist das kacke. Nö. Dann war es voll für'n Arsch."}, {"id": 154, "start": 1660.16, "end": 1666.16, "text": "Dann können wir uns das heute im Stream nicht machen, wenn wir uns da registrieren müssen."}, {"id": 155, "start": 1666.16, "end": 1673.16, "text": "Leute, ich geh jetzt Path of Exile spielen. Das ist mir zu dumm, Microsoft. Hab ich keinen Bock drauf."}, {"id": 156, "start": 1673.16, "end": 1678.16, "text": "Ich weiß auch nicht, was ich sonst heute machen soll. Ich hab mir nix überlegt, großartig."}, {"id": 157, "start": 1678.16, "end": 1693.16, "text": "Nee, Path of Exile spiele ich nicht im Stream. Das ist langweilig und außerdem weiß ich selbst teilweise nicht, was ich treibe."}, {"id": 158, "start": 1693.16, "end": 1698.16, "text": "Also es sei denn, irgendjemand hätte eine super zündende Idee, was wir machen könnten."}, {"id": 159, "start": 1698.16, "end": 1707.16, "text": "Aber mir fällt gerade für heute nix ein. Ich hab jetzt auch nicht so wahnsinnig viel Big-Prain-Kapazität, um da jetzt komplizierte Sachen neu zu machen."}, {"id": 160, "start": 1707.16, "end": 1713.16, "text": "Äh, RTX Voice. Hab ich halt keinen Bock drauf."}, {"id": 161, "start": 1713.16, "end": 1728.16, "text": "Nein, POE Stream ist nicht. WordPress? Nein, nein, nein."}, {"id": 162, "start": 1728.16, "end": 1743.16, "text": "Egal, Leute. Ich geh auf. Bis denn. See you."}]}