{"text": "Jetzt müsste es deutlich besser aussehen. Oder Sebaro haben wir jetzt, jetzt haben wir 8k, ne? Jetzt sieht das Game auch gleich viel besser aus. Oh, ups, okay, ich wusste gar nicht, dass ich da rausgegangen bin, aber okay. Dann. So, jetzt sieht es auch gleich besser aus, ne? Ja, das muss bei mir auch mal einer sagen, Alter. Ich hab, bevor ich den Stream gestartet hab, hab ich mir gedacht, Max, du musst die Quali hochstellen, weil das hab ich das letzte Mal schon gemerkt und dann hab ich's vergessen. Übrigens, ähm, habt ihr mitgekriegt, dass Nintendo, ich hab ja, ich hab ja meinen Augen nicht getraut, Nintendo möchte jetzt einen Pokemon-Moba machen. Was ist eigentlich dieses Onlyfans? Das weißt du genau, wenn du fragst, Alter. Das ist da, wo die ganzen Camgirls und Boopcam-Youtube-Twitch-Streamerinnen ihre Nacktbilder hochladen. Ja, und sie wollen einen Pokemon-Moba machen, und da hab ich mir gedacht, warum ausgerechnet ein fucking Moba? Ich mein, Mobas sind seit fünf Jahren nicht mehr richtig hype. Ich mein, besser als im Pokemon Battle Royale. Wahrscheinlich hatten sie die Auswahl zwischen einem Pokemon-Moba oder einem Pokemon Battle Royale. Und haben gesagt, okay, Battle Royale passt zu Pokemon nicht, wir machen, wir machen lieber einen Moba. Aber da sieht man schon mal, dass denen nichts einfällt. Ich mein, ein Pokemon-Moba, what the fuck, was, ich mein, Pokemon ist die größte Marke der Welt. Oder die teuerste Marke, oder die bekannteste Marke, ich weiß es nicht genau, in welchem Ranking, aber Pokemon ist überall ganz weit vorne. Pokemon, es verkauft sich alles, wo Pokemon drauf steht, also es verkauft sich auch einen, oder was heißt verkauft, es macht alles Geld, wo Pokemon drauf steht. Im Prinzip, ein Pokemon-Moba wird auch Geld machen, aber ein Moba, Alter, was ist denn mit euch los? Viel uninspirierter kann es doch nicht mal werden als ein Pokemon-Moba, ey. Also ich hab mir echt nur gedacht, WTF, als ich das gelesen hab. Ich hab mir gesagt, ich hab mir, ich hab mir gedacht, Kek-Tribble-U, Kek-Quad-Tribble-U hab ich mir gedacht, als ich das gesehen hab mit Pokemon-Moba, ja, und es ist von Tencent, das kommt ja auch noch dabei. Drehendes Kek-Quad-Tribble-U hab ich mir gedacht, ja, 3D, Kek-Tribble-U 3D, und, und, und, Run-Speed, nope, Trash, oh, warum denkt mein, warum denkt mein Loot-Filter, dass das gut ist? Das ist nicht gut, das ist, übelster Crap, ach ne, das war gar nicht mein Loot-Filter, das war meine Aura, gute Base, ah, das kann natürlich sein, lohnt sich das dann trotzdem zu behalten sowas und für irgendwelche Craftsachen zu verwenden, aber ein Level 63 Base kann doch nicht gut sein. Interaction-Shots sind gerade gut fast wert, okay, hätt ich gar nicht gedacht, nice-u, sehr, sehr nice, da hab ich ja sogar noch bisschen mehr Kohle dann, wenn ich ja nicht die Story durch hab, ein paar Sachen verkauft hab, um nicht zu sagen, was ich mir da noch reden, Stonks, wir haben jetzt übrigens Stonks-Emotes, probiert mal aus, Stonks, na groß, ich glaub groß geschrieben, bin mir nicht ganz sicher, wie es geschrieben wird, aber wir haben ein Stonks-Emote, warum, warum kann ich das noch mal, warum kann ich das nicht leveln, weil mir Decks fehlt, oder, mir fehlt Decks, ich mein meine Items sind ziemlich a Crap, aber für die Kampagne reicht's halt dicker aus, mir fehlt Decks, so, dann craft ich mir jetzt einfach noch mal schnell Decks auf irgendeinem Item und kann zumindest das Ding noch ein bisschen leveln, Stonks mit großem S, stimmt, so war's das, so haben wir hier irgendwie schon was, Fire, Resists, Cold, ja, exzellent, kann man da Decks drauf craften, nein, da kann man Decks drauf craften, Decks, Decks, na, what, kein Decks, da kann man Decks drauf craften, auch kein, achso die sind schon voll, ah nee, ich hab keinen Platz mehr, ok, ich hab genug Resists, aber ich verlier gleich Resists, ich lass das mal so, 3K Viewer, welcher Haus willst du mich jebaiten, hab keine 3K Viewer, 61, je, je, je, je, jebaited, da stand grad bei dir, ok, wo ist der Endgegner, ah, ah, ah, ich hab meine Spells vergessen, bin ich überhaupt richtig, bin ich überhaupt richtig, glaub schon, glaub ich bin hier richtig, oder, äh, hä, Moment, nee, ich bin falsch, ich bin falsch, oder, hä, Moment, ich bin grad, ich bin grad echt verwirrt, angeblich, angeblich muss ich jetzt noch hier den Boss killen, oder? ich hab, ah nee, ich muss ins nächste, ich muss ins nächste Gebiet, oder ist der Typ hier, ist der Typ hier oder im nächsten Gebiet, wahrscheinlich muss ich rechts weiter, ja, das ist, das ist der gleiche, das ist der recycelnde Boss aus Akt 5, ist das, die recyceln eben gerne Bosse in dem Game, ich glaub ich bin zurückgelaufen, weil ich übelst Noob bin, oder, übelst ein, ein übelst Noob, Noob ich ja Noob, nee, ach, da unten muss ich wahrscheinlich hin, ich bin grad, das ist big brain move, hä, hast du den schon gekillt, nee, da steht ja, Moment, hab ich den, nee, Moment, jetzt bin ich aber echt verwirrt, du hast den schon gekillt, nee, was, nee, boah jetzt, jetzt, jetzt bin ich echt verwirrt, okay, was, wir lassen mal das Questlog updaten, was nehme ich jetzt mal silver flask, ah meinetwegen, nee, nee, ich hab den noch nicht gekillt, die, ich hab die, ich hab die, nur die Questanzeige nicht gehabt, also ich muss, ich muss, ich muss den Dude noch killen, muss, ich muss den schon noch killen, muss, ich muss den schon noch killen, genau und ich hab auch kein Quest-Item, muss ich denn hin, nee, da hab ich jetzt keinen Bock drauf, bin ich so verwirrt gewesen, als ich in die falsche Richtung gelaufen bin und dass da unten ist der eigentliche Eingang, bin ich, ich glaube ich bin wirklich in die komplett falsche Richtung gerannt gerade, so brain afk-mäßig, ah, die komplett, oh Gott, fail, Alter, jetzt sind wir richtig, jetzt wird nämlich einmal der Boss recycelt, der kann überhaupt nix, der sucked, reassembled ist er, oh, na besser als re c++, oh, der war schlecht, Alter, wow, wow, wow, excellent, ah ja, sehr schön, jetzt passt, jetzt sind wir richtig, single target, so, ok, zahmen die gekillt, return to also using waypoint, talk to, ok, and armor rewards, ah was brauche ich armor rewards, ist doch useless, gleich weiter rushen, oh, rip, keine ahnung, was hatten hier die beste chance für mein zeug, ah, pains chat, wow, Alter, Alter, mein Kopfhörer piepst übertrieben, btf, Moment, oh, habt ihr es gerade gehört, monkaier, mein audiointerface hat gerade ultra rumgespackt, ok, so, ich glaube jetzt sind wir fertig, ne, talk to the, das muss ich glaube ich machen für den skillpoint, das muss ich glaube ich machen für den skillpoint, ravaged square, muss ich glaube ich machen für den skillpoint, und dann sind wir durch mit der story, danach kommt nur noch der endboss und dann ist fertig, so, ich glaube ich kann es mir jetzt halbwegs merken, für den nächsten anlauf dann, ähm, was für ein build guide folgst du, gerade dem hier, ähm, dem da, aber der hat vor zwei tagen so ein aktualisiertes build hochgeladen, auf grundlage dessen wie es gelaufen ist, also, und ich hab auch gerade bei diesem, bei dem build auch im forum auf reddit gelesen, dass das wohl absolut noob easy mode build sein soll, also genau das richtige für mich, exzellent, äh, wo muss ich jetzt hin, und zwar, control blocks, control blocks sind, die control blocks, head down towards bottom middle of the area, alter, ok, bottom middle, machen wir, ist das bottom middle, wo ich lang gehe, ich könnte unbedingt ein paar chaos resies gebrauchen, what is happening, ok, ok, ich hab keinen plan, was das macht, ist sogar ganz brauchbar, mehr life könnte es haben, ach man kann ja den kram anwählen, das stimmt, da kann man sich jetzt ja aussuchen, was man drauf haben will, ok, das ist sogar halbwegs brauchbar, gab's nicht noch mehr zum anwählen, hab ich nicht noch was zum anwählen, oder war's das, ich glaub das war's, ultra crap alles, ja aber ich glaube wo es nicht egal ist, je nachdem welche mods man gerne haben möchte, sollte man die halt anwählen lassen, dass man die lernt, oder, control blocks, nein, wo sind die control blocks, control blocks, hier control blocks, ah ja, control blocks, so und da müssen wir jetzt einfach durchrushen und irgendwas killen, wie so immer in pass of exile, oder irgendein item looten müssen wir hier glaube, für skill, skill, punkte, quest, sag mal ist das besser als meins, was ich hab, ja na viel besser, ja ist ja gut hier, was will was denn hier los, viel besser, na ja ne, ne, moment, meine ist besser, oder, die ist nur besser, weil sie, ne meine ist bessere base, allerdings die mods sind besser, der chat, der chat, lass mal zusammen, der chat ist der beste, ist beste, ist wie der brachland chat, er ist richtig pepega chat, das ist aber nur getrolle im chat, so wie in allen mmos und online spielen, so eigentlich sollte ich jetzt hier ein item finden, was ich looten muss, hier unten, ne, das ist so ein buddelding, buddelors, plickt ihr, chat, plickt ihr dank den effekten auch noch schön durch, was passiert, ich hab übrigens gelesen, man kann, man kann ein bisschen, ein bisschen pay to win machen, was das angeht, es gibt ne microtransaction, die die effekte niedriger macht, was fast schon ein bisschen pay to win ist bei dem build, ja es gibt ne microtransaction, die die effekte halt anders macht, so hab ich das item jetzt gleich mal hier, jiff ich brauch skillpunkte, wo ist das item, items, oh was ist das, arena, ah boss der kann nix, oh oh oh ok der macht doch damage, ok wenn man ausweicht sind die ganzen bosse eigentlich ziemlich easy, aua, sterben blitz, ach das sind, das sind so typischer drei phasen boss, den man gar nicht killen kann auf einmal, schreib hallo in den ingame chat und schau was passiert, probier ich gleich aus, soll ich mal in deine party kommen, da sieht man nicht mehr viel, was spielst du denn, rainbow, rainbow, was, rain, rain arrow, ach rain of arrows chat, ok das ist wirklich, globe, global abschal in twitch chat, what, ok also ich habs geschafft wir können die kampagne jetzt abschließen, wie heißt mein chat eigentlich, wupps, ok, nice so und jetzt können wir die kampagne endlich abschließen, reicht auch, genug, so jetzt müssen wir zurück mit innocence reden und dann haben wir, haben wirs, erstmal noch mal skillen schnell, du hast noch was vergessen was denn, control blocks, nee, du wolltest noch in den chat schreiben, ok, ok alles klar da seh baro, hallo, cute chat, der chat ist so ppeger alter, ist ein richtiger ppeger chat alter, ok das wars jetzt, jetzt kommt der boss und dann sind wir endlich mit der kampagne durch, poggers, achso ich wollt gucken was ich skillen muss, was muss ich denn skillen, was muss ich noch skillen, den kram haben wir gespeckt, das hab ich auch schon alles gespeckt, hier oben muss ich noch einfach skillen, das kann ich wegspecken, das kann ich wegspecken und das hier kann ich noch dazu skillen, ja, an dem dex node, mehr resis, ist ja nicht so alt, hätte ich eh nicht schon cap resis, allerdings nach dem nächsten boss krieg ich glaube ich noch 25% penalty was resis angeht, oder sogar 50%, wieviel penalty kriegt man, 50% oder 25, 30 ok, ja irgendwo in der mitte, ok ja dann brauch ich nämlich die resis erstmal, erstmal hier schön den kreisel grind weiter starten, warum hab ich denn schon wieder nen skillpoint, hab doch gerade eben erst geskillt, skillen wir nochmal, excellent, auch mehr, mehr resis, was, ok, moment der hat das andere geskillt, weiß wahrscheinlich, ja besser, mach mal passives im chat, damit siehst du eventuell fehlende skillpoints, ach, 20 passive das wars oder, ich hab alle ja ich muss, ich muss dann noch meine banditen respekten, wenn ich ordentliches, wenn ich mir dann mal ordentliches gear zusammengesucht hab und ich mein, mein, mein gear was ich seit 40 levels an hab und dann muss ich auch allira wegspecken und noch 2 skillpoints von den banditen abgreifen, wie respekt man banditen nochmal, willst du nicht dein merklab machen, das ist ne gute idee, das sollte ich tatsächlich machen, da hast du voll und ganz recht, ja, ich sollte mein lab davor machen, auf der anderen seite, ich hab genug resis eigentlich, wenn du dir das anguckst, also, kann ich danach auch machen, ja ich sollte slap machen, aber ich hab genug resis, ich kann das danach auch machen, 20 regret orbs und nix amulett, ok, na dann, dann respek ich danach nochmal, meine bandits, aber erst, nachdem ich das lab gemacht hab und ordentliches gear hab, weil ich brauch die resis, by the way, ich hab keine ahnung mehr, wie der letzte boss funktioniert hat, aber nachdem das game gerne bosse recycelt, ist das wahrscheinlich mehr oder weniger der gleiche boss wie in act 5 oder act 6, ja weiß ich nicht mehr, wie zur halbzeit quasi, richtiger blanket chill stream, ja, es gab ja die auswahl kein stream, oder kreisel crying stream, in dem ich halt zum größten teil kreisel crying da aber halt stream an hab, ich find es übrigens schön, dass trotzdem so viele leute dabei sind, mein klar ist nur ein drittel oder viertel von sonst, mittlerweile fast sogar schon eher nur ein viertel, ich hatte ja in letzter zeit recht regelmäßig 200 plus, wo ich gesagt hab, unglaublich wer sich da für alles interessiert, ja, ich find es trotzdem gut, dass so viele dabei sind, da muss ich nicht alleine kreisel crying machen, by the way, ich guck immer pass of exile stream, deswegen bin ich übrigens jetzt, muss ich vielleicht mal erklären, wie ich überhaupt wieder auf das game gekommen bin, ich hab, also ich hab ja erst wieder angefangen, quasi vorletzte season, und der account ist zwar von 2013, aber ich hab ewig nicht mal gespielt, so und ich guck immer pass of exile streams zum schlafen, zum einschlafen und die sind meistens ultra entspannend, weil da ist halt einer am start der kreisel crying zu, man muss sich halt den passenden streamer raussuchen, der nicht rumschreit oder so, und dann ist das ultra entspannend, da guckt man einfach kreisel crying zu, irgendwelche leuten die über sonst was erzählen oder sich über big brain in game crafting moves unterhalten, oder kann man wunderbar pennen bei, was schaut ihr mal uli app an, ist das jetzt werbung, ist das gbait werbung, ok was ist das, gucken wir mal, uli app, ach so ein ding, das haben wir das nicht sogar schon ausprobiert, solche launcher gibt es tausende, den haben wir sogar schon ausprobiert, wenn wir nicht den ausprobiert haben, dann haben wir einen sehr ähnlichen schon ausprobiert, ist das rofi für windows ein bisschen, ein bisschen so ähnlich, allerdings besser integriert und mit mehr funktionen standardmäßig dabei ohne plugins, this is it, ne erst nochmal garden warfare machen, sterben please, hopp, garden warfare, excellent, lass mal ne runde, oh seats, seats sind voll, kein platz mehr, da oben ist noch platz, excellent seats, hab mal ne frage bin neu in poe, aber hab mies bock zu delven oder wie das heißt, aber hab gesehen das kostet mies das gehen, wie komm ich am besten ran, ich bin auch ziemlich ein rofi noob, das einzige was ich dir dazu sagen kann ist, dass ich das noch nie gemacht habe und heute morgen irgendeiner 1900 tiefe erreicht hat im chat, ja du brauchst, mit sicherheit brauchst du gear, allerdings bis zu ner gewissen, bis zu ner gewissen tiefe, das stimmt nicht das ich noch nicht gemacht hab, ich hab mal bis 120 oder so gedelft, aber das ist ja nicht so wahnsinnig viel, außerdem war das mein op necro von vor 2 leaks, aber im chat sind ein paar leute die wohl plan haben von dem game, da kann dir vielleicht einer helfen, so boss lets go, bashen alter bashen, guck mal das sackt, ganz noobbosse, au alter, is ja what the, warum hast du so viel damage, der soll ja aufhören damage zu machen, anzeige es raus, was war die frage, xarith hat gefragt, wie er am besten zu delvegear kommt, dass er ein bisschen, ein bisschen mithalten kann, ouch, au, au, what the, ey, ey, ey, ey, ey, ey, ey, ey, ey ey, ich glaube, wenn der hardcore spielst, dann hast du dir nen heilen herzinfarkt Lass dich mal hinten, Alter! So, jetzt ist er aber dran! Jetzt geht er down gleich! Ach nee, ich muss ja das Herz killen! In your face! Let's go, zack, easy win! PoE-Bosse Oh, gleich geht er down! So, Kampagne durchgespielt! Ich hab die Dragon Godhead Microtransaction geernt! Aha! Sehr gut! Ist ja fast wie in Team Fortress mit Hüten jetzt! So! Ach nee, ich muss ja noch die post, ich muss ja noch die credits, die quasi, die credits Quest machen! Also quasi die, die Nachstory-Quest, was, warum man sich auch immer gedacht hat, ist eine gute, eine gute Idee! Du hast gerade per Mal minus 60 Resis bekommen, ja! Hab ich! Also minus 30! Weil ich, weil, minus 30 hat man schon mal bekommen beim ersten Boss, und nochmal minus 30! Okay, äh, dann machen wir jetzt noch mal kurz die post, post-credit-Quest oder wie man das nennen mag! Skillpoint! Exzellent! Das geht aber schnell, da muss man glaube ich, warte mal, unten musste man da glaube ich hin! Epilog-Quest, genau! Ja, das wars! Weiß aber gar nicht mehr, wo es lang geht, schon wieder vier Monate her! Ja! So, das ist das Ding, wo man seine Endgame-Sachen später spielt! Da kann man, dann droppt man sowas hier rein, und dann geht quasi ein Portal auf zu einer Map, die cleart man, und je nachdem, wie stark die Monster auf der Maps sind, umso besseres Loot gibt's! So, mal die ganz, ganz primitive Endgame-Variante, Erklärung von mir zum Passivexer Endgame! Sealed Storage Room! Ahja! Aber das hat noch viele Feinheiten! Ach, jetzt muss ich unten irgendwo hinlaufen, also wer sich echt gedacht hat, bei den Entwicklern, es ist eine gute Idee, diese Post-Credit-Epilog-Quest einzubauen, weiß ich auch nicht, langweiliger könnte es kaum sein! Passiert ja nix mal, da läuft einfach nur sinnlos rum! Und muss Level 1-Mops-Killen zwischendurch! Ich glaub, unten rechts war das! Alter, der In-Game-Chat wieder, was erzählen sie denn? Gibt es hier jemand, der lieb... Ach du Scheiße! Der Chat! Der In-Game-Chat! Der... Äh... Moment, wo ging's hier noch mal lang? Nee, oben rechts war das, oben rechts, genau! Haha, mir wird schlecht! Haben wir's heut noch! Ja, man muss doch ein paar Level-1-Mops-Killen! Unglaublich sinnlos! Epilog-Quest! Äh, Moment, wo muss man jetzt hin? Na, ich vergesse, wo man hin muss! Hier irgendwo? Nee, wieder zurück! Start-Porten und runter! Stimmt! Da hab ich's verwechselt mit runterlaufen, diesen Schritt, mit dem der jetzt kommt! By the way, der allerletzte Boss, den's dann später gibt in dem Game, das ist ein Bosskampf hier auf diesem Marktplatz und ich kam mir fast schon ein bisschen wie gecheatet vor, als ich den mit meinem Zombie-Nekro gemacht hab, weil normalerweise musst du ja die richtig krassen Mechanics machen und als Zombie-Nekro musst du mehr oder weniger einfach nur im Kreis laufen. Äh, Moment, bin ich jetzt richtig gelaufen? Ja. Vault-Key! Und das muss auf 10, 20 Minuten dauern, bis es aufgeht, ne? Die haben sich hier richtig Mühe gegeben, so mit neuen Sachen im Hintergrund, aber dabei ist man überhaupt nie auf diesem Gebiet hier unterwegs. Äh, ist das bugged? Ist das bugged? Ah, nee. Ach, so ging das, okay. Ich hab gedacht, dass es bugged, weil der hinter dem Tor gespawnt ist. Yes. So. Jetzt haben wir's endlich geschafft. Max rushed da einfach durch, klar, ist ja auch übelst langweilig sonst. So, hideout. Hideout. Gillette-Abdi rasiert, genau. Lebt er noch? Gibt's den eigentlich noch? Gillette-Abdi? Desert-Map. Tropical-Island-Map. Excellent. So. Komm, wir machen mal eine Map noch. Activate, yes. Und dann muss wir noch das Labyrinth machen. Ja, also, so funktioniert im Prinzip das Path of Exile Endgame, man findet Maps, Maps sind im Endeffekt die alten Gebiete recycelt mit unterschiedlich starken Monstern, es gibt da ein paar Feinheiten, ja, es gibt spezielle Maps, es gibt noch ein paar Unique-Maps mit speziellen Sachen drinne, es gibt so ein Tempel, den man anlocken muss, also es gibt schon noch ein paar Feinheiten und je nach Stärke der Map droppen dort quasi bessere Maps, die noch stärkere Mops haben und umso stärker die Mops sind, umso besser das Loot. Und um die ganzen Sachen nicht zu einfach zu machen, gibt es noch so eine Übersichtskarte, wo man dann auch die Maps quasi sammeln muss, also sprich, von jedem Typ einmal gemacht und da gibt es noch verschiedene Upgrade-Geschichten, also es ist ein bisschen komplizierter, also gibt es einiges zu machen noch im Endgame. Was ist der Shortcut für Atlas noch mal gewesen? Wenn man sich entscheidet jetzt POR anzufangen, ist man verloren, warum? Ich hab doch, ich hab, ich hab, das ist die erste, oh, oh, oh, Monka, Monka, es, das ist Chaos-Damage, ich hab keine Chaos-Resies, Alter, die erste League, die ich gespielt hab seit 2013, war, denk's hier, Metamorph und die letzte League hab ich nicht gespielt, das funktioniert schon, man muss einfach sich ein OP-Bild raussuchen und dann ist gut. Ups, was hab ich jetzt gemacht? Ich will das eigentlich jetzt gar nicht Harvesten, ich will die Map fertig machen. Ja, also man muss auf jeden Fall ein bisschen Zeit einplanen, wenn man einfach nur mal ein bisschen Hack'n'Slay spielen will, kann man das auch so machen, aber Paths of Exile macht erst so richtig Bock, wenn man halt auch ein Build hat, was gut rein haut, ja. Jetzt nochmal, das Crafting, es gibt ja 1000 Endgame-Mechaniken, du hast diesen Delve-Dungeon, du hast dieses Board mit den Karten drauf, also da wo man die Typen dann quasi richtig linken muss, es gibt so viel, wow, MonkaS, ja, wenn man keine Chaos-Resies hat, dann ist es keine gute Idee, wenn man in die Mobs einfach reinrusht, by the way, man hat nur eine endliche Anzahl an Versuchen für so eine Map und die höhere Maps können auch ein bisschen teuer sein, wenn man sie sich kauft, also man hat glaube ich nur 6 Versuche oder so oder 9, 9 Versuche, irgendwie so, bis alle Portale weg sind, die Stacheln machen Physical Damage, ok, dann ist kein Wunder, dass ich so einen Damage kriege, ich hab ja kaum Armor, also nee wirklich viel, aber die hauen übelst rein, die Stacheln, Monka, Monka Stachelors, ah, ich immer meine Spells vergesse, deswegen spiele ich auch kein Hardcore, das frustriert mich einfach nur, wenn man an so sinnlosen Zeug stirbt und dann wieder ganz von vorne anfangen muss, es gibt ja Leute, die spielen Hardcore, Self-Found, das sind dann die richtigen Pros, die quasi sich den ganzen Kram selbst craften können und auch wissen, wie das gut funktioniert, ok, Alter, what the fuck, der Scheiß macht ja mega Damage, Alter, ich mach jetzt das nächste in Town Portal auf und deswegen sieht man mal wieder, Quicksilver Flasks sind das wichtigste, was man haben kann, sonst brauchst du ja 2 Stunden, bis du da wieder hingelaufen bist, so, ich mach jetzt den Town Portal auf, ja, ich hasse diese Gegner, die ging mir auch in der Kampagne schon auf den Keks, die gibt es ja zum Glück nicht so oft, aber jetzt sind sie tot, ok, wahrscheinlich nur Crap, so, Map, fertig, was war denn jetzt noch mal der Shortcut für Atlas, wenn ich das jetzt noch mal rausfinden würde, G, ah, ich hab den Atlas noch nicht, wahrscheinlich krieg ich den jetzt erst, ah, jetzt krieg ich ihn, ok, alles klar, genau, das ist im Prinzip so der Endgame-Rahmen von Passive Quicksilver, also sprich, jede dieser Maps, die man in diesen Teleporter einsetzen kann, sind zu einem Punkt auf dieser Atlas-Map und ihr seht schon, wenn das, das ist die Map, die wir gerade gemacht haben, ihr könnt euch vorstellen, dass quasi jede dieser Abschnitte irgendwie, keine Ahnung, 30 Maps hat, also sprich, es gibt saumäßig viel, was man machen kann, im Prinzip ist es natürlich immer das gleiche, man rennt rum und killt Monster, ist halt ein Hack and Slay, 154 Maps, ok, und dazu kommt wahrscheinlich noch diese Special-Sachen, es gibt ja diesen Tempel, da gibt es noch den Abschluss-Boss-Fight, steht da, ach ja, hier, 1 von 154, ja, ich geh davon aus, dass nicht alle dazuzählen, wie gesagt, die Boss-Fights werden nicht dazuzählen, der Tempel wird auch nicht dazuzählen, es gibt wohl ein paar Sachen, die nicht reinzählen, denke ich mal, weiß ich nicht, aber es gibt ordentliche Sachen so und dass das Ganze nicht so einfach wird, gibt es diese Maps, ich glaub, 14 oder 15 verschiedene Tears, das fängt an von Tier 1 bis, glaub, 5, die sind weiß, dann irgendwie 5 bis 10, die sind gelb und dann irgendwie 10 bis 15 oder sowas, die sind rot, also umso schwerer wird das Ganze und die Maps gibt es dann natürlich auch noch in unterschiedlichen Seltenheitsstufen, also sprich, ist das quasi eine normale Map, eine Magic-Map, eine Rare-Map und die können wirklich ziemlich eklig werden, zum Beispiel gibt es Maps, die haben als Bonus, dass die Gegner Damage Reflecten und sowas, dann wird es richtig, richtig abartig, also sprich, umso höher und umso schwieriger und umso seltener die Maps sind, umso besseres Loot gibt es, allerdings werden die teilweise unschaffbar schwer für manche Builds, also ich habe zum Beispiel komplett gelitten, wenn ich eine Map bekomme, die Magic-Reflect-Gegner hat, kann ich nichts dagegen machen, wenn die Magieschaden reflektieren, die Gegner ist RIP, das kann ich nicht spielen, aber man kann das Ganze ja auch blocken in diesem Map Device, gibt es dann, gibt es noch verschiedene, oder konnte man das nicht hier blocken? Zumindest hier, wo man die Maps rein macht, kann man noch verschiedene Bonussachen einschalten, dass die Maps dann quasi noch mal schwieriger werden und noch Chancen, mehr Chancen auf irgendwas haben und um es noch etwas komplizierter zu machen, gibt es dann am Ende noch verschiedene Türme hier auf dem Atlas, wo man verschiedene Steine einsetzen kann, die dann wiederum alle Maps in diesem Gebiet noch mal verzaubern, also ist ein bisschen komplex das Ganze, aber sorgt dafür, dass es eben saumäßig viel Endgame zu tun gibt, das heißt es wird einem nicht langweilig, also wenn eine neue Passive Ox, Passive Ox, wenn eine neue Passive Ox startet, dann kannst du durchaus mal 1-2 Monate spielen, vielleicht nicht unbedingt immer mit einem Charakter, bis es dir anfängt langweilig zu werden und das Schöne ist, dass die Leaks halt auch schon abwechslungsreich sind, diesmal mit dem Gecrafte, das letzte Mal diese Sache mit diesem Delirium Portale, habe ich aber nicht viel gespielt, davor mit der Metamorph Geschichte, wo man quasi Einzelheiten, also Innereien von Bossen sammeln musste und sich die Bosse selbst zusammenbauen konnte, dass es Skill Tree Erweiterungen gibt und alles, also das ist wirklich ein ziemlich gutes Game, was man immer wieder spielen kann, es ist vielleicht kein Game, was man jetzt 3 Jahre am Stück durchspielt, aber es ist ein Game, was man 3 Jahre am Stück mit Unterbrechungen spielt, es ist komplett Free to Play und es hat auch keinerlei Pay to Win Elemente, das einzige was es gibt, was ein bisschen Pay to Win ist, ist das es Stash Tabs gibt, wo man mehr Sachen in seine Truhe legen kann, das ist aber auch das einzige und ich glaube die meisten Leute, die das Spiel so weit gespielt haben, dass sie das brauchen, die supporten das wahrscheinlich sogar gerne, also mit dem ersten Charakter kann man denke ich, wenn man ein bisschen sparsam ist, die Kampagne durchspielen, bis das Dash voll ist. Danach wird es halt eng, aber die, die dann weiterspielen wollen, kaufen sich wahrscheinlich auch schon extra Stash Tabs, der Rest ist rein kosmetisches Gedöns, also sprich, dass meine Fußschritte so weiß sind, das ist auch hier Microtransaction Kosmetics. Ja, genau Sebaro, das war noch Metamorph, wo ich das gespielt habe, ne, also die Maps, wenn ich jetzt zum Beispiel so eine Desert Map mache, machen wir was hier, Modifier rein, dann ist das jetzt halt eine Wüste, das haben die richtig gut gemacht, Maps ist im Prinzip auch bloß recycelt, aber halt richtig gut gemacht, generell sind die Typen Meister im Content Recycle, die haben die Recycle im Endgame so ziemlich alles, die Recycle in der Kampagne, die Bosse dreimal, aber dadurch, dass das Game viel random generated Zeugs hat, ist es gar nicht so auffällig und nervig, aber die Recycle halten dem GameShot ziemlich viel oder haben viel recycelt und ich finde, man merkt, man merkt, dass den ersten vier Akten auch an, dass die mit ein bisschen, oder den ersten fünf vielleicht, Akten auch an, dass die mit ein bisschen mehr Aufwand, Geld und Zeit entstanden, what the fuck ist das, entstanden sind, als die Akte danach, weil die Akte danach sind ja fast nur Recycle, vor unbedingt ein bisschen Chaos und Resists, übrigens das ist überhaupt nicht mein Endgame Speck, ich muss komplett umskillen dann, also nicht den Skilltree, sondern an Gems, das ist eigentlich nur meine Level Specks, aber Tier One Maps ist halt kein Unterschied zur Kampagne im Endeffekt. PoE 2 hat eine neue Kampagne, ja das stimmt, aber ich habe echt keine Hoffnung für PoE 2, die Story ist dermaßen konfus und wir und ehrlich gesagt auch ziemlich schlecht, dass ich da nicht viel Hoffnung habe, dass jetzt PoE 2 sich durch eine wahnsinnig tolle Story auszeichnen wird, das kann ich mir bei PoE einfach nicht vorstellen. Das Spiel soll mobile kommen, ach stimmt, ja, ich dachte das haben die bloß gesagt, weil sie sich lustig machen wollten über Diablo Mobile, ne aber stimmt, du hast Recht, es soll für mobile kommen, sag mal was zum Traden, ja was soll ich zum Traden sagen, dass es halt kein Auktionshaus ist, sondern manuell kann man zum Traden sagen, allerdings läuft das Traden schon ein bisschen wie auktionshaus mäßig ab, also du suchst über die offizielle Seite, können wir übrigens gleich mal machen, du suchst über die offizielle Seite die Items, die du haben willst mit den Sockels und mit den Stats und dann schreibst du halt den Typ in-game an, das kannst du übrigens direkt über die Seite machen, Copy Paste Text, sag dem auch gleich wo in seinem Inventar das Item liegt und dann ist gut. Hab ich irgendwas vergessen hier, ach da unten, ich mag so Maps nicht die nicht im Kreis gehen sondern so fake im Kreis, alle Müll, jetzt muss ich wieder einmal komplett unten runter rennen. Ja, also man wisst bei dem Typ dann an und sagt hier ich hätte gern dein Eat Item XY, der joint mal bei ihm ins Game rein, geht in sein, nee Quatsch, der joint bei dir ins Game rein, geht zu dir ins Hideout, gibt dir das Item, du gibst ihm das Geld und du kontrollierst auf jeden Fall 5 mal, dass er dir das richtige Item gibt, weil es ziemlich viele Traits, Gammar gibt in dem Spiel, was dem Hersteller aber anscheinend vollkommen egal ist, man könnte ja dann was dagegen machen aber nee, also erstmal das Item 5 mal checken, da gibt sogar Tools die einem helfen, wie heißt das Bild das du spielst, ich kann dir das Video dazu zeigen, das hier, ja, nee, da ist das Bild, ja und das passende Video dazu, zu dem Bild ist, das passende Video zu dem Bild ist das hier, das ist eben schon ein Update Video, das passende Bild, das Video ist das hier, da erklärt er das ein bisschen, das ist halt, das ist richtig gutes Noob Bild, allerdings wohl gemerkt die Skills die ich gerade hab sind meine Level Skills, also ich hab noch gar nicht das aus dem Bild equipped, dazu muss ich auch erstmal einkaufen gehen, bisschen ordentliche halbwegs brauchbare Items mir holen und nicht mein Crap Level Gear, achso das Labyrinth wollten wir schnell noch machen, exellent, Labyrinth können wir noch machen, ok gut, so Map fertig, dann gehen wir nochmal ins Lab, möchte man was anderes außer Necromancer beim League Start spielen, ja Necro wurde ein bisschen genervt, man nimmt hier allerdings auch Necro als Ascendancy, allerdings man spielt halt keine Minions, so, ja genau was zum Trade, also wenn man ein Item sucht, also zum Beispiel Trade POE, wenn man jetzt was verkaufen will oder was sucht, was man haben will, geht man auf die offizielle Path of Exile Seite und jetzt gucken wir mal was das Item wert ist, was ich gefunden hab beim Leveln, das brauch ich für mein Build nicht, wenn ich richtig liege und ist relativ viel wert, wir suchen da mal danach, Support, ne Moment, wie ist das Ding, Enlightened Support, ja Gems Search, da sehen wir das 28 Chaos Orbs wert, wenn nicht sogar vielleicht sogar ein Ticken, naja ne passt schon, also in dem Dreh 28 Chaos Orbs ist das ganze wert, das ist jetzt nicht super High End Dinger, aber dafür kriege ich schon mal ganz gutes Gear, mit dem ich dann Endgame starten kann, mal gucken was ich da recycle, ich muss auch mal schauen wie viele Chaos Orbs ich überhaupt schon habe, Chaos 5 Stück hier, aber sonst noch irgendwo was, 3 Stück hier, also 8 Stück, 8 Stück, da kommt noch hier, also ich kann mir erstmal für 36 Chaos Orbs Endgame, Einsteiger Endgame Gear kaufen, das ist schon mal ganz gut, da komm ich ganz gut hin, so und das schöne ist halt, wenn ich jetzt mir den Typ hier raussuche, dann kann ich direkt hier unten auf Whisper drücken, also ich will es ja nicht kaufen, ich will es ja verkaufen, dann kann ich direkt hier unten auf Whisper klicken und dann kopiert mir das Game in der Sprache des jeweiligen Account Besitzers in die Zwischenablage schon rein, was ich kaufen will, kann es in-game zu ihm reinpasten und dann scheint er bei mir und ich kann es kaufen, ja, exellent, warum kein Currency Tab, weil ich faul bin und ich die nicht in mein Currency Tab einsortiert hab, das ist alles, könnte man ja mal machen, jetzt dampfen wir den Kram mal hier schnell rein und ich mach jetzt noch schnell das Labyrinth, ich mach jetzt schnell noch mal das letzte Labyrinth, damit ich den Kram wenigstens erledigt hab, das dritte, stimmt, danach kommt noch eins, ja, danach kommt noch eins, dazu muss man aber erst in Maps noch 6 Voraussetzungs-Dungeons machen, die Voraussetzungen sind dafür, also man muss vorher noch 6 Dungeons auf Maps zufällig finden, dass man das letzte Labyrinth machen darf, übrigens der Speedrun, der schnellste Speedrun für ein Labyrinth ist glaube ich 2 Minuten 30 oder so, ich hab mir das mal angeguckt auf YouTube, der Typ hatte mega Glück, der ist reingelaufen, direkt nächstes Gebiet, reingelaufen, direkt nächstes Gebiet, genau im Global Chat, man kann Global 820 joinen, da schreiben die Leute in Chat rein wo sie was gefunden haben und dann kann man ihn nachjoin und dann geht das halbwegs schnell, wo gehts hier weiter, hab ehrlich gesagt keinen Bock durch die, oh nee, hier gehts wieder raus, MonkaS, da oben gehts lang, beste Zeit für heute ist 1 Minuten 59, also das ist krass, 1 Minuten 59, das komplette Labyrinth, aber das ist halt einfach nur Glück, also das ist, da musst du einfach big luck haben, dass es funktioniert, ich weiß nicht ob man das irgendwie schießen kann, irgendwie random Zeug manipulieren kann, dass man vielleicht bessere Layouts kriegt oder so, aber wahrscheinlich nicht, in dem Game ist ja quasi der Random Generator das Herz des Games, ich glaub nicht dass ich da was manipulieren lässt, Lab Layouts sind immer, was, sind immer gleich für alle, hä, ach werden alle 24 Stunden gerne, ah ok verstehe, das heißt man muss einfach warten bis es was richtig gutes gibt und dann geht man nochmal rein und runs einfach extrem schnell durch oder wie, also sprich wenn ich jetzt nochmal danach das Labyrinth machen würde dann wüsste ich schon wo es lang geht oder wie, das ist ja easy, dann ist es ja wenn man verreckt gar nicht so schlimm, wenn man verreckt läuft man einfach den gleichen Weg nochmal, die Builds haben 600% Movement Speed, ja, würde ich auch machen wenn ich Speedrunnern würde, dann jetzt übertreiben sie es aber hier, wo gehts denn hier lang, wo gehts hier lang, aha, exzellent da sind wir richtig, dead end nix dead end, so mal gucken ob man ein bisschen was gelernt hat, der gute Izaro, aber jetzt nicht mehr so sucked wie im letzten Labyrinth ok er macht ein bisschen mehr Damage, aber es sucked immer noch, noob Izaro, so wo sind wir, ok nach oben gehts weiter und auch eine Sache die ich richtig nice an passive exzellent finde, wenns einmal langweilig ist, das ist auch ein Game was man relativ entspannt für 15 Stunden am Stück grinden kann, wenns einem sehr langweilig ist, diese League kann man das Lab sogar tunen, echt, wie das denn Harvest craft auf die Offerings, ach echt das geht, das ist cool, kann man auf diese items auch irgendwie normale orbs drauf machen, ne, ne? Das finde ich aber gut, dass die an so Kleinigkeiten denken. Ach guck mal, da unten, da unten geht's weiter. Exzellent. Wo kommen wir jetzt lang? Äh, G-Golden Door, okay, da müssen wir, da müssen wir jetzt erst mal nen Key suchen. Die Leute ragen aber schon seit Jahren wegen der Lab RNG um die Enchants. Kann man nicht einfach das mit, mit diesem Öl, Ölcrafting Zeugs machen? Die gleichen Sachen, wie man auch vom Lab, vom Lab kriegt? Diese Oil-Geschichte, ist das nicht genau das Gleiche? Ach, Oils gehen ja auf Amulets. Ah, das heißt, wenn ich jetzt irgendwie meine Handschuhe enchaten will, dann geht das damit nicht. Okay, das wusste ich nicht. Dann verstehe ich das hier um Ragen. Ach, guck mal, da ist er, da. Das Schlüssel. Switch. Okay, das war easy, das war wirklich easy. Assfuck. Ja, aber reicht das nicht? Ach so, na gut, wenn ich sowas haben will, wie beispielsweise mehr Attack-Speed und sowas auf dem, da musst du übers Lab mehr Attack-Speed auf Kloves oder so. Was mache ich eigentlich, warum gehe ich nicht durch die Tür? Ach, das läuft eigentlich ganz gut gerade. Oh, gleich ist er down. Ah nee, das ist ja noch das Vorletzte, ich kann hier noch gar nicht down machen. Was passiert eigentlich, wenn ich hier drauf stehe und er fährt runter? Ah, ich werde rausgeportet, okay, ich dachte schon Instant-Drip. Das wäre es jetzt gewesen, aber da haben sie zum Glück dran gedacht. Oh nee, diese Kackmonster. Das sind die Monster, die mich vorhin One-Hitted haben, das sind die Stachelviecher. Please, nein, nein, nein, lass mich in Ruhe, Piss dich, Alde, da habe ich jetzt keinen Bock zu verrecken, da muss ich den Kram nochmal machen. Oh, das war ein gutes Bein. Excellent, ich nehme lieber das andere auf noch eine Map mit Tür, habe ich keinen Bock. Es sei denn, es ist auch schwierig jetzt hier durchzukommen, mal gucken, please, wo ist der Ausgang? Lass mich einfach raus, muss jetzt hier irgendwann kommen. Nein, Dead End, RIP, she baited, ich hätte wetten können, jetzt kommt der Ausgang, aber nein, gibt's nicht. Wäre ich doch durch die andere, da hätte ich wahrscheinlich den Schlüssel schneller gefunden. Ah, hier geht's lang, hat's einen, will mich das Game she baiten. Oh, wow, wow, wow, ist ja gut, wow, Game, MonkaS, jetzt sind sie aber, jetzt haben sie auf mich abgesehen. Okay, nice, next, wo sind wir, auch hier ist, hat sich ja voll gelohnt, ist auch eine Tür, haben die immer zwei Türen? Okay, einfach, einfach weiter durchrushen. Ich muss da gleich mal gucken, was ich noch, was ich noch skillen muss. Drei Skill Points am Start, ich glaube, es hat schon jemand mal die Map gepost, ah, ich seh's, ach was, das pack ich jetzt auch schnell durch, aber das ist ja cool, dass die Leute das sharen, so, sind wir schon durch, da sind wir durch, so und wenn mich jetzt der Boss nicht trollt, ist es auch easy, easy clap, wow, wow, Pepehands, no, oh, oh, oh, oh, oh, oh, ich hätte nicht sagen sollen, das ist easy clap, alter, nee, nochmal hab ich kein Bock, jetzt, POE Lap, okay, zeig mal. Ja gut, ohne die Maps bringt mir das jetzt ja nix. Ich sehe ja nicht wo die Ausgänge auf der Map sind, ne? Oder check ichs nur nicht? Die Punkte über den Kreisen? Ah, ok dann probier ichs doch nochmal aus. Das muss ich mir dann doch nochmal angucken. Das muss ich mir dann doch nochmal angucken, ok. Mein Gier ist halt übelst crap. So, also das heißt das erste ist oben rechts. Kann ich mich schon immer dran erinnern. Also da heißt im Endeffekt, so dass ich jetzt auch richtig laufe, hier. Äh, ne? Oben rechts halten, wenn es weiter nicht weiter geht dann links. Ok, aha, ok, so und das heißt, jetzt, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, das heißt, jetzt, geh ich, was sagt mir das, jetzt geh ich oben links, oder? Oben links geh ich jetzt, ich mein das ist jetzt unten links, aber was soll ich machen, ne? Ich muss das aufmachen, ok, oder auch nicht, ok, da war das das falsche unten links, wo ich hingelaufen bin, dann ist unten, unten links ist dann eher so in die Richtung hier, ne? Da ist eigentlich eher gesagt, das ist oben rechts, ok, links, links halten. Ahja, ja, ok, das sind aber, also die, ja es kommt ungefähr hin, ok. Wobei, so ist es besser als komplett selbst suchen, ja, das auf jeden Fall. Warum hat der Typ mich vorhin fast one shotted, da kann doch überhaupt nichts, guckt euch mal an, du bist ein Kackenoob. Na gut, jetzt hat er mich auch nicht gehittert, ok, auf welcher Map bin ich jetzt? Jetzt bin ich, ich muss gucken, dass ich nicht sterbe, ne? Jetzt bin ich da, das heißt, jetzt muss ich wieder nach oben rechts, excellent. Ok, also rechts, sobald rechts geht, hier geht es nicht rechts, jetzt, das ist immer ein Dude, der das täglich postet, nett schlecht, nett schlecht. Der ist voll dabei, ha? Oh, also es sieht jetzt aktuell nicht so ganz nach oben rechts aus, oh, Monka, ich bin in der Falle stehen geblieben. Komm mal nach Schlemen, denk das mal gut, jetzt guck ich mir danach an, ha ha ha, das sind die Kackmopse, Möpse, ich renn hier einfach durch, ich renn hier einfach durch, lasst mich in Ruhe, Alter, geht fort, aber ich weiß nicht ob man damit, ok, wahrscheinlich braucht es ein bisschen Übung, wahrscheinlich braucht es ein bisschen Übung, bis man mit diesen Maps was anfangen kann, aber ich weiß nicht ob ich jetzt so viel langsamer wäre, wenn ich selbst suche, so, und jetzt muss ich, äh, jetzt muss ich Mitte oben, oder was, nein, da waren doch eben gar keine Mops, oh, fickt euch Kackmopse, ey, ich bin glaube noch nie wirklich gestorben, also vorletzte League, den ganzen Lab jetzt zweimal hintereinander, weil fail, Alter, try again, nee, jetzt hab ich keinen Bock mehr, jetzt mach ich noch ne Map und dann geh ich pennen, nee, wobei es ist 21.50 Uhr, sag mal, die Maps, die haben neue Symbole, oder, die Maps haben neue Symbole, oder haben die schon seit letzter League neue Symbole, nee, das ist eigentlich nur bloß Sack, außerdem ist das e-Mirror, damit kann man glaube ich gar nichts anfangen, das haben die letzte League schon geändert, okay, ach nee, die ändern die e-League, merkwürdig, ne, also, gerade sowas Zentrales, warum eigentlich, die Dinger, finde ich, lohnen sich erst später, aktuell ist es komplett useless, muss erst mal ein paar Maps machen, dass ich überhaupt so ein paar Atlas Points krieg, übrigens, was wollte ich noch mal skillen, das hier, ne, Elemental Resists, excellent, und was jetzt noch? Fire Dimensional Kills brauch ich jetzt nicht, gut, hier Respector, hier Respector halt nur, Endurance Charges, lohnt sich das? Doch klar, warum nicht, so, ich run jetzt ja mal schnell, oh Metamorph Map, excellent Metamorph Map, da ist er, der krasse Metamorph Man, was ist denn jetzt los? Es ist Metamorph Map plus, äh, also, das ist übrigens eine dieser Endgame Mechanics, wo ich meinte, man hat so ein Board, wo man die Leute richtig verbinden muss, ich hab legit keine Ahnung, was hier eigentlich passiert, ich hab keine Ahnung, Drop Map, easy, oh, gibt's irgendjemand, der das checkt? Übelster Müll, äh, eigentlich auch ziemlicher Müll, ich auch nicht, ja, gibt wahrscheinlich kaum einen, der das kapiert, okay, wir können doch keinen Boss zusammenbauen, aber bestimmt am Ende der Map können wir bestimmt einen Boss zusammenbauen, excellent. Oh, mir fällt gerade ein, ich hab vergessen, meinem Chef vorzuschicken, äh, was ich gemacht hab, seitdem wir nur noch Dauer Home Office haben, müssen wir einmal am Tag so eine Mail schreiben, so nach dem Motto, so grob, was wir gemacht haben, hier nur ein paar Sätze, hab ich voll vergessen, aber mach ich am Montag oder am Dienstag, wenn ich wieder da bin, das ist kacke, über Chat zu erklären, nee, nee, nee, du musst mir das jetzt auch nicht erklären, ich kann mir einfach ein Tutorial Video angucken, gibt's bestimmt, gibt's bestimmt ein paar Tutorial Videos, aber was du vielleicht weißt, ist, lohnt sich das oder ist das eher so ein Gimmick, was jetzt nicht wirklich großartig was bringt? Eine Abmahnung kannst du dafür nicht geben, erstens wäre das ein bisschen arg überzogen und außerdem steht es ja nicht im Vertrag irgendwie drin, wo man, nee, also, und außerdem verstehe ich mich mit meinem Chef ganz gut, das ist halt schon aus dem Grund nicht, Pring Cebaro, grad da bist, wusstest du, dass mein Chef früher auf Anime Conventions gegangen ist und Cosplay gemacht hat, das ist mal ein nicer Chef, oder, aber wie gesagt, wir sind ja ungefähr gleich alt, da haben wir dann gleich in Laden die Ausbildung gemacht, was hier, nochmal das Syndicate, also du machst es nicht, aber es kann sich lohnen, okay. Also ich klick jetzt einfach irgendwas an, nicht als würde ich da, ich möchte nicht den Anschein erwecken, als blicke ich durch, was hier passiert, ach guck mal, wir können wieder was anwählen, anwähl, und sieht das, auch nicht, das Ding will ich hier nicht verwenden, was war das andere, moment gab es nicht, ah hier das, so, so kann ich jetzt die Map abschließen, hab ich alles gelootet an Metamorph Viechern, ja das mit der Unterkunft kenn ich, was ist eigentlich die Map, ey die Map ist ja komplett loaded mit Zeug hier, excellent, also versuch so viele Leute hier möglich einen Branch zu bekommen, wenn der Balken beim Leader voll ist, kannst du in deren Unterkunft gehen und die kämpfen, ja das kenn ich, wie gesagt, das hab ich schonmal gemacht in der vorletzten League, also ich wusste nicht warum das passiert, sondern nur dass es halt passiert, wenn man das ne Weile gemacht hat, dann, dann muss man quasi den hier Hauptquartier raiden, also ihr seht schon, Path of Exile hat so unglaublich viele Endgame bzw. Mechanics im Spiel, dass es schon fast übertrieben ist, so jetzt kann ich mir noch einen Boss zusammenbauen, ok, rare weapon, map, map ist immer gut, map droppen, your coins mein wegen, currency items, ja ok, currency items, excellent, übrigens auch später, das ist kein allzu gutes Bosskiller Bild, ne, Monka, es passiert grad so viel, ich blicke immer durch, ok, es ist tot, mein infest voll, das ist doch alles, hör mal auf mich zu bespucken hier, komisches Viech, geh weg, die Unix sind doch eigentlich alle Müll, die ich hier hab, ne, sei mal so schlecht, das suckt, was soll ich mit 3 bis 7, das ist absoluter Müll, ich muss eher, kann ich noch irgendwas droppen, ich will jetzt eigentlich gar keine Items durchgucken, kann ich noch irgendwas droppen, auch Müll, auch kompletter Müll, ist eigentlich auch nicht so geil, ah, ich hab noch ne Map hier liegen, dropp ich denn dafür, ah no, damn, ah, gut, ähm, zum Beispiel kann man bis zu 3 White Sockets drauf machen, ja ich guck mir mal den Guide dazu an, bloß wieder mal nen Guide zu angucken, ich hab ein bisschen viele Tabs gekauft, ein bisschen rein Pay to Win, ich sortier mir das morgen mal alles, hab ich grad echt keinen Nerv drauf, jetzt sortier ich jetzt auch mal alle die richtigen Stash Tabs ein, Temple Map 3, du kannst die Tabs in der Liste rechts klicken und dann, ah, achso, auch nicht, das ist nicht verkehrt, Hey Max hättest, übrigens ist Stream gleich vorbei, ne, also, hey Max hättest du Interesse an einem Job als Data Scientist? Kommt aufs Geld an und wo es ist und um was es genau geht, aber eigentlich bin ich ziemlich happy da wo ich bin, so, genug kreiseln, Crying, für heute, äh, ja, denn, trotzdem schön, dass so viele dabei gewesen sind, jetzt hab ich meine tägliche Dosis, Kreiselgrind hinter mir, wie lange haben wir jetzt gespielt, warum muss man eigentlich jetzt hier drauf, warum, erstens warum leckt die Seite und warum muss man jetzt überhaupt erst hier drauf klicken, damit man sich die Videos anzeigen lassen kann, ja, ein bisschen über 4 Stunden und das ist noch wenig Kreiselgrind, man kann deutlich mehr Kreiselgrinden, ja, ich hab doch den Stream neu gestartet, exellent, ja, Sebaro unterm Stream, das ist glaub ich auch nix von Twitch oder, das ist was von FFZ und FFZ zählt glaube ich einfach nur bis zu Refresh, kann das sein, wenn das Streamer online war, Big Brain, ja, morgen muss ich mir da mal in Ruhe angucken, äh, sagen wo sind meine Spells hin, äh, morgen muss ich mir dann, ach so, wegen Control, ah, weil ich Control halte, morgen muss ich mir dann in Ruhe mal angucken, was ich für Endgame-Spec mache, machen muss, ja, aber das werd ich wahrscheinlich nicht on Stream machen, ExxonMobile, nö, das sagt mir nix, klingt nach Mobilfunk-Anbieter, ne, kenne ich nicht, also Leute, schön, dass so viele am Bestand waren, ich geh jetzt auf, ihr seht uns, bis morgen, oder so, mal gucken, see you!", "segments": [{"id": 1, "start": 0.0, "end": 19.96, "text": "Jetzt müsste es deutlich besser aussehen."}, {"id": 2, "start": 19.96, "end": 32.44, "text": "Oder Sebaro haben wir jetzt, jetzt haben wir 8k, ne?"}, {"id": 3, "start": 32.44, "end": 34.08, "text": "Jetzt sieht das Game auch gleich viel besser aus."}, {"id": 4, "start": 34.08, "end": 49.88, "text": "Oh, ups, okay, ich wusste gar nicht, dass ich da rausgegangen bin, aber okay."}, {"id": 5, "start": 49.88, "end": 50.88, "text": "Dann."}, {"id": 6, "start": 50.88, "end": 61.2, "text": "So, jetzt sieht es auch gleich besser aus, ne?"}, {"id": 7, "start": 61.2, "end": 70.48, "text": "Ja, das muss bei mir auch mal einer sagen, Alter."}, {"id": 8, "start": 70.48, "end": 75.84, "text": "Ich hab, bevor ich den Stream gestartet hab, hab ich mir gedacht, Max, du musst die Quali"}, {"id": 9, "start": 75.84, "end": 79.12, "text": "hochstellen, weil das hab ich das letzte Mal schon gemerkt und dann hab ich's vergessen."}, {"id": 10, "start": 79.12, "end": 87.28, "text": "Übrigens, ähm, habt ihr mitgekriegt, dass Nintendo, ich hab ja, ich hab ja meinen Augen"}, {"id": 11, "start": 87.28, "end": 91.24, "text": "nicht getraut, Nintendo möchte jetzt einen Pokemon-Moba machen."}, {"id": 12, "start": 91.24, "end": 98.28, "text": "Was ist eigentlich dieses Onlyfans?"}, {"id": 13, "start": 98.28, "end": 103.44, "text": "Das weißt du genau, wenn du fragst, Alter."}, {"id": 14, "start": 103.44, "end": 110.96, "text": "Das ist da, wo die ganzen Camgirls und Boopcam-Youtube-Twitch-Streamerinnen ihre Nacktbilder hochladen."}, {"id": 15, "start": 110.96, "end": 123.96, "text": "Ja, und sie wollen einen Pokemon-Moba machen, und da hab ich mir gedacht, warum ausgerechnet"}, {"id": 16, "start": 123.96, "end": 125.92, "text": "ein fucking Moba?"}, {"id": 17, "start": 125.92, "end": 134.0, "text": "Ich mein, Mobas sind seit fünf Jahren nicht mehr richtig hype."}, {"id": 18, "start": 134.0, "end": 140.76, "text": "Ich mein, besser als im Pokemon Battle Royale."}, {"id": 19, "start": 140.76, "end": 144.48, "text": "Wahrscheinlich hatten sie die Auswahl zwischen einem Pokemon-Moba oder einem Pokemon Battle"}, {"id": 20, "start": 144.48, "end": 145.48, "text": "Royale."}, {"id": 21, "start": 145.48, "end": 149.16, "text": "Und haben gesagt, okay, Battle Royale passt zu Pokemon nicht, wir machen, wir machen lieber"}, {"id": 22, "start": 149.16, "end": 150.16, "text": "einen Moba."}, {"id": 23, "start": 150.16, "end": 151.96, "text": "Aber da sieht man schon mal, dass denen nichts einfällt."}, {"id": 24, "start": 151.96, "end": 161.36, "text": "Ich mein, ein Pokemon-Moba, what the fuck, was, ich mein, Pokemon ist die größte Marke"}, {"id": 25, "start": 161.36, "end": 162.36, "text": "der Welt."}, {"id": 26, "start": 162.36, "end": 167.32, "text": "Oder die teuerste Marke, oder die bekannteste Marke, ich weiß es nicht genau, in welchem"}, {"id": 27, "start": 167.32, "end": 169.68, "text": "Ranking, aber Pokemon ist überall ganz weit vorne."}, {"id": 28, "start": 169.68, "end": 177.72, "text": "Pokemon, es verkauft sich alles, wo Pokemon drauf steht, also es verkauft sich auch einen,"}, {"id": 29, "start": 177.72, "end": 180.96, "text": "oder was heißt verkauft, es macht alles Geld, wo Pokemon drauf steht."}, {"id": 30, "start": 180.96, "end": 187.52, "text": "Im Prinzip, ein Pokemon-Moba wird auch Geld machen, aber ein Moba, Alter, was ist denn"}, {"id": 31, "start": 187.52, "end": 188.52, "text": "mit euch los?"}, {"id": 32, "start": 188.52, "end": 199.4, "text": "Viel uninspirierter kann es doch nicht mal werden als ein Pokemon-Moba, ey."}, {"id": 33, "start": 199.4, "end": 214.88, "text": "Also ich hab mir echt nur gedacht, WTF, als ich das gelesen hab."}, {"id": 34, "start": 214.88, "end": 222.84, "text": "Ich hab mir gesagt, ich hab mir, ich hab mir gedacht, Kek-Tribble-U, Kek-Quad-Tribble-U"}, {"id": 35, "start": 222.84, "end": 230.6, "text": "hab ich mir gedacht, als ich das gesehen hab mit Pokemon-Moba, ja, und es ist von Tencent,"}, {"id": 36, "start": 230.6, "end": 231.6, "text": "das kommt ja auch noch dabei."}, {"id": 37, "start": 231.6, "end": 247.48, "text": "Drehendes Kek-Quad-Tribble-U hab ich mir gedacht, ja, 3D, Kek-Tribble-U 3D, und, und, und, Run-Speed,"}, {"id": 38, "start": 247.48, "end": 254.76, "text": "nope, Trash, oh, warum denkt mein, warum denkt mein Loot-Filter, dass das gut ist?"}, {"id": 39, "start": 254.76, "end": 263.48, "text": "Das ist nicht gut, das ist, übelster Crap, ach ne, das war gar nicht mein Loot-Filter,"}, {"id": 40, "start": 263.48, "end": 277.04, "text": "das war meine Aura, gute Base, ah, das kann natürlich sein, lohnt sich das dann trotzdem"}, {"id": 41, "start": 277.04, "end": 287.0, "text": "zu behalten sowas und für irgendwelche Craftsachen zu verwenden, aber ein Level 63 Base kann"}, {"id": 42, "start": 287.0, "end": 304.0, "text": "doch nicht gut sein."}, {"id": 43, "start": 304.0, "end": 318.08, "text": "Interaction-Shots sind gerade gut fast wert, okay, hätt ich gar nicht gedacht, nice-u,"}, {"id": 44, "start": 318.08, "end": 324.32, "text": "sehr, sehr nice, da hab ich ja sogar noch bisschen mehr Kohle dann, wenn ich ja nicht"}, {"id": 45, "start": 324.32, "end": 354.28, "text": "die Story durch hab, ein paar Sachen verkauft hab, um nicht zu sagen,"}, {"id": 46, "start": 354.28, "end": 365.88, "text": "was ich mir da noch reden, Stonks, wir haben jetzt übrigens Stonks-Emotes, probiert mal"}, {"id": 47, "start": 365.88, "end": 369.72, "text": "aus, Stonks, na groß, ich glaub groß geschrieben, bin mir nicht ganz sicher, wie es geschrieben"}, {"id": 48, "start": 369.72, "end": 380.0, "text": "wird, aber wir haben ein Stonks-Emote, warum, warum kann ich das noch mal, warum kann ich"}, {"id": 49, "start": 380.0, "end": 385.52, "text": "das nicht leveln, weil mir Decks fehlt, oder, mir fehlt Decks, ich mein meine Items sind"}, {"id": 50, "start": 385.52, "end": 391.56, "text": "ziemlich a Crap, aber für die Kampagne reicht's halt dicker aus, mir fehlt Decks, so, dann"}, {"id": 51, "start": 391.56, "end": 398.72, "text": "craft ich mir jetzt einfach noch mal schnell Decks auf irgendeinem Item und kann zumindest"}, {"id": 52, "start": 398.72, "end": 407.12, "text": "das Ding noch ein bisschen leveln, Stonks mit großem S, stimmt, so war's das, so haben wir"}, {"id": 53, "start": 407.12, "end": 414.08, "text": "hier irgendwie schon was, Fire, Resists, Cold, ja, exzellent, kann man da Decks drauf craften,"}, {"id": 54, "start": 414.08, "end": 422.6, "text": "nein, da kann man Decks drauf craften, Decks, Decks, na, what, kein Decks, da kann man Decks"}, {"id": 55, "start": 422.6, "end": 430.4, "text": "drauf craften, auch kein, achso die sind schon voll, ah nee, ich hab keinen Platz mehr,"}, {"id": 56, "start": 430.4, "end": 444.48, "text": "ok, ich hab genug Resists, aber ich verlier gleich Resists, ich lass das mal so, 3K Viewer,"}, {"id": 57, "start": 444.48, "end": 464.88, "text": "welcher Haus willst du mich jebaiten, hab keine 3K Viewer, 61, je, je, je, je, jebaited,"}, {"id": 58, "start": 464.88, "end": 490.08, "text": "da stand grad bei dir, ok, wo ist der Endgegner, ah, ah, ah, ich hab meine Spells vergessen,"}, {"id": 59, "start": 490.08, "end": 505.04, "text": "bin ich überhaupt richtig, bin ich überhaupt richtig, glaub schon, glaub ich bin hier richtig,"}, {"id": 60, "start": 505.04, "end": 526.44, "text": "oder, äh, hä, Moment, nee, ich bin falsch, ich bin falsch, oder,"}, {"id": 61, "start": 526.44, "end": 547.0, "text": "hä, Moment, ich bin grad, ich bin grad echt verwirrt,"}, {"id": 62, "start": 547.0, "end": 572.2, "text": "angeblich, angeblich muss ich jetzt noch hier den Boss killen, oder?"}, {"id": 63, "start": 572.2, "end": 584.36, "text": "ich hab, ah nee, ich muss ins nächste, ich muss ins nächste Gebiet, oder ist der Typ"}, {"id": 64, "start": 584.36, "end": 595.8, "text": "hier, ist der Typ hier oder im nächsten Gebiet,"}, {"id": 65, "start": 595.8, "end": 604.48, "text": "wahrscheinlich muss ich rechts weiter, ja, das ist, das ist der gleiche, das ist der"}, {"id": 66, "start": 604.48, "end": 621.8, "text": "recycelnde Boss aus Akt 5, ist das, die recyceln eben gerne Bosse in dem Game,"}, {"id": 67, "start": 621.8, "end": 634.32, "text": "ich glaub ich bin zurückgelaufen, weil ich übelst Noob bin, oder, übelst ein, ein übelst"}, {"id": 68, "start": 634.32, "end": 639.64, "text": "Noob, Noob ich ja Noob, nee, ach, da unten muss ich wahrscheinlich hin,"}, {"id": 69, "start": 639.64, "end": 660.28, "text": "ich bin grad, das ist big brain move, hä, hast du den schon gekillt, nee, da steht ja,"}, {"id": 70, "start": 660.28, "end": 678.4, "text": "Moment, hab ich den, nee, Moment, jetzt bin ich aber echt verwirrt,"}, {"id": 71, "start": 678.4, "end": 705.68, "text": "du hast den schon gekillt, nee, was, nee, boah jetzt, jetzt, jetzt bin ich echt verwirrt,"}, {"id": 72, "start": 705.68, "end": 711.64, "text": "okay, was, wir lassen mal das Questlog updaten, was nehme ich jetzt mal silver flask, ah meinetwegen,"}, {"id": 73, "start": 711.64, "end": 730.08, "text": "nee, nee, ich hab den noch nicht gekillt, die, ich hab die, ich hab die, nur die Questanzeige"}, {"id": 74, "start": 730.08, "end": 737.16, "text": "nicht gehabt, also ich muss, ich muss, ich muss den Dude noch killen, muss, ich muss den schon"}, {"id": 75, "start": 737.16, "end": 752.88, "text": "noch killen, muss, ich muss den schon noch killen, genau und ich hab auch kein Quest-Item,"}, {"id": 76, "start": 752.88, "end": 762.4, "text": "muss ich denn hin, nee, da hab ich jetzt keinen Bock drauf,"}, {"id": 77, "start": 762.4, "end": 773.24, "text": "bin ich so verwirrt gewesen, als ich in die falsche Richtung gelaufen bin und"}, {"id": 78, "start": 773.24, "end": 779.04, "text": "dass da unten ist der eigentliche Eingang, bin ich, ich glaube ich bin wirklich in die"}, {"id": 79, "start": 779.04, "end": 790.8, "text": "komplett falsche Richtung gerannt gerade, so brain afk-mäßig, ah, die komplett, oh Gott,"}, {"id": 80, "start": 790.8, "end": 797.52, "text": "fail, Alter, jetzt sind wir richtig, jetzt wird nämlich einmal der Boss recycelt,"}, {"id": 81, "start": 797.52, "end": 821.0, "text": "der kann überhaupt nix, der sucked, reassembled ist er, oh, na besser als re c++, oh, der war"}, {"id": 82, "start": 821.0, "end": 841.84, "text": "schlecht, Alter, wow, wow, wow, excellent, ah ja, sehr schön, jetzt passt, jetzt sind wir richtig,"}, {"id": 83, "start": 841.84, "end": 856.96, "text": "single target, so, ok, zahmen die gekillt, return to also using waypoint, talk to, ok,"}, {"id": 84, "start": 856.96, "end": 865.72, "text": "and armor rewards, ah was brauche ich armor rewards, ist doch useless, gleich weiter rushen,"}, {"id": 85, "start": 865.72, "end": 877.04, "text": "oh, rip, keine ahnung, was hatten hier die beste chance für mein zeug,"}, {"id": 86, "start": 877.04, "end": 894.68, "text": "ah, pains chat, wow, Alter, Alter, mein Kopfhörer piepst übertrieben, btf, Moment,"}, {"id": 87, "start": 894.68, "end": 913.88, "text": "oh, habt ihr es gerade gehört, monkaier, mein audiointerface hat gerade ultra rumgespackt,"}, {"id": 88, "start": 913.88, "end": 932.92, "text": "ok, so, ich glaube jetzt sind wir fertig, ne, talk to the, das muss ich glaube ich machen für"}, {"id": 89, "start": 932.92, "end": 947.56, "text": "den skillpoint, das muss ich glaube ich machen für den skillpoint, ravaged square, muss ich"}, {"id": 90, "start": 947.56, "end": 952.4, "text": "glaube ich machen für den skillpoint, und dann sind wir durch mit der story, danach kommt nur"}, {"id": 91, "start": 952.4, "end": 957.32, "text": "noch der endboss und dann ist fertig, so, ich glaube ich kann es mir jetzt halbwegs merken,"}, {"id": 92, "start": 957.32, "end": 965.56, "text": "für den nächsten anlauf dann, ähm, was für ein build guide folgst du, gerade dem hier,"}, {"id": 93, "start": 965.56, "end": 983.92, "text": "ähm, dem da, aber der hat vor zwei tagen so ein aktualisiertes build hochgeladen,"}, {"id": 94, "start": 983.92, "end": 992.92, "text": "auf grundlage dessen wie es gelaufen ist, also, und ich hab auch gerade bei diesem, bei dem build"}, {"id": 95, "start": 992.92, "end": 998.08, "text": "auch im forum auf reddit gelesen, dass das wohl absolut noob easy mode build sein soll,"}, {"id": 96, "start": 998.08, "end": 1006.32, "text": "also genau das richtige für mich, exzellent, äh, wo muss ich jetzt hin, und zwar, control"}, {"id": 97, "start": 1006.32, "end": 1028.16, "text": "blocks, control blocks sind, die control blocks, head down towards bottom middle of the area,"}, {"id": 98, "start": 1028.16, "end": 1053.52, "text": "alter, ok, bottom middle, machen wir, ist das bottom middle, wo ich lang gehe,"}, {"id": 99, "start": 1058.16, "end": 1079.76, "text": "ich könnte unbedingt ein paar chaos resies gebrauchen, what is happening,"}, {"id": 100, "start": 1088.16, "end": 1113.48, "text": "ok, ok, ich hab keinen plan, was das macht, ist sogar ganz brauchbar, mehr life könnte es haben,"}, {"id": 101, "start": 1119.16, "end": 1127.44, "text": "ach man kann ja den kram anwählen, das stimmt, da kann man sich jetzt ja aussuchen,"}, {"id": 102, "start": 1127.44, "end": 1145.28, "text": "was man drauf haben will, ok, das ist sogar halbwegs brauchbar, gab's nicht noch mehr zum anwählen,"}, {"id": 103, "start": 1145.28, "end": 1157.24, "text": "hab ich nicht noch was zum anwählen, oder war's das, ich glaub das war's, ultra crap alles,"}, {"id": 104, "start": 1166.24, "end": 1171.64, "text": "ja aber ich glaube wo es nicht egal ist, je nachdem welche mods man gerne haben möchte,"}, {"id": 105, "start": 1171.64, "end": 1178.84, "text": "sollte man die halt anwählen lassen, dass man die lernt, oder, control blocks, nein,"}, {"id": 106, "start": 1178.84, "end": 1202.32, "text": "wo sind die control blocks, control blocks, hier control blocks, ah ja, control blocks,"}, {"id": 107, "start": 1202.32, "end": 1210.84, "text": "so und da müssen wir jetzt einfach durchrushen und irgendwas killen, wie so immer in pass of"}, {"id": 108, "start": 1210.84, "end": 1218.96, "text": "exile, oder irgendein item looten müssen wir hier glaube, für skill, skill, punkte, quest,"}, {"id": 109, "start": 1218.96, "end": 1231.92, "text": "sag mal ist das besser als meins, was ich hab, ja na viel besser, ja ist ja gut hier,"}, {"id": 110, "start": 1231.92, "end": 1242.68, "text": "was will was denn hier los, viel besser, na ja ne, ne, moment, meine ist besser, oder,"}, {"id": 111, "start": 1242.68, "end": 1252.88, "text": "die ist nur besser, weil sie, ne meine ist bessere base, allerdings die mods sind besser,"}, {"id": 112, "start": 1252.88, "end": 1261.24, "text": "der chat, der chat, lass mal zusammen, der chat ist der beste, ist beste, ist wie der"}, {"id": 113, "start": 1261.24, "end": 1284.84, "text": "brachland chat, er ist richtig pepega chat, das ist aber nur getrolle im chat, so wie"}, {"id": 114, "start": 1284.84, "end": 1300.16, "text": "in allen mmos und online spielen, so eigentlich sollte ich jetzt hier ein item finden, was"}, {"id": 115, "start": 1300.16, "end": 1313.08, "text": "ich looten muss, hier unten, ne, das ist so ein buddelding, buddelors, plickt ihr, chat,"}, {"id": 116, "start": 1313.08, "end": 1319.68, "text": "plickt ihr dank den effekten auch noch schön durch, was passiert, ich hab übrigens gelesen,"}, {"id": 117, "start": 1319.68, "end": 1324.84, "text": "man kann, man kann ein bisschen, ein bisschen pay to win machen, was das angeht, es gibt"}, {"id": 118, "start": 1324.84, "end": 1332.96, "text": "ne microtransaction, die die effekte niedriger macht, was fast schon ein bisschen pay to"}, {"id": 119, "start": 1332.96, "end": 1356.4, "text": "win ist bei dem build, ja es gibt ne microtransaction, die die effekte halt anders macht, so hab ich"}, {"id": 120, "start": 1356.4, "end": 1382.08, "text": "das item jetzt gleich mal hier, jiff ich brauch skillpunkte, wo ist das item, items, oh was"}, {"id": 121, "start": 1382.08, "end": 1409.6, "text": "ist das, arena, ah boss der kann nix, oh oh oh ok der macht doch damage, ok wenn man ausweicht"}, {"id": 122, "start": 1409.6, "end": 1430.92, "text": "sind die ganzen bosse eigentlich ziemlich easy, aua, sterben blitz, ach das sind, das sind"}, {"id": 123, "start": 1430.92, "end": 1438.52, "text": "so typischer drei phasen boss, den man gar nicht killen kann auf einmal, schreib hallo"}, {"id": 124, "start": 1438.52, "end": 1457.8, "text": "in den ingame chat und schau was passiert, probier ich gleich aus, soll ich mal in deine"}, {"id": 125, "start": 1457.8, "end": 1479.52, "text": "party kommen, da sieht man nicht mehr viel, was spielst du denn, rainbow, rainbow, was,"}, {"id": 126, "start": 1479.52, "end": 1492.2, "text": "rain, rain arrow, ach rain of arrows chat, ok das ist wirklich, globe, global abschal"}, {"id": 127, "start": 1492.2, "end": 1501.24, "text": "in twitch chat, what, ok also ich habs geschafft wir können die kampagne jetzt abschließen,"}, {"id": 128, "start": 1501.24, "end": 1511.32, "text": "wie heißt mein chat eigentlich, wupps, ok, nice so und jetzt können wir die kampagne"}, {"id": 129, "start": 1511.32, "end": 1526.44, "text": "endlich abschließen, reicht auch, genug, so jetzt müssen wir zurück mit innocence reden"}, {"id": 130, "start": 1526.44, "end": 1541.96, "text": "und dann haben wir, haben wirs, erstmal noch mal skillen schnell, du hast noch was vergessen"}, {"id": 131, "start": 1541.96, "end": 1557.12, "text": "was denn, control blocks, nee, du wolltest noch in den chat schreiben, ok, ok alles klar"}, {"id": 132, "start": 1557.12, "end": 1579.72, "text": "da seh baro, hallo, cute chat, der chat ist so ppeger alter, ist ein richtiger ppeger"}, {"id": 133, "start": 1579.72, "end": 1590.12, "text": "chat alter, ok das wars jetzt, jetzt kommt der boss und dann sind wir endlich mit der"}, {"id": 134, "start": 1590.12, "end": 1608.6, "text": "kampagne durch, poggers, achso ich wollt gucken was ich skillen muss, was muss ich denn skillen,"}, {"id": 135, "start": 1608.6, "end": 1614.92, "text": "was muss ich noch skillen, den kram haben wir gespeckt, das hab ich auch schon alles"}, {"id": 136, "start": 1614.92, "end": 1630.16, "text": "gespeckt, hier oben muss ich noch einfach skillen, das kann ich wegspecken, das kann"}, {"id": 137, "start": 1630.16, "end": 1646.6, "text": "ich wegspecken und das hier kann ich noch dazu skillen, ja, an dem dex node, mehr resis,"}, {"id": 138, "start": 1646.6, "end": 1651.52, "text": "ist ja nicht so alt, hätte ich eh nicht schon cap resis, allerdings nach dem nächsten boss"}, {"id": 139, "start": 1651.52, "end": 1664.56, "text": "krieg ich glaube ich noch 25% penalty was resis angeht, oder sogar 50%, wieviel penalty"}, {"id": 140, "start": 1664.56, "end": 1676.24, "text": "kriegt man, 50% oder 25, 30 ok, ja irgendwo in der mitte, ok ja dann brauch ich nämlich"}, {"id": 141, "start": 1676.24, "end": 1693.56, "text": "die resis erstmal, erstmal hier schön den kreisel grind weiter starten, warum hab ich"}, {"id": 142, "start": 1693.56, "end": 1700.56, "text": "denn schon wieder nen skillpoint, hab doch gerade eben erst geskillt, skillen wir nochmal,"}, {"id": 143, "start": 1700.56, "end": 1716.4, "text": "excellent, auch mehr, mehr resis, was, ok, moment der hat das andere geskillt, weiß"}, {"id": 144, "start": 1716.4, "end": 1728.64, "text": "wahrscheinlich, ja besser, mach mal passives im chat, damit siehst du eventuell fehlende"}, {"id": 145, "start": 1728.64, "end": 1741.76, "text": "skillpoints, ach, 20 passive das wars oder, ich hab alle"}, {"id": 146, "start": 1758.64, "end": 1766.32, "text": "ja ich muss, ich muss dann noch meine banditen respekten, wenn ich ordentliches, wenn ich"}, {"id": 147, "start": 1766.32, "end": 1771.44, "text": "mir dann mal ordentliches gear zusammengesucht hab und ich mein, mein, mein gear was ich"}, {"id": 148, "start": 1771.44, "end": 1781.8, "text": "seit 40 levels an hab und dann muss ich auch allira wegspecken und noch 2 skillpoints von"}, {"id": 149, "start": 1781.8, "end": 1792.16, "text": "den banditen abgreifen, wie respekt man banditen nochmal, willst du nicht dein merklab machen,"}, {"id": 150, "start": 1792.16, "end": 1799.48, "text": "das ist ne gute idee, das sollte ich tatsächlich machen, da hast du voll und ganz recht, ja,"}, {"id": 151, "start": 1799.48, "end": 1804.16, "text": "ich sollte mein lab davor machen, auf der anderen seite, ich hab genug resis eigentlich, wenn"}, {"id": 152, "start": 1804.16, "end": 1814.48, "text": "du dir das anguckst, also, kann ich danach auch machen, ja ich sollte slap machen, aber"}, {"id": 153, "start": 1814.48, "end": 1827.52, "text": "ich hab genug resis, ich kann das danach auch machen, 20 regret orbs und nix amulett, ok,"}, {"id": 154, "start": 1827.52, "end": 1836.52, "text": "na dann, dann respek ich danach nochmal, meine bandits, aber erst, nachdem ich das lab gemacht"}, {"id": 155, "start": 1836.52, "end": 1855.16, "text": "hab und ordentliches gear hab, weil ich brauch die resis, by the way, ich hab keine ahnung"}, {"id": 156, "start": 1855.16, "end": 1860.16, "text": "mehr, wie der letzte boss funktioniert hat, aber nachdem das game gerne bosse recycelt,"}, {"id": 157, "start": 1860.16, "end": 1865.68, "text": "ist das wahrscheinlich mehr oder weniger der gleiche boss wie in act 5 oder act 6, ja weiß"}, {"id": 158, "start": 1865.68, "end": 1885.72, "text": "ich nicht mehr, wie zur halbzeit quasi, richtiger blanket chill stream, ja, es gab ja die auswahl"}, {"id": 159, "start": 1885.72, "end": 1896.16, "text": "kein stream, oder kreisel crying stream, in dem ich halt zum größten teil kreisel crying"}, {"id": 160, "start": 1896.16, "end": 1899.12, "text": "da aber halt stream an hab, ich find es übrigens schön, dass trotzdem so viele leute dabei"}, {"id": 161, "start": 1899.12, "end": 1906.64, "text": "sind, mein klar ist nur ein drittel oder viertel von sonst, mittlerweile fast sogar schon eher"}, {"id": 162, "start": 1906.64, "end": 1913.36, "text": "nur ein viertel, ich hatte ja in letzter zeit recht regelmäßig 200 plus, wo ich gesagt"}, {"id": 163, "start": 1913.36, "end": 1923.6, "text": "hab, unglaublich wer sich da für alles interessiert, ja, ich find es trotzdem gut, dass so viele"}, {"id": 164, "start": 1923.6, "end": 1935.48, "text": "dabei sind, da muss ich nicht alleine kreisel crying machen, by the way, ich guck immer"}, {"id": 165, "start": 1935.48, "end": 1939.2, "text": "pass of exile stream, deswegen bin ich übrigens jetzt, muss ich vielleicht mal erklären,"}, {"id": 166, "start": 1939.2, "end": 1943.28, "text": "wie ich überhaupt wieder auf das game gekommen bin, ich hab, also ich hab ja erst wieder"}, {"id": 167, "start": 1943.28, "end": 1949.12, "text": "angefangen, quasi vorletzte season, und der account ist zwar von 2013, aber ich hab ewig"}, {"id": 168, "start": 1949.12, "end": 1956.76, "text": "nicht mal gespielt, so und ich guck immer pass of exile streams zum schlafen, zum einschlafen"}, {"id": 169, "start": 1956.76, "end": 1963.04, "text": "und die sind meistens ultra entspannend, weil da ist halt einer am start der kreisel crying"}, {"id": 170, "start": 1963.04, "end": 1974.36, "text": "zu, man muss sich halt den passenden streamer raussuchen, der nicht rumschreit oder so,"}, {"id": 171, "start": 1974.36, "end": 1979.64, "text": "und dann ist das ultra entspannend, da guckt man einfach kreisel crying zu, irgendwelche"}, {"id": 172, "start": 1979.64, "end": 1987.24, "text": "leuten die über sonst was erzählen oder sich über big brain in game crafting moves unterhalten,"}, {"id": 173, "start": 1987.24, "end": 1994.68, "text": "oder kann man wunderbar pennen bei, was schaut ihr mal uli app an, ist das jetzt werbung,"}, {"id": 174, "start": 1994.68, "end": 2013.96, "text": "ist das gbait werbung, ok was ist das, gucken wir mal, uli app, ach so ein ding, das haben"}, {"id": 175, "start": 2013.96, "end": 2019.84, "text": "wir das nicht sogar schon ausprobiert, solche launcher gibt es tausende, den haben wir sogar"}, {"id": 176, "start": 2019.84, "end": 2025.76, "text": "schon ausprobiert, wenn wir nicht den ausprobiert haben, dann haben wir einen sehr ähnlichen"}, {"id": 177, "start": 2025.76, "end": 2036.36, "text": "schon ausprobiert, ist das rofi für windows ein bisschen, ein bisschen so ähnlich, allerdings"}, {"id": 178, "start": 2036.36, "end": 2046.8, "text": "besser integriert und mit mehr funktionen standardmäßig dabei ohne plugins, this is it, ne erst nochmal"}, {"id": 179, "start": 2046.8, "end": 2059.92, "text": "garden warfare machen, sterben please, hopp, garden warfare, excellent, lass mal ne runde,"}, {"id": 180, "start": 2059.92, "end": 2073.28, "text": "oh seats, seats sind voll, kein platz mehr, da oben ist noch platz, excellent seats, hab"}, {"id": 181, "start": 2073.28, "end": 2080.36, "text": "mal ne frage bin neu in poe, aber hab mies bock zu delven oder wie das heißt, aber hab"}, {"id": 182, "start": 2080.36, "end": 2085.96, "text": "gesehen das kostet mies das gehen, wie komm ich am besten ran, ich bin auch ziemlich ein"}, {"id": 183, "start": 2085.96, "end": 2092.48, "text": "rofi noob, das einzige was ich dir dazu sagen kann ist, dass ich das noch nie gemacht habe"}, {"id": 184, "start": 2092.48, "end": 2105.56, "text": "und heute morgen irgendeiner 1900 tiefe erreicht hat im chat, ja du brauchst, mit sicherheit"}, {"id": 185, "start": 2105.56, "end": 2110.08, "text": "brauchst du gear, allerdings bis zu ner gewissen, bis zu ner gewissen tiefe, das stimmt nicht"}, {"id": 186, "start": 2110.08, "end": 2114.08, "text": "das ich noch nicht gemacht hab, ich hab mal bis 120 oder so gedelft, aber das ist ja nicht"}, {"id": 187, "start": 2114.08, "end": 2122.12, "text": "so wahnsinnig viel, außerdem war das mein op necro von vor 2 leaks, aber im chat sind"}, {"id": 188, "start": 2122.12, "end": 2125.12, "text": "ein paar leute die wohl plan haben von dem game, da kann dir vielleicht einer helfen,"}, {"id": 189, "start": 2125.12, "end": 2144.28, "text": "so boss lets go, bashen alter bashen, guck mal das sackt, ganz noobbosse, au alter, is ja"}, {"id": 190, "start": 2144.28, "end": 2150.8, "text": "what the, warum hast du so viel damage, der soll ja aufhören damage zu machen, anzeige"}, {"id": 191, "start": 2150.8, "end": 2166.84, "text": "es raus, was war die frage, xarith hat gefragt, wie er am besten zu delvegear kommt, dass er"}, {"id": 192, "start": 2166.84, "end": 2193.0, "text": "ein bisschen, ein bisschen mithalten kann, ouch, au, au, what the, ey, ey, ey, ey, ey,"}, {"id": 193, "start": 2193.0, "end": 2220.34, "text": "ey, ey, ey, ey ey, ich glaube, wenn der hardcore spielst, dann hast du dir nen heilen herzinfarkt"}, {"id": 194, "start": 2220.34, "end": 2221.34, "text": "Lass dich mal hinten, Alter!"}, {"id": 195, "start": 2221.34, "end": 2244.38, "text": "So, jetzt ist er aber dran!"}, {"id": 196, "start": 2244.38, "end": 2246.3, "text": "Jetzt geht er down gleich!"}, {"id": 197, "start": 2246.3, "end": 2256.26, "text": "Ach nee, ich muss ja das Herz killen!"}, {"id": 198, "start": 2256.26, "end": 2257.26, "text": "In your face!"}, {"id": 199, "start": 2257.26, "end": 2260.74, "text": "Let's go, zack, easy win!"}, {"id": 200, "start": 2260.74, "end": 2272.78, "text": "PoE-Bosse Oh, gleich geht er down!"}, {"id": 201, "start": 2272.78, "end": 2278.94, "text": "So, Kampagne durchgespielt!"}, {"id": 202, "start": 2278.94, "end": 2291.86, "text": "Ich hab die Dragon Godhead Microtransaction geernt!"}, {"id": 203, "start": 2291.86, "end": 2292.86, "text": "Aha!"}, {"id": 204, "start": 2292.86, "end": 2293.86, "text": "Sehr gut!"}, {"id": 205, "start": 2293.86, "end": 2297.62, "text": "Ist ja fast wie in Team Fortress mit Hüten jetzt!"}, {"id": 206, "start": 2297.62, "end": 2298.62, "text": "So!"}, {"id": 207, "start": 2298.62, "end": 2304.94, "text": "Ach nee, ich muss ja noch die post, ich muss ja noch die credits, die quasi, die credits"}, {"id": 208, "start": 2304.94, "end": 2305.94, "text": "Quest machen!"}, {"id": 209, "start": 2305.94, "end": 2311.06, "text": "Also quasi die, die Nachstory-Quest, was, warum man sich auch immer gedacht hat, ist"}, {"id": 210, "start": 2311.06, "end": 2312.54, "text": "eine gute, eine gute Idee!"}, {"id": 211, "start": 2312.54, "end": 2316.66, "text": "Du hast gerade per Mal minus 60 Resis bekommen, ja!"}, {"id": 212, "start": 2316.66, "end": 2319.66, "text": "Hab ich!"}, {"id": 213, "start": 2319.66, "end": 2320.9, "text": "Also minus 30!"}, {"id": 214, "start": 2320.9, "end": 2326.18, "text": "Weil ich, weil, minus 30 hat man schon mal bekommen beim ersten Boss, und nochmal minus"}, {"id": 215, "start": 2326.18, "end": 2327.18, "text": "30!"}, {"id": 216, "start": 2327.18, "end": 2337.38, "text": "Okay, äh, dann machen wir jetzt noch mal kurz die post, post-credit-Quest oder wie man das"}, {"id": 217, "start": 2337.38, "end": 2340.38, "text": "nennen mag!"}, {"id": 218, "start": 2340.38, "end": 2341.38, "text": "Skillpoint!"}, {"id": 219, "start": 2341.38, "end": 2342.38, "text": "Exzellent!"}, {"id": 220, "start": 2342.38, "end": 2351.1, "text": "Das geht aber schnell, da muss man glaube ich, warte mal, unten musste man da glaube"}, {"id": 221, "start": 2351.1, "end": 2352.1, "text": "ich hin!"}, {"id": 222, "start": 2352.1, "end": 2353.1, "text": "Epilog-Quest, genau!"}, {"id": 223, "start": 2353.1, "end": 2354.1, "text": "Ja, das wars!"}, {"id": 224, "start": 2354.1, "end": 2362.34, "text": "Weiß aber gar nicht mehr, wo es lang geht, schon wieder vier Monate her!"}, {"id": 225, "start": 2362.34, "end": 2363.34, "text": "Ja!"}, {"id": 226, "start": 2363.34, "end": 2377.18, "text": "So, das ist das Ding, wo man seine Endgame-Sachen später spielt!"}, {"id": 227, "start": 2377.18, "end": 2385.18, "text": "Da kann man, dann droppt man sowas hier rein, und dann geht quasi ein Portal auf zu einer"}, {"id": 228, "start": 2385.18, "end": 2391.38, "text": "Map, die cleart man, und je nachdem, wie stark die Monster auf der Maps sind, umso besseres"}, {"id": 229, "start": 2391.38, "end": 2392.38, "text": "Loot gibt's!"}, {"id": 230, "start": 2392.38, "end": 2401.1, "text": "So, mal die ganz, ganz primitive Endgame-Variante, Erklärung von mir zum Passivexer Endgame!"}, {"id": 231, "start": 2401.1, "end": 2402.1, "text": "Sealed Storage Room!"}, {"id": 232, "start": 2402.1, "end": 2403.1, "text": "Ahja!"}, {"id": 233, "start": 2403.1, "end": 2407.86, "text": "Aber das hat noch viele Feinheiten!"}, {"id": 234, "start": 2407.86, "end": 2416.98, "text": "Ach, jetzt muss ich unten irgendwo hinlaufen, also wer sich echt gedacht hat, bei den Entwicklern,"}, {"id": 235, "start": 2416.98, "end": 2422.86, "text": "es ist eine gute Idee, diese Post-Credit-Epilog-Quest einzubauen, weiß ich auch nicht, langweiliger"}, {"id": 236, "start": 2422.86, "end": 2423.86, "text": "könnte es kaum sein!"}, {"id": 237, "start": 2423.86, "end": 2427.9, "text": "Passiert ja nix mal, da läuft einfach nur sinnlos rum!"}, {"id": 238, "start": 2427.9, "end": 2433.34, "text": "Und muss Level 1-Mops-Killen zwischendurch!"}, {"id": 239, "start": 2433.34, "end": 2439.38, "text": "Ich glaub, unten rechts war das!"}, {"id": 240, "start": 2439.38, "end": 2443.42, "text": "Alter, der In-Game-Chat wieder, was erzählen sie denn?"}, {"id": 241, "start": 2443.42, "end": 2447.34, "text": "Gibt es hier jemand, der lieb..."}, {"id": 242, "start": 2447.34, "end": 2448.34, "text": "Ach du Scheiße!"}, {"id": 243, "start": 2448.34, "end": 2449.34, "text": "Der Chat!"}, {"id": 244, "start": 2449.34, "end": 2450.34, "text": "Der In-Game-Chat!"}, {"id": 245, "start": 2450.34, "end": 2451.34, "text": "Der..."}, {"id": 246, "start": 2451.34, "end": 2452.34, "text": "Äh..."}, {"id": 247, "start": 2452.34, "end": 2457.34, "text": "Moment, wo ging's hier noch mal lang?"}, {"id": 248, "start": 2457.34, "end": 2464.34, "text": "Nee, oben rechts war das, oben rechts, genau!"}, {"id": 249, "start": 2464.34, "end": 2472.98, "text": "Haha, mir wird schlecht!"}, {"id": 250, "start": 2472.98, "end": 2487.42, "text": "Haben wir's heut noch!"}, {"id": 251, "start": 2487.42, "end": 2504.34, "text": "Ja, man muss doch ein paar Level-1-Mops-Killen!"}, {"id": 252, "start": 2504.34, "end": 2505.34, "text": "Unglaublich sinnlos!"}, {"id": 253, "start": 2505.34, "end": 2518.06, "text": "Epilog-Quest!"}, {"id": 254, "start": 2518.06, "end": 2521.62, "text": "Äh, Moment, wo muss man jetzt hin?"}, {"id": 255, "start": 2521.62, "end": 2524.7, "text": "Na, ich vergesse, wo man hin muss!"}, {"id": 256, "start": 2524.7, "end": 2527.7, "text": "Hier irgendwo?"}, {"id": 257, "start": 2527.7, "end": 2531.02, "text": "Nee, wieder zurück!"}, {"id": 258, "start": 2531.02, "end": 2537.06, "text": "Start-Porten und runter!"}, {"id": 259, "start": 2537.06, "end": 2538.06, "text": "Stimmt!"}, {"id": 260, "start": 2538.06, "end": 2542.18, "text": "Da hab ich's verwechselt mit runterlaufen, diesen Schritt, mit dem der jetzt kommt!"}, {"id": 261, "start": 2542.18, "end": 2551.18, "text": "By the way, der allerletzte Boss, den's dann später gibt in dem Game, das ist ein Bosskampf"}, {"id": 262, "start": 2551.18, "end": 2558.78, "text": "hier auf diesem Marktplatz und ich kam mir fast schon ein bisschen wie gecheatet vor,"}, {"id": 263, "start": 2558.78, "end": 2562.62, "text": "als ich den mit meinem Zombie-Nekro gemacht hab, weil normalerweise musst du ja die richtig"}, {"id": 264, "start": 2562.62, "end": 2566.58, "text": "krassen Mechanics machen und als Zombie-Nekro musst du mehr oder weniger einfach nur im"}, {"id": 265, "start": 2566.58, "end": 2567.58, "text": "Kreis laufen."}, {"id": 266, "start": 2567.58, "end": 2578.46, "text": "Äh, Moment, bin ich jetzt richtig gelaufen?"}, {"id": 267, "start": 2578.46, "end": 2591.58, "text": "Ja."}, {"id": 268, "start": 2591.58, "end": 2592.58, "text": "Vault-Key!"}, {"id": 269, "start": 2592.58, "end": 2611.82, "text": "Und das muss auf 10, 20 Minuten dauern, bis es aufgeht, ne?"}, {"id": 270, "start": 2611.82, "end": 2635.22, "text": "Die haben sich hier richtig Mühe gegeben, so mit neuen Sachen im Hintergrund, aber dabei"}, {"id": 271, "start": 2635.22, "end": 2642.42, "text": "ist man überhaupt nie auf diesem Gebiet hier unterwegs."}, {"id": 272, "start": 2642.42, "end": 2646.66, "text": "Äh, ist das bugged?"}, {"id": 273, "start": 2646.66, "end": 2652.18, "text": "Ist das bugged?"}, {"id": 274, "start": 2652.18, "end": 2659.18, "text": "Ah, nee."}, {"id": 275, "start": 2659.18, "end": 2665.46, "text": "Ach, so ging das, okay."}, {"id": 276, "start": 2665.46, "end": 2671.3, "text": "Ich hab gedacht, dass es bugged, weil der hinter dem Tor gespawnt ist."}, {"id": 277, "start": 2671.3, "end": 2674.3, "text": "Yes."}, {"id": 278, "start": 2674.3, "end": 2677.3, "text": "So."}, {"id": 279, "start": 2677.3, "end": 2691.78, "text": "Jetzt haben wir's endlich geschafft."}, {"id": 280, "start": 2691.78, "end": 2698.7, "text": "Max rushed da einfach durch, klar, ist ja auch übelst langweilig sonst."}, {"id": 281, "start": 2698.7, "end": 2699.7, "text": "So, hideout."}, {"id": 282, "start": 2699.7, "end": 2700.7, "text": "Hideout."}, {"id": 283, "start": 2700.7, "end": 2708.86, "text": "Gillette-Abdi rasiert, genau."}, {"id": 284, "start": 2708.86, "end": 2709.86, "text": "Lebt er noch?"}, {"id": 285, "start": 2709.86, "end": 2710.86, "text": "Gibt's den eigentlich noch?"}, {"id": 286, "start": 2710.86, "end": 2711.86, "text": "Gillette-Abdi?"}, {"id": 287, "start": 2711.86, "end": 2712.86, "text": "Desert-Map."}, {"id": 288, "start": 2712.86, "end": 2713.86, "text": "Tropical-Island-Map."}, {"id": 289, "start": 2713.86, "end": 2714.86, "text": "Excellent."}, {"id": 290, "start": 2714.86, "end": 2715.86, "text": "So."}, {"id": 291, "start": 2715.86, "end": 2720.86, "text": "Komm, wir machen mal eine Map noch."}, {"id": 292, "start": 2720.86, "end": 2731.18, "text": "Activate, yes."}, {"id": 293, "start": 2731.18, "end": 2739.78, "text": "Und dann muss wir noch das Labyrinth machen."}, {"id": 294, "start": 2739.78, "end": 2748.5, "text": "Ja, also, so funktioniert im Prinzip das Path of Exile Endgame, man findet Maps, Maps"}, {"id": 295, "start": 2748.5, "end": 2753.02, "text": "sind im Endeffekt die alten Gebiete recycelt mit unterschiedlich starken Monstern, es"}, {"id": 296, "start": 2753.02, "end": 2758.46, "text": "gibt da ein paar Feinheiten, ja, es gibt spezielle Maps, es gibt noch ein paar Unique-Maps mit"}, {"id": 297, "start": 2758.46, "end": 2762.66, "text": "speziellen Sachen drinne, es gibt so ein Tempel, den man anlocken muss, also es gibt"}, {"id": 298, "start": 2762.66, "end": 2770.14, "text": "schon noch ein paar Feinheiten und je nach Stärke der Map droppen dort quasi bessere"}, {"id": 299, "start": 2770.14, "end": 2774.62, "text": "Maps, die noch stärkere Mops haben und umso stärker die Mops sind, umso besser das Loot."}, {"id": 300, "start": 2774.62, "end": 2779.34, "text": "Und um die ganzen Sachen nicht zu einfach zu machen, gibt es noch so eine Übersichtskarte,"}, {"id": 301, "start": 2779.34, "end": 2788.06, "text": "wo man dann auch die Maps quasi sammeln muss, also sprich, von jedem Typ einmal gemacht"}, {"id": 302, "start": 2788.06, "end": 2793.82, "text": "und da gibt es noch verschiedene Upgrade-Geschichten, also es ist ein bisschen komplizierter, also"}, {"id": 303, "start": 2793.82, "end": 2797.66, "text": "gibt es einiges zu machen noch im Endgame."}, {"id": 304, "start": 2797.66, "end": 2800.18, "text": "Was ist der Shortcut für Atlas noch mal gewesen?"}, {"id": 305, "start": 2800.18, "end": 2807.62, "text": "Wenn man sich entscheidet jetzt POR anzufangen, ist man verloren, warum?"}, {"id": 306, "start": 2807.62, "end": 2812.14, "text": "Ich hab doch, ich hab, ich hab, das ist die erste, oh, oh, oh, Monka, Monka, es, das"}, {"id": 307, "start": 2812.14, "end": 2816.74, "text": "ist Chaos-Damage, ich hab keine Chaos-Resies, Alter, die erste League, die ich gespielt"}, {"id": 308, "start": 2816.74, "end": 2822.58, "text": "hab seit 2013, war, denk's hier, Metamorph und die letzte League hab ich nicht gespielt,"}, {"id": 309, "start": 2822.58, "end": 2827.06, "text": "das funktioniert schon, man muss einfach sich ein OP-Bild raussuchen und dann ist gut."}, {"id": 310, "start": 2827.06, "end": 2831.1, "text": "Ups, was hab ich jetzt gemacht?"}, {"id": 311, "start": 2831.1, "end": 2836.9, "text": "Ich will das eigentlich jetzt gar nicht Harvesten, ich will die Map fertig machen."}, {"id": 312, "start": 2836.9, "end": 2847.02, "text": "Ja, also man muss auf jeden Fall ein bisschen Zeit einplanen, wenn man einfach nur mal ein"}, {"id": 313, "start": 2847.02, "end": 2851.34, "text": "bisschen Hack'n'Slay spielen will, kann man das auch so machen, aber Paths of Exile macht"}, {"id": 314, "start": 2851.34, "end": 2868.62, "text": "erst so richtig Bock, wenn man halt auch ein Build hat, was gut rein haut, ja."}, {"id": 315, "start": 2868.62, "end": 2892.06, "text": "Jetzt nochmal, das Crafting, es gibt ja 1000 Endgame-Mechaniken, du hast diesen Delve-Dungeon,"}, {"id": 316, "start": 2892.06, "end": 2897.54, "text": "du hast dieses Board mit den Karten drauf, also da wo man die Typen dann quasi richtig"}, {"id": 317, "start": 2897.54, "end": 2908.38, "text": "linken muss, es gibt so viel, wow, MonkaS, ja, wenn man keine Chaos-Resies hat, dann"}, {"id": 318, "start": 2908.38, "end": 2912.1, "text": "ist es keine gute Idee, wenn man in die Mobs einfach reinrusht, by the way, man hat nur"}, {"id": 319, "start": 2912.1, "end": 2917.5, "text": "eine endliche Anzahl an Versuchen für so eine Map und die höhere Maps können auch ein"}, {"id": 320, "start": 2917.5, "end": 2925.54, "text": "bisschen teuer sein, wenn man sie sich kauft, also man hat glaube ich nur 6 Versuche oder"}, {"id": 321, "start": 2925.54, "end": 2933.22, "text": "so oder 9, 9 Versuche, irgendwie so, bis alle Portale weg sind, die Stacheln machen Physical"}, {"id": 322, "start": 2933.22, "end": 2938.42, "text": "Damage, ok, dann ist kein Wunder, dass ich so einen Damage kriege, ich hab ja kaum Armor,"}, {"id": 323, "start": 2938.42, "end": 2945.38, "text": "also nee wirklich viel, aber die hauen übelst rein, die Stacheln, Monka, Monka Stachelors,"}, {"id": 324, "start": 2945.38, "end": 2963.34, "text": "ah, ich immer meine Spells vergesse, deswegen spiele ich auch kein Hardcore, das frustriert"}, {"id": 325, "start": 2963.34, "end": 2967.26, "text": "mich einfach nur, wenn man an so sinnlosen Zeug stirbt und dann wieder ganz von vorne"}, {"id": 326, "start": 2967.26, "end": 2973.9, "text": "anfangen muss, es gibt ja Leute, die spielen Hardcore, Self-Found, das sind dann die richtigen"}, {"id": 327, "start": 2973.9, "end": 2978.74, "text": "Pros, die quasi sich den ganzen Kram selbst craften können und auch wissen, wie das gut"}, {"id": 328, "start": 2978.74, "end": 2993.42, "text": "funktioniert, ok, Alter, what the fuck, der Scheiß macht ja mega Damage, Alter, ich mach"}, {"id": 329, "start": 2993.42, "end": 3002.34, "text": "jetzt das nächste in Town Portal auf und deswegen sieht man mal wieder, Quicksilver Flasks sind"}, {"id": 330, "start": 3002.34, "end": 3007.74, "text": "das wichtigste, was man haben kann, sonst brauchst du ja 2 Stunden, bis du da wieder"}, {"id": 331, "start": 3007.74, "end": 3023.7, "text": "hingelaufen bist, so, ich mach jetzt den Town Portal auf, ja, ich hasse diese Gegner, die"}, {"id": 332, "start": 3023.7, "end": 3035.22, "text": "ging mir auch in der Kampagne schon auf den Keks, die gibt es ja zum Glück nicht so oft,"}, {"id": 333, "start": 3035.22, "end": 3063.7, "text": "aber jetzt sind sie tot, ok, wahrscheinlich nur Crap, so, Map, fertig, was war denn jetzt"}, {"id": 334, "start": 3063.7, "end": 3077.54, "text": "noch mal der Shortcut für Atlas, wenn ich das jetzt noch mal rausfinden würde, G, ah,"}, {"id": 335, "start": 3077.54, "end": 3081.02, "text": "ich hab den Atlas noch nicht, wahrscheinlich krieg ich den jetzt erst, ah, jetzt krieg"}, {"id": 336, "start": 3081.02, "end": 3089.74, "text": "ich ihn, ok, alles klar, genau, das ist im Prinzip so der Endgame-Rahmen von Passive"}, {"id": 337, "start": 3089.74, "end": 3095.26, "text": "Quicksilver, also sprich, jede dieser Maps, die man in diesen Teleporter einsetzen kann,"}, {"id": 338, "start": 3095.26, "end": 3099.46, "text": "sind zu einem Punkt auf dieser Atlas-Map und ihr seht schon, wenn das, das ist die Map,"}, {"id": 339, "start": 3099.46, "end": 3104.06, "text": "die wir gerade gemacht haben, ihr könnt euch vorstellen, dass quasi jede dieser Abschnitte"}, {"id": 340, "start": 3104.06, "end": 3110.3, "text": "irgendwie, keine Ahnung, 30 Maps hat, also sprich, es gibt saumäßig viel, was man machen"}, {"id": 341, "start": 3110.3, "end": 3114.82, "text": "kann, im Prinzip ist es natürlich immer das gleiche, man rennt rum und killt Monster,"}, {"id": 342, "start": 3114.82, "end": 3125.02, "text": "ist halt ein Hack and Slay, 154 Maps, ok, und dazu kommt wahrscheinlich noch diese Special-Sachen,"}, {"id": 343, "start": 3125.02, "end": 3135.46, "text": "es gibt ja diesen Tempel, da gibt es noch den Abschluss-Boss-Fight, steht da, ach ja,"}, {"id": 344, "start": 3135.46, "end": 3141.9, "text": "hier, 1 von 154, ja, ich geh davon aus, dass nicht alle dazuzählen, wie gesagt, die Boss-Fights"}, {"id": 345, "start": 3141.9, "end": 3147.38, "text": "werden nicht dazuzählen, der Tempel wird auch nicht dazuzählen, es gibt wohl ein paar Sachen,"}, {"id": 346, "start": 3147.38, "end": 3151.7, "text": "die nicht reinzählen, denke ich mal, weiß ich nicht, aber es gibt ordentliche Sachen"}, {"id": 347, "start": 3151.7, "end": 3157.18, "text": "so und dass das Ganze nicht so einfach wird, gibt es diese Maps, ich glaub, 14 oder 15"}, {"id": 348, "start": 3157.18, "end": 3162.82, "text": "verschiedene Tears, das fängt an von Tier 1 bis, glaub, 5, die sind weiß, dann irgendwie"}, {"id": 349, "start": 3162.82, "end": 3170.24, "text": "5 bis 10, die sind gelb und dann irgendwie 10 bis 15 oder sowas, die sind rot, also umso"}, {"id": 350, "start": 3170.24, "end": 3174.5, "text": "schwerer wird das Ganze und die Maps gibt es dann natürlich auch noch in unterschiedlichen"}, {"id": 351, "start": 3174.5, "end": 3181.18, "text": "Seltenheitsstufen, also sprich, ist das quasi eine normale Map, eine Magic-Map, eine Rare-Map"}, {"id": 352, "start": 3181.18, "end": 3189.98, "text": "und die können wirklich ziemlich eklig werden, zum Beispiel gibt es Maps, die haben als Bonus,"}, {"id": 353, "start": 3189.98, "end": 3195.1, "text": "dass die Gegner Damage Reflecten und sowas, dann wird es richtig, richtig abartig, also"}, {"id": 354, "start": 3195.1, "end": 3199.86, "text": "sprich, umso höher und umso schwieriger und umso seltener die Maps sind, umso besseres"}, {"id": 355, "start": 3199.86, "end": 3205.78, "text": "Loot gibt es, allerdings werden die teilweise unschaffbar schwer für manche Builds, also"}, {"id": 356, "start": 3205.78, "end": 3211.78, "text": "ich habe zum Beispiel komplett gelitten, wenn ich eine Map bekomme, die Magic-Reflect-Gegner"}, {"id": 357, "start": 3211.78, "end": 3216.7, "text": "hat, kann ich nichts dagegen machen, wenn die Magieschaden reflektieren, die Gegner"}, {"id": 358, "start": 3216.7, "end": 3222.32, "text": "ist RIP, das kann ich nicht spielen, aber man kann das Ganze ja auch blocken in diesem"}, {"id": 359, "start": 3222.32, "end": 3231.18, "text": "Map Device, gibt es dann, gibt es noch verschiedene, oder konnte man das nicht hier blocken?"}, {"id": 360, "start": 3231.18, "end": 3237.58, "text": "Zumindest hier, wo man die Maps rein macht, kann man noch verschiedene Bonussachen einschalten,"}, {"id": 361, "start": 3237.58, "end": 3241.9, "text": "dass die Maps dann quasi noch mal schwieriger werden und noch Chancen, mehr Chancen auf"}, {"id": 362, "start": 3241.9, "end": 3250.34, "text": "irgendwas haben und um es noch etwas komplizierter zu machen, gibt es dann am Ende noch verschiedene"}, {"id": 363, "start": 3250.34, "end": 3254.9, "text": "Türme hier auf dem Atlas, wo man verschiedene Steine einsetzen kann, die dann wiederum alle"}, {"id": 364, "start": 3254.9, "end": 3263.46, "text": "Maps in diesem Gebiet noch mal verzaubern, also ist ein bisschen komplex das Ganze, aber"}, {"id": 365, "start": 3263.46, "end": 3268.32, "text": "sorgt dafür, dass es eben saumäßig viel Endgame zu tun gibt, das heißt es wird einem"}, {"id": 366, "start": 3268.32, "end": 3277.02, "text": "nicht langweilig, also wenn eine neue Passive Ox, Passive Ox, wenn eine neue Passive Ox"}, {"id": 367, "start": 3277.02, "end": 3284.26, "text": "startet, dann kannst du durchaus mal 1-2 Monate spielen, vielleicht nicht unbedingt immer"}, {"id": 368, "start": 3284.26, "end": 3290.66, "text": "mit einem Charakter, bis es dir anfängt langweilig zu werden und das Schöne ist,"}, {"id": 369, "start": 3290.66, "end": 3294.98, "text": "dass die Leaks halt auch schon abwechslungsreich sind, diesmal mit dem Gecrafte, das letzte"}, {"id": 370, "start": 3294.98, "end": 3299.54, "text": "Mal diese Sache mit diesem Delirium Portale, habe ich aber nicht viel gespielt, davor"}, {"id": 371, "start": 3299.54, "end": 3304.9, "text": "mit der Metamorph Geschichte, wo man quasi Einzelheiten, also Innereien von Bossen sammeln"}, {"id": 372, "start": 3304.9, "end": 3309.42, "text": "musste und sich die Bosse selbst zusammenbauen konnte, dass es Skill Tree Erweiterungen gibt"}, {"id": 373, "start": 3309.42, "end": 3314.82, "text": "und alles, also das ist wirklich ein ziemlich gutes Game, was man immer wieder spielen"}, {"id": 374, "start": 3314.82, "end": 3318.98, "text": "kann, es ist vielleicht kein Game, was man jetzt 3 Jahre am Stück durchspielt, aber es"}, {"id": 375, "start": 3318.98, "end": 3325.06, "text": "ist ein Game, was man 3 Jahre am Stück mit Unterbrechungen spielt, es ist komplett Free"}, {"id": 376, "start": 3325.06, "end": 3333.82, "text": "to Play und es hat auch keinerlei Pay to Win Elemente, das einzige was es gibt, was"}, {"id": 377, "start": 3333.82, "end": 3341.62, "text": "ein bisschen Pay to Win ist, ist das es Stash Tabs gibt, wo man mehr Sachen in seine Truhe"}, {"id": 378, "start": 3341.62, "end": 3345.38, "text": "legen kann, das ist aber auch das einzige und ich glaube die meisten Leute, die das"}, {"id": 379, "start": 3345.38, "end": 3351.14, "text": "Spiel so weit gespielt haben, dass sie das brauchen, die supporten das wahrscheinlich"}, {"id": 380, "start": 3351.14, "end": 3355.58, "text": "sogar gerne, also mit dem ersten Charakter kann man denke ich, wenn man ein bisschen"}, {"id": 381, "start": 3355.58, "end": 3361.02, "text": "sparsam ist, die Kampagne durchspielen, bis das Dash voll ist."}, {"id": 382, "start": 3361.02, "end": 3370.82, "text": "Danach wird es halt eng, aber die, die dann weiterspielen wollen, kaufen sich wahrscheinlich"}, {"id": 383, "start": 3370.82, "end": 3379.18, "text": "auch schon extra Stash Tabs, der Rest ist rein kosmetisches Gedöns, also sprich, dass"}, {"id": 384, "start": 3379.18, "end": 3385.22, "text": "meine Fußschritte so weiß sind, das ist auch hier Microtransaction Kosmetics."}, {"id": 385, "start": 3385.22, "end": 3397.22, "text": "Ja, genau Sebaro, das war noch Metamorph, wo ich das gespielt habe, ne, also die Maps,"}, {"id": 386, "start": 3397.22, "end": 3401.94, "text": "wenn ich jetzt zum Beispiel so eine Desert Map mache, machen wir was hier, Modifier rein,"}, {"id": 387, "start": 3401.94, "end": 3407.94, "text": "dann ist das jetzt halt eine Wüste, das haben die richtig gut gemacht, Maps ist im Prinzip"}, {"id": 388, "start": 3407.94, "end": 3416.74, "text": "auch bloß recycelt, aber halt richtig gut gemacht, generell sind die Typen Meister im"}, {"id": 389, "start": 3416.74, "end": 3424.98, "text": "Content Recycle, die haben die Recycle im Endgame so ziemlich alles, die Recycle in der Kampagne,"}, {"id": 390, "start": 3424.98, "end": 3431.08, "text": "die Bosse dreimal, aber dadurch, dass das Game viel random generated Zeugs hat, ist es"}, {"id": 391, "start": 3431.08, "end": 3439.82, "text": "gar nicht so auffällig und nervig, aber die Recycle halten dem GameShot ziemlich viel"}, {"id": 392, "start": 3439.82, "end": 3447.98, "text": "oder haben viel recycelt und ich finde, man merkt, man merkt, dass den ersten vier Akten"}, {"id": 393, "start": 3447.98, "end": 3453.1, "text": "auch an, dass die mit ein bisschen, oder den ersten fünf vielleicht, Akten auch an, dass"}, {"id": 394, "start": 3453.1, "end": 3460.9, "text": "die mit ein bisschen mehr Aufwand, Geld und Zeit entstanden, what the fuck ist das, entstanden"}, {"id": 395, "start": 3460.9, "end": 3466.42, "text": "sind, als die Akte danach, weil die Akte danach sind ja fast nur Recycle, vor unbedingt ein"}, {"id": 396, "start": 3466.42, "end": 3490.78, "text": "bisschen Chaos und Resists, übrigens das ist überhaupt nicht mein Endgame Speck, ich muss"}, {"id": 397, "start": 3490.78, "end": 3499.74, "text": "komplett umskillen dann, also nicht den Skilltree, sondern an Gems, das ist eigentlich nur meine"}, {"id": 398, "start": 3499.74, "end": 3505.02, "text": "Level Specks, aber Tier One Maps ist halt kein Unterschied zur Kampagne im Endeffekt."}, {"id": 399, "start": 3505.02, "end": 3516.54, "text": "PoE 2 hat eine neue Kampagne, ja das stimmt, aber ich habe echt keine Hoffnung für PoE"}, {"id": 400, "start": 3516.54, "end": 3523.26, "text": "2, die Story ist dermaßen konfus und wir und ehrlich gesagt auch ziemlich schlecht,"}, {"id": 401, "start": 3523.26, "end": 3528.1, "text": "dass ich da nicht viel Hoffnung habe, dass jetzt PoE 2 sich durch eine wahnsinnig tolle"}, {"id": 402, "start": 3528.1, "end": 3533.34, "text": "Story auszeichnen wird, das kann ich mir bei PoE einfach nicht vorstellen."}, {"id": 403, "start": 3533.34, "end": 3552.74, "text": "Das Spiel soll mobile kommen, ach stimmt, ja, ich dachte das haben die bloß gesagt,"}, {"id": 404, "start": 3552.74, "end": 3558.1, "text": "weil sie sich lustig machen wollten über Diablo Mobile, ne aber stimmt, du hast Recht,"}, {"id": 405, "start": 3558.1, "end": 3571.54, "text": "es soll für mobile kommen, sag mal was zum Traden, ja was soll ich zum Traden sagen,"}, {"id": 406, "start": 3571.54, "end": 3578.34, "text": "dass es halt kein Auktionshaus ist, sondern manuell kann man zum Traden sagen, allerdings"}, {"id": 407, "start": 3578.34, "end": 3585.58, "text": "läuft das Traden schon ein bisschen wie auktionshaus mäßig ab, also du suchst über die offizielle"}, {"id": 408, "start": 3585.58, "end": 3592.62, "text": "Seite, können wir übrigens gleich mal machen, du suchst über die offizielle Seite die Items,"}, {"id": 409, "start": 3592.62, "end": 3597.74, "text": "die du haben willst mit den Sockels und mit den Stats und dann schreibst du halt den Typ"}, {"id": 410, "start": 3597.74, "end": 3603.52, "text": "in-game an, das kannst du übrigens direkt über die Seite machen, Copy Paste Text, sag"}, {"id": 411, "start": 3603.52, "end": 3608.14, "text": "dem auch gleich wo in seinem Inventar das Item liegt und dann ist gut."}, {"id": 412, "start": 3608.14, "end": 3616.98, "text": "Hab ich irgendwas vergessen hier, ach da unten, ich mag so Maps nicht die nicht im Kreis gehen"}, {"id": 413, "start": 3616.98, "end": 3623.3, "text": "sondern so fake im Kreis, alle Müll, jetzt muss ich wieder einmal komplett unten runter"}, {"id": 414, "start": 3623.3, "end": 3624.3, "text": "rennen."}, {"id": 415, "start": 3624.3, "end": 3636.02, "text": "Ja, also man wisst bei dem Typ dann an und sagt hier ich hätte gern dein Eat Item XY,"}, {"id": 416, "start": 3636.02, "end": 3641.06, "text": "der joint mal bei ihm ins Game rein, geht in sein, nee Quatsch, der joint bei dir ins"}, {"id": 417, "start": 3641.06, "end": 3650.86, "text": "Game rein, geht zu dir ins Hideout, gibt dir das Item, du gibst ihm das Geld und du kontrollierst"}, {"id": 418, "start": 3650.86, "end": 3656.58, "text": "auf jeden Fall 5 mal, dass er dir das richtige Item gibt, weil es ziemlich viele Traits,"}, {"id": 419, "start": 3656.58, "end": 3661.34, "text": "Gammar gibt in dem Spiel, was dem Hersteller aber anscheinend vollkommen egal ist, man"}, {"id": 420, "start": 3661.34, "end": 3667.62, "text": "könnte ja dann was dagegen machen aber nee, also erstmal das Item 5 mal checken, da gibt"}, {"id": 421, "start": 3667.62, "end": 3674.38, "text": "sogar Tools die einem helfen, wie heißt das Bild das du spielst, ich kann dir das Video"}, {"id": 422, "start": 3674.38, "end": 3699.98, "text": "dazu zeigen, das hier, ja, nee, da ist das Bild, ja und das passende Video dazu, zu dem"}, {"id": 423, "start": 3699.98, "end": 3709.94, "text": "Bild ist, das passende Video zu dem Bild ist das hier, das ist eben schon ein Update Video,"}, {"id": 424, "start": 3709.94, "end": 3715.86, "text": "das passende Bild, das Video ist das hier, da erklärt er das ein bisschen, das ist halt,"}, {"id": 425, "start": 3715.86, "end": 3719.5, "text": "das ist richtig gutes Noob Bild, allerdings wohl gemerkt die Skills die ich gerade hab"}, {"id": 426, "start": 3719.5, "end": 3725.9, "text": "sind meine Level Skills, also ich hab noch gar nicht das aus dem Bild equipped, dazu"}, {"id": 427, "start": 3725.9, "end": 3733.42, "text": "muss ich auch erstmal einkaufen gehen, bisschen ordentliche halbwegs brauchbare Items mir"}, {"id": 428, "start": 3733.42, "end": 3742.02, "text": "holen und nicht mein Crap Level Gear, achso das Labyrinth wollten wir schnell noch machen,"}, {"id": 429, "start": 3742.02, "end": 3760.34, "text": "exellent, Labyrinth können wir noch machen, ok gut, so Map fertig, dann gehen wir nochmal"}, {"id": 430, "start": 3760.34, "end": 3768.98, "text": "ins Lab, möchte man was anderes außer Necromancer beim League Start spielen, ja Necro wurde"}, {"id": 431, "start": 3768.98, "end": 3775.14, "text": "ein bisschen genervt, man nimmt hier allerdings auch Necro als Ascendancy, allerdings man spielt"}, {"id": 432, "start": 3775.14, "end": 3784.98, "text": "halt keine Minions, so, ja genau was zum Trade, also wenn man ein Item sucht, also zum Beispiel"}, {"id": 433, "start": 3784.98, "end": 3791.38, "text": "Trade POE, wenn man jetzt was verkaufen will oder was sucht, was man haben will, geht man"}, {"id": 434, "start": 3791.38, "end": 3796.9, "text": "auf die offizielle Path of Exile Seite und jetzt gucken wir mal was das Item wert ist,"}, {"id": 435, "start": 3796.9, "end": 3804.18, "text": "was ich gefunden hab beim Leveln, das brauch ich für mein Build nicht, wenn ich richtig"}, {"id": 436, "start": 3804.18, "end": 3817.54, "text": "liege und ist relativ viel wert, wir suchen da mal danach, Support, ne Moment, wie ist"}, {"id": 437, "start": 3817.54, "end": 3828.5, "text": "das Ding, Enlightened Support, ja Gems Search, da sehen wir das 28 Chaos Orbs wert, wenn"}, {"id": 438, "start": 3828.5, "end": 3833.86, "text": "nicht sogar vielleicht sogar ein Ticken, naja ne passt schon, also in dem Dreh 28 Chaos Orbs"}, {"id": 439, "start": 3833.86, "end": 3839.82, "text": "ist das ganze wert, das ist jetzt nicht super High End Dinger, aber dafür kriege ich schon"}, {"id": 440, "start": 3839.82, "end": 3845.34, "text": "mal ganz gutes Gear, mit dem ich dann Endgame starten kann, mal gucken was ich da recycle,"}, {"id": 441, "start": 3845.34, "end": 3850.1, "text": "ich muss auch mal schauen wie viele Chaos Orbs ich überhaupt schon habe, Chaos 5 Stück"}, {"id": 442, "start": 3850.1, "end": 3860.5, "text": "hier, aber sonst noch irgendwo was, 3 Stück hier, also 8 Stück, 8 Stück, da kommt noch"}, {"id": 443, "start": 3860.5, "end": 3867.58, "text": "hier, also ich kann mir erstmal für 36 Chaos Orbs Endgame, Einsteiger Endgame Gear kaufen,"}, {"id": 444, "start": 3867.58, "end": 3874.22, "text": "das ist schon mal ganz gut, da komm ich ganz gut hin, so und das schöne ist halt, wenn"}, {"id": 445, "start": 3874.22, "end": 3878.3, "text": "ich jetzt mir den Typ hier raussuche, dann kann ich direkt hier unten auf Whisper drücken,"}, {"id": 446, "start": 3878.3, "end": 3881.42, "text": "also ich will es ja nicht kaufen, ich will es ja verkaufen, dann kann ich direkt hier"}, {"id": 447, "start": 3881.42, "end": 3887.54, "text": "unten auf Whisper klicken und dann kopiert mir das Game in der Sprache des jeweiligen"}, {"id": 448, "start": 3887.54, "end": 3894.5, "text": "Account Besitzers in die Zwischenablage schon rein, was ich kaufen will, kann es in-game"}, {"id": 449, "start": 3894.5, "end": 3901.78, "text": "zu ihm reinpasten und dann scheint er bei mir und ich kann es kaufen, ja, exellent, warum"}, {"id": 450, "start": 3901.78, "end": 3910.5, "text": "kein Currency Tab, weil ich faul bin und ich die nicht in mein Currency Tab einsortiert"}, {"id": 451, "start": 3910.5, "end": 3929.18, "text": "hab, das ist alles, könnte man ja mal machen, jetzt dampfen wir den Kram mal hier schnell"}, {"id": 452, "start": 3929.18, "end": 3939.06, "text": "rein und ich mach jetzt noch schnell das Labyrinth, ich mach jetzt schnell noch mal das letzte"}, {"id": 453, "start": 3939.06, "end": 3954.42, "text": "Labyrinth, damit ich den Kram wenigstens erledigt hab, das dritte, stimmt, danach kommt noch"}, {"id": 454, "start": 3954.42, "end": 3972.9, "text": "eins, ja, danach kommt noch eins, dazu muss man aber erst in Maps noch 6 Voraussetzungs-Dungeons"}, {"id": 455, "start": 3972.9, "end": 3981.6, "text": "machen, die Voraussetzungen sind dafür, also man muss vorher noch 6 Dungeons auf Maps zufällig"}, {"id": 456, "start": 3981.6, "end": 3987.38, "text": "finden, dass man das letzte Labyrinth machen darf, übrigens der Speedrun, der schnellste"}, {"id": 457, "start": 3987.38, "end": 3991.38, "text": "Speedrun für ein Labyrinth ist glaube ich 2 Minuten 30 oder so, ich hab mir das mal"}, {"id": 458, "start": 3991.38, "end": 3996.58, "text": "angeguckt auf YouTube, der Typ hatte mega Glück, der ist reingelaufen, direkt nächstes"}, {"id": 459, "start": 3996.58, "end": 4009.58, "text": "Gebiet, reingelaufen, direkt nächstes Gebiet, genau im Global Chat, man kann Global 820"}, {"id": 460, "start": 4009.58, "end": 4014.9, "text": "joinen, da schreiben die Leute in Chat rein wo sie was gefunden haben und dann kann man"}, {"id": 461, "start": 4014.9, "end": 4033.3, "text": "ihn nachjoin und dann geht das halbwegs schnell, wo gehts hier weiter, hab ehrlich gesagt keinen"}, {"id": 462, "start": 4033.3, "end": 4041.84, "text": "Bock durch die, oh nee, hier gehts wieder raus, MonkaS, da oben gehts lang, beste Zeit"}, {"id": 463, "start": 4041.84, "end": 4047.38, "text": "für heute ist 1 Minuten 59, also das ist krass, 1 Minuten 59, das komplette Labyrinth, aber"}, {"id": 464, "start": 4047.38, "end": 4057.42, "text": "das ist halt einfach nur Glück, also das ist, da musst du einfach big luck haben, dass"}, {"id": 465, "start": 4057.42, "end": 4066.42, "text": "es funktioniert, ich weiß nicht ob man das irgendwie schießen kann, irgendwie random"}, {"id": 466, "start": 4066.42, "end": 4071.82, "text": "Zeug manipulieren kann, dass man vielleicht bessere Layouts kriegt oder so, aber wahrscheinlich"}, {"id": 467, "start": 4071.82, "end": 4076.34, "text": "nicht, in dem Game ist ja quasi der Random Generator das Herz des Games, ich glaub nicht"}, {"id": 468, "start": 4076.34, "end": 4085.54, "text": "dass ich da was manipulieren lässt, Lab Layouts sind immer, was, sind immer gleich für alle,"}, {"id": 469, "start": 4085.54, "end": 4093.42, "text": "hä, ach werden alle 24 Stunden gerne, ah ok verstehe, das heißt man muss einfach warten"}, {"id": 470, "start": 4093.42, "end": 4104.62, "text": "bis es was richtig gutes gibt und dann geht man nochmal rein und runs einfach extrem schnell"}, {"id": 471, "start": 4104.62, "end": 4110.06, "text": "durch oder wie, also sprich wenn ich jetzt nochmal danach das Labyrinth machen würde"}, {"id": 472, "start": 4110.06, "end": 4117.78, "text": "dann wüsste ich schon wo es lang geht oder wie, das ist ja easy, dann ist es ja wenn man"}, {"id": 473, "start": 4117.78, "end": 4139.66, "text": "verreckt gar nicht so schlimm, wenn man verreckt läuft man einfach den gleichen Weg nochmal,"}, {"id": 474, "start": 4139.66, "end": 4154.82, "text": "die Builds haben 600% Movement Speed, ja, würde ich auch machen wenn ich Speedrunnern würde,"}, {"id": 475, "start": 4154.82, "end": 4170.38, "text": "dann jetzt übertreiben sie es aber hier, wo gehts denn hier lang, wo gehts hier lang,"}, {"id": 476, "start": 4170.38, "end": 4183.62, "text": "aha, exzellent da sind wir richtig, dead end nix dead end, so mal gucken ob man ein bisschen"}, {"id": 477, "start": 4183.62, "end": 4191.1, "text": "was gelernt hat, der gute Izaro, aber jetzt nicht mehr so sucked wie im letzten Labyrinth"}, {"id": 478, "start": 4191.1, "end": 4214.54, "text": "ok er macht ein bisschen mehr Damage, aber es sucked immer noch, noob Izaro, so wo sind"}, {"id": 479, "start": 4214.54, "end": 4222.94, "text": "wir, ok nach oben gehts weiter und auch eine Sache die ich richtig nice an passive exzellent"}, {"id": 480, "start": 4222.94, "end": 4231.86, "text": "finde, wenns einmal langweilig ist, das ist auch ein Game was man relativ entspannt für"}, {"id": 481, "start": 4231.86, "end": 4247.94, "text": "15 Stunden am Stück grinden kann, wenns einem sehr langweilig ist, diese League kann man"}, {"id": 482, "start": 4247.94, "end": 4276.46, "text": "das Lab sogar tunen, echt, wie das denn"}, {"id": 483, "start": 4276.46, "end": 4288.06, "text": "Harvest craft auf die Offerings, ach echt das geht, das ist cool, kann man auf diese"}, {"id": 484, "start": 4288.06, "end": 4291.26, "text": "items auch irgendwie normale orbs drauf machen, ne, ne?"}, {"id": 485, "start": 4294.3, "end": 4297.06, "text": "Das finde ich aber gut, dass die an so Kleinigkeiten denken."}, {"id": 486, "start": 4306.58, "end": 4308.7, "text": "Ach guck mal, da unten, da unten geht's weiter."}, {"id": 487, "start": 4313.64, "end": 4314.74, "text": "Exzellent."}, {"id": 488, "start": 4315.62, "end": 4317.1, "text": "Wo kommen wir jetzt lang?"}, {"id": 489, "start": 4317.1, "end": 4322.38, "text": "Äh, G-Golden Door, okay, da müssen wir, da müssen wir jetzt erst mal nen Key suchen."}, {"id": 490, "start": 4325.9, "end": 4329.66, "text": "Die Leute ragen aber schon seit Jahren wegen der Lab RNG um die Enchants."}, {"id": 491, "start": 4329.66, "end": 4335.74, "text": "Kann man nicht einfach das mit, mit diesem Öl, Ölcrafting Zeugs machen?"}, {"id": 492, "start": 4335.74, "end": 4338.94, "text": "Die gleichen Sachen, wie man auch vom Lab, vom Lab kriegt?"}, {"id": 493, "start": 4338.94, "end": 4344.38, "text": "Diese Oil-Geschichte, ist das nicht genau das Gleiche?"}, {"id": 494, "start": 4344.38, "end": 4353.86, "text": "Ach, Oils gehen ja auf Amulets."}, {"id": 495, "start": 4353.86, "end": 4360.42, "text": "Ah, das heißt, wenn ich jetzt irgendwie meine Handschuhe enchaten will,"}, {"id": 496, "start": 4360.42, "end": 4361.42, "text": "dann geht das damit nicht."}, {"id": 497, "start": 4361.42, "end": 4363.26, "text": "Okay, das wusste ich nicht."}, {"id": 498, "start": 4363.26, "end": 4366.66, "text": "Dann verstehe ich das hier um Ragen."}, {"id": 499, "start": 4366.66, "end": 4373.3, "text": "Ach, guck mal, da ist er, da."}, {"id": 500, "start": 4373.3, "end": 4374.3, "text": "Das Schlüssel."}, {"id": 501, "start": 4374.3, "end": 4375.3, "text": "Switch."}, {"id": 502, "start": 4375.3, "end": 4386.26, "text": "Okay, das war easy, das war wirklich easy."}, {"id": 503, "start": 4386.26, "end": 4387.26, "text": "Assfuck."}, {"id": 504, "start": 4387.26, "end": 4396.94, "text": "Ja, aber reicht das nicht?"}, {"id": 505, "start": 4396.94, "end": 4401.18, "text": "Ach so, na gut, wenn ich sowas haben will, wie beispielsweise mehr Attack-Speed und sowas"}, {"id": 506, "start": 4401.18, "end": 4408.02, "text": "auf dem, da musst du übers Lab mehr Attack-Speed auf Kloves oder so."}, {"id": 507, "start": 4408.02, "end": 4409.98, "text": "Was mache ich eigentlich, warum gehe ich nicht durch die Tür?"}, {"id": 508, "start": 4409.98, "end": 4417.86, "text": "Ach, das läuft eigentlich ganz gut gerade."}, {"id": 509, "start": 4417.86, "end": 4437.18, "text": "Oh, gleich ist er down."}, {"id": 510, "start": 4437.18, "end": 4441.1, "text": "Ah nee, das ist ja noch das Vorletzte, ich kann hier noch gar nicht down machen."}, {"id": 511, "start": 4441.1, "end": 4444.34, "text": "Was passiert eigentlich, wenn ich hier drauf stehe und er fährt runter?"}, {"id": 512, "start": 4444.34, "end": 4448.62, "text": "Ah, ich werde rausgeportet, okay, ich dachte schon Instant-Drip."}, {"id": 513, "start": 4448.62, "end": 4454.54, "text": "Das wäre es jetzt gewesen, aber da haben sie zum Glück dran gedacht."}, {"id": 514, "start": 4454.54, "end": 4458.9, "text": "Oh nee, diese Kackmonster."}, {"id": 515, "start": 4458.9, "end": 4463.5, "text": "Das sind die Monster, die mich vorhin One-Hitted haben, das sind die Stachelviecher."}, {"id": 516, "start": 4463.5, "end": 4483.22, "text": "Please, nein, nein, nein, lass mich in Ruhe, Piss dich, Alde, da habe ich jetzt keinen"}, {"id": 517, "start": 4483.22, "end": 4484.94, "text": "Bock zu verrecken, da muss ich den Kram nochmal machen."}, {"id": 518, "start": 4484.94, "end": 4498.46, "text": "Oh, das war ein gutes Bein."}, {"id": 519, "start": 4498.46, "end": 4508.42, "text": "Excellent, ich nehme lieber das andere auf noch eine Map mit Tür, habe ich keinen Bock."}, {"id": 520, "start": 4508.42, "end": 4534.26, "text": "Es sei denn, es ist auch schwierig jetzt hier durchzukommen, mal gucken, please, wo ist"}, {"id": 521, "start": 4534.26, "end": 4535.26, "text": "der Ausgang?"}, {"id": 522, "start": 4535.26, "end": 4540.9, "text": "Lass mich einfach raus, muss jetzt hier irgendwann kommen."}, {"id": 523, "start": 4540.9, "end": 4553.5, "text": "Nein, Dead End, RIP, she baited, ich hätte wetten können, jetzt kommt der Ausgang, aber"}, {"id": 524, "start": 4553.5, "end": 4554.5, "text": "nein, gibt's nicht."}, {"id": 525, "start": 4554.5, "end": 4562.3, "text": "Wäre ich doch durch die andere, da hätte ich wahrscheinlich den Schlüssel schneller"}, {"id": 526, "start": 4562.3, "end": 4565.5, "text": "gefunden."}, {"id": 527, "start": 4565.5, "end": 4574.18, "text": "Ah, hier geht's lang, hat's einen, will mich das Game she baiten."}, {"id": 528, "start": 4574.18, "end": 4597.86, "text": "Oh, wow, wow, wow, ist ja gut, wow, Game, MonkaS, jetzt sind sie aber, jetzt haben sie"}, {"id": 529, "start": 4597.86, "end": 4598.86, "text": "auf mich abgesehen."}, {"id": 530, "start": 4598.86, "end": 4614.82, "text": "Okay, nice, next, wo sind wir, auch hier ist, hat sich ja voll gelohnt, ist auch eine Tür,"}, {"id": 531, "start": 4614.82, "end": 4615.82, "text": "haben die immer zwei Türen?"}, {"id": 532, "start": 4615.82, "end": 4632.46, "text": "Okay, einfach, einfach weiter durchrushen."}, {"id": 533, "start": 4632.46, "end": 4640.78, "text": "Ich muss da gleich mal gucken, was ich noch, was ich noch skillen muss."}, {"id": 534, "start": 4640.78, "end": 4650.58, "text": "Drei Skill Points am Start, ich glaube, es hat schon jemand mal die Map gepost, ah, ich"}, {"id": 535, "start": 4650.58, "end": 4656.3, "text": "seh's, ach was, das pack ich jetzt auch schnell durch, aber das ist ja cool, dass die Leute"}, {"id": 536, "start": 4656.3, "end": 4664.9, "text": "das sharen, so, sind wir schon durch, da sind wir durch, so und wenn mich jetzt der Boss"}, {"id": 537, "start": 4664.9, "end": 4694.06, "text": "nicht trollt, ist es auch easy, easy clap, wow, wow, Pepehands, no, oh, oh, oh, oh, oh,"}, {"id": 538, "start": 4694.06, "end": 4708.54, "text": "oh, ich hätte nicht sagen sollen, das ist easy clap, alter, nee, nochmal hab ich kein"}, {"id": 539, "start": 4708.54, "end": 4716.16, "text": "Bock, jetzt, POE Lap, okay, zeig mal."}, {"id": 540, "start": 4716.16, "end": 4732.96, "text": "Ja gut, ohne die Maps bringt mir das jetzt ja nix."}, {"id": 541, "start": 4732.96, "end": 4740.92, "text": "Ich sehe ja nicht wo die Ausgänge auf der Map sind, ne?"}, {"id": 542, "start": 4740.92, "end": 4748.68, "text": "Oder check ichs nur nicht?"}, {"id": 543, "start": 4748.68, "end": 4749.92, "text": "Die Punkte über den Kreisen?"}, {"id": 544, "start": 4749.92, "end": 4755.96, "text": "Ah, ok dann probier ichs doch nochmal aus."}, {"id": 545, "start": 4755.96, "end": 4758.08, "text": "Das muss ich mir dann doch nochmal angucken."}, {"id": 546, "start": 4758.08, "end": 4762.92, "text": "Das muss ich mir dann doch nochmal angucken, ok."}, {"id": 547, "start": 4762.92, "end": 4777.52, "text": "Mein Gier ist halt übelst crap."}, {"id": 548, "start": 4777.52, "end": 4782.44, "text": "So, also das heißt das erste ist oben rechts."}, {"id": 549, "start": 4782.44, "end": 4786.76, "text": "Kann ich mich schon immer dran erinnern."}, {"id": 550, "start": 4786.76, "end": 4800.96, "text": "Also da heißt im Endeffekt, so dass ich jetzt auch richtig laufe, hier."}, {"id": 551, "start": 4800.96, "end": 4808.92, "text": "Äh, ne?"}, {"id": 552, "start": 4808.92, "end": 4827.24, "text": "Oben rechts halten, wenn es weiter nicht weiter geht dann links."}, {"id": 553, "start": 4827.24, "end": 4855.04, "text": "Ok, aha, ok, so und das heißt, jetzt, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 554, "start": 4855.04, "end": 4866.84, "text": "das heißt, jetzt, geh ich, was sagt mir das, jetzt geh ich oben links, oder?"}, {"id": 555, "start": 4866.84, "end": 4886.24, "text": "Oben links geh ich jetzt, ich mein das ist jetzt unten links, aber was soll ich machen,"}, {"id": 556, "start": 4886.24, "end": 4887.24, "text": "ne?"}, {"id": 557, "start": 4887.24, "end": 4912.96, "text": "Ich muss das aufmachen, ok, oder auch nicht, ok, da war das das falsche unten links, wo"}, {"id": 558, "start": 4912.96, "end": 4921.36, "text": "ich hingelaufen bin, dann ist unten, unten links ist dann eher so in die Richtung hier,"}, {"id": 559, "start": 4921.36, "end": 4922.36, "text": "ne?"}, {"id": 560, "start": 4922.36, "end": 4932.8, "text": "Da ist eigentlich eher gesagt, das ist oben rechts, ok, links, links halten."}, {"id": 561, "start": 4932.8, "end": 4962.72, "text": "Ahja, ja, ok, das sind aber, also die, ja es kommt ungefähr hin, ok."}, {"id": 562, "start": 4962.72, "end": 4974.16, "text": "Wobei, so ist es besser als komplett selbst suchen, ja, das auf jeden Fall."}, {"id": 563, "start": 4974.16, "end": 4982.32, "text": "Warum hat der Typ mich vorhin fast one shotted, da kann doch überhaupt nichts, guckt euch"}, {"id": 564, "start": 4982.32, "end": 4983.88, "text": "mal an, du bist ein Kackenoob."}, {"id": 565, "start": 4983.88, "end": 4998.36, "text": "Na gut, jetzt hat er mich auch nicht gehittert, ok, auf welcher Map bin ich jetzt?"}, {"id": 566, "start": 4998.36, "end": 5004.32, "text": "Jetzt bin ich, ich muss gucken, dass ich nicht sterbe, ne?"}, {"id": 567, "start": 5004.32, "end": 5010.76, "text": "Jetzt bin ich da, das heißt, jetzt muss ich wieder nach oben rechts, excellent."}, {"id": 568, "start": 5010.76, "end": 5039.68, "text": "Ok, also rechts, sobald rechts geht, hier geht es nicht rechts, jetzt, das ist immer"}, {"id": 569, "start": 5039.68, "end": 5043.72, "text": "ein Dude, der das täglich postet, nett schlecht, nett schlecht."}, {"id": 570, "start": 5043.72, "end": 5056.08, "text": "Der ist voll dabei, ha?"}, {"id": 571, "start": 5056.08, "end": 5068.28, "text": "Oh, also es sieht jetzt aktuell nicht so ganz nach oben rechts aus, oh, Monka, ich bin"}, {"id": 572, "start": 5068.28, "end": 5070.92, "text": "in der Falle stehen geblieben."}, {"id": 573, "start": 5070.92, "end": 5084.16, "text": "Komm mal nach Schlemen, denk das mal gut, jetzt guck ich mir danach an, ha ha ha, das"}, {"id": 574, "start": 5084.16, "end": 5092.76, "text": "sind die Kackmopse, Möpse, ich renn hier einfach durch, ich renn hier einfach durch,"}, {"id": 575, "start": 5092.76, "end": 5115.72, "text": "lasst mich in Ruhe, Alter, geht fort, aber ich weiß nicht ob man damit, ok, wahrscheinlich"}, {"id": 576, "start": 5115.72, "end": 5119.88, "text": "braucht es ein bisschen Übung, wahrscheinlich braucht es ein bisschen Übung, bis man mit"}, {"id": 577, "start": 5119.88, "end": 5124.08, "text": "diesen Maps was anfangen kann, aber ich weiß nicht ob ich jetzt so viel langsamer wäre,"}, {"id": 578, "start": 5124.08, "end": 5145.6, "text": "wenn ich selbst suche, so, und jetzt muss ich, äh, jetzt muss ich Mitte oben, oder"}, {"id": 579, "start": 5145.6, "end": 5162.64, "text": "was, nein, da waren doch eben gar keine Mops, oh, fickt euch Kackmopse, ey, ich bin glaube"}, {"id": 580, "start": 5162.64, "end": 5169.12, "text": "noch nie wirklich gestorben, also vorletzte League, den ganzen Lab jetzt zweimal hintereinander,"}, {"id": 581, "start": 5169.12, "end": 5175.32, "text": "weil fail, Alter, try again, nee, jetzt hab ich keinen Bock mehr, jetzt mach ich noch"}, {"id": 582, "start": 5175.32, "end": 5181.52, "text": "ne Map und dann geh ich pennen, nee, wobei es ist 21.50 Uhr, sag mal, die Maps, die haben"}, {"id": 583, "start": 5181.52, "end": 5194.72, "text": "neue Symbole, oder, die Maps haben neue Symbole, oder haben die schon seit letzter League neue"}, {"id": 584, "start": 5194.72, "end": 5217.04, "text": "Symbole, nee, das ist eigentlich nur bloß Sack, außerdem ist das e-Mirror, damit kann"}, {"id": 585, "start": 5217.04, "end": 5231.56, "text": "man glaube ich gar nichts anfangen, das haben die letzte League schon geändert, okay, ach"}, {"id": 586, "start": 5231.56, "end": 5245.88, "text": "nee, die ändern die e-League, merkwürdig, ne, also, gerade sowas Zentrales, warum eigentlich,"}, {"id": 587, "start": 5245.88, "end": 5252.0, "text": "die Dinger, finde ich, lohnen sich erst später, aktuell ist es komplett useless, muss erst"}, {"id": 588, "start": 5252.0, "end": 5256.68, "text": "mal ein paar Maps machen, dass ich überhaupt so ein paar Atlas Points krieg, übrigens,"}, {"id": 589, "start": 5256.68, "end": 5264.92, "text": "was wollte ich noch mal skillen, das hier, ne, Elemental Resists, excellent, und was"}, {"id": 590, "start": 5264.92, "end": 5280.72, "text": "jetzt noch? Fire Dimensional Kills brauch ich jetzt nicht, gut, hier Respector, hier Respector"}, {"id": 591, "start": 5280.72, "end": 5300.16, "text": "halt nur, Endurance Charges, lohnt sich das? Doch klar, warum nicht, so, ich run jetzt"}, {"id": 592, "start": 5300.16, "end": 5322.8, "text": "ja mal schnell, oh Metamorph Map, excellent Metamorph Map, da ist er, der krasse Metamorph"}, {"id": 593, "start": 5322.8, "end": 5339.52, "text": "Man, was ist denn jetzt los? Es ist Metamorph Map plus, äh, also, das ist übrigens eine"}, {"id": 594, "start": 5339.52, "end": 5342.6, "text": "dieser Endgame Mechanics, wo ich meinte, man hat so ein Board, wo man die Leute richtig"}, {"id": 595, "start": 5342.6, "end": 5350.8, "text": "verbinden muss, ich hab legit keine Ahnung, was hier eigentlich passiert, ich hab keine"}, {"id": 596, "start": 5350.8, "end": 5373.6, "text": "Ahnung, Drop Map, easy, oh, gibt's irgendjemand, der das checkt? Übelster Müll, äh, eigentlich"}, {"id": 597, "start": 5373.6, "end": 5378.72, "text": "auch ziemlicher Müll, ich auch nicht, ja, gibt wahrscheinlich kaum einen, der das kapiert,"}, {"id": 598, "start": 5378.72, "end": 5383.44, "text": "okay, wir können doch keinen Boss zusammenbauen, aber bestimmt am Ende der Map können wir"}, {"id": 599, "start": 5383.44, "end": 5411.28, "text": "bestimmt einen Boss zusammenbauen, excellent."}, {"id": 600, "start": 5411.28, "end": 5421.0, "text": "Oh, mir fällt gerade ein, ich hab vergessen, meinem Chef vorzuschicken, äh, was ich gemacht"}, {"id": 601, "start": 5421.0, "end": 5426.8, "text": "hab, seitdem wir nur noch Dauer Home Office haben, müssen wir einmal am Tag so eine Mail"}, {"id": 602, "start": 5426.8, "end": 5429.96, "text": "schreiben, so nach dem Motto, so grob, was wir gemacht haben, hier nur ein paar Sätze,"}, {"id": 603, "start": 5429.96, "end": 5438.08, "text": "hab ich voll vergessen, aber mach ich am Montag oder am Dienstag, wenn ich wieder da bin,"}, {"id": 604, "start": 5438.08, "end": 5441.52, "text": "das ist kacke, über Chat zu erklären, nee, nee, nee, du musst mir das jetzt auch nicht"}, {"id": 605, "start": 5441.52, "end": 5444.56, "text": "erklären, ich kann mir einfach ein Tutorial Video angucken, gibt's bestimmt, gibt's bestimmt"}, {"id": 606, "start": 5444.56, "end": 5449.04, "text": "ein paar Tutorial Videos, aber was du vielleicht weißt, ist, lohnt sich das oder ist das eher"}, {"id": 607, "start": 5449.04, "end": 5452.8, "text": "so ein Gimmick, was jetzt nicht wirklich großartig was bringt?"}, {"id": 608, "start": 5452.8, "end": 5462.08, "text": "Eine Abmahnung kannst du dafür nicht geben, erstens wäre das ein bisschen arg überzogen"}, {"id": 609, "start": 5462.08, "end": 5470.48, "text": "und außerdem steht es ja nicht im Vertrag irgendwie drin, wo man, nee, also, und außerdem"}, {"id": 610, "start": 5470.48, "end": 5475.6, "text": "verstehe ich mich mit meinem Chef ganz gut, das ist halt schon aus dem Grund nicht, Pring"}, {"id": 611, "start": 5475.6, "end": 5482.88, "text": "Cebaro, grad da bist, wusstest du, dass mein Chef früher auf Anime Conventions gegangen"}, {"id": 612, "start": 5482.88, "end": 5489.84, "text": "ist und Cosplay gemacht hat, das ist mal ein nicer Chef, oder, aber wie gesagt, wir sind"}, {"id": 613, "start": 5489.84, "end": 5501.28, "text": "ja ungefähr gleich alt, da haben wir dann gleich in Laden die Ausbildung gemacht, was"}, {"id": 614, "start": 5501.28, "end": 5509.2, "text": "hier, nochmal das Syndicate, also du machst es nicht, aber es kann sich lohnen, okay."}, {"id": 615, "start": 5509.2, "end": 5535.12, "text": "Also ich klick jetzt einfach irgendwas an, nicht als würde ich da, ich möchte nicht"}, {"id": 616, "start": 5535.12, "end": 5541.04, "text": "den Anschein erwecken, als blicke ich durch, was hier passiert, ach guck mal, wir können"}, {"id": 617, "start": 5541.04, "end": 5570.76, "text": "wieder was anwählen, anwähl, und sieht das, auch nicht, das Ding will ich hier nicht verwenden,"}, {"id": 618, "start": 5570.76, "end": 5589.52, "text": "was war das andere, moment gab es nicht, ah hier das, so, so kann ich jetzt die Map abschließen,"}, {"id": 619, "start": 5589.52, "end": 5601.48, "text": "hab ich alles gelootet an Metamorph Viechern, ja das mit der Unterkunft kenn ich, was ist"}, {"id": 620, "start": 5601.48, "end": 5631.0, "text": "eigentlich die Map, ey die Map ist ja komplett loaded mit Zeug hier, excellent, also versuch"}, {"id": 621, "start": 5631.0, "end": 5634.52, "text": "so viele Leute hier möglich einen Branch zu bekommen, wenn der Balken beim Leader voll"}, {"id": 622, "start": 5634.52, "end": 5638.44, "text": "ist, kannst du in deren Unterkunft gehen und die kämpfen, ja das kenn ich, wie gesagt,"}, {"id": 623, "start": 5638.44, "end": 5645.92, "text": "das hab ich schonmal gemacht in der vorletzten League, also ich wusste nicht warum das passiert,"}, {"id": 624, "start": 5645.92, "end": 5649.56, "text": "sondern nur dass es halt passiert, wenn man das ne Weile gemacht hat, dann, dann muss"}, {"id": 625, "start": 5649.56, "end": 5657.32, "text": "man quasi den hier Hauptquartier raiden, also ihr seht schon, Path of Exile hat so unglaublich"}, {"id": 626, "start": 5657.32, "end": 5663.6, "text": "viele Endgame bzw. Mechanics im Spiel, dass es schon fast übertrieben ist, so jetzt kann"}, {"id": 627, "start": 5663.6, "end": 5679.56, "text": "ich mir noch einen Boss zusammenbauen, ok, rare weapon, map, map ist immer gut, map droppen,"}, {"id": 628, "start": 5679.56, "end": 5696.24, "text": "your coins mein wegen, currency items, ja ok, currency items, excellent, übrigens auch"}, {"id": 629, "start": 5696.24, "end": 5711.2, "text": "später, das ist kein allzu gutes Bosskiller Bild, ne, Monka, es passiert grad so viel,"}, {"id": 630, "start": 5711.2, "end": 5728.28, "text": "ich blicke immer durch, ok, es ist tot, mein infest voll, das ist doch alles, hör mal auf"}, {"id": 631, "start": 5728.28, "end": 5736.64, "text": "mich zu bespucken hier, komisches Viech, geh weg, die Unix sind doch eigentlich alle Müll,"}, {"id": 632, "start": 5736.64, "end": 5750.6, "text": "die ich hier hab, ne, sei mal so schlecht, das suckt, was soll ich mit 3 bis 7, das ist"}, {"id": 633, "start": 5750.6, "end": 5774.56, "text": "absoluter Müll, ich muss eher, kann ich noch irgendwas droppen, ich will jetzt eigentlich"}, {"id": 634, "start": 5774.56, "end": 5786.08, "text": "gar keine Items durchgucken, kann ich noch irgendwas droppen, auch Müll, auch kompletter"}, {"id": 635, "start": 5786.08, "end": 5813.64, "text": "Müll, ist eigentlich auch nicht so geil, ah, ich hab noch ne Map hier liegen, dropp ich"}, {"id": 636, "start": 5813.64, "end": 5831.84, "text": "denn dafür, ah no, damn, ah, gut, ähm, zum Beispiel kann man bis zu 3 White Sockets drauf"}, {"id": 637, "start": 5831.84, "end": 5854.28, "text": "machen, ja ich guck mir mal den Guide dazu an, bloß wieder mal nen Guide zu angucken,"}, {"id": 638, "start": 5854.28, "end": 5868.32, "text": "ich hab ein bisschen viele Tabs gekauft, ein bisschen rein Pay to Win, ich sortier mir"}, {"id": 639, "start": 5868.32, "end": 5875.28, "text": "das morgen mal alles, hab ich grad echt keinen Nerv drauf, jetzt sortier ich jetzt auch mal"}, {"id": 640, "start": 5875.28, "end": 5885.16, "text": "alle die richtigen Stash Tabs ein, Temple Map 3, du kannst die Tabs in der Liste rechts"}, {"id": 641, "start": 5885.16, "end": 5902.04, "text": "klicken und dann, ah, achso, auch nicht, das ist nicht verkehrt, Hey Max hättest, übrigens"}, {"id": 642, "start": 5902.04, "end": 5907.88, "text": "ist Stream gleich vorbei, ne, also, hey Max hättest du Interesse an einem Job als Data"}, {"id": 643, "start": 5907.88, "end": 5908.88, "text": "Scientist?"}, {"id": 644, "start": 5908.88, "end": 5921.68, "text": "Kommt aufs Geld an und wo es ist und um was es genau geht, aber eigentlich bin ich ziemlich"}, {"id": 645, "start": 5921.68, "end": 5942.12, "text": "happy da wo ich bin, so, genug kreiseln, Crying, für heute, äh,"}, {"id": 646, "start": 5942.12, "end": 5971.72, "text": "ja, denn, trotzdem schön, dass so viele dabei gewesen sind, jetzt hab ich meine tägliche"}, {"id": 647, "start": 5971.72, "end": 5981.16, "text": "Dosis, Kreiselgrind hinter mir, wie lange haben wir jetzt gespielt, warum muss man eigentlich"}, {"id": 648, "start": 5981.16, "end": 5985.68, "text": "jetzt hier drauf, warum, erstens warum leckt die Seite und warum muss man jetzt überhaupt"}, {"id": 649, "start": 5985.68, "end": 5996.48, "text": "erst hier drauf klicken, damit man sich die Videos anzeigen lassen kann, ja, ein bisschen"}, {"id": 650, "start": 5996.48, "end": 6010.16, "text": "über 4 Stunden und das ist noch wenig Kreiselgrind, man kann deutlich mehr Kreiselgrinden, ja,"}, {"id": 651, "start": 6010.16, "end": 6031.68, "text": "ich hab doch den Stream neu gestartet, exellent, ja, Sebaro unterm Stream, das ist glaub ich"}, {"id": 652, "start": 6031.68, "end": 6036.8, "text": "auch nix von Twitch oder, das ist was von FFZ und FFZ zählt glaube ich einfach nur"}, {"id": 653, "start": 6036.8, "end": 6055.48, "text": "bis zu Refresh, kann das sein, wenn das Streamer online war, Big Brain, ja, morgen muss ich"}, {"id": 654, "start": 6055.48, "end": 6065.04, "text": "mir da mal in Ruhe angucken, äh, sagen wo sind meine Spells hin, äh, morgen muss ich"}, {"id": 655, "start": 6065.04, "end": 6070.4, "text": "mir dann, ach so, wegen Control, ah, weil ich Control halte, morgen muss ich mir dann"}, {"id": 656, "start": 6070.4, "end": 6077.88, "text": "in Ruhe mal angucken, was ich für Endgame-Spec mache, machen muss, ja, aber das werd ich"}, {"id": 657, "start": 6077.88, "end": 6094.04, "text": "wahrscheinlich nicht on Stream machen, ExxonMobile, nö, das sagt mir nix, klingt nach Mobilfunk-Anbieter,"}, {"id": 658, "start": 6094.04, "end": 6110.28, "text": "ne, kenne ich nicht, also Leute, schön, dass so viele am Bestand waren, ich geh jetzt"}, {"id": 659, "start": 6110.28, "end": 6125.28, "text": "auf, ihr seht uns, bis morgen, oder so, mal gucken, see you!"}]}