{"text": "be conééééééééééééééééééééééééééééé!!!!Die ganze Zeit ist es nicht mehr so.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Die ganze Zeit ist jetzt auch damit.Ich bin schon mal wieder in der Nähe.Ich bin schon mal wieder in der Nähe.Aber das ist so ein Kandidat, der immer diskutiert. Immer. Wegen jedem Scheiß, ja.Kennen ihr, kennen ihr so Leute, die wirklich von, aus, von bei allem irgendeine Diskussion vom Zaun brechen?So nach dem Motto, ich hab ne Tasse, da ist der Henkel links und ich hab ne Tasse, da ist der Henkel rechts.Ist der jetzt links oder rechts? Vielleicht ist der sogar in der Mitte? Die müssen wegen allem die Diskussion vom Zaun brechen, ja.Ja, die labern, ja, das stimmt, das stimmt.Gut, so, so, so Stonks BWL, so Stonks BWL Consultant-Typen haben wir auch.Die kriegen ja eh Geld, wenigstens nur fürs Labern.Aber wenn du Technik, IT, Experten, beziehungsweise Consultant-Leute holst.Der Name Consultant suggeriert ja irgendwo, den fragt man zu Sachen, wo man selbst keine Ahnung hat.Aber dass diese Sache nicht der Fall ist, war mir schon eigentlich von Anfang an klar.Und das beste Beispiel für mich, warum das nicht der Fall ist, ist unser Spezialazubi, von dem ich euch schon öfters mal was erzählen hab.Also der, der so gar keinen Plan hatte. Der, der einen halben Nervenzusammenbruch hatte, wo ich ihn nach Netzwerkgrundlagen gefragt hab.Genau der. Der ist ja dann weg bei uns nach der Ausbildung, weil ihn keiner haben wollte.Und was ist er geworden? Junior Consultant. Mir fällt wirklich kein einziges Thema ein, bei was ich den konsultieren würde.Mir fällt wirklich nichts ein, bei was ich den fragen würde.Das einzige Talent, was der hat ist, das ist der mit C-Lattenzaun. Genau.Der, der statt C-Sharp gesagt hat, das würde C-Lattenzaun heißen. Genau der ist das.C-Lattenzaun. Genau der ist das.Und der schon nicht geschafft hat, einen Body-Mass-Index zu programmieren.Das waren Übungsaufgaben und das hat man ja dann hingekriegt.Und irgendwann hat er gesagt, Max, es funktioniert. Max, es funktioniert.Und im Endeffekt meinte er halt, es kompiliert.Naja.Nix wissen, Kohle schäffeln. Ja, ist echt so.Max, was hältst du davon, wenn Workstations alle Mitarbeiter durch VMs auf einem Server ersetzen?Nix.Der Mitarbeiter hat also nur eine ArtKVM-Box auf dem Tisch mit. Kann das flüssig funktionieren?Also, theoretisch schon. Praktisch, nun ja.Also, ich würde den Unterschied sofort merken.Irgendwelche Noobs, die halt absolut nix checken, was Input-Lag und Responsiveness angeht,die nicht, aber ja, man merkt das auf jeden Fall. Es gibt ja da verschiedene Varianten.Es gibt einmal diese Zytrex-Geschichte, die auch Grafikkartenbeschleunigung kann.Und es gibt diese von Microsoft, diese Hyper-V-Geschichte, die auf RDP basiert, wo auch Grafikartenbeschleunigung ist.Also, das ist quasi ein RDP, der allerdings irgendwie auch für die VMs eine GPU durchreichen kann.Das geht nur Hyper-V-mäßig. Und ich hab vergessen, wie das heißt.Und dann kann man dort auch über RDP 3D-Anwendungen benutzen und sowas.Also, die Chance, es geht, es geht. Man darf nicht vergessen, im Endeffekt, wenn sowas wie Game-Streaming geht, dann geht auch sowas.Also, wenn du Game-Streaming kannst, dann geht auch ein lag-freier Desktop. Das ist wahrscheinlich sogar noch einfacher.Allerdings, ich bezweifle, dass die das richtig machen und wahrscheinlich eher nicht.Ich bezweifle, dass die das richtig machen und wahrscheinlich eher sparen wollen, dadurch, dass sie die Workstations ersetzen.Also, ich glaube nicht, dass es gut funktioniert.Ich glaube nicht, dass das gut funktioniert. Also, bei uns, wir haben so eine ganz primitive Geschichte.Also, quasi eine Windows-VM, wo man per RDP drauf geht. Und das ist halt laggy as fuck, ne?Also, der Unterschied zwischen lokal installiertem Windows und, na, vor allem mit RDP ist halt riesig.Wenn es dieses spezielle GPU-Pass-Through-Hyper-V-RDP-Extension-Ding ist, dann ist es okay. Dann ist es ein bisschen wie Game-Streaming, würde ich mal sagen.Aber Game-Streaming funktioniert ja auch nur so flüssig, weil es halt eine GPU durchgereicht ist. Auf der anderen Seite.Also, ich glaube nicht, dass es gut funktioniert.So, Runde T einschenken. Excellent.Und gerade wenn man Windows hat, dann machen die doch eh alle möglichen Sachen über Regel im AD. Dann kann man doch auch Workstations behalten.Also, ich könnte mir vorstellen, dass es einfacher ist von der Verwaltung. Und ich könnte mir vorstellen, dass es auch spart...Zockst du Hyper? Was ist denn Hyper? Ach, das ist das Ubisoft Battle Royale. Hab ich noch nicht angeguckt.Ich hab mir nur mal einen Stream heute angeguckt. Ich finde, das sah auf den ersten Blick gar nicht mal so doof aus. Aber kann ich noch null zu sagen.Ja, wie gesagt, ich glaube, das spart Kosten. Und es ist einfacher zu verwalten. Allerdings die Frage ist, wie weit das wirklich Kosten spart, wenn die Mitarbeiter den ganzen Tag lecken.Weiß man nicht.Oh, habe hier noch meinen. Moment, Moment. GIF.Wie ging das mit dem GIF? Muss man GIF starten? GIF. GIF. Ach nee, das hatten wir auf dem anderen. Das Allerwichtigste. Also, ohne GIF im Terminal geht da nichts.Hast du das mit Wreckful mitbekommen? Ja, hat mich mitbekommen. Da gibt es ja eigentlich keinen Weg dran vorbei, das nicht mitzubekommen, wenn man ein bisschen sich da umguckt online.Heute irgendwas geplant? Nee, ich bin ja auch noch eineinhalb Stunden da. Ich komme mal on. Ich komme einfach mal on.Ah, hier, hier. Perfekt. Wo ist das? Wo ist das Paper, please? So, jetzt haben wir das Wichtigste, Leute. Jetzt haben wir das Wichtigste da.Jetzt ist das Wichtigste da. Exzellent. Wie im Titel steht.Ja, genau das habe ich vermutet, dass es laggy ist. Wie gesagt, die meisten bauen dir da nicht die ordentliche Geschichte auf.Also da, wo du halt auch GPU hast in der VM, wo du LDP Extensions für 3D Beschleunigung hast oder gar sowas in der Richtung, wie man eben beim Game Streaming macht, sondern die machen halt eine billige Geschichte VM und LDP.Und das ist halt laggy wie Sau. Da kommst du dir vor wie 1990. Schlechter.Ein Raspberry Pi ist heute ankommen. Was hast du denn vor? Begrünen wir es? Na ja, dann lockst du dich halt daheim remote ein und kopierst dir den Code, wenn du willst.Also wenn einer was klauen will, klaut er auch was. Man sollte vielleicht eher gucken, dass man Leute hat, die nichts klauen. Das ist bei uns auch so.Wir haben überall übertriebene Berechtigung. Wir verwenden ja auf der Arbeit als Ticketsystem das hier. Das ist also eines der bekannteren. Hier, die Dinger da.Hira. Es heißt übrigens wirklich Hira. Aber die richtig coolen Leute sprechen natürlich Jaira aus. Was übrigens komplett falsch ist. Ja.Jaira. Es heißt nicht Jaira. Es heißt Hira. Hira. Es heißt es. Was? Haira? Nein, Haira. Nein, es heißt Hira. Das ist Japanisch.Es heißt wirklich Hira. Zumindest. Ja, heißt es. Das sagen die sogar.Japanisch Namen für Godzilla. Zumindest. Bei uns ist es so. Die übertreiben es komplett mit Berechtigung.Also es geht sogar so weit, wenn ich ein Ticket habe, wo ich Bearbeiter bin und stelle fest, das ist bei mir falsch und verschiebe das in einen anderen Bereich, wo es richtig ist, dann kann ich das Ticket nicht mehr abgeben.Weil ich in dem anderen Bereich ja keine Berechtigung habe überhaupt Tickets zu bekommen. Allerdings habe ich das Ticket ja noch, weil ich es zuerst in meinem Bereich hatte und dort das Ticket bekommen habe.Das ist wirklich Big Planet und bei uns sind die Berechtigungen so wir, dass solche Sachen laufend auftreten.Wenn neue Mitarbeiter anfangen, dauert das erst mal drei Wochen bis sie Zugriff über Allhaut drauf haben. Das ist so lächerlich.Normalerweise würde ich erwarten, gerade wo die sich immer überschlagen von wegen, wir haben so geile Prozesse umgesetzt und sich selbst voll abfeiern, frage ich mich, wie es sein kann.Warum gibt es dann keinen Mitarbeiter-Check-In-Prozess, dass es nicht so drei Wochen dauert.Das ist nicht sonderlich agil.So ist man nicht agil.Und da bringt Jyra auch nichts.Wie gesagt, da ist Jyra.Und die haben schon so eine ekelige Seite, wenn ich das sehe.Also mittlerweile ist es ein bisschen so, wenn einer will, dass sein Zeug verschimmelt, dann muss er es in irgendwelchen Atlassientools ablegen, dann findet es keiner mehr bei uns.Das geilste ist, wir haben Teamnamen.Also keine Ahnung, ich denke mir jetzt mal einen Teamnamen aus.Sagen wir mal, wir hätten ein Team Software-Bereitstellung.Haben wir nicht? Ich mache das ja ein bisschen anonym.Aber theoretisch angenommen, wir hätten ein Team, was sich Software-Bereitstellung nennt.Und man möchte ein Ticket aufmachen, im Ticketsystem, weil man auf seine Windows-4M-Foreverplayer braucht.Zum Beispiel.Da würde man ja von ausgehen, du gehst ins Hierer rein, machst ein Ticket auf bei einem Bereich, der heißt wie das Team.Bei uns sind es allerdings Massive Big Brain und das Jyra-Team oder Atlassient-Team benennt die Gruppen im Hierer anders, wie die Gruppen wirklich heißen.Das ist der Wahnsinn.Also dann heißt das Team eigentlich Software-Bereitstellung.Auf dem Organigram heißt es dann ITSW-DEF oder so.ITSW-DEP, das muss überall anders heißen.Und im Hierer heißen sie dann nochmal ganz anders.Da heißen sie dann SWITPLUB, keine Ahnung.Man findet nichts bei uns, das ist so geil.Du kannst dich auf nichts verlassen.Wenn du den Team-Namen weißt, findest du ihn nicht im Organigram und nicht im Hierer.Hast du den Hierer-Namen, findest du ihn nicht im Organigram und nicht...Richtig gut.Aber Leute, meine Frage wer bei euch arbeitet bei einem größeren Laden, das ist fast überall so, gehe ich mal ganz stark davon aus.Also bei dem Provider, wo ich vorher gearbeitet habe, da war es nicht ganz so wild, das war aber auch nicht so ein ganz großer Laden, aber es war auch furchtbar wirr.Kennst du Redmine? Ja, kenne ich.Redmine, Alter.Da sind wir zum Glück, das haben wir überlebt, Redmine.Die Musik ist extrem paper please.Also Redmine habe ich noch nicht aufgesetzt oder so, aber ich kenne das, ich kenne das.Lukku, das richtig gemacht ist, das ist nicht schlecht.Also ich muss sagen, so von den ganzen Ticketsystemen, die es gibt, wo ich schon mal ein bisschen so reingeguckt habe, finde ich Hierer eigentlich am besten.Wenn es ordentlich gemacht ist.Wie viele Mitarbeiter hat ein Unternehmen eigentlich? Endorphine, also ich muss dir ehrlich sagen, das weiß wahrscheinlich keiner so genau.Weil das zig, Tochter und über und sonst wie, ach das weiß keiner.Also ja klar, wahrscheinlich weiß es irgendeiner, aber so wirklich wie man es hier sieht, ist es wahrscheinlich keiner.Ja, wahrscheinlich weiß es irgendeiner, aber so wirklich wissen tut das, wenn du nicht gerade Buchhaltungsmann bist, wahrscheinlich keiner.Dann machen sie ja so komische Dinge wie, ja ok, jetzt müssen neue Leute bei irgendwie einer Tochtergesellschaft anfangen, weil man sonst über eine gewisse Anzahl käme,wo es dann noch einen neuen Betriebsrat, Sitz bräuchte und so Dinge, das weiß keiner genau.Das, das, das weiß, das weiß keiner genau.Das ist schrecklich mit Ruby und Rails, ach Ruby und Rails an sich ist gut, aber Redmine ist halt eklig.Ja wie gesagt, das mit Ragfall habe ich mitgekriegt, ich kann dazu gar nichts sagen, ich habe seine Streams nicht geguckt.Ich weiß nur, dass er sich umgebracht hat mit 31 und dass er wohl schon längere Zeit ein bisschen Dachschaden hatte.Aber genaues keine Ahnung, hat wahrscheinlich schon jeder auf Twitch ausführlich behandelt, ich muss es ja nicht auch noch unbedingt machen.So, ich mache mal die ganzen Crap hier zu, die wir noch von gestern auf hatten.Das wollte ich gerade sagen, das dürfte jetzt ja nicht mehr da sein.So wie ist diese komische Seite nochmal mit diesen Jobs, die ich bemerken wollte, Jobs vor Andy, sowas, das beknackt das echt.Ich wollte mich eben ein bisschen kaputt lachen, ich habe nichts spezielles vor sage ich euch gleich.Habt ihr Dings mitgekriegt? Habt ihr Twitch Drama mitbekommen?XQZ vs Ninja vs Ninjas Frau vs Ninjas Bruder vs XQC's Frau vs frag mich nicht alles.Wie sie sich geflamet haben, ich habe mich so kaputt gelacht.Wie sie sich geflammt haben, ich hab mich so kaputt gelacht.Also wer es sich mitgekriegt hat, so die, so die, so die, so die, in drei Sätzen wardie Erklärung.XQC hat im Stream gesagt, ähm, die meisten Streamer, die Charity Event Stream bekommenGeld dafür.Und darauf, darauf war irgendwie Ninja angepisst.Und dann war Ninjas Frau noch angepisst und er hat XQC ihr geantwortet, so nach dem Mottoja was war sie schon mit ihren zwei Gucci Handtaschen, sie hatte da auch gar keine Ahnungvon.Dann hat Ninjas Bruder darauf geantwortet und Ninjas Frau, dann hat irgendwann noch,noch XQC´s Frau darauf geantwortet und haben sich alle geflammt.Ich hab mich so kaputt gelacht, das hat mich so ein bisschen an YouTube Drama 2012 verinnert.Genau er ist Ninjas Frau, dann Ninja, ich fand´s mega lustig, eigentlich total unsinnigwie sie sich da drüber gestritten haben.Ahja, kann mir jemand mit dem Raspberry Pi helfen, ähm, Noobs, Noobs ist für´n Arsch,nehm´ ne SD-Karte, mach den Raspian drauf, vergiss Noobs.Gibt es eigentlich schon was neues zu Prime, also diesen Streaming Service, ich bezweifleauch das es den geben wird, erstens, erstens, also da muss ich jetzt mal was zu sagen, erstensdie zuverlässigste Quelle davon ist 4Chan und ich finde das sagt alles wenn die zuverlässigsteQuelle 4Chan ist, so, ähm, und das nächste ist, ähm, Prime, der Name ist viel zu, vielzu, ähm, ähnlich zu Prime, würden die das wirklich rausbringen, da wäre Amazon sofortam Starten, wird die verklagen, weil Prime und Prime zu ähnlich ist, ne, also wie gesagtzuverlässigste Quelle 4Chan und Prime und Prime, das wird´s dem Leben nicht geben.Ähm, was ist deine Theorie zu Dr.Disrespect?Gut, habe ich ja schon vor ein paar Tagen gesagt, als es aktuell war, meine Theorieist immer noch Plattformwechsel, weil für alles andere brauchst du zu viele unbekannteSachen, da halte ich Plattformwechsel tatsächlich für am wahrscheinlichsten, was es am Endeist, wir haben alle keine Ahnung.Welches Einstiegsgehalt kann man als Informatikstudent, Moment, du bist Informatikstudent, also duhast vorher eine Physi-Ausbildung gemacht und bist jetzt Informatikstudent.Möchtest du quasi neben dem Studium noch was, noch was verdienen?Oder bist du fertig mit dem Studium?Ach du wirst fertig, ich habe ehrlich gesagt keine Ahnung, aber ich habe gesehen, dassdie Bahais letztens wieder ihre Gehalts, äh, Gehaltsumfrage gemacht haben, das ist immerganz gut, weil es für Deutschland ist, genau, was ist mit euch los heise, come on bra, Paywallwollen die mich veräppeln, ja aber nee Paywall dann halt nicht, ja, lull.Also ich habe keine Schmerzen damit, dass die heise plus haben, die müssen ja auch irgendwieGeld verdienen, aber vielleicht sollte man nicht auf der normalen Seite heise plus Artikeldann irgendwie verlinken, weil ich fühle mich immer angepisst, wenn ich irgendwo draufgehe und fange an, vor allem das Bahais ist das nervige, das fängt hier unten immererst an, ja, du scrollst, du drüberlängst dir, aha, aha, aha, aha, ah, Paywall, alsoirgendwie zwei Minuten verschenkt für da oben, weil Paywall voll von Arsch, also 40kist auf jeden Fall für, also es kommt immer ein bisschen aufs Gebiet ab, aber 40k erscheinenmir auch wenig, ja, es kommt natürlich drauf, also es kommt extrem auf die Region an, aber40k erscheinen mir, also mal, wenn es Frankfurt wäre oder so auch ziemlich wenig, es kommtnatürlich nicht nur darauf an, dass du, es ist halt auch die Frage Region und welchePosition das ist, ich meine, wenn du jetzt in Support gehst, wir haben bei uns im 24-7-Supportauch einige Bachelor-Studenten sitzen, die Informatik studiert haben, dann kriegst duauch nicht viel, weil Support wird dann nicht bezahlt, also, na, es kommt drauf an, welcheStelle und es kommt drauf an, welche Region, dann kann man was sagen, ehm, immer Proto,also von netto Jahresgeld redet kaum einer, auch die, auch wenn ihr den Tarifvertrag oderso, es sind alles Proto-Jahresgelder beziehungsweise Monatsgelder im Tarifvertrag, warum auch immer,was für uns gut ist, weil bei uns gibt es 14 Monatsgelder, Steps Down Gehaltsbericht,genau, da kannst du tatsächlich gucken, da kannst du sogar, die haben sogar so einenTest, den du machen kannst, die haben sogar so einen Test, den man machen kann, wo duFragen beantworten musst, also zu deiner Person und dann sagen die, was es im Durchschnittso gibt, das ist aber natürlich drauf angelegt, du sollst dich da registrieren und bla undsonst was, oh, Consulting, muss das jetzt sein, wirklich, Consulting, was, Überblick,Proto-Durchschnittsgehalt, Personalverantwortung, ja, nein, Anzahl Mitarbeiter unterstellt,aha, ok, ne, wir wollen, in welchem Bereich, gucken wir mal, zeig mal her, ehm, Geldervon Fach- und Führungskräften, ja, schon ein Überblick, was guckt man da jetzt ambesten, ah, Branchen, Gehälter nach Branchen, Banken, also ich habe mir das ja alles nichtausgesucht, ja, aber ich stelle immer wieder fest, dass ich echt in einer guten Ecke gelandetbin, also sowohl Frankfurt, sowohl Bank, als auch, sowohl was der Tarifvertrag hergibt,als auch was am Ende noch rauskommt, obwohl ich nur Teilzeit arbeite, ich habe, es warnie, ich habe es nie drauf angelegt, aber ich habe irgendwie echt Glück gehabt in derRichtung, GG, ja, also so viel haben wir nicht, wobei ich mir ehrlich, nein, ich weiß esnicht, das kann durchaus sein, dass wir über 1000 haben, wenn die ganzen Tochtergesellschaftenungedönst mit dabei sind, ich habe ehrlich gesagt keinen Plassen Schimmer, also Gehälternach Bildungs, Abschluss, oh ja, da hast du schon, da hast du schon, ist schon mal nichtverkehrt, gut, inwieweit das jetzt so ein Bachelor da was bringt, stimmt halt Null, naja,auf wem der Grundlage wird das schon sein, dass es jetzt nicht auf den Einzelnen zutrifft,ist ja auch klar, sowas ist ja immer über alle Sachen durch, ab 25 Jahren, ok, Berufserfahrung25 Jahre, da brauche ich noch ein bisschen für, wer zählt als Akademiker, kein Schimmer,das ist ja gerade die Frage hier, man erkennt es nicht wirklich, Top 5 Studienfächer, Medizinund, Moment, was, Moment, dachte das wäre IT, ach Moment, das ist nicht nur IT, dasist alles, für Führungs, ach Moment, wir haben voll den falschen Report, Alter, Zahntechnik,was ab Seite 16, wo sieht man die Seitennummer, ah da unten, Seitennummern sind out, IT hier,Crap, na gut, guck mal, mit was, was hast du hier, du hast Ärzte, Finanztons, Menschen,irgendwelche Anwälte, Banking, Ingenieur, Unternehmensberater, Vertrieb, IT, Marketing,ach ich bin ja immer froh, dass Marketing bei sowas relativ weit unten ist, Personal,oh ja, jawoll, Marketing, Personal, PR, ganze Crap, der kann noch viel weiter runter, NaturwissenschaftlicheForschung und Labor, ok, das dürfte ruhig weiter oben sein, ja, Einkauf, Logistik, nagut, das ist im Lage hin und her fahren, Bildung, ja, dass das so schlecht bezahltwird, gerade Bildung sollte eigentlich besser bezahlt werden, Gesundheit und soziale Dienste,das was alle brauchen wird am schlechtesten bezahlt, Design und Gestaltung, technischeBerufe, also mit technischen Berufe meinen sie jetzt in dem Fall nicht IT, sondern wasmit Holz zum Beispiel, so, die Gehälter für IT-Berufe im Überblick, achja, Protodurchschnittsgehalt,ok, das ist, ja gut, das sagt jetzt für den Einzelnen nicht wirklich was aus, das Durchschnittsgehaltist wahrscheinlich viel höher als das was die meisten Leute kriegen, weil es halt wiederein paar gibt, die extrem viel bekommen, deswegen ist ja auch das Durchschnitts, das durchschnittliche,wie nennt man das, Einkommen und sowas, was die Leute in Deutschland haben, insgesamtganz ok, wenn du aber mal guckst, wenn du mal so die allerreichsten weglässt, dieallerärmsten weglässt, dann ist es halt doch nicht so viel, und noch schlimmer ist, wenndu die guckst, die Grenze zwischen Arm und Reich, wo die liegt, das ist viel niedrigerals man denkt, Hessen, komm mal, ich hab echt Glück gehabt, muss ich sagen, also ich mein,was hatte ich eben gesagt, Bank, Bank, Hessen, Ulm, komm mal, eLotrix verdient 65.000, ähm,ich hasse Ulm, Ulm sackt so hart, ich musste da jahrelang hinfahren, mag Ulm überhauptnicht, Moment, jetzt hab ich drüber gescrollt gerade, over IT, ja also, 65k, 53k, Geschlecht,männlich, weiblich, Anteil variables Gehalt, 8%, mit Personalverantwortung 24, ok, undin Hessen, tja, hast du eLotrix mal besucht, nein, warum sollte ich, wie viel meinst dukriegt ein fachinformatischer Anwendungsentwickler nach der Ausbildung in Frankfurt, 40k, ja,das geht schon, je nachdem wo du hinkommst, vielleicht sogar mehr, aber 40k in Frankfurtals Einstiegsgehalt, als Anwendungsentwickler, wenn es jetzt nicht total die Klitsche ist,ja, so, also, Moment, jetzt wollte ich doch jetzt mal gucken, gibt es jetzt irgendwienoch nach, irgendwie Ausbildung, was man gelernt hat oder sonst was, ne, na gut, derGehaltsbericht, ok, ach hier kommt, Gehaltsunterschieden nach Aufgaben, Fälle, Berufserfahrung, IT-Architektur,SAP, überall diese SAP-Crap, aber der verkauft sich gut, beziehungsweise er bringt gut Kohle,Projektmanagement, IT-Beratung, ja, die von denen hatten wir es ja gerade am Anfang, Leute,die den ganzen Tag heise Luft fabrizieren, zum größten Teil, nicht alle, aber zum größtenTeil sind die sehr gut im heise Luft fabrizieren, aber wirklich Ahnung haben sie nicht, Softwareentwicklung,IT-Infrastruktur, Support, tja, da sieht man es mal, ne, Support wird meistens recht schlechtbezahlt, Top-Berufstitel, IT-Manager, IT-Architekt, Softwarearchitekt, SAP-Inhouse-Consultant,ist es dann, ist es einfach jemand, was ist ein Inhouse-Consultant, ist es einfach jemand,der sich damit gut auskennt und dort angestellt ist, also quasi ein SAP-Experte, der dortdirekt angestellt ist, also ich mein, den könnte man auch anders nennen, den muss mannicht SAP-Inhouse-Consultant nennen, aber das war's, ok, das war jetzt nicht so wahnsinnigaufschlussreich, Senior Software Engineer in, Moment, SAP-Inhouse-Consultantin, so geht'sja nett, so geht's ja nett hier, so, hab ich eigentlich meinen Chat-Log eingeschmissenhier, wo ist mein Chat-Log, ja das haben wir uns nicht gerade angeguckt gehabt, achso ja,den Gehaltsplaner haben wir schonmal gemacht und die haben uns extrem krass gebaitet, erstenshab ich weniger gekriegt laut Gehaltsplaner, als ich jetzt krieg und ich sollte mich danachregistrieren, dass er richtig funktioniert, was ist denn eine Cam-Programmiererin, dashat wahrscheinlich nichts mit Webcam zu tun, oder, Nehradorn, Stufe 1, 12 Monate, excellentSubscription, Dankeschön, Abortnetzwerk, Entwickler, Datenschutzkoordinator, CAD, Cam-Programmierer,Networker, Integrations-Techniker, Nachrichtentechniker, der Name klingt so richtig oldschool, aberrichtig deutsch klingt der Nachrichtentechniker, Prüftechnik-Testkoordinator, Jobs für IT,ok guck mal mal, 6 0 3 2 9, was haben die denn schönes, wir haben schon eine Weile nichtmehr geguckt, da ist bestimmt wieder irgendwas drinnen, wo wir ein bisschen flamen können,aber Praktikant, MV-Diverse, im Bereich Shopper, Shopper-Marketing, sind das Motorradfahrer,Shopper-Marketing, Nestle, ok, ok, was wollen die denn von so einer Praktikant, ach guckmal Bewertung, was ist mit der Mario Kart Musik los, warum wird hier auf einmal so laut,und KS, Moment das ist die Lobby von Mario, ach exzellent, na na na na na das machen wirjetzt nochmal, ok Nestle für ein Praktikant, ok bla bla bla, können wir alles einmal überspringen,welche Rolle nehmen sie ein, im Shopper-Marketing, ah das sind die die einkaufen gehen, das sinddie Shopper, sie arbeiten als Kategorie übergreifende Schnittstellen strategisch mitdem Markt, als Praktikant, als Praktikant, sie unterstützen im Rahmen der digitalen ShopperAnsprache, was ist denn das für ein bescheuerter Satz, der ergibt überhaupt keinen Sinn, sieunterstützen im Rahmen der digitalen Shopper Ansprache und entwickeln, was ist das fürein Satz, der ergibt keinen Sinn, ich kann den Satz nicht mal richtig aussprechen, weilich immer denke da fehlen Wörter, sie unterstützen im Rahmen der digitalen Shopper Anspracheund entwickeln digitale Kampagnen in Zusammenarbeit mit Startup, what, das ist Massive StonksSprache und mal ganz davon abgesehen, als Praktikant, was soll ich für den Link öffnen?Was war ich halt für ein Link, den Spider von Heise, ok warte mal, was ist denn daseigentlich für eine, what, was ist das für eine Uhr, na gut war es auch immer, marktüblicheIT Geld, der Helpdesk und Support, gut das ist immer ganz unten sowas, ja leider, datenbankadministration, Netzwerk, Telekom, Softwareentwicklung, Beratung, IT Sicherheit, Management, ok,Perzentil, wo bin ich, also früher hätte ich mich dazu gezählt, aber ich mache keineAdministration mehr, schon seit Jahren nicht mehr, da bin ich am ehesten, wobei, da binich auch nicht, ich bin, mich gibt es nicht, was sind denn Perzentil, Prozent, also dieunteren 25% dann irgendwie, oder was wollen sie hier, und dann die oberen, die oberen5%, irgendwie das sind die oberen 5%, das sind die unteren 25%, das ist so der Durchschnitt,irgendwie sowas in der Richtung, ja das ist nicht so richtig, das hier finde ich, ichwill ein bisschen, ich will noch ein bisschen ablässern über Nestle, jetzt mal ganz ehrlich,mal ganz im Ernst, die wollen doch nicht, dass das wirklich jemand umsonst macht oder,ist das richtig, die wollen, dass das hier jemand umsonst macht, die müssen da schonwas für kriegen, ansonsten wäre das doch komplett affig, ja da muss es Geld für geben,ansonsten wäre das doch, aber da steht halt nichts zu, da steht nichts von Gehalt, aberwenn das wirklich kostenlos ist, dann wäre das echt, das ist ja geschenkt, naja, na gut,was hat Nestle so für Bewertungen, leider bestenfalls Durchschnitt, relativ viel Pause,im Normalfall kann man eher mal nach Hause gehen, also ich finde, dass Nestle sackt zumgrößten Teil, hier guckt euch das mal an, stärken, pünktliche Gehaltszahlung, ok,wenn das schon die Stärken sind, ich meine, pünktliche Gehaltszahlung ist keine Stärke,pünktliche Gehaltszahlung ist die Basis, auf der man länger als einen Monat dahin zur Arbeitgeht, also ohne pünktliche Gehaltszahlung gibt es auch keine Arbeit, viele Zulangen,Sommergeld, Weihnachtsgeld, Urlaubsgeld, ok, spontan freien, aber meist ohne Problememöglich, also mit Schichtsystem scheint das zu sacken, 10 Monate, Dankeschön, Subscription,was wusste ich, das ist human, hier steht nix mit humaner Arbeit, kann man hier sortierennach, was ist das Unternehmen mit der schlechtesten Bewertung, ok, die Mario Kart Musik, die gehtmir auf den Keks, weil die ist unterschiedlich laut, wobei jetzt gehts eigentlich, hat sicheingekrägt, ich muss noch was anderes machen, das hatten wir erst letztens, ah yes, excellent,das ist schön entspannt, was neben der Suchleiste erweitert, Bewertung, ne kann man nicht, mankann nicht nach Bewertung suchen, das wäre auch zu geil, ich wollte mal nach dem schlechtbewerteten Unternehmen suchen, aber das geht anscheinend nicht, ok, schauen wir mal, washaben die sonst noch schönes zu bieten gerade, also in Fragen von Nestle Praktika, ne dasmuss nicht unbedingt sein, technischer Projektmanage für den Bereich Spritzguss, excellent, daswar es für den Chat, kannst du bei Kunden, was Kunden, habe ich denn, ok, ich will dasschlecht bewertete IT Unternehmen in Deutschland haben, kann man da nach, nach Branche suchen,IT, hier alle Branchen, IT, und jetzt Bewertung, Bewertung absteigend, äh Bewertung aufsteigend,kann man mindest, mindest, mindest Bewertung, weil, weil die kennt ja keiner hier, die sindja komplett, komplett unbekannt alle, die haben ja nicht mal Bilder, oh ja, die sackenalle, heftig, die sacken hardcore, immer Bewertung absteigend, die haben auch alle kein Bild,warum haben die alle kein Bild, ok, die Suche ist doof, ok, dann suchen wir nach, wer hatdie weißen Bewertungen, Anzahl Bewertungen, ja gibt es nicht, ah das ist ja doof, so schauenwir mal, was haben die denn hier schönes, SAP, ja überall, überall ist es, was Bewertungab, ja ne, ab Sterne, aber ich will ja sagen, ab, wie viel abgegebener Bewertung, so washaben die hier schönes noch für uns hier, ah wir gucken, ne, ne, ne Leute, wir guckenmal wieder, wir gucken mal, was unser Lieblingsunternehmen in Frankfurt so treibt, wir müssen uns malwieder Telekom-Stellangebote angucken, die sind immer am lustigsten, was die da teilweisefür Buzzwords um sich, um sich hauen, Moment, das ist aber nicht das, was ich, was ich meintehier, Jobs, wir müssen uns wieder die Telekom angucken, ja genau, da sind wir, Deutschland,ja Frankfurt, Frankfurt, auf, allein schon, wie bescheuert man hier rein scrollen muss,ja das ist das Interessante in Frankfurt, da, da, in der Ecke, Niederrad, ne, ne, dochnicht, da, exzellent, was, was, was will ich hier, Bachelor, Fachinformatiker, das sindAusbildungsstellen, sowas in der Richtung, oder, weil niemand sucht ein FachinformatikerSystementwicklung, das ist Ausbildungsstellen, Werkstudent, Ausbildungsstellen oder irgendwiesowas, die Seite ruckelt übrigens, Head of Competence Sender, IT-Industry, what, Hunter,ein Hunter suchen die, von KS, ja, ok, Telekom sucht gerade nix, aber die Telekom sucht Azubis,die weiß man, wie man sich eigentlich nennen kann, kommt auch an, was du dich bewerbst,wenn du Fachinformatiker Systementwicklung gelernt hast, danach sucht keiner, du mussthalt irgendwas suchen, dann was zu deinem Kenntnisstand entspricht, von Softwareentwicklungbis Administration, bis Automatisierungsgeschichten, bis Cloud, bis sonst was, was halt passtzu dem was du kannst, was ist das denn, Taze, was ist das denn, zeig mal her, oh, excellent,das sieht das, was ist das bei der Polizei Hessen, das, also diese Seite sieht aus wievon 1992, wer das auch immer erstellt hat, weiß ich auch nicht, aber einen Vorteil hat's,man kann's relativ gut lesen, E13, heute E13 gab's doch kaum Geld, oder, wir hatten dasja schon mal geguckt, E13, E13 gibt's doch kein Geld für, E13, E13, was ist das Stufe3, Stufe 4, okay, keine Ahnung, wollen die mich verarschen, ach Moment, netto bleiben,netto bleiben, okay, okay Moment, ich hab nix gesagt, das sind ja die einzigen, diedas in netto machen, oh ja, oh ja, so schlecht ist das doch gar, was ist denn, was ist dennKlasse 1, sind das Berufsjahre oder sowas, morgen KS, ist doch ordentlich, ich hab leiderkeine Ahnung, was diese Stufen hier unten sind, Stufe 1, 1 Jahr, Stufe 2, 2 Jahr, alsodas heißt Stufe 6, wir sind irgendwie nach 20 Jahren oder so, okay, dann gehen wir malwas von halbwegs realistisch, ach so, wie ist das eigentlich, wird das einem angerechnet,also mal angenommen theoretisch, jemand hat jetzt wie ich seit 2007, schon quasi Berufserfahrung,seit 13 Jahren, wird das dann angerechnet, wenn das nicht angerechnet wird, was ja Blödsinn,schau dir mal die Schweizer, das bringt nix zu vergleichen, das geht doch halbwegs, alsoich mein das ist jetzt nix wo ich sagen würde, ich muss sofort hier dahin, aber das siehtdoch schon mal ganz okay aus, okay was schreiben sie, was suchen sie überhaupt, eine Informatikerin,eine Informatikers im Bereich, warum suchen die keinen Informatikkorps, im Bereich Kriminaltechnik,auch richtige Hackermans suchen die, in Vollzeit, die Eingruppierung erfolgt, Moment, da gibtes auch noch so andere Abstufungen, Moment, das ist das was wir gerade schon hatten, dasist das was wir gerade schon hatten, also passt, passt, das kremen, bla, bla, bla, bla,die Aufgabengebiet umfasst die Gewährleistungsbetrieb der KTI, jetzt, okay, Entwicklung von speziellenIT-Lösungen hin und Erstellung von IT, für das, was ist denn das, KriminaltechnischeInstitut, okay, Abkürzung, Abkürzung immer gut, bla, bla, bla, okay, da muss man aberschon von dem Thema Ahnung haben, also ich wüsste jetzt nicht, was die genau wollenmit mobiler IT-Verfahren zu Analyse und Rekonstruktion von Tatordnen, sollst du Festplatten entschlüsselnoder wie?Was ist aus dem Projekt mit Traffic geworden, hat alles funktioniert, ja, Leitung von Projektenzur Einführung von IT-Anwendung, Datenbank, okay, ich mein, das könnte man vielleichtauch in den Titel schreiben, weil Projektleiter ist ja nun mal ein bisschen was anderes alseinfach Hacker-Man, Planung, Beschaffung in Betriebnahme von IT, Moment, die wolleneinen Projektleiter und gleichzeitig einen, der ein Computer anschließt, seh ich dasrichtig?Das passt irgendwie nicht zusammen, technische Analyse und gegebenenfalls Beseitigung vonMicrosoft, okay, Gewährleistung der Umsetzung, für die Landesverwaltung, Geld in der IT-Sicherheit,bla, bla, bla, bla, okay, Mitarbeiter in Gremien, ja, okay, also ich könnte das mit den meistenSachen gar nicht so wirklich was sagen, anfangen, oder vergleichbar, gute Kenntnisse in derEntwicklung und Pflege von rationalen Datenbanken, Microsoft SQL Software, Weiche, der Teufel,Oscar als Beste, Kenntnis und Erfahrung im IT-Projektmanagement, also ich find das,also das liest sich alles ganz okay, aber das meiste liest sich halt wie so ein ganzklassischer Turnschuh-Admin, der halt unterwegs ist und guckt, dass alles funktioniert unddas liest sich nicht nach einem Projektmanager, ausgeprägt, ja, bla, bla, Herr Doktor Aalhorn,hoffentlich lässt er nicht den Aal raus, aber das war schlecht, ich geb's zu, Aalhorn,alles klar, ja, gut, ich muss euch, es liest sich gar nicht so schlecht, aber ich kann mirwenig darunter vorstellen, muss ich auch gestehen, Hanfollow ist raus, so, also genau, die Telekomsucht Azubis und die suchen die überhaupt eine Ausbildung, ja, Ausbildung, boah, wasman als Azubi mittlerweile kriegt ist ja heftig, na gut, bei mir ist das ja auch schon ewigher, selbst wenn du einfach jedes Jahr ein bisschen was drauf haust, bist du dabei jetztschon, ja, naja, bei mir ist das irgendwie 15 Jahre her ungefähr und wenn du dann irgendwiepro Jahr nur 2-3% drauf haust, bist ja schon bei dem Gehalt, also im Prinzip ist da eigentlichgar nichts gegen zu sagen, wir dürfen nicht vergessen, es ist Frankfurt, Frankfurt istimmer teuer, stories, nachdem Khaled Deutsch gelernt hat, lernt er jetzt seinen Traumberuf,hä, was hat das mit der Stellenanzeige zu tun, Khaled kommt aus Syrien und muss erstDeutsch lernen, bevor er seine Ausbildung zum fachinformatischen Systemenintegrationbeginnen konnte, er liebt es jeden Tag etwas neu, ok, die Telekom möchte sich als besondersinclusive darstellen, verstehe, das ist ja gerade aktuell im Trend, ähm, ich bin begeistertvon seinem Kind, er sagt, sowohl in der Schule als auch im Ausbildungsbetrieb sind wir eingutes Team, ah ja, wo ist Khaled, ach, da gibt es wenigstens ein Bildchen zu, wie erden Server einbaut oder sowas, exellent, Agile Coach, das ist was für mich, der Agile Coach,jawoll, ich wollte schon immer agil bei der Telekom sein, was geht hier ab, Agile Coach,so, so, also, ok, sie kreieren in der Organisation den nötigen Rückenwind auf unserem Weg indie Zukunft, als Agile Coach mit in der Praxis gefestigten Methodenkompetenz, was zum Geiersoll das überhaupt bedeuten, mit Herzblut, ok, das ist ja auch nichts für mich, washeißt das überhaupt, mit Herzblut arbeiten sie an den folgenden Themen, sie ergänzendas schon bestehende Agile Chapter Team, das sich mit der Vereinfachung von Prozessen beschäftigt,sowohl das Thema Time to Market als Fokus hat, also sprich, wie schnell kommt was raus,sie gestalten aktiv den Weg der Weiterbindung für das Agile Chapter, das liest sich heftigBates Jam, Alter, sie fördern die Entwicklung eines Agilen Mindsets, vermitteln agile Werteund Praktiken und treiben die kontinuierliche Agile Kompetenzentwicklung voran, ok, undjetzt nochmal auf Deutsch, was macht man da genau, durch die Unterstützung und Schuldevon Agile Methodenkompetenz befähigen sie die Teams dazu diese Methoden dauerhaft nachhaltiganzuwenden, ihre Stakeholder sind Tribe Leader, ok, ja, ich hab die Begriffe alle schonmalirgendwie gehört, aber ich hab noch nie so viel in kurze, so viel zusammen komprimiertgelesen auf einem Flag, also ihre Stakeholder sind Tribe Leader, also bei Scrum ist es so,dass unterschiedliche Gruppen, die unterschiedliche Themen bearbeiten sind Tribes, warum man essich Gruppen nennt, weiß ich nicht, weil es cooler klingt, also wenn du die erste Gruppehast, die sich mit Thema A beschäftigt und die zweite Gruppe, die sich mit Thema B beschäftigt,da könnte man das Gruppen nennen, in Scrum sind es aber nicht, sondern es sind Tribes,weil Stonksmännchen das geiler finden, wenn das so heißt, dass man das nicht versteht,es sind eigentlich Gruppen, Gruppenleiter sind das, Gruppenleiter im Endeffekt und diehier halten, was machen wenn die Veganer sind, Painschamp, Management und Führungskräftesowie Mitarbeiter sampler Hierarchie imnen, Stakeholder sind im Prinzip, die es zu verantwortenhaben, oder die da irgendwie mit drinne hängen, wie kann man das am besten beschreiben, wiekann man am besten Stakeholder beschreiben, Stonks Chat, ihr kennt euch mit sowas aus,BWL kram ich nicht, was genau ist die Definition von einem Stakeholder, Person, für die esaufgrund ihrer Interessensanlage von Belangen ist, wie ein bestimmtes Unternehmen sich verhält,Teilhaber, ah ok, Investoren, aber in dem Fall sind es ja gar keine Investoren,ich hätte ja auch gesagt, da sind die, die es verantworten müssen in dem Fall und deswegenhalt auch Interesse daran haben, gut was auch immer, sie sind Vorreiter, die Yoshi Musikpasst da ganz gut zu, sonst wirst du hier komplett verrückt, ok, also sie sind Vorreiter und Botschafterin der Agilisierung, was ein Wort, Agilisierung, Agilisation und eine Persönlichkeit, derenFokus auf People-Business liegt, aktuell ist People-Business aber schlecht, ok, was füreine Zertifizierung brauche ich da, Zertifizierung Agile Coach, weiter Bildung zum ZertifizierenAgile, so eine Scheiße gibt es echt, mein Gott das ist, dieser ganze Bullshit ist einfachnur dazu da, um so einen Geldkreislauf zu generieren, genauso wie dieses ganze ISO,DIN ISO 9001, ITIL, sonstigen Geschiss, Zertifizierungsgedöns, das ist einfach nur da, um so einen Geldflusszu generieren, das sich selbst mit Geld versorgt, ich will nicht sagen, dass es bei den einzelnenModellen nicht sinnvolle Sachen gibt, darum geht es gar nicht, klar, hier steht in ITILauch sinnvolle Sachen drinne, aber dieses ganze Geschäft, was da drumherum gemacht wird,ist einfach, dass sich das ganze System selbst mit Geld versorgt, Scrum an sich ist super,die meisten machen es nicht richtig, genau, die meisten stellen sich mit 15 Leuten hin,labern 45 Minuten jeden Tag, setzen sich nicht dabei hin und sagen wir machen Scrum undwenn du sie fragst, ok, was war jetzt hier dran Scrum, ja, weil wir uns nicht hingesetzthaben, so, normalerweise muss das viel kürzer sein und es muss vor allem auch etabliertwerden, dass es ok ist, wenn man nichts sagt, ok, bla bla bla, Ausbildung und die langjährigepraktische Erfahrung in positiver Psychologie, Big Brain, Alter, jetzt geht es ab und systemischenBusiness Coaching oder vergleichbar wie NLP Master, was zur Teufel ist das, NLP PractitionerCertificate, es gibt in diesem Bereich so unglaublich viel Scheiße einfach, nur das ist der Wahnsinn,mindestens 5 Jahre umfassen theoretisches und praktisches Wissen zu den Frameworks,Scrum, was sonst, was sonst, also komm, mit Zertifizierung mindestens ACSM und CSP, SMist Scrum Master, denke ich mal und SAFE, dass das sagt, ich weiß jetzt nicht wovür es steht,aber das sagt mir irgendwas, SAFE, Scaled Agile Framework, genau, sowie über OKRs undKanban, ok, ich kann eine Tabelle hin und her schieben, von Technologischen Crew, achdu Scheiße, was ein Geschwätze, boah, da kriegst du ja Anfälle, wenn du das liest, ey, Benefits,Teilzeit, wie du das in Teilzeit machen willst, bin ich mal gespannt, Plexible Weiterbildungangeboten, ach du große 9er, meine Güte, die Telekom, Agile Coach, Elsa sagt, habedie Woche auch eine Stelle mit 10 Jahre Go Erfahrung gesehen, oh 10 Jahre Go ist nichtschlecht, Go ist ja mit 8 und gerade mal 10 Jahre alt, am besten ist man noch der Entwickler,genau, man hat es erfunden, jolle gebe ich ja recht, denke ich, wie der größte Schwachsinnüberhaupt, ja, ok, in Frankfurt suchen die anscheinend nichts, da kann man nichts machen,wenn die Telekom nichts sucht, kann man es heute nicht auslassen über die Telekom, Schüler,Studenten, Absolventen, Professionals, ok, Professionals, wir sind Professionals, hastdu schon Agile im Korea TTS, nee, ihre Karriere als Professional, Experten, ok, ich bin Experten,zeig mal her, was empfiehlt mir die Telekom, Auslass, gehen wir fort, ihr könnt mich einfachin Ruhe meine Arbeit machen lassen und mir nicht auf den Sack gehen, wer will denn sowas, ok, das ist so eine typische Sache, wenn das jemand will und er Bock drauf hat, istes gut, dass es das gibt und dann ist es auch schön, dass er das machen kann, aber ausmeiner Erfahrung sind die meisten IT Leute jetzt nicht so die extrovertiertesten Auslandsreise-Fans,um es mal vorsichtig auszudrücken, also die meisten haben schlichtweg keinen Bock draufund ich handele mich auch so, lasst mich doch einfach meine Arbeit machen, geht mir nichtmit zig Bullshit zwischendurch auf den Sack, lasst mich doch einfach meine Arbeit machenund gut ist, Karrierefahrt, ok, Inhouse Consulting, schau mir da, es ist übrigens toll, dass manals Consultant anfängt, also sprich man fängt als Consultant an, also sprich man soll konsultiertwerden zu Problemen und man hat vorher keine Ahnung, also normalerweise müssten hier eigentlichnoch ein paar Schritte davor kommen, so nach dem Motto ok, know how, ich werde Consultantda drinnen, aber nein, ich fange als Consultant an, also ich habe keinen Plan und fange schonmal als Consultant an, genau diesen Eindruck habe ich von unseren Consultants auch, ne,geh fort, geh fort, ja, Junior Consultant, genau, wie gesagt, unser Spezialer Zubi istauch Junior Consultant geworden und da konnte mir in seiner Fachinformatik Ausbildung, derhat einen halben Nervenzusammenbruch gekriegt, wo ich ihn nach Netzwerkgrundlagen gefragthabe und so jemand wird Junior Consultant, was ist, was hast du mir da für Link geschickt,was hast du mir da geschickt, was hast du mir da geschickt, was hast du mir da geschickt,was hast du mir da geschickt, was hast du mir da geschickt, was hast du mir da geschickt,was hast du mir da geschickt, was hast du mir da geschickt, was hast du mir da geschickt,Wir suchen mal nachDas könnte man mal suchenNe wir machen mal was anderesWir machen mal was anderes wir gucken mal nach was ganz klassischemWir gucken mal nach einem administrator nach was ganz klassischemadministration in frankfurt was ganz ganz klassischesUnd mal gucken ob es da irgendwas gescheites gibtHier ist der devops cloud engineer am startWas ganz klassisch okay sachbearbeiter administrationAdministratorHier sollten wir lieber danach suchenEin kubanetes administrator adesso as a serviceIch ich ich ahne ich ahnebuzzwordsUnd eine sache die mir bei diesen ganzen stellenanzeigen immer nicht einleuchtend istWarum übertreiben warum müssen die am anfang immer so eine riesenAbgesangen auf oder so eine riesen lobes hymne auf sich selbst anstimmenDas interessiert doch denjenigen der das jetzt hier grad zum ersten mal liest nicht die bohnedie sollten zum beispiel ganz die sollten vielleichtGanz oben hinschreiben gehalsspanne oder sowas das wäre interessantKuba netes administrator mit begeisterung für infraschung und applikation zur begebungKein blabla sie haben erste praktik als system engineer oder application administrator in projekten mit kubanetes oder einer container plattform gesammeltBegeistert sich für aktuelle cloud plattform technologien sind bereit den defops und seitreliability engineering ansatz tatkräftig zu unterstützen und eng mit jaDann sind sie bei uns genau richtigDiese formulierung die haben sie doch aus irgendeinem buch oderweil man mal ehrlich ist niemandGeht auf eine bewerbung seite und sagt ich würde mir so gern wünschendass ich ein begeistert dass ich dass ich begeistert dass ich mich begeistert also dass ich ein begeisterterAktuell begeben für aktuelle cloud plattform und technologien und ich würde auch so gern defops und seitreliability engineering tatkräftig unterstützenSagt halt keiner das sind sie bei uns genau richtig sie werden teil eines dynamischen teams und helfen mit systemlandschaft unserer kundenzu konzipieren aufzubauenUnd das ist ja alles ok das klingt aber wirklich sehr vorlagen mäßig wie sie das geschrieben haben wir hatten letztens ein paar richtig coole stellen anzeigenIch weiß nicht mehr wo das war die waren wirklichMit brain geschrieben ja also sprich wurde auch was hat es davon wenn du nie gelesen hastUnterstützung bei der vorbereitung von java software artefakten für dieGeht schon gut los hier? Das ist javaEs fängt schon mal gut anDekonikation verteilen von in helm chartsDas ist ja voll angesagt ich wusste gar nicht dass das charts hatHelm chartsAch das ist eine extra geschichte für mit charts dafür oder wasWie gesagt ich wusste nicht dass das das das das das das charts hatOk exzellent chartsDeklaration von infrastruktur komponenten terraform terraform ist voll angesagt aktuellFür aws azure und vmw sphär boar die wollen es aber wissen azure und aws und noch ein bisschen vmwTesten und ausrollen neue softwareStände in enger zusammenarbeit mit teams aus entwicklung. Es ist alles vollkommen ok was die hier wollen jaWobei man sagen muss so rein klassische administration ist es jetzt ja nichtUnterstützung bei der entwicklung von betriebsunterstützenden containern ja okDas ist alles das ist alles in ordnung. Ja ok ihre skillsErfolgreich abgeschleunigt ok immer immer immer das gleiche gute linux und bsJetzt jetzt gehen sie aber in die vollen hierMit bsd kenntnissen wirst du nicht so viele leute finden das kann ich das kann ich euch sagen alsoGut aber kenntnisse sind ja bei manchen leuten auch schonalso wir hatten mal einen der hat gesagt er ist fortgeschritten in also fortgeschrittene kenntnisse in vmwUnd als wir den gefragt haben was er gemacht hat hat er gemeine ubuntu vm installiert jetzt kein witz klingt so als hätte ich esmehr ausgedacht ich weiß aber das war das warum er fortgeschrittene kenntnisse in vmw hatteGrundlegendes verständnis vonNetzwerk protokollen und architekturen tcp ip mplsUnd architekturen tcp ip mplsPeering hab undOk dabei wer ist bei mir schon mal raus was ist hab end spokespoke nabespeiche wasÄhWasOk ab und spoke alles klarIch mein es ist es ist es angeblich ist netzwerk protokoll beziehungsweise netzwerk infrastruktur aber netzwerk architekturIch habe ernsthaft keine ahnung was damit gemeint istVielleicht wollen die mir damit sagen wie man am bestenNetzwerkgeräte miteinanderVerbindet und beziehungsweise wie man das am besten von der architektur her aufbaut dass es ordentlich läuftPro gaming sebi schreibt wenn ich kann das einfach zeigenKubernetes oder docker möchte mir über den sommer eins vielleicht beides anschauen die frage stellt sich gar nicht dockerWenn du wenn du von du wirst du wirst gehoffnungslos gegen die wand fahren wenn du irgendwie was kubernetes mäßig machen möchtest wenn du nichtEin, bisschen linux container grundlagen hast und da ist docker nun mal das das ding was sich durchgesetzt hatAlso das da musst du machen das da und dann später kannst du dir vielleicht ein bisschen das da angucken aber das daAlso docker ist für den heimbereich auch um größten ordnung sinnvoller als dockerEs ist ja gar nicht entweder oderDocker ist für lokal ein bisschen container laufen lassen vielleicht mit docker kompost ein bisschenBis ein bisschen das managen und kubernetes ist eher so orchestrierungsgeschichte von container also die frage ist gar nicht entweder oderSondern in deinem fall wenn du sagst was du lernen sollst docker ganz klar das da zuerst und danach dasHast du das schon gesehenHast du das schon gesehenNe was ist dasMir d rocket kill nicht yummyMoment, die, die, die lassen ihr JavaScript von, von Web Archive Org aus liefern?Sehe ich das richtig?Das ist ja Big Brain, dann spart man sich Traffic.Das ist, das ist ja, dass da nicht noch schon mehr drauf gekommen sind.Das ist Big Brain, was ist das für Traffic?Das muss man sich sparen, Alter.Der Support checkt's nicht.Ah, okay, okay.Okay, jetzt hast du auch gecheckt, alles klar.Das ist ja toll.Lustig.Nice.Ähm, okay, das liest sich alles, das liest sich alles relativ normal, was die hier habenwollen.Auch keine komischen Sachen zwischendrin, dass du noch Projektmanagement und First-Level-Supportmitmachen sollst, wie bei anderen Sachen.Leute, in drei Wochen hab ich meinen Azure DevOps Fünf-Tage-Kurs, ja?Und danach bin ich, äh, abgecradet, der Hacker-Mann.Oh guck mal, Zwei-Faktor-Authentifizierung reicht nicht mehr.Die brauchen Zwölf-Faktor-Authentifizierung.Ja, der AZ-900 ist übelst Resident-Sleeper gewesen und ich geh davon aus, dass der DevOps-Kursauch Mega-Resident-Sleeper wäre, wird.Ich weiß, dass damit nicht Zwölf-Faktor-Authentifizierung gemeint ist, aber es liest sich wie Zwölf-Faktor-Authentifizierung,oder?Ja, jetzt hier, Big-Big-Brain, was wollen sie hier haben?Der Karton-Plast, was, die Karton-Plast-Gruppeier, ok, also, das erwartet sie, First- und Second-Level-Anwendungssupport,ok, Instant-Range-Quit, Winners 10 Office 356 Drucker, die werden, oh Gott, Instant-Range-Quit,Second-Kundensupport, nein, nein, nein, nein, nein, Leute, äh, wie viele Stunden arbeitestdu die Woche?Das ist eine gute Frage, ich kann's dir nicht sagen, also, äh, irgendwie siebeneinhalb Stundenoder so am Tag, siebeneinhalb Stunden mal vier, mal sieben mal vier, 30, irgendwie keine Ahnung,32 Stunden oder so, 30 Stunden, irgendwie so, 30 Stunden, arbeite ich.Ok, die suchen wirklich, das finde ich cool, dass es das überhaupt noch gibt, die suchenwirklich so den ganz klassischen Drucker-Anschließer, Kleines, also Drucker scheinen sehr wichtigzu sein, weil Drucker haben die sogar zweimal drin stehen.Ach, und nebenbei machst du noch Monitoring der gesamten IT-Infrastruktur, alles klar.Ok, geht doch.Wie hast du die 30 Stunden verhandelt, Kondition gleichgeblieben, äh, naja, ich krieg wenigerGeld, weil ich anstatt 38 Stunden oder so nur noch 30 Stunden arbeite, naja, klar,dass ich nie die gleiche Kohle krieg wie vorher, ist ja klar, wenn, wäre natürlich noch vielbesser, ja, aber es ist nicht so, aber ansonsten hat sich nix geändert, genau das gleiche,bloß einfach weniger Stunden, die Z-Bank, was wollen die, was, was ist, was ist F-C-S-I,Ach, das heißt so bei denen, ok, First- und Second-Level-Support im Rahmen F-C-S-I, Administrationmit Admin Gui und Saga, die erwarten doch nicht ernsthaft, dass irgendjemand, was istdas, Server, Age of Conan, alles klar, die erwarten doch nicht immer, dass das jemandkennt, Planung und Umsetzung der System-Release-Wechsel, technische Beratung bei RT, Strukturfragen,Analyse-Optimierung, das liest sich alles, heute ist wenig Trash dabei, also das liestsich alles relativ realistisch, ja, aber wir müssen eher bei den krassen Start-ups gucken,oh je, oh je, das ist ein Bullshit-Shop, das sieht man sofort schon, gar nicht mal vonder Beschreibung her, aber Admin Mann im Krankenhaus, ich glaube da hast du keinen Spaß, bist umgebenvon technisch unfähigen Leuten wahrscheinlich und es ist auch noch wichtig, was du machst,sonst kratzen Leute ab, das würde ich mir nicht geben und es wird wahrscheinlich auchnoch schlecht bezahlt, also das würde ich mir nicht geben, in Offenbach, ob da Haftbefehltschonmal drin gewesen ist, ok, was macht man hier, sicherstellen des User-Supports, ok,die wollen einen, der alles macht, ich sehe schon, Administration der Rechner und Server-Systemesicherstellen des User-Supports bezüglich Hardware-Betriebssystems, Office-Umfeld, Meld-Line,boah, fuck, du musst ja echt alles machen, Planung, Durchführung, Verwaltung, regelmäßigerBackup, Beschaffung, Konfiguration, Installation, Neuer, ok, du machst alles, du machst allesIT, du machst komplett alles IT, so wie es aussieht, Betreuung, Installation von Softwareund systemnahe, was, Betreuung von Installation von Software und systemnahe Software, Überwachungund Portikulierung der Funktionsfähigkeit der Server und der aktiven Netz, Ach, Netzwerk-Infrastrukturmachst du auch noch mit, Beseitigung aufgetretener Störungen gemeinsam mit Soft- und Hardware-Lieferanten,auch noch, Überwachung und Wartung der passiven Netzwerk, Netzwerk-Monitoring machst du auchnoch, verstehe, Betreuung, Wartung, Austausch und Neueinsatz, Ach, Endkundensupport und Aufbauder Arbeitsplätze machst du auch noch, Unterstützung der Anwender bei Softwarenutzung, also Supportund Office erklären auch noch, Pflege, die Homepage machst du auch noch, Benutzer undE-Mail-Kontenverwahl, ok, Mail-Administrator machst du auch noch, EigenverantwortlicheErstellung von firmenspezifischen Auswertungen, what the fuck, was soll denn das geben, wennes fertig ist, also ja, das kann alles ein Administrator machen, aber das ist vielleichtein bisschen viel für einen Administrator, was hat der 400 Wochenstunden oder was, ok,also was wollen sie haben, gute Kenntnis im Bereich der Windows-Betriebsstelle, da binich schon mal raus, da bin ich schon mal raus, also nicht, dass ich das jemals freiwilligmachen würde, dazu müsste ich irgendeine Straftat begehen und zu gemeinnütziger Arbeitverurteilt werden und das Gericht müsste irgendwie anordnen, dass ich das machen muss,damit ich das machen würde, unter Androhung von Knast, sonst würde ich das nicht machen,das würde ich lebendig machen hier, Kenntnisse im Netzwerkbereich, TCP-IP, Warn-Lan-VPN,Eigenverjagte, Bereitschaft zu teamorientierter Arbeitsstil, wieso teamorientierter Arbeitsstil,du machst doch alles selbst, welches Team, du brauchst ja noch kein Team mehr, du machstdoch alles, Erfahrung mit Datenbanken auch noch, das ist ein Ger, das muss ich mir inden Kopf machen, das ist was, was ich flamen kann, sehr gute Deutschkenntnisse, Diskretionund Loyalität, das ist zu einem gewissen Grad kaufbar, würde ich mal behaupten, also sprich,wenn das Gehalt gut ist, dann ist Diskretion und Loyalität sicherlich auch gut, wenn dasGehalt ein Apel und ein Ei ist, dann kann ich mir vorstellen, dass es manche mit Diskretionund Loyalität nicht so ernst nehmen, Einsatzbereitschaft, Motivation, Flexibilität im Aufgabenbereich,das heißt, du darfst doch ab und zu mal die OP, den OP-Tisch putzen oder wie, Grundeinstellungzur nächsten Ebe und mittragen, mittragen, mittragen, mittragen, mittragen, mittragen,mittragen, michael 50 Billiardenbeutel, mittragen viel besser, unseres Leitbildes, was ist denneuer Leitbild, Leitbild, steht nirgendwo, was euer Leitbild ist, was ist denn euer Leitbild,Grundeinstellung zur nächsten Ebe, Leute wisst ihr was, ich finde diese drei Worte, ich findedie wirklich gut, also sowas könnten die gerne mehr auch noch bei anderen Stellenanzeigenirgendwie reinpacken, ich finde eine Grundeinstellung zur nächsten Ebe finde ich nicht verkehrt,ich meine gut klar hier geht es ums Krankenhaus oder so, aber das ist ein Job, den ich imLeben nicht machen würde, aber diese drei Worte, die kommen hier finde ich eigentlichnicht schlecht, diese Einstellungen sollten mehr Leute haben, der Q-Chat, genau, so wirbieten, Leistungsgerechte Vergütung nach dem gültigen Tarifvertrag AVR, ja, welche Stufe,welche was, Tarifvertrag AVR, gucken wir mal, what the fuck, was, ja welches davon ist es,Mitarbeiter im Pflegedienst, aber das ist doch kein Pflegedienst, äh, drei, what the fuck,was ist das für ein Rechner, das ist doch kein Gehaltsrechner, das ist eine fertigeTabelle, zum Rechner, Hessen, wo ist Hessen, Alter wer hat diese Seite wieder gemacht,ich mache jetzt einfach mal das da auf, ist egal, Geburtsjahr, ok, 1984, was weiß ich,ok, das kann ich nicht ausrechnen, also ich muss ehrlich sagen, wir bieten Feld wirklichsehr, ähm, zurückhaltend aus, ja, ich meine sie bieten Geld, das ist ja schonmal die Grundvoraussetzungdafür, dass man da überhaupt jemand dran denkt, da zu arbeiten, dass sie, ja, regelmäßigfreundlich und kollegial ist, da habe ich so meine Zweifel, ich könnte mir vorstellen,dass da ziemlich oft Stress und dicke Luft ist, das ist Krankenhaus, da willst du nichtarbeiten, ihre Aussage kräftige Bewerber, das ist so ein Ding, wo es mir irgendwie inden Fingern juckt, einfach mal zu fragen, was es für Geld gibt, das interessiert michbrennend, was es da für Geld gibt, das Problem ist, ich kann da nicht einfach fragen, wobeiwarum eigentlich nicht, wie gesagt, ich will es auf keinen Fall machen, mich interessiertaber echt einfach mal, was es da für gibt, ich könnte wetten, es gibt nichts, es gibtirgendwie 30k im Jahr oder so, es wird wahrscheinlich nichts, das Punkt mag ich mir mal, ich glaube,ich schreibe da echt mal eine E-Mail hin, was es da, was es da so für Gehaltsaussichtengibt, wahrscheinlich 25k oder sowas, na ich kann mich da nicht bewerben, da müsste bewerbungschreiben, ich glaube es geht los, außerdem will ich mich da gar nicht bewerben, ich willeinfach mal, hast du schon mal die Website, ok, die gucken wir uns jetzt an, Cat TillerKrankenhaus, Offenbach, oh Schlaflabor, 1995 klopft an,1995 guckt vorbei, will seine Website wieder haben, eine Babygalerie haben sie, immerhin,immer edlische Babys, aber das ist wirklich 1995, hat angeklopft und will die Websitewieder haben, Internationalpatient, ok, ich muss erstmal ranzoomen, ok, jetzt wisst ihrauch, warum die jemand suchen, die sich um den Web auftritt, das Internet, warum diejemand suchen, der sich um die Website kümmert, oh das Leitbild, das ist ja das, was wir wissenwollten, oh da gibt es ein Video zu, liebe Lindert Leiden, man darf nicht mal spulen,what the fuck, ah, spulen, nicht erlaubt, denied, ok, das muss man jetzt nicht geben,was ist denn die Babygalerie, naja wahrscheinlich neu geborene Babys, die da im Krankenhausauf die Welt gekommen sind oder so, spulen und gleich Nächstenliebe, das stimmt, ichfinde ein bisschen mehr Nächstenliebe beim Videoplayer hätte nicht verkehrt geschadet,ok, ich will jetzt nicht zu sehr flamen, weil die haben kein Budget, die kriegen auch keinBudget, die sind wahrscheinlich komplett am Limit, die haben, die kommen nicht hinterherund die brauchen irgendeinen, der sich um die IT kümmert und haben keine Geld, ihnzu bezahlen, wofür sie auch nicht so wirklich was können, also mich interessiert echt brennend,was man da kriegt, ich glaube ich frag die einfach mal, ich glaube ich schreibe da einfachmal eine Mail hin, was mich interessieren würde, was man da so bekommt, ob das nochim Tarif hat, welche Stufe man bekommen könnte, das würde mich echt interessieren, weilich wette, ich könnte wetten, das ist saumäßig wenig, 30k, 25k oder sowas, was letzte Preisschreibe ich dann in die Mail rein, genau, was letzte Gehalt, ja, 25k nicht bisschenarg wenig, doch, natürlich ist das arg wenig, aber ich glaube es wird arg wenig sein, dienicht augen klinik, aha, ja gut, das passt ja schon mal dazu, oder, guck mal, Hyper-Vmachen die, fundierte Kenntnis im Bereich, das ist wieder irgendwas, was die Personalfraugeschrieben hat und man ihr gesagt hat, schreibe das rein, ja, plopsrusher, ich hab irgendwasgesagt, was halt wenig ist, es ist wahrscheinlich unglaublich wenig, was du kriegst, deswegeninteressiert es mich ja auch, noch mehr, SAP, SAP, jetzt hört er gar nicht mehr auf, SAP,der Wetteraukreis, Moment, da war jemand mit dem Feuerlöcher, nee, das ist was ganzwas anderes, Moment, das stimmt überhaupt nicht, ja, it's public administration, zuviel SAP überall, soll ich eine Mail schreiben, wenn du willst, ja, das kannst du dir überlegen,ob du das machst, ich stifte keinen dazu an, die irgendwie zuzuspermen jetzt, nicht dassdu es dir mit dem Kettler Krankenhaus verscherzt, ich schreibe ja nicht alle ihr Spasten wasletztes Gehalt, schreibe da eine ganz normale Mail hin, wie soll ich mir da mit denen verscherzen,so plus line, von denen hab ich schonmal was gehört, ich glaub die machen bei uns irgendwas,manage services, ich glaub die managen irgendwas für uns, blablabla, mit einem echten Interessefür Linux und Open Source, ok, das wäre ja schonmal was für mich, wenn sie mit der KommandoZeile an und dem Editor bereits sicher umgehen können, exellent, sie suchen jemand wie, fürapache MySQL Postfix, wir machen sie vertraut mit o-wirt, kvm, da fehlt ein Komma, vmwir,kvmstack, sie nutzen aktuellste wie Puppet Ansible, Ichinga, nein ich mag oldschool Nagios,Nagios beste, Grafana, Elastic Search, Logstash, Kibana, das, dass, dass die coolen Leute sagen,das ist Elk, Elastic Search, Logstash, Kibana klingt zu doof, deswegen ist der Elk Stack,weil besser, Spacewalk, das verwendet noch jemand, der hat mal einen ehemaligen Dokumentator,der hat immer gesagt, der Spacewalk, der konnte Spacewalk nicht aussprechen, hat immer aufhessisch gesagt, der Spacewalk, das ist aber schon ewig her, da hatten wir selbst nochSpacewalk, Spacewalk ist für Redhead so ein Management-Frontend, Web-Frontend, wo duein bisschen Redhead-Systeme rudimentär mitmanagen kannst, nicht mal rudimentär, kannst du relativviel mitmachen, Spacemark, Forman, Catello, Catello hab ich noch nie gesehen, dass dasjemand einsetzt, Forman ist für Puppet so ein Web-Frontend, ja gut, das klingt docheigentlich ganz ok, wir bieten an, steile Lernkurve, ob das jetzt so eine gute, ob dasso toll ist, was man anbietet, ich finde das ist gar nicht schlecht geschrieben, ganz ehrlich,warum nicht, Musik ist aus, warum ist die Musik aus, oh Support, Ellenville Hair Company,klingt ja schon wieder absolut Big Brain, oh das ist Mode, Mode Zeug, the Frazier, eydas wäre glaube ich der optimale Job, mal angenommen man hätte Friseur gelernt unddann Fachinformatiker, dann wären wir hier richtig gut aufgehoben, Ratbacher, hier wahrscheinlicheher Ratbacher, das ist, die Experten-Frontend ist das irgendein Personalverschacherungs-Dingoder, ja das ist irgendein Personalverschacher-Typ, das denn, Sopra, Patenprogramm, ok du hastpermanent einen bei dir, der dir auf den Sack geht, Beratung als Reisen, IGIT, gefahrt,aber heute ist gar nicht so viel Mist dabei gewesen, war das schon in der Windows 2008,ernsthaft, im Moment wo war mal, hier, Redhead 6, fuck alter, Redhead 6, ist ja antik, 7 wirdnoch Supported, 2008 keine Ahnung ob das noch Supported ist, aber das ist auch schonganz schön alt und jünger, ok, man hätte auch neuer schreiben können, was haben diesonst noch, Apache, Apache Reverse Proxy, JBoss, IES, SVN, ok die sind oldschool unterwegs,Erfahrung mit der Programmiersprache, SQL, Bash, CMD, IGIT, MySQL, MSSQL, Oracle, ja,also die bekannte Programmiersprache, MSSQL, MySQL und Oracle, aber SVN ist das beste,also Reise, Reisegeschichten, das würde ich schon aus dem Grund nicht machen, erfahr,was unsere Aufgaben, deine Perspektive, Erfahrung im technischen Betrieb von teils hoch verfügbarenFachleuten, ja was, sind das jetzt unsere Aufgaben oder meine Perspektiven, also wassoll dieser Satz sagen, dass die Erfahrung haben im technischen Betrieb von, wer hatdas, wer hat das nicht im Administrationsbereich, die meisten Sachen sollen 24 7 verfügbarsein, die Betonung liegt auf Säulen, du sollst das haben, ok, aber dafür gibt es ja unsereErwartung, deine Fähigkeiten, ok, was auch immer, oh, so viel Keck weh, so Leute, wiegesagt, war heute etwas planloser, spontan stream, eineinhalb Stunden, ich bin einfachmorgen gekommen, es gab ja nichts, ich hatte nichts großartig vor, aber es war trotzdemschön, dass so viele Leute dabei waren, exzellent, ich denke mal wir sehen uns morgen, Nachmittagoder so wieder, ich habe nämlich wirklich mal Bock drauf, wieder ein paar Stunden Battlefield3 zu spielen, vielleicht auch im Stream machen, vielleicht machen wir noch ein bisschen TechnikKram morgen, müssen wir mal gucken, und ich würde sagen Chat, wir sehen uns, machts gut,bis zum nächsten Mal, tschüss.", "segments": [{"id": 1, "start": 90.0, "end": 96.5, "text": "be conééééééééééééééééééééééééééééé!!!!"}, {"id": 2, "start": 120.0, "end": 125.0, "text": "Die ganze Zeit ist es nicht mehr so."}, {"id": 3, "start": 125.0, "end": 130.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 4, "start": 130.0, "end": 135.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 5, "start": 135.0, "end": 140.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 6, "start": 140.0, "end": 145.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 7, "start": 145.0, "end": 150.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 8, "start": 150.0, "end": 155.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 9, "start": 155.0, "end": 160.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 10, "start": 160.0, "end": 165.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 11, "start": 165.0, "end": 180.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 12, "start": 195.0, "end": 200.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 13, "start": 225.0, "end": 230.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 14, "start": 255.0, "end": 260.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 15, "start": 285.0, "end": 290.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 16, "start": 315.0, "end": 320.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 17, "start": 330.0, "end": 335.0, "text": "Die ganze Zeit ist jetzt auch damit."}, {"id": 18, "start": 335.0, "end": 340.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 19, "start": 340.0, "end": 344.0, "text": "Ich bin schon mal wieder in der Nähe."}, {"id": 20, "start": 344.0, "end": 348.2, "text": "Aber das ist so ein Kandidat, der immer diskutiert. Immer. Wegen jedem Scheiß, ja."}, {"id": 21, "start": 349.5, "end": 355.3, "text": "Kennen ihr, kennen ihr so Leute, die wirklich von, aus, von bei allem irgendeine Diskussion vom Zaun brechen?"}, {"id": 22, "start": 357.3, "end": 361.0, "text": "So nach dem Motto, ich hab ne Tasse, da ist der Henkel links und ich hab ne Tasse, da ist der Henkel rechts."}, {"id": 23, "start": 361.9, "end": 366.0, "text": "Ist der jetzt links oder rechts? Vielleicht ist der sogar in der Mitte? Die müssen wegen allem die Diskussion vom Zaun brechen, ja."}, {"id": 24, "start": 366.0, "end": 374.0, "text": "Ja, die labern, ja, das stimmt, das stimmt."}, {"id": 25, "start": 375.0, "end": 382.0, "text": "Gut, so, so, so Stonks BWL, so Stonks BWL Consultant-Typen haben wir auch."}, {"id": 26, "start": 383.0, "end": 385.0, "text": "Die kriegen ja eh Geld, wenigstens nur fürs Labern."}, {"id": 27, "start": 386.0, "end": 393.0, "text": "Aber wenn du Technik, IT, Experten, beziehungsweise Consultant-Leute holst."}, {"id": 28, "start": 393.0, "end": 401.0, "text": "Der Name Consultant suggeriert ja irgendwo, den fragt man zu Sachen, wo man selbst keine Ahnung hat."}, {"id": 29, "start": 405.0, "end": 408.0, "text": "Aber dass diese Sache nicht der Fall ist, war mir schon eigentlich von Anfang an klar."}, {"id": 30, "start": 409.0, "end": 415.0, "text": "Und das beste Beispiel für mich, warum das nicht der Fall ist, ist unser Spezialazubi, von dem ich euch schon öfters mal was erzählen hab."}, {"id": 31, "start": 415.0, "end": 423.0, "text": "Also der, der so gar keinen Plan hatte. Der, der einen halben Nervenzusammenbruch hatte, wo ich ihn nach Netzwerkgrundlagen gefragt hab."}, {"id": 32, "start": 424.0, "end": 430.0, "text": "Genau der. Der ist ja dann weg bei uns nach der Ausbildung, weil ihn keiner haben wollte."}, {"id": 33, "start": 431.0, "end": 440.0, "text": "Und was ist er geworden? Junior Consultant. Mir fällt wirklich kein einziges Thema ein, bei was ich den konsultieren würde."}, {"id": 34, "start": 440.0, "end": 442.0, "text": "Mir fällt wirklich nichts ein, bei was ich den fragen würde."}, {"id": 35, "start": 443.0, "end": 447.0, "text": "Das einzige Talent, was der hat ist, das ist der mit C-Lattenzaun. Genau."}, {"id": 36, "start": 448.0, "end": 453.0, "text": "Der, der statt C-Sharp gesagt hat, das würde C-Lattenzaun heißen. Genau der ist das."}, {"id": 37, "start": 457.0, "end": 459.0, "text": "C-Lattenzaun. Genau der ist das."}, {"id": 38, "start": 459.0, "end": 469.0, "text": "Und der schon nicht geschafft hat, einen Body-Mass-Index zu programmieren."}, {"id": 39, "start": 471.0, "end": 473.0, "text": "Das waren Übungsaufgaben und das hat man ja dann hingekriegt."}, {"id": 40, "start": 474.0, "end": 476.0, "text": "Und irgendwann hat er gesagt, Max, es funktioniert. Max, es funktioniert."}, {"id": 41, "start": 477.0, "end": 480.0, "text": "Und im Endeffekt meinte er halt, es kompiliert."}, {"id": 42, "start": 482.0, "end": 484.0, "text": "Naja."}, {"id": 43, "start": 484.0, "end": 488.0, "text": "Nix wissen, Kohle schäffeln. Ja, ist echt so."}, {"id": 44, "start": 489.0, "end": 495.0, "text": "Max, was hältst du davon, wenn Workstations alle Mitarbeiter durch VMs auf einem Server ersetzen?"}, {"id": 45, "start": 496.0, "end": 498.0, "text": "Nix."}, {"id": 46, "start": 499.0, "end": 505.0, "text": "Der Mitarbeiter hat also nur eine ArtKVM-Box auf dem Tisch mit. Kann das flüssig funktionieren?"}, {"id": 47, "start": 505.0, "end": 513.0, "text": "Also, theoretisch schon. Praktisch, nun ja."}, {"id": 48, "start": 517.0, "end": 519.0, "text": "Also, ich würde den Unterschied sofort merken."}, {"id": 49, "start": 520.0, "end": 527.0, "text": "Irgendwelche Noobs, die halt absolut nix checken, was Input-Lag und Responsiveness angeht,"}, {"id": 50, "start": 527.0, "end": 534.0, "text": "die nicht, aber ja, man merkt das auf jeden Fall. Es gibt ja da verschiedene Varianten."}, {"id": 51, "start": 535.0, "end": 542.0, "text": "Es gibt einmal diese Zytrex-Geschichte, die auch Grafikkartenbeschleunigung kann."}, {"id": 52, "start": 543.0, "end": 553.0, "text": "Und es gibt diese von Microsoft, diese Hyper-V-Geschichte, die auf RDP basiert, wo auch Grafikartenbeschleunigung ist."}, {"id": 53, "start": 553.0, "end": 561.0, "text": "Also, das ist quasi ein RDP, der allerdings irgendwie auch für die VMs eine GPU durchreichen kann."}, {"id": 54, "start": 562.0, "end": 566.0, "text": "Das geht nur Hyper-V-mäßig. Und ich hab vergessen, wie das heißt."}, {"id": 55, "start": 567.0, "end": 574.0, "text": "Und dann kann man dort auch über RDP 3D-Anwendungen benutzen und sowas."}, {"id": 56, "start": 574.0, "end": 584.0, "text": "Also, die Chance, es geht, es geht. Man darf nicht vergessen, im Endeffekt, wenn sowas wie Game-Streaming geht, dann geht auch sowas."}, {"id": 57, "start": 586.0, "end": 592.0, "text": "Also, wenn du Game-Streaming kannst, dann geht auch ein lag-freier Desktop. Das ist wahrscheinlich sogar noch einfacher."}, {"id": 58, "start": 593.0, "end": 600.0, "text": "Allerdings, ich bezweifle, dass die das richtig machen und wahrscheinlich eher nicht."}, {"id": 59, "start": 600.0, "end": 607.0, "text": "Ich bezweifle, dass die das richtig machen und wahrscheinlich eher sparen wollen, dadurch, dass sie die Workstations ersetzen."}, {"id": 60, "start": 610.0, "end": 613.0, "text": "Also, ich glaube nicht, dass es gut funktioniert."}, {"id": 61, "start": 615.0, "end": 620.0, "text": "Ich glaube nicht, dass das gut funktioniert. Also, bei uns, wir haben so eine ganz primitive Geschichte."}, {"id": 62, "start": 620.0, "end": 629.0, "text": "Also, quasi eine Windows-VM, wo man per RDP drauf geht. Und das ist halt laggy as fuck, ne?"}, {"id": 63, "start": 632.0, "end": 639.0, "text": "Also, der Unterschied zwischen lokal installiertem Windows und, na, vor allem mit RDP ist halt riesig."}, {"id": 64, "start": 639.0, "end": 649.0, "text": "Wenn es dieses spezielle GPU-Pass-Through-Hyper-V-RDP-Extension-Ding ist, dann ist es okay. Dann ist es ein bisschen wie Game-Streaming, würde ich mal sagen."}, {"id": 65, "start": 652.0, "end": 659.0, "text": "Aber Game-Streaming funktioniert ja auch nur so flüssig, weil es halt eine GPU durchgereicht ist. Auf der anderen Seite."}, {"id": 66, "start": 661.0, "end": 664.0, "text": "Also, ich glaube nicht, dass es gut funktioniert."}, {"id": 67, "start": 664.0, "end": 669.0, "text": "So, Runde T einschenken. Excellent."}, {"id": 68, "start": 677.0, "end": 685.0, "text": "Und gerade wenn man Windows hat, dann machen die doch eh alle möglichen Sachen über Regel im AD. Dann kann man doch auch Workstations behalten."}, {"id": 69, "start": 685.0, "end": 693.0, "text": "Also, ich könnte mir vorstellen, dass es einfacher ist von der Verwaltung. Und ich könnte mir vorstellen, dass es auch spart..."}, {"id": 70, "start": 694.0, "end": 698.0, "text": "Zockst du Hyper? Was ist denn Hyper? Ach, das ist das Ubisoft Battle Royale. Hab ich noch nicht angeguckt."}, {"id": 71, "start": 699.0, "end": 705.0, "text": "Ich hab mir nur mal einen Stream heute angeguckt. Ich finde, das sah auf den ersten Blick gar nicht mal so doof aus. Aber kann ich noch null zu sagen."}, {"id": 72, "start": 705.0, "end": 716.0, "text": "Ja, wie gesagt, ich glaube, das spart Kosten. Und es ist einfacher zu verwalten. Allerdings die Frage ist, wie weit das wirklich Kosten spart, wenn die Mitarbeiter den ganzen Tag lecken."}, {"id": 73, "start": 717.0, "end": 719.0, "text": "Weiß man nicht."}, {"id": 74, "start": 720.0, "end": 725.0, "text": "Oh, habe hier noch meinen. Moment, Moment. GIF."}, {"id": 75, "start": 725.0, "end": 749.0, "text": "Wie ging das mit dem GIF? Muss man GIF starten? GIF. GIF. Ach nee, das hatten wir auf dem anderen. Das Allerwichtigste. Also, ohne GIF im Terminal geht da nichts."}, {"id": 76, "start": 749.0, "end": 762.0, "text": "Hast du das mit Wreckful mitbekommen? Ja, hat mich mitbekommen. Da gibt es ja eigentlich keinen Weg dran vorbei, das nicht mitzubekommen, wenn man ein bisschen sich da umguckt online."}, {"id": 77, "start": 763.0, "end": 770.0, "text": "Heute irgendwas geplant? Nee, ich bin ja auch noch eineinhalb Stunden da. Ich komme mal on. Ich komme einfach mal on."}, {"id": 78, "start": 770.0, "end": 791.0, "text": "Ah, hier, hier. Perfekt. Wo ist das? Wo ist das Paper, please? So, jetzt haben wir das Wichtigste, Leute. Jetzt haben wir das Wichtigste da."}, {"id": 79, "start": 791.0, "end": 799.0, "text": "Jetzt ist das Wichtigste da. Exzellent. Wie im Titel steht."}, {"id": 80, "start": 799.0, "end": 816.0, "text": "Ja, genau das habe ich vermutet, dass es laggy ist. Wie gesagt, die meisten bauen dir da nicht die ordentliche Geschichte auf."}, {"id": 81, "start": 816.0, "end": 830.0, "text": "Also da, wo du halt auch GPU hast in der VM, wo du LDP Extensions für 3D Beschleunigung hast oder gar sowas in der Richtung, wie man eben beim Game Streaming macht, sondern die machen halt eine billige Geschichte VM und LDP."}, {"id": 82, "start": 831.0, "end": 836.0, "text": "Und das ist halt laggy wie Sau. Da kommst du dir vor wie 1990. Schlechter."}, {"id": 83, "start": 836.0, "end": 852.0, "text": "Ein Raspberry Pi ist heute ankommen. Was hast du denn vor? Begrünen wir es? Na ja, dann lockst du dich halt daheim remote ein und kopierst dir den Code, wenn du willst."}, {"id": 84, "start": 853.0, "end": 861.0, "text": "Also wenn einer was klauen will, klaut er auch was. Man sollte vielleicht eher gucken, dass man Leute hat, die nichts klauen. Das ist bei uns auch so."}, {"id": 85, "start": 861.0, "end": 878.0, "text": "Wir haben überall übertriebene Berechtigung. Wir verwenden ja auf der Arbeit als Ticketsystem das hier. Das ist also eines der bekannteren. Hier, die Dinger da."}, {"id": 86, "start": 878.0, "end": 890.0, "text": "Hira. Es heißt übrigens wirklich Hira. Aber die richtig coolen Leute sprechen natürlich Jaira aus. Was übrigens komplett falsch ist. Ja."}, {"id": 87, "start": 891.0, "end": 899.0, "text": "Jaira. Es heißt nicht Jaira. Es heißt Hira. Hira. Es heißt es. Was? Haira? Nein, Haira. Nein, es heißt Hira. Das ist Japanisch."}, {"id": 88, "start": 899.0, "end": 908.0, "text": "Es heißt wirklich Hira. Zumindest. Ja, heißt es. Das sagen die sogar."}, {"id": 89, "start": 908.0, "end": 928.0, "text": "Japanisch Namen für Godzilla. Zumindest. Bei uns ist es so. Die übertreiben es komplett mit Berechtigung."}, {"id": 90, "start": 928.0, "end": 943.0, "text": "Also es geht sogar so weit, wenn ich ein Ticket habe, wo ich Bearbeiter bin und stelle fest, das ist bei mir falsch und verschiebe das in einen anderen Bereich, wo es richtig ist, dann kann ich das Ticket nicht mehr abgeben."}, {"id": 91, "start": 944.0, "end": 952.0, "text": "Weil ich in dem anderen Bereich ja keine Berechtigung habe überhaupt Tickets zu bekommen. Allerdings habe ich das Ticket ja noch, weil ich es zuerst in meinem Bereich hatte und dort das Ticket bekommen habe."}, {"id": 92, "start": 952.0, "end": 960.0, "text": "Das ist wirklich Big Planet und bei uns sind die Berechtigungen so wir, dass solche Sachen laufend auftreten."}, {"id": 93, "start": 961.0, "end": 968.0, "text": "Wenn neue Mitarbeiter anfangen, dauert das erst mal drei Wochen bis sie Zugriff über Allhaut drauf haben. Das ist so lächerlich."}, {"id": 94, "start": 969.0, "end": 979.0, "text": "Normalerweise würde ich erwarten, gerade wo die sich immer überschlagen von wegen, wir haben so geile Prozesse umgesetzt und sich selbst voll abfeiern, frage ich mich, wie es sein kann."}, {"id": 95, "start": 979.0, "end": 984.0, "text": "Warum gibt es dann keinen Mitarbeiter-Check-In-Prozess, dass es nicht so drei Wochen dauert."}, {"id": 96, "start": 985.0, "end": 989.0, "text": "Das ist nicht sonderlich agil."}, {"id": 97, "start": 1002.0, "end": 1004.0, "text": "So ist man nicht agil."}, {"id": 98, "start": 1004.0, "end": 1008.0, "text": "Und da bringt Jyra auch nichts."}, {"id": 99, "start": 1009.0, "end": 1011.0, "text": "Wie gesagt, da ist Jyra."}, {"id": 100, "start": 1012.0, "end": 1014.0, "text": "Und die haben schon so eine ekelige Seite, wenn ich das sehe."}, {"id": 101, "start": 1015.0, "end": 1025.0, "text": "Also mittlerweile ist es ein bisschen so, wenn einer will, dass sein Zeug verschimmelt, dann muss er es in irgendwelchen Atlassientools ablegen, dann findet es keiner mehr bei uns."}, {"id": 102, "start": 1026.0, "end": 1029.0, "text": "Das geilste ist, wir haben Teamnamen."}, {"id": 103, "start": 1029.0, "end": 1033.0, "text": "Also keine Ahnung, ich denke mir jetzt mal einen Teamnamen aus."}, {"id": 104, "start": 1034.0, "end": 1037.0, "text": "Sagen wir mal, wir hätten ein Team Software-Bereitstellung."}, {"id": 105, "start": 1038.0, "end": 1039.0, "text": "Haben wir nicht? Ich mache das ja ein bisschen anonym."}, {"id": 106, "start": 1040.0, "end": 1043.0, "text": "Aber theoretisch angenommen, wir hätten ein Team, was sich Software-Bereitstellung nennt."}, {"id": 107, "start": 1044.0, "end": 1053.0, "text": "Und man möchte ein Ticket aufmachen, im Ticketsystem, weil man auf seine Windows-4M-Foreverplayer braucht."}, {"id": 108, "start": 1054.0, "end": 1056.0, "text": "Zum Beispiel."}, {"id": 109, "start": 1056.0, "end": 1064.0, "text": "Da würde man ja von ausgehen, du gehst ins Hierer rein, machst ein Ticket auf bei einem Bereich, der heißt wie das Team."}, {"id": 110, "start": 1065.0, "end": 1077.0, "text": "Bei uns sind es allerdings Massive Big Brain und das Jyra-Team oder Atlassient-Team benennt die Gruppen im Hierer anders, wie die Gruppen wirklich heißen."}, {"id": 111, "start": 1078.0, "end": 1079.0, "text": "Das ist der Wahnsinn."}, {"id": 112, "start": 1080.0, "end": 1082.0, "text": "Also dann heißt das Team eigentlich Software-Bereitstellung."}, {"id": 113, "start": 1082.0, "end": 1091.0, "text": "Auf dem Organigram heißt es dann ITSW-DEF oder so."}, {"id": 114, "start": 1092.0, "end": 1097.0, "text": "ITSW-DEP, das muss überall anders heißen."}, {"id": 115, "start": 1098.0, "end": 1101.0, "text": "Und im Hierer heißen sie dann nochmal ganz anders."}, {"id": 116, "start": 1101.0, "end": 1114.0, "text": "Da heißen sie dann SWITPLUB, keine Ahnung."}, {"id": 117, "start": 1115.0, "end": 1119.0, "text": "Man findet nichts bei uns, das ist so geil."}, {"id": 118, "start": 1120.0, "end": 1121.0, "text": "Du kannst dich auf nichts verlassen."}, {"id": 119, "start": 1122.0, "end": 1128.0, "text": "Wenn du den Team-Namen weißt, findest du ihn nicht im Organigram und nicht im Hierer."}, {"id": 120, "start": 1128.0, "end": 1132.0, "text": "Hast du den Hierer-Namen, findest du ihn nicht im Organigram und nicht..."}, {"id": 121, "start": 1135.0, "end": 1136.0, "text": "Richtig gut."}, {"id": 122, "start": 1137.0, "end": 1143.0, "text": "Aber Leute, meine Frage wer bei euch arbeitet bei einem größeren Laden, das ist fast überall so, gehe ich mal ganz stark davon aus."}, {"id": 123, "start": 1144.0, "end": 1153.0, "text": "Also bei dem Provider, wo ich vorher gearbeitet habe, da war es nicht ganz so wild, das war aber auch nicht so ein ganz großer Laden, aber es war auch furchtbar wirr."}, {"id": 124, "start": 1153.0, "end": 1157.0, "text": "Kennst du Redmine? Ja, kenne ich."}, {"id": 125, "start": 1158.0, "end": 1159.0, "text": "Redmine, Alter."}, {"id": 126, "start": 1160.0, "end": 1165.0, "text": "Da sind wir zum Glück, das haben wir überlebt, Redmine."}, {"id": 127, "start": 1172.0, "end": 1175.0, "text": "Die Musik ist extrem paper please."}, {"id": 128, "start": 1175.0, "end": 1181.0, "text": "Also Redmine habe ich noch nicht aufgesetzt oder so, aber ich kenne das, ich kenne das."}, {"id": 129, "start": 1184.0, "end": 1188.0, "text": "Lukku, das richtig gemacht ist, das ist nicht schlecht."}, {"id": 130, "start": 1189.0, "end": 1197.0, "text": "Also ich muss sagen, so von den ganzen Ticketsystemen, die es gibt, wo ich schon mal ein bisschen so reingeguckt habe, finde ich Hierer eigentlich am besten."}, {"id": 131, "start": 1198.0, "end": 1199.0, "text": "Wenn es ordentlich gemacht ist."}, {"id": 132, "start": 1199.0, "end": 1210.0, "text": "Wie viele Mitarbeiter hat ein Unternehmen eigentlich? Endorphine, also ich muss dir ehrlich sagen, das weiß wahrscheinlich keiner so genau."}, {"id": 133, "start": 1211.0, "end": 1218.0, "text": "Weil das zig, Tochter und über und sonst wie, ach das weiß keiner."}, {"id": 134, "start": 1219.0, "end": 1226.0, "text": "Also ja klar, wahrscheinlich weiß es irgendeiner, aber so wirklich wie man es hier sieht, ist es wahrscheinlich keiner."}, {"id": 135, "start": 1226.0, "end": 1233.0, "text": "Ja, wahrscheinlich weiß es irgendeiner, aber so wirklich wissen tut das, wenn du nicht gerade Buchhaltungsmann bist, wahrscheinlich keiner."}, {"id": 136, "start": 1237.0, "end": 1247.0, "text": "Dann machen sie ja so komische Dinge wie, ja ok, jetzt müssen neue Leute bei irgendwie einer Tochtergesellschaft anfangen, weil man sonst über eine gewisse Anzahl käme,"}, {"id": 137, "start": 1248.0, "end": 1253.0, "text": "wo es dann noch einen neuen Betriebsrat, Sitz bräuchte und so Dinge, das weiß keiner genau."}, {"id": 138, "start": 1253.0, "end": 1256.0, "text": "Das, das, das weiß, das weiß keiner genau."}, {"id": 139, "start": 1257.0, "end": 1261.0, "text": "Das ist schrecklich mit Ruby und Rails, ach Ruby und Rails an sich ist gut, aber Redmine ist halt eklig."}, {"id": 140, "start": 1264.0, "end": 1269.0, "text": "Ja wie gesagt, das mit Ragfall habe ich mitgekriegt, ich kann dazu gar nichts sagen, ich habe seine Streams nicht geguckt."}, {"id": 141, "start": 1270.0, "end": 1276.0, "text": "Ich weiß nur, dass er sich umgebracht hat mit 31 und dass er wohl schon längere Zeit ein bisschen Dachschaden hatte."}, {"id": 142, "start": 1276.0, "end": 1284.0, "text": "Aber genaues keine Ahnung, hat wahrscheinlich schon jeder auf Twitch ausführlich behandelt, ich muss es ja nicht auch noch unbedingt machen."}, {"id": 143, "start": 1288.0, "end": 1291.0, "text": "So, ich mache mal die ganzen Crap hier zu, die wir noch von gestern auf hatten."}, {"id": 144, "start": 1297.0, "end": 1299.0, "text": "Das wollte ich gerade sagen, das dürfte jetzt ja nicht mehr da sein."}, {"id": 145, "start": 1299.0, "end": 1306.0, "text": "So wie ist diese komische Seite nochmal mit diesen Jobs, die ich bemerken wollte, Jobs vor Andy, sowas, das beknackt das echt."}, {"id": 146, "start": 1307.0, "end": 1312.0, "text": "Ich wollte mich eben ein bisschen kaputt lachen, ich habe nichts spezielles vor sage ich euch gleich."}, {"id": 147, "start": 1314.0, "end": 1320.0, "text": "Habt ihr Dings mitgekriegt? Habt ihr Twitch Drama mitbekommen?"}, {"id": 148, "start": 1320.0, "end": 1328.0, "text": "XQZ vs Ninja vs Ninjas Frau vs Ninjas Bruder vs XQC's Frau vs frag mich nicht alles."}, {"id": 149, "start": 1335.0, "end": 1338.0, "text": "Wie sie sich geflamet haben, ich habe mich so kaputt gelacht."}, {"id": 150, "start": 1338.0, "end": 1343.08, "text": "Wie sie sich geflammt haben, ich hab mich so kaputt gelacht."}, {"id": 151, "start": 1343.08, "end": 1352.44, "text": "Also wer es sich mitgekriegt hat, so die, so die, so die, so die, in drei Sätzen war"}, {"id": 152, "start": 1352.44, "end": 1353.44, "text": "die Erklärung."}, {"id": 153, "start": 1353.44, "end": 1358.64, "text": "XQC hat im Stream gesagt, ähm, die meisten Streamer, die Charity Event Stream bekommen"}, {"id": 154, "start": 1358.64, "end": 1359.64, "text": "Geld dafür."}, {"id": 155, "start": 1359.64, "end": 1364.92, "text": "Und darauf, darauf war irgendwie Ninja angepisst."}, {"id": 156, "start": 1364.92, "end": 1372.2, "text": "Und dann war Ninjas Frau noch angepisst und er hat XQC ihr geantwortet, so nach dem Motto"}, {"id": 157, "start": 1372.2, "end": 1377.4, "text": "ja was war sie schon mit ihren zwei Gucci Handtaschen, sie hatte da auch gar keine Ahnung"}, {"id": 158, "start": 1377.4, "end": 1378.4, "text": "von."}, {"id": 159, "start": 1378.4, "end": 1383.08, "text": "Dann hat Ninjas Bruder darauf geantwortet und Ninjas Frau, dann hat irgendwann noch,"}, {"id": 160, "start": 1383.08, "end": 1386.32, "text": "noch XQC´s Frau darauf geantwortet und haben sich alle geflammt."}, {"id": 161, "start": 1386.32, "end": 1393.56, "text": "Ich hab mich so kaputt gelacht, das hat mich so ein bisschen an YouTube Drama 2012 verinnert."}, {"id": 162, "start": 1393.56, "end": 1400.88, "text": "Genau er ist Ninjas Frau, dann Ninja, ich fand´s mega lustig, eigentlich total unsinnig"}, {"id": 163, "start": 1400.88, "end": 1402.32, "text": "wie sie sich da drüber gestritten haben."}, {"id": 164, "start": 1402.32, "end": 1416.84, "text": "Ahja, kann mir jemand mit dem Raspberry Pi helfen, ähm, Noobs, Noobs ist für´n Arsch,"}, {"id": 165, "start": 1416.84, "end": 1421.2, "text": "nehm´ ne SD-Karte, mach den Raspian drauf, vergiss Noobs."}, {"id": 166, "start": 1421.2, "end": 1426.84, "text": "Gibt es eigentlich schon was neues zu Prime, also diesen Streaming Service, ich bezweifle"}, {"id": 167, "start": 1426.84, "end": 1432.56, "text": "auch das es den geben wird, erstens, erstens, also da muss ich jetzt mal was zu sagen, erstens"}, {"id": 168, "start": 1432.56, "end": 1440.96, "text": "die zuverlässigste Quelle davon ist 4Chan und ich finde das sagt alles wenn die zuverlässigste"}, {"id": 169, "start": 1440.96, "end": 1451.16, "text": "Quelle 4Chan ist, so, ähm, und das nächste ist, ähm, Prime, der Name ist viel zu, viel"}, {"id": 170, "start": 1451.16, "end": 1457.28, "text": "zu, ähm, ähnlich zu Prime, würden die das wirklich rausbringen, da wäre Amazon sofort"}, {"id": 171, "start": 1457.28, "end": 1461.64, "text": "am Starten, wird die verklagen, weil Prime und Prime zu ähnlich ist, ne, also wie gesagt"}, {"id": 172, "start": 1461.64, "end": 1468.04, "text": "zuverlässigste Quelle 4Chan und Prime und Prime, das wird´s dem Leben nicht geben."}, {"id": 173, "start": 1468.04, "end": 1471.84, "text": "Ähm, was ist deine Theorie zu Dr."}, {"id": 174, "start": 1471.84, "end": 1472.84, "text": "Disrespect?"}, {"id": 175, "start": 1472.84, "end": 1475.56, "text": "Gut, habe ich ja schon vor ein paar Tagen gesagt, als es aktuell war, meine Theorie"}, {"id": 176, "start": 1475.56, "end": 1480.48, "text": "ist immer noch Plattformwechsel, weil für alles andere brauchst du zu viele unbekannte"}, {"id": 177, "start": 1480.48, "end": 1484.92, "text": "Sachen, da halte ich Plattformwechsel tatsächlich für am wahrscheinlichsten, was es am Ende"}, {"id": 178, "start": 1484.92, "end": 1486.8, "text": "ist, wir haben alle keine Ahnung."}, {"id": 179, "start": 1486.8, "end": 1497.56, "text": "Welches Einstiegsgehalt kann man als Informatikstudent, Moment, du bist Informatikstudent, also du"}, {"id": 180, "start": 1497.56, "end": 1501.2, "text": "hast vorher eine Physi-Ausbildung gemacht und bist jetzt Informatikstudent."}, {"id": 181, "start": 1501.2, "end": 1507.36, "text": "Möchtest du quasi neben dem Studium noch was, noch was verdienen?"}, {"id": 182, "start": 1507.36, "end": 1511.2, "text": "Oder bist du fertig mit dem Studium?"}, {"id": 183, "start": 1511.2, "end": 1524.56, "text": "Ach du wirst fertig, ich habe ehrlich gesagt keine Ahnung, aber ich habe gesehen, dass"}, {"id": 184, "start": 1524.56, "end": 1534.48, "text": "die Bahais letztens wieder ihre Gehalts, äh, Gehaltsumfrage gemacht haben, das ist immer"}, {"id": 185, "start": 1534.48, "end": 1553.0, "text": "ganz gut, weil es für Deutschland ist, genau, was ist mit euch los heise, come on bra, Paywall"}, {"id": 186, "start": 1553.0, "end": 1566.32, "text": "wollen die mich veräppeln, ja aber nee Paywall dann halt nicht, ja, lull."}, {"id": 187, "start": 1566.32, "end": 1569.28, "text": "Also ich habe keine Schmerzen damit, dass die heise plus haben, die müssen ja auch irgendwie"}, {"id": 188, "start": 1569.28, "end": 1573.64, "text": "Geld verdienen, aber vielleicht sollte man nicht auf der normalen Seite heise plus Artikel"}, {"id": 189, "start": 1573.64, "end": 1578.56, "text": "dann irgendwie verlinken, weil ich fühle mich immer angepisst, wenn ich irgendwo drauf"}, {"id": 190, "start": 1578.56, "end": 1583.44, "text": "gehe und fange an, vor allem das Bahais ist das nervige, das fängt hier unten immer"}, {"id": 191, "start": 1583.44, "end": 1588.36, "text": "erst an, ja, du scrollst, du drüberlängst dir, aha, aha, aha, aha, ah, Paywall, also"}, {"id": 192, "start": 1588.36, "end": 1595.48, "text": "irgendwie zwei Minuten verschenkt für da oben, weil Paywall voll von Arsch, also 40k"}, {"id": 193, "start": 1595.48, "end": 1602.68, "text": "ist auf jeden Fall für, also es kommt immer ein bisschen aufs Gebiet ab, aber 40k erscheinen"}, {"id": 194, "start": 1602.68, "end": 1613.8, "text": "mir auch wenig, ja, es kommt natürlich drauf, also es kommt extrem auf die Region an, aber"}, {"id": 195, "start": 1613.8, "end": 1626.32, "text": "40k erscheinen mir, also mal, wenn es Frankfurt wäre oder so auch ziemlich wenig, es kommt"}, {"id": 196, "start": 1626.32, "end": 1631.44, "text": "natürlich nicht nur darauf an, dass du, es ist halt auch die Frage Region und welche"}, {"id": 197, "start": 1631.44, "end": 1640.48, "text": "Position das ist, ich meine, wenn du jetzt in Support gehst, wir haben bei uns im 24-7-Support"}, {"id": 198, "start": 1640.48, "end": 1653.0, "text": "auch einige Bachelor-Studenten sitzen, die Informatik studiert haben, dann kriegst du"}, {"id": 199, "start": 1653.0, "end": 1661.32, "text": "auch nicht viel, weil Support wird dann nicht bezahlt, also, na, es kommt drauf an, welche"}, {"id": 200, "start": 1661.32, "end": 1674.76, "text": "Stelle und es kommt drauf an, welche Region, dann kann man was sagen, ehm, immer Proto,"}, {"id": 201, "start": 1674.76, "end": 1684.56, "text": "also von netto Jahresgeld redet kaum einer, auch die, auch wenn ihr den Tarifvertrag oder"}, {"id": 202, "start": 1684.56, "end": 1689.92, "text": "so, es sind alles Proto-Jahresgelder beziehungsweise Monatsgelder im Tarifvertrag, warum auch immer,"}, {"id": 203, "start": 1689.92, "end": 1695.0, "text": "was für uns gut ist, weil bei uns gibt es 14 Monatsgelder, Steps Down Gehaltsbericht,"}, {"id": 204, "start": 1695.0, "end": 1701.12, "text": "genau, da kannst du tatsächlich gucken, da kannst du sogar, die haben sogar so einen"}, {"id": 205, "start": 1701.12, "end": 1707.04, "text": "Test, den du machen kannst, die haben sogar so einen Test, den man machen kann, wo du"}, {"id": 206, "start": 1707.04, "end": 1711.48, "text": "Fragen beantworten musst, also zu deiner Person und dann sagen die, was es im Durchschnitt"}, {"id": 207, "start": 1711.48, "end": 1715.64, "text": "so gibt, das ist aber natürlich drauf angelegt, du sollst dich da registrieren und bla und"}, {"id": 208, "start": 1715.64, "end": 1730.68, "text": "sonst was, oh, Consulting, muss das jetzt sein, wirklich, Consulting, was, Überblick,"}, {"id": 209, "start": 1730.68, "end": 1736.08, "text": "Proto-Durchschnittsgehalt, Personalverantwortung, ja, nein, Anzahl Mitarbeiter unterstellt,"}, {"id": 210, "start": 1736.08, "end": 1743.44, "text": "aha, ok, ne, wir wollen, in welchem Bereich, gucken wir mal, zeig mal her, ehm, Gelder"}, {"id": 211, "start": 1743.44, "end": 1751.32, "text": "von Fach- und Führungskräften, ja, schon ein Überblick, was guckt man da jetzt am"}, {"id": 212, "start": 1751.32, "end": 1758.96, "text": "besten, ah, Branchen, Gehälter nach Branchen, Banken, also ich habe mir das ja alles nicht"}, {"id": 213, "start": 1758.96, "end": 1763.12, "text": "ausgesucht, ja, aber ich stelle immer wieder fest, dass ich echt in einer guten Ecke gelandet"}, {"id": 214, "start": 1763.12, "end": 1770.6, "text": "bin, also sowohl Frankfurt, sowohl Bank, als auch, sowohl was der Tarifvertrag hergibt,"}, {"id": 215, "start": 1770.6, "end": 1775.6, "text": "als auch was am Ende noch rauskommt, obwohl ich nur Teilzeit arbeite, ich habe, es war"}, {"id": 216, "start": 1775.6, "end": 1778.84, "text": "nie, ich habe es nie drauf angelegt, aber ich habe irgendwie echt Glück gehabt in der"}, {"id": 217, "start": 1778.84, "end": 1790.56, "text": "Richtung, GG, ja, also so viel haben wir nicht, wobei ich mir ehrlich, nein, ich weiß es"}, {"id": 218, "start": 1790.56, "end": 1795.04, "text": "nicht, das kann durchaus sein, dass wir über 1000 haben, wenn die ganzen Tochtergesellschaften"}, {"id": 219, "start": 1795.04, "end": 1800.44, "text": "ungedönst mit dabei sind, ich habe ehrlich gesagt keinen Plassen Schimmer, also Gehälter"}, {"id": 220, "start": 1800.44, "end": 1810.48, "text": "nach Bildungs, Abschluss, oh ja, da hast du schon, da hast du schon, ist schon mal nicht"}, {"id": 221, "start": 1810.48, "end": 1823.36, "text": "verkehrt, gut, inwieweit das jetzt so ein Bachelor da was bringt, stimmt halt Null, naja,"}, {"id": 222, "start": 1823.36, "end": 1828.8, "text": "auf wem der Grundlage wird das schon sein, dass es jetzt nicht auf den Einzelnen zutrifft,"}, {"id": 223, "start": 1828.8, "end": 1837.24, "text": "ist ja auch klar, sowas ist ja immer über alle Sachen durch, ab 25 Jahren, ok, Berufserfahrung"}, {"id": 224, "start": 1837.24, "end": 1842.0, "text": "25 Jahre, da brauche ich noch ein bisschen für, wer zählt als Akademiker, kein Schimmer,"}, {"id": 225, "start": 1842.0, "end": 1846.52, "text": "das ist ja gerade die Frage hier, man erkennt es nicht wirklich, Top 5 Studienfächer, Medizin"}, {"id": 226, "start": 1846.52, "end": 1867.24, "text": "und, Moment, was, Moment, dachte das wäre IT, ach Moment, das ist nicht nur IT, das"}, {"id": 227, "start": 1867.24, "end": 1877.92, "text": "ist alles, für Führungs, ach Moment, wir haben voll den falschen Report, Alter, Zahntechnik,"}, {"id": 228, "start": 1877.92, "end": 1889.68, "text": "was ab Seite 16, wo sieht man die Seitennummer, ah da unten, Seitennummern sind out, IT hier,"}, {"id": 229, "start": 1889.68, "end": 1897.76, "text": "Crap, na gut, guck mal, mit was, was hast du hier, du hast Ärzte, Finanztons, Menschen,"}, {"id": 230, "start": 1897.76, "end": 1902.76, "text": "irgendwelche Anwälte, Banking, Ingenieur, Unternehmensberater, Vertrieb, IT, Marketing,"}, {"id": 231, "start": 1902.76, "end": 1907.72, "text": "ach ich bin ja immer froh, dass Marketing bei sowas relativ weit unten ist, Personal,"}, {"id": 232, "start": 1907.72, "end": 1915.76, "text": "oh ja, jawoll, Marketing, Personal, PR, ganze Crap, der kann noch viel weiter runter, Naturwissenschaftliche"}, {"id": 233, "start": 1915.76, "end": 1922.36, "text": "Forschung und Labor, ok, das dürfte ruhig weiter oben sein, ja, Einkauf, Logistik, na"}, {"id": 234, "start": 1922.36, "end": 1926.32, "text": "gut, das ist im Lage hin und her fahren, Bildung, ja, dass das so schlecht bezahlt"}, {"id": 235, "start": 1926.32, "end": 1930.28, "text": "wird, gerade Bildung sollte eigentlich besser bezahlt werden, Gesundheit und soziale Dienste,"}, {"id": 236, "start": 1930.28, "end": 1934.0, "text": "das was alle brauchen wird am schlechtesten bezahlt, Design und Gestaltung, technische"}, {"id": 237, "start": 1934.0, "end": 1939.68, "text": "Berufe, also mit technischen Berufe meinen sie jetzt in dem Fall nicht IT, sondern was"}, {"id": 238, "start": 1939.68, "end": 1964.2, "text": "mit Holz zum Beispiel, so, die Gehälter für IT-Berufe im Überblick, achja, Protodurchschnittsgehalt,"}, {"id": 239, "start": 1964.2, "end": 1972.08, "text": "ok, das ist, ja gut, das sagt jetzt für den Einzelnen nicht wirklich was aus, das Durchschnittsgehalt"}, {"id": 240, "start": 1972.08, "end": 1977.68, "text": "ist wahrscheinlich viel höher als das was die meisten Leute kriegen, weil es halt wieder"}, {"id": 241, "start": 1977.68, "end": 1987.72, "text": "ein paar gibt, die extrem viel bekommen, deswegen ist ja auch das Durchschnitts, das durchschnittliche,"}, {"id": 242, "start": 1987.72, "end": 1992.56, "text": "wie nennt man das, Einkommen und sowas, was die Leute in Deutschland haben, insgesamt"}, {"id": 243, "start": 1992.56, "end": 1997.6, "text": "ganz ok, wenn du aber mal guckst, wenn du mal so die allerreichsten weglässt, die"}, {"id": 244, "start": 1997.6, "end": 2001.92, "text": "allerärmsten weglässt, dann ist es halt doch nicht so viel, und noch schlimmer ist, wenn"}, {"id": 245, "start": 2001.92, "end": 2008.68, "text": "du die guckst, die Grenze zwischen Arm und Reich, wo die liegt, das ist viel niedriger"}, {"id": 246, "start": 2008.68, "end": 2027.32, "text": "als man denkt, Hessen, komm mal, ich hab echt Glück gehabt, muss ich sagen, also ich mein,"}, {"id": 247, "start": 2027.32, "end": 2048.44, "text": "was hatte ich eben gesagt, Bank, Bank, Hessen, Ulm, komm mal, eLotrix verdient 65.000, ähm,"}, {"id": 248, "start": 2048.44, "end": 2065.88, "text": "ich hasse Ulm, Ulm sackt so hart, ich musste da jahrelang hinfahren, mag Ulm überhaupt"}, {"id": 249, "start": 2065.88, "end": 2086.64, "text": "nicht, Moment, jetzt hab ich drüber gescrollt gerade, over IT, ja also, 65k, 53k, Geschlecht,"}, {"id": 250, "start": 2086.64, "end": 2098.92, "text": "männlich, weiblich, Anteil variables Gehalt, 8%, mit Personalverantwortung 24, ok, und"}, {"id": 251, "start": 2098.92, "end": 2121.64, "text": "in Hessen, tja, hast du eLotrix mal besucht, nein, warum sollte ich, wie viel meinst du"}, {"id": 252, "start": 2121.64, "end": 2131.36, "text": "kriegt ein fachinformatischer Anwendungsentwickler nach der Ausbildung in Frankfurt, 40k, ja,"}, {"id": 253, "start": 2131.36, "end": 2145.26, "text": "das geht schon, je nachdem wo du hinkommst, vielleicht sogar mehr, aber 40k in Frankfurt"}, {"id": 254, "start": 2145.26, "end": 2151.96, "text": "als Einstiegsgehalt, als Anwendungsentwickler, wenn es jetzt nicht total die Klitsche ist,"}, {"id": 255, "start": 2151.96, "end": 2154.92, "text": "ja, so, also, Moment, jetzt wollte ich doch jetzt mal gucken, gibt es jetzt irgendwie"}, {"id": 256, "start": 2154.92, "end": 2162.36, "text": "noch nach, irgendwie Ausbildung, was man gelernt hat oder sonst was, ne, na gut, der"}, {"id": 257, "start": 2162.36, "end": 2168.04, "text": "Gehaltsbericht, ok, ach hier kommt, Gehaltsunterschieden nach Aufgaben, Fälle, Berufserfahrung, IT-Architektur,"}, {"id": 258, "start": 2168.04, "end": 2178.12, "text": "SAP, überall diese SAP-Crap, aber der verkauft sich gut, beziehungsweise er bringt gut Kohle,"}, {"id": 259, "start": 2178.12, "end": 2183.6, "text": "Projektmanagement, IT-Beratung, ja, die von denen hatten wir es ja gerade am Anfang, Leute,"}, {"id": 260, "start": 2183.6, "end": 2188.04, "text": "die den ganzen Tag heise Luft fabrizieren, zum größten Teil, nicht alle, aber zum größten"}, {"id": 261, "start": 2188.04, "end": 2193.8, "text": "Teil sind die sehr gut im heise Luft fabrizieren, aber wirklich Ahnung haben sie nicht, Softwareentwicklung,"}, {"id": 262, "start": 2193.8, "end": 2199.6, "text": "IT-Infrastruktur, Support, tja, da sieht man es mal, ne, Support wird meistens recht schlecht"}, {"id": 263, "start": 2199.6, "end": 2211.6, "text": "bezahlt, Top-Berufstitel, IT-Manager, IT-Architekt, Softwarearchitekt, SAP-Inhouse-Consultant,"}, {"id": 264, "start": 2211.6, "end": 2218.56, "text": "ist es dann, ist es einfach jemand, was ist ein Inhouse-Consultant, ist es einfach jemand,"}, {"id": 265, "start": 2218.56, "end": 2224.56, "text": "der sich damit gut auskennt und dort angestellt ist, also quasi ein SAP-Experte, der dort"}, {"id": 266, "start": 2224.56, "end": 2235.24, "text": "direkt angestellt ist, also ich mein, den könnte man auch anders nennen, den muss man"}, {"id": 267, "start": 2235.24, "end": 2242.36, "text": "nicht SAP-Inhouse-Consultant nennen, aber das war's, ok, das war jetzt nicht so wahnsinnig"}, {"id": 268, "start": 2242.36, "end": 2252.64, "text": "aufschlussreich, Senior Software Engineer in, Moment, SAP-Inhouse-Consultantin, so geht's"}, {"id": 269, "start": 2252.64, "end": 2268.24, "text": "ja nett, so geht's ja nett hier, so, hab ich eigentlich meinen Chat-Log eingeschmissen"}, {"id": 270, "start": 2268.24, "end": 2282.56, "text": "hier, wo ist mein Chat-Log, ja das haben wir uns nicht gerade angeguckt gehabt, achso ja,"}, {"id": 271, "start": 2282.56, "end": 2288.08, "text": "den Gehaltsplaner haben wir schonmal gemacht und die haben uns extrem krass gebaitet, erstens"}, {"id": 272, "start": 2288.08, "end": 2295.72, "text": "hab ich weniger gekriegt laut Gehaltsplaner, als ich jetzt krieg und ich sollte mich danach"}, {"id": 273, "start": 2295.72, "end": 2311.96, "text": "registrieren, dass er richtig funktioniert, was ist denn eine Cam-Programmiererin, das"}, {"id": 274, "start": 2311.96, "end": 2319.08, "text": "hat wahrscheinlich nichts mit Webcam zu tun, oder, Nehradorn, Stufe 1, 12 Monate, excellent"}, {"id": 275, "start": 2319.08, "end": 2331.96, "text": "Subscription, Dankeschön, Abortnetzwerk, Entwickler, Datenschutzkoordinator, CAD, Cam-Programmierer,"}, {"id": 276, "start": 2331.96, "end": 2337.56, "text": "Networker, Integrations-Techniker, Nachrichtentechniker, der Name klingt so richtig oldschool, aber"}, {"id": 277, "start": 2337.56, "end": 2344.8, "text": "richtig deutsch klingt der Nachrichtentechniker, Prüftechnik-Testkoordinator, Jobs für IT,"}, {"id": 278, "start": 2344.8, "end": 2349.84, "text": "ok guck mal mal, 6 0 3 2 9, was haben die denn schönes, wir haben schon eine Weile nicht"}, {"id": 279, "start": 2349.84, "end": 2355.76, "text": "mehr geguckt, da ist bestimmt wieder irgendwas drinnen, wo wir ein bisschen flamen können,"}, {"id": 280, "start": 2355.76, "end": 2365.16, "text": "aber Praktikant, MV-Diverse, im Bereich Shopper, Shopper-Marketing, sind das Motorradfahrer,"}, {"id": 281, "start": 2365.16, "end": 2381.68, "text": "Shopper-Marketing, Nestle, ok, ok, was wollen die denn von so einer Praktikant, ach guck"}, {"id": 282, "start": 2381.68, "end": 2389.72, "text": "mal Bewertung, was ist mit der Mario Kart Musik los, warum wird hier auf einmal so laut,"}, {"id": 283, "start": 2389.72, "end": 2414.52, "text": "und KS, Moment das ist die Lobby von Mario, ach exzellent, na na na na na das machen wir"}, {"id": 284, "start": 2414.52, "end": 2420.96, "text": "jetzt nochmal, ok Nestle für ein Praktikant, ok bla bla bla, können wir alles einmal überspringen,"}, {"id": 285, "start": 2420.96, "end": 2431.64, "text": "welche Rolle nehmen sie ein, im Shopper-Marketing, ah das sind die die einkaufen gehen, das sind"}, {"id": 286, "start": 2431.64, "end": 2444.4, "text": "die Shopper, sie arbeiten als Kategorie übergreifende Schnittstellen strategisch mit"}, {"id": 287, "start": 2444.4, "end": 2466.48, "text": "dem Markt, als Praktikant, als Praktikant, sie unterstützen im Rahmen der digitalen Shopper"}, {"id": 288, "start": 2466.48, "end": 2472.68, "text": "Ansprache, was ist denn das für ein bescheuerter Satz, der ergibt überhaupt keinen Sinn, sie"}, {"id": 289, "start": 2472.68, "end": 2478.84, "text": "unterstützen im Rahmen der digitalen Shopper Ansprache und entwickeln, was ist das für"}, {"id": 290, "start": 2478.84, "end": 2485.4, "text": "ein Satz, der ergibt keinen Sinn, ich kann den Satz nicht mal richtig aussprechen, weil"}, {"id": 291, "start": 2485.4, "end": 2491.88, "text": "ich immer denke da fehlen Wörter, sie unterstützen im Rahmen der digitalen Shopper Ansprache"}, {"id": 292, "start": 2491.88, "end": 2499.28, "text": "und entwickeln digitale Kampagnen in Zusammenarbeit mit Startup, what, das ist Massive Stonks"}, {"id": 293, "start": 2499.28, "end": 2506.84, "text": "Sprache und mal ganz davon abgesehen, als Praktikant, was soll ich für den Link öffnen?"}, {"id": 294, "start": 2506.84, "end": 2529.72, "text": "Was war ich halt für ein Link, den Spider von Heise, ok warte mal, was ist denn das"}, {"id": 295, "start": 2529.72, "end": 2535.32, "text": "eigentlich für eine, what, was ist das für eine Uhr, na gut war es auch immer, marktübliche"}, {"id": 296, "start": 2535.32, "end": 2542.84, "text": "IT Geld, der Helpdesk und Support, gut das ist immer ganz unten sowas, ja leider, datenbank"}, {"id": 297, "start": 2542.84, "end": 2559.44, "text": "administration, Netzwerk, Telekom, Softwareentwicklung, Beratung, IT Sicherheit, Management, ok,"}, {"id": 298, "start": 2559.44, "end": 2576.32, "text": "Perzentil, wo bin ich, also früher hätte ich mich dazu gezählt, aber ich mache keine"}, {"id": 299, "start": 2576.32, "end": 2584.4, "text": "Administration mehr, schon seit Jahren nicht mehr, da bin ich am ehesten, wobei, da bin"}, {"id": 300, "start": 2584.4, "end": 2592.08, "text": "ich auch nicht, ich bin, mich gibt es nicht, was sind denn Perzentil, Prozent, also die"}, {"id": 301, "start": 2592.08, "end": 2599.12, "text": "unteren 25% dann irgendwie, oder was wollen sie hier, und dann die oberen, die oberen"}, {"id": 302, "start": 2599.12, "end": 2610.8, "text": "5%, irgendwie das sind die oberen 5%, das sind die unteren 25%, das ist so der Durchschnitt,"}, {"id": 303, "start": 2610.8, "end": 2617.76, "text": "irgendwie sowas in der Richtung, ja das ist nicht so richtig, das hier finde ich, ich"}, {"id": 304, "start": 2617.76, "end": 2630.76, "text": "will ein bisschen, ich will noch ein bisschen ablässern über Nestle, jetzt mal ganz ehrlich,"}, {"id": 305, "start": 2630.76, "end": 2639.92, "text": "mal ganz im Ernst, die wollen doch nicht, dass das wirklich jemand umsonst macht oder,"}, {"id": 306, "start": 2639.92, "end": 2646.2, "text": "ist das richtig, die wollen, dass das hier jemand umsonst macht, die müssen da schon"}, {"id": 307, "start": 2646.2, "end": 2655.44, "text": "was für kriegen, ansonsten wäre das doch komplett affig, ja da muss es Geld für geben,"}, {"id": 308, "start": 2655.44, "end": 2662.08, "text": "ansonsten wäre das doch, aber da steht halt nichts zu, da steht nichts von Gehalt, aber"}, {"id": 309, "start": 2662.08, "end": 2679.4, "text": "wenn das wirklich kostenlos ist, dann wäre das echt, das ist ja geschenkt, naja, na gut,"}, {"id": 310, "start": 2679.4, "end": 2695.16, "text": "was hat Nestle so für Bewertungen, leider bestenfalls Durchschnitt, relativ viel Pause,"}, {"id": 311, "start": 2695.16, "end": 2702.52, "text": "im Normalfall kann man eher mal nach Hause gehen, also ich finde, dass Nestle sackt zum"}, {"id": 312, "start": 2702.52, "end": 2709.36, "text": "größten Teil, hier guckt euch das mal an, stärken, pünktliche Gehaltszahlung, ok,"}, {"id": 313, "start": 2709.36, "end": 2714.96, "text": "wenn das schon die Stärken sind, ich meine, pünktliche Gehaltszahlung ist keine Stärke,"}, {"id": 314, "start": 2714.96, "end": 2721.64, "text": "pünktliche Gehaltszahlung ist die Basis, auf der man länger als einen Monat dahin zur Arbeit"}, {"id": 315, "start": 2721.64, "end": 2732.2, "text": "geht, also ohne pünktliche Gehaltszahlung gibt es auch keine Arbeit, viele Zulangen,"}, {"id": 316, "start": 2732.2, "end": 2736.56, "text": "Sommergeld, Weihnachtsgeld, Urlaubsgeld, ok, spontan freien, aber meist ohne Probleme"}, {"id": 317, "start": 2736.56, "end": 2754.76, "text": "möglich, also mit Schichtsystem scheint das zu sacken, 10 Monate, Dankeschön, Subscription,"}, {"id": 318, "start": 2754.76, "end": 2763.8, "text": "was wusste ich, das ist human, hier steht nix mit humaner Arbeit, kann man hier sortieren"}, {"id": 319, "start": 2763.8, "end": 2772.6, "text": "nach, was ist das Unternehmen mit der schlechtesten Bewertung, ok, die Mario Kart Musik, die geht"}, {"id": 320, "start": 2772.6, "end": 2777.76, "text": "mir auf den Keks, weil die ist unterschiedlich laut, wobei jetzt gehts eigentlich, hat sich"}, {"id": 321, "start": 2777.76, "end": 2795.08, "text": "eingekrägt, ich muss noch was anderes machen, das hatten wir erst letztens, ah yes, excellent,"}, {"id": 322, "start": 2795.08, "end": 2816.48, "text": "das ist schön entspannt, was neben der Suchleiste erweitert, Bewertung, ne kann man nicht, man"}, {"id": 323, "start": 2816.48, "end": 2824.48, "text": "kann nicht nach Bewertung suchen, das wäre auch zu geil, ich wollte mal nach dem schlecht"}, {"id": 324, "start": 2824.48, "end": 2829.8, "text": "bewerteten Unternehmen suchen, aber das geht anscheinend nicht, ok, schauen wir mal, was"}, {"id": 325, "start": 2829.8, "end": 2834.28, "text": "haben die sonst noch schönes zu bieten gerade, also in Fragen von Nestle Praktika, ne das"}, {"id": 326, "start": 2834.28, "end": 2843.8, "text": "muss nicht unbedingt sein, technischer Projektmanage für den Bereich Spritzguss, excellent, das"}, {"id": 327, "start": 2843.8, "end": 2851.56, "text": "war es für den Chat, kannst du bei Kunden, was Kunden, habe ich denn, ok, ich will das"}, {"id": 328, "start": 2851.56, "end": 2857.72, "text": "schlecht bewertete IT Unternehmen in Deutschland haben, kann man da nach, nach Branche suchen,"}, {"id": 329, "start": 2857.72, "end": 2884.84, "text": "IT, hier alle Branchen, IT, und jetzt Bewertung, Bewertung absteigend, äh Bewertung aufsteigend,"}, {"id": 330, "start": 2884.84, "end": 2900.44, "text": "kann man mindest, mindest, mindest Bewertung, weil, weil die kennt ja keiner hier, die sind"}, {"id": 331, "start": 2900.44, "end": 2909.76, "text": "ja komplett, komplett unbekannt alle, die haben ja nicht mal Bilder, oh ja, die sacken"}, {"id": 332, "start": 2909.76, "end": 2919.52, "text": "alle, heftig, die sacken hardcore, immer Bewertung absteigend, die haben auch alle kein Bild,"}, {"id": 333, "start": 2919.52, "end": 2927.88, "text": "warum haben die alle kein Bild, ok, die Suche ist doof, ok, dann suchen wir nach, wer hat"}, {"id": 334, "start": 2927.88, "end": 2947.32, "text": "die weißen Bewertungen, Anzahl Bewertungen, ja gibt es nicht, ah das ist ja doof, so schauen"}, {"id": 335, "start": 2947.32, "end": 2958.92, "text": "wir mal, was haben die denn hier schönes, SAP, ja überall, überall ist es, was Bewertung"}, {"id": 336, "start": 2958.92, "end": 2967.84, "text": "ab, ja ne, ab Sterne, aber ich will ja sagen, ab, wie viel abgegebener Bewertung, so was"}, {"id": 337, "start": 2967.84, "end": 2974.36, "text": "haben die hier schönes noch für uns hier, ah wir gucken, ne, ne, ne Leute, wir gucken"}, {"id": 338, "start": 2974.36, "end": 2980.48, "text": "mal wieder, wir gucken mal, was unser Lieblingsunternehmen in Frankfurt so treibt, wir müssen uns mal"}, {"id": 339, "start": 2980.48, "end": 2984.36, "text": "wieder Telekom-Stellangebote angucken, die sind immer am lustigsten, was die da teilweise"}, {"id": 340, "start": 2984.36, "end": 2990.12, "text": "für Buzzwords um sich, um sich hauen, Moment, das ist aber nicht das, was ich, was ich meinte"}, {"id": 341, "start": 2990.12, "end": 2996.32, "text": "hier, Jobs, wir müssen uns wieder die Telekom angucken, ja genau, da sind wir, Deutschland,"}, {"id": 342, "start": 2996.32, "end": 3005.24, "text": "ja Frankfurt, Frankfurt, auf, allein schon, wie bescheuert man hier rein scrollen muss,"}, {"id": 343, "start": 3005.24, "end": 3011.04, "text": "ja das ist das Interessante in Frankfurt, da, da, in der Ecke, Niederrad, ne, ne, doch"}, {"id": 344, "start": 3011.04, "end": 3029.0, "text": "nicht, da, exzellent, was, was, was will ich hier, Bachelor, Fachinformatiker, das sind"}, {"id": 345, "start": 3029.0, "end": 3033.32, "text": "Ausbildungsstellen, sowas in der Richtung, oder, weil niemand sucht ein Fachinformatiker"}, {"id": 346, "start": 3033.32, "end": 3038.36, "text": "Systementwicklung, das ist Ausbildungsstellen, Werkstudent, Ausbildungsstellen oder irgendwie"}, {"id": 347, "start": 3038.36, "end": 3054.56, "text": "sowas, die Seite ruckelt übrigens, Head of Competence Sender, IT-Industry, what, Hunter,"}, {"id": 348, "start": 3054.56, "end": 3079.56, "text": "ein Hunter suchen die, von KS, ja, ok, Telekom sucht gerade nix, aber die Telekom sucht Azubis,"}, {"id": 349, "start": 3079.56, "end": 3085.6, "text": "die weiß man, wie man sich eigentlich nennen kann, kommt auch an, was du dich bewerbst,"}, {"id": 350, "start": 3085.6, "end": 3092.96, "text": "wenn du Fachinformatiker Systementwicklung gelernt hast, danach sucht keiner, du musst"}, {"id": 351, "start": 3092.96, "end": 3098.04, "text": "halt irgendwas suchen, dann was zu deinem Kenntnisstand entspricht, von Softwareentwicklung"}, {"id": 352, "start": 3098.04, "end": 3103.28, "text": "bis Administration, bis Automatisierungsgeschichten, bis Cloud, bis sonst was, was halt passt"}, {"id": 353, "start": 3103.28, "end": 3120.64, "text": "zu dem was du kannst, was ist das denn, Taze, was ist das denn, zeig mal her, oh, excellent,"}, {"id": 354, "start": 3120.64, "end": 3127.0, "text": "das sieht das, was ist das bei der Polizei Hessen, das, also diese Seite sieht aus wie"}, {"id": 355, "start": 3127.0, "end": 3139.6, "text": "von 1992, wer das auch immer erstellt hat, weiß ich auch nicht, aber einen Vorteil hat's,"}, {"id": 356, "start": 3139.6, "end": 3147.96, "text": "man kann's relativ gut lesen, E13, heute E13 gab's doch kaum Geld, oder, wir hatten das"}, {"id": 357, "start": 3147.96, "end": 3163.68, "text": "ja schon mal geguckt, E13, E13 gibt's doch kein Geld für, E13, E13, was ist das Stufe"}, {"id": 358, "start": 3163.68, "end": 3178.12, "text": "3, Stufe 4, okay, keine Ahnung, wollen die mich verarschen, ach Moment, netto bleiben,"}, {"id": 359, "start": 3178.12, "end": 3183.96, "text": "netto bleiben, okay, okay Moment, ich hab nix gesagt, das sind ja die einzigen, die"}, {"id": 360, "start": 3183.96, "end": 3195.48, "text": "das in netto machen, oh ja, oh ja, so schlecht ist das doch gar, was ist denn, was ist denn"}, {"id": 361, "start": 3195.48, "end": 3220.4, "text": "Klasse 1, sind das Berufsjahre oder sowas, morgen KS, ist doch ordentlich, ich hab leider"}, {"id": 362, "start": 3220.4, "end": 3226.92, "text": "keine Ahnung, was diese Stufen hier unten sind, Stufe 1, 1 Jahr, Stufe 2, 2 Jahr, also"}, {"id": 363, "start": 3226.92, "end": 3231.12, "text": "das heißt Stufe 6, wir sind irgendwie nach 20 Jahren oder so, okay, dann gehen wir mal"}, {"id": 364, "start": 3231.12, "end": 3236.0, "text": "was von halbwegs realistisch, ach so, wie ist das eigentlich, wird das einem angerechnet,"}, {"id": 365, "start": 3236.0, "end": 3245.28, "text": "also mal angenommen theoretisch, jemand hat jetzt wie ich seit 2007, schon quasi Berufserfahrung,"}, {"id": 366, "start": 3245.28, "end": 3270.88, "text": "seit 13 Jahren, wird das dann angerechnet, wenn das nicht angerechnet wird, was ja Blödsinn,"}, {"id": 367, "start": 3270.88, "end": 3279.68, "text": "schau dir mal die Schweizer, das bringt nix zu vergleichen, das geht doch halbwegs, also"}, {"id": 368, "start": 3279.68, "end": 3285.28, "text": "ich mein das ist jetzt nix wo ich sagen würde, ich muss sofort hier dahin, aber das sieht"}, {"id": 369, "start": 3285.28, "end": 3291.16, "text": "doch schon mal ganz okay aus, okay was schreiben sie, was suchen sie überhaupt, eine Informatikerin,"}, {"id": 370, "start": 3291.16, "end": 3301.8, "text": "eine Informatikers im Bereich, warum suchen die keinen Informatikkorps, im Bereich Kriminaltechnik,"}, {"id": 371, "start": 3301.8, "end": 3316.8, "text": "auch richtige Hackermans suchen die, in Vollzeit, die Eingruppierung erfolgt, Moment, da gibt"}, {"id": 372, "start": 3316.8, "end": 3330.32, "text": "es auch noch so andere Abstufungen, Moment, das ist das was wir gerade schon hatten, das"}, {"id": 373, "start": 3330.32, "end": 3337.4, "text": "ist das was wir gerade schon hatten, also passt, passt, das kremen, bla, bla, bla, bla,"}, {"id": 374, "start": 3337.4, "end": 3344.76, "text": "die Aufgabengebiet umfasst die Gewährleistungsbetrieb der KTI, jetzt, okay, Entwicklung von speziellen"}, {"id": 375, "start": 3344.76, "end": 3352.32, "text": "IT-Lösungen hin und Erstellung von IT, für das, was ist denn das, Kriminaltechnische"}, {"id": 376, "start": 3352.32, "end": 3361.86, "text": "Institut, okay, Abkürzung, Abkürzung immer gut, bla, bla, bla, okay, da muss man aber"}, {"id": 377, "start": 3361.86, "end": 3368.24, "text": "schon von dem Thema Ahnung haben, also ich wüsste jetzt nicht, was die genau wollen"}, {"id": 378, "start": 3368.24, "end": 3376.88, "text": "mit mobiler IT-Verfahren zu Analyse und Rekonstruktion von Tatordnen, sollst du Festplatten entschlüsseln"}, {"id": 379, "start": 3376.88, "end": 3377.88, "text": "oder wie?"}, {"id": 380, "start": 3377.88, "end": 3387.32, "text": "Was ist aus dem Projekt mit Traffic geworden, hat alles funktioniert, ja, Leitung von Projekten"}, {"id": 381, "start": 3387.32, "end": 3393.6, "text": "zur Einführung von IT-Anwendung, Datenbank, okay, ich mein, das könnte man vielleicht"}, {"id": 382, "start": 3393.6, "end": 3398.48, "text": "auch in den Titel schreiben, weil Projektleiter ist ja nun mal ein bisschen was anderes als"}, {"id": 383, "start": 3398.48, "end": 3405.52, "text": "einfach Hacker-Man, Planung, Beschaffung in Betriebnahme von IT, Moment, die wollen"}, {"id": 384, "start": 3405.52, "end": 3411.2, "text": "einen Projektleiter und gleichzeitig einen, der ein Computer anschließt, seh ich das"}, {"id": 385, "start": 3411.2, "end": 3412.2, "text": "richtig?"}, {"id": 386, "start": 3412.2, "end": 3421.36, "text": "Das passt irgendwie nicht zusammen, technische Analyse und gegebenenfalls Beseitigung von"}, {"id": 387, "start": 3421.36, "end": 3429.16, "text": "Microsoft, okay, Gewährleistung der Umsetzung, für die Landesverwaltung, Geld in der IT-Sicherheit,"}, {"id": 388, "start": 3429.16, "end": 3435.16, "text": "bla, bla, bla, bla, okay, Mitarbeiter in Gremien, ja, okay, also ich könnte das mit den meisten"}, {"id": 389, "start": 3435.16, "end": 3443.2, "text": "Sachen gar nicht so wirklich was sagen, anfangen, oder vergleichbar, gute Kenntnisse in der"}, {"id": 390, "start": 3443.2, "end": 3451.28, "text": "Entwicklung und Pflege von rationalen Datenbanken, Microsoft SQL Software, Weiche, der Teufel,"}, {"id": 391, "start": 3451.28, "end": 3465.52, "text": "Oscar als Beste, Kenntnis und Erfahrung im IT-Projektmanagement, also ich find das,"}, {"id": 392, "start": 3465.52, "end": 3470.6, "text": "also das liest sich alles ganz okay, aber das meiste liest sich halt wie so ein ganz"}, {"id": 393, "start": 3470.6, "end": 3476.28, "text": "klassischer Turnschuh-Admin, der halt unterwegs ist und guckt, dass alles funktioniert und"}, {"id": 394, "start": 3476.28, "end": 3492.64, "text": "das liest sich nicht nach einem Projektmanager, ausgeprägt, ja, bla, bla, Herr Doktor Aalhorn,"}, {"id": 395, "start": 3492.64, "end": 3501.48, "text": "hoffentlich lässt er nicht den Aal raus, aber das war schlecht, ich geb's zu, Aalhorn,"}, {"id": 396, "start": 3501.48, "end": 3513.48, "text": "alles klar, ja, gut, ich muss euch, es liest sich gar nicht so schlecht, aber ich kann mir"}, {"id": 397, "start": 3513.48, "end": 3529.8, "text": "wenig darunter vorstellen, muss ich auch gestehen, Hanfollow ist raus, so, also genau, die Telekom"}, {"id": 398, "start": 3529.8, "end": 3538.44, "text": "sucht Azubis und die suchen die überhaupt eine Ausbildung, ja, Ausbildung, boah, was"}, {"id": 399, "start": 3538.44, "end": 3542.96, "text": "man als Azubi mittlerweile kriegt ist ja heftig, na gut, bei mir ist das ja auch schon ewig"}, {"id": 400, "start": 3542.96, "end": 3548.36, "text": "her, selbst wenn du einfach jedes Jahr ein bisschen was drauf haust, bist du dabei jetzt"}, {"id": 401, "start": 3548.36, "end": 3557.96, "text": "schon, ja, naja, bei mir ist das irgendwie 15 Jahre her ungefähr und wenn du dann irgendwie"}, {"id": 402, "start": 3557.96, "end": 3563.88, "text": "pro Jahr nur 2-3% drauf haust, bist ja schon bei dem Gehalt, also im Prinzip ist da eigentlich"}, {"id": 403, "start": 3563.88, "end": 3575.04, "text": "gar nichts gegen zu sagen, wir dürfen nicht vergessen, es ist Frankfurt, Frankfurt ist"}, {"id": 404, "start": 3575.04, "end": 3589.56, "text": "immer teuer, stories, nachdem Khaled Deutsch gelernt hat, lernt er jetzt seinen Traumberuf,"}, {"id": 405, "start": 3589.56, "end": 3598.2, "text": "hä, was hat das mit der Stellenanzeige zu tun, Khaled kommt aus Syrien und muss erst"}, {"id": 406, "start": 3598.2, "end": 3601.36, "text": "Deutsch lernen, bevor er seine Ausbildung zum fachinformatischen Systemenintegration"}, {"id": 407, "start": 3601.36, "end": 3606.7, "text": "beginnen konnte, er liebt es jeden Tag etwas neu, ok, die Telekom möchte sich als besonders"}, {"id": 408, "start": 3606.7, "end": 3612.36, "text": "inclusive darstellen, verstehe, das ist ja gerade aktuell im Trend, ähm, ich bin begeistert"}, {"id": 409, "start": 3612.36, "end": 3616.44, "text": "von seinem Kind, er sagt, sowohl in der Schule als auch im Ausbildungsbetrieb sind wir ein"}, {"id": 410, "start": 3616.44, "end": 3627.68, "text": "gutes Team, ah ja, wo ist Khaled, ach, da gibt es wenigstens ein Bildchen zu, wie er"}, {"id": 411, "start": 3627.68, "end": 3638.08, "text": "den Server einbaut oder sowas, exellent, Agile Coach, das ist was für mich, der Agile Coach,"}, {"id": 412, "start": 3638.08, "end": 3647.6, "text": "jawoll, ich wollte schon immer agil bei der Telekom sein, was geht hier ab, Agile Coach,"}, {"id": 413, "start": 3647.6, "end": 3667.92, "text": "so, so, also, ok, sie kreieren in der Organisation den nötigen Rückenwind auf unserem Weg in"}, {"id": 414, "start": 3667.92, "end": 3676.32, "text": "die Zukunft, als Agile Coach mit in der Praxis gefestigten Methodenkompetenz, was zum Geier"}, {"id": 415, "start": 3676.32, "end": 3683.76, "text": "soll das überhaupt bedeuten, mit Herzblut, ok, das ist ja auch nichts für mich, was"}, {"id": 416, "start": 3683.76, "end": 3690.0, "text": "heißt das überhaupt, mit Herzblut arbeiten sie an den folgenden Themen, sie ergänzen"}, {"id": 417, "start": 3690.0, "end": 3695.56, "text": "das schon bestehende Agile Chapter Team, das sich mit der Vereinfachung von Prozessen beschäftigt,"}, {"id": 418, "start": 3695.56, "end": 3700.0, "text": "sowohl das Thema Time to Market als Fokus hat, also sprich, wie schnell kommt was raus,"}, {"id": 419, "start": 3700.0, "end": 3708.16, "text": "sie gestalten aktiv den Weg der Weiterbindung für das Agile Chapter, das liest sich heftig"}, {"id": 420, "start": 3708.16, "end": 3725.04, "text": "Bates Jam, Alter, sie fördern die Entwicklung eines Agilen Mindsets, vermitteln agile Werte"}, {"id": 421, "start": 3725.04, "end": 3733.0, "text": "und Praktiken und treiben die kontinuierliche Agile Kompetenzentwicklung voran, ok, und"}, {"id": 422, "start": 3733.0, "end": 3738.6, "text": "jetzt nochmal auf Deutsch, was macht man da genau, durch die Unterstützung und Schulde"}, {"id": 423, "start": 3738.6, "end": 3744.04, "text": "von Agile Methodenkompetenz befähigen sie die Teams dazu diese Methoden dauerhaft nachhaltig"}, {"id": 424, "start": 3744.04, "end": 3758.72, "text": "anzuwenden, ihre Stakeholder sind Tribe Leader, ok, ja, ich hab die Begriffe alle schonmal"}, {"id": 425, "start": 3758.72, "end": 3765.46, "text": "irgendwie gehört, aber ich hab noch nie so viel in kurze, so viel zusammen komprimiert"}, {"id": 426, "start": 3765.46, "end": 3778.36, "text": "gelesen auf einem Flag, also ihre Stakeholder sind Tribe Leader, also bei Scrum ist es so,"}, {"id": 427, "start": 3778.36, "end": 3783.76, "text": "dass unterschiedliche Gruppen, die unterschiedliche Themen bearbeiten sind Tribes, warum man es"}, {"id": 428, "start": 3783.76, "end": 3790.2, "text": "sich Gruppen nennt, weiß ich nicht, weil es cooler klingt, also wenn du die erste Gruppe"}, {"id": 429, "start": 3790.2, "end": 3794.64, "text": "hast, die sich mit Thema A beschäftigt und die zweite Gruppe, die sich mit Thema B beschäftigt,"}, {"id": 430, "start": 3794.64, "end": 3799.28, "text": "da könnte man das Gruppen nennen, in Scrum sind es aber nicht, sondern es sind Tribes,"}, {"id": 431, "start": 3799.28, "end": 3805.04, "text": "weil Stonksmännchen das geiler finden, wenn das so heißt, dass man das nicht versteht,"}, {"id": 432, "start": 3805.04, "end": 3812.04, "text": "es sind eigentlich Gruppen, Gruppenleiter sind das, Gruppenleiter im Endeffekt und die"}, {"id": 433, "start": 3812.04, "end": 3819.56, "text": "hier halten, was machen wenn die Veganer sind, Painschamp, Management und Führungskräfte"}, {"id": 434, "start": 3819.56, "end": 3829.92, "text": "sowie Mitarbeiter sampler Hierarchie imnen, Stakeholder sind im Prinzip, die es zu verantworten"}, {"id": 435, "start": 3829.92, "end": 3841.48, "text": "haben, oder die da irgendwie mit drinne hängen, wie kann man das am besten beschreiben, wie"}, {"id": 436, "start": 3841.48, "end": 3845.8, "text": "kann man am besten Stakeholder beschreiben, Stonks Chat, ihr kennt euch mit sowas aus,"}, {"id": 437, "start": 3845.8, "end": 3855.16, "text": "BWL kram ich nicht, was genau ist die Definition von einem Stakeholder, Person, für die es"}, {"id": 438, "start": 3855.16, "end": 3860.08, "text": "aufgrund ihrer Interessensanlage von Belangen ist, wie ein bestimmtes Unternehmen sich verhält,"}, {"id": 439, "start": 3860.08, "end": 3868.6, "text": "Teilhaber, ah ok, Investoren, aber in dem Fall sind es ja gar keine Investoren,"}, {"id": 440, "start": 3868.6, "end": 3882.56, "text": "ich hätte ja auch gesagt, da sind die, die es verantworten müssen in dem Fall und deswegen"}, {"id": 441, "start": 3882.56, "end": 3896.08, "text": "halt auch Interesse daran haben, gut was auch immer, sie sind Vorreiter, die Yoshi Musik"}, {"id": 442, "start": 3896.08, "end": 3903.0, "text": "passt da ganz gut zu, sonst wirst du hier komplett verrückt, ok, also sie sind Vorreiter und Botschafter"}, {"id": 443, "start": 3903.0, "end": 3915.96, "text": "in der Agilisierung, was ein Wort, Agilisierung, Agilisation und eine Persönlichkeit, deren"}, {"id": 444, "start": 3915.96, "end": 3938.8, "text": "Fokus auf People-Business liegt, aktuell ist People-Business aber schlecht, ok, was für"}, {"id": 445, "start": 3938.8, "end": 3950.76, "text": "eine Zertifizierung brauche ich da, Zertifizierung Agile Coach, weiter Bildung zum Zertifizieren"}, {"id": 446, "start": 3950.76, "end": 3960.48, "text": "Agile, so eine Scheiße gibt es echt, mein Gott das ist, dieser ganze Bullshit ist einfach"}, {"id": 447, "start": 3960.48, "end": 3969.8, "text": "nur dazu da, um so einen Geldkreislauf zu generieren, genauso wie dieses ganze ISO,"}, {"id": 448, "start": 3969.8, "end": 3978.16, "text": "DIN ISO 9001, ITIL, sonstigen Geschiss, Zertifizierungsgedöns, das ist einfach nur da, um so einen Geldfluss"}, {"id": 449, "start": 3978.16, "end": 3983.08, "text": "zu generieren, das sich selbst mit Geld versorgt, ich will nicht sagen, dass es bei den einzelnen"}, {"id": 450, "start": 3983.08, "end": 3987.76, "text": "Modellen nicht sinnvolle Sachen gibt, darum geht es gar nicht, klar, hier steht in ITIL"}, {"id": 451, "start": 3987.76, "end": 3995.0, "text": "auch sinnvolle Sachen drinne, aber dieses ganze Geschäft, was da drumherum gemacht wird,"}, {"id": 452, "start": 3995.0, "end": 4004.0, "text": "ist einfach, dass sich das ganze System selbst mit Geld versorgt, Scrum an sich ist super,"}, {"id": 453, "start": 4004.0, "end": 4008.76, "text": "die meisten machen es nicht richtig, genau, die meisten stellen sich mit 15 Leuten hin,"}, {"id": 454, "start": 4008.76, "end": 4014.36, "text": "labern 45 Minuten jeden Tag, setzen sich nicht dabei hin und sagen wir machen Scrum und"}, {"id": 455, "start": 4014.36, "end": 4017.88, "text": "wenn du sie fragst, ok, was war jetzt hier dran Scrum, ja, weil wir uns nicht hingesetzt"}, {"id": 456, "start": 4017.88, "end": 4029.04, "text": "haben, so, normalerweise muss das viel kürzer sein und es muss vor allem auch etabliert"}, {"id": 457, "start": 4029.04, "end": 4039.6, "text": "werden, dass es ok ist, wenn man nichts sagt, ok, bla bla bla, Ausbildung und die langjährige"}, {"id": 458, "start": 4039.6, "end": 4051.2, "text": "praktische Erfahrung in positiver Psychologie, Big Brain, Alter, jetzt geht es ab und systemischen"}, {"id": 459, "start": 4051.2, "end": 4065.56, "text": "Business Coaching oder vergleichbar wie NLP Master, was zur Teufel ist das, NLP Practitioner"}, {"id": 460, "start": 4065.56, "end": 4074.76, "text": "Certificate, es gibt in diesem Bereich so unglaublich viel Scheiße einfach, nur das ist der Wahnsinn,"}, {"id": 461, "start": 4074.76, "end": 4078.88, "text": "mindestens 5 Jahre umfassen theoretisches und praktisches Wissen zu den Frameworks,"}, {"id": 462, "start": 4078.88, "end": 4088.0, "text": "Scrum, was sonst, was sonst, also komm, mit Zertifizierung mindestens ACSM und CSP, SM"}, {"id": 463, "start": 4088.0, "end": 4096.04, "text": "ist Scrum Master, denke ich mal und SAFE, dass das sagt, ich weiß jetzt nicht wovür es steht,"}, {"id": 464, "start": 4096.04, "end": 4102.88, "text": "aber das sagt mir irgendwas, SAFE, Scaled Agile Framework, genau, sowie über OKRs und"}, {"id": 465, "start": 4102.88, "end": 4109.84, "text": "Kanban, ok, ich kann eine Tabelle hin und her schieben, von Technologischen Crew, ach"}, {"id": 466, "start": 4109.84, "end": 4122.2, "text": "du Scheiße, was ein Geschwätze, boah, da kriegst du ja Anfälle, wenn du das liest, ey, Benefits,"}, {"id": 467, "start": 4122.2, "end": 4127.92, "text": "Teilzeit, wie du das in Teilzeit machen willst, bin ich mal gespannt, Plexible Weiterbildung"}, {"id": 468, "start": 4127.92, "end": 4144.4, "text": "angeboten, ach du große 9er, meine Güte, die Telekom, Agile Coach, Elsa sagt, habe"}, {"id": 469, "start": 4144.4, "end": 4149.16, "text": "die Woche auch eine Stelle mit 10 Jahre Go Erfahrung gesehen, oh 10 Jahre Go ist nicht"}, {"id": 470, "start": 4149.16, "end": 4156.24, "text": "schlecht, Go ist ja mit 8 und gerade mal 10 Jahre alt, am besten ist man noch der Entwickler,"}, {"id": 471, "start": 4156.24, "end": 4161.08, "text": "genau, man hat es erfunden, jolle gebe ich ja recht, denke ich, wie der größte Schwachsinn"}, {"id": 472, "start": 4161.08, "end": 4169.2, "text": "überhaupt, ja, ok, in Frankfurt suchen die anscheinend nichts, da kann man nichts machen,"}, {"id": 473, "start": 4169.2, "end": 4173.48, "text": "wenn die Telekom nichts sucht, kann man es heute nicht auslassen über die Telekom, Schüler,"}, {"id": 474, "start": 4173.48, "end": 4180.76, "text": "Studenten, Absolventen, Professionals, ok, Professionals, wir sind Professionals, hast"}, {"id": 475, "start": 4180.76, "end": 4198.08, "text": "du schon Agile im Korea TTS, nee, ihre Karriere als Professional, Experten, ok, ich bin Experten,"}, {"id": 476, "start": 4198.08, "end": 4207.12, "text": "zeig mal her, was empfiehlt mir die Telekom, Auslass, gehen wir fort, ihr könnt mich einfach"}, {"id": 477, "start": 4207.12, "end": 4218.66, "text": "in Ruhe meine Arbeit machen lassen und mir nicht auf den Sack gehen, wer will denn so"}, {"id": 478, "start": 4218.66, "end": 4225.64, "text": "was, ok, das ist so eine typische Sache, wenn das jemand will und er Bock drauf hat, ist"}, {"id": 479, "start": 4225.64, "end": 4230.38, "text": "es gut, dass es das gibt und dann ist es auch schön, dass er das machen kann, aber aus"}, {"id": 480, "start": 4230.38, "end": 4239.76, "text": "meiner Erfahrung sind die meisten IT Leute jetzt nicht so die extrovertiertesten Auslandsreise-Fans,"}, {"id": 481, "start": 4239.76, "end": 4247.08, "text": "um es mal vorsichtig auszudrücken, also die meisten haben schlichtweg keinen Bock drauf"}, {"id": 482, "start": 4247.08, "end": 4251.36, "text": "und ich handele mich auch so, lasst mich doch einfach meine Arbeit machen, geht mir nicht"}, {"id": 483, "start": 4251.36, "end": 4256.88, "text": "mit zig Bullshit zwischendurch auf den Sack, lasst mich doch einfach meine Arbeit machen"}, {"id": 484, "start": 4256.88, "end": 4267.36, "text": "und gut ist, Karrierefahrt, ok, Inhouse Consulting, schau mir da, es ist übrigens toll, dass man"}, {"id": 485, "start": 4267.36, "end": 4274.04, "text": "als Consultant anfängt, also sprich man fängt als Consultant an, also sprich man soll konsultiert"}, {"id": 486, "start": 4274.04, "end": 4280.2, "text": "werden zu Problemen und man hat vorher keine Ahnung, also normalerweise müssten hier eigentlich"}, {"id": 487, "start": 4280.2, "end": 4284.68, "text": "noch ein paar Schritte davor kommen, so nach dem Motto ok, know how, ich werde Consultant"}, {"id": 488, "start": 4284.68, "end": 4288.0, "text": "da drinnen, aber nein, ich fange als Consultant an, also ich habe keinen Plan und fange schon"}, {"id": 489, "start": 4288.0, "end": 4301.32, "text": "mal als Consultant an, genau diesen Eindruck habe ich von unseren Consultants auch, ne,"}, {"id": 490, "start": 4301.32, "end": 4307.8, "text": "geh fort, geh fort, ja, Junior Consultant, genau, wie gesagt, unser Spezialer Zubi ist"}, {"id": 491, "start": 4307.8, "end": 4313.32, "text": "auch Junior Consultant geworden und da konnte mir in seiner Fachinformatik Ausbildung, der"}, {"id": 492, "start": 4313.32, "end": 4316.28, "text": "hat einen halben Nervenzusammenbruch gekriegt, wo ich ihn nach Netzwerkgrundlagen gefragt"}, {"id": 493, "start": 4316.28, "end": 4328.32, "text": "habe und so jemand wird Junior Consultant, was ist, was hast du mir da für Link geschickt,"}, {"id": 494, "start": 4328.32, "end": 4345.16, "text": "was hast du mir da geschickt, was hast du mir da geschickt, was hast du mir da geschickt,"}, {"id": 495, "start": 4345.16, "end": 4362.0, "text": "was hast du mir da geschickt, was hast du mir da geschickt, was hast du mir da geschickt,"}, {"id": 496, "start": 4362.0, "end": 4382.52, "text": "was hast du mir da geschickt, was hast du mir da geschickt, was hast du mir da geschickt,"}, {"id": 497, "start": 4382.52, "end": 4384.52, "text": "Wir suchen mal nach"}, {"id": 498, "start": 4385.2, "end": 4387.2, "text": "Das könnte man mal suchen"}, {"id": 499, "start": 4391.4, "end": 4393.4, "text": "Ne wir machen mal was anderes"}, {"id": 500, "start": 4394.48, "end": 4398.74, "text": "Wir machen mal was anderes wir gucken mal nach was ganz klassischem"}, {"id": 501, "start": 4400.36, "end": 4403.68, "text": "Wir gucken mal nach einem administrator nach was ganz klassischem"}, {"id": 502, "start": 4404.68, "end": 4408.04, "text": "administration in frankfurt was ganz ganz klassisches"}, {"id": 503, "start": 4408.04, "end": 4411.48, "text": "Und mal gucken ob es da irgendwas gescheites gibt"}, {"id": 504, "start": 4413.64, "end": 4415.92, "text": "Hier ist der devops cloud engineer am start"}, {"id": 505, "start": 4423.12, "end": 4426.72, "text": "Was ganz klassisch okay sachbearbeiter administration"}, {"id": 506, "start": 4430.28, "end": 4432.28, "text": "Administrator"}, {"id": 507, "start": 4432.84, "end": 4434.84, "text": "Hier sollten wir lieber danach suchen"}, {"id": 508, "start": 4434.84, "end": 4441.52, "text": "Ein kubanetes administrator adesso as a service"}, {"id": 509, "start": 4449.0, "end": 4451.0, "text": "Ich ich ich ahne ich ahne"}, {"id": 510, "start": 4451.8, "end": 4453.36, "text": "buzzwords"}, {"id": 511, "start": 4453.36, "end": 4458.32, "text": "Und eine sache die mir bei diesen ganzen stellenanzeigen immer nicht einleuchtend ist"}, {"id": 512, "start": 4458.32, "end": 4464.6, "text": "Warum übertreiben warum müssen die am anfang immer so eine riesen"}, {"id": 513, "start": 4466.04, "end": 4470.6, "text": "Abgesangen auf oder so eine riesen lobes hymne auf sich selbst anstimmen"}, {"id": 514, "start": 4471.08, "end": 4475.48, "text": "Das interessiert doch denjenigen der das jetzt hier grad zum ersten mal liest nicht die bohne"}, {"id": 515, "start": 4476.0, "end": 4478.8, "text": "die sollten zum beispiel ganz die sollten vielleicht"}, {"id": 516, "start": 4478.8, "end": 4486.08, "text": "Ganz oben hinschreiben gehalsspanne oder sowas das wäre interessant"}, {"id": 517, "start": 4490.96, "end": 4494.52, "text": "Kuba netes administrator mit begeisterung für infraschung und applikation zur begebung"}, {"id": 518, "start": 4498.0, "end": 4505.68, "text": "Kein blabla sie haben erste praktik als system engineer oder application administrator in projekten mit kubanetes oder einer container plattform gesammelt"}, {"id": 519, "start": 4505.68, "end": 4511.4, "text": "Begeistert sich für aktuelle cloud plattform technologien sind bereit den defops und seit"}, {"id": 520, "start": 4512.28, "end": 4516.84, "text": "reliability engineering ansatz tatkräftig zu unterstützen und eng mit ja"}, {"id": 521, "start": 4517.64, "end": 4519.64, "text": "Dann sind sie bei uns genau richtig"}, {"id": 522, "start": 4520.88, "end": 4523.64, "text": "Diese formulierung die haben sie doch aus irgendeinem buch oder"}, {"id": 523, "start": 4524.56, "end": 4526.56, "text": "weil man mal ehrlich ist niemand"}, {"id": 524, "start": 4527.48, "end": 4532.52, "text": "Geht auf eine bewerbung seite und sagt ich würde mir so gern wünschen"}, {"id": 525, "start": 4532.52, "end": 4537.72, "text": "dass ich ein begeistert dass ich dass ich begeistert dass ich mich begeistert also dass ich ein begeisterter"}, {"id": 526, "start": 4538.44, "end": 4544.0, "text": "Aktuell begeben für aktuelle cloud plattform und technologien und ich würde auch so gern defops und seit"}, {"id": 527, "start": 4544.52, "end": 4547.0, "text": "reliability engineering tatkräftig unterstützen"}, {"id": 528, "start": 4548.84, "end": 4555.32, "text": "Sagt halt keiner das sind sie bei uns genau richtig sie werden teil eines dynamischen teams und helfen mit systemlandschaft unserer kunden"}, {"id": 529, "start": 4556.36, "end": 4558.36, "text": "zu konzipieren aufzubauen"}, {"id": 530, "start": 4558.36, "end": 4566.32, "text": "Und das ist ja alles ok das klingt aber wirklich sehr vorlagen mäßig wie sie das geschrieben haben wir hatten letztens ein paar richtig coole stellen anzeigen"}, {"id": 531, "start": 4566.92, "end": 4569.24, "text": "Ich weiß nicht mehr wo das war die waren wirklich"}, {"id": 532, "start": 4570.28, "end": 4574.8, "text": "Mit brain geschrieben ja also sprich wurde auch was hat es davon wenn du nie gelesen hast"}, {"id": 533, "start": 4577.08, "end": 4580.76, "text": "Unterstützung bei der vorbereitung von java software artefakten für die"}, {"id": 534, "start": 4580.76, "end": 4591.08, "text": "Geht schon gut los hier? Das ist java"}, {"id": 535, "start": 4592.92, "end": 4594.92, "text": "Es fängt schon mal gut an"}, {"id": 536, "start": 4596.16, "end": 4598.92, "text": "Dekonikation verteilen von in helm charts"}, {"id": 537, "start": 4599.64, "end": 4603.92, "text": "Das ist ja voll angesagt ich wusste gar nicht dass das charts hat"}, {"id": 538, "start": 4605.2, "end": 4607.2, "text": "Helm charts"}, {"id": 539, "start": 4607.2, "end": 4610.4, "text": "Ach das ist eine extra geschichte für mit charts dafür oder was"}, {"id": 540, "start": 4611.88, "end": 4615.16, "text": "Wie gesagt ich wusste nicht dass das das das das das das charts hat"}, {"id": 541, "start": 4616.96, "end": 4618.96, "text": "Ok exzellent charts"}, {"id": 542, "start": 4620.08, "end": 4624.64, "text": "Deklaration von infrastruktur komponenten terraform terraform ist voll angesagt aktuell"}, {"id": 543, "start": 4625.52, "end": 4631.96, "text": "Für aws azure und vmw sphär boar die wollen es aber wissen azure und aws und noch ein bisschen vmw"}, {"id": 544, "start": 4633.28, "end": 4635.28, "text": "Testen und ausrollen neue software"}, {"id": 545, "start": 4635.28, "end": 4640.88, "text": "Stände in enger zusammenarbeit mit teams aus entwicklung. Es ist alles vollkommen ok was die hier wollen ja"}, {"id": 546, "start": 4641.96, "end": 4645.56, "text": "Wobei man sagen muss so rein klassische administration ist es jetzt ja nicht"}, {"id": 547, "start": 4651.96, "end": 4657.08, "text": "Unterstützung bei der entwicklung von betriebsunterstützenden containern ja ok"}, {"id": 548, "start": 4657.88, "end": 4661.76, "text": "Das ist alles das ist alles in ordnung. Ja ok ihre skills"}, {"id": 549, "start": 4661.76, "end": 4666.96, "text": "Erfolgreich abgeschleunigt ok immer immer immer das gleiche gute linux und bs"}, {"id": 550, "start": 4669.28, "end": 4671.56, "text": "Jetzt jetzt gehen sie aber in die vollen hier"}, {"id": 551, "start": 4674.64, "end": 4680.8, "text": "Mit bsd kenntnissen wirst du nicht so viele leute finden das kann ich das kann ich euch sagen also"}, {"id": 552, "start": 4683.68, "end": 4686.4, "text": "Gut aber kenntnisse sind ja bei manchen leuten auch schon"}, {"id": 553, "start": 4686.4, "end": 4692.04, "text": "also wir hatten mal einen der hat gesagt er ist fortgeschritten in also fortgeschrittene kenntnisse in vmw"}, {"id": 554, "start": 4692.44, "end": 4698.36, "text": "Und als wir den gefragt haben was er gemacht hat hat er gemeine ubuntu vm installiert jetzt kein witz klingt so als hätte ich es"}, {"id": 555, "start": 4698.36, "end": 4702.24, "text": "mehr ausgedacht ich weiß aber das war das warum er fortgeschrittene kenntnisse in vmw hatte"}, {"id": 556, "start": 4705.68, "end": 4707.68, "text": "Grundlegendes verständnis von"}, {"id": 557, "start": 4708.16, "end": 4712.12, "text": "Netzwerk protokollen und architekturen tcp ip mpls"}, {"id": 558, "start": 4712.12, "end": 4714.72, "text": "Und architekturen tcp ip mpls"}, {"id": 559, "start": 4717.2, "end": 4719.2, "text": "Peering hab und"}, {"id": 560, "start": 4721.28, "end": 4726.52, "text": "Ok dabei wer ist bei mir schon mal raus was ist hab end spoke"}, {"id": 561, "start": 4726.52, "end": 4738.36, "text": "spoke nabespeiche was"}, {"id": 562, "start": 4757.04, "end": 4759.04, "text": "Äh"}, {"id": 563, "start": 4759.44, "end": 4761.44, "text": "Was"}, {"id": 564, "start": 4762.24, "end": 4765.44, "text": "Ok ab und spoke alles klar"}, {"id": 565, "start": 4767.64, "end": 4772.44, "text": "Ich mein es ist es ist es angeblich ist netzwerk protokoll beziehungsweise netzwerk infrastruktur aber netzwerk architektur"}, {"id": 566, "start": 4772.92, "end": 4775.72, "text": "Ich habe ernsthaft keine ahnung was damit gemeint ist"}, {"id": 567, "start": 4777.56, "end": 4779.56, "text": "Vielleicht wollen die mir damit sagen wie man am besten"}, {"id": 568, "start": 4780.76, "end": 4782.76, "text": "Netzwerkgeräte miteinander"}, {"id": 569, "start": 4782.76, "end": 4789.04, "text": "Verbindet und beziehungsweise wie man das am besten von der architektur her aufbaut dass es ordentlich läuft"}, {"id": 570, "start": 4793.72, "end": 4798.14, "text": "Pro gaming sebi schreibt wenn ich kann das einfach zeigen"}, {"id": 571, "start": 4799.2, "end": 4805.52, "text": "Kubernetes oder docker möchte mir über den sommer eins vielleicht beides anschauen die frage stellt sich gar nicht docker"}, {"id": 572, "start": 4805.52, "end": 4814.64, "text": "Wenn du wenn du von du wirst du wirst gehoffnungslos gegen die wand fahren wenn du irgendwie was kubernetes mäßig machen möchtest wenn du nicht"}, {"id": 573, "start": 4814.64, "end": 4819.88, "text": "Ein, bisschen linux container grundlagen hast und da ist docker nun mal das das ding was sich durchgesetzt hat"}, {"id": 574, "start": 4820.88, "end": 4827.44, "text": "Also das da musst du machen das da und dann später kannst du dir vielleicht ein bisschen das da angucken aber das da"}, {"id": 575, "start": 4827.64, "end": 4831.68, "text": "Also docker ist für den heimbereich auch um größten ordnung sinnvoller als docker"}, {"id": 576, "start": 4831.68, "end": 4833.68, "text": "Es ist ja gar nicht entweder oder"}, {"id": 577, "start": 4835.04, "end": 4840.24, "text": "Docker ist für lokal ein bisschen container laufen lassen vielleicht mit docker kompost ein bisschen"}, {"id": 578, "start": 4840.96, "end": 4848.32, "text": "Bis ein bisschen das managen und kubernetes ist eher so orchestrierungsgeschichte von container also die frage ist gar nicht entweder oder"}, {"id": 579, "start": 4849.2, "end": 4854.56, "text": "Sondern in deinem fall wenn du sagst was du lernen sollst docker ganz klar das da zuerst und danach das"}, {"id": 580, "start": 4855.36, "end": 4857.36, "text": "Hast du das schon gesehen"}, {"id": 581, "start": 4857.36, "end": 4859.36, "text": "Hast du das schon gesehen"}, {"id": 582, "start": 4862.2, "end": 4864.2, "text": "Ne was ist das"}, {"id": 583, "start": 4864.2, "end": 4873.52, "text": "Mir d rocket kill nicht yummy"}, {"id": 584, "start": 4873.52, "end": 4885.04, "text": "Moment, die, die, die lassen ihr JavaScript von, von Web Archive Org aus liefern?"}, {"id": 585, "start": 4885.04, "end": 4886.04, "text": "Sehe ich das richtig?"}, {"id": 586, "start": 4886.04, "end": 4891.28, "text": "Das ist ja Big Brain, dann spart man sich Traffic."}, {"id": 587, "start": 4891.28, "end": 4898.84, "text": "Das ist, das ist ja, dass da nicht noch schon mehr drauf gekommen sind."}, {"id": 588, "start": 4898.84, "end": 4903.44, "text": "Das ist Big Brain, was ist das für Traffic?"}, {"id": 589, "start": 4903.44, "end": 4931.36, "text": "Das muss man sich sparen, Alter."}, {"id": 590, "start": 4931.36, "end": 4934.12, "text": "Der Support checkt's nicht."}, {"id": 591, "start": 4934.12, "end": 4937.08, "text": "Ah, okay, okay."}, {"id": 592, "start": 4937.08, "end": 4940.68, "text": "Okay, jetzt hast du auch gecheckt, alles klar."}, {"id": 593, "start": 4940.68, "end": 4941.68, "text": "Das ist ja toll."}, {"id": 594, "start": 4941.68, "end": 4942.68, "text": "Lustig."}, {"id": 595, "start": 4942.68, "end": 4943.68, "text": "Nice."}, {"id": 596, "start": 4943.68, "end": 4953.72, "text": "Ähm, okay, das liest sich alles, das liest sich alles relativ normal, was die hier haben"}, {"id": 597, "start": 4953.72, "end": 4954.72, "text": "wollen."}, {"id": 598, "start": 4954.72, "end": 4962.72, "text": "Auch keine komischen Sachen zwischendrin, dass du noch Projektmanagement und First-Level-Support"}, {"id": 599, "start": 4962.72, "end": 4964.28, "text": "mitmachen sollst, wie bei anderen Sachen."}, {"id": 600, "start": 4964.28, "end": 4980.24, "text": "Leute, in drei Wochen hab ich meinen Azure DevOps Fünf-Tage-Kurs, ja?"}, {"id": 601, "start": 4980.24, "end": 4986.2, "text": "Und danach bin ich, äh, abgecradet, der Hacker-Mann."}, {"id": 602, "start": 4986.2, "end": 4995.48, "text": "Oh guck mal, Zwei-Faktor-Authentifizierung reicht nicht mehr."}, {"id": 603, "start": 4995.48, "end": 4997.64, "text": "Die brauchen Zwölf-Faktor-Authentifizierung."}, {"id": 604, "start": 4997.64, "end": 5012.72, "text": "Ja, der AZ-900 ist übelst Resident-Sleeper gewesen und ich geh davon aus, dass der DevOps-Kurs"}, {"id": 605, "start": 5012.72, "end": 5034.64, "text": "auch Mega-Resident-Sleeper wäre, wird."}, {"id": 606, "start": 5034.64, "end": 5040.8, "text": "Ich weiß, dass damit nicht Zwölf-Faktor-Authentifizierung gemeint ist, aber es liest sich wie Zwölf-Faktor-Authentifizierung,"}, {"id": 607, "start": 5040.8, "end": 5041.8, "text": "oder?"}, {"id": 608, "start": 5041.8, "end": 5047.12, "text": "Ja, jetzt hier, Big-Big-Brain, was wollen sie hier haben?"}, {"id": 609, "start": 5047.12, "end": 5058.72, "text": "Der Karton-Plast, was, die Karton-Plast-Gruppeier, ok, also, das erwartet sie, First- und Second-Level-Anwendungssupport,"}, {"id": 610, "start": 5058.72, "end": 5070.12, "text": "ok, Instant-Range-Quit, Winners 10 Office 356 Drucker, die werden, oh Gott, Instant-Range-Quit,"}, {"id": 611, "start": 5070.12, "end": 5075.4, "text": "Second-Kundensupport, nein, nein, nein, nein, nein, Leute, äh, wie viele Stunden arbeitest"}, {"id": 612, "start": 5075.4, "end": 5076.4, "text": "du die Woche?"}, {"id": 613, "start": 5076.4, "end": 5082.04, "text": "Das ist eine gute Frage, ich kann's dir nicht sagen, also, äh, irgendwie siebeneinhalb Stunden"}, {"id": 614, "start": 5082.04, "end": 5095.08, "text": "oder so am Tag, siebeneinhalb Stunden mal vier, mal sieben mal vier, 30, irgendwie keine Ahnung,"}, {"id": 615, "start": 5095.08, "end": 5117.96, "text": "32 Stunden oder so, 30 Stunden, irgendwie so, 30 Stunden, arbeite ich."}, {"id": 616, "start": 5117.96, "end": 5130.36, "text": "Ok, die suchen wirklich, das finde ich cool, dass es das überhaupt noch gibt, die suchen"}, {"id": 617, "start": 5130.36, "end": 5137.44, "text": "wirklich so den ganz klassischen Drucker-Anschließer, Kleines, also Drucker scheinen sehr wichtig"}, {"id": 618, "start": 5137.44, "end": 5139.48, "text": "zu sein, weil Drucker haben die sogar zweimal drin stehen."}, {"id": 619, "start": 5139.48, "end": 5152.36, "text": "Ach, und nebenbei machst du noch Monitoring der gesamten IT-Infrastruktur, alles klar."}, {"id": 620, "start": 5152.36, "end": 5164.32, "text": "Ok, geht doch."}, {"id": 621, "start": 5164.32, "end": 5173.04, "text": "Wie hast du die 30 Stunden verhandelt, Kondition gleichgeblieben, äh, naja, ich krieg weniger"}, {"id": 622, "start": 5173.04, "end": 5178.92, "text": "Geld, weil ich anstatt 38 Stunden oder so nur noch 30 Stunden arbeite, naja, klar,"}, {"id": 623, "start": 5178.92, "end": 5184.48, "text": "dass ich nie die gleiche Kohle krieg wie vorher, ist ja klar, wenn, wäre natürlich noch viel"}, {"id": 624, "start": 5184.48, "end": 5190.28, "text": "besser, ja, aber es ist nicht so, aber ansonsten hat sich nix geändert, genau das gleiche,"}, {"id": 625, "start": 5190.28, "end": 5212.84, "text": "bloß einfach weniger Stunden, die Z-Bank, was wollen die, was, was ist, was ist F-C-S-I,"}, {"id": 626, "start": 5212.84, "end": 5224.36, "text": "Ach, das heißt so bei denen, ok, First- und Second-Level-Support im Rahmen F-C-S-I, Administration"}, {"id": 627, "start": 5224.36, "end": 5229.72, "text": "mit Admin Gui und Saga, die erwarten doch nicht ernsthaft, dass irgendjemand, was ist"}, {"id": 628, "start": 5229.72, "end": 5235.4, "text": "das, Server, Age of Conan, alles klar, die erwarten doch nicht immer, dass das jemand"}, {"id": 629, "start": 5235.4, "end": 5246.32, "text": "kennt, Planung und Umsetzung der System-Release-Wechsel, technische Beratung bei RT, Strukturfragen,"}, {"id": 630, "start": 5246.32, "end": 5251.36, "text": "Analyse-Optimierung, das liest sich alles, heute ist wenig Trash dabei, also das liest"}, {"id": 631, "start": 5251.36, "end": 5257.8, "text": "sich alles relativ realistisch, ja, aber wir müssen eher bei den krassen Start-ups gucken,"}, {"id": 632, "start": 5257.8, "end": 5270.44, "text": "oh je, oh je, das ist ein Bullshit-Shop, das sieht man sofort schon, gar nicht mal von"}, {"id": 633, "start": 5270.44, "end": 5277.48, "text": "der Beschreibung her, aber Admin Mann im Krankenhaus, ich glaube da hast du keinen Spaß, bist umgeben"}, {"id": 634, "start": 5277.48, "end": 5283.4, "text": "von technisch unfähigen Leuten wahrscheinlich und es ist auch noch wichtig, was du machst,"}, {"id": 635, "start": 5283.4, "end": 5286.6, "text": "sonst kratzen Leute ab, das würde ich mir nicht geben und es wird wahrscheinlich auch"}, {"id": 636, "start": 5286.6, "end": 5295.84, "text": "noch schlecht bezahlt, also das würde ich mir nicht geben, in Offenbach, ob da Haftbefehlt"}, {"id": 637, "start": 5295.84, "end": 5310.76, "text": "schonmal drin gewesen ist, ok, was macht man hier, sicherstellen des User-Supports, ok,"}, {"id": 638, "start": 5310.76, "end": 5316.32, "text": "die wollen einen, der alles macht, ich sehe schon, Administration der Rechner und Server-Systeme"}, {"id": 639, "start": 5316.32, "end": 5320.76, "text": "sicherstellen des User-Supports bezüglich Hardware-Betriebssystems, Office-Umfeld, Meld-Line,"}, {"id": 640, "start": 5320.76, "end": 5325.12, "text": "boah, fuck, du musst ja echt alles machen, Planung, Durchführung, Verwaltung, regelmäßiger"}, {"id": 641, "start": 5325.12, "end": 5329.88, "text": "Backup, Beschaffung, Konfiguration, Installation, Neuer, ok, du machst alles, du machst alles"}, {"id": 642, "start": 5329.88, "end": 5334.72, "text": "IT, du machst komplett alles IT, so wie es aussieht, Betreuung, Installation von Software"}, {"id": 643, "start": 5334.72, "end": 5342.6, "text": "und systemnahe, was, Betreuung von Installation von Software und systemnahe Software, Überwachung"}, {"id": 644, "start": 5342.6, "end": 5346.96, "text": "und Portikulierung der Funktionsfähigkeit der Server und der aktiven Netz, Ach, Netzwerk-Infrastruktur"}, {"id": 645, "start": 5346.96, "end": 5352.24, "text": "machst du auch noch mit, Beseitigung aufgetretener Störungen gemeinsam mit Soft- und Hardware-Lieferanten,"}, {"id": 646, "start": 5352.24, "end": 5358.0, "text": "auch noch, Überwachung und Wartung der passiven Netzwerk, Netzwerk-Monitoring machst du auch"}, {"id": 647, "start": 5358.0, "end": 5363.4, "text": "noch, verstehe, Betreuung, Wartung, Austausch und Neueinsatz, Ach, Endkundensupport und Aufbau"}, {"id": 648, "start": 5363.4, "end": 5368.84, "text": "der Arbeitsplätze machst du auch noch, Unterstützung der Anwender bei Softwarenutzung, also Support"}, {"id": 649, "start": 5368.84, "end": 5374.64, "text": "und Office erklären auch noch, Pflege, die Homepage machst du auch noch, Benutzer und"}, {"id": 650, "start": 5374.64, "end": 5379.68, "text": "E-Mail-Kontenverwahl, ok, Mail-Administrator machst du auch noch, Eigenverantwortliche"}, {"id": 651, "start": 5379.68, "end": 5385.36, "text": "Erstellung von firmenspezifischen Auswertungen, what the fuck, was soll denn das geben, wenn"}, {"id": 652, "start": 5385.36, "end": 5394.08, "text": "es fertig ist, also ja, das kann alles ein Administrator machen, aber das ist vielleicht"}, {"id": 653, "start": 5394.08, "end": 5408.68, "text": "ein bisschen viel für einen Administrator, was hat der 400 Wochenstunden oder was, ok,"}, {"id": 654, "start": 5408.68, "end": 5415.04, "text": "also was wollen sie haben, gute Kenntnis im Bereich der Windows-Betriebsstelle, da bin"}, {"id": 655, "start": 5415.04, "end": 5421.76, "text": "ich schon mal raus, da bin ich schon mal raus, also nicht, dass ich das jemals freiwillig"}, {"id": 656, "start": 5421.76, "end": 5428.52, "text": "machen würde, dazu müsste ich irgendeine Straftat begehen und zu gemeinnütziger Arbeit"}, {"id": 657, "start": 5428.52, "end": 5433.84, "text": "verurteilt werden und das Gericht müsste irgendwie anordnen, dass ich das machen muss,"}, {"id": 658, "start": 5433.84, "end": 5443.12, "text": "damit ich das machen würde, unter Androhung von Knast, sonst würde ich das nicht machen,"}, {"id": 659, "start": 5443.12, "end": 5452.12, "text": "das würde ich lebendig machen hier, Kenntnisse im Netzwerkbereich, TCP-IP, Warn-Lan-VPN,"}, {"id": 660, "start": 5452.12, "end": 5456.52, "text": "Eigenverjagte, Bereitschaft zu teamorientierter Arbeitsstil, wieso teamorientierter Arbeitsstil,"}, {"id": 661, "start": 5456.52, "end": 5464.76, "text": "du machst doch alles selbst, welches Team, du brauchst ja noch kein Team mehr, du machst"}, {"id": 662, "start": 5464.76, "end": 5471.72, "text": "doch alles, Erfahrung mit Datenbanken auch noch, das ist ein Ger, das muss ich mir in"}, {"id": 663, "start": 5471.72, "end": 5477.56, "text": "den Kopf machen, das ist was, was ich flamen kann, sehr gute Deutschkenntnisse, Diskretion"}, {"id": 664, "start": 5477.56, "end": 5488.36, "text": "und Loyalität, das ist zu einem gewissen Grad kaufbar, würde ich mal behaupten, also sprich,"}, {"id": 665, "start": 5488.36, "end": 5493.0, "text": "wenn das Gehalt gut ist, dann ist Diskretion und Loyalität sicherlich auch gut, wenn das"}, {"id": 666, "start": 5493.0, "end": 5497.0, "text": "Gehalt ein Apel und ein Ei ist, dann kann ich mir vorstellen, dass es manche mit Diskretion"}, {"id": 667, "start": 5497.0, "end": 5504.88, "text": "und Loyalität nicht so ernst nehmen, Einsatzbereitschaft, Motivation, Flexibilität im Aufgabenbereich,"}, {"id": 668, "start": 5504.88, "end": 5512.48, "text": "das heißt, du darfst doch ab und zu mal die OP, den OP-Tisch putzen oder wie, Grundeinstellung"}, {"id": 669, "start": 5512.48, "end": 5528.76, "text": "zur nächsten Ebe und mittragen, mittragen, mittragen, mittragen, mittragen, mittragen,"}, {"id": 670, "start": 5528.76, "end": 5539.12, "text": "mittragen, michael 50 Billiardenbeutel, mittragen viel besser, unseres Leitbildes, was ist denn"}, {"id": 671, "start": 5539.12, "end": 5551.6, "text": "euer Leitbild, Leitbild, steht nirgendwo, was euer Leitbild ist, was ist denn euer Leitbild,"}, {"id": 672, "start": 5551.6, "end": 5560.16, "text": "Grundeinstellung zur nächsten Ebe, Leute wisst ihr was, ich finde diese drei Worte, ich finde"}, {"id": 673, "start": 5560.16, "end": 5567.64, "text": "die wirklich gut, also sowas könnten die gerne mehr auch noch bei anderen Stellenanzeigen"}, {"id": 674, "start": 5567.64, "end": 5573.2, "text": "irgendwie reinpacken, ich finde eine Grundeinstellung zur nächsten Ebe finde ich nicht verkehrt,"}, {"id": 675, "start": 5573.2, "end": 5576.32, "text": "ich meine gut klar hier geht es ums Krankenhaus oder so, aber das ist ein Job, den ich im"}, {"id": 676, "start": 5576.32, "end": 5579.4, "text": "Leben nicht machen würde, aber diese drei Worte, die kommen hier finde ich eigentlich"}, {"id": 677, "start": 5579.4, "end": 5586.4, "text": "nicht schlecht, diese Einstellungen sollten mehr Leute haben, der Q-Chat, genau, so wir"}, {"id": 678, "start": 5586.4, "end": 5594.72, "text": "bieten, Leistungsgerechte Vergütung nach dem gültigen Tarifvertrag AVR, ja, welche Stufe,"}, {"id": 679, "start": 5594.72, "end": 5624.68, "text": "welche was, Tarifvertrag AVR, gucken wir mal, what the fuck, was, ja welches davon ist es,"}, {"id": 680, "start": 5624.68, "end": 5639.12, "text": "Mitarbeiter im Pflegedienst, aber das ist doch kein Pflegedienst, äh, drei, what the fuck,"}, {"id": 681, "start": 5639.12, "end": 5641.92, "text": "was ist das für ein Rechner, das ist doch kein Gehaltsrechner, das ist eine fertige"}, {"id": 682, "start": 5641.92, "end": 5653.52, "text": "Tabelle, zum Rechner, Hessen, wo ist Hessen, Alter wer hat diese Seite wieder gemacht,"}, {"id": 683, "start": 5653.52, "end": 5660.2, "text": "ich mache jetzt einfach mal das da auf, ist egal, Geburtsjahr, ok, 1984, was weiß ich,"}, {"id": 684, "start": 5660.2, "end": 5667.64, "text": "ok, das kann ich nicht ausrechnen, also ich muss ehrlich sagen, wir bieten Feld wirklich"}, {"id": 685, "start": 5667.64, "end": 5678.72, "text": "sehr, ähm, zurückhaltend aus, ja, ich meine sie bieten Geld, das ist ja schonmal die Grundvoraussetzung"}, {"id": 686, "start": 5678.72, "end": 5683.92, "text": "dafür, dass man da überhaupt jemand dran denkt, da zu arbeiten, dass sie, ja, regelmäßig"}, {"id": 687, "start": 5683.92, "end": 5688.8, "text": "freundlich und kollegial ist, da habe ich so meine Zweifel, ich könnte mir vorstellen,"}, {"id": 688, "start": 5688.8, "end": 5693.44, "text": "dass da ziemlich oft Stress und dicke Luft ist, das ist Krankenhaus, da willst du nicht"}, {"id": 689, "start": 5693.44, "end": 5706.76, "text": "arbeiten, ihre Aussage kräftige Bewerber, das ist so ein Ding, wo es mir irgendwie in"}, {"id": 690, "start": 5706.76, "end": 5713.84, "text": "den Fingern juckt, einfach mal zu fragen, was es für Geld gibt, das interessiert mich"}, {"id": 691, "start": 5713.84, "end": 5723.36, "text": "brennend, was es da für Geld gibt, das Problem ist, ich kann da nicht einfach fragen, wobei"}, {"id": 692, "start": 5723.36, "end": 5728.2, "text": "warum eigentlich nicht, wie gesagt, ich will es auf keinen Fall machen, mich interessiert"}, {"id": 693, "start": 5728.2, "end": 5735.44, "text": "aber echt einfach mal, was es da für gibt, ich könnte wetten, es gibt nichts, es gibt"}, {"id": 694, "start": 5735.44, "end": 5747.56, "text": "irgendwie 30k im Jahr oder so, es wird wahrscheinlich nichts, das Punkt mag ich mir mal, ich glaube,"}, {"id": 695, "start": 5747.56, "end": 5754.64, "text": "ich schreibe da echt mal eine E-Mail hin, was es da, was es da so für Gehaltsaussichten"}, {"id": 696, "start": 5754.64, "end": 5759.88, "text": "gibt, wahrscheinlich 25k oder sowas, na ich kann mich da nicht bewerben, da müsste bewerbung"}, {"id": 697, "start": 5759.88, "end": 5763.6, "text": "schreiben, ich glaube es geht los, außerdem will ich mich da gar nicht bewerben, ich will"}, {"id": 698, "start": 5763.6, "end": 5769.32, "text": "einfach mal, hast du schon mal die Website, ok, die gucken wir uns jetzt an, Cat Tiller"}, {"id": 699, "start": 5769.32, "end": 5782.28, "text": "Krankenhaus, Offenbach, oh Schlaflabor, 1995 klopft an,"}, {"id": 700, "start": 5782.28, "end": 5803.4, "text": "1995 guckt vorbei, will seine Website wieder haben, eine Babygalerie haben sie, immerhin,"}, {"id": 701, "start": 5803.4, "end": 5808.88, "text": "immer edlische Babys, aber das ist wirklich 1995, hat angeklopft und will die Website"}, {"id": 702, "start": 5808.88, "end": 5820.92, "text": "wieder haben, Internationalpatient, ok, ich muss erstmal ranzoomen, ok, jetzt wisst ihr"}, {"id": 703, "start": 5820.92, "end": 5827.68, "text": "auch, warum die jemand suchen, die sich um den Web auftritt, das Internet, warum die"}, {"id": 704, "start": 5827.68, "end": 5837.2, "text": "jemand suchen, der sich um die Website kümmert, oh das Leitbild, das ist ja das, was wir wissen"}, {"id": 705, "start": 5837.2, "end": 5848.04, "text": "wollten, oh da gibt es ein Video zu, liebe Lindert Leiden, man darf nicht mal spulen,"}, {"id": 706, "start": 5848.04, "end": 5868.24, "text": "what the fuck, ah, spulen, nicht erlaubt, denied, ok, das muss man jetzt nicht geben,"}, {"id": 707, "start": 5868.24, "end": 5872.32, "text": "was ist denn die Babygalerie, naja wahrscheinlich neu geborene Babys, die da im Krankenhaus"}, {"id": 708, "start": 5872.32, "end": 5878.4, "text": "auf die Welt gekommen sind oder so, spulen und gleich Nächstenliebe, das stimmt, ich"}, {"id": 709, "start": 5878.4, "end": 5883.24, "text": "finde ein bisschen mehr Nächstenliebe beim Videoplayer hätte nicht verkehrt geschadet,"}, {"id": 710, "start": 5883.24, "end": 5904.16, "text": "ok, ich will jetzt nicht zu sehr flamen, weil die haben kein Budget, die kriegen auch kein"}, {"id": 711, "start": 5904.16, "end": 5911.0, "text": "Budget, die sind wahrscheinlich komplett am Limit, die haben, die kommen nicht hinterher"}, {"id": 712, "start": 5911.0, "end": 5915.2, "text": "und die brauchen irgendeinen, der sich um die IT kümmert und haben keine Geld, ihn"}, {"id": 713, "start": 5915.2, "end": 5925.96, "text": "zu bezahlen, wofür sie auch nicht so wirklich was können, also mich interessiert echt brennend,"}, {"id": 714, "start": 5925.96, "end": 5931.72, "text": "was man da kriegt, ich glaube ich frag die einfach mal, ich glaube ich schreibe da einfach"}, {"id": 715, "start": 5931.72, "end": 5937.32, "text": "mal eine Mail hin, was mich interessieren würde, was man da so bekommt, ob das noch"}, {"id": 716, "start": 5937.32, "end": 5946.4, "text": "im Tarif hat, welche Stufe man bekommen könnte, das würde mich echt interessieren, weil"}, {"id": 717, "start": 5946.4, "end": 5958.8, "text": "ich wette, ich könnte wetten, das ist saumäßig wenig, 30k, 25k oder sowas, was letzte Preis"}, {"id": 718, "start": 5958.8, "end": 5968.12, "text": "schreibe ich dann in die Mail rein, genau, was letzte Gehalt, ja, 25k nicht bisschen"}, {"id": 719, "start": 5968.12, "end": 5980.96, "text": "arg wenig, doch, natürlich ist das arg wenig, aber ich glaube es wird arg wenig sein, die"}, {"id": 720, "start": 5980.96, "end": 5990.92, "text": "nicht augen klinik, aha, ja gut, das passt ja schon mal dazu, oder, guck mal, Hyper-V"}, {"id": 721, "start": 5990.92, "end": 6004.52, "text": "machen die, fundierte Kenntnis im Bereich, das ist wieder irgendwas, was die Personalfrau"}, {"id": 722, "start": 6004.52, "end": 6014.56, "text": "geschrieben hat und man ihr gesagt hat, schreibe das rein, ja, plopsrusher, ich hab irgendwas"}, {"id": 723, "start": 6014.56, "end": 6020.0, "text": "gesagt, was halt wenig ist, es ist wahrscheinlich unglaublich wenig, was du kriegst, deswegen"}, {"id": 724, "start": 6020.0, "end": 6029.76, "text": "interessiert es mich ja auch, noch mehr, SAP, SAP, jetzt hört er gar nicht mehr auf, SAP,"}, {"id": 725, "start": 6029.76, "end": 6043.12, "text": "der Wetteraukreis, Moment, da war jemand mit dem Feuerlöcher, nee, das ist was ganz"}, {"id": 726, "start": 6043.12, "end": 6052.84, "text": "was anderes, Moment, das stimmt überhaupt nicht, ja, it's public administration, zu"}, {"id": 727, "start": 6052.84, "end": 6064.64, "text": "viel SAP überall, soll ich eine Mail schreiben, wenn du willst, ja, das kannst du dir überlegen,"}, {"id": 728, "start": 6064.64, "end": 6072.76, "text": "ob du das machst, ich stifte keinen dazu an, die irgendwie zuzuspermen jetzt, nicht dass"}, {"id": 729, "start": 6072.76, "end": 6077.52, "text": "du es dir mit dem Kettler Krankenhaus verscherzt, ich schreibe ja nicht alle ihr Spasten was"}, {"id": 730, "start": 6077.52, "end": 6087.52, "text": "letztes Gehalt, schreibe da eine ganz normale Mail hin, wie soll ich mir da mit denen verscherzen,"}, {"id": 731, "start": 6087.52, "end": 6097.28, "text": "so plus line, von denen hab ich schonmal was gehört, ich glaub die machen bei uns irgendwas,"}, {"id": 732, "start": 6097.28, "end": 6107.96, "text": "manage services, ich glaub die managen irgendwas für uns, blablabla, mit einem echten Interesse"}, {"id": 733, "start": 6107.96, "end": 6118.2, "text": "für Linux und Open Source, ok, das wäre ja schonmal was für mich, wenn sie mit der Kommando"}, {"id": 734, "start": 6118.2, "end": 6134.92, "text": "Zeile an und dem Editor bereits sicher umgehen können, exellent, sie suchen jemand wie, für"}, {"id": 735, "start": 6134.92, "end": 6141.92, "text": "apache MySQL Postfix, wir machen sie vertraut mit o-wirt, kvm, da fehlt ein Komma, vmwir,"}, {"id": 736, "start": 6141.92, "end": 6148.72, "text": "kvmstack, sie nutzen aktuellste wie Puppet Ansible, Ichinga, nein ich mag oldschool Nagios,"}, {"id": 737, "start": 6148.72, "end": 6159.96, "text": "Nagios beste, Grafana, Elastic Search, Logstash, Kibana, das, dass, dass die coolen Leute sagen,"}, {"id": 738, "start": 6159.96, "end": 6168.76, "text": "das ist Elk, Elastic Search, Logstash, Kibana klingt zu doof, deswegen ist der Elk Stack,"}, {"id": 739, "start": 6168.76, "end": 6179.4, "text": "weil besser, Spacewalk, das verwendet noch jemand, der hat mal einen ehemaligen Dokumentator,"}, {"id": 740, "start": 6179.4, "end": 6184.4, "text": "der hat immer gesagt, der Spacewalk, der konnte Spacewalk nicht aussprechen, hat immer auf"}, {"id": 741, "start": 6184.4, "end": 6191.36, "text": "hessisch gesagt, der Spacewalk, das ist aber schon ewig her, da hatten wir selbst noch"}, {"id": 742, "start": 6191.36, "end": 6199.6, "text": "Spacewalk, Spacewalk ist für Redhead so ein Management-Frontend, Web-Frontend, wo du"}, {"id": 743, "start": 6199.6, "end": 6206.8, "text": "ein bisschen Redhead-Systeme rudimentär mitmanagen kannst, nicht mal rudimentär, kannst du relativ"}, {"id": 744, "start": 6206.8, "end": 6213.2, "text": "viel mitmachen, Spacemark, Forman, Catello, Catello hab ich noch nie gesehen, dass das"}, {"id": 745, "start": 6213.2, "end": 6222.68, "text": "jemand einsetzt, Forman ist für Puppet so ein Web-Frontend, ja gut, das klingt doch"}, {"id": 746, "start": 6222.68, "end": 6232.32, "text": "eigentlich ganz ok, wir bieten an, steile Lernkurve, ob das jetzt so eine gute, ob das"}, {"id": 747, "start": 6232.32, "end": 6241.32, "text": "so toll ist, was man anbietet, ich finde das ist gar nicht schlecht geschrieben, ganz ehrlich,"}, {"id": 748, "start": 6241.32, "end": 6265.2, "text": "warum nicht, Musik ist aus, warum ist die Musik aus, oh Support, Ellenville Hair Company,"}, {"id": 749, "start": 6265.2, "end": 6284.96, "text": "klingt ja schon wieder absolut Big Brain, oh das ist Mode, Mode Zeug, the Frazier, ey"}, {"id": 750, "start": 6284.96, "end": 6288.52, "text": "das wäre glaube ich der optimale Job, mal angenommen man hätte Friseur gelernt und"}, {"id": 751, "start": 6288.52, "end": 6300.32, "text": "dann Fachinformatiker, dann wären wir hier richtig gut aufgehoben, Ratbacher, hier wahrscheinlich"}, {"id": 752, "start": 6300.32, "end": 6310.52, "text": "eher Ratbacher, das ist, die Experten-Frontend ist das irgendein Personalverschacherungs-Ding"}, {"id": 753, "start": 6310.52, "end": 6336.8, "text": "oder, ja das ist irgendein Personalverschacher-Typ, das denn, Sopra, Patenprogramm, ok du hast"}, {"id": 754, "start": 6336.8, "end": 6351.0, "text": "permanent einen bei dir, der dir auf den Sack geht, Beratung als Reisen, IGIT, gefahrt,"}, {"id": 755, "start": 6351.0, "end": 6357.76, "text": "aber heute ist gar nicht so viel Mist dabei gewesen, war das schon in der Windows 2008,"}, {"id": 756, "start": 6357.76, "end": 6380.32, "text": "ernsthaft, im Moment wo war mal, hier, Redhead 6, fuck alter, Redhead 6, ist ja antik, 7 wird"}, {"id": 757, "start": 6380.32, "end": 6385.16, "text": "noch Supported, 2008 keine Ahnung ob das noch Supported ist, aber das ist auch schon"}, {"id": 758, "start": 6385.16, "end": 6396.32, "text": "ganz schön alt und jünger, ok, man hätte auch neuer schreiben können, was haben die"}, {"id": 759, "start": 6396.32, "end": 6409.04, "text": "sonst noch, Apache, Apache Reverse Proxy, JBoss, IES, SVN, ok die sind oldschool unterwegs,"}, {"id": 760, "start": 6409.04, "end": 6420.68, "text": "Erfahrung mit der Programmiersprache, SQL, Bash, CMD, IGIT, MySQL, MSSQL, Oracle, ja,"}, {"id": 761, "start": 6420.68, "end": 6430.52, "text": "also die bekannte Programmiersprache, MSSQL, MySQL und Oracle, aber SVN ist das beste,"}, {"id": 762, "start": 6430.52, "end": 6445.12, "text": "also Reise, Reisegeschichten, das würde ich schon aus dem Grund nicht machen, erfahr,"}, {"id": 763, "start": 6445.12, "end": 6450.36, "text": "was unsere Aufgaben, deine Perspektive, Erfahrung im technischen Betrieb von teils hoch verfügbaren"}, {"id": 764, "start": 6450.36, "end": 6456.04, "text": "Fachleuten, ja was, sind das jetzt unsere Aufgaben oder meine Perspektiven, also was"}, {"id": 765, "start": 6456.04, "end": 6459.96, "text": "soll dieser Satz sagen, dass die Erfahrung haben im technischen Betrieb von, wer hat"}, {"id": 766, "start": 6459.96, "end": 6468.16, "text": "das, wer hat das nicht im Administrationsbereich, die meisten Sachen sollen 24 7 verfügbar"}, {"id": 767, "start": 6468.16, "end": 6489.6, "text": "sein, die Betonung liegt auf Säulen, du sollst das haben, ok, aber dafür gibt es ja unsere"}, {"id": 768, "start": 6489.6, "end": 6511.28, "text": "Erwartung, deine Fähigkeiten, ok, was auch immer, oh, so viel Keck weh, so Leute, wie"}, {"id": 769, "start": 6511.28, "end": 6519.68, "text": "gesagt, war heute etwas planloser, spontan stream, eineinhalb Stunden, ich bin einfach"}, {"id": 770, "start": 6519.68, "end": 6525.04, "text": "morgen gekommen, es gab ja nichts, ich hatte nichts großartig vor, aber es war trotzdem"}, {"id": 771, "start": 6525.04, "end": 6535.72, "text": "schön, dass so viele Leute dabei waren, exzellent, ich denke mal wir sehen uns morgen, Nachmittag"}, {"id": 772, "start": 6535.72, "end": 6541.44, "text": "oder so wieder, ich habe nämlich wirklich mal Bock drauf, wieder ein paar Stunden Battlefield"}, {"id": 773, "start": 6541.44, "end": 6546.92, "text": "3 zu spielen, vielleicht auch im Stream machen, vielleicht machen wir noch ein bisschen Technik"}, {"id": 774, "start": 6546.92, "end": 6556.48, "text": "Kram morgen, müssen wir mal gucken, und ich würde sagen Chat, wir sehen uns, machts gut,"}, {"id": 775, "start": 6556.48, "end": 6580.52, "text": "bis zum nächsten Mal, tschüss."}]}