{"text": "Ja Chico gefällt das auch nicht Wenn Chico Windows Server sieht ist er gleich wieder weg Windows Server Ja wir müssen uns das heute wirklich mal geben warum weiß ich auch nicht so genau angeblich hat der Microsoft die letzten Jahre so viel gemacht dass das jetzt viel viel besser ist ich mein Docker läuft unter Windows Hyper-V ist angeblich ganz gut WSL 2 und was nicht alles gibt angeblich hat Windows jetzt doch so gar nicht SSH Server glaube ich ja also weiß man ja nicht was da los ist. Müssen wir wieder ausprobieren aber ich kann euch gleich sagen wahrscheinlich werde ich zwischendurch ganz schön flamen wieder gegen Windows. Ich mein man könnte natürlich ganz big brain machen Windows installieren und dann darauf WSL installieren und alles in Linux machen oder aber Hyper-V installieren und alles in der Ubuntu-VM machen. Ich hoffe du nimmst auch die Version ohne Desktop. Also was ist mit ohne Desktop gemeint? Ich habe keine Ahnung davon also wenn ohne Desktop gemeint ist halt ohne irgendwelche hier 3D und Transparenz und so ja dann dann bin ich dabei aber ansonsten habe ich keine Ahnung wie man Windows Server bedient ohne hier irgendwie ein bisschen rumklicken. Keine Ahnung wir probieren das jetzt mal aus ob man das überhaupt runterladen kann richtig. Try Windows Server now. On Azure. Ne ne ne ne. On Azure geht da grad nicht. Free Trial das klingt doch schon mal gut. Exzellent. Exzellent klingt das. ISO wie da da. Microsoft ist auch lustig oder? Bei Windows 10 machen sie einen riesen Akt dass man keine ISO runterladen darf und beim Server ist es wird direkt angeboten sogar als Virtual Disk Image. Übrigens bei der Gelegenheit zeige ich immer ganz gerne den Trick für die Windows 10 ISO weil es irgendwie jedes mal wenn ich das im Stream zeige sind die Leute überrascht wie einfach das doch geht. Also sprich wenn ihr euch den Windows 10 Update runterladen wollt dann geht das nicht. Da kannst du immer nur sagen Tool jetzt herunterladen, aktualisieren, bla, sonst was. Sobald man aber hier auf Inspect geht und den Mobile Modus einschaltet dann sollte es eigentlich funktionieren. Bin ich auf der falschen Seite geht das nicht mehr. Ich habe auf jetzt aktualisieren geklickt. Okay und jetzt passiert nichts. Achso wow wow wow wow wow wow. Windows ist ja gut. Alles gut Windows alles gut. Reload, ja ja ihr habt recht aber erstmal den ganzen Scheiß wieder weg machen ja. Genau also sprich wenn man jetzt hier auf Inspect geht und in die Mobile Ansicht und dann reloadet man die Seite und zack kann man Windows 10 ISOs runterladen. Richtig big brain. Habt ihr gesehen funktioniert jetzt. Wenn man es normal aufmacht ohne mobile Seite geht es nicht. Macht man es mit mobile Seite auf reloaded kann man hier auswählen Windows 10 ISO download alles gut. Wollen wir aber nicht wir wollen die Windows Server 2019 ISO downloaden. 180 Tage. Na ob das mal reicht. Ich werde es eh nach dem Stream wieder runterschmeißen was soll ich damit. Ein Noob kann mit einer ISO nichts anfangen. Das ist mir egal ob da ein Noob damit was anfangen kann oder nicht. Ich kann aber mit dem ISO was anfangen. Deswegen geht es mir immer auf den Keks dass sie nicht einfach direkt einen ISO download anbieten. Und warum das mit dem mobile Ansicht geht ist ganz einfach. Leute die nicht von Windows auf drauf gehen die sollen natürlich den ISO download angeboten kriegen. Weil Microsoft vielleicht hofft ah die installieren den Windows. Keine Ahnung. Ok please select. Also ISO wollen wir haben. First name KekW. Last name größer nein kleiner kleiner Lulve. Company name cute chat. Company size ja so meistens zumindest. Good company. Das ist das Gegenteil zu bad company. Job title. Hey wir sind CEO. Wie einfach nur. Warum ich bin hier der head of. 10 minute mail. Das ist die falsche 10 minute mail. Das ist die richtige 10 minute mail. Ok excellent. Work phone number 069 000. Was auch immer. Germany. No continue. Lulve geht nicht. Continue. Select one. Englisch wir können es auch auf Chinesisch runterladen. Englisch download. Alles klar 1776 37 37 190 906 2324 3.5. Release SVC. Refresh Server. IWAL X64 FRE EN US 1 ISO. Alles klar. Jetzt weiß ich Bescheid. Gut dass sie das so genannt haben. Ohne den Namen wäre ich überhaupt nicht in der Lage gewesen das zu installieren und geschweige denn runterzuladen. Yes ex exquisite Name. Big brain file names. Warum habe ich eigentlich die ganzen Kram hier nur auf. Teff. Ok das sind die Videos die wir noch übrig haben vom Sondag oder so. Bookmark. Session. Nicht new folder. Keine Ahnung. Letzte. So und jetzt haben wir hier Session. Letzte ist der ganze Kram drin. Ok das liegt wahnsinnig geschwind runter. Das kapiert nur Windows Admins. Ja wahrscheinlich. Noch nicht mal die. Also wenn ich mir so unsere Windows Admins angucke da habe ich nicht so wirklich das Vertrauen drin dass da das einer von kapiert. Ich frage mich eh manchmal was Windows Admins den ganzen Tag so machen. Also außer vielleicht irgendwelche Microsoft Knowledge Base Einträge sich angucken. Also ich persönlich das kann natürlich auch täuschen ja habe den Eindruck dass Windows Admins nicht unbedingt so am oberen Spektrum der Erkenntnis Skala stehen. Also sprich wenn du Leute wenn du mal unten welche hast die gar keine Ahnung haben und oben die übelsten Pros was IT Sachen angeht dann sind Windows Admins eher so in der Mitte. Die meisten. Ausnahmen bestätigen die Regel PC lustig. Naja und Linux Leute würde ich sagen die sind im oberen Drittel. Die meisten. Ausnahmen bestätigen auch da die Regel. Wir haben bei uns teilweise Leute am Start die sich eigentlich Bedienungs auskennen sollten wo dir denkst was ist mit denen los. Ich habe es dir letztens erzählt der eine der engen Änderungen am L System gemacht hat und mit dem der dann irgendwelche kaputten Git commits und ach was auch immer da gibt es auch unfähige Leute gibt es überall ja. Ruby ne der ist nicht mehr da der Kommentator der Ruby Typ ist nicht mehr da der war aber egal. Während das runter während das runter läuft kann ich es ja gerade noch mal erzählen für alle die es da nicht mitgekriegt haben. Beim Kommentator hat es das anscheinend eingebrannt wir hatten mal einen externen Experten am Start der wurde Big Brain mäßig halt eingekauft für ZFS für Solaris und ZFS haben sie den eingekauft bei uns und als der dann angefangen hat quasi so eins zwei Monate später nachdem sie jemand gesucht haben haben sie ihm gesagt ja jetzt machen wir doch kein Solaris ZFS und da war er aber schon da und dann musste er da musste er in ein halbes Jahr oder ein dreiviertel Jahr war er da musste der was anderes machen und da hat er überhaupt keinen Bock drauf gehabt und er ist von Woche zu Woche immer mehr durchgedreht der Typ und ZFS das Fallsystem ja auf Solaris also auf dem guten Oracle Geschiss da und der ist von Woche zu Woche immer weiter durchgedreht da hatte den übelsten Knall der Typ der hat es halt irgendwann geschafft dass der seine seinen Linux Desktop hat er so eingerichtet dass wenn er mit dem wenn er mit dem Maus mit dem Mauszeiger an Bildschirmrand gekommen ist ich glaube das hat er gemacht dass er nicht einschläft dabei hat sein PC Speaker gesummt also es lief dann ab und zu so der ist dann mit dem Maus mit der Maus an der Rand gekommen vom Bildschirm und hat es dann gemacht das PC Speaker hat dann gesummt ich wusste gar nicht wie man sowas einstellt überhaupt die bescheuertste Extension die ich je gesehen habe naja zumindest der ist wie gesagt der ist immer der ist immer weiter durchgedreht der ist immer weiter durchgedreht mit der Zeit und wir hatten damals relativ viel was in Ruby programmiert war und dann hat er dann immer angefangen zwischendurch vor sich hin zu zu reden Ruby der ist immer weiter durchgedreht so irgendwann lief das dann so irgendwann lief das dann so dann ist er mit dem Mauszeiger gegen den Bildschirmrand gekommen also hat ein Known Desktop und er hat es auf dem Known Desktop geschrieben er wollte irgendwie nicht zugeben dass er das selbst konfiguriert hat das muss er selbst konfiguriert haben anders ist es gar nicht möglich ja und da ist er mit dem Bildschirm Zeiger mit dem Maus Zeiger an den Bildschirmrand gekommen hat er PC Speaker hat dann gesummt und dann hat er gesagt also hat er gesagt der scheiß Known Ruby der ist komplett abgedrehter Typ mit der Zeit gut nach dem dreiviertel Jahr war er dann wieder weg da konnte er wahrscheinlich irgendwo anders dann wirklich Solaris und ZFS machen aber der ist der ist immer weiter dem Wahnsinn verfallen ja gut wenn du auch eingekauft wirst für ein Thema was dich interessiert und dann kommst du hin und kriegst gesagt ey ne wir machen jetzt was ganz was anderes da kannst du schon ein bisschen durchdrehen im Kopf so ist der Download jetzt fertig ja was hier Tommy fragt hey Max ich programmiere schon ziemlich lange und es liegt mir eher im Gefühl als dass ich eine rationale Begründung dafür habe ob ich Referenz oder Value Types benutzt ach du groß jetzt hier kommt Big Brain Talk Expanding habe ich das hier überhaupt hier Expanding Brain kommt jetzt hier aber der Talk wird jetzt richtig Big Brain der reicht schon der reicht schon der 5 Kopf nicht mehr okay ob ich Referenz oder Value Types benutzen sollte mir sind die Unterschiede deutlich klar mit dem aber es gibt irgendwie eine Forstfolie eigentlich so scheiße du fragst mich jetzt hier Dinger nein nein Morpheus damit fangen wir jetzt nicht an ja also eine fällt mir ein wenn du die vergleichen willst ob die gleich sind weil Value Types ist standardmäßig sind die gleich wenn der Inhalt gleich ist Reference Types nicht also wenn du wenn du überprüfen willst ob was ich mein das ist nicht so dass das nicht mit Reference Types auch funktionieren würde du kannst einfach Equals da überschreiben funktioniert aber standardmäßig würde ich sagen ey wenn ich über wenn ich wenn ich überprüfen will ob der Inhalt gleich ist dann würden sich vielleicht Value Types eher anbieten weil da ist es halt einfach standardmäßig so oder aber wenn man kopieren will ohne das original zu verändern dann auch Value Types ansonsten keine ahnung also ich würde das auch eher nachgefühlt wobei ich ehrlich sagen muss ich verwende eigentlich fast nie Value Types ich verwende eigentlich zu 99,9% einfach Class und Class ist Reference und ich mach mir da eigentlich gesagt auch selten Gedanken drüber puh also ja gut in C++ ihr wisst ich bin ja der wahnsinnig große C++ Fan was das angeht unter C++ sagt jetzt ja dass das die C++ Pros sagen jetzt ja also da meine meine mit denen ich ganz dicke bin ne also die C++ Profis sagen ja man soll gar keine Pointer mehr verwenden soll also gar keine also keine richtigen Pointer mehr hier sondern man soll nur noch Smartpoint ne ne ne wie heißt das wie heißt das unter C++ heißt das nicht Smartpoint ne wie heißt denn das jetzt Unique Pointer und Shared Pointer und das ist Smartpointer ich glaube das sind Smartpointer und unter C++ soll man nur noch Smartshared Poin- Unique ja sind das nicht Smartpointer Smart Pointer oh ne das ist was anderes what the f- doch doch genau das hier meine ich also C++ Leute sagen jetzt ja man soll gar keinen normalen Pointer mehr verwenden sondern nur diese big brain Pointer die man nicht lesen kann also die da C++ Leute haben ja den Hang dazu alles mögliches kryptisch zu machen und deswegen sagen die ja hier soll man machen bei C++ finde ich es eigentlich relativ einfach sobald man das woanders braucht als in der lokal in der Funktion dann musst du ja nen Pointer verwenden bleibt dir gar nichts anderes übrig großartig einziger Unterschied ist einziger Unterschied ist ja ich weiß also was auch geht ist wenn man wenn man Funktionen aufruft dann kann ich das Ding oben nicht als Pointer Decklager in kein Referenz übergeben das funktioniert auch aber letztendlich in C++ finde ich ist es einfacher weil sobald man es nicht lokal in der Funktion verwendet muss es nen Pointer sein und hier muss man sich halt nicht ums aufräumen kümmern also Funktion lokal das übergreifen mehr oder weniger immer das du kannst ja immer kopieren oder mit uns ja das kann man machen aber das ist wozu soll ich mehr kopieren als ich das br was ist denn cbr ist das cbr cbr c++ also call by reference verstehe exzellent ganz big brain abkürzung heute punkt h alles klar nein ich brauche gar nichts in c++ aus das muss sein c++ kam ja kann man mich sonst vor jep kann mich c++ ok der download ist fertig oder ich bin schon wieder da exzellent worauf willst du das install ich will es mir einfach mal angucken also ich habe mir überlegt was wir machen ist folgendes die habe ich gerade schluck auf das ja also was ich mir überlegt habe ist folgendes wir installieren uns 2019 server 2019 dann gucken wir mal wie remote access funktioniert angeblich kann das ja mittlerweile ssh mal schauen mal schauen mal keine ahnung habe ich nicht ausprobiert müssen wir mal schauen dann gucken wir wie man da eine statische html seite aus dem kann dann gucken wir wie man da mittlerweile packages nach installiert so ob man da zum beispiel einfach den engine x nach installieren kann wahrscheinlich nicht renax kommt das kommt manchmal vor jetzt hier wir waren schon mindestens zwei leute drin die ich von der arbeit kenne das ist wahrscheinlich habt ihr das nicht so mitgekriegt aber kommt manchmal vor so dann gucken wir mal wie man da nen file server macht dann dann will ich mal gucken wie man docker unter windows installiert weil das geht ja angeblich und ist ganz toll dann gucken ob man hyper wie installiert kriegen und wsl und so weiter mal schauen mal schauen ja mal gucken wie wir das auf die reihe kriegen es wird aber es wird aber wahrscheinlich echt eklig werden kann ich jetzt schon sagen weil windows ist halt pauschal eklig ok also virtual machine custom next next äh nicht linux hätte auch nicht gedacht dass ich in nächster zeit hier mal wieder umsteigen aber ist das sound zu laut nö passt da eigentlich ganz gut oder sound zu laut ticken leiser ticken lauter passt so oder also wenn ich sehe hier ist meine stimme da ist sound und ähm das ist ja decibel logik also sprich das da ist quasi nur irgendwie nen viertel so laut wie das da dann weil decibel logik weil scheiß einheit scheiß skala ist ja keine einheit bisschen lauter können wir machen können wir ein bisschen ticken können wir natürlich gerade mal kurz zurück machen wo es so schön laut war ja so lassen wir es jetzt exzellent so also windows jetzt kommen wir ja aus dem windows server 2016 ok 2019 gibt es dann noch gar nicht next äh das ganze installieren wir übrigens auf e vms new folder äh cacw komm egal wie das ding heißt äh next uevi boot ok äh cpus äh vier stück mit vier kerne 4096 mb ram sollte erst mal reichen bridge network weil ich will vielleicht auch von außen drauf zugreifen mal gucken äh was auch immer next ja wenn du das als ssd machen willst mach ssd virtual disc 60g reichen reich Leute reichen 60g ja bestimmt bestimmt 63 muss muss reichen wir machen da nichts großartig mit das müssen wir gleich mal gucken wie groß der windows server nach der installation nach der installation ist mal gucken mal gucken ob das mal gucken wie groß das ist so next customize hardware äh ja gut display müssen wir dran lassen drucke mal weg soundcard lassen wir mal dran weil ich wissen will ob dort auch cortana am anfang rumschwätzt finish ok power on was no i finish install ja nerv mich ok cd rein settings iso images downloads dieser dateiname macht mich echt fertig äh wer hat sich das denn ausgedacht war microsoft wieder ok und neustart windows installieren zack äh ah vielleicht sollte man cd laufwerk einschalten dann gehts dann gehts auch excellent view stretch oh ne ich war zu langsam jetzt noch mal press any key kann ich ein nice bekommen so language install englisch time currency setzen wir mal auf german ost in belgien reden in belgien ja doch teile in was warum kam jetzt nicht germany germany danach und next install nema ja ja ja das gibt es leider noch nicht als sprache so was können was können ok was ist der unterschied data center und standard desktop experience was ist denn da der unterschied dazwischen meinen die mit des options voll voll windows ne das brauchen wir nicht das brauchen wir nicht ich will ich will also ich brauche da kein transparenz und hintergrund ich brauche aber halt das normale windows geklicke weil ich sonst nicht weiß wie man das einrichtet manage with command prompt powershell oh ne das ne ne das das das geht nicht das da hab ich keine ahnung wie es funktioniert dass man das desktop experience nennt das klingt schon so fancy irgendwie schon ja ich brauch auf jeden fall desktop also mit powershell bin ich nicht in der ich weiß ja nicht mal wie ich das windows admin center überhaupt starte wobei ich würde es ja gerne sehen wie das das probiere ich jetzt mal aus nema snapshot es geht ja schnell das geht ja schnell ich probiere mir jetzt einfach mal aus ich will mal wissen wie ein windows ohne grafische oberfläche aussieht das wird mich jetzt mal interessieren das ist bestimmt gebaited sieht bestimmt genauso aus nur dass einfach kein desktop geladen wird obwohl alles dabei ist custom next das installieren geht ja schnell das dauert 5 minuten oder so full experience eh full experience machen wir danach weil ich kann windows wahrscheinlich nicht managen gescheit ohne grafische oberfläche ich weiß jetzt schon dass ich mich darüber aufregend werde wie unnötig kompliziert alles ist man muss ja sagen vieles ist unter linux auch nicht wirklich intuitiv aber man hat sich dran gewöhnt wahrscheinlich ist es bei windows admin ist es für windows admins ähnlich zum beispiel unter windows ist es auch total und intuitiv dass alle programme irgendwie unterschiedliche parameter haben ja mal ist es minus minus version mal ist es minus groß v mal ist es einfach nur leerzeichen version mal ist es keine ahnung minus version groß minus version klein also sprich das ist unter linux auch überhaupt nicht einheitlich was ich aber witzig finde unter windows ist es auch nicht wirklich einheitlich obwohl es mal eben gut ich meine microsoft kriegt es auf dem desktop ja auch schon mal nicht hin also warum soll ich diesen server hinkriegen das ging schnell das ging echt schnell das hat eine minute gedauert den kram zu installieren big brain speed jetzt bin ich mal gespannt wie das aussieht ohne grafische oberfläche bis jetzt sieht es vollkommen normal aus nur halt nach windows sogar mauszeiger habe ich schon gesehen wahrscheinlich geht da einfach powershell fenster auf ja ist ja gerade abgekackt oder ist es normal dass er sich neu startet kann es sein dass es kaputt ist ah nee moment ernsthaft what the fuck das ist ohne grafische oberfläche das ist doch nicht ohne grafische oberfläche da wird einfach kein desktop gestartet es stinkt am allen kratz microsoft ok jetzt mal ernstgemeinte frage warum sollte ich diese variante überhaupt installieren ich meine die paar gigabyte festplattenplatz machen sie auch nicht aus oder das ist das wird weder schneller sein noch sonst was also warum ok user password ok also ok moment ich habe rechts reingeklickt fack wie kriegt es wieder weg ok ok 123456 123456 unable ah das ist nicht kompliziert genug verstehe selbst als admin darf ich das nicht ok 123456 underscore 123456 underscore auch nicht oh jetzt wirds aber big brain 123456 underscore groß a 123456 underscore groß a ah das geht ok das ist viel sicherer ok ach du scheiße das ist wirklich einfach so ein komisches cmd ding was passiert dann jetzt wenn man control alt entfernen drückt es geht ein neues fenster auf und ich kann den task manager aufmachen sogar der task manager ist dabei das ist doch nicht ohne grafische oberfläche das ist eine ganz normale grafische oberfläche nur dass kein desktop gestartet wird kann man kann man hier ok ok ok ok ok run new tasker guck mal ich kann jetzt hier drüber sachen starten dann an die pausen kann ich nicht weil kein desktop gestartet ist cmd die powershell powershell aha echo null null was jetzt natürlich richtig big brain wäre wenn ich von hier wsl nachinstallieren kann und einfach ganz normal das ding verwenden kann wie linux aber das wird nicht funktionieren ok ich brauche einen grafischen desktop sonst komme ich mach mal explorer nee das gibt es bestimmt nicht explorer kalk auch nicht ok die haben wirklich die ganzen grafisch sein also der unterschied ist im prinzip nur dass die grafischen sachen nicht installiert sind was soll ich probieren abwitz was abwitz witz cpl geht nicht wie konfiguriere ich das ding eigentlich jetzt wie installiere ich jetzt hier sachen ok sign out switch user cancel cancel ok wie installiere ich jetzt überhaupt sachen drauf nougat gibt es das konfig wow das sieht ja aus wie windows 2000 1ks also ich will jetzt als erstes mal den desktop nachinstallieren wie mache ich das denn ok remote desktop 7 enable less secure ok habt ihrs gesehen man hat einen kommando zeilen konfigprogramm aber es ploppt immer noch ein ok fenster auf wo man drauf drücken muss windows logik wie kriege ich jetzt die ip adresse von dem ding raus mein was interessiert mich dieser komische kackname ich brauche die ip von dem teil configure remote management network settings da 2.130 alles klar ms tsc und 130 ist es administrator 1 2 3 4 5 6 underscore a yes high res high res ohne desktop ok grandios kann man jetzt die auflösung hier hoch stellen font erstmal ein bisschen fetter machen das ganze so ist das ist das nice es passt natürlich nicht genau drauf das wäre auch sonst so einfach ok wie wie kriege ich jetzt den desktop wieder drauf weil ihr mein hier kriege ich ja kriege ich ja absolut anfälle bei und das sage ich als linux mann der den ganzen tag auf der kommando zeile setzt oder kriege ich zu kriege gibt es zumindest ein schönes gui für windows konfig in irgendeiner art und weise das kann nur die zukunft sein oh guck mal guck mal telemetrie settings telemetrie settings habt ihrs gesehen das gibt es sogar in der windows server ja yes warum muss ich mit der maus zwischendurch klicken was ist für ein schwachsinn ich habe ich habe den terminal konfig ja aber ich muss zwischendrin immer noch klicken was bei windows 2019 musst du komplett nach installieren ernsthaft jetzt ok ich bin ich bin nicht begeistert aber ich habe das auch nichts anderes erwartet chat ich glaube euch aber ich muss mal kurz wirklich reinstall desktop install desktop experience ok blablabla können die einfach zum punkt kommen ok log in als start server manager ok add roles and features wo ist das add roles and features roles and features ich glaube ich bin hier gar nicht im richtigen tool drinnen ok ok start server manager from cmd ok es heißt einfach server manager alles klar server server manager exe ok aber wenn server manager nicht ohne guis wie mach ich denn da überhaupt was da muss ich die ganzen powershell sachen kennen oder und gut ok ok ich ich ich bin überzeugt ich muss die desktop experience nehmen ich bin ich bin überzeugt chat kuchendienst drei monat dankeschön excellent subscription ich ich resette snapshot mit desktop experience hätte sein können vor allem warum kann man das nicht nach installieren das ist ja total hängen geblieben warum es ergibt überhaupt keinen sinn microsoft logik ok also sind wir stehen geblieben standard ok standard desktop experience next ich hätte nachgucken soll ich den speicherplatz belegt jetzt auch ja hätte ich machen können jetzt zu spät next ich starte schon mal meine linux vm hier mit dem ppega board dass ich keine fragen verpasse und ich brauche ja nachher ich brauche ich muss unbedingt ssh zugang testen weil ich habe irgendwo letztens gelesen dass man mittlerweile den ssh server installieren kann unter windows das muss ich unbedingt ausprobieren er darf das vor allem mit was läuft das denn dann cmd in ssh oder oder was da bin ich mal gespannt drauf so jetzt installiert auch ein bisschen länger aber geht trotzdem schnell power shell big brain 5 hat baldrian die frage stellt ich weiß nicht genau was ich bezieh ist aber die frage stellt sich bei mir nicht weil ich werde mir noch in der produktiven umgebung einsetzen ich will es mir einfach nur mal angucken damit ich wieder damit ich wieder weiß warum ich will dass ich mag toxics minus 380 ja komm da geht aber noch ein bisschen mehr oder also es gibt ein paar sachen das zum beispiel was easy killer anspricht es gibt ein paar sachen die würde ich tatsächlich mit windows machen also wenn ich sie machen müsste also active directory geduld ist halt mit samba scheiße muss man auch mal sagen wenn ich was gibt es dann sonst noch schönes wenn ich windows client management deployment was auch immer machen muss also alles was irgendwie mit ad und windows management zu tun klar das würde ich mit windows machen terminal remote terminal server mit mit rdp mit dieser neuen rdp extension würde ich auch logischerweise mit windows machen ach so warum man nicht die desktop xp das stimmt das ist richtig ich finde es trotzdem blöd dass man sie nicht nach installieren kann ich meine er spricht warum nicht ich meine ich kann ja beispielsweise unter irgendeinem sagen wir irgendwie ich habe einen ubuntu server da kann ich auch einfach das paket für desktop installieren dann schicken wir mal ein desktop drauf klox hd aiya ja aber sowas von und ansonsten wo würde ich den noch ganz ehrlich wo würde ich noch windows einsetzen vielleicht wenn ich auch cortana cortana light vielleicht wenn ich in game stream firma wäre weil ich spiele nur unter unter windows laufen wobei ja auch da stadia lief ja auch unter lief stadia unter linux oder bsd ich glaube stadia lief unter linux zum größten teil die playstation hat bsd hat free bsd als kernel oder minimal betriebssystem drauf ok pass mal gucken ob ich jetzt hier 1 2 3 4 5 6 machen darf oder ob das auch die night wird finish ok da war wir das gleich 1 2 3 4 5 6 underscore a 1 2 3 4 5 6 underscore a liegt gleich klipp machen ich komme da auch nicht mehr rein mal das video gesehen wo fail overflow linux auf der ps4 zum laufen bekommen hat nee aber ich habe ein paar videos dazu gesehen man kann den username von admin nicht ändern ja jetzt am anfang nicht vielleicht später schon aber ich könnte mir vorstellen das administrator so ein ding ist ok fuck es sieht wirklich aus wie windows 10 aber nur reinklicken reinklicken geht nicht mehr reinklicken geht nicht mehr jetzt wollen sie es aber echt wissen da ist auch der server manager ok jetzt ok das ist das ist genau das was ich von windows server erwartet habe nach der installation erstmal 5 pop ups und internet explorer den habe ich auch erwartet also do you want to allow your pc to be discover yes windows admin center brings together ok es ist internet explorer guck mal die blocken sich sogar selbst die blocken sich sogar selbst du kannst ihn selbst nicht mal aufmachen geh weg geh weg weiche weiche ok was wollen die von mir windows admin center ist ein lokal bereitgestellte browser basierter ok elektron verstehe laden sie windows admin center aus dem microsoft evolutions ok mein mein ich soll admin center aus dem evaluation center runterladen mache ich wie geht denn das ok schon mal nicht schon mal nicht mit internet explorer ok wie krieg ich einen ordentlichen browser das läuft hier gar nicht mehr wie krieg ich denn ok chrome chrome chrome ok nein nein ich will chrome nicht auf deutsch was ist das ich will ich will chrome auf englisch haben chrome nicht beta chrome englisch en nein aha ja was ist das eigentlich von kack kann das mal weggehen wie kriege ich da jetzt chrome drauf ok ok wir probieren das mal mit mir aus port ich habe so keinen plan davon ok edge kann man edge ist edge da nein wie kriege ich da ok ok wie krieg ich da du darfst nichts downloaden ja ich merks ich hab ne idee ich hab ne idee chip wir laden uns von chip alter wind aha ich krieg anfälle chrome 14 spit download excellent ja chrome download jawoll naja naja alles gut alles gut bitte aktiv ok ok das ist die erste hürde wie krieg ich den gescheiten web browser drauf ich muss ja einen gescheiten web browser drauf kriegen dass dass ich mir das windows admin das admin center angucken kann ok ok ich muss ich hab ne idee ich hab ne idee was unter internet option ok internet option ne ne wir machen das anders ich hab ich hab big brain big brain 360 die idee wir installieren jetzt erstmal forever tools installieren forever tools und wenn ich forever tools installiert hab dann copy paste ich mir ne chrome exe von meinem host drauf so so machen wir das jetzt hoffentlich hoffentlich kann man forever tools installieren weiter ok da muss ich das stretching ausmachen sonst packt er rum standard installieren excellent excellent server manager für ee sicherheitseinstellung nein nein nein wir machen keine ee sicherheitseinstellung ee weg so yes start neu hat er stand da grad stopping telemetrie services warum warum laufen auf meinem server überhaupt telemetrie services kann man das nicht mal auf den server schalten so send control alt entfernen 1 2 3 fels underscore a so und jetzt schalten wir er die ne ja ja ja lass es mal auf lass mal auf lass mal auf alles gut lass lass auf so guck ich mir gleich an so und jetzt moment download chrome ja ich weiß dass ich schon chrome hab ich weiß dass ich schon ich will chrome ich will chrome nochmal nochmal laden excellent easy easy outplayed ha ha wieso ist eigentlich auf dem server internet explorer und nicht edge drauf eine exellente frage kann man kann man edge wenigstens nach installieren remove vielleicht vielleicht kann man irgendwie edge da drüber aktivieren weil microsoft nicht will dass man surft ja deswegen haben sie internet explorer drauf gemacht er geht schon gar nicht mehr das problem ist ja ohne paket manager ist es halt naja optional features was auch immer also ich meine ich brauche einen browser dass ich mir das hier angucken kann so google chrome jawoll auf geht's so jetzt kann ich mir endlich das admin center angucken also was wollt ihr von mir download admin center mache ich continue noch einmal ja ja ja ja ja ja ja ja ja ja jetzt eingeben kann jetzt ok 0 continue 0 continue 069 000 continue next sollte einem das wort evaluation nicht angst machen auf ein produkt hier eigentlich schon ja so Oh, jetzt bin ich mal gespannt was da jetzt so geil dran ist, ja jawoll, äh bei der Suche nach meiner, was, das macht er doch eh schon oder, warum muss ich das eben installation vom admin center auswählen, was auch immer, was? gateway server, what the fuck, ich hab keine Ahnung was der von mir will, winrm, was ist winrm, gateway endpoint, ok Moment, also Microsoft hat doch vorher gesagt, das ist eine lokale browser Anwendung, was will der jetzt von mir, ach windows remote management ist das, aha windows admin center, ja weiter, 4 für 3, ach so meinen die das mit lokaler web Anwendung, ich meine gar kein elektronen Zeug, verstehe, du installierst dir gerade einen webserver, wahrscheinlich ja, sieht so aus, mal gucken was er macht, das admin center hat auf einem server nichts zu suchen, aber warum schlägt der mir das denn vor, dass ich das installieren soll, was auch immer, wir installieren das jetzt mal und gucken was das ist, öffnen sie diese url in einem browser auf einem pc, nein doch doch nicht im internet explorer, alter nicht im internet explorer, ok, administrator, nein, administrator, 356, underscore a, save, das admin center, da ist es, fertig stellen, big brain admin center, ok, winrm, so, extensions, oh jetzt wirds aber richtig big brain hier, update für das azure security center, natürlich immer update, update, nicht dass ich das azure security center brauche, ist das so eine art, also es sieht nicht so aus ja, aber es sieht ein bisschen aus wie die microsoft account settings und das azure frontend, das kind quasi aus microsoft account settings und azure frontend, das was ich hier sehe, hier oben gibt es eine powershell scripts, kann man eine konsole aufmachen, nee, man kann nur vorgefertigtes scripts, das da oben gebatet, das tut so als wäre es eine konsole, ist aber gar keine konsole, warum ist da ein internet explorer drauf, weil das der einzige browser ist, der standardmäßig installiert ist, remote powershell, so, das erste was wir jetzt mal machen noch ist rdp einschalten, wie schalte ich rdp ein, ok, one figure this local server, install windows update, ah wie macht man eigentlich windows updates hier drüber, auch so, update, some settings are managed by your organization, echt ich bin meine organisation, ok wie macht man rdp an, manage tools, wobei wir haben doch schon vorhin gelernt wie man das macht, sconfig, configure remote management, enable remote management, ha, big brain, muss 2-3 mal zoomen bis alle, wow, ok wo steht hier remote management, ich seh es, ach hier da, jetzt ist remote management enabled und desktop is disabled, was, remote desktop firewall exceptions, ja, nein alles darf sich connecten, ok und jetzt kann ich da drauf, ok, ausprobieren, oho, 123456, ah, 123456, underscore a, remember me, ok, neues zertifikat, alles klar, da sind wir, it's magic, oh, moment, diese komischen windows gesten gehen auch unter rdp, sehe ich das richtig, big brain kommt nicht von alleine, gut, das können wir wieder ausmachen, das brauchen wir nicht, gut, jetzt kann ich zu den eigentlichen Sachen mal übergehen, die ich ausprobieren wollte, zum beispiel wollte ich den ssh server installieren, ssh, nee, add, nee das war's anderes, connect to the windows account, continue, was, nein, what the f, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, Da gibt es jetzt links die Remote-Power-Shell, ah ne, das ist Remote-Desktop, Moment ich kann das Remote-Desktop in meinem Remote-Desktop aufmachen? Moment geht das? Was? We are not valid. 1, 2, 3, 4, 5, 6, underscore A. Natürlich sind die valid. Das erinnert mich irgendwie an Yo-Dog. I put RDP in your RDP, I can RDP while RDP. So kann man hier suchen, also SSH. Hallo, search, ok. Ach so meinen die das mit. Ok, add. SSH, wie installiere ich hier ein SSH drauf? Rolls. Das ist schon an? Wirklich? Wie läuft's mit de Vibers? Du meinst mit den Hockengrills? Fuck-Server. Ok, also ihr sagt, der ist schon drauf. Das können wir ja mal ausprobieren, ob der schon drauf ist. Und zwar, ah ne, da gehen wir nicht hin. Wir gehen auf unsere Niedungskiste, SSH, 1, 2, 1, 2, 1, 2, 1, 3, 0. Nein, der ist nicht drauf, der SSH also aber. Gebaided, chat. Gebaided. Ach ne, Firewall-Regeln sind nicht erlaubt, kann das sein? Firewall. Firewall-Network, schalt mal einfach aus. Willst du mal Kinder haben eigentlich? Nein, auf keinen Fall. Private Network Active, mal schalte das einfach aus. Windows Defender Firewall, aus. Weg, weg damit. Ach guck mal, es pinkt da auch. Ok, jetzt. Ne, gebaided, siste Leute, kein SSH drauf. Warum gibt es hier oben eigentlich kein Suchknopf? SSH. Wie geht das, dass er Better Twitch Demotes in deinem Stream-Chat anzeigt? Das macht das automatisch. Wie kriege ich hier einen SSH-Server installiert, Leute? Seht ihr das irgendwo? Demote-System. Fuck-Server. Ok, Moment, Moment. Windows 2019 install SSH-Server. Optional Features. Aha. Apps. Apps and Features. Also ich hab ja Mitleid mit jedem, der den Kram administrieren muss ohne die Oberfläche. Apps and Features. Manage Optional Features. Add Feature. Äh, kann man jetzt hier, nein, natürlich kann man hier nicht suchen drinne. Open SSH-Server, aha. Da ist es. Hat das jetzt installiert? Warum kann man hier eigentlich nicht drinnen, Moment, ist der Open SSH-Client. Add Feature. Moment. Hä? Doch, gerade gemacht. Open SSH-Server. Der installiert das nicht. Warum installiert der das nicht? Alter Microsoft, please, warum sind die Sachen so unglaublich beschissen unter Windows? Ok, Max, bitte über den Server. Alles klar. Ist das Server-Manager das hier? Moment, ist das, meinst, wo ist das überhaupt hin? Du meinst das hier, oder? Server-Manager. Ok, dann, dann schieß los. Wo geht das jetzt? Local Server, Remote Management. Oben rechts, Manage. Kripplistner. Und dann Add Roles and Features? Ich find's aber geil, dass das hier drüber nicht funktioniert, ne? Obwohl das Microsoft, ach, kommt mal. Was macht der da? Was macht der da gerade? Das ist ziemlich langsam, ne? Ok. Ach, ihr meint die Windows-Updates würden nicht funktionieren jetzt? Pending Restart. Soll ich wirklich jetzt rebooten dafür? Ok, also was müsst ihr jetzt hier machen? Add Server Selection before you begin. Ok, next. Role. Ok, was? Ach, hier kann man den Server auswählen, das ist einfach nur... So, und da kann man jetzt bestimmt SSH irgendwo auswählen oder auch nicht. Features. Ah, SSH, hier. SSH Server. Was? Nicht SMTP. Äh, meint. Komm ich auf SMTP? SSH? Null. Äh, gibt's nicht? Äh, ja. Aber ich kann ein Interia-Client installieren. Fuck Server, Alter. Ah, ok, also das mit SSH Server installieren scheint nicht so zu tun. Ähm, ich muss jetzt wohl erstmal warten bis Windows-Updates fertig sind. Eventuell das Open SSH. Oh, Big Brain Chat. Big Brain. Guck mal mal. Ja, ja, ja. Hallo? Windows? Windows? Will Gates guckt gerade persönlich nach. Local Host Timeout? Ok, wait. Ok, vielleicht liegt es wirklich an Windows-Updates, dass der rumspackt. Ok, Leute, Leute, ich sag euch mal was. Ich sag euch mal was. Es ist Windows. Das dürfen wir nicht vergessen. Restart. Jaja. Danach geht das. Danach geht das. Reboot. Reboot hilft bestimmt. Guck mal, wer Rebooted hat. Getting Windows ready. Don't turn your computer off. Alles klar. Mir ist es absolut unbegreiflich, wie man sowas wirklich verwenden kann. Das versteht es nicht. Wir machen docker. Gleich haben wir docker drauf. Ja. Gleich haben wir docker drauf. Das wird jetzt lange. Warum? Warum braucht der 30 Stunden dafür? Ich hab doch gar nichts gemacht. Was gettet er da eigentlich ready? Oh. Ach, Updates. Ok, Big Update. Alles klar. Danach installieren wir Hyper-V. Und machen eine VM in der VM. Wir machen da eine Linux-VM in der Windows-VM. Wisst ihr, und ich denke immer, dass es schon eine Zumutung ist, wenn ich mal ein Ubuntu oder ein Debian oder ein Ratchet oder sonst etwas machen muss und der da 10 Minuten rumröten. Wobei 10 Minuten ist viel zu lang. 5 Minuten. Ach guck mal, er startet. Excellent. Trusted Installer. Aha, G-Bated. You got G-Bated. Man dachte er ist fertig. Er war gar nicht fertig. Jetzt haben wir's. Jetzt haben wir's Leute. Jetzt gehen wir wieder an unseren Remote Desktop. Yes, don't ask me again. Aha, da sind wir wieder Leute. Da sind wir wieder. Das ging tatsächlich relativ schnell. Moment, wir haben, wir haben. Was ist das? Was ist hier los? Oh. Was hat er für Schmerzen? Warum ist das jetzt alles rot? Ich hab doch gar nichts gemacht. Ich hab, ich hab doch legit nichts gemacht. Oh guck mal, es geht weg. Es geht weg. Es geht langsam weg. Habt ihr das gesehen? Jetzt sind es nur noch 5. Ah, delayed start, ok. Stand ich auch dahinter, delayed start. Ok, also können wir das ignorieren. Was macht denn eigentlich unsere SSH Server denn? Apps? Features? Warum kann man hier eigentlich nicht drinne suchen? Ok, es scheint installiert zu sein. Scheint installiert zu sein. Open SSH Server. Poggers. Ok, gleich mal gucken, ob es funktioniert. Nein, nein, nein, nicht dahin. Geh weg. Was? Man muss bestimmt den Service starten noch. Ok, Service. SSH. Nee, Open SSH. Open SSH Server, der ist nämlich nicht gestartet. Starten. Jetzt aber. Jetzt aber. Bam. Housekey Verification failed. Ja, den Scheiß können wir immer wieder komplett löschen. So, yes. Nein, Administrator. Administrator. Root ist so einfach zu tippen, ne? Kannst du mal PowerShell Remote probieren? Ja, probier mal, probier mal gleich aus. Fingerprint. Oh, MonkaS. 123456, underscore A. Da sind wir. Leute. Exzellent. Wir sind Remote über SSH auf ne Windows Server und haben ne CMD offen. Und das ist also Batchgedöns. Das ist PowerShell. PowerShell. Komm, man kann sogar ne PowerShell starten. Huge Poggers. Also, das geht ja nicht unter, unter Windows. Ah, man kann sogar ne PowerShell starten. Kann man auch SSHX Forwarding machen? Hehehe, nee, das ist zu schön. Moment, startet er das jetzt auf meinem? Wartet mal kurz, Leute. Ok, die haben keinen Bock. Startet er das jetzt? Wenn ich das jetzt hier starte in der PowerShell, startet er das jetzt auf meinem Desktop? Nee, der macht einfach gar nix. Alles klar. Was auch immer. Äh, wie kommt man hier raus? Exit. NapGuaMoase. Exit. Ok, machen wir mal SSH GUI Weiterleitung. 1, 2, 3, 4, 5. Moment, kann man Keys kopieren? SSH CopyCopyID. Nein, das wär auch zu einfach, wenn das funktioniert. Server Manager. Nee, ok, also das wär auch zu abgedreht, wenn X Forwarding funktionieren würde. Äh, ja, LS ist ein Alias in PowerShell. Es gibt ein paar Sachen, wo sie den Linux Leuten entgegen kommen wollten, was sie in PowerShell eingebaut haben. Ok, also das, das, das funktioniert schonmal. Bin ich, ich bin ja zum Teil begeistert. So, wie macht man den Server Manager wieder auf, wenn man zugemacht hat? Da war er. VGET ist auch ein Alias. Sag mal, wie lang brauchen eigentlich die Services, bis die starten? Jetzt mal ehrlich, das dauert ja 10 Minuten, bis der Kram auf ist. Was sagst du, VGET gibt's? PowerShell. Moment, was ist das? Oh, das kenn ich. Das ist diese komische PowerShell IDE, die dabei ist. Gehst sofort. PowerShell. VGET, kommt ein Problem aus. VGET ist ein Alias auf den Internet Explorer. Was, was soll ich davon halten jetzt? Los. Gibt's einen CURL? Gibt's auch einen CURL? Das ist ein fucking Internet Explorer Link. Das ist so kaputt. Ok, die Services sind immer noch nicht gestartet. Alles klar, ok, weiter, weiter im Text. Also, es ist ja schon mal nicht schlecht. Wir haben's ja schon mal geschafft. Jetzt ist es hart Zugang zu installieren. Mit kann ich zwar nichts anfangen, aber... Ach Moment, Parrot Life. Gute Idee. Nein, das geht nicht. Das geht nicht. CURL Mache mal ADD anstatt CLOSE, ok. Ich ADD jetzt einfach alles. Ich muss das gerade doppelt ADDen. Was du bisher verpasst hast, viele merkwürdige Windows Sachen. Also, by the way, wer sich fragt, wie die Seite aussehen sollte. Eigentlich sollte die Seite so aussehen. Mit einem normalen CURL funktioniert das ohne Probleme. Aber das Beste ist ja immer noch... Ah ne, das hab ich jetzt hier nicht gestartet. Du kannst doch den IE komplett rausnehmen. Ah ne, darf ruhig so bleiben. Ok, der Kram, der mag nicht starten. Das ist wirklich... Ah, das ist stopped. Ok, wenn es absichtlich stopped ist, dann muss es das doch auch nicht als rot anzeigen. Ok, nächste. Wir ignorieren das jetzt. Ok, weiter im Text. Ich bin mir nicht sicher, ob ich das jetzt ernsthaft machen will, weil ich hab mir aufgeschrieben, ich würde gerne eine statische HTML-Seite hosten. Aber nachdem ich gesehen hab... Was das für ein riesen Act ist, so einfache Dinge anzumachen. Wie würde ich eine statische HTML-Seite hosten? Ok, add roles and features. Ich mach das mal als Windows-Noob, ja. Skip this page by default, ja. Als Windows-Noob, der echt keine Ahnung davon hat. Also Windows... Ich suche... Ich würde jetzt nach Web-Server suchen. Ich würde jetzt nach Web-Server suchen. Web-Server. Add features. Next. Äh, brauch ich da alles net? Talent client, das macht mich immer noch fertig, dass es ein eigenes Feature ist unter Windows. Next. Naja, next. Was will er von mir? Was, dritte von unten? Wireless... Der WLAN-Service. Ok, next. FreshBK, was denn? Drei Minuten macht doch nix, drei Minuten geht doch schnell. Oder meinst du damit, es dauert nicht lang. Äh, static, static content. Ja, genau das brauch ich, static content. Next. Install. So. Also, er installt jetzt auf Nabukumamasa, sei. Alles klar. Easy. Also für mich als Linux-Mann ist das eher... Es ist auf eine gewisse Art und Weise unterhaltsam, aber auch nur vor dem Hintergrund, dass ich weiß, ich muss es nie verwenden. Weil wenn ich wüsste, ich müsste das verwenden, dann würde ich wahrscheinlich eher verzweifeln da dran. Ok, Klaus. Jetzt hab ich nen Web-Server installiert. Guck mal, man kann das sogar da drüber verwalten, das ist ja richtig big brain. So, und jetzt irgendwo ne statische HTML-Seite reinlegen. Wo ist denn hier so der... Der www-Root quasi, wo ist denn das hier? Nickteaming, ist das sowas wie Bonding? Noch nie nen Arbeitgeberwechsel in Betracht gezogen. Ja doch, wenn ich Windows-Server machen müsste, dann schon. IES-Manager, ist das doch hier der IES? Nee. Oben rechts Tool? Ah, hier der Internet Information Services Manager. Ah, Big Brain Tool. Sieht wahrscheinlich seit Windows 2003 genauso aus. So. Also das heißt, wenn ich jetzt auf den Server gehe, hab ich dann schon ne Seite? Äh, was war's? 130, 230, 130, ne? Oah, Porgers. Es ist schonmal ne Seite, das ist doch schonmal gut. 2003 war noch etwas eckiger. Wie willst du das von dir entscheiden können, wenn du noch nie mit Windows gearbeitet hast? Ich hab genug mit Windows gearbeitet, dass ich weiß, ich will damit nichts zu tun haben. Zumindest nicht live, ja? Jetzt hier ein bisschen mit rumspielen ist ja eigentlich ganz nett, aber nee, nee, nee, nee. Geh mal bloß fort. Jedesmal, wenn ich mit Windows was machen muss, krieg ich absolut Anfälle, wo Sachen versteckt werden. Ich mein, allein schon die glorreiche Idee von Microsoft, dass dieses komische Feature hinzufügen Telnet kleint. Ich mein, ganz im Ernst, wer hat sich das hier überlegt? Warum gibt's hier keine Suche drin und solche Sachen? Warum? Das ist alles total, total zusammengestückelt irgendwie. Ich will nicht sagen, dass das unter Linux die Usability, dass Usability mecker ist oder so. Da gibt's auch genug viel Scheiß, ja? Keine Frage. Aber es fühlt sich alles nicht so hakelig an. So, okay, ich will eine statische HTML-Seite anzeigen. Wie mach ich das? Start-Seite, die Start-Seite ist hier. New Site. Wo ist mein www-Root? Wo muss ich eine statische Seite hinlegen? Unten umschalten auf Content. Ah, ah, guck mal da. Ah, Big Brain. Add Website. Okay, wir machen jetzt mal eine ganz, ganz tolle, äh, statische Website. Dann gehen wir mal irgendwo hin. Ahnung. C. Enet-Pupp, da rein? Oh, guck mal, wir haben einen richtig echten www-Root. Krasser Shit. Alter. Das heißt ja noch www-Root. Okay. Poggers.html. Ähm, hallo. Komm, egal. So, kann ich da jetzt direkt drauf? Poggers.html. Nein. Ach, stimmt. Oh, es ist ja Windows. Ja, ja. Es schmerzt, es schmerzt. Okay, View. Dateierweiterung. File-Extension. Yes. Boah. Okay, wir haben es geschafft. Web-Server am Start. Wahnsinn. Die Seite sieht ja auch aus. Sehr gut. Sehr gut. So. Ähm. Okay, und jetzt kommen die, jetzt kommen die schwierigen Sachen. Also ich hab mir aufgeschrieben Remote Access. Dann guck mal, ob SSH installieren kann. Äh, ob man einen Web-Server installiert kriegt mit einer statischen HTML-Seite. Dann ob es so was wie einen Paket-Manager gibt, aber sowas wie einen Paket-Manager gibt es nicht. Es gibt hier dieses Rolls- und Features-Update-Gedöns, aber es hat ja mit dem Paket-Manager nichts zu tun. So, und jetzt wollen wir mal Docker installieren. Da bin ich jetzt mal wirklich sehr gespannt drauf. Docker unter Windows ist ja Hyper-V. Zumindest war es das am Anfang. Ob das immer noch so ist. Deswegen müssen wir das glaube ich hier mal stoppen, den Server anhalten und Virtualisierung einschalten, dass das klappt. Äh, bin ich jetzt auch vom Server drauf? Shutdown. Unplanned. Okay. Docker unter Windows ist cute. Sicher. Docker, ah, Windows-Container laufen ohne Hyper-V, aber eben nur Windows-Programm. Okay, verstehe. Aber man kann doch, man kann doch auch Docker-Container machen mit Linux-Programm, oder? Und dann ist es ein Hyper-V-Container. Äh, Hyper-V-VM. Also, Options. Wo ging das jetzt nochmal? CPU. Virtualize. Das da. Power on. Paket-Manager-Install-Package. Ja, aber da kann ich nicht einfach sowas wie, sagen wir mal, Firefox. Nee, na gut, Firefox ist ein doofes Brand. Nginx installieren oder sowas? Echt? Das probieren wir mal aus jetzt gleich. So, immer wieder RDP drauf. Das liest sich so als wärs PowerShell, hä? Liest sich ein bisschen so als wärs PowerShell. Was? Find-Package. Find-Package. Find-Package. Okay, Nginx. Oh, ich kann mal net, ich glaub, so schreibt man. Was? Nougat is not installed. Yes, mach einfach. Yes. Oh. WTF? Ah, der findet's nicht. Okay, das ist dann bloß für Windows eigene Geschichten. Das ist nix mit, äh, das ist nix für normale Software. Nee, nee, was kann man da so zum Beispiel installieren? Docker? Ah. Ah nee, Find-Package. Das sind PowerShell Extensions, hä? Visual Studio, mal Visual, äh, Visual. Keine Ahnung, Code. Was auch immer. Okay, was mach ich? Windows Server Host, Windows Server Container. Excellent. Oh. Okay. Äh, da brauch ich nen Guide zu. Install Docker Windows 2019. Ah. Ah, geht ja schon gut los. Null. Äh. Äh, ist es Server? Ah. Install Docker und Windows 10, nee. Okay, ich muss die Windows 10 Anleitung wahrscheinlich machen. Kann man das nicht über den Server Manager machen? Irgendjemand hat auch gerade geschrieben, man muss. Irgendjemand hat auch gerade geschrieben, man muss irgendwo auf Windows Server Host oder so. Windows Server Host, Windows Server Container. Wo, wo, wo, wo steht das? Peaches. Okay, bla, bla, bla, Hyper-V, Hyper-V. Install mir mal ne Runde Hyper-V. Kann ich schaden. Nee, nee, keine Windows, ich will, ich will richtig echte Videos ausprobieren, wie gut das funktioniert. Okay, Containers. Ah, Windows Server Containers. Switches, Switches. Äh. Okay, was auch immer. Ähm, dann installieren wir jetzt mal wirklich Docker, da stand doch hier irgendwo, Docker, Windows. Get Docker Desktop für Windows Server, nee Server. Install Docker Enterprise Engine. Ich will nicht die Enterprise Engine, ich will einfach Install Docker Windows 2019. Hier, Six-Eyed, was auch immer. Nicht Six-Eyed, Five-Headed. Connection, okay, also was? Install Windows Feature Containers, Setup, Install Docker und Windows, Install Module, Docker, MS, ja wer, alles in der Welt kommt dann da rein. Meint das den Windows Container? Äh, what the fuck. Boah ey, das überfordert mein Brain gerade. Das überfordert mein Brain. Linux. Ja, die Docker für Windows Installer hab ich ja schon gefunden, aber da steht doch nix von Server. Ich rat mir das jetzt einfach Windows typisch von der Docker-Webseite runter. Install Docker Windows 2019, Lul. Zack. What the fuck? Install Docker und Windows. Hyper-V and Container Features, okay, das müssen wir noch hinzufügen. Add Roles, also Hyper-V, add, ja mach und Containers, und Containers, next, naja, next, was auch immer, next, alles klar, next, mach weiter, install. So und eh machen wir noch PowerShell auf, da hab ich gesagt Find Package, da konnte ich Docker suchen. So und das macht jetzt was, muss ich das noch mal suchen, dass er das breiter schreibt. This model helps with development, it detects, was soll man das installieren? Aber kann man damit nicht angeblich auch Linux-Software ausführen und dass er das dann der Hyper-V Vm macht, probieren wir jetzt aus. Ich warte jetzt bis der Kram installiert ist, was bringt hier Docker, das weiß ich noch nicht, was das unter Windows bringt. Restart, ach ja, exellent, Windows Restart, alles klar. Restart pending, okay, ja wir restarten. Install Package Docker, natürlich lese ich den Chat, aber der Chat schreibt laufend irgendwas anderes, mal so, mal so, ich kann ja nicht so schwer sein. Install module, Docker Provider install, probier mal gleich aus. Also das hier mag schon mal nicht, vielleicht weil er am Neustart hängt oder es zeigt kein Progress an. Was? Okay ich starte erstmal neu, man muss ja mal zwischendurch neu starten, dass es funktioniert. Okay, ist er wieder da? Warte mal, ach nee, der Chat, ah Updates, wie konnte ich das vergessen, dass der erst zwei Stunden immer wieder neue Updates installieren muss. Was ist denn der intelligent, intelligent background, was auch immer Service? So, da ist er wieder. Moment, nein, nein, ah, hab ich doppelt aufgemacht, einmal da, einmal da, ja ja, Disconnect. Background Intelligent Transfer Service, das klingt sehr big brain. Okay, PowerShell, PowerShell, Install, Package, Docker. Packages, Trust, yes. War das ich eben schon größer gemacht und eben schon viel größer eingestellt oder? Aha, hat er das jetzt installiert? Docker, nein. Okay, dann mach ich jetzt mal das, was der Kellmore geschrieben hat. Install, okay, also Install, Module, Docker, Provider, yes, yes, yes, yes, Docker, what? Und dann was? Docker, ich will kein Brave View, ich will einfach, dass es, ich hab keine Ahnung, was das treibt, yes, Docker, ah, hoho, guck mal da, krass. Wie ist die Enterprise Experience so unglaublich? Wahnsinn, ganz toll, Docker, who am I, Container, genau, den starten wir jetzt mal. Was? Ja, das ist ja auch kein Windows, kein Windows Docker. Ja, ich weiß, dass es Docker LS ist. Kann man keine Linux Dockers ausführen? Okay, das geht anscheinend nicht. Run Linux Docker Windows. Ich mein, man kann WSL installieren hier. Die haben hier grandiose, to run Linux. Okay. Run Hello World, okay, schauen wir mal, ob das funktioniert. Also Kellmore, wenn man sowas braucht, wäre ja echt armselig. Okay, das hat funktioniert. Ja, bla, bla, Explore Application, bla, bla, bla. Linux. Ach hier, Resource Tab. Aha, das war auch die Windows Version von Hello World, garantiert. Mein Gott ist der Scheiß kompliziert, ey. Docker Settings Dialog. Hab ich jetzt Docker Settings Dialog? Boah, ich kriege Anfälle. Okay, ich mache jetzt das, was der Kellmore sagt, was aber halt echt lächerlich wäre, wenn das nur so funktioniert. Was zum? Es ist Windows, was erwartest du? Ja, ja wenig. So, jetzt ist die Frage, ob es funktioniert. Extracting, Hausechamp. Ja, funktioniert. Es läuft, Leute, es läuft. Stopp. Das heißt, wenn ich jetzt hier auf 5, Port, Moment, Port 55019 gehe. 1, 9. Oh, ups. Fast. Who am I? Wir haben den Linux-Docker-Container laufen auf Windows. Okay, das ging sogar, das ging halbwegs. Also, das habe ich mir schlimmer vorgestellt, wobei das Setting ist immer noch sehr merkwürdig. Willst du jetzt noch mal Docker vor Windows? Ich dachte ja eigentlich, dass man das so machen kann, ohne über eine Webseite Installer klicken zu müssen. Docker vor Windows. Install. Dann Docker Desktop. Ja, GIF. Ja, ich habe GIF. Stable. Das müsste die Enterprise-Passion sein. Okay, das ist mir ehrlich gesagt ziemlich egal. Kann man das sogar parallel laufen lassen? Docker Desktop ist nur für Dev-Zwecke. Ja, juckt mich nicht. Wenn ich wirklich, ich will es einfach nochmal auspringen, wenn ich wirklich Linux-Docker-Anwendung live laufen lassen will, dann mache ich das wahrscheinlich eh nicht auf dem Windows-Docker. Sondern ganz stinknormal auf der Linux-Kiste, wie ich es normalerweise eh machen würde. Aber das ging relativ gut, muss man echt sagen. Hat man wieder gesehen, die ganzen Subs haben sich gelohnt, weil es ist wieder excellent Big Ten. Chat. Wie weit bist du ja, Docker unter Windows-Schalt zu funktionieren? QEMU-Image. Bugsnack. Die finden sich in ihrem Installer auch geil, oder? Wie das hier unten ausfaded. Die feiern sich da richtig. Danach musst du Windows neu starten. Höchstwahrscheinlich. Die IHK hat einfach euer Ergebnis der Abschlussprüfung geliegt am Samstag. Wie liegt denn die IHK auf die Abschlussprüfungsergebnisse? Macht der da? Wie viel Festplattenplatz verbraucht der Kram eigentlich gerade? Geht eigentlich? Nur 20G? Lockout? Okay. Wenn Docker das sagt. Docker Info, ja, kann ich machen. Nee, das läuft doch jetzt beides, oder? Oder hat sich das eine jetzt Docker Info. Das ist die Enterprise hier. Das ist Enterprise. Und das hier ist Desktop. Wie auch immer, der das jetzt unterscheidet. Docker. Ah ja. Oh, was? Ich hab 4Gigabyte drin. Wollt ihr mich veräppeln? What? Jetzt startet er gar nicht mehr, oder was? Okay, jetzt hat er keinen Bock mehr. Docker Desktop Excel, weg damit. Bam. Dann startet er wieder. Aha. Ach, da ist es. Da ist es. Aha. Ist er einfach einmal beenden und wieder starten, dann geht's. So. Da ist es. Docker is starting. Kubernetes. Nicht genug Sp- Das Ding hat 4Gigabyte. 4Gigabyte. Das muss doch reichen um... Okay. 4Gigabyte ist doch nix. Ja, das stimmt. Für Windows reicht das nicht. Okay, wir machen das. Ich hab ja genug RAM. Da kriegt er jetzt einfach mehr RAM. Ich hab ja genug. Ich hab, wie viel hab ich eigentlich mittlerweile? 16 oder 32? 16, ne? Ich hab 16. Habe ich zu... Ey, ich hab 32. Okay, da kann der Stall noch eine ganze Ecke mehr kriegen. Easy. Kein Problem. Ja. Flop. Perfekt. Mehr RAM. Mehr RAM. Man kann nie genug RAM haben. Ich hab extra 32 GB, damit ich fürs nächste Windows Update gerüstet bin. Ja, Captain Peng, das nachvollziehbar, ja. Pongas. Mal gucken, ob es jetzt funktioniert. Kann man den Server Manager irgendwie ausschalten? Dass der nicht am Anfang mal aufploppt? Review? Hide welcome? Oh, Docker startet. Habt ihr gesehen, da ist er. Da läuft er. Docker is starting. Mal gucken, ob der RAM jetzt reicht. Wow. Der frisst schon ordentlich RAM. Der ist da schon nicht genügend, sondern nicht genügsam. Ja, haben wir. So. Und nun? Open Power Stall and start hacking with Docker or Compose. Excellent. Also. Start. Oh, die haben da sogar eine Power-Spitze, aber hier. Git clone getting started. Okay, ich gehe mal davon aus, dass es natürlich nicht standardmäßig. Nein. Kein. Ah. Kein Internet Explorer. Jetzt muss ich neu anmachen. Ja, Windows. Ja, wunderbar, mach. Next. Alles auf dem Windows. Darf man drauf klatschen, was geht? Und desktop. Ja, schadet nichts. Get bashed hier. Get GUI hier. Nein, keine Windows Explorer. Next. Was? Oh. Wim ist default. Wie modern? Was? Wer ertreist sich hier zu sagen Wim wäre nicht modern? Was ist hier los? Als wäre Wim nicht modern, Leute. Also ich glaube, es geht los hier. Was wird gemacht? Docker und Windows installiert, weil es geht. Use git from git bash only. Ah ja, mach weiter, weiter, weiter, weiter, weiter. Nanowimp. Ich habe, ich habe halber wie schon installiert. Und ich kriege Anfälle beim bei der Windows Bedienung wieder. Lounge git bash. Keck weh. Font rendering allererste Sahne. Okay, jetzt klonen wir das. Bestimmt, weil es dort nicht immer ein Wireman drinne ist. Wie mache ich jetzt die Shell wieder auf? Wie mach ich das? Oh, wie mach ich das? Wie? Nee, ich hab es Patrick, ich hab das in der VM. Ich würde es im Leben nicht auf desktop installieren. Dashboard. Ah, da, da. Und jetzt? Und jetzt kriege ich kein PowerShell mehr. Ach gut. PowerShell. So brauche ich dieses GUI Ding hier eigentlich? Kann ich noch mal das Getting Started aufrufen? Ach, hier switch to Windows Container Switch. Docker Info. Ist immer noch Enterprise Engine. Ja. Hier kann man aussehen, was man haben will. Command Line. Wie kann man hier eine Command Line jetzt aufmachen? Ach, das ist mir alles zu kompliziert. Es funktioniert zumindest. Ich konnte in Hallo Welt Container starten. Das reicht. Okay, als nächstes Hyper-V. Hyper-V Manager. Dann gucken wir mal, wie das funktioniert. Hab ich noch nie gemacht was mit. Hyper-V. Wie installiert man in Hyper-V eine VM? Hyper-V. Docker Desktop VM. Nee, nee, das wollen wir nicht. Wir wollen eine neue VM. New. Virtual Machine. Next. Ubuntu. Mal gucken, ob wir das installiert kriegen. Da bin ich echt mal gespannt jetzt. So, Name. Ubuntu. Generation. Generation 1. 1.024 reicht. No Network. Not Excellent. Size 20G reicht. Next. Finish. So, und jetzt Ubuntu Minimal Download. The Network Installer. Ja, wunderbar. BitTorrent erinnert mich irgendwie ein bisschen an. Hat aber miteinander nichts zu tun. Okay, scheint komplizierter zu sein. Ubuntu Server Download. Bin einfach nur gucken, ob es funktioniert. Ich will das gar nicht großartig installieren. Wir gucken, ob es startet und anfängt zu installieren. Das reicht mir schon. Es wird eh nicht schnell funktionieren, weil das nestet virtualisiert. Das nestet virtualisiert immer krotten lahm. So. Wie startet man das jetzt? Einfach Doppelklicken. Connect. Ah, da ist es. Start. Ja, sehr gut. Oh Mist, wie komme ich hier wieder raus? Was ist das Escape für Hyper-V? Ctrl Alt Entfernen. Moment, da ist ein Remote Desktop drüber. Oh, das verwirrt mich jetzt, aber das sieht exakt genauso aus. Kann man das verschieben? Ein bisschen. Ein bisschen verschieben kann man das. Perfekt. So, Media, DVD, Insert und Disc. Ubuntu. Ist der Download fertig? Ja. Ist jetzt eingelegt. Okay. Äh, verstanden. Aha. Poggers. Äh. Normalerweise müsste ich da jetzt eigentlich was auswählen können. Okay, aber es sieht so aus, als startet er. Das ist schon mal gut. Yep. Dass die Installation lahm wie Sau ist, ist okay. Nested Virtualisierung juckt nicht, ja. Als nächstes, ähm, ich habe noch eine Sache draufstehen. Mal WSL installieren. Gucken wir mal WSL unter Windows Server installiert. WSL Windows Server. Windows Server 2019. Äh, wir können das gleich mal unter 2. Bin, was? Good Server Preview. Nee. How to install WSL 2 on Windows Server. How to install WSL 2 on Windows Server. Nein, nein, kein Insider-Bild. Official. Das ist mittlerweile raus. Ja. Äh, WSL. Gibt es eigentlich unter Windows Server auch den Windows Store? Nee, zum Glück nicht. Mach die VM. Tatsächlich, guck mal da. Die Ubuntu VM läuft. Die PowerShell. WSL ist nur für Windows 2. Achso. Ah. Oder? Ubuntu Server läuft. Waren wir da aus. How to install WSL 2. Steht aber doch da. Okay, man braucht ein Preview-Bild. Das ist natürlich doof. Das haben wir nicht. Achso, man muss sie noch ausschalten. Turn off. Ja, okay. Das können wir machen. PowerShell, zack, enable feature. Wisst ihr, was ich sehr, was ich sehr, what? Das war einfach weg. Es kann nicht mehr auskommen ohne Restart. Deswegen war GitHub heute down, ja. Das kann ich mir richtig vorstellen. GitHub. Docker. Äh, nicht Docker. WSL installiert, zack. Loadbalancer tot. Obwohl ich mich sehr wundern würde, wenn GitHub Windows Loadbalancer verwendet. Okay, das haben wir schon installiert. Ein GitHub läuft höchstwahrscheinlich nicht auf Windows. GitHub war mal am Anfang eine Hubi-on-Rails-Anwendung. Wow. Was macht der Typ da? Kann ich jetzt WSL eingeben? Der WSL-Store, ich soll den WSL-Store visiten, steht da. Moment, warum lädt er den Ubuntu ISO noch mal runter? Kann das mal weggehen? Das nervt mich. Geh weg, jetzt. Geh weg. Hallo? Die Seite gibt's nicht. Die Seite gibt's nicht mehr. Die ist einfach weg. Wie installier ich denn jetzt WSL? Die Seite gibt's nicht mehr. Was soll ich heute am Start? Ich probiere mal das neuste Windows Server aus, um mich ein bisschen wieder darin zu bestätigen, dass ich es nicht verwenden will. Geht das unter meinem Host? Ach, das will den Store aufmachen. Den Store gibt's natürlich unter Server nicht. Ja, perfekt Microsoft. Und jetzt? Ach, deswegen macht er diesen Krempel hier. Deswegen macht er diesen Krempel hier, weil das sonst nicht geht. Und nun? Install manual. Aha. Ab X, das kann man nicht installieren. Ich hab keinen Windows-Store drauf. Das geht nicht. Oder? Nee, das wird nicht funktionieren. Install on server. Excellent. Chat, big brain. Darf nicht kopieren. Jetzt. Ja, das hatten wir doch gerade schon. Extrahieren eines Power... Whoa, whoa, what? Weil ab X kann ich nicht öffnen. Wir lassen ihn hier erstmal downloaden. Kann ja nicht mal lange dauern. Und dann einfach starten. Braucht ganz schön lang. Andi erstmal entpacken, danach entpacken, expand, big brain. Der braucht für den Download ganz schön lang. Über den Browser ging das viel schneller. Versuche in der PowerShell add app X package. Das geht bestimmt nicht. Add. App. Nee. App. App. X. Oh, doch. Downloads. Nee. U-Boot-to. Oh, jetzt wird es aber hier richtig advanced über die PowerShell. PowerShell-Magic. Und jetzt hat es es jetzt gemacht. Da ist es. Da ist es. Tatsächlich. Und der ist immer noch am runterladen. Lull. Abbrechen. Rm. U-Boot-to. Zip. Bäm. Hat funktioniert. Ich glaube es nicht. Ja, stimmt. Candy Crush brauchen wir wirklich nicht. Ist aber cool, dass man das zumindest über die PowerShell machen kann. Also ich muss sagen, PowerShell ist noch das erträglichste an ganz Windows. Sieht Windows Server wie Windows 10 aus? Ja. Mehr oder weniger. Kann man Candy Crush installieren? FeelsBadMan. New username. Pog. Panzverband 256. Wenigstens lässt mich das 123456 als Passwort verwenden. Und da sind wir. WSL am Start. So, mal gucken, ob WSL 2 läuft. Das geht wahrscheinlich nicht. Nein. Nein. Nein, das ist noch das alte WSL. Das gibt es noch nicht für Windows Server. Was kann man mit Windows Server machen? Der fragt mich nicht. Er fragt mich was leichteres. Die Frage ist, sollte man damit was machen? Und ich tendiere eher zu nein. Also was man damit schön machen kann, ist irgendwelche Windows Clients managen. Von Windows Software Installationen bis Active Directory Gedöns, wenn man sich das wirklich geben will. Aber ich glaube freiwillig macht das keiner. Wenn es nicht unbedingt sein muss. Ich finde ja meinen Random Rechner Namen immer noch ziemlich gut. Winn, Napgur, Mamase. Klingt irgendwie ein bisschen nach Zulul. Warum so ein Windows Hate? Das ist kein Windows Hate. Das ist einfach die Realität. Change my mind. Minecraft Server aus. Nein, nein, nein. Ich bin fertig mit allem was ich machen wollte in Windows. Ich bin durch. Also, es ist noch genauso schlimm, wie ich das in Erinnerung hatte. Ja, ich habe keine Ahnung davon. Das stimmt. Ist das jetzt eine Hyper-VVM? Nein, das ist keine Hyper-VVM. Das hier ist eine Hyper-VVM. Das, die Ubuntu-Kiste, ist eine Hyper-VVM. Ja. Sind das so Server wie CS Server? Was? Nee, CS Server kannst du in der Linux laufen lassen. Das würde dich im Leben nicht unter Windows laufen lassen. Im Prinzip ist Windows Server nichts anderes wie ein stabileres Windows 10 mit ein bisschen weniger Frontend Funktionen und dafür ein paar eingebauten Services, so wie ein Web-Server und sowas. Hat Hyper-V inzwischen das Snapshot-Feature? Das ist eine gute Frage. Ich verwende Hyper-V normalerweise nicht. Checkpoint, ja, guck mal. Also, von dem ganzen Crap, den wir hier haben, hat Hyper-V tatsächlich noch den besten Eindruck. Ach so, ja, das können wir noch machen. Aber ich glaube, das geht mit WSL nicht. Können wir nach Mount, Mount C und dort alles löschen? Geht das? Geht anscheinend nicht. Permission denied, sudo. Geht leider nicht. WSL als Admin ausführen, okay. Und jetzt? Da haben wir Routepferden. CD, MNT. Nee. Wow. Oh, oh, oh, oh. Oh, oh, Skate kaputt. Montags. Ich glaube, es hat sich selbst gelöscht, weil es hängt. Aber Windows kann sich immer noch nicht löschen. Das darf ich nicht. Explorer. Oh, oh je. Montags, es ist kaputt. Es ist abgekackt, Leute, es ist kaputt. Nee, doch nicht. Ha. Fast, das PC. Ja. Aha. Okay, das geht gar nicht so schnell. Ich will es noch kaputt machen. Ich will es noch wenigstens mal kaputt machen. Fuck. Ich darf das nicht löschen. Ich will mein Windows löschen. Wie kriege ich mein Windows? Du musst Permissions auf dem Windows Ordner ändern, okay? Okay, Windows. Wie macht man das? Advanced Sharing. Nee. Advanced. Nee. Security. Full Control. Administrator. Allow. Administrator. All. Nee. Kann man Linux unter Linux löschen? Klar. Was? Ich sollte mich als Owner setzen. Wüsste, wie das funktioniert. Würde ich das sogar machen? Aha. Aber ich habe Modify. Ich habe Modify-Rechte. Full Control. Owner. Administrator. All. Nee. Darf es nicht löschen? Ach so, Moment, habe ich das falsch gemacht? Change Permissions. Aha. S. Nein. Windows weigert sich, sich selbst zu löschen. Das ist aber nicht sehr nett von Windows, dass es das macht. Kann man, kann man den Explorer als Root starten? Und Explorer. Okay, das ist kaputt. Aber ich, ah, ich habe eine Idee. Ich kann, ich kann ein CMD als Root starten. Oder auch nicht. PowerShot als Root starten. Oh, ich glaube, ich habe, ich glaube, ich habe es kaputt gemacht. Ich glaube, ich habe es kaputt gemacht. Es geht nicht mehr. Es tut nichts mehr. Wir gucken jetzt mal, ob es einen Neustart überlebt. Restart. Mal gucken, mal gucken, ob es den Neustart überlebt oder ob es jetzt RIP ist. Gucken, ob es jetzt kaputt ist. Okay, noch starte das. Äh, ja, ja, alles gut, alles gut. Ich will, ich will Windows noch irgendwie kaputt machen. Das kann auch nicht so schwer sein. Früher hat sich Windows immer selbst kaputt gemacht. Jetzt will ich das mal selbst machen. Oh, es geht wieder so halbwegs. Was sagt, okay, CMD, aber ich kann CMD, ich, ah doch, ich kann CMD. Als Administrator. Also was sagt Google? Das machen wir jetzt. Wir machen das jetzt CMD. Google sagt was? EMDR slash silent, silent, quiet, was auch immer. Äh, C Doppelpunkt. Nein, das geht nicht. Wahnsinn. C Doppelpunkt Windows. Nein, krass. Windows lässt sich nicht löschen. Was soll das hier? Piss dich also. Schon, schon interessant. Ich dachte, es wäre einfacher, Windows mit Windows kaputt zu machen. System 32. Bäm. Kannst du den Windows Ordner umbenennten? Das ist eine gute Frage. Kann man Windows Ordner umbenennten? Wahrscheinlich auch nicht, ne? Nein, nein, ich habe auf Delete geklickt. Kann ich Delete drücken? Rename. Es gibt, es gibt kein Rename. Ich verschiebe ihn einfach nach Users. Okay Leute, ich bin nicht in der Lage, Windows kaputt zu machen. Ich krieg's nicht in. Äh, okay Leute, das interessiert mich jetzt wieder jetzt. How to delete Windows from Windows. Okay, der Patrick hat Big Brain Eintrag gefunden. Gucken wir uns gleich an, wie das funktioniert. Erstmal ein Chrome, ein Chrome hab ich ja gelöscht. Okay, nee, nein, muss ich hier aufmachen. Windows. Start as administrator. Was? Ich hab mein Chrome gelöscht. Okay, weißt du was? Scheiß drauf. Windows will nicht, dass ich es kaputt mache. Windows kann aber hiergegen überhaupt nichts machen. Get wrecked Windows. Keine Chance, was dagegen zu machen. Open VM directory. VMs. Remove. Remove. Zack, weg ist es. Easy. Nee, RMSF hat nicht funktioniert. Yes. Da, weg ist es Windows. Also ich muss sagen, es ist noch genauso eklig, wie ich es mir vorgestellt hab. Ist nicht besser geworden. Was mich überzeugt hat, war jetzt auf den ersten Blick Hyper-V. Das war echt nicht übel. Also es hat einfach so funktioniert, wie es funktionieren sollte. Der Rest ist halt so extrem hakelig und eklig in der Verwendung. Ah, ich weiß nicht. Nee, nee, nee. Ist das wirklich dein erster Windows? Na ja, nein, ich hab schon immer mal wieder zwischendurch installiert. Aber wirklich, ich kenne mich damit nicht aus. Und mittlerweile mache ich es ja auch so, wenn mich irgendwie einer was fragt, was Windows Sachen angeht, so was weiß ich, wenn mich zum Beispiel eine Freundin von meiner Mutter oder so sagt, ah, guck mal, der Max, der kennt schon mit Computerzeug aus. Der kann mir doch bestimmt erzählen, wie ich keine Ahnung an meinen Drucker einrichte oder so. Nein, mach ich nicht. Sag ich immer, ich hab keine Ahnung davon. Frage mich ja, also Choose my name sagt, frage mich ja, ob Microsoft selber eher Windows Server oder eher Linux Server nutzt. Das ist eine gute Frage. Auf was läuft zum Beispiel Microsoft.com? Na, Microsoft.com wird wahrscheinlich echt Windows laufen. Microsoft.com wird wahrscheinlich wirklich auf Windows laufen, kann ich mir vorstellen. Haben wir vielleicht irgendwie die Chance, das rauszukriegen? Haben wir irgendwie die Chance, das rauszukriegen vielleicht? Ne, warte, wo will ich hin, der Network? Ah,.net, es läuft auf.net. Aber die Plattform sieht man nicht. Microsoft.com läuft auf ASP.net Core. Nmap konnte doch, Nmap OS Detection gab es doch die Möglichkeit, das Nmap, das versucht, rauszubekommen. Wie ging das nochmal? OS scan, OS guess. Genau. Okay, probieren wir mal aus. Nmap, Microsoft.com, Minus O war es. Oder Minus Null. Ist groß O. Jaja, ist gut. Nein, nein, nicht Parrot.ly. Okay, scanen wir mal mit Microsoft.com, easy, wenn man gleich blacklisted. Oh, stellts, stellts, scan. What, what, what, what? Ah ja, no OS Matches, okay. Er hat keine Ahnung, was das für ein OS ist. Wie gesagt, ich glaube ja, das ist ASP.net Core. Weil Kestrel, Kestrel ist der, ich hab's euch ja hier gezeigt, Kestrel ist der ASP.net Core Web Server. Gucken wir mal, ob Google irgendwas rausrückt, auf was sie laufen, aber wahrscheinlich eher nicht, ne. GWS, okay, das ist irgendwie Google Magic Kram. Das geht über irgendeinen, ja, das geht garantiert auf irgendeinen Load Balancer. Ja, aber ich könnte mir vorstellen, dass auch vieles bei Microsoft mit Dealungs läuft, weil Windows Server Kram willst du dir vielleicht für Client Geschichten geben, aber wenn du einfach nur Dienste bereitstellen willst im Internet, gibt sich doch keiner freiwillig Windows Server, warum sollte man das machen? Live.com, was ist Bing, Bing? Oh, was lädt das denn alles nach? Microsoft, okay, Bing läuft auf IES, tatsächlich. Wenigstens Bing. Und Xbox? Xbox? Ich mein, da könnte alles drinstehen, ne, gibt's keine Infos zu. Da kann alles drinstehen, ist auch egal. Also ich gehe stark von aus, dass selbst, dass Microsoft selbst auch viele Sachen auf Linux laufen hat. Alles andere würde mich echt wundern. Ah ja. So, wir haben jetzt noch, wir haben jetzt noch ein bisschen Zeit. Oder ich gehe jetzt auf und grinde noch ein bisschen Path of Exile, das könnte ich auch machen. Ich gehe auf und grinde noch eine Runde Path of Exile, so war mal das. Ich hoffe euch hat's trotzdem gefallen im Stream, wer noch nicht gefollowed ist, kann mir gern ein Follow da lassen, bisschen Sellout muss sein. Könnt ihr euch auch mal auf Twitter vorbeigucken, YouTube ist grad nicht so viel los. Und ich hoffe man sieht sich im nächsten Stream wieder, morgen gleich, morgen wahrscheinlich ungefähr gleich Uhrzeit wieder am Start, denke ich mal. Und wir sehen uns, bis dann, macht's gut, CU.", "segments": [{"id": 1, "start": 90.0, "end": 97.44, "text": "Ja Chico gefällt das auch nicht Wenn Chico Windows Server sieht ist er gleich"}, {"id": 2, "start": 97.44, "end": 103.28, "text": "wieder weg Windows Server"}, {"id": 3, "start": 103.28, "end": 124.4, "text": "Ja wir müssen uns das heute wirklich mal geben warum weiß ich auch nicht so genau"}, {"id": 4, "start": 124.4, "end": 132.04, "text": "angeblich hat der Microsoft die letzten Jahre so viel gemacht dass das jetzt viel viel besser"}, {"id": 5, "start": 132.04, "end": 140.2, "text": "ist ich mein Docker läuft unter Windows Hyper-V ist angeblich ganz gut WSL 2 und was nicht"}, {"id": 6, "start": 140.2, "end": 146.36, "text": "alles gibt angeblich hat Windows jetzt doch so gar nicht SSH Server glaube ich ja also weiß"}, {"id": 7, "start": 146.36, "end": 150.24, "text": "man ja nicht was da los ist. Müssen wir wieder ausprobieren aber ich kann euch gleich sagen"}, {"id": 8, "start": 150.24, "end": 159.32, "text": "wahrscheinlich werde ich zwischendurch ganz schön flamen wieder gegen Windows. Ich mein man könnte"}, {"id": 9, "start": 159.32, "end": 165.32, "text": "natürlich ganz big brain machen Windows installieren und dann darauf WSL installieren und alles in"}, {"id": 10, "start": 165.32, "end": 176.08, "text": "Linux machen oder aber Hyper-V installieren und alles in der Ubuntu-VM machen. Ich hoffe du nimmst"}, {"id": 11, "start": 176.08, "end": 185.68, "text": "auch die Version ohne Desktop. Also was ist mit ohne Desktop gemeint? Ich habe keine Ahnung davon"}, {"id": 12, "start": 185.68, "end": 193.12, "text": "also wenn ohne Desktop gemeint ist halt ohne irgendwelche hier 3D und Transparenz und so ja"}, {"id": 13, "start": 193.12, "end": 198.84, "text": "dann dann bin ich dabei aber ansonsten habe ich keine Ahnung wie man Windows Server bedient"}, {"id": 14, "start": 198.84, "end": 204.48, "text": "ohne hier irgendwie ein bisschen rumklicken. Keine Ahnung wir probieren das jetzt mal aus ob man das"}, {"id": 15, "start": 204.48, "end": 210.68, "text": "überhaupt runterladen kann richtig. Try Windows Server now. On Azure. Ne ne ne ne. On Azure geht"}, {"id": 16, "start": 210.68, "end": 225.24, "text": "da grad nicht. Free Trial das klingt doch schon mal gut. Exzellent. Exzellent klingt das. ISO wie"}, {"id": 17, "start": 225.24, "end": 232.76, "text": "da da. Microsoft ist auch lustig oder? Bei Windows 10 machen sie einen riesen Akt dass man keine ISO"}, {"id": 18, "start": 232.76, "end": 237.96, "text": "runterladen darf und beim Server ist es wird direkt angeboten sogar als Virtual Disk Image."}, {"id": 19, "start": 237.96, "end": 244.64, "text": "Übrigens bei der Gelegenheit zeige ich immer ganz gerne den Trick für die Windows 10 ISO weil es"}, {"id": 20, "start": 244.64, "end": 250.44, "text": "irgendwie jedes mal wenn ich das im Stream zeige sind die Leute überrascht wie einfach das doch"}, {"id": 21, "start": 250.44, "end": 255.16, "text": "geht. Also sprich wenn ihr euch den Windows 10 Update runterladen wollt dann geht das nicht."}, {"id": 22, "start": 255.16, "end": 260.04, "text": "Da kannst du immer nur sagen Tool jetzt herunterladen, aktualisieren, bla, sonst was."}, {"id": 23, "start": 260.04, "end": 269.64, "text": "Sobald man aber hier auf Inspect geht und den Mobile Modus einschaltet dann sollte es eigentlich"}, {"id": 24, "start": 269.64, "end": 279.0, "text": "funktionieren. Bin ich auf der falschen Seite geht das nicht mehr. Ich habe auf jetzt aktualisieren"}, {"id": 25, "start": 279.0, "end": 290.76, "text": "geklickt. Okay und jetzt passiert nichts. Achso wow wow wow wow wow wow. Windows ist ja gut."}, {"id": 26, "start": 290.76, "end": 299.68, "text": "Alles gut Windows alles gut. Reload, ja ja ihr habt recht aber erstmal den ganzen Scheiß wieder"}, {"id": 27, "start": 299.68, "end": 304.44, "text": "weg machen ja. Genau also sprich wenn man jetzt hier auf Inspect geht und in die Mobile Ansicht"}, {"id": 28, "start": 304.44, "end": 310.2, "text": "und dann reloadet man die Seite und zack kann man Windows 10 ISOs runterladen. Richtig big brain."}, {"id": 29, "start": 310.2, "end": 320.24, "text": "Habt ihr gesehen funktioniert jetzt. Wenn man es normal aufmacht ohne mobile Seite geht es nicht."}, {"id": 30, "start": 320.24, "end": 328.08, "text": "Macht man es mit mobile Seite auf reloaded kann man hier auswählen Windows 10 ISO download alles"}, {"id": 31, "start": 328.08, "end": 337.76, "text": "gut. Wollen wir aber nicht wir wollen die Windows Server 2019 ISO downloaden. 180 Tage. Na ob das mal"}, {"id": 32, "start": 337.76, "end": 351.04, "text": "reicht. Ich werde es eh nach dem Stream wieder runterschmeißen was soll ich damit. Ein Noob kann"}, {"id": 33, "start": 351.04, "end": 356.0, "text": "mit einer ISO nichts anfangen. Das ist mir egal ob da ein Noob damit was anfangen kann oder nicht."}, {"id": 34, "start": 356.0, "end": 359.04, "text": "Ich kann aber mit dem ISO was anfangen. Deswegen geht es mir immer auf den Keks dass sie nicht"}, {"id": 35, "start": 359.04, "end": 367.96, "text": "einfach direkt einen ISO download anbieten. Und warum das mit dem mobile Ansicht geht ist ganz"}, {"id": 36, "start": 367.96, "end": 374.16, "text": "einfach. Leute die nicht von Windows auf drauf gehen die sollen natürlich den ISO download"}, {"id": 37, "start": 374.16, "end": 378.88, "text": "angeboten kriegen. Weil Microsoft vielleicht hofft ah die installieren den Windows. Keine Ahnung."}, {"id": 38, "start": 378.88, "end": 388.6, "text": "Ok please select. Also ISO wollen wir haben. First name KekW. Last name größer nein kleiner"}, {"id": 39, "start": 388.6, "end": 401.68, "text": "kleiner Lulve. Company name cute chat. Company size ja so meistens zumindest."}, {"id": 40, "start": 401.68, "end": 422.0, "text": "Good company. Das ist das Gegenteil zu bad company. Job title. Hey wir sind CEO. Wie"}, {"id": 41, "start": 422.0, "end": 438.2, "text": "einfach nur. Warum ich bin hier der head of. 10 minute mail. Das ist die falsche 10 minute"}, {"id": 42, "start": 438.2, "end": 449.88, "text": "mail. Das ist die richtige 10 minute mail. Ok excellent. Work phone number 069 000. Was"}, {"id": 43, "start": 449.88, "end": 463.04, "text": "auch immer. Germany. No continue. Lulve geht nicht. Continue. Select one. Englisch wir können"}, {"id": 44, "start": 463.04, "end": 477.08, "text": "es auch auf Chinesisch runterladen. Englisch download. Alles klar 1776 37 37 190 906 2324"}, {"id": 45, "start": 477.08, "end": 488.96, "text": "3.5. Release SVC. Refresh Server. IWAL X64 FRE EN US 1 ISO. Alles klar. Jetzt weiß ich"}, {"id": 46, "start": 488.96, "end": 493.48, "text": "Bescheid. Gut dass sie das so genannt haben. Ohne den Namen wäre ich überhaupt nicht in"}, {"id": 47, "start": 493.48, "end": 503.52, "text": "der Lage gewesen das zu installieren und geschweige denn runterzuladen. Yes ex exquisite Name. Big"}, {"id": 48, "start": 503.52, "end": 513.08, "text": "brain file names. Warum habe ich eigentlich die ganzen Kram hier nur auf. Teff. Ok das"}, {"id": 49, "start": 513.08, "end": 526.28, "text": "sind die Videos die wir noch übrig haben vom Sondag oder so. Bookmark. Session. Nicht"}, {"id": 50, "start": 526.28, "end": 533.96, "text": "new folder. Keine Ahnung. Letzte. So und jetzt haben wir hier Session. Letzte ist der ganze"}, {"id": 51, "start": 533.96, "end": 539.44, "text": "Kram drin. Ok das liegt wahnsinnig geschwind runter. Das kapiert nur Windows Admins. Ja"}, {"id": 52, "start": 539.44, "end": 542.8, "text": "wahrscheinlich. Noch nicht mal die. Also wenn ich mir so unsere Windows Admins angucke"}, {"id": 53, "start": 542.8, "end": 548.56, "text": "da habe ich nicht so wirklich das Vertrauen drin dass da das einer von kapiert. Ich frage"}, {"id": 54, "start": 548.56, "end": 555.4, "text": "mich eh manchmal was Windows Admins den ganzen Tag so machen. Also außer vielleicht irgendwelche"}, {"id": 55, "start": 555.4, "end": 566.0, "text": "Microsoft Knowledge Base Einträge sich angucken. Also ich persönlich das kann natürlich auch"}, {"id": 56, "start": 566.0, "end": 573.0, "text": "täuschen ja habe den Eindruck dass Windows Admins nicht unbedingt so am oberen Spektrum"}, {"id": 57, "start": 573.0, "end": 579.76, "text": "der Erkenntnis Skala stehen. Also sprich wenn du Leute wenn du mal unten welche hast die"}, {"id": 58, "start": 579.76, "end": 586.04, "text": "gar keine Ahnung haben und oben die übelsten Pros was IT Sachen angeht dann sind Windows"}, {"id": 59, "start": 586.04, "end": 594.92, "text": "Admins eher so in der Mitte. Die meisten. Ausnahmen bestätigen die Regel PC lustig."}, {"id": 60, "start": 594.92, "end": 604.8, "text": "Naja und Linux Leute würde ich sagen die sind im oberen Drittel. Die meisten. Ausnahmen"}, {"id": 61, "start": 604.8, "end": 608.28, "text": "bestätigen auch da die Regel. Wir haben bei uns teilweise Leute am Start die sich eigentlich"}, {"id": 62, "start": 608.28, "end": 615.56, "text": "Bedienungs auskennen sollten wo dir denkst was ist mit denen los. Ich habe es dir letztens"}, {"id": 63, "start": 615.56, "end": 620.72, "text": "erzählt der eine der engen Änderungen am L System gemacht hat und mit dem der dann"}, {"id": 64, "start": 620.72, "end": 625.04, "text": "irgendwelche kaputten Git commits und ach was auch immer da gibt es auch unfähige Leute"}, {"id": 65, "start": 625.04, "end": 633.08, "text": "gibt es überall ja. Ruby ne der ist nicht mehr da der Kommentator der Ruby Typ ist nicht"}, {"id": 66, "start": 633.08, "end": 639.0, "text": "mehr da der war aber egal. Während das runter während das runter läuft kann ich es ja gerade"}, {"id": 67, "start": 639.0, "end": 643.88, "text": "noch mal erzählen für alle die es da nicht mitgekriegt haben. Beim Kommentator hat es"}, {"id": 68, "start": 643.88, "end": 650.16, "text": "das anscheinend eingebrannt wir hatten mal einen externen Experten am Start der wurde"}, {"id": 69, "start": 650.16, "end": 657.04, "text": "Big Brain mäßig halt eingekauft für ZFS für Solaris und ZFS haben sie den eingekauft"}, {"id": 70, "start": 657.04, "end": 662.84, "text": "bei uns und als der dann angefangen hat quasi so eins zwei Monate später nachdem sie jemand"}, {"id": 71, "start": 662.84, "end": 669.28, "text": "gesucht haben haben sie ihm gesagt ja jetzt machen wir doch kein Solaris ZFS und da war"}, {"id": 72, "start": 669.28, "end": 673.24, "text": "er aber schon da und dann musste er da musste er in ein halbes Jahr oder ein dreiviertel Jahr"}, {"id": 73, "start": 673.24, "end": 678.28, "text": "war er da musste der was anderes machen und da hat er überhaupt keinen Bock drauf gehabt"}, {"id": 74, "start": 678.28, "end": 685.96, "text": "und er ist von Woche zu Woche immer mehr durchgedreht der Typ und ZFS das Fallsystem ja auf Solaris"}, {"id": 75, "start": 685.96, "end": 692.44, "text": "also auf dem guten Oracle Geschiss da und der ist von Woche zu Woche immer weiter durchgedreht"}, {"id": 76, "start": 692.44, "end": 697.44, "text": "da hatte den übelsten Knall der Typ der hat es halt irgendwann geschafft dass der seine"}, {"id": 77, "start": 697.44, "end": 703.64, "text": "seinen Linux Desktop hat er so eingerichtet dass wenn er mit dem wenn er mit dem Maus mit"}, {"id": 78, "start": 703.64, "end": 707.96, "text": "dem Mauszeiger an Bildschirmrand gekommen ist ich glaube das hat er gemacht dass er nicht"}, {"id": 79, "start": 707.96, "end": 714.0, "text": "einschläft dabei hat sein PC Speaker gesummt also es lief dann ab und zu so der ist dann mit dem"}, {"id": 80, "start": 714.0, "end": 720.32, "text": "Maus mit der Maus an der Rand gekommen vom Bildschirm und hat es dann gemacht das PC Speaker hat"}, {"id": 81, "start": 720.32, "end": 728.8, "text": "dann gesummt ich wusste gar nicht wie man sowas einstellt überhaupt die bescheuertste Extension die"}, {"id": 82, "start": 728.8, "end": 734.32, "text": "ich je gesehen habe naja zumindest der ist wie gesagt der ist immer der ist immer weiter durchgedreht"}, {"id": 83, "start": 734.32, "end": 741.44, "text": "der ist immer weiter durchgedreht mit der Zeit und wir hatten damals relativ viel was in Ruby"}, {"id": 84, "start": 741.44, "end": 746.84, "text": "programmiert war und dann hat er dann immer angefangen zwischendurch vor sich hin zu zu"}, {"id": 85, "start": 746.84, "end": 753.2, "text": "reden Ruby der ist immer weiter durchgedreht so irgendwann lief das dann so irgendwann lief"}, {"id": 86, "start": 753.2, "end": 758.48, "text": "das dann so dann ist er mit dem Mauszeiger gegen den Bildschirmrand gekommen also hat"}, {"id": 87, "start": 758.48, "end": 761.68, "text": "ein Known Desktop und er hat es auf dem Known Desktop geschrieben er wollte irgendwie nicht"}, {"id": 88, "start": 761.68, "end": 766.96, "text": "zugeben dass er das selbst konfiguriert hat das muss er selbst konfiguriert haben anders ist es"}, {"id": 89, "start": 766.96, "end": 771.4, "text": "gar nicht möglich ja und da ist er mit dem Bildschirm Zeiger mit dem Maus Zeiger an den"}, {"id": 90, "start": 771.4, "end": 776.8, "text": "Bildschirmrand gekommen hat er PC Speaker hat dann gesummt und dann hat er gesagt also"}, {"id": 91, "start": 776.8, "end": 784.76, "text": "hat er gesagt der scheiß Known Ruby der ist komplett abgedrehter Typ mit der Zeit"}, {"id": 92, "start": 784.76, "end": 789.12, "text": "gut nach dem dreiviertel Jahr war er dann wieder weg da konnte er wahrscheinlich irgendwo anders"}, {"id": 93, "start": 789.12, "end": 794.16, "text": "dann wirklich Solaris und ZFS machen aber der ist der ist immer weiter dem Wahnsinn verfallen"}, {"id": 94, "start": 794.16, "end": 802.64, "text": "ja gut wenn du auch eingekauft wirst für ein Thema was dich interessiert und dann kommst du"}, {"id": 95, "start": 802.64, "end": 808.6, "text": "hin und kriegst gesagt ey ne wir machen jetzt was ganz was anderes da kannst du schon ein"}, {"id": 96, "start": 808.6, "end": 815.28, "text": "bisschen durchdrehen im Kopf so ist der Download jetzt fertig ja was hier Tommy fragt hey Max ich"}, {"id": 97, "start": 815.28, "end": 819.32, "text": "programmiere schon ziemlich lange und es liegt mir eher im Gefühl als dass ich eine rationale"}, {"id": 98, "start": 819.32, "end": 824.08, "text": "Begründung dafür habe ob ich Referenz oder Value Types benutzt ach du groß jetzt hier kommt Big"}, {"id": 99, "start": 824.08, "end": 836.8, "text": "Brain Talk Expanding habe ich das hier überhaupt hier Expanding Brain kommt jetzt hier aber der"}, {"id": 100, "start": 836.8, "end": 842.52, "text": "Talk wird jetzt richtig Big Brain der reicht schon der reicht schon der 5 Kopf nicht mehr"}, {"id": 101, "start": 842.52, "end": 852.12, "text": "okay ob ich Referenz oder Value Types benutzen sollte mir sind die Unterschiede deutlich klar"}, {"id": 102, "start": 852.12, "end": 858.12, "text": "mit dem aber es gibt irgendwie eine Forstfolie eigentlich so scheiße du fragst mich jetzt hier"}, {"id": 103, "start": 858.12, "end": 878.16, "text": "Dinger nein nein Morpheus damit fangen wir jetzt nicht an ja also eine fällt mir ein wenn du die"}, {"id": 104, "start": 878.16, "end": 885.24, "text": "vergleichen willst ob die gleich sind weil Value Types ist standardmäßig sind die gleich wenn der"}, {"id": 105, "start": 885.24, "end": 895.48, "text": "Inhalt gleich ist Reference Types nicht also wenn du wenn du überprüfen willst ob was ich mein das"}, {"id": 106, "start": 895.48, "end": 898.64, "text": "ist nicht so dass das nicht mit Reference Types auch funktionieren würde du kannst einfach Equals"}, {"id": 107, "start": 898.64, "end": 903.32, "text": "da überschreiben funktioniert aber standardmäßig würde ich sagen ey wenn ich über wenn ich wenn"}, {"id": 108, "start": 903.32, "end": 911.6, "text": "ich überprüfen will ob der Inhalt gleich ist dann würden sich vielleicht Value Types eher anbieten"}, {"id": 109, "start": 911.6, "end": 922.12, "text": "weil da ist es halt einfach standardmäßig so oder aber wenn man kopieren will ohne das original zu"}, {"id": 110, "start": 922.12, "end": 939.4, "text": "verändern dann auch Value Types ansonsten keine ahnung also ich würde das auch eher nachgefühlt"}, {"id": 111, "start": 939.4, "end": 944.32, "text": "wobei ich ehrlich sagen muss ich verwende eigentlich fast nie Value Types ich verwende"}, {"id": 112, "start": 944.32, "end": 951.96, "text": "eigentlich zu 99,9% einfach Class und Class ist Reference und ich mach mir da eigentlich gesagt"}, {"id": 113, "start": 951.96, "end": 969.32, "text": "auch selten Gedanken drüber puh also ja gut in C++ ihr wisst ich bin ja der wahnsinnig große"}, {"id": 114, "start": 969.32, "end": 977.6, "text": "C++ Fan was das angeht unter C++ sagt jetzt ja dass das die C++ Pros sagen jetzt ja also"}, {"id": 115, "start": 977.6, "end": 984.04, "text": "da meine meine mit denen ich ganz dicke bin ne also die C++ Profis sagen ja man soll gar"}, {"id": 116, "start": 984.04, "end": 988.88, "text": "keine Pointer mehr verwenden soll also gar keine also keine richtigen Pointer mehr hier sondern"}, {"id": 117, "start": 988.88, "end": 995.44, "text": "man soll nur noch Smartpoint ne ne ne wie heißt das wie heißt das unter C++ heißt das nicht"}, {"id": 118, "start": 995.44, "end": 1000.24, "text": "Smartpoint ne wie heißt denn das jetzt Unique Pointer und Shared Pointer und das ist Smartpointer"}, {"id": 119, "start": 1000.24, "end": 1004.84, "text": "ich glaube das sind Smartpointer und unter C++ soll man nur noch Smartshared Poin- Unique ja"}, {"id": 120, "start": 1004.84, "end": 1015.56, "text": "sind das nicht Smartpointer Smart Pointer oh ne das ist was anderes what the f- doch doch"}, {"id": 121, "start": 1015.56, "end": 1019.52, "text": "genau das hier meine ich also C++ Leute sagen jetzt ja man soll gar keinen normalen Pointer"}, {"id": 122, "start": 1019.52, "end": 1024.44, "text": "mehr verwenden sondern nur diese big brain Pointer die man nicht lesen kann also die da"}, {"id": 123, "start": 1024.44, "end": 1032.48, "text": "C++ Leute haben ja den Hang dazu alles mögliches kryptisch zu machen und deswegen sagen die"}, {"id": 124, "start": 1032.48, "end": 1037.92, "text": "ja hier soll man machen bei C++ finde ich es eigentlich relativ einfach sobald man das"}, {"id": 125, "start": 1037.92, "end": 1046.04, "text": "woanders braucht als in der lokal in der Funktion dann musst du ja nen Pointer verwenden bleibt"}, {"id": 126, "start": 1046.04, "end": 1050.72, "text": "dir gar nichts anderes übrig großartig einziger Unterschied ist einziger Unterschied ist ja ich"}, {"id": 127, "start": 1050.72, "end": 1055.48, "text": "weiß also was auch geht ist wenn man wenn man Funktionen aufruft dann kann ich das Ding"}, {"id": 128, "start": 1055.48, "end": 1061.4, "text": "oben nicht als Pointer Decklager in kein Referenz übergeben das funktioniert auch aber letztendlich"}, {"id": 129, "start": 1061.4, "end": 1067.04, "text": "in C++ finde ich ist es einfacher weil sobald man es nicht lokal in der Funktion verwendet"}, {"id": 130, "start": 1067.04, "end": 1076.64, "text": "muss es nen Pointer sein und hier muss man sich halt nicht ums aufräumen kümmern also"}, {"id": 131, "start": 1076.64, "end": 1084.72, "text": "Funktion lokal das übergreifen mehr oder weniger immer das du kannst ja immer kopieren oder mit"}, {"id": 132, "start": 1084.72, "end": 1096.56, "text": "uns ja das kann man machen aber das ist wozu soll ich mehr kopieren als ich das br was ist"}, {"id": 133, "start": 1096.56, "end": 1111.92, "text": "denn cbr ist das cbr cbr c++ also call by reference verstehe exzellent ganz big brain"}, {"id": 134, "start": 1111.92, "end": 1126.08, "text": "abkürzung heute punkt h alles klar nein ich brauche gar nichts in c++ aus das muss sein c++"}, {"id": 135, "start": 1126.08, "end": 1141.32, "text": "kam ja kann man mich sonst vor jep kann mich c++ ok der download ist fertig oder ich bin schon"}, {"id": 136, "start": 1141.32, "end": 1160.44, "text": "wieder da exzellent worauf willst du das install ich will es mir einfach mal angucken also ich"}, {"id": 137, "start": 1160.44, "end": 1165.44, "text": "habe mir überlegt was wir machen ist folgendes die habe ich gerade schluck auf das ja also was"}, {"id": 138, "start": 1165.44, "end": 1173.64, "text": "ich mir überlegt habe ist folgendes wir installieren uns 2019 server 2019 dann gucken wir mal wie"}, {"id": 139, "start": 1173.64, "end": 1178.88, "text": "remote access funktioniert angeblich kann das ja mittlerweile ssh mal schauen mal schauen"}, {"id": 140, "start": 1178.88, "end": 1183.88, "text": "mal keine ahnung habe ich nicht ausprobiert müssen wir mal schauen dann gucken wir wie"}, {"id": 141, "start": 1183.88, "end": 1188.08, "text": "man da eine statische html seite aus dem kann dann gucken wir wie man da mittlerweile packages"}, {"id": 142, "start": 1188.08, "end": 1191.4, "text": "nach installiert so ob man da zum beispiel einfach den engine x nach installieren kann"}, {"id": 143, "start": 1191.4, "end": 1199.64, "text": "wahrscheinlich nicht renax kommt das kommt manchmal vor jetzt hier wir waren schon mindestens"}, {"id": 144, "start": 1199.64, "end": 1202.96, "text": "zwei leute drin die ich von der arbeit kenne das ist wahrscheinlich habt ihr das nicht"}, {"id": 145, "start": 1202.96, "end": 1210.12, "text": "so mitgekriegt aber kommt manchmal vor so dann gucken wir mal wie man da nen file server"}, {"id": 146, "start": 1210.12, "end": 1214.0, "text": "macht dann dann will ich mal gucken wie man docker unter windows installiert weil das geht"}, {"id": 147, "start": 1214.0, "end": 1220.6, "text": "ja angeblich und ist ganz toll dann gucken ob man hyper wie installiert kriegen und wsl"}, {"id": 148, "start": 1220.6, "end": 1224.32, "text": "und so weiter mal schauen mal schauen ja mal gucken wie wir das auf die reihe kriegen"}, {"id": 149, "start": 1224.32, "end": 1227.2, "text": "es wird aber es wird aber wahrscheinlich echt eklig werden kann ich jetzt schon sagen"}, {"id": 150, "start": 1227.2, "end": 1240.48, "text": "weil windows ist halt pauschal eklig ok also virtual machine custom next next äh nicht"}, {"id": 151, "start": 1240.48, "end": 1243.92, "text": "linux hätte auch nicht gedacht dass ich in nächster zeit hier mal wieder umsteigen aber"}, {"id": 152, "start": 1243.92, "end": 1249.76, "text": "ist das sound zu laut nö passt da eigentlich ganz gut oder sound zu laut ticken leiser"}, {"id": 153, "start": 1249.76, "end": 1256.28, "text": "ticken lauter passt so oder also wenn ich sehe hier ist meine stimme da ist sound und"}, {"id": 154, "start": 1256.28, "end": 1262.56, "text": "ähm das ist ja decibel logik also sprich das da ist quasi nur irgendwie nen viertel"}, {"id": 155, "start": 1262.56, "end": 1269.12, "text": "so laut wie das da dann weil decibel logik weil scheiß einheit scheiß skala ist ja keine"}, {"id": 156, "start": 1269.12, "end": 1279.8, "text": "einheit bisschen lauter können wir machen können wir ein bisschen ticken können wir"}, {"id": 157, "start": 1279.8, "end": 1285.6, "text": "natürlich gerade mal kurz zurück machen wo es so schön laut war ja so lassen wir es"}, {"id": 158, "start": 1285.6, "end": 1296.0, "text": "jetzt exzellent so also windows jetzt kommen wir ja aus dem windows server 2016 ok 2019"}, {"id": 159, "start": 1296.0, "end": 1313.36, "text": "gibt es dann noch gar nicht next äh das ganze installieren wir übrigens auf e vms new folder"}, {"id": 160, "start": 1313.36, "end": 1321.12, "text": "äh cacw komm egal wie das ding heißt äh next uevi boot ok äh cpus äh vier stück"}, {"id": 161, "start": 1321.12, "end": 1327.88, "text": "mit vier kerne 4096 mb ram sollte erst mal reichen bridge network weil ich will vielleicht"}, {"id": 162, "start": 1327.88, "end": 1337.04, "text": "auch von außen drauf zugreifen mal gucken äh was auch immer next ja wenn du das als"}, {"id": 163, "start": 1337.04, "end": 1344.0, "text": "ssd machen willst mach ssd virtual disc 60g reichen reich Leute reichen 60g ja bestimmt"}, {"id": 164, "start": 1344.0, "end": 1348.64, "text": "bestimmt 63 muss muss reichen wir machen da nichts großartig mit das müssen wir gleich"}, {"id": 165, "start": 1348.64, "end": 1352.16, "text": "mal gucken wie groß der windows server nach der installation nach der installation ist"}, {"id": 166, "start": 1352.16, "end": 1360.96, "text": "mal gucken mal gucken ob das mal gucken wie groß das ist so next customize hardware äh"}, {"id": 167, "start": 1360.96, "end": 1364.76, "text": "ja gut display müssen wir dran lassen drucke mal weg soundcard lassen wir mal dran weil"}, {"id": 168, "start": 1364.76, "end": 1378.24, "text": "ich wissen will ob dort auch cortana am anfang rumschwätzt finish ok power on was no i finish"}, {"id": 169, "start": 1378.24, "end": 1389.76, "text": "install ja nerv mich ok cd rein settings iso images downloads dieser dateiname macht mich"}, {"id": 170, "start": 1389.76, "end": 1396.68, "text": "echt fertig äh wer hat sich das denn ausgedacht war microsoft wieder ok und neustart windows"}, {"id": 171, "start": 1396.68, "end": 1403.28, "text": "installieren zack äh ah vielleicht sollte man cd laufwerk einschalten dann gehts dann"}, {"id": 172, "start": 1403.28, "end": 1416.08, "text": "gehts auch excellent view stretch oh ne ich war zu langsam jetzt noch mal press any key"}, {"id": 173, "start": 1416.08, "end": 1433.2, "text": "kann ich ein nice bekommen so language install englisch time currency setzen wir mal auf"}, {"id": 174, "start": 1433.2, "end": 1443.96, "text": "german ost in belgien reden in belgien ja doch teile in was warum kam jetzt nicht germany"}, {"id": 175, "start": 1443.96, "end": 1453.32, "text": "germany danach und next install nema ja ja ja das gibt es leider noch nicht als sprache"}, {"id": 176, "start": 1453.32, "end": 1471.16, "text": "so was können was können ok was ist der unterschied data center und standard desktop experience"}, {"id": 177, "start": 1471.16, "end": 1482.12, "text": "was ist denn da der unterschied dazwischen meinen die mit des options voll voll windows"}, {"id": 178, "start": 1482.12, "end": 1487.0, "text": "ne das brauchen wir nicht das brauchen wir nicht ich will ich will also ich brauche"}, {"id": 179, "start": 1487.0, "end": 1491.68, "text": "da kein transparenz und hintergrund ich brauche aber halt das normale windows geklicke weil"}, {"id": 180, "start": 1491.68, "end": 1507.64, "text": "ich sonst nicht weiß wie man das einrichtet manage with command prompt powershell oh ne"}, {"id": 181, "start": 1507.64, "end": 1512.92, "text": "das ne ne das das das geht nicht das da hab ich keine ahnung wie es funktioniert dass"}, {"id": 182, "start": 1512.92, "end": 1520.52, "text": "man das desktop experience nennt das klingt schon so fancy irgendwie schon ja ich brauch"}, {"id": 183, "start": 1520.52, "end": 1525.6, "text": "auf jeden fall desktop also mit powershell bin ich nicht in der ich weiß ja nicht mal"}, {"id": 184, "start": 1525.6, "end": 1530.16, "text": "wie ich das windows admin center überhaupt starte wobei ich würde es ja gerne sehen"}, {"id": 185, "start": 1530.16, "end": 1540.68, "text": "wie das das probiere ich jetzt mal aus nema snapshot es geht ja schnell das geht ja schnell"}, {"id": 186, "start": 1540.68, "end": 1545.2, "text": "ich probiere mir jetzt einfach mal aus ich will mal wissen wie ein windows ohne grafische"}, {"id": 187, "start": 1545.2, "end": 1551.12, "text": "oberfläche aussieht das wird mich jetzt mal interessieren das ist bestimmt gebaited sieht"}, {"id": 188, "start": 1551.12, "end": 1556.04, "text": "bestimmt genauso aus nur dass einfach kein desktop geladen wird obwohl alles dabei ist"}, {"id": 189, "start": 1556.04, "end": 1566.64, "text": "custom next das installieren geht ja schnell das dauert 5 minuten oder so full experience"}, {"id": 190, "start": 1566.64, "end": 1570.08, "text": "eh full experience machen wir danach weil ich kann windows wahrscheinlich nicht managen"}, {"id": 191, "start": 1570.08, "end": 1577.16, "text": "gescheit ohne grafische oberfläche ich weiß jetzt schon dass ich mich darüber aufregend"}, {"id": 192, "start": 1577.16, "end": 1582.84, "text": "werde wie unnötig kompliziert alles ist man muss ja sagen vieles ist unter linux auch"}, {"id": 193, "start": 1582.84, "end": 1588.48, "text": "nicht wirklich intuitiv aber man hat sich dran gewöhnt wahrscheinlich ist es bei windows"}, {"id": 194, "start": 1588.48, "end": 1592.88, "text": "admin ist es für windows admins ähnlich zum beispiel unter windows ist es auch total und"}, {"id": 195, "start": 1592.88, "end": 1599.6, "text": "intuitiv dass alle programme irgendwie unterschiedliche parameter haben ja mal ist es minus minus"}, {"id": 196, "start": 1599.6, "end": 1605.88, "text": "version mal ist es minus groß v mal ist es einfach nur leerzeichen version mal ist es"}, {"id": 197, "start": 1605.88, "end": 1611.68, "text": "keine ahnung minus version groß minus version klein also sprich das ist unter linux auch"}, {"id": 198, "start": 1611.68, "end": 1614.96, "text": "überhaupt nicht einheitlich was ich aber witzig finde unter windows ist es auch nicht wirklich"}, {"id": 199, "start": 1614.96, "end": 1618.56, "text": "einheitlich obwohl es mal eben gut ich meine microsoft kriegt es auf dem desktop ja auch"}, {"id": 200, "start": 1618.56, "end": 1626.8, "text": "schon mal nicht hin also warum soll ich diesen server hinkriegen das ging schnell das ging"}, {"id": 201, "start": 1626.8, "end": 1634.24, "text": "echt schnell das hat eine minute gedauert den kram zu installieren big brain speed jetzt"}, {"id": 202, "start": 1634.24, "end": 1639.4, "text": "bin ich mal gespannt wie das aussieht ohne grafische oberfläche bis jetzt sieht es vollkommen"}, {"id": 203, "start": 1639.4, "end": 1652.88, "text": "normal aus nur halt nach windows sogar mauszeiger habe ich schon gesehen wahrscheinlich geht"}, {"id": 204, "start": 1652.88, "end": 1664.96, "text": "da einfach powershell fenster auf ja ist ja gerade abgekackt oder ist es normal dass"}, {"id": 205, "start": 1664.96, "end": 1682.64, "text": "er sich neu startet kann es sein dass es kaputt ist ah nee moment ernsthaft what the fuck"}, {"id": 206, "start": 1682.64, "end": 1693.36, "text": "das ist ohne grafische oberfläche das ist doch nicht ohne grafische oberfläche da wird"}, {"id": 207, "start": 1693.36, "end": 1717.04, "text": "einfach kein desktop gestartet es stinkt am allen kratz microsoft ok jetzt mal ernstgemeinte"}, {"id": 208, "start": 1717.04, "end": 1722.32, "text": "frage warum sollte ich diese variante überhaupt installieren ich meine die paar gigabyte"}, {"id": 209, "start": 1722.32, "end": 1727.08, "text": "festplattenplatz machen sie auch nicht aus oder das ist das wird weder schneller sein"}, {"id": 210, "start": 1727.08, "end": 1735.76, "text": "noch sonst was also warum ok user password ok also ok moment ich habe rechts reingeklickt"}, {"id": 211, "start": 1735.76, "end": 1745.92, "text": "fack wie kriegt es wieder weg ok ok 123456 123456 unable ah das ist nicht kompliziert"}, {"id": 212, "start": 1745.92, "end": 1757.84, "text": "genug verstehe selbst als admin darf ich das nicht ok 123456 underscore 123456 underscore"}, {"id": 213, "start": 1757.84, "end": 1767.2, "text": "auch nicht oh jetzt wirds aber big brain 123456 underscore groß a 123456 underscore groß"}, {"id": 214, "start": 1767.2, "end": 1776.04, "text": "a ah das geht ok das ist viel sicherer ok ach du scheiße das ist wirklich einfach so"}, {"id": 215, "start": 1776.04, "end": 1784.24, "text": "ein komisches cmd ding was passiert dann jetzt wenn man control alt entfernen drückt es"}, {"id": 216, "start": 1784.24, "end": 1793.32, "text": "geht ein neues fenster auf und ich kann den task manager aufmachen sogar der task manager"}, {"id": 217, "start": 1793.32, "end": 1797.08, "text": "ist dabei das ist doch nicht ohne grafische oberfläche das ist eine ganz normale grafische"}, {"id": 218, "start": 1797.08, "end": 1806.96, "text": "oberfläche nur dass kein desktop gestartet wird kann man kann man hier ok ok ok ok ok"}, {"id": 219, "start": 1806.96, "end": 1811.52, "text": "run new tasker guck mal ich kann jetzt hier drüber sachen starten dann an die pausen"}, {"id": 220, "start": 1811.52, "end": 1824.24, "text": "kann ich nicht weil kein desktop gestartet ist cmd die powershell powershell aha echo"}, {"id": 221, "start": 1824.24, "end": 1833.32, "text": "null null was jetzt natürlich richtig big brain wäre wenn ich von hier wsl nachinstallieren"}, {"id": 222, "start": 1833.32, "end": 1837.48, "text": "kann und einfach ganz normal das ding verwenden kann wie linux aber das wird nicht funktionieren"}, {"id": 223, "start": 1837.48, "end": 1845.8, "text": "ok ich brauche einen grafischen desktop sonst komme ich mach mal explorer nee das gibt"}, {"id": 224, "start": 1845.8, "end": 1856.56, "text": "es bestimmt nicht explorer kalk auch nicht ok die haben wirklich die ganzen grafisch"}, {"id": 225, "start": 1856.56, "end": 1861.44, "text": "sein also der unterschied ist im prinzip nur dass die grafischen sachen nicht installiert"}, {"id": 226, "start": 1861.44, "end": 1874.96, "text": "sind was soll ich probieren abwitz was abwitz witz cpl geht nicht wie konfiguriere ich"}, {"id": 227, "start": 1874.96, "end": 1887.48, "text": "das ding eigentlich jetzt wie installiere ich jetzt hier sachen ok sign out switch user"}, {"id": 228, "start": 1887.48, "end": 1906.96, "text": "cancel cancel ok wie installiere ich jetzt überhaupt sachen drauf nougat gibt es das"}, {"id": 229, "start": 1906.96, "end": 1928.48, "text": "konfig wow das sieht ja aus wie windows 2000 1ks also ich will jetzt als erstes mal den"}, {"id": 230, "start": 1928.48, "end": 1948.08, "text": "desktop nachinstallieren wie mache ich das denn ok remote desktop 7 enable less secure"}, {"id": 231, "start": 1948.08, "end": 1956.0, "text": "ok habt ihrs gesehen man hat einen kommando zeilen konfigprogramm aber es ploppt immer"}, {"id": 232, "start": 1956.0, "end": 1963.52, "text": "noch ein ok fenster auf wo man drauf drücken muss windows logik wie kriege ich jetzt die"}, {"id": 233, "start": 1963.52, "end": 1967.92, "text": "ip adresse von dem ding raus mein was interessiert mich dieser komische kackname ich brauche"}, {"id": 234, "start": 1967.92, "end": 1991.36, "text": "die ip von dem teil configure remote management network settings da 2.130 alles klar ms tsc"}, {"id": 235, "start": 1991.36, "end": 2018.64, "text": "und 130 ist es administrator 1 2 3 4 5 6 underscore a yes high res high res ohne desktop ok grandios"}, {"id": 236, "start": 2018.64, "end": 2025.28, "text": "kann man jetzt die auflösung hier hoch stellen font erstmal ein bisschen fetter machen das"}, {"id": 237, "start": 2025.28, "end": 2033.12, "text": "ganze so ist das ist das nice es passt natürlich nicht genau drauf das wäre auch sonst so"}, {"id": 238, "start": 2033.12, "end": 2039.48, "text": "einfach ok wie wie kriege ich jetzt den desktop wieder drauf weil ihr mein hier kriege ich"}, {"id": 239, "start": 2039.48, "end": 2043.8, "text": "ja kriege ich ja absolut anfälle bei und das sage ich als linux mann der den ganzen tag"}, {"id": 240, "start": 2043.8, "end": 2049.4, "text": "auf der kommando zeile setzt oder kriege ich zu kriege gibt es zumindest ein schönes gui"}, {"id": 241, "start": 2049.4, "end": 2061.36, "text": "für windows konfig in irgendeiner art und weise das kann nur die zukunft sein oh guck"}, {"id": 242, "start": 2061.36, "end": 2066.72, "text": "mal guck mal telemetrie settings telemetrie settings habt ihrs gesehen das gibt es sogar"}, {"id": 243, "start": 2066.72, "end": 2073.52, "text": "in der windows server ja yes warum muss ich mit der maus zwischendurch klicken was ist"}, {"id": 244, "start": 2073.52, "end": 2078.0, "text": "für ein schwachsinn ich habe ich habe den terminal konfig ja aber ich muss zwischendrin"}, {"id": 245, "start": 2078.0, "end": 2087.84, "text": "immer noch klicken was bei windows 2019 musst du komplett nach installieren ernsthaft jetzt"}, {"id": 246, "start": 2087.84, "end": 2096.08, "text": "ok ich bin ich bin nicht begeistert aber ich habe das auch nichts anderes erwartet chat"}, {"id": 247, "start": 2096.08, "end": 2104.04, "text": "ich glaube euch aber ich muss mal kurz wirklich reinstall desktop install desktop experience"}, {"id": 248, "start": 2104.04, "end": 2131.28, "text": "ok blablabla können die einfach zum punkt kommen"}, {"id": 249, "start": 2131.28, "end": 2151.16, "text": "ok log in als start server manager ok add roles and features wo ist das add roles and"}, {"id": 250, "start": 2151.16, "end": 2165.6, "text": "features roles and features"}, {"id": 251, "start": 2165.6, "end": 2174.24, "text": "ich glaube ich bin hier gar nicht im richtigen tool drinnen ok ok start server manager from"}, {"id": 252, "start": 2174.24, "end": 2199.8, "text": "cmd ok es heißt einfach server manager alles klar server server manager exe ok aber wenn"}, {"id": 253, "start": 2199.8, "end": 2203.24, "text": "server manager nicht ohne guis wie mach ich denn da überhaupt was da muss ich die ganzen"}, {"id": 254, "start": 2203.24, "end": 2214.64, "text": "powershell sachen kennen oder und gut ok ok ich ich ich bin überzeugt ich muss die desktop"}, {"id": 255, "start": 2214.64, "end": 2222.28, "text": "experience nehmen ich bin ich bin überzeugt chat kuchendienst drei monat dankeschön excellent"}, {"id": 256, "start": 2222.28, "end": 2232.4, "text": "subscription ich ich resette snapshot mit desktop experience hätte sein können vor allem warum"}, {"id": 257, "start": 2232.4, "end": 2238.2, "text": "kann man das nicht nach installieren das ist ja total hängen geblieben warum es ergibt"}, {"id": 258, "start": 2238.2, "end": 2249.12, "text": "überhaupt keinen sinn microsoft logik ok also sind wir stehen geblieben standard ok"}, {"id": 259, "start": 2249.12, "end": 2260.52, "text": "standard desktop experience next ich hätte nachgucken soll ich den speicherplatz belegt"}, {"id": 260, "start": 2260.52, "end": 2267.04, "text": "jetzt auch ja hätte ich machen können jetzt zu spät next ich starte schon mal meine linux"}, {"id": 261, "start": 2267.04, "end": 2275.28, "text": "vm hier mit dem ppega board dass ich keine fragen verpasse und ich brauche ja nachher"}, {"id": 262, "start": 2275.28, "end": 2280.6, "text": "ich brauche ich muss unbedingt ssh zugang testen weil ich habe irgendwo letztens gelesen"}, {"id": 263, "start": 2280.6, "end": 2285.84, "text": "dass man mittlerweile den ssh server installieren kann unter windows das muss ich unbedingt"}, {"id": 264, "start": 2285.84, "end": 2293.16, "text": "ausprobieren er darf das vor allem mit was läuft das denn dann cmd in ssh oder oder"}, {"id": 265, "start": 2293.16, "end": 2305.76, "text": "was da bin ich mal gespannt drauf so jetzt installiert auch ein bisschen länger aber"}, {"id": 266, "start": 2305.76, "end": 2323.6, "text": "geht trotzdem schnell"}, {"id": 267, "start": 2323.6, "end": 2330.24, "text": "power shell big brain 5 hat baldrian die frage stellt ich weiß nicht genau was ich"}, {"id": 268, "start": 2330.24, "end": 2333.96, "text": "bezieh ist aber die frage stellt sich bei mir nicht weil ich werde mir noch in der"}, {"id": 269, "start": 2333.96, "end": 2342.36, "text": "produktiven umgebung einsetzen ich will es mir einfach nur mal angucken damit ich wieder"}, {"id": 270, "start": 2342.36, "end": 2348.12, "text": "damit ich wieder weiß warum ich will dass ich mag toxics minus 380 ja komm da geht aber"}, {"id": 271, "start": 2348.12, "end": 2358.92, "text": "noch ein bisschen mehr oder also es gibt ein paar sachen das zum beispiel was easy killer"}, {"id": 272, "start": 2358.92, "end": 2363.72, "text": "anspricht es gibt ein paar sachen die würde ich tatsächlich mit windows machen also wenn"}, {"id": 273, "start": 2363.72, "end": 2368.8, "text": "ich sie machen müsste also active directory geduld ist halt mit samba scheiße muss man"}, {"id": 274, "start": 2368.8, "end": 2378.2, "text": "auch mal sagen wenn ich was gibt es dann sonst noch schönes wenn ich windows client management"}, {"id": 275, "start": 2378.2, "end": 2381.88, "text": "deployment was auch immer machen muss also alles was irgendwie mit ad und windows management"}, {"id": 276, "start": 2381.88, "end": 2392.04, "text": "zu tun klar das würde ich mit windows machen terminal remote terminal server mit mit rdp"}, {"id": 277, "start": 2392.04, "end": 2398.72, "text": "mit dieser neuen rdp extension würde ich auch logischerweise mit windows machen ach so warum"}, {"id": 278, "start": 2398.72, "end": 2402.56, "text": "man nicht die desktop xp das stimmt das ist richtig ich finde es trotzdem blöd dass man"}, {"id": 279, "start": 2402.56, "end": 2406.64, "text": "sie nicht nach installieren kann ich meine er spricht warum nicht ich meine ich kann"}, {"id": 280, "start": 2406.64, "end": 2410.64, "text": "ja beispielsweise unter irgendeinem sagen wir irgendwie ich habe einen ubuntu server"}, {"id": 281, "start": 2410.64, "end": 2413.68, "text": "da kann ich auch einfach das paket für desktop installieren dann schicken wir mal ein desktop"}, {"id": 282, "start": 2413.68, "end": 2432.56, "text": "drauf klox hd aiya ja aber sowas von"}, {"id": 283, "start": 2432.56, "end": 2437.82, "text": "und ansonsten wo würde ich den noch ganz ehrlich wo würde ich noch windows einsetzen"}, {"id": 284, "start": 2437.82, "end": 2444.48, "text": "vielleicht wenn ich auch cortana cortana light vielleicht wenn ich in game stream firma wäre"}, {"id": 285, "start": 2444.48, "end": 2451.32, "text": "weil ich spiele nur unter unter windows laufen wobei ja auch da stadia lief ja auch unter"}, {"id": 286, "start": 2451.32, "end": 2457.76, "text": "lief stadia unter linux oder bsd ich glaube stadia lief unter linux zum größten teil"}, {"id": 287, "start": 2457.76, "end": 2470.72, "text": "die playstation hat bsd hat free bsd als kernel oder minimal betriebssystem drauf ok pass"}, {"id": 288, "start": 2470.72, "end": 2476.52, "text": "mal gucken ob ich jetzt hier 1 2 3 4 5 6 machen darf oder ob das auch die night wird"}, {"id": 289, "start": 2476.52, "end": 2488.28, "text": "finish ok da war wir das gleich 1 2 3 4 5 6 underscore a 1 2 3 4 5 6 underscore a liegt"}, {"id": 290, "start": 2488.28, "end": 2507.24, "text": "gleich klipp machen ich komme da auch nicht mehr rein mal das video gesehen wo fail overflow"}, {"id": 291, "start": 2507.24, "end": 2512.0, "text": "linux auf der ps4 zum laufen bekommen hat nee aber ich habe ein paar videos dazu gesehen"}, {"id": 292, "start": 2512.0, "end": 2519.4, "text": "man kann den username von admin nicht ändern ja jetzt am anfang nicht vielleicht später"}, {"id": 293, "start": 2519.4, "end": 2523.68, "text": "schon aber ich könnte mir vorstellen das administrator so ein ding ist ok fuck es sieht"}, {"id": 294, "start": 2523.68, "end": 2530.04, "text": "wirklich aus wie windows 10 aber nur reinklicken reinklicken geht nicht mehr reinklicken geht"}, {"id": 295, "start": 2530.04, "end": 2544.64, "text": "nicht mehr"}, {"id": 296, "start": 2544.64, "end": 2573.2, "text": "jetzt wollen sie es aber echt wissen da ist auch der server manager ok jetzt ok das"}, {"id": 297, "start": 2573.2, "end": 2576.0, "text": "ist das ist genau das was ich von windows server erwartet habe nach der installation"}, {"id": 298, "start": 2576.0, "end": 2583.24, "text": "erstmal 5 pop ups und internet explorer den habe ich auch erwartet also do you want to"}, {"id": 299, "start": 2583.24, "end": 2599.8, "text": "allow your pc to be discover yes windows admin center brings together ok es ist internet"}, {"id": 300, "start": 2599.8, "end": 2608.64, "text": "explorer guck mal die blocken sich sogar selbst die blocken sich sogar selbst du kannst"}, {"id": 301, "start": 2608.64, "end": 2627.92, "text": "ihn selbst nicht mal aufmachen geh weg geh weg weiche weiche ok was wollen die von mir"}, {"id": 302, "start": 2627.92, "end": 2637.4, "text": "windows admin center ist ein lokal bereitgestellte browser basierter ok elektron verstehe laden"}, {"id": 303, "start": 2637.4, "end": 2644.72, "text": "sie windows admin center aus dem microsoft evolutions ok mein mein ich soll admin center"}, {"id": 304, "start": 2644.72, "end": 2653.36, "text": "aus dem evaluation center runterladen mache ich wie geht denn das ok schon mal nicht schon"}, {"id": 305, "start": 2653.36, "end": 2658.2, "text": "mal nicht mit internet explorer ok wie krieg ich einen ordentlichen browser das läuft"}, {"id": 306, "start": 2658.2, "end": 2676.56, "text": "hier gar nicht mehr wie krieg ich denn ok chrome chrome chrome ok nein nein ich will"}, {"id": 307, "start": 2676.56, "end": 2684.16, "text": "chrome nicht auf deutsch was ist das ich will ich will chrome auf englisch haben chrome"}, {"id": 308, "start": 2684.16, "end": 2695.6, "text": "nicht beta chrome englisch en nein aha ja was ist das eigentlich von kack kann das mal"}, {"id": 309, "start": 2695.6, "end": 2717.8, "text": "weggehen wie kriege ich da jetzt chrome drauf ok ok wir probieren das mal mit mir aus port"}, {"id": 310, "start": 2717.8, "end": 2735.08, "text": "ich habe so keinen plan davon ok edge kann man edge ist edge da nein wie kriege ich da"}, {"id": 311, "start": 2735.08, "end": 2749.08, "text": "ok ok wie krieg ich da du darfst nichts downloaden ja ich merks ich hab ne idee ich hab ne idee"}, {"id": 312, "start": 2749.08, "end": 2760.6, "text": "chip wir laden uns von chip alter wind aha ich krieg anfälle chrome 14 spit download"}, {"id": 313, "start": 2760.6, "end": 2784.44, "text": "excellent ja chrome download jawoll naja naja alles gut alles gut bitte aktiv ok ok das"}, {"id": 314, "start": 2784.44, "end": 2788.84, "text": "ist die erste hürde wie krieg ich den gescheiten web browser drauf ich muss ja einen gescheiten"}, {"id": 315, "start": 2788.84, "end": 2795.56, "text": "web browser drauf kriegen dass dass ich mir das windows admin das admin center angucken"}, {"id": 316, "start": 2795.56, "end": 2804.28, "text": "kann ok ok ich muss ich hab ne idee ich hab ne idee was unter internet option ok internet"}, {"id": 317, "start": 2804.28, "end": 2811.48, "text": "option ne ne wir machen das anders ich hab ich hab big brain big brain 360 die idee wir"}, {"id": 318, "start": 2811.48, "end": 2816.56, "text": "installieren jetzt erstmal forever tools installieren forever tools und wenn ich forever tools"}, {"id": 319, "start": 2816.56, "end": 2827.28, "text": "installiert hab dann copy paste ich mir ne chrome exe von meinem host drauf so so machen"}, {"id": 320, "start": 2827.28, "end": 2833.88, "text": "wir das jetzt hoffentlich hoffentlich kann man forever tools installieren weiter ok da"}, {"id": 321, "start": 2833.88, "end": 2850.16, "text": "muss ich das stretching ausmachen sonst packt er rum standard installieren excellent excellent"}, {"id": 322, "start": 2850.16, "end": 2854.28, "text": "server manager für ee sicherheitseinstellung nein nein nein wir machen keine ee sicherheitseinstellung"}, {"id": 323, "start": 2854.28, "end": 2864.8, "text": "ee weg so yes start neu hat er stand da grad stopping telemetrie services warum warum"}, {"id": 324, "start": 2864.8, "end": 2873.52, "text": "laufen auf meinem server überhaupt telemetrie services kann man das nicht mal auf den server"}, {"id": 325, "start": 2873.52, "end": 2885.04, "text": "schalten so send control alt entfernen 1 2 3 fels underscore a so und jetzt schalten"}, {"id": 326, "start": 2885.04, "end": 2891.0, "text": "wir er die ne ja ja ja lass es mal auf lass mal auf lass mal auf alles gut lass lass auf"}, {"id": 327, "start": 2891.0, "end": 2904.64, "text": "so guck ich mir gleich an so und jetzt moment download chrome ja ich weiß dass ich schon"}, {"id": 328, "start": 2904.64, "end": 2911.52, "text": "chrome hab ich weiß dass ich schon ich will chrome ich will chrome nochmal nochmal laden"}, {"id": 329, "start": 2911.52, "end": 2932.24, "text": "excellent easy easy outplayed"}, {"id": 330, "start": 2932.24, "end": 2946.28, "text": "ha ha wieso ist eigentlich auf dem server internet explorer und nicht edge drauf eine"}, {"id": 331, "start": 2946.28, "end": 2956.76, "text": "exellente frage kann man kann man edge wenigstens nach installieren remove vielleicht vielleicht"}, {"id": 332, "start": 2956.76, "end": 2965.52, "text": "kann man irgendwie edge da drüber aktivieren weil microsoft nicht will dass man surft ja"}, {"id": 333, "start": 2965.52, "end": 2973.44, "text": "deswegen haben sie internet explorer drauf gemacht er geht schon gar nicht mehr das problem"}, {"id": 334, "start": 2973.44, "end": 2981.6, "text": "ist ja ohne paket manager ist es halt naja optional features was auch immer also ich"}, {"id": 335, "start": 2981.6, "end": 2989.64, "text": "meine ich brauche einen browser dass ich mir das hier angucken kann so google chrome jawoll"}, {"id": 336, "start": 2989.64, "end": 2993.0, "text": "auf geht's so jetzt kann ich mir endlich das admin center angucken also was wollt ihr"}, {"id": 337, "start": 2993.0, "end": 3012.6, "text": "von mir download admin center mache ich continue noch einmal ja ja ja ja ja ja ja ja ja ja"}, {"id": 338, "start": 3012.6, "end": 3033.04, "text": "jetzt eingeben kann jetzt ok 0 continue 0 continue 069 000 continue next sollte einem"}, {"id": 339, "start": 3033.04, "end": 3041.4, "text": "das wort evaluation nicht angst machen auf ein produkt hier eigentlich schon ja so"}, {"id": 340, "start": 3041.4, "end": 3049.74, "text": "Oh, jetzt bin ich mal gespannt was da jetzt so geil dran ist, ja jawoll, äh bei der Suche"}, {"id": 341, "start": 3049.74, "end": 3059.42, "text": "nach meiner, was, das macht er doch eh schon oder, warum muss ich das eben installation"}, {"id": 342, "start": 3059.42, "end": 3067.42, "text": "vom admin center auswählen, was auch immer, was?"}, {"id": 343, "start": 3067.42, "end": 3081.82, "text": "gateway server, what the fuck, ich hab keine Ahnung was der von mir will, winrm, was ist"}, {"id": 344, "start": 3081.82, "end": 3092.68, "text": "winrm, gateway endpoint, ok Moment, also Microsoft hat doch vorher gesagt, das ist eine lokale"}, {"id": 345, "start": 3092.68, "end": 3100.18, "text": "browser Anwendung, was will der jetzt von mir, ach windows remote management ist das, aha"}, {"id": 346, "start": 3100.18, "end": 3111.54, "text": "windows admin center, ja weiter, 4 für 3, ach so meinen die das mit lokaler web Anwendung,"}, {"id": 347, "start": 3111.54, "end": 3126.54, "text": "ich meine gar kein elektronen Zeug, verstehe, du installierst dir gerade einen webserver,"}, {"id": 348, "start": 3126.54, "end": 3139.78, "text": "wahrscheinlich ja, sieht so aus, mal gucken was er macht, das admin center hat auf einem"}, {"id": 349, "start": 3139.78, "end": 3147.3, "text": "server nichts zu suchen, aber warum schlägt der mir das denn vor, dass ich das installieren"}, {"id": 350, "start": 3147.3, "end": 3167.06, "text": "soll, was auch immer, wir installieren das jetzt mal und gucken was das ist, öffnen"}, {"id": 351, "start": 3167.06, "end": 3176.34, "text": "sie diese url in einem browser auf einem pc, nein doch doch nicht im internet explorer,"}, {"id": 352, "start": 3176.34, "end": 3194.26, "text": "alter nicht im internet explorer, ok, administrator, nein, administrator, 356, underscore a, save,"}, {"id": 353, "start": 3194.26, "end": 3217.22, "text": "das admin center, da ist es, fertig stellen, big brain admin center, ok, winrm, so, extensions,"}, {"id": 354, "start": 3217.22, "end": 3222.3, "text": "oh jetzt wirds aber richtig big brain hier, update für das azure security center, natürlich"}, {"id": 355, "start": 3222.3, "end": 3231.18, "text": "immer update, update, nicht dass ich das azure security center brauche, ist das so eine art,"}, {"id": 356, "start": 3231.18, "end": 3235.9, "text": "also es sieht nicht so aus ja, aber es sieht ein bisschen aus wie die microsoft account"}, {"id": 357, "start": 3235.9, "end": 3243.94, "text": "settings und das azure frontend, das kind quasi aus microsoft account settings und azure"}, {"id": 358, "start": 3243.94, "end": 3251.18, "text": "frontend, das was ich hier sehe, hier oben gibt es eine powershell scripts, kann man eine"}, {"id": 359, "start": 3251.18, "end": 3262.58, "text": "konsole aufmachen, nee, man kann nur vorgefertigtes scripts, das da oben gebatet, das tut so als"}, {"id": 360, "start": 3262.58, "end": 3271.06, "text": "wäre es eine konsole, ist aber gar keine konsole, warum ist da ein internet explorer drauf,"}, {"id": 361, "start": 3271.06, "end": 3281.42, "text": "weil das der einzige browser ist, der standardmäßig installiert ist, remote powershell, so, das"}, {"id": 362, "start": 3281.42, "end": 3295.02, "text": "erste was wir jetzt mal machen noch ist rdp einschalten, wie schalte ich rdp ein, ok,"}, {"id": 363, "start": 3295.02, "end": 3303.26, "text": "one figure this local server, install windows update, ah wie macht man eigentlich windows"}, {"id": 364, "start": 3303.26, "end": 3317.26, "text": "updates hier drüber, auch so, update, some settings are managed by your organization,"}, {"id": 365, "start": 3317.26, "end": 3330.78, "text": "echt ich bin meine organisation, ok wie macht man rdp an, manage tools, wobei wir haben doch"}, {"id": 366, "start": 3330.78, "end": 3341.1, "text": "schon vorhin gelernt wie man das macht, sconfig, configure remote management, enable remote"}, {"id": 367, "start": 3341.1, "end": 3359.22, "text": "management, ha, big brain, muss 2-3 mal zoomen bis alle, wow, ok wo steht hier remote management,"}, {"id": 368, "start": 3359.22, "end": 3373.18, "text": "ich seh es, ach hier da, jetzt ist remote management enabled und desktop is disabled, was, remote"}, {"id": 369, "start": 3373.18, "end": 3383.3, "text": "desktop firewall exceptions, ja, nein alles darf sich connecten, ok und jetzt kann ich"}, {"id": 370, "start": 3383.3, "end": 3396.06, "text": "da drauf, ok, ausprobieren, oho, 123456, ah, 123456, underscore a, remember me, ok,"}, {"id": 371, "start": 3396.06, "end": 3404.02, "text": "neues zertifikat, alles klar, da sind wir, it's magic, oh, moment, diese komischen windows"}, {"id": 372, "start": 3404.02, "end": 3418.26, "text": "gesten gehen auch unter rdp, sehe ich das richtig, big brain kommt nicht von alleine,"}, {"id": 373, "start": 3418.26, "end": 3422.94, "text": "gut, das können wir wieder ausmachen, das brauchen wir nicht, gut, jetzt kann ich zu"}, {"id": 374, "start": 3422.94, "end": 3426.62, "text": "den eigentlichen Sachen mal übergehen, die ich ausprobieren wollte, zum beispiel wollte"}, {"id": 375, "start": 3426.62, "end": 3439.22, "text": "ich den ssh server installieren, ssh, nee, add, nee das war's anderes, connect to the"}, {"id": 376, "start": 3439.22, "end": 3465.06, "text": "windows account, continue, was, nein, what the f, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 377, "start": 3465.06, "end": 3481.36, "text": "ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 378, "start": 3481.36, "end": 3504.32, "text": "Da gibt es jetzt links die Remote-Power-Shell, ah ne, das ist Remote-Desktop, Moment ich"}, {"id": 379, "start": 3504.32, "end": 3521.0, "text": "kann das Remote-Desktop in meinem Remote-Desktop aufmachen? Moment geht das? Was? We are not"}, {"id": 380, "start": 3521.0, "end": 3532.92, "text": "valid. 1, 2, 3, 4, 5, 6, underscore A. Natürlich sind die valid. Das erinnert mich irgendwie"}, {"id": 381, "start": 3532.92, "end": 3541.72, "text": "an Yo-Dog. I put RDP in your RDP, I can RDP while RDP. So kann man hier suchen, also SSH."}, {"id": 382, "start": 3541.72, "end": 3555.48, "text": "Hallo, search, ok. Ach so meinen die das mit. Ok, add. SSH, wie installiere ich hier ein"}, {"id": 383, "start": 3555.48, "end": 3578.76, "text": "SSH drauf? Rolls. Das ist schon an? Wirklich? Wie läuft's mit de Vibers? Du meinst mit den"}, {"id": 384, "start": 3578.76, "end": 3598.04, "text": "Hockengrills? Fuck-Server. Ok, also ihr sagt, der ist schon drauf. Das können wir ja mal"}, {"id": 385, "start": 3598.04, "end": 3604.64, "text": "ausprobieren, ob der schon drauf ist. Und zwar, ah ne, da gehen wir nicht hin. Wir gehen auf"}, {"id": 386, "start": 3604.64, "end": 3610.48, "text": "unsere Niedungskiste, SSH, 1, 2, 1, 2, 1, 2, 1, 3, 0. Nein, der ist nicht drauf, der SSH"}, {"id": 387, "start": 3610.48, "end": 3617.72, "text": "also aber. Gebaided, chat. Gebaided. Ach ne, Firewall-Regeln sind nicht erlaubt, kann das"}, {"id": 388, "start": 3617.72, "end": 3629.24, "text": "sein? Firewall. Firewall-Network, schalt mal einfach aus. Willst du mal Kinder haben eigentlich?"}, {"id": 389, "start": 3629.24, "end": 3634.8, "text": "Nein, auf keinen Fall. Private Network Active, mal schalte das einfach aus. Windows Defender"}, {"id": 390, "start": 3634.8, "end": 3647.36, "text": "Firewall, aus. Weg, weg damit. Ach guck mal, es pinkt da auch. Ok, jetzt. Ne, gebaided,"}, {"id": 391, "start": 3647.36, "end": 3659.96, "text": "siste Leute, kein SSH drauf. Warum gibt es hier oben eigentlich kein Suchknopf? SSH."}, {"id": 392, "start": 3659.96, "end": 3664.16, "text": "Wie geht das, dass er Better Twitch Demotes in deinem Stream-Chat anzeigt? Das macht das"}, {"id": 393, "start": 3664.16, "end": 3668.08, "text": "automatisch. Wie kriege ich hier einen SSH-Server installiert, Leute? Seht ihr das irgendwo?"}, {"id": 394, "start": 3668.08, "end": 3691.04, "text": "Demote-System. Fuck-Server. Ok, Moment, Moment. Windows 2019 install SSH-Server. Optional"}, {"id": 395, "start": 3691.04, "end": 3707.52, "text": "Features. Aha. Apps. Apps and Features. Also ich hab ja Mitleid mit jedem, der den Kram"}, {"id": 396, "start": 3707.52, "end": 3715.36, "text": "administrieren muss ohne die Oberfläche. Apps and Features. Manage Optional Features. Add"}, {"id": 397, "start": 3715.36, "end": 3724.0, "text": "Feature. Äh, kann man jetzt hier, nein, natürlich kann man hier nicht suchen drinne. Open SSH-Server,"}, {"id": 398, "start": 3724.0, "end": 3735.0, "text": "aha. Da ist es. Hat das jetzt installiert? Warum kann man hier eigentlich nicht drinnen,"}, {"id": 399, "start": 3735.0, "end": 3756.56, "text": "Moment, ist der Open SSH-Client. Add Feature. Moment. Hä? Doch, gerade gemacht. Open SSH-Server."}, {"id": 400, "start": 3756.56, "end": 3765.68, "text": "Der installiert das nicht. Warum installiert der das nicht? Alter Microsoft, please, warum"}, {"id": 401, "start": 3765.68, "end": 3770.84, "text": "sind die Sachen so unglaublich beschissen unter Windows? Ok, Max, bitte über den Server."}, {"id": 402, "start": 3770.84, "end": 3778.2, "text": "Alles klar. Ist das Server-Manager das hier? Moment, ist das, meinst, wo ist das überhaupt"}, {"id": 403, "start": 3778.2, "end": 3786.12, "text": "hin? Du meinst das hier, oder? Server-Manager. Ok, dann, dann schieß los. Wo geht das jetzt?"}, {"id": 404, "start": 3786.12, "end": 3800.76, "text": "Local Server, Remote Management. Oben rechts, Manage. Kripplistner. Und dann Add Roles and"}, {"id": 405, "start": 3800.76, "end": 3812.84, "text": "Features? Ich find's aber geil, dass das hier drüber nicht funktioniert, ne? Obwohl"}, {"id": 406, "start": 3812.84, "end": 3821.92, "text": "das Microsoft, ach, kommt mal. Was macht der da? Was macht der da gerade?"}, {"id": 407, "start": 3842.84, "end": 3850.44, "text": "Das ist ziemlich langsam, ne? Ok. Ach, ihr meint die Windows-Updates würden nicht funktionieren"}, {"id": 408, "start": 3850.44, "end": 3859.32, "text": "jetzt? Pending Restart. Soll ich wirklich jetzt rebooten dafür? Ok, also was müsst ihr"}, {"id": 409, "start": 3859.32, "end": 3873.96, "text": "jetzt hier machen? Add Server Selection before you begin. Ok, next. Role. Ok, was? Ach, hier"}, {"id": 410, "start": 3873.96, "end": 3878.0, "text": "kann man den Server auswählen, das ist einfach nur... So, und da kann man jetzt bestimmt"}, {"id": 411, "start": 3878.0, "end": 3894.92, "text": "SSH irgendwo auswählen oder auch nicht. Features. Ah, SSH, hier. SSH Server. Was? Nicht SMTP."}, {"id": 412, "start": 3894.92, "end": 3912.64, "text": "Äh, meint. Komm ich auf SMTP? SSH? Null. Äh, gibt's nicht? Äh, ja. Aber ich kann"}, {"id": 413, "start": 3912.64, "end": 3937.48, "text": "ein Interia-Client installieren. Fuck Server, Alter. Ah, ok, also das mit SSH Server installieren"}, {"id": 414, "start": 3937.48, "end": 3942.92, "text": "scheint nicht so zu tun. Ähm, ich muss jetzt wohl erstmal warten bis Windows-Updates fertig"}, {"id": 415, "start": 3942.92, "end": 3955.4, "text": "sind. Eventuell das Open SSH. Oh, Big Brain Chat. Big Brain. Guck mal mal. Ja, ja, ja."}, {"id": 416, "start": 3955.4, "end": 3983.96, "text": "Hallo? Windows? Windows? Will Gates guckt gerade persönlich nach. Local Host Timeout?"}, {"id": 417, "start": 3983.96, "end": 3992.6, "text": "Ok, wait. Ok, vielleicht liegt es wirklich an Windows-Updates, dass der rumspackt. Ok,"}, {"id": 418, "start": 3992.6, "end": 3997.6, "text": "Leute, Leute, ich sag euch mal was. Ich sag euch mal was. Es ist Windows. Das dürfen wir"}, {"id": 419, "start": 3997.6, "end": 4012.88, "text": "nicht vergessen. Restart. Jaja. Danach geht das. Danach geht das. Reboot. Reboot hilft"}, {"id": 420, "start": 4012.88, "end": 4020.4, "text": "bestimmt. Guck mal, wer Rebooted hat. Getting Windows ready. Don't turn your computer off."}, {"id": 421, "start": 4020.4, "end": 4034.44, "text": "Alles klar. Mir ist es absolut unbegreiflich, wie man sowas wirklich verwenden kann. Das"}, {"id": 422, "start": 4034.44, "end": 4043.36, "text": "versteht es nicht. Wir machen docker. Gleich haben wir docker drauf. Ja. Gleich haben wir"}, {"id": 423, "start": 4043.36, "end": 4050.68, "text": "docker drauf. Das wird jetzt lange. Warum? Warum braucht der 30 Stunden dafür? Ich hab"}, {"id": 424, "start": 4050.68, "end": 4073.68, "text": "doch gar nichts gemacht. Was gettet er da eigentlich ready? Oh. Ach, Updates. Ok, Big"}, {"id": 425, "start": 4073.68, "end": 4091.48, "text": "Update. Alles klar. Danach installieren wir Hyper-V. Und machen eine VM in der VM. Wir"}, {"id": 426, "start": 4091.48, "end": 4109.56, "text": "machen da eine Linux-VM in der Windows-VM. Wisst ihr, und ich denke immer, dass es schon"}, {"id": 427, "start": 4109.56, "end": 4114.0, "text": "eine Zumutung ist, wenn ich mal ein Ubuntu oder ein Debian oder ein Ratchet oder sonst"}, {"id": 428, "start": 4114.0, "end": 4125.32, "text": "etwas machen muss und der da 10 Minuten rumröten. Wobei 10 Minuten ist viel zu lang. 5 Minuten."}, {"id": 429, "start": 4125.32, "end": 4135.64, "text": "Ach guck mal, er startet. Excellent. Trusted Installer. Aha, G-Bated. You got G-Bated."}, {"id": 430, "start": 4135.64, "end": 4144.2, "text": "Man dachte er ist fertig. Er war gar nicht fertig. Jetzt haben wir's. Jetzt haben wir's"}, {"id": 431, "start": 4144.2, "end": 4160.2, "text": "Leute. Jetzt gehen wir wieder an unseren Remote Desktop. Yes, don't ask me again. Aha, da"}, {"id": 432, "start": 4160.2, "end": 4168.52, "text": "sind wir wieder Leute. Da sind wir wieder. Das ging tatsächlich relativ schnell. Moment,"}, {"id": 433, "start": 4168.52, "end": 4182.76, "text": "wir haben, wir haben. Was ist das? Was ist hier los? Oh. Was hat er für Schmerzen?"}, {"id": 434, "start": 4182.76, "end": 4204.08, "text": "Warum ist das jetzt alles rot? Ich hab doch gar nichts gemacht. Ich hab, ich hab doch"}, {"id": 435, "start": 4204.08, "end": 4219.32, "text": "legit nichts gemacht. Oh guck mal, es geht weg. Es geht weg. Es geht langsam weg. Habt"}, {"id": 436, "start": 4219.32, "end": 4238.28, "text": "ihr das gesehen? Jetzt sind es nur noch 5. Ah, delayed start, ok. Stand ich auch dahinter,"}, {"id": 437, "start": 4238.28, "end": 4243.56, "text": "delayed start. Ok, also können wir das ignorieren. Was macht denn eigentlich unsere SSH Server"}, {"id": 438, "start": 4243.56, "end": 4260.12, "text": "denn? Apps? Features? Warum kann man hier eigentlich nicht drinne suchen? Ok, es scheint"}, {"id": 439, "start": 4260.12, "end": 4266.92, "text": "installiert zu sein. Scheint installiert zu sein. Open SSH Server. Poggers. Ok, gleich"}, {"id": 440, "start": 4266.92, "end": 4291.68, "text": "mal gucken, ob es funktioniert. Nein, nein, nein, nicht dahin. Geh weg. Was? Man muss"}, {"id": 441, "start": 4291.68, "end": 4305.28, "text": "bestimmt den Service starten noch. Ok, Service. SSH. Nee, Open SSH. Open SSH Server, der ist"}, {"id": 442, "start": 4305.28, "end": 4313.04, "text": "nämlich nicht gestartet. Starten. Jetzt aber. Jetzt aber. Bam. Housekey Verification failed."}, {"id": 443, "start": 4313.04, "end": 4322.6, "text": "Ja, den Scheiß können wir immer wieder komplett löschen. So, yes. Nein, Administrator. Administrator."}, {"id": 444, "start": 4322.6, "end": 4327.96, "text": "Root ist so einfach zu tippen, ne? Kannst du mal PowerShell Remote probieren? Ja, probier"}, {"id": 445, "start": 4327.96, "end": 4334.08, "text": "mal, probier mal gleich aus. Fingerprint. Oh, MonkaS. 123456, underscore A. Da sind"}, {"id": 446, "start": 4334.08, "end": 4343.4, "text": "wir. Leute. Exzellent. Wir sind Remote über SSH auf ne Windows Server und haben ne CMD"}, {"id": 447, "start": 4343.4, "end": 4350.8, "text": "offen. Und das ist also Batchgedöns. Das ist PowerShell. PowerShell. Komm, man kann sogar"}, {"id": 448, "start": 4350.8, "end": 4361.56, "text": "ne PowerShell starten. Huge Poggers. Also, das geht ja nicht unter, unter Windows. Ah,"}, {"id": 449, "start": 4361.56, "end": 4368.32, "text": "man kann sogar ne PowerShell starten. Kann man auch SSHX Forwarding machen? Hehehe, nee,"}, {"id": 450, "start": 4368.32, "end": 4377.32, "text": "das ist zu schön. Moment, startet er das jetzt auf meinem? Wartet mal kurz, Leute. Ok, die"}, {"id": 451, "start": 4377.32, "end": 4382.56, "text": "haben keinen Bock. Startet er das jetzt? Wenn ich das jetzt hier starte in der PowerShell,"}, {"id": 452, "start": 4382.56, "end": 4393.48, "text": "startet er das jetzt auf meinem Desktop? Nee, der macht einfach gar nix. Alles klar. Was"}, {"id": 453, "start": 4393.48, "end": 4404.32, "text": "auch immer. Äh, wie kommt man hier raus? Exit. NapGuaMoase. Exit. Ok, machen wir mal"}, {"id": 454, "start": 4404.32, "end": 4421.4, "text": "SSH GUI Weiterleitung. 1, 2, 3, 4, 5. Moment, kann man Keys kopieren? SSH CopyCopyID. Nein,"}, {"id": 455, "start": 4421.4, "end": 4432.24, "text": "das wär auch zu einfach, wenn das funktioniert. Server Manager. Nee, ok, also das wär auch"}, {"id": 456, "start": 4432.24, "end": 4439.36, "text": "zu abgedreht, wenn X Forwarding funktionieren würde. Äh, ja, LS ist ein Alias in PowerShell."}, {"id": 457, "start": 4439.36, "end": 4445.12, "text": "Es gibt ein paar Sachen, wo sie den Linux Leuten entgegen kommen wollten, was sie in"}, {"id": 458, "start": 4445.12, "end": 4454.56, "text": "PowerShell eingebaut haben. Ok, also das, das, das funktioniert schonmal. Bin ich, ich bin"}, {"id": 459, "start": 4454.56, "end": 4460.24, "text": "ja zum Teil begeistert. So, wie macht man den Server Manager wieder auf, wenn man zugemacht"}, {"id": 460, "start": 4460.24, "end": 4470.52, "text": "hat? Da war er. VGET ist auch ein Alias. Sag mal, wie lang brauchen eigentlich die Services,"}, {"id": 461, "start": 4470.52, "end": 4475.72, "text": "bis die starten? Jetzt mal ehrlich, das dauert ja 10 Minuten, bis der Kram auf ist. Was sagst"}, {"id": 462, "start": 4475.72, "end": 4485.84, "text": "du, VGET gibt's? PowerShell. Moment, was ist das? Oh, das kenn ich. Das ist diese komische"}, {"id": 463, "start": 4485.84, "end": 4497.0, "text": "PowerShell IDE, die dabei ist. Gehst sofort. PowerShell. VGET, kommt ein Problem aus. VGET"}, {"id": 464, "start": 4497.0, "end": 4517.16, "text": "ist ein Alias auf den Internet Explorer."}, {"id": 465, "start": 4517.16, "end": 4533.6, "text": "Was, was soll ich davon halten jetzt?"}, {"id": 466, "start": 4533.6, "end": 4548.0, "text": "Los. Gibt's einen CURL? Gibt's auch einen CURL? Das ist ein fucking Internet Explorer"}, {"id": 467, "start": 4548.0, "end": 4563.36, "text": "Link. Das ist so kaputt. Ok, die Services sind immer noch nicht gestartet. Alles klar,"}, {"id": 468, "start": 4563.36, "end": 4568.96, "text": "ok, weiter, weiter im Text. Also, es ist ja schon mal nicht schlecht. Wir haben's ja schon"}, {"id": 469, "start": 4568.96, "end": 4573.04, "text": "mal geschafft. Jetzt ist es hart Zugang zu installieren. Mit kann ich zwar nichts anfangen,"}, {"id": 470, "start": 4573.04, "end": 4594.48, "text": "aber... Ach Moment, Parrot Life. Gute Idee. Nein, das geht nicht. Das geht nicht. CURL"}, {"id": 471, "start": 4594.48, "end": 4612.8, "text": "Mache mal ADD anstatt CLOSE, ok. Ich ADD jetzt einfach alles. Ich muss das gerade doppelt"}, {"id": 472, "start": 4612.8, "end": 4621.44, "text": "ADDen. Was du bisher verpasst hast, viele merkwürdige Windows Sachen. Also, by the way, wer sich"}, {"id": 473, "start": 4621.44, "end": 4631.12, "text": "fragt, wie die Seite aussehen sollte. Eigentlich sollte die Seite so aussehen. Mit einem normalen"}, {"id": 474, "start": 4631.12, "end": 4647.72, "text": "CURL funktioniert das ohne Probleme. Aber das Beste ist ja immer noch... Ah ne, das hab"}, {"id": 475, "start": 4647.72, "end": 4653.76, "text": "ich jetzt hier nicht gestartet. Du kannst doch den IE komplett rausnehmen. Ah ne, darf ruhig"}, {"id": 476, "start": 4653.76, "end": 4661.44, "text": "so bleiben. Ok, der Kram, der mag nicht starten. Das ist wirklich... Ah, das ist stopped. Ok,"}, {"id": 477, "start": 4661.44, "end": 4665.4, "text": "wenn es absichtlich stopped ist, dann muss es das doch auch nicht als rot anzeigen. Ok,"}, {"id": 478, "start": 4665.4, "end": 4673.0, "text": "nächste. Wir ignorieren das jetzt. Ok, weiter im Text. Ich bin mir nicht sicher, ob ich"}, {"id": 479, "start": 4673.0, "end": 4676.28, "text": "das jetzt ernsthaft machen will, weil ich hab mir aufgeschrieben, ich würde gerne"}, {"id": 480, "start": 4676.28, "end": 4685.96, "text": "eine statische HTML-Seite hosten. Aber nachdem ich gesehen hab... Was das für ein riesen"}, {"id": 481, "start": 4685.96, "end": 4691.32, "text": "Act ist, so einfache Dinge anzumachen. Wie würde ich eine statische HTML-Seite hosten?"}, {"id": 482, "start": 4691.32, "end": 4698.2, "text": "Ok, add roles and features. Ich mach das mal als Windows-Noob, ja. Skip this page by default,"}, {"id": 483, "start": 4698.2, "end": 4705.4, "text": "ja. Als Windows-Noob, der echt keine Ahnung davon hat. Also Windows... Ich suche... Ich"}, {"id": 484, "start": 4705.4, "end": 4718.48, "text": "würde jetzt nach Web-Server suchen. Ich würde jetzt nach Web-Server suchen. Web-Server."}, {"id": 485, "start": 4718.48, "end": 4738.6, "text": "Add features. Next. Äh, brauch ich da alles net? Talent client, das macht mich immer"}, {"id": 486, "start": 4738.6, "end": 4749.72, "text": "noch fertig, dass es ein eigenes Feature ist unter Windows. Next. Naja, next. Was will"}, {"id": 487, "start": 4749.72, "end": 4769.92, "text": "er von mir? Was, dritte von unten? Wireless... Der WLAN-Service. Ok, next. FreshBK, was denn?"}, {"id": 488, "start": 4769.92, "end": 4774.4, "text": "Drei Minuten macht doch nix, drei Minuten geht doch schnell. Oder meinst du damit, es"}, {"id": 489, "start": 4774.4, "end": 4780.84, "text": "dauert nicht lang. Äh, static, static content. Ja, genau das brauch ich, static content."}, {"id": 490, "start": 4780.84, "end": 4805.36, "text": "Next. Install. So. Also, er installt jetzt auf Nabukumamasa, sei. Alles klar. Easy."}, {"id": 491, "start": 4805.36, "end": 4823.48, "text": "Also für mich als Linux-Mann ist das eher... Es ist auf eine gewisse Art und Weise unterhaltsam,"}, {"id": 492, "start": 4823.48, "end": 4833.92, "text": "aber auch nur vor dem Hintergrund, dass ich weiß, ich muss es nie verwenden. Weil wenn"}, {"id": 493, "start": 4833.92, "end": 4840.96, "text": "ich wüsste, ich müsste das verwenden, dann würde ich wahrscheinlich eher verzweifeln"}, {"id": 494, "start": 4840.96, "end": 4846.44, "text": "da dran. Ok, Klaus. Jetzt hab ich nen Web-Server installiert. Guck mal, man kann das sogar"}, {"id": 495, "start": 4846.44, "end": 4850.8, "text": "da drüber verwalten, das ist ja richtig big brain. So, und jetzt irgendwo ne statische"}, {"id": 496, "start": 4850.8, "end": 4864.8, "text": "HTML-Seite reinlegen. Wo ist denn hier so der... Der www-Root quasi, wo ist denn das"}, {"id": 497, "start": 4864.8, "end": 4872.32, "text": "hier? Nickteaming, ist das sowas wie Bonding? Noch nie nen Arbeitgeberwechsel in Betracht"}, {"id": 498, "start": 4872.32, "end": 4881.32, "text": "gezogen. Ja doch, wenn ich Windows-Server machen müsste, dann schon. IES-Manager, ist"}, {"id": 499, "start": 4881.32, "end": 4891.16, "text": "das doch hier der IES? Nee. Oben rechts Tool? Ah, hier der Internet Information Services"}, {"id": 500, "start": 4891.16, "end": 4905.8, "text": "Manager. Ah, Big Brain Tool. Sieht wahrscheinlich seit Windows 2003 genauso aus. So. Also das"}, {"id": 501, "start": 4905.8, "end": 4913.6, "text": "heißt, wenn ich jetzt auf den Server gehe, hab ich dann schon ne Seite? Äh, was war's?"}, {"id": 502, "start": 4913.6, "end": 4943.04, "text": "130, 230, 130, ne? Oah, Porgers. Es ist schonmal ne Seite, das ist doch schonmal gut. 2003"}, {"id": 503, "start": 4943.04, "end": 4950.08, "text": "war noch etwas eckiger. Wie willst du das von dir entscheiden können, wenn du noch nie"}, {"id": 504, "start": 4950.08, "end": 4953.56, "text": "mit Windows gearbeitet hast? Ich hab genug mit Windows gearbeitet, dass ich weiß, ich"}, {"id": 505, "start": 4953.56, "end": 4958.48, "text": "will damit nichts zu tun haben. Zumindest nicht live, ja? Jetzt hier ein bisschen mit"}, {"id": 506, "start": 4958.48, "end": 4963.24, "text": "rumspielen ist ja eigentlich ganz nett, aber nee, nee, nee, nee. Geh mal bloß fort. Jedesmal,"}, {"id": 507, "start": 4963.24, "end": 4968.52, "text": "wenn ich mit Windows was machen muss, krieg ich absolut Anfälle, wo Sachen versteckt"}, {"id": 508, "start": 4968.52, "end": 4974.64, "text": "werden. Ich mein, allein schon die glorreiche Idee von Microsoft, dass dieses komische Feature"}, {"id": 509, "start": 4974.64, "end": 4978.92, "text": "hinzufügen Telnet kleint. Ich mein, ganz im Ernst, wer hat sich das hier überlegt?"}, {"id": 510, "start": 4978.92, "end": 4983.68, "text": "Warum gibt's hier keine Suche drin und solche Sachen? Warum? Das ist alles total, total"}, {"id": 511, "start": 4983.68, "end": 4991.6, "text": "zusammengestückelt irgendwie. Ich will nicht sagen, dass das unter Linux die Usability,"}, {"id": 512, "start": 4991.6, "end": 4998.8, "text": "dass Usability mecker ist oder so. Da gibt's auch genug viel Scheiß, ja? Keine Frage."}, {"id": 513, "start": 4998.8, "end": 5006.16, "text": "Aber es fühlt sich alles nicht so hakelig an. So, okay, ich will eine statische HTML-Seite"}, {"id": 514, "start": 5006.16, "end": 5025.0, "text": "anzeigen. Wie mach ich das? Start-Seite, die Start-Seite ist hier. New Site. Wo ist"}, {"id": 515, "start": 5025.0, "end": 5034.36, "text": "mein www-Root? Wo muss ich eine statische Seite hinlegen? Unten umschalten auf Content."}, {"id": 516, "start": 5034.36, "end": 5055.48, "text": "Ah, ah, guck mal da. Ah, Big Brain. Add Website. Okay, wir machen jetzt mal eine ganz, ganz"}, {"id": 517, "start": 5055.48, "end": 5071.84, "text": "tolle, äh, statische Website. Dann gehen wir mal irgendwo hin. Ahnung. C. Enet-Pupp,"}, {"id": 518, "start": 5071.84, "end": 5077.88, "text": "da rein? Oh, guck mal, wir haben einen richtig echten www-Root. Krasser Shit. Alter. Das"}, {"id": 519, "start": 5077.88, "end": 5090.52, "text": "heißt ja noch www-Root. Okay. Poggers.html. Ähm, hallo. Komm, egal. So, kann ich da jetzt"}, {"id": 520, "start": 5090.52, "end": 5105.72, "text": "direkt drauf? Poggers.html. Nein. Ach, stimmt. Oh, es ist ja Windows. Ja, ja. Es schmerzt,"}, {"id": 521, "start": 5105.72, "end": 5124.04, "text": "es schmerzt. Okay, View. Dateierweiterung. File-Extension. Yes. Boah. Okay, wir haben"}, {"id": 522, "start": 5124.04, "end": 5138.6, "text": "es geschafft. Web-Server am Start. Wahnsinn. Die Seite sieht ja auch aus. Sehr gut. Sehr"}, {"id": 523, "start": 5138.6, "end": 5144.24, "text": "gut. So. Ähm. Okay, und jetzt kommen die, jetzt kommen die schwierigen Sachen. Also"}, {"id": 524, "start": 5144.24, "end": 5149.32, "text": "ich hab mir aufgeschrieben Remote Access. Dann guck mal, ob SSH installieren kann. Äh,"}, {"id": 525, "start": 5149.32, "end": 5152.88, "text": "ob man einen Web-Server installiert kriegt mit einer statischen HTML-Seite. Dann ob"}, {"id": 526, "start": 5152.88, "end": 5156.76, "text": "es so was wie einen Paket-Manager gibt, aber sowas wie einen Paket-Manager gibt es nicht."}, {"id": 527, "start": 5156.76, "end": 5163.8, "text": "Es gibt hier dieses Rolls- und Features-Update-Gedöns, aber es hat ja mit dem Paket-Manager nichts"}, {"id": 528, "start": 5163.8, "end": 5175.96, "text": "zu tun. So, und jetzt wollen wir mal Docker installieren. Da bin ich jetzt mal wirklich"}, {"id": 529, "start": 5175.96, "end": 5184.44, "text": "sehr gespannt drauf. Docker unter Windows ist ja Hyper-V. Zumindest war es das am Anfang."}, {"id": 530, "start": 5184.44, "end": 5189.92, "text": "Ob das immer noch so ist. Deswegen müssen wir das glaube ich hier mal stoppen, den Server"}, {"id": 531, "start": 5189.92, "end": 5197.12, "text": "anhalten und Virtualisierung einschalten, dass das klappt. Äh, bin ich jetzt auch vom Server"}, {"id": 532, "start": 5197.12, "end": 5215.64, "text": "drauf? Shutdown. Unplanned. Okay. Docker unter Windows ist cute. Sicher. Docker, ah, Windows-Container"}, {"id": 533, "start": 5215.64, "end": 5220.56, "text": "laufen ohne Hyper-V, aber eben nur Windows-Programm. Okay, verstehe. Aber man kann doch, man kann"}, {"id": 534, "start": 5220.56, "end": 5225.6, "text": "doch auch Docker-Container machen mit Linux-Programm, oder? Und dann ist es ein Hyper-V-Container."}, {"id": 535, "start": 5225.6, "end": 5238.84, "text": "Äh, Hyper-V-VM. Also, Options. Wo ging das jetzt nochmal? CPU. Virtualize. Das da. Power"}, {"id": 536, "start": 5238.84, "end": 5245.68, "text": "on. Paket-Manager-Install-Package. Ja, aber da kann ich nicht einfach sowas wie, sagen"}, {"id": 537, "start": 5245.68, "end": 5249.4, "text": "wir mal, Firefox. Nee, na gut, Firefox ist ein doofes Brand. Nginx installieren oder"}, {"id": 538, "start": 5249.4, "end": 5261.08, "text": "sowas? Echt? Das probieren wir mal aus jetzt gleich. So, immer wieder RDP drauf. Das liest"}, {"id": 539, "start": 5261.08, "end": 5265.68, "text": "sich so als wärs PowerShell, hä? Liest sich ein bisschen so als wärs PowerShell. Was?"}, {"id": 540, "start": 5265.68, "end": 5272.04, "text": "Find-Package. Find-Package. Find-Package. Okay, Nginx. Oh, ich kann mal net, ich glaub,"}, {"id": 541, "start": 5272.04, "end": 5293.44, "text": "so schreibt man. Was? Nougat is not installed. Yes, mach einfach. Yes. Oh. WTF? Ah, der findet's"}, {"id": 542, "start": 5293.44, "end": 5302.16, "text": "nicht. Okay, das ist dann bloß für Windows eigene Geschichten. Das ist nix mit, äh,"}, {"id": 543, "start": 5302.16, "end": 5309.52, "text": "das ist nix für normale Software. Nee, nee, was kann man da so zum Beispiel installieren?"}, {"id": 544, "start": 5309.52, "end": 5326.36, "text": "Docker? Ah. Ah nee, Find-Package. Das sind PowerShell Extensions, hä? Visual Studio,"}, {"id": 545, "start": 5326.36, "end": 5343.2, "text": "mal Visual, äh, Visual. Keine Ahnung, Code. Was auch immer. Okay, was mach ich? Windows"}, {"id": 546, "start": 5343.2, "end": 5363.56, "text": "Server Host, Windows Server Container. Excellent. Oh. Okay. Äh, da brauch ich nen Guide zu."}, {"id": 547, "start": 5363.56, "end": 5386.96, "text": "Install Docker Windows 2019. Ah. Ah, geht ja schon gut los. Null. Äh. Äh, ist es Server?"}, {"id": 548, "start": 5386.96, "end": 5405.0, "text": "Ah. Install Docker und Windows 10, nee. Okay, ich muss die Windows 10 Anleitung wahrscheinlich"}, {"id": 549, "start": 5405.0, "end": 5415.2, "text": "machen. Kann man das nicht über den Server Manager machen? Irgendjemand hat auch gerade"}, {"id": 550, "start": 5415.2, "end": 5424.96, "text": "geschrieben, man muss. Irgendjemand hat auch gerade geschrieben, man muss irgendwo auf"}, {"id": 551, "start": 5424.96, "end": 5433.44, "text": "Windows Server Host oder so. Windows Server Host, Windows Server Container. Wo, wo, wo,"}, {"id": 552, "start": 5433.44, "end": 5450.52, "text": "wo steht das? Peaches. Okay, bla, bla, bla, Hyper-V, Hyper-V. Install mir mal ne Runde"}, {"id": 553, "start": 5450.52, "end": 5464.08, "text": "Hyper-V. Kann ich schaden. Nee, nee, keine Windows, ich will, ich will richtig echte"}, {"id": 554, "start": 5464.08, "end": 5481.36, "text": "Videos ausprobieren, wie gut das funktioniert. Okay, Containers. Ah, Windows Server Containers."}, {"id": 555, "start": 5481.36, "end": 5502.76, "text": "Switches, Switches. Äh. Okay, was auch immer. Ähm, dann installieren wir jetzt mal wirklich"}, {"id": 556, "start": 5502.76, "end": 5512.52, "text": "Docker, da stand doch hier irgendwo, Docker, Windows. Get Docker Desktop für Windows Server,"}, {"id": 557, "start": 5512.52, "end": 5524.24, "text": "nee Server. Install Docker Enterprise Engine. Ich will nicht die Enterprise Engine, ich"}, {"id": 558, "start": 5524.24, "end": 5536.52, "text": "will einfach Install Docker Windows 2019. Hier, Six-Eyed, was auch immer. Nicht Six-Eyed,"}, {"id": 559, "start": 5536.52, "end": 5543.12, "text": "Five-Headed. Connection, okay, also was? Install Windows Feature Containers, Setup, Install"}, {"id": 560, "start": 5543.12, "end": 5555.72, "text": "Docker und Windows, Install Module, Docker, MS, ja wer, alles in der Welt kommt dann da"}, {"id": 561, "start": 5555.72, "end": 5578.72, "text": "rein. Meint das den Windows Container? Äh, what the fuck. Boah ey, das überfordert"}, {"id": 562, "start": 5578.72, "end": 5600.92, "text": "mein Brain gerade. Das überfordert mein Brain. Linux. Ja, die Docker für Windows Installer"}, {"id": 563, "start": 5600.92, "end": 5624.52, "text": "hab ich ja schon gefunden, aber da steht doch nix von Server. Ich rat mir das jetzt einfach"}, {"id": 564, "start": 5624.52, "end": 5642.24, "text": "Windows typisch von der Docker-Webseite runter. Install Docker Windows 2019, Lul. Zack. What"}, {"id": 565, "start": 5642.24, "end": 5656.44, "text": "the fuck? Install Docker und Windows. Hyper-V and Container Features, okay, das müssen"}, {"id": 566, "start": 5656.44, "end": 5667.32, "text": "wir noch hinzufügen. Add Roles, also Hyper-V, add, ja mach und Containers, und Containers,"}, {"id": 567, "start": 5667.32, "end": 5678.36, "text": "next, naja, next, was auch immer, next, alles klar, next, mach weiter, install. So und eh"}, {"id": 568, "start": 5678.36, "end": 5685.72, "text": "machen wir noch PowerShell auf, da hab ich gesagt Find Package, da konnte ich Docker"}, {"id": 569, "start": 5685.72, "end": 5697.04, "text": "suchen. So und das macht jetzt was, muss ich das noch mal suchen, dass er das breiter"}, {"id": 570, "start": 5697.04, "end": 5718.68, "text": "schreibt. This model helps with development, it detects, was soll man das installieren?"}, {"id": 571, "start": 5718.68, "end": 5722.08, "text": "Aber kann man damit nicht angeblich auch Linux-Software ausführen und dass er das dann der Hyper-V"}, {"id": 572, "start": 5722.08, "end": 5728.64, "text": "Vm macht, probieren wir jetzt aus. Ich warte jetzt bis der Kram installiert ist, was bringt"}, {"id": 573, "start": 5728.64, "end": 5734.4, "text": "hier Docker, das weiß ich noch nicht, was das unter Windows bringt. Restart, ach ja,"}, {"id": 574, "start": 5734.4, "end": 5748.68, "text": "exellent, Windows Restart, alles klar. Restart pending, okay, ja wir restarten. Install Package"}, {"id": 575, "start": 5748.68, "end": 5758.4, "text": "Docker, natürlich lese ich den Chat, aber der Chat schreibt laufend irgendwas anderes,"}, {"id": 576, "start": 5758.4, "end": 5776.08, "text": "mal so, mal so, ich kann ja nicht so schwer sein. Install module, Docker Provider install,"}, {"id": 577, "start": 5776.08, "end": 5780.32, "text": "probier mal gleich aus. Also das hier mag schon mal nicht, vielleicht weil er am Neustart"}, {"id": 578, "start": 5780.32, "end": 5796.64, "text": "hängt oder es zeigt kein Progress an. Was? Okay ich starte erstmal neu, man muss ja mal"}, {"id": 579, "start": 5796.64, "end": 5814.36, "text": "zwischendurch neu starten, dass es funktioniert. Okay, ist er wieder da? Warte mal, ach nee,"}, {"id": 580, "start": 5814.36, "end": 5818.88, "text": "der Chat, ah Updates, wie konnte ich das vergessen, dass der erst zwei Stunden immer wieder neue"}, {"id": 581, "start": 5818.88, "end": 5827.76, "text": "Updates installieren muss. Was ist denn der intelligent, intelligent background, was auch"}, {"id": 582, "start": 5827.76, "end": 5851.6, "text": "immer Service? So, da ist er wieder. Moment, nein, nein, ah, hab ich doppelt aufgemacht,"}, {"id": 583, "start": 5851.6, "end": 5859.36, "text": "einmal da, einmal da, ja ja, Disconnect. Background Intelligent Transfer Service, das klingt sehr"}, {"id": 584, "start": 5859.36, "end": 5887.88, "text": "big brain. Okay, PowerShell, PowerShell, Install, Package, Docker. Packages, Trust, yes. War das"}, {"id": 585, "start": 5887.88, "end": 5902.44, "text": "ich eben schon größer gemacht und eben schon viel größer eingestellt oder? Aha, hat er"}, {"id": 586, "start": 5902.44, "end": 5923.76, "text": "das jetzt installiert? Docker, nein. Okay, dann mach ich jetzt mal das, was der Kellmore"}, {"id": 587, "start": 5923.76, "end": 5947.64, "text": "geschrieben hat. Install, okay, also Install, Module, Docker, Provider, yes, yes, yes, yes,"}, {"id": 588, "start": 5947.64, "end": 5968.6, "text": "Docker, what? Und dann was? Docker, ich will kein Brave View, ich will einfach, dass es,"}, {"id": 589, "start": 5968.6, "end": 5990.04, "text": "ich hab keine Ahnung, was das treibt, yes, Docker, ah, hoho, guck mal da, krass. Wie"}, {"id": 590, "start": 5990.04, "end": 5997.56, "text": "ist die Enterprise Experience so unglaublich? Wahnsinn, ganz toll, Docker, who am I, Container,"}, {"id": 591, "start": 5997.56, "end": 6020.92, "text": "genau, den starten wir jetzt mal. Was? Ja, das ist ja auch kein Windows, kein Windows"}, {"id": 592, "start": 6020.92, "end": 6037.32, "text": "Docker. Ja, ich weiß, dass es Docker LS ist. Kann man keine Linux Dockers ausführen? Okay,"}, {"id": 593, "start": 6037.32, "end": 6052.96, "text": "das geht anscheinend nicht. Run Linux Docker Windows. Ich mein, man kann WSL installieren"}, {"id": 594, "start": 6052.96, "end": 6080.16, "text": "hier. Die haben hier grandiose, to run Linux. Okay. Run Hello World, okay, schauen wir mal,"}, {"id": 595, "start": 6080.16, "end": 6096.28, "text": "ob das funktioniert. Also Kellmore, wenn man sowas braucht, wäre ja echt armselig. Okay,"}, {"id": 596, "start": 6096.28, "end": 6114.76, "text": "das hat funktioniert. Ja, bla, bla, Explore Application, bla, bla, bla. Linux. Ach hier,"}, {"id": 597, "start": 6114.76, "end": 6132.92, "text": "Resource Tab. Aha, das war auch die Windows Version von Hello World, garantiert. Mein"}, {"id": 598, "start": 6132.92, "end": 6142.32, "text": "Gott ist der Scheiß kompliziert, ey. Docker Settings Dialog. Hab ich jetzt Docker Settings"}, {"id": 599, "start": 6142.32, "end": 6153.0, "text": "Dialog? Boah, ich kriege Anfälle. Okay, ich mache jetzt das, was der Kellmore sagt, was"}, {"id": 600, "start": 6153.0, "end": 6174.04, "text": "aber halt echt lächerlich wäre, wenn das nur so funktioniert. Was zum? Es ist Windows,"}, {"id": 601, "start": 6174.04, "end": 6188.64, "text": "was erwartest du? Ja, ja wenig. So, jetzt ist die Frage, ob es funktioniert. Extracting,"}, {"id": 602, "start": 6188.64, "end": 6217.8, "text": "Hausechamp. Ja, funktioniert. Es läuft, Leute, es läuft."}, {"id": 603, "start": 6217.8, "end": 6235.84, "text": "Stopp. Das heißt, wenn ich jetzt hier auf 5, Port, Moment, Port 55019 gehe. 1, 9. Oh,"}, {"id": 604, "start": 6235.84, "end": 6243.24, "text": "ups. Fast. Who am I? Wir haben den Linux-Docker-Container laufen auf Windows. Okay, das ging sogar,"}, {"id": 605, "start": 6243.24, "end": 6246.68, "text": "das ging halbwegs. Also, das habe ich mir schlimmer vorgestellt, wobei das Setting"}, {"id": 606, "start": 6246.68, "end": 6250.08, "text": "ist immer noch sehr merkwürdig. Willst du jetzt noch mal Docker vor Windows? Ich dachte"}, {"id": 607, "start": 6250.08, "end": 6253.72, "text": "ja eigentlich, dass man das so machen kann, ohne über eine Webseite Installer klicken"}, {"id": 608, "start": 6253.72, "end": 6281.04, "text": "zu müssen. Docker vor Windows. Install. Dann Docker Desktop. Ja, GIF. Ja, ich habe"}, {"id": 609, "start": 6281.04, "end": 6293.32, "text": "GIF. Stable. Das müsste die Enterprise-Passion sein. Okay, das ist mir ehrlich gesagt ziemlich"}, {"id": 610, "start": 6293.32, "end": 6302.8, "text": "egal. Kann man das sogar parallel laufen lassen? Docker Desktop ist nur für Dev-Zwecke. Ja,"}, {"id": 611, "start": 6302.8, "end": 6307.36, "text": "juckt mich nicht. Wenn ich wirklich, ich will es einfach nochmal auspringen, wenn ich wirklich"}, {"id": 612, "start": 6307.36, "end": 6311.6, "text": "Linux-Docker-Anwendung live laufen lassen will, dann mache ich das wahrscheinlich eh"}, {"id": 613, "start": 6311.6, "end": 6318.32, "text": "nicht auf dem Windows-Docker. Sondern ganz stinknormal auf der Linux-Kiste, wie ich es"}, {"id": 614, "start": 6318.32, "end": 6324.52, "text": "normalerweise eh machen würde. Aber das ging relativ gut, muss man echt sagen. Hat man"}, {"id": 615, "start": 6324.52, "end": 6328.6, "text": "wieder gesehen, die ganzen Subs haben sich gelohnt, weil es ist wieder excellent Big"}, {"id": 616, "start": 6328.6, "end": 6342.8, "text": "Ten. Chat. Wie weit bist du ja, Docker unter Windows-Schalt zu funktionieren? QEMU-Image."}, {"id": 617, "start": 6342.8, "end": 6354.52, "text": "Bugsnack. Die finden sich in ihrem Installer auch geil, oder? Wie das hier unten ausfaded."}, {"id": 618, "start": 6354.52, "end": 6369.04, "text": "Die feiern sich da richtig. Danach musst du Windows neu starten. Höchstwahrscheinlich."}, {"id": 619, "start": 6369.04, "end": 6377.8, "text": "Die IHK hat einfach euer Ergebnis der Abschlussprüfung geliegt am Samstag. Wie liegt denn die IHK"}, {"id": 620, "start": 6377.8, "end": 6392.72, "text": "auf die Abschlussprüfungsergebnisse? Macht der da? Wie viel Festplattenplatz verbraucht"}, {"id": 621, "start": 6392.72, "end": 6414.12, "text": "der Kram eigentlich gerade? Geht eigentlich? Nur 20G? Lockout? Okay. Wenn Docker das sagt."}, {"id": 622, "start": 6414.12, "end": 6423.04, "text": "Docker Info, ja, kann ich machen. Nee, das läuft doch jetzt beides, oder? Oder hat sich"}, {"id": 623, "start": 6423.04, "end": 6436.28, "text": "das eine jetzt Docker Info. Das ist die Enterprise hier. Das ist Enterprise. Und das hier ist"}, {"id": 624, "start": 6436.28, "end": 6458.28, "text": "Desktop. Wie auch immer, der das jetzt unterscheidet. Docker. Ah ja. Oh, was? Ich hab 4Gigabyte"}, {"id": 625, "start": 6458.28, "end": 6482.16, "text": "drin. Wollt ihr mich veräppeln? What? Jetzt startet er gar nicht mehr, oder was?"}, {"id": 626, "start": 6482.16, "end": 6511.36, "text": "Okay, jetzt hat er keinen Bock mehr. Docker Desktop Excel, weg damit. Bam. Dann startet"}, {"id": 627, "start": 6511.36, "end": 6524.4, "text": "er wieder. Aha. Ach, da ist es. Da ist es. Aha. Ist er einfach einmal beenden und wieder"}, {"id": 628, "start": 6524.4, "end": 6537.92, "text": "starten, dann geht's. So. Da ist es. Docker is starting. Kubernetes. Nicht genug Sp- Das"}, {"id": 629, "start": 6537.92, "end": 6559.6, "text": "Ding hat 4Gigabyte. 4Gigabyte. Das muss doch reichen um... Okay. 4Gigabyte ist doch nix."}, {"id": 630, "start": 6559.6, "end": 6565.64, "text": "Ja, das stimmt. Für Windows reicht das nicht. Okay, wir machen das. Ich hab ja genug RAM."}, {"id": 631, "start": 6565.64, "end": 6569.88, "text": "Da kriegt er jetzt einfach mehr RAM. Ich hab ja genug. Ich hab, wie viel hab ich eigentlich"}, {"id": 632, "start": 6569.88, "end": 6578.04, "text": "mittlerweile? 16 oder 32? 16, ne? Ich hab 16. Habe ich zu... Ey, ich hab 32. Okay, da"}, {"id": 633, "start": 6578.04, "end": 6585.36, "text": "kann der Stall noch eine ganze Ecke mehr kriegen. Easy. Kein Problem. Ja. Flop. Perfekt. Mehr"}, {"id": 634, "start": 6585.36, "end": 6596.6, "text": "RAM. Mehr RAM. Man kann nie genug RAM haben. Ich hab extra 32 GB, damit ich fürs nächste"}, {"id": 635, "start": 6596.6, "end": 6604.48, "text": "Windows Update gerüstet bin. Ja, Captain Peng, das nachvollziehbar, ja. Pongas. Mal gucken,"}, {"id": 636, "start": 6604.48, "end": 6616.76, "text": "ob es jetzt funktioniert. Kann man den Server Manager irgendwie ausschalten? Dass der nicht"}, {"id": 637, "start": 6616.76, "end": 6628.76, "text": "am Anfang mal aufploppt? Review? Hide welcome? Oh, Docker startet. Habt ihr gesehen, da ist"}, {"id": 638, "start": 6628.76, "end": 6650.12, "text": "er. Da läuft er. Docker is starting. Mal gucken, ob der RAM jetzt reicht. Wow. Der frisst"}, {"id": 639, "start": 6650.12, "end": 6669.32, "text": "schon ordentlich RAM. Der ist da schon nicht genügend, sondern nicht genügsam. Ja, haben"}, {"id": 640, "start": 6669.32, "end": 6685.72, "text": "wir. So. Und nun? Open Power Stall and start hacking with Docker or Compose. Excellent."}, {"id": 641, "start": 6685.72, "end": 6702.64, "text": "Also. Start. Oh, die haben da sogar eine Power-Spitze, aber hier. Git clone getting started."}, {"id": 642, "start": 6702.64, "end": 6716.52, "text": "Okay, ich gehe mal davon aus, dass es natürlich nicht standardmäßig. Nein. Kein. Ah. Kein"}, {"id": 643, "start": 6716.52, "end": 6740.72, "text": "Internet Explorer. Jetzt muss ich neu anmachen. Ja, Windows. Ja, wunderbar, mach. Next. Alles"}, {"id": 644, "start": 6740.72, "end": 6746.56, "text": "auf dem Windows. Darf man drauf klatschen, was geht? Und desktop. Ja, schadet nichts."}, {"id": 645, "start": 6746.56, "end": 6758.84, "text": "Get bashed hier. Get GUI hier. Nein, keine Windows Explorer. Next. Was? Oh. Wim ist default."}, {"id": 646, "start": 6758.84, "end": 6768.88, "text": "Wie modern? Was? Wer ertreist sich hier zu sagen Wim wäre nicht modern? Was ist hier"}, {"id": 647, "start": 6768.88, "end": 6780.52, "text": "los? Als wäre Wim nicht modern, Leute. Also ich glaube, es geht los hier. Was wird gemacht?"}, {"id": 648, "start": 6780.52, "end": 6800.12, "text": "Docker und Windows installiert, weil es geht. Use git from git bash only. Ah ja, mach weiter,"}, {"id": 649, "start": 6800.12, "end": 6803.72, "text": "weiter, weiter, weiter, weiter. Nanowimp. Ich habe, ich habe halber wie schon installiert."}, {"id": 650, "start": 6803.72, "end": 6818.48, "text": "Und ich kriege Anfälle beim bei der Windows Bedienung wieder. Lounge git bash. Keck weh."}, {"id": 651, "start": 6818.48, "end": 6830.24, "text": "Font rendering allererste Sahne. Okay, jetzt klonen wir das. Bestimmt, weil es dort nicht"}, {"id": 652, "start": 6830.24, "end": 6841.68, "text": "immer ein Wireman drinne ist. Wie mache ich jetzt die Shell wieder auf? Wie mach ich das?"}, {"id": 653, "start": 6841.68, "end": 6851.84, "text": "Oh, wie mach ich das? Wie? Nee, ich hab es Patrick, ich hab das in der VM. Ich würde"}, {"id": 654, "start": 6851.84, "end": 6872.56, "text": "es im Leben nicht auf desktop installieren. Dashboard. Ah, da, da. Und jetzt? Und jetzt"}, {"id": 655, "start": 6872.56, "end": 6882.48, "text": "kriege ich kein PowerShell mehr. Ach gut. PowerShell. So brauche ich dieses GUI Ding"}, {"id": 656, "start": 6882.48, "end": 6889.96, "text": "hier eigentlich? Kann ich noch mal das Getting Started aufrufen? Ach, hier switch to Windows"}, {"id": 657, "start": 6889.96, "end": 6903.12, "text": "Container Switch. Docker Info. Ist immer noch Enterprise Engine. Ja. Hier kann man aussehen,"}, {"id": 658, "start": 6903.12, "end": 6911.96, "text": "was man haben will. Command Line. Wie kann man hier eine Command Line jetzt aufmachen?"}, {"id": 659, "start": 6911.96, "end": 6918.6, "text": "Ach, das ist mir alles zu kompliziert. Es funktioniert zumindest. Ich konnte in Hallo"}, {"id": 660, "start": 6918.6, "end": 6932.16, "text": "Welt Container starten. Das reicht. Okay, als nächstes Hyper-V. Hyper-V Manager. Dann"}, {"id": 661, "start": 6932.16, "end": 6937.68, "text": "gucken wir mal, wie das funktioniert. Hab ich noch nie gemacht was mit. Hyper-V. Wie installiert"}, {"id": 662, "start": 6937.68, "end": 6950.2, "text": "man in Hyper-V eine VM? Hyper-V. Docker Desktop VM. Nee, nee, das wollen wir nicht. Wir wollen"}, {"id": 663, "start": 6950.2, "end": 6960.44, "text": "eine neue VM. New. Virtual Machine. Next. Ubuntu. Mal gucken, ob wir das installiert"}, {"id": 664, "start": 6960.44, "end": 6974.08, "text": "kriegen. Da bin ich echt mal gespannt jetzt. So, Name. Ubuntu. Generation. Generation 1."}, {"id": 665, "start": 6974.08, "end": 6994.96, "text": "1.024 reicht. No Network. Not Excellent. Size 20G reicht. Next. Finish. So, und jetzt"}, {"id": 666, "start": 6994.96, "end": 7011.64, "text": "Ubuntu Minimal Download. The Network Installer. Ja, wunderbar. BitTorrent erinnert mich irgendwie"}, {"id": 667, "start": 7011.64, "end": 7032.96, "text": "ein bisschen an. Hat aber miteinander nichts zu tun. Okay, scheint komplizierter zu sein."}, {"id": 668, "start": 7032.96, "end": 7042.96, "text": "Ubuntu Server Download. Bin einfach nur gucken, ob es funktioniert. Ich will das gar nicht"}, {"id": 669, "start": 7042.96, "end": 7047.16, "text": "großartig installieren. Wir gucken, ob es startet und anfängt zu installieren. Das reicht"}, {"id": 670, "start": 7047.16, "end": 7052.8, "text": "mir schon. Es wird eh nicht schnell funktionieren, weil das nestet virtualisiert. Das nestet"}, {"id": 671, "start": 7052.8, "end": 7066.16, "text": "virtualisiert immer krotten lahm. So. Wie startet man das jetzt? Einfach Doppelklicken."}, {"id": 672, "start": 7066.16, "end": 7078.96, "text": "Connect. Ah, da ist es. Start. Ja, sehr gut. Oh Mist, wie komme ich hier wieder raus?"}, {"id": 673, "start": 7078.96, "end": 7100.28, "text": "Was ist das Escape für Hyper-V? Ctrl Alt Entfernen. Moment, da ist ein Remote Desktop"}, {"id": 674, "start": 7100.28, "end": 7109.72, "text": "drüber. Oh, das verwirrt mich jetzt, aber das sieht exakt genauso aus. Kann man das"}, {"id": 675, "start": 7109.72, "end": 7119.64, "text": "verschieben? Ein bisschen. Ein bisschen verschieben kann man das. Perfekt. So, Media, DVD, Insert"}, {"id": 676, "start": 7119.64, "end": 7135.28, "text": "und Disc. Ubuntu. Ist der Download fertig? Ja. Ist jetzt eingelegt. Okay. Äh, verstanden."}, {"id": 677, "start": 7135.28, "end": 7150.6, "text": "Aha. Poggers. Äh. Normalerweise müsste ich da jetzt eigentlich was auswählen können."}, {"id": 678, "start": 7150.6, "end": 7166.0, "text": "Okay, aber es sieht so aus, als startet er. Das ist schon mal gut. Yep. Dass die Installation"}, {"id": 679, "start": 7166.0, "end": 7174.04, "text": "lahm wie Sau ist, ist okay. Nested Virtualisierung juckt nicht, ja. Als nächstes, ähm, ich"}, {"id": 680, "start": 7174.04, "end": 7179.2, "text": "habe noch eine Sache draufstehen. Mal WSL installieren. Gucken wir mal WSL unter Windows Server installiert."}, {"id": 681, "start": 7179.2, "end": 7205.52, "text": "WSL Windows Server. Windows Server 2019. Äh, wir können das gleich mal unter 2. Bin, was?"}, {"id": 682, "start": 7205.52, "end": 7223.92, "text": "Good Server Preview. Nee. How to install WSL 2 on Windows Server. How to install WSL 2"}, {"id": 683, "start": 7223.92, "end": 7240.36, "text": "on Windows Server. Nein, nein, kein Insider-Bild. Official. Das ist mittlerweile raus. Ja. Äh,"}, {"id": 684, "start": 7240.36, "end": 7255.8, "text": "WSL. Gibt es eigentlich unter Windows Server auch den Windows Store? Nee, zum Glück nicht."}, {"id": 685, "start": 7255.8, "end": 7270.28, "text": "Mach die VM. Tatsächlich, guck mal da. Die Ubuntu VM läuft. Die PowerShell. WSL ist nur"}, {"id": 686, "start": 7270.28, "end": 7285.64, "text": "für Windows 2. Achso. Ah. Oder? Ubuntu Server läuft. Waren wir da aus. How to install WSL 2. Steht aber doch da."}, {"id": 687, "start": 7285.64, "end": 7307.24, "text": "Okay, man braucht ein Preview-Bild. Das ist natürlich doof. Das haben wir nicht. Achso,"}, {"id": 688, "start": 7307.24, "end": 7315.96, "text": "man muss sie noch ausschalten. Turn off. Ja, okay. Das können wir machen. PowerShell, zack,"}, {"id": 689, "start": 7315.96, "end": 7338.4, "text": "enable feature. Wisst ihr, was ich sehr, was ich sehr, what? Das war einfach weg."}, {"id": 690, "start": 7338.4, "end": 7362.36, "text": "Es kann nicht mehr auskommen ohne Restart. Deswegen war GitHub heute down, ja. Das kann"}, {"id": 691, "start": 7362.36, "end": 7370.96, "text": "ich mir richtig vorstellen. GitHub. Docker. Äh, nicht Docker. WSL installiert, zack. Loadbalancer"}, {"id": 692, "start": 7370.96, "end": 7374.88, "text": "tot. Obwohl ich mich sehr wundern würde, wenn GitHub Windows Loadbalancer verwendet."}, {"id": 693, "start": 7374.88, "end": 7388.0, "text": "Okay, das haben wir schon installiert. Ein GitHub läuft höchstwahrscheinlich nicht auf"}, {"id": 694, "start": 7388.0, "end": 7409.24, "text": "Windows. GitHub war mal am Anfang eine Hubi-on-Rails-Anwendung. Wow. Was macht der Typ da? Kann ich jetzt"}, {"id": 695, "start": 7409.24, "end": 7420.28, "text": "WSL eingeben? Der WSL-Store, ich soll den WSL-Store visiten, steht da. Moment, warum"}, {"id": 696, "start": 7420.28, "end": 7430.28, "text": "lädt er den Ubuntu ISO noch mal runter? Kann das mal weggehen? Das nervt mich. Geh weg,"}, {"id": 697, "start": 7430.28, "end": 7456.32, "text": "jetzt. Geh weg. Hallo? Die Seite gibt's nicht. Die Seite gibt's nicht mehr. Die ist einfach"}, {"id": 698, "start": 7456.32, "end": 7468.76, "text": "weg. Wie installier ich denn jetzt WSL? Die Seite gibt's nicht mehr. Was soll ich heute"}, {"id": 699, "start": 7468.76, "end": 7473.0, "text": "am Start? Ich probiere mal das neuste Windows Server aus, um mich ein bisschen wieder darin"}, {"id": 700, "start": 7473.0, "end": 7484.48, "text": "zu bestätigen, dass ich es nicht verwenden will. Geht das unter meinem Host? Ach, das"}, {"id": 701, "start": 7484.48, "end": 7495.44, "text": "will den Store aufmachen. Den Store gibt's natürlich unter Server nicht. Ja, perfekt"}, {"id": 702, "start": 7495.44, "end": 7513.56, "text": "Microsoft. Und jetzt? Ach, deswegen macht er diesen Krempel hier. Deswegen macht er"}, {"id": 703, "start": 7513.56, "end": 7537.36, "text": "diesen Krempel hier, weil das sonst nicht geht. Und nun? Install manual. Aha. Ab X,"}, {"id": 704, "start": 7537.36, "end": 7543.8, "text": "das kann man nicht installieren. Ich hab keinen Windows-Store drauf. Das geht nicht. Oder?"}, {"id": 705, "start": 7543.8, "end": 7554.12, "text": "Nee, das wird nicht funktionieren. Install on server. Excellent. Chat, big brain. Darf"}, {"id": 706, "start": 7554.12, "end": 7567.56, "text": "nicht kopieren. Jetzt. Ja, das hatten wir doch gerade schon. Extrahieren eines Power..."}, {"id": 707, "start": 7567.56, "end": 7579.88, "text": "Whoa, whoa, what? Weil ab X kann ich nicht öffnen. Wir lassen ihn hier erstmal downloaden."}, {"id": 708, "start": 7579.88, "end": 7595.76, "text": "Kann ja nicht mal lange dauern. Und dann einfach starten. Braucht ganz schön lang. Andi erstmal"}, {"id": 709, "start": 7595.76, "end": 7607.4, "text": "entpacken, danach entpacken, expand, big brain. Der braucht für den Download ganz schön"}, {"id": 710, "start": 7607.4, "end": 7617.36, "text": "lang. Über den Browser ging das viel schneller. Versuche in der PowerShell add app X package."}, {"id": 711, "start": 7617.36, "end": 7638.48, "text": "Das geht bestimmt nicht. Add. App. Nee. App. App. X. Oh, doch. Downloads. Nee. U-Boot-to."}, {"id": 712, "start": 7638.48, "end": 7645.84, "text": "Oh, jetzt wird es aber hier richtig advanced über die PowerShell. PowerShell-Magic. Und"}, {"id": 713, "start": 7645.84, "end": 7659.36, "text": "jetzt hat es es jetzt gemacht. Da ist es. Da ist es. Tatsächlich. Und der ist immer noch"}, {"id": 714, "start": 7659.36, "end": 7676.08, "text": "am runterladen. Lull. Abbrechen. Rm. U-Boot-to. Zip. Bäm. Hat funktioniert. Ich glaube es"}, {"id": 715, "start": 7676.08, "end": 7682.52, "text": "nicht. Ja, stimmt. Candy Crush brauchen wir wirklich nicht. Ist aber cool, dass man das"}, {"id": 716, "start": 7682.52, "end": 7685.76, "text": "zumindest über die PowerShell machen kann. Also ich muss sagen, PowerShell ist noch das"}, {"id": 717, "start": 7685.76, "end": 7694.28, "text": "erträglichste an ganz Windows. Sieht Windows Server wie Windows 10 aus? Ja. Mehr oder weniger."}, {"id": 718, "start": 7694.28, "end": 7709.68, "text": "Kann man Candy Crush installieren? FeelsBadMan. New username. Pog. Panzverband 256. Wenigstens"}, {"id": 719, "start": 7709.68, "end": 7717.96, "text": "lässt mich das 123456 als Passwort verwenden. Und da sind wir. WSL am Start. So, mal gucken,"}, {"id": 720, "start": 7717.96, "end": 7732.76, "text": "ob WSL 2 läuft. Das geht wahrscheinlich nicht. Nein. Nein. Nein, das ist noch das alte WSL."}, {"id": 721, "start": 7732.76, "end": 7737.96, "text": "Das gibt es noch nicht für Windows Server. Was kann man mit Windows Server machen? Der"}, {"id": 722, "start": 7737.96, "end": 7743.12, "text": "fragt mich nicht. Er fragt mich was leichteres. Die Frage ist, sollte man damit was machen?"}, {"id": 723, "start": 7743.12, "end": 7747.68, "text": "Und ich tendiere eher zu nein. Also was man damit schön machen kann, ist irgendwelche"}, {"id": 724, "start": 7747.68, "end": 7752.88, "text": "Windows Clients managen. Von Windows Software Installationen bis Active Directory Gedöns,"}, {"id": 725, "start": 7752.88, "end": 7757.92, "text": "wenn man sich das wirklich geben will. Aber ich glaube freiwillig macht das keiner. Wenn"}, {"id": 726, "start": 7757.92, "end": 7763.8, "text": "es nicht unbedingt sein muss. Ich finde ja meinen Random Rechner Namen immer noch ziemlich"}, {"id": 727, "start": 7763.8, "end": 7772.76, "text": "gut. Winn, Napgur, Mamase. Klingt irgendwie ein bisschen nach Zulul. Warum so ein Windows"}, {"id": 728, "start": 7772.76, "end": 7792.36, "text": "Hate? Das ist kein Windows Hate. Das ist einfach die Realität. Change my mind. Minecraft Server"}, {"id": 729, "start": 7792.36, "end": 7801.88, "text": "aus. Nein, nein, nein. Ich bin fertig mit allem was ich machen wollte in Windows. Ich"}, {"id": 730, "start": 7801.88, "end": 7810.84, "text": "bin durch. Also, es ist noch genauso schlimm, wie ich das in Erinnerung hatte. Ja, ich habe"}, {"id": 731, "start": 7810.84, "end": 7817.44, "text": "keine Ahnung davon. Das stimmt. Ist das jetzt eine Hyper-VVM? Nein, das ist keine Hyper-VVM."}, {"id": 732, "start": 7817.44, "end": 7826.52, "text": "Das hier ist eine Hyper-VVM. Das, die Ubuntu-Kiste, ist eine Hyper-VVM. Ja. Sind das so Server"}, {"id": 733, "start": 7826.52, "end": 7829.92, "text": "wie CS Server? Was? Nee, CS Server kannst du in der Linux laufen lassen. Das würde"}, {"id": 734, "start": 7829.92, "end": 7839.32, "text": "dich im Leben nicht unter Windows laufen lassen. Im Prinzip ist Windows Server nichts anderes"}, {"id": 735, "start": 7839.32, "end": 7845.76, "text": "wie ein stabileres Windows 10 mit ein bisschen weniger Frontend Funktionen und dafür ein"}, {"id": 736, "start": 7845.76, "end": 7853.04, "text": "paar eingebauten Services, so wie ein Web-Server und sowas. Hat Hyper-V inzwischen das Snapshot-Feature?"}, {"id": 737, "start": 7853.04, "end": 7859.76, "text": "Das ist eine gute Frage. Ich verwende Hyper-V normalerweise nicht. Checkpoint, ja, guck"}, {"id": 738, "start": 7859.76, "end": 7868.08, "text": "mal. Also, von dem ganzen Crap, den wir hier haben, hat Hyper-V tatsächlich noch den besten"}, {"id": 739, "start": 7868.08, "end": 7873.56, "text": "Eindruck. Ach so, ja, das können wir noch machen. Aber ich glaube, das geht mit WSL"}, {"id": 740, "start": 7873.56, "end": 7889.56, "text": "nicht. Können wir nach Mount, Mount C und dort alles löschen? Geht das? Geht anscheinend"}, {"id": 741, "start": 7889.56, "end": 7908.68, "text": "nicht. Permission denied, sudo. Geht leider nicht. WSL als Admin ausführen, okay."}, {"id": 742, "start": 7919.56, "end": 7942.4, "text": "Und jetzt? Da haben wir Routepferden. CD, MNT. Nee. Wow. Oh, oh, oh, oh. Oh, oh, Skate"}, {"id": 743, "start": 7942.4, "end": 7962.92, "text": "kaputt. Montags. Ich glaube, es hat sich selbst gelöscht, weil es hängt. Aber Windows kann"}, {"id": 744, "start": 7962.92, "end": 7976.24, "text": "sich immer noch nicht löschen. Das darf ich nicht. Explorer. Oh, oh je. Montags, es ist"}, {"id": 745, "start": 7976.24, "end": 7997.12, "text": "kaputt. Es ist abgekackt, Leute, es ist kaputt. Nee, doch nicht. Ha. Fast, das PC. Ja. Aha."}, {"id": 746, "start": 7997.12, "end": 8015.4, "text": "Okay, das geht gar nicht so schnell. Ich will es noch kaputt machen. Ich will es noch wenigstens"}, {"id": 747, "start": 8015.4, "end": 8031.28, "text": "mal kaputt machen. Fuck. Ich darf das nicht löschen. Ich will mein Windows löschen."}, {"id": 748, "start": 8031.28, "end": 8039.84, "text": "Wie kriege ich mein Windows? Du musst Permissions auf dem Windows Ordner ändern, okay? Okay,"}, {"id": 749, "start": 8039.84, "end": 8054.24, "text": "Windows. Wie macht man das? Advanced Sharing. Nee. Advanced. Nee. Security. Full Control."}, {"id": 750, "start": 8054.24, "end": 8073.04, "text": "Administrator. Allow. Administrator. All. Nee. Kann man Linux unter Linux löschen? Klar."}, {"id": 751, "start": 8073.04, "end": 8080.36, "text": "Was? Ich sollte mich als Owner setzen. Wüsste, wie das funktioniert. Würde ich das sogar"}, {"id": 752, "start": 8080.36, "end": 8104.04, "text": "machen? Aha. Aber ich habe Modify. Ich habe Modify-Rechte. Full Control. Owner. Administrator."}, {"id": 753, "start": 8104.04, "end": 8122.92, "text": "All. Nee. Darf es nicht löschen? Ach so, Moment, habe ich das falsch gemacht? Change"}, {"id": 754, "start": 8122.92, "end": 8148.88, "text": "Permissions. Aha. S. Nein. Windows weigert sich, sich selbst zu löschen. Das ist aber"}, {"id": 755, "start": 8148.88, "end": 8156.16, "text": "nicht sehr nett von Windows, dass es das macht. Kann man, kann man den Explorer als Root starten?"}, {"id": 756, "start": 8156.16, "end": 8173.96, "text": "Und Explorer. Okay, das ist kaputt. Aber ich, ah, ich habe eine Idee. Ich kann, ich kann"}, {"id": 757, "start": 8173.96, "end": 8189.32, "text": "ein CMD als Root starten. Oder auch nicht. PowerShot als Root starten. Oh, ich glaube,"}, {"id": 758, "start": 8189.32, "end": 8192.96, "text": "ich habe, ich glaube, ich habe es kaputt gemacht. Ich glaube, ich habe es kaputt gemacht. Es"}, {"id": 759, "start": 8192.96, "end": 8201.08, "text": "geht nicht mehr. Es tut nichts mehr. Wir gucken jetzt mal, ob es einen Neustart überlebt."}, {"id": 760, "start": 8201.08, "end": 8213.28, "text": "Restart. Mal gucken, mal gucken, ob es den Neustart überlebt oder ob es jetzt RIP ist."}, {"id": 761, "start": 8213.28, "end": 8231.96, "text": "Gucken, ob es jetzt kaputt ist. Okay, noch starte das. Äh, ja, ja, alles gut, alles"}, {"id": 762, "start": 8231.96, "end": 8236.6, "text": "gut. Ich will, ich will Windows noch irgendwie kaputt machen. Das kann auch nicht so schwer"}, {"id": 763, "start": 8236.6, "end": 8240.6, "text": "sein. Früher hat sich Windows immer selbst kaputt gemacht. Jetzt will ich das mal selbst"}, {"id": 764, "start": 8240.6, "end": 8257.52, "text": "machen. Oh, es geht wieder so halbwegs. Was sagt, okay, CMD, aber ich kann CMD, ich,"}, {"id": 765, "start": 8257.52, "end": 8262.36, "text": "ah doch, ich kann CMD. Als Administrator. Also was sagt Google? Das machen wir jetzt."}, {"id": 766, "start": 8262.36, "end": 8273.8, "text": "Wir machen das jetzt CMD. Google sagt was? EMDR slash silent, silent, quiet, was auch"}, {"id": 767, "start": 8273.8, "end": 8285.32, "text": "immer. Äh, C Doppelpunkt. Nein, das geht nicht. Wahnsinn. C Doppelpunkt Windows. Nein, krass."}, {"id": 768, "start": 8285.32, "end": 8297.4, "text": "Windows lässt sich nicht löschen. Was soll das hier? Piss dich also. Schon, schon interessant."}, {"id": 769, "start": 8297.4, "end": 8302.96, "text": "Ich dachte, es wäre einfacher, Windows mit Windows kaputt zu machen. System 32. Bäm."}, {"id": 770, "start": 8302.96, "end": 8309.52, "text": "Kannst du den Windows Ordner umbenennten? Das ist eine gute Frage. Kann man Windows"}, {"id": 771, "start": 8309.52, "end": 8314.08, "text": "Ordner umbenennten? Wahrscheinlich auch nicht, ne? Nein, nein, ich habe auf Delete geklickt."}, {"id": 772, "start": 8314.08, "end": 8326.92, "text": "Kann ich Delete drücken? Rename. Es gibt, es gibt kein Rename. Ich verschiebe ihn einfach"}, {"id": 773, "start": 8326.92, "end": 8340.76, "text": "nach Users. Okay Leute, ich bin nicht in der Lage, Windows kaputt zu machen. Ich krieg's"}, {"id": 774, "start": 8340.76, "end": 8347.92, "text": "nicht in. Äh, okay Leute, das interessiert mich jetzt wieder jetzt. How to delete Windows"}, {"id": 775, "start": 8347.92, "end": 8363.6, "text": "from Windows. Okay, der Patrick hat Big Brain Eintrag gefunden. Gucken wir uns gleich an,"}, {"id": 776, "start": 8363.6, "end": 8367.44, "text": "wie das funktioniert. Erstmal ein Chrome, ein Chrome hab ich ja gelöscht. Okay, nee,"}, {"id": 777, "start": 8367.44, "end": 8382.72, "text": "nein, muss ich hier aufmachen. Windows. Start as administrator. Was? Ich hab mein Chrome"}, {"id": 778, "start": 8382.72, "end": 8397.56, "text": "gelöscht. Okay, weißt du was? Scheiß drauf. Windows will nicht, dass ich es kaputt mache."}, {"id": 779, "start": 8397.56, "end": 8405.52, "text": "Windows kann aber hiergegen überhaupt nichts machen. Get wrecked Windows. Keine Chance,"}, {"id": 780, "start": 8405.52, "end": 8425.4, "text": "was dagegen zu machen. Open VM directory. VMs. Remove. Remove. Zack, weg ist es. Easy."}, {"id": 781, "start": 8425.4, "end": 8446.2, "text": "Nee, RMSF hat nicht funktioniert. Yes. Da, weg ist es Windows. Also ich muss sagen, es"}, {"id": 782, "start": 8446.2, "end": 8452.12, "text": "ist noch genauso eklig, wie ich es mir vorgestellt hab. Ist nicht besser geworden. Was mich überzeugt"}, {"id": 783, "start": 8452.12, "end": 8456.64, "text": "hat, war jetzt auf den ersten Blick Hyper-V. Das war echt nicht übel. Also es hat einfach"}, {"id": 784, "start": 8456.64, "end": 8464.68, "text": "so funktioniert, wie es funktionieren sollte. Der Rest ist halt so extrem hakelig und eklig"}, {"id": 785, "start": 8464.68, "end": 8485.84, "text": "in der Verwendung. Ah, ich weiß nicht. Nee, nee, nee. Ist das wirklich dein erster Windows?"}, {"id": 786, "start": 8485.84, "end": 8491.96, "text": "Na ja, nein, ich hab schon immer mal wieder zwischendurch installiert. Aber wirklich,"}, {"id": 787, "start": 8491.96, "end": 8495.88, "text": "ich kenne mich damit nicht aus. Und mittlerweile mache ich es ja auch so, wenn mich irgendwie"}, {"id": 788, "start": 8495.88, "end": 8500.72, "text": "einer was fragt, was Windows Sachen angeht, so was weiß ich, wenn mich zum Beispiel eine"}, {"id": 789, "start": 8500.72, "end": 8504.76, "text": "Freundin von meiner Mutter oder so sagt, ah, guck mal, der Max, der kennt schon mit Computerzeug"}, {"id": 790, "start": 8504.76, "end": 8509.88, "text": "aus. Der kann mir doch bestimmt erzählen, wie ich keine Ahnung an meinen Drucker einrichte"}, {"id": 791, "start": 8509.88, "end": 8515.92, "text": "oder so. Nein, mach ich nicht. Sag ich immer, ich hab keine Ahnung davon. Frage mich ja,"}, {"id": 792, "start": 8515.92, "end": 8519.6, "text": "also Choose my name sagt, frage mich ja, ob Microsoft selber eher Windows Server oder"}, {"id": 793, "start": 8519.6, "end": 8528.76, "text": "eher Linux Server nutzt. Das ist eine gute Frage. Auf was läuft zum Beispiel Microsoft.com?"}, {"id": 794, "start": 8528.76, "end": 8540.0, "text": "Na, Microsoft.com wird wahrscheinlich echt Windows laufen. Microsoft.com wird wahrscheinlich"}, {"id": 795, "start": 8540.0, "end": 8544.72, "text": "wirklich auf Windows laufen, kann ich mir vorstellen. Haben wir vielleicht irgendwie"}, {"id": 796, "start": 8544.72, "end": 8551.4, "text": "die Chance, das rauszukriegen? Haben wir irgendwie die Chance, das rauszukriegen vielleicht?"}, {"id": 797, "start": 8551.4, "end": 8567.68, "text": "Ne, warte, wo will ich hin, der Network? Ah,.net, es läuft auf.net. Aber die Plattform"}, {"id": 798, "start": 8567.68, "end": 8583.32, "text": "sieht man nicht. Microsoft.com läuft auf ASP.net Core. Nmap konnte doch, Nmap OS Detection gab"}, {"id": 799, "start": 8583.32, "end": 8590.68, "text": "es doch die Möglichkeit, das Nmap, das versucht, rauszubekommen. Wie ging das nochmal? OS scan,"}, {"id": 800, "start": 8590.68, "end": 8614.2, "text": "OS guess. Genau. Okay, probieren wir mal aus. Nmap, Microsoft.com, Minus O war es. Oder"}, {"id": 801, "start": 8614.2, "end": 8628.6, "text": "Minus Null. Ist groß O. Jaja, ist gut. Nein, nein, nicht Parrot.ly. Okay, scanen wir mal"}, {"id": 802, "start": 8628.6, "end": 8644.36, "text": "mit Microsoft.com, easy, wenn man gleich blacklisted. Oh, stellts, stellts, scan. What, what, what,"}, {"id": 803, "start": 8644.36, "end": 8653.8, "text": "what? Ah ja, no OS Matches, okay. Er hat keine Ahnung, was das für ein OS ist. Wie gesagt,"}, {"id": 804, "start": 8653.8, "end": 8662.12, "text": "ich glaube ja, das ist ASP.net Core. Weil Kestrel, Kestrel ist der, ich hab's euch ja"}, {"id": 805, "start": 8662.12, "end": 8669.92, "text": "hier gezeigt, Kestrel ist der ASP.net Core Web Server. Gucken wir mal, ob Google irgendwas"}, {"id": 806, "start": 8669.92, "end": 8677.92, "text": "rausrückt, auf was sie laufen, aber wahrscheinlich eher nicht, ne. GWS, okay, das ist irgendwie"}, {"id": 807, "start": 8677.92, "end": 8683.96, "text": "Google Magic Kram. Das geht über irgendeinen, ja, das geht garantiert auf irgendeinen Load"}, {"id": 808, "start": 8683.96, "end": 8690.12, "text": "Balancer. Ja, aber ich könnte mir vorstellen, dass auch vieles bei Microsoft mit Dealungs"}, {"id": 809, "start": 8690.12, "end": 8696.64, "text": "läuft, weil Windows Server Kram willst du dir vielleicht für Client Geschichten geben,"}, {"id": 810, "start": 8696.64, "end": 8700.04, "text": "aber wenn du einfach nur Dienste bereitstellen willst im Internet, gibt sich doch keiner"}, {"id": 811, "start": 8700.04, "end": 8707.96, "text": "freiwillig Windows Server, warum sollte man das machen? Live.com, was ist Bing, Bing?"}, {"id": 812, "start": 8707.96, "end": 8726.28, "text": "Oh, was lädt das denn alles nach? Microsoft, okay, Bing läuft auf IES, tatsächlich. Wenigstens"}, {"id": 813, "start": 8726.28, "end": 8736.32, "text": "Bing. Und Xbox? Xbox? Ich mein, da könnte alles drinstehen, ne, gibt's keine Infos"}, {"id": 814, "start": 8736.32, "end": 8744.36, "text": "zu. Da kann alles drinstehen, ist auch egal. Also ich gehe stark von aus, dass selbst,"}, {"id": 815, "start": 8744.36, "end": 8749.2, "text": "dass Microsoft selbst auch viele Sachen auf Linux laufen hat. Alles andere würde mich"}, {"id": 816, "start": 8749.2, "end": 8766.64, "text": "echt wundern. Ah ja. So, wir haben jetzt noch, wir haben jetzt noch ein bisschen Zeit. Oder"}, {"id": 817, "start": 8766.64, "end": 8769.92, "text": "ich gehe jetzt auf und grinde noch ein bisschen Path of Exile, das könnte ich auch machen."}, {"id": 818, "start": 8769.92, "end": 8781.36, "text": "Ich gehe auf und grinde noch eine Runde Path of Exile, so war mal das. Ich hoffe euch hat's"}, {"id": 819, "start": 8781.36, "end": 8785.88, "text": "trotzdem gefallen im Stream, wer noch nicht gefollowed ist, kann mir gern ein Follow da"}, {"id": 820, "start": 8785.88, "end": 8792.2, "text": "lassen, bisschen Sellout muss sein. Könnt ihr euch auch mal auf Twitter vorbeigucken,"}, {"id": 821, "start": 8792.2, "end": 8798.44, "text": "YouTube ist grad nicht so viel los. Und ich hoffe man sieht sich im nächsten Stream wieder,"}, {"id": 822, "start": 8798.44, "end": 8802.56, "text": "morgen gleich, morgen wahrscheinlich ungefähr gleich Uhrzeit wieder am Start, denke ich"}, {"id": 823, "start": 8802.56, "end": 8829.04, "text": "mal. Und wir sehen uns, bis dann, macht's gut, CU."}]}