{"text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal.Das war's für heute, bis zum nächsten Mal.Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal.Das ist doch nicht normal.Das ist eigentlich aus dieser einen Seite geworden, die ich in meinem Terminal verwendet habe für Wetterbericht.Gibt's das noch?Ja.Alsnau Unterfranken, nicht so ganz.Aber das ist die passende Hacker-Wetteransicht hier.Also ich meine, wenn ich die Auswahl habe zwischen dem und dem, dann ist das halt auch die eindeutige, die bessere Wetteransicht, oder?Moin, Patrick, du bist aber früher am Start.Weiß nicht mehr, wie man hier...Wie konnte man das angehen? Genau.Guck mal, wenn der Wetterbericht schon keine Ahnung hat, wie warm es wirklich ist, 23 bis 30.Ich weiß es nicht. Ja, doch, aktuell 23.Oh, guck mal, heut Abend. Nee, ach nee, morgen. Morgen Abend ist das. Morgen Abend regnet's sogar mal.Keck weh, erstes Service. Ja, da muss ich mir erstmal genau überlegen, was ich mache.Ja, es ist echt warm. Huge, massive Temperatures.Was ist denn... Ist das Vorhersage?Oder was ist... Ich kann das nicht aussprechen.Is das Vorhersage? Nee, das ist... Was ist das? Regenwahrscheinlichkeit? Regenwahrscheinlichkeit?Regenwahrscheinlichkeit?Okay, jetzt muss ich mal kurz gucken, was ist...Okay, was heißt das auf Deutsch? Deutsch? Deutsch.Niederschlag. Ah, okay, also ist es wirklich Regenwahrscheinlichkeit, verstehe.Regenwahrscheinlichkeit. Da ist es ja deswegen viel besser, wenn man so eine Vorschau verwendet.Excellent. Das sieht auch mit Darkreader und ohne Darkreader exakt gleich aus.Viel bessere Ansicht und die beste Ansicht ist immer noch, man kann das wunderbar sogar im Terminal verwenden.Ah, wenn man das hier nämlich ins Terminal reinpastet.Bäm. Bessere Wetteransicht geht nicht hier. Porgas.Achso, ja, LS geht nicht, LS geht nicht, minus R geht.So muss die... So muss eine Wettervorschau aussehen.Excellent.Ah, Leute, ich bin gerade aufgestanden. Ich habe heute Nacht nicht wirklich gut gepennt.Ich habe zwar eine Klimaanlage, aber ich kann die nicht die ganze Nacht überlaufen lassen.Da kann ich nicht pennen bei und ohne Klimaanlage ist es zu warm. Ist auch kacke.Komm in meine WhatsApp-Kuppe Növerro. Was ist das für eine komische Werbung?Ah, ich sehe es.Das ist ja geil. Wartet mal.Das glaube ich jetzt nicht. Jetzt machen die den Scheiß schon.Es reicht nicht mehr, wenn du auf Facebook irgendeine Werbung machst.Oder ist das Photoshopped? Das ist Photoshopped, oder?Ist das real? Wird der Chat heute ignoriert? Nee.Vielleicht, weiß ich noch nicht. Kommt heute mal, was der Chat so macht. Ist das Photoshopped?Das sieht man rechts. Hier ist rein Photoshopped.Ja, das ist rein Photoshopped. Aber AWK erst mal am Start.Aber ich würde mich fast schon nicht mehr wundern, wenn es so etwas gäbe.Klebefehler in der Mitte.Aber wie dem auch sei, ich kann mir das durchaus vorstellen, dass so ein Chat mittlerweile auf einer Anzeige steht.Auch wenn es irgendwie ein bisschen Photoshopped aussieht. Aber ich kann es mir gut vorstellen, dass es irgendwo auf der Welt sowas gibt.Es reicht halt nicht mehr, wenn du komische Facebook-Werbung machst. Nein, du musst jetzt mittlerweile auch schon die Leute dazu bringen.Findet ihr nicht auch, dass Leute, die wirklich richtig erfolgreich sind und einen richtig krassen Lifestyle leben, dass die das notwendig haben, sowas zu posten?Ich finde es toll, dass die Leute so nett sind und das posten.Wenn ich so krass erfolgreich bin und so krass einen Lifestyle mache, ich könnte es ja auch einfach für mich behalten.Sind die Leute nicht extrem nett, dass sie das der Welt mitteilen?Das sind alles richtig gute Leute.Aber ernsthaft, ich frage mich bei dieser ganzen Geschichte, diese Scams in dieser Richtung, die sind ja schon uralt.Gab es ja mehr oder weniger schon immer. Jetzt vielleicht nicht mit WhatsApp-Gruppe oder irgendwie sonst was in der Richtung.Aber es gab auch schon früher genug Leute, die dir quasi Scheiße für Gold verkaufen wollten.Was ich mich aber schon seit Aufkommen dieser WhatsApp-Gruppen und wie du erfolgreich Geschichten wirst frage, ist eine Sache.Und zwar, was haben die Leute eigentlich vorzuweisen, die diese Gruppen betreiben, dass das keiner hinterfragt?Guck mal, wenn ich irgendwie mir einen geilen Guru suche, der mir erklärt, wie ich erfolgreich werde und jetzt übelst krass Bitches-Money-Investment-Lifestyle mache.Bevor ich mir da irgendwie den Ober-Guru raussuche, gucke ich doch erstmal, was hat der Typ schon gemacht?Und die meisten davon haben außer Scam-Scheiße nichts gemacht.Wenn es jetzt irgendwie der, keine Ahnung, irgend einer wäre, der 10-15 Jahre lang erfolgreich irgendwas aufgebaut hat und dir jetzt erklärt, wie er das gemacht hat.Okay, der hat wenigstens irgendwas vorzuweisen, aber die ganzen 0-15 Scammer-Typen, die irgendwie 22 sind, die haben ja noch nicht überhaupt irgendwie ansatzweise was vorzuweisen.Und irgendwie juckt das keinen. Es reicht schon, wenn du mit einem fetten Auto reingefahren kommst und sagst, alter hier, komm in die Gruppe, 2000 Euro am Tag, easy money und alle springen drauf rein.Wobei, alle ist zu viel gesagt, ein paar dämliche Leute fallen drauf rein und das reicht halt zum Geldverdienen aus.Naja, was auch immer.Ne, das verstehe ich nicht. Naja, wie dem aus sei. Was ist denn jetzt los?Es hat ja schon ein bisschen, hat ja schon ein bisschen abgenommen in letzter Zeit. Also, nachdem es erstmal geboomt ist, diese ganzen WhatsApp-Telegram-Gruppen, was auch immer, mittlerweile ist es ein bisschen weniger.Aber ich gehe mal davon aus, nachdem, ich verfolge das ja nicht so, ich gehe mal davon aus, dass es nicht wirklich weniger geworden ist, sondern das Scam sich einfach geändert hat.Der erste Frisur, ultra geil. Das ist uralt klep, aber ich finde den immer noch lustig.Ich finde den immer noch geil. Richtig dumm, alter.Na gut, also mit was fangen wir an zu gucken? Wir haben Sachen zur Auswahl. 10 Trips für Programmieranfänger. Ne, wir fangen wie immer an mit Battlefield Top Plays.Danach gucken wir das. Oh, wir können auch das gucken. Warum das mobile Internet in Deutschland so schlecht ist?Wir gucken erstmal, wir gucken erstmal eine Runde Battlefield Top Plays. Dann gucken wir uns einfach um, dass mobile Internet in Deutschland so schlecht ist.Alter, was hat der Typ für einen FOV? 170 oder was? Was ist das für ein FOV, Alter? Der kann ja quasi vom Spawn ins Spawn gucken.By the way, der gleiche Typ, der die Videos immer macht, hat vorher ein Bild gepostet, weil ich mir gedacht, das können wir uns mal zusammen angucken.Also natürlich ist das alles fake. Wenn man sich das aussuchen könnte, was möchte man haben? Und ganz ehrlich, bei mir ist das hier. Weiß ich, wie es bei euch aussieht?Bei mir ist das hier. Also Battlefield 0 mit Rüstung brauche ich ehrlich gesagt nicht. Zukunft Stels brauche ich auch nicht unbedingt. Vietnam Stels hatten wir schon oft genug. Ich wäre mal wieder für ein ganz normales Modern Warfare Setting.Übrigens, und das hier könnte sogar die japanische Variante sein. Das heißt nicht Battlefield 0, sondern es heißt Battlefieldo. Battlefieldo! Das kann ich mir richtig vorstellen, wie das irgendwelche Anime Grills aussprechen. Battlefieldo!Aber das hier würde ich nehmen. Wobei ich ehrlich sagen muss, solange es nicht das hier unbedingt ist, die drei Sachen, die würde ich mir alle geben, wenn sie gut gemacht sind.Aber wovor zuckt das hier? Battlefieldo, ja ja.Wie viele Subs hat der Typ mittlerweile? Ich hätte gedacht mehr.Okay, also wo sind wir stehen? Battlefield. Wo waren wir? Hier. Battlefield Top Plays.Okay, der Typ wird erstmal wieder Hardcore geflammt, weil der Infanterie-Shotgun hinter uns spielt. Und die Gegner checken halt nichts, aber das ist ja schon der Klassiker.Die Gegner sind wieder absolut Lowbrains.Oh, hier richtig professionell mit Webcam am Start. Allerdings klappt der Green Screen nicht so richtig, ne?Oh, da wird er weggesprayt. Rex! Beste Pistol, Alter! Rex! Top!Jetzt wird er gemessert. Defi in Bob's. Alter, was ist? Sag mal, das ist doch gestellt. Das ist doch gestellt. So doof kannst du doch nicht sein.Also so komplett hängen geblieben im Kopf kannst du doch gar nicht sein, als wie die Leute da. Das geht doch nicht. Das glaube ich, das glaube ich nicht.Die sind ja richtig Lowbrain.Moment, er ist Attacker? What the fuck? Er ist Attacker? Ich habe gedacht, er ist Defender. Was zum Teufel machen die Gegner denn da?Warum stehen die Defender da? Das ergibt überhaupt keinen Sinn.Normalerweise ist es eher so, du kommst hier gar nicht um die Ecke, weil dich schon 30 Gegner ab-aimen.What the fuck? Alter, wo hat er die Gegner her? Auf den Server muss ich auch gleich mal connecten.Aber es kommt immer mal wieder zwischendurch so Situationen vor. Aber die waren schon echt Lowbrain.Erstmal schön, dass Smoke One-Hitted. Die sehen es gar nicht. Die sehen es nicht.Ah, Metro, was sonst?Okay, die haben schon mal absolut keinen Bock sich überhaupt nur zu bewegen. Leute, was ist mit euch verkehrt?What the fuck? Richtig Monarch-S.Ich meine, es ist schon ein geiler Clip. Aber so ultra-braindead Gegner wieder.Aber die Kit wechselt zwischendurch den Kuh. In Bad Company 2 war es ja so, du konntest richtig gut spielen, wenn du wirklich alle 10 Sekunden je nach Gegner hast das Kit gewechselt.Das ging richtig gut. Du konntest da die Kits aber auch teilweise 3 km weit aufnehmen und durch Wände wiederbeleben und sowas.Exzellent. Alle mit Farben-Blind-Modus an. Guck mal Battlefield 4. Moment, es gibt Leute, die spielen Scrims in Battlefield 4? 2020?So was gibt es noch? Es gibt Competitive Battlefield 4 im Jahr 2020? Sachen gibt es.Da wird ein 490 gegeiert. Aber das ist mal gut zu sehen, dass das auch Gegner sind, die nicht komplett braindead sind.Stimmt, da konnte man sich ja lehnen, das vergesse ich immer. Aber es hat sich nicht gelohnt in dem Spiel.Ich war es nicht so in Battlefield, dass du, wenn du dich um die Ecke gelehnt hast, mehr rausgeguckt hast, als wenn du um die Ecke gestrafed bist.Echt jetzt? Chat sagt gerade tatsächlich gestern jemand Battlefield 4 Scrim kommentiert und gestreamt. Wirklich? Sowas gibt es noch?Ja, das ist ja auch keine Kunst. Firestorm spielt ja nur wirklich gar keiner. Firestorm haben sie verkackt. Hätten die Firestorm 3-2-Play gemacht, hätte das durchaus eine Chance gehabt.Viele Sachen, die in Warzone am Start sind, z.B. das mit den Platten, gab es in Firestorm schon. Das hätte durchaus eine Chance gehabt, aber sie haben es verschissen.Ich glaube auch, dass DICE da ein bisschen ähnliches Problem hat wie Blizzard, dass die so ein bisschen entkoppelt sind von der Welt. Also sprich das, was die machen und was die Welt gerne sich wünscht, sind unterschiedliche Paar Schuhe.Battlefield 1, keine Ahnung. Endlich mal einer, der mit Gescheiter Bitrate aufnimmt. Das sieht wenigstens schon scharf aus.Ich sehe noch nicht mal die Gegner. Ich sehe Pfeile. Wo war der? The fuck? Ich sehe nur Pfeile. Und da habe ich noch nicht mal einen Pfeil gesehen.Da rennen sie aber schön rein.Die werden aber gut zerstört gerade.Oh, der ist aber oldschool. Der schreibt LOL. Wer schreibt denn noch LOL? LOL schreiben bloß noch die übertriebensten Boomer-Leute wie ich.Ist das die Community Map? Ich bin da nicht so im Bilde, was Battlefield 4 Maps angeht. War das die Community Map?xD schreibt keiner mehr. Ja doch, gibt noch ein paar. Man sieht das ab und zu. Allerdings xD war schon immer doof.Was noch viel dümmer ist, es gibt noch eine Sache um xD zu toppen. Das ist hier Xoxo. Das ist so richtig doof. Das ist wirklich massive doof.xD geht ja noch, aber Xoxo ist das Allerschlimmste.Das ist aber Heinrich, der ist der Beste. Man kann das natürlich noch kombinieren. Das ist angeblich irgendwas Arabisches oder so.Das ist das Beste. Der hier. Das ist der Beste. Den mache ich auch immer.Ja, natürlich. Das da. Das da sind so Anime-Girl-Augen. Das da. Das ist schon uralt.Sehr gut. Jetzt wird geschnipsert.Oh.Massive. Huge.Das könnte ein Clickbait Titel sein, oder?Das ist ein Clip, aber das ist ein Clip, der ist einfach nur sehr ähnlich zu einem anderen.Aber wie sie sich alle in die Reihe gestellt haben, um Collateral zu werden.Ja, und danach wird er erstmal von allen angeschrieben, was er von was auch immer sonst was treibt. Der wird auf jeden Fall geflamed danach.Das sind alle Spots. Na ja, so sind sie halt, die 90% der Spieler. In fast allen Games. In fast allen Games, wo es keinen Skill-Based Matchmaking gibt.In Skill-Based Matchmaking-Games sind 90% der Leute auch so, nur dass du nicht gematcht wirst dagegen.So toll. Ganz ehrlich. Noshark Hennels ist nur so beliebt, weil das die einzige Map ist, die du so komplett Braindead spielen konntest. In der Release-Variante.Ansonsten, es gibt die Close-Quarter-Maps, die teilweise viel besser waren, was TDM anbelangt. Aber Noshark Hennels war so richtig Spawnen, Braindead, rein TDM'en und gut ist in der Release-Variante.Übrigens, der Typ schon wieder. Den hatten wir glaube ich sogar letztens im Streamer. Das war der, der die Leute geflamed hat, weil sie ihm den Panzer geklaut haben.Ja, danke. Ist ja schon ein paar Tage her. Was ist das für eine Sprache?Was ist das für eine Sprache?Was für eine Reichweite. Guckt euch mal die Shotgun an.Oh, da werden sie geschreckt. Da werden sie hardcore geschreckt.Also Leute, ich muss euch sagen, es gibt ganz schön viel farbenblinde Spieler in Battlefield.Ich würde fast sagen, 80% der Battlefield-Spieler sind farbenblind.L85, das ist auch so ein Ding, wo ich maximal 5 Kills mit habe und dann einfach nur durch Pick-Up.Das hat er aber schön gemacht. Die Gegner checken es halt nicht, dass er hochkommt, aber gut, die können ja auch nicht in alle Richtungen gucken.Manchmal kannst du da schon gute, also günstige Gelegenheiten abpassen, gehören halt auch ein bisschen Glück zu, wann du da hochläufst, dass nicht gerade irgendwie das halbe Team in die Richtung guckt, wo du langläufst.Excellent. Ja, könnt ihr euch noch dran erinnern, ich habe ja auch mal ein Battlefield-Top-Plays-Video gemacht.Das war das letzte Video, was ich gemacht habe, war ein Battlefield-Top-Play-Video und das ist schon nur drei Monate her.Stimmt, der Michael5-Spieler hat dafür gesorgt damals, das stimmt.12 Minuten 50, High-Skill-Plays, ja, Wahnsinn. Ich habe eigentlich genug Material für ein zweites.Ah, gut. So, was schauen wir uns als nächstes an?Warum das mobile Internet in Deutschland so scheiße ist? Nee, so schlecht ist, so schlecht ist. Das gucken wir uns jetzt an.Also lass mal ein paar Vermutungen anstellen, bevor wir das Video gucken. Also warum ist das mobile Internet in Deutschland so schlecht?Erstens, weil irgendwie alle parallel ausbauen und irgendwie nicht synchronisiert ist.Dann, weil wir mal wieder nicht auf flächendeckenden Ausbau setzen, sondern auf Hotspot-Geschichten.Ähm, wahrscheinlich weil es keine gescheiten gesetzlichen Vorgaben gibt und das dürfte vielleicht das Hauptproblem sein.So, schauen wir mal. Sowas in der Richtung wird es aber sein.Die Durchschnittsgeschwindigkeit des deutschen mobilen Internets liegt im internationalen Vergleich auf...Der erinnert mich immer übelst an Willi Pete Casts Widersprüchen.Die Durchschnittsgeschwindigkeit des deutschen mobilen Internets liegt im internationalen Vergleich auf Platz 14.Direkt neben Jamaika. Direkt neben Jamaika, das ist... Okay, okay, okay. Nochmal so.Nochmal so. Nur, dass ich das richtig verstehe. Wir liegen neben Trinidad and Tobago, Jamaika und über uns ist Portugal und Bahrain.Wo zum Teufel liegt Bahrain?Wo ist das überhaupt?Ist das in Afrika? Ah. Irgendwo arabische Halbinsel oder so, ne? Nee, das ist Indien? Doch. Doch.Irgendwo Arnelegebiet auf jeden Fall. Okay, alles klar.Ich hab aber keine Ahnung bis eben gab, dass das überhaupt existiert, wenn ich ehrlich bin.So, und die haben auf jeden Fall ähnlich gutes Internet wie wir.Und hier kostet er was? 65 Euro pro Monat?60 Euro pro Monat. Bei der Telekom würden wir in Deutschland 83 Euro dafür zahlen.Und jeder kennt es. In der Bahn, auf der Autobahn, manchmal auch. Ja, ich kenn's auch.Zum Beispiel jeden Morgen, also wenn ich Zug fahre, ich fahre ja gerade keinen Zug, aber wenn ich Zug fahre jeden Morgen in Meintal,jeden Morgen in Meintal ist das Internet komplett weg kurz. So für, keine Ahnung, zwei Minuten.Und es ist ja wirklich nicht am Arsch der Welt, es ist zwischen Frankfurt und Hanau.Und wir sind schon so im Arsch, was das angeht, und selbst da machen sie jetzt rum, so nach dem Motto, sie wollen kein 5G, weil 5G-Strahlung und so.Und weil gutes mobiles Internet für uns alle im Alltag immer wichtiger wird. Man will unterwegs produktiv sein, up-to-date bleiben, sicher bleiben, wissen, wann es regnet und wo man ist.Ich möchte Twitch gucken unterwegs. Das ist eigentlich das Hauptsächliche. Twitch-Chat, Spam.Was ist das denn für exzellent Musik im Hintergrund?Verbindet sich mein Handy mit dem Mast oder der Mast mit mir? Das ist die Frage.2G ist aus dem letzten Jahrhundert und im Prinzip mobiles Internet ohne Internet. Die Geschwindigkeit reicht gerade so für WhatsApp, mehr aber auch nicht. 3G ist ebenfalls ziemlich alt, kann aber je nach Variante heute noch ausreichen.Zumindest mit 3G kannst du halbwegs surfen, das ist kein Problem.5G ist der Future Shit oder in den Worten der Telekom, das G in 5G steht für großartige Möglichkeiten. 5G ist viel schneller als 4G und pro Mast können sich viel mehr Geräte verbinden. Dadurch bietet 5G viele Möglichkeiten, zum Beispiel in der Automatisierung.Aber die Reichweite ist nicht so hoch, du brauchst mehr Masten. Was nicht verkehrt wäre, dann brauchst du auch Smart Cities, Logistik, Smart Medizin und moderne Landwirtschaft. Aber auch für autonomes Fahren oder Virtual und Augmented Reality, Cloud Gaming und das Internet of Things.Wenn ich so einen smarten Kühlschrank schon sehe, Leute. Der most useless Shit aller Zeiten. Smarter Kühlschrank, der nicht wirklich smart ist, sondern einfach nur ein fettes Tablet vorne dran hat.Okay, wie ist denn der Stand in Deutschland? 0G ist bei uns. Aber in einigen Teilen Deutschlands hat man je nach Anbieter auch Mitte 2020 immer mal wieder einfach kein Netz. Dazu kommen zahlreiche Flecken, in denen man nur 2G empfängt.In Deutschland gibt es nur 3 Anbieter mit einem eigenen Netz. Die Telekom, Vodafone und Telefonica. Dazu gehört O2. Die Telekom hat das beste Netz, die Telefonica das schlechteste. Alle anderen Anbieter leisten...Das war früher E+, oder? Ist das nicht E+, gewesen?Netze für eine Gebühr. Hätte man SIM-Karten aller 3 Anbieter, hätte man ziemlich konsequent mobiles Internet. Hat man aber leider nicht. Das alles wird besonders übel, wenn man sich schnell bewegt.Ja, richtig. Das ist wirklich ätzend, ne? Auf dem Weg von mir zur Arbeit heim ist schon teilweise schlimm, aber wo es ganz ätzend war, ist Frankfurt, Berlin. Wo man ja eigentlich sagen will, das ist eine Strecke, die ziemlich häufig gefahren wird. Da hast du zwischendrin, du konntest doch nicht mal durchgängig Musik streamen. Das war echt lächerlich.In deutschen Zügen kann man je nach Verbindung einfach nicht konsequent produktiv sein oder die neue Staffel krass Klassenfahrt durchballern.Was für ein Ding?Schon. Es begann mit der Versteigerung von LTE-Funklizenzen im Jahr 2010. Hier mussten die Anbieter Geld an den Startzahlen, um bestimmte Funklizenzen zu ergattern. Die Betreiber wurden dafür nur verpflichtet, bis 2016 90% der Haushalte in Deutschland mit LTE zu versorgen. Beginnend mit den kleinsten Orten.Damit gab es schon damals zwei Probleme. Erstmal mussten diese 90% nicht pro Betreiber erreicht werden, sondern insgesamt. Das hat dazu geführt, dass sich O2, jetzt Telefoniker, zum Beispiel einfach auf Ballungszentren gestürzt hat, nachdem Vodafone oder Telekom kleinere Orte versorgt hatten.Außerdem ist die Orientierung nur an Haushalten zum Teil unlogisch. Mobiles Internet... Orientierung in Haushalten ist total beknackt. Das ist auch das, was wir mit Festnetzanschlüssen machen oder halt mit Festnetz, Kabel und sowas, dass es pro Haushalt gerechnet wird.Das Problem ist aber, es gibt halt viele Flächen, gerade im Osten, wenn man da mal auf der Landkarte von dem Amt für Infrastruktur und Gedöns guckt, also Breitband Atlas, da in Deutschland guckt, wird man gerade im Osten viele Regionen sehen, wo halt auch Leute wohnen, aber es relativ großflächig verteilt ist.Das heißt, bei 90% der Haushalten bist du relativ schnell, aber bei 90% Fläche bist du so gut wie nie.Die Grafing in den Videos machen die doch aber nicht selber. Wer ist denn die?Was soll ich das wissen? Keine Ahnung. Wahrscheinlich haben die dafür Leute, die sowas für sich machen. Also wenn ich öfter so Info-Videos machen würde, würde ich mir auch Leute suchen, die für mich Grafiken basteln.Mal da Internet von mal diesem, mal jenem Anbieter und nur da, wo Häuser stehen. Und so ward der deutsche Flickenteppich geboren. 2015 wurden die Auflagen bei einer neuen Auktion nachgebessert. Bis 2020 sollte jeder Anbieter 98% der Bevölkerung und alle Hauptverkehrswege mit 4G versorgen.Da fehlen leider immer noch entspannte 1,7 Millionen Deutsche. Bei den Hauptverkehrswegen hat man den Betreibern ein schönes Hintertürchen gelassen. Soweit dies rechtlich und tatsächlich möglich ist. AKA, wenn's nicht geht, kein Problem.Dann wäre da noch die Diensteanbieterverpflichtung. Das bedeutet, dass große Anbieter mit einem eigenen Netz dieses Netz kleineren Anbietern für eine entsprechende Gebühr zur Verfügung stellen müssen. Das gibt es bei 2G und bei 3G. Aber bis heute nicht bei LTE.Das heißt, dass günstige Anbieter lange kaum LTE anbieten konnten. Das hat dazu geführt, dass LTE bei uns oft super teuer ist, weil es kaum Wettbewerb gibt. Kein Wunder, dass knapp die Hälfte der SIM-Karten in Deutschland auch 10 Jahre nach der ersten Auktion nicht LTE-fähig sind.Die allermeisten dieser Nutzer hätten ein entsprechendes Smartphone. Aldi Talk hab ich für meine Mutter auch geholt. War das beste Angebot. Vor allem, du kannst sie jederzeit auch kündigen.Und ich war ja überrascht, wie gut die Freischaltung ging. Du musst die Aldi Talk App installieren und dann verbindet die sich mit irgendeiner Hausfrau in Ungarn, die dann deinen Ausweis verifiziert.Und so war die wettbewerbsbefreite Dreier-Oligarchie geboren. Man hätte die Mobilfunkunternehmen auch einfach verpflichten können, zum Beispiel an die 100% der Fläche Deutschlands abzudecken.Gut, das wäre für die Unternehmen wirtschaftlich natürlich unaktiv. Ja, genau das. Und so müsste man das auch bei Festnetz-Sachen machen. Haushalte ist immer so ein Problem. Und gerade bei mobilem Internet ist Haushalte total beknackt.Weil bei mobilem Internet interessiert dich ja zum Beispiel auch, wenn du mal irgendwo wandern bist, ob du Google Maps was nachgucken kannst.Ein Mast irgendwo im Schwarzwald lohnt sich halt nicht. Was hätte man da nur tun können? Vielleicht unkomplizierte Subventionen, um etwaige unprofitable Gebiete trotzdem abzudecken?Vielleicht geteilte Masten für Betreiber in solchen Gebieten? Das, was man Ende 2019, 10 Jahre später, sowieso beschlossen hat? Man hat in Deutschland unfassbare 10 Jahre gebraucht, um die Unternehmen dazu gezwungen, Menschen in ländlichen Räumen vernünftig zu versorgen.Das ist besonders bitter, wenn man bedenkt, dass die Telekom immer noch zu knapp einem Drittel dem Staat gehört.Apropos, dasselbe Unternehmen hat jetzt eine Kampagne gestartet. Wir jagen Funklöcher. Kommunen können sich bewerben. Kriterium ist, dass man kein LTE hat. Und dann gibt es, Achtung, Gewinner.Als Bürger kann man zeitgemäßes Internet bei einem Drittelstaatlichen Unternehmen gewinnen. Im Jahr 2020 ist das ein bisschen wie Wasserlöcher.Das stimmt eigentlich. Da habe ich mir noch gar keine Gedanken drüber gemacht, aber da hat er recht. Und es muss nicht so sein. In Frankreich gibt es einen viel aggressiveren Wettbewerb.Das funktioniert. In vielen Ländern funktioniert das. Wir kriegen es ja bei unserem normalen Internetausbau auch nicht hin. Alles, was irgendwie mit Technik und zukunftsfähigen Sachen zu tun hat, pennen wir seit 20 Jahren. Und das, was da ist und ganz gut funktioniert, geht immer weiter kaputt.... billigen Anbietern dank Diensteanbieterverpflichtung. Die Durchschnittsgeschwindigkeiten sind dabei viel höher als in Deutschland. Das soll auch für 5G so weitergehen.In der Schweiz ist Internet ein Teil der Grundversorgung und wird von der teilstaatlichen Swisscom übernommen. Auch die zwei privaten Wettbewerber der Swisscom wurden früh zu großen Investitionen in ihre Infrastruktur gebracht.Heute hat man überall in der Schweiz wahnsinnig gutes mobiles Internet, selbst auf vielen Bergen und in langen Tunneln. 5G wird rasend schnell ausgebaut.Jetzt kommt auch bei uns 5G. Eine Chance für Deutschland, sich als eines der reichsten...Und als das losging, haben bei uns ganz viele Leute rumgeheult nach dem Motto, oh nein, wir wollen kein 5G-Strahlung, besser erstmal 4G richtig ausbauen, was auch immer das eine mit dem anderen zu tun hat. In Deutschland sind halt dazu noch, dass das eh schon nicht richtig funktioniert, auch noch viel irgendwie so Anti-Technik....Länder der Welt endlich aus dem hinteren Mittelfeld nach vorne zu befördern. Die Telekom kann Stand heute bereits ca. 50% der deutschen Haushalte 5G anbieten. Die entsprechende Auktion für die 5G-Frequenzen ist im Juni letzten Jahres zu Ende gegangen.Es gibt viele neue Auflagen, aber in der Autobahn-Slash-Haushaltsstrategie keine großen Veränderungen. Mit 1&1 gibt es einen neuen Wettbewerber, das ist gut. Leider gibt es wieder keine Dienste an......der Verpflichtung, das ist schlecht. Nationales Roaming, also das Teilen von Masten in kritischen oder unprofitablen Gebieten, wird auch nicht Pflicht.Der Glasfaserausbau wurde in Deutschland ja ganz krass verrissen, weil man für die Telekom viel zu lange auf Kupfer gesetzt hat. Mobilfunkmasten sind in Deutschland, genau wie unsere Häuser, kaum an Glasfaser angeschlossen.Müssen sie aber zwangsläufig für 5G, zum Beispiel aufgrund der hohen Datenraten.Mist aber auch.Gleichzeitig nutzen viele Deutsche weiter nur das 3G-Netz, dem 3G-Netz... Das bleibt ja auch nichts anderes übrig....werden jetzt Frequenzen weggenommen, um sie für 4G und 5G zu nutzen.Dadurch wird es auf Dauer langsamer. Das heißt, man wird ultimativ evtl. einfach gezwungen, sich einen teuren oder schlechten LTE-Vertrag zu kaufen, um nicht abgehängt zu werden.Deutschland droht noch weiter zu einer digitalen Zweiklassengesellschaft zu werden. Langsam ist...Und nicht nur da sind wir eine Zweiklassengesellschaft.Also ich finde, am offensichtlichen ist es, wenn ihr euch mal...Thema Hustensinn.Lasst euch mal bei einem Arzt behandeln mit eurer gesetzlichen Karte und lasst euch mal behandeln mit ihr bezahlt selbst. Da liegen Welten dazwischen.Krieges Internet auf dem Land und 5G in der Stadt. Gutes mobiles Internet für alle ist heute einfach essentiell und gehört zur Chancengleichheit in unserem Land.Wir können Leute nicht einfach abhängen, ihnen moderne Produktivität im Bus auf dem Land verwehren. Vor allem können wir uns nicht noch mehr Fehlentscheidungen und schlecht gestellte Weichen erlauben.Das Problem ist, dass genau das, er hat ja vollkommen recht, dass genau das seit 15 Jahren so die Standardsache ist, die immer erwähnt wird.So nach dem Motto, wir können uns es nicht erlauben, weiter hier keinen Anschluss zu haben, wir können es nicht erlauben, weiterhin hier in diesem Bereich nichts zu machen, wir können uns nicht erlauben, weiter in dem Bereich...Aber anscheinend können wir das schon, weil ansonsten hätte es die letzten 15 Jahre was getan.Und das Problem ist ja auch, wenn du einmal hinten dran bist, du holst dich ja nicht auf magische Art und Weise wieder auf.Es ist eher so, wenn du nicht massiv versuchst aufzuholen, wirst du nicht nur hinten dran bleiben, sondern immer mehr hinten dran sein.Das haben wir uns schon mal angeguckt, das war auch nicht schlecht.Letztendlich ist es aber auch sowohl, was er hier erzählt, was mehr oder weniger alle wissen, was aber leider in Deutschland habe ich den Eindruck auch zu wenige interessiert.Also, der 015 Benutzer hier in Deutschland, Internet, die sagen dann so, ja ab und zu mal gucke ich ein bisschen E-Mail und sowas und dann gucke ich mal ein bisschen YouTube und so, aber ansonsten ich brauche nicht mehr, ich mache doch eh kaum was.Weil zu viele Boomer in der Politik das sagen haben.Ja, ich kann mir auch nicht so hundertprozentig erklären, wie man das nicht mitbekommen kann in der Politik, unabhängig davon in welcher Partei du angehörst, so gewisse Sachen, wie zum Beispiel eben zukunftsfähige Internetausbau.Es ist doch eigentlich scheißegal, ob du jetzt CDU, SPD, Grüne, AfD, Linke, was auch immer bist, es gibt doch so ein paar Themen, da können sich doch im Kopf eigentlich mal, da kann man doch eigentlich gar nicht dagegen sein, das zu machen.Es gibt Themen, da kann man sich streiten, aber gerade was Zukunftsfähigkeit und Internetausbau angeht, das ist eigentlich kein Thema, wo man sich darüber streiten könnte, kann.Kann man anscheinend schon, aber ich weiß nicht warum.Und gerade deswegen kann ich es nicht nachvollziehen, weil egal wer an der Regierung ist, gerade internettechnisch, diese Weitsicht, diese die man dafür eigentlich noch nicht mal braucht, dass das wichtig ist, das sollte man eigentlich allen zutrauen.So, was schauen wir dann als nächstes? Was haben wir denn sonst noch? MW2 Klassen, Diablo Clone in One Week? Was? Ok Leute, es ist heute so warm, ich muss mir jetzt den Schnee Maulwurf, was auch immer das ist, in Lego angucken.Ah, yes. Und was, egal, man muss sich fragen, was man davon hat, weil man hat davon nichts, außer dass es cooles Lego-Stellzeugs ist.Warming UpGuck mal hier, wie er da durchgeht. Wie nichts. Da war ziemlich weicher Schnee.Guck mal, wie lang es das machen kann, bevor es kaputt geht.Guck mal, wie stylish das sogar nach, guck mal, wie geil sich das drehen kann.Pssst.Gleich hat er sich unterm Haus durchgegraben, kam auf der anderen Seite von der Garage wieder raus.Oh, er hat sich eingegrabt.Guck mal hier, da geht er ab, da geht er steil.Na gut, das wird nichts. Aber es ist eine coole Konstruktion.So, ein bisschen Schnee muss sein jetzt. Nachdem ja gerade schon wieder, Moment, wie viel Grad ist? Schauen wir nochmal schnell. Nachdem ja gerade schon 29 Grad ist, muss also ein bisschen Schnee angucken.Okay, kommen wir uns an. I made a Diablo clone in one week. Ich sag lieber Diablo. Die Amis sagen wir so Diablo. Ich kann das nicht aussprechen.Wetter in der Kommandozeile, klar. Beste. Geht übrigens auch so, kannst du auch direkt den Browser angucken. Sieht genauso aus.Diablo, genau Diablo. Was hältst du von meiner Theorie, dass die IT als Kollektiv irgendwann verlernt von Grund auf zu programmieren und dann die einzigen Leute, die nach der Apokalypse die IT wieder aufbauen können, Minecraft Redstone Engineers sind.Ah, yes, das klingt plausibel. Wie? Ohne zu programmieren, gut, Unity Editor auf und zusammenklicken.Unity Editor zusammenklicken. Einfach in Asset Store sich alles kaufen und im Editor zusammenklicken.Oder Unreal. Und Unreal geht auch, Unreal Asset Store und zusammenklicken. Okay, okay, okay, also mal jetzt mal, Visual Scripting und ohne Single Line of Code, das kommt doch aufs Gleiche raus.Ob ich jetzt zusammen, ob ich jetzt quasi Plöcke zusammenklicke mit Logik oder eine Zeile Programmcode macht auch überhaupt keinen Unterschied.Wahrscheinlich ist es mit Programmcode nur deutlich simpler und schneller erledigt.Ah, das C++. Sekunde Leute, ich muss den C++ Flame rausholen.Ne, das ist die Schraub, das ist kein C++. Nein, das ist die Schraub, das ist kein C++. So schöne Lambda-Funktionen hat C++ gar nicht, wie die hier.Man sieht nämlich gleich, es sieht gescheit aus, also kann kein C++ sein.Okay, ich glaube, das kriege ich auch noch hin. So weit kriege ich es auch noch hin.Okay, Lautstärke ist okay. Muss gerade noch mal, also. Okay, also hätte das genauso gut auch gleich programmieren können, anstatt das zusammenzuklicken.Okay, er klickt den Kram im Editor zusammen, anstatt zu programmieren. Ja, okay, er hätte es auch programmieren können.Jays fragt, sollte ich mir Sensoren DHT22 von Aliexpress bestellen, sind da viel billiger? Klar, wenn du die brauchst. DHT22 habe ich auch ein paar im Einsatz. Schade auf jeden Fall nicht ein paar zu haben.Wobei ich ehrlich sagen muss, Temperatursensoren finde ich die hier besser.B, B, M, B, B, M, E, ne, 28, genau, genau, genau, den meine ich. Ja, die finde ich besser.Sowohl von den Libraries her, die es dafür gibt, als auch von der Genauigkeit. Weil ich hatte einen DHT11 oder DHT22 bei mir im Keller und der ist mit der hohen Luftfeuchtigkeit nicht klar gekommen. Der hat immer Müll angezeigt und der hier zeigt jetzt was Sinnvolles an.Computation, ja, sehr nötig. Es gibt ein paar Staaten und Transitionen. Jede Transition kann von ein paar Inputen getriggert werden. Nachdem eine Basis-Animation eingeführt wurde, habe ich die Zeit.Oh, es läuft. Wisst ihr, was man daran wieder richtig gut sieht? Genau, der Sensor kann auch Luftdruck, Luftfeuchtigkeit und Temperatur.Was man daran richtig gut sieht ist, wie viel Arbeit ein aktueller Game-Editor, Engine-Game-Editor abnehmen kann.Also wenn du einfach nur, wenn du eine Spiele-Idee hast und du möchtest gucken, ob die sich umsetzen lässt und sich gut spielen lässt, gibt es nichts besseres als Unity und Unreal oder vielleicht noch die ein oder andere. Ich kenne mich an dem Bereich nicht sonderlich gut aus.Aber was einen riesen Akt überlegt mal, wie lange sowas dauern würde, allein schon sowas Publisches selbst zu machen. Allein schon ein System, wo du Animation laden kannst. Ich weiß nicht, was dort bei Models und Animationen so die Standardformate sind der üblichen Programme. Allein schon bis du das laden kannst, umsetzen kannst. Das dauert ewig, bis du sowas gebaut hast.Und gerade deswegen können auch kleinere Teams mittlerweile sowas halbwegs auf die Reihe kriegen. Wir sind nicht mehr in Zeiten von Rollercoaster Tycoon, wo das ein Mann in Assembler selbst programmiert.Ok, im Prinzip, anstatt zu programmieren, klickt er den ganzen Kram zusammen. Existentiale Modus.Ok, im Prinzip, anstatt zu programmieren, klickt er den ganzen Kram zusammen. Existentiale Modus.Das ist aber nicht so viel. Also wenn er in der Geschwindigkeit weitermacht, wird das aber nichts mit dem Diablo-Klon in einer Woche.Quasi eine laufende Figur mit einer Kamera drüber. Das ist wahrscheinlich eine Sache, die ist in so einem Editor ziemlich simpel zu machen.Das ist wahrscheinlich eine Sache, die ist in so einem Editor ziemlich simpel zu machen.Das ist einfach. Einfach in den Asset Store und kaufen. Und dann auch Steam Greenlight hochladen.Das ist einfach. Einfach in den Asset Store und kaufen. Und dann auch Steam Greenlight hochladen. Und dann auch Steam Greenlight hochladen.Das ist einfach. Einfach in den Asset Store und kaufen. Und dann auch Steam Greenlight hochladen.Das ist einfach. Einfach in den Asset Store und kaufen. Und dann auch Steam Greenlight hochladen. Und dann auch Steam Greenlight hochladen.Und dann auch Steam Greenlight hochladen. Und dann auch Steam Greenlight hochladen. Und dann auch Steam Greenlight hochladen.Oh!Ich finde das cool. Das soll er anlassen. Da passiert wenigstens was, wenn die Monster sterben.Ich finde das cool. Das soll er anlassen. Da passiert wenigstens was, wenn die Monster sterben.Ich finde das cool. Das soll er anlassen. Das soll er anlassen.Mein nächster Tag begann mit mantle Miel RogerCast. Es sieht recht cool aus.Ich habe einen Manhattan gewünscht aber es gibt gar keine neuen Sachen.Ich werde diesen Problem dadurch erstellen nach einer neuen Impfe.Aber ich brauche einige Icon für die Attackungen.Asset Store, exzellent!Ne, Asset Store heißt bei Unity, bei Unreal heißt es der Unreal Engine Marketplace, ok.Der sollte mit einem Baguette kämpfen, das wäre viel besser.Es ist halt lustig, dass du quasi dir mehr oderweniger, wie man ja auch auf Steam sieht, dass du dir ziemlich easy ein Spiel aus demMarketplace oder aus dem Asset Store zusammenklicken kannst, mit Basic Funktionen.Das ist eine Sache von 2-3 Tagen, wie man hier sieht und von diesem Shit wird so vielmittlerweile rausgehauen, auch als Early Access und dann Gott und die Welt dabei versprochen,wie geil es noch wird und direkt nach Release haben sich das dann 5 Leute gekauft und dannwird nie weiterentwickelt dran.Ich habe es nicht geschafft, für Single-Slot-Items zu arbeiten, ich habe es nicht geschafft,für Doppel-Slot-Items, wie Waffen, zu arbeiten.Also habe ich von Anfang an Equipment-Slotten gegründet und viel Zeit damit verwendet.Jedoch war ich sehr glücklich mit dem Ergebnis.Das letzte, was ich am ersten Tag gemacht habe, war ein Widget für Attribute.Es gibt drei Hauptattribute, Kraft, Dexterität und Intelligenz.An diesem Punkt war ich wirklich müde, also habe ich mich am nächsten Tag beendet.Ich habe meinen vierten Tag begonnen.Die Items sehen nicht gut aus, ja?Das stimmt schon.Aber müssen sie ja auch nicht für sowas.Guckt ja mal in Steam an, es ist kein Greenlight mehr, die ganzen Early Access Games, die sehenauch schlechter aus.Die Zänen sind eine Attribute-System.Kraft sollte die Anzahl von Health Points und Schaden erhöhen.Dexterität sollte die Anzahl von Schaden erhöhen, Bewegung und Geschwindigkeit erhöhen.Intelligenz sollte die Anzahl von Mana Points erhöhen und auch Health und Mana Regeneration.Und Schaden?Na ja, eigentlich erhöht der Schaden nur die Anzahl von Schaden.Aber all das funktioniert nicht wirklich gerade jetzt.Es gibt nur ein paar Tooltipps.Hallo Max, hast du dir schon mal angeschaut, wie man mit dem Linux Kernel programmiert?Scheint gar nicht so schwer.Was meinst du, mit dem Linux Kernel zu programmieren?Der sitzt ja nicht neben dir und tippt.We're going to implement it a bit later and now I want to improve item system.Firstly I've created a new enumeration for items rarity.There will be common, rare, epic and legendary items.Ah, noch nie gesehen, er ist noch nie gesehen.I made yet another widget for item system.Ach, Kernel-Module.Nein, das hab ich mir noch nicht angeguckt.Kernel-Module.Nein, hab ich mir nicht angeguckt.Now the player can see the name of the item, attributes that item gives and also rarity.Items don't affect any attributes right now, so that is something we should do later.And now I want to make items to be real physical objects in the world, so we can spawn themand pick them up.I've added a...Spawn him.Now we can spawn them in the world, but they are actually not interactable.Also now items have their names displayed if a player holds control key or hover the cursorover an item.After that I made a script...Also ich glaube, es wäre doch einfacher gewesen, den Kram zu programmieren, anstattdem hier im Editor zusammenzuklicken....possible to pick up items.I thought that it doesn't work, but it actually does.We need to hide collected items, but I fixed it with a simple script and now it workslike a charm.Another thing I've added was a special item for gold.Player will receive gold if he is near enough.Previously I implemented a bunch of functions to manipulate players' attributes, and itemsnow actually affect them.Spielst du noch Harvest League?Äh, ja.Letzte Woche war ich krank, habe ich nicht gespielt, da hatte ich andere Probleme.Bei mir ist es immer so, wenn ich eine Woche nicht gespielt habe, vergeht mir die Lust,mich wieder reinzufinden, aber ich spiele weiter.PoE hat doch eine eigene Engine, die haben PoE komplett from scratch, wie man so schönsagt, gebastelt.Ob sie das heute noch machen würden, weiß ich nicht.Man darf nicht vergessen, PoE ist an, ich glaube, 2012 entstanden, oder noch früher.Ob sie das heute wieder machen würden, weiß ich nicht, wahrscheinlich nicht.Das sieht tatsächlich ganz gut aus, aber das ist halt auch ein gutes Model, was von Leutenerstellt wurde, die wissen, wie es geht.Das sieht besser aus, als 80% das Team Greenlight, ihr wisst, Early Access, Gedulds, Games.Und er soll sich mal an den Boden kümmern, ich gehe mal davon aus, er geht in den AssetsStore und kauft sich einfach eine Map.Kannstsogar skillen.Poggers.Und natürlich kann ein Spieler auf den Boden kümmern, es war ein wirklich produktiverTag, also los geht's.Ich erinnere mich, dass Abilitäten nichts tun, also habe ich zwölf Abilitäten für zweiKlassen gearbeitet.Warrior und Mage.Ich habe einmal mit Warriors angefangen.Der erste sollte jeden Gegner vor dem Spieler schießen.Es war nicht wirklich schwer zu implementieren, weil ich bereits eine abstrakte Abilität-Klassehatte.Der Akzent von ihm hört sich irgendwie so ein bisschen, ähm, gekomretmäßig an.Und du musst gucken, dass die Firewall auch die Verbindung zulässt auf den Router.Sturm.Richtig big brain Abilities.Der Chuck, neun Monate, Dankeschön.Jo, danke, das ist schon ein paar Tage her.Ähm, ja dann würde ich, also wenn das Web-Interface gar nicht mehr abkommt, dann würde ich auchmal resetten.Oder Reset sollte eigentlich immer funktionieren.Stöpsel dich aber, zum ausprobieren, stöpsel dich mal an Port, ähm, an Port Null.Ich glaube da gibt es unterschiedliche Regelungen, was denn die Fault Port ist, ähm, und ansonstenmit Windbox kannst du es auch ausprobieren, ja.Aber wenn es gar nicht mehr funktioniert, ist es schon sehr merkwürdig.Boah, sag doch einfach Asset Store Map kaufen, wozu Map selber machen.Das, das Schlimme ist, das sieht wirklich besser aus, wie 90% der Early Access Gamesauf Steam.Das ist auch noch kostenlos.Und ja, es könnte echt ein Diablo 3 Map sein, huge NPCs.Ja, so sieht es aus, Chet, der Chet hier ist der Beste, jetzt kannst du ja Chet mal selberloben.Ne, Choose My Name ist ja nix mitgemacht.Das ist, das, das sieht wirklich besser aus, als 90% der Greenlight Games.Obwohl es im Endeffekt halt einfach nur Simples Asset Zusammentracken und Droppen ist undnatürlich die Logik dahinter, ja, die jetzt aber nicht allzu komplex sein dürfte.Ich muss mal sagen, der Unreal Editor sieht mega hässlich aus.Das sieht aus wie irgendeinen, boah, keine Ahnung, mir fällt aber gar kein Vergleichein.Random zusammen angeordnete Buttons.Sorsioi, ein bisschen, ja, aber sogar Plender sieht mittlerweile ganz gut aus.Die sollten sich mal Eikens aus ihrem eigenen Store kaufen.Oh, das sieht nicht gut aus, Hits, it never hits, alles, alles Assets da, ja, ja, ja,ja.Okay, derAlso ich sage es jetzt zum 15 Mal, der hätte das doch selbst programmieren können anstatthier zusammen zu klicken, weil im Prinzip nichts anderes ist.Es könnte wirklich in die Upload 3 Dungeon sein.Ja und jetzt Release Steam Early Access und dann nie wieder was dran machen.Coolen Trailer mit 0850 Epic Music erstellen?Choose my name?Nein, gar nicht.Warum das Leute unterstützen verstehe ich auch nicht, choose my name.Keine Ahnung, also was da die Leute so geil dran finden und da massig Kohle reinpumpenerschließt sich mir auch absolut nicht.Ich brauche mal den nicht, sounds overrated, jebaited.Sogar mit Menü!Funktioniert!Ich meine für das, dass er das mehr oder weniger alles aus dem Marketplace zusammengestöpselthat, ist das doch echt ganz ansehnlich was er da fabriziert hat.Ist das RTX Ready bestimmt?Chat, ich glaube das würden wir auch noch hinkriegen.Gut, das müssen wir uns jetzt nicht angucken.Kann looten, Soundeffekte hat er nicht.Seine Abilities funktionieren, Zeug verkaufen tut auch.Jetzt wird der Boss gebashed und dann ist er durch.Ja, war doch ein cooles Video.Wo ist der Battle Royale Modus?Das geht anders, der released das jetzt erstmal als Early Access, macht einen geilen Trailermit Epic Music und sagt dann Battle Royale coming soon und dann kaufen es alle die verrückten.Und dann macht er nie wieder was dran und löscht sein Steam Account und behält dasGeld.So wie man das mit Early Access Spielen macht.Nee, sowas mach ich nicht.Spieleentwicklung ist echt ein Bereich, da bin ich absolut gar nicht interessiert.Vielleicht bin ich dazu unkreativ, zu was Spieleideen angeht.My Favorite Modern Warfare Kimbo, wir haben schon ewig kein MW2 Video mehr geguckt.Kennst du Danny, der macht solche Videos, was für Videos, nee, wer, Kimbo, also Profimäßighätte ich keinen Bock Spiele zu entwickeln, wie gesagt ich kenne ja einen oder kannteeinen, nein ich kenne einen der war bei Crytek.In Frankfurt.Ist aber schon ein bisschen her und auf professionelle Spieleentwicklung hätte ich echt auch keinenBock.So, also komm wir gucken jetzt eine Runde MW2, wir haben schon ewig kein MW2 immer geguckt.Muss man was anderes angucken als, ich mein eigentlich MW2 hört es ja vom Namen so anals ist es neuer als das aktuelle MW, wo wir schon mal wieder sehen, was für ein Clusterfuckdie Call of Duty Benamung mittlerweile ist.Ich bin Fortunet hier und heute sind wir wieder auf MW2, in heute's Video will ich einenMW2, was das für eine Klasse, MP5, Akimbo Silencer, mein G18 Akimbo Silencer, das istKeine frageDie benahmung ist gut neClass 1,2,3,4,5,6,7,8Die schleuteAlter, man muss ja sagen in mw2 ist man auchVerdammt schnell gestorbenUnd an soviel BullshitAllerdings allesAlles nicht so random Bullshit wie normalesModern Warfare 2019Was울TopThe crosshairs on these GA teams with steady aim is really small. So extremely accurate. We got people coming this way though, soYou don't want to challenge too many open gunfights. Although they do have some decent rangeWar das grad, war der grad mit dem Noobtube am Start der Gegner?Man hört ihn doch rechts laufen, Kollege. Er hat eine Claymore gesetzt rechts.Richtig Low-Brain-Gegner.Das ist der Grund, warum wir die G-18s haben. Für mich liebt es den Geräusch der Doppelsuppressten MP5s, das ist so sauer.Ich glaube, die Suppressoren sind nötig. Nicht genau, aber ich würde sie trotzdem benutzen.Wenn du nicht die G-18s von Kimbo bekommst, solltest du dir okay sein.Warum ist es so laggig? Ich werde diese aufschlagen.Ich bin ein wenig nervös. Ich habe gerade eine Claymore explodiert. Ich weiß nicht, woher das herkommt.Ich glaube, mein Haar hat bis jetzt noch einen Kassel getötet.Was mir gerade im Nachhinein bei den alten Call of Duty ganz gut auffällt, die waren relativ simpel. Da gab es nicht 50 Billionen Spielmodi, die gespielt wurden, irgendwelche Nachtmaps, ein Waffen-Editor wurde, 50 Aufsätze drin rumwurschteln konntest,3 Milliarden Kombinationen von irgendwas. Du konntest mehr oder weniger sprinten und Gegner killen und sterben. Das war's.Ich glaube, wir brauchen noch einen Kassel.Ja, wir haben ihn. Lass uns gehen.Soll ich ihn hier anrufen? Das ist die Frage.Ich glaube, ich kann mich nur dafür schützen.Ich glaube, ich kann mich selbst schützen.Ich habe gerade diese explodierten Bärle rausgeholt.Hoffentlich mit meinem Teamkameraden oben oben.Er bleibt da drin und versucht es nicht zu lassen, mich zu töten.Oh Gott, wo ist dieser Lag?Ich weiß es nicht.Okay, das ist jetzt natürlich der typische Modern Warfare 2 Shit.Killstreaks, Chopper, Gunner, Nuke.Okay, doch nicht, doch nicht.Oh, kennt ihr das? Aus dem Killstreak rauskommen und instant verrecken?Das war immer so ätzend. Du sagst dem Motto, jawoll, jetzt noch 2 Kills, jetzt noch 2 Kills nach dem Killstreak.Oh fuck, tot.Ah, schön.Exzellent.Wo ist der geile, dass man da oben drauf kann?Der Noobtube Dude, Alter.Der schießt über die halbe Map.Wie halt komplett umfallen an Stellen, wo sie nie gewesen sind.134.Das hätte man zu der Zeit, als das Spiel angesagt war, ohne Probleme hochladen können.Das ist der Inbegriff von Spray and Pray, was der macht, ja.Oh, what?Oh, what?Wow.In MW2 kannst du alles mit allem irgendwie in 0,1 Sekunde killen.Big Brain Play, Claymore PlacementIn MW2, im aktuellen Modern Warfarewärs halt so gewesen, dass hier linksin diesem Fenster permanent einer gehättklitscht hätte.Hier guck da links in dem Fensterhat permanent einer gehättklitscht.Ha! Da steht er rum.Das hat übrigens auch nur geklappt, weil ereindeutig irgendeinen Latency Vorteil gegenüber dem anderen hatte.Sonst hätte er die normalerweise keine Chance gehabt,weil er als Danny in der rein läuft und der andere hätte normalerweisene ganze Ecke länger Zeit gehabt ihn zu killen beim reinlaufen.Das war aber halt Konsolen P2P Matchmakinggeschiss.Das war so OP, die G18.Eigentlich brauchst du überhaupt keine Primary Waffe mit,wenn die G18er Kimbo spielt.Doppel Harrier.Endlich mal ein Gegner, der auch was killt.Also dort sich hinzulegen könnte ein bisschen problematisch sein.Oh knapp, knapp, knapp, knapp.Irgendwo hier in die Ecke lege.Der stirbt jetzt.Normalerweise wirst du immer von hinten gekillt bei sowas.Der Chopper auf der Map hat gesackt.Oh ein, immerhin.Äußerst fairer Spawn, direkt direkt, super Spawn, direkt im Fadenkreuz vom Chopper-Gunner.Noob tubt, oder besser gesagt RPG tubt.Hi-Rise, ja jetzt, oh na gut, Hi-Rise AC130 oder Hi-Rise Chopper-Gunner, da kannste ja kaum was falsch machen.Da kommste ja gar nicht raus.Okay, der hat auch absolut Low-Brain-Reactions der Gegner.Du konntest dem Spawn normalerweise durch die Decke schießen.Ich glaube das einzige, wo du nicht getroffen werden konntest war,wenn du entweder im Tunnel warst oder ganz hinten auf der Seite.Aber sonst konntest du durch die Decke schießen.Guck hier kannst du normalerweise durch die Decke schießen.Ich glaube hier bist du safe, hier bist du safe.Der kann Glück haben, dass er keine Ballhacker oder sonst was am Start hat.Echt nur eine Seite?Sehr fair.Oh nee, ich spüre den Rage.Der Schneiber-Dude.Was ist mit denen los?Monkeys.Machst du auch wieder PoE?Nee, wahrscheinlich nicht.Und?Guck mal, wie gut das Ding trifft über die gesamte Map.Also G18 Akimbo war schon echt heftige Geschichte.Jetzt kriegt er eine Nuke, ich sag's euch Leute.Weil auf Afghan mit AC130, also...Da ist, da kannst du ja kaum was falsch machen, es sei denn du wirst direkt abgeballert.Oh nee, das war unglücklich.Jetzt, jetzt, jetzt.Wie? Moment, man kann das überleben?Jawoll.So und jetzt ist nur noch die Preisfrage.Messer der, während die Nuke angemacht wird.G00 Stufe 1, dankeschön.Excellent Subscription, huge.Ohne Messern keine legit...So, wird gemessert.Bomby.Messern.Und, und, und, und.Ja, legit, zählt.Ohne Messern in der Nuke ist nicht, geht nicht.Okay, was haben wir sonst noch für einen Star?Was haben wir sonst noch?Switch Clone, you should stay away.Was, wenn der Desktop...What do alien civilizations look like?Ja, kurz gesagt macht der mal gute Videos.Die gibt's übrigens mittlerweile auch auf Deutsch.Der Flight Simulator, so gut ist der wirklich.Okay, wer, wer, wer macht das Video?Je nachdem, wer das Video spricht, guck ich mir ein Gamster Video auch an.Ich konnte Maurice früher mir nie angucken.Mittlerweile gucke ich mir eigentlich die Videos von ihm mit am liebsten an.Keine Ahnung.Es sieht aber schon echt ziemlich gut aus.Ach, das ist ja ein recht oldschool Typ.Buckelt oder?Also es sieht wirklich gut aus.Alter, das Video ist ja mega Resident Sleeper.Ich gebe zu, dass Flug Simulator jetzt vielleicht ähnlich, sodass das Killer-Thema schlechthin ist, ja.Hast du dir den mal Game Pass angeschaut?Was? Moment, was?Hast du dir den Game Pass mal angeschaut?Du meinst von Flug Simulator? Nö.Es sieht aber schon, also wenn man sich mal anguckt, wie detailliert und die Häuser halt auch echte, richtige 3D-Objekte da unten sind.Das ist echt gut.Es sieht schon cool aus.Angeblich wollten die ja auch irgendwie Echtzeitwetter und sowas haben.Das ist aber was anderes.Sieht jetzt aber nicht so gut aus.Optisch macht das echt was her.Ich hab letztens drüber gelesen, dass es irgendwie drei verschiedene Editions gibt und je nachdem welche Edition man kauft, sind dann unterschiedlich viele Flugzeuge, unterschiedlich viele detaillierte Flughäfen dabei und sowas.Mal gucken, ob das so ausartet wie beim, was war das, der Truck Simulator oder sowas?Dieses eine Game, wo du irgendwie 5000 Euro Microtransactions ausgeben kannst.Ist das auch Echtzeit? Man kann das garantiert Echtzeit spielen.Was ist der Train Simulator? Der Train Simulator, nicht der Truck Simulator.Es gibt Leute, die streamen das teilweise auf Twitch und die machen das richtig hardcore, also sprich, die fliegen fünf Stunden Echtzeit und die haben dann Spieler, die unterwegs dann auch Air Traffic und Gedöns machen.Die haben dann Spieler, die wirklich auch Funkverkehr und so machen.Das ist richtig die Hardcore Simulationsleute am Start.Gibt es hier teilweise auch auf Twitch, ist aber halt übelst langweilig, wenn man sich nicht dafür interessiert.Wenn der Desktop in einem Notebook lag, heftige Kühllösung und Stromversorgung.Zeig mal her, der Auer wieder am Start.Hallo zusammen und herzlich willkommen zu einem weiteren Video.Es geht jetzt endlich mal wieder normal weiter.Die letzten vier, fünf Wochen waren bei mir ein bisschen schwierig, deswegen war der Video Output auch nicht ganz so hoch.Und das versuche ich jetzt wieder in die normal geordneten Bahnen zu führen.Und wir machen das heute mit einem XMG Notebook.Und das ist mal wieder was.Also wir haben ja vor kurzem den Apex 15 reviewt.Das war das mit einem 3950X, also einem Desktop CPU von AMD in einem Notebook.Und jetzt muss ich sagen, hat XMG es einfach komplett übertrieben.Generales Lame, vier Monate, dankeschön.Subscription, huge massive.Dieses Produkt ist was, wo ich mich frage, ist das noch ein Laptop oder ist das einfach...Es ist absolut sinnlos, für das nämlich für mobil mitnehmen.... ein Desktop PC mit aufklappbarem Display, ich weiß es nicht ganz genau.Der Anwendungszweck ist schon fragwürdig, ja.Das teile ich heute im Detail an, da gibt es einige absolut verrückte, kurze Details.Wenn ihr keinen Bock habt auf dieses ganze Blabla, also es geht jetzt mal so hauptsächlich um Chic.Also meine Katze.Das sind ein paar Details, die habt ihr wahrscheinlich auf Instagram schon gesehen.Wenn ihr...... man sich das so anhört, es kommt halt nicht hochwertig rüber.Es ist ein technisch gesehen absolut super Produkt.Aber das passt einfach nicht zusammen.Also da sollte ein hochwertigeres Gehäuse her.Reden wir dafür jetzt mal über die Kühllösung.Habt ihr...Boah, das ist aber ein riesen fettes Teil, Alter.Das hast du schon mal gesehen in einem Laptop, einfach nur...Aber ich gucke eh selten in Laptops rein.Massive Anzahl an Heatpipes, die sich hier oben befindet.Und dieser Lüfter.Einfach nur der Lüfter, wie massiv dieses Teil ist.Unfassbar, was eine Kühlkonstruktion...Wahrscheinlich hast du erstmal Brandflecken an den Beinen.Wenn du sie auf den Schoß stellst.... in diesem Teil hier steckt.Das erklärt natürlich auch so ein bisschen das Gewicht, würde ich sagen.Schrauben wir gleich noch mal ab und schauen uns das mal in der vollen Pracht an.Aber so ein Teil, so eine riesen Kühllösung habe ich noch nie in irgendeinem Notebook verbaut gesehen.Warum kauft man sich so ein Laptop? Keine Ahnung.Der Anwendungszweck erschließt sich mir nicht.So eine Konstruktion, das ist Beleuchtung.Oh RGB, wichtig.Dieses Teil liegt einfach über dem Kühler drüber.Ohne RGB geht nichts.Aber was ist das?Dass man weiß, wo man welche Teile hinlegt oder was?Ah ja, genau.Dass man die Teile wieder findet.Alle Schrauben vom Kühlkörper sind entfernt.Kabel 1, Kabel 2 abgezogen.Dann schauen wir mal, ob wir das Ding abgelöst bekommen.Und da haben wir auch schon mal einen Ausblick, warum diese Kühllösung so wichtig ist.Und auch die Netzteile.Erstmal haben sie ordentlich Wärmeleitpaste drauf geklatscht.So gehört sich das.Wir haben hier tatsächlich Sockel LGA 1200.Das heißt, hier ist ein 10900K drin gesockelt.Und hier ist ein RTX 2080 Super in einem MX.Aber gerade wenn du unterwegs bist, kannst du das nicht richtig verwenden.Lippziger.Das kannst du.Das ist höchstens was, wenn du abends, wenn du viel unterwegs bist und abends im Hotel spielen willst.Aber nur stationär.Dann okay, dann verstehe ich es.Das ist im Modul verbaut.Die werden wir gleich mal noch ausbauen.Aber jetzt erst mal kurz einen Blick auf die Kühllösung.Über die Jahre habe ich wirklich schon viele Notebooks auseinandergeschraubt und mir so die Kühllösungen angeschaut.Das ist aber echt ein fetter Kühler.Das ist wirklich, wirklich geisteskrank.Das ist wirklich ein fetter Kühler.Den Kühlblock an, der ist so groß wie meine Hand.Hier, der Kühlblock, wo die CPU aufliegt, ist übrigens Thermonucleosy-Cryonaut.Sofern ich das beurteilen kann.Besser.Hier haben wir glatte 6 Heatpipes, die von der CPU weggehen.Und wenn man hier schaut, wie viele Heatpipes überall links und rechts verteilt sind.Hier haben wir eine Vapor-Chamber, die auf der GPU aufliegt.Und da werden dann gleichzeitig auch noch die ganzen Rambauscheine mitgefüllt.Vapor-Chamber?Vapenation?Hier nochmal und hier...Das Notebook wiegt wahrscheinlich auch 5 Kilo oder so.Handlungsversorgung, CPU, also für ein Notebook-Kühler ist es wirklich krass.Und zurück zum Notebook.Ja.Hier ist tatsächlich ein ganz normaler 10900K verbaut.Mit Sockel.Das ist einfach krass.Sowas in Notebooks zu haben, ich finde das einfach beeindruckend.Kommen wir jetzt aber erstmal zur Grafikeinheit.Wie gesagt, die ist auf einem MXM-Modul, was das genaue ist, zeige ich euch gleich.Dafür müssen wir erst mal die zwei Schrauben noch entfernen.Und jetzt erstmal...Auf der Unterseite des Grafike-Moduls haben wir noch so ein richtig, richtig fettes Wärmelight-Pad.Das ist wahrscheinlich dazu da, um ein bisschen Wärme von dieser Platine auf die untere zu übertragen.Dieses MXM-Modul, also das ist eine RTX 2080 Super.Das ist eine der Hauptgründe, warum so krasse Netzteile notwendig sind bei diesem Notebook.Denn zusammen mit dem 10900K können die sich insgesamt im Dauerlastbetrieb knapp 400 Watt gönnen.Das ist wirklich, wirklich viel, weil wir haben jetzt 200 Watt.Und der 10900K, der darf sich dauerhaft auch 125 Watt gönnen, genauso wie es in einem Desktoprechner der Fall ist.Wir hatten ja beim Apex 15 einen 359X drin von AMD und der war quasi im Eco-Modus auf 65 Watt.Das ist jetzt hier beim 10900K nicht...Mich würde mal die Akkulaufzeit interessieren, eine Viertelstunde.Fall, und dementsprechend...Wahrscheinlich takte das Ding klarenlos runter im Akkubetrieb, dass es wahrscheinlich doch eine Stunde oder so hält.Die Leistungsaufnahme aus GPU und CPU in diesem Teil ist einfach krass.Da werden wir uns auch gleich mal die Temperaturen anschauen.Ich bin wirklich gespannt, wie das unter Last dann ist.Wenn man keine Ahnung, 3D Mark zum Beispiel einfach mal so 15 Minuten laufen lässt und CPU und GPU ordentlich unter Last stehen,da wird mich wirklich interessieren, wie mit so einer Kühlösung die Temperaturen letztendlich ausfallen und auch die Taktraten und natürlich...Ich glaube, die Temperaturen sind ganz okay.Ich mein, das Ding ist ein riesen fetter Kupferblock.Sofern die da genug Lüfter haben, die das Ganze abtransportieren, könnte ich mir vorstellen, die Temperaturen werden schon ganz okay sein.Werden jetzt auch nicht so gut wie in einem Desktopgehäuse mit irgendeinem Nocturlüfter oder gar einer Wasserkühlung dran.Aber die dürften schon okay sein.Wir haben modulare RAM-Bänke, wir haben ein MXM-Modul und wir haben einen gesockelten 10900K.Kann man das Ding natürlich auch upgraden, in der Theorie, sage ich ganz klar.Praktisch keiner macht, ja.Nur aus Erfahrung über die Jahre, wie ich so MXM-Module oder sowas verfolgt habe, lohnt sich das meistens gar nicht so sehr,weil diese Teile sind unfassbar teuer.Wenn man heutzutage einfach nur versucht, keine Ahnung, schaut euch eine 1070, 1080 im MXM-Format an.Die kosten heutzutage noch 600, 800 Euro.Das ist wirklich, wirklich krass.Und da muss man sich dann immer fragen, lohnt sich das wirklich, dass man da plant, vielleicht in Zukunft abzugradenoder kauft man sich das Teil und denkt sich dann, okay, das benutze ich so und so viele Jahre.Ich denke mal, die meisten Leute, die das kaufen, upgraden das nicht.Vielleicht mal einen neuen RAM-Riegel oder so, wenn noch einer frei ist.Aber das war es dann auch.Upgraden kann man damit.Aber ob das so ein wirklich krasses Argument ist dafür, da bin ich mir nicht so ganz sicher.Die Kühlung ist wieder komplett montiert.Dann noch ein kurzes Wort hier rechts an der Seite.Ist so eine kleine Abdeckung normalerweise drauf.Und da hat man Platz 3 M2 SSDs zu montieren.Gleich drei Stück.Links ist noch mal ein weiterer Slot.Also da kann man auf jeden Fall einiges unterbringen.Da wird es an nichts mangeln.Ein ganz kurzer Blick ins BIOS einfach nur, dass ihr seht, was für einen Umfang das hier bietetoder welchen Umfang es gegebenenfalls auch nicht bietet.Also hier einfach Übersicht über die Komponenten, dass immer was verbaut ist.Auch welcher RAM.Also wir haben hier 32 GB RAM aktuell verbaut.Hier hat man Möglichkeit NVMe und so weiter.RAM ist übrigens, beide beide noch mal kurz angemerkt gerade, extrem billig.Also wer RAM braucht, sollte RAM jetzt kaufen.RAM ist ultra billig gerade.Du kriegst 32 GB für unter 100 Euro.Also die schnelle, schnelle 32 GB für unter 100 Euro.Unter advanced gibt es dann richtig viele Optionen, was CPU Management, Webcam und so weiter betrifft.Also alles mögliche, was man brauchen könnte, ist hier auf jeden Fall vorhanden.Sehr übersichtlich dargestellt.Das gefällt mir sehr, sehr gut.Dann habe ich hier was gefunden.Overclocking Performance Menü.Das kann man nur anmachen.Was das bedeutet, zeige ich euch gleich.An, aus.Und diese Option bewirkt nämlich, dass wir hier neben dem Control Center, was wir uns noch gleich kurz anschauen,auch ein CPU Overclocking Menü finden.Und das Overclocking Menü sieht auf den ersten Blick eigentlich ganz interessant aus.Aber wirklich viel kann man nicht machen.Auf jeden Fall nicht mehr, als man auch mit Intel XTU könnte.Und ich würde mir nicht wünschen, dass es diese Option direkt in BIOS gäbe.Man kann allerdings hier bei der CPU Spannung Ander- und Overvolten.Das ist schon mal...Ob ich das jetzt noch übertakken muss?Hinter diesem CPU Overclocking Menü versteckt sich dieses Tool, was auf den ersten Blick...Wenn es geht, dann wird es gemacht.... eigentlich ganz interessant ist, aber sich ganz, ganz komisch verhält.Also die Optionen sind generell jetzt nicht mehr, als man bei Intel XTU hätte.Und wenn ich jetzt zum Beispiel hier mal versuche, die Spannung zu verändern, kann ich das gar nicht übernehmen.Und wird auch alles nicht so ganz so perfekt angezeigt.Wahrscheinlich so auto-translated.Sieht übrigens hässlich aus, das Programm.Dann werde ich jetzt für meinen Test erstmal auf Intel XTU zurückgreifen.Dafür muss ich sagen, gefällt mir das Control Center 3.0 relativ gut.Also erstmal hier LED Control für Keyboard.Da könnt ihr einfach eure Farben einstellen.Da gehe ich jetzt erstmal nicht rein.Fanspeed Control ist auf jeden Fall interessant.Gerade für Benchmarks oder wenn ihr irgendwas overclocken wollt, testen wollt...Also es ist ja schön, wenn man seine Programme stylish machen will.Allerdings, wenn man sie stylish macht, auf Kosten der Bedienbarkeit, kommt dann sowas hier raus.Weil du hast ja keine Ahnung, was du hier von anklicken kannst und was nicht.... artisch lassen.Könnt ihr maximal machen oder benutzerdefiniert einstellen, was ihr hier für eine Lüfterkurve haben wollt.Also das ist schon mal sehr, sehr gut gemacht.Das gefällt mir wirklich sehr, sehr gut.Wir lassen das für den Moment erstmal auf automatisch.Das Programm hat bestimmt eine Browser Toolbar eingebaut.Das haben wir uns ja gerade schon angeschaut.Das werden wir jetzt mal nicht verwenden.Was aber auch interessant ist, ist GPU Overclocking.Wenn wir hier reinklicken, dann gibt es nochmal ein extra Menü, wo wir die GPU übertakten können.Und hier ist es jetzt auch so, da sehen wir jetzt rechts unten auch übernehmen, also speichern.Hier können wir tatsächlich was machen.Das werden wir dann im 3D Mark gleich nach ausprobieren.Das sieht auf jeden Fall schon mal vielversprechend aus.Zeigt mal, was das Ding an Power hat.Lautlos Modus und der Lautlos Modus muss ich auch sagen, funktioniert tatsächlich sehr, sehr gut.Habt ihr natürlich deutlich weniger, als man von RAM nennt, von The Ashes, 1080p Ultra.Hast du dir eigentlich schon mal den OPERA Gaming Browser angeschaut?Ja, den haben wir uns vor einem Jahr oder so schon angeschaut.Ich habe nichts daran gefunden, wozu man den verwenden sollte.Maximale Details mit 1080p, denn bei diesem Teil ist ein 1080p Monitor verbaut.Es gibt es auch mit 4K, dann allerdings nur mit 60Hz, somit bis zu 240Hz.Wow, cool!Was ein reines Gaming Gerät ist.Das ist ja cool.1080p 240Hz als Notebook, das ist cool.Mit der 1080p Option, da sehen wir bei RAM nennt, von The Ashes, haben wir 137 FPS durchschnittlichund 1% Low League bei 98 FPS.Das ist wirklich sehr, sehr gut und wirklich extrem flüssig.Wirklich absolute maximale Details.Ähnliches Bild haben wir bei Red Dead Redemption 2.Jetzt ergibt das für mich auch einen Sinn.Das Ding richtet sich wirklich an Leute, die wahrscheinlich viel unterwegs sind,allerdings trotzdem relativ viel Zeit haben zu spielen.Keine Ahnung, du bist halt irgendjemand, der permanent unterwegs ist,in einem Hotel, dann irgendwie zwei Tage später in einem anderen Hotel,allerdings halt trotzdem abends Zeit hat zu spielen.Ich weiß nicht, wie viele Leute es da gibt.Und dann nimmst du halt so ein Ding mit, stellst es ins Hotel und dann kannst du abends dann deineWorld of Warcraft Rates machen.P-Ultra, also maximale Details, durchschnittlich 94 FPS und 1% Low League bei 76 FPS.Soweit erstmal kurz einfach nur zwei Einblicke.Was kann man gametechnisch von diesem Gerät erwarten?Cinebench R20 ist klar, da ist ein 10900K drin.Da gibt es keine Überraschungen.Single Core Performance, wie gewohnt beim 10900K extrem hoch.Haben wir hier 514, wenn das ganze Ding stock läuft,und 515, wenn ich einen Offset von minus 60 mV mache,damit die CPU ein kleines bisschen kühler bleibt.Und der Multi-Core Score liegt knapp unter 6000 stock und knapp über 6000,wenn ich eben den kleinen Offset bei der CPU Spannung mache.Ansonsten alles, wie erwartet, performenstechnisch bei Cinebench R20.Wenn wir uns Adobe Premiere anschauen, also ein 4K-Video rausrendern,dann liegen wir hier knapp unter einem 3900X, der ja 12-Kerne hat,also einer Desktop-CPU, der noch ein sehr respektables Ergebnis.Man muss dazu auch sagen, die 10900K-CPU, die hier verbaut ist,hat keine integrierte Grafikeinheit.Also sie hat eine integrierte Grafikeinheit, weil es ein ganz normaler 10900K ist.Aber es ist nicht rausgeführt.Die Spannungsversäugung ist hier aber abgeschnitten.Das heißt, sie wird nur die Kerne versäugt, einfach energiespartechnisch ist das sinnvoll.Da spart man noch ein paar Watt ein, wenn man die interne Grafikeinheit von Intel nicht verwendet.Dementsprechend gibt es aber auch kein Intel QuickSync, was einem vielleicht hier helfen würde.Dementsprechend ist zum Beispiel das XMG Apex 15 mit dem 3950X 16-Kerner hier nochmal knapp eine Minute schneller.Und damit würde ich sagen, wir machen kurz noch einen 3D Mark Times bei und versuchen,ob wir die GPU noch übertakten können, weil CPU übertaktet uns technisch nicht soweit.Oder irgendwie.Wo ist das für mich jetzt alles gleich mit?Gut, was auch immer, eigentlich ein ziemlich cooles Gerät.Ich habe da zwar überhaupt keinen Anwendungszweck für, aber ich finde es cool, dass das gibt.Und ich könnte mir vorstellen, es gibt durchaus Anwendungsbereiche dafür.Was haben wir denn sonst noch?Switch console you should stay away fromHey, was geht alles? Es ist ETA Prime wieder zurück. Heute werden wir den Powkiddy X2 sehen.Jetzt sieht man schon, dass das definitiv wie der Nintendo Switch aussehen kann.Ich bin mir sicher, dass das genau das ist.Es sieht Hardcore nach der Switch aus.Aber die Button sehen nicht aus wie von der Switch.Also, das ist doch garantiert nicht erlaubt. Das ist so eine Wish-Switch, Alter.Also da hat Nintendo garantiert was dagegen.Powkiddy, Powkiddy PlayAh, AliExpress, AliExpressWas kostet das? Ich muss jetzt mal da gucken.Was? Powkiddy X2, was zum?Oh, oh, oh, huge Bewertung. AliExpress69. Hey, immerhin ein Viertel von der Switch.Switch console you should stay away fromTollDie Buttons sehen schon leicht, äh, äh, minder wertiger aus als bei der Switch.Auch hier oben die Buttons.Aber das ist so krasser Switch-Gehäuse rip-off, das geht ja gar nicht.Guck mal, wie schlecht hier unten das zusammengebaut ist, schlecht verarbeitet ist das Gehäuse.White one, a black one and this kind of red and blue that really resembles the Nintendo Switch.I opted for the red and blue version because...Das ist so ein typisches Geschenk, wenn der Enkel mit Opa und Oma in den Supermarkt geht und sagtOma, Oma, ich will eine Switch haben und die Oma sagt, wieso, wir haben doch daheim eine.Oder umgedreht, der Enkel kriegt zu Weihnachten eine Switch geschenkt und Opa und Oma hat sich halt eine Powkiddy X2 gekauft.Denken, ja, das sieht doch aus wie eine Switch, das muss eine Switch sein.Und dann können sie absolut nicht nachvollziehen, warum sich der Enkel nicht freut.Okay, wenn da Games drauf sind, ist es halt eindeutig schon mal China Copyright gedürzt.Was ist eigentlich auch das Soldier Boy-Konsole geworden?Okay, die Games sind schon komplett voll installiert drauf.Erstmal die ganzen N64-Roms, die natürlich legit da drauf gekommen sind.Da ist wahrscheinlich irgendein Retro-Pie oder so drin.Game Boy, Game Boy Advance, Game Boy Color, Game Gear, Mega Drive, Neo Geo, Playstation 1 und Super Nintendo oder Super Famicom.Und wir können jede eine dieser Game-Menu-Ikonen unterhalten und wir sehen die Games hier.Es unterstützt Box-Art, aber es ist in einem seltsamen Format und es gibt auch viele Games, die Box-Art missen.Wenn du eine lange Liste von Games wie für Super Nintendo hier hast, gehst du nach unten.Viele von denen sind missen und ich habe das in der Vergangenheit gesehen mit anderen cheaperen Handhelds.Es scheint mir so zu sein, dass sie nur 20 oder 25 geben, um es gut zu sehen.Aber wenn du in der Liste runterkommst, ist alles missen.Als Bildqualität ist es wirklich nicht so großartig.Ich meine, es ist eine alles Plastik-Konstruktion und die wichtigsten Stücke sind die Analog-Sticks.Das sind einige der schlimmsten, die ich jemals durchgekommen habe.Das sind die Slider-Style-Analog-Sticks und ich habe das in der Vergangenheit gut gesehen, wenn es richtig implementiert wurde.Aber diese sind so günstig, dass sie sich an sich befinden und es ist wirklich schwer, sie zu drücken.Und nicht zu erwähnen, dass es nur zwei Trigger-Style-Analog-Sticks gibt.Aber die Weise, wie sie diese aufsetzen, ist sehr seltsam.Wenn du sie von oben drückst, werden sie nicht registriert.Wenn du sie von links drückst, werden sie nicht registriert.Du musst sie eigentlich an einen Angle drücken, um es zu funktionieren.Und das ist wirklich nicht ein Deal-Breaker.Aber die Analog-Sticks sind definitiv die schlimmsten, die ich jemals durchgekommen habe.Und manchmal, wenn du spielst, locken sie eigentlich auf.Und wenn sie auflocken, bedeutet das nicht, dass sie an sich befinden.Es fühlt sich an, als ob es etwas in der Art ist.Und du musst sie zurück- und dann weiter-drehen, um es zu funktionieren.Also, nach dem Button-Layout, siehst du, wir haben diese Duell-Analog-Sticks,diese separaten D-Pads und sie benutzen die gleichen Knöpfe, wie sie die Aktionsknöpfe nutzen.Das macht es ein bisschen schwerer, diese D-Pads zu setzten, weil die Knöpfe ein wenig hoch sind.Auf dem Boden des Units haben wir zwei Mikro-USB-Ports.Diese können für das Schargen oder das Schinken der Unit genutzt werden.Oder du kannst auch Kontrollern verbinden, wenn du wirklich wollen.Wir haben hier zwei Stücke.65 Euro kostet das.Sagt doch, es ist RetroPie, mehr oder weniger.Wahrscheinlich, wenn es geschickt anstellt, kriegst du da wahrscheinlich auch ein Terminal.Es ruckelt ein bisschen.Oh, das ist schlecht.Ja, okay, wenn die Buttons nicht funktionieren, ist es natürlich schon mal komplett RIP, das Ding.Also, wenn Buttons nicht funktionieren, ist es halt komplett RIP.Ja, aber es ist trotzdem Müll. Also, wenn Buttons nicht registriert werden, kann man es vergessen.Übrigens, wo wir wieder beim Thema sind, ich wollte doch schon seit einer ganzen Weile meine Playstation Vita im Stream flashen und gucken, was man damit mittlerweile anfangen kann.Na gut, okay, es ist Crap im Endeffekt. Unter dem Strich kann man sagen, es ist Müll.Es ist halt, es ist halt kompletter Müll. Und, und, dass es aussieht wie eine Switch, setzt dem Ganzen noch mal die Krone auf.Das ist so eine typische Switch von Wish. Wish-Switch.So, was haben wir denn sonst noch? What do alien civilizations look like? Auf geht's.A big brain time, Leute, a big brain time.Also, sollten wir jemals Aliens finden, das was mich am ehesten interessieren würde ist, wie sieht Twitch bei den Aliens aus? Was ist das Gegenstück von TwitchTV bei den Aliens?Und was, und was ist dort das beliebteste Lach-Emote? Das ist eigentlich das, was mich wirklich interessiert. Was ist das Gegenstück von Lulvee und Kegvee bei den Aliens?Guck mal, Void-Danny hat das neue Emote gefunden.Naja.Naja, also wenn ich bei uns mal so rumgucke, habe ich das Problem, dass wir uns nicht mehr umsetzen können.Naja, also wenn ich bei uns mal so rumgucke, habe ich das Problem, bei den meisten Leuten überhaupt davon zu sprechen, dass sie eine intelligente Spezies sind.Minecraft. Nur in echt.So, es ist sinnvoll, zu sagen, dass die Aliens, die sich über ihre Heimplaneten übernehmen, auch solche Qualitäten haben. Und wenn die Aliens die gleichen Physik-Läden folgen müssen, dann gibt es eine measurable Metrik für den Prozess, Energie-Nutzung.Human-Progress kann sehr präzise von der Energie, die wir aus unserem Umfeld getragen haben, und wie wir es nutzbar gemacht haben, um Dinge zu tun. Wir begannen mit Muskeln, bis wir gelernt haben, Feuer zu kontrollieren. Dann haben wir Maschinen gemacht, die kinesische Energie aus Wasser und Wind genutzt haben.Als unsere Maschinen verbesserten und unser Wissen von Materialen expanded, begannen wir, die konzentrierte Energie aus sterben Pflanzen aus dem Boden herzusteigen. Als unsere Energiekonsumption exponentiell größer wurde, so wurden die Abilitäten unserer Zivilisation.Zwischen 1800 und 2015 hat die Population die 7-Folge erhöht, während die Menschheit 25-mal mehr Energie konsumte. Es ist möglich, dass dieses Prozess weiter geht.Nach diesen Faxen hat der Wissenschaftler Nikolai Kardashev eine Methode entwickelt, um Zivilisationen zu kategorisieren, z.B. Kave-Dwellern oder Götter der Galaxien zu regeln. Die Kardashev-Szene ist eine Methode, um die Zivilisationen zu rankieren, durch ihre Energie-Nutzung.Die Szene wurde über die Jahrzehnte verbessert, aber im Allgemeinen wird sie Zivilisationen in vier verschiedenen Kategorien verwendet. Eine Type-1-Zivilisation kann die zahlreiche Energie ihrer Heimatplaneten benutzen.Eine Type-2-Zivilisation kann die zahlreiche Energie ihrer Star- und Planeten-Systeme benutzen. Eine Type-3-Zivilisation kann die zahlreiche Energie ihrer Galaxien benutzen. Eine Type-4-Zivilisation kann die zahlreiche Energie von verschiedenen Galaxien benutzen.Diese Niveau verbreiten sich in ordentlichen Größen. Es ist wie eine Ant-Kolonie zu einer menschlichen Metropolitän-Area.An Anten sind wir so komplex und zahlreiche, dass wir vielleicht auch Götter sein könnten.Um die Szene mehr nötig zu machen, brauchen wir Sub-Kategorien.Am unteren Ende des Spektrums gibt es Type-0- zu Type-1-Zivilisationen. Alles, was wir in den nächsten Jahrzehnten erreichen können, von Hunter-Gathererinnen und Hunter-Gathererinnen. Diese können in der Milky Way eigentlich sehr viele sein.Aber eine Zivilisation, die nicht aktiv Radio-Signale in das Allgemeine verwendet, könnte so nahe wie unser neuestes steller Nachbar, das Alpha Centauri-System, sein, und wir hätten keine Weise, dass sie existieren würden.Aber auch wenn sie Radio-Signale verwendet haben, wie wir es tun, könnte es nicht sehr hilfreich sein.Auf einer Interstellarscale...... ist es praktisch unbekannte.Unsere Signale können über ein beeindruckendes 200 Lichtjahre aussteigen, aber das ist nur eine kleine Faktion der Milky Way.Etwas schdie Komposition und Temperatur der Atmosphäre, wenn es weitergeht und wirnicht die Erde unhabitabel machen, werden wir eine volle Type 1-Zivilisation in den nächstenwenigen hundert Jahren. Jede Zivilisation, die eine Type 1 wird, ist verbunden, außerhalb zu schauen,weil es wahrscheinlich immer noch ein interessantes, kompetitives, gruseliger undExpansionist ist. Der nächste vernünftige Schritt zur Transition zu Type 2 ist,andere Planeten und Bodies zu altern und zu minieren. Das könnte mit Ausflug indem Raum beginnen, eine Transition zu Infrastruktur und Industrie nahe den Heimplaneten,nach Kolonien zu gehen und mit Terraformen anderen Planeten zu enden, indem sie ihre Atmosphäre,ihre Rotation oder Position verändern. Sobald eine Zivilisation weiterentwickelt und mehr und mehrStoff und Raum nutzt, wird die Energieverbrauchung mit ihnen verwendet. So werden sie irgendwann aufdas größte Projekt, das eine Type 2-Zivilisation anbieten kann, angeboten werden. Die Energieihrer Star wird durch einen Dyson-Swarm gebaut. Nachdem diese Megastruktur fertig ist, wird die Energiepraktisch unbedeutigt für das Heimsystem, wie sie sich befinden. Wenn sie immer nochinteressiert, kompetitiv, gruselig und Expansionist sind und nun komplett in Kontrolle über ihr Heimsystem,die steile Infrastruktur und die Energieverbrauchung einer Star sind, bewegt der nächste Frontierzu anderen Starrn, ein paar Jahre entfernt. Für eine Type 2-Zivilisation wird die Distanz zu anderen Starrnwie die Distanz zwischen der Erde und Pluto zu uns, heute. Technisch innerhalb von Reichen,aber nur mit enormen Investitionen in Bezug auf Zeit, Ingenieurität und …Ah, easy, fahren wir mal einfach unser komplettes Sonnensystem weg.… und Ressourcen. Dies beginnt ihre Transition in Richtung Type 3. Dieser Schritt ist so weitüber uns, dass es hart wird, zu vorstellen, was genau diese Herausforderungen aussehen undwie sie lösen werden. Wissen sie, ob sie eine Lösung finden können zu den großen Distanzen und Zeitungen von Hunderten oder TausendenJahren? Wissen sie, ob sie kommunizieren können und eine gescheite Kultur und Biologie zwischen Kolonienund Light-Years-Aparten halten? Oder werden sie in verschiedene Type-2-Zivilisationen verbreitet werden?Also das erste, was passiert, wenn wir, also mal angenommen, wir würden irgendeine Kolonie auf dem,frag mich nicht, Mars oder sonst wo gründen, das erste, was passieren würde, ist nach, keine Ahnung,drei, vierhundert Jahren werden wir uns bekriegen gegenseitig. Das ist das Beste, was wir können unddas ist alles der ersten Sache, die wir machen werden. Und da kommen dann die Mars-Leute und sagen, wir sinddie Geilsten, weil wir von Mars sind. Da kommen die Leute von der Erde und sagen, wir sind die Geilsten,weil wir von der Erde sind. Und da gibt es auch irgendwelche Splitter-Gruppen, die sagen, wir sinddie Geilsten, weil wir aus Offenbach sind. Und da werden wir uns erstmal die Körbe einschlagen, bisvor dem einen Planet nicht mehr viel lubriert ist. Weil das, das können wir.Oh, ich hab letzte Woche auch Dark Matter kontrolliert.Die Type-2-Zivilisation könnte bereits die Menschheit zu primitiv sein, um sogar zu reden.Eine Type-3-Zivilisation könnte sich so fühlen, als würden wir die Bakterien auf derAnteile leben. Vielleicht würden sie uns nicht sogar bewusst sein oder unsere Survival relevant sein.Wir könnten nur hoffen, dass sie gute Götter sind. Aber die Skala endet nicht unbedingt hier.Einige Wissenschaftler suggerieren, dass es Type-4- und Type-5-Zivilisationen gibt,die Influenzen über Galaxie- oder Super-Klustern streicheln.Strukturen mit Tausenden Galaxien und Trillionen Star.Endlich könnte es eine Type-Omega-Zivilisation sein, die das ganze Universum und möglicherweiseandere manipulieren kann. Type-Omega-Zivilisationen... Type-Omega jetzt übertreiben, ist es aber.Omega null....können eigentlich die Kreaturen unseres Universums sein,für Gründe über unsere Verständnis. Vielleicht waren sie einfach bunt. So flott wie dieseKlassifikation könnte es sein, ist dieses Gedanke-Experiment uns bereits interessante Dinge zu erzählen.Wenn unsere Ideen über die Natur der Spezies, die Interstellar-Zivilisationen sind,irgendwie korrekt sind, dann können wir ziemlich sicher sein, dass es keineZivilisationen von Type-3 und mehr neben der Milky Way sind.Die Influenzen würden in aller Wahrheit so allaufregend sein und ihre Technologie so weitüber unseren eigenen... Ja, okay, das zum Glück nicht.Die Galaxie sollte mit ihrer Aktivität in tausenden Star-Systemen flaschen.Wir sollten sehen oder entdecken ihre Artifaktien oder Bewegungen zwischen verschiedenenTeilen ihres Empires sehen. Obwohl eine Type-3-Zivilisation in der Vergangenheit existiertund ein mysteriöses Tod ermordet, sollten wir einiges der Remanenzen ihres Empires entdecken können.Aber als Wissenschaftler sahen, fanden sie keine Remanenzen von gebrannten Stars,zerstörenden Megastrukturen oder Schmerzen von großen Interstellar-Wars.Also sind sie sehr wahrscheinlich nicht da draußen und nie waren sie.In einem Sinne ist das sehr traurig, aber auch sehr erheblich.Es lässt die Galaxie uns und andere ähnlich zu uns.Also, die am meisten erheblichen Zivilisationen zu suchen,sind vielleicht irgendwo im Spektrum von Type-1.5 bis Type-2.5.Sie würden nicht zu vorausgehen, um sie zu verstehen und ihre Motiven.Vielleicht haben sie ihre ersten Megastrukturen beendet.Und sie könnten in dem Prozess von Bewegungen zwischen Stars undTransmissionen von enormen Mengen von Informationen in den Raum,aus Unwahrheit oder auf Zweck.Sie würden wahrscheinlich auch zu den Stars suchen und für andere suchen.Dann noch einmal, vielleicht haben wir es alles falsch.Vielleicht gibt es einen Prozess zu Type-2, der nicht zuvielführend ist und die Menschheitist immer noch zu unbekannte, um es anders zu vorstellen.Für jetzt wissen wir wirklich, dass wir noch nie jemanden gesehen haben.Aber wir haben nur angefangen zu schauen.Bis wir endlich freundliche Super-Aliens finden und sie fragen,um die Regeln unseres Universums zu erklären, müssen wir die meisten von uns beobachten.Das erste, was ich mir angucken würde, ist das Alien-Pornhub und gucken, was da so abgeht.Zeig mir dein Pornhub und ich weiß, wer du bist.Da weißt du sofort Bescheid.Da weißt du gleich, mit wem du es da zu tun hast.Du musst gar keine langen Analysen machen, du musst einfach nur den Alien-Internet-Verlaufauswerten und dann weißt du, was du da am Start hast.So, Leute, ich geh jetzt was zu essen machen, ich hab Hunger.Was gibt's wahrscheinlich? Spaghetti.Wahrscheinlich Spaghetti ohne großartigen Kram dabei.Gucken.Also bis denn, wir sehen uns, ich hab Hunger.Macht's gut, see you.", "segments": [{"id": 1, "start": 0.0, "end": 5.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 2, "start": 30.0, "end": 35.0, "text": "Das war's für heute, bis zum nächsten Mal."}, {"id": 3, "start": 60.0, "end": 65.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 4, "start": 90.0, "end": 92.0, "text": "Das ist doch nicht normal."}, {"id": 5, "start": 97.0, "end": 102.0, "text": "Das ist eigentlich aus dieser einen Seite geworden, die ich in meinem Terminal verwendet habe für Wetterbericht."}, {"id": 6, "start": 103.0, "end": 105.0, "text": "Gibt's das noch?"}, {"id": 7, "start": 107.0, "end": 108.0, "text": "Ja."}, {"id": 8, "start": 110.0, "end": 113.0, "text": "Alsnau Unterfranken, nicht so ganz."}, {"id": 9, "start": 114.0, "end": 117.0, "text": "Aber das ist die passende Hacker-Wetteransicht hier."}, {"id": 10, "start": 117.0, "end": 122.0, "text": "Also ich meine, wenn ich die Auswahl habe zwischen dem und dem, dann ist das halt auch die eindeutige, die bessere Wetteransicht, oder?"}, {"id": 11, "start": 123.0, "end": 125.0, "text": "Moin, Patrick, du bist aber früher am Start."}, {"id": 12, "start": 127.0, "end": 129.0, "text": "Weiß nicht mehr, wie man hier..."}, {"id": 13, "start": 129.0, "end": 131.0, "text": "Wie konnte man das angehen? Genau."}, {"id": 14, "start": 133.0, "end": 137.0, "text": "Guck mal, wenn der Wetterbericht schon keine Ahnung hat, wie warm es wirklich ist, 23 bis 30."}, {"id": 15, "start": 137.0, "end": 146.0, "text": "Ich weiß es nicht. Ja, doch, aktuell 23."}, {"id": 16, "start": 147.0, "end": 152.0, "text": "Oh, guck mal, heut Abend. Nee, ach nee, morgen. Morgen Abend ist das. Morgen Abend regnet's sogar mal."}, {"id": 17, "start": 152.0, "end": 164.0, "text": "Keck weh, erstes Service. Ja, da muss ich mir erstmal genau überlegen, was ich mache."}, {"id": 18, "start": 168.0, "end": 173.0, "text": "Ja, es ist echt warm. Huge, massive Temperatures."}, {"id": 19, "start": 173.0, "end": 179.0, "text": "Was ist denn... Ist das Vorhersage?"}, {"id": 20, "start": 180.0, "end": 186.0, "text": "Oder was ist... Ich kann das nicht aussprechen."}, {"id": 21, "start": 188.0, "end": 198.0, "text": "Is das Vorhersage? Nee, das ist... Was ist das? Regenwahrscheinlichkeit? Regenwahrscheinlichkeit?"}, {"id": 22, "start": 198.0, "end": 200.0, "text": "Regenwahrscheinlichkeit?"}, {"id": 23, "start": 202.0, "end": 205.0, "text": "Okay, jetzt muss ich mal kurz gucken, was ist..."}, {"id": 24, "start": 208.0, "end": 212.0, "text": "Okay, was heißt das auf Deutsch? Deutsch? Deutsch."}, {"id": 25, "start": 213.0, "end": 217.0, "text": "Niederschlag. Ah, okay, also ist es wirklich Regenwahrscheinlichkeit, verstehe."}, {"id": 26, "start": 218.0, "end": 222.0, "text": "Regenwahrscheinlichkeit. Da ist es ja deswegen viel besser, wenn man so eine Vorschau verwendet."}, {"id": 27, "start": 222.0, "end": 227.0, "text": "Excellent. Das sieht auch mit Darkreader und ohne Darkreader exakt gleich aus."}, {"id": 28, "start": 229.0, "end": 236.0, "text": "Viel bessere Ansicht und die beste Ansicht ist immer noch, man kann das wunderbar sogar im Terminal verwenden."}, {"id": 29, "start": 236.0, "end": 248.0, "text": "Ah, wenn man das hier nämlich ins Terminal reinpastet."}, {"id": 30, "start": 253.0, "end": 258.0, "text": "Bäm. Bessere Wetteransicht geht nicht hier. Porgas."}, {"id": 31, "start": 259.0, "end": 263.0, "text": "Achso, ja, LS geht nicht, LS geht nicht, minus R geht."}, {"id": 32, "start": 263.0, "end": 268.0, "text": "So muss die... So muss eine Wettervorschau aussehen."}, {"id": 33, "start": 269.0, "end": 271.0, "text": "Excellent."}, {"id": 34, "start": 280.0, "end": 283.0, "text": "Ah, Leute, ich bin gerade aufgestanden. Ich habe heute Nacht nicht wirklich gut gepennt."}, {"id": 35, "start": 284.0, "end": 287.0, "text": "Ich habe zwar eine Klimaanlage, aber ich kann die nicht die ganze Nacht überlaufen lassen."}, {"id": 36, "start": 287.0, "end": 292.0, "text": "Da kann ich nicht pennen bei und ohne Klimaanlage ist es zu warm. Ist auch kacke."}, {"id": 37, "start": 294.0, "end": 301.0, "text": "Komm in meine WhatsApp-Kuppe Növerro. Was ist das für eine komische Werbung?"}, {"id": 38, "start": 306.0, "end": 308.0, "text": "Ah, ich sehe es."}, {"id": 39, "start": 308.0, "end": 315.0, "text": "Das ist ja geil. Wartet mal."}, {"id": 40, "start": 322.0, "end": 325.0, "text": "Das glaube ich jetzt nicht. Jetzt machen die den Scheiß schon."}, {"id": 41, "start": 326.0, "end": 328.0, "text": "Es reicht nicht mehr, wenn du auf Facebook irgendeine Werbung machst."}, {"id": 42, "start": 329.0, "end": 333.0, "text": "Oder ist das Photoshopped? Das ist Photoshopped, oder?"}, {"id": 43, "start": 333.0, "end": 342.0, "text": "Ist das real? Wird der Chat heute ignoriert? Nee."}, {"id": 44, "start": 342.0, "end": 363.0, "text": "Vielleicht, weiß ich noch nicht. Kommt heute mal, was der Chat so macht. Ist das Photoshopped?"}, {"id": 45, "start": 363.0, "end": 371.0, "text": "Das sieht man rechts. Hier ist rein Photoshopped."}, {"id": 46, "start": 373.0, "end": 380.0, "text": "Ja, das ist rein Photoshopped. Aber AWK erst mal am Start."}, {"id": 47, "start": 380.0, "end": 391.0, "text": "Aber ich würde mich fast schon nicht mehr wundern, wenn es so etwas gäbe."}, {"id": 48, "start": 399.0, "end": 402.0, "text": "Klebefehler in der Mitte."}, {"id": 49, "start": 402.0, "end": 410.0, "text": "Aber wie dem auch sei, ich kann mir das durchaus vorstellen, dass so ein Chat mittlerweile auf einer Anzeige steht."}, {"id": 50, "start": 411.0, "end": 419.0, "text": "Auch wenn es irgendwie ein bisschen Photoshopped aussieht. Aber ich kann es mir gut vorstellen, dass es irgendwo auf der Welt sowas gibt."}, {"id": 51, "start": 420.0, "end": 426.0, "text": "Es reicht halt nicht mehr, wenn du komische Facebook-Werbung machst. Nein, du musst jetzt mittlerweile auch schon die Leute dazu bringen."}, {"id": 52, "start": 426.0, "end": 439.0, "text": "Findet ihr nicht auch, dass Leute, die wirklich richtig erfolgreich sind und einen richtig krassen Lifestyle leben, dass die das notwendig haben, sowas zu posten?"}, {"id": 53, "start": 440.0, "end": 445.0, "text": "Ich finde es toll, dass die Leute so nett sind und das posten."}, {"id": 54, "start": 445.0, "end": 455.0, "text": "Wenn ich so krass erfolgreich bin und so krass einen Lifestyle mache, ich könnte es ja auch einfach für mich behalten."}, {"id": 55, "start": 456.0, "end": 461.0, "text": "Sind die Leute nicht extrem nett, dass sie das der Welt mitteilen?"}, {"id": 56, "start": 462.0, "end": 465.0, "text": "Das sind alles richtig gute Leute."}, {"id": 57, "start": 465.0, "end": 474.0, "text": "Aber ernsthaft, ich frage mich bei dieser ganzen Geschichte, diese Scams in dieser Richtung, die sind ja schon uralt."}, {"id": 58, "start": 475.0, "end": 482.0, "text": "Gab es ja mehr oder weniger schon immer. Jetzt vielleicht nicht mit WhatsApp-Gruppe oder irgendwie sonst was in der Richtung."}, {"id": 59, "start": 483.0, "end": 488.0, "text": "Aber es gab auch schon früher genug Leute, die dir quasi Scheiße für Gold verkaufen wollten."}, {"id": 60, "start": 488.0, "end": 497.0, "text": "Was ich mich aber schon seit Aufkommen dieser WhatsApp-Gruppen und wie du erfolgreich Geschichten wirst frage, ist eine Sache."}, {"id": 61, "start": 498.0, "end": 509.0, "text": "Und zwar, was haben die Leute eigentlich vorzuweisen, die diese Gruppen betreiben, dass das keiner hinterfragt?"}, {"id": 62, "start": 509.0, "end": 519.0, "text": "Guck mal, wenn ich irgendwie mir einen geilen Guru suche, der mir erklärt, wie ich erfolgreich werde und jetzt übelst krass Bitches-Money-Investment-Lifestyle mache."}, {"id": 63, "start": 520.0, "end": 528.0, "text": "Bevor ich mir da irgendwie den Ober-Guru raussuche, gucke ich doch erstmal, was hat der Typ schon gemacht?"}, {"id": 64, "start": 529.0, "end": 532.0, "text": "Und die meisten davon haben außer Scam-Scheiße nichts gemacht."}, {"id": 65, "start": 532.0, "end": 544.0, "text": "Wenn es jetzt irgendwie der, keine Ahnung, irgend einer wäre, der 10-15 Jahre lang erfolgreich irgendwas aufgebaut hat und dir jetzt erklärt, wie er das gemacht hat."}, {"id": 66, "start": 545.0, "end": 554.0, "text": "Okay, der hat wenigstens irgendwas vorzuweisen, aber die ganzen 0-15 Scammer-Typen, die irgendwie 22 sind, die haben ja noch nicht überhaupt irgendwie ansatzweise was vorzuweisen."}, {"id": 67, "start": 554.0, "end": 568.0, "text": "Und irgendwie juckt das keinen. Es reicht schon, wenn du mit einem fetten Auto reingefahren kommst und sagst, alter hier, komm in die Gruppe, 2000 Euro am Tag, easy money und alle springen drauf rein."}, {"id": 68, "start": 568.0, "end": 587.0, "text": "Wobei, alle ist zu viel gesagt, ein paar dämliche Leute fallen drauf rein und das reicht halt zum Geldverdienen aus."}, {"id": 69, "start": 587.0, "end": 601.0, "text": "Naja, was auch immer."}, {"id": 70, "start": 601.0, "end": 616.0, "text": "Ne, das verstehe ich nicht. Naja, wie dem aus sei. Was ist denn jetzt los?"}, {"id": 71, "start": 616.0, "end": 630.0, "text": "Es hat ja schon ein bisschen, hat ja schon ein bisschen abgenommen in letzter Zeit. Also, nachdem es erstmal geboomt ist, diese ganzen WhatsApp-Telegram-Gruppen, was auch immer, mittlerweile ist es ein bisschen weniger."}, {"id": 72, "start": 631.0, "end": 637.0, "text": "Aber ich gehe mal davon aus, nachdem, ich verfolge das ja nicht so, ich gehe mal davon aus, dass es nicht wirklich weniger geworden ist, sondern das Scam sich einfach geändert hat."}, {"id": 73, "start": 637.0, "end": 665.0, "text": "Der erste Frisur, ultra geil. Das ist uralt klep, aber ich finde den immer noch lustig."}, {"id": 74, "start": 665.0, "end": 680.0, "text": "Ich finde den immer noch geil. Richtig dumm, alter."}, {"id": 75, "start": 680.0, "end": 694.0, "text": "Na gut, also mit was fangen wir an zu gucken? Wir haben Sachen zur Auswahl. 10 Trips für Programmieranfänger. Ne, wir fangen wie immer an mit Battlefield Top Plays."}, {"id": 76, "start": 695.0, "end": 704.0, "text": "Danach gucken wir das. Oh, wir können auch das gucken. Warum das mobile Internet in Deutschland so schlecht ist?"}, {"id": 77, "start": 704.0, "end": 711.0, "text": "Wir gucken erstmal, wir gucken erstmal eine Runde Battlefield Top Plays. Dann gucken wir uns einfach um, dass mobile Internet in Deutschland so schlecht ist."}, {"id": 78, "start": 711.0, "end": 728.0, "text": "Alter, was hat der Typ für einen FOV? 170 oder was? Was ist das für ein FOV, Alter? Der kann ja quasi vom Spawn ins Spawn gucken."}, {"id": 79, "start": 728.0, "end": 741.0, "text": "By the way, der gleiche Typ, der die Videos immer macht, hat vorher ein Bild gepostet, weil ich mir gedacht, das können wir uns mal zusammen angucken."}, {"id": 80, "start": 741.0, "end": 761.0, "text": "Also natürlich ist das alles fake. Wenn man sich das aussuchen könnte, was möchte man haben? Und ganz ehrlich, bei mir ist das hier. Weiß ich, wie es bei euch aussieht?"}, {"id": 81, "start": 761.0, "end": 777.0, "text": "Bei mir ist das hier. Also Battlefield 0 mit Rüstung brauche ich ehrlich gesagt nicht. Zukunft Stels brauche ich auch nicht unbedingt. Vietnam Stels hatten wir schon oft genug. Ich wäre mal wieder für ein ganz normales Modern Warfare Setting."}, {"id": 82, "start": 777.0, "end": 797.0, "text": "Übrigens, und das hier könnte sogar die japanische Variante sein. Das heißt nicht Battlefield 0, sondern es heißt Battlefieldo. Battlefieldo! Das kann ich mir richtig vorstellen, wie das irgendwelche Anime Grills aussprechen. Battlefieldo!"}, {"id": 83, "start": 797.0, "end": 823.0, "text": "Aber das hier würde ich nehmen. Wobei ich ehrlich sagen muss, solange es nicht das hier unbedingt ist, die drei Sachen, die würde ich mir alle geben, wenn sie gut gemacht sind."}, {"id": 84, "start": 823.0, "end": 836.0, "text": "Aber wovor zuckt das hier? Battlefieldo, ja ja."}, {"id": 85, "start": 836.0, "end": 852.0, "text": "Wie viele Subs hat der Typ mittlerweile? Ich hätte gedacht mehr."}, {"id": 86, "start": 852.0, "end": 866.0, "text": "Okay, also wo sind wir stehen? Battlefield. Wo waren wir? Hier. Battlefield Top Plays."}, {"id": 87, "start": 866.0, "end": 881.0, "text": "Okay, der Typ wird erstmal wieder Hardcore geflammt, weil der Infanterie-Shotgun hinter uns spielt. Und die Gegner checken halt nichts, aber das ist ja schon der Klassiker."}, {"id": 88, "start": 881.0, "end": 896.0, "text": "Die Gegner sind wieder absolut Lowbrains."}, {"id": 89, "start": 896.0, "end": 918.0, "text": "Oh, hier richtig professionell mit Webcam am Start. Allerdings klappt der Green Screen nicht so richtig, ne?"}, {"id": 90, "start": 918.0, "end": 927.0, "text": "Oh, da wird er weggesprayt. Rex! Beste Pistol, Alter! Rex! Top!"}, {"id": 91, "start": 928.0, "end": 939.0, "text": "Jetzt wird er gemessert. Defi in Bob's. Alter, was ist? Sag mal, das ist doch gestellt. Das ist doch gestellt. So doof kannst du doch nicht sein."}, {"id": 92, "start": 939.0, "end": 955.0, "text": "Also so komplett hängen geblieben im Kopf kannst du doch gar nicht sein, als wie die Leute da. Das geht doch nicht. Das glaube ich, das glaube ich nicht."}, {"id": 93, "start": 955.0, "end": 972.0, "text": "Die sind ja richtig Lowbrain."}, {"id": 94, "start": 972.0, "end": 992.0, "text": "Moment, er ist Attacker? What the fuck? Er ist Attacker? Ich habe gedacht, er ist Defender. Was zum Teufel machen die Gegner denn da?"}, {"id": 95, "start": 992.0, "end": 1008.0, "text": "Warum stehen die Defender da? Das ergibt überhaupt keinen Sinn."}, {"id": 96, "start": 1008.0, "end": 1026.0, "text": "Normalerweise ist es eher so, du kommst hier gar nicht um die Ecke, weil dich schon 30 Gegner ab-aimen."}, {"id": 97, "start": 1026.0, "end": 1037.0, "text": "What the fuck? Alter, wo hat er die Gegner her? Auf den Server muss ich auch gleich mal connecten."}, {"id": 98, "start": 1038.0, "end": 1047.0, "text": "Aber es kommt immer mal wieder zwischendurch so Situationen vor. Aber die waren schon echt Lowbrain."}, {"id": 99, "start": 1047.0, "end": 1062.0, "text": "Erstmal schön, dass Smoke One-Hitted. Die sehen es gar nicht. Die sehen es nicht."}, {"id": 100, "start": 1062.0, "end": 1082.0, "text": "Ah, Metro, was sonst?"}, {"id": 101, "start": 1082.0, "end": 1094.0, "text": "Okay, die haben schon mal absolut keinen Bock sich überhaupt nur zu bewegen. Leute, was ist mit euch verkehrt?"}, {"id": 102, "start": 1094.0, "end": 1112.0, "text": "What the fuck? Richtig Monarch-S."}, {"id": 103, "start": 1112.0, "end": 1128.0, "text": "Ich meine, es ist schon ein geiler Clip. Aber so ultra-braindead Gegner wieder."}, {"id": 104, "start": 1128.0, "end": 1151.0, "text": "Aber die Kit wechselt zwischendurch den Kuh. In Bad Company 2 war es ja so, du konntest richtig gut spielen, wenn du wirklich alle 10 Sekunden je nach Gegner hast das Kit gewechselt."}, {"id": 105, "start": 1151.0, "end": 1164.0, "text": "Das ging richtig gut. Du konntest da die Kits aber auch teilweise 3 km weit aufnehmen und durch Wände wiederbeleben und sowas."}, {"id": 106, "start": 1164.0, "end": 1183.0, "text": "Exzellent. Alle mit Farben-Blind-Modus an. Guck mal Battlefield 4. Moment, es gibt Leute, die spielen Scrims in Battlefield 4? 2020?"}, {"id": 107, "start": 1183.0, "end": 1210.0, "text": "So was gibt es noch? Es gibt Competitive Battlefield 4 im Jahr 2020? Sachen gibt es."}, {"id": 108, "start": 1210.0, "end": 1224.0, "text": "Da wird ein 490 gegeiert. Aber das ist mal gut zu sehen, dass das auch Gegner sind, die nicht komplett braindead sind."}, {"id": 109, "start": 1224.0, "end": 1241.0, "text": "Stimmt, da konnte man sich ja lehnen, das vergesse ich immer. Aber es hat sich nicht gelohnt in dem Spiel."}, {"id": 110, "start": 1241.0, "end": 1253.0, "text": "Ich war es nicht so in Battlefield, dass du, wenn du dich um die Ecke gelehnt hast, mehr rausgeguckt hast, als wenn du um die Ecke gestrafed bist."}, {"id": 111, "start": 1253.0, "end": 1270.0, "text": "Echt jetzt? Chat sagt gerade tatsächlich gestern jemand Battlefield 4 Scrim kommentiert und gestreamt. Wirklich? Sowas gibt es noch?"}, {"id": 112, "start": 1270.0, "end": 1284.0, "text": "Ja, das ist ja auch keine Kunst. Firestorm spielt ja nur wirklich gar keiner. Firestorm haben sie verkackt. Hätten die Firestorm 3-2-Play gemacht, hätte das durchaus eine Chance gehabt."}, {"id": 113, "start": 1284.0, "end": 1299.0, "text": "Viele Sachen, die in Warzone am Start sind, z.B. das mit den Platten, gab es in Firestorm schon. Das hätte durchaus eine Chance gehabt, aber sie haben es verschissen."}, {"id": 114, "start": 1299.0, "end": 1318.0, "text": "Ich glaube auch, dass DICE da ein bisschen ähnliches Problem hat wie Blizzard, dass die so ein bisschen entkoppelt sind von der Welt. Also sprich das, was die machen und was die Welt gerne sich wünscht, sind unterschiedliche Paar Schuhe."}, {"id": 115, "start": 1318.0, "end": 1336.0, "text": "Battlefield 1, keine Ahnung. Endlich mal einer, der mit Gescheiter Bitrate aufnimmt. Das sieht wenigstens schon scharf aus."}, {"id": 116, "start": 1348.0, "end": 1376.0, "text": "Ich sehe noch nicht mal die Gegner. Ich sehe Pfeile. Wo war der? The fuck? Ich sehe nur Pfeile. Und da habe ich noch nicht mal einen Pfeil gesehen."}, {"id": 117, "start": 1376.0, "end": 1400.0, "text": "Da rennen sie aber schön rein."}, {"id": 118, "start": 1400.0, "end": 1408.0, "text": "Die werden aber gut zerstört gerade."}, {"id": 119, "start": 1409.0, "end": 1428.0, "text": "Oh, der ist aber oldschool. Der schreibt LOL. Wer schreibt denn noch LOL? LOL schreiben bloß noch die übertriebensten Boomer-Leute wie ich."}, {"id": 120, "start": 1428.0, "end": 1453.0, "text": "Ist das die Community Map? Ich bin da nicht so im Bilde, was Battlefield 4 Maps angeht. War das die Community Map?"}, {"id": 121, "start": 1453.0, "end": 1461.0, "text": "xD schreibt keiner mehr. Ja doch, gibt noch ein paar. Man sieht das ab und zu. Allerdings xD war schon immer doof."}, {"id": 122, "start": 1462.0, "end": 1474.0, "text": "Was noch viel dümmer ist, es gibt noch eine Sache um xD zu toppen. Das ist hier Xoxo. Das ist so richtig doof. Das ist wirklich massive doof."}, {"id": 123, "start": 1474.0, "end": 1494.0, "text": "xD geht ja noch, aber Xoxo ist das Allerschlimmste."}, {"id": 124, "start": 1494.0, "end": 1504.0, "text": "Das ist aber Heinrich, der ist der Beste. Man kann das natürlich noch kombinieren. Das ist angeblich irgendwas Arabisches oder so."}, {"id": 125, "start": 1504.0, "end": 1524.0, "text": "Das ist das Beste. Der hier. Das ist der Beste. Den mache ich auch immer."}, {"id": 126, "start": 1524.0, "end": 1552.0, "text": "Ja, natürlich. Das da. Das da sind so Anime-Girl-Augen. Das da. Das ist schon uralt."}, {"id": 127, "start": 1552.0, "end": 1557.0, "text": "Sehr gut. Jetzt wird geschnipsert."}, {"id": 128, "start": 1557.0, "end": 1561.0, "text": "Oh."}, {"id": 129, "start": 1571.0, "end": 1576.0, "text": "Massive. Huge."}, {"id": 130, "start": 1579.0, "end": 1584.0, "text": "Das könnte ein Clickbait Titel sein, oder?"}, {"id": 131, "start": 1584.0, "end": 1602.0, "text": "Das ist ein Clip, aber das ist ein Clip, der ist einfach nur sehr ähnlich zu einem anderen."}, {"id": 132, "start": 1602.0, "end": 1620.0, "text": "Aber wie sie sich alle in die Reihe gestellt haben, um Collateral zu werden."}, {"id": 133, "start": 1620.0, "end": 1631.0, "text": "Ja, und danach wird er erstmal von allen angeschrieben, was er von was auch immer sonst was treibt. Der wird auf jeden Fall geflamed danach."}, {"id": 134, "start": 1632.0, "end": 1645.0, "text": "Das sind alle Spots. Na ja, so sind sie halt, die 90% der Spieler. In fast allen Games. In fast allen Games, wo es keinen Skill-Based Matchmaking gibt."}, {"id": 135, "start": 1645.0, "end": 1652.0, "text": "In Skill-Based Matchmaking-Games sind 90% der Leute auch so, nur dass du nicht gematcht wirst dagegen."}, {"id": 136, "start": 1675.0, "end": 1692.0, "text": "So toll. Ganz ehrlich. Noshark Hennels ist nur so beliebt, weil das die einzige Map ist, die du so komplett Braindead spielen konntest. In der Release-Variante."}, {"id": 137, "start": 1692.0, "end": 1708.0, "text": "Ansonsten, es gibt die Close-Quarter-Maps, die teilweise viel besser waren, was TDM anbelangt. Aber Noshark Hennels war so richtig Spawnen, Braindead, rein TDM'en und gut ist in der Release-Variante."}, {"id": 138, "start": 1708.0, "end": 1722.0, "text": "Übrigens, der Typ schon wieder. Den hatten wir glaube ich sogar letztens im Streamer. Das war der, der die Leute geflamed hat, weil sie ihm den Panzer geklaut haben."}, {"id": 139, "start": 1722.0, "end": 1737.0, "text": "Ja, danke. Ist ja schon ein paar Tage her. Was ist das für eine Sprache?"}, {"id": 140, "start": 1737.0, "end": 1752.0, "text": "Was ist das für eine Sprache?"}, {"id": 141, "start": 1752.0, "end": 1766.0, "text": "Was für eine Reichweite. Guckt euch mal die Shotgun an."}, {"id": 142, "start": 1766.0, "end": 1781.0, "text": "Oh, da werden sie geschreckt. Da werden sie hardcore geschreckt."}, {"id": 143, "start": 1781.0, "end": 1796.0, "text": "Also Leute, ich muss euch sagen, es gibt ganz schön viel farbenblinde Spieler in Battlefield."}, {"id": 144, "start": 1796.0, "end": 1814.0, "text": "Ich würde fast sagen, 80% der Battlefield-Spieler sind farbenblind."}, {"id": 145, "start": 1814.0, "end": 1826.0, "text": "L85, das ist auch so ein Ding, wo ich maximal 5 Kills mit habe und dann einfach nur durch Pick-Up."}, {"id": 146, "start": 1827.0, "end": 1835.0, "text": "Das hat er aber schön gemacht. Die Gegner checken es halt nicht, dass er hochkommt, aber gut, die können ja auch nicht in alle Richtungen gucken."}, {"id": 147, "start": 1835.0, "end": 1853.0, "text": "Manchmal kannst du da schon gute, also günstige Gelegenheiten abpassen, gehören halt auch ein bisschen Glück zu, wann du da hochläufst, dass nicht gerade irgendwie das halbe Team in die Richtung guckt, wo du langläufst."}, {"id": 148, "start": 1853.0, "end": 1864.0, "text": "Excellent. Ja, könnt ihr euch noch dran erinnern, ich habe ja auch mal ein Battlefield-Top-Plays-Video gemacht."}, {"id": 149, "start": 1865.0, "end": 1870.0, "text": "Das war das letzte Video, was ich gemacht habe, war ein Battlefield-Top-Play-Video und das ist schon nur drei Monate her."}, {"id": 150, "start": 1871.0, "end": 1878.0, "text": "Stimmt, der Michael5-Spieler hat dafür gesorgt damals, das stimmt."}, {"id": 151, "start": 1878.0, "end": 1888.0, "text": "12 Minuten 50, High-Skill-Plays, ja, Wahnsinn. Ich habe eigentlich genug Material für ein zweites."}, {"id": 152, "start": 1889.0, "end": 1893.0, "text": "Ah, gut. So, was schauen wir uns als nächstes an?"}, {"id": 153, "start": 1894.0, "end": 1903.0, "text": "Warum das mobile Internet in Deutschland so scheiße ist? Nee, so schlecht ist, so schlecht ist. Das gucken wir uns jetzt an."}, {"id": 154, "start": 1903.0, "end": 1911.0, "text": "Also lass mal ein paar Vermutungen anstellen, bevor wir das Video gucken. Also warum ist das mobile Internet in Deutschland so schlecht?"}, {"id": 155, "start": 1912.0, "end": 1917.0, "text": "Erstens, weil irgendwie alle parallel ausbauen und irgendwie nicht synchronisiert ist."}, {"id": 156, "start": 1918.0, "end": 1927.0, "text": "Dann, weil wir mal wieder nicht auf flächendeckenden Ausbau setzen, sondern auf Hotspot-Geschichten."}, {"id": 157, "start": 1927.0, "end": 1939.0, "text": "Ähm, wahrscheinlich weil es keine gescheiten gesetzlichen Vorgaben gibt und das dürfte vielleicht das Hauptproblem sein."}, {"id": 158, "start": 1940.0, "end": 1945.0, "text": "So, schauen wir mal. Sowas in der Richtung wird es aber sein."}, {"id": 159, "start": 1946.0, "end": 1950.0, "text": "Die Durchschnittsgeschwindigkeit des deutschen mobilen Internets liegt im internationalen Vergleich auf..."}, {"id": 160, "start": 1951.0, "end": 1953.0, "text": "Der erinnert mich immer übelst an Willi Pete Casts Widersprüchen."}, {"id": 161, "start": 1953.0, "end": 1959.0, "text": "Die Durchschnittsgeschwindigkeit des deutschen mobilen Internets liegt im internationalen Vergleich auf Platz 14."}, {"id": 162, "start": 1960.0, "end": 1979.0, "text": "Direkt neben Jamaika. Direkt neben Jamaika, das ist... Okay, okay, okay. Nochmal so."}, {"id": 163, "start": 1979.0, "end": 1990.0, "text": "Nochmal so. Nur, dass ich das richtig verstehe. Wir liegen neben Trinidad and Tobago, Jamaika und über uns ist Portugal und Bahrain."}, {"id": 164, "start": 1991.0, "end": 1995.0, "text": "Wo zum Teufel liegt Bahrain?"}, {"id": 165, "start": 2000.0, "end": 2002.0, "text": "Wo ist das überhaupt?"}, {"id": 166, "start": 2002.0, "end": 2017.0, "text": "Ist das in Afrika? Ah. Irgendwo arabische Halbinsel oder so, ne? Nee, das ist Indien? Doch. Doch."}, {"id": 167, "start": 2018.0, "end": 2022.0, "text": "Irgendwo Arnelegebiet auf jeden Fall. Okay, alles klar."}, {"id": 168, "start": 2023.0, "end": 2027.0, "text": "Ich hab aber keine Ahnung bis eben gab, dass das überhaupt existiert, wenn ich ehrlich bin."}, {"id": 169, "start": 2027.0, "end": 2031.0, "text": "So, und die haben auf jeden Fall ähnlich gutes Internet wie wir."}, {"id": 170, "start": 2031.0, "end": 2053.0, "text": "Und hier kostet er was? 65 Euro pro Monat?"}, {"id": 171, "start": 2053.0, "end": 2067.0, "text": "60 Euro pro Monat. Bei der Telekom würden wir in Deutschland 83 Euro dafür zahlen."}, {"id": 172, "start": 2068.0, "end": 2071.0, "text": "Und jeder kennt es. In der Bahn, auf der Autobahn, manchmal auch. Ja, ich kenn's auch."}, {"id": 173, "start": 2072.0, "end": 2079.0, "text": "Zum Beispiel jeden Morgen, also wenn ich Zug fahre, ich fahre ja gerade keinen Zug, aber wenn ich Zug fahre jeden Morgen in Meintal,"}, {"id": 174, "start": 2079.0, "end": 2086.0, "text": "jeden Morgen in Meintal ist das Internet komplett weg kurz. So für, keine Ahnung, zwei Minuten."}, {"id": 175, "start": 2086.0, "end": 2115.0, "text": "Und es ist ja wirklich nicht am Arsch der Welt, es ist zwischen Frankfurt und Hanau."}, {"id": 176, "start": 2116.0, "end": 2127.0, "text": "Und wir sind schon so im Arsch, was das angeht, und selbst da machen sie jetzt rum, so nach dem Motto, sie wollen kein 5G, weil 5G-Strahlung und so."}, {"id": 177, "start": 2127.0, "end": 2137.0, "text": "Und weil gutes mobiles Internet für uns alle im Alltag immer wichtiger wird. Man will unterwegs produktiv sein, up-to-date bleiben, sicher bleiben, wissen, wann es regnet und wo man ist."}, {"id": 178, "start": 2137.0, "end": 2159.0, "text": "Ich möchte Twitch gucken unterwegs. Das ist eigentlich das Hauptsächliche. Twitch-Chat, Spam."}, {"id": 179, "start": 2159.0, "end": 2174.0, "text": "Was ist das denn für exzellent Musik im Hintergrund?"}, {"id": 180, "start": 2174.0, "end": 2189.0, "text": "Verbindet sich mein Handy mit dem Mast oder der Mast mit mir? Das ist die Frage."}, {"id": 181, "start": 2189.0, "end": 2203.0, "text": "2G ist aus dem letzten Jahrhundert und im Prinzip mobiles Internet ohne Internet. Die Geschwindigkeit reicht gerade so für WhatsApp, mehr aber auch nicht. 3G ist ebenfalls ziemlich alt, kann aber je nach Variante heute noch ausreichen."}, {"id": 182, "start": 2203.0, "end": 2218.0, "text": "Zumindest mit 3G kannst du halbwegs surfen, das ist kein Problem."}, {"id": 183, "start": 2218.0, "end": 2238.0, "text": "5G ist der Future Shit oder in den Worten der Telekom, das G in 5G steht für großartige Möglichkeiten. 5G ist viel schneller als 4G und pro Mast können sich viel mehr Geräte verbinden. Dadurch bietet 5G viele Möglichkeiten, zum Beispiel in der Automatisierung."}, {"id": 184, "start": 2238.0, "end": 2256.0, "text": "Aber die Reichweite ist nicht so hoch, du brauchst mehr Masten. Was nicht verkehrt wäre, dann brauchst du auch Smart Cities, Logistik, Smart Medizin und moderne Landwirtschaft. Aber auch für autonomes Fahren oder Virtual und Augmented Reality, Cloud Gaming und das Internet of Things."}, {"id": 185, "start": 2256.0, "end": 2270.0, "text": "Wenn ich so einen smarten Kühlschrank schon sehe, Leute. Der most useless Shit aller Zeiten. Smarter Kühlschrank, der nicht wirklich smart ist, sondern einfach nur ein fettes Tablet vorne dran hat."}, {"id": 186, "start": 2270.0, "end": 2289.0, "text": "Okay, wie ist denn der Stand in Deutschland? 0G ist bei uns. Aber in einigen Teilen Deutschlands hat man je nach Anbieter auch Mitte 2020 immer mal wieder einfach kein Netz. Dazu kommen zahlreiche Flecken, in denen man nur 2G empfängt."}, {"id": 187, "start": 2289.0, "end": 2302.0, "text": "In Deutschland gibt es nur 3 Anbieter mit einem eigenen Netz. Die Telekom, Vodafone und Telefonica. Dazu gehört O2. Die Telekom hat das beste Netz, die Telefonica das schlechteste. Alle anderen Anbieter leisten..."}, {"id": 188, "start": 2303.0, "end": 2306.0, "text": "Das war früher E+, oder? Ist das nicht E+, gewesen?"}, {"id": 189, "start": 2306.0, "end": 2319.0, "text": "Netze für eine Gebühr. Hätte man SIM-Karten aller 3 Anbieter, hätte man ziemlich konsequent mobiles Internet. Hat man aber leider nicht. Das alles wird besonders übel, wenn man sich schnell bewegt."}, {"id": 190, "start": 2319.0, "end": 2342.0, "text": "Ja, richtig. Das ist wirklich ätzend, ne? Auf dem Weg von mir zur Arbeit heim ist schon teilweise schlimm, aber wo es ganz ätzend war, ist Frankfurt, Berlin. Wo man ja eigentlich sagen will, das ist eine Strecke, die ziemlich häufig gefahren wird. Da hast du zwischendrin, du konntest doch nicht mal durchgängig Musik streamen. Das war echt lächerlich."}, {"id": 191, "start": 2342.0, "end": 2349.0, "text": "In deutschen Zügen kann man je nach Verbindung einfach nicht konsequent produktiv sein oder die neue Staffel krass Klassenfahrt durchballern."}, {"id": 192, "start": 2350.0, "end": 2351.0, "text": "Was für ein Ding?"}, {"id": 193, "start": 2351.0, "end": 2372.0, "text": "Schon. Es begann mit der Versteigerung von LTE-Funklizenzen im Jahr 2010. Hier mussten die Anbieter Geld an den Startzahlen, um bestimmte Funklizenzen zu ergattern. Die Betreiber wurden dafür nur verpflichtet, bis 2016 90% der Haushalte in Deutschland mit LTE zu versorgen. Beginnend mit den kleinsten Orten."}, {"id": 194, "start": 2372.0, "end": 2389.0, "text": "Damit gab es schon damals zwei Probleme. Erstmal mussten diese 90% nicht pro Betreiber erreicht werden, sondern insgesamt. Das hat dazu geführt, dass sich O2, jetzt Telefoniker, zum Beispiel einfach auf Ballungszentren gestürzt hat, nachdem Vodafone oder Telekom kleinere Orte versorgt hatten."}, {"id": 195, "start": 2389.0, "end": 2406.0, "text": "Außerdem ist die Orientierung nur an Haushalten zum Teil unlogisch. Mobiles Internet... Orientierung in Haushalten ist total beknackt. Das ist auch das, was wir mit Festnetzanschlüssen machen oder halt mit Festnetz, Kabel und sowas, dass es pro Haushalt gerechnet wird."}, {"id": 196, "start": 2406.0, "end": 2427.0, "text": "Das Problem ist aber, es gibt halt viele Flächen, gerade im Osten, wenn man da mal auf der Landkarte von dem Amt für Infrastruktur und Gedöns guckt, also Breitband Atlas, da in Deutschland guckt, wird man gerade im Osten viele Regionen sehen, wo halt auch Leute wohnen, aber es relativ großflächig verteilt ist."}, {"id": 197, "start": 2427.0, "end": 2439.0, "text": "Das heißt, bei 90% der Haushalten bist du relativ schnell, aber bei 90% Fläche bist du so gut wie nie."}, {"id": 198, "start": 2444.0, "end": 2448.0, "text": "Die Grafing in den Videos machen die doch aber nicht selber. Wer ist denn die?"}, {"id": 199, "start": 2448.0, "end": 2461.0, "text": "Was soll ich das wissen? Keine Ahnung. Wahrscheinlich haben die dafür Leute, die sowas für sich machen. Also wenn ich öfter so Info-Videos machen würde, würde ich mir auch Leute suchen, die für mich Grafiken basteln."}, {"id": 200, "start": 2461.0, "end": 2482.0, "text": "Mal da Internet von mal diesem, mal jenem Anbieter und nur da, wo Häuser stehen. Und so ward der deutsche Flickenteppich geboren. 2015 wurden die Auflagen bei einer neuen Auktion nachgebessert. Bis 2020 sollte jeder Anbieter 98% der Bevölkerung und alle Hauptverkehrswege mit 4G versorgen."}, {"id": 201, "start": 2482.0, "end": 2496.0, "text": "Da fehlen leider immer noch entspannte 1,7 Millionen Deutsche. Bei den Hauptverkehrswegen hat man den Betreibern ein schönes Hintertürchen gelassen. Soweit dies rechtlich und tatsächlich möglich ist. AKA, wenn's nicht geht, kein Problem."}, {"id": 202, "start": 2496.0, "end": 2511.0, "text": "Dann wäre da noch die Diensteanbieterverpflichtung. Das bedeutet, dass große Anbieter mit einem eigenen Netz dieses Netz kleineren Anbietern für eine entsprechende Gebühr zur Verfügung stellen müssen. Das gibt es bei 2G und bei 3G. Aber bis heute nicht bei LTE."}, {"id": 203, "start": 2511.0, "end": 2528.0, "text": "Das heißt, dass günstige Anbieter lange kaum LTE anbieten konnten. Das hat dazu geführt, dass LTE bei uns oft super teuer ist, weil es kaum Wettbewerb gibt. Kein Wunder, dass knapp die Hälfte der SIM-Karten in Deutschland auch 10 Jahre nach der ersten Auktion nicht LTE-fähig sind."}, {"id": 204, "start": 2528.0, "end": 2540.0, "text": "Die allermeisten dieser Nutzer hätten ein entsprechendes Smartphone. Aldi Talk hab ich für meine Mutter auch geholt. War das beste Angebot. Vor allem, du kannst sie jederzeit auch kündigen."}, {"id": 205, "start": 2540.0, "end": 2558.0, "text": "Und ich war ja überrascht, wie gut die Freischaltung ging. Du musst die Aldi Talk App installieren und dann verbindet die sich mit irgendeiner Hausfrau in Ungarn, die dann deinen Ausweis verifiziert."}, {"id": 206, "start": 2558.0, "end": 2572.0, "text": "Und so war die wettbewerbsbefreite Dreier-Oligarchie geboren. Man hätte die Mobilfunkunternehmen auch einfach verpflichten können, zum Beispiel an die 100% der Fläche Deutschlands abzudecken."}, {"id": 207, "start": 2572.0, "end": 2587.0, "text": "Gut, das wäre für die Unternehmen wirtschaftlich natürlich unaktiv. Ja, genau das. Und so müsste man das auch bei Festnetz-Sachen machen. Haushalte ist immer so ein Problem. Und gerade bei mobilem Internet ist Haushalte total beknackt."}, {"id": 208, "start": 2588.0, "end": 2595.0, "text": "Weil bei mobilem Internet interessiert dich ja zum Beispiel auch, wenn du mal irgendwo wandern bist, ob du Google Maps was nachgucken kannst."}, {"id": 209, "start": 2595.0, "end": 2608.0, "text": "Ein Mast irgendwo im Schwarzwald lohnt sich halt nicht. Was hätte man da nur tun können? Vielleicht unkomplizierte Subventionen, um etwaige unprofitable Gebiete trotzdem abzudecken?"}, {"id": 210, "start": 2608.0, "end": 2625.0, "text": "Vielleicht geteilte Masten für Betreiber in solchen Gebieten? Das, was man Ende 2019, 10 Jahre später, sowieso beschlossen hat? Man hat in Deutschland unfassbare 10 Jahre gebraucht, um die Unternehmen dazu gezwungen, Menschen in ländlichen Räumen vernünftig zu versorgen."}, {"id": 211, "start": 2626.0, "end": 2631.0, "text": "Das ist besonders bitter, wenn man bedenkt, dass die Telekom immer noch zu knapp einem Drittel dem Staat gehört."}, {"id": 212, "start": 2631.0, "end": 2643.0, "text": "Apropos, dasselbe Unternehmen hat jetzt eine Kampagne gestartet. Wir jagen Funklöcher. Kommunen können sich bewerben. Kriterium ist, dass man kein LTE hat. Und dann gibt es, Achtung, Gewinner."}, {"id": 213, "start": 2644.0, "end": 2653.0, "text": "Als Bürger kann man zeitgemäßes Internet bei einem Drittelstaatlichen Unternehmen gewinnen. Im Jahr 2020 ist das ein bisschen wie Wasserlöcher."}, {"id": 214, "start": 2653.0, "end": 2663.0, "text": "Das stimmt eigentlich. Da habe ich mir noch gar keine Gedanken drüber gemacht, aber da hat er recht. Und es muss nicht so sein. In Frankreich gibt es einen viel aggressiveren Wettbewerb."}, {"id": 215, "start": 2664.0, "end": 2681.0, "text": "Das funktioniert. In vielen Ländern funktioniert das. Wir kriegen es ja bei unserem normalen Internetausbau auch nicht hin. Alles, was irgendwie mit Technik und zukunftsfähigen Sachen zu tun hat, pennen wir seit 20 Jahren. Und das, was da ist und ganz gut funktioniert, geht immer weiter kaputt."}, {"id": 216, "start": 2681.0, "end": 2690.0, "text": "... billigen Anbietern dank Diensteanbieterverpflichtung. Die Durchschnittsgeschwindigkeiten sind dabei viel höher als in Deutschland. Das soll auch für 5G so weitergehen."}, {"id": 217, "start": 2691.0, "end": 2702.0, "text": "In der Schweiz ist Internet ein Teil der Grundversorgung und wird von der teilstaatlichen Swisscom übernommen. Auch die zwei privaten Wettbewerber der Swisscom wurden früh zu großen Investitionen in ihre Infrastruktur gebracht."}, {"id": 218, "start": 2702.0, "end": 2712.0, "text": "Heute hat man überall in der Schweiz wahnsinnig gutes mobiles Internet, selbst auf vielen Bergen und in langen Tunneln. 5G wird rasend schnell ausgebaut."}, {"id": 219, "start": 2713.0, "end": 2717.0, "text": "Jetzt kommt auch bei uns 5G. Eine Chance für Deutschland, sich als eines der reichsten..."}, {"id": 220, "start": 2717.0, "end": 2735.0, "text": "Und als das losging, haben bei uns ganz viele Leute rumgeheult nach dem Motto, oh nein, wir wollen kein 5G-Strahlung, besser erstmal 4G richtig ausbauen, was auch immer das eine mit dem anderen zu tun hat. In Deutschland sind halt dazu noch, dass das eh schon nicht richtig funktioniert, auch noch viel irgendwie so Anti-Technik."}, {"id": 221, "start": 2735.0, "end": 2752.0, "text": "...Länder der Welt endlich aus dem hinteren Mittelfeld nach vorne zu befördern. Die Telekom kann Stand heute bereits ca. 50% der deutschen Haushalte 5G anbieten. Die entsprechende Auktion für die 5G-Frequenzen ist im Juni letzten Jahres zu Ende gegangen."}, {"id": 222, "start": 2752.0, "end": 2764.0, "text": "Es gibt viele neue Auflagen, aber in der Autobahn-Slash-Haushaltsstrategie keine großen Veränderungen. Mit 1&1 gibt es einen neuen Wettbewerber, das ist gut. Leider gibt es wieder keine Dienste an..."}, {"id": 223, "start": 2765.0, "end": 2773.0, "text": "...der Verpflichtung, das ist schlecht. Nationales Roaming, also das Teilen von Masten in kritischen oder unprofitablen Gebieten, wird auch nicht Pflicht."}, {"id": 224, "start": 2773.0, "end": 2785.0, "text": "Der Glasfaserausbau wurde in Deutschland ja ganz krass verrissen, weil man für die Telekom viel zu lange auf Kupfer gesetzt hat. Mobilfunkmasten sind in Deutschland, genau wie unsere Häuser, kaum an Glasfaser angeschlossen."}, {"id": 225, "start": 2786.0, "end": 2790.0, "text": "Müssen sie aber zwangsläufig für 5G, zum Beispiel aufgrund der hohen Datenraten."}, {"id": 226, "start": 2791.0, "end": 2792.0, "text": "Mist aber auch."}, {"id": 227, "start": 2792.0, "end": 2802.0, "text": "Gleichzeitig nutzen viele Deutsche weiter nur das 3G-Netz, dem 3G-Netz... Das bleibt ja auch nichts anderes übrig....werden jetzt Frequenzen weggenommen, um sie für 4G und 5G zu nutzen."}, {"id": 228, "start": 2803.0, "end": 2813.0, "text": "Dadurch wird es auf Dauer langsamer. Das heißt, man wird ultimativ evtl. einfach gezwungen, sich einen teuren oder schlechten LTE-Vertrag zu kaufen, um nicht abgehängt zu werden."}, {"id": 229, "start": 2814.0, "end": 2819.0, "text": "Deutschland droht noch weiter zu einer digitalen Zweiklassengesellschaft zu werden. Langsam ist..."}, {"id": 230, "start": 2819.0, "end": 2822.0, "text": "Und nicht nur da sind wir eine Zweiklassengesellschaft."}, {"id": 231, "start": 2823.0, "end": 2826.0, "text": "Also ich finde, am offensichtlichen ist es, wenn ihr euch mal..."}, {"id": 232, "start": 2828.0, "end": 2829.0, "text": "Thema Hustensinn."}, {"id": 233, "start": 2830.0, "end": 2838.0, "text": "Lasst euch mal bei einem Arzt behandeln mit eurer gesetzlichen Karte und lasst euch mal behandeln mit ihr bezahlt selbst. Da liegen Welten dazwischen."}, {"id": 234, "start": 2838.0, "end": 2848.0, "text": "Krieges Internet auf dem Land und 5G in der Stadt. Gutes mobiles Internet für alle ist heute einfach essentiell und gehört zur Chancengleichheit in unserem Land."}, {"id": 235, "start": 2849.0, "end": 2859.0, "text": "Wir können Leute nicht einfach abhängen, ihnen moderne Produktivität im Bus auf dem Land verwehren. Vor allem können wir uns nicht noch mehr Fehlentscheidungen und schlecht gestellte Weichen erlauben."}, {"id": 236, "start": 2859.0, "end": 2868.0, "text": "Das Problem ist, dass genau das, er hat ja vollkommen recht, dass genau das seit 15 Jahren so die Standardsache ist, die immer erwähnt wird."}, {"id": 237, "start": 2869.0, "end": 2878.0, "text": "So nach dem Motto, wir können uns es nicht erlauben, weiter hier keinen Anschluss zu haben, wir können es nicht erlauben, weiterhin hier in diesem Bereich nichts zu machen, wir können uns nicht erlauben, weiter in dem Bereich..."}, {"id": 238, "start": 2879.0, "end": 2884.0, "text": "Aber anscheinend können wir das schon, weil ansonsten hätte es die letzten 15 Jahre was getan."}, {"id": 239, "start": 2884.0, "end": 2891.0, "text": "Und das Problem ist ja auch, wenn du einmal hinten dran bist, du holst dich ja nicht auf magische Art und Weise wieder auf."}, {"id": 240, "start": 2891.0, "end": 2914.0, "text": "Es ist eher so, wenn du nicht massiv versuchst aufzuholen, wirst du nicht nur hinten dran bleiben, sondern immer mehr hinten dran sein."}, {"id": 241, "start": 2915.0, "end": 2918.0, "text": "Das haben wir uns schon mal angeguckt, das war auch nicht schlecht."}, {"id": 242, "start": 2918.0, "end": 2927.0, "text": "Letztendlich ist es aber auch sowohl, was er hier erzählt, was mehr oder weniger alle wissen, was aber leider in Deutschland habe ich den Eindruck auch zu wenige interessiert."}, {"id": 243, "start": 2928.0, "end": 2945.0, "text": "Also, der 015 Benutzer hier in Deutschland, Internet, die sagen dann so, ja ab und zu mal gucke ich ein bisschen E-Mail und sowas und dann gucke ich mal ein bisschen YouTube und so, aber ansonsten ich brauche nicht mehr, ich mache doch eh kaum was."}, {"id": 244, "start": 2945.0, "end": 2962.0, "text": "Weil zu viele Boomer in der Politik das sagen haben."}, {"id": 245, "start": 2962.0, "end": 2980.0, "text": "Ja, ich kann mir auch nicht so hundertprozentig erklären, wie man das nicht mitbekommen kann in der Politik, unabhängig davon in welcher Partei du angehörst, so gewisse Sachen, wie zum Beispiel eben zukunftsfähige Internetausbau."}, {"id": 246, "start": 2980.0, "end": 2996.0, "text": "Es ist doch eigentlich scheißegal, ob du jetzt CDU, SPD, Grüne, AfD, Linke, was auch immer bist, es gibt doch so ein paar Themen, da können sich doch im Kopf eigentlich mal, da kann man doch eigentlich gar nicht dagegen sein, das zu machen."}, {"id": 247, "start": 2997.0, "end": 3007.0, "text": "Es gibt Themen, da kann man sich streiten, aber gerade was Zukunftsfähigkeit und Internetausbau angeht, das ist eigentlich kein Thema, wo man sich darüber streiten könnte, kann."}, {"id": 248, "start": 3007.0, "end": 3010.0, "text": "Kann man anscheinend schon, aber ich weiß nicht warum."}, {"id": 249, "start": 3011.0, "end": 3034.0, "text": "Und gerade deswegen kann ich es nicht nachvollziehen, weil egal wer an der Regierung ist, gerade internettechnisch, diese Weitsicht, diese die man dafür eigentlich noch nicht mal braucht, dass das wichtig ist, das sollte man eigentlich allen zutrauen."}, {"id": 250, "start": 3034.0, "end": 3061.0, "text": "So, was schauen wir dann als nächstes? Was haben wir denn sonst noch? MW2 Klassen, Diablo Clone in One Week? Was? Ok Leute, es ist heute so warm, ich muss mir jetzt den Schnee Maulwurf, was auch immer das ist, in Lego angucken."}, {"id": 251, "start": 3061.0, "end": 3087.0, "text": "Ah, yes. Und was, egal, man muss sich fragen, was man davon hat, weil man hat davon nichts, außer dass es cooles Lego-Stellzeugs ist."}, {"id": 252, "start": 3087.0, "end": 3094.0, "text": "Warming Up"}, {"id": 253, "start": 3095.0, "end": 3114.0, "text": "Guck mal hier, wie er da durchgeht. Wie nichts. Da war ziemlich weicher Schnee."}, {"id": 254, "start": 3114.0, "end": 3121.0, "text": "Guck mal, wie lang es das machen kann, bevor es kaputt geht."}, {"id": 255, "start": 3122.0, "end": 3131.0, "text": "Guck mal, wie stylish das sogar nach, guck mal, wie geil sich das drehen kann."}, {"id": 256, "start": 3131.0, "end": 3147.0, "text": "Pssst."}, {"id": 257, "start": 3147.0, "end": 3168.0, "text": "Gleich hat er sich unterm Haus durchgegraben, kam auf der anderen Seite von der Garage wieder raus."}, {"id": 258, "start": 3168.0, "end": 3189.0, "text": "Oh, er hat sich eingegrabt."}, {"id": 259, "start": 3189.0, "end": 3200.0, "text": "Guck mal hier, da geht er ab, da geht er steil."}, {"id": 260, "start": 3201.0, "end": 3208.0, "text": "Na gut, das wird nichts. Aber es ist eine coole Konstruktion."}, {"id": 261, "start": 3208.0, "end": 3228.0, "text": "So, ein bisschen Schnee muss sein jetzt. Nachdem ja gerade schon wieder, Moment, wie viel Grad ist? Schauen wir nochmal schnell. Nachdem ja gerade schon 29 Grad ist, muss also ein bisschen Schnee angucken."}, {"id": 262, "start": 3228.0, "end": 3243.0, "text": "Okay, kommen wir uns an. I made a Diablo clone in one week. Ich sag lieber Diablo. Die Amis sagen wir so Diablo. Ich kann das nicht aussprechen."}, {"id": 263, "start": 3243.0, "end": 3257.0, "text": "Wetter in der Kommandozeile, klar. Beste. Geht übrigens auch so, kannst du auch direkt den Browser angucken. Sieht genauso aus."}, {"id": 264, "start": 3257.0, "end": 3278.0, "text": "Diablo, genau Diablo. Was hältst du von meiner Theorie, dass die IT als Kollektiv irgendwann verlernt von Grund auf zu programmieren und dann die einzigen Leute, die nach der Apokalypse die IT wieder aufbauen können, Minecraft Redstone Engineers sind."}, {"id": 265, "start": 3278.0, "end": 3299.0, "text": "Ah, yes, das klingt plausibel. Wie? Ohne zu programmieren, gut, Unity Editor auf und zusammenklicken."}, {"id": 266, "start": 3299.0, "end": 3312.0, "text": "Unity Editor zusammenklicken. Einfach in Asset Store sich alles kaufen und im Editor zusammenklicken."}, {"id": 267, "start": 3312.0, "end": 3334.0, "text": "Oder Unreal. Und Unreal geht auch, Unreal Asset Store und zusammenklicken. Okay, okay, okay, also mal jetzt mal, Visual Scripting und ohne Single Line of Code, das kommt doch aufs Gleiche raus."}, {"id": 268, "start": 3334.0, "end": 3344.0, "text": "Ob ich jetzt zusammen, ob ich jetzt quasi Plöcke zusammenklicke mit Logik oder eine Zeile Programmcode macht auch überhaupt keinen Unterschied."}, {"id": 269, "start": 3345.0, "end": 3348.0, "text": "Wahrscheinlich ist es mit Programmcode nur deutlich simpler und schneller erledigt."}, {"id": 270, "start": 3348.0, "end": 3365.0, "text": "Ah, das C++. Sekunde Leute, ich muss den C++ Flame rausholen."}, {"id": 271, "start": 3365.0, "end": 3383.0, "text": "Ne, das ist die Schraub, das ist kein C++. Nein, das ist die Schraub, das ist kein C++. So schöne Lambda-Funktionen hat C++ gar nicht, wie die hier."}, {"id": 272, "start": 3383.0, "end": 3407.0, "text": "Man sieht nämlich gleich, es sieht gescheit aus, also kann kein C++ sein."}, {"id": 273, "start": 3407.0, "end": 3422.0, "text": "Okay, ich glaube, das kriege ich auch noch hin. So weit kriege ich es auch noch hin."}, {"id": 274, "start": 3422.0, "end": 3438.0, "text": "Okay, Lautstärke ist okay. Muss gerade noch mal, also. Okay, also hätte das genauso gut auch gleich programmieren können, anstatt das zusammenzuklicken."}, {"id": 275, "start": 3452.0, "end": 3477.0, "text": "Okay, er klickt den Kram im Editor zusammen, anstatt zu programmieren. Ja, okay, er hätte es auch programmieren können."}, {"id": 276, "start": 3477.0, "end": 3489.0, "text": "Jays fragt, sollte ich mir Sensoren DHT22 von Aliexpress bestellen, sind da viel billiger? Klar, wenn du die brauchst. DHT22 habe ich auch ein paar im Einsatz. Schade auf jeden Fall nicht ein paar zu haben."}, {"id": 277, "start": 3490.0, "end": 3497.0, "text": "Wobei ich ehrlich sagen muss, Temperatursensoren finde ich die hier besser."}, {"id": 278, "start": 3497.0, "end": 3518.0, "text": "B, B, M, B, B, M, E, ne, 28, genau, genau, genau, den meine ich. Ja, die finde ich besser."}, {"id": 279, "start": 3518.0, "end": 3534.0, "text": "Sowohl von den Libraries her, die es dafür gibt, als auch von der Genauigkeit. Weil ich hatte einen DHT11 oder DHT22 bei mir im Keller und der ist mit der hohen Luftfeuchtigkeit nicht klar gekommen. Der hat immer Müll angezeigt und der hier zeigt jetzt was Sinnvolles an."}, {"id": 280, "start": 3534.0, "end": 3554.0, "text": "Computation, ja, sehr nötig. Es gibt ein paar Staaten und Transitionen. Jede Transition kann von ein paar Inputen getriggert werden. Nachdem eine Basis-Animation eingeführt wurde, habe ich die Zeit."}, {"id": 281, "start": 3555.0, "end": 3561.0, "text": "Oh, es läuft. Wisst ihr, was man daran wieder richtig gut sieht? Genau, der Sensor kann auch Luftdruck, Luftfeuchtigkeit und Temperatur."}, {"id": 282, "start": 3561.0, "end": 3571.0, "text": "Was man daran richtig gut sieht ist, wie viel Arbeit ein aktueller Game-Editor, Engine-Game-Editor abnehmen kann."}, {"id": 283, "start": 3572.0, "end": 3588.0, "text": "Also wenn du einfach nur, wenn du eine Spiele-Idee hast und du möchtest gucken, ob die sich umsetzen lässt und sich gut spielen lässt, gibt es nichts besseres als Unity und Unreal oder vielleicht noch die ein oder andere. Ich kenne mich an dem Bereich nicht sonderlich gut aus."}, {"id": 284, "start": 3588.0, "end": 3609.0, "text": "Aber was einen riesen Akt überlegt mal, wie lange sowas dauern würde, allein schon sowas Publisches selbst zu machen. Allein schon ein System, wo du Animation laden kannst. Ich weiß nicht, was dort bei Models und Animationen so die Standardformate sind der üblichen Programme. Allein schon bis du das laden kannst, umsetzen kannst. Das dauert ewig, bis du sowas gebaut hast."}, {"id": 285, "start": 3609.0, "end": 3625.0, "text": "Und gerade deswegen können auch kleinere Teams mittlerweile sowas halbwegs auf die Reihe kriegen. Wir sind nicht mehr in Zeiten von Rollercoaster Tycoon, wo das ein Mann in Assembler selbst programmiert."}, {"id": 286, "start": 3625.0, "end": 3642.0, "text": "Ok, im Prinzip, anstatt zu programmieren, klickt er den ganzen Kram zusammen. Existentiale Modus."}, {"id": 287, "start": 3642.0, "end": 3670.0, "text": "Ok, im Prinzip, anstatt zu programmieren, klickt er den ganzen Kram zusammen. Existentiale Modus."}, {"id": 288, "start": 3670.0, "end": 3680.0, "text": "Das ist aber nicht so viel. Also wenn er in der Geschwindigkeit weitermacht, wird das aber nichts mit dem Diablo-Klon in einer Woche."}, {"id": 289, "start": 3681.0, "end": 3688.0, "text": "Quasi eine laufende Figur mit einer Kamera drüber. Das ist wahrscheinlich eine Sache, die ist in so einem Editor ziemlich simpel zu machen."}, {"id": 290, "start": 3688.0, "end": 3703.0, "text": "Das ist wahrscheinlich eine Sache, die ist in so einem Editor ziemlich simpel zu machen."}, {"id": 291, "start": 3703.0, "end": 3724.0, "text": "Das ist einfach. Einfach in den Asset Store und kaufen. Und dann auch Steam Greenlight hochladen."}, {"id": 292, "start": 3724.0, "end": 3739.0, "text": "Das ist einfach. Einfach in den Asset Store und kaufen. Und dann auch Steam Greenlight hochladen. Und dann auch Steam Greenlight hochladen."}, {"id": 293, "start": 3739.0, "end": 3754.0, "text": "Das ist einfach. Einfach in den Asset Store und kaufen. Und dann auch Steam Greenlight hochladen."}, {"id": 294, "start": 3754.0, "end": 3769.0, "text": "Das ist einfach. Einfach in den Asset Store und kaufen. Und dann auch Steam Greenlight hochladen. Und dann auch Steam Greenlight hochladen."}, {"id": 295, "start": 3769.0, "end": 3784.0, "text": "Und dann auch Steam Greenlight hochladen. Und dann auch Steam Greenlight hochladen. Und dann auch Steam Greenlight hochladen."}, {"id": 296, "start": 3784.0, "end": 3798.0, "text": "Oh!"}, {"id": 297, "start": 3798.0, "end": 3813.0, "text": "Ich finde das cool. Das soll er anlassen. Da passiert wenigstens was, wenn die Monster sterben."}, {"id": 298, "start": 3813.0, "end": 3828.0, "text": "Ich finde das cool. Das soll er anlassen. Da passiert wenigstens was, wenn die Monster sterben."}, {"id": 299, "start": 3828.0, "end": 3849.0, "text": "Ich finde das cool. Das soll er anlassen. Das soll er anlassen."}, {"id": 300, "start": 3849.0, "end": 3857.0, "text": "Mein nächster Tag begann mit mantle Miel RogerCast. Es sieht recht cool aus."}, {"id": 301, "start": 3858.0, "end": 3861.98, "text": "Ich habe einen Manhattan gewünscht aber es gibt gar keine neuen Sachen."}, {"id": 302, "start": 3862.98, "end": 3866.02, "text": "Ich werde diesen Problem dadurch erstellen nach einer neuen Impfe."}, {"id": 303, "start": 3867.02, "end": 3869.02, "text": "Aber ich brauche einige Icon für die Attackungen."}, {"id": 304, "start": 3869.02, "end": 3871.78, "text": "Asset Store, exzellent!"}, {"id": 305, "start": 3871.78, "end": 3879.74, "text": "Ne, Asset Store heißt bei Unity, bei Unreal heißt es der Unreal Engine Marketplace, ok."}, {"id": 306, "start": 3879.74, "end": 3896.58, "text": "Der sollte mit einem Baguette kämpfen, das wäre viel besser."}, {"id": 307, "start": 3896.58, "end": 3926.3, "text": "Es ist halt lustig, dass du quasi dir mehr oder"}, {"id": 308, "start": 3926.3, "end": 3930.7, "text": "weniger, wie man ja auch auf Steam sieht, dass du dir ziemlich easy ein Spiel aus dem"}, {"id": 309, "start": 3930.7, "end": 3935.46, "text": "Marketplace oder aus dem Asset Store zusammenklicken kannst, mit Basic Funktionen."}, {"id": 310, "start": 3935.46, "end": 3942.66, "text": "Das ist eine Sache von 2-3 Tagen, wie man hier sieht und von diesem Shit wird so viel"}, {"id": 311, "start": 3942.66, "end": 3948.7, "text": "mittlerweile rausgehauen, auch als Early Access und dann Gott und die Welt dabei versprochen,"}, {"id": 312, "start": 3948.7, "end": 3952.7, "text": "wie geil es noch wird und direkt nach Release haben sich das dann 5 Leute gekauft und dann"}, {"id": 313, "start": 3952.7, "end": 3953.86, "text": "wird nie weiterentwickelt dran."}, {"id": 314, "start": 3953.86, "end": 3960.78, "text": "Ich habe es nicht geschafft, für Single-Slot-Items zu arbeiten, ich habe es nicht geschafft,"}, {"id": 315, "start": 3960.78, "end": 3964.82, "text": "für Doppel-Slot-Items, wie Waffen, zu arbeiten."}, {"id": 316, "start": 3964.82, "end": 3970.5, "text": "Also habe ich von Anfang an Equipment-Slotten gegründet und viel Zeit damit verwendet."}, {"id": 317, "start": 3970.5, "end": 3973.7, "text": "Jedoch war ich sehr glücklich mit dem Ergebnis."}, {"id": 318, "start": 3973.7, "end": 3978.38, "text": "Das letzte, was ich am ersten Tag gemacht habe, war ein Widget für Attribute."}, {"id": 319, "start": 3978.38, "end": 3983.54, "text": "Es gibt drei Hauptattribute, Kraft, Dexterität und Intelligenz."}, {"id": 320, "start": 3983.54, "end": 3988.62, "text": "An diesem Punkt war ich wirklich müde, also habe ich mich am nächsten Tag beendet."}, {"id": 321, "start": 3988.62, "end": 3991.14, "text": "Ich habe meinen vierten Tag begonnen."}, {"id": 322, "start": 3991.14, "end": 3993.18, "text": "Die Items sehen nicht gut aus, ja?"}, {"id": 323, "start": 3993.18, "end": 3994.18, "text": "Das stimmt schon."}, {"id": 324, "start": 3994.18, "end": 3996.42, "text": "Aber müssen sie ja auch nicht für sowas."}, {"id": 325, "start": 3996.42, "end": 4002.46, "text": "Guckt ja mal in Steam an, es ist kein Greenlight mehr, die ganzen Early Access Games, die sehen"}, {"id": 326, "start": 4002.46, "end": 4003.46, "text": "auch schlechter aus."}, {"id": 327, "start": 4003.46, "end": 4005.46, "text": "Die Zänen sind eine Attribute-System."}, {"id": 328, "start": 4005.46, "end": 4009.14, "text": "Kraft sollte die Anzahl von Health Points und Schaden erhöhen."}, {"id": 329, "start": 4009.14, "end": 4014.9, "text": "Dexterität sollte die Anzahl von Schaden erhöhen, Bewegung und Geschwindigkeit erhöhen."}, {"id": 330, "start": 4014.9, "end": 4021.14, "text": "Intelligenz sollte die Anzahl von Mana Points erhöhen und auch Health und Mana Regeneration."}, {"id": 331, "start": 4021.14, "end": 4022.14, "text": "Und Schaden?"}, {"id": 332, "start": 4022.14, "end": 4025.98, "text": "Na ja, eigentlich erhöht der Schaden nur die Anzahl von Schaden."}, {"id": 333, "start": 4025.98, "end": 4028.78, "text": "Aber all das funktioniert nicht wirklich gerade jetzt."}, {"id": 334, "start": 4028.78, "end": 4030.58, "text": "Es gibt nur ein paar Tooltipps."}, {"id": 335, "start": 4030.58, "end": 4034.58, "text": "Hallo Max, hast du dir schon mal angeschaut, wie man mit dem Linux Kernel programmiert?"}, {"id": 336, "start": 4034.58, "end": 4035.58, "text": "Scheint gar nicht so schwer."}, {"id": 337, "start": 4035.58, "end": 4038.18, "text": "Was meinst du, mit dem Linux Kernel zu programmieren?"}, {"id": 338, "start": 4038.18, "end": 4042.02, "text": "Der sitzt ja nicht neben dir und tippt."}, {"id": 339, "start": 4042.02, "end": 4050.7, "text": "We're going to implement it a bit later and now I want to improve item system."}, {"id": 340, "start": 4050.7, "end": 4055.26, "text": "Firstly I've created a new enumeration for items rarity."}, {"id": 341, "start": 4055.26, "end": 4059.42, "text": "There will be common, rare, epic and legendary items."}, {"id": 342, "start": 4059.42, "end": 4062.02, "text": "Ah, noch nie gesehen, er ist noch nie gesehen."}, {"id": 343, "start": 4062.02, "end": 4065.42, "text": "I made yet another widget for item system."}, {"id": 344, "start": 4065.42, "end": 4066.42, "text": "Ach, Kernel-Module."}, {"id": 345, "start": 4066.42, "end": 4068.26, "text": "Nein, das hab ich mir noch nicht angeguckt."}, {"id": 346, "start": 4068.26, "end": 4069.26, "text": "Kernel-Module."}, {"id": 347, "start": 4069.26, "end": 4070.26, "text": "Nein, hab ich mir nicht angeguckt."}, {"id": 348, "start": 4070.26, "end": 4079.62, "text": "Now the player can see the name of the item, attributes that item gives and also rarity."}, {"id": 349, "start": 4079.62, "end": 4084.7, "text": "Items don't affect any attributes right now, so that is something we should do later."}, {"id": 350, "start": 4084.7, "end": 4090.62, "text": "And now I want to make items to be real physical objects in the world, so we can spawn them"}, {"id": 351, "start": 4090.62, "end": 4091.62, "text": "and pick them up."}, {"id": 352, "start": 4091.62, "end": 4092.62, "text": "I've added a..."}, {"id": 353, "start": 4092.62, "end": 4093.62, "text": "Spawn him."}, {"id": 354, "start": 4093.62, "end": 4101.86, "text": "Now we can spawn them in the world, but they are actually not interactable."}, {"id": 355, "start": 4101.86, "end": 4108.02, "text": "Also now items have their names displayed if a player holds control key or hover the cursor"}, {"id": 356, "start": 4108.02, "end": 4109.02, "text": "over an item."}, {"id": 357, "start": 4109.02, "end": 4111.02, "text": "After that I made a script..."}, {"id": 358, "start": 4111.02, "end": 4114.42, "text": "Also ich glaube, es wäre doch einfacher gewesen, den Kram zu programmieren, anstatt"}, {"id": 359, "start": 4114.42, "end": 4116.18, "text": "dem hier im Editor zusammenzuklicken."}, {"id": 360, "start": 4116.18, "end": 4119.26, "text": "...possible to pick up items."}, {"id": 361, "start": 4119.26, "end": 4127.14, "text": "I thought that it doesn't work, but it actually does."}, {"id": 362, "start": 4127.14, "end": 4132.7, "text": "We need to hide collected items, but I fixed it with a simple script and now it works"}, {"id": 363, "start": 4132.7, "end": 4135.7, "text": "like a charm."}, {"id": 364, "start": 4135.7, "end": 4140.42, "text": "Another thing I've added was a special item for gold."}, {"id": 365, "start": 4140.42, "end": 4144.9, "text": "Player will receive gold if he is near enough."}, {"id": 366, "start": 4144.9, "end": 4150.46, "text": "Previously I implemented a bunch of functions to manipulate players' attributes, and items"}, {"id": 367, "start": 4150.46, "end": 4152.42, "text": "now actually affect them."}, {"id": 368, "start": 4152.42, "end": 4154.1, "text": "Spielst du noch Harvest League?"}, {"id": 369, "start": 4154.1, "end": 4155.1, "text": "Äh, ja."}, {"id": 370, "start": 4155.1, "end": 4159.26, "text": "Letzte Woche war ich krank, habe ich nicht gespielt, da hatte ich andere Probleme."}, {"id": 371, "start": 4159.26, "end": 4164.94, "text": "Bei mir ist es immer so, wenn ich eine Woche nicht gespielt habe, vergeht mir die Lust,"}, {"id": 372, "start": 4164.94, "end": 4168.42, "text": "mich wieder reinzufinden, aber ich spiele weiter."}, {"id": 373, "start": 4168.42, "end": 4175.98, "text": "PoE hat doch eine eigene Engine, die haben PoE komplett from scratch, wie man so schön"}, {"id": 374, "start": 4175.98, "end": 4176.98, "text": "sagt, gebastelt."}, {"id": 375, "start": 4176.98, "end": 4180.46, "text": "Ob sie das heute noch machen würden, weiß ich nicht."}, {"id": 376, "start": 4180.46, "end": 4185.46, "text": "Man darf nicht vergessen, PoE ist an, ich glaube, 2012 entstanden, oder noch früher."}, {"id": 377, "start": 4185.46, "end": 4189.34, "text": "Ob sie das heute wieder machen würden, weiß ich nicht, wahrscheinlich nicht."}, {"id": 378, "start": 4189.34, "end": 4218.66, "text": "Das sieht tatsächlich ganz gut aus, aber das ist halt auch ein gutes Model, was von Leuten"}, {"id": 379, "start": 4218.66, "end": 4222.82, "text": "erstellt wurde, die wissen, wie es geht."}, {"id": 380, "start": 4222.82, "end": 4236.18, "text": "Das sieht besser aus, als 80% das Team Greenlight, ihr wisst, Early Access, Gedulds, Games."}, {"id": 381, "start": 4236.18, "end": 4239.62, "text": "Und er soll sich mal an den Boden kümmern, ich gehe mal davon aus, er geht in den Assets"}, {"id": 382, "start": 4239.62, "end": 4241.1, "text": "Store und kauft sich einfach eine Map."}, {"id": 383, "start": 4241.1, "end": 4260.7, "text": "Kannst"}, {"id": 384, "start": 4260.7, "end": 4261.7, "text": "sogar skillen."}, {"id": 385, "start": 4261.7, "end": 4262.7, "text": "Poggers."}, {"id": 386, "start": 4262.7, "end": 4271.34, "text": "Und natürlich kann ein Spieler auf den Boden kümmern, es war ein wirklich produktiver"}, {"id": 387, "start": 4271.34, "end": 4272.34, "text": "Tag, also los geht's."}, {"id": 388, "start": 4272.34, "end": 4278.26, "text": "Ich erinnere mich, dass Abilitäten nichts tun, also habe ich zwölf Abilitäten für zwei"}, {"id": 389, "start": 4278.26, "end": 4279.26, "text": "Klassen gearbeitet."}, {"id": 390, "start": 4279.26, "end": 4280.62, "text": "Warrior und Mage."}, {"id": 391, "start": 4280.62, "end": 4282.9, "text": "Ich habe einmal mit Warriors angefangen."}, {"id": 392, "start": 4282.9, "end": 4286.5, "text": "Der erste sollte jeden Gegner vor dem Spieler schießen."}, {"id": 393, "start": 4286.5, "end": 4291.5, "text": "Es war nicht wirklich schwer zu implementieren, weil ich bereits eine abstrakte Abilität-Klasse"}, {"id": 394, "start": 4291.5, "end": 4292.5, "text": "hatte."}, {"id": 395, "start": 4292.5, "end": 4300.82, "text": "Der Akzent von ihm hört sich irgendwie so ein bisschen, ähm, gekomretmäßig an."}, {"id": 396, "start": 4300.82, "end": 4326.5, "text": "Und du musst gucken, dass die Firewall auch die Verbindung zulässt auf den Router."}, {"id": 397, "start": 4326.5, "end": 4331.06, "text": "Sturm."}, {"id": 398, "start": 4331.06, "end": 4340.02, "text": "Richtig big brain Abilities."}, {"id": 399, "start": 4340.02, "end": 4356.94, "text": "Der Chuck, neun Monate, Dankeschön."}, {"id": 400, "start": 4356.94, "end": 4365.74, "text": "Jo, danke, das ist schon ein paar Tage her."}, {"id": 401, "start": 4365.74, "end": 4377.94, "text": "Ähm, ja dann würde ich, also wenn das Web-Interface gar nicht mehr abkommt, dann würde ich auch"}, {"id": 402, "start": 4377.94, "end": 4378.94, "text": "mal resetten."}, {"id": 403, "start": 4378.94, "end": 4381.46, "text": "Oder Reset sollte eigentlich immer funktionieren."}, {"id": 404, "start": 4381.46, "end": 4389.46, "text": "Stöpsel dich aber, zum ausprobieren, stöpsel dich mal an Port, ähm, an Port Null."}, {"id": 405, "start": 4389.46, "end": 4397.74, "text": "Ich glaube da gibt es unterschiedliche Regelungen, was denn die Fault Port ist, ähm, und ansonsten"}, {"id": 406, "start": 4397.74, "end": 4400.1, "text": "mit Windbox kannst du es auch ausprobieren, ja."}, {"id": 407, "start": 4400.1, "end": 4403.94, "text": "Aber wenn es gar nicht mehr funktioniert, ist es schon sehr merkwürdig."}, {"id": 408, "start": 4403.94, "end": 4421.42, "text": "Boah, sag doch einfach Asset Store Map kaufen, wozu Map selber machen."}, {"id": 409, "start": 4421.42, "end": 4431.18, "text": "Das, das Schlimme ist, das sieht wirklich besser aus, wie 90% der Early Access Games"}, {"id": 410, "start": 4431.18, "end": 4435.62, "text": "auf Steam."}, {"id": 411, "start": 4435.62, "end": 4453.34, "text": "Das ist auch noch kostenlos."}, {"id": 412, "start": 4453.34, "end": 4468.98, "text": "Und ja, es könnte echt ein Diablo 3 Map sein, huge NPCs."}, {"id": 413, "start": 4468.98, "end": 4493.58, "text": "Ja, so sieht es aus, Chet, der Chet hier ist der Beste, jetzt kannst du ja Chet mal selber"}, {"id": 414, "start": 4493.58, "end": 4494.58, "text": "loben."}, {"id": 415, "start": 4494.58, "end": 4518.3, "text": "Ne, Choose My Name ist ja nix mitgemacht."}, {"id": 416, "start": 4518.3, "end": 4524.5, "text": "Das ist, das, das sieht wirklich besser aus, als 90% der Greenlight Games."}, {"id": 417, "start": 4524.5, "end": 4534.18, "text": "Obwohl es im Endeffekt halt einfach nur Simples Asset Zusammentracken und Droppen ist und"}, {"id": 418, "start": 4534.18, "end": 4537.74, "text": "natürlich die Logik dahinter, ja, die jetzt aber nicht allzu komplex sein dürfte."}, {"id": 419, "start": 4537.74, "end": 4542.66, "text": "Ich muss mal sagen, der Unreal Editor sieht mega hässlich aus."}, {"id": 420, "start": 4542.66, "end": 4550.54, "text": "Das sieht aus wie irgendeinen, boah, keine Ahnung, mir fällt aber gar kein Vergleich"}, {"id": 421, "start": 4550.54, "end": 4551.54, "text": "ein."}, {"id": 422, "start": 4551.54, "end": 4555.7, "text": "Random zusammen angeordnete Buttons."}, {"id": 423, "start": 4555.7, "end": 4566.78, "text": "Sorsioi, ein bisschen, ja, aber sogar Plender sieht mittlerweile ganz gut aus."}, {"id": 424, "start": 4566.78, "end": 4575.38, "text": "Die sollten sich mal Eikens aus ihrem eigenen Store kaufen."}, {"id": 425, "start": 4575.38, "end": 4601.02, "text": "Oh, das sieht nicht gut aus, Hits, it never hits, alles, alles Assets da, ja, ja, ja,"}, {"id": 426, "start": 4601.02, "end": 4602.02, "text": "ja."}, {"id": 427, "start": 4602.02, "end": 4620.38, "text": "Okay, der"}, {"id": 428, "start": 4620.38, "end": 4635.74, "text": "Also ich sage es jetzt zum 15 Mal, der hätte das doch selbst programmieren können anstatt"}, {"id": 429, "start": 4635.74, "end": 4639.74, "text": "hier zusammen zu klicken, weil im Prinzip nichts anderes ist."}, {"id": 430, "start": 4639.74, "end": 4653.42, "text": "Es könnte wirklich in die Upload 3 Dungeon sein."}, {"id": 431, "start": 4669.74, "end": 4685.1, "text": "Ja und jetzt Release Steam Early Access und dann nie wieder was dran machen."}, {"id": 432, "start": 4685.1, "end": 4699.62, "text": "Coolen Trailer mit 0850 Epic Music erstellen?"}, {"id": 433, "start": 4699.62, "end": 4700.62, "text": "Choose my name?"}, {"id": 434, "start": 4700.62, "end": 4705.62, "text": "Nein, gar nicht."}, {"id": 435, "start": 4705.62, "end": 4708.3, "text": "Warum das Leute unterstützen verstehe ich auch nicht, choose my name."}, {"id": 436, "start": 4708.3, "end": 4712.02, "text": "Keine Ahnung, also was da die Leute so geil dran finden und da massig Kohle reinpumpen"}, {"id": 437, "start": 4712.02, "end": 4741.38, "text": "erschließt sich mir auch absolut nicht."}, {"id": 438, "start": 4741.38, "end": 4745.14, "text": "Ich brauche mal den nicht, sounds overrated, jebaited."}, {"id": 439, "start": 4745.14, "end": 4774.9, "text": "Sogar mit Menü!"}, {"id": 440, "start": 4774.9, "end": 4775.9, "text": "Funktioniert!"}, {"id": 441, "start": 4804.9, "end": 4816.54, "text": "Ich meine für das, dass er das mehr oder weniger alles aus dem Marketplace zusammengestöpselt"}, {"id": 442, "start": 4816.54, "end": 4819.86, "text": "hat, ist das doch echt ganz ansehnlich was er da fabriziert hat."}, {"id": 443, "start": 4819.86, "end": 4824.14, "text": "Ist das RTX Ready bestimmt?"}, {"id": 444, "start": 4824.14, "end": 4837.82, "text": "Chat, ich glaube das würden wir auch noch hinkriegen."}, {"id": 445, "start": 4837.82, "end": 4841.9, "text": "Gut, das müssen wir uns jetzt nicht angucken."}, {"id": 446, "start": 4841.9, "end": 4848.06, "text": "Kann looten, Soundeffekte hat er nicht."}, {"id": 447, "start": 4848.06, "end": 4851.62, "text": "Seine Abilities funktionieren, Zeug verkaufen tut auch."}, {"id": 448, "start": 4851.62, "end": 4857.86, "text": "Jetzt wird der Boss gebashed und dann ist er durch."}, {"id": 449, "start": 4857.86, "end": 4859.9, "text": "Ja, war doch ein cooles Video."}, {"id": 450, "start": 4859.9, "end": 4862.54, "text": "Wo ist der Battle Royale Modus?"}, {"id": 451, "start": 4862.54, "end": 4866.1, "text": "Das geht anders, der released das jetzt erstmal als Early Access, macht einen geilen Trailer"}, {"id": 452, "start": 4866.1, "end": 4870.74, "text": "mit Epic Music und sagt dann Battle Royale coming soon und dann kaufen es alle die verrückten."}, {"id": 453, "start": 4870.74, "end": 4878.38, "text": "Und dann macht er nie wieder was dran und löscht sein Steam Account und behält das"}, {"id": 454, "start": 4878.38, "end": 4879.38, "text": "Geld."}, {"id": 455, "start": 4879.38, "end": 4883.54, "text": "So wie man das mit Early Access Spielen macht."}, {"id": 456, "start": 4883.54, "end": 4888.82, "text": "Nee, sowas mach ich nicht."}, {"id": 457, "start": 4888.82, "end": 4892.54, "text": "Spieleentwicklung ist echt ein Bereich, da bin ich absolut gar nicht interessiert."}, {"id": 458, "start": 4892.54, "end": 4896.54, "text": "Vielleicht bin ich dazu unkreativ, zu was Spieleideen angeht."}, {"id": 459, "start": 4896.54, "end": 4906.14, "text": "My Favorite Modern Warfare Kimbo, wir haben schon ewig kein MW2 Video mehr geguckt."}, {"id": 460, "start": 4906.14, "end": 4927.54, "text": "Kennst du Danny, der macht solche Videos, was für Videos, nee, wer, Kimbo, also Profimäßig"}, {"id": 461, "start": 4927.54, "end": 4931.54, "text": "hätte ich keinen Bock Spiele zu entwickeln, wie gesagt ich kenne ja einen oder kannte"}, {"id": 462, "start": 4931.54, "end": 4935.5, "text": "einen, nein ich kenne einen der war bei Crytek."}, {"id": 463, "start": 4935.5, "end": 4936.5, "text": "In Frankfurt."}, {"id": 464, "start": 4936.5, "end": 4949.34, "text": "Ist aber schon ein bisschen her und auf professionelle Spieleentwicklung hätte ich echt auch keinen"}, {"id": 465, "start": 4949.34, "end": 4950.34, "text": "Bock."}, {"id": 466, "start": 4950.34, "end": 4961.78, "text": "So, also komm wir gucken jetzt eine Runde MW2, wir haben schon ewig kein MW2 immer geguckt."}, {"id": 467, "start": 4961.78, "end": 4968.54, "text": "Muss man was anderes angucken als, ich mein eigentlich MW2 hört es ja vom Namen so an"}, {"id": 468, "start": 4968.54, "end": 4973.54, "text": "als ist es neuer als das aktuelle MW, wo wir schon mal wieder sehen, was für ein Clusterfuck"}, {"id": 469, "start": 4973.54, "end": 4975.58, "text": "die Call of Duty Benamung mittlerweile ist."}, {"id": 470, "start": 4975.58, "end": 4995.46, "text": "Ich bin Fortunet hier und heute sind wir wieder auf MW2, in heute's Video will ich einen"}, {"id": 471, "start": 4995.46, "end": 5022.5, "text": "MW2, was das für eine Klasse, MP5, Akimbo Silencer, mein G18 Akimbo Silencer, das ist"}, {"id": 472, "start": 5022.5, "end": 5024.5, "text": "Keine frage"}, {"id": 473, "start": 5024.5, "end": 5026.5, "text": "Die benahmung ist gut ne"}, {"id": 474, "start": 5026.5, "end": 5028.5, "text": "Class 1,2,3,4,5,6,7,8"}, {"id": 475, "start": 5046.5, "end": 5048.5, "text": "Die schleute"}, {"id": 476, "start": 5048.5, "end": 5050.5, "text": "Alter, man muss ja sagen in mw2 ist man auch"}, {"id": 477, "start": 5050.5, "end": 5052.5, "text": "Verdammt schnell gestorben"}, {"id": 478, "start": 5054.5, "end": 5056.5, "text": "Und an soviel Bullshit"}, {"id": 479, "start": 5056.5, "end": 5058.5, "text": "Allerdings alles"}, {"id": 480, "start": 5058.5, "end": 5060.5, "text": "Alles nicht so random Bullshit wie normales"}, {"id": 481, "start": 5060.5, "end": 5062.5, "text": "Modern Warfare 2019"}, {"id": 482, "start": 5062.5, "end": 5072.5, "text": "Was울"}, {"id": 483, "start": 5072.5, "end": 5084.5, "text": "Top"}, {"id": 484, "start": 5084.5, "end": 5092.18, "text": "The crosshairs on these GA teams with steady aim is really small. So extremely accurate. We got people coming this way though, so"}, {"id": 485, "start": 5092.98, "end": 5097.94, "text": "You don't want to challenge too many open gunfights. Although they do have some decent range"}, {"id": 486, "start": 5098.5, "end": 5102.14, "text": "War das grad, war der grad mit dem Noobtube am Start der Gegner?"}, {"id": 487, "start": 5102.14, "end": 5111.1, "text": "Man hört ihn doch rechts laufen, Kollege. Er hat eine Claymore gesetzt rechts."}, {"id": 488, "start": 5115.26, "end": 5117.26, "text": "Richtig Low-Brain-Gegner."}, {"id": 489, "start": 5117.26, "end": 5123.26, "text": "Das ist der Grund, warum wir die G-18s haben. Für mich liebt es den Geräusch der Doppelsuppressten MP5s, das ist so sauer."}, {"id": 490, "start": 5123.26, "end": 5127.98, "text": "Ich glaube, die Suppressoren sind nötig. Nicht genau, aber ich würde sie trotzdem benutzen."}, {"id": 491, "start": 5127.98, "end": 5131.74, "text": "Wenn du nicht die G-18s von Kimbo bekommst, solltest du dir okay sein."}, {"id": 492, "start": 5137.74, "end": 5141.74, "text": "Warum ist es so laggig? Ich werde diese aufschlagen."}, {"id": 493, "start": 5141.74, "end": 5145.74, "text": "Ich bin ein wenig nervös. Ich habe gerade eine Claymore explodiert. Ich weiß nicht, woher das herkommt."}, {"id": 494, "start": 5145.74, "end": 5147.74, "text": "Ich glaube, mein Haar hat bis jetzt noch einen Kassel getötet."}, {"id": 495, "start": 5147.74, "end": 5175.74, "text": "Was mir gerade im Nachhinein bei den alten Call of Duty ganz gut auffällt, die waren relativ simpel. Da gab es nicht 50 Billionen Spielmodi, die gespielt wurden, irgendwelche Nachtmaps, ein Waffen-Editor wurde, 50 Aufsätze drin rumwurschteln konntest,"}, {"id": 496, "start": 5175.74, "end": 5183.74, "text": "3 Milliarden Kombinationen von irgendwas. Du konntest mehr oder weniger sprinten und Gegner killen und sterben. Das war's."}, {"id": 497, "start": 5183.74, "end": 5185.74, "text": "Ich glaube, wir brauchen noch einen Kassel."}, {"id": 498, "start": 5185.74, "end": 5187.74, "text": "Ja, wir haben ihn. Lass uns gehen."}, {"id": 499, "start": 5187.74, "end": 5189.74, "text": "Soll ich ihn hier anrufen? Das ist die Frage."}, {"id": 500, "start": 5189.74, "end": 5191.74, "text": "Ich glaube, ich kann mich nur dafür schützen."}, {"id": 501, "start": 5191.74, "end": 5193.74, "text": "Ich glaube, ich kann mich selbst schützen."}, {"id": 502, "start": 5193.74, "end": 5195.74, "text": "Ich habe gerade diese explodierten Bärle rausgeholt."}, {"id": 503, "start": 5195.74, "end": 5197.74, "text": "Hoffentlich mit meinem Teamkameraden oben oben."}, {"id": 504, "start": 5197.74, "end": 5199.74, "text": "Er bleibt da drin und versucht es nicht zu lassen, mich zu töten."}, {"id": 505, "start": 5199.74, "end": 5201.74, "text": "Oh Gott, wo ist dieser Lag?"}, {"id": 506, "start": 5201.74, "end": 5203.74, "text": "Ich weiß es nicht."}, {"id": 507, "start": 5203.74, "end": 5207.74, "text": "Okay, das ist jetzt natürlich der typische Modern Warfare 2 Shit."}, {"id": 508, "start": 5209.74, "end": 5211.74, "text": "Killstreaks, Chopper, Gunner, Nuke."}, {"id": 509, "start": 5225.74, "end": 5227.74, "text": "Okay, doch nicht, doch nicht."}, {"id": 510, "start": 5227.74, "end": 5231.74, "text": "Oh, kennt ihr das? Aus dem Killstreak rauskommen und instant verrecken?"}, {"id": 511, "start": 5235.74, "end": 5241.74, "text": "Das war immer so ätzend. Du sagst dem Motto, jawoll, jetzt noch 2 Kills, jetzt noch 2 Kills nach dem Killstreak."}, {"id": 512, "start": 5241.74, "end": 5243.74, "text": "Oh fuck, tot."}, {"id": 513, "start": 5247.74, "end": 5249.74, "text": "Ah, schön."}, {"id": 514, "start": 5249.74, "end": 5251.74, "text": "Exzellent."}, {"id": 515, "start": 5251.74, "end": 5253.74, "text": "Wo ist der geile, dass man da oben drauf kann?"}, {"id": 516, "start": 5273.74, "end": 5275.74, "text": "Der Noobtube Dude, Alter."}, {"id": 517, "start": 5275.74, "end": 5281.74, "text": "Der schießt über die halbe Map."}, {"id": 518, "start": 5297.74, "end": 5301.74, "text": "Wie halt komplett umfallen an Stellen, wo sie nie gewesen sind."}, {"id": 519, "start": 5301.74, "end": 5303.74, "text": "134."}, {"id": 520, "start": 5303.74, "end": 5307.74, "text": "Das hätte man zu der Zeit, als das Spiel angesagt war, ohne Probleme hochladen können."}, {"id": 521, "start": 5311.74, "end": 5315.74, "text": "Das ist der Inbegriff von Spray and Pray, was der macht, ja."}, {"id": 522, "start": 5315.74, "end": 5325.74, "text": "Oh, what?"}, {"id": 523, "start": 5325.74, "end": 5327.74, "text": "Oh, what?"}, {"id": 524, "start": 5335.74, "end": 5337.74, "text": "Wow."}, {"id": 525, "start": 5345.74, "end": 5353.74, "text": "In MW2 kannst du alles mit allem irgendwie in 0,1 Sekunde killen."}, {"id": 526, "start": 5353.74, "end": 5356.74, "text": "Big Brain Play, Claymore Placement"}, {"id": 527, "start": 5356.74, "end": 5359.74, "text": "In MW2, im aktuellen Modern Warfare"}, {"id": 528, "start": 5359.74, "end": 5362.74, "text": "wärs halt so gewesen, dass hier links"}, {"id": 529, "start": 5362.74, "end": 5365.74, "text": "in diesem Fenster permanent einer gehättklitscht hätte."}, {"id": 530, "start": 5365.74, "end": 5368.74, "text": "Hier guck da links in dem Fenster"}, {"id": 531, "start": 5368.74, "end": 5371.74, "text": "hat permanent einer gehättklitscht."}, {"id": 532, "start": 5375.74, "end": 5378.74, "text": "Ha! Da steht er rum."}, {"id": 533, "start": 5378.74, "end": 5381.74, "text": "Das hat übrigens auch nur geklappt, weil er"}, {"id": 534, "start": 5381.74, "end": 5384.74, "text": "eindeutig irgendeinen Latency Vorteil gegenüber dem anderen hatte."}, {"id": 535, "start": 5384.74, "end": 5387.74, "text": "Sonst hätte er die normalerweise keine Chance gehabt,"}, {"id": 536, "start": 5387.74, "end": 5390.74, "text": "weil er als Danny in der rein läuft und der andere hätte normalerweise"}, {"id": 537, "start": 5390.74, "end": 5393.74, "text": "ne ganze Ecke länger Zeit gehabt ihn zu killen beim reinlaufen."}, {"id": 538, "start": 5393.74, "end": 5396.74, "text": "Das war aber halt Konsolen P2P Matchmaking"}, {"id": 539, "start": 5396.74, "end": 5421.74, "text": "geschiss."}, {"id": 540, "start": 5421.74, "end": 5426.74, "text": "Das war so OP, die G18."}, {"id": 541, "start": 5426.74, "end": 5429.74, "text": "Eigentlich brauchst du überhaupt keine Primary Waffe mit,"}, {"id": 542, "start": 5429.74, "end": 5443.74, "text": "wenn die G18er Kimbo spielt."}, {"id": 543, "start": 5443.74, "end": 5455.74, "text": "Doppel Harrier."}, {"id": 544, "start": 5455.74, "end": 5476.74, "text": "Endlich mal ein Gegner, der auch was killt."}, {"id": 545, "start": 5476.74, "end": 5480.74, "text": "Also dort sich hinzulegen könnte ein bisschen problematisch sein."}, {"id": 546, "start": 5480.74, "end": 5488.74, "text": "Oh knapp, knapp, knapp, knapp."}, {"id": 547, "start": 5488.74, "end": 5490.74, "text": "Irgendwo hier in die Ecke lege."}, {"id": 548, "start": 5490.74, "end": 5494.74, "text": "Der stirbt jetzt."}, {"id": 549, "start": 5494.74, "end": 5507.74, "text": "Normalerweise wirst du immer von hinten gekillt bei sowas."}, {"id": 550, "start": 5507.74, "end": 5516.74, "text": "Der Chopper auf der Map hat gesackt."}, {"id": 551, "start": 5516.74, "end": 5522.74, "text": "Oh ein, immerhin."}, {"id": 552, "start": 5522.74, "end": 5536.74, "text": "Äußerst fairer Spawn, direkt direkt, super Spawn, direkt im Fadenkreuz vom Chopper-Gunner."}, {"id": 553, "start": 5536.74, "end": 5559.74, "text": "Noob tubt, oder besser gesagt RPG tubt."}, {"id": 554, "start": 5559.74, "end": 5579.74, "text": "Hi-Rise, ja jetzt, oh na gut, Hi-Rise AC130 oder Hi-Rise Chopper-Gunner, da kannste ja kaum was falsch machen."}, {"id": 555, "start": 5579.74, "end": 5593.74, "text": "Da kommste ja gar nicht raus."}, {"id": 556, "start": 5593.74, "end": 5600.74, "text": "Okay, der hat auch absolut Low-Brain-Reactions der Gegner."}, {"id": 557, "start": 5600.74, "end": 5603.74, "text": "Du konntest dem Spawn normalerweise durch die Decke schießen."}, {"id": 558, "start": 5603.74, "end": 5606.74, "text": "Ich glaube das einzige, wo du nicht getroffen werden konntest war,"}, {"id": 559, "start": 5606.74, "end": 5610.74, "text": "wenn du entweder im Tunnel warst oder ganz hinten auf der Seite."}, {"id": 560, "start": 5610.74, "end": 5622.74, "text": "Aber sonst konntest du durch die Decke schießen."}, {"id": 561, "start": 5622.74, "end": 5627.74, "text": "Guck hier kannst du normalerweise durch die Decke schießen."}, {"id": 562, "start": 5627.74, "end": 5637.74, "text": "Ich glaube hier bist du safe, hier bist du safe."}, {"id": 563, "start": 5637.74, "end": 5642.74, "text": "Der kann Glück haben, dass er keine Ballhacker oder sonst was am Start hat."}, {"id": 564, "start": 5642.74, "end": 5646.74, "text": "Echt nur eine Seite?"}, {"id": 565, "start": 5646.74, "end": 5651.74, "text": "Sehr fair."}, {"id": 566, "start": 5651.74, "end": 5675.74, "text": "Oh nee, ich spüre den Rage."}, {"id": 567, "start": 5675.74, "end": 5681.74, "text": "Der Schneiber-Dude."}, {"id": 568, "start": 5681.74, "end": 5687.74, "text": "Was ist mit denen los?"}, {"id": 569, "start": 5687.74, "end": 5690.74, "text": "Monkeys."}, {"id": 570, "start": 5690.74, "end": 5693.74, "text": "Machst du auch wieder PoE?"}, {"id": 571, "start": 5693.74, "end": 5702.74, "text": "Nee, wahrscheinlich nicht."}, {"id": 572, "start": 5702.74, "end": 5710.74, "text": "Und?"}, {"id": 573, "start": 5710.74, "end": 5720.74, "text": "Guck mal, wie gut das Ding trifft über die gesamte Map."}, {"id": 574, "start": 5720.74, "end": 5735.74, "text": "Also G18 Akimbo war schon echt heftige Geschichte."}, {"id": 575, "start": 5735.74, "end": 5738.74, "text": "Jetzt kriegt er eine Nuke, ich sag's euch Leute."}, {"id": 576, "start": 5738.74, "end": 5746.74, "text": "Weil auf Afghan mit AC130, also..."}, {"id": 577, "start": 5746.74, "end": 5761.74, "text": "Da ist, da kannst du ja kaum was falsch machen, es sei denn du wirst direkt abgeballert."}, {"id": 578, "start": 5761.74, "end": 5766.74, "text": "Oh nee, das war unglücklich."}, {"id": 579, "start": 5766.74, "end": 5770.74, "text": "Jetzt, jetzt, jetzt."}, {"id": 580, "start": 5770.74, "end": 5784.74, "text": "Wie? Moment, man kann das überleben?"}, {"id": 581, "start": 5784.74, "end": 5793.74, "text": "Jawoll."}, {"id": 582, "start": 5793.74, "end": 5795.74, "text": "So und jetzt ist nur noch die Preisfrage."}, {"id": 583, "start": 5795.74, "end": 5798.74, "text": "Messer der, während die Nuke angemacht wird."}, {"id": 584, "start": 5798.74, "end": 5800.74, "text": "G00 Stufe 1, dankeschön."}, {"id": 585, "start": 5800.74, "end": 5807.74, "text": "Excellent Subscription, huge."}, {"id": 586, "start": 5807.74, "end": 5814.74, "text": "Ohne Messern keine legit..."}, {"id": 587, "start": 5814.74, "end": 5819.74, "text": "So, wird gemessert."}, {"id": 588, "start": 5819.74, "end": 5822.74, "text": "Bomby."}, {"id": 589, "start": 5822.74, "end": 5823.74, "text": "Messern."}, {"id": 590, "start": 5823.74, "end": 5824.74, "text": "Und, und, und, und."}, {"id": 591, "start": 5824.74, "end": 5827.74, "text": "Ja, legit, zählt."}, {"id": 592, "start": 5827.74, "end": 5833.74, "text": "Ohne Messern in der Nuke ist nicht, geht nicht."}, {"id": 593, "start": 5833.74, "end": 5835.74, "text": "Okay, was haben wir sonst noch für einen Star?"}, {"id": 594, "start": 5835.74, "end": 5836.74, "text": "Was haben wir sonst noch?"}, {"id": 595, "start": 5836.74, "end": 5839.74, "text": "Switch Clone, you should stay away."}, {"id": 596, "start": 5839.74, "end": 5840.74, "text": "Was, wenn der Desktop..."}, {"id": 597, "start": 5840.74, "end": 5844.74, "text": "What do alien civilizations look like?"}, {"id": 598, "start": 5844.74, "end": 5846.74, "text": "Ja, kurz gesagt macht der mal gute Videos."}, {"id": 599, "start": 5846.74, "end": 5848.74, "text": "Die gibt's übrigens mittlerweile auch auf Deutsch."}, {"id": 600, "start": 5848.74, "end": 5852.74, "text": "Der Flight Simulator, so gut ist der wirklich."}, {"id": 601, "start": 5852.74, "end": 5854.74, "text": "Okay, wer, wer, wer macht das Video?"}, {"id": 602, "start": 5854.74, "end": 5860.74, "text": "Je nachdem, wer das Video spricht, guck ich mir ein Gamster Video auch an."}, {"id": 603, "start": 5860.74, "end": 5862.74, "text": "Ich konnte Maurice früher mir nie angucken."}, {"id": 604, "start": 5862.74, "end": 5871.74, "text": "Mittlerweile gucke ich mir eigentlich die Videos von ihm mit am liebsten an."}, {"id": 605, "start": 5871.74, "end": 5873.74, "text": "Keine Ahnung."}, {"id": 606, "start": 5873.74, "end": 5880.74, "text": "Es sieht aber schon echt ziemlich gut aus."}, {"id": 607, "start": 5880.74, "end": 5891.74, "text": "Ach, das ist ja ein recht oldschool Typ."}, {"id": 608, "start": 5891.74, "end": 5911.74, "text": "Buckelt oder?"}, {"id": 609, "start": 5911.74, "end": 5912.74, "text": "Also es sieht wirklich gut aus."}, {"id": 610, "start": 5912.74, "end": 5934.74, "text": "Alter, das Video ist ja mega Resident Sleeper."}, {"id": 611, "start": 5934.74, "end": 5957.74, "text": "Ich gebe zu, dass Flug Simulator jetzt vielleicht ähnlich, sodass das Killer-Thema schlechthin ist, ja."}, {"id": 612, "start": 5957.74, "end": 5958.74, "text": "Hast du dir den mal Game Pass angeschaut?"}, {"id": 613, "start": 5958.74, "end": 5959.74, "text": "Was? Moment, was?"}, {"id": 614, "start": 5959.74, "end": 5961.74, "text": "Hast du dir den Game Pass mal angeschaut?"}, {"id": 615, "start": 5961.74, "end": 5972.74, "text": "Du meinst von Flug Simulator? Nö."}, {"id": 616, "start": 5972.74, "end": 5984.74, "text": "Es sieht aber schon, also wenn man sich mal anguckt, wie detailliert und die Häuser halt auch echte, richtige 3D-Objekte da unten sind."}, {"id": 617, "start": 5984.74, "end": 6001.74, "text": "Das ist echt gut."}, {"id": 618, "start": 6001.74, "end": 6003.74, "text": "Es sieht schon cool aus."}, {"id": 619, "start": 6003.74, "end": 6013.74, "text": "Angeblich wollten die ja auch irgendwie Echtzeitwetter und sowas haben."}, {"id": 620, "start": 6013.74, "end": 6015.74, "text": "Das ist aber was anderes."}, {"id": 621, "start": 6015.74, "end": 6029.74, "text": "Sieht jetzt aber nicht so gut aus."}, {"id": 622, "start": 6029.74, "end": 6032.74, "text": "Optisch macht das echt was her."}, {"id": 623, "start": 6032.74, "end": 6042.74, "text": "Ich hab letztens drüber gelesen, dass es irgendwie drei verschiedene Editions gibt und je nachdem welche Edition man kauft, sind dann unterschiedlich viele Flugzeuge, unterschiedlich viele detaillierte Flughäfen dabei und sowas."}, {"id": 624, "start": 6042.74, "end": 6049.74, "text": "Mal gucken, ob das so ausartet wie beim, was war das, der Truck Simulator oder sowas?"}, {"id": 625, "start": 6049.74, "end": 6055.74, "text": "Dieses eine Game, wo du irgendwie 5000 Euro Microtransactions ausgeben kannst."}, {"id": 626, "start": 6055.74, "end": 6058.74, "text": "Ist das auch Echtzeit? Man kann das garantiert Echtzeit spielen."}, {"id": 627, "start": 6058.74, "end": 6062.74, "text": "Was ist der Train Simulator? Der Train Simulator, nicht der Truck Simulator."}, {"id": 628, "start": 6062.74, "end": 6078.74, "text": "Es gibt Leute, die streamen das teilweise auf Twitch und die machen das richtig hardcore, also sprich, die fliegen fünf Stunden Echtzeit und die haben dann Spieler, die unterwegs dann auch Air Traffic und Gedöns machen."}, {"id": 629, "start": 6078.74, "end": 6084.74, "text": "Die haben dann Spieler, die wirklich auch Funkverkehr und so machen."}, {"id": 630, "start": 6084.74, "end": 6087.74, "text": "Das ist richtig die Hardcore Simulationsleute am Start."}, {"id": 631, "start": 6087.74, "end": 6093.74, "text": "Gibt es hier teilweise auch auf Twitch, ist aber halt übelst langweilig, wenn man sich nicht dafür interessiert."}, {"id": 632, "start": 6101.74, "end": 6106.74, "text": "Wenn der Desktop in einem Notebook lag, heftige Kühllösung und Stromversorgung."}, {"id": 633, "start": 6106.74, "end": 6108.74, "text": "Zeig mal her, der Auer wieder am Start."}, {"id": 634, "start": 6108.74, "end": 6111.74, "text": "Hallo zusammen und herzlich willkommen zu einem weiteren Video."}, {"id": 635, "start": 6111.74, "end": 6113.74, "text": "Es geht jetzt endlich mal wieder normal weiter."}, {"id": 636, "start": 6113.74, "end": 6118.74, "text": "Die letzten vier, fünf Wochen waren bei mir ein bisschen schwierig, deswegen war der Video Output auch nicht ganz so hoch."}, {"id": 637, "start": 6118.74, "end": 6122.74, "text": "Und das versuche ich jetzt wieder in die normal geordneten Bahnen zu führen."}, {"id": 638, "start": 6122.74, "end": 6126.74, "text": "Und wir machen das heute mit einem XMG Notebook."}, {"id": 639, "start": 6126.74, "end": 6128.74, "text": "Und das ist mal wieder was."}, {"id": 640, "start": 6128.74, "end": 6131.74, "text": "Also wir haben ja vor kurzem den Apex 15 reviewt."}, {"id": 641, "start": 6131.74, "end": 6138.74, "text": "Das war das mit einem 3950X, also einem Desktop CPU von AMD in einem Notebook."}, {"id": 642, "start": 6138.74, "end": 6142.74, "text": "Und jetzt muss ich sagen, hat XMG es einfach komplett übertrieben."}, {"id": 643, "start": 6142.74, "end": 6144.74, "text": "Generales Lame, vier Monate, dankeschön."}, {"id": 644, "start": 6144.74, "end": 6147.74, "text": "Subscription, huge massive."}, {"id": 645, "start": 6147.74, "end": 6152.74, "text": "Dieses Produkt ist was, wo ich mich frage, ist das noch ein Laptop oder ist das einfach..."}, {"id": 646, "start": 6152.74, "end": 6156.74, "text": "Es ist absolut sinnlos, für das nämlich für mobil mitnehmen."}, {"id": 647, "start": 6156.74, "end": 6160.74, "text": "... ein Desktop PC mit aufklappbarem Display, ich weiß es nicht ganz genau."}, {"id": 648, "start": 6160.74, "end": 6162.74, "text": "Der Anwendungszweck ist schon fragwürdig, ja."}, {"id": 649, "start": 6162.74, "end": 6168.74, "text": "Das teile ich heute im Detail an, da gibt es einige absolut verrückte, kurze Details."}, {"id": 650, "start": 6168.74, "end": 6173.74, "text": "Wenn ihr keinen Bock habt auf dieses ganze Blabla, also es geht jetzt mal so hauptsächlich um Chic."}, {"id": 651, "start": 6173.74, "end": 6175.74, "text": "Also meine Katze."}, {"id": 652, "start": 6175.74, "end": 6178.74, "text": "Das sind ein paar Details, die habt ihr wahrscheinlich auf Instagram schon gesehen."}, {"id": 653, "start": 6178.74, "end": 6179.74, "text": "Wenn ihr..."}, {"id": 654, "start": 6179.74, "end": 6181.74, "text": "... man sich das so anhört, es kommt halt nicht hochwertig rüber."}, {"id": 655, "start": 6181.74, "end": 6184.74, "text": "Es ist ein technisch gesehen absolut super Produkt."}, {"id": 656, "start": 6184.74, "end": 6186.74, "text": "Aber das passt einfach nicht zusammen."}, {"id": 657, "start": 6186.74, "end": 6189.74, "text": "Also da sollte ein hochwertigeres Gehäuse her."}, {"id": 658, "start": 6189.74, "end": 6191.74, "text": "Reden wir dafür jetzt mal über die Kühllösung."}, {"id": 659, "start": 6191.74, "end": 6192.74, "text": "Habt ihr..."}, {"id": 660, "start": 6192.74, "end": 6195.74, "text": "Boah, das ist aber ein riesen fettes Teil, Alter."}, {"id": 661, "start": 6195.74, "end": 6198.74, "text": "Das hast du schon mal gesehen in einem Laptop, einfach nur..."}, {"id": 662, "start": 6198.74, "end": 6200.74, "text": "Aber ich gucke eh selten in Laptops rein."}, {"id": 663, "start": 6200.74, "end": 6204.74, "text": "Massive Anzahl an Heatpipes, die sich hier oben befindet."}, {"id": 664, "start": 6204.74, "end": 6207.74, "text": "Und dieser Lüfter."}, {"id": 665, "start": 6207.74, "end": 6209.74, "text": "Einfach nur der Lüfter, wie massiv dieses Teil ist."}, {"id": 666, "start": 6209.74, "end": 6211.74, "text": "Unfassbar, was eine Kühlkonstruktion..."}, {"id": 667, "start": 6211.74, "end": 6215.74, "text": "Wahrscheinlich hast du erstmal Brandflecken an den Beinen."}, {"id": 668, "start": 6215.74, "end": 6217.74, "text": "Wenn du sie auf den Schoß stellst."}, {"id": 669, "start": 6217.74, "end": 6219.74, "text": "... in diesem Teil hier steckt."}, {"id": 670, "start": 6219.74, "end": 6222.74, "text": "Das erklärt natürlich auch so ein bisschen das Gewicht, würde ich sagen."}, {"id": 671, "start": 6222.74, "end": 6225.74, "text": "Schrauben wir gleich noch mal ab und schauen uns das mal in der vollen Pracht an."}, {"id": 672, "start": 6225.74, "end": 6232.74, "text": "Aber so ein Teil, so eine riesen Kühllösung habe ich noch nie in irgendeinem Notebook verbaut gesehen."}, {"id": 673, "start": 6232.74, "end": 6235.74, "text": "Warum kauft man sich so ein Laptop? Keine Ahnung."}, {"id": 674, "start": 6235.74, "end": 6238.74, "text": "Der Anwendungszweck erschließt sich mir nicht."}, {"id": 675, "start": 6238.74, "end": 6241.74, "text": "So eine Konstruktion, das ist Beleuchtung."}, {"id": 676, "start": 6241.74, "end": 6243.74, "text": "Oh RGB, wichtig."}, {"id": 677, "start": 6243.74, "end": 6246.74, "text": "Dieses Teil liegt einfach über dem Kühler drüber."}, {"id": 678, "start": 6246.74, "end": 6250.74, "text": "Ohne RGB geht nichts."}, {"id": 679, "start": 6254.74, "end": 6256.74, "text": "Aber was ist das?"}, {"id": 680, "start": 6256.74, "end": 6260.74, "text": "Dass man weiß, wo man welche Teile hinlegt oder was?"}, {"id": 681, "start": 6260.74, "end": 6262.74, "text": "Ah ja, genau."}, {"id": 682, "start": 6262.74, "end": 6265.74, "text": "Dass man die Teile wieder findet."}, {"id": 683, "start": 6265.74, "end": 6268.74, "text": "Alle Schrauben vom Kühlkörper sind entfernt."}, {"id": 684, "start": 6268.74, "end": 6270.74, "text": "Kabel 1, Kabel 2 abgezogen."}, {"id": 685, "start": 6270.74, "end": 6273.74, "text": "Dann schauen wir mal, ob wir das Ding abgelöst bekommen."}, {"id": 686, "start": 6285.74, "end": 6290.74, "text": "Und da haben wir auch schon mal einen Ausblick, warum diese Kühllösung so wichtig ist."}, {"id": 687, "start": 6290.74, "end": 6295.74, "text": "Und auch die Netzteile."}, {"id": 688, "start": 6295.74, "end": 6298.74, "text": "Erstmal haben sie ordentlich Wärmeleitpaste drauf geklatscht."}, {"id": 689, "start": 6298.74, "end": 6300.74, "text": "So gehört sich das."}, {"id": 690, "start": 6300.74, "end": 6303.74, "text": "Wir haben hier tatsächlich Sockel LGA 1200."}, {"id": 691, "start": 6303.74, "end": 6306.74, "text": "Das heißt, hier ist ein 10900K drin gesockelt."}, {"id": 692, "start": 6306.74, "end": 6310.74, "text": "Und hier ist ein RTX 2080 Super in einem MX."}, {"id": 693, "start": 6310.74, "end": 6313.74, "text": "Aber gerade wenn du unterwegs bist, kannst du das nicht richtig verwenden."}, {"id": 694, "start": 6313.74, "end": 6315.74, "text": "Lippziger."}, {"id": 695, "start": 6315.74, "end": 6317.74, "text": "Das kannst du."}, {"id": 696, "start": 6317.74, "end": 6324.74, "text": "Das ist höchstens was, wenn du abends, wenn du viel unterwegs bist und abends im Hotel spielen willst."}, {"id": 697, "start": 6324.74, "end": 6326.74, "text": "Aber nur stationär."}, {"id": 698, "start": 6326.74, "end": 6328.74, "text": "Dann okay, dann verstehe ich es."}, {"id": 699, "start": 6328.74, "end": 6329.74, "text": "Das ist im Modul verbaut."}, {"id": 700, "start": 6329.74, "end": 6330.74, "text": "Die werden wir gleich mal noch ausbauen."}, {"id": 701, "start": 6330.74, "end": 6332.74, "text": "Aber jetzt erst mal kurz einen Blick auf die Kühllösung."}, {"id": 702, "start": 6332.74, "end": 6337.74, "text": "Über die Jahre habe ich wirklich schon viele Notebooks auseinandergeschraubt und mir so die Kühllösungen angeschaut."}, {"id": 703, "start": 6337.74, "end": 6339.74, "text": "Das ist aber echt ein fetter Kühler."}, {"id": 704, "start": 6339.74, "end": 6341.74, "text": "Das ist wirklich, wirklich geisteskrank."}, {"id": 705, "start": 6341.74, "end": 6343.74, "text": "Das ist wirklich ein fetter Kühler."}, {"id": 706, "start": 6343.74, "end": 6345.74, "text": "Den Kühlblock an, der ist so groß wie meine Hand."}, {"id": 707, "start": 6345.74, "end": 6350.74, "text": "Hier, der Kühlblock, wo die CPU aufliegt, ist übrigens Thermonucleosy-Cryonaut."}, {"id": 708, "start": 6350.74, "end": 6352.74, "text": "Sofern ich das beurteilen kann."}, {"id": 709, "start": 6352.74, "end": 6353.74, "text": "Besser."}, {"id": 710, "start": 6353.74, "end": 6356.74, "text": "Hier haben wir glatte 6 Heatpipes, die von der CPU weggehen."}, {"id": 711, "start": 6356.74, "end": 6360.74, "text": "Und wenn man hier schaut, wie viele Heatpipes überall links und rechts verteilt sind."}, {"id": 712, "start": 6360.74, "end": 6364.74, "text": "Hier haben wir eine Vapor-Chamber, die auf der GPU aufliegt."}, {"id": 713, "start": 6364.74, "end": 6367.74, "text": "Und da werden dann gleichzeitig auch noch die ganzen Rambauscheine mitgefüllt."}, {"id": 714, "start": 6367.74, "end": 6368.74, "text": "Vapor-Chamber?"}, {"id": 715, "start": 6368.74, "end": 6370.74, "text": "Vapenation?"}, {"id": 716, "start": 6370.74, "end": 6372.74, "text": "Hier nochmal und hier..."}, {"id": 717, "start": 6372.74, "end": 6375.74, "text": "Das Notebook wiegt wahrscheinlich auch 5 Kilo oder so."}, {"id": 718, "start": 6375.74, "end": 6380.74, "text": "Handlungsversorgung, CPU, also für ein Notebook-Kühler ist es wirklich krass."}, {"id": 719, "start": 6380.74, "end": 6382.74, "text": "Und zurück zum Notebook."}, {"id": 720, "start": 6382.74, "end": 6383.74, "text": "Ja."}, {"id": 721, "start": 6383.74, "end": 6389.74, "text": "Hier ist tatsächlich ein ganz normaler 10900K verbaut."}, {"id": 722, "start": 6389.74, "end": 6390.74, "text": "Mit Sockel."}, {"id": 723, "start": 6390.74, "end": 6391.74, "text": "Das ist einfach krass."}, {"id": 724, "start": 6391.74, "end": 6394.74, "text": "Sowas in Notebooks zu haben, ich finde das einfach beeindruckend."}, {"id": 725, "start": 6394.74, "end": 6397.74, "text": "Kommen wir jetzt aber erstmal zur Grafikeinheit."}, {"id": 726, "start": 6397.74, "end": 6400.74, "text": "Wie gesagt, die ist auf einem MXM-Modul, was das genaue ist, zeige ich euch gleich."}, {"id": 727, "start": 6400.74, "end": 6403.74, "text": "Dafür müssen wir erst mal die zwei Schrauben noch entfernen."}, {"id": 728, "start": 6415.74, "end": 6417.74, "text": "Und jetzt erstmal..."}, {"id": 729, "start": 6419.74, "end": 6423.74, "text": "Auf der Unterseite des Grafike-Moduls haben wir noch so ein richtig, richtig fettes Wärmelight-Pad."}, {"id": 730, "start": 6423.74, "end": 6427.74, "text": "Das ist wahrscheinlich dazu da, um ein bisschen Wärme von dieser Platine auf die untere zu übertragen."}, {"id": 731, "start": 6427.74, "end": 6431.74, "text": "Dieses MXM-Modul, also das ist eine RTX 2080 Super."}, {"id": 732, "start": 6431.74, "end": 6438.74, "text": "Das ist eine der Hauptgründe, warum so krasse Netzteile notwendig sind bei diesem Notebook."}, {"id": 733, "start": 6438.74, "end": 6448.74, "text": "Denn zusammen mit dem 10900K können die sich insgesamt im Dauerlastbetrieb knapp 400 Watt gönnen."}, {"id": 734, "start": 6448.74, "end": 6451.74, "text": "Das ist wirklich, wirklich viel, weil wir haben jetzt 200 Watt."}, {"id": 735, "start": 6451.74, "end": 6458.74, "text": "Und der 10900K, der darf sich dauerhaft auch 125 Watt gönnen, genauso wie es in einem Desktoprechner der Fall ist."}, {"id": 736, "start": 6458.74, "end": 6465.74, "text": "Wir hatten ja beim Apex 15 einen 359X drin von AMD und der war quasi im Eco-Modus auf 65 Watt."}, {"id": 737, "start": 6465.74, "end": 6468.74, "text": "Das ist jetzt hier beim 10900K nicht..."}, {"id": 738, "start": 6468.74, "end": 6471.74, "text": "Mich würde mal die Akkulaufzeit interessieren, eine Viertelstunde."}, {"id": 739, "start": 6471.74, "end": 6473.74, "text": "Fall, und dementsprechend..."}, {"id": 740, "start": 6473.74, "end": 6481.74, "text": "Wahrscheinlich takte das Ding klarenlos runter im Akkubetrieb, dass es wahrscheinlich doch eine Stunde oder so hält."}, {"id": 741, "start": 6481.74, "end": 6485.74, "text": "Die Leistungsaufnahme aus GPU und CPU in diesem Teil ist einfach krass."}, {"id": 742, "start": 6485.74, "end": 6487.74, "text": "Da werden wir uns auch gleich mal die Temperaturen anschauen."}, {"id": 743, "start": 6487.74, "end": 6490.74, "text": "Ich bin wirklich gespannt, wie das unter Last dann ist."}, {"id": 744, "start": 6490.74, "end": 6498.74, "text": "Wenn man keine Ahnung, 3D Mark zum Beispiel einfach mal so 15 Minuten laufen lässt und CPU und GPU ordentlich unter Last stehen,"}, {"id": 745, "start": 6498.74, "end": 6504.74, "text": "da wird mich wirklich interessieren, wie mit so einer Kühlösung die Temperaturen letztendlich ausfallen und auch die Taktraten und natürlich..."}, {"id": 746, "start": 6504.74, "end": 6507.74, "text": "Ich glaube, die Temperaturen sind ganz okay."}, {"id": 747, "start": 6507.74, "end": 6512.74, "text": "Ich mein, das Ding ist ein riesen fetter Kupferblock."}, {"id": 748, "start": 6512.74, "end": 6519.74, "text": "Sofern die da genug Lüfter haben, die das Ganze abtransportieren, könnte ich mir vorstellen, die Temperaturen werden schon ganz okay sein."}, {"id": 749, "start": 6519.74, "end": 6526.74, "text": "Werden jetzt auch nicht so gut wie in einem Desktopgehäuse mit irgendeinem Nocturlüfter oder gar einer Wasserkühlung dran."}, {"id": 750, "start": 6526.74, "end": 6528.74, "text": "Aber die dürften schon okay sein."}, {"id": 751, "start": 6528.74, "end": 6536.74, "text": "Wir haben modulare RAM-Bänke, wir haben ein MXM-Modul und wir haben einen gesockelten 10900K."}, {"id": 752, "start": 6536.74, "end": 6539.74, "text": "Kann man das Ding natürlich auch upgraden, in der Theorie, sage ich ganz klar."}, {"id": 753, "start": 6539.74, "end": 6540.74, "text": "Praktisch keiner macht, ja."}, {"id": 754, "start": 6540.74, "end": 6547.74, "text": "Nur aus Erfahrung über die Jahre, wie ich so MXM-Module oder sowas verfolgt habe, lohnt sich das meistens gar nicht so sehr,"}, {"id": 755, "start": 6547.74, "end": 6549.74, "text": "weil diese Teile sind unfassbar teuer."}, {"id": 756, "start": 6549.74, "end": 6556.74, "text": "Wenn man heutzutage einfach nur versucht, keine Ahnung, schaut euch eine 1070, 1080 im MXM-Format an."}, {"id": 757, "start": 6556.74, "end": 6559.74, "text": "Die kosten heutzutage noch 600, 800 Euro."}, {"id": 758, "start": 6559.74, "end": 6561.74, "text": "Das ist wirklich, wirklich krass."}, {"id": 759, "start": 6561.74, "end": 6566.74, "text": "Und da muss man sich dann immer fragen, lohnt sich das wirklich, dass man da plant, vielleicht in Zukunft abzugraden"}, {"id": 760, "start": 6566.74, "end": 6570.74, "text": "oder kauft man sich das Teil und denkt sich dann, okay, das benutze ich so und so viele Jahre."}, {"id": 761, "start": 6570.74, "end": 6572.74, "text": "Ich denke mal, die meisten Leute, die das kaufen, upgraden das nicht."}, {"id": 762, "start": 6572.74, "end": 6575.74, "text": "Vielleicht mal einen neuen RAM-Riegel oder so, wenn noch einer frei ist."}, {"id": 763, "start": 6575.74, "end": 6577.74, "text": "Aber das war es dann auch."}, {"id": 764, "start": 6577.74, "end": 6579.74, "text": "Upgraden kann man damit."}, {"id": 765, "start": 6579.74, "end": 6583.74, "text": "Aber ob das so ein wirklich krasses Argument ist dafür, da bin ich mir nicht so ganz sicher."}, {"id": 766, "start": 6583.74, "end": 6585.74, "text": "Die Kühlung ist wieder komplett montiert."}, {"id": 767, "start": 6585.74, "end": 6587.74, "text": "Dann noch ein kurzes Wort hier rechts an der Seite."}, {"id": 768, "start": 6587.74, "end": 6589.74, "text": "Ist so eine kleine Abdeckung normalerweise drauf."}, {"id": 769, "start": 6589.74, "end": 6592.74, "text": "Und da hat man Platz 3 M2 SSDs zu montieren."}, {"id": 770, "start": 6592.74, "end": 6593.74, "text": "Gleich drei Stück."}, {"id": 771, "start": 6593.74, "end": 6595.74, "text": "Links ist noch mal ein weiterer Slot."}, {"id": 772, "start": 6595.74, "end": 6597.74, "text": "Also da kann man auf jeden Fall einiges unterbringen."}, {"id": 773, "start": 6597.74, "end": 6599.74, "text": "Da wird es an nichts mangeln."}, {"id": 774, "start": 6599.74, "end": 6603.74, "text": "Ein ganz kurzer Blick ins BIOS einfach nur, dass ihr seht, was für einen Umfang das hier bietet"}, {"id": 775, "start": 6603.74, "end": 6606.74, "text": "oder welchen Umfang es gegebenenfalls auch nicht bietet."}, {"id": 776, "start": 6606.74, "end": 6609.74, "text": "Also hier einfach Übersicht über die Komponenten, dass immer was verbaut ist."}, {"id": 777, "start": 6609.74, "end": 6611.74, "text": "Auch welcher RAM."}, {"id": 778, "start": 6611.74, "end": 6614.74, "text": "Also wir haben hier 32 GB RAM aktuell verbaut."}, {"id": 779, "start": 6614.74, "end": 6616.74, "text": "Hier hat man Möglichkeit NVMe und so weiter."}, {"id": 780, "start": 6616.74, "end": 6620.74, "text": "RAM ist übrigens, beide beide noch mal kurz angemerkt gerade, extrem billig."}, {"id": 781, "start": 6620.74, "end": 6623.74, "text": "Also wer RAM braucht, sollte RAM jetzt kaufen."}, {"id": 782, "start": 6623.74, "end": 6625.74, "text": "RAM ist ultra billig gerade."}, {"id": 783, "start": 6625.74, "end": 6628.74, "text": "Du kriegst 32 GB für unter 100 Euro."}, {"id": 784, "start": 6628.74, "end": 6631.74, "text": "Also die schnelle, schnelle 32 GB für unter 100 Euro."}, {"id": 785, "start": 6631.74, "end": 6638.74, "text": "Unter advanced gibt es dann richtig viele Optionen, was CPU Management, Webcam und so weiter betrifft."}, {"id": 786, "start": 6638.74, "end": 6641.74, "text": "Also alles mögliche, was man brauchen könnte, ist hier auf jeden Fall vorhanden."}, {"id": 787, "start": 6641.74, "end": 6643.74, "text": "Sehr übersichtlich dargestellt."}, {"id": 788, "start": 6643.74, "end": 6645.74, "text": "Das gefällt mir sehr, sehr gut."}, {"id": 789, "start": 6645.74, "end": 6646.74, "text": "Dann habe ich hier was gefunden."}, {"id": 790, "start": 6646.74, "end": 6648.74, "text": "Overclocking Performance Menü."}, {"id": 791, "start": 6648.74, "end": 6649.74, "text": "Das kann man nur anmachen."}, {"id": 792, "start": 6649.74, "end": 6651.74, "text": "Was das bedeutet, zeige ich euch gleich."}, {"id": 793, "start": 6651.74, "end": 6652.74, "text": "An, aus."}, {"id": 794, "start": 6652.74, "end": 6656.74, "text": "Und diese Option bewirkt nämlich, dass wir hier neben dem Control Center, was wir uns noch gleich kurz anschauen,"}, {"id": 795, "start": 6656.74, "end": 6659.74, "text": "auch ein CPU Overclocking Menü finden."}, {"id": 796, "start": 6659.74, "end": 6662.74, "text": "Und das Overclocking Menü sieht auf den ersten Blick eigentlich ganz interessant aus."}, {"id": 797, "start": 6662.74, "end": 6665.74, "text": "Aber wirklich viel kann man nicht machen."}, {"id": 798, "start": 6665.74, "end": 6668.74, "text": "Auf jeden Fall nicht mehr, als man auch mit Intel XTU könnte."}, {"id": 799, "start": 6668.74, "end": 6671.74, "text": "Und ich würde mir nicht wünschen, dass es diese Option direkt in BIOS gäbe."}, {"id": 800, "start": 6671.74, "end": 6675.74, "text": "Man kann allerdings hier bei der CPU Spannung Ander- und Overvolten."}, {"id": 801, "start": 6675.74, "end": 6676.74, "text": "Das ist schon mal..."}, {"id": 802, "start": 6676.74, "end": 6677.74, "text": "Ob ich das jetzt noch übertakken muss?"}, {"id": 803, "start": 6677.74, "end": 6681.74, "text": "Hinter diesem CPU Overclocking Menü versteckt sich dieses Tool, was auf den ersten Blick..."}, {"id": 804, "start": 6681.74, "end": 6683.74, "text": "Wenn es geht, dann wird es gemacht."}, {"id": 805, "start": 6683.74, "end": 6686.74, "text": "... eigentlich ganz interessant ist, aber sich ganz, ganz komisch verhält."}, {"id": 806, "start": 6686.74, "end": 6690.74, "text": "Also die Optionen sind generell jetzt nicht mehr, als man bei Intel XTU hätte."}, {"id": 807, "start": 6690.74, "end": 6695.74, "text": "Und wenn ich jetzt zum Beispiel hier mal versuche, die Spannung zu verändern, kann ich das gar nicht übernehmen."}, {"id": 808, "start": 6695.74, "end": 6699.74, "text": "Und wird auch alles nicht so ganz so perfekt angezeigt."}, {"id": 809, "start": 6699.74, "end": 6701.74, "text": "Wahrscheinlich so auto-translated."}, {"id": 810, "start": 6701.74, "end": 6704.74, "text": "Sieht übrigens hässlich aus, das Programm."}, {"id": 811, "start": 6704.74, "end": 6706.74, "text": "Dann werde ich jetzt für meinen Test erstmal auf Intel XTU zurückgreifen."}, {"id": 812, "start": 6706.74, "end": 6710.74, "text": "Dafür muss ich sagen, gefällt mir das Control Center 3.0 relativ gut."}, {"id": 813, "start": 6710.74, "end": 6712.74, "text": "Also erstmal hier LED Control für Keyboard."}, {"id": 814, "start": 6712.74, "end": 6714.74, "text": "Da könnt ihr einfach eure Farben einstellen."}, {"id": 815, "start": 6714.74, "end": 6716.74, "text": "Da gehe ich jetzt erstmal nicht rein."}, {"id": 816, "start": 6716.74, "end": 6718.74, "text": "Fanspeed Control ist auf jeden Fall interessant."}, {"id": 817, "start": 6718.74, "end": 6722.74, "text": "Gerade für Benchmarks oder wenn ihr irgendwas overclocken wollt, testen wollt..."}, {"id": 818, "start": 6722.74, "end": 6725.74, "text": "Also es ist ja schön, wenn man seine Programme stylish machen will."}, {"id": 819, "start": 6725.74, "end": 6729.74, "text": "Allerdings, wenn man sie stylish macht, auf Kosten der Bedienbarkeit, kommt dann sowas hier raus."}, {"id": 820, "start": 6729.74, "end": 6732.74, "text": "Weil du hast ja keine Ahnung, was du hier von anklicken kannst und was nicht."}, {"id": 821, "start": 6732.74, "end": 6733.74, "text": "... artisch lassen."}, {"id": 822, "start": 6733.74, "end": 6738.74, "text": "Könnt ihr maximal machen oder benutzerdefiniert einstellen, was ihr hier für eine Lüfterkurve haben wollt."}, {"id": 823, "start": 6738.74, "end": 6740.74, "text": "Also das ist schon mal sehr, sehr gut gemacht."}, {"id": 824, "start": 6740.74, "end": 6742.74, "text": "Das gefällt mir wirklich sehr, sehr gut."}, {"id": 825, "start": 6742.74, "end": 6744.74, "text": "Wir lassen das für den Moment erstmal auf automatisch."}, {"id": 826, "start": 6744.74, "end": 6746.74, "text": "Das Programm hat bestimmt eine Browser Toolbar eingebaut."}, {"id": 827, "start": 6746.74, "end": 6748.74, "text": "Das haben wir uns ja gerade schon angeschaut."}, {"id": 828, "start": 6748.74, "end": 6750.74, "text": "Das werden wir jetzt mal nicht verwenden."}, {"id": 829, "start": 6750.74, "end": 6752.74, "text": "Was aber auch interessant ist, ist GPU Overclocking."}, {"id": 830, "start": 6752.74, "end": 6757.74, "text": "Wenn wir hier reinklicken, dann gibt es nochmal ein extra Menü, wo wir die GPU übertakten können."}, {"id": 831, "start": 6757.74, "end": 6762.74, "text": "Und hier ist es jetzt auch so, da sehen wir jetzt rechts unten auch übernehmen, also speichern."}, {"id": 832, "start": 6762.74, "end": 6764.74, "text": "Hier können wir tatsächlich was machen."}, {"id": 833, "start": 6764.74, "end": 6766.74, "text": "Das werden wir dann im 3D Mark gleich nach ausprobieren."}, {"id": 834, "start": 6766.74, "end": 6769.74, "text": "Das sieht auf jeden Fall schon mal vielversprechend aus."}, {"id": 835, "start": 6769.74, "end": 6772.74, "text": "Zeigt mal, was das Ding an Power hat."}, {"id": 836, "start": 6772.74, "end": 6776.74, "text": "Lautlos Modus und der Lautlos Modus muss ich auch sagen, funktioniert tatsächlich sehr, sehr gut."}, {"id": 837, "start": 6776.74, "end": 6780.74, "text": "Habt ihr natürlich deutlich weniger, als man von RAM nennt, von The Ashes, 1080p Ultra."}, {"id": 838, "start": 6780.74, "end": 6783.74, "text": "Hast du dir eigentlich schon mal den OPERA Gaming Browser angeschaut?"}, {"id": 839, "start": 6783.74, "end": 6785.74, "text": "Ja, den haben wir uns vor einem Jahr oder so schon angeschaut."}, {"id": 840, "start": 6785.74, "end": 6788.74, "text": "Ich habe nichts daran gefunden, wozu man den verwenden sollte."}, {"id": 841, "start": 6788.74, "end": 6793.74, "text": "Maximale Details mit 1080p, denn bei diesem Teil ist ein 1080p Monitor verbaut."}, {"id": 842, "start": 6793.74, "end": 6798.74, "text": "Es gibt es auch mit 4K, dann allerdings nur mit 60Hz, somit bis zu 240Hz."}, {"id": 843, "start": 6798.74, "end": 6800.74, "text": "Wow, cool!"}, {"id": 844, "start": 6800.74, "end": 6802.74, "text": "Was ein reines Gaming Gerät ist."}, {"id": 845, "start": 6802.74, "end": 6804.74, "text": "Das ist ja cool."}, {"id": 846, "start": 6804.74, "end": 6808.74, "text": "1080p 240Hz als Notebook, das ist cool."}, {"id": 847, "start": 6808.74, "end": 6814.74, "text": "Mit der 1080p Option, da sehen wir bei RAM nennt, von The Ashes, haben wir 137 FPS durchschnittlich"}, {"id": 848, "start": 6814.74, "end": 6817.74, "text": "und 1% Low League bei 98 FPS."}, {"id": 849, "start": 6817.74, "end": 6820.74, "text": "Das ist wirklich sehr, sehr gut und wirklich extrem flüssig."}, {"id": 850, "start": 6820.74, "end": 6822.74, "text": "Wirklich absolute maximale Details."}, {"id": 851, "start": 6822.74, "end": 6824.74, "text": "Ähnliches Bild haben wir bei Red Dead Redemption 2."}, {"id": 852, "start": 6824.74, "end": 6826.74, "text": "Jetzt ergibt das für mich auch einen Sinn."}, {"id": 853, "start": 6826.74, "end": 6830.74, "text": "Das Ding richtet sich wirklich an Leute, die wahrscheinlich viel unterwegs sind,"}, {"id": 854, "start": 6830.74, "end": 6834.74, "text": "allerdings trotzdem relativ viel Zeit haben zu spielen."}, {"id": 855, "start": 6834.74, "end": 6837.74, "text": "Keine Ahnung, du bist halt irgendjemand, der permanent unterwegs ist,"}, {"id": 856, "start": 6837.74, "end": 6840.74, "text": "in einem Hotel, dann irgendwie zwei Tage später in einem anderen Hotel,"}, {"id": 857, "start": 6840.74, "end": 6845.74, "text": "allerdings halt trotzdem abends Zeit hat zu spielen."}, {"id": 858, "start": 6845.74, "end": 6848.74, "text": "Ich weiß nicht, wie viele Leute es da gibt."}, {"id": 859, "start": 6848.74, "end": 6853.74, "text": "Und dann nimmst du halt so ein Ding mit, stellst es ins Hotel und dann kannst du abends dann deine"}, {"id": 860, "start": 6853.74, "end": 6857.74, "text": "World of Warcraft Rates machen."}, {"id": 861, "start": 6857.74, "end": 6865.74, "text": "P-Ultra, also maximale Details, durchschnittlich 94 FPS und 1% Low League bei 76 FPS."}, {"id": 862, "start": 6865.74, "end": 6867.74, "text": "Soweit erstmal kurz einfach nur zwei Einblicke."}, {"id": 863, "start": 6867.74, "end": 6870.74, "text": "Was kann man gametechnisch von diesem Gerät erwarten?"}, {"id": 864, "start": 6870.74, "end": 6874.74, "text": "Cinebench R20 ist klar, da ist ein 10900K drin."}, {"id": 865, "start": 6874.74, "end": 6876.74, "text": "Da gibt es keine Überraschungen."}, {"id": 866, "start": 6876.74, "end": 6880.74, "text": "Single Core Performance, wie gewohnt beim 10900K extrem hoch."}, {"id": 867, "start": 6880.74, "end": 6883.74, "text": "Haben wir hier 514, wenn das ganze Ding stock läuft,"}, {"id": 868, "start": 6883.74, "end": 6888.74, "text": "und 515, wenn ich einen Offset von minus 60 mV mache,"}, {"id": 869, "start": 6888.74, "end": 6891.74, "text": "damit die CPU ein kleines bisschen kühler bleibt."}, {"id": 870, "start": 6891.74, "end": 6896.74, "text": "Und der Multi-Core Score liegt knapp unter 6000 stock und knapp über 6000,"}, {"id": 871, "start": 6896.74, "end": 6900.74, "text": "wenn ich eben den kleinen Offset bei der CPU Spannung mache."}, {"id": 872, "start": 6900.74, "end": 6906.74, "text": "Ansonsten alles, wie erwartet, performenstechnisch bei Cinebench R20."}, {"id": 873, "start": 6906.74, "end": 6910.74, "text": "Wenn wir uns Adobe Premiere anschauen, also ein 4K-Video rausrendern,"}, {"id": 874, "start": 6910.74, "end": 6915.74, "text": "dann liegen wir hier knapp unter einem 3900X, der ja 12-Kerne hat,"}, {"id": 875, "start": 6915.74, "end": 6919.74, "text": "also einer Desktop-CPU, der noch ein sehr respektables Ergebnis."}, {"id": 876, "start": 6919.74, "end": 6923.74, "text": "Man muss dazu auch sagen, die 10900K-CPU, die hier verbaut ist,"}, {"id": 877, "start": 6923.74, "end": 6925.74, "text": "hat keine integrierte Grafikeinheit."}, {"id": 878, "start": 6925.74, "end": 6928.74, "text": "Also sie hat eine integrierte Grafikeinheit, weil es ein ganz normaler 10900K ist."}, {"id": 879, "start": 6928.74, "end": 6929.74, "text": "Aber es ist nicht rausgeführt."}, {"id": 880, "start": 6929.74, "end": 6931.74, "text": "Die Spannungsversäugung ist hier aber abgeschnitten."}, {"id": 881, "start": 6931.74, "end": 6935.74, "text": "Das heißt, sie wird nur die Kerne versäugt, einfach energiespartechnisch ist das sinnvoll."}, {"id": 882, "start": 6935.74, "end": 6939.74, "text": "Da spart man noch ein paar Watt ein, wenn man die interne Grafikeinheit von Intel nicht verwendet."}, {"id": 883, "start": 6939.74, "end": 6943.74, "text": "Dementsprechend gibt es aber auch kein Intel QuickSync, was einem vielleicht hier helfen würde."}, {"id": 884, "start": 6943.74, "end": 6951.74, "text": "Dementsprechend ist zum Beispiel das XMG Apex 15 mit dem 3950X 16-Kerner hier nochmal knapp eine Minute schneller."}, {"id": 885, "start": 6951.74, "end": 6954.74, "text": "Und damit würde ich sagen, wir machen kurz noch einen 3D Mark Times bei und versuchen,"}, {"id": 886, "start": 6954.74, "end": 6958.74, "text": "ob wir die GPU noch übertakten können, weil CPU übertaktet uns technisch nicht soweit."}, {"id": 887, "start": 6958.74, "end": 6960.74, "text": "Oder irgendwie."}, {"id": 888, "start": 6960.74, "end": 6963.74, "text": "Wo ist das für mich jetzt alles gleich mit?"}, {"id": 889, "start": 6963.74, "end": 6966.74, "text": "Gut, was auch immer, eigentlich ein ziemlich cooles Gerät."}, {"id": 890, "start": 6966.74, "end": 6972.74, "text": "Ich habe da zwar überhaupt keinen Anwendungszweck für, aber ich finde es cool, dass das gibt."}, {"id": 891, "start": 6972.74, "end": 6977.74, "text": "Und ich könnte mir vorstellen, es gibt durchaus Anwendungsbereiche dafür."}, {"id": 892, "start": 6984.74, "end": 6986.74, "text": "Was haben wir denn sonst noch?"}, {"id": 893, "start": 6986.74, "end": 6989.74, "text": "Switch console you should stay away from"}, {"id": 894, "start": 6995.74, "end": 7002.74, "text": "Hey, was geht alles? Es ist ETA Prime wieder zurück. Heute werden wir den Powkiddy X2 sehen."}, {"id": 895, "start": 7002.74, "end": 7006.74, "text": "Jetzt sieht man schon, dass das definitiv wie der Nintendo Switch aussehen kann."}, {"id": 896, "start": 7006.74, "end": 7008.74, "text": "Ich bin mir sicher, dass das genau das ist."}, {"id": 897, "start": 7008.74, "end": 7010.74, "text": "Es sieht Hardcore nach der Switch aus."}, {"id": 898, "start": 7010.74, "end": 7017.74, "text": "Aber die Button sehen nicht aus wie von der Switch."}, {"id": 899, "start": 7024.74, "end": 7030.74, "text": "Also, das ist doch garantiert nicht erlaubt. Das ist so eine Wish-Switch, Alter."}, {"id": 900, "start": 7030.74, "end": 7034.74, "text": "Also da hat Nintendo garantiert was dagegen."}, {"id": 901, "start": 7034.74, "end": 7041.74, "text": "Powkiddy, Powkiddy Play"}, {"id": 902, "start": 7044.74, "end": 7047.74, "text": "Ah, AliExpress, AliExpress"}, {"id": 903, "start": 7058.74, "end": 7060.74, "text": "Was kostet das? Ich muss jetzt mal da gucken."}, {"id": 904, "start": 7060.74, "end": 7064.74, "text": "Was? Powkiddy X2, was zum?"}, {"id": 905, "start": 7066.74, "end": 7071.74, "text": "Oh, oh, oh, huge Bewertung. AliExpress"}, {"id": 906, "start": 7075.74, "end": 7079.74, "text": "69. Hey, immerhin ein Viertel von der Switch."}, {"id": 907, "start": 7079.74, "end": 7083.74, "text": "Switch console you should stay away from"}, {"id": 908, "start": 7086.74, "end": 7087.74, "text": "Toll"}, {"id": 909, "start": 7098.74, "end": 7104.74, "text": "Die Buttons sehen schon leicht, äh, äh, minder wertiger aus als bei der Switch."}, {"id": 910, "start": 7104.74, "end": 7108.74, "text": "Auch hier oben die Buttons."}, {"id": 911, "start": 7115.74, "end": 7120.74, "text": "Aber das ist so krasser Switch-Gehäuse rip-off, das geht ja gar nicht."}, {"id": 912, "start": 7120.74, "end": 7126.74, "text": "Guck mal, wie schlecht hier unten das zusammengebaut ist, schlecht verarbeitet ist das Gehäuse."}, {"id": 913, "start": 7126.74, "end": 7131.74, "text": "White one, a black one and this kind of red and blue that really resembles the Nintendo Switch."}, {"id": 914, "start": 7131.74, "end": 7133.74, "text": "I opted for the red and blue version because..."}, {"id": 915, "start": 7133.74, "end": 7140.74, "text": "Das ist so ein typisches Geschenk, wenn der Enkel mit Opa und Oma in den Supermarkt geht und sagt"}, {"id": 916, "start": 7140.74, "end": 7145.74, "text": "Oma, Oma, ich will eine Switch haben und die Oma sagt, wieso, wir haben doch daheim eine."}, {"id": 917, "start": 7145.74, "end": 7152.74, "text": "Oder umgedreht, der Enkel kriegt zu Weihnachten eine Switch geschenkt und Opa und Oma hat sich halt eine Powkiddy X2 gekauft."}, {"id": 918, "start": 7152.74, "end": 7156.74, "text": "Denken, ja, das sieht doch aus wie eine Switch, das muss eine Switch sein."}, {"id": 919, "start": 7156.74, "end": 7183.74, "text": "Und dann können sie absolut nicht nachvollziehen, warum sich der Enkel nicht freut."}, {"id": 920, "start": 7186.74, "end": 7196.74, "text": "Okay, wenn da Games drauf sind, ist es halt eindeutig schon mal China Copyright gedürzt."}, {"id": 921, "start": 7196.74, "end": 7202.74, "text": "Was ist eigentlich auch das Soldier Boy-Konsole geworden?"}, {"id": 922, "start": 7202.74, "end": 7214.74, "text": "Okay, die Games sind schon komplett voll installiert drauf."}, {"id": 923, "start": 7214.74, "end": 7228.74, "text": "Erstmal die ganzen N64-Roms, die natürlich legit da drauf gekommen sind."}, {"id": 924, "start": 7228.74, "end": 7241.74, "text": "Da ist wahrscheinlich irgendein Retro-Pie oder so drin."}, {"id": 925, "start": 7241.74, "end": 7254.74, "text": "Game Boy, Game Boy Advance, Game Boy Color, Game Gear, Mega Drive, Neo Geo, Playstation 1 und Super Nintendo oder Super Famicom."}, {"id": 926, "start": 7254.74, "end": 7258.74, "text": "Und wir können jede eine dieser Game-Menu-Ikonen unterhalten und wir sehen die Games hier."}, {"id": 927, "start": 7258.74, "end": 7263.74, "text": "Es unterstützt Box-Art, aber es ist in einem seltsamen Format und es gibt auch viele Games, die Box-Art missen."}, {"id": 928, "start": 7263.74, "end": 7267.74, "text": "Wenn du eine lange Liste von Games wie für Super Nintendo hier hast, gehst du nach unten."}, {"id": 929, "start": 7267.74, "end": 7271.74, "text": "Viele von denen sind missen und ich habe das in der Vergangenheit gesehen mit anderen cheaperen Handhelds."}, {"id": 930, "start": 7271.74, "end": 7275.74, "text": "Es scheint mir so zu sein, dass sie nur 20 oder 25 geben, um es gut zu sehen."}, {"id": 931, "start": 7275.74, "end": 7279.74, "text": "Aber wenn du in der Liste runterkommst, ist alles missen."}, {"id": 932, "start": 7279.74, "end": 7281.74, "text": "Als Bildqualität ist es wirklich nicht so großartig."}, {"id": 933, "start": 7281.74, "end": 7286.74, "text": "Ich meine, es ist eine alles Plastik-Konstruktion und die wichtigsten Stücke sind die Analog-Sticks."}, {"id": 934, "start": 7286.74, "end": 7288.74, "text": "Das sind einige der schlimmsten, die ich jemals durchgekommen habe."}, {"id": 935, "start": 7288.74, "end": 7293.74, "text": "Das sind die Slider-Style-Analog-Sticks und ich habe das in der Vergangenheit gut gesehen, wenn es richtig implementiert wurde."}, {"id": 936, "start": 7293.74, "end": 7297.74, "text": "Aber diese sind so günstig, dass sie sich an sich befinden und es ist wirklich schwer, sie zu drücken."}, {"id": 937, "start": 7297.74, "end": 7300.74, "text": "Und nicht zu erwähnen, dass es nur zwei Trigger-Style-Analog-Sticks gibt."}, {"id": 938, "start": 7300.74, "end": 7302.74, "text": "Aber die Weise, wie sie diese aufsetzen, ist sehr seltsam."}, {"id": 939, "start": 7302.74, "end": 7304.74, "text": "Wenn du sie von oben drückst, werden sie nicht registriert."}, {"id": 940, "start": 7304.74, "end": 7306.74, "text": "Wenn du sie von links drückst, werden sie nicht registriert."}, {"id": 941, "start": 7306.74, "end": 7309.74, "text": "Du musst sie eigentlich an einen Angle drücken, um es zu funktionieren."}, {"id": 942, "start": 7309.74, "end": 7311.74, "text": "Und das ist wirklich nicht ein Deal-Breaker."}, {"id": 943, "start": 7315.74, "end": 7318.74, "text": "Aber die Analog-Sticks sind definitiv die schlimmsten, die ich jemals durchgekommen habe."}, {"id": 944, "start": 7318.74, "end": 7321.74, "text": "Und manchmal, wenn du spielst, locken sie eigentlich auf."}, {"id": 945, "start": 7321.74, "end": 7323.74, "text": "Und wenn sie auflocken, bedeutet das nicht, dass sie an sich befinden."}, {"id": 946, "start": 7323.74, "end": 7325.74, "text": "Es fühlt sich an, als ob es etwas in der Art ist."}, {"id": 947, "start": 7325.74, "end": 7329.74, "text": "Und du musst sie zurück- und dann weiter-drehen, um es zu funktionieren."}, {"id": 948, "start": 7329.74, "end": 7332.74, "text": "Also, nach dem Button-Layout, siehst du, wir haben diese Duell-Analog-Sticks,"}, {"id": 949, "start": 7332.74, "end": 7336.74, "text": "diese separaten D-Pads und sie benutzen die gleichen Knöpfe, wie sie die Aktionsknöpfe nutzen."}, {"id": 950, "start": 7336.74, "end": 7341.74, "text": "Das macht es ein bisschen schwerer, diese D-Pads zu setzten, weil die Knöpfe ein wenig hoch sind."}, {"id": 951, "start": 7341.74, "end": 7344.74, "text": "Auf dem Boden des Units haben wir zwei Mikro-USB-Ports."}, {"id": 952, "start": 7344.74, "end": 7347.74, "text": "Diese können für das Schargen oder das Schinken der Unit genutzt werden."}, {"id": 953, "start": 7347.74, "end": 7350.74, "text": "Oder du kannst auch Kontrollern verbinden, wenn du wirklich wollen."}, {"id": 954, "start": 7350.74, "end": 7352.74, "text": "Wir haben hier zwei Stücke."}, {"id": 955, "start": 7356.74, "end": 7358.74, "text": "65 Euro kostet das."}, {"id": 956, "start": 7358.74, "end": 7377.74, "text": "Sagt doch, es ist RetroPie, mehr oder weniger."}, {"id": 957, "start": 7389.74, "end": 7393.74, "text": "Wahrscheinlich, wenn es geschickt anstellt, kriegst du da wahrscheinlich auch ein Terminal."}, {"id": 958, "start": 7406.74, "end": 7408.74, "text": "Es ruckelt ein bisschen."}, {"id": 959, "start": 7410.74, "end": 7412.74, "text": "Oh, das ist schlecht."}, {"id": 960, "start": 7412.74, "end": 7422.74, "text": "Ja, okay, wenn die Buttons nicht funktionieren, ist es natürlich schon mal komplett RIP, das Ding."}, {"id": 961, "start": 7422.74, "end": 7435.74, "text": "Also, wenn Buttons nicht funktionieren, ist es halt komplett RIP."}, {"id": 962, "start": 7452.74, "end": 7466.74, "text": "Ja, aber es ist trotzdem Müll. Also, wenn Buttons nicht registriert werden, kann man es vergessen."}, {"id": 963, "start": 7466.74, "end": 7495.74, "text": "Übrigens, wo wir wieder beim Thema sind, ich wollte doch schon seit einer ganzen Weile meine Playstation Vita im Stream flashen und gucken, was man damit mittlerweile anfangen kann."}, {"id": 964, "start": 7495.74, "end": 7499.74, "text": "Na gut, okay, es ist Crap im Endeffekt. Unter dem Strich kann man sagen, es ist Müll."}, {"id": 965, "start": 7502.74, "end": 7507.74, "text": "Es ist halt, es ist halt kompletter Müll. Und, und, dass es aussieht wie eine Switch, setzt dem Ganzen noch mal die Krone auf."}, {"id": 966, "start": 7510.74, "end": 7516.74, "text": "Das ist so eine typische Switch von Wish. Wish-Switch."}, {"id": 967, "start": 7516.74, "end": 7523.74, "text": "So, was haben wir denn sonst noch? What do alien civilizations look like? Auf geht's."}, {"id": 968, "start": 7523.74, "end": 7537.74, "text": "A big brain time, Leute, a big brain time."}, {"id": 969, "start": 7554.74, "end": 7565.74, "text": "Also, sollten wir jemals Aliens finden, das was mich am ehesten interessieren würde ist, wie sieht Twitch bei den Aliens aus? Was ist das Gegenstück von TwitchTV bei den Aliens?"}, {"id": 970, "start": 7565.74, "end": 7582.74, "text": "Und was, und was ist dort das beliebteste Lach-Emote? Das ist eigentlich das, was mich wirklich interessiert. Was ist das Gegenstück von Lulvee und Kegvee bei den Aliens?"}, {"id": 971, "start": 7582.74, "end": 7590.74, "text": "Guck mal, Void-Danny hat das neue Emote gefunden."}, {"id": 972, "start": 7612.74, "end": 7616.74, "text": "Naja."}, {"id": 973, "start": 7616.74, "end": 7624.74, "text": "Naja, also wenn ich bei uns mal so rumgucke, habe ich das Problem, dass wir uns nicht mehr umsetzen können."}, {"id": 974, "start": 7624.74, "end": 7651.74, "text": "Naja, also wenn ich bei uns mal so rumgucke, habe ich das Problem, bei den meisten Leuten überhaupt davon zu sprechen, dass sie eine intelligente Spezies sind."}, {"id": 975, "start": 7654.74, "end": 7674.74, "text": "Minecraft. Nur in echt."}, {"id": 976, "start": 7684.74, "end": 7701.74, "text": "So, es ist sinnvoll, zu sagen, dass die Aliens, die sich über ihre Heimplaneten übernehmen, auch solche Qualitäten haben. Und wenn die Aliens die gleichen Physik-Läden folgen müssen, dann gibt es eine measurable Metrik für den Prozess, Energie-Nutzung."}, {"id": 977, "start": 7701.74, "end": 7717.74, "text": "Human-Progress kann sehr präzise von der Energie, die wir aus unserem Umfeld getragen haben, und wie wir es nutzbar gemacht haben, um Dinge zu tun. Wir begannen mit Muskeln, bis wir gelernt haben, Feuer zu kontrollieren. Dann haben wir Maschinen gemacht, die kinesische Energie aus Wasser und Wind genutzt haben."}, {"id": 978, "start": 7717.74, "end": 7732.74, "text": "Als unsere Maschinen verbesserten und unser Wissen von Materialen expanded, begannen wir, die konzentrierte Energie aus sterben Pflanzen aus dem Boden herzusteigen. Als unsere Energiekonsumption exponentiell größer wurde, so wurden die Abilitäten unserer Zivilisation."}, {"id": 979, "start": 7732.74, "end": 7747.74, "text": "Zwischen 1800 und 2015 hat die Population die 7-Folge erhöht, während die Menschheit 25-mal mehr Energie konsumte. Es ist möglich, dass dieses Prozess weiter geht."}, {"id": 980, "start": 7747.74, "end": 7762.74, "text": "Nach diesen Faxen hat der Wissenschaftler Nikolai Kardashev eine Methode entwickelt, um Zivilisationen zu kategorisieren, z.B. Kave-Dwellern oder Götter der Galaxien zu regeln. Die Kardashev-Szene ist eine Methode, um die Zivilisationen zu rankieren, durch ihre Energie-Nutzung."}, {"id": 981, "start": 7762.74, "end": 7775.74, "text": "Die Szene wurde über die Jahrzehnte verbessert, aber im Allgemeinen wird sie Zivilisationen in vier verschiedenen Kategorien verwendet. Eine Type-1-Zivilisation kann die zahlreiche Energie ihrer Heimatplaneten benutzen."}, {"id": 982, "start": 7775.74, "end": 7799.74, "text": "Eine Type-2-Zivilisation kann die zahlreiche Energie ihrer Star- und Planeten-Systeme benutzen. Eine Type-3-Zivilisation kann die zahlreiche Energie ihrer Galaxien benutzen. Eine Type-4-Zivilisation kann die zahlreiche Energie von verschiedenen Galaxien benutzen."}, {"id": 983, "start": 7799.74, "end": 7807.74, "text": "Diese Niveau verbreiten sich in ordentlichen Größen. Es ist wie eine Ant-Kolonie zu einer menschlichen Metropolitän-Area."}, {"id": 984, "start": 7807.74, "end": 7812.74, "text": "An Anten sind wir so komplex und zahlreiche, dass wir vielleicht auch Götter sein könnten."}, {"id": 985, "start": 7812.74, "end": 7816.74, "text": "Um die Szene mehr nötig zu machen, brauchen wir Sub-Kategorien."}, {"id": 986, "start": 7816.74, "end": 7829.74, "text": "Am unteren Ende des Spektrums gibt es Type-0- zu Type-1-Zivilisationen. Alles, was wir in den nächsten Jahrzehnten erreichen können, von Hunter-Gathererinnen und Hunter-Gathererinnen. Diese können in der Milky Way eigentlich sehr viele sein."}, {"id": 987, "start": 7829.74, "end": 7842.74, "text": "Aber eine Zivilisation, die nicht aktiv Radio-Signale in das Allgemeine verwendet, könnte so nahe wie unser neuestes steller Nachbar, das Alpha Centauri-System, sein, und wir hätten keine Weise, dass sie existieren würden."}, {"id": 988, "start": 7842.74, "end": 7847.74, "text": "Aber auch wenn sie Radio-Signale verwendet haben, wie wir es tun, könnte es nicht sehr hilfreich sein."}, {"id": 989, "start": 7847.74, "end": 7849.74, "text": "Auf einer Interstellarscale..."}, {"id": 990, "start": 7856.74, "end": 7858.74, "text": "... ist es praktisch unbekannte."}, {"id": 991, "start": 7858.74, "end": 7866.74, "text": "Unsere Signale können über ein beeindruckendes 200 Lichtjahre aussteigen, aber das ist nur eine kleine Faktion der Milky Way."}, {"id": 992, "start": 7866.74, "end": 7891.94, "text": "Etwas sch"}, {"id": 993, "start": 7891.94, "end": 7897.06, "text": "die Komposition und Temperatur der Atmosphäre, wenn es weitergeht und wir"}, {"id": 994, "start": 7897.06, "end": 7904.98, "text": "nicht die Erde unhabitabel machen, werden wir eine volle Type 1-Zivilisation in den nächsten"}, {"id": 995, "start": 7904.98, "end": 7910.42, "text": "wenigen hundert Jahren. Jede Zivilisation, die eine Type 1 wird, ist verbunden, außerhalb zu schauen,"}, {"id": 996, "start": 7910.42, "end": 7914.02, "text": "weil es wahrscheinlich immer noch ein interessantes, kompetitives, gruseliger und"}, {"id": 997, "start": 7914.02, "end": 7919.06, "text": "Expansionist ist. Der nächste vernünftige Schritt zur Transition zu Type 2 ist,"}, {"id": 998, "start": 7919.06, "end": 7924.58, "text": "andere Planeten und Bodies zu altern und zu minieren. Das könnte mit Ausflug in"}, {"id": 999, "start": 7924.58, "end": 7928.26, "text": "dem Raum beginnen, eine Transition zu Infrastruktur und Industrie nahe den Heimplaneten,"}, {"id": 1000, "start": 7928.26, "end": 7932.9, "text": "nach Kolonien zu gehen und mit Terraformen anderen Planeten zu enden, indem sie ihre Atmosphäre,"}, {"id": 1001, "start": 7932.9, "end": 7937.9, "text": "ihre Rotation oder Position verändern. Sobald eine Zivilisation weiterentwickelt und mehr und mehr"}, {"id": 1002, "start": 7937.9, "end": 7943.54, "text": "Stoff und Raum nutzt, wird die Energieverbrauchung mit ihnen verwendet. So werden sie irgendwann auf"}, {"id": 1003, "start": 7943.54, "end": 7948.42, "text": "das größte Projekt, das eine Type 2-Zivilisation anbieten kann, angeboten werden. Die Energie"}, {"id": 1004, "start": 7948.42, "end": 7954.9, "text": "ihrer Star wird durch einen Dyson-Swarm gebaut. Nachdem diese Megastruktur fertig ist, wird die Energie"}, {"id": 1005, "start": 7954.9, "end": 7960.5, "text": "praktisch unbedeutigt für das Heimsystem, wie sie sich befinden. Wenn sie immer noch"}, {"id": 1006, "start": 7960.5, "end": 7966.34, "text": "interessiert, kompetitiv, gruselig und Expansionist sind und nun komplett in Kontrolle über ihr Heimsystem,"}, {"id": 1007, "start": 7966.34, "end": 7971.38, "text": "die steile Infrastruktur und die Energieverbrauchung einer Star sind, bewegt der nächste Frontier"}, {"id": 1008, "start": 7971.38, "end": 7977.22, "text": "zu anderen Starrn, ein paar Jahre entfernt. Für eine Type 2-Zivilisation wird die Distanz zu anderen Starrn"}, {"id": 1009, "start": 7977.22, "end": 7982.5, "text": "wie die Distanz zwischen der Erde und Pluto zu uns, heute. Technisch innerhalb von Reichen,"}, {"id": 1010, "start": 7982.5, "end": 7986.1, "text": "aber nur mit enormen Investitionen in Bezug auf Zeit, Ingenieurität und …"}, {"id": 1011, "start": 7986.1, "end": 7989.14, "text": "Ah, easy, fahren wir mal einfach unser komplettes Sonnensystem weg."}, {"id": 1012, "start": 7989.14, "end": 7995.86, "text": "… und Ressourcen. Dies beginnt ihre Transition in Richtung Type 3. Dieser Schritt ist so weit"}, {"id": 1013, "start": 7995.86, "end": 8000.5, "text": "über uns, dass es hart wird, zu vorstellen, was genau diese Herausforderungen aussehen und"}, {"id": 1014, "start": 8000.5, "end": 8007.3, "text": "wie sie lösen werden. Wissen sie, ob sie eine Lösung finden können zu den großen Distanzen und Zeitungen von Hunderten oder Tausenden"}, {"id": 1015, "start": 8007.3, "end": 8013.22, "text": "Jahren? Wissen sie, ob sie kommunizieren können und eine gescheite Kultur und Biologie zwischen Kolonien"}, {"id": 1016, "start": 8013.22, "end": 8018.66, "text": "und Light-Years-Aparten halten? Oder werden sie in verschiedene Type-2-Zivilisationen verbreitet werden?"}, {"id": 1017, "start": 8018.66, "end": 8025.06, "text": "Also das erste, was passiert, wenn wir, also mal angenommen, wir würden irgendeine Kolonie auf dem,"}, {"id": 1018, "start": 8025.06, "end": 8030.74, "text": "frag mich nicht, Mars oder sonst wo gründen, das erste, was passieren würde, ist nach, keine Ahnung,"}, {"id": 1019, "start": 8030.74, "end": 8036.02, "text": "drei, vierhundert Jahren werden wir uns bekriegen gegenseitig. Das ist das Beste, was wir können und"}, {"id": 1020, "start": 8036.02, "end": 8040.74, "text": "das ist alles der ersten Sache, die wir machen werden. Und da kommen dann die Mars-Leute und sagen, wir sind"}, {"id": 1021, "start": 8040.74, "end": 8044.18, "text": "die Geilsten, weil wir von Mars sind. Da kommen die Leute von der Erde und sagen, wir sind die Geilsten,"}, {"id": 1022, "start": 8044.18, "end": 8048.02, "text": "weil wir von der Erde sind. Und da gibt es auch irgendwelche Splitter-Gruppen, die sagen, wir sind"}, {"id": 1023, "start": 8048.02, "end": 8052.74, "text": "die Geilsten, weil wir aus Offenbach sind. Und da werden wir uns erstmal die Körbe einschlagen, bis"}, {"id": 1024, "start": 8052.74, "end": 8057.94, "text": "vor dem einen Planet nicht mehr viel lubriert ist. Weil das, das können wir."}, {"id": 1025, "start": 8057.94, "end": 8065.46, "text": "Oh, ich hab letzte Woche auch Dark Matter kontrolliert."}, {"id": 1026, "start": 8087.94, "end": 8092.74, "text": "Die Type-2-Zivilisation könnte bereits die Menschheit zu primitiv sein, um sogar zu reden."}, {"id": 1027, "start": 8093.54, "end": 8098.46, "text": "Eine Type-3-Zivilisation könnte sich so fühlen, als würden wir die Bakterien auf der"}, {"id": 1028, "start": 8098.46, "end": 8103.46, "text": "Anteile leben. Vielleicht würden sie uns nicht sogar bewusst sein oder unsere Survival relevant sein."}, {"id": 1029, "start": 8104.26, "end": 8110.42, "text": "Wir könnten nur hoffen, dass sie gute Götter sind. Aber die Skala endet nicht unbedingt hier."}, {"id": 1030, "start": 8111.14, "end": 8115.3, "text": "Einige Wissenschaftler suggerieren, dass es Type-4- und Type-5-Zivilisationen gibt,"}, {"id": 1031, "start": 8115.3, "end": 8119.22, "text": "die Influenzen über Galaxie- oder Super-Klustern streicheln."}, {"id": 1032, "start": 8119.22, "end": 8123.06, "text": "Strukturen mit Tausenden Galaxien und Trillionen Star."}, {"id": 1033, "start": 8123.94, "end": 8130.74, "text": "Endlich könnte es eine Type-Omega-Zivilisation sein, die das ganze Universum und möglicherweise"}, {"id": 1034, "start": 8130.74, "end": 8136.1, "text": "andere manipulieren kann. Type-Omega-Zivilisationen... Type-Omega jetzt übertreiben, ist es aber."}, {"id": 1035, "start": 8136.1, "end": 8140.26, "text": "Omega null....können eigentlich die Kreaturen unseres Universums sein,"}, {"id": 1036, "start": 8140.26, "end": 8146.02, "text": "für Gründe über unsere Verständnis. Vielleicht waren sie einfach bunt. So flott wie diese"}, {"id": 1037, "start": 8146.02, "end": 8150.74, "text": "Klassifikation könnte es sein, ist dieses Gedanke-Experiment uns bereits interessante Dinge zu erzählen."}, {"id": 1038, "start": 8151.54, "end": 8156.18, "text": "Wenn unsere Ideen über die Natur der Spezies, die Interstellar-Zivilisationen sind,"}, {"id": 1039, "start": 8156.18, "end": 8159.54, "text": "irgendwie korrekt sind, dann können wir ziemlich sicher sein, dass es keine"}, {"id": 1040, "start": 8159.54, "end": 8162.98, "text": "Zivilisationen von Type-3 und mehr neben der Milky Way sind."}, {"id": 1041, "start": 8163.7, "end": 8168.58, "text": "Die Influenzen würden in aller Wahrheit so allaufregend sein und ihre Technologie so weit"}, {"id": 1042, "start": 8168.58, "end": 8171.14, "text": "über unseren eigenen... Ja, okay, das zum Glück nicht."}, {"id": 1043, "start": 8172.18, "end": 8176.42, "text": "Die Galaxie sollte mit ihrer Aktivität in tausenden Star-Systemen flaschen."}, {"id": 1044, "start": 8177.14, "end": 8181.3, "text": "Wir sollten sehen oder entdecken ihre Artifaktien oder Bewegungen zwischen verschiedenen"}, {"id": 1045, "start": 8181.3, "end": 8186.5, "text": "Teilen ihres Empires sehen. Obwohl eine Type-3-Zivilisation in der Vergangenheit existiert"}, {"id": 1046, "start": 8186.5, "end": 8192.18, "text": "und ein mysteriöses Tod ermordet, sollten wir einiges der Remanenzen ihres Empires entdecken können."}, {"id": 1047, "start": 8192.74, "end": 8197.22, "text": "Aber als Wissenschaftler sahen, fanden sie keine Remanenzen von gebrannten Stars,"}, {"id": 1048, "start": 8197.22, "end": 8201.78, "text": "zerstörenden Megastrukturen oder Schmerzen von großen Interstellar-Wars."}, {"id": 1049, "start": 8202.5, "end": 8205.3, "text": "Also sind sie sehr wahrscheinlich nicht da draußen und nie waren sie."}, {"id": 1050, "start": 8205.86, "end": 8209.46, "text": "In einem Sinne ist das sehr traurig, aber auch sehr erheblich."}, {"id": 1051, "start": 8210.02, "end": 8213.62, "text": "Es lässt die Galaxie uns und andere ähnlich zu uns."}, {"id": 1052, "start": 8214.9, "end": 8217.62, "text": "Also, die am meisten erheblichen Zivilisationen zu suchen,"}, {"id": 1053, "start": 8217.62, "end": 8221.86, "text": "sind vielleicht irgendwo im Spektrum von Type-1.5 bis Type-2.5."}, {"id": 1054, "start": 8222.5, "end": 8225.86, "text": "Sie würden nicht zu vorausgehen, um sie zu verstehen und ihre Motiven."}, {"id": 1055, "start": 8225.86, "end": 8228.58, "text": "Vielleicht haben sie ihre ersten Megastrukturen beendet."}, {"id": 1056, "start": 8231.78, "end": 8235.7, "text": "Und sie könnten in dem Prozess von Bewegungen zwischen Stars und"}, {"id": 1057, "start": 8235.7, "end": 8238.74, "text": "Transmissionen von enormen Mengen von Informationen in den Raum,"}, {"id": 1058, "start": 8238.74, "end": 8240.58, "text": "aus Unwahrheit oder auf Zweck."}, {"id": 1059, "start": 8241.3, "end": 8244.74, "text": "Sie würden wahrscheinlich auch zu den Stars suchen und für andere suchen."}, {"id": 1060, "start": 8245.46, "end": 8247.46, "text": "Dann noch einmal, vielleicht haben wir es alles falsch."}, {"id": 1061, "start": 8248.02, "end": 8253.38, "text": "Vielleicht gibt es einen Prozess zu Type-2, der nicht zuvielführend ist und die Menschheit"}, {"id": 1062, "start": 8253.38, "end": 8256.18, "text": "ist immer noch zu unbekannte, um es anders zu vorstellen."}, {"id": 1063, "start": 8257.3, "end": 8261.38, "text": "Für jetzt wissen wir wirklich, dass wir noch nie jemanden gesehen haben."}, {"id": 1064, "start": 8261.38, "end": 8264.02, "text": "Aber wir haben nur angefangen zu schauen."}, {"id": 1065, "start": 8266.34, "end": 8270.1, "text": "Bis wir endlich freundliche Super-Aliens finden und sie fragen,"}, {"id": 1066, "start": 8270.1, "end": 8283.78, "text": "um die Regeln unseres Universums zu erklären, müssen wir die meisten von uns beobachten."}, {"id": 1067, "start": 8300.1, "end": 8304.5, "text": "Das erste, was ich mir angucken würde, ist das Alien-Pornhub und gucken, was da so abgeht."}, {"id": 1068, "start": 8306.5, "end": 8310.58, "text": "Zeig mir dein Pornhub und ich weiß, wer du bist."}, {"id": 1069, "start": 8312.26, "end": 8314.26, "text": "Da weißt du sofort Bescheid."}, {"id": 1070, "start": 8314.26, "end": 8316.26, "text": "Da weißt du gleich, mit wem du es da zu tun hast."}, {"id": 1071, "start": 8317.38, "end": 8322.1, "text": "Du musst gar keine langen Analysen machen, du musst einfach nur den Alien-Internet-Verlauf"}, {"id": 1072, "start": 8322.1, "end": 8324.9, "text": "auswerten und dann weißt du, was du da am Start hast."}, {"id": 1073, "start": 8324.9, "end": 8327.94, "text": "So, Leute, ich geh jetzt was zu essen machen, ich hab Hunger."}, {"id": 1074, "start": 8335.22, "end": 8337.22, "text": "Was gibt's wahrscheinlich? Spaghetti."}, {"id": 1075, "start": 8340.34, "end": 8342.9, "text": "Wahrscheinlich Spaghetti ohne großartigen Kram dabei."}, {"id": 1076, "start": 8342.9, "end": 8344.9, "text": "Gucken."}, {"id": 1077, "start": 8345.94, "end": 8348.74, "text": "Also bis denn, wir sehen uns, ich hab Hunger."}, {"id": 1078, "start": 8348.74, "end": 8355.06, "text": "Macht's gut, see you."}]}