{"text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal.Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal.I remember typing Dan's game, forehead swift rage, PJ salt and failfish.Life was easy, spamming all the time, TOS was nowhere, so everyone's feeling fine, twitchy molds from long ago.Kokona made you feel you're not alone, Kappa Pock jammed, keep a forehead, Bible thumb, twitchy molds.Still hear his bark in the morning hour, he calls me, his doggy emote reminds me of a time far away.Looking at a chat, I get a feeling that I miss emotes from yesterday, yesterday.Twitchy molds from long ago made you feel you're not alone, Kappa Pock jammed, cap is Kappa Bible thumb.Twitchy molds, perfect hands, twitchy molds, Bible thumb.Crisis, crisis remastered, crisis remastered.Okay, also ich will kein Testvideo gucken, ich will ehrlich gesagt einfach nur wissen, was rausgekommen ist.Äh, gibt's nicht, ja.Boah, 22 Minuten, what the f***, osartische Unterschied wird's nicht sein, oder?Haben die da, ich glaub nicht, dass die da viel gemacht haben.Oder ist das ein Remastered, was man als Remastered wirklich durchgeht?Und nicht einfach nur ein paar Texturen ausgetauscht, durchwachsen, okay?Gucken wir mal, ähm.Crisis Remastered, Switch?Dazu kann ich eigentlich nur das hier sein.Auf der Switch, Alter.Das geht aber nicht.Okay, es kommt nicht gut weg.Warum nicht? Weil?Weil ich mal muss ja sagen, mittlerweile läuft Crisis ja wirklich auf fast allem.Man darf doch nicht vergessen, das Spiel ist ja von, von wann ist Crisis? 2005? Oder so?Ah nee, 2007.Also ist ja schon mal nur 13 Jahre alt, also mittlerweile läuft es ja wirklich überall drauf.Index Optimization, no gameplay improvements, da fand ich irgendwie, es war ein bisschen hakelig, ja.Das war aber Far Cry auch, und ich fand's gar nicht so übel.Wie man kann kein Manual Save mehr machen, das war eigentlich das Geilste, auch gerade in Far Cry.Far Cry, äh, wobei, warte mal, hatte Far Cry Manual Saves? Ich bin grad gar nicht, bin mir da gar nicht so sicher, gerade ob Far Cry.Nee, Far Cry hatte keine Manual Saves, oder? Zumindest hatte Far Cry Save Points, das weiß ich noch.Ich weiß aber nicht, ob es zu, zu......setzlich Manual Saves hatte. Es hat auf jeden Fall Save Points.The Worst Remaster in Gaming, ich dachte das ist, äh, Warcraft 3 Deforged schon.Also das ist ja schon, also man muss ja sagen, das ist ja eigentlich ein Feature, ne?Das ist ja eigentlich schon ein Feature, also, dass die Performance schlecht ist.Das muss ja bei Far Cry so sein, äh, bei, bei Crysis so sein, sonst, sonst wäre das ja kein Crysis.Die Leute finden schlecht.Ah ja, alles klar. Keine Comrades am Start.Ich wollte, ich wollte, ich wollte, ich wollte gerade, ich wollte gerade sagen, die Russen sind ja auch mal wieder die einzigen, die auf einer internationalen Seite die Sachen in Russisch schreiben.Und was sehe ich als nächstes? Schlechter Konsolenport.So, also, dann muss ich das jetzt ja weiter...Die Russen und die Deutschen sind hier die einzigen, die auf einer internationalen Seite das Ganze in Deutsch und Russisch schreiben.So, weil man ja noch nicht mal auf der Seite irgendwie die Reviews per Sprache kennzeichnen kann.Besser als das Prince of Persia Remaster. Das kenne ich gar nicht.Das ist wahrscheinlich auch nicht, nicht schlimm.Es fehlt ein Level aus dem Original. Jetzt die Frage, hatten die nicht auf den Konsolen?Gab es nicht auf dem Konsolenrelease irgendein extra Level?Nee, umgedreht. Auf dem Konsolenrelease haben sie das Flugzeuglevel rausgemacht oder irgendwie sowas, ne?Ich kann mich da gar nicht mal richtig dran erinnern. Das ist schon, schon, schon ewig her.Mein 13er-Jahr ist das, gell, mal, weiß ich nicht mehr.Weiß ich nur, dass es, dass die Erweiterung kacke war. Warhead war übelst freudig.Man kann sich auch darüber streiten, ob das letzte Viertel so von oder Drittel, oder was kann man genau sagen, das war mit den Aliens in Crysis jetzt so geil war.Edge in the Tasteless ist nicht nur Edge, der neue Edge.Excellent. Nein.Nein. Das muss aber so sein, weil in Far Cry 1 wohlgemerkt, Far Cry 1 war das einzige Far Cry von Crytek, da hatten sie ja am Ende auch jede Menge Aliens drin.Und es waren, glaube ich, Mutanten in Far Cry, da kommt das gleiche raus. Das hat sich auch doof gespielt.Und letztens von Ubisoft angekündigt. Okay.Wollten wir uns nicht die neuesten C-Sharp-Features angucken irgendwann?Irgendjemand hat das gepostet und hat gemeint, ich soll auf jeden Fall warten, bis er wieder da ist, weil ihn interessiert, was ich sag.Weiß ich nicht, ob der diejenige da ist.So, also, das erste, was wir uns heute angucken werden, ist das hier.Da bin ich nämlich mal gespannt, was er dazu sagt.Nein, nein, nein. Moment. Ja, das da.Das ist das erste, was wir uns angucken werden, was Fortunet sagt zu Black Ops.Da bin ich mal gespannt. Er fand in Modern Warfare kacke.Und ich bin mal gespannt, was er zu Black Ops sagt.Also, was ich so mitbekommen habe, was ich so mitbekommen habe, ich hab's nicht gespielt, ich werd's auch nicht spielen, weil das ist auf der PS4 und ich hab zwei linke Hände am Playstation-Controller.Ich krieg's da mittlerweile mit dem Xbox-Controller schon gar nicht mehr richtig hin.Ich bin einfach zu PCMR mittlerweile.Und die einzige Variante, die ich hätte, ich könnt Maus-Tastatur anschließen.An die Playstation 4, aber auf der alten Playstation 4, ich hab ja nicht mal die Pro, ich hab ja die Release-Date-Konsole, die ich vielleicht fünf Stunden lang hatte.Das spielt sich extrem laggy mit Maus-Tastatur.Ganz merkwürdig. Das kann man irgendwie ganz, ganz schwierig steuern.So, und, ähm...Die nächste Variante wäre, ich cheate quasi und schließ mein Maus zu Controller-Converter an.Dann hätt ich Auto-Aim und besseres, besseres In-Game-Feeling.Aber das wäre ja quasi schon fast illegal. Nee, ist das nicht.Also ich mach ja nix dagegen, aber es ist trotzdem nicht so schön.Deswegen guck ich mir erstmal an, was die anderen Leute zu sagen haben.Also was ich so gelesen hab, auf Twitter ist vernichtend.Ja.Also Waffen-Sounds müssen ganz mies sein.Es muss immer noch rumgeschwitzt, beziehungsweise, also das ist ja nicht das Problem, immer rumgecampt werden erst, fuck.Also sagen wir mal defensiv gespielt werden ohne Ende.Es hockt wohl immer noch in jeder Ecke einer.Also es ist eher so eine Art Modern Warfare im Kalten Krieg als wohl ein Black Ops, so wie man sich das erwartet hat.Und es muss sehr, sehr unfertig sein und sich auch dementsprechend komplett unfertig spielen.Natürlich hast du die üblichen Diskussionen, die hast du ja die letzten 13 Jahre schon.Und die letzten 10 Jahre, seit ich den Kram schon mache, hast du die gleichen Diskussionen ja.Die kommen raus, die Leute sagen, haha, ja, das ist deine Alpha.Ja, aber guck dir mal Leute, es ist Ende September.Das Game kommt in zwei Monaten ungefähr raus.Ich weiß gar nicht wann Release Date ist.Ja, es kommt ungefähr in zwei Monaten raus.Da tut sich nicht mehr viel.Da ist am Ende zwar ein bisschen mehr Content drin.Aber das ist wie in Modern Warfare, wo auch Alexander Horomaks, das ist nur eine Beta.Das ist genauso am Ende geworden.Das sind alles Promotion Alpha Betas.Also die wollen das promoten und die wollen vielleicht mal gucken, dass die Server irgendwie halten oder so.Also zumindest laut Twitter ist das mega, mega schlecht.Ich kann dazu nichts sagen, ich hab's nicht ausprobiert.Allerdings ging mir der Modern Warfare Multiplayer ziemlich auf den Keks.In Modern Warfare kam aber auch noch dazu, dass ein Großteil der Maps einfach nur extrem mies war.Du hattest Maps wie, ähm, irgendwie Palace, irgendwas, ich weiß gar nicht wie das Ding genau heißt.So ein riesen Map, wo du dich gar nicht drauf findest und wenn du findest sitzt da irgendein Typ im Fenster und guckt seit fünf Minuten da raus.Die besten Spielmodi waren, als die auf die Idee gekommen sind und die kleineren Maps in so ein Playlist gepackt haben.Das Problem war daran nur, dass die dort auch Shipment reingepackt haben und Shipment ist halt keine Map.Shipment ist halt das, was ein Level Design, das muss doch nicht mal ein Praktikant, was ein absoluter Level Design Noob in der ersten halben Stunde in einem Level Editor macht.Das ist Shipment.Und warum das überhaupt, das hat absolut keine Existenzberechtigung überhaupt in diesem Spiel zu sein.Warum das in Call of Duty 4 war, weiß ich nicht. Da war es aber glaube ich nur eine Mini in your face, free for all Map und sonst nix.Also, du hast so Sachen wie Asia Cave, übelst Müll.Dann hast du...Kann ich mich gar nicht mehr dran erinnern. Superstore, auch absolut grausam.Remake geht halbwegs auch grausam.Auch viel zu groß. Eine der schlimmsten Maps überhaupt.Hardhat geht tatsächlich ganz gut, wobei ja auch halt viel. Man den Unterschied zu MW3 merkt, worum geliegen wird.Die geht auch noch halbwegs. Gunrunner ist eigentlich, finde ich somit, die beste Map.Sagt mir jetzt gerade aus dem Kopf nix, sagt mir jetzt auch nix. Oh, Piccadilly ist ja noch schlimmer.Also hier jagt ja ein Map Highlight das andere. Sagt mir jetzt auch nix. Rust, kannst du auch komplett knicken, das ist ja auch keine Map, die man spielen soll.Scrapyard ist auch mega schlimm geworden. Shipment ist schon immer für'n Arsch.Shoothouse ist es tatsächlich ganz gut. Sagt mir jetzt auch grad nix.Backload ging auch halbwegs. Wacom auch halbwegs. Die Hälfte der Maps ist absoluter Schrott und da sind vielleicht zwei, drei gute Maps dabei.Also ich weiß nicht wie das in Black Ops ist. Musst du uns mal angucken, was er dazu sagt. Bin ich wirklich mal gespannt.Okay, okay, okay. Nein, dann gilt das nicht, weil das erste Game ist noch bevor Skill-Based Matchmaking reinkickt. Der wird jetzt übelst zerstören und sich mega freuen über das Game.Und nach der dritten Runde hat er keinen Bock mehr. Ich seh's kommen, 100%.Okay, es ist ein Modern Warfare Reskin. Es ist jetzt wirklich das erste Mal, dass ich in-game sehe. Ich hab mir nichts angeguckt dazu.Okay, es ist einfach mal Modern Warfare Waffenauswahl reskinnt.Laut genug oder?Laut genug.Das ist aber so krass Modern Warfare Waffenauswahl reskinnt.Das ist aber so krass Modern Warfare Waffenauswahl reskinnt.Das ist aber so krass Modern Warfare Waffenauswahl reskinnt.Auch der Player-Screen hier. Das ist Modern Warfare Reskin as fuck. Das sieht ja überhaupt nicht wie dein eigenes Game aus.Das ist Original. Das ist einfach der Modern Warfare Reskin. Du siehst das alles, wie das hier aufgebaut ist und so.Klar, das sind andere Models, aber der Style ist original. Das ist original Modern Warfare.Mich würd sogar nicht wundern, wenn es die gleiche Schrift da ist, aber da bin ich mir jetzt nicht ganz sicher.Ja, ja. Mach mal langsamer.Auch die Intro-Videos?Es sieht ein bisschen verschwommen aus.Warum heißt es Dingalo SA-12 und nicht SPAS-12? Haben die wieder nur teilweise Waffenlizenzen gekriegt? Weil die MP5 heißt MP5.Die haben bestimmt wieder nur teilweise Waffenlizenzen bekommen. Anders konnt ich mir das nämlich in Modern Warfare auch nicht erklären.Es sieht ein bisschen aus wie, äh, nicht Silk Road Battlefield 1 Map. Ja, du hast recht. Ich weiß aber auch nicht, wie die heißt.Die wo Rush so mega gesackt hat, weil hier so ein Gebirge war. Weiß nicht. Ich weiß gerade aus dem Kopf nicht, wie die Map heißt. Ich hab Battlefield 1 nicht richtig gespielt.Aber du hast recht. Es sieht wirklich ähnlich aus wie die Battlefield 1 Map. Sinai Desert, ja, genau.Ja, gut. Er hat einen Gegner gefunden.Das ist... Das ist vor... Das ist vor Skill-Match-Match-Banking. Das ist seine erste Runde. Die nächste Runde ist auf 100% übelst am Abkotzen.Ja, ja. Also wenn du hier rüberläufst, gehen sie zurück in das Schlachtfeld. Ansonsten tippst du auf 100%.Die haben sich ja mittlerweile aufgegeben, halbwegs realistische Map-Begrenzungen einzubauen. Die sagen einfach, ja, ja, wir killen dich.Stormination? Nee, das ist Hardhead oder irgendwie sowas. Ich wette mit euch, er feiert übelst und freut sich total, weil die erste Runde halt mega geil läuft.Es ist halt nur mal in Multiplayer-Spielen so, auch wenn das Spiel an sich nicht so wahnsinnig geil ist, solange man owned, macht alles Bock.Also du kannst fast das größte Scheiß-Game spielen. Wenn du Gegner zerstörst, macht's Spaß.So, absolut blind die Gegner. Ich wette mit euch, ab dem dritten Game ist er voll am Kotzen wieder.Weil dann kriegt er gescheite Gegner.Ja, Relics, genau das dachte ich mir. Das ist bei Modern Warfare auch so. Es macht Bock, bis es Skill-Base-Matchmaking komplett reinkickt.Sind das Scorestreaks oder Skillstreaks? Gute Frage. Oh, jetzt wird er gescheitert.Ich habe einen Sniper. Team, ich habe noch einen UAV, das ist gut.Hört euch das mal an. Das wummert einfach nur. Das Bass macht einfach nur Bass ohne wirklich einen Sound zu haben.Na klar, das wird ja weiter so sein.Das ist, ich glaube, das ist auch wieder eine Map. Da kannst du nicht rumrennen.Hier aimt dich wahrscheinlich um jede Ecke schon, normalerweise irgendeiner ab der dritten Runde.Guckt euch das mal an. Hitmarker, diese Ordeneinplantung hier unten. Das ist alles original Modern Warfare reskinned?Okay, die Shotgun ist nicht One-Hit, Klaus.Konnte man Sliden? Ist er gerade geslided?Oh, das wird wieder gehackt, wenn man Sliden kann. Die meisten Leute wünschen Sliden nicht.Ist der Typ auf dem Dach?Ja, in solchen Low-Games dann spielen die Leute noch Objective.Soll ich mal was sagen, was ich zu Skill-Based Matchmaking denke?Ich glaube ja, das ist viel trickreicher als man sich das jetzt vorstellt.Ich könnte mir gut vorstellen, dass die in ein, zwei Jahren Skill-Based Matchmaking als die Sau durchs Dorf treiben, die jetzt entfernt wird und das Spiel wieder gut.Die haben ja immer Sachen in dem Spiel, die sich rauskristallisieren, als dass es die Leute richtig abfackt.Und dann kommen die ein, zwei Jahre später und machen da einen großen Wirbel drum, dass diese eine Sache, die die Leute abfackt, jetzt entfernt werden.Dass jetzt noch 90 andere Sachen drin sind, sei mal dahingestellt.Und ich kann mir gut vorstellen, dass die in ein, zwei Jahren ankommen und sagen, wir entfernen jetzt Skill-Based Matchmaking, endlich wieder gut, kauft den Kram.Also, dass das eigentlich nur ein Trick ist, um wieder noch mehr Verkäufe zu machen in ein, zwei Jahren.Ich glaube, das ist viel trickreicher als man noch denkt sogar. Und sie werden es da nicht entfernen.Das ist wie bei Last Stand, was Last Stand entfernt wurde und dann war es Final Stand.Die werden das nicht entfernen. Das ist ja nicht drin, weil die sich gedacht haben, wir machen das mal.Das hat schon seinen Grund und die haben garantiert massig Analyse und Daten laufen, dass das gut ist für Verkäufe, durchschnittliche Spielzeit, Microtransaction, kaufen, alles mögliche.Die werten die Daten ja aus und die werden zum Schluss gekommen sein, das ist sinnvoll für sie, also für ihr Money.Aber es sieht, finde ich, krass, es sieht noch mehr, wie die letzten Call of Duty's in Reskin, wie vom letzten aus.Das ist original Modern Warfare mit Cold War drum herum.Gerade ansonsten hatte, auch weil Call of Duty immer ausgesehen hat wie Call of Duty, aber ich finde schon, dass sich gerade Black Ops und Modern Warfare,schon nicht nur vom Setting, auch vom Feeling und vom, schwierig zu sagen, von der Atmosphäre und vom Style her schon Unterschiede haben.Es ist ja nicht so, als hättest du nicht erkannt, dass das eine in Call of Duty und das andere nicht, das hast du schon immer gut erkannt.Aber es hatte schon ganz schön Unterschied, wohl guckt euch zum Beispiel an, die Modern Warfare Teile waren relativ grau,die Black Ops Teile waren schon immer relativ bunt und solche Sachen.Aber die ganzen Animationen, sogar die Laufanimation ist gefühlt aus Modern Warfare.Und das ist halt original Modern Warfare, nur ein bisschen reskinned.Auch die Aufstehanimation und alles, das sieht original Modern Warfare aus.So eine Art Acid Flip, quasi. Ich hätte da übrigens gar nichts dagegen.Also die könnten ruhig Modern Warfare nur in gut machen, was den Multiplayer angeht, weil der Multiplayer, also Warzone hat das Spiel einfach komplett gerettet.Der Multiplayer war so, der war ein Kacke, aber so wie es sich jetzt aktuell abzeichnet, ist es halt hier auch nicht besser.Nice. Oh, the stun grenade actually isn't that bad. I think it's because I have the tac mask on now.You're dead. Let me go this way.God, hat er geschneibert? Der hat geschneibert, was sonst? Der Name und mit der Sniper an der Ecke.Das ist der typische 360 XX HD Quickscoper Typ hier. Der macht dann irgendwie, der spielt 50 Games und macht dann ne Quickscope Montage, wo er 30 Sekunden zeigt, weil das die einzig gescheiten Clips sind, die er in 50 Games zusammen bekommen hat.You're dead. Okay. Das ist, wenn Skill-Base Matchmaking drin ist, definitiv nicht so. Der wird da von drei Seiten abgeampft, wenn er hier um die Ecke guckt.Und klar macht es so Spaß. Gegner bashen macht immer Spaß.Da ist er schon wieder. Gott, Gott ist am Start.Oh, okay. Dude, ich liebe den Spaz-12. Der hat so ein Black Ops 1 Gefühl. Warte mal, kommt der? Nein, der ist nicht da. Ich will diesen RPG schnell auslösen, aber da ist er. Okay, ich glaube, ich brauchte ihn nicht mehr. Lass uns jetzt los.Das macht immer so komische Geräusche im Hintergrund.Aber das ist die Einblendung. Das ist auch wieder ein Modern Warfare. Guck, und so, und so, wenn Skill-Base Matchmaking reinkickt bei ihm, so wird jeder tot aussehen. Schon instant abgeampft um die Ecke.Ich bin mal gespannt, was er die nächsten paar Wochen noch zu sagt. Ich selbst gebe es mir nicht. Wie gesagt, PS4 kann ich, das kriege ich nicht, kriege ich Anfälle.Ja, warte mal ab, warte mal ab, warte mal ab.Ja, das stimmt. Das stimmt auch. Die sehen deutlich mehr farbig, bunter aus. Das könnte natürlich schon ein Vorteil sein, dass man den Gegner einfach nicht so ganz besser sieht. Ich meine, in Modern Warfare waren die Gegner grau und die Map grau.Wenn es hier oben bete am PC kippt, probiere ich es vielleicht mal aus, ja.BTF. Habt ihr es gehört im Hintergrund, da hat gerade übelst einen Out hier jemand genießt. Ich weiß es nicht.Ja, deswegen läuft es ja auch so gut.Ist das wieder God? War das wieder God? Das war wieder God, Alter. Der Typ.God ist Afk. Das Gefühl habe ich im echten Leben auch, dass God Afk ist. Der hat sich das angeguckt und hat sich gedacht, nee, da habe ich keinen Bock auf den Kack. Afk. Afk-Klo. Seit dem Mittelalter. Afk-Klo.Das die Sounds sind ja übelst laut. Waffen und Killstreak Sounds.Naja, Objective. Captchern die. Gibt bestimmt wieder Huge Spawns.Ja, also wenn es sowas wie Ghost und Ninja und sowas gibt, das haben eh mittlerweile alle an und sitzen an der Ecke mit Silencer. So wie immer eigentlich.Wisst ihr was? Mal angenommen, ich hätte so ein Gameplay hochgeladen. Ich hätte auf der PS4 im Leben nicht so ein gutes Gameplay hingekriegt. Mal angenommen, ich hätte so ein Gameplay hochgeladen. Da werden die Kommentare wieder voll gelesen. Max, spiel doch mal Objective. Du nimmst nicht eine Flagge ein.Und das ist halt das Coole gewesen an den Spielen, die keine Skill-Base-Matchmaking hatten. Du hattest nicht unbedingt so viel mehr extrem geile Runden, du hattest aber halt mal geile Runden.Du hattest halt zwischendurch halt auch richtig Sucker-Team und ziemlich gute Gegner, aber du hattest halt ab und zu mal die Lobbys, wo halt nur Ultra-Low-Bobs am Start waren. Es ist ungefähr damit zu vergleichen, wie wenn einer jetzt einfach mal 15 Runden Reverse boostet.Und das sieht man ja jetzt schon. Die ganzen Channels, die kontinuierlich irgendwelche New-Gameplays hochladen. Oder auch. Was habe ich letztens gesehen, Solo in Quad Warzone alles zerrissen haben. Das geht nur, wenn du Reverse boosted hast vorher. Vor allem in dieser Frequenz, wo da teilweise Videos rausgehauen werden.Wie viele Punkte hat God? Oh, God hat 250 Punkte. Das hätte ich von God hätte ich jetzt echt mehr erwartet. Das wird aber nichts mit seiner Sniping-Montage.Okay, mal gucken, ob er sich ein bisschen mehr dazu ausgelassen hat. Nee, hat er nicht. Okay, mal gespannt, wie das in ein paar Monaten aussieht.Also ich gehe davon aus, dass es ungefähr so läuft wie in Modern Warfare, dass alle übelst am Rumflamen sind nach einer Woche, dass der Multiplayer unspielbar ist. Und dann bringen sie Black Ops Cold War Content in Warzone und dann spielen alle wieder Warzone und der Multiplayer interessiert keiner mehr. Also ungefähr so wie in Modern Warfare.Ich bin mal gespannt, ob die wieder Duos bringen. Duos macht tatsächlich ab und zu mal Spaß. Aber das war es dann auch. Man kann nur hoffen, dass die Maps ein bisschen besser sind als in Modern Warfare und das Ganze nicht ganz so schlimm wird. Aber ich habe da ja so meine Befürchtung.Also bei mir ist es jetzt so, die müssen jetzt erst mal zeigen, dass es sich lohnt, dass man den Kram kauft. Mal schauen. Also ich werde es mir nicht am Release holen.So, ich kriege wieder einen Key, dann hol ich mir. Ja. Ja, ja, Loonix wird ja eigentlich bei jedem Game rumgeheult. Das ist ja normal. So sind sie halt. So sind wir halt.So, also was gucken wir als nächstes? Ich brauche mal irgendwelche Videos, wo ich ein bisschen was building an invisible PC. Das ist doch, das ist doch jebaited.Loonix sagt, ich finde auch, dass Cold War zu langsam ist. Du findest nicht viele Gegner. Die Maps sind auch wieder zu groß. Okay. Und hat wieder zu viele Ecken zum Gammeln. Ja, das wundert mich nicht. Das ist halt das Problem. Wenn du ein Game machst, wo man gut gammeln kann und dann baust du die Maps noch so, dass man gut gammeln kann, dann wird halt auch krass gegammelt.Was halt auch in Modern Warfare, was mich halt in Modern Warfare Multiplayer so gewundert hat, ist, dass es muss ihnen aufgefallen sein, aber es war ihnen egal. Du hast in Modern Warfare so viele Maps, die nicht bis zum Score-Limit gehen.Diese Windmühle ist die schlimmste Map in der Richtung. Also die geht bis zur Hälfte der Punktezahl ungefähr. In einem normalen TDM. Das muss denen aufgefallen sein. 100% ist das denen aufgefallen. Das kann nicht sein, dass das ihnen nicht aufgefallen ist. Und die haben sich trotzdem gedacht, das ist gut so.So, schauen wir mal weiter. Also ich glaube, das ist G-Bait. Ich glaube, das ist G-Bait. Der baut keinen unsichtbaren PC. Das ist 100% G-Bait. Ich werde das gleich wegmachen, weil ich will nur den G-Bait erkennen.Okay, es ist kein invisible PC. Es ist ein PC im Tisch eingebaut. Das war so klar. Ich habe ja gehofft, er baut irgendwie so ein Ding mit Spiegel oder so und wenn man den dann in die richtige Ecke stellt, sieht man den PC nicht. Aber nein, es ist einfach ein PC in einem Tisch eingebaut.Es war relativ dünn, muss man sagen, aber kein Problem. Ihr müsst euch überlegen, was man für ultrakleine Notebooks bauen kann. Ist das in so einen fetten Tisch einzubauen kein Problem.Ja, klar, das Netzteil. Ordentlich breiter Kühler. Ist überhaupt kein Problem. Aber der Titel hier, building an invisible PC. Ja, gut, es ist halt ein PC in einem Tisch.Battlefield 3 Remastered will ich nicht haben. Ich will ein richtig gutes neues Battlefield, aber da habe ich meine Hoffnung schon fast aufgegeben. Was ist das hier? Oh, die seltensten Tiere, da bin ich mal.Jetzt müssen wir uns angucken. Ich weiß auch nicht, warum irgendwie, irgendwie will ich mir das jetzt angucken. Ich bin so entgegen angesprungen. Okay, schwarze Leopard, Pantera Pardus. Ah ja, Panda. Ah ja, ja. Moment.Das ist doch Photoshopped. Das hier sieht doch gar nicht so aus. Ist das so selten, dass sie kein Bild davon gefunden haben oder was? Guckt hier bitte das Video an 40. Oh, das sind irgendwelche Deutschrapper. Nee, Deutschrapper Videos gucke ich mir nicht an.Das ist doch auch Photoshopped. Das ist einfach ein Kontrastfilter drüber. Oh, ist das schlecht. Das ist so selten. 1 in 20, da haben sie kein Bild von gefunden.Ist das weiße Tiger nicht das, wo dieses eine Magier-Duo in den Arm gebissen bekommen hat? Vor, keine Ahnung. Ich weiß Boomer und vor Ewigkeiten so. Schon die neue Pepo-Animation gesehen? Du meinst die XQC-Pepo-Animation, wo er mit dem Roller draußen rumfährt? Die haben uns gestern angeguckt. Oder gibt es noch eine neue?Okay, hier haben sie tatsächlich mal ein Bild. Hier haben sie wieder kein Bild. Ach, das ist ja alles ja mies. Schneeleopard gibt es ganz viele, besonders auf MacBooks.Okay, ich gebe zu, das war nicht lustig. Okay, das scheint tatsächlich ein echtes Bild zu sein.Ein weißer Löwe. Okay, das ist auch Photoshopped. Es wäre ja gut, wenn sie echte Bilder drin hätten. Ein goldner Tiger. Was ist das? Das sieht eklig aus. Das ist sowas, was ich definitiv nicht an meiner Decke oder an der Wand krabbeln haben will.Das ist, ich erkenne es gar nicht, ein Fisch. Ein Wal ist das, okay. Ein blauer, ach ne, mit zwei Hörnern irgendwie. Okay, na dann.Oh, wie sie es gesungen haben zur Musik hier. Okay, ich weiß nicht, was Amour für eine Farbe ist.Das ist ein Huhn. Ach ne, ein Peacock ist das.Okay, wir spulen mal ein bisschen vor. Ich will wissen, was das heißt.Ja, aha, alles klar. Black Flamingo, eins in 1,25 Millionen. Exzellent.Moment, was? Ein Orangener Alligator. Ein blauer Hummer. Lobster ist Hummer, ne?Wow. Ein roter, sind die nicht alle rot? Ich dachte, die sind alle rot. Ein roter Hummer.Ein goldener Hummer. Sie haben einen gelben, also die haben einen gelben Hummer gerettet im Supermarkt und haben ihn zurück in die Wildnis entlassen.Dann wird das wieder gefangen. Ach so, die werden nur rot, wenn man sie kocht. Okay, dann sind die standardmäßig eher so braun.Multicolored Lobster. Gibt sogar bunte Lobster. Das sind dann Lobster of Color wahrscheinlich. So Albino Lobster, weiße Lobster gibt es auch.Ach, das war jetzt das. Oh ne, jetzt kommt's. Albino. Moment, was? Ein Albino, ein einäugiger Albino Hai.Okay, ich bin mir jetzt nicht, ich bin mir bei dem Bild nicht so ganz sicher, ob das jetzt gefährlich aussieht oder eher einfach nur bescheuert.Ahja. Exzellent, jetzt wissen wir Bescheid. So, was haben wir hier als nächstes? Erstmal ein bisschen Musik anmachen.Krasse Drop Rates, ja. Muss man erstmal aus der Lootbox ziehen. Hör mich mal vor, ihr habt eine machende Lootbox aus und da kommt ein einäugiger weißer Hai raus.Das wär nix. So, was ist das? Die Pete Smeet Fertig Gaming PC's auf Boostbox. Was ist Boostbox? Ist das so was wie Möchte gern Alienware?Zeig mal hier, Boostbox. Max, du musst Elektro Boom anmachen. Hat er ein neues Video? Hat er ein neues Video?Das letzte fand ich langweilig. Nee, das mein ich nicht, ich mein was anderes. They are tracking us. Okay, das ist so ein Fertig PC an Peter, der gerne wie Alienware wäre, aber nicht wie Alienware ist wahrscheinlich.Wobei Alienware sich auch nicht zu kaufen lohnt. Meiner Ansicht nach zumindest. Zu den MeinMMO PC's. Was? Die machen einfach Fertig PC's und haben jede Menge Influencer Geld gegeben wahrscheinlich, um ihre PC's zu bewerben.Das ist eigentlich gar keine schlechte Idee. Man baut einfach 08-15 Gaming PC's, macht die vielleicht sogar ein bisschen zu teuer und dann gibt man das Geld dafür aus, dass Influencer die promoten und die Kinder kaufen.Das ist eigentlich exzellent. Was haben die denn so? Extreme. Schauen wir uns mal an was das taucht. Ich bin jetzt nicht so auf dem laufenden was aktuelle PC's angeht, aber so ungefähr kann man das ganze wahrscheinlich einschätzen.Nehmen wir mal hier was, was keine Ahnung. Das da nehme ich jetzt einfach mal, zeig mal her. Also was ist da drin? Ich finde das Gehäuse ist Geschmackssache, mir gefällt es nicht. Vor allem was, warum ist da vorne so ein komischer Bild ruckelt? Warum ist da vorne so ein komischer Leuchtstoffröhre oder sowas drin?Ach das ist der Wassertank, ok. Aber wenn du da mal zu fest mit dem Fuß dran haust, ist glaube ich egal. Also ich finde es obdich jetzt nicht, ist nicht mein Fall. Ist nicht mein Fall, das heißt nicht dass es schlecht ist, ist nicht mein Fall. So, also was ist denn da drin? Zeig ich mal her.Was ist Bullgard? Also ein Prozessor, 10600K. Das ist glaube ich gar nicht mal so gut das Ding.Das ist glaube ich gar nicht mal so geil. Ach hier rechts, hier rechts, ein i5. Es ist halt, ok es ist, ne was, hä? Ne 2060, ein 1600K. Also ich bin jetzt so wirklich nicht auf dem aktuellen, ne ne ich bin nicht am PC zusammenstellen Sebaro.Ich bin grad PC-Anbieter gucken, die hier mit, die Influencer-Marketing-mäßig da den Kram fällen. Also ich bin, ich muss dazu sagen, ich bin nicht wirklich auf dem alleraktuellsten Stand was PC-Hardware angeht, weil ich bin, ich gucke immer nur wenn ich mir selbst was kaufen will.Aber, das erscheint mir jetzt doch, also erscheint mir jetzt auf den ersten Blick ein bisschen teuer. Ich meine es ist ne Mittelklasse CPU, Mittelklasse bis obere Ecke, also obere Mittelklasse CPU sag mal mal, ne Mittelklasse Grafikkarte.Ansonsten nix, nix, RAM ist grade billig as fuck. Dann nur ne 2GB Festplatte und ne 500. Und ich glaube die SSDs sind auch gar nicht mehr sonderlich geil.Das erscheint mir jetzt ein bisschen teuer als 2TB mein ich. Das erscheint mir jetzt ehrlich gesagt ein bisschen teuer. Ich mein schau mal doch mal, was so ne, also ich denke mal wie gesagt die CPU kostet ungefähr 250, 260, 270 Euro.Dann hast du hier die Grafikkarte dabei. Was kostet ne 2600? 400 Euro, keine Ahnung, weiß ich nicht, muss ich mal gucken.Also mir erscheint es ein Tick zu teuer. Ich denke mal sowas kann man auch für um die 1000 Euro bauen. Ohne dass ich jetzt wirklich komplett auf dem aktuellen Stand bin, was so PCs angeht. Aber ich denke sowas kannst du dir auch für ungefähr 1000 Euro zusammenbauen. Das erscheint mir ein bisschen sehr teuer.Was haben wir ansonsten, ach das ist schon Xtreme. Das Mainboard kostet 270 Euro, wahrscheinlich haben sie davon jede Menge. Und müssen es loswerden, weil es demnächst keiner mehr kauft.Ja das Mainboard ist ultra offer size für die Zusammenstellung. Ja, naja. So was hatten sie sonst noch? Ich guck mal, achso ne das war es hier, Xtreme. Ah ne es geht noch weiter, Xtreme.Ach guck mal hier gibt es eine, oh ganz eine Bewertung schon. Ich will mal kurz gucken ob die Bewertung fake sind. Hä? Okay, genau so stelle ich mir Leute vor die sich solche PCs kaufen. Sehr schöne Fragezeichen. Excellent.Okay was haben die hier drinnen? 9700k, okay sogar noch die eine Generation davor. Ungefähr übertaktet würde ich sagen, also meiner übertagt ungefähr so wie auf dem gleichen Niveau wie der hier.Ne 2070 sogar, die gibt es ja mittlerweile, also du kriegst ja mittlerweile 280 TI hinterher geschmissen. Es scheint mir auch ein bisschen teuer. Ich meine es ist im Prinzip wie der letzte PC, ein ticken schnellere CPU, ein ticken schnellere Grafikkarte.Klar das ganze hat was angestellt. Mir kommt es ein bisschen teuer vor. Ist jetzt mein Eindruck, aber ich bin auch nicht auf dem aktuellen Stand was PCs angeht. So, jetzt gucken wir uns mal an was er dazu zu sagen hat. Ach guck mal die machen auch.Also eins kann man sagen, Peazmeat wird sich sicherlich, wird das nicht für ein Apfel und ein Ei machen, ihre Namen für einen PC draufschreiben lassen oder PCs promoten. Da musste bestimmt ordentlich Kohle für Latzen dass sie das machen.Kriegt ihr übrigens auch manchmal Peazmeat Prinzenrolle Werbung auf Twitch? Verwirrt mich jedes Mal, weil es irgendwie absolut nichts mit Prinzenrolle zu tun hat bis zum Schluss.Okay. Auf der einen Seite da beschweren sich so einige über die freitaglichen Rgb-Cringe-Gedichte. Auf der anderen Seite. Über was? Rgb-Gedichte? Das wird ja immer schlimmer. Erreichen mich zahlreiche Beschwerde.Das PC-Bau, die haben ein PC-Bau-Video, das muss ich mir auch gleich nochmal angucken. Aber an das PC-Bau-Video von, wie hießen die? Wins? Wans? Nee, Wans? Nee, wie hieß dieser Channel?Kennt ihr noch mit dem Elektro-Anti-Static-Band, was er nirgendswo angeschlossen hat? Verge, Verge, ja.Der hört sich so übertrieben glücklich an. Was ist denn hier los? Nein, nein, das kann ich mir nicht angucken.Ich dachte, er sagt jetzt was mit dem PizMiet-PC. Okay. War gespannt.Das sagt mir irgendwas. Warte mal, was ist das? CSL? Die kommen mir irgendwie bekannt vor. Ach, die sind das. Okay, das sagt mir irgendwas. Ich weiß jetzt nicht genau was, aber das sagt mir irgendwas.2006, 2007 selbst bei CSL Computer gekauft, weil die Preis-Leistungs-Verhältnisse der Rechner eigentlich gar nicht so schlecht waren. Ja und dann bin ich mal auf diese Landing-Page mit dem PizMiet-System gegangen und Leute, das konnte ich irgendwie so nicht stehen lassen, denn alleine schon das erste System für 999 Euro.Das Ding heißt nicht wirklich Zerficker, oder? Der Boostbox-Piz wie Zerficker.... hat einen AMD Ryzen 5 2600 in Kombination mit einer RX 5500 XT. Schnitzchen? Alter, die Namen sind so cringe. Oh, meine Güte.Die PC-Namen, das ist ja... Oh, da zieht sich ja alles bei mir zusammen, wenn ich die PC-Namen sehe. Wenn ich die PC-Namen sehe. Oh, das tut weh. Vor allem, warum kostet der gerade 2800 Euro?BTF? Warum ist das so teuer? Ja gut, ich meine, PizMiet kostet halt was, ne?Was sagst du denn da, Leute? Jungs, ich hab mir jetzt den PizMiet-Penetrator geholt. Das hört sich eher wie ein Billig-Dildo von AliExpress an, als wie ein Fertig-PC-Gaming-PC.Da kann man eigentlich nicht motzen, das ist solider RAM. Aber RAM ist billig. Dann haben wir noch eine NVMe SSD, und zwar die A2000. Das ist auch eine SSD mit einem guten Preis-Leistungs-Verhältnis. Dazu eine 1TB normale Festplatte, was auch nicht schlecht ist von der Grundkonfiguration.Aber für den Preis, eine 1TB Festplatte, was willst du denn damit machen? Also 6TB Platte sind mittlerweile eine Preis-Leistung, ist nämlich echt ganz gut. Ach, das ist auch okay, es ist luftgekühlt. Es ist luftgekühlt.Weil da der Box-Kühler am Anfang zumindest ausreicht. Aber der Kühler ist natürlich leiser und etwas performanter als der AMD Box-Kühler. Deshalb, da kann man auch nicht meckern. Das Netzteil ist zumindest okay für den Preis mit einem Be Quiet-System.Ich denke auch nicht, dass die Zusammenstellung irgendwie jetzt wahnsinnig schlecht wäre und in die Luft fliegt. Ich glaube, die schlichtweg einfach viel zu teuer.Mit 600 Watt, was vielleicht für das System etwas overpowered ist. Aber das machen die gerne. Das machen komplett PC-Hersteller, machen das gerne. Viel zu starke Netzteile rein. Allerdings kann ich es bis zu einem gewissen Grad verstehen.Weil die wollen halt auch auf Nummer sicher gehen, falls jetzt irgendeiner auf die Idee kommt und da eine 3900 RTX oder so reinschmeißt und sagt, oh, das geht ja gar nicht. Ja, mit ein bisschen besseren Netzteilen hast du halt die Probleme nicht.Gehäuse ist ein Kohling Stronghold. Ist auch ein günstiges gutes Gehäuse. Und beim Mainboard setzen sie auf das Asus TUF B450 Plus Gaming. Das ist sogar schon etwas besseres.Und da bist du jetzt bei wie viel? 800 Euro?Mainboard aber auch zu einem vernünftigen Preis. Also sagen wir mal...Max, was sagst du dazu, wenn man die 3080 mit einem 600 Watt Netzteil betreibt? Langt das? Ich habe mir den Stromverbrauch von den neuen Nvidia Karten nicht angeguckt.Aus dem Bauhaus würde ich sagen, also bisher hat das immer locker gereicht. Wie das jetzt ist, keine Ahnung. Also kann ich dir nicht sagen, ich würde vorher nachgucken und auch mal ein paar Tests lesen, was das wirklich braucht.Bisher hat das locker gereicht. Ich habe auch nur einen 650 Watt Netzteil. Bisher hat das locker gereicht, aber ich habe auch nur 1.080 GE.Nvidia meint mindestens 750. Ja, siehst du, dann würde ich mich daran halten. Allerdings, auf was heißen die das auch öfters mal.Aber Schattnix kostet ja nicht viel mehr.Bis auf die Grafikkarte ist diese Grundkonfiguration von den Komponenten her nicht mal Schrott.Muss man sagen. Klingt sinnvoll, aber wahrscheinlich viel zu teuer.Das ist eigentlich ganz okay. Würdet ihr euch aber diesen Rechner nachbauen und alles im günstigsten Shop bestellen.800 Euro, oder? Das kostet einfach alles top. Na gut, die Pete's Meet Collaboration muss halt bezahlt werden.Und die wollen einfach fast 1000 Euro. Klar, es ist noch Windows 10 Home dabei, aber...Ja, wokehrs? Windows 10 Home kannst du ja sogar kostenlos installieren.Das ist eigentlich fast gar nichts. Deshalb frage ich mich, warum so einen krassen Aufpreis? Warum so einen 1000 Euro PC?Ich persönlich finde das nicht so gut. Und ja, diese etwas hoch angesetzten Preise, die sieht man natürlich häufig bei PCs, die...Klar, ein bisschen was müssen die ja verdienen. Das sehe ich auch ein. Aber in dem Fall muss da halt auch noch die Collaboration irgendwie mit bezahlen.Und das wird nicht billig sein, dass man Pete's Meet draufschreiben darf.Vor allem in Kooperation mit YouTubern entstehen. Das liegt halt natürlich auch einfach daran, dass die Systemintegratoren irgendwie mit plus rauskommen möchten.Weil, da fließen Marketinggelder. Und diese Marketinggelder...Ordentlich Marketinggelder....hauen natürlich ordentlich rein. Dann ist die Marge an den PCs nicht mehr so hoch. Und dann kann man die natürlich auch nicht entsprechend günstig verkaufen.Ich persönlich weiß ehrlich gesagt nicht, was ich davon halten soll, aber was ihr davon haltet, das könnt ihr mir ja jetzt mal in die Kommentare schreiben.Hauptsache der RGB. Okay, das war's schon. Den Rest müssen wir uns nicht angucken.Ich wusste gar nicht, dass Pete's Meet ein PC-Bauvideo gemacht hat.Haben die einen PC-Bauvideo? Wir gucken uns jetzt das Originale an. Wo ist das Originale Pete's Meet PC-Bauvideo? Zeig her.Wo ist das?Wow.Zwei Profis bauen ein Mini-PC.Ich glaub, das ist langweilig.Ich glaub, das ist langweilig.Was ist das für ein hässlicher PC?Was ist das? Ist das irgendwie moderne Kunst?Dann spielen sie ja drauf irgendwas, was nicht antwortet. Das sieht ja wirklich fast aus wie moderne Kunst.Das kann ich mir nicht angucken.Also, Bram hat den Slot gefunden.Das Ding hat einen PC-4. Ach so, das ist der M2.Jetzt sinkt das da so hoch. Ach so, da kommt eine Schraube.Genau, und da kommt noch eine Schraube, die dürfte dann hoffentlich beim Mainboard dabei sein.Die beiden haben doch garantiert schon mal einen PC zusammengebaut.100 pro. Wahrscheinlich müssen sie sich jetzt extra unfil anstellen.Warte mal, ich glaube, das ist vielleicht die.So, geile... Alter, ohne Spaß. Der Wasserkühlung ist halt eine Million Meter lang.Wieso hat Zed noch einen Lüfter gekauft? Die CPUs gibt es auch ohne Lüfter.Nur kein Quatsch.Okay, was auch immer. Das gucken wir uns jetzt nicht an.Muss nicht sein.Stimmt, mittlerweile kriegen die ja den Kram 100 pro gesponsert.Ja, logisch. Da müssen sie nicht mal selbst bauen.Die haben wahrscheinlich nur die M2 eingebaut.Ja, würde ich auch so machen.Wenn ich den Kram in den Arsch geblasen kriege.Aber dazu müsste ich erstmal wieder was auf YouTube machen.Da kaufe ich mir den Kram lieber selbst.Ich versuche mir die ganze Zeit so im Kopf zusammenzureimen.Ich meine, ich habe ja auch schon die ein oder anderen Collaboration-Geschichten gemacht auf YouTube.Und in den letzten Jahren kriegst du ja auch teilweise für fast nichts, was ich kohle.Ich versuche mir echt irgendwie zusammenzureimen, was es diesen PC-Distributor-Typ da gekostet hat,diese Piz-Me-Collaboration zu machen.Weil ich meine, das ist ja nicht einfach nur...Die machen mal kurz ein Unboxing-Video.Der Name steht drauf.Die bewerben das.Die haben unterschiedliche Konfigurationen mit unterschiedlichen Namen,mit unterschiedlichen Fotos von denen zu verwenden.Ich glaube sogar noch persönliche Kommentare dazu.Also ich würde sagen unter 100k wird da wahrscheinlich nix gegangen sein.Also das ist auch so das erste, was mir eingefallen ist.Wahrscheinlich sogar noch mehr.Also billig wird es nett gewesen sein.Ich meine, da muss ich mal überlegen...Ich weiß gar nicht, darf ich das sagen?Ich weiß gar nicht, ob das jetzt noch irgendjemand interessiert.Also die haben ja für mein publisches Ghostreak-Video war es ja schon vierstellig.Und ich hab dafür fast nix gemacht.Also...Der Kram ist mittlerweile voll aus dem Ruder, was man da an Kohle bekommt.So, also...Äh, was gucken wir jetzt?Randomly messing around in my house, der...Oh, fremde Hardware ab...Oh ja, das mach ich immer gerne.Über fremde Hardware kommentieren, das mach ich gerne.Oh guck mal, da hat ein gutes Multimeter hier.Exzellent, wollte ich mir auch noch eins kaufen.Hi, and welcome to my playhouse.And today we're gonna be...Das ist...Das ist Windows Movie Maker.Ist das nicht in Windows Movie Maker fade in?Das ist irgendein Default...Default...Subtitle.Das ist Windows Movie...Das ist doch Windows Movie Maker.Ist das Windows Movie Maker?Aha, jetzt.Messing around with...Wie spricht man ihn denn aus?Mort...How do we pronounce him?Oh, das ist schwierig auszusprechen.Random things in the data center.Und warum hat er so 30 Milliarden Dinger per sich da?Was machen die Leute immer daheim?Da hat er noch ein Schrank mit allen...Mit allen Servern drin.Oh, der hat ein Playcenter.Der hat ein Playcenter daheim.WTF.alles IBM Playcenter hatte. Sind das die 14er? 1, 2, 3, 4, 5, 611, 12, 13, 14, ja. Das sind die fetten olden IBM Playcenter. The fuck?Ich mein es ist geile Hardware, kann man nichts gegen sagen, ja. Ich mochte Playcenter immer.Aber daheim ist das ganz schön laut.Also, als ich mit dem Felix noch die Ausbildung gemacht habe, haben wir immer davon geträumt,mal so eine Art Playcenter Flugzeug zu bauen, was nicht funktioniert, ja. Also die Dinge habenhalt übelst krasse Lüfter drin und wir hatten so einen relativ leicht gängigen Wagen im Rechenzentrumund wir haben uns immer gefragt, was passiert, wenn man diese Lüfter vom Playcenter mal aufdiesem Wagen montieren würde, ob der dann von alleine fährt. Aber wir haben das nie ausprobiert.Also die Dinger haben wirklich brutale Lüfter, das bläst dich fast weg hinter dem Rack,wenn das voller Plates ist. Also wenn du einen Rack hast voller Playcenter und die drehenkomplett hoch, das pustet, also es puste dich nicht um, aber du musst schon dich ein bisschenin die Richtung lehnen, dass du nicht umgepustet wirst. Also das haut schon ordentlich raus dieLüfter und wir wollten, wir haben damals gedacht, irgendwann, wenn wir die ausbauen, machen wir das,dass wir die auf den Wagen bauen und mal gucken, ob der Wagen durchs Rechenzentrum fährt rein,aber haben wir nie gemacht. Okay, okay. Mit einem Staubsauger. Zumindest eine Sache istschon mal original, Rechenzentrum ist schön laut. Ja, so gehört sich das. Im Rechenzentrum muss esordentlich laut sein, sodass du nach einer Stunde eigentlich nur Rauschen auf dem Ohren hast,wenn du nicht gerade einen Gehörschutz aufhast. Der hat wirklich, guck mal hier, der hat sogarErsatzplates hier rumliegen und die Dinger sind neu, nicht billig. Also ich kann mich noch dranerinnern, als wir damals die Sachen neu, also mittlerweile sind die billig auf Ebay, ja, weißnicht, was so ein Plate kostet. Ebay, weiß gar nicht, weiß gar nicht mehr, wie die Dinger heißen.IBM, Blade Center, HS10, Blade oder so? Nee, ach, keine Ahnung. Hier irgendwie sowas. Genau,H21 und sowas. Mittlerweile sind die Dinger, glaube ich, relativ günstig auf Ebay. Was ist H23?Ohne RAM, CPU. Ja, ist immer noch ziemlich ordentlich. Also ich weiß, wir haben die neugekauft, ungefähr, ich glaube es hat ungefähr 23 oder 25.000 Euro pro Plate gekostet, irgendwiein dem Dreh. Aber die waren auch 2000, das war irgendwie 2000, 2011 oder so, oder 2010,glaube ich, war das noch. Und da waren das schon Plates mit 96 GB RAM, also die waren wirklichordentlich. Also wir haben da quasi regelmäßig kleinen Wagen vom Preis her über die Straßegetragen ins Rechenzentrum. Das war noch die Zeit, wo wir noch Turnschuh-Admin waren, wo mansich noch wirklich ins Rechenzentrum bewegt hat. Mittlerweile habe ich damit ja leider gar nichtsmehr zu tun. Ab und zu mal wieder so eine schöne 4HE-Kiste einbauen alleine, ja, das muss mal wiedersein. Warum macht der ein Video, wo er das Rechenzentrum saugt? AliExpress, exzellent.Fette Batterie. Das ist so eine Art, so eine Art Konsole fürs Rack, oder wie?Die Idee ist gar nicht schlecht, das als Konsole zu verwenden. Die ist gar nicht so übel, findeich eigentlich ganz gut. Was hat der Typ eigentlich alles daheim in seinem Rack drinnen? Ich meine,das ist mehr als kleine Firmen, die sich am Start haben. Jede Menge ESXe. Sogar so einStatikband hat er am Start. Der hat massig ESXe anscheinend, dann hat er irgendwie, weißich nicht, was das ist, sieht irgendwie so appliance-mäßig aus. Dass es irgendwas oldschoolist mit serieller Schnittstelle. Der hat sogar eine Konsole, also der hat ordentlich Sachenam Start daheim. Was hat der denn alles am Start? WTF? By the way, ich habe es ja oftgesagt, zu VGA ist noch Standard im Rechenzentrum. Ah, jetzt erklärt er, was was ist. Okay, okay,zeig mal her. Jetzt erklär mal, jetzt bin ich mal gespannt. Damit kann ich mich echtgut identifizieren. Das habe ich früher auch gemacht. Also man muss ja sagen, normalerweisesind die Dinger auf einer Schiene. Normalerweise sind die Dinger nicht, das hier sind so Universal-Schienen,da kannst du alles drauf stellen. Normalerweise sind die Systeme hier nebentran in der Schiene,sprich die fahren auf einer Schiene raus, die kannst du rausziehen und dann hängendie vorm Reck, rausgezogen auf den Schienen. Also normalerweise haben die noch mal Schienendran, aber wenn du die dann rausheben musst aus den Schienen, das habe ich auch schonoft mit dem Kopf gemacht damals. Vor allem im Nachhinein war das eigentlich richtig abenteuerlich,dass die uns zusammen alleine machen lassen. Sowas musst du eigentlich immer mit zweiLeuten machen, weil wir hatten mal einen, dem ist so ein Server auf den Fuß gefallen.Nicht so einer, nur ein DL380 2HE HP Kiste, aber wenn dir das auf den Fuß fällt, nichtunbedingt aus dieser Höhe, da ist der Fuß ab. Wenn dir eine 2HE Kiste aus dieser Höheauf den Fuß fällt mit der Kante und du hast keine Sicherheitsschuhe an, dann ist der Cschon mal fast ab. Ich glaube, das haben die sogar wieder dran genäht oder so im Krankenhaus.Es war ordentlich, das war wirklich ordentlich, der war auch ein paar Wochen da nicht da.Also da sieht man, auch Rechenzentrum kann gefährlich sein.Da kann ich mich wirklich sehr gut mit identifizieren, so habe ich auch schon so einfach umgetragen.Oder Scheiß ist schwer.Okay, das ist irgendwas alles, das juckt mich jetzt nicht.Nee, da passiert nicht mehr allzu viel. Aber warum hat der, ja genau, solche Schienen müssenda rein, exakt. Das ist das, was ich meinte, eigentlich hängen die Kisten an solchen Schienendran.Stand da Rechnung? Gute Frage, keine Ahnung.Kann sein. Hier, Rechnung, Invoice, bitte nicht überweisen.Protogesamt, was ist das für eine Einheit? Dänische Kronen oder sowas?Wow, wow, ich bin auf die Leertaste gekommen mit dem Arm.Nee, das sind keine Euro, das sind Dänische Kronen oder irgendwie sowas.DKK, Dänisch, Däne ist das wahrscheinlich. Das klingt auch irgendwie dänisch.Kost, 1125 Dänische Kronen. Okay, wie viel ist das?Zu Euro, 151 Euro, okay, der Kram kostet halt nicht viel.Ja, die Dinger sind gut, die Dinger sind wirklich gut.Ja, nee, da kann ich ja gar nicht so viel über die Hardware lessen, weil der hat einrichtig nice Rechenzentrum, nur halt wieder absolut übertrieben für daheim, WTF.Warum hat man den Kram daheim am Start, ich weiß nicht, das ist wirklich schon echt heftig.Home Data Center Tour, ja mal gucken. My Server Room, ja da ist er, vielleicht kriegenwir jetzt die Details gezeigt, exellent.Der hat wirklich IBM Playcenter am Start, ich verstehe es nicht, warum?Das ist der einzige, wo ich jemals gesehen habe, dass der ein Playcenter daheim stehenhat. Was hältst du von Anwalt oder kennst dusie? Ja, ich kenne das, ich habe es nie ausprobiert, hat mich bisher nicht so angesprochen.Was ist das für ein blaues Chrom? Das ist Chromium, das ist quasi die nicht Google-Variantedavon. Warum haben die ein DVD-Laufwerk, weil dieDinger so alt sind, wo man noch Betriebssysteme von DVDs installiert hat.Kannst du ein Open Source Web Hosting Panel empfehlen? Nee, habe ich mich noch nicht mitbeschäftigt.Da unten hat er noch ein paar andere. Ich denke immer an HP, wenn ich das hier sehe,ist auch HP. Man muss sagen, die Anbieter, die haben recht gute, du erkennst besser aneinem Server von welchem Hersteller, der kommt, als an so einem normalen Notebook.HP hat immer dieses komische Rot, IBM hat immer dieses komische Grün, was hat Dell?Dell hat auch so ein Rot-Silber, glaube ich. IBM kannst du gut unterscheiden, IBM hathier Blau- oder Lenovo-Zeug mit, also blaues Zeug und Dell hat immer so rotes Zeug dran.HP, HP hat immer so rotes Zeug dran. Der hat echt einen Platesender, was ich drinne.Guck mal, exzellent noch mit dem Kettenlaufwerk.Das ist ziemlich groß, das Ding. Nur, dass ihr euch das vorstellen könnt. Eine HE istglaube ich 4,5 cm oder so was. Ja, 4,5 cm, also sprich, das Ding ist 30 cm hoch. Dasist schon ein bisschen was. Das ist schon eine ordentliche Kiste hier. Und da kannstdu halt bis zu 14 einzelne Rechner reinstecken. Also jeder, jedes dieser Einschübe hier hatRAM-CB, also jedes ist ein eigener Rechner. Das war halt damals auch, das war früher rechtangesagt, weil du da auf sehr engen Raum viel Rechenleistung bekommst. Also hattest du,sag mal mal, du hattest einen Rack voller Platesender, da konntest du kaum mehr Rechenleistungin kleineren Raum bekommen. Ja, wofür das da heimat, verstehe ich auch nicht. Bei unswaren da zum größten Teil tatsächlich Virtualisierungsgeschichten drauf und damals auch noch normale Linux-Serverfür Außendienstsysteme, wobei das mittlerweile bei uns zu 95% virtualisiert ist und jetztmittlerweile auch teilweise Azure Cloud. Das ist auch vieles am Start. Das ist abereine richtig alte HP. Der macht bestimmt Filesharing. Der macht nicht nur Filesharing, der hostetwahrscheinlich halb BitTorrent-Traffic in Dänemark. Seeded. So, dann hat er jede MengeOlle. Die hatten wir auch. Ok, das ist richtig, Alterszeug. 3650. Genau die hatten wir auch.Also da sieht man mal, die Hardware ist, es ist eigentlich, also wenn man sich ein bisschenan RZ-Hardware und so rantasten will, so Dinger kriegst du bestimmt wirklich für ein Apfelund ein Ei heute auf Ebay, aber das lohnt sich nicht, äh, aber das lohnt sich nicht,weil der Kram halt kaum Rechenleistung hat und laut und Strom verbraucht wie Sau. Also,eigentlich ist es ziemlich sinnlos. Und dann hat er hier noch WD-Green-Platten als Nass.Ok. Geht bestimmt ganz gut. Was WD-Green nicht gut verkraftet, ist häufiges hoch undrunter fahren. Die brauchen viel Strom. Die Dinger sind wirklich nicht zum Stromsparenund nicht für Lautstärke. Also, die sind nicht ausgelegt dafür, irgendwie möglichstleise oder möglichst sparend zu sein. Ihr weißt ja nicht, ob die überhaupt Lüftersteuerunghaben. Doch, Lüftersteuerung haben sie. Lüftersteuerung haben die eigentlich fast alle. Aber trotzdem,die niedrigste Lüfterstufe ist halt schon, äh, Turbine. Ja, wenn man sich da, das stimmt,jetzt sagt er, aber wenn man sich da mal rantasten will und mal ein bisschen mit, mit etwasälterer, nämlich etwas bei Enterprise-Hardware rumspielen will, ist sowas gar nicht übel.Es ist halt die Sache, wenn es hasst, du kannst es nicht verwenden für irgendwas, weil eszu laut ist und zu viel Strom braucht. Und danach musst du es irgendwie wieder entsorgenund hast so ein riesen fettes Teil. Also, lohnen tut es nicht wirklich. Außer man möchtees halt mal ausprobieren und danach wieder verscherbeln auf Ebay. Und lahm ist es auch.Also sprich, der hat noch eine PCI, der hat es angeschlossen an, äh, was, eine SATA PCIExpresskarte, die auch noch eine M2 hat oder so, irgendwas. Naja. Übrigens, vorne sehenselber halt nicht viel anders aus. Außer, dass manche mittlerweile schon HDMI haben.Aber alle noch VGA. Du brauchst was mit Linux-Support. Dein Linux funktioniert auf den Dinger super.Wobei, nee, ich glaube, du meinst irgendwas anderes, ne? Ich hab den Chat grad nichtverfolgt. W- warum hat der, warum hat der irgendwie acht ESXs? Was macht der denn?Was hat der denn daheim am Start? Mich würd ja mal, mich würd ja mal richtig interessieren,was der da drauf laufen hat. Eins muss man ihm aber echt mal lassen. Das Wreck ist wirklichähm ziemlich, ziemlich gut und, und ordentlich und alles in allem, ja. Also wirklich, alsofür daheim. Also wie gesagt, das ist mehr als viele kleine Firmen am Start haben. Habtja eine Erfehlung als Home-File, äh Fileserver. Kommt drauf an, was du damit machen willst.Das geht ja von Low-End billig bis ziemlich teuer. Willst du selbst bauen? Willst duwas Fertiges haben? Dann noch ein Play-Sender. Naja, das ist janoch ein Play-Sender. Oh, der hat sogar ne Konsole. Ist es, Konsolen sind auch komplettunsinnig, braucht man eigentlich nicht, aber sind cool, wenn man sie hat. Kennst du guteQuellen um sich da einzulehnen? Wo? Ja, das ist richtig alte. Die haben noch,die haben noch diese Nippel hier auf der Tastatur. Das ist ja so ein IBM, IBM Lenovo Merkmal,dass sie diese Nippel auf der Tastatur haben. Ehe, guck da, ja. Track, Track, äh, ja, Point.Point, Mist, Crazy. Ha, warum hat der noch ein Play-Sender? Äh, der übertreibt's.Also der hat, ja, der hat Stromkosten des Todes. Ja. Und daneben steht noch irgendeinNass drum, ok. Ok, also Captain Peng sagt, ähm, ich will Drive Dropbox iCloud-Ersatz.Ich würde gerne selber basteln, aber eine gute Soft-Lösung wäre auch, ne, also wenndu was Fertiges haben willst, hol dir irgendein Synology-Nass, fertig, gut hingestellt, Dingertaugen und reichen für einfache Sachen ohne Probleme aus.Na, wenn du selbst, wenn du was selbst bauen willst, ähm, würde ich dir keinen RaspberryPi empfehlen, die Dinger sind für Nass nicht sonderlich gut geeignet. Die Odroid-Dingersind ganz gut, wenn Single-Bot-Computer sein soll, aber, äh, für eine Nass mit am bestenist eigentlich, ähm, finde ich aktuell Low-Power, Low-Power-Intel. Irgendwie sowas hier. Low-Power-Intelkostet auch nicht viel. Hast viel Data-Anschluss. Ah, da kannst du keine, da kannst du jetztkeine großen, du hast da keinen Sass oder sowas drinne, äh, aber die Dinger verbrauchennicht viel, da kannst, äh, theoretisch noch einen Control, du kannst auch ne, ne, ne bessereNetzwerk-Cut oder so reinmachen, wobei das halt nur einfach PC-Express ist, äh, undauch nur PC-Express zweifach, aber die verbrauchen nicht viel, die verbrauchen irgendwie Eidlohne Platten, irgendwie nur 7, 7 Watt Eidl ungefähr, wenn man Stromspaß-Sachen anschließt.Kostet nur 80 Euro das Board, CPU ist schon drauf, ähm, also, das ist für so ne Nass-Bildwirklich gut. Ansonsten, wenn's ne fertige Single-Board-Computer sein soll, nimm sowas,da kannst, also viel einfacher kann man's nicht haben, wenn man selbst was bauen will,allerdings nur für eine, nur für eine Platte, ne. Nimmst so ein Ding, kannst ne 10TB-Plattereinmachen und, ähm, installierst da irgendwie ein aktuelles Ledungs-Persd-Karte drauf undzack. Das ist wirklich so die allerbilligste Variante, äh, easieste Variante, die man machenkann, wenn man was selbst bauen will. So ein Teil hab ich bei mir drüben liegen mit nerFestplatte drin für Fernsehaufnahmen. Da ist ne, da ist ne, am USB ist ne TV-Stick,Dual-Tuner-TV-Stick dran mit nem TV-Headend-Server aufm Linux und dahinten hängt ne, äh, glaub,2TB-WD-Green-Uralt-Platte dran, dass man da Fernsehaufnahmen drauf machen kann. Äh,im Moment sind wir stehen geblieben. Home Data Center. Na klar, VGA-Anschluss. Der müssteman Playcenter von hinten zeigen, die Dinger waren, äh, sehen sogar relativ interessantaus. Mit mehrere Netzteilen drin, mehrere Switches, die haben teilweise nur extra Sound-Switchesdrinne. Also die Playcenter an sich fand ich ne richtig coole Technik. Die Atoms sind auchnicht verkehrt. Ja, ich hoffe ja drauf, dass die mal endlich ne, ne neue Low-Power-Plattformrausbringen. Weil für mich ist Low-, dieses Low-Power-Segment von Intel ist aktuell das,fast das einzige, wo ich sage, da hat AMD nix. Ich kenn die, die Atom-Dinger sind, sind nichtübel. Äh, Atom. Eisen die wirklich so? Eisen die echt so? Also, zu dem Namen find ich jetztnix. Meinst du, du meinst eher die, oder? Ja, die sind auch ganz ok. Ne, das sind nichtdie. Ich weiß, die neuen Atom sind auch ganz gut. Aber, äh, Low-Power und Low-Budget findich die Jiminy-Lake-Sachen immer noch am besten. Was C? Ok, die sind schon, die sind anscheiden,ja die sind auch schon n bisschen älter, aber Jiminy-Lake-Sachen auch. Ein Einzelkarten-Computer,ah, yes. Ähm, das ist, das ist irgendwas im Raspberry-Format. Ja, die Dinger kann mansich auch holen, es ist nicht verkehrt, aber man sieht schon, es ist n bisschen teurer.Dafür hast du hier halt bei, bei diesen Super-Micro-Dinger halt auch, äh, Server-Ausstattung in Form von,du kriegst wahrscheinlich Management-Interface und sonst was. Aber wenn's wirklich Low-Budget-Low-Powersein soll, ganz ehrlich, irgendein Jiminy-Lake-Mainboard mit, äh, CPU schon drauf, kann man nicht allzuviel verkehrt machen. Das Problem am Nook ist, dass du keinen PCI-Express hast. Wenndu keinen PCI-Express brauchst, ist ok. Wenn du PCI-Express brauchst, äh, kannst du,du kommst mit dem Nook nicht weit. Richtig, du hast zu viele Server, eigentlich komplettunsinnig, aber hat was. 46 Kisten. 46, was hat er denn für ne Stromrechnung? Äh, 4, äh,nicht 64, 64. 64, wa, was hat er denn für ne Stromrechnung? Achso, achso, achso, achso,achso, also die Dinger, die auch im, im, im Schrank liegen, ok. Mich würd, mich würdja mal interessieren, ob der dazu sagt, was er damit macht. Ok, seht mal, und dann bezahltihr ordentlich. Weil diese Platesender ziehen auch massig, äh, Geld, ja. Über die Stromrechnungstand fast in den Kommentaren, wirklich. Ok, wir scrollen mal durch und so mal nachPower. Power? Solar powered UPS. Ok. Aber, es, es, es, es, es ist wirklich übertrieben,so, aber wir spulen mal ein bisschen vor. Er hat, er hat halt eBay leer gekauft, ne,er hat halt echt eBay, eBay leer gekauft, wenn ich mir das so anguck. Das ist auch von,das ist auch, ich mein, das Video von 2017, aber selbst 2017 ist das keine aktuelle Hardwaremehr gewesen. Was ist das? Ein Pentium 3? Also, das ist ja ne komplette Stromverschwendung.Aber das ist auch nicht auf, das ist auch nicht an, oder? Das ist aus. 380 Genre Sporstgeht noch. Erstmal Lidl. Ok, braucht er mehr Platz, reicht das nichtmal? Da versteckt er, da versteckt er sich dann immer drin, oder? ETF. Da, da, da kanner sich immer verstecken, dahinter. Na, es reicht auf jeden Fall, um das Zeug an- undabzustöpseln. Ach, ok, ja. Guck, da siehst du noch, du hast noch Sahnenkarten drin, weilden ollen Dingern, den er nicht verwendet. So, auch klar, hier, da, da sind hier irgendwelcheFiber Channel Sachen drin, oder so vermute ich mal. Die waren wahrscheinlich einfach nochdrin. Soll man einen Playcenter von hinten zeigen? Alle Cisco-Dinger? Wahrscheinlichauch unnötig laut, unnötig langsam, unnötig stromfressend? Ok.Ihr hört, wie das pustet, ne? Hier ist der Playcenter-Anschluss, unten drunter, dashat man gerade gesehen. Weiterweise hat Musik im Hintergrund laufen, das hört man nur kaum,weil es zu laut lüftert. Was zur Hölle? Die Mal-Anlage ist Playcenter, aber man siehtes kaum. Also, das ist schon ein echt krasses Setup für daheim. Total unsinnig. Ne, derhat nicht gesagt, was er drauf laufen lässt, das würde mich auch mal interessieren. JedeMenge ESXer, aber was lässt er auf seinem ESX laufen? Man weiß es nicht. Aber ultrakrasses Setup für daheim. Komplett unsinnig, meiner Ansicht nach, aber cool, hat was. Warumsoll man nur Sachen machen, die sinnvoll sind? Der Stromverbrauch ist, da reicht MonkaS nicht,der Stromverbrauch ist MonkaGiga. Rack-Server blows up. Ok, das müssen wir schnell maldurchscrollen. Der Depp1899 hat subscribt. Danke schön, Depp. Ich muss kurz gucken,wie der Server x, das muss ich mir angucken. Ich will wissen, wie der Server upload. Woupload er ab? Das sieht nach einem Billig-Schiner-Netzteil aus. Wo upload er ab? Oh, da. Oh, hier. Ja, jetztgleich MonkaS-Smoke. Es wäre eine bessere Idee gewesen, das Kabel reinzustecken, da wäreim Schalter anzumachen. Oh. Es schmilzt. Es brennt sich durch den Tisch. Boah, da stinktes jetzt bestimmt nicht. Nur mal das Fenster auf. Alter, mach das Fenster auf. Ja, dasdachte ich mir. Mach das Fenster auf. Erstmal eine Runde einatmen. Jetzt guter Technologie-Gestank.Was ist da hoch auf dem Netzteil? Moment, das ist ja uralt, da sind PCI-Anschlüsse,sehe ich das richtig? Ja, es wäre schön gewesen, er hätte noch das Fenster aufgemacht.Ja, exellent. Jetzt haben wir noch gesehen, wie der Server in die Luft fliegt. Aber daswar halt eine ganz uralt Geschichte. Hi, was macht er denn? Ja, irgendwie seinen Serverabfackeln. Warum? Weil es geht. Keine Ahnung. Es gibt schon bescheuerte Videos. Ich willes nicht machen. Ich will es nicht machen. Okay, was haben wir sonst noch so? Oh, daswollte ich ja auch mal im Stream machen, mein Nintendo, mein 3DS-Flashen. Das müssen wirso mal kurz angucken, was man an Homebrew laufen lassen kann auf dem DSi. Lego-Tank,AirCore und Flappy. Blablabla. Was man auf dem DSi an Customs laufen kann. 3DS-Flashist mittlerweile leichter denn je. Ja, ich werde es ausprobieren. Ich weiß nicht, obich es im Stream machen darf, ehrlich gesagt. Die Sache ist die, man darf es in Deutschlandmachen, es ist kein Problem, es ist meine eigene Hardware. Darf ich damit machen, wasich will. Ich weiß aber nicht, ob Twitch das mag, wenn man sowas zeigt im Stream. Dasstimmt, ich fand den auch ganz cool. Zumal, zumal, das Gute am ersten DS war, dass essehr schnell Modding-Karten gab, wo man von Micro SD-Karten alle möglichen Spiele abspielenkonnte. Inklusive den Gameboy Advance. Hier vorne waren ja Gameboy Advance-Cartridges,da kamen wir da rein. Ich hatte in der Berufsschule immer mein DS dabei und auf der SD-Karte,auf der Micro SD-Karte, hatte ich den Text Only Dump aus Wikipedia. Das war Pre-Smartphone,Leute. Das war Pre-Smartphone. Da hatte man kein Smartphone dabei, wo man einfach malWikipedia nachgucken konnte. Da hatte ich Wikipedia-Dump von, frag mich nicht, 3G aufder Micro SD-Karte in der Berufsschule dabei und das war sehr praktisch. Ich meine, 2004,2004 ist so eindeutig Pre-Smartphone. Ja, Nintendo hat zu viel iteratet zwischendurchsogar.Ja, aber ich hatte normalen DS. Wobei ich mir gar nicht sicher bin, ob ich einen normalenDS, also ich hatte definitiv einen mit Gameboy Advance-Slot.Nee, ich hatte normalen DS.Das war Pre-Snapchat-Filter noch.Das stimmt, ja.Den DSi hatte ich nie.Eine Sache, die damals selbst als der DS neu war, also was richtig gesagt hat, der DS konntenur WEP-WiFi, das hat halt gesagt und es war WPA2. Ich weiß nicht, wann WPA2 angefangenhat verbreitet. Guck mal, also das hätte Nintendo schon auch besser machen können.Also Moment, WPA, es hätte ja WPA gereicht. Es hätte ja WPA gereicht, ne? Und die hattennur WEP. Das heißt, du konntest selbst damals schon nicht online spielen, weil du ein WEP-Netzwerkgebraucht hast, was im Endeffekt bedeutet, du hast dein WLAN unverschlüsselt gehabt.Da hat Nintendo mal wieder richtig gefehlt. Aber Nintendo und online wissen wir ja, dasist eine Sache, die passt nicht zusammen.Das war so das Flappy Bird seiner Zeit damals, jeder hat's gespielt und ich hab mich immergefragt, warum spielt man den Kram?Guck mal, habt ihr was gesehen? Habt ihr's gesehen? Habt ihr's gesehen? Moment, habtihr's gesehen? Na? Das Ding hatte den Webbrowser, der war schlecht, aber das hatte den Webbrowser,ne? Stimmt! Ja, das gibt's ja nicht mehr. Top, das ist mittlerweile eingestellt.Ja.Ja, was wollen die meisten Leute? Das brauchen sie ja auch nicht mehr, also, ne? Keine Wunder,dass das Zeug günstig ist.Ja, das genau.Das ist gut. Also man kann sogar die DS-Flashcards verwenden.Also ich hatte damals für ein DS, hatte ich ein, wie heißt es, Cyclo? Cyclo-DS?Sowas da?Ja.Okay.Okay.Okay.Okay.Okay.Okay.Okay.Okay.Dann hatte ich ein, wie heißt es, Cyclo? Cyclo-DS? Sowas da?Genau.So ein Teil hatte ich damals.Genau.Genau.Das war eine Karte, das war quasi wie aufgebaut, man sieht es hier.Das war aufgebaut wie ein Nintendo-DS-Game.Das hast du reingesteckt und dort hattest du, du hattest hier unten einen MicroSD-Kartenslot.Und du konntest quasi so tun, als wäre das ein Nintendo-DS-Game.Aber in Wirklichkeit war das eine Custom-Card, wo die Games von der MicroSD-Karte gekommen sind.Das war quasi Sicherheitskopien, ja?Und das Ding gab es auch noch.Das war aber, Pre-Smartphone war das wirklich praktisch, damit ein Wikipedia dabei haben zu können.Jetzt unabhängig davon, wenn man damit jetzt vielleicht irgendwelche Sicherheitskopien spielen wollte, ja?Aber Wikipedia-Mobile dabei zu haben im Rucksack war 2005 wirklich nice.Wie gesagt, das war Pre-Smartphone.Ah!Man muss sich mal überlegen, dass 2019 kümmern sich noch Leute um Modding von einem DS.Ah, ja!Very private.Okay, das ist irgendeine Speicheradresse.Okay, da hat irgendeiner wahrscheinlich Directory-Fade nicht richtig escaped.Könnte ich mir vorstellen, wenn ich sowas sehe.Irgendeiner hat da irgendwelche Sachen nicht richtig escaped in der DS-Firmware.Aha.Ah, exzellent.Wahnsinn, 15 Monate. Wahnsinn, so lang.Hypersubscriber, ja. Dankeschön. Poggers.Moment, jetzt habe ich vergessen, wie geht das jetzt?Okay.Wahrscheinlich machen sie das größer.Ja.Ah, yes.Alles klar.Chat, morgen wird die Arbeit drüber geschrieben. Ich hoffe, ihr habt es verstanden.Ah.Kannst du das nochmal für dumme erklären?Ehrlich gesagt habe ich nicht so hundertprozentig durchgeblickt.Es ging ein bisschen schnell.So ganz grob, was ich verstanden habe, ist, es gibt so ein Index-File auf der SD-Karte, wo drin steht, was es für Bilder gibt.Und dieses Index-File sagt irgendwie auch, wie groß die ganze Bildergeschichte ist.Das kann man überschreiben und dann kommt man auf einem Custom-Builder-File raus und das Custom-Builder-File zeigt auf den nächsten Custom-Builder-File und das zeigt auf das nächste Custom-Builder-File.Und irgendwann zeigt das auf eine Custom-Binary-Datei, die ausgeführt wird.Aber im Detail müsst ihr es nochmal angucken.Aber er hat gesagt, es ist ziemlich einfach.Also ich glaube, ich werde mein DS nachher flashen. Ich bin da jetzt irgendwie ganz scharf drauf.Ich weiß aber gar nicht, was ich damit machen soll. Warum soll ich den flashen?Ich weiß gar nicht, was ich damit machen soll.Weil man es kann, ja.Also ich habe ganz ehrlich, ich sitze lieber mit einem 3DS im Zug und spiele alles mit einer Switch. Die Switch ist mir viel zu fett.Excellent.Ja, da bin ich eigentlich schon on. Fast zwei Stunden. Kommt mir gar nicht so lang vor.Ich habe Hunger. Ich habe übelst Hunger langsam.Das ist echt ein Thema, ne? Das wird so oft kassiert schon, diese ganze Geschichte. Aber sie geben nicht auf.Dafür ist gar nicht genug Platz.Ja, dann.Ja, guck mal.Weil es geht wahrscheinlich. Das ist der einzige Grund.Man kann es machen.Barbecue Sushi.Also ich werde jetzt übrig gebliebenes halbes Schnitzel futtern und ein paar Pommes frites dabei machen.Ist er immer noch nicht fertig damit? Hat er nicht vor zwei Jahren angefangen, diesen PC zu bauen?Er hat doch vor zwei Jahren angefangen, diesen PC zu bauen.Auch schon eine Kühlwasser. Was ist das?Okay, alles klar.Die anderen Videos sind mir jetzt zu anspruchsvoll. Wobei das Elektro Boom Video könnten wir uns so angucken.Ja, zeigt mal her.Was ist denn jetzt los?Was ist das auf der Straße? Hab ich noch nie gesehen. Das ist bestimmt nicht so eine Ami-Geschichte. Kerkona-Style.Wahrscheinlich gibt es das bei uns gar nicht. Oder was soll das sein?Ach so. Die meinen, dass man das erkennt, wenn einer vor der Ampel steht.Ach das ja, das haben wir auch.Ja, das haben wir auch, das haben wir auch.Der Chat, 10 Monate, Dankeschön. Huge Subscription.Klingt sinnvoll.So in diesen Intersektionen, wenn ich nur ein Auto sehe, das auf dem ersten Sensor stoppt, stoppe ich auf dem zweiten Sensor, damit mein Licht grün wird.Du Monster.Aber ich frage mich, wie diese Sensoren funktionieren. Es muss ein Weichsensor sein, mit einem hohen Weichsensor, damit etwas so schwer wie ein Auto es bewegen würde.Deine Mama würde den Sensor bewegen.Ah du Idiot. Es ist unsere Mama, die dich vertreten.Oh, sorry.Was ist los, Jungs?Oh verdammt, nichts.Oh verdammt.Wo sind meine Pilze?Mal sehen.Die Sensoren sind Induktivlupen.Wenn das so ist, ist es so.Ein gigantischer Metalldetektor.Oh, also ist es eine Magnetikradiation.Was? Sie machen uns in unseren Autos lebendig?Nein Mann, sie haben eine sehr hohe Frequenz und Kraft.Warum spreche ich zu mir? Wo sind meine Pilze?Die Art, wie diese Sensoren funktionieren, ist ziemlich einfach.Sie sind grundsätzlich aus einem gigantischen Lauf des Weichsensors.Und wenn du eine AC-Voltage über den Weichsensor platzierst, wird ein AC-Kurrent durch den Weichsensor gehen,aufgrund der Impedanz des Weichsensors.Wenn ein Auto, zum Beispiel, das aus Stahl und einem gigantischen ferromagnetischen Körper auf dem Koil stoppt,werden die Magnetikradiationen von dem Koil durch den Körper des Autos magnifiziert.Die Induktanz des Koils steigt deutlich, die Impedanz steigt, der Kurrent fallt,du entdeckst diese Veränderungen und du weißt, dass da ein Auto ist.Nein, es ist wie einer von diesen Kreditkart-Lieferanten, dass du deinen Karten auf den Karten tippst,es steigert deinen Karten und gibt dir Informationen.Es ist doch egal, es ist doch egal, Bill Gates spritzt uns doch eh neue Mikrochips, also das macht es doch alles keinen Unterschied mehr.Was machst du?Steig zurück!Ich mache meinen Scope batterieoperiert.Nicht den 4-Channel-Scope, zumindest den 2-Channel.Okay, gut, lass mich sehen.Schleif-Boys!Ich sollte ihnen eine Frau finden, damit sie in einen guten Mann werden.Ich denke, du solltest deine Pilze nehmen.Oh, da ist es. Alles besser. Jetzt können wir es aufhören zu öffnen.Lohnt es sich, Peaholz zu installieren? Kommt drauf an, für was? Also für Twitch und YouTube bringt es dir nix. Twitch geht wohl irgendwie, aber YouTube geht gar nicht.Er wird immer besser, was seine Sellouts angeht.Okay, ist er laut.War so richtig viel drin.Nein, ich habe kein 2-Channel-Scope, ich habe nur ein 2-Channel-Scope.Ist auch so ein Ding, wo ich mir schon ein paar Mal überlegt habe, aber nee, wozu? Ich habe einen Logic-Analyser, wo man ein paar ähnliche Sachen mitmachen kann.Das ist für Low-Power-Zeug.Ach, yes.Was hat er vor? Er will das Ding batteriebetrieben machen?Okay.Da ist ganz schön viel Heißkleber drin hier.Haben die den Kleber an den Spulen, dass es nicht piepst? Oder wozu ist der Kleber? Ich meine, dass die Komponenten drauf bleiben, kann ja der Kleber wohl kaum sein.Das geht noch.Ah, yes.Okay.Excellent.Ah, der Kleber ist dazu da, damit die Komponenten einen Vibrationstest bestehen, dadurch verstehe. Excellent Informations.Jetzt denken sich die Leute auch, WTF passiert da gerade.Ich würde mich da gar nicht trauen, drüber zu fahren.Bei uns sind die Dinge aber besser versteckt. So habe ich das noch nie auf der Straße gesehen.Ja, ein bisschen. Ein bisschen. Ein bisschen. Ein bisschen, ein bisschen.Na ja.Also so hat es nicht funktioniert.Das war immer ganz davon abgesehen. Also, wenn du Leute tracken willst, ist ein Smartphone doch mal tausendfach besser als irgendwelche komischen Schleifen auf der Straße.Also, wenn du Leute tracken willst, ist ein Smartphone doch mal tausendfach besser als irgendwelche komischen Schleifen auf der Straße.Also, ich würde mir ja Gedanken machen, da mit meinem Auto drüber zu fahren, wenn da irgendetwas auf die Straße gepappt ist.Der ist in Kanada, oder? War der in USA oder in Kanada? Ich kann mir das immer nicht merken.Kanada.Okay, genug Werbung.Excellent. Jetzt wissen wir auch Bescheid, wie man es nicht macht.Ich glaube, ich gehe was essen. Ich habe übels Hunger. Was haben denn die Barbecue Pit Boys so Neues? War das gerade?Was gibt es denn hier Neues? Beef-Bacon-Sushi-Slide. Ein Sushi auf ein Burger? Ich weiß ja nicht.Ich weiß ja nicht.Smoked Fried Sparrel. Oh, das sieht gut aus. Aber ich, nein, nein Leute, ich fange nicht wieder an, im Stream zu essen. Wenn ich im Stream esse, habe ich erstens schon mal übels rumgesaut, weil ich im Headset hängen geblieben bin. Außerdem kann ich da nicht entspannt essen. Das mache ich jetzt nicht.Das mache ich jetzt nicht.Oh, Kokona.Huge Update, Home Center. Jetzt gucken wir das nächste Mal.Jawoll. Hauptsache, ich habe ein Hardware-Video zum Reacten-Prost-Stream. So, speichern wir den ganzen Kram mal. Moment.Bookmark All Tabs. Vom 20.9. Excellent. So, und dann können wir das nächste Mal hier weiter gucken. Ich gehe jetzt was essen. Ich habe übels Hunger, Leute. Und nachher kann es durchaus sein, dass wir weiter basteln an dem SSL HTTPS Web-Server.Aber erstmal was essen.Also nachher heißt es dann irgendwann heute Nachmittag. Es ist jetzt 12.30 Uhr. Also nicht vor 15 Uhr. Oder vielleicht. Mal gucken. Vielleicht sogar schon früher. Waren wir nachher weiter. Okay, also bis denn. Macht's gut, CU. Ich habe übels Hunger. Macht's gut. Pepo Fett, genau. CU. Und ein bisschen kürzer.", "segments": [{"id": 1, "start": 0.0, "end": 5.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 2, "start": 30.0, "end": 35.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 3, "start": 61.0, "end": 73.0, "text": "I remember typing Dan's game, forehead swift rage, PJ salt and failfish."}, {"id": 4, "start": 74.0, "end": 88.0, "text": "Life was easy, spamming all the time, TOS was nowhere, so everyone's feeling fine, twitchy molds from long ago."}, {"id": 5, "start": 88.0, "end": 107.0, "text": "Kokona made you feel you're not alone, Kappa Pock jammed, keep a forehead, Bible thumb, twitchy molds."}, {"id": 6, "start": 107.0, "end": 119.0, "text": "Still hear his bark in the morning hour, he calls me, his doggy emote reminds me of a time far away."}, {"id": 7, "start": 120.0, "end": 130.0, "text": "Looking at a chat, I get a feeling that I miss emotes from yesterday, yesterday."}, {"id": 8, "start": 130.0, "end": 150.0, "text": "Twitchy molds from long ago made you feel you're not alone, Kappa Pock jammed, cap is Kappa Bible thumb."}, {"id": 9, "start": 150.0, "end": 162.0, "text": "Twitchy molds, perfect hands, twitchy molds, Bible thumb."}, {"id": 10, "start": 181.0, "end": 188.0, "text": "Crisis, crisis remastered, crisis remastered."}, {"id": 11, "start": 189.0, "end": 194.0, "text": "Okay, also ich will kein Testvideo gucken, ich will ehrlich gesagt einfach nur wissen, was rausgekommen ist."}, {"id": 12, "start": 197.0, "end": 199.0, "text": "Äh, gibt's nicht, ja."}, {"id": 13, "start": 199.0, "end": 207.0, "text": "Boah, 22 Minuten, what the f***, osartische Unterschied wird's nicht sein, oder?"}, {"id": 14, "start": 208.0, "end": 210.0, "text": "Haben die da, ich glaub nicht, dass die da viel gemacht haben."}, {"id": 15, "start": 211.0, "end": 214.0, "text": "Oder ist das ein Remastered, was man als Remastered wirklich durchgeht?"}, {"id": 16, "start": 215.0, "end": 220.0, "text": "Und nicht einfach nur ein paar Texturen ausgetauscht, durchwachsen, okay?"}, {"id": 17, "start": 221.0, "end": 223.0, "text": "Gucken wir mal, ähm."}, {"id": 18, "start": 223.0, "end": 229.0, "text": "Crisis Remastered, Switch?"}, {"id": 19, "start": 230.0, "end": 235.0, "text": "Dazu kann ich eigentlich nur das hier sein."}, {"id": 20, "start": 236.0, "end": 238.0, "text": "Auf der Switch, Alter."}, {"id": 21, "start": 239.0, "end": 241.0, "text": "Das geht aber nicht."}, {"id": 22, "start": 242.0, "end": 245.0, "text": "Okay, es kommt nicht gut weg."}, {"id": 23, "start": 246.0, "end": 248.0, "text": "Warum nicht? Weil?"}, {"id": 24, "start": 248.0, "end": 256.0, "text": "Weil ich mal muss ja sagen, mittlerweile läuft Crisis ja wirklich auf fast allem."}, {"id": 25, "start": 257.0, "end": 265.0, "text": "Man darf doch nicht vergessen, das Spiel ist ja von, von wann ist Crisis? 2005? Oder so?"}, {"id": 26, "start": 266.0, "end": 268.0, "text": "Ah nee, 2007."}, {"id": 27, "start": 269.0, "end": 274.0, "text": "Also ist ja schon mal nur 13 Jahre alt, also mittlerweile läuft es ja wirklich überall drauf."}, {"id": 28, "start": 274.0, "end": 282.0, "text": "Index Optimization, no gameplay improvements, da fand ich irgendwie, es war ein bisschen hakelig, ja."}, {"id": 29, "start": 283.0, "end": 287.0, "text": "Das war aber Far Cry auch, und ich fand's gar nicht so übel."}, {"id": 30, "start": 290.0, "end": 296.0, "text": "Wie man kann kein Manual Save mehr machen, das war eigentlich das Geilste, auch gerade in Far Cry."}, {"id": 31, "start": 296.0, "end": 303.0, "text": "Far Cry, äh, wobei, warte mal, hatte Far Cry Manual Saves? Ich bin grad gar nicht, bin mir da gar nicht so sicher, gerade ob Far Cry."}, {"id": 32, "start": 304.0, "end": 311.0, "text": "Nee, Far Cry hatte keine Manual Saves, oder? Zumindest hatte Far Cry Save Points, das weiß ich noch."}, {"id": 33, "start": 312.0, "end": 314.0, "text": "Ich weiß aber nicht, ob es zu, zu..."}, {"id": 34, "start": 314.0, "end": 325.0, "text": "...setzlich Manual Saves hatte. Es hat auf jeden Fall Save Points."}, {"id": 35, "start": 328.0, "end": 334.0, "text": "The Worst Remaster in Gaming, ich dachte das ist, äh, Warcraft 3 Deforged schon."}, {"id": 36, "start": 335.0, "end": 339.0, "text": "Also das ist ja schon, also man muss ja sagen, das ist ja eigentlich ein Feature, ne?"}, {"id": 37, "start": 339.0, "end": 344.0, "text": "Das ist ja eigentlich schon ein Feature, also, dass die Performance schlecht ist."}, {"id": 38, "start": 345.0, "end": 350.0, "text": "Das muss ja bei Far Cry so sein, äh, bei, bei Crysis so sein, sonst, sonst wäre das ja kein Crysis."}, {"id": 39, "start": 354.0, "end": 356.0, "text": "Die Leute finden schlecht."}, {"id": 40, "start": 357.0, "end": 361.0, "text": "Ah ja, alles klar. Keine Comrades am Start."}, {"id": 41, "start": 361.0, "end": 372.0, "text": "Ich wollte, ich wollte, ich wollte, ich wollte gerade, ich wollte gerade sagen, die Russen sind ja auch mal wieder die einzigen, die auf einer internationalen Seite die Sachen in Russisch schreiben."}, {"id": 42, "start": 373.0, "end": 376.0, "text": "Und was sehe ich als nächstes? Schlechter Konsolenport."}, {"id": 43, "start": 377.0, "end": 381.0, "text": "So, also, dann muss ich das jetzt ja weiter..."}, {"id": 44, "start": 382.0, "end": 387.0, "text": "Die Russen und die Deutschen sind hier die einzigen, die auf einer internationalen Seite das Ganze in Deutsch und Russisch schreiben."}, {"id": 45, "start": 387.0, "end": 394.0, "text": "So, weil man ja noch nicht mal auf der Seite irgendwie die Reviews per Sprache kennzeichnen kann."}, {"id": 46, "start": 397.0, "end": 401.0, "text": "Besser als das Prince of Persia Remaster. Das kenne ich gar nicht."}, {"id": 47, "start": 402.0, "end": 404.0, "text": "Das ist wahrscheinlich auch nicht, nicht schlimm."}, {"id": 48, "start": 405.0, "end": 410.0, "text": "Es fehlt ein Level aus dem Original. Jetzt die Frage, hatten die nicht auf den Konsolen?"}, {"id": 49, "start": 411.0, "end": 413.0, "text": "Gab es nicht auf dem Konsolenrelease irgendein extra Level?"}, {"id": 50, "start": 413.0, "end": 418.0, "text": "Nee, umgedreht. Auf dem Konsolenrelease haben sie das Flugzeuglevel rausgemacht oder irgendwie sowas, ne?"}, {"id": 51, "start": 419.0, "end": 422.0, "text": "Ich kann mich da gar nicht mal richtig dran erinnern. Das ist schon, schon, schon ewig her."}, {"id": 52, "start": 423.0, "end": 425.0, "text": "Mein 13er-Jahr ist das, gell, mal, weiß ich nicht mehr."}, {"id": 53, "start": 426.0, "end": 429.0, "text": "Weiß ich nur, dass es, dass die Erweiterung kacke war. Warhead war übelst freudig."}, {"id": 54, "start": 429.0, "end": 443.0, "text": "Man kann sich auch darüber streiten, ob das letzte Viertel so von oder Drittel, oder was kann man genau sagen, das war mit den Aliens in Crysis jetzt so geil war."}, {"id": 55, "start": 444.0, "end": 447.0, "text": "Edge in the Tasteless ist nicht nur Edge, der neue Edge."}, {"id": 56, "start": 448.0, "end": 450.0, "text": "Excellent. Nein."}, {"id": 57, "start": 450.0, "end": 467.0, "text": "Nein. Das muss aber so sein, weil in Far Cry 1 wohlgemerkt, Far Cry 1 war das einzige Far Cry von Crytek, da hatten sie ja am Ende auch jede Menge Aliens drin."}, {"id": 58, "start": 468.0, "end": 472.0, "text": "Und es waren, glaube ich, Mutanten in Far Cry, da kommt das gleiche raus. Das hat sich auch doof gespielt."}, {"id": 59, "start": 472.0, "end": 480.0, "text": "Und letztens von Ubisoft angekündigt. Okay."}, {"id": 60, "start": 481.0, "end": 485.0, "text": "Wollten wir uns nicht die neuesten C-Sharp-Features angucken irgendwann?"}, {"id": 61, "start": 486.0, "end": 489.0, "text": "Irgendjemand hat das gepostet und hat gemeint, ich soll auf jeden Fall warten, bis er wieder da ist, weil ihn interessiert, was ich sag."}, {"id": 62, "start": 490.0, "end": 492.0, "text": "Weiß ich nicht, ob der diejenige da ist."}, {"id": 63, "start": 493.0, "end": 495.0, "text": "So, also, das erste, was wir uns heute angucken werden, ist das hier."}, {"id": 64, "start": 496.0, "end": 498.0, "text": "Da bin ich nämlich mal gespannt, was er dazu sagt."}, {"id": 65, "start": 498.0, "end": 501.0, "text": "Nein, nein, nein. Moment. Ja, das da."}, {"id": 66, "start": 502.0, "end": 506.0, "text": "Das ist das erste, was wir uns angucken werden, was Fortunet sagt zu Black Ops."}, {"id": 67, "start": 507.0, "end": 509.0, "text": "Da bin ich mal gespannt. Er fand in Modern Warfare kacke."}, {"id": 68, "start": 510.0, "end": 512.0, "text": "Und ich bin mal gespannt, was er zu Black Ops sagt."}, {"id": 69, "start": 513.0, "end": 520.0, "text": "Also, was ich so mitbekommen habe, was ich so mitbekommen habe, ich hab's nicht gespielt, ich werd's auch nicht spielen, weil das ist auf der PS4 und ich hab zwei linke Hände am Playstation-Controller."}, {"id": 70, "start": 521.0, "end": 523.0, "text": "Ich krieg's da mittlerweile mit dem Xbox-Controller schon gar nicht mehr richtig hin."}, {"id": 71, "start": 523.0, "end": 527.0, "text": "Ich bin einfach zu PCMR mittlerweile."}, {"id": 72, "start": 528.0, "end": 533.0, "text": "Und die einzige Variante, die ich hätte, ich könnt Maus-Tastatur anschließen."}, {"id": 73, "start": 534.0, "end": 541.0, "text": "An die Playstation 4, aber auf der alten Playstation 4, ich hab ja nicht mal die Pro, ich hab ja die Release-Date-Konsole, die ich vielleicht fünf Stunden lang hatte."}, {"id": 74, "start": 542.0, "end": 545.0, "text": "Das spielt sich extrem laggy mit Maus-Tastatur."}, {"id": 75, "start": 546.0, "end": 550.0, "text": "Ganz merkwürdig. Das kann man irgendwie ganz, ganz schwierig steuern."}, {"id": 76, "start": 550.0, "end": 552.0, "text": "So, und, ähm..."}, {"id": 77, "start": 553.0, "end": 558.0, "text": "Die nächste Variante wäre, ich cheate quasi und schließ mein Maus zu Controller-Converter an."}, {"id": 78, "start": 559.0, "end": 563.0, "text": "Dann hätt ich Auto-Aim und besseres, besseres In-Game-Feeling."}, {"id": 79, "start": 564.0, "end": 567.0, "text": "Aber das wäre ja quasi schon fast illegal. Nee, ist das nicht."}, {"id": 80, "start": 568.0, "end": 570.0, "text": "Also ich mach ja nix dagegen, aber es ist trotzdem nicht so schön."}, {"id": 81, "start": 571.0, "end": 573.0, "text": "Deswegen guck ich mir erstmal an, was die anderen Leute zu sagen haben."}, {"id": 82, "start": 574.0, "end": 578.0, "text": "Also was ich so gelesen hab, auf Twitter ist vernichtend."}, {"id": 83, "start": 578.0, "end": 579.0, "text": "Ja."}, {"id": 84, "start": 580.0, "end": 583.0, "text": "Also Waffen-Sounds müssen ganz mies sein."}, {"id": 85, "start": 584.0, "end": 590.0, "text": "Es muss immer noch rumgeschwitzt, beziehungsweise, also das ist ja nicht das Problem, immer rumgecampt werden erst, fuck."}, {"id": 86, "start": 591.0, "end": 593.0, "text": "Also sagen wir mal defensiv gespielt werden ohne Ende."}, {"id": 87, "start": 594.0, "end": 596.0, "text": "Es hockt wohl immer noch in jeder Ecke einer."}, {"id": 88, "start": 597.0, "end": 604.0, "text": "Also es ist eher so eine Art Modern Warfare im Kalten Krieg als wohl ein Black Ops, so wie man sich das erwartet hat."}, {"id": 89, "start": 604.0, "end": 610.0, "text": "Und es muss sehr, sehr unfertig sein und sich auch dementsprechend komplett unfertig spielen."}, {"id": 90, "start": 611.0, "end": 614.0, "text": "Natürlich hast du die üblichen Diskussionen, die hast du ja die letzten 13 Jahre schon."}, {"id": 91, "start": 615.0, "end": 617.0, "text": "Und die letzten 10 Jahre, seit ich den Kram schon mache, hast du die gleichen Diskussionen ja."}, {"id": 92, "start": 618.0, "end": 621.0, "text": "Die kommen raus, die Leute sagen, haha, ja, das ist deine Alpha."}, {"id": 93, "start": 622.0, "end": 625.0, "text": "Ja, aber guck dir mal Leute, es ist Ende September."}, {"id": 94, "start": 626.0, "end": 628.0, "text": "Das Game kommt in zwei Monaten ungefähr raus."}, {"id": 95, "start": 629.0, "end": 631.0, "text": "Ich weiß gar nicht wann Release Date ist."}, {"id": 96, "start": 631.0, "end": 633.0, "text": "Ja, es kommt ungefähr in zwei Monaten raus."}, {"id": 97, "start": 634.0, "end": 636.0, "text": "Da tut sich nicht mehr viel."}, {"id": 98, "start": 637.0, "end": 639.0, "text": "Da ist am Ende zwar ein bisschen mehr Content drin."}, {"id": 99, "start": 640.0, "end": 644.0, "text": "Aber das ist wie in Modern Warfare, wo auch Alexander Horomaks, das ist nur eine Beta."}, {"id": 100, "start": 645.0, "end": 647.0, "text": "Das ist genauso am Ende geworden."}, {"id": 101, "start": 648.0, "end": 650.0, "text": "Das sind alles Promotion Alpha Betas."}, {"id": 102, "start": 651.0, "end": 658.0, "text": "Also die wollen das promoten und die wollen vielleicht mal gucken, dass die Server irgendwie halten oder so."}, {"id": 103, "start": 658.0, "end": 661.0, "text": "Also zumindest laut Twitter ist das mega, mega schlecht."}, {"id": 104, "start": 662.0, "end": 664.0, "text": "Ich kann dazu nichts sagen, ich hab's nicht ausprobiert."}, {"id": 105, "start": 665.0, "end": 669.0, "text": "Allerdings ging mir der Modern Warfare Multiplayer ziemlich auf den Keks."}, {"id": 106, "start": 670.0, "end": 676.0, "text": "In Modern Warfare kam aber auch noch dazu, dass ein Großteil der Maps einfach nur extrem mies war."}, {"id": 107, "start": 677.0, "end": 683.0, "text": "Du hattest Maps wie, ähm, irgendwie Palace, irgendwas, ich weiß gar nicht wie das Ding genau heißt."}, {"id": 108, "start": 683.0, "end": 690.0, "text": "So ein riesen Map, wo du dich gar nicht drauf findest und wenn du findest sitzt da irgendein Typ im Fenster und guckt seit fünf Minuten da raus."}, {"id": 109, "start": 695.0, "end": 706.0, "text": "Die besten Spielmodi waren, als die auf die Idee gekommen sind und die kleineren Maps in so ein Playlist gepackt haben."}, {"id": 110, "start": 706.0, "end": 712.0, "text": "Das Problem war daran nur, dass die dort auch Shipment reingepackt haben und Shipment ist halt keine Map."}, {"id": 111, "start": 713.0, "end": 722.0, "text": "Shipment ist halt das, was ein Level Design, das muss doch nicht mal ein Praktikant, was ein absoluter Level Design Noob in der ersten halben Stunde in einem Level Editor macht."}, {"id": 112, "start": 723.0, "end": 724.0, "text": "Das ist Shipment."}, {"id": 113, "start": 725.0, "end": 731.0, "text": "Und warum das überhaupt, das hat absolut keine Existenzberechtigung überhaupt in diesem Spiel zu sein."}, {"id": 114, "start": 731.0, "end": 738.0, "text": "Warum das in Call of Duty 4 war, weiß ich nicht. Da war es aber glaube ich nur eine Mini in your face, free for all Map und sonst nix."}, {"id": 115, "start": 739.0, "end": 744.0, "text": "Also, du hast so Sachen wie Asia Cave, übelst Müll."}, {"id": 116, "start": 745.0, "end": 746.0, "text": "Dann hast du..."}, {"id": 117, "start": 748.0, "end": 752.0, "text": "Kann ich mich gar nicht mehr dran erinnern. Superstore, auch absolut grausam."}, {"id": 118, "start": 754.0, "end": 756.0, "text": "Remake geht halbwegs auch grausam."}, {"id": 119, "start": 756.0, "end": 760.0, "text": "Auch viel zu groß. Eine der schlimmsten Maps überhaupt."}, {"id": 120, "start": 761.0, "end": 765.0, "text": "Hardhat geht tatsächlich ganz gut, wobei ja auch halt viel. Man den Unterschied zu MW3 merkt, worum geliegen wird."}, {"id": 121, "start": 766.0, "end": 770.0, "text": "Die geht auch noch halbwegs. Gunrunner ist eigentlich, finde ich somit, die beste Map."}, {"id": 122, "start": 772.0, "end": 776.0, "text": "Sagt mir jetzt gerade aus dem Kopf nix, sagt mir jetzt auch nix. Oh, Piccadilly ist ja noch schlimmer."}, {"id": 123, "start": 776.0, "end": 786.0, "text": "Also hier jagt ja ein Map Highlight das andere. Sagt mir jetzt auch nix. Rust, kannst du auch komplett knicken, das ist ja auch keine Map, die man spielen soll."}, {"id": 124, "start": 787.0, "end": 790.0, "text": "Scrapyard ist auch mega schlimm geworden. Shipment ist schon immer für'n Arsch."}, {"id": 125, "start": 791.0, "end": 795.0, "text": "Shoothouse ist es tatsächlich ganz gut. Sagt mir jetzt auch grad nix."}, {"id": 126, "start": 795.0, "end": 805.0, "text": "Backload ging auch halbwegs. Wacom auch halbwegs. Die Hälfte der Maps ist absoluter Schrott und da sind vielleicht zwei, drei gute Maps dabei."}, {"id": 127, "start": 806.0, "end": 811.0, "text": "Also ich weiß nicht wie das in Black Ops ist. Musst du uns mal angucken, was er dazu sagt. Bin ich wirklich mal gespannt."}, {"id": 128, "start": 811.0, "end": 824.0, "text": "Okay, okay, okay. Nein, dann gilt das nicht, weil das erste Game ist noch bevor Skill-Based Matchmaking reinkickt. Der wird jetzt übelst zerstören und sich mega freuen über das Game."}, {"id": 129, "start": 825.0, "end": 828.0, "text": "Und nach der dritten Runde hat er keinen Bock mehr. Ich seh's kommen, 100%."}, {"id": 130, "start": 828.0, "end": 844.0, "text": "Okay, es ist ein Modern Warfare Reskin. Es ist jetzt wirklich das erste Mal, dass ich in-game sehe. Ich hab mir nichts angeguckt dazu."}, {"id": 131, "start": 844.0, "end": 858.0, "text": "Okay, es ist einfach mal Modern Warfare Waffenauswahl reskinnt."}, {"id": 132, "start": 859.0, "end": 861.0, "text": "Laut genug oder?"}, {"id": 133, "start": 862.0, "end": 864.0, "text": "Laut genug."}, {"id": 134, "start": 864.0, "end": 878.0, "text": "Das ist aber so krass Modern Warfare Waffenauswahl reskinnt."}, {"id": 135, "start": 878.0, "end": 893.0, "text": "Das ist aber so krass Modern Warfare Waffenauswahl reskinnt."}, {"id": 136, "start": 893.0, "end": 915.0, "text": "Das ist aber so krass Modern Warfare Waffenauswahl reskinnt."}, {"id": 137, "start": 915.0, "end": 936.0, "text": "Auch der Player-Screen hier. Das ist Modern Warfare Reskin as fuck. Das sieht ja überhaupt nicht wie dein eigenes Game aus."}, {"id": 138, "start": 936.0, "end": 944.0, "text": "Das ist Original. Das ist einfach der Modern Warfare Reskin. Du siehst das alles, wie das hier aufgebaut ist und so."}, {"id": 139, "start": 945.0, "end": 950.0, "text": "Klar, das sind andere Models, aber der Style ist original. Das ist original Modern Warfare."}, {"id": 140, "start": 951.0, "end": 955.0, "text": "Mich würd sogar nicht wundern, wenn es die gleiche Schrift da ist, aber da bin ich mir jetzt nicht ganz sicher."}, {"id": 141, "start": 955.0, "end": 968.0, "text": "Ja, ja. Mach mal langsamer."}, {"id": 142, "start": 969.0, "end": 974.0, "text": "Auch die Intro-Videos?"}, {"id": 143, "start": 974.0, "end": 984.0, "text": "Es sieht ein bisschen verschwommen aus."}, {"id": 144, "start": 985.0, "end": 995.0, "text": "Warum heißt es Dingalo SA-12 und nicht SPAS-12? Haben die wieder nur teilweise Waffenlizenzen gekriegt? Weil die MP5 heißt MP5."}, {"id": 145, "start": 995.0, "end": 1003.0, "text": "Die haben bestimmt wieder nur teilweise Waffenlizenzen bekommen. Anders konnt ich mir das nämlich in Modern Warfare auch nicht erklären."}, {"id": 146, "start": 1004.0, "end": 1010.0, "text": "Es sieht ein bisschen aus wie, äh, nicht Silk Road Battlefield 1 Map. Ja, du hast recht. Ich weiß aber auch nicht, wie die heißt."}, {"id": 147, "start": 1011.0, "end": 1018.0, "text": "Die wo Rush so mega gesackt hat, weil hier so ein Gebirge war. Weiß nicht. Ich weiß gerade aus dem Kopf nicht, wie die Map heißt. Ich hab Battlefield 1 nicht richtig gespielt."}, {"id": 148, "start": 1018.0, "end": 1033.0, "text": "Aber du hast recht. Es sieht wirklich ähnlich aus wie die Battlefield 1 Map. Sinai Desert, ja, genau."}, {"id": 149, "start": 1033.0, "end": 1047.0, "text": "Ja, gut. Er hat einen Gegner gefunden."}, {"id": 150, "start": 1048.0, "end": 1059.0, "text": "Das ist... Das ist vor... Das ist vor Skill-Match-Match-Banking. Das ist seine erste Runde. Die nächste Runde ist auf 100% übelst am Abkotzen."}, {"id": 151, "start": 1059.0, "end": 1065.0, "text": "Ja, ja. Also wenn du hier rüberläufst, gehen sie zurück in das Schlachtfeld. Ansonsten tippst du auf 100%."}, {"id": 152, "start": 1066.0, "end": 1072.0, "text": "Die haben sich ja mittlerweile aufgegeben, halbwegs realistische Map-Begrenzungen einzubauen. Die sagen einfach, ja, ja, wir killen dich."}, {"id": 153, "start": 1072.0, "end": 1092.0, "text": "Stormination? Nee, das ist Hardhead oder irgendwie sowas. Ich wette mit euch, er feiert übelst und freut sich total, weil die erste Runde halt mega geil läuft."}, {"id": 154, "start": 1093.0, "end": 1099.0, "text": "Es ist halt nur mal in Multiplayer-Spielen so, auch wenn das Spiel an sich nicht so wahnsinnig geil ist, solange man owned, macht alles Bock."}, {"id": 155, "start": 1099.0, "end": 1104.0, "text": "Also du kannst fast das größte Scheiß-Game spielen. Wenn du Gegner zerstörst, macht's Spaß."}, {"id": 156, "start": 1111.0, "end": 1119.0, "text": "So, absolut blind die Gegner. Ich wette mit euch, ab dem dritten Game ist er voll am Kotzen wieder."}, {"id": 157, "start": 1119.0, "end": 1127.0, "text": "Weil dann kriegt er gescheite Gegner."}, {"id": 158, "start": 1127.0, "end": 1152.0, "text": "Ja, Relics, genau das dachte ich mir. Das ist bei Modern Warfare auch so. Es macht Bock, bis es Skill-Base-Matchmaking komplett reinkickt."}, {"id": 159, "start": 1152.0, "end": 1160.0, "text": "Sind das Scorestreaks oder Skillstreaks? Gute Frage. Oh, jetzt wird er gescheitert."}, {"id": 160, "start": 1160.0, "end": 1172.0, "text": "Ich habe einen Sniper. Team, ich habe noch einen UAV, das ist gut."}, {"id": 161, "start": 1190.0, "end": 1203.0, "text": "Hört euch das mal an. Das wummert einfach nur. Das Bass macht einfach nur Bass ohne wirklich einen Sound zu haben."}, {"id": 162, "start": 1221.0, "end": 1228.0, "text": "Na klar, das wird ja weiter so sein."}, {"id": 163, "start": 1229.0, "end": 1233.0, "text": "Das ist, ich glaube, das ist auch wieder eine Map. Da kannst du nicht rumrennen."}, {"id": 164, "start": 1234.0, "end": 1239.0, "text": "Hier aimt dich wahrscheinlich um jede Ecke schon, normalerweise irgendeiner ab der dritten Runde."}, {"id": 165, "start": 1239.0, "end": 1257.0, "text": "Guckt euch das mal an. Hitmarker, diese Ordeneinplantung hier unten. Das ist alles original Modern Warfare reskinned?"}, {"id": 166, "start": 1257.0, "end": 1265.0, "text": "Okay, die Shotgun ist nicht One-Hit, Klaus."}, {"id": 167, "start": 1265.0, "end": 1275.0, "text": "Konnte man Sliden? Ist er gerade geslided?"}, {"id": 168, "start": 1276.0, "end": 1285.0, "text": "Oh, das wird wieder gehackt, wenn man Sliden kann. Die meisten Leute wünschen Sliden nicht."}, {"id": 169, "start": 1285.0, "end": 1294.0, "text": "Ist der Typ auf dem Dach?"}, {"id": 170, "start": 1294.0, "end": 1315.0, "text": "Ja, in solchen Low-Games dann spielen die Leute noch Objective."}, {"id": 171, "start": 1315.0, "end": 1331.0, "text": "Soll ich mal was sagen, was ich zu Skill-Based Matchmaking denke?"}, {"id": 172, "start": 1331.0, "end": 1344.0, "text": "Ich glaube ja, das ist viel trickreicher als man sich das jetzt vorstellt."}, {"id": 173, "start": 1345.0, "end": 1356.0, "text": "Ich könnte mir gut vorstellen, dass die in ein, zwei Jahren Skill-Based Matchmaking als die Sau durchs Dorf treiben, die jetzt entfernt wird und das Spiel wieder gut."}, {"id": 174, "start": 1356.0, "end": 1363.0, "text": "Die haben ja immer Sachen in dem Spiel, die sich rauskristallisieren, als dass es die Leute richtig abfackt."}, {"id": 175, "start": 1364.0, "end": 1373.0, "text": "Und dann kommen die ein, zwei Jahre später und machen da einen großen Wirbel drum, dass diese eine Sache, die die Leute abfackt, jetzt entfernt werden."}, {"id": 176, "start": 1374.0, "end": 1378.0, "text": "Dass jetzt noch 90 andere Sachen drin sind, sei mal dahingestellt."}, {"id": 177, "start": 1378.0, "end": 1386.0, "text": "Und ich kann mir gut vorstellen, dass die in ein, zwei Jahren ankommen und sagen, wir entfernen jetzt Skill-Based Matchmaking, endlich wieder gut, kauft den Kram."}, {"id": 178, "start": 1387.0, "end": 1393.0, "text": "Also, dass das eigentlich nur ein Trick ist, um wieder noch mehr Verkäufe zu machen in ein, zwei Jahren."}, {"id": 179, "start": 1394.0, "end": 1400.0, "text": "Ich glaube, das ist viel trickreicher als man noch denkt sogar. Und sie werden es da nicht entfernen."}, {"id": 180, "start": 1401.0, "end": 1405.0, "text": "Das ist wie bei Last Stand, was Last Stand entfernt wurde und dann war es Final Stand."}, {"id": 181, "start": 1405.0, "end": 1413.0, "text": "Die werden das nicht entfernen. Das ist ja nicht drin, weil die sich gedacht haben, wir machen das mal."}, {"id": 182, "start": 1414.0, "end": 1426.0, "text": "Das hat schon seinen Grund und die haben garantiert massig Analyse und Daten laufen, dass das gut ist für Verkäufe, durchschnittliche Spielzeit, Microtransaction, kaufen, alles mögliche."}, {"id": 183, "start": 1427.0, "end": 1433.0, "text": "Die werten die Daten ja aus und die werden zum Schluss gekommen sein, das ist sinnvoll für sie, also für ihr Money."}, {"id": 184, "start": 1433.0, "end": 1450.0, "text": "Aber es sieht, finde ich, krass, es sieht noch mehr, wie die letzten Call of Duty's in Reskin, wie vom letzten aus."}, {"id": 185, "start": 1451.0, "end": 1456.0, "text": "Das ist original Modern Warfare mit Cold War drum herum."}, {"id": 186, "start": 1456.0, "end": 1468.0, "text": "Gerade ansonsten hatte, auch weil Call of Duty immer ausgesehen hat wie Call of Duty, aber ich finde schon, dass sich gerade Black Ops und Modern Warfare,"}, {"id": 187, "start": 1468.0, "end": 1488.0, "text": "schon nicht nur vom Setting, auch vom Feeling und vom, schwierig zu sagen, von der Atmosphäre und vom Style her schon Unterschiede haben."}, {"id": 188, "start": 1489.0, "end": 1494.0, "text": "Es ist ja nicht so, als hättest du nicht erkannt, dass das eine in Call of Duty und das andere nicht, das hast du schon immer gut erkannt."}, {"id": 189, "start": 1494.0, "end": 1501.0, "text": "Aber es hatte schon ganz schön Unterschied, wohl guckt euch zum Beispiel an, die Modern Warfare Teile waren relativ grau,"}, {"id": 190, "start": 1502.0, "end": 1505.0, "text": "die Black Ops Teile waren schon immer relativ bunt und solche Sachen."}, {"id": 191, "start": 1505.0, "end": 1519.0, "text": "Aber die ganzen Animationen, sogar die Laufanimation ist gefühlt aus Modern Warfare."}, {"id": 192, "start": 1519.0, "end": 1531.0, "text": "Und das ist halt original Modern Warfare, nur ein bisschen reskinned."}, {"id": 193, "start": 1532.0, "end": 1539.0, "text": "Auch die Aufstehanimation und alles, das sieht original Modern Warfare aus."}, {"id": 194, "start": 1539.0, "end": 1552.0, "text": "So eine Art Acid Flip, quasi. Ich hätte da übrigens gar nichts dagegen."}, {"id": 195, "start": 1553.0, "end": 1561.0, "text": "Also die könnten ruhig Modern Warfare nur in gut machen, was den Multiplayer angeht, weil der Multiplayer, also Warzone hat das Spiel einfach komplett gerettet."}, {"id": 196, "start": 1561.0, "end": 1568.0, "text": "Der Multiplayer war so, der war ein Kacke, aber so wie es sich jetzt aktuell abzeichnet, ist es halt hier auch nicht besser."}, {"id": 197, "start": 1568.0, "end": 1575.0, "text": "Nice. Oh, the stun grenade actually isn't that bad. I think it's because I have the tac mask on now."}, {"id": 198, "start": 1580.0, "end": 1582.0, "text": "You're dead. Let me go this way."}, {"id": 199, "start": 1582.0, "end": 1598.0, "text": "God, hat er geschneibert? Der hat geschneibert, was sonst? Der Name und mit der Sniper an der Ecke."}, {"id": 200, "start": 1598.0, "end": 1620.0, "text": "Das ist der typische 360 XX HD Quickscoper Typ hier. Der macht dann irgendwie, der spielt 50 Games und macht dann ne Quickscope Montage, wo er 30 Sekunden zeigt, weil das die einzig gescheiten Clips sind, die er in 50 Games zusammen bekommen hat."}, {"id": 201, "start": 1620.0, "end": 1630.0, "text": "You're dead. Okay. Das ist, wenn Skill-Base Matchmaking drin ist, definitiv nicht so. Der wird da von drei Seiten abgeampft, wenn er hier um die Ecke guckt."}, {"id": 202, "start": 1632.0, "end": 1635.0, "text": "Und klar macht es so Spaß. Gegner bashen macht immer Spaß."}, {"id": 203, "start": 1635.0, "end": 1639.0, "text": "Da ist er schon wieder. Gott, Gott ist am Start."}, {"id": 204, "start": 1665.0, "end": 1681.0, "text": "Oh, okay. Dude, ich liebe den Spaz-12. Der hat so ein Black Ops 1 Gefühl. Warte mal, kommt der? Nein, der ist nicht da. Ich will diesen RPG schnell auslösen, aber da ist er. Okay, ich glaube, ich brauchte ihn nicht mehr. Lass uns jetzt los."}, {"id": 205, "start": 1684.0, "end": 1687.0, "text": "Das macht immer so komische Geräusche im Hintergrund."}, {"id": 206, "start": 1687.0, "end": 1703.0, "text": "Aber das ist die Einblendung. Das ist auch wieder ein Modern Warfare. Guck, und so, und so, wenn Skill-Base Matchmaking reinkickt bei ihm, so wird jeder tot aussehen. Schon instant abgeampft um die Ecke."}, {"id": 207, "start": 1703.0, "end": 1716.0, "text": "Ich bin mal gespannt, was er die nächsten paar Wochen noch zu sagt. Ich selbst gebe es mir nicht. Wie gesagt, PS4 kann ich, das kriege ich nicht, kriege ich Anfälle."}, {"id": 208, "start": 1719.0, "end": 1722.0, "text": "Ja, warte mal ab, warte mal ab, warte mal ab."}, {"id": 209, "start": 1722.0, "end": 1736.0, "text": "Ja, das stimmt. Das stimmt auch. Die sehen deutlich mehr farbig, bunter aus. Das könnte natürlich schon ein Vorteil sein, dass man den Gegner einfach nicht so ganz besser sieht. Ich meine, in Modern Warfare waren die Gegner grau und die Map grau."}, {"id": 210, "start": 1736.0, "end": 1750.0, "text": "Wenn es hier oben bete am PC kippt, probiere ich es vielleicht mal aus, ja."}, {"id": 211, "start": 1750.0, "end": 1767.0, "text": "BTF. Habt ihr es gehört im Hintergrund, da hat gerade übelst einen Out hier jemand genießt. Ich weiß es nicht."}, {"id": 212, "start": 1780.0, "end": 1796.0, "text": "Ja, deswegen läuft es ja auch so gut."}, {"id": 213, "start": 1796.0, "end": 1808.0, "text": "Ist das wieder God? War das wieder God? Das war wieder God, Alter. Der Typ."}, {"id": 214, "start": 1808.0, "end": 1825.0, "text": "God ist Afk. Das Gefühl habe ich im echten Leben auch, dass God Afk ist. Der hat sich das angeguckt und hat sich gedacht, nee, da habe ich keinen Bock auf den Kack. Afk. Afk-Klo. Seit dem Mittelalter. Afk-Klo."}, {"id": 215, "start": 1825.0, "end": 1842.0, "text": "Das die Sounds sind ja übelst laut. Waffen und Killstreak Sounds."}, {"id": 216, "start": 1842.0, "end": 1863.0, "text": "Naja, Objective. Captchern die. Gibt bestimmt wieder Huge Spawns."}, {"id": 217, "start": 1863.0, "end": 1877.0, "text": "Ja, also wenn es sowas wie Ghost und Ninja und sowas gibt, das haben eh mittlerweile alle an und sitzen an der Ecke mit Silencer. So wie immer eigentlich."}, {"id": 218, "start": 1877.0, "end": 1895.0, "text": "Wisst ihr was? Mal angenommen, ich hätte so ein Gameplay hochgeladen. Ich hätte auf der PS4 im Leben nicht so ein gutes Gameplay hingekriegt. Mal angenommen, ich hätte so ein Gameplay hochgeladen. Da werden die Kommentare wieder voll gelesen. Max, spiel doch mal Objective. Du nimmst nicht eine Flagge ein."}, {"id": 219, "start": 1907.0, "end": 1928.0, "text": "Und das ist halt das Coole gewesen an den Spielen, die keine Skill-Base-Matchmaking hatten. Du hattest nicht unbedingt so viel mehr extrem geile Runden, du hattest aber halt mal geile Runden."}, {"id": 220, "start": 1928.0, "end": 1946.0, "text": "Du hattest halt zwischendurch halt auch richtig Sucker-Team und ziemlich gute Gegner, aber du hattest halt ab und zu mal die Lobbys, wo halt nur Ultra-Low-Bobs am Start waren. Es ist ungefähr damit zu vergleichen, wie wenn einer jetzt einfach mal 15 Runden Reverse boostet."}, {"id": 221, "start": 1946.0, "end": 1974.0, "text": "Und das sieht man ja jetzt schon. Die ganzen Channels, die kontinuierlich irgendwelche New-Gameplays hochladen. Oder auch. Was habe ich letztens gesehen, Solo in Quad Warzone alles zerrissen haben. Das geht nur, wenn du Reverse boosted hast vorher. Vor allem in dieser Frequenz, wo da teilweise Videos rausgehauen werden."}, {"id": 222, "start": 1974.0, "end": 1988.0, "text": "Wie viele Punkte hat God? Oh, God hat 250 Punkte. Das hätte ich von God hätte ich jetzt echt mehr erwartet. Das wird aber nichts mit seiner Sniping-Montage."}, {"id": 223, "start": 1988.0, "end": 2005.0, "text": "Okay, mal gucken, ob er sich ein bisschen mehr dazu ausgelassen hat. Nee, hat er nicht. Okay, mal gespannt, wie das in ein paar Monaten aussieht."}, {"id": 224, "start": 2005.0, "end": 2032.0, "text": "Also ich gehe davon aus, dass es ungefähr so läuft wie in Modern Warfare, dass alle übelst am Rumflamen sind nach einer Woche, dass der Multiplayer unspielbar ist. Und dann bringen sie Black Ops Cold War Content in Warzone und dann spielen alle wieder Warzone und der Multiplayer interessiert keiner mehr. Also ungefähr so wie in Modern Warfare."}, {"id": 225, "start": 2032.0, "end": 2061.0, "text": "Ich bin mal gespannt, ob die wieder Duos bringen. Duos macht tatsächlich ab und zu mal Spaß. Aber das war es dann auch. Man kann nur hoffen, dass die Maps ein bisschen besser sind als in Modern Warfare und das Ganze nicht ganz so schlimm wird. Aber ich habe da ja so meine Befürchtung."}, {"id": 226, "start": 2062.0, "end": 2070.0, "text": "Also bei mir ist es jetzt so, die müssen jetzt erst mal zeigen, dass es sich lohnt, dass man den Kram kauft. Mal schauen. Also ich werde es mir nicht am Release holen."}, {"id": 227, "start": 2071.0, "end": 2086.0, "text": "So, ich kriege wieder einen Key, dann hol ich mir. Ja. Ja, ja, Loonix wird ja eigentlich bei jedem Game rumgeheult. Das ist ja normal. So sind sie halt. So sind wir halt."}, {"id": 228, "start": 2086.0, "end": 2094.0, "text": "So, also was gucken wir als nächstes? Ich brauche mal irgendwelche Videos, wo ich ein bisschen was building an invisible PC. Das ist doch, das ist doch jebaited."}, {"id": 229, "start": 2094.0, "end": 2115.0, "text": "Loonix sagt, ich finde auch, dass Cold War zu langsam ist. Du findest nicht viele Gegner. Die Maps sind auch wieder zu groß. Okay. Und hat wieder zu viele Ecken zum Gammeln. Ja, das wundert mich nicht. Das ist halt das Problem. Wenn du ein Game machst, wo man gut gammeln kann und dann baust du die Maps noch so, dass man gut gammeln kann, dann wird halt auch krass gegammelt."}, {"id": 230, "start": 2115.0, "end": 2135.0, "text": "Was halt auch in Modern Warfare, was mich halt in Modern Warfare Multiplayer so gewundert hat, ist, dass es muss ihnen aufgefallen sein, aber es war ihnen egal. Du hast in Modern Warfare so viele Maps, die nicht bis zum Score-Limit gehen."}, {"id": 231, "start": 2135.0, "end": 2152.0, "text": "Diese Windmühle ist die schlimmste Map in der Richtung. Also die geht bis zur Hälfte der Punktezahl ungefähr. In einem normalen TDM. Das muss denen aufgefallen sein. 100% ist das denen aufgefallen. Das kann nicht sein, dass das ihnen nicht aufgefallen ist. Und die haben sich trotzdem gedacht, das ist gut so."}, {"id": 232, "start": 2152.0, "end": 2169.0, "text": "So, schauen wir mal weiter. Also ich glaube, das ist G-Bait. Ich glaube, das ist G-Bait. Der baut keinen unsichtbaren PC. Das ist 100% G-Bait. Ich werde das gleich wegmachen, weil ich will nur den G-Bait erkennen."}, {"id": 233, "start": 2169.0, "end": 2193.0, "text": "Okay, es ist kein invisible PC. Es ist ein PC im Tisch eingebaut. Das war so klar. Ich habe ja gehofft, er baut irgendwie so ein Ding mit Spiegel oder so und wenn man den dann in die richtige Ecke stellt, sieht man den PC nicht. Aber nein, es ist einfach ein PC in einem Tisch eingebaut."}, {"id": 234, "start": 2193.0, "end": 2207.0, "text": "Es war relativ dünn, muss man sagen, aber kein Problem. Ihr müsst euch überlegen, was man für ultrakleine Notebooks bauen kann. Ist das in so einen fetten Tisch einzubauen kein Problem."}, {"id": 235, "start": 2207.0, "end": 2224.0, "text": "Ja, klar, das Netzteil. Ordentlich breiter Kühler. Ist überhaupt kein Problem. Aber der Titel hier, building an invisible PC. Ja, gut, es ist halt ein PC in einem Tisch."}, {"id": 236, "start": 2224.0, "end": 2240.0, "text": "Battlefield 3 Remastered will ich nicht haben. Ich will ein richtig gutes neues Battlefield, aber da habe ich meine Hoffnung schon fast aufgegeben. Was ist das hier? Oh, die seltensten Tiere, da bin ich mal."}, {"id": 237, "start": 2240.0, "end": 2260.0, "text": "Jetzt müssen wir uns angucken. Ich weiß auch nicht, warum irgendwie, irgendwie will ich mir das jetzt angucken. Ich bin so entgegen angesprungen. Okay, schwarze Leopard, Pantera Pardus. Ah ja, Panda. Ah ja, ja. Moment."}, {"id": 238, "start": 2260.0, "end": 2285.0, "text": "Das ist doch Photoshopped. Das hier sieht doch gar nicht so aus. Ist das so selten, dass sie kein Bild davon gefunden haben oder was? Guckt hier bitte das Video an 40. Oh, das sind irgendwelche Deutschrapper. Nee, Deutschrapper Videos gucke ich mir nicht an."}, {"id": 239, "start": 2285.0, "end": 2296.0, "text": "Das ist doch auch Photoshopped. Das ist einfach ein Kontrastfilter drüber. Oh, ist das schlecht. Das ist so selten. 1 in 20, da haben sie kein Bild von gefunden."}, {"id": 240, "start": 2296.0, "end": 2320.0, "text": "Ist das weiße Tiger nicht das, wo dieses eine Magier-Duo in den Arm gebissen bekommen hat? Vor, keine Ahnung. Ich weiß Boomer und vor Ewigkeiten so. Schon die neue Pepo-Animation gesehen? Du meinst die XQC-Pepo-Animation, wo er mit dem Roller draußen rumfährt? Die haben uns gestern angeguckt. Oder gibt es noch eine neue?"}, {"id": 241, "start": 2320.0, "end": 2336.0, "text": "Okay, hier haben sie tatsächlich mal ein Bild. Hier haben sie wieder kein Bild. Ach, das ist ja alles ja mies. Schneeleopard gibt es ganz viele, besonders auf MacBooks."}, {"id": 242, "start": 2336.0, "end": 2351.0, "text": "Okay, ich gebe zu, das war nicht lustig. Okay, das scheint tatsächlich ein echtes Bild zu sein."}, {"id": 243, "start": 2351.0, "end": 2373.0, "text": "Ein weißer Löwe. Okay, das ist auch Photoshopped. Es wäre ja gut, wenn sie echte Bilder drin hätten. Ein goldner Tiger. Was ist das? Das sieht eklig aus. Das ist sowas, was ich definitiv nicht an meiner Decke oder an der Wand krabbeln haben will."}, {"id": 244, "start": 2382.0, "end": 2397.0, "text": "Das ist, ich erkenne es gar nicht, ein Fisch. Ein Wal ist das, okay. Ein blauer, ach ne, mit zwei Hörnern irgendwie. Okay, na dann."}, {"id": 245, "start": 2397.0, "end": 2411.0, "text": "Oh, wie sie es gesungen haben zur Musik hier. Okay, ich weiß nicht, was Amour für eine Farbe ist."}, {"id": 246, "start": 2411.0, "end": 2429.0, "text": "Das ist ein Huhn. Ach ne, ein Peacock ist das."}, {"id": 247, "start": 2442.0, "end": 2446.0, "text": "Okay, wir spulen mal ein bisschen vor. Ich will wissen, was das heißt."}, {"id": 248, "start": 2446.0, "end": 2471.0, "text": "Ja, aha, alles klar. Black Flamingo, eins in 1,25 Millionen. Exzellent."}, {"id": 249, "start": 2471.0, "end": 2484.0, "text": "Moment, was? Ein Orangener Alligator. Ein blauer Hummer. Lobster ist Hummer, ne?"}, {"id": 250, "start": 2484.0, "end": 2498.0, "text": "Wow. Ein roter, sind die nicht alle rot? Ich dachte, die sind alle rot. Ein roter Hummer."}, {"id": 251, "start": 2498.0, "end": 2521.0, "text": "Ein goldener Hummer. Sie haben einen gelben, also die haben einen gelben Hummer gerettet im Supermarkt und haben ihn zurück in die Wildnis entlassen."}, {"id": 252, "start": 2521.0, "end": 2531.0, "text": "Dann wird das wieder gefangen. Ach so, die werden nur rot, wenn man sie kocht. Okay, dann sind die standardmäßig eher so braun."}, {"id": 253, "start": 2531.0, "end": 2547.0, "text": "Multicolored Lobster. Gibt sogar bunte Lobster. Das sind dann Lobster of Color wahrscheinlich. So Albino Lobster, weiße Lobster gibt es auch."}, {"id": 254, "start": 2547.0, "end": 2564.0, "text": "Ach, das war jetzt das. Oh ne, jetzt kommt's. Albino. Moment, was? Ein Albino, ein einäugiger Albino Hai."}, {"id": 255, "start": 2564.0, "end": 2581.0, "text": "Okay, ich bin mir jetzt nicht, ich bin mir bei dem Bild nicht so ganz sicher, ob das jetzt gefährlich aussieht oder eher einfach nur bescheuert."}, {"id": 256, "start": 2581.0, "end": 2595.0, "text": "Ahja. Exzellent, jetzt wissen wir Bescheid. So, was haben wir hier als nächstes? Erstmal ein bisschen Musik anmachen."}, {"id": 257, "start": 2595.0, "end": 2610.0, "text": "Krasse Drop Rates, ja. Muss man erstmal aus der Lootbox ziehen. Hör mich mal vor, ihr habt eine machende Lootbox aus und da kommt ein einäugiger weißer Hai raus."}, {"id": 258, "start": 2610.0, "end": 2629.0, "text": "Das wär nix. So, was ist das? Die Pete Smeet Fertig Gaming PC's auf Boostbox. Was ist Boostbox? Ist das so was wie Möchte gern Alienware?"}, {"id": 259, "start": 2629.0, "end": 2644.0, "text": "Zeig mal hier, Boostbox. Max, du musst Elektro Boom anmachen. Hat er ein neues Video? Hat er ein neues Video?"}, {"id": 260, "start": 2644.0, "end": 2664.0, "text": "Das letzte fand ich langweilig. Nee, das mein ich nicht, ich mein was anderes. They are tracking us. Okay, das ist so ein Fertig PC an Peter, der gerne wie Alienware wäre, aber nicht wie Alienware ist wahrscheinlich."}, {"id": 261, "start": 2664.0, "end": 2685.0, "text": "Wobei Alienware sich auch nicht zu kaufen lohnt. Meiner Ansicht nach zumindest. Zu den MeinMMO PC's. Was? Die machen einfach Fertig PC's und haben jede Menge Influencer Geld gegeben wahrscheinlich, um ihre PC's zu bewerben."}, {"id": 262, "start": 2685.0, "end": 2705.0, "text": "Das ist eigentlich gar keine schlechte Idee. Man baut einfach 08-15 Gaming PC's, macht die vielleicht sogar ein bisschen zu teuer und dann gibt man das Geld dafür aus, dass Influencer die promoten und die Kinder kaufen."}, {"id": 263, "start": 2705.0, "end": 2723.0, "text": "Das ist eigentlich exzellent. Was haben die denn so? Extreme. Schauen wir uns mal an was das taucht. Ich bin jetzt nicht so auf dem laufenden was aktuelle PC's angeht, aber so ungefähr kann man das ganze wahrscheinlich einschätzen."}, {"id": 264, "start": 2723.0, "end": 2751.0, "text": "Nehmen wir mal hier was, was keine Ahnung. Das da nehme ich jetzt einfach mal, zeig mal her. Also was ist da drin? Ich finde das Gehäuse ist Geschmackssache, mir gefällt es nicht. Vor allem was, warum ist da vorne so ein komischer Bild ruckelt? Warum ist da vorne so ein komischer Leuchtstoffröhre oder sowas drin?"}, {"id": 265, "start": 2751.0, "end": 2766.0, "text": "Ach das ist der Wassertank, ok. Aber wenn du da mal zu fest mit dem Fuß dran haust, ist glaube ich egal. Also ich finde es obdich jetzt nicht, ist nicht mein Fall. Ist nicht mein Fall, das heißt nicht dass es schlecht ist, ist nicht mein Fall. So, also was ist denn da drin? Zeig ich mal her."}, {"id": 266, "start": 2766.0, "end": 2789.0, "text": "Was ist Bullgard? Also ein Prozessor, 10600K. Das ist glaube ich gar nicht mal so gut das Ding."}, {"id": 267, "start": 2797.0, "end": 2821.0, "text": "Das ist glaube ich gar nicht mal so geil. Ach hier rechts, hier rechts, ein i5. Es ist halt, ok es ist, ne was, hä? Ne 2060, ein 1600K. Also ich bin jetzt so wirklich nicht auf dem aktuellen, ne ne ich bin nicht am PC zusammenstellen Sebaro."}, {"id": 268, "start": 2821.0, "end": 2838.0, "text": "Ich bin grad PC-Anbieter gucken, die hier mit, die Influencer-Marketing-mäßig da den Kram fällen. Also ich bin, ich muss dazu sagen, ich bin nicht wirklich auf dem alleraktuellsten Stand was PC-Hardware angeht, weil ich bin, ich gucke immer nur wenn ich mir selbst was kaufen will."}, {"id": 269, "start": 2838.0, "end": 2862.0, "text": "Aber, das erscheint mir jetzt doch, also erscheint mir jetzt auf den ersten Blick ein bisschen teuer. Ich meine es ist ne Mittelklasse CPU, Mittelklasse bis obere Ecke, also obere Mittelklasse CPU sag mal mal, ne Mittelklasse Grafikkarte."}, {"id": 270, "start": 2862.0, "end": 2880.0, "text": "Ansonsten nix, nix, RAM ist grade billig as fuck. Dann nur ne 2GB Festplatte und ne 500. Und ich glaube die SSDs sind auch gar nicht mehr sonderlich geil."}, {"id": 271, "start": 2880.0, "end": 2903.0, "text": "Das erscheint mir jetzt ein bisschen teuer als 2TB mein ich. Das erscheint mir jetzt ehrlich gesagt ein bisschen teuer. Ich mein schau mal doch mal, was so ne, also ich denke mal wie gesagt die CPU kostet ungefähr 250, 260, 270 Euro."}, {"id": 272, "start": 2903.0, "end": 2912.0, "text": "Dann hast du hier die Grafikkarte dabei. Was kostet ne 2600? 400 Euro, keine Ahnung, weiß ich nicht, muss ich mal gucken."}, {"id": 273, "start": 2912.0, "end": 2939.0, "text": "Also mir erscheint es ein Tick zu teuer. Ich denke mal sowas kann man auch für um die 1000 Euro bauen. Ohne dass ich jetzt wirklich komplett auf dem aktuellen Stand bin, was so PCs angeht. Aber ich denke sowas kannst du dir auch für ungefähr 1000 Euro zusammenbauen. Das erscheint mir ein bisschen sehr teuer."}, {"id": 274, "start": 2942.0, "end": 2959.0, "text": "Was haben wir ansonsten, ach das ist schon Xtreme. Das Mainboard kostet 270 Euro, wahrscheinlich haben sie davon jede Menge. Und müssen es loswerden, weil es demnächst keiner mehr kauft."}, {"id": 275, "start": 2959.0, "end": 2986.0, "text": "Ja das Mainboard ist ultra offer size für die Zusammenstellung. Ja, naja. So was hatten sie sonst noch? Ich guck mal, achso ne das war es hier, Xtreme. Ah ne es geht noch weiter, Xtreme."}, {"id": 276, "start": 2986.0, "end": 3014.0, "text": "Ach guck mal hier gibt es eine, oh ganz eine Bewertung schon. Ich will mal kurz gucken ob die Bewertung fake sind. Hä? Okay, genau so stelle ich mir Leute vor die sich solche PCs kaufen. Sehr schöne Fragezeichen. Excellent."}, {"id": 277, "start": 3014.0, "end": 3040.0, "text": "Okay was haben die hier drinnen? 9700k, okay sogar noch die eine Generation davor. Ungefähr übertaktet würde ich sagen, also meiner übertagt ungefähr so wie auf dem gleichen Niveau wie der hier."}, {"id": 278, "start": 3040.0, "end": 3057.0, "text": "Ne 2070 sogar, die gibt es ja mittlerweile, also du kriegst ja mittlerweile 280 TI hinterher geschmissen. Es scheint mir auch ein bisschen teuer. Ich meine es ist im Prinzip wie der letzte PC, ein ticken schnellere CPU, ein ticken schnellere Grafikkarte."}, {"id": 279, "start": 3057.0, "end": 3071.0, "text": "Klar das ganze hat was angestellt. Mir kommt es ein bisschen teuer vor. Ist jetzt mein Eindruck, aber ich bin auch nicht auf dem aktuellen Stand was PCs angeht. So, jetzt gucken wir uns mal an was er dazu zu sagen hat. Ach guck mal die machen auch."}, {"id": 280, "start": 3071.0, "end": 3087.0, "text": "Also eins kann man sagen, Peazmeat wird sich sicherlich, wird das nicht für ein Apfel und ein Ei machen, ihre Namen für einen PC draufschreiben lassen oder PCs promoten. Da musste bestimmt ordentlich Kohle für Latzen dass sie das machen."}, {"id": 281, "start": 3087.0, "end": 3101.0, "text": "Kriegt ihr übrigens auch manchmal Peazmeat Prinzenrolle Werbung auf Twitch? Verwirrt mich jedes Mal, weil es irgendwie absolut nichts mit Prinzenrolle zu tun hat bis zum Schluss."}, {"id": 282, "start": 3101.0, "end": 3118.0, "text": "Okay. Auf der einen Seite da beschweren sich so einige über die freitaglichen Rgb-Cringe-Gedichte. Auf der anderen Seite. Über was? Rgb-Gedichte? Das wird ja immer schlimmer. Erreichen mich zahlreiche Beschwerde."}, {"id": 283, "start": 3118.0, "end": 3136.0, "text": "Das PC-Bau, die haben ein PC-Bau-Video, das muss ich mir auch gleich nochmal angucken. Aber an das PC-Bau-Video von, wie hießen die? Wins? Wans? Nee, Wans? Nee, wie hieß dieser Channel?"}, {"id": 284, "start": 3136.0, "end": 3157.0, "text": "Kennt ihr noch mit dem Elektro-Anti-Static-Band, was er nirgendswo angeschlossen hat? Verge, Verge, ja."}, {"id": 285, "start": 3157.0, "end": 3173.0, "text": "Der hört sich so übertrieben glücklich an. Was ist denn hier los? Nein, nein, das kann ich mir nicht angucken."}, {"id": 286, "start": 3173.0, "end": 3187.0, "text": "Ich dachte, er sagt jetzt was mit dem PizMiet-PC. Okay. War gespannt."}, {"id": 287, "start": 3203.0, "end": 3222.0, "text": "Das sagt mir irgendwas. Warte mal, was ist das? CSL? Die kommen mir irgendwie bekannt vor. Ach, die sind das. Okay, das sagt mir irgendwas. Ich weiß jetzt nicht genau was, aber das sagt mir irgendwas."}, {"id": 288, "start": 3222.0, "end": 3244.0, "text": "2006, 2007 selbst bei CSL Computer gekauft, weil die Preis-Leistungs-Verhältnisse der Rechner eigentlich gar nicht so schlecht waren. Ja und dann bin ich mal auf diese Landing-Page mit dem PizMiet-System gegangen und Leute, das konnte ich irgendwie so nicht stehen lassen, denn alleine schon das erste System für 999 Euro."}, {"id": 289, "start": 3244.0, "end": 3261.0, "text": "Das Ding heißt nicht wirklich Zerficker, oder? Der Boostbox-Piz wie Zerficker."}, {"id": 290, "start": 3261.0, "end": 3275.0, "text": "... hat einen AMD Ryzen 5 2600 in Kombination mit einer RX 5500 XT. Schnitzchen? Alter, die Namen sind so cringe. Oh, meine Güte."}, {"id": 291, "start": 3275.0, "end": 3294.0, "text": "Die PC-Namen, das ist ja... Oh, da zieht sich ja alles bei mir zusammen, wenn ich die PC-Namen sehe. Wenn ich die PC-Namen sehe. Oh, das tut weh. Vor allem, warum kostet der gerade 2800 Euro?"}, {"id": 292, "start": 3294.0, "end": 3313.0, "text": "BTF? Warum ist das so teuer? Ja gut, ich meine, PizMiet kostet halt was, ne?"}, {"id": 293, "start": 3313.0, "end": 3328.0, "text": "Was sagst du denn da, Leute? Jungs, ich hab mir jetzt den PizMiet-Penetrator geholt. Das hört sich eher wie ein Billig-Dildo von AliExpress an, als wie ein Fertig-PC-Gaming-PC."}, {"id": 294, "start": 3328.0, "end": 3345.0, "text": "Da kann man eigentlich nicht motzen, das ist solider RAM. Aber RAM ist billig. Dann haben wir noch eine NVMe SSD, und zwar die A2000. Das ist auch eine SSD mit einem guten Preis-Leistungs-Verhältnis. Dazu eine 1TB normale Festplatte, was auch nicht schlecht ist von der Grundkonfiguration."}, {"id": 295, "start": 3345.0, "end": 3362.0, "text": "Aber für den Preis, eine 1TB Festplatte, was willst du denn damit machen? Also 6TB Platte sind mittlerweile eine Preis-Leistung, ist nämlich echt ganz gut. Ach, das ist auch okay, es ist luftgekühlt. Es ist luftgekühlt."}, {"id": 296, "start": 3362.0, "end": 3375.0, "text": "Weil da der Box-Kühler am Anfang zumindest ausreicht. Aber der Kühler ist natürlich leiser und etwas performanter als der AMD Box-Kühler. Deshalb, da kann man auch nicht meckern. Das Netzteil ist zumindest okay für den Preis mit einem Be Quiet-System."}, {"id": 297, "start": 3375.0, "end": 3381.0, "text": "Ich denke auch nicht, dass die Zusammenstellung irgendwie jetzt wahnsinnig schlecht wäre und in die Luft fliegt. Ich glaube, die schlichtweg einfach viel zu teuer."}, {"id": 298, "start": 3381.0, "end": 3394.0, "text": "Mit 600 Watt, was vielleicht für das System etwas overpowered ist. Aber das machen die gerne. Das machen komplett PC-Hersteller, machen das gerne. Viel zu starke Netzteile rein. Allerdings kann ich es bis zu einem gewissen Grad verstehen."}, {"id": 299, "start": 3394.0, "end": 3407.0, "text": "Weil die wollen halt auch auf Nummer sicher gehen, falls jetzt irgendeiner auf die Idee kommt und da eine 3900 RTX oder so reinschmeißt und sagt, oh, das geht ja gar nicht. Ja, mit ein bisschen besseren Netzteilen hast du halt die Probleme nicht."}, {"id": 300, "start": 3407.0, "end": 3417.0, "text": "Gehäuse ist ein Kohling Stronghold. Ist auch ein günstiges gutes Gehäuse. Und beim Mainboard setzen sie auf das Asus TUF B450 Plus Gaming. Das ist sogar schon etwas besseres."}, {"id": 301, "start": 3417.0, "end": 3419.0, "text": "Und da bist du jetzt bei wie viel? 800 Euro?"}, {"id": 302, "start": 3419.0, "end": 3422.0, "text": "Mainboard aber auch zu einem vernünftigen Preis. Also sagen wir mal..."}, {"id": 303, "start": 3422.0, "end": 3431.0, "text": "Max, was sagst du dazu, wenn man die 3080 mit einem 600 Watt Netzteil betreibt? Langt das? Ich habe mir den Stromverbrauch von den neuen Nvidia Karten nicht angeguckt."}, {"id": 304, "start": 3431.0, "end": 3446.0, "text": "Aus dem Bauhaus würde ich sagen, also bisher hat das immer locker gereicht. Wie das jetzt ist, keine Ahnung. Also kann ich dir nicht sagen, ich würde vorher nachgucken und auch mal ein paar Tests lesen, was das wirklich braucht."}, {"id": 305, "start": 3446.0, "end": 3466.0, "text": "Bisher hat das locker gereicht. Ich habe auch nur einen 650 Watt Netzteil. Bisher hat das locker gereicht, aber ich habe auch nur 1.080 GE."}, {"id": 306, "start": 3466.0, "end": 3480.0, "text": "Nvidia meint mindestens 750. Ja, siehst du, dann würde ich mich daran halten. Allerdings, auf was heißen die das auch öfters mal."}, {"id": 307, "start": 3480.0, "end": 3484.0, "text": "Aber Schattnix kostet ja nicht viel mehr."}, {"id": 308, "start": 3484.0, "end": 3489.0, "text": "Bis auf die Grafikkarte ist diese Grundkonfiguration von den Komponenten her nicht mal Schrott."}, {"id": 309, "start": 3489.0, "end": 3492.0, "text": "Muss man sagen. Klingt sinnvoll, aber wahrscheinlich viel zu teuer."}, {"id": 310, "start": 3492.0, "end": 3497.0, "text": "Das ist eigentlich ganz okay. Würdet ihr euch aber diesen Rechner nachbauen und alles im günstigsten Shop bestellen."}, {"id": 311, "start": 3497.0, "end": 3504.0, "text": "800 Euro, oder? Das kostet einfach alles top. Na gut, die Pete's Meet Collaboration muss halt bezahlt werden."}, {"id": 312, "start": 3504.0, "end": 3509.0, "text": "Und die wollen einfach fast 1000 Euro. Klar, es ist noch Windows 10 Home dabei, aber..."}, {"id": 313, "start": 3509.0, "end": 3514.0, "text": "Ja, wokehrs? Windows 10 Home kannst du ja sogar kostenlos installieren."}, {"id": 314, "start": 3514.0, "end": 3522.0, "text": "Das ist eigentlich fast gar nichts. Deshalb frage ich mich, warum so einen krassen Aufpreis? Warum so einen 1000 Euro PC?"}, {"id": 315, "start": 3522.0, "end": 3529.0, "text": "Ich persönlich finde das nicht so gut. Und ja, diese etwas hoch angesetzten Preise, die sieht man natürlich häufig bei PCs, die..."}, {"id": 316, "start": 3529.0, "end": 3536.0, "text": "Klar, ein bisschen was müssen die ja verdienen. Das sehe ich auch ein. Aber in dem Fall muss da halt auch noch die Collaboration irgendwie mit bezahlen."}, {"id": 317, "start": 3536.0, "end": 3539.0, "text": "Und das wird nicht billig sein, dass man Pete's Meet draufschreiben darf."}, {"id": 318, "start": 3539.0, "end": 3546.0, "text": "Vor allem in Kooperation mit YouTubern entstehen. Das liegt halt natürlich auch einfach daran, dass die Systemintegratoren irgendwie mit plus rauskommen möchten."}, {"id": 319, "start": 3546.0, "end": 3549.0, "text": "Weil, da fließen Marketinggelder. Und diese Marketinggelder..."}, {"id": 320, "start": 3549.0, "end": 3550.0, "text": "Ordentlich Marketinggelder."}, {"id": 321, "start": 3550.0, "end": 3557.0, "text": "...hauen natürlich ordentlich rein. Dann ist die Marge an den PCs nicht mehr so hoch. Und dann kann man die natürlich auch nicht entsprechend günstig verkaufen."}, {"id": 322, "start": 3557.0, "end": 3563.0, "text": "Ich persönlich weiß ehrlich gesagt nicht, was ich davon halten soll, aber was ihr davon haltet, das könnt ihr mir ja jetzt mal in die Kommentare schreiben."}, {"id": 323, "start": 3563.0, "end": 3567.0, "text": "Hauptsache der RGB. Okay, das war's schon. Den Rest müssen wir uns nicht angucken."}, {"id": 324, "start": 3567.0, "end": 3570.0, "text": "Ich wusste gar nicht, dass Pete's Meet ein PC-Bauvideo gemacht hat."}, {"id": 325, "start": 3574.0, "end": 3580.0, "text": "Haben die einen PC-Bauvideo? Wir gucken uns jetzt das Originale an. Wo ist das Originale Pete's Meet PC-Bauvideo? Zeig her."}, {"id": 326, "start": 3581.0, "end": 3582.0, "text": "Wo ist das?"}, {"id": 327, "start": 3588.0, "end": 3589.0, "text": "Wow."}, {"id": 328, "start": 3589.0, "end": 3595.0, "text": "Zwei Profis bauen ein Mini-PC."}, {"id": 329, "start": 3601.0, "end": 3603.0, "text": "Ich glaub, das ist langweilig."}, {"id": 330, "start": 3604.0, "end": 3606.0, "text": "Ich glaub, das ist langweilig."}, {"id": 331, "start": 3607.0, "end": 3609.0, "text": "Was ist das für ein hässlicher PC?"}, {"id": 332, "start": 3609.0, "end": 3616.0, "text": "Was ist das? Ist das irgendwie moderne Kunst?"}, {"id": 333, "start": 3621.0, "end": 3627.0, "text": "Dann spielen sie ja drauf irgendwas, was nicht antwortet. Das sieht ja wirklich fast aus wie moderne Kunst."}, {"id": 334, "start": 3629.0, "end": 3631.0, "text": "Das kann ich mir nicht angucken."}, {"id": 335, "start": 3632.0, "end": 3634.0, "text": "Also, Bram hat den Slot gefunden."}, {"id": 336, "start": 3634.0, "end": 3638.0, "text": "Das Ding hat einen PC-4. Ach so, das ist der M2."}, {"id": 337, "start": 3638.0, "end": 3640.0, "text": "Jetzt sinkt das da so hoch. Ach so, da kommt eine Schraube."}, {"id": 338, "start": 3640.0, "end": 3642.0, "text": "Genau, und da kommt noch eine Schraube, die dürfte dann hoffentlich beim Mainboard dabei sein."}, {"id": 339, "start": 3643.0, "end": 3647.0, "text": "Die beiden haben doch garantiert schon mal einen PC zusammengebaut."}, {"id": 340, "start": 3648.0, "end": 3653.0, "text": "100 pro. Wahrscheinlich müssen sie sich jetzt extra unfil anstellen."}, {"id": 341, "start": 3653.0, "end": 3657.0, "text": "Warte mal, ich glaube, das ist vielleicht die."}, {"id": 342, "start": 3657.0, "end": 3661.0, "text": "So, geile... Alter, ohne Spaß. Der Wasserkühlung ist halt eine Million Meter lang."}, {"id": 343, "start": 3661.0, "end": 3665.0, "text": "Wieso hat Zed noch einen Lüfter gekauft? Die CPUs gibt es auch ohne Lüfter."}, {"id": 344, "start": 3667.0, "end": 3669.0, "text": "Nur kein Quatsch."}, {"id": 345, "start": 3670.0, "end": 3673.0, "text": "Okay, was auch immer. Das gucken wir uns jetzt nicht an."}, {"id": 346, "start": 3674.0, "end": 3676.0, "text": "Muss nicht sein."}, {"id": 347, "start": 3680.0, "end": 3683.0, "text": "Stimmt, mittlerweile kriegen die ja den Kram 100 pro gesponsert."}, {"id": 348, "start": 3683.0, "end": 3686.0, "text": "Ja, logisch. Da müssen sie nicht mal selbst bauen."}, {"id": 349, "start": 3686.0, "end": 3688.0, "text": "Die haben wahrscheinlich nur die M2 eingebaut."}, {"id": 350, "start": 3688.0, "end": 3690.0, "text": "Ja, würde ich auch so machen."}, {"id": 351, "start": 3692.0, "end": 3694.0, "text": "Wenn ich den Kram in den Arsch geblasen kriege."}, {"id": 352, "start": 3694.0, "end": 3698.0, "text": "Aber dazu müsste ich erstmal wieder was auf YouTube machen."}, {"id": 353, "start": 3699.0, "end": 3701.0, "text": "Da kaufe ich mir den Kram lieber selbst."}, {"id": 354, "start": 3701.0, "end": 3705.0, "text": "Ich versuche mir die ganze Zeit so im Kopf zusammenzureimen."}, {"id": 355, "start": 3705.0, "end": 3710.0, "text": "Ich meine, ich habe ja auch schon die ein oder anderen Collaboration-Geschichten gemacht auf YouTube."}, {"id": 356, "start": 3710.0, "end": 3715.0, "text": "Und in den letzten Jahren kriegst du ja auch teilweise für fast nichts, was ich kohle."}, {"id": 357, "start": 3715.0, "end": 3725.0, "text": "Ich versuche mir echt irgendwie zusammenzureimen, was es diesen PC-Distributor-Typ da gekostet hat,"}, {"id": 358, "start": 3725.0, "end": 3727.0, "text": "diese Piz-Me-Collaboration zu machen."}, {"id": 359, "start": 3727.0, "end": 3729.0, "text": "Weil ich meine, das ist ja nicht einfach nur..."}, {"id": 360, "start": 3729.0, "end": 3731.0, "text": "Die machen mal kurz ein Unboxing-Video."}, {"id": 361, "start": 3731.0, "end": 3733.0, "text": "Der Name steht drauf."}, {"id": 362, "start": 3733.0, "end": 3734.0, "text": "Die bewerben das."}, {"id": 363, "start": 3734.0, "end": 3736.0, "text": "Die haben unterschiedliche Konfigurationen mit unterschiedlichen Namen,"}, {"id": 364, "start": 3736.0, "end": 3738.0, "text": "mit unterschiedlichen Fotos von denen zu verwenden."}, {"id": 365, "start": 3738.0, "end": 3742.0, "text": "Ich glaube sogar noch persönliche Kommentare dazu."}, {"id": 366, "start": 3742.0, "end": 3747.0, "text": "Also ich würde sagen unter 100k wird da wahrscheinlich nix gegangen sein."}, {"id": 367, "start": 3750.0, "end": 3753.0, "text": "Also das ist auch so das erste, was mir eingefallen ist."}, {"id": 368, "start": 3753.0, "end": 3755.0, "text": "Wahrscheinlich sogar noch mehr."}, {"id": 369, "start": 3755.0, "end": 3758.0, "text": "Also billig wird es nett gewesen sein."}, {"id": 370, "start": 3763.0, "end": 3765.0, "text": "Ich meine, da muss ich mal überlegen..."}, {"id": 371, "start": 3766.0, "end": 3768.0, "text": "Ich weiß gar nicht, darf ich das sagen?"}, {"id": 372, "start": 3768.0, "end": 3770.0, "text": "Ich weiß gar nicht, ob das jetzt noch irgendjemand interessiert."}, {"id": 373, "start": 3770.0, "end": 3777.0, "text": "Also die haben ja für mein publisches Ghostreak-Video war es ja schon vierstellig."}, {"id": 374, "start": 3779.0, "end": 3781.0, "text": "Und ich hab dafür fast nix gemacht."}, {"id": 375, "start": 3783.0, "end": 3784.0, "text": "Also..."}, {"id": 376, "start": 3786.0, "end": 3791.0, "text": "Der Kram ist mittlerweile voll aus dem Ruder, was man da an Kohle bekommt."}, {"id": 377, "start": 3794.0, "end": 3795.0, "text": "So, also..."}, {"id": 378, "start": 3795.0, "end": 3799.0, "text": "Äh, was gucken wir jetzt?"}, {"id": 379, "start": 3801.0, "end": 3803.0, "text": "Randomly messing around in my house, der..."}, {"id": 380, "start": 3803.0, "end": 3804.0, "text": "Oh, fremde Hardware ab..."}, {"id": 381, "start": 3804.0, "end": 3806.0, "text": "Oh ja, das mach ich immer gerne."}, {"id": 382, "start": 3806.0, "end": 3809.0, "text": "Über fremde Hardware kommentieren, das mach ich gerne."}, {"id": 383, "start": 3814.0, "end": 3816.0, "text": "Oh guck mal, da hat ein gutes Multimeter hier."}, {"id": 384, "start": 3816.0, "end": 3818.0, "text": "Exzellent, wollte ich mir auch noch eins kaufen."}, {"id": 385, "start": 3818.0, "end": 3821.0, "text": "Hi, and welcome to my playhouse."}, {"id": 386, "start": 3821.0, "end": 3822.0, "text": "And today we're gonna be..."}, {"id": 387, "start": 3822.0, "end": 3823.0, "text": "Das ist..."}, {"id": 388, "start": 3823.0, "end": 3825.0, "text": "Das ist Windows Movie Maker."}, {"id": 389, "start": 3825.0, "end": 3828.0, "text": "Ist das nicht in Windows Movie Maker fade in?"}, {"id": 390, "start": 3829.0, "end": 3830.0, "text": "Das ist irgendein Default..."}, {"id": 391, "start": 3830.0, "end": 3831.0, "text": "Default..."}, {"id": 392, "start": 3831.0, "end": 3833.0, "text": "Subtitle."}, {"id": 393, "start": 3834.0, "end": 3835.0, "text": "Das ist Windows Movie..."}, {"id": 394, "start": 3835.0, "end": 3836.0, "text": "Das ist doch Windows Movie Maker."}, {"id": 395, "start": 3836.0, "end": 3838.0, "text": "Ist das Windows Movie Maker?"}, {"id": 396, "start": 3841.0, "end": 3842.0, "text": "Aha, jetzt."}, {"id": 397, "start": 3842.0, "end": 3843.0, "text": "Messing around with..."}, {"id": 398, "start": 3843.0, "end": 3845.0, "text": "Wie spricht man ihn denn aus?"}, {"id": 399, "start": 3845.0, "end": 3846.0, "text": "Mort..."}, {"id": 400, "start": 3846.0, "end": 3851.0, "text": "How do we pronounce him?"}, {"id": 401, "start": 3852.0, "end": 3854.0, "text": "Oh, das ist schwierig auszusprechen."}, {"id": 402, "start": 3856.0, "end": 3859.0, "text": "Random things in the data center."}, {"id": 403, "start": 3860.0, "end": 3862.0, "text": "Und warum hat er so 30 Milliarden Dinger per sich da?"}, {"id": 404, "start": 3862.0, "end": 3864.0, "text": "Was machen die Leute immer daheim?"}, {"id": 405, "start": 3865.0, "end": 3867.0, "text": "Da hat er noch ein Schrank mit allen..."}, {"id": 406, "start": 3867.0, "end": 3869.0, "text": "Mit allen Servern drin."}, {"id": 407, "start": 3869.0, "end": 3871.0, "text": "Oh, der hat ein Playcenter."}, {"id": 408, "start": 3871.0, "end": 3873.0, "text": "Der hat ein Playcenter daheim."}, {"id": 409, "start": 3873.0, "end": 3875.0, "text": "WTF."}, {"id": 410, "start": 3875.0, "end": 3881.24, "text": "alles IBM Playcenter hatte. Sind das die 14er? 1, 2, 3, 4, 5, 6"}, {"id": 411, "start": 3885.24, "end": 3891.88, "text": "11, 12, 13, 14, ja. Das sind die fetten olden IBM Playcenter. The fuck?"}, {"id": 412, "start": 3893.88, "end": 3898.44, "text": "Ich mein es ist geile Hardware, kann man nichts gegen sagen, ja. Ich mochte Playcenter immer."}, {"id": 413, "start": 3900.08, "end": 3902.08, "text": "Aber daheim ist das ganz schön laut."}, {"id": 414, "start": 3902.08, "end": 3909.8, "text": "Also, als ich mit dem Felix noch die Ausbildung gemacht habe, haben wir immer davon geträumt,"}, {"id": 415, "start": 3909.8, "end": 3916.32, "text": "mal so eine Art Playcenter Flugzeug zu bauen, was nicht funktioniert, ja. Also die Dinge haben"}, {"id": 416, "start": 3916.32, "end": 3923.76, "text": "halt übelst krasse Lüfter drin und wir hatten so einen relativ leicht gängigen Wagen im Rechenzentrum"}, {"id": 417, "start": 3923.76, "end": 3929.28, "text": "und wir haben uns immer gefragt, was passiert, wenn man diese Lüfter vom Playcenter mal auf"}, {"id": 418, "start": 3929.28, "end": 3934.56, "text": "diesem Wagen montieren würde, ob der dann von alleine fährt. Aber wir haben das nie ausprobiert."}, {"id": 419, "start": 3934.56, "end": 3938.12, "text": "Also die Dinger haben wirklich brutale Lüfter, das bläst dich fast weg hinter dem Rack,"}, {"id": 420, "start": 3938.12, "end": 3941.88, "text": "wenn das voller Plates ist. Also wenn du einen Rack hast voller Playcenter und die drehen"}, {"id": 421, "start": 3941.88, "end": 3948.92, "text": "komplett hoch, das pustet, also es puste dich nicht um, aber du musst schon dich ein bisschen"}, {"id": 422, "start": 3948.92, "end": 3953.6, "text": "in die Richtung lehnen, dass du nicht umgepustet wirst. Also das haut schon ordentlich raus die"}, {"id": 423, "start": 3953.6, "end": 3959.48, "text": "Lüfter und wir wollten, wir haben damals gedacht, irgendwann, wenn wir die ausbauen, machen wir das,"}, {"id": 424, "start": 3959.48, "end": 3963.24, "text": "dass wir die auf den Wagen bauen und mal gucken, ob der Wagen durchs Rechenzentrum fährt rein,"}, {"id": 425, "start": 3963.24, "end": 3981.88, "text": "aber haben wir nie gemacht. Okay, okay. Mit einem Staubsauger. Zumindest eine Sache ist"}, {"id": 426, "start": 3981.88, "end": 3986.44, "text": "schon mal original, Rechenzentrum ist schön laut. Ja, so gehört sich das. Im Rechenzentrum muss es"}, {"id": 427, "start": 3986.44, "end": 3991.16, "text": "ordentlich laut sein, sodass du nach einer Stunde eigentlich nur Rauschen auf dem Ohren hast,"}, {"id": 428, "start": 3991.16, "end": 3995.56, "text": "wenn du nicht gerade einen Gehörschutz aufhast. Der hat wirklich, guck mal hier, der hat sogar"}, {"id": 429, "start": 3995.56, "end": 4000.12, "text": "Ersatzplates hier rumliegen und die Dinger sind neu, nicht billig. Also ich kann mich noch dran"}, {"id": 430, "start": 4000.12, "end": 4004.36, "text": "erinnern, als wir damals die Sachen neu, also mittlerweile sind die billig auf Ebay, ja, weiß"}, {"id": 431, "start": 4004.36, "end": 4010.0, "text": "nicht, was so ein Plate kostet. Ebay, weiß gar nicht, weiß gar nicht mehr, wie die Dinger heißen."}, {"id": 432, "start": 4010.0, "end": 4027.24, "text": "IBM, Blade Center, HS10, Blade oder so? Nee, ach, keine Ahnung. Hier irgendwie sowas. Genau,"}, {"id": 433, "start": 4027.24, "end": 4039.72, "text": "H21 und sowas. Mittlerweile sind die Dinger, glaube ich, relativ günstig auf Ebay. Was ist H23?"}, {"id": 434, "start": 4039.72, "end": 4050.68, "text": "Ohne RAM, CPU. Ja, ist immer noch ziemlich ordentlich. Also ich weiß, wir haben die neu"}, {"id": 435, "start": 4050.68, "end": 4056.68, "text": "gekauft, ungefähr, ich glaube es hat ungefähr 23 oder 25.000 Euro pro Plate gekostet, irgendwie"}, {"id": 436, "start": 4056.68, "end": 4065.88, "text": "in dem Dreh. Aber die waren auch 2000, das war irgendwie 2000, 2011 oder so, oder 2010,"}, {"id": 437, "start": 4065.88, "end": 4071.08, "text": "glaube ich, war das noch. Und da waren das schon Plates mit 96 GB RAM, also die waren wirklich"}, {"id": 438, "start": 4071.08, "end": 4075.76, "text": "ordentlich. Also wir haben da quasi regelmäßig kleinen Wagen vom Preis her über die Straße"}, {"id": 439, "start": 4075.76, "end": 4080.84, "text": "getragen ins Rechenzentrum. Das war noch die Zeit, wo wir noch Turnschuh-Admin waren, wo man"}, {"id": 440, "start": 4080.84, "end": 4089.12, "text": "sich noch wirklich ins Rechenzentrum bewegt hat. Mittlerweile habe ich damit ja leider gar nichts"}, {"id": 441, "start": 4089.12, "end": 4095.2, "text": "mehr zu tun. Ab und zu mal wieder so eine schöne 4HE-Kiste einbauen alleine, ja, das muss mal wieder"}, {"id": 442, "start": 4095.2, "end": 4110.8, "text": "sein. Warum macht der ein Video, wo er das Rechenzentrum saugt? AliExpress, exzellent."}, {"id": 443, "start": 4110.8, "end": 4135.08, "text": "Fette Batterie. Das ist so eine Art, so eine Art Konsole fürs Rack, oder wie?"}, {"id": 444, "start": 4140.8, "end": 4154.64, "text": "Die Idee ist gar nicht schlecht, das als Konsole zu verwenden. Die ist gar nicht so übel, finde"}, {"id": 445, "start": 4154.64, "end": 4162.68, "text": "ich eigentlich ganz gut. Was hat der Typ eigentlich alles daheim in seinem Rack drinnen? Ich meine,"}, {"id": 446, "start": 4162.68, "end": 4172.32, "text": "das ist mehr als kleine Firmen, die sich am Start haben. Jede Menge ESXe. Sogar so ein"}, {"id": 447, "start": 4172.32, "end": 4178.8, "text": "Statikband hat er am Start. Der hat massig ESXe anscheinend, dann hat er irgendwie, weiß"}, {"id": 448, "start": 4178.8, "end": 4185.68, "text": "ich nicht, was das ist, sieht irgendwie so appliance-mäßig aus. Dass es irgendwas oldschool"}, {"id": 449, "start": 4185.68, "end": 4192.88, "text": "ist mit serieller Schnittstelle. Der hat sogar eine Konsole, also der hat ordentlich Sachen"}, {"id": 450, "start": 4192.88, "end": 4208.04, "text": "am Start daheim. Was hat der denn alles am Start? WTF? By the way, ich habe es ja oft"}, {"id": 451, "start": 4208.04, "end": 4218.12, "text": "gesagt, zu VGA ist noch Standard im Rechenzentrum. Ah, jetzt erklärt er, was was ist. Okay, okay,"}, {"id": 452, "start": 4218.12, "end": 4239.4, "text": "zeig mal her. Jetzt erklär mal, jetzt bin ich mal gespannt. Damit kann ich mich echt"}, {"id": 453, "start": 4239.4, "end": 4253.28, "text": "gut identifizieren. Das habe ich früher auch gemacht. Also man muss ja sagen, normalerweise"}, {"id": 454, "start": 4253.28, "end": 4259.4, "text": "sind die Dinger auf einer Schiene. Normalerweise sind die Dinger nicht, das hier sind so Universal-Schienen,"}, {"id": 455, "start": 4259.4, "end": 4263.68, "text": "da kannst du alles drauf stellen. Normalerweise sind die Systeme hier nebentran in der Schiene,"}, {"id": 456, "start": 4263.68, "end": 4269.64, "text": "sprich die fahren auf einer Schiene raus, die kannst du rausziehen und dann hängen"}, {"id": 457, "start": 4269.64, "end": 4277.0, "text": "die vorm Reck, rausgezogen auf den Schienen. Also normalerweise haben die noch mal Schienen"}, {"id": 458, "start": 4277.0, "end": 4281.4, "text": "dran, aber wenn du die dann rausheben musst aus den Schienen, das habe ich auch schon"}, {"id": 459, "start": 4281.4, "end": 4288.16, "text": "oft mit dem Kopf gemacht damals. Vor allem im Nachhinein war das eigentlich richtig abenteuerlich,"}, {"id": 460, "start": 4288.16, "end": 4291.12, "text": "dass die uns zusammen alleine machen lassen. Sowas musst du eigentlich immer mit zwei"}, {"id": 461, "start": 4291.12, "end": 4296.12, "text": "Leuten machen, weil wir hatten mal einen, dem ist so ein Server auf den Fuß gefallen."}, {"id": 462, "start": 4296.12, "end": 4305.28, "text": "Nicht so einer, nur ein DL380 2HE HP Kiste, aber wenn dir das auf den Fuß fällt, nicht"}, {"id": 463, "start": 4305.28, "end": 4310.6, "text": "unbedingt aus dieser Höhe, da ist der Fuß ab. Wenn dir eine 2HE Kiste aus dieser Höhe"}, {"id": 464, "start": 4310.6, "end": 4317.28, "text": "auf den Fuß fällt mit der Kante und du hast keine Sicherheitsschuhe an, dann ist der C"}, {"id": 465, "start": 4317.28, "end": 4325.44, "text": "schon mal fast ab. Ich glaube, das haben die sogar wieder dran genäht oder so im Krankenhaus."}, {"id": 466, "start": 4325.44, "end": 4329.0, "text": "Es war ordentlich, das war wirklich ordentlich, der war auch ein paar Wochen da nicht da."}, {"id": 467, "start": 4329.0, "end": 4332.16, "text": "Also da sieht man, auch Rechenzentrum kann gefährlich sein."}, {"id": 468, "start": 4332.16, "end": 4348.56, "text": "Da kann ich mich wirklich sehr gut mit identifizieren, so habe ich auch schon so einfach umgetragen."}, {"id": 469, "start": 4348.56, "end": 4362.2, "text": "Oder Scheiß ist schwer."}, {"id": 470, "start": 4362.2, "end": 4385.04, "text": "Okay, das ist irgendwas alles, das juckt mich jetzt nicht."}, {"id": 471, "start": 4385.04, "end": 4394.04, "text": "Nee, da passiert nicht mehr allzu viel. Aber warum hat der, ja genau, solche Schienen müssen"}, {"id": 472, "start": 4394.04, "end": 4398.4, "text": "da rein, exakt. Das ist das, was ich meinte, eigentlich hängen die Kisten an solchen Schienen"}, {"id": 473, "start": 4398.4, "end": 4399.4, "text": "dran."}, {"id": 474, "start": 4399.4, "end": 4405.24, "text": "Stand da Rechnung? Gute Frage, keine Ahnung."}, {"id": 475, "start": 4405.24, "end": 4420.76, "text": "Kann sein. Hier, Rechnung, Invoice, bitte nicht überweisen."}, {"id": 476, "start": 4420.76, "end": 4436.0, "text": "Protogesamt, was ist das für eine Einheit? Dänische Kronen oder sowas?"}, {"id": 477, "start": 4436.0, "end": 4443.32, "text": "Wow, wow, ich bin auf die Leertaste gekommen mit dem Arm."}, {"id": 478, "start": 4443.32, "end": 4447.72, "text": "Nee, das sind keine Euro, das sind Dänische Kronen oder irgendwie sowas."}, {"id": 479, "start": 4447.72, "end": 4455.44, "text": "DKK, Dänisch, Däne ist das wahrscheinlich. Das klingt auch irgendwie dänisch."}, {"id": 480, "start": 4455.44, "end": 4463.32, "text": "Kost, 1125 Dänische Kronen. Okay, wie viel ist das?"}, {"id": 481, "start": 4463.32, "end": 4478.36, "text": "Zu Euro, 151 Euro, okay, der Kram kostet halt nicht viel."}, {"id": 482, "start": 4478.36, "end": 4481.36, "text": "Ja, die Dinger sind gut, die Dinger sind wirklich gut."}, {"id": 483, "start": 4481.36, "end": 4484.32, "text": "Ja, nee, da kann ich ja gar nicht so viel über die Hardware lessen, weil der hat ein"}, {"id": 484, "start": 4484.32, "end": 4492.44, "text": "richtig nice Rechenzentrum, nur halt wieder absolut übertrieben für daheim, WTF."}, {"id": 485, "start": 4492.44, "end": 4500.12, "text": "Warum hat man den Kram daheim am Start, ich weiß nicht, das ist wirklich schon echt heftig."}, {"id": 486, "start": 4500.12, "end": 4514.0, "text": "Home Data Center Tour, ja mal gucken. My Server Room, ja da ist er, vielleicht kriegen"}, {"id": 487, "start": 4514.0, "end": 4516.16, "text": "wir jetzt die Details gezeigt, exellent."}, {"id": 488, "start": 4516.16, "end": 4531.32, "text": "Der hat wirklich IBM Playcenter am Start, ich verstehe es nicht, warum?"}, {"id": 489, "start": 4531.32, "end": 4535.28, "text": "Das ist der einzige, wo ich jemals gesehen habe, dass der ein Playcenter daheim stehen"}, {"id": 490, "start": 4535.28, "end": 4538.56, "text": "hat. Was hältst du von Anwalt oder kennst du"}, {"id": 491, "start": 4538.56, "end": 4541.88, "text": "sie? Ja, ich kenne das, ich habe es nie ausprobiert, hat mich bisher nicht so angesprochen."}, {"id": 492, "start": 4541.88, "end": 4550.6, "text": "Was ist das für ein blaues Chrom? Das ist Chromium, das ist quasi die nicht Google-Variante"}, {"id": 493, "start": 4550.6, "end": 4553.64, "text": "davon. Warum haben die ein DVD-Laufwerk, weil die"}, {"id": 494, "start": 4553.64, "end": 4557.08, "text": "Dinger so alt sind, wo man noch Betriebssysteme von DVDs installiert hat."}, {"id": 495, "start": 4557.08, "end": 4562.92, "text": "Kannst du ein Open Source Web Hosting Panel empfehlen? Nee, habe ich mich noch nicht mit"}, {"id": 496, "start": 4562.92, "end": 4563.92, "text": "beschäftigt."}, {"id": 497, "start": 4563.92, "end": 4570.68, "text": "Da unten hat er noch ein paar andere. Ich denke immer an HP, wenn ich das hier sehe,"}, {"id": 498, "start": 4570.68, "end": 4580.0, "text": "ist auch HP. Man muss sagen, die Anbieter, die haben recht gute, du erkennst besser an"}, {"id": 499, "start": 4580.0, "end": 4584.4, "text": "einem Server von welchem Hersteller, der kommt, als an so einem normalen Notebook."}, {"id": 500, "start": 4584.4, "end": 4589.44, "text": "HP hat immer dieses komische Rot, IBM hat immer dieses komische Grün, was hat Dell?"}, {"id": 501, "start": 4589.44, "end": 4595.88, "text": "Dell hat auch so ein Rot-Silber, glaube ich. IBM kannst du gut unterscheiden, IBM hat"}, {"id": 502, "start": 4595.88, "end": 4600.8, "text": "hier Blau- oder Lenovo-Zeug mit, also blaues Zeug und Dell hat immer so rotes Zeug dran."}, {"id": 503, "start": 4600.8, "end": 4612.04, "text": "HP, HP hat immer so rotes Zeug dran. Der hat echt einen Platesender, was ich drinne."}, {"id": 504, "start": 4612.04, "end": 4615.6, "text": "Guck mal, exzellent noch mit dem Kettenlaufwerk."}, {"id": 505, "start": 4615.6, "end": 4632.0, "text": "Das ist ziemlich groß, das Ding. Nur, dass ihr euch das vorstellen könnt. Eine HE ist"}, {"id": 506, "start": 4632.0, "end": 4650.92, "text": "glaube ich 4,5 cm oder so was. Ja, 4,5 cm, also sprich, das Ding ist 30 cm hoch. Das"}, {"id": 507, "start": 4650.92, "end": 4658.24, "text": "ist schon ein bisschen was. Das ist schon eine ordentliche Kiste hier. Und da kannst"}, {"id": 508, "start": 4658.24, "end": 4663.84, "text": "du halt bis zu 14 einzelne Rechner reinstecken. Also jeder, jedes dieser Einschübe hier hat"}, {"id": 509, "start": 4663.84, "end": 4669.68, "text": "RAM-CB, also jedes ist ein eigener Rechner. Das war halt damals auch, das war früher recht"}, {"id": 510, "start": 4669.68, "end": 4677.04, "text": "angesagt, weil du da auf sehr engen Raum viel Rechenleistung bekommst. Also hattest du,"}, {"id": 511, "start": 4677.04, "end": 4682.44, "text": "sag mal mal, du hattest einen Rack voller Platesender, da konntest du kaum mehr Rechenleistung"}, {"id": 512, "start": 4682.44, "end": 4689.88, "text": "in kleineren Raum bekommen. Ja, wofür das da heimat, verstehe ich auch nicht. Bei uns"}, {"id": 513, "start": 4689.88, "end": 4697.32, "text": "waren da zum größten Teil tatsächlich Virtualisierungsgeschichten drauf und damals auch noch normale Linux-Server"}, {"id": 514, "start": 4697.32, "end": 4702.12, "text": "für Außendienstsysteme, wobei das mittlerweile bei uns zu 95% virtualisiert ist und jetzt"}, {"id": 515, "start": 4702.12, "end": 4717.76, "text": "mittlerweile auch teilweise Azure Cloud. Das ist auch vieles am Start. Das ist aber"}, {"id": 516, "start": 4717.76, "end": 4730.44, "text": "eine richtig alte HP. Der macht bestimmt Filesharing. Der macht nicht nur Filesharing, der hostet"}, {"id": 517, "start": 4730.44, "end": 4745.6, "text": "wahrscheinlich halb BitTorrent-Traffic in Dänemark. Seeded. So, dann hat er jede Menge"}, {"id": 518, "start": 4745.6, "end": 4755.72, "text": "Olle. Die hatten wir auch. Ok, das ist richtig, Alterszeug. 3650. Genau die hatten wir auch."}, {"id": 519, "start": 4755.72, "end": 4761.44, "text": "Also da sieht man mal, die Hardware ist, es ist eigentlich, also wenn man sich ein bisschen"}, {"id": 520, "start": 4761.44, "end": 4767.36, "text": "an RZ-Hardware und so rantasten will, so Dinger kriegst du bestimmt wirklich für ein Apfel"}, {"id": 521, "start": 4767.36, "end": 4778.2, "text": "und ein Ei heute auf Ebay, aber das lohnt sich nicht, äh, aber das lohnt sich nicht,"}, {"id": 522, "start": 4778.2, "end": 4789.44, "text": "weil der Kram halt kaum Rechenleistung hat und laut und Strom verbraucht wie Sau. Also,"}, {"id": 523, "start": 4789.44, "end": 4802.08, "text": "eigentlich ist es ziemlich sinnlos. Und dann hat er hier noch WD-Green-Platten als Nass."}, {"id": 524, "start": 4802.08, "end": 4808.12, "text": "Ok. Geht bestimmt ganz gut. Was WD-Green nicht gut verkraftet, ist häufiges hoch und"}, {"id": 525, "start": 4808.12, "end": 4821.28, "text": "runter fahren. Die brauchen viel Strom. Die Dinger sind wirklich nicht zum Stromsparen"}, {"id": 526, "start": 4821.28, "end": 4825.4, "text": "und nicht für Lautstärke. Also, die sind nicht ausgelegt dafür, irgendwie möglichst"}, {"id": 527, "start": 4825.4, "end": 4829.84, "text": "leise oder möglichst sparend zu sein. Ihr weißt ja nicht, ob die überhaupt Lüftersteuerung"}, {"id": 528, "start": 4829.84, "end": 4834.64, "text": "haben. Doch, Lüftersteuerung haben sie. Lüftersteuerung haben die eigentlich fast alle. Aber trotzdem,"}, {"id": 529, "start": 4834.64, "end": 4845.68, "text": "die niedrigste Lüfterstufe ist halt schon, äh, Turbine. Ja, wenn man sich da, das stimmt,"}, {"id": 530, "start": 4845.68, "end": 4850.64, "text": "jetzt sagt er, aber wenn man sich da mal rantasten will und mal ein bisschen mit, mit etwas"}, {"id": 531, "start": 4850.64, "end": 4855.0, "text": "älterer, nämlich etwas bei Enterprise-Hardware rumspielen will, ist sowas gar nicht übel."}, {"id": 532, "start": 4855.0, "end": 4858.68, "text": "Es ist halt die Sache, wenn es hasst, du kannst es nicht verwenden für irgendwas, weil es"}, {"id": 533, "start": 4858.68, "end": 4862.2, "text": "zu laut ist und zu viel Strom braucht. Und danach musst du es irgendwie wieder entsorgen"}, {"id": 534, "start": 4862.2, "end": 4866.84, "text": "und hast so ein riesen fettes Teil. Also, lohnen tut es nicht wirklich. Außer man möchte"}, {"id": 535, "start": 4866.84, "end": 4875.12, "text": "es halt mal ausprobieren und danach wieder verscherbeln auf Ebay. Und lahm ist es auch."}, {"id": 536, "start": 4875.12, "end": 4895.52, "text": "Also sprich, der hat noch eine PCI, der hat es angeschlossen an, äh, was, eine SATA PCI"}, {"id": 537, "start": 4895.52, "end": 4900.32, "text": "Expresskarte, die auch noch eine M2 hat oder so, irgendwas. Naja. Übrigens, vorne sehen"}, {"id": 538, "start": 4900.32, "end": 4905.32, "text": "selber halt nicht viel anders aus. Außer, dass manche mittlerweile schon HDMI haben."}, {"id": 539, "start": 4905.32, "end": 4913.28, "text": "Aber alle noch VGA. Du brauchst was mit Linux-Support. Dein Linux funktioniert auf den Dinger super."}, {"id": 540, "start": 4913.28, "end": 4916.08, "text": "Wobei, nee, ich glaube, du meinst irgendwas anderes, ne? Ich hab den Chat grad nicht"}, {"id": 541, "start": 4916.08, "end": 4929.76, "text": "verfolgt. W- warum hat der, warum hat der irgendwie acht ESXs? Was macht der denn?"}, {"id": 542, "start": 4929.76, "end": 4934.64, "text": "Was hat der denn daheim am Start? Mich würd ja mal, mich würd ja mal richtig interessieren,"}, {"id": 543, "start": 4934.64, "end": 4939.4, "text": "was der da drauf laufen hat. Eins muss man ihm aber echt mal lassen. Das Wreck ist wirklich"}, {"id": 544, "start": 4939.4, "end": 4946.4, "text": "ähm ziemlich, ziemlich gut und, und ordentlich und alles in allem, ja. Also wirklich, also"}, {"id": 545, "start": 4946.4, "end": 4956.16, "text": "für daheim. Also wie gesagt, das ist mehr als viele kleine Firmen am Start haben. Habt"}, {"id": 546, "start": 4956.16, "end": 4961.76, "text": "ja eine Erfehlung als Home-File, äh Fileserver. Kommt drauf an, was du damit machen willst."}, {"id": 547, "start": 4961.76, "end": 4969.88, "text": "Das geht ja von Low-End billig bis ziemlich teuer. Willst du selbst bauen? Willst du"}, {"id": 548, "start": 4969.88, "end": 4981.8, "text": "was Fertiges haben? Dann noch ein Play-Sender. Naja, das ist ja"}, {"id": 549, "start": 4981.8, "end": 4993.76, "text": "noch ein Play-Sender. Oh, der hat sogar ne Konsole. Ist es, Konsolen sind auch komplett"}, {"id": 550, "start": 4993.76, "end": 4999.64, "text": "unsinnig, braucht man eigentlich nicht, aber sind cool, wenn man sie hat. Kennst du gute"}, {"id": 551, "start": 4999.64, "end": 5013.28, "text": "Quellen um sich da einzulehnen? Wo? Ja, das ist richtig alte. Die haben noch,"}, {"id": 552, "start": 5013.28, "end": 5020.24, "text": "die haben noch diese Nippel hier auf der Tastatur. Das ist ja so ein IBM, IBM Lenovo Merkmal,"}, {"id": 553, "start": 5020.24, "end": 5033.76, "text": "dass sie diese Nippel auf der Tastatur haben. Ehe, guck da, ja. Track, Track, äh, ja, Point."}, {"id": 554, "start": 5033.76, "end": 5057.6, "text": "Point, Mist, Crazy. Ha, warum hat der noch ein Play-Sender? Äh, der übertreibt's."}, {"id": 555, "start": 5057.6, "end": 5072.24, "text": "Also der hat, ja, der hat Stromkosten des Todes. Ja. Und daneben steht noch irgendein"}, {"id": 556, "start": 5072.24, "end": 5082.96, "text": "Nass drum, ok. Ok, also Captain Peng sagt, ähm, ich will Drive Dropbox iCloud-Ersatz."}, {"id": 557, "start": 5082.96, "end": 5087.88, "text": "Ich würde gerne selber basteln, aber eine gute Soft-Lösung wäre auch, ne, also wenn"}, {"id": 558, "start": 5087.88, "end": 5091.24, "text": "du was Fertiges haben willst, hol dir irgendein Synology-Nass, fertig, gut hingestellt, Dinger"}, {"id": 559, "start": 5091.24, "end": 5095.72, "text": "taugen und reichen für einfache Sachen ohne Probleme aus."}, {"id": 560, "start": 5095.72, "end": 5105.36, "text": "Na, wenn du selbst, wenn du was selbst bauen willst, ähm, würde ich dir keinen Raspberry"}, {"id": 561, "start": 5105.36, "end": 5111.36, "text": "Pi empfehlen, die Dinger sind für Nass nicht sonderlich gut geeignet. Die Odroid-Dinger"}, {"id": 562, "start": 5111.36, "end": 5116.16, "text": "sind ganz gut, wenn Single-Bot-Computer sein soll, aber, äh, für eine Nass mit am besten"}, {"id": 563, "start": 5116.16, "end": 5131.68, "text": "ist eigentlich, ähm, finde ich aktuell Low-Power, Low-Power-Intel. Irgendwie sowas hier. Low-Power-Intel"}, {"id": 564, "start": 5131.68, "end": 5137.36, "text": "kostet auch nicht viel. Hast viel Data-Anschluss. Ah, da kannst du keine, da kannst du jetzt"}, {"id": 565, "start": 5137.36, "end": 5141.64, "text": "keine großen, du hast da keinen Sass oder sowas drinne, äh, aber die Dinger verbrauchen"}, {"id": 566, "start": 5141.64, "end": 5147.52, "text": "nicht viel, da kannst, äh, theoretisch noch einen Control, du kannst auch ne, ne, ne bessere"}, {"id": 567, "start": 5147.52, "end": 5151.84, "text": "Netzwerk-Cut oder so reinmachen, wobei das halt nur einfach PC-Express ist, äh, und"}, {"id": 568, "start": 5151.84, "end": 5156.12, "text": "auch nur PC-Express zweifach, aber die verbrauchen nicht viel, die verbrauchen irgendwie Eidl"}, {"id": 569, "start": 5156.12, "end": 5160.8, "text": "ohne Platten, irgendwie nur 7, 7 Watt Eidl ungefähr, wenn man Stromspaß-Sachen anschließt."}, {"id": 570, "start": 5160.8, "end": 5168.2, "text": "Kostet nur 80 Euro das Board, CPU ist schon drauf, ähm, also, das ist für so ne Nass-Bild"}, {"id": 571, "start": 5168.2, "end": 5175.12, "text": "wirklich gut. Ansonsten, wenn's ne fertige Single-Board-Computer sein soll, nimm sowas,"}, {"id": 572, "start": 5175.12, "end": 5178.2, "text": "da kannst, also viel einfacher kann man's nicht haben, wenn man selbst was bauen will,"}, {"id": 573, "start": 5178.2, "end": 5182.96, "text": "allerdings nur für eine, nur für eine Platte, ne. Nimmst so ein Ding, kannst ne 10TB-Platte"}, {"id": 574, "start": 5182.96, "end": 5188.16, "text": "reinmachen und, ähm, installierst da irgendwie ein aktuelles Ledungs-Persd-Karte drauf und"}, {"id": 575, "start": 5188.16, "end": 5193.52, "text": "zack. Das ist wirklich so die allerbilligste Variante, äh, easieste Variante, die man machen"}, {"id": 576, "start": 5193.52, "end": 5197.2, "text": "kann, wenn man was selbst bauen will. So ein Teil hab ich bei mir drüben liegen mit ner"}, {"id": 577, "start": 5197.2, "end": 5203.4, "text": "Festplatte drin für Fernsehaufnahmen. Da ist ne, da ist ne, am USB ist ne TV-Stick,"}, {"id": 578, "start": 5203.4, "end": 5209.24, "text": "Dual-Tuner-TV-Stick dran mit nem TV-Headend-Server aufm Linux und dahinten hängt ne, äh, glaub,"}, {"id": 579, "start": 5209.24, "end": 5218.52, "text": "2TB-WD-Green-Uralt-Platte dran, dass man da Fernsehaufnahmen drauf machen kann. Äh,"}, {"id": 580, "start": 5218.52, "end": 5229.04, "text": "im Moment sind wir stehen geblieben. Home Data Center. Na klar, VGA-Anschluss. Der müsste"}, {"id": 581, "start": 5229.04, "end": 5232.88, "text": "man Playcenter von hinten zeigen, die Dinger waren, äh, sehen sogar relativ interessant"}, {"id": 582, "start": 5232.88, "end": 5237.56, "text": "aus. Mit mehrere Netzteilen drin, mehrere Switches, die haben teilweise nur extra Sound-Switches"}, {"id": 583, "start": 5237.56, "end": 5245.6, "text": "drinne. Also die Playcenter an sich fand ich ne richtig coole Technik. Die Atoms sind auch"}, {"id": 584, "start": 5245.6, "end": 5250.12, "text": "nicht verkehrt. Ja, ich hoffe ja drauf, dass die mal endlich ne, ne neue Low-Power-Plattform"}, {"id": 585, "start": 5250.12, "end": 5255.72, "text": "rausbringen. Weil für mich ist Low-, dieses Low-Power-Segment von Intel ist aktuell das,"}, {"id": 586, "start": 5255.72, "end": 5262.92, "text": "fast das einzige, wo ich sage, da hat AMD nix. Ich kenn die, die Atom-Dinger sind, sind nicht"}, {"id": 587, "start": 5262.92, "end": 5292.6, "text": "übel. Äh, Atom. Eisen die wirklich so? Eisen die echt so? Also, zu dem Namen find ich jetzt"}, {"id": 588, "start": 5292.6, "end": 5302.92, "text": "nix. Meinst du, du meinst eher die, oder? Ja, die sind auch ganz ok. Ne, das sind nicht"}, {"id": 589, "start": 5302.92, "end": 5309.84, "text": "die. Ich weiß, die neuen Atom sind auch ganz gut. Aber, äh, Low-Power und Low-Budget find"}, {"id": 590, "start": 5309.84, "end": 5321.48, "text": "ich die Jiminy-Lake-Sachen immer noch am besten. Was C? Ok, die sind schon, die sind anscheiden,"}, {"id": 591, "start": 5321.48, "end": 5328.08, "text": "ja die sind auch schon n bisschen älter, aber Jiminy-Lake-Sachen auch. Ein Einzelkarten-Computer,"}, {"id": 592, "start": 5328.08, "end": 5335.0, "text": "ah, yes. Ähm, das ist, das ist irgendwas im Raspberry-Format. Ja, die Dinger kann man"}, {"id": 593, "start": 5335.0, "end": 5337.84, "text": "sich auch holen, es ist nicht verkehrt, aber man sieht schon, es ist n bisschen teurer."}, {"id": 594, "start": 5337.84, "end": 5342.2, "text": "Dafür hast du hier halt bei, bei diesen Super-Micro-Dinger halt auch, äh, Server-Ausstattung in Form von,"}, {"id": 595, "start": 5342.2, "end": 5346.96, "text": "du kriegst wahrscheinlich Management-Interface und sonst was. Aber wenn's wirklich Low-Budget-Low-Power"}, {"id": 596, "start": 5346.96, "end": 5352.08, "text": "sein soll, ganz ehrlich, irgendein Jiminy-Lake-Mainboard mit, äh, CPU schon drauf, kann man nicht allzu"}, {"id": 597, "start": 5352.08, "end": 5359.04, "text": "viel verkehrt machen. Das Problem am Nook ist, dass du keinen PCI-Express hast. Wenn"}, {"id": 598, "start": 5359.04, "end": 5363.8, "text": "du keinen PCI-Express brauchst, ist ok. Wenn du PCI-Express brauchst, äh, kannst du,"}, {"id": 599, "start": 5363.8, "end": 5373.6, "text": "du kommst mit dem Nook nicht weit. Richtig, du hast zu viele Server, eigentlich komplett"}, {"id": 600, "start": 5373.6, "end": 5391.76, "text": "unsinnig, aber hat was. 46 Kisten. 46, was hat er denn für ne Stromrechnung? Äh, 4, äh,"}, {"id": 601, "start": 5391.76, "end": 5401.4, "text": "nicht 64, 64. 64, wa, was hat er denn für ne Stromrechnung? Achso, achso, achso, achso,"}, {"id": 602, "start": 5401.4, "end": 5415.96, "text": "achso, also die Dinger, die auch im, im, im Schrank liegen, ok. Mich würd, mich würd"}, {"id": 603, "start": 5415.96, "end": 5426.84, "text": "ja mal interessieren, ob der dazu sagt, was er damit macht. Ok, seht mal, und dann bezahlt"}, {"id": 604, "start": 5426.84, "end": 5434.44, "text": "ihr ordentlich. Weil diese Platesender ziehen auch massig, äh, Geld, ja. Über die Stromrechnung"}, {"id": 605, "start": 5434.44, "end": 5444.8, "text": "stand fast in den Kommentaren, wirklich. Ok, wir scrollen mal durch und so mal nach"}, {"id": 606, "start": 5444.8, "end": 5463.2, "text": "Power. Power? Solar powered UPS. Ok. Aber, es, es, es, es, es ist wirklich übertrieben,"}, {"id": 607, "start": 5463.2, "end": 5470.0, "text": "so, aber wir spulen mal ein bisschen vor. Er hat, er hat halt eBay leer gekauft, ne,"}, {"id": 608, "start": 5470.0, "end": 5473.36, "text": "er hat halt echt eBay, eBay leer gekauft, wenn ich mir das so anguck. Das ist auch von,"}, {"id": 609, "start": 5473.36, "end": 5477.6, "text": "das ist auch, ich mein, das Video von 2017, aber selbst 2017 ist das keine aktuelle Hardware"}, {"id": 610, "start": 5477.6, "end": 5497.92, "text": "mehr gewesen. Was ist das? Ein Pentium 3? Also, das ist ja ne komplette Stromverschwendung."}, {"id": 611, "start": 5497.92, "end": 5511.76, "text": "Aber das ist auch nicht auf, das ist auch nicht an, oder? Das ist aus. 380 Genre Sporst"}, {"id": 612, "start": 5511.76, "end": 5534.4, "text": "geht noch. Erstmal Lidl. Ok, braucht er mehr Platz, reicht das nicht"}, {"id": 613, "start": 5534.4, "end": 5563.6, "text": "mal? Da versteckt er, da versteckt er sich dann immer drin, oder? ETF. Da, da, da kann"}, {"id": 614, "start": 5563.6, "end": 5572.0, "text": "er sich immer verstecken, dahinter. Na, es reicht auf jeden Fall, um das Zeug an- und"}, {"id": 615, "start": 5572.0, "end": 5584.8, "text": "abzustöpseln. Ach, ok, ja. Guck, da siehst du noch, du hast noch Sahnenkarten drin, weil"}, {"id": 616, "start": 5584.8, "end": 5590.24, "text": "den ollen Dingern, den er nicht verwendet. So, auch klar, hier, da, da sind hier irgendwelche"}, {"id": 617, "start": 5590.24, "end": 5593.92, "text": "Fiber Channel Sachen drin, oder so vermute ich mal. Die waren wahrscheinlich einfach noch"}, {"id": 618, "start": 5593.92, "end": 5606.96, "text": "drin. Soll man einen Playcenter von hinten zeigen? Alle Cisco-Dinger? Wahrscheinlich"}, {"id": 619, "start": 5606.96, "end": 5618.32, "text": "auch unnötig laut, unnötig langsam, unnötig stromfressend? Ok."}, {"id": 620, "start": 5618.32, "end": 5639.04, "text": "Ihr hört, wie das pustet, ne? Hier ist der Playcenter-Anschluss, unten drunter, das"}, {"id": 621, "start": 5639.04, "end": 5650.48, "text": "hat man gerade gesehen. Weiterweise hat Musik im Hintergrund laufen, das hört man nur kaum,"}, {"id": 622, "start": 5650.48, "end": 5670.08, "text": "weil es zu laut lüftert. Was zur Hölle? Die Mal-Anlage ist Playcenter, aber man sieht"}, {"id": 623, "start": 5670.08, "end": 5677.04, "text": "es kaum. Also, das ist schon ein echt krasses Setup für daheim. Total unsinnig. Ne, der"}, {"id": 624, "start": 5677.04, "end": 5680.28, "text": "hat nicht gesagt, was er drauf laufen lässt, das würde mich auch mal interessieren. Jede"}, {"id": 625, "start": 5680.28, "end": 5686.68, "text": "Menge ESXer, aber was lässt er auf seinem ESX laufen? Man weiß es nicht. Aber ultra"}, {"id": 626, "start": 5686.68, "end": 5691.84, "text": "krasses Setup für daheim. Komplett unsinnig, meiner Ansicht nach, aber cool, hat was. Warum"}, {"id": 627, "start": 5691.84, "end": 5698.72, "text": "soll man nur Sachen machen, die sinnvoll sind? Der Stromverbrauch ist, da reicht MonkaS nicht,"}, {"id": 628, "start": 5698.72, "end": 5706.68, "text": "der Stromverbrauch ist MonkaGiga. Rack-Server blows up. Ok, das müssen wir schnell mal"}, {"id": 629, "start": 5706.68, "end": 5715.08, "text": "durchscrollen. Der Depp1899 hat subscribt. Danke schön, Depp. Ich muss kurz gucken,"}, {"id": 630, "start": 5715.08, "end": 5728.0, "text": "wie der Server x, das muss ich mir angucken. Ich will wissen, wie der Server upload. Wo"}, {"id": 631, "start": 5728.0, "end": 5754.24, "text": "upload er ab? Das sieht nach einem Billig-Schiner-Netzteil aus. Wo upload er ab? Oh, da. Oh, hier. Ja, jetzt"}, {"id": 632, "start": 5754.24, "end": 5784.2, "text": "gleich MonkaS-Smoke. Es wäre eine bessere Idee gewesen, das Kabel reinzustecken, da wäre"}, {"id": 633, "start": 5784.2, "end": 5804.0, "text": "im Schalter anzumachen. Oh. Es schmilzt. Es brennt sich durch den Tisch. Boah, da stinkt"}, {"id": 634, "start": 5804.0, "end": 5810.6, "text": "es jetzt bestimmt nicht. Nur mal das Fenster auf. Alter, mach das Fenster auf. Ja, das"}, {"id": 635, "start": 5810.6, "end": 5821.32, "text": "dachte ich mir. Mach das Fenster auf. Erstmal eine Runde einatmen. Jetzt guter Technologie-Gestank."}, {"id": 636, "start": 5821.32, "end": 5841.2, "text": "Was ist da hoch auf dem Netzteil? Moment, das ist ja uralt, da sind PCI-Anschlüsse,"}, {"id": 637, "start": 5841.2, "end": 5869.4, "text": "sehe ich das richtig? Ja, es wäre schön gewesen, er hätte noch das Fenster aufgemacht."}, {"id": 638, "start": 5872.2, "end": 5877.48, "text": "Ja, exellent. Jetzt haben wir noch gesehen, wie der Server in die Luft fliegt. Aber das"}, {"id": 639, "start": 5877.48, "end": 5890.8, "text": "war halt eine ganz uralt Geschichte. Hi, was macht er denn? Ja, irgendwie seinen Server"}, {"id": 640, "start": 5890.8, "end": 5920.28, "text": "abfackeln. Warum? Weil es geht. Keine Ahnung. Es gibt schon bescheuerte Videos. Ich will"}, {"id": 641, "start": 5920.28, "end": 5949.24, "text": "es nicht machen. Ich will es nicht machen. Okay, was haben wir sonst noch so? Oh, das"}, {"id": 642, "start": 5949.24, "end": 5961.88, "text": "wollte ich ja auch mal im Stream machen, mein Nintendo, mein 3DS-Flashen. Das müssen wir"}, {"id": 643, "start": 5961.88, "end": 5967.28, "text": "so mal kurz angucken, was man an Homebrew laufen lassen kann auf dem DSi. Lego-Tank,"}, {"id": 644, "start": 5967.28, "end": 5979.88, "text": "AirCore und Flappy. Blablabla. Was man auf dem DSi an Customs laufen kann. 3DS-Flash"}, {"id": 645, "start": 5979.88, "end": 5983.24, "text": "ist mittlerweile leichter denn je. Ja, ich werde es ausprobieren. Ich weiß nicht, ob"}, {"id": 646, "start": 5983.24, "end": 5988.4, "text": "ich es im Stream machen darf, ehrlich gesagt. Die Sache ist die, man darf es in Deutschland"}, {"id": 647, "start": 5988.4, "end": 5990.64, "text": "machen, es ist kein Problem, es ist meine eigene Hardware. Darf ich damit machen, was"}, {"id": 648, "start": 5990.64, "end": 6008.44, "text": "ich will. Ich weiß aber nicht, ob Twitch das mag, wenn man sowas zeigt im Stream. Das"}, {"id": 649, "start": 6008.44, "end": 6021.6, "text": "stimmt, ich fand den auch ganz cool. Zumal, zumal, das Gute am ersten DS war, dass es"}, {"id": 650, "start": 6021.6, "end": 6027.52, "text": "sehr schnell Modding-Karten gab, wo man von Micro SD-Karten alle möglichen Spiele abspielen"}, {"id": 651, "start": 6027.52, "end": 6031.96, "text": "konnte. Inklusive den Gameboy Advance. Hier vorne waren ja Gameboy Advance-Cartridges,"}, {"id": 652, "start": 6031.96, "end": 6039.92, "text": "da kamen wir da rein. Ich hatte in der Berufsschule immer mein DS dabei und auf der SD-Karte,"}, {"id": 653, "start": 6039.92, "end": 6046.8, "text": "auf der Micro SD-Karte, hatte ich den Text Only Dump aus Wikipedia. Das war Pre-Smartphone,"}, {"id": 654, "start": 6046.8, "end": 6053.12, "text": "Leute. Das war Pre-Smartphone. Da hatte man kein Smartphone dabei, wo man einfach mal"}, {"id": 655, "start": 6053.12, "end": 6062.8, "text": "Wikipedia nachgucken konnte. Da hatte ich Wikipedia-Dump von, frag mich nicht, 3G auf"}, {"id": 656, "start": 6062.8, "end": 6072.24, "text": "der Micro SD-Karte in der Berufsschule dabei und das war sehr praktisch. Ich meine, 2004,"}, {"id": 657, "start": 6072.24, "end": 6088.92, "text": "2004 ist so eindeutig Pre-Smartphone. Ja, Nintendo hat zu viel iteratet zwischendurch"}, {"id": 658, "start": 6088.92, "end": 6089.92, "text": "sogar."}, {"id": 659, "start": 6089.92, "end": 6109.84, "text": "Ja, aber ich hatte normalen DS. Wobei ich mir gar nicht sicher bin, ob ich einen normalen"}, {"id": 660, "start": 6109.84, "end": 6113.84, "text": "DS, also ich hatte definitiv einen mit Gameboy Advance-Slot."}, {"id": 661, "start": 6113.84, "end": 6130.28, "text": "Nee, ich hatte normalen DS."}, {"id": 662, "start": 6130.28, "end": 6146.04, "text": "Das war Pre-Snapchat-Filter noch."}, {"id": 663, "start": 6146.04, "end": 6161.6, "text": "Das stimmt, ja."}, {"id": 664, "start": 6161.6, "end": 6169.68, "text": "Den DSi hatte ich nie."}, {"id": 665, "start": 6169.68, "end": 6178.4, "text": "Eine Sache, die damals selbst als der DS neu war, also was richtig gesagt hat, der DS konnte"}, {"id": 666, "start": 6178.4, "end": 6189.8, "text": "nur WEP-WiFi, das hat halt gesagt und es war WPA2. Ich weiß nicht, wann WPA2 angefangen"}, {"id": 667, "start": 6189.8, "end": 6195.12, "text": "hat verbreitet. Guck mal, also das hätte Nintendo schon auch besser machen können."}, {"id": 668, "start": 6195.12, "end": 6202.2, "text": "Also Moment, WPA, es hätte ja WPA gereicht. Es hätte ja WPA gereicht, ne? Und die hatten"}, {"id": 669, "start": 6202.2, "end": 6210.4, "text": "nur WEP. Das heißt, du konntest selbst damals schon nicht online spielen, weil du ein WEP-Netzwerk"}, {"id": 670, "start": 6210.4, "end": 6214.8, "text": "gebraucht hast, was im Endeffekt bedeutet, du hast dein WLAN unverschlüsselt gehabt."}, {"id": 671, "start": 6214.8, "end": 6222.24, "text": "Da hat Nintendo mal wieder richtig gefehlt. Aber Nintendo und online wissen wir ja, das"}, {"id": 672, "start": 6222.24, "end": 6226.96, "text": "ist eine Sache, die passt nicht zusammen."}, {"id": 673, "start": 6226.96, "end": 6234.88, "text": "Das war so das Flappy Bird seiner Zeit damals, jeder hat's gespielt und ich hab mich immer"}, {"id": 674, "start": 6234.88, "end": 6236.6, "text": "gefragt, warum spielt man den Kram?"}, {"id": 675, "start": 6236.6, "end": 6251.84, "text": "Guck mal, habt ihr was gesehen? Habt ihr's gesehen? Habt ihr's gesehen? Moment, habt"}, {"id": 676, "start": 6251.84, "end": 6258.8, "text": "ihr's gesehen? Na? Das Ding hatte den Webbrowser, der war schlecht, aber das hatte den Webbrowser,"}, {"id": 677, "start": 6281.84, "end": 6307.56, "text": "ne? Stimmt! Ja, das gibt's ja nicht mehr. Top, das ist mittlerweile eingestellt."}, {"id": 678, "start": 6307.56, "end": 6335.88, "text": "Ja."}, {"id": 679, "start": 6335.88, "end": 6346.56, "text": "Ja, was wollen die meisten Leute? Das brauchen sie ja auch nicht mehr, also, ne? Keine Wunder,"}, {"id": 680, "start": 6346.56, "end": 6347.96, "text": "dass das Zeug günstig ist."}, {"id": 681, "start": 6347.96, "end": 6367.28, "text": "Ja, das genau."}, {"id": 682, "start": 6367.28, "end": 6372.28, "text": "Das ist gut. Also man kann sogar die DS-Flashcards verwenden."}, {"id": 683, "start": 6374.28, "end": 6380.28, "text": "Also ich hatte damals für ein DS, hatte ich ein, wie heißt es, Cyclo? Cyclo-DS?"}, {"id": 684, "start": 6380.28, "end": 6381.28, "text": "Sowas da?"}, {"id": 685, "start": 6381.28, "end": 6382.28, "text": "Ja."}, {"id": 686, "start": 6382.28, "end": 6383.28, "text": "Okay."}, {"id": 687, "start": 6383.28, "end": 6384.28, "text": "Okay."}, {"id": 688, "start": 6384.28, "end": 6385.28, "text": "Okay."}, {"id": 689, "start": 6385.28, "end": 6386.28, "text": "Okay."}, {"id": 690, "start": 6386.28, "end": 6387.28, "text": "Okay."}, {"id": 691, "start": 6387.28, "end": 6388.28, "text": "Okay."}, {"id": 692, "start": 6388.28, "end": 6389.28, "text": "Okay."}, {"id": 693, "start": 6389.28, "end": 6390.28, "text": "Okay."}, {"id": 694, "start": 6390.28, "end": 6399.28, "text": "Dann hatte ich ein, wie heißt es, Cyclo? Cyclo-DS? Sowas da?"}, {"id": 695, "start": 6399.28, "end": 6400.28, "text": "Genau."}, {"id": 696, "start": 6400.28, "end": 6402.28, "text": "So ein Teil hatte ich damals."}, {"id": 697, "start": 6402.28, "end": 6403.28, "text": "Genau."}, {"id": 698, "start": 6403.28, "end": 6404.28, "text": "Genau."}, {"id": 699, "start": 6404.28, "end": 6409.28, "text": "Das war eine Karte, das war quasi wie aufgebaut, man sieht es hier."}, {"id": 700, "start": 6409.28, "end": 6411.28, "text": "Das war aufgebaut wie ein Nintendo-DS-Game."}, {"id": 701, "start": 6411.28, "end": 6416.28, "text": "Das hast du reingesteckt und dort hattest du, du hattest hier unten einen MicroSD-Kartenslot."}, {"id": 702, "start": 6416.28, "end": 6422.28, "text": "Und du konntest quasi so tun, als wäre das ein Nintendo-DS-Game."}, {"id": 703, "start": 6422.28, "end": 6429.28, "text": "Aber in Wirklichkeit war das eine Custom-Card, wo die Games von der MicroSD-Karte gekommen sind."}, {"id": 704, "start": 6429.28, "end": 6457.28, "text": "Das war quasi Sicherheitskopien, ja?"}, {"id": 705, "start": 6457.28, "end": 6459.28, "text": "Und das Ding gab es auch noch."}, {"id": 706, "start": 6518.28, "end": 6523.28, "text": "Das war aber, Pre-Smartphone war das wirklich praktisch, damit ein Wikipedia dabei haben zu können."}, {"id": 707, "start": 6523.28, "end": 6528.28, "text": "Jetzt unabhängig davon, wenn man damit jetzt vielleicht irgendwelche Sicherheitskopien spielen wollte, ja?"}, {"id": 708, "start": 6528.28, "end": 6535.28, "text": "Aber Wikipedia-Mobile dabei zu haben im Rucksack war 2005 wirklich nice."}, {"id": 709, "start": 6535.28, "end": 6558.28, "text": "Wie gesagt, das war Pre-Smartphone."}, {"id": 710, "start": 6565.28, "end": 6585.28, "text": "Ah!"}, {"id": 711, "start": 6585.28, "end": 6594.28, "text": "Man muss sich mal überlegen, dass 2019 kümmern sich noch Leute um Modding von einem DS."}, {"id": 712, "start": 6594.28, "end": 6623.28, "text": "Ah, ja!"}, {"id": 713, "start": 6623.28, "end": 6635.28, "text": "Very private."}, {"id": 714, "start": 6635.28, "end": 6639.28, "text": "Okay, das ist irgendeine Speicheradresse."}, {"id": 715, "start": 6639.28, "end": 6644.28, "text": "Okay, da hat irgendeiner wahrscheinlich Directory-Fade nicht richtig escaped."}, {"id": 716, "start": 6644.28, "end": 6646.28, "text": "Könnte ich mir vorstellen, wenn ich sowas sehe."}, {"id": 717, "start": 6646.28, "end": 6675.28, "text": "Irgendeiner hat da irgendwelche Sachen nicht richtig escaped in der DS-Firmware."}, {"id": 718, "start": 6675.28, "end": 6678.28, "text": "Aha."}, {"id": 719, "start": 6678.28, "end": 6699.28, "text": "Ah, exzellent."}, {"id": 720, "start": 6699.28, "end": 6705.28, "text": "Wahnsinn, 15 Monate. Wahnsinn, so lang."}, {"id": 721, "start": 6705.28, "end": 6717.28, "text": "Hypersubscriber, ja. Dankeschön. Poggers."}, {"id": 722, "start": 6717.28, "end": 6728.28, "text": "Moment, jetzt habe ich vergessen, wie geht das jetzt?"}, {"id": 723, "start": 6728.28, "end": 6741.28, "text": "Okay."}, {"id": 724, "start": 6741.28, "end": 6747.28, "text": "Wahrscheinlich machen sie das größer."}, {"id": 725, "start": 6747.28, "end": 6758.28, "text": "Ja."}, {"id": 726, "start": 6758.28, "end": 6777.28, "text": "Ah, yes."}, {"id": 727, "start": 6777.28, "end": 6783.28, "text": "Alles klar."}, {"id": 728, "start": 6783.28, "end": 6807.28, "text": "Chat, morgen wird die Arbeit drüber geschrieben. Ich hoffe, ihr habt es verstanden."}, {"id": 729, "start": 6807.28, "end": 6816.28, "text": "Ah."}, {"id": 730, "start": 6816.28, "end": 6818.28, "text": "Kannst du das nochmal für dumme erklären?"}, {"id": 731, "start": 6818.28, "end": 6821.28, "text": "Ehrlich gesagt habe ich nicht so hundertprozentig durchgeblickt."}, {"id": 732, "start": 6821.28, "end": 6823.28, "text": "Es ging ein bisschen schnell."}, {"id": 733, "start": 6823.28, "end": 6834.28, "text": "So ganz grob, was ich verstanden habe, ist, es gibt so ein Index-File auf der SD-Karte, wo drin steht, was es für Bilder gibt."}, {"id": 734, "start": 6834.28, "end": 6841.28, "text": "Und dieses Index-File sagt irgendwie auch, wie groß die ganze Bildergeschichte ist."}, {"id": 735, "start": 6841.28, "end": 6849.28, "text": "Das kann man überschreiben und dann kommt man auf einem Custom-Builder-File raus und das Custom-Builder-File zeigt auf den nächsten Custom-Builder-File und das zeigt auf das nächste Custom-Builder-File."}, {"id": 736, "start": 6849.28, "end": 6854.28, "text": "Und irgendwann zeigt das auf eine Custom-Binary-Datei, die ausgeführt wird."}, {"id": 737, "start": 6854.28, "end": 6869.28, "text": "Aber im Detail müsst ihr es nochmal angucken."}, {"id": 738, "start": 6869.28, "end": 6885.28, "text": "Aber er hat gesagt, es ist ziemlich einfach."}, {"id": 739, "start": 6885.28, "end": 6894.28, "text": "Also ich glaube, ich werde mein DS nachher flashen. Ich bin da jetzt irgendwie ganz scharf drauf."}, {"id": 740, "start": 6894.28, "end": 6899.28, "text": "Ich weiß aber gar nicht, was ich damit machen soll. Warum soll ich den flashen?"}, {"id": 741, "start": 6899.28, "end": 6913.28, "text": "Ich weiß gar nicht, was ich damit machen soll."}, {"id": 742, "start": 6913.28, "end": 6940.28, "text": "Weil man es kann, ja."}, {"id": 743, "start": 6940.28, "end": 6968.28, "text": "Also ich habe ganz ehrlich, ich sitze lieber mit einem 3DS im Zug und spiele alles mit einer Switch. Die Switch ist mir viel zu fett."}, {"id": 744, "start": 6968.28, "end": 6972.28, "text": "Excellent."}, {"id": 745, "start": 6972.28, "end": 6978.28, "text": "Ja, da bin ich eigentlich schon on. Fast zwei Stunden. Kommt mir gar nicht so lang vor."}, {"id": 746, "start": 6978.28, "end": 6987.28, "text": "Ich habe Hunger. Ich habe übelst Hunger langsam."}, {"id": 747, "start": 6987.28, "end": 6999.28, "text": "Das ist echt ein Thema, ne? Das wird so oft kassiert schon, diese ganze Geschichte. Aber sie geben nicht auf."}, {"id": 748, "start": 6999.28, "end": 7017.28, "text": "Dafür ist gar nicht genug Platz."}, {"id": 749, "start": 7017.28, "end": 7031.28, "text": "Ja, dann."}, {"id": 750, "start": 7031.28, "end": 7044.28, "text": "Ja, guck mal."}, {"id": 751, "start": 7044.28, "end": 7048.28, "text": "Weil es geht wahrscheinlich. Das ist der einzige Grund."}, {"id": 752, "start": 7048.28, "end": 7058.28, "text": "Man kann es machen."}, {"id": 753, "start": 7058.28, "end": 7060.28, "text": "Barbecue Sushi."}, {"id": 754, "start": 7060.28, "end": 7069.28, "text": "Also ich werde jetzt übrig gebliebenes halbes Schnitzel futtern und ein paar Pommes frites dabei machen."}, {"id": 755, "start": 7069.28, "end": 7079.28, "text": "Ist er immer noch nicht fertig damit? Hat er nicht vor zwei Jahren angefangen, diesen PC zu bauen?"}, {"id": 756, "start": 7079.28, "end": 7093.28, "text": "Er hat doch vor zwei Jahren angefangen, diesen PC zu bauen."}, {"id": 757, "start": 7093.28, "end": 7106.28, "text": "Auch schon eine Kühlwasser. Was ist das?"}, {"id": 758, "start": 7106.28, "end": 7112.28, "text": "Okay, alles klar."}, {"id": 759, "start": 7112.28, "end": 7125.28, "text": "Die anderen Videos sind mir jetzt zu anspruchsvoll. Wobei das Elektro Boom Video könnten wir uns so angucken."}, {"id": 760, "start": 7125.28, "end": 7130.28, "text": "Ja, zeigt mal her."}, {"id": 761, "start": 7130.28, "end": 7150.28, "text": "Was ist denn jetzt los?"}, {"id": 762, "start": 7160.28, "end": 7173.28, "text": "Was ist das auf der Straße? Hab ich noch nie gesehen. Das ist bestimmt nicht so eine Ami-Geschichte. Kerkona-Style."}, {"id": 763, "start": 7173.28, "end": 7183.28, "text": "Wahrscheinlich gibt es das bei uns gar nicht. Oder was soll das sein?"}, {"id": 764, "start": 7183.28, "end": 7189.28, "text": "Ach so. Die meinen, dass man das erkennt, wenn einer vor der Ampel steht."}, {"id": 765, "start": 7189.28, "end": 7191.28, "text": "Ach das ja, das haben wir auch."}, {"id": 766, "start": 7219.28, "end": 7231.28, "text": "Ja, das haben wir auch, das haben wir auch."}, {"id": 767, "start": 7249.28, "end": 7272.28, "text": "Der Chat, 10 Monate, Dankeschön. Huge Subscription."}, {"id": 768, "start": 7272.28, "end": 7278.28, "text": "Klingt sinnvoll."}, {"id": 769, "start": 7278.28, "end": 7287.28, "text": "So in diesen Intersektionen, wenn ich nur ein Auto sehe, das auf dem ersten Sensor stoppt, stoppe ich auf dem zweiten Sensor, damit mein Licht grün wird."}, {"id": 770, "start": 7287.28, "end": 7288.28, "text": "Du Monster."}, {"id": 771, "start": 7288.28, "end": 7297.28, "text": "Aber ich frage mich, wie diese Sensoren funktionieren. Es muss ein Weichsensor sein, mit einem hohen Weichsensor, damit etwas so schwer wie ein Auto es bewegen würde."}, {"id": 772, "start": 7297.28, "end": 7299.28, "text": "Deine Mama würde den Sensor bewegen."}, {"id": 773, "start": 7299.28, "end": 7302.28, "text": "Ah du Idiot. Es ist unsere Mama, die dich vertreten."}, {"id": 774, "start": 7302.28, "end": 7304.28, "text": "Oh, sorry."}, {"id": 775, "start": 7304.28, "end": 7306.28, "text": "Was ist los, Jungs?"}, {"id": 776, "start": 7306.28, "end": 7308.28, "text": "Oh verdammt, nichts."}, {"id": 777, "start": 7308.28, "end": 7310.28, "text": "Oh verdammt."}, {"id": 778, "start": 7310.28, "end": 7312.28, "text": "Wo sind meine Pilze?"}, {"id": 779, "start": 7312.28, "end": 7314.28, "text": "Mal sehen."}, {"id": 780, "start": 7314.28, "end": 7316.28, "text": "Die Sensoren sind Induktivlupen."}, {"id": 781, "start": 7316.28, "end": 7318.28, "text": "Wenn das so ist, ist es so."}, {"id": 782, "start": 7324.28, "end": 7326.28, "text": "Ein gigantischer Metalldetektor."}, {"id": 783, "start": 7326.28, "end": 7328.28, "text": "Oh, also ist es eine Magnetikradiation."}, {"id": 784, "start": 7328.28, "end": 7331.28, "text": "Was? Sie machen uns in unseren Autos lebendig?"}, {"id": 785, "start": 7331.28, "end": 7334.28, "text": "Nein Mann, sie haben eine sehr hohe Frequenz und Kraft."}, {"id": 786, "start": 7334.28, "end": 7336.28, "text": "Warum spreche ich zu mir? Wo sind meine Pilze?"}, {"id": 787, "start": 7336.28, "end": 7339.28, "text": "Die Art, wie diese Sensoren funktionieren, ist ziemlich einfach."}, {"id": 788, "start": 7339.28, "end": 7342.28, "text": "Sie sind grundsätzlich aus einem gigantischen Lauf des Weichsensors."}, {"id": 789, "start": 7342.28, "end": 7346.28, "text": "Und wenn du eine AC-Voltage über den Weichsensor platzierst, wird ein AC-Kurrent durch den Weichsensor gehen,"}, {"id": 790, "start": 7346.28, "end": 7348.28, "text": "aufgrund der Impedanz des Weichsensors."}, {"id": 791, "start": 7348.28, "end": 7354.28, "text": "Wenn ein Auto, zum Beispiel, das aus Stahl und einem gigantischen ferromagnetischen Körper auf dem Koil stoppt,"}, {"id": 792, "start": 7354.28, "end": 7359.28, "text": "werden die Magnetikradiationen von dem Koil durch den Körper des Autos magnifiziert."}, {"id": 793, "start": 7359.28, "end": 7364.28, "text": "Die Induktanz des Koils steigt deutlich, die Impedanz steigt, der Kurrent fallt,"}, {"id": 794, "start": 7364.28, "end": 7367.28, "text": "du entdeckst diese Veränderungen und du weißt, dass da ein Auto ist."}, {"id": 795, "start": 7367.28, "end": 7371.28, "text": "Nein, es ist wie einer von diesen Kreditkart-Lieferanten, dass du deinen Karten auf den Karten tippst,"}, {"id": 796, "start": 7371.28, "end": 7374.28, "text": "es steigert deinen Karten und gibt dir Informationen."}, {"id": 797, "start": 7374.28, "end": 7389.28, "text": "Es ist doch egal, es ist doch egal, Bill Gates spritzt uns doch eh neue Mikrochips, also das macht es doch alles keinen Unterschied mehr."}, {"id": 798, "start": 7405.28, "end": 7406.28, "text": "Was machst du?"}, {"id": 799, "start": 7406.28, "end": 7407.28, "text": "Steig zurück!"}, {"id": 800, "start": 7407.28, "end": 7410.28, "text": "Ich mache meinen Scope batterieoperiert."}, {"id": 801, "start": 7410.28, "end": 7413.28, "text": "Nicht den 4-Channel-Scope, zumindest den 2-Channel."}, {"id": 802, "start": 7413.28, "end": 7415.28, "text": "Okay, gut, lass mich sehen."}, {"id": 803, "start": 7417.28, "end": 7418.28, "text": "Schleif-Boys!"}, {"id": 804, "start": 7418.28, "end": 7422.28, "text": "Ich sollte ihnen eine Frau finden, damit sie in einen guten Mann werden."}, {"id": 805, "start": 7424.28, "end": 7426.28, "text": "Ich denke, du solltest deine Pilze nehmen."}, {"id": 806, "start": 7426.28, "end": 7437.28, "text": "Oh, da ist es. Alles besser. Jetzt können wir es aufhören zu öffnen."}, {"id": 807, "start": 7437.28, "end": 7448.28, "text": "Lohnt es sich, Peaholz zu installieren? Kommt drauf an, für was? Also für Twitch und YouTube bringt es dir nix. Twitch geht wohl irgendwie, aber YouTube geht gar nicht."}, {"id": 808, "start": 7448.28, "end": 7462.28, "text": "Er wird immer besser, was seine Sellouts angeht."}, {"id": 809, "start": 7462.28, "end": 7464.28, "text": "Okay, ist er laut."}, {"id": 810, "start": 7469.28, "end": 7471.28, "text": "War so richtig viel drin."}, {"id": 811, "start": 7471.28, "end": 7488.28, "text": "Nein, ich habe kein 2-Channel-Scope, ich habe nur ein 2-Channel-Scope."}, {"id": 812, "start": 7488.28, "end": 7501.28, "text": "Ist auch so ein Ding, wo ich mir schon ein paar Mal überlegt habe, aber nee, wozu? Ich habe einen Logic-Analyser, wo man ein paar ähnliche Sachen mitmachen kann."}, {"id": 813, "start": 7501.28, "end": 7504.28, "text": "Das ist für Low-Power-Zeug."}, {"id": 814, "start": 7504.28, "end": 7518.28, "text": "Ach, yes."}, {"id": 815, "start": 7534.28, "end": 7537.28, "text": "Was hat er vor? Er will das Ding batteriebetrieben machen?"}, {"id": 816, "start": 7537.28, "end": 7541.28, "text": "Okay."}, {"id": 817, "start": 7560.28, "end": 7564.28, "text": "Da ist ganz schön viel Heißkleber drin hier."}, {"id": 818, "start": 7564.28, "end": 7574.28, "text": "Haben die den Kleber an den Spulen, dass es nicht piepst? Oder wozu ist der Kleber? Ich meine, dass die Komponenten drauf bleiben, kann ja der Kleber wohl kaum sein."}, {"id": 819, "start": 7594.28, "end": 7596.28, "text": "Das geht noch."}, {"id": 820, "start": 7624.28, "end": 7627.28, "text": "Ah, yes."}, {"id": 821, "start": 7654.28, "end": 7656.28, "text": "Okay."}, {"id": 822, "start": 7661.28, "end": 7663.28, "text": "Excellent."}, {"id": 823, "start": 7663.28, "end": 7691.28, "text": "Ah, der Kleber ist dazu da, damit die Komponenten einen Vibrationstest bestehen, dadurch verstehe. Excellent Informations."}, {"id": 824, "start": 7691.28, "end": 7697.28, "text": "Jetzt denken sich die Leute auch, WTF passiert da gerade."}, {"id": 825, "start": 7706.28, "end": 7709.28, "text": "Ich würde mich da gar nicht trauen, drüber zu fahren."}, {"id": 826, "start": 7709.28, "end": 7718.28, "text": "Bei uns sind die Dinge aber besser versteckt. So habe ich das noch nie auf der Straße gesehen."}, {"id": 827, "start": 7739.28, "end": 7751.28, "text": "Ja, ein bisschen. Ein bisschen. Ein bisschen. Ein bisschen, ein bisschen."}, {"id": 828, "start": 7769.28, "end": 7772.28, "text": "Na ja."}, {"id": 829, "start": 7799.28, "end": 7801.28, "text": "Also so hat es nicht funktioniert."}, {"id": 830, "start": 7801.28, "end": 7814.28, "text": "Das war immer ganz davon abgesehen. Also, wenn du Leute tracken willst, ist ein Smartphone doch mal tausendfach besser als irgendwelche komischen Schleifen auf der Straße."}, {"id": 831, "start": 7814.28, "end": 7827.28, "text": "Also, wenn du Leute tracken willst, ist ein Smartphone doch mal tausendfach besser als irgendwelche komischen Schleifen auf der Straße."}, {"id": 832, "start": 7844.28, "end": 7856.28, "text": "Also, ich würde mir ja Gedanken machen, da mit meinem Auto drüber zu fahren, wenn da irgendetwas auf die Straße gepappt ist."}, {"id": 833, "start": 7857.28, "end": 7865.28, "text": "Der ist in Kanada, oder? War der in USA oder in Kanada? Ich kann mir das immer nicht merken."}, {"id": 834, "start": 7865.28, "end": 7870.28, "text": "Kanada."}, {"id": 835, "start": 7887.28, "end": 7889.28, "text": "Okay, genug Werbung."}, {"id": 836, "start": 7889.28, "end": 7894.28, "text": "Excellent. Jetzt wissen wir auch Bescheid, wie man es nicht macht."}, {"id": 837, "start": 7895.28, "end": 7905.28, "text": "Ich glaube, ich gehe was essen. Ich habe übels Hunger. Was haben denn die Barbecue Pit Boys so Neues? War das gerade?"}, {"id": 838, "start": 7905.28, "end": 7921.28, "text": "Was gibt es denn hier Neues? Beef-Bacon-Sushi-Slide. Ein Sushi auf ein Burger? Ich weiß ja nicht."}, {"id": 839, "start": 7922.28, "end": 7924.28, "text": "Ich weiß ja nicht."}, {"id": 840, "start": 7924.28, "end": 7938.28, "text": "Smoked Fried Sparrel. Oh, das sieht gut aus. Aber ich, nein, nein Leute, ich fange nicht wieder an, im Stream zu essen. Wenn ich im Stream esse, habe ich erstens schon mal übels rumgesaut, weil ich im Headset hängen geblieben bin. Außerdem kann ich da nicht entspannt essen. Das mache ich jetzt nicht."}, {"id": 841, "start": 7942.28, "end": 7944.28, "text": "Das mache ich jetzt nicht."}, {"id": 842, "start": 7945.28, "end": 7947.28, "text": "Oh, Kokona."}, {"id": 843, "start": 7947.28, "end": 7960.28, "text": "Huge Update, Home Center. Jetzt gucken wir das nächste Mal."}, {"id": 844, "start": 7961.28, "end": 7974.28, "text": "Jawoll. Hauptsache, ich habe ein Hardware-Video zum Reacten-Prost-Stream. So, speichern wir den ganzen Kram mal. Moment."}, {"id": 845, "start": 7974.28, "end": 7999.28, "text": "Bookmark All Tabs. Vom 20.9. Excellent. So, und dann können wir das nächste Mal hier weiter gucken. Ich gehe jetzt was essen. Ich habe übels Hunger, Leute. Und nachher kann es durchaus sein, dass wir weiter basteln an dem SSL HTTPS Web-Server."}, {"id": 846, "start": 7999.28, "end": 8007.28, "text": "Aber erstmal was essen."}, {"id": 847, "start": 8007.28, "end": 8028.28, "text": "Also nachher heißt es dann irgendwann heute Nachmittag. Es ist jetzt 12.30 Uhr. Also nicht vor 15 Uhr. Oder vielleicht. Mal gucken. Vielleicht sogar schon früher. Waren wir nachher weiter. Okay, also bis denn. Macht's gut, CU. Ich habe übels Hunger. Macht's gut. Pepo Fett, genau. CU. Und ein bisschen kürzer."}]}