{"text": "Tschü tschü tschü tschü tschü baitedDas war's für heute.Bis zum nächsten Mal.Bis zum nächsten Mal.Ja, was auch immer.Twitch hat eh noch nicht gecheckt, dass da stream on ist.Doch.Alpha HD ist schon am Start.Gebaited, aber richtig gebaited.Aber eigentlich nicht gebaited.Weil ich mach jetzt nicht wieder aus oder so.Das ist Absicht.Kein Gebait.Von irgendwas anderes.Aber wie hieß denn nochmal diese...Wie hieß denn dieser...Das ist doch...Wie hieß denn dieser Typ nochmal...Den die alle in...Ihre MW2 Montages reingemacht haben.Den hier, oder?Der war in allen MW2 Montages drinne.Huge. Headbang.Das war doch der...Den haben sie alle in MW2 Montages reingemacht.Ich erinnere mich schon.Das war doch der...Den haben sie alle in allen MW2 Montages reingemacht.Das war doch der...Den haben sie alle in allen MW2 Montages reingemacht.Ich erinnere mich noch.Da gab es noch Videos von...Von...Wie hieß das?Sandy Ravage gab es da.Gibt es den noch?Gibt es den noch?Gibt es den noch?Gibt es den noch?Vor 11 Monaten.Ey ich mein...Immerhin.Immerhin.Den scheint es noch...Den gibt es ungefähr genau so viel wie es mich noch gibt.Auf YouTube würde ich mal behaupten.Auch nur noch sehr am Rande.Ah ja.Ah ja.Das größten Verhältnis ist nicht richtig.Gut das ist das kleinste Problem jetzt.Ja also Leute, ich wollte mir mal heute mit euch zusammeneine Sache angucken, die ich mir schon lange anschauen wollte.Und zwar das hier.Das ist aber wahrscheinlich nichts, was den ganzen Stream dauert.Weil ich glaube, dass das ziemlich einfach ist.Und zwar das hier wollte ich mir mit euch mal angucken.Und zwar...Ich hab letztens ein Video gesehen.Da hat irgendjemandanstatt CSS das verwendet.Und ich wusste auch schon, dass...Ich wusste, dass es das gibt.Ich weiß auch so ungefähr, was es macht.Und ich weiß auch ungefähr, wofür es da ist.Aber ich hab letztens ein Video geguckt.Das war irgendwie...Sass in 20 Minuten.Oder sowas.Und ich muss sagen, ich fand das nicht verkehrt.Das hat mich überzeugt,dass man sich das mal angucken muss.Also soweit ich das verstanden habe,ist das quasi CSS.Mit ein bisschen zusätzlicher Syntax,wo man mehr machen kann.20 Minuten fürs Sass.Wieso meinst du, es ist zu lang oder zu kurz?Wahrscheinlich brauchen wir schon ein bisschen länger für.Aber wahrscheinlich sind wir die Streamer heute beschäftigt,sich das im Detail mal anzugucken.Aber es ist mehr oder weniger...Also wenn ich das verstanden habe,wenn ich das richtig kapiert habe...Wie gesagt, ich wusste schon vorher, dass es das gibt.Aber ich hab es mir nie so genau angeschaut.Es ist normale CSS-Syntax.Es ist normale CSS-Syntax.Nur, dass mannoch ein paar andere sinnvolle Sachen drin machen kann.Zum Beispiel kann manwohl irgendwie...Na gut, Variablen gibt es jetzt in CSS auch.Wir gucken uns einfach mal das Getting Startedjetzt an und probieren das ein bisschen aus.Da kann ich mal wieder meineHuge-Frontend-Skills zeigen.Kann ich mein...Wie sagt man heutzutage so schön?Mein Frontend-Game upsteppen.Painstrap.Ähm...Also wie gesagt, Variablen kannst du.Du kannst irgendwiedie Elemente besserineinander schachteln.Man kann die Sachen in unterschiedliche Filesaufteilen. Moduleshabe ich keine Ahnung, wases sein soll, ehrlich gesagt.Okay, ich glaube, das ist jetzt nicht so wild.Man kann irgendwelche Sachen einmal schreibenund dann eben mehrfach inkluden und solche Sachen.Das sieht wirklich ganzgut aus. Wie gesagt, das gibt es schonlange. Es ist das erste Mal, wo ich dasgesehen habe, istals ich noch Ruby on Rails verwende.Hat mal irgendjemandvon euch Ruby on Rails verwendet?Das ist ja nicht mehr angesagt.Das ist ja so wasvon extrem.Es gibt schon Rails 5 mittlerweile.Warte.Moment.Da gibt es schon 5. Ich habe irgendwie das letzte,was ich benutzt habe, war keine Ahnung, 3.8oder irgendwie sowas. Das istewig her. Rails release3.8 oder irgendwie sowas.Aber Moment, es gibt schonVersion 6. What the fuck.Wie gesagt, ich habe das mal vorUhrzeiten verwendet.Oder 3.2.Kann auch sein.Ja, das sieht eher aus.Das letzte Mal, wo ich das verwendet habe, war Rubyon Rails 3.2. Und daskam wann raus? Gibt es da irgendwie ein Datum?Warum macht man release notesohne Datum?2012. Ja, das kommt ungefähr hin,weil ich das zuletzt verwendet habe.Discourse ist mit Ruby gemacht,aber Discourse geht mir megaauf den Sack. Discoursewurde dann immer erstmal eine halbe Stunde JavascriptZeug nachladen muss und nicht richtig scrollen kannst.Warum sichdiese Plattform durchgesetzt hat, ist mir auchein absolutes Rätsel.Slay.Teddy.6 Monate. Danke für den Sub. Exquisite.Serious Max.Naja, also wirklich, ich bin da fastFrontend angeht. Nicht so der allergroße Checker.Ich glaube, das ist, also SASund SCSS ist das gleiche.Das ist bloß ein andererDialekt. Also SASist quasi mit Einrückungso ein bisschen wieJaml. SCSS istquasi, CSS mitein bisschen mehr dabei. Das ist aber alles das gleiche.Und LESS ist quasi so eine alternativeImplementierung. Ich weiß, dasBootstrap war früher mal in LESS.So die ersten Bootstrap-Versionenwaren irgendwie mal in LESS.Aber weiß nicht, obdas überhaupt noch, ist das überhaupt noch angesagt?Ich glaube, das ist gar nicht mehrgar nichtmehr im Trend. Ich glaube, das istoutdated oder so.Bootstrap ist echtnicht mehr gut. Okay.Wie gesagt, Frontend-mäßig kenne ich mich nicht sowahnsinnig gut aus. Alsodie meisten Sachen, die ich bisher gemacht habe,weil ich sag ja immer so ein bisschenFrontend-Gedöns, kommt man nicht drum herum.Die meisten Frontend-Sachen,die ich in letzter Zeit gemacht habe, warenVue.js mitVue.tify, wenn irgendwasAnsehnliches sein muss. Das da.So undTailwind, da kann ichden Hype gar nicht drum verstehen, muss ich ehrlich sagen.Vielleicht habe ichauch einfach nur nichtgroß genug einen Kopf, um Tailwind zu kapieren.Das kann auch sein.Material ist overused. Ja, das istdas, was mich an Vue.tify auch nervt.Das Material UILook istdas neue Bootstrap.Material UI Design,das ist das Android.Das habt ihr alle schon gesehen. Also MaterialDesign istdiese Geschichte. Das ist quasi das, wie es beiAndroid aussieht. Das ist das neue Bootstrap.Früher hatte jede Webseite BootstrapLook. Heute hat jede zweite WebseiteMaterial UI Look.Das geht sogarso weit, dass es einMaterial UI für WindowsForms gibt, Alter.Mega Paynes Champ.So, aberokay, Chat, ich seheein paar von euch verwenden Tailwind. Also icherzähle euch jetzt mal, was ichverstanden habe, was Tailwind ist.Dakönnt ihr mir erzählen, warum man es verwendensoll oder was ich...wo mein Kopf zusmall dafür ist. Also,was ich kapiert habe, ist,dass im Prinzip Tailwind CSSkein richtigesCSS Framework ist inRichtung Bootstrap, wo du quasi fertigeModule kriegst. So, also fertige,fertige... Ne, Module ist das falscheWort. Wie heißt das im Browser?Wo du fertige Komponenten kriegst. Das ist inTailwind nicht so. Na, in Bootstrap kriegst duquasi einen fertigenButton mit sich Geschichten. Du kriegsteinen fertigen, keine Ahnung,Data Table mit sich Geschichten. So, das istin Tailwind nicht so, aberTailwind istquasi eine riesige Sammlungaus Helperklassen,mit denen ich mein Zeugstylen kann. Also, anstattich jetzt schreibe,keine Ahnung, Überschrift,H2,und da mache ich dann eine eigene Klasse,irgendwie Highlight undColor Red, gibt es dann schon einefertige Klasse dafür, so für Zentrierenund fürUmbruch undfür Grid und sonstigeGedöns. Aber,wo ist der Vorteil?Das habe ich, das leucht mir nämlich nicht ein.Wo ist der Vorteil davon,wenn ich erstmal 500 Klassenoder so lernen muss in Tailwindund du dannquasiin der eigenen CSS-Sprachelernen musst, um deinHTML zu stylen, anstattselbst CSS zu schreiben?Das kapiere ich nicht.WTF, du streamst auch ja schon3 Jahre oder so?Bist du jetzt gerade von YouTuberüber gekommen, oder wie?Also, deswegenverstehe ich den Sinn hinter Tailwindnicht so ganz. Also,wenn ich 500 Klassenlernen muss, dass ich meinen HTMLstylen kann, dann kann ich doch auch einfachCSS lernen oder Sassoder sonst was undmeinen HTML stylen auf demWeg, wie das eigentlich vom Browser-Herstellergedacht ist. Vielleicht habe ich aberauch die Genialität vonTailwind nicht kapiert, aber so sieht es fürmich aus und ich verstehe den Sinn von Tailwindeinfach nicht. Den Sinn von Bootstrap,den Sinn vonvon Viewtifyund sonst was, das habe ichkapiert, da kriegst du fertige Sachen,also beispielsweise, auch wennes 0x15 Material Designaussieht, aber bei Viewtify kannst dusagen, aha, Components und dann sagstdir Data Table und dannhast du halt eine fix und fertige Data Table,wo du sortieren kannst,wo du suchen kannst, wo duPaging machen kannst und was auch immer. Alsoden Sinn davon verstehe ich,man kann ja, man sieht es ja,das ist halt fix und fertig, man kann es einfach wenden,aber das ist ja in Tailwind nicht. Also wo ist der Sinnvon Tailwind, das verstehe ich nicht so genau.Tainser sagt,es geht halt schneller einfach, die Klassenin HTML rein zu hauen, anstatt hier einenNamen auszudenken, dann CSSzu schreiben, dann wieder zu HTML zu packen.Meinst du, das geht wirklich so viel schneller?Also ja, am Anfang vielleicht,alsowenn ich jetzt was zentrieren will, ich muss einfachnur noch sagen, Class Center, okay,aber ob ich jetzt einfach sage, Class Centeroder ob ich einmal in meine Stylesumgehe und sage,Class Center und dannan jedes Element ein Center dran,ja gut, stimmt, man muss keineCSS Files managen, dafür mussdann 500 Texts auswendig lernen,die sich ein anderer für dich ausgedacht hat, wases vielleicht auch schwieriger macht. Vielleicht gucke ichmir das irgendwann mal an, aber ich habeden Sinn noch nicht so 100%kapiert.So, Tfrom the future8 Monate, das ist ja kurzvoreigentlich schon für den Sub, Poggers.Morgen kommtder Telekom Netzingenieur.Also Sebaro, ich will es jetzt ja nichtbeschwören, ja,aber die haben dichdas letzte Mal auch schon versetzt.Ich hoffe ja, dassder kommt, ja.Der soll mal anrückenoder Zeug fixen.Richtig PP-Gas, Alter.Massive PP-Gas.Gut, also so sieht es aus. Und jetzt nochmal zu dieserSache mit Discourse, das ist auch so eine Plattform,die ich nicht genau kapiert habe. Zum Beispielder Spiegel oder so, die habenauch Discourse. So, ich machemal x-beliebigen Spiegelartikel auf.Was weiß ich,irgendwie das da, aber wenn man jetzt runter scrollt,ist das, glaub, Discourse bei denen auch.Nee, okay, bei denen war es nicht Discourseoder doch Discourse. Ach, ich weiß nicht,oder was Eigenes.Äh.Warte mal, wer hat, wer hat einen Discourse?Ich hab's voll vergessen, es gibt total oftalle WordPress-Blocks haben Discourseund sowas.Discourse, Dis-, Dis-, ach, ich, nee,Dis-, Dis-, krass.Ich glaub, das meine ich.Ich glaub, das meine ich. Oder mein, Moment,oder meine ich, oder meine ich das?Ich bin verwirrt. Warte mal.Was ist das Kommentarsystem?Mein ich das,oder mein ich, mein ich das?Äh.Ich mein, das Kommentarsystem, ich glaub, ich mein das.Oh. Undich finddas halt extrem, genau, das sind dieseSorten von, ich find das halt extremnervig, dass dasquasi soembedded ist auf der Seite. Und du kannstda drin auch nicht richtig scrollen und solcheGeschichten. Das ist ja schon, das istja schon was, was mir an Reddit immer übelst aufden Keks geht. Geh da mal zum Beispiel,ja, Self-Hosted-Reddit.So. Ich, also, mal davon abgesehen,dass ich ja, ehrlich gesagt,eher, lieber Old,Old-Reddit verwende, alsNew-Reddit. Aberwer ist denn auf die glorreiche Idee gekommenmit endless scroll hier drauf?Oder noch schlimmer?Moment, noch schlimmer, pass mal auf.Wir gehen jetzt mal auf ein YouTube-Video vonmir und wir sagen jetzt mal,ah, ok, ich weiß, der Sebarohat da einen Kommentar geschrieben, irgendwievorgestern, ich guck mal nach.Ich hab keine Chance das zu finden.Es gibt keine Pages, es gibt keineSuchmöglichkeiten, es gibt keine Pages. Ichweiß, dass man theoretisch suchen kann in denKanal-Settings, aber das kannich machen. Wenn du dein eigenes Kommentarsuchst, oder ich unter einem anderenVideo jemand gesehen hab, und mir gedachthab ich Antwort gemacht, du findest das nicht. Du kannstkomplett verknicken, du kannst komplett, du findestdas nicht.Warum gibt's hier endless scroll?Nee, Steuerung F gehtnicht. Guck mal, du siehst ja, der lädt immerdynamisch nach.Der lädt immer dynamisch nach, also sprich,wenn das Kommentar, was jemand geschrieben hat,zwei Tage alt ist, dann ist es jagar nicht geladen, wenn die Steuerung Ftotal beknackt.Also ich mein, man kann natürlichalles laden und dann Steuerung Fdrücken, aberdas geht,das geht auch nicht,weildie richtigen Big BrainSeiten, die zum Beispiel Discastverwenden, die machen das so.Ich hab ein gutes Beispiel,das Home Assistant Forumist so ein Kandidat.Das Home Assistant Forumist so ein Kandidat, was ich auchin der Handhabung extremnervig und umständlich finde.Zum Beispiel,ich mein, es siehtaus wie eine normale Seite, ne?Ist es aber nicht. Ups, wenn manhier runter scrollt,sieht man, es wird dynamisch geladenund wenn man jetzt hoch scrollt,sieht man, es ist dynamisch unloaded.Das heißt, ich kann die Seite gar nicht mehr ordentlichdurchsuchen. Ich kann hier oben hingehenund irgendwo sagen,search this topic.Aber warum mussich ne Funktion, die im Browsereingebaut ist, nachbauen?Das ist total,totalbescheuert einfach nur, ich versteh'snicht.Ja, genau, es ist das Smartphoneoptimiert, aber auf dem Desktop geht'smal auf dem Keks. Was ist das?Ja, das versuche ich heute rauszukriegen,also ob es was taugt.Es ist wohl ne bessere,nein, es ist keine bessere CSS-Variante.Es ist ein, wie sagt man so schön,ein super Set von CSS, also sprich,du kannstCSS schreiben, allerdings kannstdu ein bisschen mehr machen und derübersetzt dir das dann in CSS. Das istwohl ziemlich simpel und relativbeliebt. Ich hab letztens in dem Video gesehenund es sah ziemlich pock aus, was dergemacht hat.Ja, und das isteinfach Schrott, so dieseForumssache hier.Guck, das ist, das istich mein,auf dem Handykann ich's noch irgendwie nachvollziehen,aber ich wette mit euch,das Ding hat600also646 Postshat das.Würde man dasladen, wäre das beieinem aktuellen Desktoprechnerüberhaupt kein Problem. 600solcher Posts zu laden ist wirklich easyas fuck. Aber selbst wenn man das nichtmachen würde und man sagt,ok, man macht Pages mit 100Posts pro Seite, wäre jaauch noch ok. Aber so finde ichist das, du kannst, dasdumme ist, dass es komplett, und dasmag ich einfach nicht, es hebelt dieBrowserfunktion aus. Scrollen geht nichtmehr, also sprich Browser scrollen istkaputt, Browser Search istkaputt, dann überschreibtdas auch nochStandard Browser Shortcuts,Ctrl F, normalerweise dasCtrl F, hier ist Ctrl F dasund scrollen geht nicht, man muss dieses eingebauteScrollen verwenden, ich kann das überhaupt nicht ab.So, deswegenverwende ich auchimmer nur Old Reddit.Old Reddit hatauch so schöne Sachen wie Pages.Ich meine, Old Reddit sieht auch wirklichold aus,aber OldReddit ist lustigerweise, obwohl es soalt ist, sogar viel schneller.Ja, ich glaube die meisten, dieöfters am Start sind, nutzen wirklichOld Reddit. Ich meine, es ist jetztnicht, also es ist jetzt nichtdie Ausgeburt der Schönheit, Old Reddit.Wobei ich sagen muss,ich persönlich finde New Reddit jetzt auchnicht wahnsinnig hübsch.Außer dass die die Seitenicht richtig verwenden. Ich weiß, man mussauf, äh, man muss aufClassic View schaltenoder so.Ich meine, es sieht ein bisschenneuer aus, bisschen schöner, aber so neriesen Unterschied ist es nicht, und man darf einsnicht vergessen, pass mal auf, wenn man hier jetztin die, ups, Moment, äh,ich muss erst mal auf Desktop View schalten.Guckt euch mal an, wie vielder lädt, das ist Old Reddit,der lädt,guckt mal, 931Kilobyteund 2,5 MBResources, lädt er bei Old Reddit.Sondern das passt mal auf,ratet mal, wie viel New Redditläuft. Ich hab letztens erst geguckt, was, alsodas ist Old Reddit, und New Reddit würde mansagen, was ist besser, neuer, schöner, optimierter.Was meint er, wie viel New Reddit hat?Ja, Sebaro 10 MB ist gar nicht so schlecht.Ich glaub, ich glaub, um die 10 MB Resourcesund irgendwie 3 MB Java Scriptoder sowas, guck mal mal.Also erstens ist es viellangsamer, wie man sieht.Äh, what the...Ok, ähm, also daslädt einfach mal 40 MB.Was, der Chatist weg?Oh, oh Stream istda, oder?Ne,ne, ne, meine Vorschauist nur broken.Das ist alles, meine Vorschauist broken, das ist nicht so schlimm.Äh, die Chat Anzeige funktioniertauch noch.Die Chat Anzeige ist da, die funktioniert.Ich seh sie doch in meinerVorschau.Die ist auch nicht verdeckt.Ach, der Chatblockiert die Anzeige. Ach, jetzt weiß ich,was ihr meint. Ach so, äh, wartet mal,ähm,äh, Moment,Moment, äh,äh,Hallo?Moment,kann man keine, ah jetzt,seht ihr es jetzt?Ja, guckt mal,40 MB,40 MBnew reddit,und jetzt zum Vergleichold reddit, äh, ups,und jetzt zum Vergleichold reddit,äh,what? Alter,Firefox, äh,Chrome, was auch immer,mach einfach mal. So, und jetztold reddit, ihr seht,ich mein, es ist klar, das neuereddit lädt ja auch irgendwelche Bilderund so vor, wobei man sich halt echtfragen muss, ne? Ich hab, ich hab mirdas, wir machen das einfach anders, ich kanndoch den hier unten einpletten, oder ichkann einfach links einpletten, das geht auch.Was ich halt sehr fragwürdig finde, ana new reddit ist,oder am neuenreddit, guckt mal, ich hab, ich habhier letztens, ich hab mir das letztens mal,ähm,letztens mal in Ruhe angeschaut, da sindVideovorschau dabei.Wenn ihr hier durchguckt.Hier, Dash, da sind Videovorschaudabei, ich versteheden Sinn, ich verstehe den Sinn davon nicht, warum redditVideos vorlädt. Kannman nicht einfach, nen thumb,äh, äh, äh, äh, äh, äh, äh, äh, ähpreview thumbnail anzeigen?Wo siehst duda 40 MB hier,äh, 15 MB, 15 MBtransfered und, achMoment, warte mal,kann das sein dass transfer das was übertragen ist und 14 mb das überpackende das entpackendeentpackt entpackte was ist der unterschied zwischen transfer und und resources transferresources developer tools aha excellent stackoverflow what is the difference between transfer and resourcesok ok ok ok aha also was kommt raus compress size of all resources ok dann dann habe ich dasfalsch interpretiert dann sind das 14 mb ja aber das macht ja noch das macht ja das macht dasverhältnis ja noch schlechter es sind 14,6 transfer und old und old sind plus 968 kb dasist 14 mal größer oder 15 mal größer was machen die denn da ja genug genug ausgekotzt über redditich finde reddit immer noch eine super plattform aber new reddit ist echt so eine beleidigung ichmeine wozu muss man hier jetzt videos vorladen ok ich muss mir noch den classic view anguckenob es da ob es da besser ist nach moment merkt merkt moment merkt er sich nicht ob man den kompwelchen view der merkt sich doch mal welchen view man an hatte ja die videos werden direktabgespielt ist auch eine sache die finde ich so schön moment merkt merkt er merkt er sichnicht was man eingestellt das merkt er sich doch normalerweise ok wir ignorieren das jetzteinfach mal aber nur wenn man eingeloggt ist ja das ist ja auch so ein ding das geht natürlichtechnisch nur wenn man eingeloggt ist keine ahnung was reddit los ist wie dem aus sei wirmachen erstmal hier alles schön sauber und letzten mal zack weg wunderbar so da widmen wir uns maldem eigentlichen thema des streams und ich mache mal kurz visual studio code auf codra ne wir machenmal wir machen mal einen neuen ordner haben noch irgendwo tmp lull ok tmp tmp lull bessername ich habe keine ahnung mehr was es ist ich lasse es mal kurz da mk dir tmp so perfektbeste deswegen finde ich auch meine eigenen projekte immer so gut weil ich diese toll benennebeide mal es gibt eine lösung für jubel mit twitch ok sehr gut exzellent habe ich im chatirgendwas übersehen kann man schauen es was es gibt jetzt twitch soundtrack für lizenzfreiemusik echt wo denn ich kenne mich ich kenne mich doch auf twitch nicht aus weißte noch aber ichhabe ich noch nicht gesehen ich habe da bestimmt ich habe da garantiert eine benachrichtigungdrüber bekommen ich glaube ich habe nichts übersehen nope sieht gut aus warum keinaiya support weil ich kann fft moment was ist hier loswarum geht das nicht sekunde das muss man das muss man gleich gleich ändern das mussman gleich das muss jetzt weg das muss man gleich ändern und zwar er unsmein wo ist es denn ja bett und steve enabled gift emotes animated alles klar jetzt geht'sich refresh mal refreshen und jetzt ist es nicht mal dark theme ok das wird jetzt maltesten exzellent cute chat am werksehr gut was kannst du mal anschauen kann damit was passieren wenn man da was ändertmal gucken ich glaube dass ich weiß nicht ob twitch das so gerne hat wenn man das imstream bespricht ehrlich gesagt das ist eventuell eventuell ist so was sogar monka tos ich weißes gar nicht ich könnte mir nur vorstellen dass sie das nicht so geil finden also wennich twitch wäre würde ich wahrscheinlich nicht so geil finden twitch broadcast soundtrackmelde dich für die lavate liste an lofi hip hop beats electronic rap ok das ist ja schonmal nicht meins aber für den hintergrund sound ist es okdas ist ein bild gbd ok naja wir widmen uns jetzt mal der eigentlichen sache was wir heutemachen wollen und zwar das da wollte ich mir angucken so und also was ich im vorfeld rüberrausgekriegt habe ist erstens dass die seite kacke aussieht von denen das heißt was wirjetzt erstmal machen muss es den dark reader anschalten damit man das jetzt überhauptordentlich erkennt jetzt jetzt ist das schon ein bisschen erträglicher und ich war ichwar mal ein bisschen größer das ganze der zu lull reader genau übrigens habe ich habhabe ich schon mal in letzter zeit erzählt wie geil meine heizungsüberwachung funktioniertich weiß das habe ich jeden stream erzählt aber ich bin immer noch begeistert wie gutmeine heizungsüberwachung funktioniert nur noch mal angemerkt nebenbei ich weiß ich habdie letzten 50 streams gefühlt erzählt so also was ich jetzt was ich verstanden habedavon was das ganze ist das ist quasi ein bisschen sowas wie templates in c++ nur nichtganz so schlimm also sprich man kann css schreiben mit ein bisschen mehr funktion und dann machtes ein gültiges css daraus und man selbst muss halt weniger schreiben also man hat zumbeispiel variablen die er überall einsetzen kann man hat irgendwie so eine art kann soeine art funktion machen die man die automatisch überall einsetzt man kann halt keine sachenmachen die css grundsätzlich nicht kann also wenn css zum beispiel keine sachen berechnenkann dann kann sas auch dynamisch keine sachen berechnen also man kann mit sas nichts machenwo der browser keinen support für hat was man allerdings machen kann ist man kann wohleinfacher komplexes css schreiben ohne dass man fünf seiten css schreiben mussalso wir probieren das wir probieren es jetzt einfach mal aus das machen wir übrigensnicht wir machen folgendes das habe ich das habe ich in einem video gesehen es gibt eineoriginal studio addon das nennt sich das war es nicht das hier live sas compiler damitkann man sich den browser man sieht es hier da kann man sich den browser vorschauen machenman tippt hier und der übersetzt das nebenbei im hintergrund und man kann auch automatischden browser refreshen lassen das ist eigentlich wirklich ganz nützlich der ist ein updateavailable ja ok wir wollen mal nicht so sein wir lassen ihn mal wischl studio code updatemachen oh ich habe das offizielle richtig höchst offizielle wischl studio code installierterstmal paketquellen updaten nothing to update ok ich lasse ich lasse ihn einmal kurz wischlstudio neu installieren nicht dass wir irgendwelche bugs noch finden die in der neuen versiongefixt denn das geht ja relativ zackig der chat ist wieder an der grenze zu monka tossich sehe es schonheute schon wieder stream so ja ich habe ich glaube ich habe fast eine woche am stückoder so jetzt gestreamt wartet mal ne ne ne ne ne ne max ruhig ähm moment wo ihr scheduleguckt mal hier heute gestern vorgestern kann man da weiter zurück ne so ne kalender ansich hat die javascript die javascript leute von twitch überfordert aber hier unter videoskann man gucken hier guckt mal heute gestern vorgestern vorvorgestern zweimal zweimal sogaräh ok ok ne hier waren mal hier waren mal drei tage stoppt dazwischen dann aber ichhab doch ich hab ganz schön viel gestreamt in letzter tage guckt doch mal an hier 1 23 4 5 6 7 8 9 10 11 12 15 16 16 16 ne ich hab jetzt noch ein paar tippen und dann16 16 ne ich kann nicht zählen warte mal es sind 5 äh 15 15 15 streams diesen monat schonalso quasi jeder zweite tag so also das ist für meine verhältnisse schon wirklich vielso hat er jetzt geupdatet exzellent willst du sass oder css machen äh äh oder scss willich machen ich will scss machen ich kann also ich kann mal ganz kurz was zum unterschiedsagen sofern ich das äh richtig verstanden hab also man kann man also wir müssen jetzterstmal index html machen damit man was sieht index html und jetzt einen live server aufmachendamit man was sieht so ahjaja also viel steht ja auf der seite noch nicht drauf sass testso und jetzt können wir ein paar files anlegen also es gibt die möglichkeit dass man stylespunkt scss verwendet und dass man styles punkt sass verwendet so der unterschied ist jetztfolgendes vielleicht haben wir hier so gerne mit unter auf der webseite vielleicht sogarein beispiel dafür das problem ist die webseite ist mit dem dark reader kaputt leute sonnenbrilleaufziehen difference sass sts also das eine ist mit einrückung das andere ist wie cssbloß ein bisschen mehr ist visual studio gratis ja ich weiß aber nicht ob du vielleichtnicht eher visual studio code meinst also visual studio selber ist die community variantegratis die normale also bei von der normalen visual studio das ist das normale visual studiogibt es eine community variante die kostet nichts die standard professional kostet wasund visual studio code ist grundsätzlich kostenlos ja genau hier hat man schönes beispiel gucktalso scss ist einfach normales css mit also jedes gültige css ist gültiges scss an demmoment das ist ein doofes beispiel hier ist ein gutes beispiel so allerdings ist nichtjedes gültige css gültiges sass also sass das war der ursprüng war glaube ich die ursprünglichevariante das kommt noch aus ruby zeiten aber da muss man diesen diesen mist hier mit einrückungschreiben das ist aber wirklich paint champ ich glaube das verwendet ehrlich gesagt auchgar keiner mehr so ach guck hier kann man sogar hier kann man sogar dazwischen umschaltenso siehts mit scss aus und so siehts mit sass aus es sieht jetzt erstmal praktischer auswenn du es mit mit sass machst weil du kannst dir semi kolons sparen du kannst dir klammersparen und was kannst du dir noch sparen ich glaube das wars aber dementsprechend ist esist es eher eine neue eigene sprache als ein extended css und es wird wahrscheinlich spätersogar noch ein bisschen komplizierter ja guck mal hier hier musste dann das als einrückungmachen und sowas also ganz ehrlich dann mache ich es lieber so dann ist es css aber einbisschen enhance des css also ich werde kein sass machen das ganze projekt nennt sich haltsass aber ich mache scss und habt ihr denn mal frage falls es jemand von euch verwendethabt ihr habt ihr projekte die sass verwenden oder eher scss so wir müssen noch glaubeich das stylecheat einbinden dass das funktioniert link styles excellent so und jetzt und jetztund jetzt erstmal das das allerwichtigste was wir einbinden müssen to smart redwichtv so copy image location image ah yes also die wichtigste sache haben wir schonmal erledigtso jetzt kanns ja weitergehen exquisite ja ok wie fangen wir jetzt am besten an stylesscss so ich würd sagen wir gucken uns einfach mal die beispiele an du musst die css einstimmt du hast recht ja klar ja aber die hat er noch gar nicht generiert aber du hastrecht ich muss die css datei einbinden weil der browser selbst versteht kein scss derscss versteht plus css so genau man muss hier unten noch das ne sass hä moment hab ichdas hab ich das vorhin gar nicht installiert hab ich nur hab ich nur rumgelabert ich glaubeich hab nur rumgelabert hab das gar nicht installiert excellent so wie man das kenntjetzt haben wir es hier watch stars alles klar kann man den kann man den kram hier auchmal ordentlich zumachen so guck jetzt seht ihr jetzt hat das ding jetzt als erst dateigeneriert jetzt hat das ding jetzt als erst datei generiert das heißt wir können jetztanfangen wir machen mal wir fangen mal easy an weil ihr wisst ja ich bin jetzt nichtder allergroße größte frontend checker aber der chat der chat kennt sich aus alsomal nachbar da machen wir jetzt irgendwie so links oder so rein ich muss mal kurz aufdem zweiten bildschirm was aufmachen dass ich ein bisschen abgucken kann wie das beider anderen seite genau jetzt kannst du hier einfach links rein machen so und jetzt solltesie sollte sich noch eigentlich refreshen oder also die links sind leer null aber irgendwiehome aber sieht das das sieht ja sieht ja schön aus wie 1995 jetzt home wifi ich willja demnächst für ein esp 32 so ein kleines admin frontend machen und irgendwie info odersowas irgendwie so reicht nach bitte in den body muss man nach achso ja ich finde ja interessantdass das überhaupt funktioniert wahrscheinlich macht er das für das macht der browser schonfür ein vermute ich mal ich denke mal der browser macht es schon für ein der fix meinschlechtes mein schlechtes hat im elm macht er macht er für mich ganz so gut und jetztund jetzt fangen wir mal an mit mit mit stylesorn als erstes machen wir hier mal naf und danngucken wir uns mal beispiele an so wir machen jetzt wir machen jetzt wir machen gleich amanfang einer margin bottom 50 pixel dass das bild dann nicht so rein was exquisite so undjetzt gucken wir uns mal beispiele an was man alles so machen kann also man kann variablenverwenden das geht mittlerweile geht das in css auch was ist jetzt der vorteil davon wennich das variablen nehme anstatt sss anstatt css variablen wahrscheinlich kann ich diein wahrscheinlich kann ich die dann ins das funktionen und so verwenden was mit normalencss variablen nicht kanndesorption schreibt kann mir wer erklären warum der bettel net launcher innerhalb von19 stunden fast 205 hits zu telemetrie bettel net aufbauen will ja klar der will wissenwas du machst warum du nicht spielst du sollst spielen und gefälligst loot boxen und undmicrotransactions kauf und die versuchen rauszubekommen warum kaufst du keine ich glaubewenn ich auf aliexpress wäre eine stunde lang da würde der schon 705 sachen zurückschickenkanns ja plocken mal gucken ob das damit klar kommt ok also dann dann probieren wir dasjetzt mal also sprich wir können variablen verwenden das bedeutet ich könnte da jetztsowas machen wie sagen wir mal keine ahnung blu wie sinnvoll das ist sei mal dahingestelltblu und dann machen wir irgendwie blu toll wobei nie komm wir machen machen ein bisschenschöneren ein bisschen schöneren plauton irgendwie sowas da so exzellent mach colorchuck norris was ist color chuck norris das kenne ich nicht was ist color chuck norrisist das irgendein dienst oder ist koffee purple geh mal weg ne ne ne behalte ich behalte dasandere so 128 128 240 exquisite color so muss das so muss das sein kannst in sass auch schleifenbauen und generieren aber braucht man das in seinen man kann in sass schleifen generierenne oder also ja du kannst wahrscheinlich so so so ein bisschen wie wie pre processorund dinger in c++ man also sprich eine schleife die dann quasi unter der haube einfach nurmöglichst viel css generiert das könnte ich mir vorstellen dass das geht aber zur laufzeitkann er nicht sein weil zur laufzeit kann er css selber keine schleifen 69 68 420 perfektso ich lasse ich lasse das jetzt erst mal ok das heißt man kann jetzt variablen anlegenso das heißt wenn ich war ja ok wir legen wir legen noch mal ein bisschen mehr variablenalso wir machen noch mal blu blu kann background background was ich was für ein backgroundnehmen 11111 so bg der ist so background wobei ich will ich will ich will ein light lightbackground haben light background ist jetzt ein bisschen angenehmer irgendwie wie sowasdas klingt gut so so was können wir sonst noch machen keine ahnung text text brauchenwir auch immer text machen wir einfach irgendwas irgendwas helles und dann brauchen dann istegal mehr brauchen wir irgendwie wir können auch sowas wie wie warning oder oder sowasmachen da machen wir irgendetwas orangsch aber orangsch weiß ich aus dem kopf nichtwas schöne orangsturn ist so das reicht dann zum ausprobieren erst mal aus ja orange dassieht eklig aus exzellent orange genauso muss das sein so und da kann ich jetzt was machenmit kleinen tipp man kann durch klick auf den wert im color picker die formatierungändern von rgb zu hex ah oh exzellent der chat ist wie immer heute da reicht das schonüber der chat ist heute wieder hier on point aber was habe ich davon jetzt in meinem prinzipdie gleiche farbe aber es heißt ich kann hier oben das heißt ich kann hier oben sojetzt machen super gut so das heißt ich kann jetzt schon mal bei meiner bei meiner nafbarwie mache ich denn das jetzt kann ich jetzt kann ich jetzt einfach sowas sagen wie waswas ich background oder so so sie im background color was ist eigentlich der unterschied zwischenbackground und background color wobei gibt es background überhaupt so und da jetzt bgda sieht er scheiße aus aber ich brauche etwas graues oder sowas was ist das ist dasgrau ok bisschen so ok besser also ich meine es sieht mega beschissen aus ja backgroundist ein short mit mehreren attributen für welches projekt lernst du jetzt css einfachum es zu können dass wo wir wieder bei dem eigentlichen bei der eigentlichen sache sinddie ich in jedem stream sage wo es immer darum geht so nach dem motto mit was fängt manam besten an oder was oder was soll ich machen oder oder oder besser noch wie kann ich dafürsorgen dass ich nach der ausbildung das machen kann was ich will einfach lernen wenn es euchspaß macht also wenn euch was interessiert einfach lernen einfach big brain modus aktivierenund sich das angucken weil man kann es immer mal gebrauchen man kann es immer mal gebrauchenund nachdem man an frontend sachen eh nicht dran vorbeikommt color palettes ja ich okok das das muss nicht schön sein ich mache mal ein bisschen kleiner so jetzt sagen wirerstmal dass das ding noch padding oder so 20 so es ist ein bisschen größer das siehthalt richtig richtig hängen geblieben aus ja ok exzellent so und jetzt habe ich gesehenein feature von von sass ist dass man jetzt hier drinne beispielsweise schreiben kannich möchte dass alle meine links das habe ich vorhin schon gesehen das mal gucken wodas steht hier genau also normales normales css ist ja so was bitte für body margin paddinghinzu alles klar der chat der kennt sich da besser aus als ich jetzt exzellent so alsonormalerweise in css muss man das ja so machen wenn ich quasi ein link element in der navigationsleiste stylen will dann muss ich sagen naf a was dazu spürt spürt näher ob man spürtist jetzt ist jetzt die andere frage was dazu führt dass man halt so ewig lange dingerhat die nicht zusammengehören und mit sass kann man jetzt diese sachen inline schreibennestet das finde ich ist eigentlich ein sehr praktisches feature weil dann steht es nämlichgenau an der stelle wo es sein muss also im normalen css müsste ich jetzt so was hierschreiben um das also wir können es ja mal mit normalen css machen dann würde ich jetztzum beispiel sagen so was wie color und das haben wir jetzt hier blue haben wir da obenschon angelegt so color blue so und jetzt sind meine links so hässlich so hässlichblau da können wir noch sagen text decoration ist es nun so und jetzt sieht das jetzt siehtes zwar auch kacke aus aber nicht mal ganz so kacke so und das blau gefällt mir garnicht das blau das als blau soll ein bisschen dunkler so gut so dann ändern wir noch maldie font size aber noch irgendwie wobei ne wir ändern nicht die font size wir sagenfont family aber monospace oder sowas monospace ok wirklich wirklich besser ok das siehtdoch das sieht jetzt ein ticken das sieht jetzt ein ticken besser aus so abstände undso machen wir gleich so jetzt machen wir big brain abstände mal gucken ob ich das hinkriegejetzt bin ich mal gespannt ob ich das gebacken kriege flexbox wie ging das flex display wartemal da bin ich auch das krieg ob ich das gebacken kriege auch display flex und dann kann manirgendwie sagen just justify contents space hier exploding brain da ich mir das gemerkthabe so jetzt ist das schön verteilt wir können wir können ja sogar wir können essogar noch noch besser machen hier vor haus jetzt oh jetzt wirds advanced guckt euch dasmal an jetzt gibt es emojis für die einzelnen punkte wireless da kann ich euch da kann icheuch antenna heißt das glaube ich da kann ich euch einen ultra geilen service für zeigenfür icons das machen wir danach ich mache jetzt erstmal emojis hin das keine all zugute idee ist weil wenn manche emojis bei dem font nicht unterstützt wird dann funktioniertes am ende nicht ja sowas wie font awesome aber ich kann euch das nennt sich fontellodas das zeige ich euch nachher das habe ich jetzt schon ein paar mal benutzt das ist wirklichrichtig big brain weil wenn man wenn man image fonts verwenden will also zum beispiel keinerso materialize icons oder font awesome also sprich wenn man image fonts verwenden willzum beispiel hier die material design icons da gab es irgendwie so ein search search searchding und wo ist die suche für material material icons da gab es also gute seite zum suchendas da ist das das cc fonts icons was weiß ich was du meinst genau da kann man jetzt hierzum beispiel suchen nach nach wireless oder so und dann findet man passende icons füraccess point so aber damit man das verwenden kann muss man die schriftart inkluden unddie schriftart ist freut mich nicht 500 kilobyte oder sowas sind das creative commons iconsdie meisten schon ich glaube die lizenz steht sogar wenn man glück hat dabei aber ehrlichgesagt ich habe mir noch nie gedanken drum gemacht habe es einfach verwendet ich glaubedie lizenz steht da irgendwo dabei ja zumindest dass ich das hier verwenden kann ist die sacheentweder mache ich das als svg sonst was rein oder ich include diesen kompletten materialicons font bei mir link hier hast du hier sind noch mal alle also die icons kann manauf jeden fall verwenden die sind ja startmäßig mit dabei ich weiß gar nicht wo man stylesheetwo es das offiziell gibt hier so da müsste ich da müsste ich das hier einbinden undwie ich dazu gekommen bin dass das keine gute idee ist folgendes wenn man das auf dem microcontroller macht ist der kram ein bisschen fett guck mal wenn ich probst wenn ich denkram runter lade so diesen icon font dann ist der moment das ist nicht das richtigedas ist das richtige da hat erstmal gebaited what ok das ist das richtige font fall unddas ist einfach das ist ein bisschen groß wenn man nur fünf icons braucht so zumindestes gibt bestimmt noch andere varianten aber ich habe eine ultra geilen service gefundenvon ich glaube von tello war das genau so und da kann man sich jetzt die icons raussuchenich zeige euch das nachher mal weil ich habe wie gesagt ich habe den letzten letzten paarfür die letzten paar embedded spiele spiele rein auch schon verwendet da kann man sichjetzt die icons raussuchen die man die man hätte aus verschiedenen image fonts alsoman muss nicht unbedingt immer den gleichen image font verwenden also sagen jetzt malich will dieses icon haben dieses icon und und was ich firmen wir update icon so da kannman die sich enden und dann generierte einen image font der nur diese drei icons enthältund dementsprechend keine ahnung 800 byte groß ist oder oder kilobyte oder so das istdas ist richtig gut genauso aber dauernd web font safe kann euch mal zeigen wie das dannaussieht da sind dann verschiedene sachen drinne guckt mal allein schon gezippt istdas hier nur da sind verschiedenste formate drin erst mal was zum entpacken installierenkurz wo habe ich es denn so und da ist das zeug jetzt in verschiedensten formaten drinneund unter anderem gibt es ne 8 kilobyte datei oder ne 14 kilobyte datei die hat das quasials embedded css drinne sprich man muss noch nicht mal ein extra woops ok warum auch immerist es nicht offenhaft man muss es noch nicht mal als als extra datei laden sondern kannes quasi direkt im css embedden und man kann jetzt und kann die icons verwenden das istecht cool also man hat den man hat die auswahl oh mein wimm spektrum man hat die auswahlkompletten image font oder nur die image image die man braucht aus dem font also dasist eine super super geschichte probieren wir gleich mal aus aber ich mache erstmalein paar emojis hier rein dass das zumindest ein bisschen hübscher aussieht so was nehmenwir für firmware für firmware nehmen wir einfach den computer icon oder so exzellentso mein meine font config ist nicht so ganz on point würde ich sagen so logs dann habenwir irgendwie mal so noteblock und habe ich noch nie verwendet also wenn ich das entpackenwürde würde wollen dann würde ich einfach so machen ich habe nicht mal anzippen installiertwas ist was ist und habe ich noch nie hab ich nicht ausprobiert kenne ich nicht alsoich würde jetzt einfach anzippen installieren und das ding anzippen was mein ich installiertah ist installiert so ich würde es jetzt einfach anzippen und zack ist es da aber ichwollte ja gar nicht anzippen so logs nehmen wir mal hier so ein block so und für infonehmen wir mal info gibt es da so information jawoll ah das kenne ich das ist das icon waswir uns geklaut haben für das display so ok also kommen wir mal wieder zu sas jetzt habenwir ja schon eine super erstklassige navigationsleiste hier oben besser besser geht es ja kaum soalso was kann man damit jetzt machen genau ein vorteil von sas wie gesagt ist laut diesemwas wir gerade gesehen haben dass man das inline schreiben kann also das hier wäre ja nochvollkommen normal gültiges css bis auf diese variablen aber sobald wir das hier rein machennicht mehr so das ist das ist ein sas feature dass ich quasi die sachen an die stelle nestedschreiben kann wo ich sie brauche man sieht es hat sich nix geändert und unter der haubewenn man da mal in die styles reingucken hat er genau das gleiche generiert was ich vorherauch hatte was macht er denn hier was ist der unterschied zwischen sas und scss dasprojekt heißt sas ist die für ein esp projekt ich will für mein esp noch eine noch einewebseite machen ja deswegen habe ich jetzt diese diese punkt hier umgenommen aber dasgerade ist nur zum sas ausprobieren was möchte er denn hier ja genau also sas heißt dasprojekt und die haben zwei formate die haben sas und scss scss ist quasi ein superset alsoeine übermenge und wie heißt das auf deutsch keine ahnung von css also sprich du kannstjedes gültige css ist gültiges scss nur dass du in scss noch mehr machen kannst sas istein bisschen wie jammel mit einrückungen und gedöns also ich glaube die meisten verwendenscss ich finde ich finde das sas ein bisschen umständlich so mich jetzt gesehen habe weilich wenn ich css schreibe dann bin ich im kopf bei css und ich bei jammel einrückungendu kannst mal kannst mal verklagen wir haben noch hier noch einen vergleich offen wartemal wir haben doch noch einen vergleich offen genau das habe ich mich ja vorher auch gefragtoder hier auf der guck mal hier kann man so umstellen so sieht es als scss aus und sosieht es als als sas aus also in scss ist halt ein typisches css mit klammern und undsimikolon und hier musste halt auf einrückung achten dementsprechend kannst du auch dasdisplay nicht so schreiben sondern muss halt das display jammel style mäßig einrückenalso mir gefällt es ehrlich gesagt so auch besser so was will er denn hier von mir eigentlichdas sind irgendwelche browser prefix dinger braucht man das überhaupt im jahr 2020 nochbraucht man browser prefixes noch ich meine wenn man nicht gerade internet explorer 11und alle firefox versionen braucht man doch eigentlich gar nicht mehr das das könnensie doch eh alle es gibt doch keinen modernen browser metadata das niemand kann denn esnicht kann es macht einfach nur die seite größer kann man das ausschalten was sindbrowser prefixe das da also das ist wenn spezielle features noch nicht in allen browsersdrin sind oder wenn ein browser was unterstützt was andere browser nicht unterstützen oderwenn die was unterstützen was noch nicht standardisiert ist dann führen die das mit so einem jeweiligenprefix ein also zum beispiel minus webkit äh minus mozilla moment nee was ist dennder mozilla prefix webkit kann es ja nicht sein motz motz ok alles klar was ist der prefixvom ee der hat so was wahrscheinlich gar nicht oder was ist der prefix von random prefixe ms opera ist minus o ms aha alles klar ich sehe der chat ist wieder big brain big brainich unterwegs ok also das ist für safari das ach hier steht doch ms das ist für internetexplorer ja mozilla braucht das nicht einstelle für die extension live sass compile settingsauto prefix ah das ist gut das will ich nämlich rausschmeißen weil das das braucht mir einfachnur zu viel speicher und ich gehe da eh nur mit modernen browser drauf kartoffel 1503twitch prime ein neuer sub dankeschön huge massive big brain subscription so live sasscompiler wo steht da was von prefix moment ich suche einfach mal hier prefix ach hierguck mal auto prefix ok was was kann ich was kann ich da einstelle 0 ich mach mal die hilfeich mach mal die hilfeseite auf die grad verlinkt hast weil ich will das ausschalten auto prefixmit null zu turn off default ist null äh ne ne ne ne ne default ist nicht null defaultmacht er das ja gerade aber es ist immer noch drinach guck mal jetzt ist weg sehr sehr sehr nice ok wir haben es ausgeschaltet jetzt istder teil ein bisschen kleiner weil ich brauche keine browser prefix ich gehe da mit demneuesten chrome und dem neuesten firefox drauf und das war es vielleicht ja auch mit demopera gaming browser aber nicht nicht damit ist das nicht ein bisschen overkill weißich nicht es interessiert mich einfach wo wir wieder beim thema sind wenn ein sacheninteressieren ist das beste man lernt die weil man kann sie garantiert mal irgendwannbrauchen und man rutscht auch so in bereiche rein wo man teilweise noch gar nicht wusstedass da irgendwie äh was da so abgeht ach stimmt wenn ich es unleashed wollten sieja heute auch da muss ich mal kurz äh äh da muss ich mal kurz äh schauen das ist jadieser battlefield 3 mod der battlefield 3 wieder spielbar machen will das das das guckenwir uns äh das gucken wir uns hier nach an das gucken wir uns hier das gucken wir unswenn wir fertig sind an so also jetzt machen wir erst mal jetzt mal erst mal sagt vielleichtkann ich immer zig sachen gleichzeitig machen es hier ist max hat er merkt wie sein IQ steigtja deswegen habe ich das bild ja auch eingeblendet weil das wirkt sich natürlich auf mich auchaus sonst kann ich das kann man einfacher lernen hast du bist den ganzen tag im workmode exzellent oder eher nicht exzellent je nachdem ob es was gutes oder was schlechtesist so also was kann man jetzt sonst noch schönes mal ich meine das ist schon mal ganznett dass man so variable verwenden kann und dass man ähm die sachen inline schreibenkann das ist ja ganz nice moin captain peng was kann man denn sonst noch schönes damitmachen variables haben wir gemacht nesting haben wir uns angeguckt was haben die nochim beispiel drin stehen naja gut das ist ja im prinzip das was wir ausprobiert habenoh herring angular 2 das ist so ein ding da habe ich ganz viel ganz viel ganz großenbogen bisher drum gemacht habe ich auch absolut kein bock was was dran zu machen so was kommenman parcels ok da kann man die sachen aufsplitten modules da habe ich den sinn noch nicht gechecktvon mix ins da kann man quasi sachen inkluden also man kann quasi einmal sachen wenn ichdas so verstehe man kann einmal sachen schreiben und die dann an den passenden stellen inkludenund man muss ihn noch einmal schreiben extent man kann sachen erweitern operate dass mankann irgendwelche sachen berechnen lassen ich habe aber in dem video was ich habe mirso ein 20 minuten oder sass in 20 minuten video angeschaut und der typ hat also wirkönnen ja mal werbung machen ich habe mir das das video angeschaut und daraufhin habeich gesagt das muss ich mir mal muss ich mir mal näher angucken dass da sass in 20 minutenund er hat irgendein feature gezeigt dass man also was man ja gerne macht ist zum beispielich sowas ja hava so also sprich wenn ich jetzt über den über den link drüber gehedann dann dann sage ich zum beispiel text text decoration hier anderlei oder sowas und wennich da drüber gehe dann kommt halt so ein unter so so ein underscore strich so man konntedas irgendwie abkürzen und ich habe keine ahnung mehr wie er das gemacht hat das warpoggers wie er das gemacht und ein und war das genau syrien der ist der kennt sich aushier und genau und hat das gemacht das ist jetzt bei einem a natürlich ein bisschendoofes beispiel weil ein a ist halt auch nur ein buchstaben aber zum beispiel wenn mansowas hier hat sieht sieht schon ist so natürlich besser als als so ich glaube hat button überhauptund hava was nicht das das finde ich eigentlich ganz praktisch das war das feature war sielustigerweise das feature was ich im video gesehen habe was wo was wo ich gesagt habeich muss mir das mal angucken muss aber in klammern vom a wat nee geht doch auch soane moment wat achso ich habe jetzt hava gemacht für die gesamte nachbar ups verstehe ja dasist aber noch besser das ist aber noch besser weil dann steht es jetzt lokal beim a dabeidas heißt ich muss gar nichts mehr großartig suchen ich gucke mir mal das css an was derjetzt unter der haube generiert hat genau also man sieht schon okay ehrlich gesagt an derstelle sieht man das noch nicht dass man kürzer ist aber es ist auf jeden fall übersichtlicheralso ich finde das viel angenehmer wenn das hier in line drin steht bei der naf wenn manwenn man sich vorstellt man hat den man hat den kram später hat man irgendwie hier keineahnung 50 50.000 verschiedene dinger drin so und jetzt muss ich naf naf link elementesuchen so und dann finde ich hier war es dann finde ich da unten was und hier habe ich allesbei der naf zusammen stehen das hat das hat dass es deutlich kürzer ist sieht man jetztnoch nicht weil es noch so kurz also noch ist es noch noch sieht man den vorteil davonich aber ich glaube dass es später tatsächlich auch eine ganze ecke kürzer wird was mangebastelt hier so als was kann man noch schönes machen ist auch deutlich angenehmer zu schreibenja finde ich auch also ich finde auch man findet es besser so und ich sage das jetztso nach fünf minuten wie gesagt ich habe das mit noch nie großartig angeguckt weil esist ja auch in wenn irgendwelche sachen programmiert es ist immer praktischer wenn das eben ander stelle steht wo du suchst deswegen bin ich auch überhaupt kein fan von dass mandie sachen unnötig auf splittet also man muss keine metoden programmieren die irgendwiefünf seiten lang sind ja das muss nicht sein aber ich finde es besser man schreibt es vielleichtein bisschen länger und dafür hat man die wichtigen sachen die für die logik relevantsind an der stelle stehen wo sie verwendet werden als man macht noch mal fünf fünfuntermethoden irgendwie draus die nur an dieser einen stelle aufgerufen werden da muss manwild hin und her springen ohne dass man was findet ich habe mal einen webcast geguckteinen habe ich glaube ich schon mal erzählt ein ein konferenz talk von irgendem ruby guruhabe ich mir angeguckt und der hat erzählt dass er der meinung ist dass metoden die längerals eine zeile sind für ihn schon schlecht ist da habe ich mir gedacht was ist mit demtypos also besteht dem seine codebase quasi für in der hallo welt dann aus aus irgendwieerst bei 800 800 funktionen oder was total hängen geblieben ja und ich habe das wie gesagtso 2011 12 geguckt wo ich noch mit ruby on rails rum gewurstet habe und ich habe dasdamals geglaubt ich habe gesagt man muss das alles möglichst kurz machen und das hat dazugeführt dass man die sachen unnötig aufgesplittet hat also ich mache es immer so wenn man denmetoden also wenn man was extra hier in der eigenen metode dann immer erst wenn es entwedergar zu extrem lang wird oder was aber eigentlich die viel bessere variante ist sobald man esan mehr als einer stelle verwenden kann wenn man es nur an einer stelle braucht ist esmeistens am besten auch wenn es ein bisschen länger wird wenn man den kram an die stelleschreibt wo er gehört weil es hat doch wirklich keiner was davon wenn ich irgendwie keineahnung ich habe eine metode die was die was einliest sortiert und dann irgendwo hinschreibtwas man machen kann ist dass man die auf splittet in input sort output ok auch wenn das nuran einer stelle verwenden meinetwegen das leuchtet mir noch ein das ist klar strukturiertund so das geht aber man muss nicht anfangen dort dann quasi sort first items third seconditem oder sonst was raus zu splitten weil dann hat man das problem wenn irgendjemandversucht den kram nachzuvollziehen der muss erst mal durch 2000 zeilen so aus kultur springenbis er sich halbwegs zusammen gereimt hat was in deinem kopf vorgegangen ist als dudas gebastelt hastcaptain peng exakt so ist es mehr als eine zeile ist er hat nicht gesagt plotet dieserruby typ hat gemeint it's a code smell jaso weiter also das das finde ich schon alles sehr schick das das gefällt mir so also variablemaus für nestinger maus mit parcels parcels habe ich auch im video gesehen fand ich jetztpersönlich nicht so ultra toll also was man machen kann ist folgendes wahrscheinlich bringtes erst was wenn es größer wird also was man machen kann ist zum beispiel man kanndie teile in verschiedene dateien auslagern kann man es jetzt erst kompilieren lassenvom webserver also das machst du normalerweise bevor du das auf den webserver deploys ichmeine ich will nicht ausschließen dass es nicht irgendwelche big brain node gs webservergibt die das machen können das wird mich hinter mich wundert nichts mehr im java scriptökosystem irgendwo aber eigentlich würde ich darauf tippen man macht das vorher bevorman es auf den webserver schiebt so wie so wie irgendwelche webpack roll up bundle wases da nicht alles gibt warum gibt es eigentlich für frontend sachen immer 30 konkurrierendedinger das muss ja an sich nicht schlechtes sein aber die java script leute übertreibenist ein bisschen also ich muss sagen ich finde die webpack config ist abartig also das hatdas hat auch einer irgendwie so übelster menschenfeind sich ausgedacht die webpack config aber esgibt irgendwie auch wieder also mir mir fallen schon aus dem stehgreif zwei alternativenzu webpack ein und ich bin echt niemand dass ich frontend mäßig gut auskennt es gibtda noch parcel und es gibt noch roll up genau und es gibt java script typisch 50 anderedinger und das ist so ein ding was java script so ein eigenes java script ding es gibt zuallem 50 wenn wenn es mal reicht 50 verschiedene sachen und alles ist irgendwie beliebt undman man man steht dann davor und denkt sich so was de fuck was soll ich denn jetzt nehmendas ist auch eine sache die finde ich an vue js ganz praktisch die haben die wichtigstensachen dabei das heißt dann ist nicht die frage welche von 1000 routing libraries sollich verwenden oder so oder nehme ich einfach den eingebauten und gut ist eine sache dienoch ähnlich wo auch jeder was eigenes bastelt ist ls ls replacements also ls hier ls replacementsihr müsst mal auf github nach ls replacements suchen übrigens das ist das finde ich eigentlichganz gut hier es gibt bestimmt 150 ls replacements hsu zehn monate dankeschön für den sup exquisiteso machen wir mal weiter ich wollte jetzt ich wollte jetzt das mit mit mit parcels ausprobierenwas in der unterschied zwischen ach moment das geht nur mit mit das geht nur mit mitdarts ok dann müssen sie es gar nicht angucken da lobe ich mir doch jquery da gibt es wenigstensnur eins wobei das stimmt gar nicht es gab es gab früher auch noch zepto oder wie dashieß so als jquery alternative es gab es gab es gab zig dinger jquery war damals daserste so 2000 frag mich nicht zwei oder so so also parcels also sprich man kann jetztzum beispiel diese variablen auslage in der eigene datei da bin ich mir unschlüssig wiesinnvoll das ist also man kann jetzt folgendes machen mal angenommen ich hätte hier um 5050 milliarden variablen gesetzt und das wird mir zu unübersichtlich dann könnte ich sagenok ich nehme alle meine variablen und mache eine eigene datei die ich keine ahnung warpunkt scss nenne da schreibe ich das jetzt rein und dann kann ich hier oben sagen includeuse was include oder use use use und dann irgendwie war oder einfach nur war genau ihr sehtes hat sich nichts geändert kann man einfach nur war schreiben geht das auch exquisiteso jetzt kann ich quasi die variablen in kluden hier an der stelle hast du schon woman wo man ist absichtlich falsch geschrieben wo man als man ersatz da habe ich nicht undich bin ja auch ich bin ja auch ganz also ich verwende ja auch post man anstatt post womanoder so wie das wie der ersatz hieß davon geht ja gar nicht aber das war einfach daserste programm in dieser richtung was ich mir angeguckt habe das macht alles was ichwill so also sprich man kann den kram in kluden was glaube ich ganz nützlich ist wenn manmehr hat also wenn ich jetzt ich könnte mir durchaus vorstellen wenn ich ein bisschenkomplex der webseite habe dann habe ich da schon mal so was weiß ich 20 30 variablenoder vielleicht auch 100 weil ich weiß keine ahnung so komplizierte dinge habe ich nichtgemacht dann ist das ist das glaube ich ganz gut wenn man das auslagern kann wo es bestimmtauch ganz nützlich ist wenn man verschiedene wenn man irgendwie verschiedene farbvariationenausprobieren will ja ich glaube das ist echt ganz praktisch mal angenommen ich möchtejetzt global webseitenweit blau anders anders machen dann gehe ich immer variablen fileund sagt nee ich will lieber dieses blau und zack ist überall oder auch nicht ich mussdoch punktslash machen oder nicht import echt aber die schreiben hier use import ah hierja aber warum schreiben die hier use wenn man das mit import macht das für einen schwachsinnbut why also wenn die offizielle seite schon so mehrdeutig ist ist das nicht gut oderich verstehe nicht was die schreiben quai 1 neun monate auch wieder am start exquisitesubscription ok aber man hat gesehen es funktioniert also sprich wenn ich jetzt hier das blau wiederzurück obs das blau wieder hallo wieder zurück enda auf das hellere blau dann wird es auchwieder hell ach das ist use und und s css ist echt ok ja gut das ist ich nehme es malzur kenntnis dass das so ist aber ich finde es halt doof dass sie das hier nicht geschriebenhaben jetzt einfacher gewesen so ja das ist schon mal ganz nützlich so also was man jetztauch machen könnte es also bis jetzt mal total übertreiben ich könnte jetzt auch so washier machen new file knapp punkt s css und da würde ich jetzt quasi meine komplettenav bar reinschieben und dann würde ich in meinem main css sagen import nav genau sodas ist wahrscheinlich sobald die seite ein bisschen größer wird ganz ganz sinnvollaber ich glaube das ist auch so ein feature was man nicht verwenden sollte einfach nurum es zu verwenden sondern erst wenn es anfängt unübersichtlich zu werden zumindest ist daszumindest ist das meine erfahrung so mit letzten jahren gewesen es gibt es gibt so ein paarguidelines die die teilweise schon so fast so so so irgendwie religiös gefolgt werdenso nach dem motto du musst super jetzt müssen wir mal was einfallen du musst alle zum beispielsp.net kurse nach dem motto du musst alle deine models in einem model ordner schreibendu musst alle deine controller jeweils einzeln in einem feil haben oder irgendwie ich glaubebei controller geht es gar nicht anders wegen irgendwelche reflection geschichten oder dumusst deine db kontexte immer in eigener ding also ich bin der ansicht dass es alles schönund gut aber man muss es für kleine projekte nicht übertreiben also man muss kleine projektedie irgendwie nur 300 zeilen lang sind nicht aufsplitten in zehn feils nur weil das lauthersteller best practice ist wenn es noch so klein und kurz und übersichtlich ist dasses alles in einen feil passt finde ich spricht da überhaupt nichts dagegen das ist ja solcheempfehlungen die die davon herstellern kommen die sind ja auch im hinblick darauf dass dasempfehlungen sind die allgemein gültig haben allgemein gültig sein soll also sprich dasswenn es der irgendwie eine super krasse business enterprise anwendung macht dann ist das natürlichsinnvoll sowas zu machen deswegen ich denke man sollte die sachen eigentlich immer erstdann machen wenn man selbst merkt dass es nervig wird also stellt man fest ok das zeug wirdmir jetzt zu lang zu unübersichtlich dann mache ich vielleicht eine extra klasse rausok das zeug wird mir jetzt zu lang zu unübersichtlich ok dann split ich vielleicht auf in ja wasgibt uns jetzt html oder es wird mir zu unübersichtlich dann mache ich vielleicht den db kontext ausmeinem start-up raus oder irgendwie sowas ja manche sachen sind allerdings tatsächlichsinnvoll wenn man das macht weil bestimmte sachen sucht man halt an speziellen stellenja zum beispiel sucht man in einem asp.net projekt immer eine start-up punkt s h ähman kann das anders konfigurieren aber das macht niemand und deswegen verwirrt es dieleute unglaublich und ein selbst wenn man sich das halbes jahr später wieder anguckenmuss wenn man in in main irgendwie seinen start-up konfiguriert anstatt es da da punkts zu haben aber was ich damit sagen will ist einfach man muss die sachen nicht unbedingtnur machen weil irgendwie einer gesagt hat in einem webcast oder so das ist super oderweiter hersteller sagt das ist super ich ich handel es mittlerweile so dass ich viele sachenso macht wie es mir am saubersten vorkommt und da ist halt vieles geschmackssache aufder anderen seite wenn man sachen im team bastelt ja dann sollte man natürlich guckendass alle so ungefähr das gleiche machen also es hat zum beispiel keinen sinn wennirgendwie einer styles mit das macht und der andere mit scss das ist bescheuert wenn ihralleine da dran rumwurstet und euch gefällt das besser dann nimmt das und drauf geschissendass stss das verbreitete ist warum nicht ja ich müsste ich müsste mir da mal ein bisschenmehr da gibt es da gibt es bestimmt viel bessere beispiele als die die mir jetzt gerade eingefallensind wo immer gesagt wird das muss das muss man so machen und das wäre total anti petanti pettern ist auch so ein komisch so geiles wort wenn man das so und so macht ich habeich habe schönes beispiel ich habe schönes beispiel es gibt in asp.net core was das nenntsich so was man damit machen kann i hosted service ist im prinzip eine einfache varianteum um hintergrund sachen um sachen im hintergrund laufen zu lassen ich muss jetzt gar nichtso sehr im detail eingehen was was sie da eigentlich genau machen aber es ist relatives ist relativ das ist wieder typisch ms beispiel dabei ist das übelst easy as fuck hallodu machst eine klasse implementierst zwei metoden start stopp das war es mehr musstdu nicht machen so also zumindest wenn man nicht gerade so ein riesen fettes ms ms beispielms beispiel basteln so und jetzt kommt ja irgendwann mal der fall dass man sagt ok also zum anwendungszweckfür so einen für so einen hintergrund service ist zum beispiel irgendwelche sachen die alsgelöscht markiert sind rauszuwerfen oder im hintergrund irgendwelche neuen sachen voneiner web api abzurufen oder sowas oder emails ja emails newsletter versenden was auch immeralso irgendwas was asynchron im hintergrund passieren muss so und da gibt es so eine regeldie sagt man sollte nicht und die schreiben halt nicht man sollte nicht sondern die schreibenhalt schon fast man darf nicht man sollte eben nicht aus diesen hintergrund diensten auf diedatenbank zugreifen was aber in vielen fällen gar nicht anders geht und ich habe am anfang auchgedacht immer alter max kannst du das da nicht einfach aus dem hintergrund dienst auf diedatenbank zugreifen und das ist ja voll antipattern aber warum denn nicht man muss sich einfach nurgedanken machen was man will weil die andere lösung wäre man müsste übelst komplizierteszeug basteln dann müsste irgendwelche vier fünf zusätzliche klassen in der dependencyinjection registrieren dann müsste man gucken dass das eine in das andere injectet werdenkann nur dass man dann irgendwie also total total wir wenn man einfach nur den status in derdatenbank markieren will warum soll man das nicht aus dem hintergrund dienst machen letztendlichmuss es ja irgendwo gemacht werden und warum nicht an der stelle wo es anfällt die schreibenhalt bei ms so nach dem motto nein man sollte auf gar keinen fall auf die datenbank zugreifen aberes geht halt nicht anders und bevor man da jetzt fünf neue klassen und 500 zeilen code basteln nurdass man das an dieser einen stelle nicht machen muss macht man es halt einfach spricht überhauptnichts da es spricht wirklich gar nichts dagegen und ich habe mich früher viel zu sehr an solchenoffiziellen das macht man nicht gerichtet obwohl es an vielen von vielen stellen einfach tatsächlichdie einfachste lösung ist und die übersichtigste lösung so aber machen wir mal weiter was kann mansonst auch schönes machen in sass modules gibt es nicht parcels haben ausprobiert mix ins ok jetztjetzt wirds big big brain time mix ins kommen wir machen wir machen erst noch mal unsere unserenav navigations leist irgendwie bei was kann man da können wir da irgendwie auch ich habeeine idee wir können auch wir machen und border border border wie man konnte border in einemschreiben 2 pixel solid und dann irgendwie black oder so ok das sieht mega kacke aus aber wir habennoch eine variable gemacht für background background ist weiß moment background ist das gleiche wiehier ne da kann ich mir das eigentlich sparen exzellent aber wir können sagen border radiusund da machen wir fünf pixel dann sieht es ein bisschen apple styliger auch abgerundet aus undbody machen wir mal padding zehn pixel dass man was sieht exquisite abgerundete eckensona gut ich habe noch eine idee wir könnten auch eine sache mal probieren habe ich habeich roboto oder so installiert da machen wir mal von family moment habe ich das nicht woandersschon stehen von family ach hier habe ich aber von family hier raus dann sieht es jetzt erst mal kurzkacke aus roboto hier habe ich den installiert what apples what the fuck ok alles klar was istdas für ein komisches preset apple system blink mac os ok wunderbar so lassen wir das perfektkeine ahnung was es eigentlich jetzt was es alles macht kein java script framework bis jetzt daswird keine website ich will mir einfach nur angucken wie es das funktioniert das wirdnichts fertig die animation ist kaputt leute brain brain explodiert aber ein browser istabgeschissen erzhaft wow der browser ist verreckt warum ist what the chat wer von euch ist dasein in wer war es ja ja schon ok chat schon ok warum wird eigentlich dieses gift so schnellabgespielt alle an alle anderen gifs vollkommen ok von der geschwindigkeit her aber dieses gifhyper shit stimmt wir können das gift noch sentern was ist denn der neueste css big brainwieg dieses gift zu sentern also ich würde jetzt sagen text center aber das ist bestimmtnicht mehr best practice wie es so schön heißt also also man könnte man könnte jetzt ja sowashier machen text allein center aber das ist bestimmt nicht die justify content center aberda muss ich sagen display flex was denn flex oder flex box was ist der unterschied zwischenflex und flex box ist das gleich in ne kann er nicht sein flex macht das und flex box machtdas oder im moment gibt es flex box vielleicht in meinem browser nicht ach nee flex box gibt'snicht aber um steht es dann hier drin visual studio ist gebadet ok so aber jetzt habe ichja alles so komisch gesendet was muss ich jetzt machen ich glaube ich muss mir mal ein flex boxtutorial angucken das funktioniert nicht der eierkopf muss in ein extra diff dann funktioniert dasnee hast du firefox ja habe ich was soll ich da sehen guide to flex box exquisite und aufdas diff dann die klasse setzten was welche klasse flex direction excellent ok jetzt istaber immer noch nicht in der mitte aber wahrscheinlich muss ich jetzt das diff wiederweg machen ha ha exquisite ich finde es fast noch besser so das alleinnee aber vielleicht muss ich justify ich finde es noch viel besser ich lasse es so ich lassedas so wahrscheinlich muss ich dem eine breite geben könnte das sein dass irgendwie sowasaus nee was allein center fehlt was denn welches allein allein content allein was allein itemscenter ja aber dann ist sie nachbar auch in der mitte nur ok ich werde ich werde mal ichmuss mich mal mit mit der flex box geschichte beschäftigen in der zwischenzeit werde ichmal folgendes machen auch wenn das auch wenn das absolut old school ist aber da weiß ichdass es funktioniert ich lasse es jetzt erstmal so ich war ja ich weiß dass ich alles alleineaber ich habe davon kein plastenschimmer gesagt ich bin nicht der ultra frontend kenner ichlasse es jetzt erstmal so wir gucken wir wollten eigentlich das angucken und nicht how toallein gif aber ist ja allein es ist jetzt es ist exquisite im center ok moment youtubewas flex box flex box in 15 minutes nee ich gucke mir das an weil von dem habe ich schondas sas tutorial angeguckt das fand ich auch ganz gut das gucke ich mal zum einschlafenauf dem tablet an und dann bin ich morgen ultra frei fährt und kann flex box easy ausdem kopf auswendig einfach einfach pro tip einfach sachen vorm schlafen angucken dannkann man sich das alles immer gut merken wann kommt css krit ich glaube sein flex box istkrit total outdated ich weiß das dann morgen auch nicht aber ich finde trotzdem jetzt ohnemist also ich finde ich finde wirklich dass es hilft wenn man also ich ich merke mir sachendie ich mir vom form die ich mir zum einschlafen angucken besonders gut so also mix ins wasmachen für mixins transform oh jetzt wird es aber exquisite big brain was machen diedann hierich muss es jetzt mal ausprobieren ich habe also ich vermute mal ich vermute mal dass dashier so eine art funktion ist die man die man quasi hier inkluden kann also sprich ichkann die nicht ich muss sie nicht in box inkluden ich könnte zum beispiel auch in body inkludenaber mal und alles mein body 30 prozent schape exzellent dann ist doch auch mal was ich findeso sollte man das lassen so viel weil das geht ja schon fast als moderne kunst durchok ich glaube ich habe es kapiert ich glaube ich habe es halbwegs ich habe es halbwegsgecheckt das heißt ich probiere ich probiere also man könnte quasi so was hier machenso highlight und dann und dann sagen wir text text wird rot im highlight oder text wir habenso eine variable für warning gemacht also sagen wir color ne mal mal fg ne momentne color color color ne gibt es nicht auch fg ne das gibt es nicht und foreground gibtes auch nicht ok ist color und dann irgendwie warningtja was machen wir dahinten als argument keine ahnung ich habe eine idee text boltbei gibt es das war aber noch mal war das hier text bolt wie macht man die text textweight font weight font weight bolt exzellent ja bisschen undurchsichtig ist es manchmalschon so und dann sagen wir so was hier wie genau size und wie war das jetzt dollar sizeso also das heißt wenn ich das jetzt richtig verstanden habe ich mache das mal hier obendrüber ich kann das jetzt an verschiedenen stellen verwenden also mal angenommen ichmöchte jetzt meine navigationsleiste oder hier von meinem link soll die schrift fettund in bolt sein dann sage ich include include oh wir haben sogar auto complete highlightoder sowas wie bolt ah yes ok kapiert ah stimmt wie sieht es mit default parameter aussowas sowas nee gibt sie fault parameterdefault values passiv passiv default value for mixins oh man kann if else darin machenwhat if else aber das kann man noch gar nicht dynamisch ok nee da könnte ich sowas sagenwie wenn border size von dem jeweiligen element wo ich das mixin drauf anwende wenn das größerals sowas ist dann möchte ich keine ahnung den den border durchsichtig machen wenn eskleiner ist bin ich da irgendwie sowas es gibt auch bestimmt die fault arguments optionalarguments doppelpunkt was ist s css s css ist ein super set von css also sprich du kannstalles machen was du in css machen kannst nur noch mehr doppelpunkt ist das ok ah es funktioniertdas ist praktisch das ist wirklich praktisch das ist echt praktisch also sprich wenn ichjetzt was übergebe kann ich jetzt die klammern weglassen ach noch besser also sprich okich meine in dem einen fall ist jetzt natürlich überflüssig da könnte ich das ja auch reinschreibenaber man muss ja davon ausgehen dass man das auf mehrere dass man das auf mehrere objekteanwenden will na also mal angenommen ich hätte irgendwie noch ups mal angenommen ich hättenoch irgendwie einen button oder so weißt du um teufel wischel zu dir was machst dudenn da also mal angenommen ich hätte noch einen button und ich hätte dann irgendwienoch was irgendwie noch anderes zeug da könnte ich dann auch hier sagen include highlightund er würde er würde die sachen bolt und in warning color machen das ist echt praktischbenötigt man für workstation pro 16 einen neuen key wenn man ein 15 ja immer aber ichglaube es gibt relativ günstige upgrades ok das ist das ist echt das ist echt nützlichdas finde ich gut so wie sieht das mit if else aus das muss ich mir jetzt nochmal anguckenfunction sonst was ok es wird noch deutlich big brain brainiger was man machen kannman kann man es gibt schleifen ok aber das ist ok das ist ja ein pre processor das heißtman darf sich nicht jetzt irgendwie denken man könnte dort dynamisch irgendwelche sachenmachen während der user resized im browser das kann ja nicht funktionieren wenn es wennes pre pre process calculated ist also sprich diese sachen laufen nicht zur runtime alsowenn ich jetzt meinen browser resize kriegt da s css absolut nix von mit das heißt esist auch nur beschränkt nützlich ich war man könnte damit vielleicht verschiedeneklassen vor vor generieren also mal angenommen man möchte jetzt irgendwie eine tabelle oderirgendwie den krit mit bis zu 20 elementen und man generiert sich quasi für jedes elementirgendwie einen passenden style vor oder sowas ja aber ich glaube das ist ich glaube nichtdass man das so oft verwendet glaube ich glaube nicht dass man das so oft verwendetwenn du was dynamisches brauchst css custom prob was sind css custom properties erst einmalich bin überhaupt nicht auf dem also die wahre css variablen sehr die kenne ich diekenne ich wusste nicht dass die custom properties heißen ich dachte immer css variablen fürja die kenne ich kenne ich so also das ist ja schon mal an sich ganz nice was was kannman da sonst noch jetzt schönes machen es gab da noch die möglichkeit das zeug irgendwiezu erweitern irgendwas mit extent gab es dann noch extentwas für was ist das prozentzeichen da vorne dran also mein extent was macht prozent wasmacht ein prozent in css ich kenne punkt ich kenne raute ich kenne einfach nur elementaber was macht denn was macht denn achso das ist eine sassgeschichte placeholder selektorachso jetzt verstehe ich also sprich diese sache landet nicht im css es sei denn ichstände sie das ist quasi so eine base class um es war so ganz abstrakt zu sagen oder abstrueckbase class sogar noch besser das ist quasi irgend so ein ding von dem ich von dem ichextenten kann die aber alleine nichts macht also sprich die taucht nie im css feil aufsondern es taucht nur message im css feil auf das ist doch dann aber quasi ein bisschenso was wie ein mixin oder große unterschied dazwischen ist jetzt ja nicht mixin hat parameterja richtig aber ich meine ich könnte ja einfach auch den mixin ohne parameter verwenden oderok ich glaube das ist so ein feature man weiß wenn man es braucht und dann kann man es verwendenalso man steht irgendwann mal vor einem problem und denkt sich ach da wäre das für ganz gutdann verwendet man es wählt es da grad nichts zu ein aber das mit extent können wir nochmal ausprobieren also sprich mal angenommen ich komme jetzt auf die glorreiche idee undfinde meine navigations bar so geil dass ich die extenten will da könnte ich dann so washier machen kann sup naf extent naf ne noch oder so und jetzt und jetzt könnte ich quasinoch mal eine naf bar machen als diff und dann sagen class sup naf ohohoho magic ichhabe meine naf leiste geklont exquisite so und da könnte ich jetzt auch noch was änderndrinnen und ich könnte zum beispiel sagen ja ne aber hier will ich jetzt color wiederblack haben ne das funktioniert nicht ach moment das ist ja auch in dem art drinne dasmuss ich hier machen ach ne ich überschreibe das ja hier ne das ok das funktioniert nichtdas funktioniert nicht wie ich mir das gedacht habe aber prinzipiell also was ich zum beispielmachen könnte ist sowas wie hier will ich jetzt border border color black so und danndie momentan machen wir border 2 pixels solid black so geht das na genau und jetzt ist nurdie jetzt hat nur die einen rand und schwarz aber erbt alles andere also sprich das hovererbt die von hier oben und so ok das das stelle ich mir auch äußerst praktisch vorwenn man zum beispiel irgendwelche forms formelemente hat oder so die hat man ja vielleichtauch in drei vier verschiedene formularen und man möchte mehr oder weniger immer dasgleiche stylen bis auf ein paar kleinigkeiten unterschied das das klingt das klingt eigentlichganz sinnvoll ja ja ich probiere jetzt konnte man nicht konnte man nicht color überschreibenmit sache red und jetzt irgendwie important beim nee ach nee das geht nicht das geht nichtdas geht nicht weil das in dem art drunter ist ja aber schon mal nicht übel exquisiteim großen und ganzen jetzt mal so an die sas kenner im großen und ganzen war es das glaubeich halbwegs oder also ich meine klar im detail gibt es da noch deutlich mehr also ich habejetzt gesehen man kann schleifen machen und und nur irgendwie fangt schon sachen auf aberso im von den funktionsbereichen her war es das im großen und ganzen das ist eigentlichziemlich easyja man kann natürlich noch 30.000 andere sachen machen aber so von den funktionsbereichenher habe ich den eindruck ist das ziemlich übersichtlich das finde ich gut ich glaubedas werde ich mal bei der nächsten sachen verwenden wir werden in einem der nächstenstreams das dashboard bauen für den esp 32 für nehme ich genau das wlan einstellungfirmware update und locks angucken weil aktuell geht das nur über karl befehle was vielleichtjetzt nicht jedermanns geschmack ist letztendlich für mich kein problem also ich mache es lieberüber den karl befehl und letztendlich ist es eigentlich rausgeschmissene zeit insofernweil ich eh der einzige bin der die sachen hier bei mir daheim verwendet aber ich glaubeich finde es auch ich würde es auch ganz angenehm verwenden ganz angenehm finden wennich zumindest verwenden könnte um wifi settings zu zu ändern übers web interface ich habees ja aktuell so gebaut auf dem esp 32 dass der zwei verschiedene oder bis zu drei verschiedenewlan durchprobiert der probiert default wlan aus was er direkt eingestellt hat und gucktbis in bis bis zu in zwei json dateien auf dem flash nach ob der weitere wifi settingsfindetwie es ganz schöne dashboards brennen ja aber ich glaube ich mache das dashboard nicht nichtin die chairs weil ich habe nicht so viel flasche und ich will da wirklich alles möglichsparen ich wollte mir das hier mal angucken weil da wohl relativ kleine falls rauskommenoder im zweifelsfall einfach die sachen von hand ja was krippen braucht ja nicht so vielwie groß wie groß ist der view js min und das ganze geht zippt zeigt mal her muss malgucken vielleicht vielleicht ist meine bedenken da auch unsinnig ist das die minifight varianteguck mal wie groß das ist so 91 k geht zippt oder mal ich muss ich ich blende das mal kurzum so es ist auf jeden fall die minifight variante geht zippt das ganze wie groß 33k naja gut dasgeht eigentlich noch aber auf der anderen seite sind es 33k umsonst die die ganze webseite istvielleicht 5k oder so ist aber also die sassgeschichte gefällt mir ich mag egen ich mageh allgemein so dinger die man innerhalb von paar stunden den überblick hat und halbwegs weiß wassie was sie machen also nicht so was wie z++ zum beispiel oder gar cobalt also ich weiß ja dassich an weihnachten ein bisschen cobalt programmieren muss ja das hat mich dann der chat dazu schonüberredet und ich ich predikte jetzt schon mal eine sache cobalt werde ich wahnsinnig eklig undoldschool finden aber ich finde es wahrscheinlich trotzdem besser als z++ weil weil einfach fastalso es gibt eigentlich kaum was was schlechter ist insofern wahrscheinlich sogar cobalt gefälltmir noch besser als z++ es wird echt mal zeit dass man sp 2 nacht 32 und 86 sinnvoll in wasandere programmieren kann es gibt schon zig projekte aber wirklich sinnvoll ist es nur möglich inc++ leider jo ja chat das ging schneller als gedacht rast embed ja es gibt schon ein paarversuche dafür es gibt auch schon so experimentelle sachen für sp 32 aber das ist halt weit davonentfernt dass sie wirklich wirklich gut benutzbar ist und ich muss halt sagen rast ist auch so einding das ist schon so ein bisschen big brain ja aber guck mal der browser hat wieder denlöffel abgegeben rast ist teilweise aber auch nicht schön zu lesen also rast hat schon einbisschen also rast ist anders anders merkwürdig als z++ z++ ist merkwürdig weil es an vielenstellen einfach total inkonsistent ist und man das gefühl hat das cremium will ein verarschen sound bei rast ist es so man denkt permanent man ist zu dumm für ich glaube ich glaube das habeich ganz gut beschrieben ok ich habe das jetzt mal zugemacht warum auch immer das jetzt gecrashtist bei rast denkt man permanent man ist zu dumm für und bei css bei z++ denkt man permanent dascremium will ein verarschen und ich finde die rast sonntags jetzt auch nicht die schönste diebesteht die besteht mir aus ein bisschen viel spitzen klammern denkst du dir irgendwann nochmalwas für channel points aus ja das mache ich dann wenn ich mir auch neue emotes hole aber spaßbeiseite ich habe wirklich vor nachdem ich jetzt ja auch gerade wieder viel streamen und ich weißrecht und öfters gar ich will mir wirklich jetzt channel points besorgen nicht channel pointsordentlich emotes besorgen wir haben ja schon eine riesenliste gemacht mit emotes ich habeja glaube ich noch 25 emotes frei oder so massig ja ja go finde ich auch ganz ok die haben aberauch ein paar merkwürdige entscheidungen aber ich habe schon eine weile nichts mein go gemacht dassich mich jetzt ich kann mich jetzt nicht so sehr drüber zum beispiel die sache dass es keinegenerics wollten und jetzt doch irgendwie wie man sowas nicht wollen kann ist mir auch unbegreiflichgenau das gibt es nachdem ich mit dem youtube video fertig bin ne aber emotes ich habe wirklichalso die die wie soll ich sagen sie wirklich die absicht emotes zu machen jetzt peißen im streamwäre nice ich bin kein großer peißen nicht fern kenne aber ich habe letztens was gemachtda drin und es war sehr angenehm muss ich sagen ich sollte auf der arbeit jetzt istihn auf letzten drücker wieder eingefallen ich sollte also es kam es kam es kam immer zu mirund hat gefragt ob ich die dhcp konfig geht peißen auf dem esp 32 theoretisch schon abermit einschränkungen also es gibt micro peißen das geht ganz gut aber du hast du hast ein paareinschränkungen die du mit c++ nicht hast zum beispiel wenn du den ssl webserver laufen lassenwillst oder so hast du nicht genug ram das geht mit c++ geht zum beispiel zumindest da sindauf der arbeit zu mir kommen das wird auf letzten drücker eingefallen haben sie mich gefragt okayob ich ihnen nicht irgendwie eine linux dhcp server hinstellen könnte mit der konfig vomwindows dhcp server habe erst mal das kannst du vergessen im windows dhcp server stehen 30milliarden sachen die du wahrscheinlich mit so einem ics gar nicht abbilden kannst so und irgendwannhaben sie dann gesagt ja okay verstehen wir es würde ihnen einfach reichen wenn man die zonenund die reservierung umzieht und am ende haben sogar noch gesagt die reservierung braucht mangar nicht einfach einfach alle dns ranges so und da habe ich so ein mini python script gebasteltkeine ahnung 30 zeilen oder so was des den windows dhcp export um konvertiert hat indhcp linux dhcp server konfig und ich muss sagen das war echt angenehm das in peißen zumachen weil die haben alles mögliche dabei die haben sogar einen ip calculator dabei also kannstsogar du kannst die haben in der standard library den ip calculator bei wo du quasip-adressen sachen dazu rechnen kannst ihn abziehen kannst weil bei der gelegenheit ist mir natürlichaufgefallen weil sonst guckt da keiner drauf dass die ranges im windows dhcp falsch angelegtwaren die haben die ranges inklusive gateway angelegt normalerweise müssen so eine rangeanlesen anlegen nach dem gateway dass das funktioniert liegt einfach daran dass derdns vorher checkt ob die ip doppelt vergeben ist aber ich wollte keine konfig bauen die quasiin sich schon falsch ist so und deswegen habe ich einfach die range genommen das netz angegebenund mit diesem eingebauten ip modul die ip 1 hochgezählt weil ich wusste ok range startist immer der gateway und range start plus eins ist die erste dhcp range und das warhalt echt praktisch meine haben ein ip address calculator eingebaut die haben einen csv readereingebaut der windows export war übrigens csv weil ich weiß nicht was im jahr 2020 alle noch mitcsv haben gut ich meine es könnte noch schlimmer kommen es könnte auch xml sein aber mal ganzehrlich csv ist schon ist schon es dicht gefolgt auf xml also wer hat kein csv reader also mirfallen jetzt wenige atmosphere fällt jetzt aus spontan keine programmier sprache ein die inder die in ihrer standard library einen csv reader dabei hat dort net hat kein csv dabei ruby hatstandardmäßig glaube kein csv dabei go hat standardmäßig kein csv dabei sehr gut zählenvon 10 plus reden wir schon mal gar nicht hat stande mich kein kein dabei so sachen wie bashnatürlich ähnlich note also ja was gibt auch nicht also mir fällt außer heißt keine spracheein die standardmäßig einen csv reader dabei hat bei ruby bin ich mir nicht sicherok ruby hat ein dabei ok ruby hatten ein csv reader dabei alles klarwas go hat echt ein nades glaube ich nicht go hat auch standardmäßig kein csv reader dabeiernsthaft wirklichne package ist das jetzt das ist auch so ein ding was mich an den go documentsnervt ist das jetzt standard library oder ist es irgendwas custom das ist nicht schlechtna gut dort net hat zumindest keinen das weiß ich da musste ich mit irgendwelchen komischendingern rumschlagen die nicht gut funktionieren so note also note hat höchstwahrscheinlich auchkein weil note standardmäßig sehr wenig dabei hat ja auch kein ja gut ist jetzt auch egal zumindestich fand es gut dass die sowohl in alpea trust calculator dabei haben als auch in den csvreader das war wirklich praktisch kannst du dir im stream mal alternative datenbank systemanschauen ja aber ich weiß ich ob also ja ich wollte mir immer ein bisschen mehr sachen anguckendatenbank technische nächsterzeit aber ich weiß nicht ob das so interessant ist im stream weilich muss dir ehrlich sagen ich bin schon so ein bisschen datenbank noch auch teilweise was dasangeht weil ich verwende zu 95 prozent sq light so und ab und zu mal so was wie reddis das war esalso ich glaube ich habe ich überleg gerade habe ich schon mal für mein zeug was anderes verwendetalso wenn ich eine richtige datenbank bräuchte will ich postkurs verwenden aberalso ich habe gut ich meine du kannst ja mehr oder weniger das sql von sq lite auf postkursdas kannst ja kannst ja verwenden aber ich glaube ich habe für mein zeug noch nie wasanderes außer reddis und also reddis und und sq lite verwendet a craft ql craft ql habe ichauch schon verwendet aber das ist das zählt ja nicht nicht so wirklich als daten das isteher so ein aufsatz oft doch doch ich habe schon mal postkurs mit craft ql verwendet korrektstimmt da gibt es nämlich ein plugin was die datenbank per craft ql zugreifbar macht das habeich für unser routing routing planungsding verwendet ja ja doch genau stimmt da habeich aber ich habe noch nie wirklich von meinem zeug was ich hier daheim zusammen gewusstethabe zumindest noch nie richtig echte datenbank verwendet brauche ich auch meistens nicht beiden eins zwei drei maximal fünf usern oder so aber aber craft ql ist wirklich sehr nice soein alex drei monate exquisite subscription dankeschön hugeja go finde ich tatsächlich nicht schlecht also ich finde ein paar sachen fragwürdig ja alsoaber nicht so fragwürdig dass ich ich habe mir noch keine datei angelegt warum go sagt ichhabe für ein paar programmier sprache in allem voran c++ eine extra text datei wo ich mich immerwo ich immer sachen die mir auf den sack gehen reinschreibe für den fall der fälle dass michirgendwann mal jemand fragt max warum findest du c++ immer so kacke so und go hat es bisher nochnicht geschafft dass ich mir so eine datei angelegt habe das heißt ich kann gar nicht soschlecht finden was ich in go gemacht habe bisher ich habe in go eigentlich nur eine sache bishergemacht das ist ein web cam überwachungskamera schrägstich web cam übersichtswebsite und derteil was diese videos macht ist in go weil es die einzig sinnvolle library dafür in go gibtdeswegen habe ich damals mit go angefangen und die erste variante war eine mischung aus c und goc weil ffmpeg und die ffmpeg bindings für go hardcore gesackt haben als ich es ausprobierthabe so die ffmpeg variante war in c und übrigens das ist auch eine doch das ist auch ein punktder mich an go stört dass der interop mit c komplizierter ist als er sein müsste und auchperformance mäßig viel mehr performance braucht als es eigentlich sein müsste das war eine sachedie mich an go gestört hat also c interop war nicht schön die go philosophie ist schreibteinfach alles in go das ohne miss das ist die offizielle go philosophie interop mit anderensprachen warum brauchen wir nicht einfach alles in go neu programmieren das das sagen die goleute das ist natürlich massive big brain weil einfach mal jeder der ein bisschen video brauchtjetzt mal kurz ffmpeg neu programmiert ist klar ja allerdings man muss sagen go programmierersind immer besonders stolz darauf wenn ihre sachen in go programmiert sind es gibt soviel software ihr müsst mal gucken auf auf self-hosted wo das angekündigt wird oder auchauf auf auf github die einfach nur gemacht wird damit man dran schreiben kann written in go soirgendwie dass das 150 programm was das gleiche macht wie alle 149 anderen programme auch aberwritten in go dann ist das natürlich gleich viel besser nur weil das written in go ist beirust ist es übrigens genauso es gibt auch viele sachen die neu implementiert werden einfach weiles geht und dann steht da written in rust von 10 minus minus gehört nein aber von holy see habeich schon mal was gehört ich weiß dass ich mir die viennese unleashed angucken wollte es guckenuns klar hab ich das irgendwie wieder zugemacht ja und eine sache die mir auch noch in go aufdem keks ging gucken wir uns gleich an ich bin ja bin ja echt mal gespannt drauf ich muss aberdas erst noch fertig fertig erzählen wo bin stehen geblieben genau eine sache die mir auchnoch in go ein bisschen auf dem keks geht ist dass die in manchen sachen unnötig minimalistischsind zum beispiel dass man sagt nein erase filtern mit irgendwelchen lambdas oder so ist böse macheeine schleife natürlich kann ich eine schleife machen aber ich meine was ist was ist schönerund angenehmer also wahrgenommen ich habe hier irgendwie den array 1 2 3 4 ist es erstmal vollkommenegal was ist schöner ich kann sowas hier machen keine ahnung x größer 2 also was ist besser ichkann sowas hier machen oder ich muss vor keine ahnung vor i in a i größer 2 dann oder sowasmachen was ist besser also mir gefällt das besser go sagt das ist besser die sind da manche ichfinde an manchen stellen sind bissel bissel zu minimalistisch obwohl sie eigentlich sichdas gar nicht auf die fahne geschrieben haben irgendwie super minimalistisch zu machen diefrage was ist performanter ganz ehrlich wenn das ordentlich gemacht ist braucht wahrscheinlichbeides genau das gleiche und selbst wenn das hier oder das hier ein paar tix schneller sind geht mirdas sonst wo vorbei weil die sache ist ja die schleife hat die sprache so und wenn man sowashier noch einbauen würde und das sollte wirklich irgendwie nanosekunden langsamer sein da kann ichimmer noch eine schleife schleife machen ja aber man kann es man kann es ja den programmiererzumindest ein bisschen einfacher machen das war auch eine sache die mir an go auf den keksgegangen ist ja und dass sie halt überhaupt keine generics wollten weil dieses dieses mapmap konzept und sowas das ist in go irgendwie wirkt irgendwie auf aufgestülpt also aber eskommt jetzt ja angeblich angeblich gibt es jetzt demnächst generics in go habe ich gelesenweiß ich ob es es mittlerweile schon gibt gibt es ist das jetzt schon ist es jetzt schon liveoder ist das weißt du das jemand ist das schon draus oder kommt das irgendwie vorfuture irgendwann future versions ach ja und was mich auch noch genervt hat in go jetzt wo ichsie gerade wieder sehe sind teilweise sündags schichten zum beispiel dass es es gibt irgendwievier varianten oder so eine variable anzulegen teilweise exakt identisch und teilweise auchfeinheiten die sich unterscheiden ich weiß es sind c++ teilweise noch schlimmer aber c++ ist jaauch keine messlatte ja gut so also so viel so viel dazu ja meine lieblingssprache bleibt sound so sie scharf da kann man nichts machen also ich habe jetzt mittlerweile schon einigesprachen ausprobiert und auch schon kleinere größere dinge drin gemacht aber wenn ich diewenn ich die auswahl habe und es möglich ist was in dort net beziehungsweise sie scharf zumachen da mache ich es immer in sie scharf aber wofür willst du generics wenn du compositionshast zum beispiel dass man eine eigene dictionary implementierung programmieren kann eine ordentlichetype safe das geht ja so nicht wenn man sich wenn man sich die sachen anguckt die es gibt aufgithub zusätzliche map und dictionary implementierung die sind alle nur sehr halbherzig weil es haltkeine generics gibt das ist der vorteil wenn man hauptsächlich von c++ kommt ja da schocktein nichts mehr das ist richtig so gucken wir uns mal die vernies unleashed ankündigung an malgucken was sie vor haben mit battlefield 3 es wäre ja mega poggers wenn battlefield 3 wiederordentlich spielbar wäre mit neuen surfern und allem aus die verwendest bettel sind battlefielddem dings abmahnung von da ist es raus ich sag euch wie es ist wenn das eine einzunehmendekonkurrenz wird strikt da ist die in grün und boden das ist eine neue map ist das ist daseine neue map oder ist es taller market das ist das sieht aus dass es das zwei das war das ichwollte gerade sagen kommt mir irgendwie bekannt vor ok man kann es das zwei in battlefield spielenexquisite da läuft gerade ein live stream okorffatz ok scheine nicht so viele zu interessierenwowach sind das developer tools von denen oder so was ja die haben eine neue map die habeneine map editor guck mal die haben im battlefield 3 map editor gebastelt das ist schon nice oderist das ne das ist das ist immer noch das zwei hier mit den thorn und so zwischendurch würdeich mal sagen also die thore sehen halt ultra das zwei mäßig aus die haben map editor inbattlefield 2 gebastelt der battlefield 3 das ist doch richtig gut das ist doch mega niceich meine ich will vielleicht in dem reveal treel stream was anderes zeigen weil das jetzt diemeisten heute nicht sonderlich interessiert aber das ist doch sehr nice da bin ich malecht gespannt drauf ok kommen wir uns mal den reveal den ankündigungs trelle ansie haben das die haben sie haben in battlefield 7 gebastelt was ich nach was anhört nichtdieses battlefield in battlefield 3 erinnert euch vielleicht noch was ist das zombie modusoder wie oh habt ihr es gesehen das war das war ein neues squadmenü das ist ein 8er squad10er squads oder ist es ein caster das könnte das ist in den caster übersicht oder sowaswas schaut ihr euch dann das ist der ankündigungs trailer zu venice unleashed das sind irgendwelcheleute die seit 2013 schon ich habe da schon vor ewigkeiten das projekt reingeguckt battlefield3 wieder spielbar machen wollen ok so allzu viel hat man das nicht gesehen die hättensich irgendeinen dubstep trailer man von youtube suchen sollen die das für sie macht december2020 exzellent es gibt ein ähnliches projekt für battlefield 4 ich habe aber vergessenwie es heißt es gibt ein ähnliches projekt wie release unleashed was revamped ne oderfür battlefield 4 da weiß ich aber hier das da das da das da aber das ist glaube ichdas ist da er hat sich glaube ich noch gar nichts getan ich glaube da hat sich nochgar nichts getan was play.com war das ja mal gespannt auf december 2020 endlich mal wiederordentliches battlefield spielen ich hoffe ja das taugt was und das schlägt ein bisschenein weil ansonsten geht es halt unter modding stream wann ich glaube daran beteilige ichmir nicht wie moddet man das denn weder noch die haben glaube ich eigene level editorund sowas gebaut deswegen hat es wahrscheinlich auch sieben jahre gedauert weil die vielesachen selbst programmiert haben ja battlefield 5 ist zu unbeliebt dass das jemand macht vorallem hätte da ist das mal gefälligst selbst machen sollen ja wir haben eine chance aufein gutes bf es wäre ja so geil wenn wenn das wirklich einschlägt also wenn das wastaugt den werde ich auf jeden fall auch dazu ein video machen einfach um die sachen bisschenzu supporten es wäre schon cool es wäre nicht das erste spiel was quasi vom mod zum hitwird irgendwie weil cs ist das bekannteste schlechthin wobei man halt sagen muss so einrichtiger mod es ist ein mod aber es ist ja quasi also cs war halt ein half life modder was komplett anderes aus dem half life multiplayer gemacht hat aber venice unleashedist ja quasi battlefield 3 einfach nur in widerspielbar mit ein paar sachen dabei dotagenau gibt gibt ja gibt einige sachen und aber dota war auch hat mit dem warcraft 3multiplayer was anderes gemacht als der warcraft 3 multiplayer war also es wäre nicht das erstemal dass ein mod richtig einschlägt es wäre auf jeden fall ihn zu gönnen und es wäreauf jeden fall geil wieder ein ordentliches battlefield zu spielen mit ordentlich vielenspieler und allen dabei und wie gesagt wenn ich das erste mal dass ein mod groß großrauskommt ich hoffe dass das was wird aber ich ich wette mit euch wenn das groß wirdstrike battlefield strike da ist beziehungsweise den laden in grund und boden also solltendie wirklich also bei 5 600 spieler das juckt kein mensch ja ich rede auch nicht parallel500 600 spieler 500 600 spieler parallel ist schon wieder was anderes wenn die mal angenommensollte man sollten die mal wirklich irgendwie sagen okay alter wir haben 10.000 spieleroder sowas die die werden in grund und boden gestrickt das ist ja das wo sich nintendoauch in letzter zeit so wahnsinnig beliebt macht das ist halt kacke also daran siehtman ja auch wieder dass ihnen die community egal ist auch wenn sie das immer wieder sagendie kommune die mögen also die community ist ihnen so lang nicht egal so lange die communitynoch ihnen ordentlich geld gibt sollte das aber in irgendeiner art und weise sich alskonkurrenz erweisen zu zu battlefield was ihr geld bringt sind die schneller weg vomfenster als die ihren webserver nach auf die bahamas umziehen könnennun gut chat das ging heute besser als gedacht also dass taugt gefällt mir welche in zukunftverwenden wenn es an liest weiß ich nicht ob es taugt ob ich in zukunft verwenden werdeich hoffe mal und jetzt sehe ich es 21.40 ich mache jetztein stream aus wir sehen uns die tage ich gehe jetzt wahrscheinlich zähle putze danngehe ich ins bett irgendwie eine halbe stunde oder so also wir sehen uns leute bis denn machtes gut bis zu den nächsten tage zu", "segments": [{"id": 1, "start": 0.0, "end": 27.4, "text": "Tschü tschü tschü tschü tschü baited"}, {"id": 2, "start": 30.0, "end": 32.0, "text": "Das war's für heute."}, {"id": 3, "start": 32.0, "end": 34.0, "text": "Bis zum nächsten Mal."}, {"id": 4, "start": 34.0, "end": 62.0, "text": "Bis zum nächsten Mal."}, {"id": 5, "start": 65.0, "end": 67.0, "text": "Ja, was auch immer."}, {"id": 6, "start": 69.0, "end": 71.0, "text": "Twitch hat eh noch nicht gecheckt, dass da stream on ist."}, {"id": 7, "start": 71.0, "end": 73.0, "text": "Doch."}, {"id": 8, "start": 73.0, "end": 75.0, "text": "Alpha HD ist schon am Start."}, {"id": 9, "start": 75.0, "end": 77.0, "text": "Gebaited, aber richtig gebaited."}, {"id": 10, "start": 77.0, "end": 79.0, "text": "Aber eigentlich nicht gebaited."}, {"id": 11, "start": 79.0, "end": 81.0, "text": "Weil ich mach jetzt nicht wieder aus oder so."}, {"id": 12, "start": 81.0, "end": 83.0, "text": "Das ist Absicht."}, {"id": 13, "start": 83.0, "end": 85.0, "text": "Kein Gebait."}, {"id": 14, "start": 87.0, "end": 89.0, "text": "Von irgendwas anderes."}, {"id": 15, "start": 89.0, "end": 91.0, "text": "Aber wie hieß denn nochmal diese..."}, {"id": 16, "start": 91.0, "end": 93.0, "text": "Wie hieß denn dieser..."}, {"id": 17, "start": 93.0, "end": 95.0, "text": "Das ist doch..."}, {"id": 18, "start": 95.0, "end": 97.0, "text": "Wie hieß denn dieser Typ nochmal..."}, {"id": 19, "start": 97.0, "end": 99.0, "text": "Den die alle in..."}, {"id": 20, "start": 99.0, "end": 101.0, "text": "Ihre MW2 Montages reingemacht haben."}, {"id": 21, "start": 101.0, "end": 103.0, "text": "Den hier, oder?"}, {"id": 22, "start": 103.0, "end": 105.0, "text": "Der war in allen MW2 Montages drinne."}, {"id": 23, "start": 105.0, "end": 111.0, "text": "Huge. Headbang."}, {"id": 24, "start": 111.0, "end": 113.0, "text": "Das war doch der..."}, {"id": 25, "start": 113.0, "end": 115.0, "text": "Den haben sie alle in MW2 Montages reingemacht."}, {"id": 26, "start": 121.0, "end": 123.0, "text": "Ich erinnere mich schon."}, {"id": 27, "start": 123.0, "end": 125.0, "text": "Das war doch der..."}, {"id": 28, "start": 125.0, "end": 127.0, "text": "Den haben sie alle in allen MW2 Montages reingemacht."}, {"id": 29, "start": 127.0, "end": 129.0, "text": "Das war doch der..."}, {"id": 30, "start": 129.0, "end": 131.0, "text": "Den haben sie alle in allen MW2 Montages reingemacht."}, {"id": 31, "start": 131.0, "end": 133.0, "text": "Ich erinnere mich noch."}, {"id": 32, "start": 133.0, "end": 135.0, "text": "Da gab es noch Videos von..."}, {"id": 33, "start": 135.0, "end": 137.0, "text": "Von..."}, {"id": 34, "start": 137.0, "end": 139.0, "text": "Wie hieß das?"}, {"id": 35, "start": 139.0, "end": 141.0, "text": "Sandy Ravage gab es da."}, {"id": 36, "start": 141.0, "end": 143.0, "text": "Gibt es den noch?"}, {"id": 37, "start": 143.0, "end": 145.0, "text": "Gibt es den noch?"}, {"id": 38, "start": 145.0, "end": 147.0, "text": "Gibt es den noch?"}, {"id": 39, "start": 147.0, "end": 149.0, "text": "Gibt es den noch?"}, {"id": 40, "start": 149.0, "end": 151.0, "text": "Vor 11 Monaten."}, {"id": 41, "start": 151.0, "end": 153.0, "text": "Ey ich mein..."}, {"id": 42, "start": 153.0, "end": 155.0, "text": "Immerhin."}, {"id": 43, "start": 155.0, "end": 157.0, "text": "Immerhin."}, {"id": 44, "start": 163.0, "end": 165.0, "text": "Den scheint es noch..."}, {"id": 45, "start": 165.0, "end": 167.0, "text": "Den gibt es ungefähr genau so viel wie es mich noch gibt."}, {"id": 46, "start": 167.0, "end": 169.0, "text": "Auf YouTube würde ich mal behaupten."}, {"id": 47, "start": 171.0, "end": 173.0, "text": "Auch nur noch sehr am Rande."}, {"id": 48, "start": 181.0, "end": 183.0, "text": "Ah ja."}, {"id": 49, "start": 183.0, "end": 185.0, "text": "Ah ja."}, {"id": 50, "start": 189.0, "end": 191.0, "text": "Das größten Verhältnis ist nicht richtig."}, {"id": 51, "start": 193.0, "end": 195.0, "text": "Gut das ist das kleinste Problem jetzt."}, {"id": 52, "start": 207.0, "end": 209.0, "text": "Ja also Leute, ich wollte mir mal heute mit euch zusammen"}, {"id": 53, "start": 209.0, "end": 213.0, "text": "eine Sache angucken, die ich mir schon lange anschauen wollte."}, {"id": 54, "start": 213.0, "end": 215.0, "text": "Und zwar das hier."}, {"id": 55, "start": 215.0, "end": 217.0, "text": "Das ist aber wahrscheinlich nichts, was den ganzen Stream dauert."}, {"id": 56, "start": 217.0, "end": 219.0, "text": "Weil ich glaube, dass das ziemlich einfach ist."}, {"id": 57, "start": 219.0, "end": 221.0, "text": "Und zwar das hier wollte ich mir mit euch mal angucken."}, {"id": 58, "start": 225.0, "end": 227.0, "text": "Und zwar..."}, {"id": 59, "start": 227.0, "end": 229.0, "text": "Ich hab letztens ein Video gesehen."}, {"id": 60, "start": 229.0, "end": 231.0, "text": "Da hat irgendjemand"}, {"id": 61, "start": 231.0, "end": 233.0, "text": "anstatt CSS das verwendet."}, {"id": 62, "start": 233.0, "end": 235.0, "text": "Und ich wusste auch schon, dass..."}, {"id": 63, "start": 235.0, "end": 237.0, "text": "Ich wusste, dass es das gibt."}, {"id": 64, "start": 237.0, "end": 239.0, "text": "Ich weiß auch so ungefähr, was es macht."}, {"id": 65, "start": 239.0, "end": 241.0, "text": "Und ich weiß auch ungefähr, wofür es da ist."}, {"id": 66, "start": 243.0, "end": 245.0, "text": "Aber ich hab letztens ein Video geguckt."}, {"id": 67, "start": 245.0, "end": 247.0, "text": "Das war irgendwie..."}, {"id": 68, "start": 247.0, "end": 249.0, "text": "Sass in 20 Minuten."}, {"id": 69, "start": 249.0, "end": 251.0, "text": "Oder sowas."}, {"id": 70, "start": 251.0, "end": 253.0, "text": "Und ich muss sagen, ich fand das nicht verkehrt."}, {"id": 71, "start": 253.0, "end": 255.0, "text": "Das hat mich überzeugt,"}, {"id": 72, "start": 255.0, "end": 257.0, "text": "dass man sich das mal angucken muss."}, {"id": 73, "start": 257.0, "end": 259.0, "text": "Also soweit ich das verstanden habe,"}, {"id": 74, "start": 259.0, "end": 261.0, "text": "ist das quasi CSS."}, {"id": 75, "start": 261.0, "end": 263.0, "text": "Mit ein bisschen zusätzlicher Syntax,"}, {"id": 76, "start": 263.0, "end": 265.0, "text": "wo man mehr machen kann."}, {"id": 77, "start": 265.0, "end": 267.0, "text": "20 Minuten fürs Sass."}, {"id": 78, "start": 267.0, "end": 269.0, "text": "Wieso meinst du, es ist zu lang oder zu kurz?"}, {"id": 79, "start": 269.0, "end": 271.0, "text": "Wahrscheinlich brauchen wir schon ein bisschen länger für."}, {"id": 80, "start": 271.0, "end": 273.0, "text": "Aber wahrscheinlich sind wir die Streamer heute beschäftigt,"}, {"id": 81, "start": 273.0, "end": 275.0, "text": "sich das im Detail mal anzugucken."}, {"id": 82, "start": 275.0, "end": 277.0, "text": "Aber es ist mehr oder weniger..."}, {"id": 83, "start": 277.0, "end": 279.0, "text": "Also wenn ich das verstanden habe,"}, {"id": 84, "start": 279.0, "end": 281.0, "text": "wenn ich das richtig kapiert habe..."}, {"id": 85, "start": 281.0, "end": 283.0, "text": "Wie gesagt, ich wusste schon vorher, dass es das gibt."}, {"id": 86, "start": 283.0, "end": 285.0, "text": "Aber ich hab es mir nie so genau angeschaut."}, {"id": 87, "start": 285.0, "end": 287.0, "text": "Es ist normale CSS-Syntax."}, {"id": 88, "start": 289.0, "end": 291.0, "text": "Es ist normale CSS-Syntax."}, {"id": 89, "start": 291.0, "end": 293.0, "text": "Nur, dass man"}, {"id": 90, "start": 293.0, "end": 295.0, "text": "noch ein paar andere sinnvolle Sachen drin machen kann."}, {"id": 91, "start": 295.0, "end": 297.0, "text": "Zum Beispiel kann man"}, {"id": 92, "start": 297.0, "end": 299.0, "text": "wohl irgendwie..."}, {"id": 93, "start": 299.0, "end": 301.0, "text": "Na gut, Variablen gibt es jetzt in CSS auch."}, {"id": 94, "start": 301.0, "end": 303.0, "text": "Wir gucken uns einfach mal das Getting Started"}, {"id": 95, "start": 303.0, "end": 305.0, "text": "jetzt an und probieren das ein bisschen aus."}, {"id": 96, "start": 305.0, "end": 307.0, "text": "Da kann ich mal wieder meine"}, {"id": 97, "start": 307.0, "end": 309.0, "text": "Huge-Frontend-Skills zeigen."}, {"id": 98, "start": 309.0, "end": 311.0, "text": "Kann ich mein..."}, {"id": 99, "start": 311.0, "end": 313.0, "text": "Wie sagt man heutzutage so schön?"}, {"id": 100, "start": 313.0, "end": 315.0, "text": "Mein Frontend-Game upsteppen."}, {"id": 101, "start": 317.0, "end": 319.0, "text": "Painstrap."}, {"id": 102, "start": 319.0, "end": 321.0, "text": "Ähm..."}, {"id": 103, "start": 321.0, "end": 323.0, "text": "Also wie gesagt, Variablen kannst du."}, {"id": 104, "start": 323.0, "end": 325.0, "text": "Du kannst irgendwie"}, {"id": 105, "start": 325.0, "end": 327.0, "text": "die Elemente besser"}, {"id": 106, "start": 327.0, "end": 329.0, "text": "ineinander schachteln."}, {"id": 107, "start": 329.0, "end": 331.0, "text": "Man kann die Sachen in unterschiedliche Files"}, {"id": 108, "start": 331.0, "end": 333.0, "text": "aufteilen. Modules"}, {"id": 109, "start": 333.0, "end": 335.0, "text": "habe ich keine Ahnung, was"}, {"id": 110, "start": 335.0, "end": 337.0, "text": "es sein soll, ehrlich gesagt."}, {"id": 111, "start": 343.0, "end": 345.0, "text": "Okay, ich glaube, das ist jetzt nicht so wild."}, {"id": 112, "start": 345.0, "end": 347.0, "text": "Man kann irgendwelche Sachen einmal schreiben"}, {"id": 113, "start": 347.0, "end": 349.0, "text": "und dann eben mehrfach inkluden und solche Sachen."}, {"id": 114, "start": 349.0, "end": 351.0, "text": "Das sieht wirklich ganz"}, {"id": 115, "start": 351.0, "end": 353.0, "text": "gut aus. Wie gesagt, das gibt es schon"}, {"id": 116, "start": 353.0, "end": 355.0, "text": "lange. Es ist das erste Mal, wo ich das"}, {"id": 117, "start": 355.0, "end": 357.0, "text": "gesehen habe, ist"}, {"id": 118, "start": 357.0, "end": 359.0, "text": "als ich noch Ruby on Rails verwende."}, {"id": 119, "start": 359.0, "end": 361.0, "text": "Hat mal irgendjemand"}, {"id": 120, "start": 361.0, "end": 363.0, "text": "von euch Ruby on Rails verwendet?"}, {"id": 121, "start": 365.0, "end": 367.0, "text": "Das ist ja nicht mehr angesagt."}, {"id": 122, "start": 367.0, "end": 369.0, "text": "Das ist ja so was"}, {"id": 123, "start": 369.0, "end": 371.0, "text": "von extrem."}, {"id": 124, "start": 371.0, "end": 373.0, "text": "Es gibt schon Rails 5 mittlerweile."}, {"id": 125, "start": 373.0, "end": 375.0, "text": "Warte."}, {"id": 126, "start": 375.0, "end": 377.0, "text": "Moment."}, {"id": 127, "start": 379.0, "end": 381.0, "text": "Da gibt es schon 5. Ich habe irgendwie das letzte,"}, {"id": 128, "start": 381.0, "end": 383.0, "text": "was ich benutzt habe, war keine Ahnung, 3.8"}, {"id": 129, "start": 383.0, "end": 385.0, "text": "oder irgendwie sowas. Das ist"}, {"id": 130, "start": 385.0, "end": 387.0, "text": "ewig her. Rails release"}, {"id": 131, "start": 387.0, "end": 389.0, "text": "3.8 oder irgendwie sowas."}, {"id": 132, "start": 389.0, "end": 391.0, "text": "Aber Moment, es gibt schon"}, {"id": 133, "start": 391.0, "end": 393.0, "text": "Version 6. What the fuck."}, {"id": 134, "start": 395.0, "end": 397.0, "text": "Wie gesagt, ich habe das mal vor"}, {"id": 135, "start": 397.0, "end": 399.0, "text": "Uhrzeiten verwendet."}, {"id": 136, "start": 399.0, "end": 401.0, "text": "Oder 3.2."}, {"id": 137, "start": 401.0, "end": 403.0, "text": "Kann auch sein."}, {"id": 138, "start": 403.0, "end": 405.0, "text": "Ja, das sieht eher aus."}, {"id": 139, "start": 405.0, "end": 407.0, "text": "Das letzte Mal, wo ich das verwendet habe, war Ruby"}, {"id": 140, "start": 407.0, "end": 409.0, "text": "on Rails 3.2. Und das"}, {"id": 141, "start": 409.0, "end": 411.0, "text": "kam wann raus? Gibt es da irgendwie ein Datum?"}, {"id": 142, "start": 411.0, "end": 413.0, "text": "Warum macht man release notes"}, {"id": 143, "start": 413.0, "end": 415.0, "text": "ohne Datum?"}, {"id": 144, "start": 423.0, "end": 425.0, "text": "2012. Ja, das kommt ungefähr hin,"}, {"id": 145, "start": 425.0, "end": 427.0, "text": "weil ich das zuletzt verwendet habe."}, {"id": 146, "start": 427.0, "end": 429.0, "text": "Discourse ist mit Ruby gemacht,"}, {"id": 147, "start": 429.0, "end": 431.0, "text": "aber Discourse geht mir mega"}, {"id": 148, "start": 431.0, "end": 433.0, "text": "auf den Sack. Discourse"}, {"id": 149, "start": 433.0, "end": 435.0, "text": "wurde dann immer erstmal eine halbe Stunde Javascript"}, {"id": 150, "start": 435.0, "end": 437.0, "text": "Zeug nachladen muss und nicht richtig scrollen kannst."}, {"id": 151, "start": 437.0, "end": 439.0, "text": "Warum sich"}, {"id": 152, "start": 439.0, "end": 441.0, "text": "diese Plattform durchgesetzt hat, ist mir auch"}, {"id": 153, "start": 441.0, "end": 443.0, "text": "ein absolutes Rätsel."}, {"id": 154, "start": 443.0, "end": 445.0, "text": "Slay.Teddy."}, {"id": 155, "start": 445.0, "end": 447.0, "text": "6 Monate. Danke für den Sub. Exquisite."}, {"id": 156, "start": 451.0, "end": 453.0, "text": "Serious Max."}, {"id": 157, "start": 453.0, "end": 455.0, "text": "Naja, also wirklich, ich bin da fast"}, {"id": 158, "start": 455.0, "end": 457.0, "text": "Frontend angeht. Nicht so der allergroße Checker."}, {"id": 159, "start": 457.0, "end": 459.0, "text": "Ich glaube, das ist, also SAS"}, {"id": 160, "start": 459.0, "end": 461.0, "text": "und SCSS ist das gleiche."}, {"id": 161, "start": 461.0, "end": 463.0, "text": "Das ist bloß ein anderer"}, {"id": 162, "start": 463.0, "end": 465.0, "text": "Dialekt. Also SAS"}, {"id": 163, "start": 465.0, "end": 467.0, "text": "ist quasi mit Einrückung"}, {"id": 164, "start": 467.0, "end": 469.0, "text": "so ein bisschen wie"}, {"id": 165, "start": 469.0, "end": 471.0, "text": "Jaml. SCSS ist"}, {"id": 166, "start": 471.0, "end": 473.0, "text": "quasi, CSS mit"}, {"id": 167, "start": 473.0, "end": 475.0, "text": "ein bisschen mehr dabei. Das ist aber alles das gleiche."}, {"id": 168, "start": 475.0, "end": 477.0, "text": "Und LESS ist quasi so eine alternative"}, {"id": 169, "start": 477.0, "end": 479.0, "text": "Implementierung. Ich weiß, das"}, {"id": 170, "start": 479.0, "end": 481.0, "text": "Bootstrap war früher mal in LESS."}, {"id": 171, "start": 481.0, "end": 483.0, "text": "So die ersten Bootstrap-Versionen"}, {"id": 172, "start": 483.0, "end": 485.0, "text": "waren irgendwie mal in LESS."}, {"id": 173, "start": 485.0, "end": 487.0, "text": "Aber weiß nicht, ob"}, {"id": 174, "start": 487.0, "end": 489.0, "text": "das überhaupt noch, ist das überhaupt noch angesagt?"}, {"id": 175, "start": 491.0, "end": 493.0, "text": "Ich glaube, das ist gar nicht mehr"}, {"id": 176, "start": 493.0, "end": 495.0, "text": "gar nicht"}, {"id": 177, "start": 495.0, "end": 497.0, "text": "mehr im Trend. Ich glaube, das ist"}, {"id": 178, "start": 497.0, "end": 499.0, "text": "outdated oder so."}, {"id": 179, "start": 501.0, "end": 503.0, "text": "Bootstrap ist echt"}, {"id": 180, "start": 503.0, "end": 505.0, "text": "nicht mehr gut. Okay."}, {"id": 181, "start": 505.0, "end": 507.0, "text": "Wie gesagt, Frontend-mäßig kenne ich mich nicht so"}, {"id": 182, "start": 507.0, "end": 509.0, "text": "wahnsinnig gut aus. Also"}, {"id": 183, "start": 509.0, "end": 511.0, "text": "die meisten Sachen, die ich bisher gemacht habe,"}, {"id": 184, "start": 511.0, "end": 513.0, "text": "weil ich sag ja immer so ein bisschen"}, {"id": 185, "start": 513.0, "end": 515.0, "text": "Frontend-Gedöns, kommt man nicht drum herum."}, {"id": 186, "start": 515.0, "end": 517.0, "text": "Die meisten Frontend-Sachen,"}, {"id": 187, "start": 517.0, "end": 519.0, "text": "die ich in letzter Zeit gemacht habe, waren"}, {"id": 188, "start": 519.0, "end": 521.0, "text": "Vue.js mit"}, {"id": 189, "start": 521.0, "end": 523.0, "text": "Vue.tify, wenn irgendwas"}, {"id": 190, "start": 523.0, "end": 525.0, "text": "Ansehnliches sein muss. Das da."}, {"id": 191, "start": 525.0, "end": 527.0, "text": "So und"}, {"id": 192, "start": 527.0, "end": 529.0, "text": "Tailwind, da kann ich"}, {"id": 193, "start": 529.0, "end": 531.0, "text": "den Hype gar nicht drum verstehen, muss ich ehrlich sagen."}, {"id": 194, "start": 531.0, "end": 533.0, "text": "Vielleicht habe ich"}, {"id": 195, "start": 533.0, "end": 535.0, "text": "auch einfach nur nicht"}, {"id": 196, "start": 535.0, "end": 537.0, "text": "groß genug einen Kopf, um Tailwind zu kapieren."}, {"id": 197, "start": 537.0, "end": 539.0, "text": "Das kann auch sein."}, {"id": 198, "start": 539.0, "end": 541.0, "text": "Material ist overused. Ja, das ist"}, {"id": 199, "start": 541.0, "end": 543.0, "text": "das, was mich an Vue.tify auch nervt."}, {"id": 200, "start": 543.0, "end": 545.0, "text": "Das Material UI"}, {"id": 201, "start": 545.0, "end": 547.0, "text": "Look ist"}, {"id": 202, "start": 547.0, "end": 549.0, "text": "das neue Bootstrap."}, {"id": 203, "start": 549.0, "end": 551.0, "text": "Material UI Design,"}, {"id": 204, "start": 551.0, "end": 553.0, "text": "das ist das Android."}, {"id": 205, "start": 553.0, "end": 555.0, "text": "Das habt ihr alle schon gesehen. Also Material"}, {"id": 206, "start": 555.0, "end": 557.0, "text": "Design ist"}, {"id": 207, "start": 557.0, "end": 559.0, "text": "diese Geschichte. Das ist quasi das, wie es bei"}, {"id": 208, "start": 559.0, "end": 561.0, "text": "Android aussieht. Das ist das neue Bootstrap."}, {"id": 209, "start": 561.0, "end": 563.0, "text": "Früher hatte jede Webseite Bootstrap"}, {"id": 210, "start": 563.0, "end": 565.0, "text": "Look. Heute hat jede zweite Webseite"}, {"id": 211, "start": 565.0, "end": 567.0, "text": "Material UI Look."}, {"id": 212, "start": 567.0, "end": 569.0, "text": "Das geht sogar"}, {"id": 213, "start": 569.0, "end": 571.0, "text": "so weit, dass es ein"}, {"id": 214, "start": 571.0, "end": 573.0, "text": "Material UI für Windows"}, {"id": 215, "start": 573.0, "end": 575.0, "text": "Forms gibt, Alter."}, {"id": 216, "start": 575.0, "end": 577.0, "text": "Mega Paynes Champ."}, {"id": 217, "start": 581.0, "end": 583.0, "text": "So, aber"}, {"id": 218, "start": 583.0, "end": 585.0, "text": "okay, Chat, ich sehe"}, {"id": 219, "start": 585.0, "end": 587.0, "text": "ein paar von euch verwenden Tailwind. Also ich"}, {"id": 220, "start": 587.0, "end": 589.0, "text": "erzähle euch jetzt mal, was ich"}, {"id": 221, "start": 589.0, "end": 591.0, "text": "verstanden habe, was Tailwind ist."}, {"id": 222, "start": 591.0, "end": 593.0, "text": "Da"}, {"id": 223, "start": 593.0, "end": 595.0, "text": "könnt ihr mir erzählen, warum man es verwenden"}, {"id": 224, "start": 595.0, "end": 597.0, "text": "soll oder was ich..."}, {"id": 225, "start": 597.0, "end": 599.0, "text": "wo mein Kopf zu"}, {"id": 226, "start": 599.0, "end": 601.0, "text": "small dafür ist. Also,"}, {"id": 227, "start": 601.0, "end": 603.0, "text": "was ich kapiert habe, ist,"}, {"id": 228, "start": 603.0, "end": 605.0, "text": "dass im Prinzip Tailwind CSS"}, {"id": 229, "start": 605.0, "end": 607.0, "text": "kein richtiges"}, {"id": 230, "start": 607.0, "end": 609.0, "text": "CSS Framework ist in"}, {"id": 231, "start": 609.0, "end": 611.0, "text": "Richtung Bootstrap, wo du quasi fertige"}, {"id": 232, "start": 611.0, "end": 613.0, "text": "Module kriegst. So, also fertige,"}, {"id": 233, "start": 613.0, "end": 615.0, "text": "fertige... Ne, Module ist das falsche"}, {"id": 234, "start": 615.0, "end": 617.0, "text": "Wort. Wie heißt das im Browser?"}, {"id": 235, "start": 617.0, "end": 619.0, "text": "Wo du fertige Komponenten kriegst. Das ist in"}, {"id": 236, "start": 619.0, "end": 621.0, "text": "Tailwind nicht so. Na, in Bootstrap kriegst du"}, {"id": 237, "start": 621.0, "end": 623.0, "text": "quasi einen fertigen"}, {"id": 238, "start": 623.0, "end": 625.0, "text": "Button mit sich Geschichten. Du kriegst"}, {"id": 239, "start": 625.0, "end": 627.0, "text": "einen fertigen, keine Ahnung,"}, {"id": 240, "start": 627.0, "end": 629.0, "text": "Data Table mit sich Geschichten. So, das ist"}, {"id": 241, "start": 629.0, "end": 631.0, "text": "in Tailwind nicht so, aber"}, {"id": 242, "start": 631.0, "end": 633.0, "text": "Tailwind ist"}, {"id": 243, "start": 633.0, "end": 635.0, "text": "quasi eine riesige Sammlung"}, {"id": 244, "start": 635.0, "end": 637.0, "text": "aus Helperklassen,"}, {"id": 245, "start": 637.0, "end": 639.0, "text": "mit denen ich mein Zeug"}, {"id": 246, "start": 639.0, "end": 641.0, "text": "stylen kann. Also, anstatt"}, {"id": 247, "start": 641.0, "end": 643.0, "text": "ich jetzt schreibe,"}, {"id": 248, "start": 643.0, "end": 645.0, "text": "keine Ahnung, Überschrift,"}, {"id": 249, "start": 645.0, "end": 647.0, "text": "H2,"}, {"id": 250, "start": 647.0, "end": 649.0, "text": "und da mache ich dann eine eigene Klasse,"}, {"id": 251, "start": 649.0, "end": 651.0, "text": "irgendwie Highlight und"}, {"id": 252, "start": 651.0, "end": 653.0, "text": "Color Red, gibt es dann schon eine"}, {"id": 253, "start": 653.0, "end": 655.0, "text": "fertige Klasse dafür, so für Zentrieren"}, {"id": 254, "start": 655.0, "end": 657.0, "text": "und für"}, {"id": 255, "start": 657.0, "end": 659.0, "text": "Umbruch und"}, {"id": 256, "start": 659.0, "end": 661.0, "text": "für Grid und sonstige"}, {"id": 257, "start": 661.0, "end": 663.0, "text": "Gedöns. Aber,"}, {"id": 258, "start": 663.0, "end": 665.0, "text": "wo ist der Vorteil?"}, {"id": 259, "start": 665.0, "end": 667.0, "text": "Das habe ich, das leucht mir nämlich nicht ein."}, {"id": 260, "start": 667.0, "end": 669.0, "text": "Wo ist der Vorteil davon,"}, {"id": 261, "start": 669.0, "end": 671.0, "text": "wenn ich erstmal 500 Klassen"}, {"id": 262, "start": 671.0, "end": 673.0, "text": "oder so lernen muss in Tailwind"}, {"id": 263, "start": 673.0, "end": 675.0, "text": "und du dann"}, {"id": 264, "start": 677.0, "end": 679.0, "text": "quasi"}, {"id": 265, "start": 679.0, "end": 681.0, "text": "in der eigenen CSS-Sprache"}, {"id": 266, "start": 681.0, "end": 683.0, "text": "lernen musst, um dein"}, {"id": 267, "start": 683.0, "end": 685.0, "text": "HTML zu stylen, anstatt"}, {"id": 268, "start": 685.0, "end": 687.0, "text": "selbst CSS zu schreiben?"}, {"id": 269, "start": 687.0, "end": 689.0, "text": "Das kapiere ich nicht."}, {"id": 270, "start": 689.0, "end": 691.0, "text": "WTF, du streamst auch ja schon"}, {"id": 271, "start": 691.0, "end": 693.0, "text": "3 Jahre oder so?"}, {"id": 272, "start": 693.0, "end": 695.0, "text": "Bist du jetzt gerade von YouTube"}, {"id": 273, "start": 695.0, "end": 697.0, "text": "rüber gekommen, oder wie?"}, {"id": 274, "start": 699.0, "end": 701.0, "text": "Also, deswegen"}, {"id": 275, "start": 701.0, "end": 703.0, "text": "verstehe ich den Sinn hinter Tailwind"}, {"id": 276, "start": 703.0, "end": 705.0, "text": "nicht so ganz. Also,"}, {"id": 277, "start": 705.0, "end": 707.0, "text": "wenn ich 500 Klassen"}, {"id": 278, "start": 707.0, "end": 709.0, "text": "lernen muss, dass ich meinen HTML"}, {"id": 279, "start": 709.0, "end": 711.0, "text": "stylen kann, dann kann ich doch auch einfach"}, {"id": 280, "start": 711.0, "end": 713.0, "text": "CSS lernen oder Sass"}, {"id": 281, "start": 713.0, "end": 715.0, "text": "oder sonst was und"}, {"id": 282, "start": 715.0, "end": 717.0, "text": "meinen HTML stylen auf dem"}, {"id": 283, "start": 717.0, "end": 719.0, "text": "Weg, wie das eigentlich vom Browser-Hersteller"}, {"id": 284, "start": 719.0, "end": 721.0, "text": "gedacht ist. Vielleicht habe ich aber"}, {"id": 285, "start": 721.0, "end": 723.0, "text": "auch die Genialität von"}, {"id": 286, "start": 723.0, "end": 725.0, "text": "Tailwind nicht kapiert, aber so sieht es für"}, {"id": 287, "start": 725.0, "end": 727.0, "text": "mich aus und ich verstehe den Sinn von Tailwind"}, {"id": 288, "start": 727.0, "end": 729.0, "text": "einfach nicht. Den Sinn von Bootstrap,"}, {"id": 289, "start": 729.0, "end": 731.0, "text": "den Sinn von"}, {"id": 290, "start": 731.0, "end": 733.0, "text": "von Viewtify"}, {"id": 291, "start": 733.0, "end": 735.0, "text": "und sonst was, das habe ich"}, {"id": 292, "start": 735.0, "end": 737.0, "text": "kapiert, da kriegst du fertige Sachen,"}, {"id": 293, "start": 737.0, "end": 739.0, "text": "also beispielsweise, auch wenn"}, {"id": 294, "start": 739.0, "end": 741.0, "text": "es 0x15 Material Design"}, {"id": 295, "start": 741.0, "end": 743.0, "text": "aussieht, aber bei Viewtify kannst du"}, {"id": 296, "start": 743.0, "end": 745.0, "text": "sagen, aha, Components und dann sagst"}, {"id": 297, "start": 745.0, "end": 747.0, "text": "dir Data Table und dann"}, {"id": 298, "start": 747.0, "end": 749.0, "text": "hast du halt eine fix und fertige Data Table,"}, {"id": 299, "start": 749.0, "end": 751.0, "text": "wo du sortieren kannst,"}, {"id": 300, "start": 751.0, "end": 753.0, "text": "wo du suchen kannst, wo du"}, {"id": 301, "start": 753.0, "end": 755.0, "text": "Paging machen kannst und was auch immer. Also"}, {"id": 302, "start": 755.0, "end": 757.0, "text": "den Sinn davon verstehe ich,"}, {"id": 303, "start": 757.0, "end": 759.0, "text": "man kann ja, man sieht es ja,"}, {"id": 304, "start": 759.0, "end": 761.0, "text": "das ist halt fix und fertig, man kann es einfach wenden,"}, {"id": 305, "start": 761.0, "end": 763.0, "text": "aber das ist ja in Tailwind nicht. Also wo ist der Sinn"}, {"id": 306, "start": 763.0, "end": 765.0, "text": "von Tailwind, das verstehe ich nicht so genau."}, {"id": 307, "start": 767.0, "end": 769.0, "text": "Tainser sagt,"}, {"id": 308, "start": 769.0, "end": 771.0, "text": "es geht halt schneller einfach, die Klassen"}, {"id": 309, "start": 771.0, "end": 773.0, "text": "in HTML rein zu hauen, anstatt hier einen"}, {"id": 310, "start": 773.0, "end": 775.0, "text": "Namen auszudenken, dann CSS"}, {"id": 311, "start": 775.0, "end": 777.0, "text": "zu schreiben, dann wieder zu HTML zu packen."}, {"id": 312, "start": 779.0, "end": 781.0, "text": "Meinst du, das geht wirklich so viel schneller?"}, {"id": 313, "start": 781.0, "end": 783.0, "text": "Also ja, am Anfang vielleicht,"}, {"id": 314, "start": 783.0, "end": 785.0, "text": "also"}, {"id": 315, "start": 785.0, "end": 787.0, "text": "wenn ich jetzt was zentrieren will, ich muss einfach"}, {"id": 316, "start": 787.0, "end": 789.0, "text": "nur noch sagen, Class Center, okay,"}, {"id": 317, "start": 789.0, "end": 791.0, "text": "aber ob ich jetzt einfach sage, Class Center"}, {"id": 318, "start": 791.0, "end": 793.0, "text": "oder ob ich einmal in meine Styles"}, {"id": 319, "start": 793.0, "end": 795.0, "text": "umgehe und sage,"}, {"id": 320, "start": 795.0, "end": 797.0, "text": "Class Center und dann"}, {"id": 321, "start": 797.0, "end": 799.0, "text": "an jedes Element ein Center dran,"}, {"id": 322, "start": 799.0, "end": 801.0, "text": "ja gut, stimmt, man muss keine"}, {"id": 323, "start": 801.0, "end": 803.0, "text": "CSS Files managen, dafür muss"}, {"id": 324, "start": 803.0, "end": 805.0, "text": "dann 500 Texts auswendig lernen,"}, {"id": 325, "start": 805.0, "end": 807.0, "text": "die sich ein anderer für dich ausgedacht hat, was"}, {"id": 326, "start": 807.0, "end": 809.0, "text": "es vielleicht auch schwieriger macht. Vielleicht gucke ich"}, {"id": 327, "start": 809.0, "end": 811.0, "text": "mir das irgendwann mal an, aber ich habe"}, {"id": 328, "start": 811.0, "end": 813.0, "text": "den Sinn noch nicht so 100%"}, {"id": 329, "start": 813.0, "end": 815.0, "text": "kapiert."}, {"id": 330, "start": 817.0, "end": 819.0, "text": "So, T"}, {"id": 331, "start": 819.0, "end": 821.0, "text": "from the future"}, {"id": 332, "start": 821.0, "end": 823.0, "text": "8 Monate, das ist ja kurz"}, {"id": 333, "start": 823.0, "end": 825.0, "text": "vor"}, {"id": 334, "start": 825.0, "end": 827.0, "text": "eigentlich schon für den Sub, Poggers."}, {"id": 335, "start": 829.0, "end": 831.0, "text": "Morgen kommt"}, {"id": 336, "start": 831.0, "end": 833.0, "text": "der Telekom Netzingenieur."}, {"id": 337, "start": 833.0, "end": 835.0, "text": "Also Sebaro, ich will es jetzt ja nicht"}, {"id": 338, "start": 835.0, "end": 837.0, "text": "beschwören, ja,"}, {"id": 339, "start": 837.0, "end": 839.0, "text": "aber die haben dich"}, {"id": 340, "start": 839.0, "end": 841.0, "text": "das letzte Mal auch schon versetzt."}, {"id": 341, "start": 843.0, "end": 845.0, "text": "Ich hoffe ja, dass"}, {"id": 342, "start": 845.0, "end": 847.0, "text": "der kommt, ja."}, {"id": 343, "start": 847.0, "end": 849.0, "text": "Der soll mal anrücken"}, {"id": 344, "start": 849.0, "end": 851.0, "text": "oder Zeug fixen."}, {"id": 345, "start": 851.0, "end": 853.0, "text": "Richtig PP-Gas, Alter."}, {"id": 346, "start": 853.0, "end": 855.0, "text": "Massive PP-Gas."}, {"id": 347, "start": 855.0, "end": 857.0, "text": "Gut, also so sieht es aus. Und jetzt nochmal zu dieser"}, {"id": 348, "start": 857.0, "end": 859.0, "text": "Sache mit Discourse, das ist auch so eine Plattform,"}, {"id": 349, "start": 859.0, "end": 861.0, "text": "die ich nicht genau kapiert habe. Zum Beispiel"}, {"id": 350, "start": 861.0, "end": 863.0, "text": "der Spiegel oder so, die haben"}, {"id": 351, "start": 863.0, "end": 865.0, "text": "auch Discourse. So, ich mache"}, {"id": 352, "start": 865.0, "end": 867.0, "text": "mal x-beliebigen Spiegelartikel auf."}, {"id": 353, "start": 867.0, "end": 869.0, "text": "Was weiß ich,"}, {"id": 354, "start": 869.0, "end": 871.0, "text": "irgendwie das da, aber wenn man jetzt runter scrollt,"}, {"id": 355, "start": 871.0, "end": 873.0, "text": "ist das, glaub, Discourse bei denen auch."}, {"id": 356, "start": 873.0, "end": 875.0, "text": "Nee, okay, bei denen war es nicht Discourse"}, {"id": 357, "start": 875.0, "end": 877.0, "text": "oder doch Discourse. Ach, ich weiß nicht,"}, {"id": 358, "start": 877.0, "end": 879.0, "text": "oder was Eigenes."}, {"id": 359, "start": 881.0, "end": 883.0, "text": "Äh."}, {"id": 360, "start": 883.0, "end": 885.0, "text": "Warte mal, wer hat, wer hat einen Discourse?"}, {"id": 361, "start": 885.0, "end": 887.0, "text": "Ich hab's voll vergessen, es gibt total oft"}, {"id": 362, "start": 887.0, "end": 889.0, "text": "alle WordPress-Blocks haben Discourse"}, {"id": 363, "start": 889.0, "end": 891.0, "text": "und sowas."}, {"id": 364, "start": 891.0, "end": 893.0, "text": "Discourse, Dis-, Dis-, ach, ich, nee,"}, {"id": 365, "start": 893.0, "end": 895.0, "text": "Dis-, Dis-, krass."}, {"id": 366, "start": 895.0, "end": 897.0, "text": "Ich glaub, das meine ich."}, {"id": 367, "start": 897.0, "end": 899.0, "text": "Ich glaub, das meine ich. Oder mein, Moment,"}, {"id": 368, "start": 899.0, "end": 901.0, "text": "oder meine ich, oder meine ich das?"}, {"id": 369, "start": 901.0, "end": 903.0, "text": "Ich bin verwirrt. Warte mal."}, {"id": 370, "start": 903.0, "end": 905.0, "text": "Was ist das Kommentarsystem?"}, {"id": 371, "start": 905.0, "end": 907.0, "text": "Mein ich das,"}, {"id": 372, "start": 907.0, "end": 909.0, "text": "oder mein ich, mein ich das?"}, {"id": 373, "start": 909.0, "end": 911.0, "text": "Äh."}, {"id": 374, "start": 919.0, "end": 921.0, "text": "Ich mein, das Kommentarsystem, ich glaub, ich mein das."}, {"id": 375, "start": 923.0, "end": 925.0, "text": "Oh. Und"}, {"id": 376, "start": 925.0, "end": 927.0, "text": "ich find"}, {"id": 377, "start": 927.0, "end": 929.0, "text": "das halt extrem, genau, das sind diese"}, {"id": 378, "start": 929.0, "end": 931.0, "text": "Sorten von, ich find das halt extrem"}, {"id": 379, "start": 931.0, "end": 933.0, "text": "nervig, dass das"}, {"id": 380, "start": 933.0, "end": 935.0, "text": "quasi so"}, {"id": 381, "start": 935.0, "end": 937.0, "text": "embedded ist auf der Seite. Und du kannst"}, {"id": 382, "start": 937.0, "end": 939.0, "text": "da drin auch nicht richtig scrollen und solche"}, {"id": 383, "start": 939.0, "end": 941.0, "text": "Geschichten. Das ist ja schon, das ist"}, {"id": 384, "start": 941.0, "end": 943.0, "text": "ja schon was, was mir an Reddit immer übelst auf"}, {"id": 385, "start": 943.0, "end": 945.0, "text": "den Keks geht. Geh da mal zum Beispiel,"}, {"id": 386, "start": 945.0, "end": 947.0, "text": "ja, Self-Hosted-Reddit."}, {"id": 387, "start": 947.0, "end": 949.0, "text": "So. Ich, also, mal davon abgesehen,"}, {"id": 388, "start": 949.0, "end": 951.0, "text": "dass ich ja, ehrlich gesagt,"}, {"id": 389, "start": 951.0, "end": 953.0, "text": "eher, lieber Old,"}, {"id": 390, "start": 953.0, "end": 955.0, "text": "Old-Reddit verwende, als"}, {"id": 391, "start": 955.0, "end": 957.0, "text": "New-Reddit. Aber"}, {"id": 392, "start": 957.0, "end": 959.0, "text": "wer ist denn auf die glorreiche Idee gekommen"}, {"id": 393, "start": 959.0, "end": 961.0, "text": "mit endless scroll hier drauf?"}, {"id": 394, "start": 961.0, "end": 963.0, "text": "Oder noch schlimmer?"}, {"id": 395, "start": 963.0, "end": 965.0, "text": "Moment, noch schlimmer, pass mal auf."}, {"id": 396, "start": 965.0, "end": 967.0, "text": "Wir gehen jetzt mal auf ein YouTube-Video von"}, {"id": 397, "start": 967.0, "end": 969.0, "text": "mir und wir sagen jetzt mal,"}, {"id": 398, "start": 969.0, "end": 971.0, "text": "ah, ok, ich weiß, der Sebaro"}, {"id": 399, "start": 971.0, "end": 973.0, "text": "hat da einen Kommentar geschrieben, irgendwie"}, {"id": 400, "start": 973.0, "end": 975.0, "text": "vorgestern, ich guck mal nach."}, {"id": 401, "start": 975.0, "end": 977.0, "text": "Ich hab keine Chance das zu finden."}, {"id": 402, "start": 977.0, "end": 979.0, "text": "Es gibt keine Pages, es gibt keine"}, {"id": 403, "start": 979.0, "end": 981.0, "text": "Suchmöglichkeiten, es gibt keine Pages. Ich"}, {"id": 404, "start": 981.0, "end": 983.0, "text": "weiß, dass man theoretisch suchen kann in den"}, {"id": 405, "start": 983.0, "end": 985.0, "text": "Kanal-Settings, aber das kann"}, {"id": 406, "start": 985.0, "end": 987.0, "text": "ich machen. Wenn du dein eigenes Kommentar"}, {"id": 407, "start": 987.0, "end": 989.0, "text": "suchst, oder ich unter einem anderen"}, {"id": 408, "start": 989.0, "end": 991.0, "text": "Video jemand gesehen hab, und mir gedacht"}, {"id": 409, "start": 991.0, "end": 993.0, "text": "hab ich Antwort gemacht, du findest das nicht. Du kannst"}, {"id": 410, "start": 993.0, "end": 995.0, "text": "komplett verknicken, du kannst komplett, du findest"}, {"id": 411, "start": 995.0, "end": 997.0, "text": "das nicht."}, {"id": 412, "start": 997.0, "end": 999.0, "text": "Warum gibt's hier endless scroll?"}, {"id": 413, "start": 999.0, "end": 1001.0, "text": "Nee, Steuerung F geht"}, {"id": 414, "start": 1001.0, "end": 1003.0, "text": "nicht. Guck mal, du siehst ja, der lädt immer"}, {"id": 415, "start": 1003.0, "end": 1005.0, "text": "dynamisch nach."}, {"id": 416, "start": 1005.0, "end": 1007.0, "text": "Der lädt immer dynamisch nach, also sprich,"}, {"id": 417, "start": 1007.0, "end": 1009.0, "text": "wenn das Kommentar, was jemand geschrieben hat,"}, {"id": 418, "start": 1009.0, "end": 1011.0, "text": "zwei Tage alt ist, dann ist es ja"}, {"id": 419, "start": 1011.0, "end": 1013.0, "text": "gar nicht geladen, wenn die Steuerung F"}, {"id": 420, "start": 1013.0, "end": 1017.0, "text": "total beknackt."}, {"id": 421, "start": 1017.0, "end": 1021.0, "text": "Also ich mein, man kann natürlich"}, {"id": 422, "start": 1021.0, "end": 1023.0, "text": "alles laden und dann Steuerung F"}, {"id": 423, "start": 1023.0, "end": 1025.0, "text": "drücken, aber"}, {"id": 424, "start": 1025.0, "end": 1027.0, "text": "das geht,"}, {"id": 425, "start": 1027.0, "end": 1029.0, "text": "das geht auch nicht,"}, {"id": 426, "start": 1029.0, "end": 1031.0, "text": "weil"}, {"id": 427, "start": 1031.0, "end": 1033.0, "text": "die richtigen Big Brain"}, {"id": 428, "start": 1033.0, "end": 1035.0, "text": "Seiten, die zum Beispiel Discast"}, {"id": 429, "start": 1035.0, "end": 1037.0, "text": "verwenden, die machen das so."}, {"id": 430, "start": 1037.0, "end": 1039.0, "text": "Ich hab ein gutes Beispiel,"}, {"id": 431, "start": 1039.0, "end": 1041.0, "text": "das Home Assistant Forum"}, {"id": 432, "start": 1041.0, "end": 1043.0, "text": "ist so ein Kandidat."}, {"id": 433, "start": 1045.0, "end": 1047.0, "text": "Das Home Assistant Forum"}, {"id": 434, "start": 1047.0, "end": 1049.0, "text": "ist so ein Kandidat, was ich auch"}, {"id": 435, "start": 1049.0, "end": 1051.0, "text": "in der Handhabung extrem"}, {"id": 436, "start": 1051.0, "end": 1053.0, "text": "nervig und umständlich finde."}, {"id": 437, "start": 1053.0, "end": 1055.0, "text": "Zum Beispiel,"}, {"id": 438, "start": 1055.0, "end": 1057.0, "text": "ich mein, es sieht"}, {"id": 439, "start": 1057.0, "end": 1059.0, "text": "aus wie eine normale Seite, ne?"}, {"id": 440, "start": 1059.0, "end": 1061.0, "text": "Ist es aber nicht. Ups, wenn man"}, {"id": 441, "start": 1061.0, "end": 1063.0, "text": "hier runter scrollt,"}, {"id": 442, "start": 1063.0, "end": 1065.0, "text": "sieht man, es wird dynamisch geladen"}, {"id": 443, "start": 1065.0, "end": 1067.0, "text": "und wenn man jetzt hoch scrollt,"}, {"id": 444, "start": 1067.0, "end": 1069.0, "text": "sieht man, es ist dynamisch unloaded."}, {"id": 445, "start": 1069.0, "end": 1071.0, "text": "Das heißt, ich kann die Seite gar nicht mehr ordentlich"}, {"id": 446, "start": 1071.0, "end": 1073.0, "text": "durchsuchen. Ich kann hier oben hingehen"}, {"id": 447, "start": 1073.0, "end": 1075.0, "text": "und irgendwo sagen,"}, {"id": 448, "start": 1075.0, "end": 1077.0, "text": "search this topic."}, {"id": 449, "start": 1077.0, "end": 1079.0, "text": "Aber warum muss"}, {"id": 450, "start": 1079.0, "end": 1081.0, "text": "ich ne Funktion, die im Browser"}, {"id": 451, "start": 1081.0, "end": 1083.0, "text": "eingebaut ist, nachbauen?"}, {"id": 452, "start": 1085.0, "end": 1087.0, "text": "Das ist total,"}, {"id": 453, "start": 1087.0, "end": 1089.0, "text": "total"}, {"id": 454, "start": 1089.0, "end": 1091.0, "text": "bescheuert einfach nur, ich versteh's"}, {"id": 455, "start": 1091.0, "end": 1093.0, "text": "nicht."}, {"id": 456, "start": 1095.0, "end": 1097.0, "text": "Ja, genau, es ist das Smartphone"}, {"id": 457, "start": 1097.0, "end": 1099.0, "text": "optimiert, aber auf dem Desktop geht's"}, {"id": 458, "start": 1099.0, "end": 1101.0, "text": "mal auf dem Keks. Was ist das?"}, {"id": 459, "start": 1101.0, "end": 1103.0, "text": "Ja, das versuche ich heute rauszukriegen,"}, {"id": 460, "start": 1103.0, "end": 1105.0, "text": "also ob es was taugt."}, {"id": 461, "start": 1105.0, "end": 1107.0, "text": "Es ist wohl ne bessere,"}, {"id": 462, "start": 1107.0, "end": 1109.0, "text": "nein, es ist keine bessere CSS-Variante."}, {"id": 463, "start": 1109.0, "end": 1111.0, "text": "Es ist ein, wie sagt man so schön,"}, {"id": 464, "start": 1111.0, "end": 1113.0, "text": "ein super Set von CSS, also sprich,"}, {"id": 465, "start": 1113.0, "end": 1115.0, "text": "du kannst"}, {"id": 466, "start": 1115.0, "end": 1117.0, "text": "CSS schreiben, allerdings kannst"}, {"id": 467, "start": 1117.0, "end": 1119.0, "text": "du ein bisschen mehr machen und der"}, {"id": 468, "start": 1119.0, "end": 1121.0, "text": "übersetzt dir das dann in CSS. Das ist"}, {"id": 469, "start": 1121.0, "end": 1123.0, "text": "wohl ziemlich simpel und relativ"}, {"id": 470, "start": 1123.0, "end": 1125.0, "text": "beliebt. Ich hab letztens in dem Video gesehen"}, {"id": 471, "start": 1125.0, "end": 1127.0, "text": "und es sah ziemlich pock aus, was der"}, {"id": 472, "start": 1127.0, "end": 1129.0, "text": "gemacht hat."}, {"id": 473, "start": 1129.0, "end": 1131.0, "text": "Ja, und das ist"}, {"id": 474, "start": 1131.0, "end": 1133.0, "text": "einfach Schrott, so diese"}, {"id": 475, "start": 1133.0, "end": 1135.0, "text": "Forumssache hier."}, {"id": 476, "start": 1135.0, "end": 1137.0, "text": "Guck, das ist, das ist"}, {"id": 477, "start": 1137.0, "end": 1139.0, "text": "ich mein,"}, {"id": 478, "start": 1139.0, "end": 1141.0, "text": "auf dem Handy"}, {"id": 479, "start": 1141.0, "end": 1143.0, "text": "kann ich's noch irgendwie nachvollziehen,"}, {"id": 480, "start": 1143.0, "end": 1145.0, "text": "aber ich wette mit euch,"}, {"id": 481, "start": 1145.0, "end": 1147.0, "text": "das Ding hat"}, {"id": 482, "start": 1147.0, "end": 1149.0, "text": "600"}, {"id": 483, "start": 1149.0, "end": 1151.0, "text": "also"}, {"id": 484, "start": 1151.0, "end": 1153.0, "text": "646 Posts"}, {"id": 485, "start": 1153.0, "end": 1155.0, "text": "hat das."}, {"id": 486, "start": 1155.0, "end": 1157.0, "text": "Würde man das"}, {"id": 487, "start": 1157.0, "end": 1159.0, "text": "laden, wäre das bei"}, {"id": 488, "start": 1159.0, "end": 1161.0, "text": "einem aktuellen Desktoprechner"}, {"id": 489, "start": 1161.0, "end": 1163.0, "text": "überhaupt kein Problem. 600"}, {"id": 490, "start": 1163.0, "end": 1165.0, "text": "solcher Posts zu laden ist wirklich easy"}, {"id": 491, "start": 1165.0, "end": 1167.0, "text": "as fuck. Aber selbst wenn man das nicht"}, {"id": 492, "start": 1167.0, "end": 1169.0, "text": "machen würde und man sagt,"}, {"id": 493, "start": 1169.0, "end": 1171.0, "text": "ok, man macht Pages mit 100"}, {"id": 494, "start": 1171.0, "end": 1173.0, "text": "Posts pro Seite, wäre ja"}, {"id": 495, "start": 1173.0, "end": 1175.0, "text": "auch noch ok. Aber so finde ich"}, {"id": 496, "start": 1175.0, "end": 1177.0, "text": "ist das, du kannst, das"}, {"id": 497, "start": 1177.0, "end": 1179.0, "text": "dumme ist, dass es komplett, und das"}, {"id": 498, "start": 1179.0, "end": 1181.0, "text": "mag ich einfach nicht, es hebelt die"}, {"id": 499, "start": 1181.0, "end": 1183.0, "text": "Browserfunktion aus. Scrollen geht nicht"}, {"id": 500, "start": 1183.0, "end": 1185.0, "text": "mehr, also sprich Browser scrollen ist"}, {"id": 501, "start": 1185.0, "end": 1187.0, "text": "kaputt, Browser Search ist"}, {"id": 502, "start": 1187.0, "end": 1189.0, "text": "kaputt, dann überschreibt"}, {"id": 503, "start": 1189.0, "end": 1191.0, "text": "das auch noch"}, {"id": 504, "start": 1191.0, "end": 1193.0, "text": "Standard Browser Shortcuts,"}, {"id": 505, "start": 1193.0, "end": 1195.0, "text": "Ctrl F, normalerweise das"}, {"id": 506, "start": 1195.0, "end": 1197.0, "text": "Ctrl F, hier ist Ctrl F das"}, {"id": 507, "start": 1197.0, "end": 1199.0, "text": "und scrollen geht nicht, man muss dieses eingebaute"}, {"id": 508, "start": 1199.0, "end": 1201.0, "text": "Scrollen verwenden, ich kann das überhaupt nicht ab."}, {"id": 509, "start": 1201.0, "end": 1203.0, "text": "So, deswegen"}, {"id": 510, "start": 1203.0, "end": 1205.0, "text": "verwende ich auch"}, {"id": 511, "start": 1205.0, "end": 1207.0, "text": "immer nur Old Reddit."}, {"id": 512, "start": 1207.0, "end": 1209.0, "text": "Old Reddit hat"}, {"id": 513, "start": 1209.0, "end": 1211.0, "text": "auch so schöne Sachen wie Pages."}, {"id": 514, "start": 1211.0, "end": 1213.0, "text": "Ich meine, Old Reddit sieht auch wirklich"}, {"id": 515, "start": 1213.0, "end": 1215.0, "text": "old aus,"}, {"id": 516, "start": 1215.0, "end": 1217.0, "text": "aber Old"}, {"id": 517, "start": 1217.0, "end": 1219.0, "text": "Reddit ist lustigerweise, obwohl es so"}, {"id": 518, "start": 1219.0, "end": 1221.0, "text": "alt ist, sogar viel schneller."}, {"id": 519, "start": 1229.0, "end": 1231.0, "text": "Ja, ich glaube die meisten, die"}, {"id": 520, "start": 1231.0, "end": 1233.0, "text": "öfters am Start sind, nutzen wirklich"}, {"id": 521, "start": 1233.0, "end": 1235.0, "text": "Old Reddit. Ich meine, es ist jetzt"}, {"id": 522, "start": 1235.0, "end": 1237.0, "text": "nicht, also es ist jetzt nicht"}, {"id": 523, "start": 1237.0, "end": 1239.0, "text": "die Ausgeburt der Schönheit, Old Reddit."}, {"id": 524, "start": 1239.0, "end": 1241.0, "text": "Wobei ich sagen muss,"}, {"id": 525, "start": 1241.0, "end": 1243.0, "text": "ich persönlich finde New Reddit jetzt auch"}, {"id": 526, "start": 1243.0, "end": 1245.0, "text": "nicht wahnsinnig hübsch."}, {"id": 527, "start": 1245.0, "end": 1247.0, "text": "Außer dass die die Seite"}, {"id": 528, "start": 1247.0, "end": 1249.0, "text": "nicht richtig verwenden. Ich weiß, man muss"}, {"id": 529, "start": 1249.0, "end": 1251.0, "text": "auf, äh, man muss auf"}, {"id": 530, "start": 1251.0, "end": 1253.0, "text": "Classic View schalten"}, {"id": 531, "start": 1253.0, "end": 1255.0, "text": "oder so."}, {"id": 532, "start": 1255.0, "end": 1257.0, "text": "Ich meine, es sieht ein bisschen"}, {"id": 533, "start": 1257.0, "end": 1259.0, "text": "neuer aus, bisschen schöner, aber so ne"}, {"id": 534, "start": 1259.0, "end": 1261.0, "text": "riesen Unterschied ist es nicht, und man darf eins"}, {"id": 535, "start": 1261.0, "end": 1263.0, "text": "nicht vergessen, pass mal auf, wenn man hier jetzt"}, {"id": 536, "start": 1263.0, "end": 1265.0, "text": "in die, ups, Moment, äh,"}, {"id": 537, "start": 1265.0, "end": 1267.0, "text": "ich muss erst mal auf Desktop View schalten."}, {"id": 538, "start": 1267.0, "end": 1269.0, "text": "Guckt euch mal an, wie viel"}, {"id": 539, "start": 1269.0, "end": 1271.0, "text": "der lädt, das ist Old Reddit,"}, {"id": 540, "start": 1271.0, "end": 1273.0, "text": "der lädt,"}, {"id": 541, "start": 1273.0, "end": 1275.0, "text": "guckt mal, 931"}, {"id": 542, "start": 1275.0, "end": 1277.0, "text": "Kilobyte"}, {"id": 543, "start": 1277.0, "end": 1279.0, "text": "und 2,5 MB"}, {"id": 544, "start": 1279.0, "end": 1281.0, "text": "Resources, lädt er bei Old Reddit."}, {"id": 545, "start": 1281.0, "end": 1283.0, "text": "Sondern das passt mal auf,"}, {"id": 546, "start": 1283.0, "end": 1285.0, "text": "ratet mal, wie viel New Reddit"}, {"id": 547, "start": 1285.0, "end": 1287.0, "text": "läuft. Ich hab letztens erst geguckt, was, also"}, {"id": 548, "start": 1287.0, "end": 1289.0, "text": "das ist Old Reddit, und New Reddit würde man"}, {"id": 549, "start": 1289.0, "end": 1291.0, "text": "sagen, was ist besser, neuer, schöner, optimierter."}, {"id": 550, "start": 1291.0, "end": 1293.0, "text": "Was meint er, wie viel New Reddit hat?"}, {"id": 551, "start": 1297.0, "end": 1299.0, "text": "Ja, Sebaro 10 MB ist gar nicht so schlecht."}, {"id": 552, "start": 1301.0, "end": 1303.0, "text": "Ich glaub, ich glaub, um die 10 MB Resources"}, {"id": 553, "start": 1303.0, "end": 1305.0, "text": "und irgendwie 3 MB Java Script"}, {"id": 554, "start": 1305.0, "end": 1307.0, "text": "oder sowas, guck mal mal."}, {"id": 555, "start": 1307.0, "end": 1309.0, "text": "Also erstens ist es viel"}, {"id": 556, "start": 1309.0, "end": 1311.0, "text": "langsamer, wie man sieht."}, {"id": 557, "start": 1311.0, "end": 1321.0, "text": "Äh, what the..."}, {"id": 558, "start": 1321.0, "end": 1323.0, "text": "Ok, ähm, also das"}, {"id": 559, "start": 1323.0, "end": 1325.0, "text": "lädt einfach mal 40 MB."}, {"id": 560, "start": 1325.0, "end": 1327.0, "text": "Was, der Chat"}, {"id": 561, "start": 1327.0, "end": 1329.0, "text": "ist weg?"}, {"id": 562, "start": 1331.0, "end": 1333.0, "text": "Oh, oh Stream ist"}, {"id": 563, "start": 1333.0, "end": 1335.0, "text": "da, oder?"}, {"id": 564, "start": 1337.0, "end": 1339.0, "text": "Ne,"}, {"id": 565, "start": 1339.0, "end": 1341.0, "text": "ne, ne, meine Vorschau"}, {"id": 566, "start": 1341.0, "end": 1343.0, "text": "ist nur broken."}, {"id": 567, "start": 1343.0, "end": 1345.0, "text": "Das ist alles, meine Vorschau"}, {"id": 568, "start": 1345.0, "end": 1347.0, "text": "ist broken, das ist nicht so schlimm."}, {"id": 569, "start": 1349.0, "end": 1351.0, "text": "Äh, die Chat Anzeige funktioniert"}, {"id": 570, "start": 1351.0, "end": 1353.0, "text": "auch noch."}, {"id": 571, "start": 1355.0, "end": 1357.0, "text": "Die Chat Anzeige ist da, die funktioniert."}, {"id": 572, "start": 1357.0, "end": 1359.0, "text": "Ich seh sie doch in meiner"}, {"id": 573, "start": 1359.0, "end": 1361.0, "text": "Vorschau."}, {"id": 574, "start": 1363.0, "end": 1365.0, "text": "Die ist auch nicht verdeckt."}, {"id": 575, "start": 1365.0, "end": 1367.0, "text": "Ach, der Chat"}, {"id": 576, "start": 1367.0, "end": 1369.0, "text": "blockiert die Anzeige. Ach, jetzt weiß ich,"}, {"id": 577, "start": 1369.0, "end": 1371.0, "text": "was ihr meint. Ach so, äh, wartet mal,"}, {"id": 578, "start": 1371.0, "end": 1373.0, "text": "ähm,"}, {"id": 579, "start": 1373.0, "end": 1375.0, "text": "äh, Moment,"}, {"id": 580, "start": 1375.0, "end": 1377.0, "text": "Moment, äh,"}, {"id": 581, "start": 1377.0, "end": 1379.0, "text": "äh,"}, {"id": 582, "start": 1379.0, "end": 1381.0, "text": "Hallo?"}, {"id": 583, "start": 1381.0, "end": 1383.0, "text": "Moment,"}, {"id": 584, "start": 1383.0, "end": 1385.0, "text": "kann man keine, ah jetzt,"}, {"id": 585, "start": 1385.0, "end": 1387.0, "text": "seht ihr es jetzt?"}, {"id": 586, "start": 1389.0, "end": 1391.0, "text": "Ja, guckt mal,"}, {"id": 587, "start": 1391.0, "end": 1393.0, "text": "40 MB,"}, {"id": 588, "start": 1393.0, "end": 1395.0, "text": "40 MB"}, {"id": 589, "start": 1395.0, "end": 1397.0, "text": "new reddit,"}, {"id": 590, "start": 1397.0, "end": 1399.0, "text": "und jetzt zum Vergleich"}, {"id": 591, "start": 1399.0, "end": 1401.0, "text": "old reddit, äh, ups,"}, {"id": 592, "start": 1401.0, "end": 1403.0, "text": "und jetzt zum Vergleich"}, {"id": 593, "start": 1403.0, "end": 1405.0, "text": "old reddit,"}, {"id": 594, "start": 1407.0, "end": 1409.0, "text": "äh,"}, {"id": 595, "start": 1409.0, "end": 1411.0, "text": "what? Alter,"}, {"id": 596, "start": 1411.0, "end": 1413.0, "text": "Firefox, äh,"}, {"id": 597, "start": 1413.0, "end": 1415.0, "text": "Chrome, was auch immer,"}, {"id": 598, "start": 1415.0, "end": 1417.0, "text": "mach einfach mal. So, und jetzt"}, {"id": 599, "start": 1417.0, "end": 1419.0, "text": "old reddit, ihr seht,"}, {"id": 600, "start": 1419.0, "end": 1421.0, "text": "ich mein, es ist klar, das neue"}, {"id": 601, "start": 1421.0, "end": 1423.0, "text": "reddit lädt ja auch irgendwelche Bilder"}, {"id": 602, "start": 1423.0, "end": 1425.0, "text": "und so vor, wobei man sich halt echt"}, {"id": 603, "start": 1425.0, "end": 1427.0, "text": "fragen muss, ne? Ich hab, ich hab mir"}, {"id": 604, "start": 1427.0, "end": 1429.0, "text": "das, wir machen das einfach anders, ich kann"}, {"id": 605, "start": 1429.0, "end": 1431.0, "text": "doch den hier unten einpletten, oder ich"}, {"id": 606, "start": 1431.0, "end": 1433.0, "text": "kann einfach links einpletten, das geht auch."}, {"id": 607, "start": 1433.0, "end": 1435.0, "text": "Was ich halt sehr fragwürdig finde, an"}, {"id": 608, "start": 1435.0, "end": 1437.0, "text": "a new reddit ist,"}, {"id": 609, "start": 1437.0, "end": 1439.0, "text": "oder am neuen"}, {"id": 610, "start": 1439.0, "end": 1441.0, "text": "reddit, guckt mal, ich hab, ich hab"}, {"id": 611, "start": 1441.0, "end": 1443.0, "text": "hier letztens, ich hab mir das letztens mal,"}, {"id": 612, "start": 1443.0, "end": 1445.0, "text": "ähm,"}, {"id": 613, "start": 1445.0, "end": 1447.0, "text": "letztens mal in Ruhe angeschaut, da sind"}, {"id": 614, "start": 1447.0, "end": 1449.0, "text": "Videovorschau dabei."}, {"id": 615, "start": 1449.0, "end": 1451.0, "text": "Wenn ihr hier durchguckt."}, {"id": 616, "start": 1451.0, "end": 1453.0, "text": "Hier, Dash, da sind Videovorschau"}, {"id": 617, "start": 1453.0, "end": 1455.0, "text": "dabei, ich verstehe"}, {"id": 618, "start": 1455.0, "end": 1457.0, "text": "den Sinn, ich verstehe den Sinn davon nicht, warum reddit"}, {"id": 619, "start": 1457.0, "end": 1459.0, "text": "Videos vorlädt. Kann"}, {"id": 620, "start": 1459.0, "end": 1461.0, "text": "man nicht einfach, nen thumb,"}, {"id": 621, "start": 1461.0, "end": 1463.0, "text": "äh, äh, äh, äh, äh, äh, äh, äh, äh"}, {"id": 622, "start": 1463.0, "end": 1465.0, "text": "preview thumbnail anzeigen?"}, {"id": 623, "start": 1465.0, "end": 1467.0, "text": "Wo siehst du"}, {"id": 624, "start": 1467.0, "end": 1469.0, "text": "da 40 MB hier,"}, {"id": 625, "start": 1469.0, "end": 1471.0, "text": "äh, 15 MB, 15 MB"}, {"id": 626, "start": 1471.0, "end": 1473.0, "text": "transfered und, ach"}, {"id": 627, "start": 1473.0, "end": 1475.0, "text": "Moment, warte mal,"}, {"id": 628, "start": 1475.0, "end": 1484.28, "text": "kann das sein dass transfer das was übertragen ist und 14 mb das überpackende das entpackende"}, {"id": 629, "start": 1484.28, "end": 1494.08, "text": "entpackt entpackte was ist der unterschied zwischen transfer und und resources transfer"}, {"id": 630, "start": 1494.08, "end": 1504.88, "text": "resources developer tools aha excellent stackoverflow what is the difference between transfer and resources"}, {"id": 631, "start": 1504.88, "end": 1515.68, "text": "ok ok ok ok aha also was kommt raus compress size of all resources ok dann dann habe ich das"}, {"id": 632, "start": 1515.68, "end": 1521.0, "text": "falsch interpretiert dann sind das 14 mb ja aber das macht ja noch das macht ja das macht das"}, {"id": 633, "start": 1521.0, "end": 1533.0, "text": "verhältnis ja noch schlechter es sind 14,6 transfer und old und old sind plus 968 kb das"}, {"id": 634, "start": 1533.0, "end": 1543.48, "text": "ist 14 mal größer oder 15 mal größer was machen die denn da ja genug genug ausgekotzt über reddit"}, {"id": 635, "start": 1543.48, "end": 1553.64, "text": "ich finde reddit immer noch eine super plattform aber new reddit ist echt so eine beleidigung ich"}, {"id": 636, "start": 1553.64, "end": 1561.6, "text": "meine wozu muss man hier jetzt videos vorladen ok ich muss mir noch den classic view angucken"}, {"id": 637, "start": 1561.6, "end": 1579.32, "text": "ob es da ob es da besser ist nach moment merkt merkt moment merkt er sich nicht ob man den komp"}, {"id": 638, "start": 1579.32, "end": 1590.0, "text": "welchen view der merkt sich doch mal welchen view man an hatte ja die videos werden direkt"}, {"id": 639, "start": 1590.0, "end": 1600.64, "text": "abgespielt ist auch eine sache die finde ich so schön moment merkt merkt er merkt er sich"}, {"id": 640, "start": 1600.64, "end": 1611.72, "text": "nicht was man eingestellt das merkt er sich doch normalerweise ok wir ignorieren das jetzt"}, {"id": 641, "start": 1611.72, "end": 1616.64, "text": "einfach mal aber nur wenn man eingeloggt ist ja das ist ja auch so ein ding das geht natürlich"}, {"id": 642, "start": 1616.64, "end": 1623.72, "text": "technisch nur wenn man eingeloggt ist keine ahnung was reddit los ist wie dem aus sei wir"}, {"id": 643, "start": 1623.72, "end": 1633.08, "text": "machen erstmal hier alles schön sauber und letzten mal zack weg wunderbar so da widmen wir uns mal"}, {"id": 644, "start": 1633.08, "end": 1642.12, "text": "dem eigentlichen thema des streams und ich mache mal kurz visual studio code auf codra ne wir machen"}, {"id": 645, "start": 1642.12, "end": 1648.96, "text": "mal wir machen mal einen neuen ordner haben noch irgendwo tmp lull ok tmp tmp lull besser"}, {"id": 646, "start": 1648.96, "end": 1658.6, "text": "name ich habe keine ahnung mehr was es ist ich lasse es mal kurz da mk dir tmp so perfekt"}, {"id": 647, "start": 1658.6, "end": 1663.84, "text": "beste deswegen finde ich auch meine eigenen projekte immer so gut weil ich diese toll benenne"}, {"id": 648, "start": 1663.84, "end": 1676.4, "text": "beide mal es gibt eine lösung für jubel mit twitch ok sehr gut exzellent habe ich im chat"}, {"id": 649, "start": 1676.4, "end": 1689.36, "text": "irgendwas übersehen kann man schauen es was es gibt jetzt twitch soundtrack für lizenzfreie"}, {"id": 650, "start": 1689.36, "end": 1696.08, "text": "musik echt wo denn ich kenne mich ich kenne mich doch auf twitch nicht aus weißte noch aber ich"}, {"id": 651, "start": 1696.08, "end": 1699.52, "text": "habe ich noch nicht gesehen ich habe da bestimmt ich habe da garantiert eine benachrichtigung"}, {"id": 652, "start": 1699.52, "end": 1726.92, "text": "drüber bekommen ich glaube ich habe nichts übersehen nope sieht gut aus warum kein"}, {"id": 653, "start": 1726.92, "end": 1731.84, "text": "aiya support weil ich kann fft moment was ist hier los"}, {"id": 654, "start": 1731.84, "end": 1743.36, "text": "warum geht das nicht sekunde das muss man das muss man gleich gleich ändern das muss"}, {"id": 655, "start": 1743.36, "end": 1749.32, "text": "man gleich das muss jetzt weg das muss man gleich ändern und zwar er uns"}, {"id": 656, "start": 1749.32, "end": 1768.68, "text": "mein wo ist es denn ja bett und steve enabled gift emotes animated alles klar jetzt geht's"}, {"id": 657, "start": 1768.68, "end": 1778.0, "text": "ich refresh mal refreshen und jetzt ist es nicht mal dark theme ok das wird jetzt mal"}, {"id": 658, "start": 1778.0, "end": 1786.24, "text": "testen exzellent cute chat am werk"}, {"id": 659, "start": 1786.24, "end": 1802.32, "text": "sehr gut was kannst du mal anschauen kann damit was passieren wenn man da was ändert"}, {"id": 660, "start": 1802.32, "end": 1811.6, "text": "mal gucken ich glaube dass ich weiß nicht ob twitch das so gerne hat wenn man das im"}, {"id": 661, "start": 1811.6, "end": 1817.88, "text": "stream bespricht ehrlich gesagt das ist eventuell eventuell ist so was sogar monka tos ich weiß"}, {"id": 662, "start": 1817.88, "end": 1828.64, "text": "es gar nicht ich könnte mir nur vorstellen dass sie das nicht so geil finden also wenn"}, {"id": 663, "start": 1828.64, "end": 1835.48, "text": "ich twitch wäre würde ich wahrscheinlich nicht so geil finden twitch broadcast soundtrack"}, {"id": 664, "start": 1835.48, "end": 1845.64, "text": "melde dich für die lavate liste an lofi hip hop beats electronic rap ok das ist ja schon"}, {"id": 665, "start": 1845.64, "end": 1850.12, "text": "mal nicht meins aber für den hintergrund sound ist es ok"}, {"id": 666, "start": 1850.12, "end": 1869.6, "text": "das ist ein bild gbd ok naja wir widmen uns jetzt mal der eigentlichen sache was wir heute"}, {"id": 667, "start": 1869.6, "end": 1879.64, "text": "machen wollen und zwar das da wollte ich mir angucken so und also was ich im vorfeld rüber"}, {"id": 668, "start": 1879.64, "end": 1885.0, "text": "rausgekriegt habe ist erstens dass die seite kacke aussieht von denen das heißt was wir"}, {"id": 669, "start": 1885.0, "end": 1888.04, "text": "jetzt erstmal machen muss es den dark reader anschalten damit man das jetzt überhaupt"}, {"id": 670, "start": 1888.04, "end": 1895.2, "text": "ordentlich erkennt jetzt jetzt ist das schon ein bisschen erträglicher und ich war ich"}, {"id": 671, "start": 1895.2, "end": 1901.52, "text": "war mal ein bisschen größer das ganze der zu lull reader genau übrigens habe ich hab"}, {"id": 672, "start": 1901.52, "end": 1905.32, "text": "habe ich schon mal in letzter zeit erzählt wie geil meine heizungsüberwachung funktioniert"}, {"id": 673, "start": 1905.32, "end": 1908.8, "text": "ich weiß das habe ich jeden stream erzählt aber ich bin immer noch begeistert wie gut"}, {"id": 674, "start": 1908.8, "end": 1912.56, "text": "meine heizungsüberwachung funktioniert nur noch mal angemerkt nebenbei ich weiß ich hab"}, {"id": 675, "start": 1912.56, "end": 1918.32, "text": "die letzten 50 streams gefühlt erzählt so also was ich jetzt was ich verstanden habe"}, {"id": 676, "start": 1918.32, "end": 1926.84, "text": "davon was das ganze ist das ist quasi ein bisschen sowas wie templates in c++ nur nicht"}, {"id": 677, "start": 1926.84, "end": 1941.12, "text": "ganz so schlimm also sprich man kann css schreiben mit ein bisschen mehr funktion und dann macht"}, {"id": 678, "start": 1941.12, "end": 1946.16, "text": "es ein gültiges css daraus und man selbst muss halt weniger schreiben also man hat zum"}, {"id": 679, "start": 1946.16, "end": 1950.0, "text": "beispiel variablen die er überall einsetzen kann man hat irgendwie so eine art kann so"}, {"id": 680, "start": 1950.0, "end": 1954.6, "text": "eine art funktion machen die man die automatisch überall einsetzt man kann halt keine sachen"}, {"id": 681, "start": 1954.6, "end": 1963.04, "text": "machen die css grundsätzlich nicht kann also wenn css zum beispiel keine sachen berechnen"}, {"id": 682, "start": 1963.04, "end": 1969.2, "text": "kann dann kann sas auch dynamisch keine sachen berechnen also man kann mit sas nichts machen"}, {"id": 683, "start": 1969.2, "end": 1975.08, "text": "wo der browser keinen support für hat was man allerdings machen kann ist man kann wohl"}, {"id": 684, "start": 1975.08, "end": 1979.88, "text": "einfacher komplexes css schreiben ohne dass man fünf seiten css schreiben muss"}, {"id": 685, "start": 1979.88, "end": 1989.6, "text": "also wir probieren das wir probieren es jetzt einfach mal aus das machen wir übrigens"}, {"id": 686, "start": 1989.6, "end": 1994.32, "text": "nicht wir machen folgendes das habe ich das habe ich in einem video gesehen es gibt eine"}, {"id": 687, "start": 1994.32, "end": 2009.64, "text": "original studio addon das nennt sich das war es nicht das hier live sas compiler damit"}, {"id": 688, "start": 2009.64, "end": 2013.12, "text": "kann man sich den browser man sieht es hier da kann man sich den browser vorschauen machen"}, {"id": 689, "start": 2013.12, "end": 2019.64, "text": "man tippt hier und der übersetzt das nebenbei im hintergrund und man kann auch automatisch"}, {"id": 690, "start": 2019.64, "end": 2026.08, "text": "den browser refreshen lassen das ist eigentlich wirklich ganz nützlich der ist ein update"}, {"id": 691, "start": 2026.08, "end": 2034.28, "text": "available ja ok wir wollen mal nicht so sein wir lassen ihn mal wischl studio code update"}, {"id": 692, "start": 2034.28, "end": 2045.08, "text": "machen oh ich habe das offizielle richtig höchst offizielle wischl studio code installiert"}, {"id": 693, "start": 2045.08, "end": 2057.4, "text": "erstmal paketquellen updaten nothing to update ok ich lasse ich lasse ihn einmal kurz wischl"}, {"id": 694, "start": 2057.4, "end": 2065.0, "text": "studio neu installieren nicht dass wir irgendwelche bugs noch finden die in der neuen version"}, {"id": 695, "start": 2065.0, "end": 2075.96, "text": "gefixt denn das geht ja relativ zackig der chat ist wieder an der grenze zu monka toss"}, {"id": 696, "start": 2075.96, "end": 2086.36, "text": "ich sehe es schon"}, {"id": 697, "start": 2086.36, "end": 2090.84, "text": "heute schon wieder stream so ja ich habe ich glaube ich habe fast eine woche am stück"}, {"id": 698, "start": 2090.84, "end": 2100.2, "text": "oder so jetzt gestreamt wartet mal ne ne ne ne ne ne max ruhig ähm moment wo ihr schedule"}, {"id": 699, "start": 2100.2, "end": 2108.52, "text": "guckt mal hier heute gestern vorgestern kann man da weiter zurück ne so ne kalender an"}, {"id": 700, "start": 2108.52, "end": 2114.04, "text": "sich hat die javascript die javascript leute von twitch überfordert aber hier unter videos"}, {"id": 701, "start": 2114.04, "end": 2123.56, "text": "kann man gucken hier guckt mal heute gestern vorgestern vorvorgestern zweimal zweimal sogar"}, {"id": 702, "start": 2123.56, "end": 2129.32, "text": "äh ok ok ne hier waren mal hier waren mal drei tage stoppt dazwischen dann aber ich"}, {"id": 703, "start": 2129.32, "end": 2133.72, "text": "hab doch ich hab ganz schön viel gestreamt in letzter tage guckt doch mal an hier 1 2"}, {"id": 704, "start": 2133.72, "end": 2141.16, "text": "3 4 5 6 7 8 9 10 11 12 15 16 16 16 ne ich hab jetzt noch ein paar tippen und dann"}, {"id": 705, "start": 2141.16, "end": 2158.32, "text": "16 16 ne ich kann nicht zählen warte mal es sind 5 äh 15 15 15 streams diesen monat schon"}, {"id": 706, "start": 2158.32, "end": 2163.84, "text": "also quasi jeder zweite tag so also das ist für meine verhältnisse schon wirklich viel"}, {"id": 707, "start": 2163.84, "end": 2174.36, "text": "so hat er jetzt geupdatet exzellent willst du sass oder css machen äh äh oder scss will"}, {"id": 708, "start": 2174.36, "end": 2179.44, "text": "ich machen ich will scss machen ich kann also ich kann mal ganz kurz was zum unterschied"}, {"id": 709, "start": 2179.44, "end": 2186.6, "text": "sagen sofern ich das äh richtig verstanden hab also man kann man also wir müssen jetzt"}, {"id": 710, "start": 2186.6, "end": 2196.28, "text": "erstmal index html machen damit man was sieht index html und jetzt einen live server aufmachen"}, {"id": 711, "start": 2196.28, "end": 2207.32, "text": "damit man was sieht so ahjaja also viel steht ja auf der seite noch nicht drauf sass test"}, {"id": 712, "start": 2207.32, "end": 2212.32, "text": "so und jetzt können wir ein paar files anlegen also es gibt die möglichkeit dass man styles"}, {"id": 713, "start": 2212.32, "end": 2220.04, "text": "punkt scss verwendet und dass man styles punkt sass verwendet so der unterschied ist jetzt"}, {"id": 714, "start": 2220.04, "end": 2226.12, "text": "folgendes vielleicht haben wir hier so gerne mit unter auf der webseite vielleicht sogar"}, {"id": 715, "start": 2226.12, "end": 2231.96, "text": "ein beispiel dafür das problem ist die webseite ist mit dem dark reader kaputt leute sonnenbrille"}, {"id": 716, "start": 2231.96, "end": 2242.88, "text": "aufziehen difference sass sts also das eine ist mit einrückung das andere ist wie css"}, {"id": 717, "start": 2242.88, "end": 2248.72, "text": "bloß ein bisschen mehr ist visual studio gratis ja ich weiß aber nicht ob du vielleicht"}, {"id": 718, "start": 2248.72, "end": 2253.6, "text": "nicht eher visual studio code meinst also visual studio selber ist die community variante"}, {"id": 719, "start": 2253.6, "end": 2265.72, "text": "gratis die normale also bei von der normalen visual studio das ist das normale visual studio"}, {"id": 720, "start": 2265.72, "end": 2271.24, "text": "gibt es eine community variante die kostet nichts die standard professional kostet was"}, {"id": 721, "start": 2271.24, "end": 2283.32, "text": "und visual studio code ist grundsätzlich kostenlos ja genau hier hat man schönes beispiel guckt"}, {"id": 722, "start": 2283.32, "end": 2296.92, "text": "also scss ist einfach normales css mit also jedes gültige css ist gültiges scss an dem"}, {"id": 723, "start": 2296.92, "end": 2305.44, "text": "moment das ist ein doofes beispiel hier ist ein gutes beispiel so allerdings ist nicht"}, {"id": 724, "start": 2305.44, "end": 2312.44, "text": "jedes gültige css gültiges sass also sass das war der ursprüng war glaube ich die ursprüngliche"}, {"id": 725, "start": 2312.44, "end": 2316.92, "text": "variante das kommt noch aus ruby zeiten aber da muss man diesen diesen mist hier mit einrückung"}, {"id": 726, "start": 2316.92, "end": 2322.6, "text": "schreiben das ist aber wirklich paint champ ich glaube das verwendet ehrlich gesagt auch"}, {"id": 727, "start": 2322.6, "end": 2330.72, "text": "gar keiner mehr so ach guck hier kann man sogar hier kann man sogar dazwischen umschalten"}, {"id": 728, "start": 2330.72, "end": 2335.44, "text": "so siehts mit scss aus und so siehts mit sass aus es sieht jetzt erstmal praktischer aus"}, {"id": 729, "start": 2335.44, "end": 2339.56, "text": "wenn du es mit mit sass machst weil du kannst dir semi kolons sparen du kannst dir klammer"}, {"id": 730, "start": 2339.56, "end": 2346.8, "text": "sparen und was kannst du dir noch sparen ich glaube das wars aber dementsprechend ist es"}, {"id": 731, "start": 2346.8, "end": 2353.32, "text": "ist es eher eine neue eigene sprache als ein extended css und es wird wahrscheinlich später"}, {"id": 732, "start": 2353.32, "end": 2357.48, "text": "sogar noch ein bisschen komplizierter ja guck mal hier hier musste dann das als einrückung"}, {"id": 733, "start": 2357.48, "end": 2363.56, "text": "machen und sowas also ganz ehrlich dann mache ich es lieber so dann ist es css aber ein"}, {"id": 734, "start": 2363.56, "end": 2370.12, "text": "bisschen enhance des css also ich werde kein sass machen das ganze projekt nennt sich halt"}, {"id": 735, "start": 2370.12, "end": 2377.52, "text": "sass aber ich mache scss und habt ihr denn mal frage falls es jemand von euch verwendet"}, {"id": 736, "start": 2377.52, "end": 2387.28, "text": "habt ihr habt ihr projekte die sass verwenden oder eher scss so wir müssen noch glaube"}, {"id": 737, "start": 2387.28, "end": 2396.8, "text": "ich das stylecheat einbinden dass das funktioniert link styles excellent so und jetzt und jetzt"}, {"id": 738, "start": 2396.8, "end": 2402.68, "text": "und jetzt erstmal das das allerwichtigste was wir einbinden müssen to smart redwich"}, {"id": 739, "start": 2402.68, "end": 2425.44, "text": "tv so copy image location image ah yes also die wichtigste sache haben wir schonmal erledigt"}, {"id": 740, "start": 2425.44, "end": 2441.0, "text": "so jetzt kanns ja weitergehen exquisite ja ok wie fangen wir jetzt am besten an styles"}, {"id": 741, "start": 2441.0, "end": 2455.92, "text": "scss so ich würd sagen wir gucken uns einfach mal die beispiele an du musst die css ein"}, {"id": 742, "start": 2455.92, "end": 2458.68, "text": "stimmt du hast recht ja klar ja aber die hat er noch gar nicht generiert aber du hast"}, {"id": 743, "start": 2458.68, "end": 2464.44, "text": "recht ich muss die css datei einbinden weil der browser selbst versteht kein scss der"}, {"id": 744, "start": 2464.44, "end": 2475.6, "text": "scss versteht plus css so genau man muss hier unten noch das ne sass hä moment hab ich"}, {"id": 745, "start": 2475.6, "end": 2480.72, "text": "das hab ich das vorhin gar nicht installiert hab ich nur hab ich nur rumgelabert ich glaube"}, {"id": 746, "start": 2480.72, "end": 2485.52, "text": "ich hab nur rumgelabert hab das gar nicht installiert excellent so wie man das kennt"}, {"id": 747, "start": 2485.52, "end": 2494.72, "text": "jetzt haben wir es hier watch stars alles klar kann man den kann man den kram hier auch"}, {"id": 748, "start": 2494.72, "end": 2499.6, "text": "mal ordentlich zumachen so guck jetzt seht ihr jetzt hat das ding jetzt als erst datei"}, {"id": 749, "start": 2499.6, "end": 2505.72, "text": "generiert jetzt hat das ding jetzt als erst datei generiert das heißt wir können jetzt"}, {"id": 750, "start": 2505.72, "end": 2510.12, "text": "anfangen wir machen mal wir fangen mal easy an weil ihr wisst ja ich bin jetzt nicht"}, {"id": 751, "start": 2510.12, "end": 2516.72, "text": "der allergroße größte frontend checker aber der chat der chat kennt sich aus also"}, {"id": 752, "start": 2516.72, "end": 2523.68, "text": "mal nachbar da machen wir jetzt irgendwie so links oder so rein ich muss mal kurz auf"}, {"id": 753, "start": 2523.68, "end": 2528.72, "text": "dem zweiten bildschirm was aufmachen dass ich ein bisschen abgucken kann wie das bei"}, {"id": 754, "start": 2528.72, "end": 2536.44, "text": "der anderen seite genau jetzt kannst du hier einfach links rein machen so und jetzt sollte"}, {"id": 755, "start": 2536.44, "end": 2542.2, "text": "sie sollte sich noch eigentlich refreshen oder also die links sind leer null aber irgendwie"}, {"id": 756, "start": 2542.2, "end": 2554.4, "text": "home aber sieht das das sieht ja sieht ja schön aus wie 1995 jetzt home wifi ich will"}, {"id": 757, "start": 2554.4, "end": 2559.28, "text": "ja demnächst für ein esp 32 so ein kleines admin frontend machen und irgendwie info oder"}, {"id": 758, "start": 2559.28, "end": 2570.48, "text": "sowas irgendwie so reicht nach bitte in den body muss man nach achso ja ich finde ja interessant"}, {"id": 759, "start": 2570.48, "end": 2577.24, "text": "dass das überhaupt funktioniert wahrscheinlich macht er das für das macht der browser schon"}, {"id": 760, "start": 2577.24, "end": 2589.56, "text": "für ein vermute ich mal ich denke mal der browser macht es schon für ein der fix mein"}, {"id": 761, "start": 2589.56, "end": 2599.76, "text": "schlechtes mein schlechtes hat im elm macht er macht er für mich ganz so gut und jetzt"}, {"id": 762, "start": 2599.76, "end": 2605.92, "text": "und jetzt fangen wir mal an mit mit mit stylesorn als erstes machen wir hier mal naf und dann"}, {"id": 763, "start": 2605.92, "end": 2610.32, "text": "gucken wir uns mal beispiele an so wir machen jetzt wir machen jetzt wir machen gleich am"}, {"id": 764, "start": 2610.32, "end": 2623.0, "text": "anfang einer margin bottom 50 pixel dass das bild dann nicht so rein was exquisite so und"}, {"id": 765, "start": 2623.0, "end": 2627.36, "text": "jetzt gucken wir uns mal beispiele an was man alles so machen kann also man kann variablen"}, {"id": 766, "start": 2627.36, "end": 2638.76, "text": "verwenden das geht mittlerweile geht das in css auch was ist jetzt der vorteil davon wenn"}, {"id": 767, "start": 2638.76, "end": 2648.48, "text": "ich das variablen nehme anstatt sss anstatt css variablen wahrscheinlich kann ich die"}, {"id": 768, "start": 2648.48, "end": 2654.56, "text": "in wahrscheinlich kann ich die dann ins das funktionen und so verwenden was mit normalen"}, {"id": 769, "start": 2654.56, "end": 2665.92, "text": "css variablen nicht kann"}, {"id": 770, "start": 2665.92, "end": 2670.56, "text": "desorption schreibt kann mir wer erklären warum der bettel net launcher innerhalb von"}, {"id": 771, "start": 2670.56, "end": 2678.88, "text": "19 stunden fast 205 hits zu telemetrie bettel net aufbauen will ja klar der will wissen"}, {"id": 772, "start": 2678.88, "end": 2683.76, "text": "was du machst warum du nicht spielst du sollst spielen und gefälligst loot boxen und und"}, {"id": 773, "start": 2683.76, "end": 2693.48, "text": "microtransactions kauf und die versuchen rauszubekommen warum kaufst du keine ich glaube"}, {"id": 774, "start": 2693.48, "end": 2698.4, "text": "wenn ich auf aliexpress wäre eine stunde lang da würde der schon 705 sachen zurückschicken"}, {"id": 775, "start": 2698.4, "end": 2703.88, "text": "kanns ja plocken mal gucken ob das damit klar kommt ok also dann dann probieren wir das"}, {"id": 776, "start": 2703.88, "end": 2710.16, "text": "jetzt mal also sprich wir können variablen verwenden das bedeutet ich könnte da jetzt"}, {"id": 777, "start": 2710.16, "end": 2718.24, "text": "sowas machen wie sagen wir mal keine ahnung blu wie sinnvoll das ist sei mal dahingestellt"}, {"id": 778, "start": 2718.24, "end": 2727.2, "text": "blu und dann machen wir irgendwie blu toll wobei nie komm wir machen machen ein bisschen"}, {"id": 779, "start": 2727.2, "end": 2739.16, "text": "schöneren ein bisschen schöneren plauton irgendwie sowas da so exzellent mach color"}, {"id": 780, "start": 2739.16, "end": 2747.92, "text": "chuck norris was ist color chuck norris das kenne ich nicht was ist color chuck norris"}, {"id": 781, "start": 2747.92, "end": 2760.84, "text": "ist das irgendein dienst oder ist koffee purple geh mal weg ne ne ne behalte ich behalte das"}, {"id": 782, "start": 2760.84, "end": 2775.68, "text": "andere so 128 128 240 exquisite color so muss das so muss das sein kannst in sass auch schleifen"}, {"id": 783, "start": 2775.68, "end": 2782.56, "text": "bauen und generieren aber braucht man das in seinen man kann in sass schleifen generieren"}, {"id": 784, "start": 2782.56, "end": 2788.92, "text": "ne oder also ja du kannst wahrscheinlich so so so ein bisschen wie wie pre processor"}, {"id": 785, "start": 2788.92, "end": 2795.8, "text": "und dinger in c++ man also sprich eine schleife die dann quasi unter der haube einfach nur"}, {"id": 786, "start": 2795.8, "end": 2800.28, "text": "möglichst viel css generiert das könnte ich mir vorstellen dass das geht aber zur laufzeit"}, {"id": 787, "start": 2800.28, "end": 2809.36, "text": "kann er nicht sein weil zur laufzeit kann er css selber keine schleifen 69 68 420 perfekt"}, {"id": 788, "start": 2809.36, "end": 2812.8, "text": "so ich lasse ich lasse das jetzt erst mal ok das heißt man kann jetzt variablen anlegen"}, {"id": 789, "start": 2812.8, "end": 2816.76, "text": "so das heißt wenn ich war ja ok wir legen wir legen noch mal ein bisschen mehr variablen"}, {"id": 790, "start": 2816.76, "end": 2826.52, "text": "also wir machen noch mal blu blu kann background background was ich was für ein background"}, {"id": 791, "start": 2826.52, "end": 2853.64, "text": "nehmen 11111 so bg der ist so background wobei ich will ich will ich will ein light light"}, {"id": 792, "start": 2853.64, "end": 2863.12, "text": "background haben light background ist jetzt ein bisschen angenehmer irgendwie wie sowas"}, {"id": 793, "start": 2863.12, "end": 2870.44, "text": "das klingt gut so so was können wir sonst noch machen keine ahnung text text brauchen"}, {"id": 794, "start": 2870.44, "end": 2877.76, "text": "wir auch immer text machen wir einfach irgendwas irgendwas helles und dann brauchen dann ist"}, {"id": 795, "start": 2877.76, "end": 2881.76, "text": "egal mehr brauchen wir irgendwie wir können auch sowas wie wie warning oder oder sowas"}, {"id": 796, "start": 2881.76, "end": 2886.84, "text": "machen da machen wir irgendetwas orangsch aber orangsch weiß ich aus dem kopf nicht"}, {"id": 797, "start": 2886.84, "end": 2895.32, "text": "was schöne orangsturn ist so das reicht dann zum ausprobieren erst mal aus ja orange das"}, {"id": 798, "start": 2895.32, "end": 2902.36, "text": "sieht eklig aus exzellent orange genauso muss das sein so und da kann ich jetzt was machen"}, {"id": 799, "start": 2902.36, "end": 2908.96, "text": "mit kleinen tipp man kann durch klick auf den wert im color picker die formatierung"}, {"id": 800, "start": 2908.96, "end": 2922.16, "text": "ändern von rgb zu hex ah oh exzellent der chat ist wie immer heute da reicht das schon"}, {"id": 801, "start": 2922.16, "end": 2930.68, "text": "über der chat ist heute wieder hier on point aber was habe ich davon jetzt in meinem prinzip"}, {"id": 802, "start": 2930.68, "end": 2940.2, "text": "die gleiche farbe aber es heißt ich kann hier oben das heißt ich kann hier oben so"}, {"id": 803, "start": 2940.2, "end": 2963.56, "text": "jetzt machen super gut so das heißt ich kann jetzt schon mal bei meiner bei meiner nafbar"}, {"id": 804, "start": 2963.56, "end": 2970.68, "text": "wie mache ich denn das jetzt kann ich jetzt kann ich jetzt einfach sowas sagen wie was"}, {"id": 805, "start": 2970.68, "end": 2977.2, "text": "was ich background oder so so sie im background color was ist eigentlich der unterschied zwischen"}, {"id": 806, "start": 2977.2, "end": 2988.16, "text": "background und background color wobei gibt es background überhaupt so und da jetzt bg"}, {"id": 807, "start": 2988.16, "end": 3002.28, "text": "da sieht er scheiße aus aber ich brauche etwas graues oder sowas was ist das ist das"}, {"id": 808, "start": 3002.28, "end": 3022.08, "text": "grau ok bisschen so ok besser also ich meine es sieht mega beschissen aus ja background"}, {"id": 809, "start": 3022.08, "end": 3034.28, "text": "ist ein short mit mehreren attributen für welches projekt lernst du jetzt css einfach"}, {"id": 810, "start": 3034.28, "end": 3039.2, "text": "um es zu können dass wo wir wieder bei dem eigentlichen bei der eigentlichen sache sind"}, {"id": 811, "start": 3039.2, "end": 3044.68, "text": "die ich in jedem stream sage wo es immer darum geht so nach dem motto mit was fängt man"}, {"id": 812, "start": 3044.68, "end": 3050.72, "text": "am besten an oder was oder was soll ich machen oder oder oder besser noch wie kann ich dafür"}, {"id": 813, "start": 3050.72, "end": 3055.4, "text": "sorgen dass ich nach der ausbildung das machen kann was ich will einfach lernen wenn es euch"}, {"id": 814, "start": 3055.4, "end": 3061.2, "text": "spaß macht also wenn euch was interessiert einfach lernen einfach big brain modus aktivieren"}, {"id": 815, "start": 3061.2, "end": 3069.6, "text": "und sich das angucken weil man kann es immer mal gebrauchen man kann es immer mal gebrauchen"}, {"id": 816, "start": 3069.6, "end": 3080.72, "text": "und nachdem man an frontend sachen eh nicht dran vorbeikommt color palettes ja ich ok"}, {"id": 817, "start": 3080.72, "end": 3089.2, "text": "ok das das muss nicht schön sein ich mache mal ein bisschen kleiner so jetzt sagen wir"}, {"id": 818, "start": 3089.2, "end": 3099.92, "text": "erstmal dass das ding noch padding oder so 20 so es ist ein bisschen größer das sieht"}, {"id": 819, "start": 3099.92, "end": 3110.12, "text": "halt richtig richtig hängen geblieben aus ja ok exzellent so und jetzt habe ich gesehen"}, {"id": 820, "start": 3110.12, "end": 3116.8, "text": "ein feature von von sass ist dass man jetzt hier drinne beispielsweise schreiben kann"}, {"id": 821, "start": 3116.8, "end": 3120.8, "text": "ich möchte dass alle meine links das habe ich vorhin schon gesehen das mal gucken wo"}, {"id": 822, "start": 3120.8, "end": 3130.36, "text": "das steht hier genau also normales normales css ist ja so was bitte für body margin padding"}, {"id": 823, "start": 3130.36, "end": 3144.32, "text": "hinzu alles klar der chat der kennt sich da besser aus als ich jetzt exzellent so also"}, {"id": 824, "start": 3144.32, "end": 3151.32, "text": "normalerweise in css muss man das ja so machen wenn ich quasi ein link element in der navigations"}, {"id": 825, "start": 3151.32, "end": 3160.68, "text": "leiste stylen will dann muss ich sagen naf a was dazu spürt spürt näher ob man spürt"}, {"id": 826, "start": 3160.68, "end": 3167.88, "text": "ist jetzt ist jetzt die andere frage was dazu führt dass man halt so ewig lange dinger"}, {"id": 827, "start": 3167.88, "end": 3173.0, "text": "hat die nicht zusammengehören und mit sass kann man jetzt diese sachen inline schreiben"}, {"id": 828, "start": 3173.0, "end": 3177.4, "text": "nestet das finde ich ist eigentlich ein sehr praktisches feature weil dann steht es nämlich"}, {"id": 829, "start": 3177.4, "end": 3181.48, "text": "genau an der stelle wo es sein muss also im normalen css müsste ich jetzt so was hier"}, {"id": 830, "start": 3181.48, "end": 3186.32, "text": "schreiben um das also wir können es ja mal mit normalen css machen dann würde ich jetzt"}, {"id": 831, "start": 3186.32, "end": 3191.44, "text": "zum beispiel sagen so was wie color und das haben wir jetzt hier blue haben wir da oben"}, {"id": 832, "start": 3191.44, "end": 3195.52, "text": "schon angelegt so color blue so und jetzt sind meine links so hässlich so hässlich"}, {"id": 833, "start": 3195.52, "end": 3203.72, "text": "blau da können wir noch sagen text decoration ist es nun so und jetzt sieht das jetzt sieht"}, {"id": 834, "start": 3203.72, "end": 3209.72, "text": "es zwar auch kacke aus aber nicht mal ganz so kacke so und das blau gefällt mir gar"}, {"id": 835, "start": 3209.72, "end": 3221.04, "text": "nicht das blau das als blau soll ein bisschen dunkler so gut so dann ändern wir noch mal"}, {"id": 836, "start": 3221.04, "end": 3228.64, "text": "die font size aber noch irgendwie wobei ne wir ändern nicht die font size wir sagen"}, {"id": 837, "start": 3228.64, "end": 3241.28, "text": "font family aber monospace oder sowas monospace ok wirklich wirklich besser ok das sieht"}, {"id": 838, "start": 3241.28, "end": 3246.2, "text": "doch das sieht jetzt ein ticken das sieht jetzt ein ticken besser aus so abstände und"}, {"id": 839, "start": 3246.2, "end": 3250.92, "text": "so machen wir gleich so jetzt machen wir big brain abstände mal gucken ob ich das hinkriege"}, {"id": 840, "start": 3250.92, "end": 3260.92, "text": "jetzt bin ich mal gespannt ob ich das gebacken kriege flexbox wie ging das flex display warte"}, {"id": 841, "start": 3260.92, "end": 3266.2, "text": "mal da bin ich auch das krieg ob ich das gebacken kriege auch display flex und dann kann man"}, {"id": 842, "start": 3266.2, "end": 3280.96, "text": "irgendwie sagen just justify contents space hier exploding brain da ich mir das gemerkt"}, {"id": 843, "start": 3280.96, "end": 3291.96, "text": "habe so jetzt ist das schön verteilt wir können wir können ja sogar wir können es"}, {"id": 844, "start": 3291.96, "end": 3306.28, "text": "sogar noch noch besser machen hier vor haus jetzt oh jetzt wirds advanced guckt euch das"}, {"id": 845, "start": 3306.28, "end": 3313.16, "text": "mal an jetzt gibt es emojis für die einzelnen punkte wireless da kann ich euch da kann ich"}, {"id": 846, "start": 3313.16, "end": 3320.24, "text": "euch antenna heißt das glaube ich da kann ich euch einen ultra geilen service für zeigen"}, {"id": 847, "start": 3320.24, "end": 3325.64, "text": "für icons das machen wir danach ich mache jetzt erstmal emojis hin das keine all zu"}, {"id": 848, "start": 3325.64, "end": 3329.4, "text": "gute idee ist weil wenn manche emojis bei dem font nicht unterstützt wird dann funktioniert"}, {"id": 849, "start": 3329.4, "end": 3335.72, "text": "es am ende nicht ja sowas wie font awesome aber ich kann euch das nennt sich fontello"}, {"id": 850, "start": 3335.72, "end": 3339.24, "text": "das das zeige ich euch nachher das habe ich jetzt schon ein paar mal benutzt das ist wirklich"}, {"id": 851, "start": 3339.24, "end": 3345.76, "text": "richtig big brain weil wenn man wenn man image fonts verwenden will also zum beispiel keiner"}, {"id": 852, "start": 3345.76, "end": 3352.48, "text": "so materialize icons oder font awesome also sprich wenn man image fonts verwenden will"}, {"id": 853, "start": 3352.48, "end": 3359.6, "text": "zum beispiel hier die material design icons da gab es irgendwie so ein search search search"}, {"id": 854, "start": 3359.6, "end": 3368.36, "text": "ding und wo ist die suche für material material icons da gab es also gute seite zum suchen"}, {"id": 855, "start": 3368.36, "end": 3383.48, "text": "das da ist das das cc fonts icons was weiß ich was du meinst genau da kann man jetzt hier"}, {"id": 856, "start": 3383.48, "end": 3389.32, "text": "zum beispiel suchen nach nach wireless oder so und dann findet man passende icons für"}, {"id": 857, "start": 3389.32, "end": 3395.2, "text": "access point so aber damit man das verwenden kann muss man die schriftart inkluden und"}, {"id": 858, "start": 3395.2, "end": 3400.0, "text": "die schriftart ist freut mich nicht 500 kilobyte oder sowas sind das creative commons icons"}, {"id": 859, "start": 3400.0, "end": 3408.96, "text": "die meisten schon ich glaube die lizenz steht sogar wenn man glück hat dabei aber ehrlich"}, {"id": 860, "start": 3408.96, "end": 3414.44, "text": "gesagt ich habe mir noch nie gedanken drum gemacht habe es einfach verwendet ich glaube"}, {"id": 861, "start": 3414.44, "end": 3422.96, "text": "die lizenz steht da irgendwo dabei ja zumindest dass ich das hier verwenden kann ist die sache"}, {"id": 862, "start": 3422.96, "end": 3432.04, "text": "entweder mache ich das als svg sonst was rein oder ich include diesen kompletten material"}, {"id": 863, "start": 3432.04, "end": 3442.96, "text": "icons font bei mir link hier hast du hier sind noch mal alle also die icons kann man"}, {"id": 864, "start": 3442.96, "end": 3450.4, "text": "auf jeden fall verwenden die sind ja startmäßig mit dabei ich weiß gar nicht wo man stylesheet"}, {"id": 865, "start": 3450.4, "end": 3458.68, "text": "wo es das offiziell gibt hier so da müsste ich da müsste ich das hier einbinden und"}, {"id": 866, "start": 3458.68, "end": 3463.72, "text": "wie ich dazu gekommen bin dass das keine gute idee ist folgendes wenn man das auf dem micro"}, {"id": 867, "start": 3463.72, "end": 3467.4, "text": "controller macht ist der kram ein bisschen fett guck mal wenn ich probst wenn ich den"}, {"id": 868, "start": 3467.4, "end": 3479.56, "text": "kram runter lade so diesen icon font dann ist der moment das ist nicht das richtige"}, {"id": 869, "start": 3479.56, "end": 3495.2, "text": "das ist das richtige da hat erstmal gebaited what ok das ist das richtige font fall und"}, {"id": 870, "start": 3495.2, "end": 3503.12, "text": "das ist einfach das ist ein bisschen groß wenn man nur fünf icons braucht so zumindest"}, {"id": 871, "start": 3503.12, "end": 3507.56, "text": "es gibt bestimmt noch andere varianten aber ich habe eine ultra geilen service gefunden"}, {"id": 872, "start": 3507.56, "end": 3515.96, "text": "von ich glaube von tello war das genau so und da kann man sich jetzt die icons raussuchen"}, {"id": 873, "start": 3515.96, "end": 3520.72, "text": "ich zeige euch das nachher mal weil ich habe wie gesagt ich habe den letzten letzten paar"}, {"id": 874, "start": 3520.72, "end": 3526.16, "text": "für die letzten paar embedded spiele spiele rein auch schon verwendet da kann man sich"}, {"id": 875, "start": 3526.16, "end": 3531.0, "text": "jetzt die icons raussuchen die man die man hätte aus verschiedenen image fonts also"}, {"id": 876, "start": 3531.0, "end": 3534.68, "text": "man muss nicht unbedingt immer den gleichen image font verwenden also sagen jetzt mal"}, {"id": 877, "start": 3534.68, "end": 3541.6, "text": "ich will dieses icon haben dieses icon und und was ich firmen wir update icon so da kann"}, {"id": 878, "start": 3541.6, "end": 3547.88, "text": "man die sich enden und dann generierte einen image font der nur diese drei icons enthält"}, {"id": 879, "start": 3547.88, "end": 3554.92, "text": "und dementsprechend keine ahnung 800 byte groß ist oder oder kilobyte oder so das ist"}, {"id": 880, "start": 3554.92, "end": 3563.84, "text": "das ist richtig gut genauso aber dauernd web font safe kann euch mal zeigen wie das dann"}, {"id": 881, "start": 3563.84, "end": 3567.16, "text": "aussieht da sind dann verschiedene sachen drinne guckt mal allein schon gezippt ist"}, {"id": 882, "start": 3567.16, "end": 3575.52, "text": "das hier nur da sind verschiedenste formate drin erst mal was zum entpacken installieren"}, {"id": 883, "start": 3575.52, "end": 3593.76, "text": "kurz wo habe ich es denn so und da ist das zeug jetzt in verschiedensten formaten drinne"}, {"id": 884, "start": 3593.76, "end": 3601.72, "text": "und unter anderem gibt es ne 8 kilobyte datei oder ne 14 kilobyte datei die hat das quasi"}, {"id": 885, "start": 3601.72, "end": 3608.84, "text": "als embedded css drinne sprich man muss noch nicht mal ein extra woops ok warum auch immer"}, {"id": 886, "start": 3608.84, "end": 3613.64, "text": "ist es nicht offenhaft man muss es noch nicht mal als als extra datei laden sondern kann"}, {"id": 887, "start": 3613.64, "end": 3618.92, "text": "es quasi direkt im css embedden und man kann jetzt und kann die icons verwenden das ist"}, {"id": 888, "start": 3618.92, "end": 3627.64, "text": "echt cool also man hat den man hat die auswahl oh mein wimm spektrum man hat die auswahl"}, {"id": 889, "start": 3627.64, "end": 3632.2, "text": "kompletten image font oder nur die image image die man braucht aus dem font also das"}, {"id": 890, "start": 3632.2, "end": 3635.6, "text": "ist eine super super geschichte probieren wir gleich mal aus aber ich mache erstmal"}, {"id": 891, "start": 3635.6, "end": 3640.16, "text": "ein paar emojis hier rein dass das zumindest ein bisschen hübscher aussieht so was nehmen"}, {"id": 892, "start": 3640.16, "end": 3650.64, "text": "wir für firmware für firmware nehmen wir einfach den computer icon oder so exzellent"}, {"id": 893, "start": 3650.64, "end": 3657.76, "text": "so mein meine font config ist nicht so ganz on point würde ich sagen so logs dann haben"}, {"id": 894, "start": 3657.76, "end": 3667.52, "text": "wir irgendwie mal so noteblock und habe ich noch nie verwendet also wenn ich das entpacken"}, {"id": 895, "start": 3667.52, "end": 3672.2, "text": "würde würde wollen dann würde ich einfach so machen ich habe nicht mal anzippen installiert"}, {"id": 896, "start": 3672.2, "end": 3675.88, "text": "was ist was ist und habe ich noch nie hab ich nicht ausprobiert kenne ich nicht also"}, {"id": 897, "start": 3675.88, "end": 3682.08, "text": "ich würde jetzt einfach anzippen installieren und das ding anzippen was mein ich installiert"}, {"id": 898, "start": 3682.08, "end": 3692.72, "text": "ah ist installiert so ich würde es jetzt einfach anzippen und zack ist es da aber ich"}, {"id": 899, "start": 3692.72, "end": 3700.0, "text": "wollte ja gar nicht anzippen so logs nehmen wir mal hier so ein block so und für info"}, {"id": 900, "start": 3700.0, "end": 3705.08, "text": "nehmen wir mal info gibt es da so information jawoll ah das kenne ich das ist das icon was"}, {"id": 901, "start": 3705.08, "end": 3711.92, "text": "wir uns geklaut haben für das display so ok also kommen wir mal wieder zu sas jetzt haben"}, {"id": 902, "start": 3711.92, "end": 3722.68, "text": "wir ja schon eine super erstklassige navigationsleiste hier oben besser besser geht es ja kaum so"}, {"id": 903, "start": 3722.68, "end": 3729.44, "text": "also was kann man damit jetzt machen genau ein vorteil von sas wie gesagt ist laut diesem"}, {"id": 904, "start": 3729.44, "end": 3735.32, "text": "was wir gerade gesehen haben dass man das inline schreiben kann also das hier wäre ja noch"}, {"id": 905, "start": 3735.32, "end": 3742.8, "text": "vollkommen normal gültiges css bis auf diese variablen aber sobald wir das hier rein machen"}, {"id": 906, "start": 3742.8, "end": 3751.24, "text": "nicht mehr so das ist das ist ein sas feature dass ich quasi die sachen an die stelle nested"}, {"id": 907, "start": 3751.24, "end": 3756.08, "text": "schreiben kann wo ich sie brauche man sieht es hat sich nix geändert und unter der haube"}, {"id": 908, "start": 3756.08, "end": 3760.32, "text": "wenn man da mal in die styles reingucken hat er genau das gleiche generiert was ich vorher"}, {"id": 909, "start": 3760.32, "end": 3768.28, "text": "auch hatte was macht er denn hier was ist der unterschied zwischen sas und scss das"}, {"id": 910, "start": 3768.28, "end": 3777.4, "text": "projekt heißt sas ist die für ein esp projekt ich will für mein esp noch eine noch eine"}, {"id": 911, "start": 3777.4, "end": 3781.8, "text": "webseite machen ja deswegen habe ich jetzt diese diese punkt hier umgenommen aber das"}, {"id": 912, "start": 3781.8, "end": 3787.68, "text": "gerade ist nur zum sas ausprobieren was möchte er denn hier ja genau also sas heißt das"}, {"id": 913, "start": 3787.68, "end": 3802.12, "text": "projekt und die haben zwei formate die haben sas und scss scss ist quasi ein superset also"}, {"id": 914, "start": 3802.12, "end": 3808.2, "text": "eine übermenge und wie heißt das auf deutsch keine ahnung von css also sprich du kannst"}, {"id": 915, "start": 3808.2, "end": 3817.84, "text": "jedes gültige css ist gültiges scss nur dass du in scss noch mehr machen kannst sas ist"}, {"id": 916, "start": 3817.84, "end": 3824.92, "text": "ein bisschen wie jammel mit einrückungen und gedöns also ich glaube die meisten verwenden"}, {"id": 917, "start": 3824.92, "end": 3832.48, "text": "scss ich finde ich finde das sas ein bisschen umständlich so mich jetzt gesehen habe weil"}, {"id": 918, "start": 3832.48, "end": 3841.48, "text": "ich wenn ich css schreibe dann bin ich im kopf bei css und ich bei jammel einrückungen"}, {"id": 919, "start": 3841.48, "end": 3844.28, "text": "du kannst mal kannst mal verklagen wir haben noch hier noch einen vergleich offen warte"}, {"id": 920, "start": 3844.28, "end": 3853.56, "text": "mal wir haben doch noch einen vergleich offen genau das habe ich mich ja vorher auch gefragt"}, {"id": 921, "start": 3853.56, "end": 3862.52, "text": "oder hier auf der guck mal hier kann man so umstellen so sieht es als scss aus und so"}, {"id": 922, "start": 3862.52, "end": 3869.56, "text": "sieht es als als sas aus also in scss ist halt ein typisches css mit klammern und und"}, {"id": 923, "start": 3869.56, "end": 3873.44, "text": "simikolon und hier musste halt auf einrückung achten dementsprechend kannst du auch das"}, {"id": 924, "start": 3873.44, "end": 3879.28, "text": "display nicht so schreiben sondern muss halt das display jammel style mäßig einrücken"}, {"id": 925, "start": 3879.28, "end": 3884.6, "text": "also mir gefällt es ehrlich gesagt so auch besser so was will er denn hier von mir eigentlich"}, {"id": 926, "start": 3884.6, "end": 3891.72, "text": "das sind irgendwelche browser prefix dinger braucht man das überhaupt im jahr 2020 noch"}, {"id": 927, "start": 3891.72, "end": 3899.0, "text": "braucht man browser prefixes noch ich meine wenn man nicht gerade internet explorer 11"}, {"id": 928, "start": 3899.0, "end": 3904.16, "text": "und alle firefox versionen braucht man doch eigentlich gar nicht mehr das das können"}, {"id": 929, "start": 3904.16, "end": 3910.6, "text": "sie doch eh alle es gibt doch keinen modernen browser metadata das niemand kann denn es"}, {"id": 930, "start": 3910.6, "end": 3920.64, "text": "nicht kann es macht einfach nur die seite größer kann man das ausschalten was sind"}, {"id": 931, "start": 3920.64, "end": 3932.24, "text": "browser prefixe das da also das ist wenn spezielle features noch nicht in allen browsers"}, {"id": 932, "start": 3932.24, "end": 3937.84, "text": "drin sind oder wenn ein browser was unterstützt was andere browser nicht unterstützen oder"}, {"id": 933, "start": 3937.84, "end": 3943.28, "text": "wenn die was unterstützen was noch nicht standardisiert ist dann führen die das mit so einem jeweiligen"}, {"id": 934, "start": 3943.28, "end": 3952.84, "text": "prefix ein also zum beispiel minus webkit äh minus mozilla moment nee was ist denn"}, {"id": 935, "start": 3952.84, "end": 3968.36, "text": "der mozilla prefix webkit kann es ja nicht sein motz motz ok alles klar was ist der prefix"}, {"id": 936, "start": 3968.36, "end": 3975.88, "text": "vom ee der hat so was wahrscheinlich gar nicht oder was ist der prefix von random prefix"}, {"id": 937, "start": 3975.88, "end": 3989.0, "text": "e ms opera ist minus o ms aha alles klar ich sehe der chat ist wieder big brain big brain"}, {"id": 938, "start": 3989.0, "end": 3995.6, "text": "ich unterwegs ok also das ist für safari das ach hier steht doch ms das ist für internet"}, {"id": 939, "start": 3995.6, "end": 4012.92, "text": "explorer ja mozilla braucht das nicht einstelle für die extension live sass compile settings"}, {"id": 940, "start": 4012.92, "end": 4017.28, "text": "auto prefix ah das ist gut das will ich nämlich rausschmeißen weil das das braucht mir einfach"}, {"id": 941, "start": 4017.28, "end": 4027.8, "text": "nur zu viel speicher und ich gehe da eh nur mit modernen browser drauf kartoffel 1503"}, {"id": 942, "start": 4027.8, "end": 4037.48, "text": "twitch prime ein neuer sub dankeschön huge massive big brain subscription so live sass"}, {"id": 943, "start": 4037.48, "end": 4052.32, "text": "compiler wo steht da was von prefix moment ich suche einfach mal hier prefix ach hier"}, {"id": 944, "start": 4052.32, "end": 4067.6, "text": "guck mal auto prefix ok was was kann ich was kann ich da einstelle 0 ich mach mal die hilfe"}, {"id": 945, "start": 4067.6, "end": 4081.16, "text": "ich mach mal die hilfeseite auf die grad verlinkt hast weil ich will das ausschalten auto prefix"}, {"id": 946, "start": 4081.16, "end": 4086.88, "text": "mit null zu turn off default ist null äh ne ne ne ne ne default ist nicht null default"}, {"id": 947, "start": 4086.88, "end": 4092.04, "text": "macht er das ja gerade aber es ist immer noch drin"}, {"id": 948, "start": 4092.04, "end": 4109.12, "text": "ach guck mal jetzt ist weg sehr sehr sehr nice ok wir haben es ausgeschaltet jetzt ist"}, {"id": 949, "start": 4109.12, "end": 4113.88, "text": "der teil ein bisschen kleiner weil ich brauche keine browser prefix ich gehe da mit dem"}, {"id": 950, "start": 4113.88, "end": 4117.8, "text": "neuesten chrome und dem neuesten firefox drauf und das war es vielleicht ja auch mit dem"}, {"id": 951, "start": 4117.8, "end": 4124.68, "text": "opera gaming browser aber nicht nicht damit ist das nicht ein bisschen overkill weiß"}, {"id": 952, "start": 4124.68, "end": 4128.12, "text": "ich nicht es interessiert mich einfach wo wir wieder beim thema sind wenn ein sachen"}, {"id": 953, "start": 4128.12, "end": 4132.12, "text": "interessieren ist das beste man lernt die weil man kann sie garantiert mal irgendwann"}, {"id": 954, "start": 4132.12, "end": 4135.72, "text": "brauchen und man rutscht auch so in bereiche rein wo man teilweise noch gar nicht wusste"}, {"id": 955, "start": 4135.72, "end": 4144.28, "text": "dass da irgendwie äh was da so abgeht ach stimmt wenn ich es unleashed wollten sie"}, {"id": 956, "start": 4144.28, "end": 4150.92, "text": "ja heute auch da muss ich mal kurz äh äh da muss ich mal kurz äh schauen das ist ja"}, {"id": 957, "start": 4150.92, "end": 4157.96, "text": "dieser battlefield 3 mod der battlefield 3 wieder spielbar machen will das das das gucken"}, {"id": 958, "start": 4157.96, "end": 4162.16, "text": "wir uns äh das gucken wir uns hier nach an das gucken wir uns hier das gucken wir uns"}, {"id": 959, "start": 4162.16, "end": 4166.84, "text": "wenn wir fertig sind an so also jetzt machen wir erst mal jetzt mal erst mal sagt vielleicht"}, {"id": 960, "start": 4166.84, "end": 4174.12, "text": "kann ich immer zig sachen gleichzeitig machen es hier ist max hat er merkt wie sein IQ steigt"}, {"id": 961, "start": 4174.12, "end": 4177.96, "text": "ja deswegen habe ich das bild ja auch eingeblendet weil das wirkt sich natürlich auf mich auch"}, {"id": 962, "start": 4177.96, "end": 4194.12, "text": "aus sonst kann ich das kann man einfacher lernen hast du bist den ganzen tag im work"}, {"id": 963, "start": 4194.12, "end": 4199.68, "text": "mode exzellent oder eher nicht exzellent je nachdem ob es was gutes oder was schlechtes"}, {"id": 964, "start": 4199.68, "end": 4204.92, "text": "ist so also was kann man jetzt sonst noch schönes mal ich meine das ist schon mal ganz"}, {"id": 965, "start": 4204.92, "end": 4210.52, "text": "nett dass man so variable verwenden kann und dass man ähm die sachen inline schreiben"}, {"id": 966, "start": 4210.52, "end": 4217.32, "text": "kann das ist ja ganz nice moin captain peng was kann man denn sonst noch schönes damit"}, {"id": 967, "start": 4217.32, "end": 4225.2, "text": "machen variables haben wir gemacht nesting haben wir uns angeguckt was haben die noch"}, {"id": 968, "start": 4225.2, "end": 4232.72, "text": "im beispiel drin stehen naja gut das ist ja im prinzip das was wir ausprobiert haben"}, {"id": 969, "start": 4232.72, "end": 4242.76, "text": "oh herring angular 2 das ist so ein ding da habe ich ganz viel ganz viel ganz großen"}, {"id": 970, "start": 4242.76, "end": 4247.32, "text": "bogen bisher drum gemacht habe ich auch absolut kein bock was was dran zu machen so was kommen"}, {"id": 971, "start": 4247.32, "end": 4259.4, "text": "man parcels ok da kann man die sachen aufsplitten modules da habe ich den sinn noch nicht gecheckt"}, {"id": 972, "start": 4259.4, "end": 4267.88, "text": "von mix ins da kann man quasi sachen inkluden also man kann quasi einmal sachen wenn ich"}, {"id": 973, "start": 4267.88, "end": 4273.16, "text": "das so verstehe man kann einmal sachen schreiben und die dann an den passenden stellen inkluden"}, {"id": 974, "start": 4273.16, "end": 4280.72, "text": "und man muss ihn noch einmal schreiben extent man kann sachen erweitern operate dass man"}, {"id": 975, "start": 4280.72, "end": 4284.64, "text": "kann irgendwelche sachen berechnen lassen ich habe aber in dem video was ich habe mir"}, {"id": 976, "start": 4284.64, "end": 4290.68, "text": "so ein 20 minuten oder sass in 20 minuten video angeschaut und der typ hat also wir"}, {"id": 977, "start": 4290.68, "end": 4296.88, "text": "können ja mal werbung machen ich habe mir das das video angeschaut und daraufhin habe"}, {"id": 978, "start": 4296.88, "end": 4301.92, "text": "ich gesagt das muss ich mir mal muss ich mir mal näher angucken dass da sass in 20 minuten"}, {"id": 979, "start": 4301.92, "end": 4310.16, "text": "und er hat irgendein feature gezeigt dass man also was man ja gerne macht ist zum beispiel"}, {"id": 980, "start": 4310.16, "end": 4318.24, "text": "ich sowas ja hava so also sprich wenn ich jetzt über den über den link drüber gehe"}, {"id": 981, "start": 4318.24, "end": 4327.0, "text": "dann dann dann sage ich zum beispiel text text decoration hier anderlei oder sowas und wenn"}, {"id": 982, "start": 4327.0, "end": 4331.64, "text": "ich da drüber gehe dann kommt halt so ein unter so so ein underscore strich so man konnte"}, {"id": 983, "start": 4331.64, "end": 4337.48, "text": "das irgendwie abkürzen und ich habe keine ahnung mehr wie er das gemacht hat das war"}, {"id": 984, "start": 4337.48, "end": 4349.6, "text": "poggers wie er das gemacht und ein und war das genau syrien der ist der kennt sich aus"}, {"id": 985, "start": 4349.6, "end": 4353.4, "text": "hier und genau und hat das gemacht das ist jetzt bei einem a natürlich ein bisschen"}, {"id": 986, "start": 4353.4, "end": 4357.68, "text": "doofes beispiel weil ein a ist halt auch nur ein buchstaben aber zum beispiel wenn man"}, {"id": 987, "start": 4357.68, "end": 4363.48, "text": "sowas hier hat sieht sieht schon ist so natürlich besser als als so ich glaube hat button überhaupt"}, {"id": 988, "start": 4363.48, "end": 4369.72, "text": "und hava was nicht das das finde ich eigentlich ganz praktisch das war das feature war sie"}, {"id": 989, "start": 4369.72, "end": 4374.52, "text": "lustigerweise das feature was ich im video gesehen habe was wo was wo ich gesagt habe"}, {"id": 990, "start": 4374.52, "end": 4386.56, "text": "ich muss mir das mal angucken muss aber in klammern vom a wat nee geht doch auch so"}, {"id": 991, "start": 4386.56, "end": 4402.96, "text": "ane moment wat achso ich habe jetzt hava gemacht für die gesamte nachbar ups verstehe ja das"}, {"id": 992, "start": 4402.96, "end": 4408.28, "text": "ist aber noch besser das ist aber noch besser weil dann steht es jetzt lokal beim a dabei"}, {"id": 993, "start": 4408.28, "end": 4412.8, "text": "das heißt ich muss gar nichts mehr großartig suchen ich gucke mir mal das css an was der"}, {"id": 994, "start": 4412.8, "end": 4420.64, "text": "jetzt unter der haube generiert hat genau also man sieht schon okay ehrlich gesagt an der"}, {"id": 995, "start": 4420.64, "end": 4424.88, "text": "stelle sieht man das noch nicht dass man kürzer ist aber es ist auf jeden fall übersichtlicher"}, {"id": 996, "start": 4424.88, "end": 4428.96, "text": "also ich finde das viel angenehmer wenn das hier in line drin steht bei der naf wenn man"}, {"id": 997, "start": 4428.96, "end": 4432.76, "text": "wenn man sich vorstellt man hat den man hat den kram später hat man irgendwie hier keine"}, {"id": 998, "start": 4432.76, "end": 4438.72, "text": "ahnung 50 50.000 verschiedene dinger drin so und jetzt muss ich naf naf link elemente"}, {"id": 999, "start": 4438.72, "end": 4443.12, "text": "suchen so und dann finde ich hier war es dann finde ich da unten was und hier habe ich alles"}, {"id": 1000, "start": 4443.12, "end": 4449.2, "text": "bei der naf zusammen stehen das hat das hat dass es deutlich kürzer ist sieht man jetzt"}, {"id": 1001, "start": 4449.2, "end": 4457.04, "text": "noch nicht weil es noch so kurz also noch ist es noch noch sieht man den vorteil davon"}, {"id": 1002, "start": 4457.04, "end": 4463.4, "text": "ich aber ich glaube dass es später tatsächlich auch eine ganze ecke kürzer wird was man"}, {"id": 1003, "start": 4463.4, "end": 4474.48, "text": "gebastelt hier so als was kann man noch schönes machen ist auch deutlich angenehmer zu schreiben"}, {"id": 1004, "start": 4474.48, "end": 4478.92, "text": "ja finde ich auch also ich finde auch man findet es besser so und ich sage das jetzt"}, {"id": 1005, "start": 4478.92, "end": 4484.16, "text": "so nach fünf minuten wie gesagt ich habe das mit noch nie großartig angeguckt weil es"}, {"id": 1006, "start": 4484.16, "end": 4489.04, "text": "ist ja auch in wenn irgendwelche sachen programmiert es ist immer praktischer wenn das eben an"}, {"id": 1007, "start": 4489.04, "end": 4494.56, "text": "der stelle steht wo du suchst deswegen bin ich auch überhaupt kein fan von dass man"}, {"id": 1008, "start": 4494.56, "end": 4502.2, "text": "die sachen unnötig auf splittet also man muss keine metoden programmieren die irgendwie"}, {"id": 1009, "start": 4502.2, "end": 4510.2, "text": "fünf seiten lang sind ja das muss nicht sein aber ich finde es besser man schreibt es vielleicht"}, {"id": 1010, "start": 4510.2, "end": 4515.2, "text": "ein bisschen länger und dafür hat man die wichtigen sachen die für die logik relevant"}, {"id": 1011, "start": 4515.2, "end": 4522.8, "text": "sind an der stelle stehen wo sie verwendet werden als man macht noch mal fünf fünf"}, {"id": 1012, "start": 4522.8, "end": 4527.04, "text": "untermethoden irgendwie draus die nur an dieser einen stelle aufgerufen werden da muss man"}, {"id": 1013, "start": 4527.04, "end": 4530.76, "text": "wild hin und her springen ohne dass man was findet ich habe mal einen webcast geguckt"}, {"id": 1014, "start": 4530.76, "end": 4540.24, "text": "einen habe ich glaube ich schon mal erzählt ein ein konferenz talk von irgendem ruby guru"}, {"id": 1015, "start": 4540.24, "end": 4548.16, "text": "habe ich mir angeguckt und der hat erzählt dass er der meinung ist dass metoden die länger"}, {"id": 1016, "start": 4548.16, "end": 4553.4, "text": "als eine zeile sind für ihn schon schlecht ist da habe ich mir gedacht was ist mit dem"}, {"id": 1017, "start": 4553.4, "end": 4563.44, "text": "typos also besteht dem seine codebase quasi für in der hallo welt dann aus aus irgendwie"}, {"id": 1018, "start": 4563.44, "end": 4571.24, "text": "erst bei 800 800 funktionen oder was total hängen geblieben ja und ich habe das wie gesagt"}, {"id": 1019, "start": 4571.24, "end": 4580.04, "text": "so 2011 12 geguckt wo ich noch mit ruby on rails rum gewurstet habe und ich habe das"}, {"id": 1020, "start": 4580.04, "end": 4583.8, "text": "damals geglaubt ich habe gesagt man muss das alles möglichst kurz machen und das hat dazu"}, {"id": 1021, "start": 4583.8, "end": 4591.24, "text": "geführt dass man die sachen unnötig aufgesplittet hat also ich mache es immer so wenn man den"}, {"id": 1022, "start": 4591.24, "end": 4598.84, "text": "metoden also wenn man was extra hier in der eigenen metode dann immer erst wenn es entweder"}, {"id": 1023, "start": 4598.84, "end": 4604.08, "text": "gar zu extrem lang wird oder was aber eigentlich die viel bessere variante ist sobald man es"}, {"id": 1024, "start": 4604.08, "end": 4609.12, "text": "an mehr als einer stelle verwenden kann wenn man es nur an einer stelle braucht ist es"}, {"id": 1025, "start": 4609.12, "end": 4613.48, "text": "meistens am besten auch wenn es ein bisschen länger wird wenn man den kram an die stelle"}, {"id": 1026, "start": 4613.48, "end": 4619.04, "text": "schreibt wo er gehört weil es hat doch wirklich keiner was davon wenn ich irgendwie keine"}, {"id": 1027, "start": 4619.04, "end": 4624.28, "text": "ahnung ich habe eine metode die was die was einliest sortiert und dann irgendwo hinschreibt"}, {"id": 1028, "start": 4624.28, "end": 4630.68, "text": "was man machen kann ist dass man die auf splittet in input sort output ok auch wenn das nur"}, {"id": 1029, "start": 4630.68, "end": 4634.72, "text": "an einer stelle verwenden meinetwegen das leuchtet mir noch ein das ist klar strukturiert"}, {"id": 1030, "start": 4634.72, "end": 4643.32, "text": "und so das geht aber man muss nicht anfangen dort dann quasi sort first items third second"}, {"id": 1031, "start": 4643.32, "end": 4648.68, "text": "item oder sonst was raus zu splitten weil dann hat man das problem wenn irgendjemand"}, {"id": 1032, "start": 4648.68, "end": 4654.72, "text": "versucht den kram nachzuvollziehen der muss erst mal durch 2000 zeilen so aus kultur springen"}, {"id": 1033, "start": 4654.72, "end": 4658.64, "text": "bis er sich halbwegs zusammen gereimt hat was in deinem kopf vorgegangen ist als du"}, {"id": 1034, "start": 4658.64, "end": 4667.68, "text": "das gebastelt hast"}, {"id": 1035, "start": 4667.68, "end": 4672.48, "text": "captain peng exakt so ist es mehr als eine zeile ist er hat nicht gesagt plotet dieser"}, {"id": 1036, "start": 4672.48, "end": 4689.08, "text": "ruby typ hat gemeint it's a code smell ja"}, {"id": 1037, "start": 4689.08, "end": 4700.52, "text": "so weiter also das das finde ich schon alles sehr schick das das gefällt mir so also variable"}, {"id": 1038, "start": 4700.52, "end": 4705.92, "text": "maus für nestinger maus mit parcels parcels habe ich auch im video gesehen fand ich jetzt"}, {"id": 1039, "start": 4705.92, "end": 4712.96, "text": "persönlich nicht so ultra toll also was man machen kann ist folgendes wahrscheinlich bringt"}, {"id": 1040, "start": 4712.96, "end": 4720.64, "text": "es erst was wenn es größer wird also was man machen kann ist zum beispiel man kann"}, {"id": 1041, "start": 4720.64, "end": 4726.92, "text": "die teile in verschiedene dateien auslagern kann man es jetzt erst kompilieren lassen"}, {"id": 1042, "start": 4726.92, "end": 4732.64, "text": "vom webserver also das machst du normalerweise bevor du das auf den webserver deploys ich"}, {"id": 1043, "start": 4732.64, "end": 4736.68, "text": "meine ich will nicht ausschließen dass es nicht irgendwelche big brain node gs webserver"}, {"id": 1044, "start": 4736.68, "end": 4741.92, "text": "gibt die das machen können das wird mich hinter mich wundert nichts mehr im java script"}, {"id": 1045, "start": 4741.92, "end": 4749.68, "text": "ökosystem irgendwo aber eigentlich würde ich darauf tippen man macht das vorher bevor"}, {"id": 1046, "start": 4749.68, "end": 4757.44, "text": "man es auf den webserver schiebt so wie so wie irgendwelche webpack roll up bundle was"}, {"id": 1047, "start": 4757.44, "end": 4764.92, "text": "es da nicht alles gibt warum gibt es eigentlich für frontend sachen immer 30 konkurrierende"}, {"id": 1048, "start": 4764.92, "end": 4771.44, "text": "dinger das muss ja an sich nicht schlechtes sein aber die java script leute übertreiben"}, {"id": 1049, "start": 4771.44, "end": 4779.4, "text": "ist ein bisschen also ich muss sagen ich finde die webpack config ist abartig also das hat"}, {"id": 1050, "start": 4779.4, "end": 4789.84, "text": "das hat auch einer irgendwie so übelster menschenfeind sich ausgedacht die webpack config aber es"}, {"id": 1051, "start": 4789.84, "end": 4797.04, "text": "gibt irgendwie auch wieder also mir mir fallen schon aus dem stehgreif zwei alternativen"}, {"id": 1052, "start": 4797.04, "end": 4801.52, "text": "zu webpack ein und ich bin echt niemand dass ich frontend mäßig gut auskennt es gibt"}, {"id": 1053, "start": 4801.52, "end": 4807.2, "text": "da noch parcel und es gibt noch roll up genau und es gibt java script typisch 50 andere"}, {"id": 1054, "start": 4807.2, "end": 4819.88, "text": "dinger und das ist so ein ding was java script so ein eigenes java script ding es gibt zu"}, {"id": 1055, "start": 4819.88, "end": 4828.68, "text": "allem 50 wenn wenn es mal reicht 50 verschiedene sachen und alles ist irgendwie beliebt und"}, {"id": 1056, "start": 4828.68, "end": 4834.44, "text": "man man man steht dann davor und denkt sich so was de fuck was soll ich denn jetzt nehmen"}, {"id": 1057, "start": 4834.44, "end": 4838.24, "text": "das ist auch eine sache die finde ich an vue js ganz praktisch die haben die wichtigsten"}, {"id": 1058, "start": 4838.24, "end": 4845.2, "text": "sachen dabei das heißt dann ist nicht die frage welche von 1000 routing libraries soll"}, {"id": 1059, "start": 4845.2, "end": 4851.68, "text": "ich verwenden oder so oder nehme ich einfach den eingebauten und gut ist eine sache die"}, {"id": 1060, "start": 4851.68, "end": 4864.64, "text": "noch ähnlich wo auch jeder was eigenes bastelt ist ls ls replacements also ls hier ls replacements"}, {"id": 1061, "start": 4864.64, "end": 4868.6, "text": "ihr müsst mal auf github nach ls replacements suchen übrigens das ist das finde ich eigentlich"}, {"id": 1062, "start": 4868.6, "end": 4885.88, "text": "ganz gut hier es gibt bestimmt 150 ls replacements hsu zehn monate dankeschön für den sup exquisite"}, {"id": 1063, "start": 4885.88, "end": 4891.08, "text": "so machen wir mal weiter ich wollte jetzt ich wollte jetzt das mit mit mit parcels ausprobieren"}, {"id": 1064, "start": 4891.08, "end": 4899.04, "text": "was in der unterschied zwischen ach moment das geht nur mit mit das geht nur mit mit"}, {"id": 1065, "start": 4899.04, "end": 4911.96, "text": "darts ok dann müssen sie es gar nicht angucken da lobe ich mir doch jquery da gibt es wenigstens"}, {"id": 1066, "start": 4911.96, "end": 4918.96, "text": "nur eins wobei das stimmt gar nicht es gab es gab früher auch noch zepto oder wie das"}, {"id": 1067, "start": 4918.96, "end": 4924.1, "text": "hieß so als jquery alternative es gab es gab es gab zig dinger jquery war damals das"}, {"id": 1068, "start": 4924.1, "end": 4943.04, "text": "erste so 2000 frag mich nicht zwei oder so so also parcels also sprich man kann jetzt"}, {"id": 1069, "start": 4943.04, "end": 4951.0, "text": "zum beispiel diese variablen auslage in der eigene datei da bin ich mir unschlüssig wie"}, {"id": 1070, "start": 4951.0, "end": 4955.36, "text": "sinnvoll das ist also man kann jetzt folgendes machen mal angenommen ich hätte hier um 50"}, {"id": 1071, "start": 4955.36, "end": 4960.56, "text": "50 milliarden variablen gesetzt und das wird mir zu unübersichtlich dann könnte ich sagen"}, {"id": 1072, "start": 4960.56, "end": 4968.44, "text": "ok ich nehme alle meine variablen und mache eine eigene datei die ich keine ahnung war"}, {"id": 1073, "start": 4968.44, "end": 4978.72, "text": "punkt scss nenne da schreibe ich das jetzt rein und dann kann ich hier oben sagen include"}, {"id": 1074, "start": 4978.72, "end": 4992.88, "text": "use was include oder use use use und dann irgendwie war oder einfach nur war genau ihr seht"}, {"id": 1075, "start": 4992.88, "end": 4999.28, "text": "es hat sich nichts geändert kann man einfach nur war schreiben geht das auch exquisite"}, {"id": 1076, "start": 4999.28, "end": 5006.28, "text": "so jetzt kann ich quasi die variablen in kluden hier an der stelle hast du schon wo"}, {"id": 1077, "start": 5006.28, "end": 5016.08, "text": "man wo man ist absichtlich falsch geschrieben wo man als man ersatz da habe ich nicht und"}, {"id": 1078, "start": 5016.08, "end": 5026.44, "text": "ich bin ja auch ich bin ja auch ganz also ich verwende ja auch post man anstatt post woman"}, {"id": 1079, "start": 5026.44, "end": 5035.76, "text": "oder so wie das wie der ersatz hieß davon geht ja gar nicht aber das war einfach das"}, {"id": 1080, "start": 5035.76, "end": 5040.0, "text": "erste programm in dieser richtung was ich mir angeguckt habe das macht alles was ich"}, {"id": 1081, "start": 5040.0, "end": 5052.88, "text": "will so also sprich man kann den kram in kluden was glaube ich ganz nützlich ist wenn man"}, {"id": 1082, "start": 5052.88, "end": 5058.0, "text": "mehr hat also wenn ich jetzt ich könnte mir durchaus vorstellen wenn ich ein bisschen"}, {"id": 1083, "start": 5058.0, "end": 5062.4, "text": "komplex der webseite habe dann habe ich da schon mal so was weiß ich 20 30 variablen"}, {"id": 1084, "start": 5062.4, "end": 5065.76, "text": "oder vielleicht auch 100 weil ich weiß keine ahnung so komplizierte dinge habe ich nicht"}, {"id": 1085, "start": 5065.76, "end": 5073.4, "text": "gemacht dann ist das ist das glaube ich ganz gut wenn man das auslagern kann wo es bestimmt"}, {"id": 1086, "start": 5073.4, "end": 5080.28, "text": "auch ganz nützlich ist wenn man verschiedene wenn man irgendwie verschiedene farbvariationen"}, {"id": 1087, "start": 5080.28, "end": 5087.32, "text": "ausprobieren will ja ich glaube das ist echt ganz praktisch mal angenommen ich möchte"}, {"id": 1088, "start": 5087.32, "end": 5094.48, "text": "jetzt global webseitenweit blau anders anders machen dann gehe ich immer variablen file"}, {"id": 1089, "start": 5094.48, "end": 5110.36, "text": "und sagt nee ich will lieber dieses blau und zack ist überall oder auch nicht ich muss"}, {"id": 1090, "start": 5110.36, "end": 5139.72, "text": "doch punktslash machen oder nicht import echt aber die schreiben hier use import ah hier"}, {"id": 1091, "start": 5139.72, "end": 5147.76, "text": "ja aber warum schreiben die hier use wenn man das mit import macht das für einen schwachsinn"}, {"id": 1092, "start": 5147.76, "end": 5158.92, "text": "but why also wenn die offizielle seite schon so mehrdeutig ist ist das nicht gut oder"}, {"id": 1093, "start": 5158.92, "end": 5165.68, "text": "ich verstehe nicht was die schreiben quai 1 neun monate auch wieder am start exquisite"}, {"id": 1094, "start": 5165.68, "end": 5172.08, "text": "subscription ok aber man hat gesehen es funktioniert also sprich wenn ich jetzt hier das blau wieder"}, {"id": 1095, "start": 5172.08, "end": 5177.32, "text": "zurück obs das blau wieder hallo wieder zurück enda auf das hellere blau dann wird es auch"}, {"id": 1096, "start": 5177.32, "end": 5193.12, "text": "wieder hell ach das ist use und und s css ist echt ok ja gut das ist ich nehme es mal"}, {"id": 1097, "start": 5193.12, "end": 5196.92, "text": "zur kenntnis dass das so ist aber ich finde es halt doof dass sie das hier nicht geschrieben"}, {"id": 1098, "start": 5196.92, "end": 5204.96, "text": "haben jetzt einfacher gewesen so ja das ist schon mal ganz nützlich so also was man jetzt"}, {"id": 1099, "start": 5204.96, "end": 5208.6, "text": "auch machen könnte es also bis jetzt mal total übertreiben ich könnte jetzt auch so was"}, {"id": 1100, "start": 5208.6, "end": 5215.16, "text": "hier machen new file knapp punkt s css und da würde ich jetzt quasi meine komplette"}, {"id": 1101, "start": 5215.16, "end": 5231.32, "text": "nav bar reinschieben und dann würde ich in meinem main css sagen import nav genau so"}, {"id": 1102, "start": 5231.32, "end": 5236.32, "text": "das ist wahrscheinlich sobald die seite ein bisschen größer wird ganz ganz sinnvoll"}, {"id": 1103, "start": 5236.32, "end": 5243.12, "text": "aber ich glaube das ist auch so ein feature was man nicht verwenden sollte einfach nur"}, {"id": 1104, "start": 5243.12, "end": 5248.44, "text": "um es zu verwenden sondern erst wenn es anfängt unübersichtlich zu werden zumindest ist das"}, {"id": 1105, "start": 5248.44, "end": 5252.28, "text": "zumindest ist das meine erfahrung so mit letzten jahren gewesen es gibt es gibt so ein paar"}, {"id": 1106, "start": 5252.28, "end": 5260.64, "text": "guidelines die die teilweise schon so fast so so so irgendwie religiös gefolgt werden"}, {"id": 1107, "start": 5260.64, "end": 5269.12, "text": "so nach dem motto du musst super jetzt müssen wir mal was einfallen du musst alle zum beispiel"}, {"id": 1108, "start": 5269.12, "end": 5274.64, "text": "sp.net kurse nach dem motto du musst alle deine models in einem model ordner schreiben"}, {"id": 1109, "start": 5274.64, "end": 5279.88, "text": "du musst alle deine controller jeweils einzeln in einem feil haben oder irgendwie ich glaube"}, {"id": 1110, "start": 5279.88, "end": 5283.88, "text": "bei controller geht es gar nicht anders wegen irgendwelche reflection geschichten oder du"}, {"id": 1111, "start": 5283.88, "end": 5289.48, "text": "musst deine db kontexte immer in eigener ding also ich bin der ansicht dass es alles schön"}, {"id": 1112, "start": 5289.48, "end": 5295.04, "text": "und gut aber man muss es für kleine projekte nicht übertreiben also man muss kleine projekte"}, {"id": 1113, "start": 5295.04, "end": 5301.88, "text": "die irgendwie nur 300 zeilen lang sind nicht aufsplitten in zehn feils nur weil das laut"}, {"id": 1114, "start": 5301.88, "end": 5306.72, "text": "hersteller best practice ist wenn es noch so klein und kurz und übersichtlich ist dass"}, {"id": 1115, "start": 5306.72, "end": 5312.44, "text": "es alles in einen feil passt finde ich spricht da überhaupt nichts dagegen das ist ja solche"}, {"id": 1116, "start": 5312.44, "end": 5317.96, "text": "empfehlungen die die davon herstellern kommen die sind ja auch im hinblick darauf dass das"}, {"id": 1117, "start": 5317.96, "end": 5322.92, "text": "empfehlungen sind die allgemein gültig haben allgemein gültig sein soll also sprich dass"}, {"id": 1118, "start": 5322.92, "end": 5328.04, "text": "wenn es der irgendwie eine super krasse business enterprise anwendung macht dann ist das natürlich"}, {"id": 1119, "start": 5328.04, "end": 5333.72, "text": "sinnvoll sowas zu machen deswegen ich denke man sollte die sachen eigentlich immer erst"}, {"id": 1120, "start": 5333.72, "end": 5343.0, "text": "dann machen wenn man selbst merkt dass es nervig wird also stellt man fest ok das zeug wird"}, {"id": 1121, "start": 5343.0, "end": 5346.2, "text": "mir jetzt zu lang zu unübersichtlich dann mache ich vielleicht eine extra klasse raus"}, {"id": 1122, "start": 5346.2, "end": 5350.24, "text": "ok das zeug wird mir jetzt zu lang zu unübersichtlich ok dann split ich vielleicht auf in ja was"}, {"id": 1123, "start": 5350.24, "end": 5356.28, "text": "gibt uns jetzt html oder es wird mir zu unübersichtlich dann mache ich vielleicht den db kontext aus"}, {"id": 1124, "start": 5356.28, "end": 5361.2, "text": "meinem start-up raus oder irgendwie sowas ja manche sachen sind allerdings tatsächlich"}, {"id": 1125, "start": 5361.2, "end": 5372.0, "text": "sinnvoll wenn man das macht weil bestimmte sachen sucht man halt an speziellen stellen"}, {"id": 1126, "start": 5372.0, "end": 5378.32, "text": "ja zum beispiel sucht man in einem asp.net projekt immer eine start-up punkt s h äh"}, {"id": 1127, "start": 5378.32, "end": 5384.6, "text": "man kann das anders konfigurieren aber das macht niemand und deswegen verwirrt es die"}, {"id": 1128, "start": 5384.6, "end": 5388.64, "text": "leute unglaublich und ein selbst wenn man sich das halbes jahr später wieder angucken"}, {"id": 1129, "start": 5388.64, "end": 5394.08, "text": "muss wenn man in in main irgendwie seinen start-up konfiguriert anstatt es da da punkt"}, {"id": 1130, "start": 5394.08, "end": 5401.36, "text": "s zu haben aber was ich damit sagen will ist einfach man muss die sachen nicht unbedingt"}, {"id": 1131, "start": 5401.36, "end": 5406.16, "text": "nur machen weil irgendwie einer gesagt hat in einem webcast oder so das ist super oder"}, {"id": 1132, "start": 5406.16, "end": 5413.08, "text": "weiter hersteller sagt das ist super ich ich handel es mittlerweile so dass ich viele sachen"}, {"id": 1133, "start": 5413.08, "end": 5418.48, "text": "so macht wie es mir am saubersten vorkommt und da ist halt vieles geschmackssache auf"}, {"id": 1134, "start": 5418.48, "end": 5422.08, "text": "der anderen seite wenn man sachen im team bastelt ja dann sollte man natürlich gucken"}, {"id": 1135, "start": 5422.08, "end": 5426.0, "text": "dass alle so ungefähr das gleiche machen also es hat zum beispiel keinen sinn wenn"}, {"id": 1136, "start": 5426.0, "end": 5431.96, "text": "irgendwie einer styles mit das macht und der andere mit scss das ist bescheuert wenn ihr"}, {"id": 1137, "start": 5431.96, "end": 5438.52, "text": "alleine da dran rumwurstet und euch gefällt das besser dann nimmt das und drauf geschissen"}, {"id": 1138, "start": 5438.52, "end": 5453.28, "text": "dass stss das verbreitete ist warum nicht ja ich müsste ich müsste mir da mal ein bisschen"}, {"id": 1139, "start": 5453.28, "end": 5457.28, "text": "mehr da gibt es da gibt es bestimmt viel bessere beispiele als die die mir jetzt gerade eingefallen"}, {"id": 1140, "start": 5457.28, "end": 5469.68, "text": "sind wo immer gesagt wird das muss das muss man so machen und das wäre total anti pet"}, {"id": 1141, "start": 5469.68, "end": 5475.56, "text": "anti pettern ist auch so ein komisch so geiles wort wenn man das so und so macht ich habe"}, {"id": 1142, "start": 5475.56, "end": 5484.8, "text": "ich habe schönes beispiel ich habe schönes beispiel es gibt in asp.net core was das nennt"}, {"id": 1143, "start": 5484.8, "end": 5494.28, "text": "sich so was man damit machen kann i hosted service ist im prinzip eine einfache variante"}, {"id": 1144, "start": 5494.28, "end": 5500.04, "text": "um um hintergrund sachen um sachen im hintergrund laufen zu lassen ich muss jetzt gar nicht"}, {"id": 1145, "start": 5500.04, "end": 5505.0, "text": "so sehr im detail eingehen was was sie da eigentlich genau machen aber es ist relativ"}, {"id": 1146, "start": 5505.0, "end": 5514.36, "text": "es ist relativ das ist wieder typisch ms beispiel dabei ist das übelst easy as fuck hallo"}, {"id": 1147, "start": 5514.36, "end": 5520.2, "text": "du machst eine klasse implementierst zwei metoden start stopp das war es mehr musst"}, {"id": 1148, "start": 5520.2, "end": 5526.72, "text": "du nicht machen so also zumindest wenn man nicht gerade so ein riesen fettes ms ms beispiel"}, {"id": 1149, "start": 5526.72, "end": 5536.04, "text": "ms beispiel basteln so und jetzt kommt ja irgendwann mal der fall dass man sagt ok also zum anwendungszweck"}, {"id": 1150, "start": 5536.04, "end": 5542.6, "text": "für so einen für so einen hintergrund service ist zum beispiel irgendwelche sachen die als"}, {"id": 1151, "start": 5542.6, "end": 5550.64, "text": "gelöscht markiert sind rauszuwerfen oder im hintergrund irgendwelche neuen sachen von"}, {"id": 1152, "start": 5550.64, "end": 5556.76, "text": "einer web api abzurufen oder sowas oder emails ja emails newsletter versenden was auch immer"}, {"id": 1153, "start": 5556.76, "end": 5563.12, "text": "also irgendwas was asynchron im hintergrund passieren muss so und da gibt es so eine regel"}, {"id": 1154, "start": 5563.12, "end": 5568.24, "text": "die sagt man sollte nicht und die schreiben halt nicht man sollte nicht sondern die schreiben"}, {"id": 1155, "start": 5568.24, "end": 5572.8, "text": "halt schon fast man darf nicht man sollte eben nicht aus diesen hintergrund diensten auf die"}, {"id": 1156, "start": 5572.8, "end": 5580.76, "text": "datenbank zugreifen was aber in vielen fällen gar nicht anders geht und ich habe am anfang auch"}, {"id": 1157, "start": 5580.76, "end": 5584.6, "text": "gedacht immer alter max kannst du das da nicht einfach aus dem hintergrund dienst auf die"}, {"id": 1158, "start": 5584.6, "end": 5590.84, "text": "datenbank zugreifen und das ist ja voll antipattern aber warum denn nicht man muss sich einfach nur"}, {"id": 1159, "start": 5590.84, "end": 5596.68, "text": "gedanken machen was man will weil die andere lösung wäre man müsste übelst kompliziertes"}, {"id": 1160, "start": 5596.68, "end": 5603.92, "text": "zeug basteln dann müsste irgendwelche vier fünf zusätzliche klassen in der dependency"}, {"id": 1161, "start": 5603.92, "end": 5608.28, "text": "injection registrieren dann müsste man gucken dass das eine in das andere injectet werden"}, {"id": 1162, "start": 5608.28, "end": 5613.88, "text": "kann nur dass man dann irgendwie also total total wir wenn man einfach nur den status in der"}, {"id": 1163, "start": 5613.88, "end": 5617.56, "text": "datenbank markieren will warum soll man das nicht aus dem hintergrund dienst machen letztendlich"}, {"id": 1164, "start": 5617.56, "end": 5626.8, "text": "muss es ja irgendwo gemacht werden und warum nicht an der stelle wo es anfällt die schreiben"}, {"id": 1165, "start": 5626.8, "end": 5631.68, "text": "halt bei ms so nach dem motto nein man sollte auf gar keinen fall auf die datenbank zugreifen aber"}, {"id": 1166, "start": 5631.68, "end": 5638.8, "text": "es geht halt nicht anders und bevor man da jetzt fünf neue klassen und 500 zeilen code basteln nur"}, {"id": 1167, "start": 5638.8, "end": 5643.44, "text": "dass man das an dieser einen stelle nicht machen muss macht man es halt einfach spricht überhaupt"}, {"id": 1168, "start": 5643.44, "end": 5648.8, "text": "nichts da es spricht wirklich gar nichts dagegen und ich habe mich früher viel zu sehr an solchen"}, {"id": 1169, "start": 5648.8, "end": 5657.16, "text": "offiziellen das macht man nicht gerichtet obwohl es an vielen von vielen stellen einfach tatsächlich"}, {"id": 1170, "start": 5657.16, "end": 5666.76, "text": "die einfachste lösung ist und die übersichtigste lösung so aber machen wir mal weiter was kann man"}, {"id": 1171, "start": 5666.76, "end": 5674.68, "text": "sonst auch schönes machen in sass modules gibt es nicht parcels haben ausprobiert mix ins ok jetzt"}, {"id": 1172, "start": 5674.68, "end": 5681.52, "text": "jetzt wirds big big brain time mix ins kommen wir machen wir machen erst noch mal unsere unsere"}, {"id": 1173, "start": 5681.52, "end": 5686.6, "text": "nav navigations leist irgendwie bei was kann man da können wir da irgendwie auch ich habe"}, {"id": 1174, "start": 5686.6, "end": 5693.64, "text": "eine idee wir können auch wir machen und border border border wie man konnte border in einem"}, {"id": 1175, "start": 5693.64, "end": 5703.88, "text": "schreiben 2 pixel solid und dann irgendwie black oder so ok das sieht mega kacke aus aber wir haben"}, {"id": 1176, "start": 5703.88, "end": 5709.44, "text": "noch eine variable gemacht für background background ist weiß moment background ist das gleiche wie"}, {"id": 1177, "start": 5709.44, "end": 5717.92, "text": "hier ne da kann ich mir das eigentlich sparen exzellent aber wir können sagen border radius"}, {"id": 1178, "start": 5717.92, "end": 5725.16, "text": "und da machen wir fünf pixel dann sieht es ein bisschen apple styliger auch abgerundet aus und"}, {"id": 1179, "start": 5725.16, "end": 5731.48, "text": "body machen wir mal padding zehn pixel dass man was sieht exquisite abgerundete ecken"}, {"id": 1180, "start": 5736.08, "end": 5736.58, "text": "so"}, {"id": 1181, "start": 5736.58, "end": 5751.74, "text": "na gut ich habe noch eine idee wir könnten auch eine sache mal probieren habe ich habe"}, {"id": 1182, "start": 5751.74, "end": 5761.06, "text": "ich roboto oder so installiert da machen wir mal von family moment habe ich das nicht woanders"}, {"id": 1183, "start": 5761.06, "end": 5766.66, "text": "schon stehen von family ach hier habe ich aber von family hier raus dann sieht es jetzt erst mal kurz"}, {"id": 1184, "start": 5766.66, "end": 5777.14, "text": "kacke aus roboto hier habe ich den installiert what apples what the fuck ok alles klar was ist"}, {"id": 1185, "start": 5777.14, "end": 5782.86, "text": "das für ein komisches preset apple system blink mac os ok wunderbar so lassen wir das perfekt"}, {"id": 1186, "start": 5782.86, "end": 5791.1, "text": "keine ahnung was es eigentlich jetzt was es alles macht kein java script framework bis jetzt das"}, {"id": 1187, "start": 5791.1, "end": 5794.62, "text": "wird keine website ich will mir einfach nur angucken wie es das funktioniert das wird"}, {"id": 1188, "start": 5794.62, "end": 5806.54, "text": "nichts fertig die animation ist kaputt leute brain brain explodiert aber ein browser ist"}, {"id": 1189, "start": 5806.54, "end": 5820.18, "text": "abgeschissen erzhaft wow der browser ist verreckt warum ist what the chat wer von euch ist das"}, {"id": 1190, "start": 5820.18, "end": 5843.82, "text": "ein in wer war es ja ja schon ok chat schon ok warum wird eigentlich dieses gift so schnell"}, {"id": 1191, "start": 5843.82, "end": 5850.06, "text": "abgespielt alle an alle anderen gifs vollkommen ok von der geschwindigkeit her aber dieses gif"}, {"id": 1192, "start": 5850.06, "end": 5859.7, "text": "hyper shit stimmt wir können das gift noch sentern was ist denn der neueste css big brain"}, {"id": 1193, "start": 5859.7, "end": 5866.98, "text": "wieg dieses gift zu sentern also ich würde jetzt sagen text center aber das ist bestimmt"}, {"id": 1194, "start": 5866.98, "end": 5874.3, "text": "nicht mehr best practice wie es so schön heißt also also man könnte man könnte jetzt ja sowas"}, {"id": 1195, "start": 5874.3, "end": 5887.58, "text": "hier machen text allein center aber das ist bestimmt nicht die justify content center aber"}, {"id": 1196, "start": 5887.58, "end": 5902.66, "text": "da muss ich sagen display flex was denn flex oder flex box was ist der unterschied zwischen"}, {"id": 1197, "start": 5902.66, "end": 5916.82, "text": "flex und flex box ist das gleich in ne kann er nicht sein flex macht das und flex box macht"}, {"id": 1198, "start": 5916.82, "end": 5927.86, "text": "das oder im moment gibt es flex box vielleicht in meinem browser nicht ach nee flex box gibt's"}, {"id": 1199, "start": 5927.86, "end": 5945.06, "text": "nicht aber um steht es dann hier drin visual studio ist gebadet ok so aber jetzt habe ich"}, {"id": 1200, "start": 5945.06, "end": 5954.3, "text": "ja alles so komisch gesendet was muss ich jetzt machen ich glaube ich muss mir mal ein flex box"}, {"id": 1201, "start": 5954.3, "end": 5967.06, "text": "tutorial angucken das funktioniert nicht der eierkopf muss in ein extra diff dann funktioniert das"}, {"id": 1202, "start": 5967.06, "end": 5987.3, "text": "nee hast du firefox ja habe ich was soll ich da sehen guide to flex box exquisite und auf"}, {"id": 1203, "start": 5987.3, "end": 6002.9, "text": "das diff dann die klasse setzten was welche klasse flex direction excellent ok jetzt ist"}, {"id": 1204, "start": 6002.9, "end": 6006.74, "text": "aber immer noch nicht in der mitte aber wahrscheinlich muss ich jetzt das diff wieder"}, {"id": 1205, "start": 6006.74, "end": 6028.5, "text": "weg machen ha ha exquisite ich finde es fast noch besser so das allein"}, {"id": 1206, "start": 6028.5, "end": 6043.54, "text": "nee aber vielleicht muss ich justify ich finde es noch viel besser ich lasse es so ich lasse"}, {"id": 1207, "start": 6043.54, "end": 6047.02, "text": "das so wahrscheinlich muss ich dem eine breite geben könnte das sein dass irgendwie sowas"}, {"id": 1208, "start": 6047.02, "end": 6065.46, "text": "aus nee was allein center fehlt was denn welches allein allein content allein was allein items"}, {"id": 1209, "start": 6065.46, "end": 6085.42, "text": "center ja aber dann ist sie nachbar auch in der mitte nur ok ich werde ich werde mal ich"}, {"id": 1210, "start": 6085.42, "end": 6090.66, "text": "muss mich mal mit mit der flex box geschichte beschäftigen in der zwischenzeit werde ich"}, {"id": 1211, "start": 6090.66, "end": 6095.5, "text": "mal folgendes machen auch wenn das auch wenn das absolut old school ist aber da weiß ich"}, {"id": 1212, "start": 6095.5, "end": 6110.14, "text": "dass es funktioniert ich lasse es jetzt erstmal so ich war ja ich weiß dass ich alles alleine"}, {"id": 1213, "start": 6110.14, "end": 6120.9, "text": "aber ich habe davon kein plastenschimmer gesagt ich bin nicht der ultra frontend kenner ich"}, {"id": 1214, "start": 6120.9, "end": 6124.62, "text": "lasse es jetzt erstmal so wir gucken wir wollten eigentlich das angucken und nicht how to"}, {"id": 1215, "start": 6124.62, "end": 6136.1, "text": "allein gif aber ist ja allein es ist jetzt es ist exquisite im center ok moment youtube"}, {"id": 1216, "start": 6136.1, "end": 6157.82, "text": "was flex box flex box in 15 minutes nee ich gucke mir das an weil von dem habe ich schon"}, {"id": 1217, "start": 6157.82, "end": 6163.22, "text": "das sas tutorial angeguckt das fand ich auch ganz gut das gucke ich mal zum einschlafen"}, {"id": 1218, "start": 6163.22, "end": 6168.78, "text": "auf dem tablet an und dann bin ich morgen ultra frei fährt und kann flex box easy aus"}, {"id": 1219, "start": 6168.78, "end": 6179.34, "text": "dem kopf auswendig einfach einfach pro tip einfach sachen vorm schlafen angucken dann"}, {"id": 1220, "start": 6179.34, "end": 6187.62, "text": "kann man sich das alles immer gut merken wann kommt css krit ich glaube sein flex box ist"}, {"id": 1221, "start": 6187.62, "end": 6202.54, "text": "krit total outdated ich weiß das dann morgen auch nicht aber ich finde trotzdem jetzt ohne"}, {"id": 1222, "start": 6202.54, "end": 6206.94, "text": "mist also ich finde ich finde wirklich dass es hilft wenn man also ich ich merke mir sachen"}, {"id": 1223, "start": 6206.94, "end": 6216.26, "text": "die ich mir vom form die ich mir zum einschlafen angucken besonders gut so also mix ins was"}, {"id": 1224, "start": 6216.26, "end": 6225.7, "text": "machen für mixins transform oh jetzt wird es aber exquisite big brain was machen die"}, {"id": 1225, "start": 6225.7, "end": 6252.18, "text": "dann hier"}, {"id": 1226, "start": 6252.18, "end": 6260.22, "text": "ich muss es jetzt mal ausprobieren ich habe also ich vermute mal ich vermute mal dass das"}, {"id": 1227, "start": 6260.22, "end": 6268.66, "text": "hier so eine art funktion ist die man die man quasi hier inkluden kann also sprich ich"}, {"id": 1228, "start": 6268.66, "end": 6272.26, "text": "kann die nicht ich muss sie nicht in box inkluden ich könnte zum beispiel auch in body inkluden"}, {"id": 1229, "start": 6272.26, "end": 6285.62, "text": "aber mal und alles mein body 30 prozent schape exzellent dann ist doch auch mal was ich finde"}, {"id": 1230, "start": 6285.62, "end": 6303.82, "text": "so sollte man das lassen so viel weil das geht ja schon fast als moderne kunst durch"}, {"id": 1231, "start": 6303.82, "end": 6315.22, "text": "ok ich glaube ich habe es kapiert ich glaube ich habe es halbwegs ich habe es halbwegs"}, {"id": 1232, "start": 6315.22, "end": 6319.14, "text": "gecheckt das heißt ich probiere ich probiere also man könnte quasi so was hier machen"}, {"id": 1233, "start": 6319.14, "end": 6328.38, "text": "so highlight und dann und dann sagen wir text text wird rot im highlight oder text wir haben"}, {"id": 1234, "start": 6328.38, "end": 6334.98, "text": "so eine variable für warning gemacht also sagen wir color ne mal mal fg ne moment"}, {"id": 1235, "start": 6334.98, "end": 6342.82, "text": "ne color color color ne gibt es nicht auch fg ne das gibt es nicht und foreground gibt"}, {"id": 1236, "start": 6342.82, "end": 6346.5, "text": "es auch nicht ok ist color und dann irgendwie warning"}, {"id": 1237, "start": 6346.5, "end": 6360.74, "text": "tja was machen wir dahinten als argument keine ahnung ich habe eine idee text bolt"}, {"id": 1238, "start": 6360.74, "end": 6377.26, "text": "bei gibt es das war aber noch mal war das hier text bolt wie macht man die text text"}, {"id": 1239, "start": 6377.26, "end": 6381.9, "text": "weight font weight font weight bolt exzellent ja bisschen undurchsichtig ist es manchmal"}, {"id": 1240, "start": 6381.9, "end": 6396.3, "text": "schon so und dann sagen wir so was hier wie genau size und wie war das jetzt dollar size"}, {"id": 1241, "start": 6396.3, "end": 6407.98, "text": "so also das heißt wenn ich das jetzt richtig verstanden habe ich mache das mal hier oben"}, {"id": 1242, "start": 6407.98, "end": 6413.02, "text": "drüber ich kann das jetzt an verschiedenen stellen verwenden also mal angenommen ich"}, {"id": 1243, "start": 6413.02, "end": 6420.74, "text": "möchte jetzt meine navigationsleiste oder hier von meinem link soll die schrift fett"}, {"id": 1244, "start": 6420.74, "end": 6430.54, "text": "und in bolt sein dann sage ich include include oh wir haben sogar auto complete highlight"}, {"id": 1245, "start": 6430.54, "end": 6442.82, "text": "oder sowas wie bolt ah yes ok kapiert ah stimmt wie sieht es mit default parameter aus"}, {"id": 1246, "start": 6442.82, "end": 6462.26, "text": "sowas sowas nee gibt sie fault parameter"}, {"id": 1247, "start": 6462.26, "end": 6475.58, "text": "default values passiv passiv default value for mixins oh man kann if else darin machen"}, {"id": 1248, "start": 6475.58, "end": 6499.82, "text": "what if else aber das kann man noch gar nicht dynamisch ok nee da könnte ich sowas sagen"}, {"id": 1249, "start": 6499.82, "end": 6507.06, "text": "wie wenn border size von dem jeweiligen element wo ich das mixin drauf anwende wenn das größer"}, {"id": 1250, "start": 6507.06, "end": 6511.34, "text": "als sowas ist dann möchte ich keine ahnung den den border durchsichtig machen wenn es"}, {"id": 1251, "start": 6511.34, "end": 6523.02, "text": "kleiner ist bin ich da irgendwie sowas es gibt auch bestimmt die fault arguments optional"}, {"id": 1252, "start": 6523.02, "end": 6533.9, "text": "arguments doppelpunkt was ist s css s css ist ein super set von css also sprich du kannst"}, {"id": 1253, "start": 6533.9, "end": 6541.18, "text": "alles machen was du in css machen kannst nur noch mehr doppelpunkt ist das ok ah es funktioniert"}, {"id": 1254, "start": 6541.18, "end": 6555.3, "text": "das ist praktisch das ist wirklich praktisch das ist echt praktisch also sprich wenn ich"}, {"id": 1255, "start": 6555.3, "end": 6563.26, "text": "jetzt was übergebe kann ich jetzt die klammern weglassen ach noch besser also sprich ok"}, {"id": 1256, "start": 6563.26, "end": 6567.26, "text": "ich meine in dem einen fall ist jetzt natürlich überflüssig da könnte ich das ja auch reinschreiben"}, {"id": 1257, "start": 6567.26, "end": 6574.34, "text": "aber man muss ja davon ausgehen dass man das auf mehrere dass man das auf mehrere objekte"}, {"id": 1258, "start": 6574.34, "end": 6578.5, "text": "anwenden will na also mal angenommen ich hätte irgendwie noch ups mal angenommen ich hätte"}, {"id": 1259, "start": 6578.5, "end": 6585.46, "text": "noch irgendwie einen button oder so weißt du um teufel wischel zu dir was machst du"}, {"id": 1260, "start": 6585.46, "end": 6589.98, "text": "denn da also mal angenommen ich hätte noch einen button und ich hätte dann irgendwie"}, {"id": 1261, "start": 6589.98, "end": 6595.78, "text": "noch was irgendwie noch anderes zeug da könnte ich dann auch hier sagen include highlight"}, {"id": 1262, "start": 6595.78, "end": 6612.22, "text": "und er würde er würde die sachen bolt und in warning color machen das ist echt praktisch"}, {"id": 1263, "start": 6612.22, "end": 6619.62, "text": "benötigt man für workstation pro 16 einen neuen key wenn man ein 15 ja immer aber ich"}, {"id": 1264, "start": 6619.62, "end": 6631.94, "text": "glaube es gibt relativ günstige upgrades ok das ist das ist echt das ist echt nützlich"}, {"id": 1265, "start": 6631.94, "end": 6638.22, "text": "das finde ich gut so wie sieht das mit if else aus das muss ich mir jetzt nochmal angucken"}, {"id": 1266, "start": 6638.22, "end": 6646.06, "text": "function sonst was ok es wird noch deutlich big brain brainiger was man machen kann"}, {"id": 1267, "start": 6646.06, "end": 6657.98, "text": "man kann man es gibt schleifen ok aber das ist ok das ist ja ein pre processor das heißt"}, {"id": 1268, "start": 6657.98, "end": 6661.82, "text": "man darf sich nicht jetzt irgendwie denken man könnte dort dynamisch irgendwelche sachen"}, {"id": 1269, "start": 6661.82, "end": 6667.38, "text": "machen während der user resized im browser das kann ja nicht funktionieren wenn es wenn"}, {"id": 1270, "start": 6667.38, "end": 6673.74, "text": "es pre pre process calculated ist also sprich diese sachen laufen nicht zur runtime also"}, {"id": 1271, "start": 6673.74, "end": 6684.18, "text": "wenn ich jetzt meinen browser resize kriegt da s css absolut nix von mit das heißt es"}, {"id": 1272, "start": 6684.18, "end": 6693.7, "text": "ist auch nur beschränkt nützlich ich war man könnte damit vielleicht verschiedene"}, {"id": 1273, "start": 6693.7, "end": 6704.82, "text": "klassen vor vor generieren also mal angenommen man möchte jetzt irgendwie eine tabelle oder"}, {"id": 1274, "start": 6704.82, "end": 6710.9, "text": "irgendwie den krit mit bis zu 20 elementen und man generiert sich quasi für jedes element"}, {"id": 1275, "start": 6710.9, "end": 6720.54, "text": "irgendwie einen passenden style vor oder sowas ja aber ich glaube das ist ich glaube nicht"}, {"id": 1276, "start": 6720.54, "end": 6736.86, "text": "dass man das so oft verwendet glaube ich glaube nicht dass man das so oft verwendet"}, {"id": 1277, "start": 6736.86, "end": 6743.82, "text": "wenn du was dynamisches brauchst css custom prob was sind css custom properties erst einmal"}, {"id": 1278, "start": 6743.82, "end": 6747.98, "text": "ich bin überhaupt nicht auf dem also die wahre css variablen sehr die kenne ich die"}, {"id": 1279, "start": 6747.98, "end": 6753.18, "text": "kenne ich wusste nicht dass die custom properties heißen ich dachte immer css variablen für"}, {"id": 1280, "start": 6753.18, "end": 6764.46, "text": "ja die kenne ich kenne ich so also das ist ja schon mal an sich ganz nice was was kann"}, {"id": 1281, "start": 6764.46, "end": 6769.82, "text": "man da sonst noch jetzt schönes machen es gab da noch die möglichkeit das zeug irgendwie"}, {"id": 1282, "start": 6769.82, "end": 6787.3, "text": "zu erweitern irgendwas mit extent gab es dann noch extent"}, {"id": 1283, "start": 6787.3, "end": 6801.98, "text": "was für was ist das prozentzeichen da vorne dran also mein extent was macht prozent was"}, {"id": 1284, "start": 6801.98, "end": 6808.34, "text": "macht ein prozent in css ich kenne punkt ich kenne raute ich kenne einfach nur element"}, {"id": 1285, "start": 6808.34, "end": 6826.66, "text": "aber was macht denn was macht denn achso das ist eine sassgeschichte placeholder selektor"}, {"id": 1286, "start": 6826.66, "end": 6851.18, "text": "achso jetzt verstehe ich also sprich diese sache landet nicht im css es sei denn ich"}, {"id": 1287, "start": 6851.18, "end": 6857.1, "text": "stände sie das ist quasi so eine base class um es war so ganz abstrakt zu sagen oder abstrueck"}, {"id": 1288, "start": 6857.1, "end": 6862.3, "text": "base class sogar noch besser das ist quasi irgend so ein ding von dem ich von dem ich"}, {"id": 1289, "start": 6862.3, "end": 6871.74, "text": "extenten kann die aber alleine nichts macht also sprich die taucht nie im css feil auf"}, {"id": 1290, "start": 6871.74, "end": 6876.42, "text": "sondern es taucht nur message im css feil auf das ist doch dann aber quasi ein bisschen"}, {"id": 1291, "start": 6876.42, "end": 6905.38, "text": "so was wie ein mixin oder große unterschied dazwischen ist jetzt ja nicht mixin hat parameter"}, {"id": 1292, "start": 6905.38, "end": 6917.22, "text": "ja richtig aber ich meine ich könnte ja einfach auch den mixin ohne parameter verwenden oder"}, {"id": 1293, "start": 6917.22, "end": 6925.22, "text": "ok ich glaube das ist so ein feature man weiß wenn man es braucht und dann kann man es verwenden"}, {"id": 1294, "start": 6925.22, "end": 6930.22, "text": "also man steht irgendwann mal vor einem problem und denkt sich ach da wäre das für ganz gut"}, {"id": 1295, "start": 6930.22, "end": 6937.62, "text": "dann verwendet man es wählt es da grad nichts zu ein aber das mit extent können wir noch"}, {"id": 1296, "start": 6937.62, "end": 6944.3, "text": "mal ausprobieren also sprich mal angenommen ich komme jetzt auf die glorreiche idee und"}, {"id": 1297, "start": 6944.3, "end": 6952.34, "text": "finde meine navigations bar so geil dass ich die extenten will da könnte ich dann so was"}, {"id": 1298, "start": 6952.34, "end": 6973.22, "text": "hier machen kann sup naf extent naf ne noch oder so und jetzt und jetzt könnte ich quasi"}, {"id": 1299, "start": 6973.22, "end": 6988.22, "text": "noch mal eine naf bar machen als diff und dann sagen class sup naf ohohoho magic ich"}, {"id": 1300, "start": 6988.22, "end": 6998.86, "text": "habe meine naf leiste geklont exquisite so und da könnte ich jetzt auch noch was ändern"}, {"id": 1301, "start": 6998.86, "end": 7006.14, "text": "drinnen und ich könnte zum beispiel sagen ja ne aber hier will ich jetzt color wieder"}, {"id": 1302, "start": 7006.14, "end": 7020.38, "text": "black haben ne das funktioniert nicht ach moment das ist ja auch in dem art drinne das"}, {"id": 1303, "start": 7020.38, "end": 7033.1, "text": "muss ich hier machen ach ne ich überschreibe das ja hier ne das ok das funktioniert nicht"}, {"id": 1304, "start": 7033.1, "end": 7042.86, "text": "das funktioniert nicht wie ich mir das gedacht habe aber prinzipiell also was ich zum beispiel"}, {"id": 1305, "start": 7042.86, "end": 7056.66, "text": "machen könnte ist sowas wie hier will ich jetzt border border color black so und dann"}, {"id": 1306, "start": 7056.66, "end": 7063.18, "text": "die momentan machen wir border 2 pixels solid black so geht das na genau und jetzt ist nur"}, {"id": 1307, "start": 7063.18, "end": 7068.26, "text": "die jetzt hat nur die einen rand und schwarz aber erbt alles andere also sprich das hover"}, {"id": 1308, "start": 7068.26, "end": 7078.34, "text": "erbt die von hier oben und so ok das das stelle ich mir auch äußerst praktisch vor"}, {"id": 1309, "start": 7078.34, "end": 7089.58, "text": "wenn man zum beispiel irgendwelche forms formelemente hat oder so die hat man ja vielleicht"}, {"id": 1310, "start": 7089.58, "end": 7093.02, "text": "auch in drei vier verschiedene formularen und man möchte mehr oder weniger immer das"}, {"id": 1311, "start": 7093.02, "end": 7102.62, "text": "gleiche stylen bis auf ein paar kleinigkeiten unterschied das das klingt das klingt eigentlich"}, {"id": 1312, "start": 7102.62, "end": 7115.98, "text": "ganz sinnvoll ja ja ich probiere jetzt konnte man nicht konnte man nicht color überschreiben"}, {"id": 1313, "start": 7115.98, "end": 7122.94, "text": "mit sache red und jetzt irgendwie important beim nee ach nee das geht nicht das geht nicht"}, {"id": 1314, "start": 7122.94, "end": 7137.9, "text": "das geht nicht weil das in dem art drunter ist ja aber schon mal nicht übel exquisite"}, {"id": 1315, "start": 7137.9, "end": 7146.18, "text": "im großen und ganzen jetzt mal so an die sas kenner im großen und ganzen war es das glaube"}, {"id": 1316, "start": 7146.18, "end": 7153.54, "text": "ich halbwegs oder also ich meine klar im detail gibt es da noch deutlich mehr also ich habe"}, {"id": 1317, "start": 7153.54, "end": 7158.66, "text": "jetzt gesehen man kann schleifen machen und und nur irgendwie fangt schon sachen auf aber"}, {"id": 1318, "start": 7158.66, "end": 7164.62, "text": "so im von den funktionsbereichen her war es das im großen und ganzen das ist eigentlich"}, {"id": 1319, "start": 7164.62, "end": 7176.02, "text": "ziemlich easy"}, {"id": 1320, "start": 7176.02, "end": 7184.1, "text": "ja man kann natürlich noch 30.000 andere sachen machen aber so von den funktionsbereichen"}, {"id": 1321, "start": 7184.1, "end": 7188.94, "text": "her habe ich den eindruck ist das ziemlich übersichtlich das finde ich gut ich glaube"}, {"id": 1322, "start": 7188.94, "end": 7194.66, "text": "das werde ich mal bei der nächsten sachen verwenden wir werden in einem der nächsten"}, {"id": 1323, "start": 7194.66, "end": 7208.42, "text": "streams das dashboard bauen für den esp 32 für nehme ich genau das wlan einstellung"}, {"id": 1324, "start": 7208.42, "end": 7215.02, "text": "firmware update und locks angucken weil aktuell geht das nur über karl befehle was vielleicht"}, {"id": 1325, "start": 7215.02, "end": 7222.78, "text": "jetzt nicht jedermanns geschmack ist letztendlich für mich kein problem also ich mache es lieber"}, {"id": 1326, "start": 7222.78, "end": 7229.22, "text": "über den karl befehl und letztendlich ist es eigentlich rausgeschmissene zeit insofern"}, {"id": 1327, "start": 7229.22, "end": 7234.5, "text": "weil ich eh der einzige bin der die sachen hier bei mir daheim verwendet aber ich glaube"}, {"id": 1328, "start": 7234.5, "end": 7240.42, "text": "ich finde es auch ich würde es auch ganz angenehm verwenden ganz angenehm finden wenn"}, {"id": 1329, "start": 7240.42, "end": 7248.62, "text": "ich zumindest verwenden könnte um wifi settings zu zu ändern übers web interface ich habe"}, {"id": 1330, "start": 7248.62, "end": 7255.86, "text": "es ja aktuell so gebaut auf dem esp 32 dass der zwei verschiedene oder bis zu drei verschiedene"}, {"id": 1331, "start": 7255.86, "end": 7264.18, "text": "wlan durchprobiert der probiert default wlan aus was er direkt eingestellt hat und guckt"}, {"id": 1332, "start": 7264.18, "end": 7270.86, "text": "bis in bis bis zu in zwei json dateien auf dem flash nach ob der weitere wifi settings"}, {"id": 1333, "start": 7270.86, "end": 7271.38, "text": "findet"}, {"id": 1334, "start": 7271.38, "end": 7287.58, "text": "wie es ganz schöne dashboards brennen ja aber ich glaube ich mache das dashboard nicht nicht"}, {"id": 1335, "start": 7287.58, "end": 7295.22, "text": "in die chairs weil ich habe nicht so viel flasche und ich will da wirklich alles möglich"}, {"id": 1336, "start": 7295.22, "end": 7301.74, "text": "sparen ich wollte mir das hier mal angucken weil da wohl relativ kleine falls rauskommen"}, {"id": 1337, "start": 7301.74, "end": 7308.5, "text": "oder im zweifelsfall einfach die sachen von hand ja was krippen braucht ja nicht so viel"}, {"id": 1338, "start": 7308.5, "end": 7315.42, "text": "wie groß wie groß ist der view js min und das ganze geht zippt zeigt mal her muss mal"}, {"id": 1339, "start": 7315.42, "end": 7324.58, "text": "gucken vielleicht vielleicht ist meine bedenken da auch unsinnig ist das die minifight variante"}, {"id": 1340, "start": 7324.58, "end": 7336.02, "text": "guck mal wie groß das ist so 91 k geht zippt oder mal ich muss ich ich blende das mal kurz"}, {"id": 1341, "start": 7336.02, "end": 7346.86, "text": "um so es ist auf jeden fall die minifight variante geht zippt das ganze wie groß 33k naja gut das"}, {"id": 1342, "start": 7346.86, "end": 7353.38, "text": "geht eigentlich noch aber auf der anderen seite sind es 33k umsonst die die ganze webseite ist"}, {"id": 1343, "start": 7353.38, "end": 7363.66, "text": "vielleicht 5k oder so ist aber also die sassgeschichte gefällt mir ich mag egen ich mag"}, {"id": 1344, "start": 7363.66, "end": 7369.7, "text": "eh allgemein so dinger die man innerhalb von paar stunden den überblick hat und halbwegs weiß was"}, {"id": 1345, "start": 7369.7, "end": 7382.3, "text": "sie was sie machen also nicht so was wie z++ zum beispiel oder gar cobalt also ich weiß ja dass"}, {"id": 1346, "start": 7382.3, "end": 7386.5, "text": "ich an weihnachten ein bisschen cobalt programmieren muss ja das hat mich dann der chat dazu schon"}, {"id": 1347, "start": 7386.5, "end": 7396.74, "text": "überredet und ich ich predikte jetzt schon mal eine sache cobalt werde ich wahnsinnig eklig und"}, {"id": 1348, "start": 7396.74, "end": 7404.3, "text": "oldschool finden aber ich finde es wahrscheinlich trotzdem besser als z++ weil weil einfach fast"}, {"id": 1349, "start": 7404.3, "end": 7409.5, "text": "also es gibt eigentlich kaum was was schlechter ist insofern wahrscheinlich sogar cobalt gefällt"}, {"id": 1350, "start": 7409.5, "end": 7423.06, "text": "mir noch besser als z++ es wird echt mal zeit dass man sp 2 nacht 32 und 86 sinnvoll in was"}, {"id": 1351, "start": 7423.06, "end": 7428.94, "text": "andere programmieren kann es gibt schon zig projekte aber wirklich sinnvoll ist es nur möglich in"}, {"id": 1352, "start": 7428.94, "end": 7441.98, "text": "c++ leider jo ja chat das ging schneller als gedacht rast embed ja es gibt schon ein paar"}, {"id": 1353, "start": 7441.98, "end": 7449.46, "text": "versuche dafür es gibt auch schon so experimentelle sachen für sp 32 aber das ist halt weit davon"}, {"id": 1354, "start": 7449.46, "end": 7454.1, "text": "entfernt dass sie wirklich wirklich gut benutzbar ist und ich muss halt sagen rast ist auch so ein"}, {"id": 1355, "start": 7454.1, "end": 7464.18, "text": "ding das ist schon so ein bisschen big brain ja aber guck mal der browser hat wieder den"}, {"id": 1356, "start": 7464.18, "end": 7470.82, "text": "löffel abgegeben rast ist teilweise aber auch nicht schön zu lesen also rast hat schon ein"}, {"id": 1357, "start": 7470.82, "end": 7479.18, "text": "bisschen also rast ist anders anders merkwürdig als z++ z++ ist merkwürdig weil es an vielen"}, {"id": 1358, "start": 7479.18, "end": 7484.46, "text": "stellen einfach total inkonsistent ist und man das gefühl hat das cremium will ein verarschen so"}, {"id": 1359, "start": 7484.46, "end": 7490.82, "text": "und bei rast ist es so man denkt permanent man ist zu dumm für ich glaube ich glaube das habe"}, {"id": 1360, "start": 7490.82, "end": 7499.7, "text": "ich ganz gut beschrieben ok ich habe das jetzt mal zugemacht warum auch immer das jetzt gecrasht"}, {"id": 1361, "start": 7499.7, "end": 7505.58, "text": "ist bei rast denkt man permanent man ist zu dumm für und bei css bei z++ denkt man permanent das"}, {"id": 1362, "start": 7505.58, "end": 7516.7, "text": "cremium will ein verarschen und ich finde die rast sonntags jetzt auch nicht die schönste die"}, {"id": 1363, "start": 7516.7, "end": 7522.5, "text": "besteht die besteht mir aus ein bisschen viel spitzen klammern denkst du dir irgendwann nochmal"}, {"id": 1364, "start": 7522.5, "end": 7530.78, "text": "was für channel points aus ja das mache ich dann wenn ich mir auch neue emotes hole aber spaß"}, {"id": 1365, "start": 7530.78, "end": 7535.02, "text": "beiseite ich habe wirklich vor nachdem ich jetzt ja auch gerade wieder viel streamen und ich weiß"}, {"id": 1366, "start": 7535.02, "end": 7539.66, "text": "recht und öfters gar ich will mir wirklich jetzt channel points besorgen nicht channel points"}, {"id": 1367, "start": 7539.66, "end": 7543.82, "text": "ordentlich emotes besorgen wir haben ja schon eine riesenliste gemacht mit emotes ich habe"}, {"id": 1368, "start": 7543.82, "end": 7560.3, "text": "ja glaube ich noch 25 emotes frei oder so massig ja ja go finde ich auch ganz ok die haben aber"}, {"id": 1369, "start": 7560.3, "end": 7566.9, "text": "auch ein paar merkwürdige entscheidungen aber ich habe schon eine weile nichts mein go gemacht dass"}, {"id": 1370, "start": 7566.9, "end": 7570.1, "text": "ich mich jetzt ich kann mich jetzt nicht so sehr drüber zum beispiel die sache dass es keine"}, {"id": 1371, "start": 7570.1, "end": 7575.82, "text": "generics wollten und jetzt doch irgendwie wie man sowas nicht wollen kann ist mir auch unbegreiflich"}, {"id": 1372, "start": 7575.82, "end": 7583.1, "text": "genau das gibt es nachdem ich mit dem youtube video fertig bin ne aber emotes ich habe wirklich"}, {"id": 1373, "start": 7583.1, "end": 7592.02, "text": "also die die wie soll ich sagen sie wirklich die absicht emotes zu machen jetzt peißen im stream"}, {"id": 1374, "start": 7592.02, "end": 7605.46, "text": "wäre nice ich bin kein großer peißen nicht fern kenne aber ich habe letztens was gemacht"}, {"id": 1375, "start": 7605.46, "end": 7611.06, "text": "da drin und es war sehr angenehm muss ich sagen ich sollte auf der arbeit jetzt ist"}, {"id": 1376, "start": 7611.06, "end": 7616.82, "text": "ihn auf letzten drücker wieder eingefallen ich sollte also es kam es kam es kam immer zu mir"}, {"id": 1377, "start": 7616.82, "end": 7624.14, "text": "und hat gefragt ob ich die dhcp konfig geht peißen auf dem esp 32 theoretisch schon aber"}, {"id": 1378, "start": 7624.14, "end": 7630.82, "text": "mit einschränkungen also es gibt micro peißen das geht ganz gut aber du hast du hast ein paar"}, {"id": 1379, "start": 7630.82, "end": 7635.82, "text": "einschränkungen die du mit c++ nicht hast zum beispiel wenn du den ssl webserver laufen lassen"}, {"id": 1380, "start": 7635.82, "end": 7642.54, "text": "willst oder so hast du nicht genug ram das geht mit c++ geht zum beispiel zumindest da sind"}, {"id": 1381, "start": 7642.54, "end": 7646.26, "text": "auf der arbeit zu mir kommen das wird auf letzten drücker eingefallen haben sie mich gefragt okay"}, {"id": 1382, "start": 7646.26, "end": 7654.74, "text": "ob ich ihnen nicht irgendwie eine linux dhcp server hinstellen könnte mit der konfig vom"}, {"id": 1383, "start": 7654.74, "end": 7660.34, "text": "windows dhcp server habe erst mal das kannst du vergessen im windows dhcp server stehen 30"}, {"id": 1384, "start": 7660.34, "end": 7665.74, "text": "milliarden sachen die du wahrscheinlich mit so einem ics gar nicht abbilden kannst so und irgendwann"}, {"id": 1385, "start": 7665.74, "end": 7670.02, "text": "haben sie dann gesagt ja okay verstehen wir es würde ihnen einfach reichen wenn man die zonen"}, {"id": 1386, "start": 7670.02, "end": 7674.42, "text": "und die reservierung umzieht und am ende haben sogar noch gesagt die reservierung braucht man"}, {"id": 1387, "start": 7674.42, "end": 7680.22, "text": "gar nicht einfach einfach alle dns ranges so und da habe ich so ein mini python script gebastelt"}, {"id": 1388, "start": 7680.22, "end": 7687.34, "text": "keine ahnung 30 zeilen oder so was des den windows dhcp export um konvertiert hat in"}, {"id": 1389, "start": 7687.34, "end": 7693.46, "text": "dhcp linux dhcp server konfig und ich muss sagen das war echt angenehm das in peißen zu"}, {"id": 1390, "start": 7693.46, "end": 7698.98, "text": "machen weil die haben alles mögliche dabei die haben sogar einen ip calculator dabei also kannst"}, {"id": 1391, "start": 7698.98, "end": 7706.42, "text": "sogar du kannst die haben in der standard library den ip calculator bei wo du quasi"}, {"id": 1392, "start": 7706.42, "end": 7712.42, "text": "p-adressen sachen dazu rechnen kannst ihn abziehen kannst weil bei der gelegenheit ist mir natürlich"}, {"id": 1393, "start": 7712.42, "end": 7719.22, "text": "aufgefallen weil sonst guckt da keiner drauf dass die ranges im windows dhcp falsch angelegt"}, {"id": 1394, "start": 7719.22, "end": 7723.86, "text": "waren die haben die ranges inklusive gateway angelegt normalerweise müssen so eine range"}, {"id": 1395, "start": 7723.86, "end": 7730.22, "text": "anlesen anlegen nach dem gateway dass das funktioniert liegt einfach daran dass der"}, {"id": 1396, "start": 7730.22, "end": 7737.98, "text": "dns vorher checkt ob die ip doppelt vergeben ist aber ich wollte keine konfig bauen die quasi"}, {"id": 1397, "start": 7737.98, "end": 7744.54, "text": "in sich schon falsch ist so und deswegen habe ich einfach die range genommen das netz angegeben"}, {"id": 1398, "start": 7744.54, "end": 7750.86, "text": "und mit diesem eingebauten ip modul die ip 1 hochgezählt weil ich wusste ok range start"}, {"id": 1399, "start": 7750.86, "end": 7755.78, "text": "ist immer der gateway und range start plus eins ist die erste dhcp range und das war"}, {"id": 1400, "start": 7755.78, "end": 7760.26, "text": "halt echt praktisch meine haben ein ip address calculator eingebaut die haben einen csv reader"}, {"id": 1401, "start": 7760.26, "end": 7766.66, "text": "eingebaut der windows export war übrigens csv weil ich weiß nicht was im jahr 2020 alle noch mit"}, {"id": 1402, "start": 7766.66, "end": 7774.78, "text": "csv haben gut ich meine es könnte noch schlimmer kommen es könnte auch xml sein aber mal ganz"}, {"id": 1403, "start": 7774.78, "end": 7789.46, "text": "ehrlich csv ist schon ist schon es dicht gefolgt auf xml also wer hat kein csv reader also mir"}, {"id": 1404, "start": 7789.46, "end": 7794.26, "text": "fallen jetzt wenige atmosphere fällt jetzt aus spontan keine programmier sprache ein die in"}, {"id": 1405, "start": 7794.26, "end": 7799.66, "text": "der die in ihrer standard library einen csv reader dabei hat dort net hat kein csv dabei ruby hat"}, {"id": 1406, "start": 7799.66, "end": 7806.02, "text": "standardmäßig glaube kein csv dabei go hat standardmäßig kein csv dabei sehr gut zählen"}, {"id": 1407, "start": 7806.02, "end": 7810.78, "text": "von 10 plus reden wir schon mal gar nicht hat stande mich kein kein dabei so sachen wie bash"}, {"id": 1408, "start": 7810.78, "end": 7819.1, "text": "natürlich ähnlich note also ja was gibt auch nicht also mir fällt außer heißt keine sprache"}, {"id": 1409, "start": 7819.1, "end": 7825.5, "text": "ein die standardmäßig einen csv reader dabei hat bei ruby bin ich mir nicht sicher"}, {"id": 1410, "start": 7825.5, "end": 7843.66, "text": "ok ruby hat ein dabei ok ruby hatten ein csv reader dabei alles klar"}, {"id": 1411, "start": 7855.62, "end": 7861.42, "text": "was go hat echt ein nades glaube ich nicht go hat auch standardmäßig kein csv reader dabei"}, {"id": 1412, "start": 7861.42, "end": 7869.5, "text": "ernsthaft wirklich"}, {"id": 1413, "start": 7874.62, "end": 7879.3, "text": "ne package ist das jetzt das ist auch so ein ding was mich an den go documents"}, {"id": 1414, "start": 7879.3, "end": 7890.06, "text": "nervt ist das jetzt standard library oder ist es irgendwas custom das ist nicht schlecht"}, {"id": 1415, "start": 7890.06, "end": 7900.5, "text": "na gut dort net hat zumindest keinen das weiß ich da musste ich mit irgendwelchen komischen"}, {"id": 1416, "start": 7900.5, "end": 7914.3, "text": "dingern rumschlagen die nicht gut funktionieren so note also note hat höchstwahrscheinlich auch"}, {"id": 1417, "start": 7914.3, "end": 7925.1, "text": "kein weil note standardmäßig sehr wenig dabei hat ja auch kein ja gut ist jetzt auch egal zumindest"}, {"id": 1418, "start": 7925.1, "end": 7931.38, "text": "ich fand es gut dass die sowohl in alpea trust calculator dabei haben als auch in den csv"}, {"id": 1419, "start": 7931.38, "end": 7939.5, "text": "reader das war wirklich praktisch kannst du dir im stream mal alternative datenbank system"}, {"id": 1420, "start": 7939.5, "end": 7943.86, "text": "anschauen ja aber ich weiß ich ob also ja ich wollte mir immer ein bisschen mehr sachen angucken"}, {"id": 1421, "start": 7943.86, "end": 7950.3, "text": "datenbank technische nächsterzeit aber ich weiß nicht ob das so interessant ist im stream weil"}, {"id": 1422, "start": 7950.3, "end": 7955.18, "text": "ich muss dir ehrlich sagen ich bin schon so ein bisschen datenbank noch auch teilweise was das"}, {"id": 1423, "start": 7955.18, "end": 7969.7, "text": "angeht weil ich verwende zu 95 prozent sq light so und ab und zu mal so was wie reddis das war es"}, {"id": 1424, "start": 7969.7, "end": 7980.34, "text": "also ich glaube ich habe ich überleg gerade habe ich schon mal für mein zeug was anderes verwendet"}, {"id": 1425, "start": 7980.34, "end": 7986.58, "text": "also wenn ich eine richtige datenbank bräuchte will ich postkurs verwenden aber"}, {"id": 1426, "start": 7986.58, "end": 8005.18, "text": "also ich habe gut ich meine du kannst ja mehr oder weniger das sql von sq lite auf postkurs"}, {"id": 1427, "start": 8005.18, "end": 8011.7, "text": "das kannst ja kannst ja verwenden aber ich glaube ich habe für mein zeug noch nie was"}, {"id": 1428, "start": 8011.7, "end": 8020.3, "text": "anderes außer reddis und also reddis und und sq lite verwendet a craft ql craft ql habe ich"}, {"id": 1429, "start": 8020.3, "end": 8025.26, "text": "auch schon verwendet aber das ist das zählt ja nicht nicht so wirklich als daten das ist"}, {"id": 1430, "start": 8025.26, "end": 8030.54, "text": "eher so ein aufsatz oft doch doch ich habe schon mal postkurs mit craft ql verwendet korrekt"}, {"id": 1431, "start": 8030.54, "end": 8037.46, "text": "stimmt da gibt es nämlich ein plugin was die datenbank per craft ql zugreifbar macht das habe"}, {"id": 1432, "start": 8037.46, "end": 8045.06, "text": "ich für unser routing routing planungsding verwendet ja ja doch genau stimmt da habe"}, {"id": 1433, "start": 8045.06, "end": 8051.14, "text": "ich aber ich habe noch nie wirklich von meinem zeug was ich hier daheim zusammen gewusstet"}, {"id": 1434, "start": 8051.14, "end": 8058.34, "text": "habe zumindest noch nie richtig echte datenbank verwendet brauche ich auch meistens nicht bei"}, {"id": 1435, "start": 8058.34, "end": 8069.1, "text": "den eins zwei drei maximal fünf usern oder so aber aber craft ql ist wirklich sehr nice so"}, {"id": 1436, "start": 8069.1, "end": 8073.22, "text": "ein alex drei monate exquisite subscription dankeschön huge"}, {"id": 1437, "start": 8073.22, "end": 8093.22, "text": "ja go finde ich tatsächlich nicht schlecht also ich finde ein paar sachen fragwürdig ja also"}, {"id": 1438, "start": 8093.22, "end": 8100.3, "text": "aber nicht so fragwürdig dass ich ich habe mir noch keine datei angelegt warum go sagt ich"}, {"id": 1439, "start": 8100.3, "end": 8105.1, "text": "habe für ein paar programmier sprache in allem voran c++ eine extra text datei wo ich mich immer"}, {"id": 1440, "start": 8105.1, "end": 8110.14, "text": "wo ich immer sachen die mir auf den sack gehen reinschreibe für den fall der fälle dass mich"}, {"id": 1441, "start": 8110.14, "end": 8115.38, "text": "irgendwann mal jemand fragt max warum findest du c++ immer so kacke so und go hat es bisher noch"}, {"id": 1442, "start": 8115.38, "end": 8119.58, "text": "nicht geschafft dass ich mir so eine datei angelegt habe das heißt ich kann gar nicht so"}, {"id": 1443, "start": 8119.58, "end": 8124.66, "text": "schlecht finden was ich in go gemacht habe bisher ich habe in go eigentlich nur eine sache bisher"}, {"id": 1444, "start": 8124.66, "end": 8140.3, "text": "gemacht das ist ein web cam überwachungskamera schrägstich web cam übersichtswebsite und der"}, {"id": 1445, "start": 8140.3, "end": 8147.3, "text": "teil was diese videos macht ist in go weil es die einzig sinnvolle library dafür in go gibt"}, {"id": 1446, "start": 8147.3, "end": 8153.1, "text": "deswegen habe ich damals mit go angefangen und die erste variante war eine mischung aus c und go"}, {"id": 1447, "start": 8153.1, "end": 8159.54, "text": "c weil ffmpeg und die ffmpeg bindings für go hardcore gesackt haben als ich es ausprobiert"}, {"id": 1448, "start": 8159.54, "end": 8164.98, "text": "habe so die ffmpeg variante war in c und übrigens das ist auch eine doch das ist auch ein punkt"}, {"id": 1449, "start": 8164.98, "end": 8170.74, "text": "der mich an go stört dass der interop mit c komplizierter ist als er sein müsste und auch"}, {"id": 1450, "start": 8170.74, "end": 8175.1, "text": "performance mäßig viel mehr performance braucht als es eigentlich sein müsste das war eine sache"}, {"id": 1451, "start": 8175.1, "end": 8180.46, "text": "die mich an go gestört hat also c interop war nicht schön die go philosophie ist schreibt"}, {"id": 1452, "start": 8180.46, "end": 8185.98, "text": "einfach alles in go das ohne miss das ist die offizielle go philosophie interop mit anderen"}, {"id": 1453, "start": 8185.98, "end": 8191.14, "text": "sprachen warum brauchen wir nicht einfach alles in go neu programmieren das das sagen die go"}, {"id": 1454, "start": 8191.14, "end": 8195.86, "text": "leute das ist natürlich massive big brain weil einfach mal jeder der ein bisschen video braucht"}, {"id": 1455, "start": 8195.86, "end": 8203.82, "text": "jetzt mal kurz ffmpeg neu programmiert ist klar ja allerdings man muss sagen go programmierer"}, {"id": 1456, "start": 8203.82, "end": 8209.82, "text": "sind immer besonders stolz darauf wenn ihre sachen in go programmiert sind es gibt so"}, {"id": 1457, "start": 8209.82, "end": 8214.22, "text": "viel software ihr müsst mal gucken auf auf self-hosted wo das angekündigt wird oder auch"}, {"id": 1458, "start": 8214.22, "end": 8222.82, "text": "auf auf auf github die einfach nur gemacht wird damit man dran schreiben kann written in go so"}, {"id": 1459, "start": 8222.82, "end": 8229.38, "text": "irgendwie dass das 150 programm was das gleiche macht wie alle 149 anderen programme auch aber"}, {"id": 1460, "start": 8229.38, "end": 8237.1, "text": "written in go dann ist das natürlich gleich viel besser nur weil das written in go ist bei"}, {"id": 1461, "start": 8237.1, "end": 8241.74, "text": "rust ist es übrigens genauso es gibt auch viele sachen die neu implementiert werden einfach weil"}, {"id": 1462, "start": 8241.74, "end": 8254.38, "text": "es geht und dann steht da written in rust von 10 minus minus gehört nein aber von holy see habe"}, {"id": 1463, "start": 8254.38, "end": 8260.98, "text": "ich schon mal was gehört ich weiß dass ich mir die viennese unleashed angucken wollte es gucken"}, {"id": 1464, "start": 8260.98, "end": 8274.14, "text": "uns klar hab ich das irgendwie wieder zugemacht ja und eine sache die mir auch noch in go auf"}, {"id": 1465, "start": 8274.14, "end": 8283.82, "text": "dem keks ging gucken wir uns gleich an ich bin ja bin ja echt mal gespannt drauf ich muss aber"}, {"id": 1466, "start": 8283.82, "end": 8288.98, "text": "das erst noch fertig fertig erzählen wo bin stehen geblieben genau eine sache die mir auch"}, {"id": 1467, "start": 8288.98, "end": 8297.18, "text": "noch in go ein bisschen auf dem keks geht ist dass die in manchen sachen unnötig minimalistisch"}, {"id": 1468, "start": 8297.18, "end": 8306.98, "text": "sind zum beispiel dass man sagt nein erase filtern mit irgendwelchen lambdas oder so ist böse mache"}, {"id": 1469, "start": 8306.98, "end": 8315.38, "text": "eine schleife natürlich kann ich eine schleife machen aber ich meine was ist was ist schöner"}, {"id": 1470, "start": 8315.38, "end": 8322.02, "text": "und angenehmer also wahrgenommen ich habe hier irgendwie den array 1 2 3 4 ist es erstmal vollkommen"}, {"id": 1471, "start": 8322.02, "end": 8331.34, "text": "egal was ist schöner ich kann sowas hier machen keine ahnung x größer 2 also was ist besser ich"}, {"id": 1472, "start": 8331.34, "end": 8341.46, "text": "kann sowas hier machen oder ich muss vor keine ahnung vor i in a i größer 2 dann oder sowas"}, {"id": 1473, "start": 8341.46, "end": 8349.62, "text": "machen was ist besser also mir gefällt das besser go sagt das ist besser die sind da manche ich"}, {"id": 1474, "start": 8349.62, "end": 8354.58, "text": "finde an manchen stellen sind bissel bissel zu minimalistisch obwohl sie eigentlich sich"}, {"id": 1475, "start": 8354.58, "end": 8363.42, "text": "das gar nicht auf die fahne geschrieben haben irgendwie super minimalistisch zu machen die"}, {"id": 1476, "start": 8363.42, "end": 8368.22, "text": "frage was ist performanter ganz ehrlich wenn das ordentlich gemacht ist braucht wahrscheinlich"}, {"id": 1477, "start": 8368.22, "end": 8380.7, "text": "beides genau das gleiche und selbst wenn das hier oder das hier ein paar tix schneller sind geht mir"}, {"id": 1478, "start": 8380.7, "end": 8388.98, "text": "das sonst wo vorbei weil die sache ist ja die schleife hat die sprache so und wenn man sowas"}, {"id": 1479, "start": 8388.98, "end": 8398.9, "text": "hier noch einbauen würde und das sollte wirklich irgendwie nanosekunden langsamer sein da kann ich"}, {"id": 1480, "start": 8398.9, "end": 8403.46, "text": "immer noch eine schleife schleife machen ja aber man kann es man kann es ja den programmierer"}, {"id": 1481, "start": 8403.46, "end": 8406.92, "text": "zumindest ein bisschen einfacher machen das war auch eine sache die mir an go auf den keks"}, {"id": 1482, "start": 8406.92, "end": 8412.82, "text": "gegangen ist ja und dass sie halt überhaupt keine generics wollten weil dieses dieses map"}, {"id": 1483, "start": 8412.82, "end": 8423.58, "text": "map konzept und sowas das ist in go irgendwie wirkt irgendwie auf aufgestülpt also aber es"}, {"id": 1484, "start": 8423.58, "end": 8430.58, "text": "kommt jetzt ja angeblich angeblich gibt es jetzt demnächst generics in go habe ich gelesen"}, {"id": 1485, "start": 8430.58, "end": 8443.5, "text": "weiß ich ob es es mittlerweile schon gibt gibt es ist das jetzt schon ist es jetzt schon live"}, {"id": 1486, "start": 8443.5, "end": 8452.94, "text": "oder ist das weißt du das jemand ist das schon draus oder kommt das irgendwie vor"}, {"id": 1487, "start": 8452.94, "end": 8461.82, "text": "future irgendwann future versions ach ja und was mich auch noch genervt hat in go jetzt wo ich"}, {"id": 1488, "start": 8461.82, "end": 8468.62, "text": "sie gerade wieder sehe sind teilweise sündags schichten zum beispiel dass es es gibt irgendwie"}, {"id": 1489, "start": 8468.62, "end": 8475.02, "text": "vier varianten oder so eine variable anzulegen teilweise exakt identisch und teilweise auch"}, {"id": 1490, "start": 8475.02, "end": 8480.42, "text": "feinheiten die sich unterscheiden ich weiß es sind c++ teilweise noch schlimmer aber c++ ist ja"}, {"id": 1491, "start": 8480.42, "end": 8498.38, "text": "auch keine messlatte ja gut so also so viel so viel dazu ja meine lieblingssprache bleibt so"}, {"id": 1492, "start": 8498.38, "end": 8505.26, "text": "und so sie scharf da kann man nichts machen also ich habe jetzt mittlerweile schon einige"}, {"id": 1493, "start": 8505.26, "end": 8512.26, "text": "sprachen ausprobiert und auch schon kleinere größere dinge drin gemacht aber wenn ich die"}, {"id": 1494, "start": 8512.26, "end": 8520.5, "text": "wenn ich die auswahl habe und es möglich ist was in dort net beziehungsweise sie scharf zu"}, {"id": 1495, "start": 8520.5, "end": 8524.22, "text": "machen da mache ich es immer in sie scharf aber wofür willst du generics wenn du compositions"}, {"id": 1496, "start": 8524.22, "end": 8529.9, "text": "hast zum beispiel dass man eine eigene dictionary implementierung programmieren kann eine ordentliche"}, {"id": 1497, "start": 8529.9, "end": 8542.66, "text": "type safe das geht ja so nicht wenn man sich wenn man sich die sachen anguckt die es gibt auf"}, {"id": 1498, "start": 8542.66, "end": 8549.74, "text": "github zusätzliche map und dictionary implementierung die sind alle nur sehr halbherzig weil es halt"}, {"id": 1499, "start": 8549.74, "end": 8558.94, "text": "keine generics gibt das ist der vorteil wenn man hauptsächlich von c++ kommt ja da schockt"}, {"id": 1500, "start": 8558.94, "end": 8563.94, "text": "ein nichts mehr das ist richtig so gucken wir uns mal die vernies unleashed ankündigung an mal"}, {"id": 1501, "start": 8563.94, "end": 8573.3, "text": "gucken was sie vor haben mit battlefield 3 es wäre ja mega poggers wenn battlefield 3 wieder"}, {"id": 1502, "start": 8573.3, "end": 8580.94, "text": "ordentlich spielbar wäre mit neuen surfern und allem aus die verwendest bettel sind battlefield"}, {"id": 1503, "start": 8580.94, "end": 8588.9, "text": "dem dings abmahnung von da ist es raus ich sag euch wie es ist wenn das eine einzunehmende"}, {"id": 1504, "start": 8588.9, "end": 8600.34, "text": "konkurrenz wird strikt da ist die in grün und boden das ist eine neue map ist das ist das"}, {"id": 1505, "start": 8600.34, "end": 8611.78, "text": "eine neue map oder ist es taller market das ist das sieht aus dass es das zwei das war das ich"}, {"id": 1506, "start": 8611.78, "end": 8616.3, "text": "wollte gerade sagen kommt mir irgendwie bekannt vor ok man kann es das zwei in battlefield spielen"}, {"id": 1507, "start": 8616.3, "end": 8623.7, "text": "exquisite da läuft gerade ein live stream ok"}, {"id": 1508, "start": 8623.7, "end": 8632.46, "text": "orffatz ok scheine nicht so viele zu interessieren"}, {"id": 1509, "start": 8632.46, "end": 8634.42, "text": "wow"}, {"id": 1510, "start": 8634.42, "end": 8644.38, "text": "ach sind das developer tools von denen oder so was ja die haben eine neue map die haben"}, {"id": 1511, "start": 8644.38, "end": 8653.58, "text": "eine map editor guck mal die haben im battlefield 3 map editor gebastelt das ist schon nice oder"}, {"id": 1512, "start": 8653.58, "end": 8663.74, "text": "ist das ne das ist das ist immer noch das zwei hier mit den thorn und so zwischendurch würde"}, {"id": 1513, "start": 8663.74, "end": 8668.74, "text": "ich mal sagen also die thore sehen halt ultra das zwei mäßig aus die haben map editor in"}, {"id": 1514, "start": 8668.74, "end": 8678.42, "text": "battlefield 2 gebastelt der battlefield 3 das ist doch richtig gut das ist doch mega nice"}, {"id": 1515, "start": 8678.42, "end": 8691.34, "text": "ich meine ich will vielleicht in dem reveal treel stream was anderes zeigen weil das jetzt die"}, {"id": 1516, "start": 8691.34, "end": 8703.18, "text": "meisten heute nicht sonderlich interessiert aber das ist doch sehr nice da bin ich mal"}, {"id": 1517, "start": 8703.18, "end": 8707.58, "text": "echt gespannt drauf ok kommen wir uns mal den reveal den ankündigungs trelle an"}, {"id": 1518, "start": 8707.58, "end": 8724.74, "text": "sie haben das die haben sie haben in battlefield 7 gebastelt was ich nach was anhört nicht"}, {"id": 1519, "start": 8724.74, "end": 8742.42, "text": "dieses battlefield in battlefield 3 erinnert euch vielleicht noch was ist das zombie modus"}, {"id": 1520, "start": 8742.42, "end": 8759.26, "text": "oder wie oh habt ihr es gesehen das war das war ein neues squadmenü das ist ein 8er squad"}, {"id": 1521, "start": 8759.26, "end": 8767.02, "text": "10er squads oder ist es ein caster das könnte das ist in den caster übersicht oder sowas"}, {"id": 1522, "start": 8767.02, "end": 8774.7, "text": "was schaut ihr euch dann das ist der ankündigungs trailer zu venice unleashed das sind irgendwelche"}, {"id": 1523, "start": 8774.7, "end": 8779.98, "text": "leute die seit 2013 schon ich habe da schon vor ewigkeiten das projekt reingeguckt battlefield"}, {"id": 1524, "start": 8779.98, "end": 8804.18, "text": "3 wieder spielbar machen wollen ok so allzu viel hat man das nicht gesehen die hätten"}, {"id": 1525, "start": 8804.18, "end": 8810.22, "text": "sich irgendeinen dubstep trailer man von youtube suchen sollen die das für sie macht december"}, {"id": 1526, "start": 8810.22, "end": 8819.26, "text": "2020 exzellent es gibt ein ähnliches projekt für battlefield 4 ich habe aber vergessen"}, {"id": 1527, "start": 8819.26, "end": 8835.9, "text": "wie es heißt es gibt ein ähnliches projekt wie release unleashed was revamped ne oder"}, {"id": 1528, "start": 8835.9, "end": 8844.7, "text": "für battlefield 4 da weiß ich aber hier das da das da das da aber das ist glaube ich"}, {"id": 1529, "start": 8844.7, "end": 8852.34, "text": "das ist da er hat sich glaube ich noch gar nichts getan ich glaube da hat sich noch"}, {"id": 1530, "start": 8852.34, "end": 8879.98, "text": "gar nichts getan was play.com war das ja mal gespannt auf december 2020 endlich mal wieder"}, {"id": 1531, "start": 8879.98, "end": 8892.94, "text": "ordentliches battlefield spielen ich hoffe ja das taugt was und das schlägt ein bisschen"}, {"id": 1532, "start": 8892.94, "end": 8899.22, "text": "ein weil ansonsten geht es halt unter modding stream wann ich glaube daran beteilige ich"}, {"id": 1533, "start": 8899.22, "end": 8912.66, "text": "mir nicht wie moddet man das denn weder noch die haben glaube ich eigene level editor"}, {"id": 1534, "start": 8912.66, "end": 8918.82, "text": "und sowas gebaut deswegen hat es wahrscheinlich auch sieben jahre gedauert weil die viele"}, {"id": 1535, "start": 8918.82, "end": 8932.34, "text": "sachen selbst programmiert haben ja battlefield 5 ist zu unbeliebt dass das jemand macht vor"}, {"id": 1536, "start": 8932.34, "end": 8946.18, "text": "allem hätte da ist das mal gefälligst selbst machen sollen ja wir haben eine chance auf"}, {"id": 1537, "start": 8946.18, "end": 8951.94, "text": "ein gutes bf es wäre ja so geil wenn wenn das wirklich einschlägt also wenn das was"}, {"id": 1538, "start": 8951.94, "end": 8955.66, "text": "taugt den werde ich auf jeden fall auch dazu ein video machen einfach um die sachen bisschen"}, {"id": 1539, "start": 8955.66, "end": 8962.3, "text": "zu supporten es wäre schon cool es wäre nicht das erste spiel was quasi vom mod zum hit"}, {"id": 1540, "start": 8962.3, "end": 8967.74, "text": "wird irgendwie weil cs ist das bekannteste schlechthin wobei man halt sagen muss so ein"}, {"id": 1541, "start": 8967.74, "end": 8973.1, "text": "richtiger mod es ist ein mod aber es ist ja quasi also cs war halt ein half life mod"}, {"id": 1542, "start": 8973.1, "end": 8977.18, "text": "der was komplett anderes aus dem half life multiplayer gemacht hat aber venice unleashed"}, {"id": 1543, "start": 8977.18, "end": 8984.9, "text": "ist ja quasi battlefield 3 einfach nur in widerspielbar mit ein paar sachen dabei dota"}, {"id": 1544, "start": 8984.9, "end": 8992.62, "text": "genau gibt gibt ja gibt einige sachen und aber dota war auch hat mit dem warcraft 3"}, {"id": 1545, "start": 8992.62, "end": 8998.58, "text": "multiplayer was anderes gemacht als der warcraft 3 multiplayer war also es wäre nicht das erste"}, {"id": 1546, "start": 8998.58, "end": 9002.98, "text": "mal dass ein mod richtig einschlägt es wäre auf jeden fall ihn zu gönnen und es wäre"}, {"id": 1547, "start": 9002.98, "end": 9006.98, "text": "auf jeden fall geil wieder ein ordentliches battlefield zu spielen mit ordentlich vielen"}, {"id": 1548, "start": 9006.98, "end": 9010.78, "text": "spieler und allen dabei und wie gesagt wenn ich das erste mal dass ein mod groß groß"}, {"id": 1549, "start": 9010.78, "end": 9024.34, "text": "rauskommt ich hoffe dass das was wird aber ich ich wette mit euch wenn das groß wird"}, {"id": 1550, "start": 9024.34, "end": 9035.54, "text": "strike battlefield strike da ist beziehungsweise den laden in grund und boden also sollten"}, {"id": 1551, "start": 9035.54, "end": 9042.54, "text": "die wirklich also bei 5 600 spieler das juckt kein mensch ja ich rede auch nicht parallel"}, {"id": 1552, "start": 9042.54, "end": 9051.7, "text": "500 600 spieler 500 600 spieler parallel ist schon wieder was anderes wenn die mal angenommen"}, {"id": 1553, "start": 9051.7, "end": 9055.02, "text": "sollte man sollten die mal wirklich irgendwie sagen okay alter wir haben 10.000 spieler"}, {"id": 1554, "start": 9055.02, "end": 9061.74, "text": "oder sowas die die werden in grund und boden gestrickt das ist ja das wo sich nintendo"}, {"id": 1555, "start": 9061.74, "end": 9067.58, "text": "auch in letzter zeit so wahnsinnig beliebt macht das ist halt kacke also daran sieht"}, {"id": 1556, "start": 9067.58, "end": 9072.14, "text": "man ja auch wieder dass ihnen die community egal ist auch wenn sie das immer wieder sagen"}, {"id": 1557, "start": 9072.14, "end": 9075.74, "text": "die kommune die mögen also die community ist ihnen so lang nicht egal so lange die community"}, {"id": 1558, "start": 9075.74, "end": 9079.62, "text": "noch ihnen ordentlich geld gibt sollte das aber in irgendeiner art und weise sich als"}, {"id": 1559, "start": 9079.62, "end": 9084.34, "text": "konkurrenz erweisen zu zu battlefield was ihr geld bringt sind die schneller weg vom"}, {"id": 1560, "start": 9084.34, "end": 9090.34, "text": "fenster als die ihren webserver nach auf die bahamas umziehen können"}, {"id": 1561, "start": 9090.34, "end": 9111.34, "text": "nun gut chat das ging heute besser als gedacht also dass taugt gefällt mir welche in zukunft"}, {"id": 1562, "start": 9111.34, "end": 9120.02, "text": "verwenden wenn es an liest weiß ich nicht ob es taugt ob ich in zukunft verwenden werde"}, {"id": 1563, "start": 9120.02, "end": 9129.38, "text": "ich hoffe mal und jetzt sehe ich es 21.40 ich mache jetzt"}, {"id": 1564, "start": 9129.38, "end": 9134.42, "text": "ein stream aus wir sehen uns die tage ich gehe jetzt wahrscheinlich zähle putze dann"}, {"id": 1565, "start": 9134.42, "end": 9140.5, "text": "gehe ich ins bett irgendwie eine halbe stunde oder so also wir sehen uns leute bis denn macht"}, {"id": 1566, "start": 9140.5, "end": 9157.94, "text": "es gut bis zu den nächsten tage zu"}]}