{"text": "So, exellent war das! Massive! Huge! Ähm... Ah, so viele leute schon am da! Wer ist denn hier am da? Wer ist am start? Der Kengin ist da, der Real Renax ist da, Serious Max ist am start Skillkiller1337 xDxDxDxDxDxD xDxDxDxDxDxD Exact, so sieht es aus! Ähm, ich muss mal kurz mein Headset noch mal schnell einführen. So, soll ich euch mal was erzählen? Ich muss jetzt noch genau morgen und übermorgen arbeiten, dann hab ich das restliche Jahr über frei. Pog, oder? Findet ihr den nicht auch? Das ist richtig Pog. Wie gesagt, das ist der französische Poggers. Da reicht der normale immer für. Ganzes Jahr keinen Urlaub gemacht, doch zwei Tage oder so. Nee, nee, nee, nee, das hast du nicht verhört, das ist das restliche Jahr. Oh, ich soll vielleicht das Afklo wegmachen. Weil ich bin ja gar nicht mal Afklo. So sieht's aus. Schauen wir mal eine V-M kurz an. Ich weiß noch nicht so genau, was wir heute machen. Sollen wir mal schauen. Es hatte im Discord einer eine gute Idee. Ich soll mal hier ein bisschen rumgucken, um einen Senf zu ablassen. Senf zu ablassen mach ich natürlich immer gerne. Das sind wohl irgendwelche Umfragen zu, frag mich nicht, Zeug. Oder kann ich mal meinen Senf, oh, oh, wenn ich das schon sehe. What are the best text editors? Oh je, das wird, das weiß ich nicht, ob ich mich dazu jetzt auslassen soll. Das wird wieder, ich hoffe da ist keine Frage, was ist die beste Programmiersprache. Und ich hoffe, wenn es die Frage gibt, oh fuck, die gibt's. Okay, ist kein C++ dabei. Sonst, sonst hätte ich jetzt anfangen müssen, Leute. Wenn da C++ dabei gestanden hätte, wäre vorbei gewesen. Okay, ja, da kann ich wirklich meinen Senf gleich zu haben. Was ist Löwe? Und warum ist da nicht Unity vorne? Wenn es der verbreitet... Okay, also was weiß ich C++ programmieren kann für mich schon mal nicht vorne sein. Okay, gut. Also, was wollte ich jetzt sagen? Genau, ich mach mal kurz meine V-M an. Übrigens, ich hab mir mal wieder was zum Flaschen gekauft. Wo wir gerade dabei sind. Jeden Tag aufsteh streamen bis zum Neujahr. Naja, ich hab ja eigentlich gesagt, ich mach im Dezember wieder ein paar Videos. Und wenn ich jetzt jeden Tag aufwach streamen mach, dann kann ich ja keine Videos machen. Das geht gar nicht so einfach. Ich mein, der Tag hat auch nur 24 Stunden. Was ich im Urlaub machen werde, also was ich mir vorgenommen hab. Eine Sache ist, also ich mach erstmal Videos. Ich mach wieder Videos, wir machen mehr Streams. Und ich werde mich diesmal wirklich zusammenreißen. Weil ja auch im Stream schon ein paar gesagt haben, sie wollen das mal ausprobieren. Und sie finden das ist eine richtig gute Idee, sowas zu programmieren. Ich werde mich diesmal zusammenreißen und den Scheiß nicht wieder nach zwei Wochen einstellen. Und zwar, ich werde das so weit wie es geht fertig basteln. Wenn ich weiß, was es ist, kann ich es gleich nochmal zeigen. Das ist ein Programm, das Webcams in den Browser streamt. Normaler RTSP Webcams, Securitycams in den Browser streamt. Man die Streams aufnehmen kann und die Object Detection macht, dass man sieht. Kann ich euch gleich mal zeigen. Ich hab nämlich vorhin was gepusht, wie ihr seht hier. Guck, vor 15 Minuten hab ich was gepusht. Genau und was ich euch, also ich finde das ist ein äußerst Aussagekräfte. Also besser als Monarch S kann man das. Da mach ich mir übrigens, für Monarch S hab ich schon eine super Idee für ein Logo. Für dieses Programm. Also wir nehmen einfach Monarch S. Hallo? Wir nehmen einfach das hier. Wir nehmen einfach das hier. Und machen da eine Kamera drum. Es gibt sicher ein Free Stock Photo Camera. Und das wird ein richtig megaschlechtes Projektbild. So was und dann kommt da ein Monarch S vorne rein oder so. So irgendwas in der Richtung. Transparent. So was hier, genau. Guckt hier. Das machen wir jetzt mal mit meinen krassen Grafik Skills. In, ne, äh, äh, Foto. Ne Design, Design. Das machen wir mit meinen krassen Grafik Skills auf. Also ich kann mir tatsächlich vorstellen, dass das Programm, wenn ich da, wenn ich mich wirklich mal dran seh, das ist was für mich. Das Programm, wenn ich da, wenn ich mich wirklich mal dran seh, das ist was, was viele brauchen. Es gibt, es gibt kaum gescheite, äh, Überwachungs, also Software für Überwachungskameras im privaten Bereich. Die auf dem Raspberry Pi Performance läuft und ein paar advanced Features hat. Gibt's kaum. So, jetzt mach ich euch, pass mal auf, ich mach jetzt mal ein super, super krasse, ähm, Copy Image. Bam. Ihh. Warum, warum kopiert der, der F-Image. Ja, genau. Jetzt machen wir mal Projekt, jetzt machen wir mal Projektbild, ganz, ganz, nicht Camera. Hä? Cam? Hab ich, hä? Hä? Windows, wo ist es? Muss ich da jetzt erst F5 drücken, oder was? Da ist es. Alter, ist das hängen geblieben, ähm. Windows Logik. So, so machen wir da jetzt. Das da. Und jetzt brauchen wir noch nen Monarch S Transparent. Und dann ist das Logo exzellent fertig. Oh, hier, den da. Am besten auch noch schön skalieren. Oh, den hab ich da schon. Sogar ein PNG, was haben wir denn hier? Guck mal, da ist er noch. So. Ist das nicht ein exzellentes Logo? Wir können den jetzt auch ein bisschen croppen oder so. So, und das jetzt als Icon machen. Oh, fuck. Äh. Das ist doch das beste Projektlogo aller Zeiten, oder? Ist das schlecht, Alter? Exzellent. Okay, wir können das noch. Ich, ich hab schon ewig, ich, man merkt, dass ich keine Thumbnails mehr gemacht hab. Ich hab vergessen, wie es geht. Moment, wie, wie, wie? Moment, wie, wie beschneide ich den Kram denn jetzt noch mal hier? Äh, ich hab's, ich hab's komplett vergessen, wie es geht. Nee. Und wie ging das jetzt noch mal? Ah. Siehst du mal, Qualität, Alter. Ist das nicht geil? Das ist doch mal das beste Projekt. Normalerweise wollte ich das hier neben noch abschneiden, aber ich bin gerade zu dumm, den Knopf dafür zu finden. War das nicht das Corner Tool? Ob das war das Corner Tool? Das Tool links in der Mitte, grau mit dem Strich durch. Du meinst das da, ne? Ja, aber, ach nee, Moment, da muss ich das vorher umwandeln oder so, gell? Äh, irgendwie so muss man das, glaub ich, machen. Jetzt kann man Corner Tool, ah. Exzellent. Ist das kein, ist das kein Poggers Bild? Hier, guckt euch das mal an. Also wenn das nicht, Leute, das beste Logo auf, oh fuck, das beste Logo auf ganz GitHub ist, dann weiß ich auch nicht. So. Save As. Nee, Moment, wie ging das jetzt noch mal? Save As. Export. Export, Foto, PNG. Äh, Selected. Logo. Monarch S. Logo. Windows. System 32. Warum ist da die Vorfahrt? Windows System 32. Verändere die Transparente, damit es so aussieht, ob es sich gespiegelt. Ich bin nicht zu dumm für. Ich bin bildbearbeitungsmäßig übelst schlecht. So. Ach Mist, ich bin ja in GitHub gar nicht eingeloggt. Zumindest hier, das ist doch. Das ist doch das beste Projekt Logo, was es überhaupt nur gibt. Und da jetzt noch irgendwie was drüber schreiben und gut ist. Oder bin ich vielleicht doch eingeloggt? GitHub. GitHub. Nein, bin ich nicht eingeloggt. Na gut. Ja. Hast du das Programm als Admin ausgeführt? Nö. Nein, habe ich nicht. Oh, das ist ganz wichtig. Das müssen wir speichern. Sehr gut. Sehr gut. Ja, was ich euch zeigen wollte. Ich habe wieder was zum Flaschen gekauft. Was war das hier? Das ist. Also wenn das so funktioniert, wie es da steht, dann ist das. Ihr wisst ja, dass ich ein paar Steckdosen leisten prinzipiell nicht wieder stehen kann. Und das ist diesmal sogar ein bisschen was advancedes. Erstens ist das ein doppelter Stecker, den man remote einem ausschalten kann und das trackt, was der Energieverbrauch ist. Das ist cool, das habe ich noch nicht. Die Sache ist nur die. Es ist ein bisschen unklar, ob man das Ganze flaschen kann. Angeblich geht das. Wenn jemand nach Tasmota sucht. Angeblich geht das. Aber manche sagen, dass das nicht mehr aktuell möglich ist. Ich meine, das sind jetzt Sachen vom Oktober. Aber ich habe jetzt hier schon Sachen gelesen, die sagen, es funktioniert nicht mehr. So, was ist das für ein Produkt eigentlich? Hier Gosund. Was Gosund? Das ist wieder so ein typischer China Ding. Hier SP211. Da kann man suchen. Tasmota. So immer das ist. Oh, das ist ja eine coole Seite, die kenne ich noch gar nicht. Was ist das? Startseite. Interessant, dass die das hier mal beschreiben. Oh, nee, ich will es doch nicht wieder löten müssen. Das ist immer ein Gefuddel. So ein das Gleiche. Wie hieß denn diese Seite, wo man dann diese ganzen Tasmota-Geräte drauf standen. Aufstanden Ich habe es für Tastmotor Das da das da genau Da ist er doch, der Goh so ein Plack Also Ja, Tuya Convert might not be possible for this device Wenn es die neueste Firmware gibt und angeblich laut Amazon ist da die neueste Firmware mittlerweile drauf Schauen wir mal wenn nicht muss ich den Kram. Wisst ihr was wir dann mal probieren Sollte das nicht gehen und man muss den Kram wirklich löten dann probieren wir mal das im Stream zusammen zu machen Weil ihr wisst ja ich habe jetzt hier oben so eine RGB Rgb dimmbare mit Farbe einstellbare RGB Lampe an der Decke da könnte ich theoretisch Theoretisch die Kamera irgendwie neben dran hängen Tisch hier hinstellen und wir könnten das zusammen mal probieren zu löten Im Stream und dann kann der Chat sagen Max du machst das ganz falsch so geht das nicht Lull wo hast du denn bitte löten gelernt alter hätte ich das so auf der Arbeit gemacht dann würde ich rausgeschmissen werden Lololol ich weiß jetzt schon wie die Leute dann wieder weil wenn man sowas im Stream macht Es wissen alle Backseat löten genau Backseat und wenn man sowas macht es wissen alle prinzipiell immer besser Ok also was muss man denn hier machen wenn man die löten will zeigt mal hier ist das überhaupt diese Steckdose die ich habe Sp Moment ne was was für eine habe ich sp 2 1 1 und das ist sp 1 1 2 Exzellente Produktnamen würde ich sagen Es gibt es gibt die sp 2 1 1 und die sp 1 1 2 so die sp 1 1 2 ist 1 Und die sp 2 1 ist die chinesen oh je jetzt habe ich wieder Jetzt habe ich wieder chinesen gesagt jetzt kommen sie oft wird er wieder an max du scheiß rassist das wusste ich unbedingt ein chinesen designed haben Richtig wie gesagt vielleicht war es auch Colombianer oder so aber von dem chinesischen hersteller von dem chinesen liegt das schon nahe irgendwie Warum kann man da auf x drücken seit wann kann man werbung zu ach das ist gar keine werbung Also was muss man machen um den kram von hand zu löten Schrauben in metallklammern lösen ja ok mit dünnem hebelwerkzeug Innerhalb der steckdose drei schrauben innerhalb der steckdose lösen ich habe löten gelesen Dann löten man die schrauben von metallklammern ok also zeige ich mal her Da ist ein loch was macht man damit Ach da ist eine schraube drinne Da ist wahrscheinlich eine schraube drinne muss man irgendwie raus machen Ich dachte dass man hier eigentlich immer diesen dritten stecker rein macht wenn man den hat So dann muss man hier die schrauben in der mitte raus machen und dann kommt man an die pins vom esp 2866 dran Das sieht easy aus im vergleich zu den restlichen steckdosen wie gesagt das letzte mal die letzten waren Die letzten waren richtig also massiv scheiße zu löten Hier die letzten waren echt massiv scheiße zu löten Da musste man also hier unten war kein problem aber da musste man hier dran das ist was weiß ich Keine ahnung ein zehntel vom millimeter oder irgendwie sowas das ist übelst klein und das habe ich nicht gebacken bekommen bis ich dann irgendwie schon Bis ich dann irgendwann mal auf die idee gekommen bin löte den kram einfach nicht dran sondern halt nur mit dem finger fest und das hat dann funktioniert Ich habe dann hier einfach nur hier unten dran gelötet und das oben habe ich mit dem finger fest gehalten und gut ist Und das ist das ist das hier luxus da ist das ja wirklich luxus hier da siehst ja alle pets und alle pins und so das hat überhaupt kein problem Und das ist das ist das hier luxus da ist das ja wirklich luxus hier da siehst ja alle pets und alle pins und so das hat überhaupt kein problem Äh ne seilgubas sowas ist die sache meistens ganz danach also ich habe ich glaube ich habe noch nix geschrottet bisher mit solchen aktionen Oder es war unwichtig habe es total vergessen schon wieder genau und dann wird das mit heißt okay das ist easy das mache ich dann wieder mit dem raspberry pi Nice was macht der hier noch hinten dran messwerte kalibrieren ach du scheiße Gut das ist kein problem wo wir gerade beim thema messwerte kalibrieren sind hat jemand ein gutes so so energy meter zum reinstecken was halbwegs was halbwegs taugt also ich hab Ich hab ich hab ich hab mir mal vor einer weile hier von eins gekauft elv energy master oder sowas das ist es teuer mittlerweile ich hab dafür 40 euro oder so bezahlt sind die noch ganz dicht Ist das so teuer geworden das hat bei mir 35 40 euro gekostet oder so what the hell Ach so hier kommen wir der sache schon näher master basic oder hier hab ich sowas also der ist eigentlich ganz gut gewesen hier erkennt da einer irgendwas ordentliches was aktuell noch hergestellt wird und vielleicht nicht ganz so teuer ist weil das ist immer nützlich wenn man sowas hier dann ausprobieren will ich trau mich da nicht dran mit meinem multimeter printstuhl Weichei weißt du besser weiches ei als f in chat oder wie der chemiker sagt abstand schützt wenn man nicht da ist wo was schlimmes passiert passiert einem auch nix Elv ja den hab ich schon den hab ich da hab ich einen von das hab ich eben grad eben grad gezeigt so ein ding hab ich mir mal gekauft von der weile und ich hätte jetzt gerne noch noch so eins zwei weil das eine steckt permanent hier neben an dieser kleinen mini surfer kiste dran und das will ich jetzt nicht ausschalten Hier noch ein low effort der ist geil das sind poggers das ist aus dem poggers logo ok chat was findet ihr besser dieses logo oder mein logo was ist besser der da oder der da der da oder der da Ich gebe zu uns ist beides extrem schlecht ja wisst ihr was warum wisst ihr warum der besser ist wisst ihr warum der besser ist weil der gewollt scheiße aussieht das sieht so aus als hat das jemand gemacht der es eigentlich besser könnte aber er hat es absichtlich schlecht gemacht So und mein sieht so aus als hätte es jemand gemacht der es nicht kann und versucht es zu können Deswegen der ist besser den speichere ich mir den nehmen aber ihr wisst wie das ist auch schlechte Sachen können dazu beitragen dass das Produkt bekannt wird und so richtig schlechte kennt jemand die Werbung von Seitenbacher Müsli das ist nur so bekannt geworden weil es einfach richtig schlecht ist Bergsteiger Müsli genau das nehmen wir das ist ein top top logo bin ich hier auf github eingeloggt oh ich bin auf github eingeloggt sehr gut Guck mal hier die repos werden gestarrt die repos werden gestarrt exzellent wir machen jetzt wir machen jetzt das logo rein wir machen jetzt das wichtigste wir machen das logo rein was ist ein tm tool ein tm tool das kann jetzt nicht sein das ist ein private repo closed Das ist das was ich mit meinem kollege zusammen programmiert habe für die Routenberechnung Übrigens ich hab die subs gar nicht übersehen twitch mason dankeschön für den sub falls ich nicht gesehen hab jedenfalls huge big brain subscription hier Den haben wir da sonst noch haben wir sonst noch einen any primers keine primers mehr ok ok ich muss euch ehrlich gestehen ich hab glaub noch nie ein logo ein projekt hinzugefügt ok mal eine readme Forscher monarch s ach du scheiß wie ging noch mal images wie ging noch mal images im markdown haben die da vielleicht irgendeinen editor knopf oder so Die macht man noch mal images in markdown so nee so markdown embed images Ist der code in dem privaten repo auch so gut dokumentiert guter code dokumentiert sich selbst weißt du doch war das so nee aber es war es war irgendwas in der richtung alter ich kann mir markdown images War welche syntax zeig her achso falsch rum fast fast so rum excellent sehr gut Komm mit directly to master wir brauchen keine jawoll leute wir haben es wir haben ein off wir haben offiziell ein logo wir haben es geschafft wir sind jetzt ein richtig echtes github projekt weil ohne logo geht das net Übrigens das hier stimmt überhaupt nicht na wisst ihr warum das 390 prozent javascript sind oder wie die coolen leute sagen würden 300 prozent javascript das liegt daran weil ich komplettes viewjs signal a und irgendeinen web-adapter eingecheckt hab Also macht man normalerweise auch nicht sowas macht man normalerweise npm install oder yan install und dann ist das in den notes modules ordner den man nicht included aber kann ja immer noch kann ich immer noch löschen Es ist zwar nicht aus der historie raus aber aus der statistik raus der der text ist auch gut ja also ich würde sagen das sieht so vertrauenserweckend aus dass das morgen 10.000 sterne hat Aber vielleicht übermorgen vielleicht übermorgen also ich finde ich finde ein vertrauenswürdigeres projekt gibt es eigentlich nicht Gut jetzt hätten wir das erledigt also ich habe euch auch hier die neue steckdose gezeigt die wir mal flaschen die kommt morgen an sagt amazon zumindest und dann probieren wir mal im stream aus steckdose leiste flaschen und diese dings hier flaschen mit das motor zum gucken ob das wirklich den energieverbrauch messen kann Soll ich euch mal die neue version hier zeigen die ich vorher gepusht hab von monac s das hört sich schon mal total hängen geblieben an oder soll ich euch die neue version von monac s zeigen ja du brauchst das logo als emote Ah das ist so das ist so klein guck mal wenn ich das das erkennt man nicht als emote das erkennt man nicht wo sieht man meine steckdosenübersicht ich glaube so eine steckdosenübersicht habe ich gar nicht habe ich eine steckdosenübersicht irgendwo Nein der sebaro hatte schon vor langer zeit richtig gute idee der hat gesagt ich soll mal eine liste machen mit so quasi empfohlene hardware und ich habe schon 50 mal gesagt ja sebaro das machen wir und was meint ihr wie weit die liste schon ist ratet mal wieviel sachen schon auf der liste draufstehen da ist er das sebaro wenn man von ihm spricht null nein null ist nicht richtig ich habe gesagt sebaro du hast schon vor einer ganzen weile und zwar schon öfters vorgeschlagen dass ich mal eine liste machen soll mit empfohlene hardware drauf ja ich glaube zwei sachen stehen drauf auf der liste bisher zwei sachen ich weiß gar nicht mehr welche sachen das waren das müssen wir echt mal machen also weil ich habe mittlerweile so viel zeug die sache ist nur die wenn ich eine liste mache mit hier wenn ich eine liste mache mit so geräten die ok wo auch immer amazon jetzt hin ist wenn ich eine liste mache mit solchen geräten das problem dabei ist das kann durchaus sein dass wenn ihr diese liste seht das gar nicht mehr flashbar ist und wenn es dann gar nicht mehr flashbar ist dann kommen die leute zu mir immer sachen max warum empfiehlst du china cloud hardware dabei bin ich ja komplett anti china cloud hardware die steckdosen leiste die ich habe die bringt ihr nichts mehr weil die kann man in der aktuellen version nicht mehr flaschen und ich habe die mir wieder gekauft vor einem monat oder so habe ich mir die gleiche steckdosen leiste wieder gekauft und die hat jetzt ein mediatek chip drinnen anstatt den esp 86 also die gehen gar nicht mehr total hängen geblieben sieht exakt genauso aus von außen eins zu eins aber geht nicht mehr ja so ich zeige euch mal die neue monat s version das nehme ich richtig nice was ich da eingebaut habe wo sie hin repos auch nie überhaupt mein vor hab ich das liegen wo habe ich denn hier mein repo da guck mal writer projects monat s da ist es doch pull pull ja was habe ich hier sachen ich habe hier irgendwas habe ich denn nicht komm bitte zeig mal da überschreiben alles weg brauche man nicht so hallo ihr heckermans ja ich zeige euch jetzt mal die neuste monat s version und ich kann euch sagen es ist extrem nice was das mittlerweile kann das teil das testvideo läuft das testvideo läuft auf my stream ah gut da kann ich direkt starten ohne dass ich was brauche so ich starte es mal moment aber nicht mit dotnet 5 sondern mit dotnet 3 1 ach ich bin noch im falschen projekt so das passt mal auf richtig nice mittlerweile was das kann ja ja wait nervt nicht rum starte ok 5.000 und ich kann es euch auch unter windows zeigen geht auch 5.000 wie war ich da nicht drauf noch nie das habe ich noch für eine ip ja port 5.000 komm mal hier er erkennt person ist übrigens das falsche video das ist das video mit dem fitness grill das fitness grill video das fitness grill video ist gar nicht so schön anzugucken mit der object detection da brauchen wir ein anderes video warte mal genau das ist das fitness grill was war das video was ich von youtube runtergeladen habe viel besser ist das andere video was habe ich denn das andere video nicht das fitness grill sondern war das plupp 2 plupp 2 ts war das plupp 2 ts meine benamung ist ja legendär pluppe 1 und plus 2 ja ah hier guck mal seht ihr es multiple dinger kann er jetzt erkennen ich war im spielplatz ist kacke für object detection ja sehen wir uns einig ja seht ihr das er erkennt multiple dinger ja person person person ja ich habe mich leider geleakt jetzt ja stimmt schon so wie gut das funktioniert seht ihr das hier denkt euch mal diese konsole da in der mitte weg wie was das bringt also chat chat fragt was das bringt also erstens mal bringt das weil es geht so und jetzt aber ernsthaft was es bringt ist normale kamera ist also normale motion detection bei einer kamera macht das ungefähr an dem fest was sich im bild ändert also sprich wenn du die kamera schwenkst dann macht normale kamera motion detection immer sofort alarm das motion detected wurde oder wenn ein zug durchs bild fährt dann auch übrigens bei dem ding fällt ja ein bisschen so und das erkennt nicht bewegung das erkennt personen in bildern mehr habt ihr gesehen die personen im hintergrund das erkennt personen in bildern das heißt das ist viel zuverlässiger und hat viel weniger falls positives bei der motion erkennung oder durch ob es durch die durch die object detection woran er das erkennt das ist tensor flow machine machine learning mit tensor flow ist da unten drunter so aber wartet mal kurz es wird noch viel neisser wenn er wenn er wieder den spielplatz im hintergrund zeigt ich meine das ist jetzt das hat das letzte mal auch schon konnt übrigens wisst ihr was auch noch anders ist euch euch fällt vielleicht auf dass die dass die dass die größe skaliert kommen er erkennt die personen im hintergrund habt ihr es gesehen wobei er da probleme hat bei so kleinen sachen hier weiß ich aber die erkennt ja guckt ja er erkannt aber hauptsächlich die im vordergrund ich war man darf nicht vergessen das ganze läuft mit 300 mal 300 im hinter für die für die motion erkennung alla kirby ist ja gut und da kannst du den live feed von einer kamera einmal ja das ist ja grad der witz das läuft nicht auf dem raspberry pi das läuft lokal aber ich hab es testweise schon über den raspberry pi laufen lassen ist kein problem also raspberry pi schafft bis zu vier kameras somit zwei drei sekunden verzögerung du musst aber den den container beschränken auf der auf den docker container muss auf raspberry pi beschränken sonst braucht er zu viel cpu guck jetzt das grill was durchläuft hat er auch erkannt kannst du die alerts irgendwie pushen jetzt das ist der plan das ist der plan dass man auch alerts irgendwo hin pushen kann dass man das in seine heimautomatisierung integriert hat und dass man irgendwie webhooks hat für alerts oder so vielleicht unterstütze ich auch mal eingebaut irgendwelche standard alerts sagen übrigens ich filtre alles raus ich filtre alles raus ich kann es euch ja mal zeigen ich filtre alles raus guck mal hier seht ihr es das ist das ist nice hier erkennt er alles person person person den typ hier empfinde kommt er sich nicht merkwürdig vor dass er auf dem spielplatz das er eine geile fitness action macht und drum herum rennen die familien mit kindern um und dann rum passen passen passen passen passen passen der filtert hier übrigens nur nach person der erkennt manchmal ganz merkwürdige sachen der erkennt manchmal baseball schläger und sowas dann sagt er hier baseball bett oder sowas steht dann manchmal dran ja das kannst du mit normalen camera feed machen ich kann dir sogar zeigen dass es mit normalen camera feed geht ich muss mal nur gucken wo ich meinen wo ich den ausschnitt von meinem normalen camera feed habe ich glaube nur 2 ts ist es ja ffmpeg guckt das ist jetzt ein mitschnitt von meiner normalen aber übrigens das buggt jetzt weil er noch ein bisschen hängt ah moment ich glaube das ist noch ein bug ich glaube das ist noch ein bug wenn man ne ne ne das geht nicht das geht nicht das geht ja normalerweise mit einer camera auch nicht dass man unter der haube den video stream ändert das funktioniert nicht weil wenn sich die auflösung von dem video ändert dann kommt der objekt detektor durcheinander das das problem hat man bei einer normalen camera aber nicht guckt so das ist jetzt ein mitschnitt von meiner normalen camera die ich im hof hängen hab und da erkennt er auch dass das hier person ist die durchs bild läuft ja das ist ein bug also was heißt bug normalerweise der muss ja den image detector und den rescaler muss der initialisieren auf ne gewisse größe von den frames und das macht er einmal beim starten von der camera ne normale camera ändert ja aber auch nicht seinen stream und die auflösung mitten im stream das ist spinnwebe davor ja und das ist ausplan funkt so und jetzt ist die sache das wie viele ressourcen braucht das kann ich dir gleich zeigen nicht so viel weil aktuell macht er das nur jeden keyframe und das ist eigentlich auch ziemlich big brain finde ich genau aber bevor ich was für den ressourcen sage ich wollte noch eine sache sagen warum das jetzt so viel besser aussieht hier mit dem overlay und so wie das letzte mal ich mach das jetzt mit einem wo ist es hier ich mach das jetzt mit dem canvas und mal das selbst oben drüber also sprich ich schieb da kein diff mehr hin und her sondern das ist ein canvas und hier male ich auf dem canvas rum ah guck hier hier start start stop font hingemalt und dann hier rechteck malen und sowas das ist komplett nur lokal na klar als würde ich was mit cloud unterstützung basteln jetzt mal ganz ehrlich nein natürlich nicht das ist rein lokal komplett lokal ich baue ja nichts mit cloud unterstützung mit cloud unterstützung wäre das noch viel easier möglich es gibt eine richtig gute image detection api von microsoft die sagen dir sogar was inhaltlich auf dem bild zu sehen ist also die sagen dir zum beispiel wenn du jetzt irgendwie dass die sagen dann keine ahnung spielplatz auf der wiese und sowas das ist richtig gut das ding von microsoft das haben wir sogar mal im stream ausprobiert wo wir wo ich versucht habe für bdo dieses screenshot tool zu basteln was dir eine nachricht schickt wenn das auktionshaus was hat das ist das ist kein knasthoftor das ist ein künstlerhoftor das hat mein opa gebaut und das einzige was ich oder was wir gemacht haben ist hier so so plastik davor dass die katz nicht rüberspringen kann aber das das hoftor ist an sich eigentlich ziemlich nice das hat hier ihr seht ja so das hat hier so unterschiedlich geformte stebe und muster also das sind das sind auch so unterschiedlich gewölbt das sind das sind quasi irgendwelche platter und motive und so wie gesagt der opa war ja maler also er hatte auch so viele bilder hinterlassen und alles bei solchen dingern war er echt big brain ne das ist eher das von innen keiner rausspringt das klappt doch bis jetzt aber das kostet doch richtig viel geld wenn du 24 system bilder dahinter gehst deswegen deswegen verwende ich ja auch keine microsoft cloud api und also will ich nichts cloud werden so und jetzt so viel zum ressourcenverbrauch ich kann euch das mal zeigen der ressourcenverbrauch ist aktuell ziemlich nicht existent ja wir machen mal so wusste gar nicht dass das geht habe ich kein system monitor da drauf das ist schöner zu sehen finde ich weil kann man es nämlich als auferlehr drüber machen als im hardtop im terminal für diese sache hier klompses zum monitor starten wir mal als root dass man auch alles sieht ja so also das ist das was object detection macht und das braucht aktuell 3 bis 5 prozent cpu wohlgemerkt das ist ein das ist ein i7 8700k ja ja und der macht ja auch nur jeden keyframe also das keyframe ist ja das bild was also ist ist der frame der wieder zum ersten mal komplett alle bildinformationen enthält das heißt ich kann auch nur keyframes analysieren wenn ich mehr analysieren möchte als die keyframes dann müsste ich das komplette video decoden und das braucht zu viel zu viel leistung das will ich auch nicht alle 2 sekunden reicht voll und ganz aus ja ich kann mal den spielplatz zeigen da bewegt sich bisschen mehr da muss ich aber ausmachen war das jetzt richtig oder war das das fitness grill das ist das fitness grill im moment falscher falscher stream würde ich ja mal die dateien ordentlich benennen dann wird man da auch was erkennen hallo die auslastung raspberry kann ich euch das nächste mal zeigen die habe ich aber ausprobiert die hält sich auch in grenzen so guck so viel braucht das jetzt ungefähr hier bei diesem video auf dem spielplatz wie groß ich den browser mache ist natürlich egal weil der immer nur das gleiche bild dahin schickt das ist nicht so hoch so die sache ist jetzt die wenn man das auf dem raspberry pi macht dann ist man relativ schnell auf 100 prozent cpu last aber es ist ja egal ob das jetzt 500 millisekunden 300 millisekunden oder eine sekunde braucht zum processen wichtig ist dass es nicht das system komplett dicht macht so und deswegen würde ich das hier auf dem raspberry pi so starten das man ich will den process nicht ausmachen dass es nur maximal zwei von vier kerne verwenden darf auf dem raspberry pi vier dann braucht es zwar so halbe sekunde bis sekunde für den keyframe aber das ist kein problem und es ist genug cpu last frei für alles andere dass man auf dem raspberry pi jetzt keine performance erreichen wird mit 15 fps die sekunde für frag mich nicht zehn kameras ist klar ja also man muss das schon mit bedacht einschalten man kann jetzt da auch nicht alle seine kameras rein machen und motion detection anmachen das ist aber auch nicht so wild weil ganz ehrlich wo will man motion detection haben bei der kamera die auf hof store geht ok und vielleicht noch bei einer kamera die irgendwie guckt wenn die katze essen geht oder irgendwas falls man sowas will ja aber so mehr als zwei maximal drei kameras wenn man die hat will man eigentlich gar keine motion zumindest ich nicht motion detection anmachen und wenn man das will kann man sich immer noch so ein ding kaufen ne nicht gpu tpu dann kann man sich immer noch so ein ding kaufen für 60 70 euro und das ist für den raspberry pi das ist so ein ki accelerator und wenn man das dran hat kommt man auch auf seine 5 6 fps und das auf den raspberry pi und ohne großartig cpu last das ist was wenn man wirklich viele kameras hat und bei vielen dann motion detection machen will ist das was was sich dann von der investition her sogar lohnt weil besser kriegt man das mit dem teureren rechner dann auch nicht zusammen also ich finde das ist sogar ganz fair 68 euro dafür also siehst du es braucht nicht viel cpu last so wir können jetzt ja mal den stream wir können jetzt ja mal den stream mehrfach rein machen und da können wir mal gucken wie die cpu last hoch geht übrigens falsch was ich hier auf hab muss monarch s aufmachen und nicht da drinne sondern im anderen ich mach mal ich mach mal mehr mich macht den streamer mehrfach an dann sehen wir das auch die cpu auslastung relativ schnell hoch geht kopieren wir den kram hier einfach ein paar mal haben wir hier fünf streams oder so eins also drei streams sechs streams jetzt also also als haben wir sechs streams laufen aber ich muss nur gucken dass die id unterschiedlich sind 0 1 2 3 4 5 ok ich brauche noch ein overlay wo der name der kamera drauf steht fällt mir gerade auf guck jetzt jetzt braucht schon ein bisschen mehr jetzt sind wir schon gleich bei 36 prozent cpu last und schwankt 18 36 nachdem wann die keyframes kommen also zwischen 18 und 40 prozent cpu last haben wir jetzt hier schon und das ist bei 1 2 3 4 5 6 kameras wobei man sagen muss das geht eigentlich auch immer noch klar ja ich meine ihr seht ja jetzt sind jetzt hier halt sechs kameras zwar ist immer der gleiche stream aber es sind sechs kameras skaliert ziemlich linear ja bis zu dem punkt wo er halt warten muss weil es weil es dicht ist ab dann dürfte wahrscheinlich richtig richtig bäm hochgehen ansonsten dürfte das ziemlich linear sein aber das ist halt eine sache die man auch wirklich vorzüglich exzellent multithreaden kann weil das eine bild hat nichts mit dem anderen bild zu tun und das eine bild von der einen kamera hat noch viel weniger mit dem bild von anderen kameras zu tun also das kann man perfekt multithreaden eigentlich sondern ich zeige euch jetzt noch mal die auslastung von meinem programm weil die ist auch passt gar nicht da hier mal hier guck mal das programm was die kameras streams ausliest und an browser schickt hat gerade mal 1 2 prozent cpu last und das geht nur übrigens dass es pixels liegt an diesem komischen rtsp server hier damit rumspackt dass das so wenig ist liegt einzig und allein da dran dass es nicht die code und encoded werden muss also sprich wenn die kamera das video nicht in einem format liefert was der browser abspielen kann da geht das ganze nicht also ich transcode nichts das ist nämlich das was wir bei der ganzen kommerziellen kamerasoftware also surveillance software und mit detection software auf den sack geht die transcode das alles also sprich die decode immer die videos komplett und encode sie wieder um dann ihre magic zu machen das ist aber für Raspberry Pi nicht händelbar deswegen mache ich so ich kopiere einfach nur die frames also ich lese die frames in der kamera aus packt die ein bisschen anders ein und schickt sie an browser das heißt wenn die kamera in den modus also wenn die kamera beispielsweise nur mpeg 2 unterstützt oder so dann funktioniert es nicht wenn die kamera nur h264 unterstützt mit irgendeinem ganz komischen profile funktioniert es im browser nicht ist die kamera vp9 was es glaube ich gar nicht gibt funktioniert im browser nicht also sprich das funktioniert nur mit der kamera die h264 encoded mit einem normalen profile was 99 prozent der kameras können ja ich habe mir schon überlegt ob ich direkten support für die raspberry pi kamera und motion jpeg streams noch irgendwie einbau das lässt sich wahrscheinlich noch machen ja da muss man gucken excellent kaum verbrauch nächstes mal probieren wir so für Raspberry Pi aus genau hat jemand noch mal ein anderes video was testen soll ob es gut funktioniert mit personenerkennung aber wie gesagt es funktioniert relativ zuverlässig mit ganz vielen leuten das macht gar nicht so viel unterschied ob da viele oder wenig leute drauf sind wir können ja mal konzert ist dunkel und die leute verschwimmen in der masse das kann ja nicht gut ne das funktioniert nicht wir können es mal ausprobieren was war denn rock ich weiß was wir nehmen das video wo es mich drin zu sehen gibt aber keiner weiß wer ich bin sebaro was schickst du mir da für videos soll ich das jetzt einfach aufmachen ja genau sebaro exakt das müssen wir ausprobieren rock am ring nickelback 2004 so stop hier ist irgendwo hier sieht man mich ich kann das jetzt nicht abspielen irgendwo hier sieht man mich vorne erste reihe ja ok das kann ja das müssen wir nicht ausprobieren das erkennt er nicht ja ich darf keine musik abspielen ja ne ne das erkennt er nicht aber wir können mal nach einem anderen video keine ahnung park park was könnte man da suchen park people irgendwas fitness wow alter die leute was ist da los hier sind viele leute drauf hier sind viele leute drauf alter was gibt ihr denn ab hier sind viele leute drauf das können wir mal gucken ob er das erkennt alter was ist mit dem los was macht der da ok das probieren wir es doch mal youtube dl oh achso ich muss erstmal das format auswählen f 22 ne 18 den klein reicht das ist noch ein viel besseres video das ist noch viel besseres video was da einer geschickt hat hier im oh das ist richtig gutes video das das das das das nehmen wir das nehmen wir da rennen 50.000 leute in den pokemon nach das ist top für detection das probieren wir mal aus ok ffmpeg ffmpeg ich muss jetzt ich muss jetzt erstmal kopieren wie heißt das rare pokemon und dann bester name das nennen wir jetzt plub 3 dass man auch schön Bescheid weiß welcher plub was ist plub 3 starten das ganze und dann gucken wir mal ob er da was er da erkennt ok das das oh das macht jetzt ein bisschen fertig das macht jetzt ein bisschen fertig das sind alles person hier guck mal alles person alles person das macht ihn fertig aus horse erkennt er nicht das habe ich ausgeblendet ob er das er das horse erkennt ich habe nur person gemacht leute soll ich mal einstellen dass der alles anzeigt was er erkennt das wird das wird lustig wartet mal wir nehmen immer das person raus machen einfach nur detection truck truck guck mal hier leute truck er erkennt das feuerwehrauto truck car traffic light guck mal der ist gar nicht so doof person na er kennt es ja fast so als crowd guck mal weil wenn das hier eine person ist das sind alles das ist alles person hier also man muss doch echt sagen das funktioniert verhältnismäßig gut horse suitcase person nein das pferd erkennt er nicht also ich finde immer noch dass er klappt ausgesprochen gut man muss es zwar probiert auf der gpu laufen zu lassen nein habe ich nicht geht habe ich aber nicht weil mein ziel ist dass es am ende ja also es am ende auf dem raspberry pi läuft da ist mit gpu eh nix also was heißt ich habe es ja schon ausprobiert und auf dem raspberry pi gehts halbwegs man kann halt nicht 6 7 kameras mit motion detection rein machen und erwarten dass der das bei jedem keyframe innerhalb von sekunden erkennt gut spärzonen kann ich auch machen also ich kann auch sagen hier keine motion detection das ist kein problem das funktioniert auf dem vierer auf dem dreier würde ich es nicht unbedingt ausprobieren auf dem dreier ist vielleicht ein bisschen wobei ganz ehrlich so ein großer unterschied ist ja da nicht rein cpu leistungsmäßig also keine welten dazwischen der dreier hatte auch schon vier kerne oder ja so viel ram braucht das nicht das braucht nicht viel ram ja 180 mb und das andere braucht 275 mb ja ich habe das doch recht also das hier hier kann ich mich nicht damit rühmen das habe ich nicht programmiert das verwende ich nur aber ich habe mir schon mühe gegeben dass das effizient programmiert ist ja also es braucht nicht nicht unnötig viel cpu und auch nicht unnötig viel ram und funktioniert doch gut excellent ich bin begeistert so wisst ihr was wir jetzt mal machen wir lassen das jetzt hier im hintergrund laufen und wir gucken mal ob das memory leaks hat das habe ich nämlich noch nicht ausprobiert also lasst uns mal merken wir sind jetzt bei also das hier ist übrigens uninteressant das das das das das wichtige wir sind jetzt bei 128 mb 130 mb 130 mb und hier meint er irgendwas von 206 ok schauen wir mal schauen wir mal gleich ob wir irgendwelche memory leaks haben und inzwischen zeige ich mich mal zu der geschichte aus muss mal kurz in mein texteditor gucken ich habe mir glaube ich irgendwas aufgeschrieben was ich noch erzählen wollte das hat übrigens der serious max vorgeschlagen falls er noch da ist dass wir uns das hier mal angucken sollen ach ja stimmt weil mich jemand letztens gefragt hat was ich mir für nfc text gekauft habe nfc starterkit das hatte ich mir geholt da ist eine mischung aus alle möglichen du hast ein paar karten mit nfc du hast ein paar ganz neutrale weiße aufkleber nfc text du hast ein paar nfc text mit anhänger du hast magnetische nfc text und du hast noch ein paar nfc text mit aufdruck und so ist eigentlich top das ist das womit ich beispielsweise jetzt morgens mein heizlüfter im bad einschalte auf dem klo wenn ich mich aufs klo setze wenn ich mich aufs klo setze nehme ich mein handy halte das an ein nfc tag oder geht der heizlüfter an und der steht in der position wo ich gar nicht drankommen normalerweise alternativ könnte ich natürlich einfach vorher auf den knopf vom heizlüfter drücken knopf vom heizlüfter drücken aber mit nfc tag ist natürlich viel nicer wer braucht den heizlüfter hä die frage ist wer braucht keinen heizlüfter heizlüfter ist das beste vor allem wenn es morgens kalt ist oder man lässt morgens oder man lässt natürlich dann nachts die heizung ne fußbodenheizung habe ich keine das ging bei mir auch schlecht hier im ersten stock im erdgeschoss haben wir ne fußbodenheizung fußbodenheizung bei mir im ersten stock ging nicht sonst hätte ich auch eine und memory leak kann man noch nicht sagen schauen wir mal liegt da was bei der garbage collector muss ab und zu mal laufen wir warten wir warten einfach mal ab ok excellent also dann werde ich mich mal hierzu ein bisschen auslassen also was was sind das für serious maxi bist du eigentlich auf die idee gekommen ist richtig richtig nice nice idee gut also was die besten game engines sind kann ich nichts zu sagen da bin ich echt nicht der beste für was game g develop g develop ist mit sicherheit keine gute game engine g develop klingt so nach irgendwie so einem fail gnome editor das sieht da eklig aus wo ist denn unity warum steht mal best game engine ach das sind 2d 2d aber man kann auch mit unity na gut ne ich glaube unity ist ja im kern immer 3d du kannst zwar die sachen so machen dass du nicht nach hinten und vorne laufen kannst aber im prinzip sind sachen immer 3d oder oder kann man mit unity ordentlich 2d machen ich habe keine ahnung von spielentwicklung sieht aus wie netbeans ja und wisst ihr was früher war netbeans richtig beliebt das war wahrscheinlich noch bevor es diese jetblades sachen gab weil dann hatte man damals hatte man die alternative zwischen eclipse und netbeans jetzt sage ich netbeans mittlerweile auf github auf jithub tatsächlich ja nicht so viele sterne verwendet man ja auch nicht also was das ist jetzt das ist das ist auch eine frage wo ideologisch manche leute ein bisschen über die strenge schlagen was der beste text editor ist wenn den ok wenn ihr sagt unity ist eines der besten 2d sachen ich würde fast sagen so rein als außenstehender wie ich das sehe ja also ich kenne mich ja mit spielentwicklung nicht aus dass unity eigentlich mittlerweile fast das beste für so nahe zu alles ist und für mich als jemand der keine ahnung von spielentwicklung hat aus einem grund nämlich dass unity der community support und der anzahl an tutorials und sowas einfach unglaublich hoch ist das ist auch übrigens der gleiche grund warum ich der meinung bin dass an so einen raspberry pi so schnell nichts dran kommen wird den computer zu bauen der schneller ist oder so ein single board computer zu bauen der schneller ist als ein raspberry pi ist kein problem vielleicht sogar zu einem ähnlichen preis ist kein problem aber was was an ökosystem und unterstützung und allem da drumherum existiert kommt keiner so schnell an raspberry pi dran und ich denke mal das ist bei unity ähnlich vielleicht unreal noch so und jetzt was gibt es hier heute captain peng du hast die neue version vom monka s tool verpasst vom monarch s tool guck mal das kann jetzt unterschiedliche sachen highlighten und er erkennt keine pokemons aber traffic lights aber ich glaube wir haben keine memory leaks der ist nämlich gerade schon wieder runtergegangen erstes intellijay war von 2001 ne glaubt man wirklich nicht also beste text editors na da kann man sich jetzt drüber streiten über ein paar sachen also wim und neowim ich verstehe warum die sachen als unterschiedliche unterschiedliche editoren geführt sind aber für für einen als anwender macht es jetzt auf den ersten blick nicht so wahnsinnig viel unterschiedlich weiß es gibt ein paar plugins die sind explizit für neowim die bauen jetzt nach und nach auch dieses async feature von wim ein aber im prinzip macht es erstmal nicht allzu viel unterschied und ohne plugins schon mal gar nicht großartig so ich kann verstehen dass wim und neowim auf dem ersten platz ist der hype um neowim ist auch schon ein bisschen vorbei aber die haben die haben für viel also die haben viel die haben vieles ins rollen gebracht bei wim was wim jetzt auch eingebaut hat kann ich verstehen dass das vorne ist wim ist halt auch historisch einfach ganz weit vorne mit dabei und hat sicherlich auch viele votes hier schon eingesackt wo vision studio code gar nicht dabei war dazu kommt dass wim ein super editor ist den man einfach für klein kram verwenden kann also ich bin ja mittlerweile davon weg gekommen ich bin ja mittlerweile davon weg gekommen größere sachen im wim zu machen aber es gibt nichts besseres wie wenn man was kleines editieren muss oder ssh was editieren muss das über wim zu machen also da ist wim top ich verwende wim immer noch täglich nicht als main editor aber eben um halt zu editieren also da bin ich mit einverstanden dass die immer noch im ersten platz stehen also universell ist wim da immer noch wenn man wirklich mal rein auf text editor guckt und wie vielfältig der benutzbar ist rein als editor ich rede das nicht von irgendwelchen features für unterschiedliche programmiersprachen sondern wie vielfältig wim allein als editor zu benutzen ist kommt da eigentlich kaum was dran also du kannst den über ssh wunderbar verwenden auf dem terminal wunderbar verwenden du kannst wenn du dich damit auskennst auch super schnell editieren ja doch ich sehe schon den vorteil versus nano weil wenn man sich mal so keine ahnung so die 10 basic wim commandos gemerkt hat ist es viel angenehmer in einem terminal editor in einem terminal mit wim zu editieren als mit nano nano ist quasi der klassische gui editor nur ohne gui was blöd ist weil man dann keine maus verwenden kann über ssh und für wim brauchst du keine maus deswegen finde ich wim für kleine editier sachen viel angenehmer also ich sehe auch schon vorteil also man muss sich gar nicht man muss sich bei wim gar nicht so viel merken es reichen ja schon so die standarddinger ja also wo haben wir denn hier was zum beispiel was mache ich in wim wenn ich jetzt hier dieses wenn ich das hier wenn ich das hier ersetzen will durch was anderes was mache ich dann in wim dann sage ich einfach c moment ci anführungszeichen zack so rückgängig das ist halt sehr praktisch das sind so sachen die machst du im nano nicht nebenbei sondern hast du was wie lösche ab hier bis zu bis zum zeilen ende ändert dieses eine wort ja wim kann sogar zählen übrigens eigentlich ein feature was kein mensch braucht aber trotzdem irgendwie nice ist gibt es sonst noch zu zeigen aber wenn man sich die paar basics die paar basics merkt die basics genau du kannst mit g hoch und mit groß g runter also groß g ist nach unten gg ist hoch das suchen in wim ist auch nice zum beispiel was richtig cool ist kannst du nach setz suchen dann kannst du hier durchspringen die unterschiedlichen setz sachen einmal suchen und was man auch machen kann ist mal angenommen ich möchte hier das highlighten überall überall im gesamten dokument habe ich irgendwas was es noch mehrfach gibt hier if dann gehe ich drauf und rückstärnchen und dann highlight der mir alle ifs das sind die sind die sind einfach praktisch deswegen mag ich wim für sachen über ssh zu editieren und sowas ja aber letztendlich letztendlich ist es geschmackssache ich will es ja keinem ausreden dass er mit nano editiert oder so genau das ist auch ganz praktisch man kann zum beispiel r drücken dann überschreibt man das alles man kann control y drücken dann schreibt er das was die zeile oben drüber ist unten drunter dann gibt es noch richtig nice copy paste features wim kann halt unendlich viel und wenn man sich so die wenn man sich so sagen wir so zehn basic befähle gemerkt hat finde ich kommt man damit gerade wenn man über ssh auf der kommando zeile was editiert sehr angenehm zurecht ja so also als als reinen editor verstehe ich dass im vordersteht das würde ich so unterschreiben so und wenn es jetzt darum geht wie universell man das einsetzen kann eben für unterschiedliche programmier sprachen und unterschiedliche anwendungsszenarien die quasi obendrauf zum editieren kommen dann sehe ich tatsächlich wirklich auch visual studio code auf dem zweiten platz ich zähle jetzt mal wim und neowimmer zusammen an der stelle da sehe ich visual studio code auch auf dem zweiten platz ich weiß dass jetzt wahrscheinlich die ganzen emacs leute sagen oh nein das geht ja gar nicht ich habe auch mal eine ganze weile emacs benutzt aber man muss ehrlicherweise sagen die entwicklung bei vielen plugins bei emacs ist mittlerweile ziemlich eingeschlafen emacs leute sind ziemlich ziemlich anti neuerungen was man zum beispiel gesehen hat ich bin mir gar nicht sicher ob es mittlerweile wieder emoji support für emacs gibt es gab es eine ganze weile nicht weil die gesagt haben wir bauen das erst ein wenn es unter allen betriebssystemen der open source implementierung für gibt es halt die emacs philosophie ja du kannst beispielsweise org mode heute immer noch nicht ordentlich mit kalt aufsunken auch wenn es plugin dafür gibt aber es funktioniert nicht richtig also ich finde dass mittlerweile visual studio code eigentlich das bessere editor betriebssystem ist als bei emacs und der vorteil der riesen vorteil bei visual studio code ist der gleichzeitig auch der größte nachteil wenn man es so will es ist komplett javascript es ist kirby musik das ist der größte vorteil und nachteil gleichzeitig von visual studio code es ist javascript es gibt glaube ich keine programmiersprache aktuell vielleicht wenn es ein python editor wäre oder sowas kennst du den atom editor ja atom haben wir haben wir elektronen zu verdanken introducing atom board ne die kenne ich nicht die werbung kenne ich nicht zeitmeier die klingt wie fallout ne klingt wie bioshock klingt wie bioshock auf dem ding ja mit javascript macht er seine hausautomaten ist auch mutig mit atom mit atom ich mag keinen git support in keinem editor in keiner ide git geht nichts über kommando zeile lasst mich raten er verwendet auch atom was was soll man ausprobieren eclipse scheiß die werbung ist gut die werbung ist gut leider atom mittlerweile nicht mehr so angesagt aber wir dürfen einzig vergessen wie sieht das atom repo mittlerweile aus wir dürfen einzig vergessen atom wird für ich sag mal nicht für ewig aber atom wird für sehr lange zeit weiterleben egal ob da als text editor oder nicht wie gesagt elektron ist aus atom hervorgegangen und elektron ist so schnell nicht mehr wegzudenken die ganzen javascript leute freuen sich jetzt dass sie desktop und mobile anwendung machen können und das hat er geradezu zur explosion an apps und desktop apps und mobile apps gesorgt die mit javascript und elektron gebastelt wurden das haben wir atom zu verdanken zu verdanken ja und also atom wird weiterleben vielleicht auch nicht als text editor aber in jeder elektron anwendung zum beispiel in discord by the way also ohne atom hätten wir kein discord zumindest nicht in dieser form was hältst du eigentlich vom apple mi ich hab mich damit absolut gar nicht groß beschäftigt so jetzt nochmal ein paar sagen was haben sie sonst noch drin steht also wie gesagt die ersten zwei plätze würde ich genauso unterschreiben top man kann imax sicherlich auf den nächsten platz nehmen wobei ich gerade finde das sind imax die haben ein bisschen den anschluss verloren so was gibt es denn da noch ah seafulllist was haben die sonst noch ach moment spacemax und imax sind spacemax ist doch nur eine pluginsammlung für imax im prinzip also was haben sie sonst noch gut warum das so weit oben ist kann ich nicht verstehen vielleicht weil die folgen ist bei so vielen ich weiß es nicht zu bleiben text verstehe ich rein als editor würde ich den sogar hier ja doch passt passt wunderbar mikro kein schimmer warum auch immer das so weit oben ist imax kate aller e-git wer verwendet denn so was atom ja ok und notepad plus plus ihr glaubt gar nicht wie viele nord notepad plus plus verwenden brackets stimmt den habe ich ja schon wieder komplett vergessen brackets brackets gab es ja auch noch das ist der dritte javascript editor im bunde es gab mal visual studio code eclipse brackets und noch ein vierten wie hießen der tables irgendwas mit tables kann sich da noch einer dran erinnern leiten die nicht light tables irgendwas mit tables hieß der war damals auch übelst gehyped vor einigen jahren und ist glaube ich mittlerweile eingestellt irgendwas mit tables war auch so ein javascript editor den rest gut ist im prinzip das gleiche wieder ja doch die liste finde ich gut passt passt zum größten teil außer mal also genny oder wie man das das weiß ich nicht was das da oben macht das ist nice also die liste würde ich so mehr oder weniger sogar unterschreiben ich würde mal interessieren was die leute schreiben space banks ja verstehe ich also das ist eine gute liste die passt so je mehr plus desto schlechter ne ich finde es gut was die also das würde ich so mehr oder weniger bis auf ein paar kleine änderungen unterschreiben das passt ok oh das ist jetzt natürlich auch eine harte frage was ist also was die beste programmiersprache um damit anzufangen ok schauen wir mal ich hoffe da ist nicht c++ unter den top 10 da ist c++ gar nicht drinnen sehr gut sehr gut eine liste die ich komplett unterschreibe zum glück ist da kein c++ drin ja c c ist ja ok aber c++ ist nicht ok c++ macht man wenn man nicht möchte dass die leute weiter spaß am programmieren haben also zeigen wir mal her ja das kann man das könnte das kann man wirklich bedenkenlos als einstieg empfehlen was ist denn der unterschied zwischen c und c++ dass c eigentlich eine ziemlich schlanke lo in sich konsistent logische programmiersprache ist und c++ ein riesen zusammengeschusteter haufen müll so das ist der unterschied zwischen c und c++ also bei so kann ich als erster nim habe ich noch nie was mitgemacht keine ahnung wahrscheinlich haben das die nim fanboys hier hoch gewartet kein schimmer c ganz ehrlich ich würde da heute nicht mehr mit c anfangen so mal nebenbei ein bisschen rumkommen aber als erste sprache in der heutigen zeit man man sollte finde ich mit einer sprache anfangen wo man auch ein bisschen was sieht was passiert und ganz ehrlich c ist langweilig am anfang da machst du das spannendste was du in c machen kannst am anfang ist terminal input und output das ist ultra langweilig mit piste kannst du viel mehr sachen machen am anfang ja also das würde ich so würde ich so gelten lassen das kann ich nichts zu sagen kann man machen würde ich auch nicht unbedingt als einstieg wish also warum ist es wish empfehlen ruby auf jeden fall ruby ist eine top einsteiger programmiersprache finde ich leider in letzter zeit ein bisschen aus der mode gekommen ich hoffe dass mit ruby ruby 5 ist es jetzt oder ruby 4 oder wann kommt denn das oder ist ruby 5 was jetzt kommt ne ruby 3 ich habe das mit wells durcheinander gebracht ruby 3 kommt jetzt genau weil ich hoffe dass ruby mit ruby 3 wieder ein bisschen aufwind bekommt denn sie haben richtig viele geile sachen gemacht in ruby 3 ruby ist jetzt massiv viel schneller im vergleich zu früher ich meine ruby ist jetzt nicht hier irgendwie bei c sharp oder oder go oder c oder so in der nähe aber ruby dürfte doch schon mal ordentlich zulegen mit der nächsten version wann geht es weiter mit dudes unter überwachungskamera was den anfang verpasst wir gucken gerade ob das irgendwelche memory leaks hat scheint aber nicht so zu sein oh genau die haben auch viel gemacht was multiflating angeht also ich hoffe weil ruby ist nebenbei c sharp meine absolute lieblingsprogrammiersprache ich hoffe dass die mit ruby 3 wieder ordentlich zulegen future of ruby den habe ich nicht geguckt aber der typ also mats ist übelst big brainer typ mit was würdest du als anfänger beginnen das sage ich gleich was zu wenn ich hier diese wenn ich die sache durch habe ich habe da nämlich meine eigene ansicht zu mit was man am besten anfangen sollte aber pyson ist prinzipiell echt nicht verkehrt ja also das könne ich so stehen lassen zähne ich ruby würde ich auf jeden fall auch hier oben hin ansehen racket keine ahnung ich weiß gar nicht so genau was es ist wahrscheinlich irgendwas was zu javascript kompiliert also javascript ganz ehrlich in der heutigen zeit was macht ruby attraktiv ehrlich gesagt hauptsächlich die syntax früher hätte ich noch gesagt weil es halt viele viele libraries und gems zur auswahl gibt das ruby ökosystem hat ein bisschen gelitten die letzten jahre über dadurch dass rails immer unbeliebter geworden ist also was ruby attraktiv macht ist dass ruby eine programmiersprache ist die gemacht wird dass sich programmierer wohlfühlen ruby on rails war mal der der mit der also kann man auch gar nicht sagen dass das der shit war das war der der näher boden für die ganzen wir haben es wie ist das damals rockstar programmer und nicht die typen die gta programmieren sondern die dies quasi so so krass geil programmieren können dass sie so famous werden wie rockstars die ganzen rockstar programmer die haben damals ruby programmiert ja sinatra war auch top also ruby ist echt super ich hoffe dass mit ruby 3 wieder wieder aufwärts geht so javascript meiner meinung nach müsste javascript exakt hier oben bei 390 stehen mit python weil javascript in der heutigen zeit nicht wegzudenken ist egal wie du kannst kein meinung zu pearl right only aber ich habe jahre kein pearl mehr gemacht habe ich auch nicht habe ich auch nicht vor was wollte ich jetzt gerade sagen also gerade in der heutigen zeit egal ob du backend frontend sonst was lieber machst du kommst an javascript nicht mehr vorbei javascript ist überall und ein bisschen frontend muss heute auch jeder können und das schöne bei javascript ist man sieht was man macht nämlich im browser was und man sieht was und das ist das wo ich der meinung bin dass das die ein dass das einsteiger am meisten motiviert wenn sie sehen dass was passiert wenn sie was machen deswegen denke ich dass javascript ganz weit oben mit python stehen muss nämlich noch aus dem weiteren grund javascript ist mittlerweile auch einfach zu lernen nicht so sehr wegen der sprache die sprache ist auch jetzt nicht extrem schwer aber es gibt glaube ich für javascript mehr tutorials und mehr guides und mehr kurse und mehr libraries und mehr alles als für jede andere programmier sprache auf der welt deswegen ist javascript meiner meinung kann das ganze wenn es wenn wenn ich diese liste machen müsste ja so nach den kriterien wie ich denke dass es für leute sich eignet zum einsteigen auch gerade von der motivation und wie gut man progress sieht ich würde ehrlich gesagt ohne scheiß ich würde javascript auf platz eins setzen gab es da nicht mal so eine gab es da nicht mal so eine seite wo man programmier sprachen tier rankings machen konnte tier ranking genau das da das was der hier im video zeigt diese seite was ist denn das wie heißt denn das rank tier maker genau da fehlen aber ganz schön viele noch da fehlen aber ganz schön viele noch also ok ok also wir fangen jetzt mal an ist hier wir machen mal die einfachen sein ist hier das ist schon mal relativ einfach so das haben wir schon mal ganz gut verteilt so ja meine persönliche präferenz alles hier ja was ist das überhaupt was ist das hatte man da was das für eine programmier sprache ist powershell ist das powershell ist das powershell könnte powershell sein oder powershell png excellent das war jetzt auch der übelste hacker way das rauszukriegen oder wahrscheinlich steht irgendwo so powershell ist ok wenn man ftn ich habe keine ahnung was ftn ist das ist ja keine programmier sprache in dem sinn wichita basic jetzt kann ich nichts zu sagen swift das ist swift oder ist das swift swift habe ich keine ahnung von ganz ehrlich ganz ehrlich ich tendiere zu b so scheiße ist php gar nicht die vba was was ist denn das mehr klammern igitt geh mal weg hey monka es latex aber das weiß ich nicht was es ist es kann ich nichts zu sagen bestimmt bestimmt übelst für die big brain leute ist das mega nice das ist kotlin ja kann ich kann ich nichts zu sagen aber ich tendiere hier zu ja ok es ist nicht total akram mal was dahin was ist das css gut das ist bash bash ok die sprache ist scheiße also bash ist wirklich abartig aber als shell ist ganz nützlich ja so excellent hier ranking java gehört unter z++ ne ne ne ne ne ne unter z++ gehört nix wenn ihr mich kennt wisst ihr genau dass diese zwei dinger oben stehen oder aber ich ich bin begeistert so wenn ich das so sehe dass ich eigentlich gegen viele sprachen dass ich die meisten eigentlich ganz gern hab so also ich seh ist ok go javascript gut hat hier mehr lasst mal aus vor rast bei kotlin gut kann ich wenigst zu sagen aber wobei ganz ehrlich ich da muss ich ich wusste eigentlich swift auch recht hoch mal alles was ich bisher von swift gesehen habe aber nicht schlecht gut power shell ist ok mys gelb hp das ist alles in ordnung save postet es mal in discord kann jeder kann jeder mal seinen seinen selbst dazu geben ja moment das ist das ist programming language tier es ist nicht zum lernen was zum lernen ist da habe ich mir hier gerade drüber ausgelassen wie gesagt ich würde peißen und javascript ganz oben hin packen zum lernen und persönliche präferenz würde ich schaap und ruby drum runter packen gerade sie schaap finde ich ist auch eine super programmier sprache zum einsteigen ich gucke an die anderen sachen durch paskal was ist mit euch was mit denen los warum ich also ich denke sie schaap ist auch eine top einstiegssprache denn der große vorteil von sie schaap gegen alle anderen die man hier sieht ist du kannst damit wirklich es gibt eigentlich nichts was du nicht machen kannst in sie schaap sei es irgendwelche low level geschichten die interop mit c sachen so ist mittlerweile auch super low level geschichten kannst du performant und schnell machen du kannst web geschichten machen du kannst server geschichten machen du kannst automatisierungsgeschichten machen du kannst muis machen du kannst du kannst in sie schaap wirklich alles machen sogar mobile apps du kannst in sie schaap wirklich einfach alles machen und ich finde da gibt es nicht viele programmier sprachen wo das gut geht und zumal sie schaap in allen bereichen auch gut ist das ist nicht so wie beispielsweise kann sie mit pisen auch theoretisch alles machen aber sobald es mal ein bisschen wums braucht bist du da halt aufgeschmissen sei du hast irgendwelche c extensions was bei sie schüchter dich der workflow ein warum also man muss sagen sie schaap hat mit abstand ihr wisst ich bin sie schaap fanboy aber das ist was da bin ich da bin ich wirklich auch überzeugt sie schaap hat mit abstand die besten developer tools da kann man microsoft halten wie man will das zeug ist wirklich gut und jetzt sogar ohne main ja guck mal wie toll die ganze autocomplete und und code assist geschichte funktioniert in dotnet und guckt euch mal an für wie selbstverständlich man das hält wenn man eine weile sie schaap dort net programmiert hat und dann guckt euch mal die liste dieser programmier sprachen an wo ist es denn ähnlich gut eigentlich bei keiner ja bei pisen nicht allein durch das dynamische geht gar nicht nimmt keine ahnung c definitiv nicht ruby definitiv auch nicht javascript definitiv nicht kotlin kann sein weiß ich nicht go auf gar keinen fall nur auch auf gar keinen fall lexie aber garantiert nicht es wird immer besser aber ist nicht mal ansatzweise am ehesten tat am ehesten tat nein c++ garantiert nicht der c++ die c++ da wo ist es alles steht hier gar nicht wo steht c++ hat so viele ecken und kanten auch im tool support vom editor zum beispiel wenn du ein callback hast mit auto return type ein auto return type ist ja in c++ nicht wirklich auto sondern es steht zur compile zeit fest die meisten editors ob es bei sea lion auch so ist weiß ich nicht die meisten editors schaffen es nicht diesen auto return type aufzulösen zu dem was es wirklich ist so und das einzige was jetzt noch ansatzweise mithalten kann was support und developer tools und sonst was angeht und und und quasi unterstützungen editor mit c sharp ist für dich ehrlich gesagt am ehesten sagen typescript noch aber das kommt nicht von ungefähr weil der c sharp erfinder oder typescript erfinder der gleiche dude ist das der gleiche typ das war c sharp war quasi anders haltsberg bevor er typescript gemacht hat und ich weiß es gar nicht ob man den wirklich so ausspricht es kommt nicht von ungefähr dass das ähnlich ist ja und ich glaube davor hat irgendwas mit paskalle gemacht oder delphi oder so riecht krasse dude ja so so viel zu tun genau und mich hat dir vorher jemand gefragt mit was würdest du als anfänger beginnen jetzt mal so als kontrast nachdem ich jetzt gerade übelst krasse scharp gelobt habe und erzählt habe wie toll dass die beste programmier sprache von allen ist anfangen würde ich tatsächlich mit javascript ich glaube javascript ist für einsteiger das motivierendste was man machen kann aktuell es gibt mit abstand die meisten tutorials kurse und und content für javascript man bekommt javascript auch super hilfe das ist für einsteiger wichtig und die natur von javascript dass es eben hauptsächlich im browser läuft ist man sieht auch direkt was also sprich man kann direkt was grafisches machen man kann direkt was machen wo man vielleicht auch mal andere leuten zeigen kann und sagen hier guck mal hab ich gemacht und die sagen cool javascript ist glaube ich für den einsteiger aktuell das motivierendste was es gibt kobol stream ja an weihnachten machen kobol moin schisi pro ja das ist also ich würde sagen wenn also wenn mich heute jemand fragt mit was soll ich anfangen und ich kann nur was ich kann nur eine sprache als antwort nehmen ohne großartig auszuholen ich dürfte nur eine sprache nennen und nicht großartig drumherum zusätzlich sagen würde ich sagen ja was kippt ansonsten würde ich das sagen was ich eben vorher vorher gesagt habe ok was was ist denn was gibt es hier unter linux was ist passiert wie sucht man hier nach neuen sachen ok also das das was haben sie als nix mehr gut meiner meinung nach ist ja ich habe vorhin schon gesagt ich habe keine ahnung ob das da vorne ist der beste ist der raspberry pi vom ganzen ökosystem drumherum er ist nicht das schnellste er ist mit sicherlich auch nicht der der sparenste oder der der kühlste aber das ökosystem um den raspberry pi macht ihn meiner meinung nach zu mit abstand wirklich mit riesem abstand besten singelbord computer zu der anderen hier kann ich auch gar nicht viel sagen hier so ein habe ich auch am start allerdings in der variante mit sata anschluss der ist auch ok krankt aber eben an support von paketen und alle möglichen nie ausprobiert ganz viele raspberry also auch nicht ausprobiert raspberry pi finde ich gibt es gar nichts großartig was man da zu erzählen muss so was was gibt sie im chat noch hallo max stimme dir zu javascript ist wohl echt am besten zum anfang ich habe damals mit cc plus plus angefangen natürlich war das eine katastrophe weil er c++ dabei ist alles mit c im namen ist wohl für den anfang sehr frustrierend ja reines c ist dann tatsächlich noch am besten wobei halt reines c langweilig zu am anfang ist du kannst ja damit nichts machen wirklich was irgendwie ein bisschen eindruck macht kennt jemand gut ressourcen zu sie schab ja du kannst also es gibt wenn du gerne bücher dir angucken willst gibt es immer noch das ist zwar von 2012 aber von den basics her ist das vollkommen ok und ist auch ganz gut geschrieben also ich finde dass es als einstieg wirklich nicht verkehrt wenn man mal wenn man was auf deutsch und in buchform haben will du musst ja auch nicht alles angucken du es reicht wenn du dir das ganze anguckst bis bis 16 bis inklusive 16 der rest ist nicht so wichtig da hat sich zwar einiges getan aber an den basics diese hier beschreiben hat sich nichts geändert das sind nur sachen dazugekommen also zum einstieg ist das hier nicht schlecht und ansonsten ist auch oftmals die sachen bei microsoft selbst auf channel 9 ist manchmal auch ganz gutes zeug dabei oder halt auf youtube ja ich denke bei so mit einem rasperi perler oder so ist spannender als das kommt ganz individuell auf die jeweiligen leute an wenn es wenn das jemand ist der gerne hardware bastelt dann ja würde ich auch sagen ja wenn es jemand ist der spaß daran hat leds blinken zu lassen oder vielleicht man irgendwie motor anzusteuern oder oder sonst wie irgendwelche sensoren auszulesen oder so dann ist es bestimmt spannender aber die meisten leute den fehlt schon mal so komplett die vorstellung was sie eigentlich machen könnten und da ist es im browser wirklich ganz gut weil im browser da kommt da kommt so eins zum anderen ja du machst dir eine webseite bastelt bis drum sagt ja ich hätte jetzt gerne vielleicht dort irgendwie in den bild und er hätte jetzt aber wenn ich da drauf klicke hätte ich gerne dass das bild fullscreen wird und so was ich glaube browser ist da zum einsteigen immer noch am besten du hast du schon basic angefangen exzellent ich habe mal einen kurs gemacht wo ich kann halt war ich da 13 oder so ne warte mal das war 98 98 war ich 14 14 den kurs gemacht wischel basic alles war das war vb 6 0 damals noch wischel basic 6 war das habe ich einen kurs gemacht mit 14 und das war schlimm im nachhinein betrachtet das war so scheiße dass wir dann zwischendrin in der pause immer half life auf den schulungsrechner gespielt haben deswegen weiß ich auch dass es 98 gewesen sein muss half life kam 98 so was max frage o was ubuntu direkt aus dem root was ja wahrscheinlich verwende es irgendwelche relativen fahnen muss dem richtigen verzeichnis sein keine ahnung wo soll ich das wissen sollte gerade noch mal die fragen durch scrollen dass ich nichts vergesse stimmt ja wo wir auch wieder beim thema sind dass du mit z sharp alles machen kannst sogar spielerentwicklung ich glaube ich habe gar nichts großartig übersehen mache ich das das ist wahr ok gut eins geht und zwei nicht keine ahnung dass das ist etwas spezifisches hier das kann ich dir nicht sagen was der da warum das nicht geht so aber memory leak wir haben kein memory leak guck mal wir sind immer noch ungefähr genauso viel mb wie vorhin also kein memory leak konfront mit den speicher hier sind wir bei 214 mb und jetzt gehen wir mal hoch 240 nein das ist ungefähr immer gleich bis der gar mit collector mal rund wir haben kein memory leak memory leak frei konfront und das bei so viel native ffm pack rumgegräbse da kann man nur sagen und es kackt auch nicht ab oder so es funktioniert einfach das läuft jetzt hier schon seit einer stunde oder so mit ein paar videos macht die ganze objekterkennung und er erkennt den gaul immer noch nicht aber darauf ist auch nicht trainiert aber was haben die sonst noch für questions übrigens leute morgen geht zum zahnarzt ich habe keinen bock zum zahnarzt zu gehen ich sponks so was haben wir hier sonst noch für sachen best 3d game engines ok kann ich nichts zu sagen kann ich mich nur mit aus beste git clients ok da kann ich was zu sagen gar keiner davon alles kacke braucht man nicht kommando zeile beste alles müll alles weg nur git kommando zeile das einzig wahre alles alles wegschweißen hier alles kacke braucht man nicht das muss ich mir jetzt an sekunde wartet mal ich mach das mal hier lieber im browser in der vm ich weiß nicht wo ich da rauskommen das sieht aus wisst ihr was das sieht aus wie einen elektron gui das ist das bestimmt elektron meinte nicht auch welche sprache auch das ist eine gute frage da muss ich mir gedanken zu machen welche sprache kopiere ich mir mal welche sprache sollte man für 2021 auf dem schirm haben da muss ich mir gedanken zu machen aber das bestimmt elektron hier das kommt mir nicht in die tüte alle git guis brauchen wir nicht git guis overrated jebaited brauchen wir nicht alles überflüssig ganz einfach beantwortet was sind die besten java script idees or editors wishlist studio code webstorm ja webstorm vielleicht webstorm habe ich nie großartig ausprobiert nur mal kurz hier im stream war okay war okay aber ehrlich gesagt es bei mir lässt jetzt wishlist studio code was javascript angeht wenig wünsche offen atom geht bestimmt auch gut neowim das schöne an javascript ist dass viele sachen quasi unab editor unabhängig sind an tools die muss man quasi dann nur indem wir mal den editor ordentlich einbinden bei mir ist code sagt die autocompletion echt ich habe mich bei javascript quasi schon dran gewöhnt dass es quasi kein autocompletion gibt ne man muss keine doch natürlich muss man geld ausgeben also ich empfehle natürlich selbstverständlich niemandem hier die trial version zu verwenden also kauft es euch ja so so pleite mit der brackets vielleicht sollte ich mal webstorm wieder ausprobieren wisst ihr was wenn wir gerade dabei sind wenn wir gerade dabei sind wenn es denn ihr einfach mal wieder eine runde webstorm warum nicht probiere ich die nächsten tage mal aus mal gucken ob ich damit jetzt irgendwie den vorteil erkenne oder so weil optisch sieht das ja genauso aus wie die ganze andere in jetbrains geschichten warum hat die warum hat die toolbox jetzt einfach 90 prozent cpu last verursacht ja natürlich drakula was sonst jetzt ember gibt es das überhaupt noch ok es sieht es sieht im prinzip aus wie ganz normales jetbrains gedöns wow wie er erst mal 30 milliarden sachen anlegt sieht aus wie ganz normales jetbrains gedöns ja ach so stimmt ich habe hier npm gar nicht installiert lull ich hab hier jahren installiert muss ich mir die tage mal angucken so was was haben wir noch so für listen hier zeige ich mal her ok was was für ein ding best productivity enhancing well-designed and concise rather than just was für ein ding also was was quasi big brain programmiersprachen sind oder was ist die frage also was ist die bigste die bigste welche programmiersprache hat das größte hirn oder was ist das für eine frage hier ok keine ahnung ich kann zu nimm überhaupt nichts sagen zu smalltalk auch nicht außer dass glaube ich viele klammern hat rast ist wirklich nice rast ist wirklich nice aber rast ist exploding brain bis man da halbwegs durchblickt es ist ok schieben closure das ist für die ganzen klammer fettig ist die die überall die wirklich jede arten von klammern die die tastatur her gibt verwenden wollen und die möglichst noch einander geschachtelt endlich mal hier die scharfe würde ich da auch ganz weit oben ansehen ruby auch naja gut wann ist die jetzt liste jetzt nicht das ist eine gute frage was sind die besten window manager für linux i3 gefolgt von dwm x-monat openbox awesome fluxbox was zum teufel herbstluft oder das habe ich mal vor jahren irgendwo gelesen enlightenment gala was ist gala überhaupt ja also ich muss sagen ja stimme ich voll und ganz zu die drei beste aus dem grund habe ich ja selbst nur noch die drei überall ops doch zwei ist auch dabei aber weyland ist zu niche was youtube die ls wieder back war youtube die ls back leute auf github youtube ls back kein d d m c c d c m a d m c a wie kommts wie kommts dass es wieder da ist ja ok wir müssen jetzt mal ein bisschen andere kermi musik machen also github stellt youtube die l wieder her dass das schritt excellent satz golem das schritt ist wohl dem github chef und der eff zu verdanken was ist denn die eff was das hier war das problem hier gucken wir gleich youtube was ist wer ist was ich weiß nicht was die eff ist elektronik frontier foundation was für dinger für was für welche für welche grenzen sind die zuständig okay haben sie wieder hergestellt nice ok das war das problem remove copyright media from tests moment moment das ist das gar nicht das da ist doch einfach nur den download link drinnen in den test das kann doch den download link auf youtube ist illegal aha ok das wird eigentlich das wird auch so ausgelegt wie es gerade passt alle nice nice das ist aber überhaupt nicht also die sagen ja hier die sagen ja hier ok das hier war wohl das problem und deswegen wurde es runter genommen ich wette mit euch leute die haben youtube die l down genommen weil es youtube die l an sich nicht mögen ja weil sie nicht mögen dass man youtube videos runterladen kann deswegen haben sie youtube die l down genommen und das hat dann so einen wind gemacht dass sie sich gedacht haben auf fack damit haben wir jetzt nicht gerechnet wir schieben jetzt da mal was vor woran es gelegen hat und wenn sie das entfernen können sie wieder online gehen die haben garantiert diese vorwand gesucht um youtube die l down zu nehmen aber man hat ja gesehen dass es nicht funktioniert hat übrigens wisst ihr was noch was viel lustiger war in dem offiziellen dcma dmc dns repo von github haben die einen bug ausgenutzt den github schon seit ein paar jahren kennt aber nicht fixen wollte um einen kommentar in einem issue den kompletten youtube die l sourcecode anzuhängen also sie haben quasi in dem repo wo die copyright strikes gesammelt werden wenn man so will die den sourcecode der copyright strike wurde noch mal angehängt über eine sicherheitslücke aufgetan also dir versteht kein spaß aber gott sei dank ist das ding wieder da youtube tl beste und wisst ihr was man da auch wieder wunderbar sieht so was stört ein open source projekt nur teilweise die software ist weiterhin da weiterhin verfügbar es gibt nicht eine quelle die man ausschalten muss und das programm ist weg es gab 30 millionen mirros auf der welt ja also wunderbar ja was youtube die l ist ja ein programm wo man youtube videos mit runterladen kann in unterschiedlicher qualität mit diesem programm beispielsweise auch dieses testvideo runtergeladen von youtube wo ich gerade teste ob ich memory leaks in meiner anwendung aber sieht nicht so aus so da bin ich froh dass youtube wieder da ist das ist sehr sehr nice exzellent ja hier stimme ich zu i3 wm bester window manager gibt es nix beste linux terminal emulator ok da kann man sich jetzt auch drüber streiten best keyboards schwer zu sagen weil was kostet das was wollen die ernsthaft 642 oder ich weiß auch gar nicht so viel ist doch gar nicht so viel exzellent ist das ihr habt das gehört exzellent ok ich glaube die preise sind nicht so ganz realistisch damit würde ich im leben nicht programmieren damit komme ich nicht klar also damit würde ich definitiv nicht klarkommen ich weiß guckt euch das ding mal an was ist das das sieht aus als hat sich einer auf die tastatur gekniet als hat als hat der der fliesen leger die tastatur als untersetzer genommen so sieht das aus ich kann mich nicht vorstellen dass ich das als wahnsinnig ergonomisch empfinden würde du findest doch die tasten gar nicht wieder du greifst du greifst von der tastatur weg an die maus und brauchst erst mal einen halben tag bis du wieder die tastatur gefunden hast das kann ich nicht mit arbeiten ist meine ducky ducky skyline dabei lull der supercoder 2000 was denn der supercoder 2000 beste tastatur allzeit dann 0 1 mehr braucht man nicht besser das ist fast so gut wie diese steuerung alt entfernen tastatur wie für windows best cloud idees verwende ich nicht kann ich nichts zu sagen ok die fragen wiederholen sich ja sehe ich auch so manch auch nach was kann man was haben die da sonst noch für sachen popular text pc und dann ok development nach rekommend recommendations mai sql guise who cares was interessiert mich mal sql guise beste launcher ich habe eigentlich nur in move und nova launcher am start was gibt es bei pc best voice chat for gaming naja aufgrund der verbreitung würde ich tatsächlich sagen discord ts 3 der chat wieder aber verbreitungsmäßig ist discord einfach nicht zu toppen aktuell ok das jetzt soll ich soll ich ihr best best software also was haben wir denn hier zu bieten element nee bestimmt nicht mummel das habe ich früher verwendet ab und zu weil es quasi so eine art open source teamspeak war aber letztendlich ich verwende hauptsächlich discord in letzter zeit gut das sagt tatsächlich nix über die voice qualität von discord aus nur weil jeder discord verwendet aber es zumindest muss discord ja irgendwie diese verbreitung gefunden haben ja also discord muss zumindest sachen machen die die leute haben wollen aber als kostenloses teamspeaks auch kostenlos die meisten leute mieten sich ja kein teamspeak server discord hat auch die vorteile dass die als erster angefangen haben oder zumindest als erster brauchbare so eine komplett lösung aus chats channels anrufen voice calls und eben letztendlich voice chat zu machen was discord scannt den kompletten pc ab ist das wirklich so anzeige ist raus aber macht das discord ja naja natürlich nicht naja natürlich nicht tja alle sind so halt scharf auf das zeug ne ist es macht das discord auch wenn discord aus ist oder nur wenn discord an ist weil der neueste trend ist ja dass software auch wenn sie eigentlich aus ist doch noch an ist und was macht das discord das beste ja sehe ich auch so keepers beste habe ich auch seit jahren am start gibt's eigentlich nix zu sagen gut ich glaube jetzt haben wir die meisten interessanten sachen durch best audio player also chat ich hab das letzte was ich verwendet hab ist fubar 2000 und das ist auch schon fünf jahre her oder so über 2000 und ansonsten wenn ich keine audio player ich verwende vlc ja vlc um alle möglichen aber ansonsten wenn ich musik hören mache ich das entweder über amazon prime oder also da habe ich ja ich habe ja dings gekauft dieses ultimate ding was eigentlich bescheuert war ich hätte mir lieber spotify kaufen soll entweder höre ich auf youtube oder auf amazon so direkt in einem player offline habe ich eigentlich kaum noch was wie hieß diese seite gerade die taucht öfters mal in den suchbegriffen oben auf mit bescheuerten vergleichen also die seite hat sich bei mir bisher nicht gerade mit irgendwie sonderlicher vorgetan durch hochwertige sachen aber das ja war jetzt doch mal ganz nett sich das anzugucken tja leute haben uns das auch angeguckt ich schau mal kurz in mein text dokument ob ich noch irgendwas los werden wollte wir haben ja noch zeit ist ja noch ist ja nicht so dass ich jetzt gleich auf muss also zumindest eine sache können wir uns schon mal sicher sein memory leaks haben wir keine sonst wäre der ganze kram jetzt schon längst bei irgendwie frag mich nicht 500 mb und würde auch nicht immer wieder hoch und runter gehen also das ist zumindest schon mal klar memory leaks haben wir keine das schon mal nice wieder zu auch zu zu zu wieder rückgängig zack und den aus also keine memory leaks konform schon mal gut ich würde sagen in einem der nächsten streams erweitern wir das dann endlich mal drum dass man aufnehmen kann ich habe damit schon ein bisschen rumgespielt aber ich habe noch keine wirklich schöne lösungen dazu gefunden ob jemand aber im stream auf dass man die sachen nicht nur abspielen kann sondern auch aufnehmen kann und ich meine was richtig cool ist wenn man dann was richtig cool ist wenn man dann hier die objekterkennung hat das macht den voll fertig jetzt aber wenn man die objekterkennung hat dann kann man quasi eine aufnahme triggern wenn der person in der webcam erkennt und ich habe mir das so überlegt also wenn man eine person in der webcam erkennt dann triggert der eine aufnahme für 30 sekunden allerdings rückwirkten zehn sekunden also sprich ich muss im hintergrund immer einen zehn sekunden buffer mit laufen lassen dass ich das nachträglich aufnehmen kann so und dann triggert einfach jede weitere motion erkennung die in dieser zeit triggert erweitert die sache um 30 sekunden sonst hat man ja auf einmal wenn mal einer durchs bild läuft oder mal öfters einer durchs bild läuft hat man auf einmal 50 files das kann man triggern so und dann man kann manuell triggern man kann über den timer triggern die aufnahme oder man kann sie über motion beziehungsweise objekte detection triggern würde ich sagen das wird einem der nächsten streams mal ausprobieren wieso lieber spotify weil prime musik die hälfte aus meinen playlists immer removed ich habe ich habe beispielsweise relativ lange ärzteplaylist und da fehlen regelmäßig sachen drin die werden dann zwar wieder hinzugefügt nach ein paar wochen aber dass sie haben intern andere ids und dann muss ich wieder die sachen neu hinzufügen total bescheuert was was programmiert sogar heute gar nichts wir haben ich habe hier nur was offen um zu testen ob ich memory leaks habe ich habe was gewasselt wo du deine webcam in browser streamen kannst ich habe jetzt testweise mein youtube in den youtube videos genommen zum streamen du kannst deine webcam im browser streamen lassen mit so gut wie keiner verzögerung und kannst quasi noch sachen erkennen lassen auf dem bild das ist jetzt nur der der der stress test ob das wirklich funktioniert man sieht dass er da ein bisschen überfordert ist mit mit anderen sachen funktioniert viel besser wenn man hier zum beispiel einzelne leute drauf hat und so genau und dann kannst du das auch aufnehmen lassen dass das nächste was ich machen will das wichtigste ist erstmal dass du die webcam latency frei in den browser bekommst und dass du jetzt angucken kannst von jedem x beliebigen browser egal ob das jetzt safari unter ios ist oder windows und es ist wirklich nahezu latency frei wir haben es letztens im stream ausprobiert natürlich kommt es auf die kamera an ja wenn die kamera an sich den stream erst mit 15 sekunden verzögerung ausgibt da kann ich auch nichts machen und dann haben wir im letzten letzten durchgang haben wir diese object erkennung eingebaut das ist jetzt relativ schlecht zu erkennen ich mache das gerade mal aus und starte das mal mit einem anderen stream ich starte das mal mit hier hier plupp 2 ts da erkennt man das besser das ist so ein fitness video was runter gelernt da sieht man auch dass die dass die object erkennung wirklich besser funktioniert funktioniert besser also der erkennt den du hier auch immer und er weiß dass es eine person ist das eigentlich ziemlich nice ja und ich habe fitness videos von youtube genommen weil fitness videos ist ein super super test um zu gucken ob ob er auch erkennt wo eine person anfängt und eine person aufhört excellent aber ich darf mich da nicht zu sehr damit rühmen dieses ob also diese object erkennung habe ich nicht selber also nicht komplett selber programmiert da verwende ich was fertiges für und spreche das nur an machine learning ist langsam echt krass ok was ist das was hat es jetzt mit machine learning zu tun oder kommt es jetzt noch oder was macht er da ist ein ipad oder was ist das was da da hat irgendein ultra fettes ach das fährt von alleine ach das fährt von alleine oder hat er einfach nur die hand am lenker wisst ihr warum ich warum ich glaube dass das dass ich als dass ich das komisch anfühlt also warum ich da probleme mit hätte mit diesem konzept von selbstfahrendem auto und zwar weil ich wahrscheinlich also ich muss ja eigentlich noch auf den straßenverkehr achten weil ich muss ja immer noch eingreifen können aber dadurch dass ich nicht permanent was mache bin ich überhaupt nicht mehr richtig aufmerksam und gucke ob was ist und im ernstfall wenn das wirklich wenn ich wirklich eingreifen müsste würde ich wahrscheinlich dann nicht reagieren weil ich die letzte halbe stunde nichts machen musste aus wie würde ich den tesla fleschen erstmal genau also das stelle ich mir zumindest für mich problematisch vor ok bis wohin soll ich jetzt gucken ich kann mir jetzt ja nicht die 24 videos angucken wie die straße fährt ja da kann schon mal sein dass du nicht losfahren kannst mit deinem auto weil es erstmal software update machen muss ich mein cool ist das mit dem fetten tablet schon da vorne ist ja vor wie ein flugzeug ich habe ein auto ja aber also wenn du das hier jetzt als auto siehst dann geht meins wahrscheinlich nicht als auto durch ich bin mir aber noch unschlüssig ob selbstfahrende autos wirklich die zukunft sind ich sehe die zukunft eigentlich eher dass er darin dass autos weniger nötig sein werden durch ändern durch durch umstände die sich ändern durch bessere öffentliche verkehrsmittel werden in deutschland natürlich nicht hinbekommen weil öffentliche verkehrsmittel hier ist ja eh so null w immer sehr gut der konter dankeschön exquisite subscription drei monate huge moment doch prime was es hat hier mal ein unfall gebaut weil er die geschwindigkeit vom scheibenwischer über das tablet geändert hat im tesla deswegen war er schuld hätte man besser selbst gefahren ja aber so ein auto werde ich mir in nächster zeit nicht kaufen ich fahre so selten und wenn ich fahre tut es mein alles ding auch noch baumi 137 drei monate dankeschön für den zapp messer subscription huge gibt ja leute sind so voll voll drinnen was neue autos angeht und tuning und zig sachen und upgrades und dinger und gedöns und ich muss euch ehrlich sagen es ist mir so wurscht es ist also autos ist ein thema also ich meine es gibt ja viele männer die sich total für autos interessieren ich muss sagen autos ist so ein thema es ist mir sowas von egal ich finde das so langweilig dann flashe ich lieber steckdosen leisten was ist deine meinung zu unity media als dsl bieter meine meinung ist dass unity media nicht mehr gibt die media gibt es nicht mehr guck unity media.de gibt es nicht mehr kommt jetzt mal vodafone raus ist jetzt vodafone seit einem halben jahr oder so hast du erfahrung mit den mikrotik access points nee aber die technischen specs wo ich damals mich hier entscheiden musste für was ich als access point nehme haben mir nicht gefallen die meisten mikrotik dinger für daheim die erschwinglich waren hatten damals wo ich geguckt habe hier auch für das haus hatten nur 2,4 gigahertz also das nope ich glaube die mikrotik access points sind auch nicht so wahnsinnig geil was ich gut finde sind halt die low price mikrotik switch und router was ist das nochmal ein tesla video und was sagt mir das jetzt dass er gebremst hat und nicht in die seite gefahren ist aber der erkennt das gut dass ein selbstfahrendes auto nicht von der straße abkommt und rennt und brennt oder du meinst er erkennt dass deine kurve ist andere gute ap außer unify ist ja auch schwer zu sagen ich hab nur noch unify kisten ach der lernt das automatisch ja ok verstehe ehrlich gesagt keine ahnung ich hab damals als ich hier ein bisschen abgecrayt hab ich hatte ja davor so ganz billigen tp link access point rumstehen der es auch irgendwie getan hat ja aber schön war das damit nicht danach habe ich mir zwei unify access points hingestellt erst unten ein und dann hier oben noch ein bisschen später und seitdem bin ich rund um zufrieden was das ding an wlan abdeckung bringt was empfiehlst du für business umfeld als mit shooter da kann ich dir leider nichts empfehlen ich bin kein profi irgendwie netzwerktechniker der das da der was öfters business bereich macht keine ahnung kann ich den x großartig empfehlen eigentlich so grafikkarten und und dps not in stock da habe ich mir fast gedacht da brauche ich mir vielleicht dieses jahr doch kein neuen pc aber meiner reicht ja noch was meinste zu dem router jetzt box also rein als router nicht so geil aber als multifunktionsgerät schon 5094 fiber sagt mir nix mit direkt mit glasfaser anschluss ok den das problem ist glaube ich nicht der router sondern so ein anschluss in deutschland zu informieren ich benutze seit drei jahren home assistant und das ist halt eher die du das ist ein schweizer shop ja ok in der schweiz gibt es ja sowas hier haben wir sowas ja nicht ja wir haben jetzt übrigens ein super projektfoto drinne hier beste das sieht so schlecht aus so schlecht aus übrigens keck das ist ein bisschen schnell oder jetzt das keck läuft auch noch in noch in langsam viel zu schnell aber was ist mit euch los ich wollte es nämlich in mein bord rein machen aber das sieht so schlecht aus zu geil warum ist das github user content das ist ein im im im im gure bild das ist warum ist das ein link zum zu github ja das ist ein guter keck keck wähler das brauche save s muss man nämlich noch hinzufügen das brauche hallo browser nicht abkacken please oder ganz schön pixelig der ist nicht so pixelig der besser also der ist aber dafür ist der animiert ja passt ab und zu mal dass man bisschen variieren kann zwischen dem den uns dem und dem und ich habe ja so viele lulli modes übersehen also lulli ist eh besser besseres keck wehe okay wisst ihr was chat ich gehe jetzt auf macht's gut wir sehen uns beim nächsten stream bis deren ziel", "segments": [{"id": 1, "start": 90.0, "end": 118.76, "text": "So, exellent war das!"}, {"id": 2, "start": 118.76, "end": 120.76, "text": "Massive!"}, {"id": 3, "start": 120.76, "end": 122.76, "text": "Huge!"}, {"id": 4, "start": 122.76, "end": 124.76, "text": "Ähm..."}, {"id": 5, "start": 124.76, "end": 126.76, "text": "Ah, so viele leute schon am da!"}, {"id": 6, "start": 126.76, "end": 128.76, "text": "Wer ist denn hier am da?"}, {"id": 7, "start": 128.76, "end": 130.76, "text": "Wer ist am start?"}, {"id": 8, "start": 130.76, "end": 132.76, "text": "Der Kengin ist da, der Real Renax ist da, Serious Max ist am start"}, {"id": 9, "start": 132.76, "end": 134.76, "text": "Skillkiller1337"}, {"id": 10, "start": 134.76, "end": 136.76, "text": "xDxDxDxDxDxD"}, {"id": 11, "start": 136.76, "end": 158.76, "text": "xDxDxDxDxDxD Exact, so sieht es aus!"}, {"id": 12, "start": 158.76, "end": 161.76, "text": "Ähm, ich muss mal kurz mein Headset noch mal schnell einführen."}, {"id": 13, "start": 161.76, "end": 190.76, "text": "So, soll ich euch mal was erzählen?"}, {"id": 14, "start": 190.76, "end": 199.76, "text": "Ich muss jetzt noch genau morgen und übermorgen arbeiten, dann hab ich das restliche Jahr über frei."}, {"id": 15, "start": 199.76, "end": 202.76, "text": "Pog, oder?"}, {"id": 16, "start": 202.76, "end": 204.76, "text": "Findet ihr den nicht auch?"}, {"id": 17, "start": 204.76, "end": 208.76, "text": "Das ist richtig Pog."}, {"id": 18, "start": 208.76, "end": 212.76, "text": "Wie gesagt, das ist der französische Poggers."}, {"id": 19, "start": 212.76, "end": 214.76, "text": "Da reicht der normale immer für."}, {"id": 20, "start": 214.76, "end": 219.76, "text": "Ganzes Jahr keinen Urlaub gemacht, doch zwei Tage oder so."}, {"id": 21, "start": 219.76, "end": 225.76, "text": "Nee, nee, nee, nee, das hast du nicht verhört, das ist das restliche Jahr."}, {"id": 22, "start": 225.76, "end": 231.76, "text": "Oh, ich soll vielleicht das Afklo wegmachen."}, {"id": 23, "start": 231.76, "end": 234.76, "text": "Weil ich bin ja gar nicht mal Afklo."}, {"id": 24, "start": 234.76, "end": 239.76, "text": "So sieht's aus."}, {"id": 25, "start": 239.76, "end": 250.76, "text": "Schauen wir mal eine V-M kurz an."}, {"id": 26, "start": 250.76, "end": 254.76, "text": "Ich weiß noch nicht so genau, was wir heute machen."}, {"id": 27, "start": 254.76, "end": 255.76, "text": "Sollen wir mal schauen."}, {"id": 28, "start": 255.76, "end": 258.76, "text": "Es hatte im Discord einer eine gute Idee."}, {"id": 29, "start": 258.76, "end": 262.76, "text": "Ich soll mal hier ein bisschen rumgucken, um einen Senf zu ablassen."}, {"id": 30, "start": 262.76, "end": 268.76, "text": "Senf zu ablassen mach ich natürlich immer gerne."}, {"id": 31, "start": 268.76, "end": 272.76, "text": "Das sind wohl irgendwelche Umfragen zu, frag mich nicht, Zeug."}, {"id": 32, "start": 272.76, "end": 275.76, "text": "Oder kann ich mal meinen Senf, oh, oh, wenn ich das schon sehe."}, {"id": 33, "start": 275.76, "end": 278.76, "text": "What are the best text editors?"}, {"id": 34, "start": 278.76, "end": 281.76, "text": "Oh je, das wird, das weiß ich nicht, ob ich mich dazu jetzt auslassen soll."}, {"id": 35, "start": 281.76, "end": 285.76, "text": "Das wird wieder, ich hoffe da ist keine Frage, was ist die beste Programmiersprache."}, {"id": 36, "start": 285.76, "end": 289.76, "text": "Und ich hoffe, wenn es die Frage gibt, oh fuck, die gibt's."}, {"id": 37, "start": 289.76, "end": 293.76, "text": "Okay, ist kein C++ dabei."}, {"id": 38, "start": 293.76, "end": 296.76, "text": "Sonst, sonst hätte ich jetzt anfangen müssen, Leute."}, {"id": 39, "start": 296.76, "end": 300.76, "text": "Wenn da C++ dabei gestanden hätte, wäre vorbei gewesen."}, {"id": 40, "start": 300.76, "end": 303.76, "text": "Okay, ja, da kann ich wirklich meinen Senf gleich zu haben."}, {"id": 41, "start": 303.76, "end": 306.76, "text": "Was ist Löwe?"}, {"id": 42, "start": 306.76, "end": 309.76, "text": "Und warum ist da nicht Unity vorne?"}, {"id": 43, "start": 309.76, "end": 311.76, "text": "Wenn es der verbreitet..."}, {"id": 44, "start": 311.76, "end": 316.76, "text": "Okay, also was weiß ich C++ programmieren kann für mich schon mal nicht vorne sein."}, {"id": 45, "start": 316.76, "end": 318.76, "text": "Okay, gut."}, {"id": 46, "start": 318.76, "end": 321.76, "text": "Also, was wollte ich jetzt sagen?"}, {"id": 47, "start": 321.76, "end": 324.76, "text": "Genau, ich mach mal kurz meine V-M an."}, {"id": 48, "start": 324.76, "end": 328.76, "text": "Übrigens, ich hab mir mal wieder was zum Flaschen gekauft."}, {"id": 49, "start": 328.76, "end": 331.76, "text": "Wo wir gerade dabei sind."}, {"id": 50, "start": 331.76, "end": 334.76, "text": "Jeden Tag aufsteh streamen bis zum Neujahr."}, {"id": 51, "start": 334.76, "end": 338.76, "text": "Naja, ich hab ja eigentlich gesagt, ich mach im Dezember wieder ein paar Videos."}, {"id": 52, "start": 338.76, "end": 345.76, "text": "Und wenn ich jetzt jeden Tag aufwach streamen mach, dann kann ich ja keine Videos machen."}, {"id": 53, "start": 345.76, "end": 346.76, "text": "Das geht gar nicht so einfach."}, {"id": 54, "start": 346.76, "end": 351.76, "text": "Ich mein, der Tag hat auch nur 24 Stunden."}, {"id": 55, "start": 351.76, "end": 353.76, "text": "Was ich im Urlaub machen werde, also was ich mir vorgenommen hab."}, {"id": 56, "start": 353.76, "end": 357.76, "text": "Eine Sache ist, also ich mach erstmal Videos."}, {"id": 57, "start": 357.76, "end": 359.76, "text": "Ich mach wieder Videos, wir machen mehr Streams."}, {"id": 58, "start": 359.76, "end": 364.76, "text": "Und ich werde mich diesmal wirklich zusammenreißen."}, {"id": 59, "start": 364.76, "end": 368.76, "text": "Weil ja auch im Stream schon ein paar gesagt haben, sie wollen das mal ausprobieren."}, {"id": 60, "start": 368.76, "end": 372.76, "text": "Und sie finden das ist eine richtig gute Idee, sowas zu programmieren."}, {"id": 61, "start": 372.76, "end": 376.76, "text": "Ich werde mich diesmal zusammenreißen und den Scheiß nicht wieder nach zwei Wochen einstellen."}, {"id": 62, "start": 376.76, "end": 381.76, "text": "Und zwar, ich werde das so weit wie es geht fertig basteln."}, {"id": 63, "start": 381.76, "end": 384.76, "text": "Wenn ich weiß, was es ist, kann ich es gleich nochmal zeigen."}, {"id": 64, "start": 384.76, "end": 389.76, "text": "Das ist ein Programm, das Webcams in den Browser streamt."}, {"id": 65, "start": 389.76, "end": 393.76, "text": "Normaler RTSP Webcams, Securitycams in den Browser streamt."}, {"id": 66, "start": 393.76, "end": 399.76, "text": "Man die Streams aufnehmen kann und die Object Detection macht, dass man sieht."}, {"id": 67, "start": 399.76, "end": 400.76, "text": "Kann ich euch gleich mal zeigen."}, {"id": 68, "start": 400.76, "end": 402.76, "text": "Ich hab nämlich vorhin was gepusht, wie ihr seht hier."}, {"id": 69, "start": 402.76, "end": 406.76, "text": "Guck, vor 15 Minuten hab ich was gepusht."}, {"id": 70, "start": 406.76, "end": 411.76, "text": "Genau und was ich euch, also ich finde das ist ein äußerst Aussagekräfte."}, {"id": 71, "start": 411.76, "end": 414.76, "text": "Also besser als Monarch S kann man das."}, {"id": 72, "start": 414.76, "end": 419.76, "text": "Da mach ich mir übrigens, für Monarch S hab ich schon eine super Idee für ein Logo."}, {"id": 73, "start": 419.76, "end": 420.76, "text": "Für dieses Programm."}, {"id": 74, "start": 420.76, "end": 423.76, "text": "Also wir nehmen einfach Monarch S."}, {"id": 75, "start": 423.76, "end": 425.76, "text": "Hallo?"}, {"id": 76, "start": 427.76, "end": 430.76, "text": "Wir nehmen einfach das hier."}, {"id": 77, "start": 430.76, "end": 432.76, "text": "Wir nehmen einfach das hier."}, {"id": 78, "start": 432.76, "end": 435.76, "text": "Und machen da eine Kamera drum."}, {"id": 79, "start": 435.76, "end": 443.76, "text": "Es gibt sicher ein Free Stock Photo Camera."}, {"id": 80, "start": 443.76, "end": 448.76, "text": "Und das wird ein richtig megaschlechtes Projektbild."}, {"id": 81, "start": 448.76, "end": 452.76, "text": "So was und dann kommt da ein Monarch S vorne rein oder so."}, {"id": 82, "start": 456.76, "end": 457.76, "text": "So irgendwas in der Richtung."}, {"id": 83, "start": 457.76, "end": 458.76, "text": "Transparent."}, {"id": 84, "start": 458.76, "end": 461.76, "text": "So was hier, genau."}, {"id": 85, "start": 461.76, "end": 462.76, "text": "Guckt hier."}, {"id": 86, "start": 462.76, "end": 466.76, "text": "Das machen wir jetzt mal mit meinen krassen Grafik Skills."}, {"id": 87, "start": 466.76, "end": 469.76, "text": "In, ne, äh, äh, Foto."}, {"id": 88, "start": 469.76, "end": 472.76, "text": "Ne Design, Design."}, {"id": 89, "start": 472.76, "end": 476.76, "text": "Das machen wir mit meinen krassen Grafik Skills auf."}, {"id": 90, "start": 476.76, "end": 482.76, "text": "Also ich kann mir tatsächlich vorstellen, dass das Programm, wenn ich da, wenn ich"}, {"id": 91, "start": 482.76, "end": 485.76, "text": "mich wirklich mal dran seh, das ist was für mich."}, {"id": 92, "start": 485.76, "end": 489.76, "text": "Das Programm, wenn ich da, wenn ich mich wirklich mal dran seh, das ist was, was viele"}, {"id": 93, "start": 489.76, "end": 490.76, "text": "brauchen."}, {"id": 94, "start": 490.76, "end": 496.76, "text": "Es gibt, es gibt kaum gescheite, äh, Überwachungs, also Software für Überwachungskameras im"}, {"id": 95, "start": 496.76, "end": 497.76, "text": "privaten Bereich."}, {"id": 96, "start": 497.76, "end": 501.76, "text": "Die auf dem Raspberry Pi Performance läuft und ein paar advanced Features hat."}, {"id": 97, "start": 501.76, "end": 502.76, "text": "Gibt's kaum."}, {"id": 98, "start": 502.76, "end": 510.76, "text": "So, jetzt mach ich euch, pass mal auf, ich mach jetzt mal ein super, super krasse, ähm,"}, {"id": 99, "start": 510.76, "end": 511.76, "text": "Copy Image."}, {"id": 100, "start": 511.76, "end": 512.76, "text": "Bam."}, {"id": 101, "start": 512.76, "end": 513.76, "text": "Ihh."}, {"id": 102, "start": 513.76, "end": 518.76, "text": "Warum, warum kopiert der, der F-Image."}, {"id": 103, "start": 518.76, "end": 520.76, "text": "Ja, genau."}, {"id": 104, "start": 520.76, "end": 527.76, "text": "Jetzt machen wir mal Projekt, jetzt machen wir mal Projektbild, ganz, ganz, nicht Camera."}, {"id": 105, "start": 527.76, "end": 528.76, "text": "Hä?"}, {"id": 106, "start": 528.76, "end": 529.76, "text": "Cam?"}, {"id": 107, "start": 529.76, "end": 532.76, "text": "Hab ich, hä?"}, {"id": 108, "start": 532.76, "end": 543.76, "text": "Hä?"}, {"id": 109, "start": 543.76, "end": 544.76, "text": "Windows, wo ist es?"}, {"id": 110, "start": 544.76, "end": 546.76, "text": "Muss ich da jetzt erst F5 drücken, oder was?"}, {"id": 111, "start": 546.76, "end": 549.76, "text": "Da ist es."}, {"id": 112, "start": 549.76, "end": 553.76, "text": "Alter, ist das hängen geblieben, ähm."}, {"id": 113, "start": 553.76, "end": 554.76, "text": "Windows Logik."}, {"id": 114, "start": 554.76, "end": 555.76, "text": "So, so machen wir da jetzt."}, {"id": 115, "start": 555.76, "end": 556.76, "text": "Das da."}, {"id": 116, "start": 556.76, "end": 560.76, "text": "Und jetzt brauchen wir noch nen Monarch S Transparent."}, {"id": 117, "start": 560.76, "end": 567.76, "text": "Und dann ist das Logo exzellent fertig."}, {"id": 118, "start": 567.76, "end": 571.76, "text": "Oh, hier, den da."}, {"id": 119, "start": 571.76, "end": 574.76, "text": "Am besten auch noch schön skalieren."}, {"id": 120, "start": 574.76, "end": 577.76, "text": "Oh, den hab ich da schon."}, {"id": 121, "start": 577.76, "end": 580.76, "text": "Sogar ein PNG, was haben wir denn hier?"}, {"id": 122, "start": 580.76, "end": 583.76, "text": "Guck mal, da ist er noch."}, {"id": 123, "start": 583.76, "end": 584.76, "text": "So."}, {"id": 124, "start": 584.76, "end": 586.76, "text": "Ist das nicht ein exzellentes Logo?"}, {"id": 125, "start": 586.76, "end": 590.76, "text": "Wir können den jetzt auch ein bisschen croppen oder so."}, {"id": 126, "start": 590.76, "end": 592.76, "text": "So, und das jetzt als Icon machen."}, {"id": 127, "start": 592.76, "end": 593.76, "text": "Oh, fuck."}, {"id": 128, "start": 593.76, "end": 596.76, "text": "Äh."}, {"id": 129, "start": 596.76, "end": 600.76, "text": "Das ist doch das beste Projektlogo aller Zeiten, oder?"}, {"id": 130, "start": 600.76, "end": 605.76, "text": "Ist das schlecht, Alter?"}, {"id": 131, "start": 605.76, "end": 607.76, "text": "Exzellent."}, {"id": 132, "start": 607.76, "end": 608.76, "text": "Okay, wir können das noch."}, {"id": 133, "start": 608.76, "end": 611.76, "text": "Ich, ich hab schon ewig, ich, man merkt, dass ich keine Thumbnails mehr gemacht hab."}, {"id": 134, "start": 611.76, "end": 613.76, "text": "Ich hab vergessen, wie es geht."}, {"id": 135, "start": 613.76, "end": 616.76, "text": "Moment, wie, wie, wie?"}, {"id": 136, "start": 616.76, "end": 621.76, "text": "Moment, wie, wie beschneide ich den Kram denn jetzt noch mal hier?"}, {"id": 137, "start": 621.76, "end": 631.76, "text": "Äh, ich hab's, ich hab's komplett vergessen, wie es geht."}, {"id": 138, "start": 631.76, "end": 632.76, "text": "Nee."}, {"id": 139, "start": 632.76, "end": 636.76, "text": "Und wie ging das jetzt noch mal?"}, {"id": 140, "start": 636.76, "end": 639.76, "text": "Ah."}, {"id": 141, "start": 639.76, "end": 643.76, "text": "Siehst du mal, Qualität, Alter."}, {"id": 142, "start": 643.76, "end": 645.76, "text": "Ist das nicht geil?"}, {"id": 143, "start": 645.76, "end": 647.76, "text": "Das ist doch mal das beste Projekt."}, {"id": 144, "start": 647.76, "end": 651.76, "text": "Normalerweise wollte ich das hier neben noch abschneiden, aber ich bin gerade zu dumm, den Knopf dafür zu finden."}, {"id": 145, "start": 651.76, "end": 653.76, "text": "War das nicht das Corner Tool?"}, {"id": 146, "start": 653.76, "end": 660.76, "text": "Ob das war das Corner Tool?"}, {"id": 147, "start": 660.76, "end": 664.76, "text": "Das Tool links in der Mitte, grau mit dem Strich durch."}, {"id": 148, "start": 664.76, "end": 665.76, "text": "Du meinst das da, ne?"}, {"id": 149, "start": 665.76, "end": 673.76, "text": "Ja, aber, ach nee, Moment, da muss ich das vorher umwandeln oder so, gell?"}, {"id": 150, "start": 673.76, "end": 676.76, "text": "Äh, irgendwie so muss man das, glaub ich, machen."}, {"id": 151, "start": 676.76, "end": 679.76, "text": "Jetzt kann man Corner Tool, ah."}, {"id": 152, "start": 679.76, "end": 682.76, "text": "Exzellent."}, {"id": 153, "start": 682.76, "end": 685.76, "text": "Ist das kein, ist das kein Poggers Bild?"}, {"id": 154, "start": 685.76, "end": 691.76, "text": "Hier, guckt euch das mal an."}, {"id": 155, "start": 691.76, "end": 702.76, "text": "Also wenn das nicht, Leute, das beste Logo auf, oh fuck, das beste Logo auf ganz GitHub ist, dann weiß ich auch nicht."}, {"id": 156, "start": 702.76, "end": 704.76, "text": "So."}, {"id": 157, "start": 704.76, "end": 705.76, "text": "Save As."}, {"id": 158, "start": 705.76, "end": 707.76, "text": "Nee, Moment, wie ging das jetzt noch mal?"}, {"id": 159, "start": 707.76, "end": 708.76, "text": "Save As."}, {"id": 160, "start": 708.76, "end": 709.76, "text": "Export."}, {"id": 161, "start": 709.76, "end": 711.76, "text": "Export, Foto, PNG."}, {"id": 162, "start": 711.76, "end": 714.76, "text": "Äh, Selected."}, {"id": 163, "start": 714.76, "end": 719.76, "text": "Logo."}, {"id": 164, "start": 719.76, "end": 721.76, "text": "Monarch S."}, {"id": 165, "start": 721.76, "end": 722.76, "text": "Logo."}, {"id": 166, "start": 722.76, "end": 724.76, "text": "Windows."}, {"id": 167, "start": 724.76, "end": 727.76, "text": "System 32."}, {"id": 168, "start": 727.76, "end": 729.76, "text": "Warum ist da die Vorfahrt?"}, {"id": 169, "start": 729.76, "end": 737.76, "text": "Windows System 32."}, {"id": 170, "start": 737.76, "end": 740.76, "text": "Verändere die Transparente, damit es so aussieht, ob es sich gespiegelt."}, {"id": 171, "start": 740.76, "end": 741.76, "text": "Ich bin nicht zu dumm für."}, {"id": 172, "start": 741.76, "end": 745.76, "text": "Ich bin bildbearbeitungsmäßig übelst schlecht."}, {"id": 173, "start": 745.76, "end": 748.76, "text": "So."}, {"id": 174, "start": 748.76, "end": 750.76, "text": "Ach Mist, ich bin ja in GitHub gar nicht eingeloggt."}, {"id": 175, "start": 750.76, "end": 754.76, "text": "Zumindest hier, das ist doch."}, {"id": 176, "start": 754.76, "end": 758.76, "text": "Das ist doch das beste Projekt Logo, was es überhaupt nur gibt."}, {"id": 177, "start": 758.76, "end": 764.76, "text": "Und da jetzt noch irgendwie was drüber schreiben und gut ist."}, {"id": 178, "start": 764.76, "end": 767.76, "text": "Oder bin ich vielleicht doch eingeloggt?"}, {"id": 179, "start": 767.76, "end": 769.76, "text": "GitHub."}, {"id": 180, "start": 769.76, "end": 770.76, "text": "GitHub."}, {"id": 181, "start": 770.76, "end": 771.76, "text": "Nein, bin ich nicht eingeloggt."}, {"id": 182, "start": 771.76, "end": 773.76, "text": "Na gut."}, {"id": 183, "start": 773.76, "end": 776.76, "text": "Ja."}, {"id": 184, "start": 776.76, "end": 778.76, "text": "Hast du das Programm als Admin ausgeführt?"}, {"id": 185, "start": 778.76, "end": 779.76, "text": "Nö."}, {"id": 186, "start": 779.76, "end": 783.76, "text": "Nein, habe ich nicht."}, {"id": 187, "start": 783.76, "end": 784.76, "text": "Oh, das ist ganz wichtig."}, {"id": 188, "start": 784.76, "end": 789.76, "text": "Das müssen wir speichern."}, {"id": 189, "start": 789.76, "end": 790.76, "text": "Sehr gut."}, {"id": 190, "start": 790.76, "end": 791.76, "text": "Sehr gut."}, {"id": 191, "start": 791.76, "end": 792.76, "text": "Ja, was ich euch zeigen wollte."}, {"id": 192, "start": 792.76, "end": 799.76, "text": "Ich habe wieder was zum Flaschen gekauft."}, {"id": 193, "start": 799.76, "end": 800.76, "text": "Was war das hier?"}, {"id": 194, "start": 800.76, "end": 801.76, "text": "Das ist."}, {"id": 195, "start": 801.76, "end": 805.76, "text": "Also wenn das so funktioniert, wie es da steht, dann ist das."}, {"id": 196, "start": 805.76, "end": 811.76, "text": "Ihr wisst ja, dass ich ein paar Steckdosen leisten prinzipiell nicht wieder stehen kann."}, {"id": 197, "start": 811.76, "end": 814.76, "text": "Und das ist diesmal sogar ein bisschen was advancedes."}, {"id": 198, "start": 814.76, "end": 819.76, "text": "Erstens ist das ein doppelter Stecker, den man remote einem ausschalten kann und das"}, {"id": 199, "start": 819.76, "end": 822.76, "text": "trackt, was der Energieverbrauch ist."}, {"id": 200, "start": 822.76, "end": 824.76, "text": "Das ist cool, das habe ich noch nicht."}, {"id": 201, "start": 824.76, "end": 827.76, "text": "Die Sache ist nur die."}, {"id": 202, "start": 827.76, "end": 830.76, "text": "Es ist ein bisschen unklar, ob man das Ganze flaschen kann."}, {"id": 203, "start": 830.76, "end": 832.76, "text": "Angeblich geht das."}, {"id": 204, "start": 832.76, "end": 836.76, "text": "Wenn jemand nach Tasmota sucht."}, {"id": 205, "start": 836.76, "end": 839.76, "text": "Angeblich geht das."}, {"id": 206, "start": 839.76, "end": 848.76, "text": "Aber manche sagen, dass das nicht mehr aktuell möglich ist."}, {"id": 207, "start": 848.76, "end": 850.76, "text": "Ich meine, das sind jetzt Sachen vom Oktober."}, {"id": 208, "start": 850.76, "end": 856.76, "text": "Aber ich habe jetzt hier schon Sachen gelesen, die sagen, es funktioniert nicht mehr."}, {"id": 209, "start": 856.76, "end": 861.76, "text": "So, was ist das für ein Produkt eigentlich?"}, {"id": 210, "start": 861.76, "end": 862.76, "text": "Hier Gosund."}, {"id": 211, "start": 862.76, "end": 863.76, "text": "Was Gosund?"}, {"id": 212, "start": 863.76, "end": 865.76, "text": "Das ist wieder so ein typischer China Ding."}, {"id": 213, "start": 865.76, "end": 866.76, "text": "Hier SP211."}, {"id": 214, "start": 866.76, "end": 867.76, "text": "Da kann man suchen."}, {"id": 215, "start": 867.76, "end": 868.76, "text": "Tasmota."}, {"id": 216, "start": 868.76, "end": 869.76, "text": "So immer das ist."}, {"id": 217, "start": 869.76, "end": 890.76, "text": "Oh, das ist ja eine coole Seite, die kenne ich noch gar nicht."}, {"id": 218, "start": 890.76, "end": 891.76, "text": "Was ist das?"}, {"id": 219, "start": 891.76, "end": 892.76, "text": "Startseite."}, {"id": 220, "start": 892.76, "end": 893.76, "text": "Interessant, dass die das hier mal beschreiben."}, {"id": 221, "start": 893.76, "end": 906.76, "text": "Oh, nee, ich will es doch nicht wieder löten müssen."}, {"id": 222, "start": 906.76, "end": 908.76, "text": "Das ist immer ein Gefuddel."}, {"id": 223, "start": 908.76, "end": 911.76, "text": "So ein das Gleiche."}, {"id": 224, "start": 911.76, "end": 918.76, "text": "Wie hieß denn diese Seite, wo man dann diese ganzen Tasmota-Geräte drauf standen."}, {"id": 225, "start": 918.76, "end": 920.76, "text": "Aufstanden"}, {"id": 226, "start": 924.12, "end": 926.12, "text": "Ich habe es für Tastmotor"}, {"id": 227, "start": 928.84, "end": 931.24, "text": "Das da das da genau"}, {"id": 228, "start": 935.68, "end": 937.68, "text": "Da ist er doch, der Goh so ein Plack"}, {"id": 229, "start": 939.72, "end": 941.16, "text": "Also"}, {"id": 230, "start": 941.16, "end": 943.84, "text": "Ja, Tuya Convert might not be possible for this device"}, {"id": 231, "start": 943.84, "end": 949.68, "text": "Wenn es die neueste Firmware gibt und angeblich laut Amazon ist da die neueste Firmware mittlerweile drauf"}, {"id": 232, "start": 951.28, "end": 955.0, "text": "Schauen wir mal wenn nicht muss ich den Kram. Wisst ihr was wir dann mal probieren"}, {"id": 233, "start": 955.72, "end": 962.16, "text": "Sollte das nicht gehen und man muss den Kram wirklich löten dann probieren wir mal das im Stream zusammen zu machen"}, {"id": 234, "start": 962.56, "end": 965.64, "text": "Weil ihr wisst ja ich habe jetzt hier oben so eine RGB"}, {"id": 235, "start": 966.4, "end": 971.64, "text": "Rgb dimmbare mit Farbe einstellbare RGB Lampe an der Decke da könnte ich theoretisch"}, {"id": 236, "start": 971.64, "end": 978.16, "text": "Theoretisch die Kamera irgendwie neben dran hängen Tisch hier hinstellen und wir könnten das zusammen mal probieren zu löten"}, {"id": 237, "start": 981.64, "end": 986.48, "text": "Im Stream und dann kann der Chat sagen Max du machst das ganz falsch so geht das nicht"}, {"id": 238, "start": 986.48, "end": 991.96, "text": "Lull wo hast du denn bitte löten gelernt alter hätte ich das so auf der Arbeit gemacht dann würde ich rausgeschmissen werden"}, {"id": 239, "start": 991.96, "end": 996.44, "text": "Lololol ich weiß jetzt schon wie die Leute dann wieder weil wenn man sowas im Stream macht"}, {"id": 240, "start": 996.44, "end": 1003.6, "text": "Es wissen alle Backseat löten genau Backseat und wenn man sowas macht es wissen alle prinzipiell immer besser"}, {"id": 241, "start": 1009.8, "end": 1015.12, "text": "Ok also was muss man denn hier machen wenn man die löten will zeigt mal hier ist das überhaupt diese Steckdose die ich habe"}, {"id": 242, "start": 1015.12, "end": 1025.4, "text": "Sp Moment ne was was für eine habe ich sp 2 1 1 und das ist sp 1 1 2"}, {"id": 243, "start": 1028.68, "end": 1030.68, "text": "Exzellente Produktnamen würde ich sagen"}, {"id": 244, "start": 1032.4, "end": 1039.28, "text": "Es gibt es gibt die sp 2 1 1 und die sp 1 1 2 so die sp 1 1 2 ist 1"}, {"id": 245, "start": 1039.28, "end": 1056.56, "text": "Und die sp 2 1 ist die chinesen oh je jetzt habe ich wieder"}, {"id": 246, "start": 1060.0, "end": 1067.04, "text": "Jetzt habe ich wieder chinesen gesagt jetzt kommen sie oft wird er wieder an max du scheiß rassist das wusste ich unbedingt ein chinesen designed haben"}, {"id": 247, "start": 1067.04, "end": 1069.84, "text": "Richtig wie gesagt vielleicht war es auch"}, {"id": 248, "start": 1070.88, "end": 1077.76, "text": "Colombianer oder so aber von dem chinesischen hersteller von dem chinesen liegt das schon nahe irgendwie"}, {"id": 249, "start": 1078.88, "end": 1083.36, "text": "Warum kann man da auf x drücken seit wann kann man werbung zu ach das ist gar keine werbung"}, {"id": 250, "start": 1087.28, "end": 1089.52, "text": "Also was muss man machen um den kram von hand zu löten"}, {"id": 251, "start": 1090.0, "end": 1093.52, "text": "Schrauben in metallklammern lösen ja ok mit dünnem hebelwerkzeug"}, {"id": 252, "start": 1093.52, "end": 1098.88, "text": "Innerhalb der steckdose drei schrauben innerhalb der steckdose lösen ich habe löten gelesen"}, {"id": 253, "start": 1099.12, "end": 1103.12, "text": "Dann löten man die schrauben von metallklammern ok also zeige ich mal her"}, {"id": 254, "start": 1104.24, "end": 1106.24, "text": "Da ist ein loch was macht man damit"}, {"id": 255, "start": 1114.96, "end": 1116.96, "text": "Ach da ist eine schraube drinne"}, {"id": 256, "start": 1118.0, "end": 1120.0, "text": "Da ist wahrscheinlich eine schraube drinne muss man irgendwie raus machen"}, {"id": 257, "start": 1120.0, "end": 1123.04, "text": "Ich dachte dass man hier eigentlich immer diesen dritten stecker rein macht wenn man den hat"}, {"id": 258, "start": 1127.36, "end": 1133.84, "text": "So dann muss man hier die schrauben in der mitte raus machen und dann kommt man an die pins vom esp 2866 dran"}, {"id": 259, "start": 1134.88, "end": 1140.48, "text": "Das sieht easy aus im vergleich zu den restlichen steckdosen wie gesagt das letzte mal die letzten waren"}, {"id": 260, "start": 1141.12, "end": 1144.88, "text": "Die letzten waren richtig also massiv scheiße zu löten"}, {"id": 261, "start": 1144.88, "end": 1148.64, "text": "Hier die letzten waren echt massiv scheiße zu löten"}, {"id": 262, "start": 1149.44, "end": 1155.36, "text": "Da musste man also hier unten war kein problem aber da musste man hier dran das ist was weiß ich"}, {"id": 263, "start": 1159.92, "end": 1167.04, "text": "Keine ahnung ein zehntel vom millimeter oder irgendwie sowas das ist übelst klein und das habe ich nicht gebacken bekommen bis ich dann irgendwie schon"}, {"id": 264, "start": 1167.04, "end": 1173.6, "text": "Bis ich dann irgendwann mal auf die idee gekommen bin löte den kram einfach nicht dran sondern halt nur mit dem finger fest und das hat dann funktioniert"}, {"id": 265, "start": 1173.6, "end": 1177.6, "text": "Ich habe dann hier einfach nur hier unten dran gelötet und das oben habe ich mit dem finger fest gehalten und gut ist"}, {"id": 266, "start": 1179.2, "end": 1186.72, "text": "Und das ist das ist das hier luxus da ist das ja wirklich luxus hier da siehst ja alle pets und alle pins und so das hat überhaupt kein problem"}, {"id": 267, "start": 1186.72, "end": 1193.76, "text": "Und das ist das ist das hier luxus da ist das ja wirklich luxus hier da siehst ja alle pets und alle pins und so das hat überhaupt kein problem"}, {"id": 268, "start": 1199.12, "end": 1207.52, "text": "Äh ne seilgubas sowas ist die sache meistens ganz danach also ich habe ich glaube ich habe noch nix geschrottet bisher mit solchen aktionen"}, {"id": 269, "start": 1207.52, "end": 1215.36, "text": "Oder es war unwichtig habe es total vergessen schon wieder genau und dann wird das mit heißt okay das ist easy das mache ich dann wieder mit dem raspberry pi"}, {"id": 270, "start": 1215.36, "end": 1221.36, "text": "Nice was macht der hier noch hinten dran messwerte kalibrieren ach du scheiße"}, {"id": 271, "start": 1221.36, "end": 1233.36, "text": "Gut das ist kein problem wo wir gerade beim thema messwerte kalibrieren sind hat jemand ein gutes so so energy meter zum reinstecken was halbwegs was halbwegs taugt also ich hab"}, {"id": 272, "start": 1233.36, "end": 1246.4, "text": "Ich hab ich hab ich hab mir mal vor einer weile hier von eins gekauft elv energy master oder sowas das ist es teuer mittlerweile ich hab dafür 40 euro oder so bezahlt sind die noch ganz dicht"}, {"id": 273, "start": 1248.4, "end": 1254.0, "text": "Ist das so teuer geworden das hat bei mir 35 40 euro gekostet oder so what the hell"}, {"id": 274, "start": 1254.0, "end": 1282.88, "text": "Ach so hier kommen wir der sache schon näher master basic oder hier hab ich sowas also der ist eigentlich ganz gut gewesen hier erkennt da einer irgendwas ordentliches was aktuell noch hergestellt wird und vielleicht nicht ganz so teuer ist weil das ist immer nützlich wenn man sowas hier dann ausprobieren will ich trau mich da nicht dran mit meinem multimeter printstuhl"}, {"id": 275, "start": 1284.0, "end": 1305.76, "text": "Weichei weißt du besser weiches ei als f in chat oder wie der chemiker sagt abstand schützt wenn man nicht da ist wo was schlimmes passiert passiert einem auch nix"}, {"id": 276, "start": 1305.76, "end": 1325.92, "text": "Elv ja den hab ich schon den hab ich da hab ich einen von das hab ich eben grad eben grad gezeigt so ein ding hab ich mir mal gekauft von der weile und ich hätte jetzt gerne noch noch so eins zwei weil das eine steckt permanent hier neben an dieser kleinen mini surfer kiste dran und das will ich jetzt nicht ausschalten"}, {"id": 277, "start": 1325.92, "end": 1353.44, "text": "Hier noch ein low effort der ist geil das sind poggers das ist aus dem poggers logo ok chat was findet ihr besser dieses logo oder mein logo was ist besser der da oder der da der da oder der da"}, {"id": 278, "start": 1353.44, "end": 1382.24, "text": "Ich gebe zu uns ist beides extrem schlecht ja wisst ihr was warum wisst ihr warum der besser ist wisst ihr warum der besser ist weil der gewollt scheiße aussieht das sieht so aus als hat das jemand gemacht der es eigentlich besser könnte aber er hat es absichtlich schlecht gemacht"}, {"id": 279, "start": 1382.24, "end": 1391.84, "text": "So und mein sieht so aus als hätte es jemand gemacht der es nicht kann und versucht es zu können"}, {"id": 280, "start": 1391.84, "end": 1417.44, "text": "Deswegen der ist besser den speichere ich mir den nehmen aber ihr wisst wie das ist auch schlechte Sachen können dazu beitragen dass das Produkt bekannt wird und so richtig schlechte kennt jemand die Werbung von Seitenbacher Müsli das ist nur so bekannt geworden weil es einfach richtig schlecht ist"}, {"id": 281, "start": 1422.72, "end": 1435.68, "text": "Bergsteiger Müsli genau das nehmen wir das ist ein top top logo bin ich hier auf github eingeloggt oh ich bin auf github eingeloggt sehr gut"}, {"id": 282, "start": 1435.68, "end": 1465.28, "text": "Guck mal hier die repos werden gestarrt die repos werden gestarrt exzellent wir machen jetzt wir machen jetzt das logo rein wir machen jetzt das wichtigste wir machen das logo rein was ist ein tm tool ein tm tool das kann jetzt nicht sein das ist ein private repo closed"}, {"id": 283, "start": 1465.28, "end": 1474.48, "text": "Das ist das was ich mit meinem kollege zusammen programmiert habe für die Routenberechnung"}, {"id": 284, "start": 1474.48, "end": 1486.16, "text": "Übrigens ich hab die subs gar nicht übersehen twitch mason dankeschön für den sub falls ich nicht gesehen hab jedenfalls huge big brain subscription hier"}, {"id": 285, "start": 1486.16, "end": 1502.24, "text": "Den haben wir da sonst noch haben wir sonst noch einen any primers keine primers mehr ok ok ich muss euch ehrlich gestehen ich hab glaub noch nie ein logo ein projekt hinzugefügt ok mal eine readme"}, {"id": 286, "start": 1502.24, "end": 1517.68, "text": "Forscher monarch s ach du scheiß wie ging noch mal images wie ging noch mal images im markdown haben die da vielleicht irgendeinen editor knopf oder so"}, {"id": 287, "start": 1517.68, "end": 1533.52, "text": "Die macht man noch mal images in markdown so nee so markdown embed images"}, {"id": 288, "start": 1533.52, "end": 1556.08, "text": "Ist der code in dem privaten repo auch so gut dokumentiert guter code dokumentiert sich selbst weißt du doch war das so nee aber es war es war irgendwas in der richtung alter ich kann mir markdown images"}, {"id": 289, "start": 1556.08, "end": 1576.64, "text": "War welche syntax zeig her achso falsch rum fast fast so rum excellent sehr gut"}, {"id": 290, "start": 1576.64, "end": 1598.0, "text": "Komm mit directly to master wir brauchen keine jawoll leute wir haben es wir haben ein off wir haben offiziell ein logo wir haben es geschafft wir sind jetzt ein richtig echtes github projekt weil ohne logo geht das net"}, {"id": 291, "start": 1598.0, "end": 1619.36, "text": "Übrigens das hier stimmt überhaupt nicht na wisst ihr warum das 390 prozent javascript sind oder wie die coolen leute sagen würden 300 prozent javascript das liegt daran weil ich komplettes viewjs signal a und irgendeinen web-adapter eingecheckt hab"}, {"id": 292, "start": 1619.36, "end": 1631.2, "text": "Also macht man normalerweise auch nicht sowas macht man normalerweise npm install oder yan install und dann ist das in den notes modules ordner den man nicht included aber kann ja immer noch kann ich immer noch löschen"}, {"id": 293, "start": 1631.2, "end": 1643.04, "text": "Es ist zwar nicht aus der historie raus aber aus der statistik raus der der text ist auch gut ja also ich würde sagen das sieht so vertrauenserweckend aus dass das morgen 10.000 sterne hat"}, {"id": 294, "start": 1643.04, "end": 1653.52, "text": "Aber vielleicht übermorgen vielleicht übermorgen also ich finde ich finde ein vertrauenswürdigeres projekt gibt es eigentlich nicht"}, {"id": 295, "start": 1653.52, "end": 1672.96, "text": "Gut jetzt hätten wir das erledigt also ich habe euch auch hier die neue steckdose gezeigt die wir mal flaschen die kommt morgen an sagt amazon zumindest und dann probieren wir mal im stream aus steckdose leiste flaschen und diese dings hier flaschen mit das motor zum gucken ob das wirklich den energieverbrauch messen kann"}, {"id": 296, "start": 1672.96, "end": 1688.0, "text": "Soll ich euch mal die neue version hier zeigen die ich vorher gepusht hab von monac s das hört sich schon mal total hängen geblieben an oder soll ich euch die neue version von monac s zeigen ja du brauchst das logo als emote"}, {"id": 297, "start": 1688.0, "end": 1709.36, "text": "Ah das ist so das ist so klein guck mal wenn ich das das erkennt man nicht als emote das erkennt man nicht wo sieht man meine steckdosenübersicht ich glaube so eine steckdosenübersicht habe ich gar nicht habe ich eine steckdosenübersicht irgendwo"}, {"id": 298, "start": 1709.36, "end": 1737.44, "text": "Nein der sebaro hatte schon vor langer zeit richtig gute idee der hat gesagt ich soll mal eine liste machen mit so quasi empfohlene hardware und ich habe schon 50 mal gesagt ja sebaro das machen wir und was meint ihr wie weit die liste schon ist ratet mal wieviel sachen schon auf der liste draufstehen"}, {"id": 299, "start": 1737.44, "end": 1767.36, "text": "da ist er das sebaro wenn man von ihm spricht null nein null ist nicht richtig ich habe gesagt sebaro du hast schon vor einer ganzen weile und zwar schon öfters vorgeschlagen dass ich mal eine liste machen soll mit empfohlene hardware drauf ja ich glaube zwei sachen stehen drauf auf der liste bisher zwei sachen ich weiß gar nicht mehr welche sachen das waren das müssen wir echt mal machen also weil ich habe mittlerweile so viel zeug die sache ist nur die wenn ich eine liste mache mit"}, {"id": 300, "start": 1767.36, "end": 1797.32, "text": "hier wenn ich eine liste mache mit so geräten die ok wo auch immer amazon jetzt hin ist wenn ich eine liste mache mit solchen geräten das problem dabei ist das kann durchaus sein dass wenn ihr diese liste seht das gar nicht mehr flashbar ist und wenn es dann gar nicht mehr flashbar ist dann kommen die leute zu mir immer sachen max warum empfiehlst du china cloud hardware dabei bin ich ja komplett anti china cloud"}, {"id": 301, "start": 1797.32, "end": 1825.96, "text": "hardware die steckdosen leiste die ich habe die bringt ihr nichts mehr weil die kann man in der aktuellen version nicht mehr flaschen und ich habe die mir wieder gekauft vor einem monat oder so habe ich mir die gleiche steckdosen leiste wieder gekauft und die hat jetzt ein mediatek chip drinnen anstatt den esp 86 also die gehen gar nicht mehr total hängen geblieben sieht exakt genauso aus von außen eins zu eins aber geht nicht mehr"}, {"id": 302, "start": 1825.96, "end": 1839.12, "text": "ja so ich zeige euch mal die neue monat s version das nehme ich richtig nice was ich da eingebaut habe wo sie hin repos auch nie überhaupt mein vor hab ich das liegen"}, {"id": 303, "start": 1839.12, "end": 1865.2, "text": "wo habe ich denn hier mein repo da guck mal writer projects monat s da ist es doch pull pull ja was habe ich hier sachen ich habe hier irgendwas habe ich denn nicht komm bitte zeig mal da überschreiben"}, {"id": 304, "start": 1865.2, "end": 1893.04, "text": "alles weg brauche man nicht so hallo ihr heckermans ja ich zeige euch jetzt mal die neuste monat s version und ich kann euch sagen es ist extrem nice was das mittlerweile kann das teil das testvideo läuft das testvideo läuft auf"}, {"id": 305, "start": 1893.04, "end": 1914.04, "text": "my stream ah gut da kann ich direkt starten ohne dass ich was brauche so ich starte es mal moment aber nicht mit dotnet 5 sondern mit dotnet 3 1 ach ich bin noch im falschen projekt so das passt mal auf richtig nice"}, {"id": 306, "start": 1914.04, "end": 1933.04, "text": "mittlerweile was das kann ja ja wait nervt nicht rum starte ok 5.000 und ich kann es euch auch unter windows zeigen geht auch 5.000 wie war ich da nicht drauf noch nie"}, {"id": 307, "start": 1933.04, "end": 1952.04, "text": "das habe ich noch für eine ip ja port 5.000"}, {"id": 308, "start": 1952.04, "end": 1974.04, "text": "komm mal hier er erkennt person ist übrigens das falsche video das ist das video mit dem fitness grill das fitness grill video das fitness grill video ist gar nicht so schön anzugucken mit der object detection da brauchen wir ein anderes video"}, {"id": 309, "start": 1974.04, "end": 1998.04, "text": "warte mal genau das ist das fitness grill was war das video was ich von youtube runtergeladen habe viel besser ist das andere video was habe ich denn das andere video nicht das fitness grill sondern war das plupp 2 plupp 2 ts war das plupp 2 ts meine benamung ist ja legendär"}, {"id": 310, "start": 1998.04, "end": 2008.04, "text": "pluppe 1 und plus 2 ja ah hier guck mal seht ihr es multiple dinger kann er jetzt erkennen"}, {"id": 311, "start": 2008.04, "end": 2026.04, "text": "ich war im spielplatz ist kacke für object detection ja sehen wir uns einig ja seht ihr das er erkennt multiple dinger ja person person person ja ich habe mich leider geleakt jetzt ja stimmt schon"}, {"id": 312, "start": 2026.04, "end": 2054.04, "text": "so wie gut das funktioniert seht ihr das hier denkt euch mal diese konsole da in der mitte weg wie was das bringt also chat chat fragt was das bringt also erstens mal bringt das weil es geht so und jetzt aber ernsthaft was es bringt ist normale kamera ist also normale motion detection bei einer kamera macht das ungefähr an dem fest was sich im bild ändert"}, {"id": 313, "start": 2054.04, "end": 2078.04, "text": "also sprich wenn du die kamera schwenkst dann macht normale kamera motion detection immer sofort alarm das motion detected wurde oder wenn ein zug durchs bild fährt dann auch übrigens bei dem ding fällt ja ein bisschen so und das erkennt nicht bewegung das erkennt personen in bildern"}, {"id": 314, "start": 2078.04, "end": 2101.04, "text": "mehr habt ihr gesehen die personen im hintergrund das erkennt personen in bildern das heißt das ist viel zuverlässiger und hat viel weniger falls positives bei der motion erkennung oder durch ob es durch die durch die object detection woran er das erkennt das ist tensor flow machine machine learning mit tensor flow ist da unten drunter"}, {"id": 315, "start": 2101.04, "end": 2116.04, "text": "so aber wartet mal kurz es wird noch viel neisser wenn er wenn er wieder den spielplatz im hintergrund zeigt ich meine das ist jetzt das hat das letzte mal auch schon konnt übrigens wisst ihr was auch noch anders ist euch euch fällt vielleicht auf dass die dass die dass die größe skaliert"}, {"id": 316, "start": 2116.04, "end": 2139.04, "text": "kommen er erkennt die personen im hintergrund habt ihr es gesehen wobei er da probleme hat bei so kleinen sachen hier weiß ich aber die erkennt ja guckt ja er erkannt aber hauptsächlich die im vordergrund ich war man darf nicht vergessen das ganze läuft mit 300 mal 300 im hinter für die für die motion erkennung"}, {"id": 317, "start": 2139.04, "end": 2154.04, "text": "alla kirby ist ja gut und da kannst du den live feed von einer kamera einmal ja das ist ja grad der witz das läuft nicht auf dem raspberry pi das läuft lokal aber ich hab es testweise schon über den raspberry pi laufen lassen ist kein problem"}, {"id": 318, "start": 2154.04, "end": 2183.04, "text": "also raspberry pi schafft bis zu vier kameras somit zwei drei sekunden verzögerung du musst aber den den container beschränken auf der auf den docker container muss auf raspberry pi beschränken sonst braucht er zu viel cpu guck jetzt das grill was durchläuft hat er auch erkannt kannst du die alerts irgendwie pushen jetzt das ist der plan das ist der plan dass man auch alerts irgendwo hin pushen kann dass man das in seine heimautomatisierung integriert hat"}, {"id": 319, "start": 2183.04, "end": 2213.04, "text": "und dass man irgendwie webhooks hat für alerts oder so vielleicht unterstütze ich auch mal eingebaut irgendwelche standard alerts sagen übrigens ich filtre alles raus ich filtre alles raus ich kann es euch ja mal zeigen ich filtre alles raus guck mal hier seht ihr es das ist das ist nice hier erkennt er alles person person person den typ hier empfinde kommt er sich nicht merkwürdig vor dass er auf dem spielplatz das er eine geile fitness action macht und drum herum rennen die familien mit kindern um und dann"}, {"id": 320, "start": 2213.04, "end": 2216.04, "text": "rum"}, {"id": 321, "start": 2216.04, "end": 2227.04, "text": "passen passen passen passen passen passen"}, {"id": 322, "start": 2227.04, "end": 2243.04, "text": "der filtert hier übrigens nur nach person der erkennt manchmal ganz merkwürdige sachen der erkennt manchmal baseball schläger und sowas dann sagt er hier baseball bett oder sowas steht dann manchmal dran"}, {"id": 323, "start": 2243.04, "end": 2269.04, "text": "ja das kannst du mit normalen camera feed machen ich kann dir sogar zeigen dass es mit normalen camera feed geht ich muss mal nur gucken wo ich meinen wo ich den ausschnitt von meinem normalen camera feed habe ich glaube nur 2 ts ist es ja ffmpeg"}, {"id": 324, "start": 2269.04, "end": 2282.04, "text": "guckt das ist jetzt ein mitschnitt von meiner normalen aber übrigens das buggt jetzt weil er noch ein bisschen hängt ah moment"}, {"id": 325, "start": 2282.04, "end": 2287.04, "text": "ich glaube das ist noch ein bug"}, {"id": 326, "start": 2287.04, "end": 2297.04, "text": "ich glaube das ist noch ein bug wenn man ne ne ne das geht nicht das geht nicht das geht ja normalerweise mit einer camera auch nicht dass man unter der haube den video stream ändert das funktioniert nicht"}, {"id": 327, "start": 2297.04, "end": 2304.04, "text": "weil wenn sich die auflösung von dem video ändert dann kommt der objekt detektor durcheinander"}, {"id": 328, "start": 2304.04, "end": 2313.04, "text": "das das problem hat man bei einer normalen camera aber nicht"}, {"id": 329, "start": 2313.04, "end": 2328.04, "text": "guckt so das ist jetzt ein mitschnitt von meiner normalen camera die ich im hof hängen hab und da erkennt er auch dass das hier person ist die durchs bild läuft"}, {"id": 330, "start": 2328.04, "end": 2339.04, "text": "ja das ist ein bug also was heißt bug normalerweise der muss ja den image detector und den rescaler muss der initialisieren auf ne gewisse größe von den frames"}, {"id": 331, "start": 2339.04, "end": 2348.04, "text": "und das macht er einmal beim starten von der camera ne normale camera ändert ja aber auch nicht seinen stream und die auflösung mitten im stream"}, {"id": 332, "start": 2348.04, "end": 2358.04, "text": "das ist spinnwebe davor ja und das ist ausplan funkt so und jetzt ist die sache das wie viele ressourcen braucht das kann ich dir gleich zeigen nicht so viel"}, {"id": 333, "start": 2358.04, "end": 2363.04, "text": "weil aktuell macht er das nur jeden keyframe und das ist eigentlich auch ziemlich big brain finde ich"}, {"id": 334, "start": 2363.04, "end": 2371.04, "text": "genau aber bevor ich was für den ressourcen sage ich wollte noch eine sache sagen warum das jetzt so viel besser aussieht hier mit dem overlay und so wie das letzte mal"}, {"id": 335, "start": 2371.04, "end": 2378.04, "text": "ich mach das jetzt mit einem"}, {"id": 336, "start": 2378.04, "end": 2385.04, "text": "wo ist es hier ich mach das jetzt mit dem canvas und mal das selbst oben drüber"}, {"id": 337, "start": 2385.04, "end": 2392.04, "text": "also sprich ich schieb da kein diff mehr hin und her sondern das ist ein canvas und hier male ich auf dem canvas rum"}, {"id": 338, "start": 2392.04, "end": 2403.04, "text": "ah guck hier hier start start stop font hingemalt und dann hier rechteck malen und sowas"}, {"id": 339, "start": 2403.04, "end": 2413.04, "text": "das ist komplett nur lokal na klar als würde ich was mit cloud unterstützung basteln jetzt mal ganz ehrlich nein natürlich nicht das ist rein lokal"}, {"id": 340, "start": 2413.04, "end": 2425.04, "text": "komplett lokal ich baue ja nichts mit cloud unterstützung mit cloud unterstützung wäre das noch viel easier möglich es gibt eine richtig gute image detection api von microsoft"}, {"id": 341, "start": 2425.04, "end": 2436.04, "text": "die sagen dir sogar was inhaltlich auf dem bild zu sehen ist also die sagen dir zum beispiel wenn du jetzt irgendwie dass die sagen dann keine ahnung spielplatz auf der wiese und sowas das ist richtig gut das ding von microsoft"}, {"id": 342, "start": 2436.04, "end": 2449.04, "text": "das haben wir sogar mal im stream ausprobiert wo wir wo ich versucht habe für bdo dieses screenshot tool zu basteln was dir eine nachricht schickt wenn das auktionshaus was hat"}, {"id": 343, "start": 2449.04, "end": 2465.04, "text": "das ist das ist kein knasthoftor das ist ein künstlerhoftor das hat mein opa gebaut und das einzige was ich oder was wir gemacht haben ist hier so so plastik davor dass die katz nicht rüberspringen kann"}, {"id": 344, "start": 2465.04, "end": 2477.04, "text": "aber das das hoftor ist an sich eigentlich ziemlich nice das hat hier ihr seht ja so das hat hier so unterschiedlich geformte stebe und muster also das sind das sind auch so unterschiedlich gewölbt das sind das sind quasi irgendwelche platter und motive und so"}, {"id": 345, "start": 2477.04, "end": 2485.04, "text": "wie gesagt der opa war ja maler also er hatte auch so viele bilder hinterlassen und alles bei solchen dingern war er echt big brain"}, {"id": 346, "start": 2485.04, "end": 2502.04, "text": "ne das ist eher das von innen keiner rausspringt das klappt doch bis jetzt aber das kostet doch richtig viel geld wenn du 24 system bilder dahinter gehst deswegen deswegen verwende ich ja auch keine microsoft cloud api und also will ich nichts cloud"}, {"id": 347, "start": 2502.04, "end": 2520.04, "text": "werden so und jetzt so viel zum ressourcenverbrauch ich kann euch das mal zeigen der ressourcenverbrauch ist aktuell ziemlich nicht existent ja wir machen mal so"}, {"id": 348, "start": 2520.04, "end": 2537.04, "text": "wusste gar nicht dass das geht habe ich kein system monitor da drauf das ist schöner zu sehen finde ich weil kann man es nämlich als auferlehr drüber machen als im hardtop im terminal für diese sache"}, {"id": 349, "start": 2537.04, "end": 2553.04, "text": "hier klompses zum monitor starten wir mal als root dass man auch alles sieht"}, {"id": 350, "start": 2553.04, "end": 2570.04, "text": "ja so also das ist das was object detection macht und das braucht aktuell 3 bis 5 prozent cpu wohlgemerkt das ist ein das ist ein i7 8700k ja"}, {"id": 351, "start": 2570.04, "end": 2587.04, "text": "ja und der macht ja auch nur jeden keyframe also das keyframe ist ja das bild was also ist ist der frame der wieder zum ersten mal komplett alle bildinformationen enthält das heißt ich kann auch nur keyframes"}, {"id": 352, "start": 2587.04, "end": 2608.04, "text": "analysieren wenn ich mehr analysieren möchte als die keyframes dann müsste ich das komplette video decoden und das braucht zu viel zu viel leistung das will ich auch nicht alle 2 sekunden reicht voll und ganz aus ja ich kann mal den spielplatz zeigen da bewegt sich"}, {"id": 353, "start": 2608.04, "end": 2623.04, "text": "bisschen mehr da muss ich aber ausmachen"}, {"id": 354, "start": 2623.04, "end": 2629.04, "text": "war das jetzt richtig oder war das das fitness grill"}, {"id": 355, "start": 2629.04, "end": 2644.04, "text": "das ist das fitness grill im moment falscher falscher stream würde ich ja mal die dateien ordentlich benennen dann wird man da auch was erkennen"}, {"id": 356, "start": 2644.04, "end": 2668.04, "text": "hallo die auslastung raspberry kann ich euch das nächste mal zeigen die habe ich aber ausprobiert die hält sich auch in grenzen so guck so viel braucht das jetzt ungefähr hier bei diesem video auf dem spielplatz wie groß ich den browser mache ist natürlich egal weil der immer nur das gleiche bild dahin schickt"}, {"id": 357, "start": 2668.04, "end": 2675.04, "text": "das ist nicht so hoch so die sache ist jetzt die wenn man das auf dem raspberry pi macht"}, {"id": 358, "start": 2675.04, "end": 2690.04, "text": "dann ist man relativ schnell auf 100 prozent cpu last aber es ist ja egal ob das jetzt 500 millisekunden 300 millisekunden oder eine sekunde braucht zum processen"}, {"id": 359, "start": 2690.04, "end": 2702.04, "text": "wichtig ist dass es nicht das system komplett dicht macht so und deswegen würde ich das hier auf dem raspberry pi so starten das man ich will den process nicht ausmachen"}, {"id": 360, "start": 2702.04, "end": 2715.04, "text": "dass es nur maximal zwei von vier kerne verwenden darf auf dem raspberry pi vier dann braucht es zwar so halbe sekunde bis sekunde für den keyframe aber das ist kein problem und es ist genug cpu last frei für alles andere"}, {"id": 361, "start": 2715.04, "end": 2732.04, "text": "dass man auf dem raspberry pi jetzt keine performance erreichen wird mit 15 fps die sekunde für frag mich nicht zehn kameras ist klar ja also man muss das schon mit bedacht einschalten man kann jetzt da auch nicht alle seine kameras rein machen und motion detection anmachen"}, {"id": 362, "start": 2732.04, "end": 2761.04, "text": "das ist aber auch nicht so wild weil ganz ehrlich wo will man motion detection haben bei der kamera die auf hof store geht ok und vielleicht noch bei einer kamera die irgendwie guckt wenn die katze essen geht oder irgendwas falls man sowas will ja aber so mehr als zwei maximal drei kameras wenn man die hat will man eigentlich gar keine motion zumindest ich nicht motion detection anmachen und wenn man das will kann man sich immer noch so ein ding kaufen ne nicht gpu tpu"}, {"id": 363, "start": 2761.04, "end": 2776.04, "text": "dann kann man sich immer noch so ein ding kaufen für 60 70 euro und das ist für den raspberry pi"}, {"id": 364, "start": 2776.04, "end": 2804.04, "text": "das ist so ein ki accelerator und wenn man das dran hat kommt man auch auf seine 5 6 fps und das auf den raspberry pi und ohne großartig cpu last das ist was wenn man wirklich viele kameras hat und bei vielen dann motion detection machen will ist das was was sich dann von der investition her sogar lohnt weil besser kriegt man das mit dem teureren rechner dann auch nicht zusammen also ich finde das ist sogar ganz fair 68 euro dafür"}, {"id": 365, "start": 2804.04, "end": 2807.04, "text": "also siehst du es braucht nicht viel cpu last"}, {"id": 366, "start": 2807.04, "end": 2813.04, "text": "so wir können jetzt ja mal den stream wir können jetzt ja mal den stream mehrfach rein machen"}, {"id": 367, "start": 2813.04, "end": 2818.04, "text": "und da können wir mal gucken wie die cpu last hoch geht"}, {"id": 368, "start": 2818.04, "end": 2825.04, "text": "übrigens falsch was ich hier auf hab muss monarch s aufmachen und nicht da drinne sondern im anderen"}, {"id": 369, "start": 2825.04, "end": 2843.04, "text": "ich mach mal ich mach mal mehr mich macht den streamer mehrfach an"}, {"id": 370, "start": 2843.04, "end": 2856.04, "text": "dann sehen wir das auch die cpu auslastung relativ schnell hoch geht"}, {"id": 371, "start": 2856.04, "end": 2873.04, "text": "kopieren wir den kram hier einfach ein paar mal haben wir hier fünf streams oder so eins also drei streams sechs streams jetzt"}, {"id": 372, "start": 2873.04, "end": 2887.04, "text": "also also als haben wir sechs streams laufen aber ich muss nur gucken dass die id unterschiedlich sind 0 1 2 3 4 5 ok"}, {"id": 373, "start": 2887.04, "end": 2892.04, "text": "ich brauche noch ein overlay wo der name der kamera drauf steht fällt mir gerade auf"}, {"id": 374, "start": 2892.04, "end": 2904.04, "text": "guck jetzt jetzt braucht schon ein bisschen mehr jetzt sind wir schon gleich bei 36 prozent cpu last"}, {"id": 375, "start": 2904.04, "end": 2912.04, "text": "und schwankt 18 36 nachdem wann die keyframes kommen also zwischen 18 und 40 prozent cpu last haben wir jetzt hier schon"}, {"id": 376, "start": 2912.04, "end": 2919.04, "text": "und das ist bei 1 2 3 4 5 6 kameras"}, {"id": 377, "start": 2919.04, "end": 2928.04, "text": "wobei man sagen muss das geht eigentlich auch immer noch klar ja"}, {"id": 378, "start": 2928.04, "end": 2936.04, "text": "ich meine ihr seht ja jetzt sind jetzt hier halt sechs kameras zwar ist immer der gleiche stream aber es sind sechs kameras"}, {"id": 379, "start": 2936.04, "end": 2946.04, "text": "skaliert ziemlich linear ja bis zu dem punkt wo er halt warten muss weil es weil es dicht ist"}, {"id": 380, "start": 2946.04, "end": 2953.04, "text": "ab dann dürfte wahrscheinlich richtig richtig bäm hochgehen"}, {"id": 381, "start": 2953.04, "end": 2961.04, "text": "ansonsten dürfte das ziemlich linear sein aber das ist halt eine sache die man auch wirklich vorzüglich exzellent multithreaden kann"}, {"id": 382, "start": 2961.04, "end": 2970.04, "text": "weil das eine bild hat nichts mit dem anderen bild zu tun und das eine bild von der einen kamera hat noch viel weniger mit dem bild von anderen kameras zu tun"}, {"id": 383, "start": 2970.04, "end": 2977.04, "text": "also das kann man perfekt multithreaden eigentlich sondern ich zeige euch jetzt noch mal die auslastung von meinem programm weil die ist auch"}, {"id": 384, "start": 2977.04, "end": 2985.04, "text": "passt gar nicht da hier mal hier"}, {"id": 385, "start": 2985.04, "end": 2996.04, "text": "guck mal das programm was die kameras streams ausliest und an browser schickt hat gerade mal 1 2 prozent cpu last"}, {"id": 386, "start": 2996.04, "end": 3006.04, "text": "und das geht nur übrigens dass es pixels liegt an diesem komischen rtsp server hier damit rumspackt dass das so wenig ist liegt einzig und allein da dran"}, {"id": 387, "start": 3006.04, "end": 3015.04, "text": "dass es nicht die code und encoded werden muss"}, {"id": 388, "start": 3015.04, "end": 3025.04, "text": "also sprich wenn die kamera das video nicht in einem format liefert was der browser abspielen kann da geht das ganze nicht"}, {"id": 389, "start": 3025.04, "end": 3035.04, "text": "also ich transcode nichts das ist nämlich das was wir bei der ganzen kommerziellen kamerasoftware also surveillance software und mit detection software auf den sack geht"}, {"id": 390, "start": 3035.04, "end": 3042.04, "text": "die transcode das alles also sprich die decode immer die videos komplett und encode sie wieder um dann ihre magic zu machen"}, {"id": 391, "start": 3042.04, "end": 3052.04, "text": "das ist aber für Raspberry Pi nicht händelbar deswegen mache ich so ich kopiere einfach nur die frames also ich lese die frames in der kamera aus"}, {"id": 392, "start": 3052.04, "end": 3063.04, "text": "packt die ein bisschen anders ein und schickt sie an browser das heißt wenn die kamera in den modus also wenn die kamera beispielsweise nur mpeg 2 unterstützt oder so dann funktioniert es nicht"}, {"id": 393, "start": 3063.04, "end": 3069.04, "text": "wenn die kamera nur h264 unterstützt mit irgendeinem ganz komischen profile funktioniert es im browser nicht"}, {"id": 394, "start": 3069.04, "end": 3079.04, "text": "ist die kamera vp9 was es glaube ich gar nicht gibt funktioniert im browser nicht also sprich das funktioniert nur mit der kamera die h264 encoded mit einem normalen profile"}, {"id": 395, "start": 3079.04, "end": 3089.04, "text": "was 99 prozent der kameras können ja ich habe mir schon überlegt ob ich direkten support für die raspberry pi kamera und motion jpeg streams noch irgendwie einbau"}, {"id": 396, "start": 3089.04, "end": 3103.04, "text": "das lässt sich wahrscheinlich noch machen ja da muss man gucken excellent kaum verbrauch nächstes mal probieren wir so für Raspberry Pi aus"}, {"id": 397, "start": 3103.04, "end": 3121.04, "text": "genau hat jemand noch mal ein anderes video was testen soll ob es gut funktioniert mit personenerkennung aber wie gesagt es funktioniert relativ zuverlässig"}, {"id": 398, "start": 3121.04, "end": 3137.04, "text": "mit ganz vielen leuten das macht gar nicht so viel unterschied ob da viele oder wenig leute drauf sind wir können ja mal konzert ist dunkel und die leute verschwimmen in der masse das kann ja nicht gut"}, {"id": 399, "start": 3137.04, "end": 3152.04, "text": "ne das funktioniert nicht wir können es mal ausprobieren was war denn rock ich weiß was wir nehmen das video wo es mich drin zu sehen gibt aber keiner weiß wer ich bin"}, {"id": 400, "start": 3152.04, "end": 3172.04, "text": "sebaro was schickst du mir da für videos soll ich das jetzt einfach aufmachen ja genau sebaro exakt das müssen wir ausprobieren"}, {"id": 401, "start": 3172.04, "end": 3201.04, "text": "rock am ring nickelback 2004 so stop hier ist irgendwo hier sieht man mich ich kann das jetzt nicht abspielen irgendwo hier sieht man mich vorne erste reihe"}, {"id": 402, "start": 3201.04, "end": 3222.04, "text": "ja ok das kann ja das müssen wir nicht ausprobieren das erkennt er nicht ja ich darf keine musik abspielen ja ne ne das erkennt er nicht aber wir können mal nach einem anderen video keine ahnung"}, {"id": 403, "start": 3222.04, "end": 3250.04, "text": "park park was könnte man da suchen park people irgendwas fitness wow alter die leute was ist da los hier sind viele leute drauf hier sind viele leute drauf alter was gibt ihr denn ab"}, {"id": 404, "start": 3250.04, "end": 3267.04, "text": "hier sind viele leute drauf das können wir mal gucken ob er das erkennt alter was ist mit dem los was macht der da ok das probieren wir es doch mal youtube dl"}, {"id": 405, "start": 3267.04, "end": 3290.04, "text": "oh achso ich muss erstmal das format auswählen f 22 ne 18 den klein reicht"}, {"id": 406, "start": 3290.04, "end": 3307.04, "text": "das ist noch ein viel besseres video das ist noch viel besseres video was da einer geschickt hat hier im oh das ist richtig gutes video das das das das das nehmen wir das nehmen wir da rennen 50.000 leute in den pokemon nach"}, {"id": 407, "start": 3307.04, "end": 3336.04, "text": "das ist top für detection das probieren wir mal aus ok ffmpeg ffmpeg ich muss jetzt ich muss jetzt erstmal kopieren wie heißt das rare pokemon und dann bester name das nennen wir jetzt plub 3 dass man auch schön Bescheid weiß welcher plub was ist"}, {"id": 408, "start": 3336.04, "end": 3362.04, "text": "plub 3 starten das ganze und dann gucken wir mal ob er da was er da erkennt ok das das oh das macht jetzt ein bisschen fertig das macht jetzt ein bisschen fertig das sind alles person hier guck mal alles person alles person"}, {"id": 409, "start": 3362.04, "end": 3388.04, "text": "das macht ihn fertig aus horse erkennt er nicht das habe ich ausgeblendet ob er das er das horse erkennt ich habe nur person gemacht leute soll ich mal einstellen dass der alles anzeigt was er erkennt das wird das wird lustig wartet mal"}, {"id": 410, "start": 3388.04, "end": 3416.04, "text": "wir nehmen immer das person raus machen einfach nur detection truck truck guck mal hier leute truck er erkennt das feuerwehrauto truck"}, {"id": 411, "start": 3416.04, "end": 3440.04, "text": "car traffic light guck mal der ist gar nicht so doof person na er kennt es ja fast so als crowd guck mal weil wenn das hier eine person ist das sind alles das ist alles person hier"}, {"id": 412, "start": 3440.04, "end": 3462.04, "text": "also man muss doch echt sagen das funktioniert verhältnismäßig gut horse suitcase person nein das pferd erkennt er nicht also ich finde immer noch dass er klappt ausgesprochen gut"}, {"id": 413, "start": 3462.04, "end": 3490.04, "text": "man muss es zwar probiert auf der gpu laufen zu lassen nein habe ich nicht geht habe ich aber nicht weil mein ziel ist dass es am ende ja also es am ende auf dem raspberry pi läuft da ist mit gpu eh nix also was heißt ich habe es ja schon ausprobiert und auf dem raspberry pi gehts halbwegs man kann halt nicht 6 7 kameras mit motion detection rein machen und erwarten dass der das bei jedem keyframe innerhalb von sekunden erkennt"}, {"id": 414, "start": 3490.04, "end": 3518.04, "text": "gut spärzonen kann ich auch machen also ich kann auch sagen hier keine motion detection das ist kein problem das funktioniert auf dem vierer auf dem dreier würde ich es nicht unbedingt ausprobieren auf dem dreier ist vielleicht ein bisschen wobei ganz ehrlich so ein großer unterschied ist ja da nicht rein cpu leistungsmäßig also keine welten dazwischen der dreier hatte auch schon vier kerne oder"}, {"id": 415, "start": 3518.04, "end": 3547.04, "text": "ja so viel ram braucht das nicht das braucht nicht viel ram ja 180 mb und das andere braucht 275 mb ja ich habe das doch recht also das hier hier kann ich mich nicht damit rühmen das habe ich nicht programmiert das verwende ich nur aber ich habe mir schon mühe gegeben dass das effizient programmiert ist ja also es braucht nicht nicht unnötig viel"}, {"id": 416, "start": 3547.04, "end": 3575.04, "text": "cpu und auch nicht unnötig viel ram und funktioniert doch gut excellent ich bin begeistert so wisst ihr was wir jetzt mal machen wir lassen das jetzt hier im hintergrund laufen und wir gucken mal ob das memory leaks hat das habe ich nämlich noch nicht ausprobiert also lasst uns mal merken wir sind jetzt bei also das hier ist übrigens uninteressant das das das das das wichtige wir sind jetzt bei 128 mb 130 mb"}, {"id": 417, "start": 3575.04, "end": 3601.04, "text": "130 mb und hier meint er irgendwas von 206 ok schauen wir mal schauen wir mal gleich ob wir irgendwelche memory leaks haben und inzwischen zeige ich mich mal zu der geschichte aus muss mal kurz in mein texteditor gucken ich habe mir glaube ich irgendwas aufgeschrieben was ich noch erzählen wollte"}, {"id": 418, "start": 3601.04, "end": 3614.04, "text": "das hat übrigens der serious max vorgeschlagen falls er noch da ist dass wir uns das hier mal angucken sollen"}, {"id": 419, "start": 3614.04, "end": 3641.04, "text": "ach ja stimmt weil mich jemand letztens gefragt hat was ich mir für nfc text gekauft habe nfc starterkit das hatte ich mir geholt da ist eine mischung aus alle möglichen du hast ein paar karten mit nfc du hast ein paar ganz neutrale weiße aufkleber nfc text du hast ein paar nfc text mit anhänger"}, {"id": 420, "start": 3641.04, "end": 3670.04, "text": "du hast magnetische nfc text und du hast noch ein paar nfc text mit aufdruck und so ist eigentlich top das ist das womit ich beispielsweise jetzt morgens mein heizlüfter im bad einschalte auf dem klo wenn ich mich aufs klo setze wenn ich mich aufs klo setze nehme ich mein handy halte das an ein nfc tag oder geht der heizlüfter an und der steht in der position wo ich gar nicht drankommen normalerweise alternativ könnte ich natürlich einfach vorher auf den knopf vom heizlüfter drücken"}, {"id": 421, "start": 3670.04, "end": 3682.04, "text": "knopf vom heizlüfter drücken aber mit nfc tag ist natürlich viel nicer wer braucht den heizlüfter"}, {"id": 422, "start": 3682.04, "end": 3704.04, "text": "hä die frage ist wer braucht keinen heizlüfter heizlüfter ist das beste vor allem wenn es morgens kalt ist oder man lässt morgens oder man lässt natürlich dann nachts die heizung ne fußbodenheizung habe ich keine das ging bei mir auch schlecht hier im ersten stock im erdgeschoss haben wir ne fußbodenheizung"}, {"id": 423, "start": 3704.04, "end": 3733.04, "text": "fußbodenheizung bei mir im ersten stock ging nicht sonst hätte ich auch eine und memory leak kann man noch nicht sagen schauen wir mal liegt da was bei der garbage collector muss ab und zu mal laufen wir warten wir warten einfach mal ab ok excellent also dann werde ich mich mal hierzu ein bisschen auslassen"}, {"id": 424, "start": 3733.04, "end": 3755.04, "text": "also was was sind das für serious maxi bist du eigentlich auf die idee gekommen ist richtig richtig nice nice idee gut also was die besten game engines sind kann ich nichts zu sagen da bin ich echt nicht der beste für was game g develop g develop ist mit sicherheit keine gute game engine"}, {"id": 425, "start": 3755.04, "end": 3781.04, "text": "g develop klingt so nach irgendwie so einem fail gnome editor das sieht da eklig aus"}, {"id": 426, "start": 3781.04, "end": 3806.04, "text": "wo ist denn unity warum steht mal best game engine ach das sind 2d 2d aber man kann auch mit unity na gut ne ich glaube unity ist ja im kern immer 3d du kannst zwar die sachen so machen dass du nicht nach hinten und vorne laufen kannst aber im prinzip sind sachen immer 3d oder oder kann man mit unity ordentlich 2d machen ich habe keine ahnung von spielentwicklung"}, {"id": 427, "start": 3806.04, "end": 3832.04, "text": "sieht aus wie netbeans ja und wisst ihr was früher war netbeans richtig beliebt das war wahrscheinlich noch bevor es diese jetblades sachen gab weil dann hatte man damals hatte man die alternative zwischen eclipse und netbeans jetzt sage ich netbeans mittlerweile auf github auf jithub tatsächlich"}, {"id": 428, "start": 3832.04, "end": 3840.04, "text": "ja nicht so viele sterne verwendet man ja auch nicht"}, {"id": 429, "start": 3840.04, "end": 3854.04, "text": "also was das ist jetzt das ist das ist auch eine frage wo ideologisch manche leute ein bisschen über die strenge schlagen was der beste text editor ist"}, {"id": 430, "start": 3854.04, "end": 3870.04, "text": "wenn den ok wenn ihr sagt unity ist eines der besten 2d sachen ich würde fast sagen so rein als außenstehender wie ich das sehe ja also ich kenne mich ja mit spielentwicklung nicht aus dass unity eigentlich mittlerweile fast das beste für so nahe zu alles ist"}, {"id": 431, "start": 3870.04, "end": 3887.04, "text": "und für mich als jemand der keine ahnung von spielentwicklung hat aus einem grund nämlich dass unity der community support und der anzahl an tutorials und sowas einfach unglaublich hoch ist das ist auch übrigens der gleiche grund warum ich der meinung bin dass an so einen raspberry pi so schnell nichts dran kommen wird"}, {"id": 432, "start": 3887.04, "end": 3908.04, "text": "den computer zu bauen der schneller ist oder so ein single board computer zu bauen der schneller ist als ein raspberry pi ist kein problem vielleicht sogar zu einem ähnlichen preis ist kein problem aber was was an ökosystem und unterstützung und allem da drumherum existiert kommt keiner so schnell an raspberry pi dran und ich denke mal das ist bei unity ähnlich vielleicht unreal noch"}, {"id": 433, "start": 3908.04, "end": 3926.04, "text": "so und jetzt was gibt es hier heute captain peng du hast die neue version vom monka s tool verpasst vom monarch s tool guck mal das kann jetzt unterschiedliche sachen highlighten und er erkennt keine pokemons aber traffic lights"}, {"id": 434, "start": 3926.04, "end": 3955.04, "text": "aber ich glaube wir haben keine memory leaks der ist nämlich gerade schon wieder runtergegangen erstes intellijay war von 2001 ne glaubt man wirklich nicht also beste text editors na da kann man sich jetzt drüber streiten über ein paar sachen also wim und neowim ich verstehe warum die sachen"}, {"id": 435, "start": 3955.04, "end": 3983.04, "text": "als unterschiedliche unterschiedliche editoren geführt sind aber für für einen als anwender macht es jetzt auf den ersten blick nicht so wahnsinnig viel unterschiedlich weiß es gibt ein paar plugins die sind explizit für neowim die bauen jetzt nach und nach auch dieses async feature von wim ein aber im prinzip macht es erstmal nicht allzu viel unterschied und ohne plugins schon mal gar nicht großartig so ich kann verstehen dass wim und neowim auf dem ersten platz ist"}, {"id": 436, "start": 3983.04, "end": 4008.04, "text": "der hype um neowim ist auch schon ein bisschen vorbei aber die haben die haben für viel also die haben viel die haben vieles ins rollen gebracht bei wim was wim jetzt auch eingebaut hat kann ich verstehen dass das vorne ist wim ist halt auch historisch einfach ganz weit vorne mit dabei und hat sicherlich auch viele votes hier schon eingesackt wo vision studio code gar nicht dabei war"}, {"id": 437, "start": 4008.04, "end": 4034.04, "text": "dazu kommt dass wim ein super editor ist den man einfach für klein kram verwenden kann also ich bin ja mittlerweile davon weg gekommen ich bin ja mittlerweile davon weg gekommen größere sachen im wim zu machen aber es gibt nichts besseres wie wenn man was kleines editieren muss oder ssh was editieren muss das über wim zu machen"}, {"id": 438, "start": 4038.04, "end": 4060.04, "text": "also da ist wim top ich verwende wim immer noch täglich nicht als main editor aber eben um halt zu editieren also da bin ich mit einverstanden dass die immer noch im ersten platz stehen also universell ist wim da immer noch wenn man wirklich mal rein auf text editor guckt"}, {"id": 439, "start": 4060.04, "end": 4089.04, "text": "und wie vielfältig der benutzbar ist rein als editor ich rede das nicht von irgendwelchen features für unterschiedliche programmiersprachen sondern wie vielfältig wim allein als editor zu benutzen ist kommt da eigentlich kaum was dran also du kannst den über ssh wunderbar verwenden auf dem terminal wunderbar verwenden du kannst wenn du dich damit auskennst auch super schnell editieren ja doch ich sehe schon den vorteil versus nano weil wenn man sich mal so keine ahnung so die 10 basic wim commandos gemerkt hat"}, {"id": 440, "start": 4089.04, "end": 4109.04, "text": "ist es viel angenehmer in einem terminal editor in einem terminal mit wim zu editieren als mit nano nano ist quasi der klassische gui editor nur ohne gui was blöd ist weil man dann keine maus verwenden kann über ssh und für wim brauchst du keine maus deswegen finde ich wim für kleine editier sachen viel angenehmer"}, {"id": 441, "start": 4109.04, "end": 4138.04, "text": "also ich sehe auch schon vorteil also man muss sich gar nicht man muss sich bei wim gar nicht so viel merken es reichen ja schon so die standarddinger ja also wo haben wir denn hier was zum beispiel was mache ich in wim wenn ich jetzt hier dieses wenn ich das hier wenn ich das hier ersetzen will durch was anderes was mache ich dann in wim dann sage ich einfach c"}, {"id": 442, "start": 4138.04, "end": 4162.04, "text": "moment ci anführungszeichen zack so rückgängig das ist halt sehr praktisch das sind so sachen die machst du im nano nicht nebenbei sondern hast du was wie lösche ab hier bis zu bis zum zeilen ende ändert dieses eine wort ja wim kann sogar zählen übrigens"}, {"id": 443, "start": 4162.04, "end": 4191.04, "text": "eigentlich ein feature was kein mensch braucht aber trotzdem irgendwie nice ist gibt es sonst noch zu zeigen aber wenn man sich die paar basics die paar basics merkt die basics genau du kannst mit g hoch und mit groß g runter also groß g"}, {"id": 444, "start": 4191.04, "end": 4208.04, "text": "ist nach unten gg ist hoch das suchen in wim ist auch nice zum beispiel was richtig cool ist kannst du nach setz suchen dann kannst du hier durchspringen die unterschiedlichen setz sachen einmal suchen und was man auch machen kann ist mal angenommen ich möchte hier das"}, {"id": 445, "start": 4208.04, "end": 4232.04, "text": "highlighten überall überall im gesamten dokument habe ich irgendwas was es noch mehrfach gibt hier if dann gehe ich drauf und rückstärnchen und dann highlight der mir alle ifs das sind die sind die sind einfach praktisch deswegen mag ich wim für sachen über ssh zu editieren und sowas"}, {"id": 446, "start": 4232.04, "end": 4247.04, "text": "ja aber letztendlich letztendlich ist es geschmackssache ich will es ja keinem ausreden dass er mit nano editiert oder so genau das ist auch ganz praktisch man kann zum beispiel r drücken dann überschreibt man das alles man kann"}, {"id": 447, "start": 4247.04, "end": 4267.04, "text": "control y drücken dann schreibt er das was die zeile oben drüber ist unten drunter dann gibt es noch richtig nice copy paste features wim kann halt unendlich viel und wenn man sich so die wenn man sich so sagen wir so zehn basic befähle"}, {"id": 448, "start": 4267.04, "end": 4281.04, "text": "gemerkt hat finde ich kommt man damit gerade wenn man über ssh auf der kommando zeile was editiert sehr angenehm zurecht ja so also als als reinen editor verstehe ich dass im vordersteht das würde ich so"}, {"id": 449, "start": 4281.04, "end": 4298.04, "text": "unterschreiben so und wenn es jetzt darum geht wie universell man das einsetzen kann eben für unterschiedliche programmier sprachen und unterschiedliche anwendungsszenarien die quasi obendrauf zum editieren kommen dann sehe ich tatsächlich"}, {"id": 450, "start": 4298.04, "end": 4324.04, "text": "wirklich auch visual studio code auf dem zweiten platz ich zähle jetzt mal wim und neowimmer zusammen an der stelle da sehe ich visual studio code auch auf dem zweiten platz ich weiß dass jetzt wahrscheinlich die ganzen emacs leute sagen oh nein das geht ja gar nicht ich habe auch mal eine ganze weile emacs benutzt aber man muss ehrlicherweise sagen die entwicklung bei vielen plugins bei emacs ist mittlerweile ziemlich eingeschlafen"}, {"id": 451, "start": 4324.04, "end": 4350.04, "text": "emacs leute sind ziemlich ziemlich anti neuerungen was man zum beispiel gesehen hat ich bin mir gar nicht sicher ob es mittlerweile wieder emoji support für emacs gibt es gab es eine ganze weile nicht weil die gesagt haben wir bauen das erst ein wenn es unter allen betriebssystemen der"}, {"id": 452, "start": 4350.04, "end": 4379.04, "text": "open source implementierung für gibt es halt die emacs philosophie ja du kannst beispielsweise org mode heute immer noch nicht ordentlich mit kalt aufsunken auch wenn es plugin dafür gibt aber es funktioniert nicht richtig also ich finde dass mittlerweile visual studio code eigentlich das bessere editor betriebssystem ist als bei emacs und der vorteil der riesen vorteil bei visual studio code ist der gleichzeitig auch der größte nachteil wenn man es so will"}, {"id": 453, "start": 4379.04, "end": 4381.04, "text": "es ist komplett javascript"}, {"id": 454, "start": 4381.04, "end": 4385.04, "text": "es ist kirby musik"}, {"id": 455, "start": 4385.04, "end": 4391.04, "text": "das ist der größte vorteil und nachteil gleichzeitig von visual studio code es ist javascript"}, {"id": 456, "start": 4391.04, "end": 4397.04, "text": "es gibt glaube ich keine programmiersprache aktuell vielleicht wenn es ein python editor wäre oder sowas"}, {"id": 457, "start": 4397.04, "end": 4412.04, "text": "kennst du den atom editor ja atom haben wir haben wir elektronen zu verdanken introducing atom board ne die kenne ich nicht"}, {"id": 458, "start": 4412.04, "end": 4427.04, "text": "die werbung kenne ich nicht zeitmeier"}, {"id": 459, "start": 4427.04, "end": 4433.36, "text": "die"}, {"id": 460, "start": 4433.36, "end": 4442.04, "text": "klingt wie fallout ne klingt wie bioshock klingt wie bioshock"}, {"id": 461, "start": 4442.04, "end": 4463.04, "text": "auf dem ding ja"}, {"id": 462, "start": 4463.04, "end": 4467.04, "text": "mit javascript macht er seine hausautomaten ist auch mutig"}, {"id": 463, "start": 4467.04, "end": 4489.04, "text": "mit atom"}, {"id": 464, "start": 4489.04, "end": 4498.04, "text": "mit atom"}, {"id": 465, "start": 4498.04, "end": 4515.04, "text": "ich mag keinen git support in keinem editor in keiner ide git geht nichts über kommando zeile"}, {"id": 466, "start": 4515.04, "end": 4522.04, "text": "lasst mich raten er verwendet auch atom"}, {"id": 467, "start": 4522.04, "end": 4541.04, "text": "was was soll man ausprobieren eclipse scheiß"}, {"id": 468, "start": 4541.04, "end": 4561.04, "text": "die werbung ist gut"}, {"id": 469, "start": 4561.04, "end": 4572.04, "text": "die werbung ist gut leider atom mittlerweile nicht mehr so angesagt aber wir dürfen einzig vergessen"}, {"id": 470, "start": 4572.04, "end": 4582.04, "text": "wie sieht das atom repo mittlerweile aus wir dürfen einzig vergessen atom wird für ich sag mal nicht für ewig"}, {"id": 471, "start": 4582.04, "end": 4594.04, "text": "aber atom wird für sehr lange zeit weiterleben egal ob da als text editor oder nicht wie gesagt elektron ist aus atom hervorgegangen"}, {"id": 472, "start": 4594.04, "end": 4601.04, "text": "und elektron ist so schnell nicht mehr wegzudenken die ganzen javascript leute freuen sich jetzt dass sie desktop und mobile anwendung machen können"}, {"id": 473, "start": 4601.04, "end": 4612.04, "text": "und das hat er geradezu zur explosion an apps und desktop apps und mobile apps gesorgt die mit javascript und elektron gebastelt wurden"}, {"id": 474, "start": 4612.04, "end": 4622.04, "text": "das haben wir atom zu verdanken zu verdanken ja und also atom wird weiterleben vielleicht auch nicht als text editor aber in jeder elektron anwendung"}, {"id": 475, "start": 4622.04, "end": 4631.04, "text": "zum beispiel in discord by the way also ohne atom hätten wir kein discord zumindest nicht in dieser form"}, {"id": 476, "start": 4631.04, "end": 4639.04, "text": "was hältst du eigentlich vom apple mi ich hab mich damit absolut gar nicht groß beschäftigt so jetzt nochmal ein paar sagen was haben sie sonst noch drin steht"}, {"id": 477, "start": 4639.04, "end": 4648.04, "text": "also wie gesagt die ersten zwei plätze würde ich genauso unterschreiben top man kann imax sicherlich auf den nächsten platz nehmen"}, {"id": 478, "start": 4648.04, "end": 4652.04, "text": "wobei ich gerade finde das sind imax die haben ein bisschen den anschluss verloren"}, {"id": 479, "start": 4652.04, "end": 4662.04, "text": "so was gibt es denn da noch ah seafulllist was haben die sonst noch"}, {"id": 480, "start": 4662.04, "end": 4668.04, "text": "ach moment spacemax und imax sind spacemax ist doch nur eine pluginsammlung für imax im prinzip"}, {"id": 481, "start": 4668.04, "end": 4673.04, "text": "also was haben sie sonst noch gut warum das so weit oben ist kann ich nicht verstehen"}, {"id": 482, "start": 4673.04, "end": 4683.04, "text": "vielleicht weil die folgen ist bei so vielen ich weiß es nicht zu bleiben text verstehe ich rein als editor würde ich den sogar"}, {"id": 483, "start": 4683.04, "end": 4693.04, "text": "hier ja doch passt passt wunderbar mikro kein schimmer warum auch immer das so weit oben ist imax kate aller e-git wer verwendet denn so was"}, {"id": 484, "start": 4693.04, "end": 4699.04, "text": "atom ja ok und notepad plus plus ihr glaubt gar nicht wie viele nord notepad plus plus verwenden"}, {"id": 485, "start": 4699.04, "end": 4714.04, "text": "brackets stimmt den habe ich ja schon wieder komplett vergessen brackets brackets gab es ja auch noch"}, {"id": 486, "start": 4714.04, "end": 4724.04, "text": "das ist der dritte javascript editor im bunde es gab mal visual studio code eclipse brackets und noch ein vierten"}, {"id": 487, "start": 4724.04, "end": 4730.04, "text": "wie hießen der tables irgendwas mit tables kann sich da noch einer dran erinnern leiten die nicht light tables"}, {"id": 488, "start": 4730.04, "end": 4737.04, "text": "irgendwas mit tables hieß der war damals auch übelst gehyped vor einigen jahren und ist glaube ich mittlerweile eingestellt"}, {"id": 489, "start": 4737.04, "end": 4748.04, "text": "irgendwas mit tables war auch so ein javascript editor den rest gut ist im prinzip das gleiche wieder ja doch die liste finde ich gut"}, {"id": 490, "start": 4748.04, "end": 4755.04, "text": "passt passt zum größten teil außer mal also genny oder wie man das das weiß ich nicht was das da oben macht"}, {"id": 491, "start": 4755.04, "end": 4761.04, "text": "das ist nice also die liste würde ich so mehr oder weniger sogar unterschreiben"}, {"id": 492, "start": 4761.04, "end": 4775.04, "text": "ich würde mal interessieren was die leute schreiben space banks ja verstehe ich also das ist eine gute liste die passt so"}, {"id": 493, "start": 4775.04, "end": 4781.04, "text": "je mehr plus desto schlechter ne ich finde es gut was die also das würde ich so mehr oder weniger bis auf ein paar kleine"}, {"id": 494, "start": 4781.04, "end": 4787.04, "text": "änderungen unterschreiben das passt ok oh das ist jetzt natürlich auch eine harte frage was ist also was die beste"}, {"id": 495, "start": 4787.04, "end": 4801.04, "text": "programmiersprache um damit anzufangen ok schauen wir mal ich hoffe da ist nicht c++ unter den top 10"}, {"id": 496, "start": 4801.04, "end": 4810.04, "text": "da ist c++ gar nicht drinnen sehr gut sehr gut eine liste die ich komplett unterschreibe"}, {"id": 497, "start": 4810.04, "end": 4821.04, "text": "zum glück ist da kein c++ drin ja c c ist ja ok aber c++ ist nicht ok"}, {"id": 498, "start": 4821.04, "end": 4828.04, "text": "c++ macht man wenn man nicht möchte dass die leute weiter spaß am programmieren haben"}, {"id": 499, "start": 4828.04, "end": 4836.04, "text": "also zeigen wir mal her ja das kann man das könnte das kann man wirklich bedenkenlos als einstieg empfehlen"}, {"id": 500, "start": 4836.04, "end": 4844.04, "text": "was ist denn der unterschied zwischen c und c++ dass c eigentlich eine ziemlich schlanke lo in sich"}, {"id": 501, "start": 4844.04, "end": 4852.04, "text": "konsistent logische programmiersprache ist und c++ ein riesen zusammengeschusteter haufen müll"}, {"id": 502, "start": 4852.04, "end": 4864.04, "text": "so das ist der unterschied zwischen c und c++ also bei so kann ich als erster nim habe ich noch nie was mitgemacht"}, {"id": 503, "start": 4864.04, "end": 4875.04, "text": "keine ahnung wahrscheinlich haben das die nim fanboys hier hoch gewartet kein schimmer c ganz ehrlich ich würde"}, {"id": 504, "start": 4875.04, "end": 4887.04, "text": "da heute nicht mehr mit c anfangen so mal nebenbei ein bisschen rumkommen aber als erste sprache in der"}, {"id": 505, "start": 4887.04, "end": 4895.04, "text": "heutigen zeit man man sollte finde ich mit einer sprache anfangen wo man auch ein bisschen was sieht was"}, {"id": 506, "start": 4895.04, "end": 4905.04, "text": "passiert und ganz ehrlich c ist langweilig am anfang da machst du das spannendste was du in c machen kannst"}, {"id": 507, "start": 4905.04, "end": 4916.04, "text": "am anfang ist terminal input und output das ist ultra langweilig mit piste kannst du viel mehr sachen machen am anfang"}, {"id": 508, "start": 4916.04, "end": 4927.04, "text": "ja also das würde ich so würde ich so gelten lassen das kann ich nichts zu sagen kann man machen würde ich auch"}, {"id": 509, "start": 4927.04, "end": 4935.04, "text": "nicht unbedingt als einstieg wish also warum ist es wish empfehlen ruby auf jeden fall ruby ist eine top einsteiger"}, {"id": 510, "start": 4935.04, "end": 4941.04, "text": "programmiersprache finde ich leider in letzter zeit ein bisschen aus der mode gekommen ich hoffe dass mit"}, {"id": 511, "start": 4941.04, "end": 4952.04, "text": "ruby ruby 5 ist es jetzt oder ruby 4 oder wann kommt denn das oder ist ruby 5 was jetzt kommt"}, {"id": 512, "start": 4952.04, "end": 4977.04, "text": "ne ruby 3 ich habe das mit wells durcheinander gebracht ruby 3 kommt jetzt genau weil ich hoffe dass ruby mit ruby 3"}, {"id": 513, "start": 4977.04, "end": 4987.04, "text": "wieder ein bisschen aufwind bekommt denn sie haben richtig viele geile sachen gemacht in ruby 3 ruby ist jetzt"}, {"id": 514, "start": 4987.04, "end": 4993.04, "text": "massiv viel schneller im vergleich zu früher ich meine ruby ist jetzt nicht hier irgendwie bei"}, {"id": 515, "start": 4993.04, "end": 5000.04, "text": "c sharp oder oder go oder c oder so in der nähe aber ruby dürfte doch schon mal ordentlich zulegen mit der"}, {"id": 516, "start": 5000.04, "end": 5009.04, "text": "nächsten version wann geht es weiter mit dudes unter überwachungskamera was den anfang verpasst wir gucken"}, {"id": 517, "start": 5009.04, "end": 5014.04, "text": "gerade ob das irgendwelche memory leaks hat scheint aber nicht so zu sein"}, {"id": 518, "start": 5014.04, "end": 5032.04, "text": "oh genau die haben auch viel gemacht was multiflating angeht also ich hoffe weil ruby ist nebenbei c sharp"}, {"id": 519, "start": 5032.04, "end": 5048.04, "text": "meine absolute lieblingsprogrammiersprache ich hoffe dass die mit ruby 3 wieder ordentlich zulegen"}, {"id": 520, "start": 5048.04, "end": 5056.04, "text": "future of ruby den habe ich nicht geguckt aber der typ also mats ist übelst big brainer typ mit was würdest du als"}, {"id": 521, "start": 5056.04, "end": 5062.04, "text": "anfänger beginnen das sage ich gleich was zu wenn ich hier diese wenn ich die sache durch habe ich habe da"}, {"id": 522, "start": 5062.04, "end": 5068.04, "text": "nämlich meine eigene ansicht zu mit was man am besten anfangen sollte aber pyson ist prinzipiell echt nicht"}, {"id": 523, "start": 5068.04, "end": 5073.04, "text": "verkehrt ja also das könne ich so stehen lassen zähne ich ruby würde ich auf jeden fall auch hier oben hin ansehen"}, {"id": 524, "start": 5073.04, "end": 5078.04, "text": "racket keine ahnung ich weiß gar nicht so genau was es ist wahrscheinlich irgendwas was zu javascript"}, {"id": 525, "start": 5078.04, "end": 5086.04, "text": "kompiliert also javascript ganz ehrlich in der heutigen zeit was macht ruby attraktiv ehrlich gesagt"}, {"id": 526, "start": 5086.04, "end": 5091.04, "text": "hauptsächlich die syntax früher hätte ich noch gesagt weil es halt viele viele libraries und gems zur"}, {"id": 527, "start": 5091.04, "end": 5096.04, "text": "auswahl gibt das ruby ökosystem hat ein bisschen gelitten die letzten jahre über dadurch dass rails immer"}, {"id": 528, "start": 5096.04, "end": 5104.04, "text": "unbeliebter geworden ist also was ruby attraktiv macht ist dass ruby eine programmiersprache ist die gemacht"}, {"id": 529, "start": 5104.04, "end": 5112.04, "text": "wird dass sich programmierer wohlfühlen ruby on rails war mal der der mit der also kann man auch gar nicht"}, {"id": 530, "start": 5112.04, "end": 5118.04, "text": "sagen dass das der shit war das war der der näher boden für die ganzen wir haben es wie ist das damals"}, {"id": 531, "start": 5118.04, "end": 5124.04, "text": "rockstar programmer und nicht die typen die gta programmieren sondern die dies quasi so so krass geil"}, {"id": 532, "start": 5124.04, "end": 5130.04, "text": "programmieren können dass sie so famous werden wie rockstars die ganzen rockstar programmer die haben"}, {"id": 533, "start": 5130.04, "end": 5142.04, "text": "damals ruby programmiert ja sinatra war auch top also ruby ist echt super ich hoffe dass mit ruby 3"}, {"id": 534, "start": 5142.04, "end": 5148.04, "text": "wieder wieder aufwärts geht so javascript meiner meinung nach müsste javascript exakt hier oben bei"}, {"id": 535, "start": 5148.04, "end": 5155.04, "text": "390 stehen mit python weil javascript in der heutigen zeit nicht wegzudenken ist egal wie du kannst"}, {"id": 536, "start": 5155.04, "end": 5164.04, "text": "kein meinung zu pearl right only aber ich habe jahre kein pearl mehr gemacht habe ich auch nicht"}, {"id": 537, "start": 5164.04, "end": 5173.04, "text": "habe ich auch nicht vor was wollte ich jetzt gerade sagen also gerade in der heutigen zeit egal ob du"}, {"id": 538, "start": 5173.04, "end": 5180.04, "text": "backend frontend sonst was lieber machst du kommst an javascript nicht mehr vorbei javascript ist"}, {"id": 539, "start": 5180.04, "end": 5189.04, "text": "überall und ein bisschen frontend muss heute auch jeder können und das schöne bei javascript ist"}, {"id": 540, "start": 5189.04, "end": 5195.04, "text": "man sieht was man macht nämlich im browser was und man sieht was und das ist das wo ich der meinung"}, {"id": 541, "start": 5195.04, "end": 5201.32, "text": "bin dass das die ein dass das einsteiger am meisten motiviert wenn sie sehen dass was passiert wenn"}, {"id": 542, "start": 5201.32, "end": 5212.32, "text": "sie was machen deswegen denke ich dass javascript ganz weit oben mit python stehen muss nämlich noch"}, {"id": 543, "start": 5212.32, "end": 5218.08, "text": "aus dem weiteren grund javascript ist mittlerweile auch einfach zu lernen nicht so sehr wegen der"}, {"id": 544, "start": 5218.08, "end": 5224.36, "text": "sprache die sprache ist auch jetzt nicht extrem schwer aber es gibt glaube ich für javascript"}, {"id": 545, "start": 5224.36, "end": 5231.92, "text": "mehr tutorials und mehr guides und mehr kurse und mehr libraries und mehr alles als für jede"}, {"id": 546, "start": 5231.92, "end": 5241.04, "text": "andere programmier sprache auf der welt deswegen ist javascript meiner meinung kann das ganze wenn"}, {"id": 547, "start": 5241.04, "end": 5248.2, "text": "es wenn wenn ich diese liste machen müsste ja so nach den kriterien wie ich denke dass es für"}, {"id": 548, "start": 5248.2, "end": 5254.68, "text": "leute sich eignet zum einsteigen auch gerade von der motivation und wie gut man progress sieht ich"}, {"id": 549, "start": 5254.68, "end": 5263.8, "text": "würde ehrlich gesagt ohne scheiß ich würde javascript auf platz eins setzen gab es da nicht"}, {"id": 550, "start": 5263.8, "end": 5268.68, "text": "mal so eine gab es da nicht mal so eine seite wo man programmier sprachen tier rankings machen"}, {"id": 551, "start": 5268.68, "end": 5288.56, "text": "konnte tier ranking genau das da das was der hier im video zeigt diese seite was ist denn das"}, {"id": 552, "start": 5288.56, "end": 5299.16, "text": "wie heißt denn das rank"}, {"id": 553, "start": 5299.16, "end": 5320.52, "text": "tier maker genau da fehlen aber ganz schön viele noch da fehlen aber ganz schön viele"}, {"id": 554, "start": 5320.52, "end": 5330.12, "text": "noch also ok ok also wir fangen jetzt mal an ist hier wir machen mal die einfachen sein ist hier"}, {"id": 555, "start": 5330.12, "end": 5340.88, "text": "das ist schon mal relativ einfach so das haben wir schon mal ganz gut verteilt so"}, {"id": 556, "start": 5340.88, "end": 5349.64, "text": "ja"}, {"id": 557, "start": 5355.04, "end": 5357.24, "text": "meine persönliche präferenz alles hier ja"}, {"id": 558, "start": 5365.6, "end": 5370.24, "text": "was ist das überhaupt was ist das hatte man da was das für eine programmier sprache ist"}, {"id": 559, "start": 5370.24, "end": 5379.6, "text": "powershell ist das powershell ist das powershell könnte powershell sein oder"}, {"id": 560, "start": 5379.6, "end": 5388.84, "text": "powershell png excellent das war jetzt auch der übelste hacker way das rauszukriegen oder"}, {"id": 561, "start": 5388.84, "end": 5398.04, "text": "wahrscheinlich steht irgendwo so powershell ist ok wenn man ftn ich habe keine ahnung was ftn ist"}, {"id": 562, "start": 5398.04, "end": 5403.2, "text": "das ist ja keine programmier sprache in dem sinn"}, {"id": 563, "start": 5403.2, "end": 5430.96, "text": "wichita basic jetzt kann ich nichts zu sagen swift das ist swift oder ist das swift swift habe ich"}, {"id": 564, "start": 5430.96, "end": 5458.32, "text": "keine ahnung von ganz ehrlich ganz ehrlich ich tendiere zu b so scheiße ist php gar nicht"}, {"id": 565, "start": 5461.96, "end": 5469.32, "text": "die vba was was ist denn das"}, {"id": 566, "start": 5469.32, "end": 5490.28, "text": "mehr klammern igitt geh mal weg hey monka es latex aber das weiß ich nicht was es ist"}, {"id": 567, "start": 5490.28, "end": 5500.36, "text": "es kann ich nichts zu sagen bestimmt bestimmt übelst für die big brain leute ist das mega nice das"}, {"id": 568, "start": 5500.36, "end": 5510.56, "text": "ist kotlin ja kann ich kann ich nichts zu sagen aber ich tendiere hier zu ja ok es ist nicht total"}, {"id": 569, "start": 5510.56, "end": 5526.88, "text": "akram mal was dahin was ist das css gut das ist bash bash ok die sprache ist scheiße also"}, {"id": 570, "start": 5526.88, "end": 5545.68, "text": "bash ist wirklich abartig aber als shell ist ganz nützlich ja so excellent hier ranking java gehört"}, {"id": 571, "start": 5545.68, "end": 5558.12, "text": "unter z++ ne ne ne ne ne ne unter z++ gehört nix wenn ihr mich kennt wisst ihr genau dass"}, {"id": 572, "start": 5558.12, "end": 5567.44, "text": "diese zwei dinger oben stehen oder aber ich ich bin begeistert so wenn ich das so sehe dass ich"}, {"id": 573, "start": 5567.44, "end": 5572.52, "text": "eigentlich gegen viele sprachen dass ich die meisten eigentlich ganz gern hab so also ich"}, {"id": 574, "start": 5572.52, "end": 5579.24, "text": "seh ist ok go javascript gut hat hier mehr lasst mal aus vor rast bei kotlin gut kann ich wenigst"}, {"id": 575, "start": 5579.24, "end": 5585.36, "text": "zu sagen aber wobei ganz ehrlich ich da muss ich ich wusste eigentlich swift auch recht hoch"}, {"id": 576, "start": 5585.36, "end": 5592.4, "text": "mal alles was ich bisher von swift gesehen habe aber nicht schlecht gut power shell ist ok"}, {"id": 577, "start": 5592.4, "end": 5610.0, "text": "mys gelb hp das ist alles in ordnung save postet es mal in discord kann jeder kann jeder mal seinen"}, {"id": 578, "start": 5610.0, "end": 5619.04, "text": "seinen selbst dazu geben ja moment das ist das ist programming language tier es ist nicht zum"}, {"id": 579, "start": 5619.04, "end": 5623.32, "text": "lernen was zum lernen ist da habe ich mir hier gerade drüber ausgelassen wie gesagt ich würde"}, {"id": 580, "start": 5623.32, "end": 5629.84, "text": "peißen und javascript ganz oben hin packen zum lernen und persönliche präferenz würde ich"}, {"id": 581, "start": 5629.84, "end": 5634.8, "text": "schaap und ruby drum runter packen gerade sie schaap finde ich ist auch eine super programmier"}, {"id": 582, "start": 5634.8, "end": 5642.44, "text": "sprache zum einsteigen ich gucke an die anderen sachen durch paskal was ist mit euch was mit"}, {"id": 583, "start": 5642.44, "end": 5649.44, "text": "denen los warum ich also ich denke sie schaap ist auch eine top einstiegssprache denn der große"}, {"id": 584, "start": 5649.44, "end": 5657.88, "text": "vorteil von sie schaap gegen alle anderen die man hier sieht ist du kannst damit wirklich es"}, {"id": 585, "start": 5657.88, "end": 5665.8, "text": "gibt eigentlich nichts was du nicht machen kannst in sie schaap sei es irgendwelche low level"}, {"id": 586, "start": 5665.8, "end": 5673.08, "text": "geschichten die interop mit c sachen so ist mittlerweile auch super low level geschichten kannst du performant"}, {"id": 587, "start": 5673.08, "end": 5679.08, "text": "und schnell machen du kannst web geschichten machen du kannst server geschichten machen du"}, {"id": 588, "start": 5679.08, "end": 5683.44, "text": "kannst automatisierungsgeschichten machen du kannst muis machen du kannst du kannst in sie schaap"}, {"id": 589, "start": 5683.44, "end": 5693.52, "text": "wirklich alles machen sogar mobile apps du kannst in sie schaap wirklich einfach alles machen und ich"}, {"id": 590, "start": 5693.52, "end": 5700.48, "text": "finde da gibt es nicht viele programmier sprachen wo das gut geht und zumal sie schaap in allen"}, {"id": 591, "start": 5700.48, "end": 5707.96, "text": "bereichen auch gut ist das ist nicht so wie beispielsweise kann sie mit pisen auch theoretisch"}, {"id": 592, "start": 5707.96, "end": 5712.76, "text": "alles machen aber sobald es mal ein bisschen wums braucht bist du da halt aufgeschmissen"}, {"id": 593, "start": 5712.76, "end": 5725.72, "text": "sei du hast irgendwelche c extensions was bei sie schüchter dich der workflow ein warum also"}, {"id": 594, "start": 5725.72, "end": 5730.44, "text": "man muss sagen sie schaap hat mit abstand ihr wisst ich bin sie schaap fanboy aber das ist"}, {"id": 595, "start": 5730.44, "end": 5735.92, "text": "was da bin ich da bin ich wirklich auch überzeugt sie schaap hat mit abstand die besten developer"}, {"id": 596, "start": 5735.92, "end": 5745.28, "text": "tools da kann man microsoft halten wie man will das zeug ist wirklich gut und jetzt sogar ohne"}, {"id": 597, "start": 5745.28, "end": 5769.0, "text": "main ja guck mal wie toll die ganze autocomplete und und code assist geschichte funktioniert in"}, {"id": 598, "start": 5769.0, "end": 5775.36, "text": "dotnet und guckt euch mal an für wie selbstverständlich man das hält wenn man eine weile"}, {"id": 599, "start": 5775.36, "end": 5779.8, "text": "sie schaap dort net programmiert hat und dann guckt euch mal die liste dieser programmier"}, {"id": 600, "start": 5779.8, "end": 5787.88, "text": "sprachen an wo ist es denn ähnlich gut eigentlich bei keiner ja bei pisen nicht allein durch das"}, {"id": 601, "start": 5787.88, "end": 5794.6, "text": "dynamische geht gar nicht nimmt keine ahnung c definitiv nicht ruby definitiv auch nicht javascript"}, {"id": 602, "start": 5794.6, "end": 5801.4, "text": "definitiv nicht kotlin kann sein weiß ich nicht go auf gar keinen fall nur auch auf gar keinen"}, {"id": 603, "start": 5801.4, "end": 5807.0, "text": "fall lexie aber garantiert nicht es wird immer besser aber ist nicht mal ansatzweise am ehesten"}, {"id": 604, "start": 5807.0, "end": 5814.96, "text": "tat am ehesten tat nein c++ garantiert nicht der c++ die c++ da wo ist es alles steht hier gar nicht"}, {"id": 605, "start": 5814.96, "end": 5825.76, "text": "wo steht c++ hat so viele ecken und kanten auch im tool support vom editor zum beispiel wenn du"}, {"id": 606, "start": 5825.76, "end": 5836.28, "text": "ein callback hast mit auto return type ein auto return type ist ja in c++ nicht wirklich auto"}, {"id": 607, "start": 5836.28, "end": 5844.52, "text": "sondern es steht zur compile zeit fest die meisten editors ob es bei sea lion auch so ist weiß ich"}, {"id": 608, "start": 5844.52, "end": 5851.16, "text": "nicht die meisten editors schaffen es nicht diesen auto return type aufzulösen zu dem was es wirklich"}, {"id": 609, "start": 5851.16, "end": 5858.92, "text": "ist so und das einzige was jetzt noch ansatzweise mithalten kann was support und developer tools"}, {"id": 610, "start": 5858.92, "end": 5865.8, "text": "und sonst was angeht und und und quasi unterstützungen editor mit c sharp ist für dich ehrlich gesagt am"}, {"id": 611, "start": 5865.8, "end": 5874.84, "text": "ehesten sagen typescript noch aber das kommt nicht von ungefähr weil der c sharp erfinder oder"}, {"id": 612, "start": 5874.84, "end": 5885.44, "text": "typescript erfinder der gleiche dude ist das der gleiche typ das war c sharp war quasi anders"}, {"id": 613, "start": 5885.44, "end": 5891.4, "text": "haltsberg bevor er typescript gemacht hat und ich weiß es gar nicht ob man den wirklich so"}, {"id": 614, "start": 5891.4, "end": 5898.28, "text": "ausspricht es kommt nicht von ungefähr dass das ähnlich ist ja und ich glaube davor hat"}, {"id": 615, "start": 5898.28, "end": 5907.96, "text": "irgendwas mit paskalle gemacht oder delphi oder so riecht krasse dude ja so so viel zu tun genau"}, {"id": 616, "start": 5907.96, "end": 5915.08, "text": "und mich hat dir vorher jemand gefragt mit was würdest du als anfänger beginnen jetzt mal so als"}, {"id": 617, "start": 5915.08, "end": 5919.88, "text": "kontrast nachdem ich jetzt gerade übelst krasse scharp gelobt habe und erzählt habe wie toll"}, {"id": 618, "start": 5919.88, "end": 5924.64, "text": "dass die beste programmier sprache von allen ist anfangen würde ich tatsächlich mit javascript"}, {"id": 619, "start": 5930.64, "end": 5936.08, "text": "ich glaube javascript ist für einsteiger das motivierendste was man machen kann aktuell es"}, {"id": 620, "start": 5936.08, "end": 5943.84, "text": "gibt mit abstand die meisten tutorials kurse und und content für javascript man bekommt"}, {"id": 621, "start": 5943.84, "end": 5950.6, "text": "javascript auch super hilfe das ist für einsteiger wichtig und die natur von javascript dass es eben"}, {"id": 622, "start": 5950.6, "end": 5955.6, "text": "hauptsächlich im browser läuft ist man sieht auch direkt was also sprich man kann direkt was"}, {"id": 623, "start": 5955.6, "end": 5960.8, "text": "grafisches machen man kann direkt was machen wo man vielleicht auch mal andere leuten zeigen kann"}, {"id": 624, "start": 5960.8, "end": 5965.08, "text": "und sagen hier guck mal hab ich gemacht und die sagen cool javascript ist glaube ich für den"}, {"id": 625, "start": 5965.08, "end": 5972.28, "text": "einsteiger aktuell das motivierendste was es gibt kobol stream ja an weihnachten machen kobol"}, {"id": 626, "start": 5972.28, "end": 5982.0, "text": "moin schisi pro ja das ist also ich würde sagen wenn also wenn mich heute jemand fragt mit was"}, {"id": 627, "start": 5982.0, "end": 5987.04, "text": "soll ich anfangen und ich kann nur was ich kann nur eine sprache als antwort nehmen ohne großartig"}, {"id": 628, "start": 5987.04, "end": 5991.56, "text": "auszuholen ich dürfte nur eine sprache nennen und nicht großartig drumherum zusätzlich sagen"}, {"id": 629, "start": 5991.56, "end": 5996.16, "text": "würde ich sagen ja was kippt ansonsten würde ich das sagen was ich eben vorher vorher gesagt habe"}, {"id": 630, "start": 5996.16, "end": 6004.04, "text": "ok was was ist denn was gibt es hier unter linux"}, {"id": 631, "start": 6004.04, "end": 6017.56, "text": "was ist passiert"}, {"id": 632, "start": 6017.56, "end": 6035.52, "text": "wie sucht man hier nach neuen sachen ok also das das was haben sie als nix mehr gut meiner"}, {"id": 633, "start": 6035.52, "end": 6040.2, "text": "meinung nach ist ja ich habe vorhin schon gesagt ich habe keine ahnung ob das da vorne ist der"}, {"id": 634, "start": 6040.2, "end": 6048.76, "text": "beste ist der raspberry pi vom ganzen ökosystem drumherum er ist nicht das schnellste er ist mit"}, {"id": 635, "start": 6048.76, "end": 6056.96, "text": "sicherlich auch nicht der der sparenste oder der der kühlste aber das ökosystem um den raspberry"}, {"id": 636, "start": 6056.96, "end": 6061.6, "text": "pi macht ihn meiner meinung nach zu mit abstand wirklich mit riesem abstand besten singelbord"}, {"id": 637, "start": 6061.6, "end": 6068.28, "text": "computer zu der anderen hier kann ich auch gar nicht viel sagen hier so ein habe ich auch am"}, {"id": 638, "start": 6068.28, "end": 6074.2, "text": "start allerdings in der variante mit sata anschluss der ist auch ok krankt aber eben an support von"}, {"id": 639, "start": 6074.2, "end": 6079.84, "text": "paketen und alle möglichen nie ausprobiert ganz viele raspberry also auch nicht ausprobiert"}, {"id": 640, "start": 6079.84, "end": 6087.64, "text": "raspberry pi finde ich gibt es gar nichts großartig was man da zu erzählen muss so was was gibt"}, {"id": 641, "start": 6087.64, "end": 6093.92, "text": "sie im chat noch hallo max stimme dir zu javascript ist wohl echt am besten zum anfang ich habe"}, {"id": 642, "start": 6093.92, "end": 6098.44, "text": "damals mit cc plus plus angefangen natürlich war das eine katastrophe weil er c++ dabei ist"}, {"id": 643, "start": 6098.44, "end": 6104.92, "text": "alles mit c im namen ist wohl für den anfang sehr frustrierend ja reines c ist dann tatsächlich"}, {"id": 644, "start": 6104.92, "end": 6111.32, "text": "noch am besten wobei halt reines c langweilig zu am anfang ist du kannst ja damit nichts machen"}, {"id": 645, "start": 6111.32, "end": 6123.48, "text": "wirklich was irgendwie ein bisschen eindruck macht kennt jemand gut ressourcen zu sie schab ja du"}, {"id": 646, "start": 6123.48, "end": 6130.76, "text": "kannst also es gibt wenn du gerne bücher dir angucken willst gibt es immer noch das ist zwar"}, {"id": 647, "start": 6130.76, "end": 6137.36, "text": "von 2012 aber von den basics her ist das vollkommen ok und ist auch ganz gut geschrieben also ich"}, {"id": 648, "start": 6137.36, "end": 6140.72, "text": "finde dass es als einstieg wirklich nicht verkehrt wenn man mal wenn man was auf deutsch und in"}, {"id": 649, "start": 6140.72, "end": 6145.36, "text": "buchform haben will du musst ja auch nicht alles angucken du es reicht wenn du dir das ganze anguckst"}, {"id": 650, "start": 6145.36, "end": 6165.52, "text": "bis bis 16 bis inklusive 16 der rest ist nicht so wichtig da hat sich zwar einiges getan aber an"}, {"id": 651, "start": 6165.52, "end": 6169.68, "text": "den basics diese hier beschreiben hat sich nichts geändert das sind nur sachen dazugekommen also zum"}, {"id": 652, "start": 6169.68, "end": 6181.44, "text": "einstieg ist das hier nicht schlecht und ansonsten ist auch oftmals die sachen bei microsoft selbst"}, {"id": 653, "start": 6181.44, "end": 6201.36, "text": "auf channel 9 ist manchmal auch ganz gutes zeug dabei oder halt auf youtube ja ich denke"}, {"id": 654, "start": 6201.36, "end": 6208.0, "text": "bei so mit einem rasperi perler oder so ist spannender als das kommt ganz individuell auf"}, {"id": 655, "start": 6208.0, "end": 6216.64, "text": "die jeweiligen leute an wenn es wenn das jemand ist der gerne hardware bastelt dann ja würde"}, {"id": 656, "start": 6216.64, "end": 6221.56, "text": "ich auch sagen ja wenn es jemand ist der spaß daran hat leds blinken zu lassen oder vielleicht"}, {"id": 657, "start": 6221.56, "end": 6226.92, "text": "man irgendwie motor anzusteuern oder oder sonst wie irgendwelche sensoren auszulesen oder so"}, {"id": 658, "start": 6226.92, "end": 6233.36, "text": "dann ist es bestimmt spannender aber die meisten leute den fehlt schon mal so komplett die"}, {"id": 659, "start": 6233.36, "end": 6238.36, "text": "vorstellung was sie eigentlich machen könnten und da ist es im browser wirklich ganz gut weil"}, {"id": 660, "start": 6238.36, "end": 6242.72, "text": "im browser da kommt da kommt so eins zum anderen ja du machst dir eine webseite bastelt bis"}, {"id": 661, "start": 6242.72, "end": 6247.88, "text": "drum sagt ja ich hätte jetzt gerne vielleicht dort irgendwie in den bild und er hätte jetzt aber wenn"}, {"id": 662, "start": 6247.88, "end": 6252.44, "text": "ich da drauf klicke hätte ich gerne dass das bild fullscreen wird und so was ich glaube browser"}, {"id": 663, "start": 6252.44, "end": 6257.72, "text": "ist da zum einsteigen immer noch am besten du hast du schon basic angefangen exzellent"}, {"id": 664, "start": 6257.72, "end": 6270.48, "text": "ich habe mal einen kurs gemacht wo ich kann halt war ich da 13 oder so ne warte mal das war"}, {"id": 665, "start": 6270.48, "end": 6280.68, "text": "98 98 war ich 14 14 den kurs gemacht wischel basic alles war das war vb 6 0 damals noch"}, {"id": 666, "start": 6280.68, "end": 6293.16, "text": "wischel basic 6 war das habe ich einen kurs gemacht mit 14 und das war schlimm im nachhinein"}, {"id": 667, "start": 6293.16, "end": 6298.4, "text": "betrachtet das war so scheiße dass wir dann zwischendrin in der pause immer half life auf"}, {"id": 668, "start": 6298.4, "end": 6304.12, "text": "den schulungsrechner gespielt haben deswegen weiß ich auch dass es 98 gewesen sein muss"}, {"id": 669, "start": 6304.12, "end": 6321.4, "text": "half life kam 98 so was max frage o was ubuntu direkt aus dem root was"}, {"id": 670, "start": 6329.8, "end": 6333.08, "text": "ja wahrscheinlich verwende es irgendwelche relativen fahnen muss dem richtigen"}, {"id": 671, "start": 6333.08, "end": 6336.08, "text": "verzeichnis sein keine ahnung wo soll ich das wissen"}, {"id": 672, "start": 6336.08, "end": 6343.88, "text": "sollte gerade noch mal die fragen durch scrollen dass ich nichts vergesse"}, {"id": 673, "start": 6357.88, "end": 6362.08, "text": "stimmt ja wo wir auch wieder beim thema sind dass du mit z sharp alles machen kannst sogar"}, {"id": 674, "start": 6362.08, "end": 6368.96, "text": "spielerentwicklung ich glaube ich habe gar nichts großartig übersehen mache ich"}, {"id": 675, "start": 6373.52, "end": 6374.52, "text": "das das ist wahr"}, {"id": 676, "start": 6374.52, "end": 6388.36, "text": "ok gut"}, {"id": 677, "start": 6388.36, "end": 6397.36, "text": "eins geht und zwei nicht"}, {"id": 678, "start": 6406.68, "end": 6411.76, "text": "keine ahnung dass das ist etwas spezifisches hier das kann ich dir nicht sagen was der da warum"}, {"id": 679, "start": 6411.76, "end": 6425.08, "text": "das nicht geht so aber memory leak wir haben kein memory leak guck mal wir sind immer noch"}, {"id": 680, "start": 6425.08, "end": 6432.12, "text": "ungefähr genauso viel mb wie vorhin also kein memory leak konfront mit den speicher hier sind"}, {"id": 681, "start": 6432.12, "end": 6439.8, "text": "wir bei 214 mb und jetzt gehen wir mal hoch 240 nein das ist ungefähr immer gleich bis"}, {"id": 682, "start": 6439.8, "end": 6449.64, "text": "der gar mit collector mal rund wir haben kein memory leak memory leak frei konfront und das"}, {"id": 683, "start": 6449.64, "end": 6465.84, "text": "bei so viel native ffm pack rumgegräbse da kann man nur sagen und es kackt auch nicht ab"}, {"id": 684, "start": 6465.84, "end": 6472.44, "text": "oder so es funktioniert einfach das läuft jetzt hier schon seit einer stunde oder so"}, {"id": 685, "start": 6472.44, "end": 6475.92, "text": "mit ein paar videos macht die ganze objekterkennung und er erkennt den"}, {"id": 686, "start": 6475.92, "end": 6482.44, "text": "gaul immer noch nicht aber darauf ist auch nicht trainiert aber was haben die sonst noch"}, {"id": 687, "start": 6482.44, "end": 6491.6, "text": "für questions übrigens leute morgen geht zum zahnarzt ich habe keinen bock zum zahnarzt zu"}, {"id": 688, "start": 6491.6, "end": 6504.68, "text": "gehen ich sponks so was haben wir hier sonst noch für sachen best 3d game engines ok kann"}, {"id": 689, "start": 6504.68, "end": 6513.32, "text": "ich nichts zu sagen kann ich mich nur mit aus beste git clients ok da kann ich was zu sagen"}, {"id": 690, "start": 6513.32, "end": 6525.64, "text": "gar keiner davon alles kacke braucht man nicht kommando zeile beste alles müll alles weg nur"}, {"id": 691, "start": 6525.64, "end": 6546.84, "text": "git kommando zeile das einzig wahre alles alles wegschweißen hier alles kacke braucht man nicht"}, {"id": 692, "start": 6546.84, "end": 6554.2, "text": "das muss ich mir jetzt an sekunde wartet mal ich mach das mal hier lieber im browser in der vm ich"}, {"id": 693, "start": 6554.2, "end": 6568.76, "text": "weiß nicht wo ich da rauskommen das sieht aus wisst ihr was das sieht aus wie einen elektron"}, {"id": 694, "start": 6568.76, "end": 6586.04, "text": "gui das ist das bestimmt elektron meinte nicht auch welche sprache auch das ist eine gute"}, {"id": 695, "start": 6586.04, "end": 6597.2, "text": "frage da muss ich mir gedanken zu machen welche sprache kopiere ich mir mal welche sprache"}, {"id": 696, "start": 6597.2, "end": 6606.2, "text": "sollte man für 2021 auf dem schirm haben da muss ich mir gedanken zu machen aber das bestimmt"}, {"id": 697, "start": 6606.2, "end": 6618.6, "text": "elektron hier das kommt mir nicht in die tüte alle git guis brauchen wir nicht git guis"}, {"id": 698, "start": 6618.6, "end": 6634.84, "text": "overrated jebaited brauchen wir nicht alles überflüssig ganz einfach beantwortet was sind"}, {"id": 699, "start": 6634.84, "end": 6642.56, "text": "die besten java script idees or editors wishlist studio code webstorm ja webstorm vielleicht webstorm"}, {"id": 700, "start": 6642.56, "end": 6651.64, "text": "habe ich nie großartig ausprobiert nur mal kurz hier im stream war okay war okay aber ehrlich"}, {"id": 701, "start": 6651.64, "end": 6656.96, "text": "gesagt es bei mir lässt jetzt wishlist studio code was javascript angeht wenig wünsche offen"}, {"id": 702, "start": 6656.96, "end": 6670.92, "text": "atom geht bestimmt auch gut neowim das schöne an javascript ist dass viele sachen quasi unab"}, {"id": 703, "start": 6670.92, "end": 6674.32, "text": "editor unabhängig sind an tools die muss man quasi dann nur indem wir mal den editor"}, {"id": 704, "start": 6674.32, "end": 6683.76, "text": "ordentlich einbinden bei mir ist code sagt die autocompletion echt ich habe mich bei"}, {"id": 705, "start": 6683.76, "end": 6695.6, "text": "javascript quasi schon dran gewöhnt dass es quasi kein autocompletion gibt ne man muss"}, {"id": 706, "start": 6695.6, "end": 6700.28, "text": "keine doch natürlich muss man geld ausgeben also ich empfehle natürlich selbstverständlich"}, {"id": 707, "start": 6700.28, "end": 6710.32, "text": "niemandem hier die trial version zu verwenden also kauft es euch ja so so pleite mit der"}, {"id": 708, "start": 6710.32, "end": 6729.0, "text": "brackets vielleicht sollte ich mal webstorm wieder ausprobieren wisst ihr was wenn wir"}, {"id": 709, "start": 6729.0, "end": 6751.64, "text": "gerade dabei sind wenn wir gerade dabei sind wenn es denn ihr einfach mal wieder eine runde"}, {"id": 710, "start": 6751.64, "end": 6758.76, "text": "webstorm warum nicht probiere ich die nächsten tage mal aus mal gucken ob ich damit jetzt"}, {"id": 711, "start": 6758.76, "end": 6766.04, "text": "irgendwie den vorteil erkenne oder so weil optisch sieht das ja genauso aus wie die"}, {"id": 712, "start": 6766.04, "end": 6779.2, "text": "ganze andere in jetbrains geschichten warum hat die warum hat die toolbox jetzt einfach"}, {"id": 713, "start": 6779.2, "end": 6796.68, "text": "90 prozent cpu last verursacht ja natürlich drakula was sonst jetzt ember gibt es das"}, {"id": 714, "start": 6796.68, "end": 6811.64, "text": "überhaupt noch ok es sieht es sieht im prinzip aus wie ganz"}, {"id": 715, "start": 6811.64, "end": 6834.88, "text": "normales jetbrains gedöns wow wie er erst mal 30 milliarden sachen anlegt sieht aus"}, {"id": 716, "start": 6834.88, "end": 6843.56, "text": "wie ganz normales jetbrains gedöns ja ach so stimmt ich habe hier npm gar nicht installiert"}, {"id": 717, "start": 6843.56, "end": 6853.08, "text": "lull ich hab hier jahren installiert muss ich mir die tage mal angucken so was was haben"}, {"id": 718, "start": 6853.08, "end": 6870.56, "text": "wir noch so für listen hier zeige ich mal her ok was was für ein ding best productivity"}, {"id": 719, "start": 6870.56, "end": 6877.48, "text": "enhancing well-designed and concise rather than just was für ein ding also was was quasi"}, {"id": 720, "start": 6877.48, "end": 6883.2, "text": "big brain programmiersprachen sind oder was ist die frage also was ist die bigste die"}, {"id": 721, "start": 6883.2, "end": 6887.48, "text": "bigste welche programmiersprache hat das größte hirn oder was ist das für eine frage"}, {"id": 722, "start": 6887.48, "end": 6896.72, "text": "hier ok keine ahnung ich kann zu nimm überhaupt nichts sagen zu smalltalk auch nicht außer"}, {"id": 723, "start": 6896.72, "end": 6902.96, "text": "dass glaube ich viele klammern hat rast ist wirklich nice rast ist wirklich nice aber"}, {"id": 724, "start": 6902.96, "end": 6913.6, "text": "rast ist exploding brain bis man da halbwegs durchblickt es ist ok schieben closure das"}, {"id": 725, "start": 6913.6, "end": 6919.36, "text": "ist für die ganzen klammer fettig ist die die überall die wirklich jede arten von klammern"}, {"id": 726, "start": 6919.36, "end": 6922.48, "text": "die die tastatur her gibt verwenden wollen und die möglichst noch einander geschachtelt"}, {"id": 727, "start": 6922.48, "end": 6930.36, "text": "endlich mal hier die scharfe würde ich da auch ganz weit oben ansehen ruby auch naja"}, {"id": 728, "start": 6930.36, "end": 6940.8, "text": "gut wann ist die jetzt liste jetzt nicht das ist eine gute frage was sind die besten window"}, {"id": 729, "start": 6940.8, "end": 6964.32, "text": "manager für linux i3 gefolgt von dwm x-monat openbox awesome fluxbox was zum teufel herbstluft"}, {"id": 730, "start": 6964.32, "end": 6976.48, "text": "oder das habe ich mal vor jahren irgendwo gelesen enlightenment gala was ist gala überhaupt"}, {"id": 731, "start": 6976.48, "end": 6982.0, "text": "ja also ich muss sagen ja stimme ich voll und ganz zu die drei beste aus dem grund habe"}, {"id": 732, "start": 6982.0, "end": 6994.92, "text": "ich ja selbst nur noch die drei überall ops doch zwei ist auch dabei aber weyland ist"}, {"id": 733, "start": 6994.92, "end": 7012.84, "text": "zu niche was youtube die ls wieder back war youtube die ls back leute auf github youtube"}, {"id": 734, "start": 7012.84, "end": 7040.64, "text": "ls back kein d d m c c d c m a d m c a wie kommts wie kommts dass es wieder da ist ja"}, {"id": 735, "start": 7040.64, "end": 7056.72, "text": "ok wir müssen jetzt mal ein bisschen andere kermi musik machen"}, {"id": 736, "start": 7056.72, "end": 7066.96, "text": "also github stellt youtube die l wieder her dass das schritt excellent satz golem das"}, {"id": 737, "start": 7066.96, "end": 7081.32, "text": "schritt ist wohl dem github chef und der eff zu verdanken was ist denn die eff was das"}, {"id": 738, "start": 7081.32, "end": 7088.0, "text": "hier war das problem hier gucken wir gleich youtube was ist wer ist was ich weiß nicht"}, {"id": 739, "start": 7088.0, "end": 7096.92, "text": "was die eff ist elektronik frontier foundation was für dinger für was für welche für welche"}, {"id": 740, "start": 7096.92, "end": 7103.68, "text": "grenzen sind die zuständig okay haben sie wieder hergestellt nice ok das war das problem"}, {"id": 741, "start": 7103.68, "end": 7123.68, "text": "remove copyright media from tests moment moment das ist das gar nicht das da ist doch einfach"}, {"id": 742, "start": 7123.68, "end": 7129.36, "text": "nur den download link drinnen in den test das kann doch den download link auf youtube"}, {"id": 743, "start": 7129.36, "end": 7137.92, "text": "ist illegal aha ok das wird eigentlich das wird auch so ausgelegt wie es gerade passt"}, {"id": 744, "start": 7137.92, "end": 7167.04, "text": "alle nice nice"}, {"id": 745, "start": 7167.04, "end": 7177.56, "text": "das ist aber überhaupt nicht also die sagen ja hier die sagen ja hier ok das hier war"}, {"id": 746, "start": 7177.56, "end": 7181.92, "text": "wohl das problem und deswegen wurde es runter genommen ich wette mit euch leute die haben"}, {"id": 747, "start": 7181.92, "end": 7187.0, "text": "youtube die l down genommen weil es youtube die l an sich nicht mögen ja weil sie nicht"}, {"id": 748, "start": 7187.0, "end": 7189.96, "text": "mögen dass man youtube videos runterladen kann deswegen haben sie youtube die l down"}, {"id": 749, "start": 7189.96, "end": 7195.4, "text": "genommen und das hat dann so einen wind gemacht dass sie sich gedacht haben auf fack damit"}, {"id": 750, "start": 7195.4, "end": 7201.6, "text": "haben wir jetzt nicht gerechnet wir schieben jetzt da mal was vor woran es gelegen hat"}, {"id": 751, "start": 7201.6, "end": 7206.96, "text": "und wenn sie das entfernen können sie wieder online gehen die haben garantiert diese vorwand"}, {"id": 752, "start": 7206.96, "end": 7211.76, "text": "gesucht um youtube die l down zu nehmen aber man hat ja gesehen dass es nicht funktioniert"}, {"id": 753, "start": 7211.76, "end": 7218.08, "text": "hat übrigens wisst ihr was noch was viel lustiger war in dem offiziellen dcma dmc"}, {"id": 754, "start": 7218.08, "end": 7227.76, "text": "dns repo von github haben die einen bug ausgenutzt den github schon seit ein paar jahren kennt"}, {"id": 755, "start": 7227.76, "end": 7233.04, "text": "aber nicht fixen wollte um einen kommentar in einem issue den kompletten youtube die"}, {"id": 756, "start": 7233.04, "end": 7238.72, "text": "l sourcecode anzuhängen also sie haben quasi in dem repo wo die copyright strikes gesammelt"}, {"id": 757, "start": 7238.72, "end": 7244.04, "text": "werden wenn man so will die den sourcecode der copyright strike wurde noch mal angehängt"}, {"id": 758, "start": 7244.04, "end": 7251.08, "text": "über eine sicherheitslücke aufgetan also dir versteht kein spaß aber gott sei dank"}, {"id": 759, "start": 7251.08, "end": 7255.8, "text": "ist das ding wieder da youtube tl beste und wisst ihr was man da auch wieder wunderbar"}, {"id": 760, "start": 7255.8, "end": 7265.26, "text": "sieht so was stört ein open source projekt nur teilweise die software ist weiterhin da"}, {"id": 761, "start": 7265.26, "end": 7269.84, "text": "weiterhin verfügbar es gibt nicht eine quelle die man ausschalten muss und das programm"}, {"id": 762, "start": 7269.84, "end": 7279.4, "text": "ist weg es gab 30 millionen mirros auf der welt ja also wunderbar ja was youtube die l"}, {"id": 763, "start": 7279.4, "end": 7285.48, "text": "ist ja ein programm wo man youtube videos mit runterladen kann in unterschiedlicher"}, {"id": 764, "start": 7285.48, "end": 7293.44, "text": "qualität mit diesem programm beispielsweise auch dieses testvideo runtergeladen von youtube"}, {"id": 765, "start": 7293.44, "end": 7309.08, "text": "wo ich gerade teste ob ich memory leaks in meiner anwendung aber sieht nicht so aus"}, {"id": 766, "start": 7309.08, "end": 7313.84, "text": "so da bin ich froh dass youtube wieder da ist das ist sehr sehr nice"}, {"id": 767, "start": 7313.84, "end": 7330.24, "text": "exzellent ja hier stimme ich zu i3 wm bester window manager gibt es nix"}, {"id": 768, "start": 7330.24, "end": 7334.96, "text": "beste linux terminal emulator ok da kann man sich jetzt auch drüber streiten"}, {"id": 769, "start": 7334.96, "end": 7354.4, "text": "best keyboards schwer zu sagen weil was kostet das was wollen die ernsthaft 642 oder"}, {"id": 770, "start": 7354.4, "end": 7375.04, "text": "ich weiß auch gar nicht so viel"}, {"id": 771, "start": 7375.04, "end": 7389.56, "text": "ist doch gar nicht so viel exzellent ist das ihr habt das gehört exzellent ok ich glaube"}, {"id": 772, "start": 7389.56, "end": 7402.44, "text": "die preise sind nicht so ganz realistisch damit würde ich im leben nicht programmieren"}, {"id": 773, "start": 7402.44, "end": 7410.2, "text": "damit komme ich nicht klar also damit würde ich definitiv nicht klarkommen ich weiß guckt"}, {"id": 774, "start": 7410.2, "end": 7434.92, "text": "euch das ding mal an was ist das das sieht aus als hat sich einer auf die"}, {"id": 775, "start": 7434.92, "end": 7441.12, "text": "tastatur gekniet als hat als hat der der fliesen leger die tastatur als untersetzer genommen"}, {"id": 776, "start": 7441.12, "end": 7446.0, "text": "so sieht das aus ich kann mich nicht vorstellen dass ich das"}, {"id": 777, "start": 7446.0, "end": 7450.88, "text": "als wahnsinnig ergonomisch empfinden würde du findest doch die tasten gar nicht wieder"}, {"id": 778, "start": 7450.88, "end": 7454.8, "text": "du greifst du greifst von der tastatur weg an die maus und brauchst erst mal einen halben"}, {"id": 779, "start": 7454.8, "end": 7470.28, "text": "tag bis du wieder die tastatur gefunden hast das kann ich nicht mit arbeiten"}, {"id": 780, "start": 7484.8, "end": 7501.52, "text": "ist meine ducky ducky skyline dabei lull der supercoder 2000 was denn der supercoder"}, {"id": 781, "start": 7501.52, "end": 7522.12, "text": "2000 beste tastatur allzeit dann 0 1 mehr braucht man nicht besser das ist fast so gut"}, {"id": 782, "start": 7522.12, "end": 7534.12, "text": "wie diese steuerung alt entfernen tastatur wie für windows best cloud idees verwende"}, {"id": 783, "start": 7534.12, "end": 7543.16, "text": "ich nicht kann ich nichts zu sagen ok die fragen wiederholen sich ja sehe ich auch so"}, {"id": 784, "start": 7543.16, "end": 7552.08, "text": "manch auch nach was kann man was haben die da sonst noch für sachen popular text pc"}, {"id": 785, "start": 7552.08, "end": 7562.36, "text": "und dann ok development nach rekommend recommendations"}, {"id": 786, "start": 7562.36, "end": 7571.92, "text": "mai sql guise who cares was interessiert mich mal sql guise beste launcher ich habe"}, {"id": 787, "start": 7571.92, "end": 7580.64, "text": "eigentlich nur in move und nova launcher am start was gibt es bei pc best voice chat"}, {"id": 788, "start": 7580.64, "end": 7608.6, "text": "for gaming naja aufgrund der verbreitung würde ich tatsächlich sagen discord ts 3 der chat"}, {"id": 789, "start": 7608.6, "end": 7613.8, "text": "wieder aber verbreitungsmäßig ist discord einfach nicht zu toppen aktuell"}, {"id": 790, "start": 7613.8, "end": 7631.12, "text": "ok das jetzt soll ich soll ich ihr best best software also was haben wir denn hier zu"}, {"id": 791, "start": 7631.12, "end": 7638.68, "text": "bieten element nee bestimmt nicht mummel das habe ich früher verwendet ab und zu weil"}, {"id": 792, "start": 7638.68, "end": 7644.96, "text": "es quasi so eine art open source teamspeak war aber letztendlich ich verwende hauptsächlich"}, {"id": 793, "start": 7644.96, "end": 7651.68, "text": "discord in letzter zeit gut das sagt tatsächlich nix über die voice qualität von discord"}, {"id": 794, "start": 7651.68, "end": 7659.76, "text": "aus nur weil jeder discord verwendet aber es zumindest muss discord ja irgendwie diese"}, {"id": 795, "start": 7659.76, "end": 7669.68, "text": "verbreitung gefunden haben ja also discord muss zumindest sachen machen die die leute"}, {"id": 796, "start": 7669.68, "end": 7677.0, "text": "haben wollen aber als kostenloses teamspeaks auch kostenlos die meisten leute mieten sich"}, {"id": 797, "start": 7677.0, "end": 7688.26, "text": "ja kein teamspeak server discord hat auch die vorteile dass die als erster angefangen"}, {"id": 798, "start": 7688.26, "end": 7695.8, "text": "haben oder zumindest als erster brauchbare so eine komplett lösung aus chats channels"}, {"id": 799, "start": 7695.8, "end": 7706.36, "text": "anrufen voice calls und eben letztendlich voice chat zu machen was discord scannt den"}, {"id": 800, "start": 7706.36, "end": 7721.84, "text": "kompletten pc ab ist das wirklich so anzeige ist raus"}, {"id": 801, "start": 7721.84, "end": 7744.4, "text": "aber macht das discord ja naja natürlich nicht naja natürlich nicht"}, {"id": 802, "start": 6744.78, "end": 7772.56, "text": "tja alle sind so halt scharf auf das zeug ne ist es macht das discord auch"}, {"id": 803, "start": 7772.56, "end": 7777.56, "text": "wenn discord aus ist oder nur wenn discord an ist weil der neueste trend ist ja dass"}, {"id": 804, "start": 7777.56, "end": 7806.44, "text": "software auch wenn sie eigentlich aus ist doch noch an ist und was macht"}, {"id": 805, "start": 7806.44, "end": 7811.58, "text": "das discord das beste ja sehe ich auch so keepers beste habe ich auch seit jahren am"}, {"id": 806, "start": 7811.58, "end": 7826.28, "text": "start gibt's eigentlich nix zu sagen gut ich glaube jetzt haben wir die meisten interessanten"}, {"id": 807, "start": 7826.28, "end": 7836.92, "text": "sachen durch best audio player also chat ich hab das letzte was ich verwendet hab ist fubar 2000"}, {"id": 808, "start": 7836.92, "end": 7852.72, "text": "und das ist auch schon fünf jahre her oder so über 2000 und ansonsten wenn ich keine audio"}, {"id": 809, "start": 7852.72, "end": 7858.96, "text": "player ich verwende vlc ja vlc um alle möglichen aber ansonsten wenn ich musik hören mache ich"}, {"id": 810, "start": 7858.96, "end": 7866.56, "text": "das entweder über amazon prime oder also da habe ich ja ich habe ja dings gekauft dieses ultimate"}, {"id": 811, "start": 7866.56, "end": 7871.12, "text": "ding was eigentlich bescheuert war ich hätte mir lieber spotify kaufen soll entweder höre ich"}, {"id": 812, "start": 7871.12, "end": 7876.24, "text": "auf youtube oder auf amazon so direkt in einem player offline habe ich eigentlich kaum noch was"}, {"id": 813, "start": 7876.24, "end": 7888.52, "text": "wie hieß diese seite gerade die taucht öfters mal in den suchbegriffen oben auf mit bescheuerten"}, {"id": 814, "start": 7888.52, "end": 7897.12, "text": "vergleichen also die seite hat sich bei mir bisher nicht gerade mit irgendwie sonderlicher"}, {"id": 815, "start": 7897.12, "end": 7906.4, "text": "vorgetan durch hochwertige sachen aber das ja war jetzt doch mal ganz nett sich das anzugucken"}, {"id": 816, "start": 7906.4, "end": 7916.2, "text": "tja leute haben uns das auch angeguckt ich schau mal kurz in mein text dokument ob ich noch"}, {"id": 817, "start": 7916.2, "end": 7919.88, "text": "irgendwas los werden wollte wir haben ja noch zeit ist ja noch ist ja nicht so dass ich jetzt"}, {"id": 818, "start": 7919.88, "end": 7927.48, "text": "gleich auf muss also zumindest eine sache können wir uns schon mal sicher sein memory leaks haben"}, {"id": 819, "start": 7927.48, "end": 7933.88, "text": "wir keine sonst wäre der ganze kram jetzt schon längst bei irgendwie frag mich nicht 500 mb und"}, {"id": 820, "start": 7933.88, "end": 7937.76, "text": "würde auch nicht immer wieder hoch und runter gehen also das ist zumindest schon mal klar memory"}, {"id": 821, "start": 7937.76, "end": 7954.56, "text": "leaks haben wir keine das schon mal nice wieder zu auch zu zu zu wieder rückgängig zack und"}, {"id": 822, "start": 7954.56, "end": 7965.56, "text": "den aus also keine memory leaks konform schon mal gut ich würde sagen in einem der nächsten"}, {"id": 823, "start": 7965.56, "end": 7969.16, "text": "streams erweitern wir das dann endlich mal drum dass man aufnehmen kann ich habe damit schon"}, {"id": 824, "start": 7969.16, "end": 7975.44, "text": "ein bisschen rumgespielt aber ich habe noch keine wirklich schöne lösungen dazu gefunden ob jemand"}, {"id": 825, "start": 7975.44, "end": 7978.6, "text": "aber im stream auf dass man die sachen nicht nur abspielen kann sondern auch aufnehmen kann"}, {"id": 826, "start": 7978.6, "end": 7996.0, "text": "und ich meine was richtig cool ist wenn man dann was richtig cool ist wenn man dann hier die"}, {"id": 827, "start": 7996.0, "end": 8019.76, "text": "objekterkennung hat das macht den voll fertig jetzt aber wenn man die objekterkennung hat dann"}, {"id": 828, "start": 8019.76, "end": 8025.32, "text": "kann man quasi eine aufnahme triggern wenn der person in der webcam erkennt und ich habe mir"}, {"id": 829, "start": 8025.32, "end": 8033.96, "text": "das so überlegt also wenn man eine person in der webcam erkennt dann triggert der eine"}, {"id": 830, "start": 8033.96, "end": 8039.32, "text": "aufnahme für 30 sekunden allerdings rückwirkten zehn sekunden also sprich ich muss im hintergrund"}, {"id": 831, "start": 8039.32, "end": 8043.4, "text": "immer einen zehn sekunden buffer mit laufen lassen dass ich das nachträglich aufnehmen"}, {"id": 832, "start": 8043.4, "end": 8049.04, "text": "kann so und dann triggert einfach jede weitere motion erkennung die in dieser zeit triggert"}, {"id": 833, "start": 8049.04, "end": 8054.12, "text": "erweitert die sache um 30 sekunden sonst hat man ja auf einmal wenn mal einer durchs bild"}, {"id": 834, "start": 8054.12, "end": 8061.28, "text": "läuft oder mal öfters einer durchs bild läuft hat man auf einmal 50 files das kann man triggern"}, {"id": 835, "start": 8061.28, "end": 8065.52, "text": "so und dann man kann manuell triggern man kann über den timer triggern die aufnahme oder man"}, {"id": 836, "start": 8065.52, "end": 8071.4, "text": "kann sie über motion beziehungsweise objekte detection triggern würde ich sagen das wird"}, {"id": 837, "start": 8071.4, "end": 8078.52, "text": "einem der nächsten streams mal ausprobieren wieso lieber spotify weil prime musik die hälfte aus"}, {"id": 838, "start": 8078.52, "end": 8084.84, "text": "meinen playlists immer removed ich habe ich habe beispielsweise relativ lange ärzteplaylist und"}, {"id": 839, "start": 8084.84, "end": 8091.28, "text": "da fehlen regelmäßig sachen drin die werden dann zwar wieder hinzugefügt nach ein paar wochen aber"}, {"id": 840, "start": 8091.28, "end": 8098.04, "text": "dass sie haben intern andere ids und dann muss ich wieder die sachen neu hinzufügen total bescheuert"}, {"id": 841, "start": 8098.04, "end": 8108.76, "text": "was was programmiert sogar heute gar nichts wir haben ich habe hier nur was offen um zu testen ob"}, {"id": 842, "start": 8108.76, "end": 8117.72, "text": "ich memory leaks habe ich habe was gewasselt wo du deine webcam in browser streamen kannst ich"}, {"id": 843, "start": 8117.72, "end": 8121.8, "text": "habe jetzt testweise mein youtube in den youtube videos genommen zum streamen du kannst deine"}, {"id": 844, "start": 8121.8, "end": 8127.04, "text": "webcam im browser streamen lassen mit so gut wie keiner verzögerung und kannst quasi noch"}, {"id": 845, "start": 8127.04, "end": 8132.08, "text": "sachen erkennen lassen auf dem bild das ist jetzt nur der der der stress test ob das wirklich"}, {"id": 846, "start": 8132.08, "end": 8138.32, "text": "funktioniert man sieht dass er da ein bisschen überfordert ist mit mit anderen sachen funktioniert"}, {"id": 847, "start": 8138.32, "end": 8144.4, "text": "viel besser wenn man hier zum beispiel einzelne leute drauf hat und so genau und dann kannst du"}, {"id": 848, "start": 8144.4, "end": 8148.52, "text": "das auch aufnehmen lassen dass das nächste was ich machen will das wichtigste ist erstmal dass du"}, {"id": 849, "start": 8148.52, "end": 8153.12, "text": "die webcam latency frei in den browser bekommst und dass du jetzt angucken kannst von jedem x"}, {"id": 850, "start": 8153.12, "end": 8160.0, "text": "beliebigen browser egal ob das jetzt safari unter ios ist oder windows und es ist wirklich"}, {"id": 851, "start": 8160.0, "end": 8164.0, "text": "nahezu latency frei wir haben es letztens im stream ausprobiert natürlich kommt es auf die"}, {"id": 852, "start": 8164.0, "end": 8168.84, "text": "kamera an ja wenn die kamera an sich den stream erst mit 15 sekunden verzögerung ausgibt da kann"}, {"id": 853, "start": 8168.84, "end": 8174.32, "text": "ich auch nichts machen und dann haben wir im letzten letzten durchgang haben wir diese object"}, {"id": 854, "start": 8174.32, "end": 8180.08, "text": "erkennung eingebaut das ist jetzt relativ schlecht zu erkennen ich mache das gerade mal aus und"}, {"id": 855, "start": 8180.08, "end": 8191.0, "text": "starte das mal mit einem anderen stream ich starte das mal mit hier hier plupp 2 ts da erkennt man"}, {"id": 856, "start": 8191.0, "end": 8199.24, "text": "das besser das ist so ein fitness video was runter gelernt da sieht man auch dass die dass"}, {"id": 857, "start": 8199.24, "end": 8213.56, "text": "die object erkennung wirklich besser funktioniert funktioniert besser also der erkennt den du hier"}, {"id": 858, "start": 8213.56, "end": 8222.4, "text": "auch immer und er weiß dass es eine person ist das eigentlich ziemlich nice ja und ich"}, {"id": 859, "start": 8222.4, "end": 8227.6, "text": "habe fitness videos von youtube genommen weil fitness videos ist ein super super test um zu"}, {"id": 860, "start": 8227.6, "end": 8237.2, "text": "gucken ob ob er auch erkennt wo eine person anfängt und eine person aufhört excellent aber"}, {"id": 861, "start": 8237.2, "end": 8242.36, "text": "ich darf mich da nicht zu sehr damit rühmen dieses ob also diese object erkennung habe ich nicht"}, {"id": 862, "start": 8242.36, "end": 8246.48, "text": "selber also nicht komplett selber programmiert da verwende ich was fertiges für und spreche"}, {"id": 863, "start": 8246.48, "end": 8272.96, "text": "das nur an machine learning ist langsam echt krass ok was ist das was hat es jetzt mit machine"}, {"id": 864, "start": 8272.96, "end": 8281.08, "text": "learning zu tun oder kommt es jetzt noch oder was macht er da ist ein ipad oder was ist das was"}, {"id": 865, "start": 8281.08, "end": 8305.68, "text": "da da hat irgendein ultra fettes ach das fährt von alleine ach das fährt von alleine oder hat er"}, {"id": 866, "start": 8305.68, "end": 8320.12, "text": "einfach nur die hand am lenker"}, {"id": 867, "start": 8320.12, "end": 8338.68, "text": "wisst ihr warum ich warum ich glaube dass das dass ich als dass ich das komisch anfühlt also warum"}, {"id": 868, "start": 8338.68, "end": 8344.6, "text": "ich da probleme mit hätte mit diesem konzept von selbstfahrendem auto und zwar weil ich"}, {"id": 869, "start": 8344.6, "end": 8349.64, "text": "wahrscheinlich also ich muss ja eigentlich noch auf den straßenverkehr achten weil ich"}, {"id": 870, "start": 8349.64, "end": 8354.28, "text": "muss ja immer noch eingreifen können aber dadurch dass ich nicht permanent was mache"}, {"id": 871, "start": 8354.28, "end": 8359.88, "text": "bin ich überhaupt nicht mehr richtig aufmerksam und gucke ob was ist und im ernstfall wenn das"}, {"id": 872, "start": 8359.88, "end": 8364.44, "text": "wirklich wenn ich wirklich eingreifen müsste würde ich wahrscheinlich dann nicht reagieren"}, {"id": 873, "start": 8364.44, "end": 8366.68, "text": "weil ich die letzte halbe stunde nichts machen musste"}, {"id": 874, "start": 8366.68, "end": 8375.04, "text": "aus wie würde ich den tesla fleschen erstmal genau also das stelle ich mir zumindest für mich"}, {"id": 875, "start": 8375.04, "end": 8390.48, "text": "problematisch vor"}, {"id": 876, "start": 8390.48, "end": 8406.72, "text": "ok bis wohin soll ich jetzt gucken ich kann mir jetzt ja nicht die 24 videos angucken wie"}, {"id": 877, "start": 8406.72, "end": 8419.88, "text": "die straße fährt ja da kann schon mal sein dass du nicht losfahren kannst mit deinem auto"}, {"id": 878, "start": 8419.88, "end": 8436.24, "text": "weil es erstmal software update machen muss ich mein cool ist das mit dem fetten tablet"}, {"id": 879, "start": 8436.24, "end": 8464.08, "text": "schon da vorne ist ja vor wie ein flugzeug"}, {"id": 880, "start": 8464.08, "end": 8480.0, "text": "ich habe ein auto ja aber also wenn du das hier jetzt als auto siehst dann geht meins"}, {"id": 881, "start": 8480.0, "end": 8507.24, "text": "wahrscheinlich nicht als auto durch"}, {"id": 882, "start": 8507.24, "end": 8514.4, "text": "ich bin mir aber noch unschlüssig ob selbstfahrende autos wirklich die zukunft sind ich sehe"}, {"id": 883, "start": 8514.4, "end": 8523.0, "text": "die zukunft eigentlich eher dass er darin dass autos weniger nötig sein werden durch"}, {"id": 884, "start": 8523.0, "end": 8526.96, "text": "ändern durch durch umstände die sich ändern durch bessere öffentliche verkehrsmittel"}, {"id": 885, "start": 8526.96, "end": 8530.72, "text": "werden in deutschland natürlich nicht hinbekommen weil öffentliche verkehrsmittel hier ist"}, {"id": 886, "start": 8530.72, "end": 8540.36, "text": "ja eh so null w immer sehr gut der konter dankeschön exquisite subscription drei monate"}, {"id": 887, "start": 8540.36, "end": 8554.68, "text": "huge moment doch prime"}, {"id": 888, "start": 8554.68, "end": 8557.8, "text": "was es hat hier mal ein unfall gebaut weil er die geschwindigkeit vom scheibenwischer"}, {"id": 889, "start": 8557.8, "end": 8562.76, "text": "über das tablet geändert hat im tesla deswegen war er schuld hätte man besser selbst gefahren"}, {"id": 890, "start": 8562.76, "end": 8573.2, "text": "ja aber so ein auto werde ich mir in nächster zeit nicht kaufen ich fahre so selten und"}, {"id": 891, "start": 8573.2, "end": 8586.28, "text": "wenn ich fahre tut es mein alles ding auch noch baumi 137 drei monate dankeschön für"}, {"id": 892, "start": 8586.28, "end": 8592.72, "text": "den zapp messer subscription huge"}, {"id": 893, "start": 8592.72, "end": 8602.36, "text": "gibt ja leute sind so voll voll drinnen was neue autos angeht und tuning und zig sachen"}, {"id": 894, "start": 8602.36, "end": 8607.24, "text": "und upgrades und dinger und gedöns und ich muss euch ehrlich sagen es ist mir so wurscht"}, {"id": 895, "start": 8607.24, "end": 8610.76, "text": "es ist also autos ist ein thema also ich meine es gibt ja viele männer die sich total für"}, {"id": 896, "start": 8610.76, "end": 8617.4, "text": "autos interessieren ich muss sagen autos ist so ein thema es ist mir sowas von egal ich"}, {"id": 897, "start": 8617.4, "end": 8623.28, "text": "finde das so langweilig dann flashe ich lieber steckdosen leisten was ist deine meinung zu"}, {"id": 898, "start": 8623.28, "end": 8646.64, "text": "unity media als dsl bieter meine meinung ist dass unity media nicht mehr gibt"}, {"id": 899, "start": 8646.64, "end": 8656.96, "text": "die media gibt es nicht mehr guck unity media.de gibt es nicht mehr kommt jetzt mal vodafone"}, {"id": 900, "start": 8656.96, "end": 8671.92, "text": "raus ist jetzt vodafone seit einem halben jahr oder so"}, {"id": 901, "start": 8671.92, "end": 8681.84, "text": "hast du erfahrung mit den mikrotik access points nee aber die technischen specs wo ich"}, {"id": 902, "start": 8681.84, "end": 8686.64, "text": "damals mich hier entscheiden musste für was ich als access point nehme haben mir nicht"}, {"id": 903, "start": 8686.64, "end": 8690.24, "text": "gefallen die meisten mikrotik dinger für daheim die erschwinglich waren hatten damals"}, {"id": 904, "start": 8690.24, "end": 8696.96, "text": "wo ich geguckt habe hier auch für das haus hatten nur 2,4 gigahertz also das nope ich"}, {"id": 905, "start": 8696.96, "end": 8700.4, "text": "glaube die mikrotik access points sind auch nicht so wahnsinnig geil was ich gut finde"}, {"id": 906, "start": 8700.4, "end": 8715.84, "text": "sind halt die low price mikrotik switch und router was ist das nochmal ein tesla video"}, {"id": 907, "start": 8715.84, "end": 8737.08, "text": "und was sagt mir das jetzt dass er gebremst hat und nicht in die seite gefahren ist aber"}, {"id": 908, "start": 8737.08, "end": 8743.72, "text": "der erkennt das gut dass ein selbstfahrendes auto nicht von der straße abkommt und rennt"}, {"id": 909, "start": 8743.72, "end": 8758.32, "text": "und brennt oder du meinst er erkennt dass deine kurve ist andere gute ap außer unify"}, {"id": 910, "start": 8758.32, "end": 8764.76, "text": "ist ja auch schwer zu sagen ich hab nur noch unify kisten ach der lernt das automatisch"}, {"id": 911, "start": 8764.76, "end": 8777.24, "text": "ja ok verstehe ehrlich gesagt keine ahnung ich hab damals als ich hier ein bisschen abgecrayt"}, {"id": 912, "start": 8777.24, "end": 8782.44, "text": "hab ich hatte ja davor so ganz billigen tp link access point rumstehen der es auch irgendwie"}, {"id": 913, "start": 8782.44, "end": 8789.76, "text": "getan hat ja aber schön war das damit nicht danach habe ich mir zwei unify access points"}, {"id": 914, "start": 8789.76, "end": 8793.96, "text": "hingestellt erst unten ein und dann hier oben noch ein bisschen später und seitdem bin"}, {"id": 915, "start": 8793.96, "end": 8802.72, "text": "ich rund um zufrieden was das ding an wlan abdeckung bringt was empfiehlst du für business"}, {"id": 916, "start": 8802.72, "end": 8808.04, "text": "umfeld als mit shooter da kann ich dir leider nichts empfehlen ich bin kein profi irgendwie"}, {"id": 917, "start": 8808.04, "end": 8815.0, "text": "netzwerktechniker der das da der was öfters business bereich macht keine ahnung kann"}, {"id": 918, "start": 8815.0, "end": 8833.56, "text": "ich den x großartig empfehlen"}, {"id": 919, "start": 8833.56, "end": 8851.6, "text": "eigentlich so grafikkarten und und dps not in stock da habe ich mir fast gedacht da brauche"}, {"id": 920, "start": 8851.6, "end": 8858.08, "text": "ich mir vielleicht dieses jahr doch kein neuen pc aber meiner reicht ja noch was meinste"}, {"id": 921, "start": 8858.08, "end": 8868.92, "text": "zu dem router jetzt box also rein als router nicht so geil aber als multifunktionsgerät"}, {"id": 922, "start": 8868.92, "end": 8892.96, "text": "schon 5094 fiber sagt mir nix mit direkt mit glasfaser anschluss ok"}, {"id": 923, "start": 8892.96, "end": 8909.8, "text": "den das problem ist glaube ich nicht der router sondern so ein anschluss in deutschland zu"}, {"id": 924, "start": 8909.8, "end": 8923.1, "text": "informieren ich benutze seit drei jahren home assistant und das ist halt eher die du"}, {"id": 925, "start": 8923.1, "end": 8941.84, "text": "das ist ein schweizer shop ja ok in der schweiz gibt es ja sowas hier haben wir sowas ja nicht"}, {"id": 926, "start": 8941.84, "end": 8957.48, "text": "ja wir haben jetzt übrigens ein super projektfoto drinne hier beste das sieht so schlecht aus"}, {"id": 927, "start": 8957.48, "end": 8976.08, "text": "so schlecht aus übrigens keck"}, {"id": 928, "start": 8976.08, "end": 8996.76, "text": "das ist ein bisschen schnell oder jetzt das keck läuft auch noch in noch in langsam"}, {"id": 929, "start": 8996.76, "end": 9014.72, "text": "viel zu schnell aber was ist mit euch los"}, {"id": 930, "start": 9014.72, "end": 9026.72, "text": "ich wollte es nämlich in mein bord rein machen aber das sieht so schlecht aus zu geil"}, {"id": 931, "start": 9026.72, "end": 9041.92, "text": "warum ist das github user content das ist ein im im im im gure bild das ist warum ist das"}, {"id": 932, "start": 9041.92, "end": 9054.16, "text": "ein link zum zu github"}, {"id": 933, "start": 9054.16, "end": 9066.12, "text": "ja das ist ein guter keck keck wähler das brauche save s muss man nämlich noch hinzufügen"}, {"id": 934, "start": 9066.12, "end": 9085.92, "text": "das brauche hallo browser nicht abkacken please oder ganz schön pixelig der ist nicht so pixelig"}, {"id": 935, "start": 9085.92, "end": 9099.88, "text": "der besser also der ist aber dafür ist der animiert ja passt ab und zu mal dass man bisschen"}, {"id": 936, "start": 9099.88, "end": 9115.6, "text": "variieren kann zwischen dem den uns dem und dem und ich habe ja so viele lulli modes"}, {"id": 937, "start": 9115.6, "end": 9131.56, "text": "übersehen also lulli ist eh besser besseres keck wehe"}, {"id": 938, "start": 9131.56, "end": 9145.44, "text": "okay wisst ihr was chat ich gehe jetzt auf macht's gut wir sehen uns beim nächsten stream"}, {"id": 939, "start": 9145.44, "end": 9160.86, "text": "bis deren ziel"}]}