{"text": "So, wer jetzt nicht glauben will, dass es gerade aufgekoppelt ist, bei mir auf dem zweiten Rechner, der Avira Black Friday Sale. So, Crap, warum hab ich den Kram überhaupt noch installiert. So, aber ich find's schon geil, dass mittlerweile Viren-Scanner oder Antivirus-Hersteller eigentlich kein dort besser sind als irgendwelche Scammers. Du kriegst kostenlos Werbung, du kriegst Fehler angezeigt, die keine Fehler sind. Also, das ist schon Hardcore-Jubate, was da abläuft. Richtig heftiger Jubate. Musik ist zu anstrengend. Iceland, wie Shopmusik. Was ist das? Ja, verlassen. So. How to Twitch Chat, PogChamp. Das müssen wir lernen. Aus irgendwelchen Gründen aktualisiert der Chat bei mir nicht, aber ich seh's hier in der anderen Vorschau, dass der Chat läuft. Twitch, please. Was ist da schon wieder los? Come on, brah. Mach ich einfach mal Refresh. Ah, ja, ja. Gerade rechts hat er den Chat aufgemacht. Übrigens Leute, ich hab meine LED-Strips noch ein bisschen upgraded. Das hab ich euch ja gezeigt, auch auf Twitter, hier dieses, das Fake-Feuerwerk-LED-Strip. Ja, den da, ne? Hab ich euch ja gezeigt. Haben wir jetzt sogar zusammen im Stream gebaut. Also, bei allen, die hier dabei waren, die kennen das. Das haben wir zusammen im Stream gebaut. Ich hab das jetzt ein bisschen geupgradet, weil was man hier sieht, ist, hier hab ich ja nur die Leiste an das Fenster geklebt. Also sprich, du siehst hier die kompletten einzelnen Bildpunkte, die einzelnen Lichter, siehst du hier. Das sieht ein bisschen scharf und ein bisschen billig aus, um's mal so zu sagen. Deswegen hab ich mir jetzt folgendes noch gekauft dafür. Und zwar LED-Aluminium-Sowas hab ich mir gekauft, genau. Ziemlich ähnlich zu dem hier. Ich mach jetzt mal stellvertretend das hier auf. Das ist alles mehr oder weniger das gleiche. Sowas hier in der Richter und drauf zehn Stück, jeweils in Meter, ja, das könnte die tatsächlich sein. Und da ist so ein, wie nennt man das überhaupt? Da kommt so ein, so ein Milchglas, oder was auch immer, so eine Milch. Diffuso, ach das ist exzellent. Der Chat wieder hier. Big Brain Chat, exzellent. Wahrscheinlich steht das da irgendwo und ich hätt's mal vorlesen müssen. Zumindest, das betreut das Licht von den LEDs noch ein bisschen. Ich bin mir jetzt gar nicht sicher, ob ich überall, hab ich überall die Folie abgemacht? Lull weh. Wartet mal, ich muss mal kurz gucken, ob ich irgendwie, ob ich die Folie abgemacht hab. Ich denk schon. Also ich hab jetzt keine Folie mehr gefunden. Zumindest, das hab ich jetzt über die LEDs drüber, sodass es jetzt dementsprechend nicht mehr ganz so extrem die einzelnen Bildpunkte raus strechen, also die einzelnen Pixels hier raus stechen, sondern das ist jetzt alles ein bisschen, ich hab da jetzt grad noch kein Bild von, jetzt kann ich keins machen, gescheit, weil es nicht dunkel ist. Kann ich schon, aber sieht nicht so doll aus. Zumindest hab ich das gestern eingebaut und die Sache ist, die mein Fenster ist unten nur 86 cm breit und oben ist mein Fenster dann irgendwie 115 cm oder so. Nee, Schwachsinn. Nicht oben. Unten ist das Fenster ja gar nicht quadratisch, nein nicht rechteckig. An der Seite ist es 115 cm und unten ist es irgendwie nur 86 cm oder so. Deswegen hab ich so eine Leiste genommen, hab bei einer 15 cm abgeschnitten und bei der anderen dran gemacht und das geht echt ganz gut, muss man sagen, das ist wirklich top und dann sieht es nicht mehr so billig aus, wie einfach ein LED Strip hier dran geklebt, sondern das sieht jetzt richtig so ordentlich aus und man kann diese Leisten auch einfach abmachen, weil die LED Leiste, die hat ja nur einmal Kleber hinten dran und wenn ich das abroppe ist halt kacke. Homo 08186 Monate. Excellent Subscription, Dankeschön für den Sub. Ja, genau und das hab ich gestern auch gebastelt. Eigentlich wollte ich gestern schon mal wieder Stream anschmeißen, aber ich hab mir gedacht, jetzt bastelt ihr erstmal das LED Zeug fertig. Ja ne, ich kann ein Bild machen, aber man erkennt da jetzt, wenn es so hell ist, nicht so viel. Doch, ich kann euch ein Bild machen, wartet mal kurz, ich muss ein Handy holen zum Foto machen. Das ist doch nicht ganz perfekt, ich muss das noch mal runter machen, wahrscheinlich, weil ich hab es erstmal nur reingepappt, um zu gucken, ob es passt und ich hab die LED Leisten in diesen Dinger noch gar nicht angeklebt, weil ich mir gedacht hab, ich mach es danach eh noch mal runter, aber es war dann gestern Abend um 20 Uhr, da hatte ich keine Bock mehr, das noch mal runter zu machen. Aber ich kann es euch mal zeigen, ich mach jetzt erstmal einen anderen Effekt, dass man auch alle LEDs sieht. So, jetzt mach ich mal kurz ein Bild von. Moment, da muss ich ein Stückchen hier rüber rücken, dass man es gescheiter erkennt. Ah, das sieht jetzt nicht so gut aus, aber ich lad euch das Bild mal hoch. Also, was gibt es denn für eine schöne Image Host Seite, wo man keine App für braucht, wo ich, nehm ich denn da immer hier, Post Image, Post Image, genau, da gehen wir jetzt hin, sagen Upload, Post Image, Photolibrary und dann nehmen wir das hier. Ok, so, jetzt gehen wir mal, also Hups, ich zeig es euch mal. Boah, alle die können ja, können die ihren Code noch mal länger machen, der ist ja 3 Kilometer langer Code, den ich jetzt abtippen muss. Ok, Moment, also, Post Image, ok, D8, 4, Y, K, H, gibt es da nicht irgendwie eine ordentliche, irgendwas ordentlich zum Sinken oder so, 2, 4, 2, 1, 4, 1, 1, 4, wo ist es? Upload Completed, ach so, ich hätte einfach nur das da schicken müssen, ach egal, ja, so sieht es jetzt aus, guck, ist schon besser mit den Leisten hier, ich hab jetzt ein bisschen buntiges Zeug angemacht, dass man es auch ganz gut sieht, also so ist es halt viel weicher, das Licht und es sieht auch deutlich besser, als man das da mal außen vor, das muss ich noch gucken, dass es ordentlich kürzt. Die Leisten sind so, ja, die Leisten sind ungefähr nur einen Zentimeter breit, die gucken ganz kleines bisschen aus dem Fenster raus, aber nicht so wild, ja, also so sieht es jetzt aus, also im Vergleich zu hier sieht man jetzt halt schon, hier sind die Lichter halt richtig, so richtig hart außen, das fällt jetzt nicht so auf, weil die Kamera noch ein bisschen blört das Ganze, weil das Licht reinleuchtet und hier ist es halt schön diffusst das Ganze und es sieht natürlich ordentlicher aus, wenn da Leisten drin sind im Fenster, als wenn da irgendwelche LED-Strips direkt im Fenster hängen. Also wie gesagt, hat sich gelohnt und es hält sich auch in Grenzen, ich mein, das ist wahrscheinlich sogar noch eine der teureren Sachen, das sind 10 Stück für 35 Euro, jeweils ein Meter, also 10 Meter, so Aluminium-Dinger für 35 Euro, geht es bestimmt noch billiger. Übrigens was witzig ist bei dieser Sache hier, die schreiben alle ihre Strips werden nicht gelb, die schreiben alle Anbieter, fragt man sich, ob es noch Anbieter gibt, wo die Strips überhaupt gelb werden, äh, die das Plastik auch überhaupt noch gelb werden, naja, so zumindest so sieht es jetzt aus, sieht auch viel schicker aus, du siehst die LED-Strips nicht mehr und man kann das wahrscheinlich auch besser abmachen, wobei ich jetzt, gestern habe ich mir noch ein Gehäuse ausgedruckt, gestern habe ich mir noch ein Gehäuse ausgedruckt, aber ich hoffe mal, das finde ich jetzt, NodeMCU Relay Case, das da, habe ich mir gestern noch ausgedruckt, äh, aber ohne die Relays drinnen, ich habe einfach hier ein Board rein, das passt eigentlich ganz gut, der, hehehe, Kyogre, viel Spaß, richtig gut, ja, sieht viel besser aus, und ich habe das auch ziemlich passend abgeschnitten, dabei habe ich bloß so Pima Daumen abgemessen mit dem Maßband, aber am Ende hat es doch ziemlich gut reingepasst, und ich war ja richtig froh, dass ich mir mal vor einer Weile so ein Dremel-Set gekauft habe, dieses Einsteiger-Ding, glaub so, ich glaub, das da, ich glaub das Ding hatte ich mir mal vor einer Weile gekauft, weil damit kannst du halt auch mal so ein Aluminium-Ding durchschneiden, ansonsten hast du ja daheim nix, wo du irgendwelche Metallsachen schneiden kannst, kannst ja schlecht mit dem Seitenschneider anfangen oder so, das kriegst du vielleicht irgendwie nach 3 Stunden mal durch, aber es sieht halt ausgefranst ohne Ende aus, so, Lechak1978, Dankeschön für den Sub, oh Kyogre, ich hab dich glaube ich übersehen, äh, aber das ist ja schon Hypersubscriber hier, Kyogre, und bei dir auch, 16 Monate, das ist ja schon hier Hyper Hypersubscriber, Dankeschön für die ganzen Subs, Kegmas, genau, so, damit hab ich es abgeschnitten, dann hab ich mir das hier als Case ausgedruckt, die Relays hab ich rausgeschmissen, also das ist gar nicht reingemacht, ich hab hier einen Controller reingemacht auf der Seite, und hier die restlichen Kabels, man sieht es hier unten auch noch, ah, ne, man sieht es hier unten nicht, aber hier ist das Case, hier ist das Case, und da sitzt auch noch kein Deckel drauf, hier ist das Case, da ist, guck, hier sieht man neben, sieht man noch den Rand vom Case, wenn ich es richtig, guck hier, hier sieht man noch den Rand vom Case, da kommt nämlich der ganze Mist rein, da wird das zugemacht, dann guckt, ok, plus noch das Netzteilkabel rein, und diese zwei LED-Strip-Kabel raus, und dann ist gut, tja, also, wie gesagt, das kann ich für LED-Strips echt nur empfehlen, gerade wenn man auf die Idee kommt, mit LED-Strips noch ein bisschen mehr zu beleuchten, dann ist das, stell euch mal vor, ihr wollt beispielsweise euer Wohnzimmer beleuchten, ne, und, keine Ahnung, ihr habt das Sofa irgendwie in der Mitte vom Raum stehen oder so, und wollt hinten an den Sofa einen Strip machen, einfach dran zu kleben ist kacke, hier mit solchen Sachen ist das viel schöner, generell ist es immer schöner, hab ich jetzt gemerkt, wenn man Beleuchtung macht mit LED-Strips, wenn die ein bisschen indirekt ist, also am besten ist eigentlich, man macht die irgendwo dahinter und lässt die dann gegen die Wand scheinen, oder so, die sieht viel, viel besser aus, als die LED-Strips direkt in den Raum scheinen zu lassen, wie wir es hier sehen, was eigentlich mit dem, das sieht richtig kacke aus jetzt im Nachhinein, ne, naja, man lernt nicht aus, ja, so, was haben wir jetzt, 12 Monate für den, für der Kommentator, underscore, excellent Subscription, für den Sub, und das Scam Train ist auch am Start, der Jibay Train, ja, ist viel, hast du vollkommen recht, ist viel angenehmer, wenn man nicht direkt in die LEDs guckt, sondern in diffusedes Zeug reinschaut, also, ich muss mal wieder hier, Paulgas Effekte machen, so, was macht dein Projekt mit den Zigbee-Thermostaten-Plans zu Fenster, Fensterkontakte habe ich schon, aber keine Zigbeede sind noch die alten Z-Wave-Dinger, die werde ich auch lassen, warum nicht einfach bei das, oh, warte mal, gerade, jetzt kann man den Stecker von dem LED-Strip draußen reinschneiden, so, alles klar, wir sind wieder am Start, Brings bestes Emote, schon mal halt Kekwet im Chat, mit welcher Software, das ist alles, also, das ist alles mit W-LED, W-LED gibt es hier auf GitHub, das war jetzt ein ziemlich beliebtes Projekt, 3,7K, kriegste nicht umsonst, also, gibt es nicht, gibt es nicht so oft als Sterne, ist ziemlich easy, du brauchst einen Controller, LED-Strip und ein Netzteil, das wars, ein paar Kabel brauchst du noch, aber, Kabel hat ja jeder in irgendeiner Art und Weise daheim, man kann auch einfach was, was man nicht benutzt, aufschneiden und die Kabel rausnehmen oder so, ja, so sieht es aus, also, viel besser, ne, sind wir uns einig, Chat, jetzt gebt euch mal, gebt euch den Druck und macht den Scamtrain weg, ich glaube, wir brauchen noch einen Sub, Any Primors, Chuck690 hat es voll gemacht, Dankeschön, huge, Hyper Subscription, 16 Monate hier, Foggers, nice, so, irgendwas habe ich jetzt vergessen, ich wollte euch noch irgendwas erzählen, aber voll verdrängt, naja gut, ähm, übrigens, habt ihr schon dieses, ich weiß nicht, ob ich das, ich will mir das gar nicht angucken, ich zeig euch nur mal, ich zeig euch nur mal die Überschrift, dann cringet ihr schon wieder innerlich, Mediathek Frontal 21, schon mal gecringed heute, äh, Moment, wo ist das, wo ist das, Gamer, hier, das ist so dermaßen schlecht, und dann zeigen sie noch ein Video, und dann zeigen sie noch ein Video, von einem Verarschungs-Minecraft-Video, also sprich, das was die hier in dem Thumbnail haben, das ist ein Video von Youtube, wo einer das irgendwie verarscht, das ist so richtig dumm das einfach reinzunehmen, ja, dazu kommt, egal, es ist einfach Hardcore-Cringe wieder der Kram, ja, oh man, ich wills mir gar nicht geben jetzt, aber es ist wirklich schlimm, wenn ihr mal wirklich richtig Pains-Champen wollt, dann guckt euch da später an und schüttelt mal mit dem Kopf, es ist so unglaublich fail, und diesen ganzen Beitrag zeigen sie keinerlei Nazi-Games, die ja angeblich, was ja alles voll ist, also, doch, doch, doch, doch, sie zeigen eins, was aber halt offensichtlich das Propagandagame aller Zeiten ist, richtig dumm, so ein, ich weiß gar nicht was ich dazu sagen soll, so fail auch, so fail, was auch geil ist, ihr müsst euch mal, also falls, nur mal so als Tipp, für die Leute, die sich wirklich diesen Kram geben, und ihr müsst mal drauf achten, wie die das aussprechen, und zwar, also ich will das jetzt nicht im Stream gucken, das ist so ein dämlicher Beitrag, der hat Aufrufzahlen gar nicht verdient, ja, ihr müsst mal drauf hören, wenn es um, also ARD und ZTS sind halt halt ganz gut dabei, also sprich, wenn die Leute ansprechen wollen, die sagen nicht Gamer, die sagen Gamerinnen und sowas, oder, oder Playerinnen, Spielerinnen und so, aber was witzig ist, worauf ihr mal achten müsst, worauf ihr mal achten müsst, die negativen Sachen in diesem Video sind männlich, alle normalen und positiven Sachen, guckt euch mal an und beurteilt das selbst, ja, und alle normalen und positiven Sachen sind innen, es ist echter Wahnsinn, ich weiß gar nicht, was mit denen los ist, alter, also richtig hängen gebliebener Kram, ey, und wisst ihr, was mich da, was mich bei sowas immer ärgert, wenn das RTL macht und sowas, da finde ich es lustig und mich juckt es nicht, ganz ehrlich, wenn das RTL macht, es erinnert sich wahrscheinlich noch jeder an den Stinke-Gamer-Beitrag von RTL von vor ein paar Jahren, es ist ja nichts Neues hier, RTL Gamer gibt es bestimmt immer noch hier, der Tough Bericht von der Gelskrupp 2011, genau, ach guck mal, das taucht, ach nee, das ist irgendeine Reaction da drauf, okay, nee, ist was anderes, so zumindest, dieses RTL Gamer-Video, das hat mich, also ich hab mich da so ein bisschen drüber aufgeregt, gerade auch fürs Video damals, ja, aber das hat mich nicht aufgeregt, nicht großartig aufgeregt, da hab ich mir halt gedacht, alter RTL ist einfach doof, ja, und eigentlich könnte ich mir jetzt bei Frontal21 auch denken, ja gut, die sind halt einfach doof, was juckt es mich, aber was mich halt abfuckt ist, für den Scheiß bezahle ich quasi auch noch was, gezwungenermaßen, und bei RTL gucke ich halt einfach nicht, und man schadet RTL im Endeffekt ja schon am meisten, wenn man nicht guckt, im Prinzip kann aber ARD, ZDF, unöffentlich-rechtliche, größten Scheiß ever produzieren, du musst trotzdem für bezahlen, ob du es gewillst oder nicht, und das fuckt mich dabei ab, der Beitrag an sich gar nicht so sehr, aber diese Tatsache, die geht mir mega auf den Sack, richtig, richtig, ich muss mal kurz, ich muss mal kurz gucken, was sie für YouTube-Comments haben, hier, wie Rechte die Gaming-Kultur unterwandern, mein Gott, ich, nein, ich guck, ich hab das gestern geguckt, ich kann das heute nicht nochmal gucken, ich krieg absolute Anfälle, wenn ich das guck, also was haben sie was schreiben wollen, wir müssen uns mal das offizielle Reaktion-Kommentar angucken, Akenas99, ich hab absolut keine Ahnung, vor allem wird ja auch komplett unlogisch das verwendet, ja, manchmal ist es männlich, manchmal ist es weiblich, manchmal ist es innen, ich, ganz ehrlich, eigentlich gehts mir ziemlich am Arsch vorbei, wie gesagt, ist ja auch der Grund, warum ich Twitter auf Andorra stehen hab, ich hab ehrlich gesagt keine Bock auf diese vom Zaun gebrochenen Diskussionen, die es aktuell so gibt, über irgendwelche Gender-Sachen, über Rassismus-Themen, interessiert mich alles gar nicht, ist mir alles mittlerweile scheißegal, auch wenns nicht unwichtige Themen sind, aber ich kanns mir mittlerweile einfach nicht mehr geben, weil diese Sachen meistens auch nicht mit halbwegs kühlem Kopf geführt werden, sondern dass der eher um irgendwelche ideologischen Sachen geht, nach Bauchgefühl und sowas, ist einfach nicht meine Welt, die sollen alle machen, was sie wollen, ist die Sache, bin ich da seit Jahren dafür, sollen alle machen, was sie wollen, aber sollen andere Leute in Ruhe lassen, so, also, ähm, ach so, ich dachte, MWD steht für männlich-weiß-deutsch, ach, das steht für männlich-weiß-die, ja, verstehe, verstehe, Paints-Champ, guck, ich geb zu, war ein schlechter Witz, ja, gleich kommt Hashtag-Nazi-Keks, also was antworten sie denn hier drauf? Auf unseren Filmen gab es heftige Reaktionen, manche fanden das Thema gut, viele hatten Kritik mit dem Ton, andere fanden es schlecht, ja, ich fand schlecht, muss ich ehrlich sagen, ähm, weil, hab ich ja eben schon gesagt, so, teilweise verstehen wir auch in Ärgerung, kurz, wir wollen mit euch über das Thema, ach, ach, echt? Deswegen, wir wollen mit euch sprechen, deswegen haben sie auch Caesar-Interviewed in, oder was heißt Interviewed, also, gezeigt in dem Beitrag, und, äh, äh, was, äh, daraus gemacht, was sie eigentlich gar nicht sagen wollte, ja, ja, weil sie mit uns drüber reden wollte, alles klar. Also, unser Ziel war ein, bla, bla, bla, ach, übrigens, das ist auch, das ist auch zu geil, die, den Ausschnitt muss ich euch zeigen, den Ausschnitt muss ich euch zeigen, der ist so, der ist so fail, der GTA-Ausschnitt, der war relativ, hier, der GTA-Ausschnitt, das ist so geil, und, ähm, das ist so Pains-Champ, what the fuck, what the fuck, what the fuck, mach mal, haben die das in GTA nachgebaut, wo ist der Sender von, jetzt kommt's gleich, gleich, gleich, gleich wird sie, gleich wird sie richtig abgedreht, das ist so dumm, das ist so dumm, Alter, weil die, weil ja auch Gamer dafür bekannt sind, dass sie einfach rausgehen und am Hauptbahnhof irgendwelche Frauen headbutten, das ist so unglaublich fail, außerdem ist die Frau bewaffnet, vielleicht war es sogar ganz gut in dem Fall, dass sie gehadbuttet hat, vielleicht wollten sie ihn erschießen oder so, das ist so unglaublich dumm, was das ist, what the fuck, warum laufen hier Leute drauf und schlagen irgendwelche Frauen ins Gesicht, was ist das denn, ich meine, das ist GTA, was hat das in diesem Beitrag zu tun, es ist so unglaublich fail, ich weiß überhaupt nicht, was mit den Leuten los ist bei frontal 21, also, oh Gott, das ist so, das ist so kaputt, das ist so dumm, welche, ey, ohne Scheiß Leute, ich kenne wenige, wie soll man es nennen, so, so, so, man kann es nicht Community nennen, wenige Subkultur oder wie auch immer man das nennen mag, also, wo es eigentlich so egal ist, wer du bist, wie du ausschaust, woher du kommst als beim Onlinespielen, ohne Mist, beim Onlinespielen ist das scheißegal, okay, mal Russen in CS ausgenommen, ne, aber generell, es ist eigentlich fast egal, also, mal angenommen, du spielst irgendwie ein Competitive Game Online, es ist vollkommen wurscht, zumindest bei den allermeisten, ob du schwarz bist, weiß bist, lila gestreift bist, männlich, weiblich, divers, Attack Helikopter, Fahrrad, vollkommen egal, den meisten ist das Online total egal, gerade bei MMOs, wenn ich mir überlege, ich hab selten ein so, wie soll ich sagen, so gemischtes Zeug gesehen, wie als ich MMOs gespielt hab, da war wirklich alles möglich an Leuten dabei, ja, von viel Geld bis wenig Geld, von egal, welche, wie soll ich sagen, aus irgendwelchen sozialen Brennpunkten, aus junge Leute, alte Leute, deutsche, Ausländer, alles mögliche am Start, und die haben online zusammen geradet, und wen hat's interessiert? Keine Sau! Ja gut, wir reden jetzt nicht von Twitch-Streamern, dass es da wieder ganz andere Probleme gibt, sei mal dahingestellt, aber das hat ja mit Gaming an sich nichts zu tun, und dass gerade Multiplayer-Competitive-FPS generell toxik sind, as fuck, ist ja mal was ganz anderes, und man darf ja auch nicht vergessen, es ist jetzt kein exklusives Ding für Frauen, generell ist Online-Multiplayer-Shooter-Competitive-Sachen teilweise extrem toxik, guck dir Overwatch ranked an, oder guck dir CS ranked an und sonst was, da kriegst du in-game-Voice-Chat, da wird instant, wenn du ihn killst, dein Vater, deine Mutter, was weiß ich, alles beleidigt, vollkommen egal, ob du männlich oder weiblich bist, ich will jetzt aber mal nicht bestreiten, also ich kann mir tatsächlich vorstellen, dass in dem Fall sich Mädels noch dümmeres Zeug und noch mehr Zeug anhören müssen, das kann ich mir gut vorstellen, kann ich beurteilen, als Kerl ist das in dem Fall schwierig, kann ich mir vorstellen, wundert mich irgendwie auch nicht, es gibt schon unglaublich viel fertige Leute, und vielleicht fällt es auch viel, macht es auch mehr Leute Spaß irgendwelche Mädels zu beleidigen, keine Ahnung, aber insgesamt, gerade im Competitive-Matchmaking-Bereich, ich rede jetzt nicht davon, wenn man im festen Team spielt, ist toxik gedöns halt an der Tagesordnung, guckt euch LoL an, guckt euch Overwatch an, guckt euch CS ranked an oder solche, das ist alles toxik as fuck, und erst mal, erst mal unabhängig davon, ob du männlich oder weiblich bist, die Beleidigungen mögen halt unterschiedlich sein, ja, natürlich, es gibt überall toxik Spasten, es gibt überall toxik Spasten, ja, aber gerade in diesem Bereich gibt es halt besonders viel, und das ist halt der Grund, übrigens, mal ganz im ehrlich, mal ganz im ernst, wenn du jetzt hier sagst, wenn deine Ex-Freundin aufhören müsste, ihre Lieblingsspiel zu spielen, einer der Gründe, warum ich keinen Overwatch mehr spielen will, ich bin jetzt mal nicht deine Frau, also hoffe ich zumindest, einer der Gründe, warum ich nicht mehr Overwatch spielen wollte, war, weil Overwatch ranked voice chat absolut dämlich war, absolut kacke, ich hatte keinen Bock mehr, ich hatte fast schon Schiss davor, Overwatch ranked online zu spielen, das trifft nicht nur Frauen, das trifft alle, die keinen Bock haben, sich permanent mit Leuten im Internet, um irgendwelche Gaming-Sachen zu streiten, einer der Hauptgründe, warum ich keinen Overwatch ranked mehr spielen wollte, war der fucking toxic voice chat, man kann das nach einer Weile ignorieren, aber es nervt einfach unglaublich, deswegen hatte ich da keinen Bock mehr drauf, ach ja, und man darf nicht vergessen, du musstest dir auch oft genug Zeug anhören, ja, da, wo, was, was, ich, du warst auch mal ganz schnell Nazi und sowas in einem Online-Chat, weil es das erste, weil es denen die erst beste Beleidigung für Deutsche ist, die ihnen nicht einfällt, ja, aber deswegen kann man doch nicht sagen, so nach dem Motto, dass das unterwandert wird oder so, das ist halt competitive online games, gerade im Matchmaking sind einfach toxic as fuck, das ist durch die Bankwreck, es ist egal, ob es CS, LoL ist, Dota ist, sonst was, die einzigen Sachen, wo das ein bisschen, ich will nicht sagen gesittet dazugeht, aber wo das ein bisschen, nicht so offensichtlich ist in one on one games, sowas wie Starcraft und sonst was, da wird natürlich auch geflamed, wie Sau, aber da gibt es keinen in-game voice chat im Team, ja, sobald es ein PvP Spiel ist, mit ranked, gegeneinander, Team versus Team gegeneinander, dann ist es, ich habe noch kein Online-Spiel gesehen, wo das nicht so ist, wird untereinander das Team geflamed, weil jeder von sich denkt, das Team ist versaut, obwohl er ist zumindest zum Teil mitversaut, und das ist halt in vielen Sachen so, das hat aber absolut gar nichts damit zu tun und vor allem, was jetzt diese Szene, wo in GTA irgendwelche Leute random Frauen zusammenschlagen, einfach mal so, man darf nicht vergessen, es ist GTA, es ist quasi auch unabhängig davon, dass das wahrscheinlich so in einem Spiel tatsächlich passieren kann, weil das ja irgendwie so eine kriminelle Welt ist von GTA, wo es eben darum geht, auch Straftaten zu begehen, hat das alles nichts mit der Überschrift zu tun, und das ist ja der eigentliche Witz dabei, was das jetzt damit zu tun haben soll, das kann uns wahrscheinlich nicht mal frontal 21 erklären, aber der Beitrag ist so unglaublich fail, und ja, wie gesagt, das ist auch der Grund, warum ich auf diese ganze Diskussion keinen Bock habe, und ich mein Twitter auf Andorra gestellt habe, weil es mir nur noch auf den Sack geht, obwohl das eigentlich nicht unwichtige Themen sind, aber mittlerweile nimmt das so unglaubliche Ausmaße an, und man kann auch bei den meisten Themen nicht normal mehr darüber sprechen, ohne dass nach zwei Minuten einer um die Ecke kommt und sagt, was weiß ich, Nazi Hammer geht ja immer, also nach dem Motto, wie, der ist nicht dafür, dann muss er ein Nazi sein, wie, der ist nicht dafür, der will bestimmt AfD, muss ein Nazi sein, aber der ist auch nicht dafür, ja dann ist er ein links-grün-versifter-gut-mensch, alter, es ist nicht mehr möglich, oftmals normale Diskussionen zu führen, ohne dass nach zwei Minuten irgendwie einer in irgendeine Ecke gestellt wird, weil er angeblich, dass das ist, richtig dumm, richtig hängen geblieben. Vor allem, wie die jetzt da von diesem Frontal-21-Beitrag irgendwie auf Gamergate kommen, erschließt sich mir auch überhaupt gar nicht, die Meinungen werden immer radikaler, ich glaube, das liegt auch daran, ja, werden sie, aber ich glaube, das liegt auch daran, dass viele Leute das mittlerweile so machen wie ich und sich einfach nicht mehr daran beteiligen, also sprich, die normalen im Hirn, ja, die haben keinen Bock mehr, die sagen, leck mich, die sagen quasi, oder sie sagen, und setzen sich damit überhaupt nicht mehr auseinander, ich glaube, das ist eigentlich das Meiste, es gibt bestimmt noch sehr viele Leute, die da normal ticken im Hirn, ja, aber die beteiligen sich da nicht mehr dran, ja, und dass das immer radikaler wird, prinzipiell gebe ich dir aber recht, ja. Es gab letztens eine Umfrage, ähm, sehe ich gerade, wo das gewesen ist, habe ich auch in irgendeinem Twitter-Feed-News-Artikel gelesen, ähm, was war denn das, weiß ich nicht mehr, zumindest war es eine Umfrage, wo Leute befragt wurden, ob sie sich zu heiklen Themen noch äußern und da haben, ich glaube, 52% gesagt, dass es bestimmte Themen gibt, wozu sie sich öffentlich nicht mehr äußern, weil sie Angst haben, sich dazu zu äußern, äh, ich glaube, um die 20% haben gesagt, sie sind bei allem vorsichtig, und der Rest hat gesagt, kein Problem, also, ist schon bedenklich, ja, ja, normal, ich, wisst ihr, was ich gut finde, weil, weil, ja, das, was ich, was ich, was ich wirklich gut finde in der heutigen Zeit, dass du dich viel freier, wie soll ich sagen, freier entfalten kannst, ne, also, guck mal, guck mal mich an, ich bin jetzt 36, ich sitze sonntags morgens vorm Computer, Sache keckmas, keck weh, people love, people happy, äh, mach dofe Sachen wie das hier, ganz ehrlich, 1984, als ich geboren bin, hätte das da jemand gemacht, ja, die hätten gedacht, der ist total verrückt, also, was ähnliches in der Richtung, die Leute hätten gesagt, ey, Max, mit 36, auf gehts, bam, bam, bam, Kinderzeugen hier, Nachwuchs muss jetzt endlich mal, bald gehts nicht mehr, beeil dich mal, kann doch nicht sein, 36, äh, keine, keine Frau, keine Kinder, keine Familie, sonst wie hier, und komisches Internetzeugstar, kann ja nicht sein, ähm, also, in der heutigen Zeit ist das nicht mehr, das interessiert eigentlich gar keinen, das finde ich ziemlich gut, also, du kannst dich heute schon deutlich freier von irgendwelchen gesellschaftlichen Dingern da bewegen, Gaming ist auch viel mehr Mainstream, als es das noch vor ein paar Jahren war, wahrscheinlich gibt es diese ganzen Diskussionen deswegen jetzt auch, ja, also, das, das finde ich wunderbar, ja, du kannst heute mehr oder weniger machen, was du willst, wo ich dann halt immer ein Problem mit hab, ist, wenn die Leute versuchen, andere zu bekehren, ich sag ja immer dabei, hey, wie ich das sehe, vielleicht überzeug ich den ein oder anderen, weil er sagt, hey, da hab ich ja noch gar nicht drüber nachgedacht, aber ich versuch das keinem aufzuzwingen, ich versuch doch keinem zu erzählen, es ist eine gute Sache, als 36-jähriger, sonntags morgens vom Rechner zu sitzen und zu sagen, keck wait, kann jeder machen, was er will, aber ich kanns machen heute, ohne dass ich mir permanent irgendwelches blöde Zeug anhören muss, was früher definitiv nicht so gewesen wäre, das finde ich echt gut, wenn ich mich jetzt hinstellen würde, nur so, dass man sieht, wie sich da, wie sich da die Zeiten gerne haben, wenn ich mich jetzt hinstellen würde und sag, Leute, ich bin schwul, es wird kein Jucken, es würde keinen Jucken, da sieht man doch mal, dass, wie sich das, in welche, zumindest aus meiner Sicht positive Sachen sich das die letzten Jahre überentwickelt hat, wird kein Jucken, würde man sagen, ja, okay, Max, was juckt's mich, Max, du kannst quasi dein Ding reinstecken, das ist mir doch egal, würden alle sagen, wen juckt's, so muss es auch sein, die Leute sollen machen, was sie wollen, wo ich halt immer ein Problem mit hab, wenn sie Leute überzeugen wollen, dass ihre Sache die überlegene und bessere Sache ist, das geht mir immer auf den Keks, und das ist halt an vielen Stellen so, das f**kt mich ab, deswegen gehen mir so Berichte wie bei Frontalein und 21 auch auf den Keks, weil erstens bezahle ich die mit, ich weiß, ich bezahle die für was, was ich absolut nicht teile, generell geht mir öffentlich rechtlich als Zwangsabgaben Zeug auf den Keks, naja, naja, es ist echt so, was das, diese Bekehrungssache von vielen Leuten geht mir voll auf den Sack, was von denen hat letztens doch einer Netflix getrashed, was, ich hab keine Ahnung, was geht, der ist so, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was Sollte man sagen, wie ist es, und nicht, was sollen die Leute davon halten? Magst du Monitor? Ich glaube, ich habe ewig nichts mehr gesehen. Das ist halt was, was mir bei ARD und ZDF gerade bei Nachrichtensendungen auf den Kiks geht, oder auch teilweise bei Talkshows. Dass man nicht sagt, okay, das sind unterschiedliche Ansichten vielleicht, die es da gerade gibt. Nein, man versucht den Leuten gleich noch dazu zu erzählen, welche davon die korrekte ist. Und das ist meiner Meinung nach nicht die Aufgabe eines öffentlich-rechtlichen Nachrichtensendungen. Aber die SWR-Handwerks-Dokus, die sind wirklich cool. Das sind Sachen, dafür kann ich auch, dafür bezahle ich dann auch Gebühren, das ist okay. Es gibt ja auch, es gibt ja auch durchaus gute Sendung. Ich wollte mal kurz Chat durchscrollen, ob ich irgendwas übersehen habe. SWR-Handwerks-Dokus, ja. Das ist eine typische Internet-Diskussion, ja. Das ist eine typische Internet-Diskussion. Da wird total übertrieben, ja. Ja, so sieht es aus. Ja, das frage ich mich eh oft. Das frage ich mich wirklich oft, wenn ich Beiträge sehe, wo es irgendwie um Technik-Computer-Kram geht und quasi jeder zweite Satz ist falsch. Dann denke ich mir immer, wie sieht das aus bei Beiträgen, wo ich mich nicht auskenne? Sind die auch alle so kacke? Kurze Frage, mit welcher Software hast du die Thermostat- und Fensterkontakte verknüpft? Hiermit. Beste. Musste aber viel selbst machen. Musste aber viel selbst machen. Mittlerweile haben die ziemlich viel im GUI drinnen. Alter, ich hab irgendwas im Hals. Also, mittlerweile kannst du, ne, ne, das ist nicht alles Jaml. Mittlerweile kannst du sehr viel übers GUI machen. Zum Beispiel die WLAN-Integration für die LED-Leistung. Du kannst alles komplett übers GUI machen mittlerweile. Zum Beispiel die WLAN-Integration für die LED-Leistung, du kannst ja alles komplett über das GUI machen mittlerweile. Klickst du im GUI an, hinzubefügen WLAN, gibts API ein und es funktioniert. Du kannst ziemlich viele Standard-Integrations mittlerweile über GUI machen, aber du brauchst auch noch für einige Sachen YAML-Files. Allerdings ist das nicht so schlimm, weil du bekommst beispielsweise eine Visual Studio Code-Extension direkt im Browser zum editieren. Kann man installieren, damit ist das dann auch brauchbar. Die Frage kommt häufig, ne, da machen wir kein Kommando für, weil da kann ich immer ein bisschen was zu sagen, dann habe ich was zu tun. Ne, das ist aber wirklich gut. Es gibt noch ein paar Alternativen, sollte ich nicht vergessen zu erwähnen, es gibt noch so einen wie IOP-Broker oder es gibt Open Hub und solche Sachen. Also Home Assistant ist bei weitem nicht das einzige Heimautomatisierungssystem, aber Open Hub fällt bei mir schon mal komplett raus. Das ist Java und das geht ja schon mal nicht. So, IOP-Broker war glaube ich Node.js, habe ich aber noch nie was groß mit gemacht. Na ja, so, also, komm wir gucken uns jetzt mal ne Runde Battlefield am Anfang an. Oder wir gucken uns ne Runde MW2 gesnipen an. Komm wir gucken uns ne Runde MW2 gesnipen an, easy, easy. Moment. Moment. Excellent. Excellent. Doch gar keine Intervention. Oh, was ein Lack, habt ihrs gesehen? Hyper Lack. Das hat ja ne halbe Sekunde genauer, bis er hinterher gestartet hat. Guckt euch das mal an, was das für ein Lack. Das ist echt nicht gut. Das ist echt nicht gut. Das ist echt nicht gut. Das ist echt nicht gut. Das ist echt nicht gut. Das ist echt nicht gut. Guckt euch das mal an, was das für ein Lack. ACOG, excellent. Die ACOG da, richtig gute Gegner. Das war ein Hit. Was ist das für ne Hit Registration, Alter. Vorhin. Vorhin. Was sind denn das für Bots? Na überleg mal, wer spielt denn heut noch MW2? Das sind wahrscheinlich irgendwelche Leute, die die Xbox von ihrem Opa geerbt haben oder so. Was gibt es übrigens wieder, ein neues alter EW-Net habe ich gesehen für Black Ops 2 und MW3. Hab ich noch nicht ausprobiert, hab ich letztens irgendwo gelesen, dass es wieder irgendwelche modded Lobby Geschichten gibt. Also nicht modded Lobby, stimmt ja nicht, modded Game auf dem PC mit extra Lobbys und so. Alles Plutonium, oder? Doch, doch, doch. Das kann Plutonium. Dashboard. Es war nicht alles gut in MW2, sowas war z.B. kacke. Was übrigens auch daran lag, dass sie sich damals ordentlich ins Server sparen wollten, weil sie sich gedacht haben, kann auch jeder was sich daheim hosten. Gerade in 2013 oder so, gerade in Deutschland 2013 jemand daheim hosten ey. Eiss. Bam, in Ess gesniped. Bam, jawoll. Road to Commander hat man sowas früher genannt, wenn man von Level 0 alle Games gezeigt hat zu Level 60, 70 oder was das höchste da war. Ja, genau, WZG gab es damals auch noch. Was im Prinzip aber auch Road to Commander war. Was aber einen irgendwie kontroversen Namen hatte, wo ich auch nicht so genau weiß, was sich daran alle gestört haben. Ja. Mr. Sultanos sagt, jetzt hat er Bock auf MW2, glaubt mir, sobald du anfängst zu spielen lässt, ist er Bock nach, weil bei dem Spiel ist eigentlich auch viel Shit dabei. Der zeigt ja wie immer nur die Games, wo es gut gelaufen ist. Daniel Lull, 17 Monate, Dankeschön für den Sub. 17 Monate ist ja schon. Ah, vorbei. Bam. Nein, ich hab Black Ops 2021, nein 2020. Darum hab ich geholt, aber ich hab's noch nicht installiert. Richtig dumm. Ich wollte unbedingt die Kampagne spielen. Soweit sind wir schon, dass ich in Call of Duty eine Kampagne hole. Oh, Rust, Quickscope, Duell. Last Nice. Tango Sucker. Die sagen übrigens gar nicht Tango Sucker. Die sagen irgendwas anderes auf Arabisch, aber es hört sich an wie Tango Sucker. Bam. Habt ihr das gehört? Deine Mutter, hat er gerade gesagt. Also MW2 hatte schon lustige Sound-Samples. Wall-Banked. Bambi. Also Leute, Leute, Leute, das kann ich nicht promoten. Das sind ja quasi schon fast Hardscopes. Und wie wir alle wissen aus MW2-Zeiten, Hardscopes geht überhaupt nicht. Du darfst das Fadenkreuz nicht sehen. Nur dann ist es ein richtig ordentlich ausgeführter Quickscope. Und wir wissen alle, Quickscope only ist das höchste, was man machen kann in MW2. Und man muss seinen FPS auf 50 Billionen stellen. Und FPS Control Freaks drauf machen für die Stick-Verlängerung. Nur dann kann man richtig snipen. Kennt ihr diesen Blödsinn noch mit FPS Freaks oder wie das hieß? Last Knight und Last Knight muss auch sein. Kennt ihr die Dinger noch? Ja. Ich weiß nicht, was das ist. Ich weiß nicht, was das ist. Ich weiß nicht, was das ist. Ich weiß nicht, was das ist. Kennt ihr die Dinger noch? Ja. Diese Nippel-Aufsätze für Controller. Wo man damals gedacht hat, da ist man viel präziser mit, wenn ich so einen Aufsatz auf dem Stick habe. Ich habe es probiert, mir hat es nicht gefallen. Ich sage nicht, dass es gar nichts bringt. Also wenn man sich dran gewöhnt, vielleicht. Aber, also meins war es jetzt nicht. Haben die auch mal einen Xbox-Controller? So war es da, ja. Da waren die Sticks halt ein bisschen länger. Und da hat man sich dann eingeredet, man ist, weil man dann quasi bessere Übersetzungen hat oder so, ist man präziser. Ja, ja, naja, naja, also ich weiß nicht. Wo es, glaube ich, wirklich ganz gut für war, weil man Riesenhände hatte, weil dann hat man ein bisschen mehr Raum. Aber ansonsten. Ich muss gehen, ich werde jetzt rennen. Schau, schau, schau. Es ist so langsam. Komm schon, geh, geh, geh. Bam. Die Leute oben oben. Das ist gut. Das ist so einfach. Das ist so einfach. Das ist so einfach. Also eins muss man ja mal zu MW2 sagen. Die Streaks, die Streaks und gerade den Nuke, die waren viel zu einfach und viel zu OP. Bam. Gleich weggenugt. And another triple and they're spawning on top of me now. What a game this is, holy crap. Chat, chat, mein Chat ist weg. Warum ist mein Chat weg? Mein Chat ist weg. Ich muss reloaden. Loki, doing well, man. You're dead. Wo ist mein Chat hin? Dead. Watch out. Jetzt ist er wieder da. Was auch immer das jetzt gerade gewesen ist. Nice. Moment, ich hab jetzt gar nicht geguckt, ich muss gerade meinen Chat fixen. Hat er das Allerwichtigste gemacht? Hat er gemessert bei der Nuke? Hat er gemessert bei der Nuke? Ansonsten ist sie nicht legit, nicht validate. Validated. Er hat nicht gemessert bei der Nuke. Was ist das hier? Anzeige ist raus. Er ist gestorben. Das ist doch keine Entschuldigung dafür. Man muss messern bei der Nuke. Messern 360 und messern. Alles noobs, ey. Kann das sein? Ich glaub, ich hab nie eine Nuke-Gameplay hochgeladen, weil die immer so scheiße waren. Ich hab, ich glaube, ich hatte nicht ein richtig gutes Nuke-Gameplay in MW2. Das waren alles so Dinger, wo ich irgendwie 80% auf den Sack bekommen hab. Dann hab ich Harrier Chopper Gunner gemacht, Nuke. Und dann im Ende hatte ich dann irgendwie, frag mich nicht, keine Ahnung. 35, 20 oder so. Ich glaub, ich hab nicht ein, kann das sein? Ich hab nicht ein Nuke-Gameplay hochgeladen. Ich glaub, ich hab nicht ein Nuke-Gameplay hochgeladen. Dafür hat der Friseur, glaub ich, ein paar Nuke-Gameplays hochgeladen bei mir. Dann hol die Nuke nach, genau, ich mach jetzt die Xbox an und dann, easy. Dafür hat der Friseur, glaube ich, ein paar Nuke-Gameplays hochgeladen bei mir. Dann hol die Nuke nach. Genau, ich mach jetzt die Xbox an und dann easy. Easy Upload. Wie kann ich den Nuke auf Nuke Town haben? Hä? Dein Videotitel ergibt für mich keinen Sinn. Oh, jetzt endlich, endlich mal die richtige Intervention-Sniper. Der Harrier war auch, der hat auch so ultra schnell gekillt in dem Game. Das hat, du hast den Harrier gesehen. Bzzzt, tot. Ne, Intro ist 2020 auf YouTube nicht mehr in, kann man nicht mehr machen. Haha, wir sind links checken wieder. Oh. Sag mal, sehe ich, dass das da irgendwie ein Clan im Gegnerteam ist? Ernsthaft? In MW2? No. Okay, denn ein halber Clan ist da im Gegnerteam. Und hier auch, ach ne, ach ne, okay, ach ne, okay ist dieser, ja okay, verstehe. Ich hab mich verguckt, das ist wohl so ein Standardding, was viele haben jetzt, verstehe. Das sind von ihm, aha, dass er überhaupt spielen kann wahrscheinlich. Oh, no, no, no, I had to get off that roof. Wahrscheinlich finden er sonst keine Games, wenn die nicht mitmachen. Got him, got him, got him, like they have to be over, my stun missed him, dude. This game was a good run, but it wasn't good enough, I almost had it, I just had to get away from that building. Ist das, ist das gestelltes Sniper-Gameplay hier, gleicher Clan-Tech, Anzeige ist raus. Und Intervention-Thermal. Colette, let's go, baby, I'll take that start to a game any day of the week. There's another one, 4-0, nice, bam, why, there's people on the other team still spawn sniping, I don't get it, oh my gosh. Okay, da muss man einfach nur geradeaus gucken. I think if that guy peeked, he would have killed me, just because of my luck right now. I think I need to pick off one more kill here, it's been kinda slow, wow, hey, hey, it's 12. Cold-Blooded almost. Ich muss mich mal outen, ich fand High-Rise war eine Cut-Map. Got me, bruh, call these in real quick though. Weil ich hab' weder gerne gesniped, noch sonst wie, ich bin gerne rumgerannt mit irgendwie einer MP5 oder einer AK-74U oder sowas und, äh, nee, Moment, das ist MW2, äh, warte mal, MW2, Akimbo-Model, nee, was auch immer, rumgerannt und die W, du konntest ja im Prinzip nur entweder ganz außen rum oder unten rum rennen, UMP war, OP, ja, ich, ich mochte High-Rise nicht. Nee, ich hab' kein Cold War gespielt, aber nachdem ich schon wieder die Leute überall über Reverse-Boosten rumflamen, äh, Skill-Base-Matchmaking und dann Reverse-Boosten rumflamen, hab' ich auch keinen Bock drauf, sowas hat in Public-Matchmaking meiner Meinung nach nichts zu suchen und ist für'n Arsch. Ja, gut, das ist MW2, da muss man sich nicht wundern, dass der oder, das ist MW2, das ist normal. Die Map war gut, die fand ich zum Beispiel nice, ja, ich hab' vergessen, wie gesagt, Sub? Sub-Pen? War das Sub-Pen? Nee, irgendwas, wie ist das denn die Map? Sub-Base, Sub-Base, genau, irgendwas mit Sub. Hahaha, was mit dem, du Closed-Alten, was macht der da? Ja, und man muss sagen, MW2, MW2 war schon ziemlich farbenfroh versus Cod 4. Rust war Müll, genauso wie, und ich weiß, sehr unpopulärer Meinung, Nuketown ist auch Müll. Nuketown ist nur so beliebt, Nuketown ist nicht gut spielbar, Nuketown ist nur so beliebt, weil's Instant-In-Your-Face-Action ist und die schlimmste Map, genau, hier, 13, die schlimmste Map überhaupt ist Shipment, was mir absolut nicht einleuchtet, warum man ausgerechnet so eine Tracks-Map nochmal reingebracht hat. Ich mein, Shipment ist ne Map, was ein Praktikant, den man den Level-Editor installiert hat, nach 45 Minuten gebaut hat, das ist Shipment. Denn Shipment ist wirklich ne Editor-Übungs-Map, achja, übrigens, der Grund dafür ist auch, oder warum ich Shipment nicht schlecht finde in MW2 ist, weil man dort seine Sachen schnell hochleveln kann. Aber die Map finde ich scheiße, aber die Funktion ist okay, die Funktion ist okay, wobei halt die Sache die ist, man muss sich mal überlegen, ne, jetzt mal real-time, muss ich mal überlegen, wie verkackt muss ein Multiplayer sein, dass die Leute 24-7 Shipment spielen, weil sie die Waffen leveln müssen und ansonsten den Multiplayer nicht anrühren? Also wie schlecht muss ein Multiplayer sein, dass die Leute, die Leute wollen ihn nicht spielen? Und was machen die Leute, dass sie den Multiplayer möglichst wenig spielen wollen, 24-7 Shipment, bis die Waffen hochgelevelt sind? So richtig hängen geblieben, ne? Ich hab' noch immer den Kopf gesehen vom Gegner. Easy, Chopper-Ganne. Na gut, es ist, es ist MW2 Free-for-all, da wurde, da wurde auch schon rumgestellst ohne Ende. Ah, Free-for-all-Nukes waren auch nicht so ohne, also Free-for-all-Nukes waren mit, mit das schwierige, das ist das Schwierigere in MW2. Ich glaub, der ist da einfach gespawnt. Ah, easy, easy Sniper-Kill für die Nuke. Nein! Bam! Äh, doch kein Nuke? Oh, ah. Jetspam-Cool-Kerl, ja, der ist echt so, ich hab' da echt keinen Nerv drauf, ich kann mir das nicht geben. Also komm, also jetzt mal ganz im Ernst, was ist da los, also Gegner die nicht treffen ist ja okay, aber Gegner die einfach nur afk rumstehen, wieder nicht gemessert, zählt wieder nicht. Zählt wieder nicht. War nicht eine legit Nuke dabei. Ja, MW2 war viel zu einfach, die Nuke, seh ich auch so, aber wirklich. Also ich muss ja sagen, von der Basis her, also vom reinen Unterbau her, war Modern Warfare, oder jetzt meinetwegen auch Black Ops, wobei ich da wenig zu sagen kann, aber zumindest zu Modern Warfare, das war gar nicht so schlecht, aber die wussten nicht, was sie wollen. Auf der einen Seite war das mit dem Pieken und dem Rutschen und dem Movement und dem hohen Headshot Multiplayer darauf ausgelegt, dass es eher, sagen wir mal, so eine Mischung hätte werden müssen aus Rainbow Six und CS, aber dann haben sie sich dafür entschieden, wir haben quasi einen Unterbau gebastelt für ein Game, für eine Mischung aus CS und Rainbow Six, aber wir machen einfach ganz normales Call of Duty TDM draus. So, und das funktioniert halt einfach nicht, das hast du in Modern Warfare auch gesehen, dass das hinten und vorne nicht funktioniert, die Leute haben permanent nur noch am Fenster rumgeschimmelt, dann haben sie riesen Maps gemacht, wo man sich in jeder Ecke aus 70 E-Winkeln abgeaimt werden kann, aber da hat der Rest halt nicht dazu gepasst. So, und dazu kam dann auch noch, dass es halt diesen ganzen üblichen Killstreak-Gramm gab, der eigentlich, wenn man ehrlich ist, in so einem Game dann eigentlich nichts verloren hätte, plus, dass es durch Skill-Based-Matchmaking sogar nahezu unmöglich war, dann noch diese Killstreaks auch noch zu bekommen, also das war echt ein Game, was total viele Widersprüche hatte in Modern Warfare. Und ich bin immer noch der Meinung, dass Skill-Based-Matchmaking absolut nichts in so einem Public-Basher-Game wie Call of Duty zu suchen hat. Du kannst das machen, warum hat man nicht einfach einen Rank-Modus? In einem Rank-Modus ist das doch top. In einem Rank-Modus hast du da nebendran auch stehen, was du für einen Rank hast und kannst dir da drauf ein abrubbeln, dass du irgendwas als ich Gold, Platin, Master, Extreme oder so bist. Im Public-Matchmaking kannst du dir da überhaupt nichts dafür kaufen. Und ich erwarte ja auch nicht, dass jede Lobby gleich wie eine Reverse-Boosted-Lobby ist, aber zumindest, dass man die Chance drauf hat. Es war doch schon immer so, entweder wirst du gebashed oder du bashedst, aber so wie es jetzt aktuell ist, hat keiner so wirklich Spaß dran. Die Noobs spielen unter sich, bleiben für immer Noobs und krebsen da jeder mit ihrer 50 rum. Die guten Leute spielen weiter unter sich und jeder krebs da mit seinem 50 rum. Das ist doch langweilig und frustrierend as fuck. Nach meinem Ranking-Modus, dann ist okay. Es gibt ja manchmal automatisch generierte Tour-en-Tour-Turniere und so. Sowas ist gut. Sowas ist nice, ja. Aber doch nicht das normale Matchmaking. David Tree, genau das kann einem da eben auch passieren. Das finde ich auch okay. Deswegen soll es einen Unterschied geben zwischen Quickplay und Ranked. Ganz einfach. Und du musst sogar, das ist richtig, du musst sogar jede Runde tryharnen, dass du bei deinem 50-50 bleibst oder vielleicht 46, da bist du ja schon gut. Da bist du ja in Modern Warfare, wenn du nicht reverse boosted mit einer 1,5er KD oder so, bist du schon ein Gottgamer. Ich finde, das ist eigentlich hauptsächlich frustrierend und langweilig zugleich, auch wenn es sich doof anhört, wenn die Noobs unter sich sind und 1,5er KDs haben und die guten Leute unter sich sind und 1,5er KDs haben, ist richtig kacke eigentlich. Ich meine, es muss was bringen, umsonst machen die das nicht. Die sind ja nicht dumm. Analysieren tun die schon. Ich habe ja auch so ein bisschen die Vermutung, ehrlich gesagt, dass man das macht, also einmal natürlich, dass man beeinflussen kann, was die Leute kaufen im Spiel. Also man versucht das so hinzudrehen, dass man eventuell Leute bekommt, die eine Waffe haben, die man noch nicht hat und die man dann freispielt, wie auch immer. Das ist bestimmt einmal eine Variante, um zu kontrollieren, was die Leute kaufen oder Anreize zu geben, was sie kaufen sollen. Da gab es sogar mal ein Patent, natürlich ist das Spekulation, ob sie das wirklich benutzen. Aber das ist bestimmt ein Aspekt von Skill-Based Matchmaking. Der andere Aspekt ist mit Sicherheit auch, dass die Leute nicht demotiviert werden, durch komplettes Zerstört werden. Was man sich halt damit erkauft, ist, dass es halt dementsprechend auch so gut wie keine Erfolgserlebnisse mehr gibt. Also gerade Public Matchmaking ist meiner Meinung nach ganz wichtig, dass es eben zerstören und zerstört werden ist. Deswegen finde ich es auch kacke und es hat im Quickplay nichts zu suchen. Was man machen kann und was ich ja persönlich auch für viel sinnvoller halten würde, ist, man macht ein richtiges Skill-Based Matchmaking mit Ranks, wo man dann eben auch sieht, ok, der Typ ist so und so gut. Weil dann ist es auch motivierend zu tryharten. Wo ist denn die Motivation, zu tryharten, um nichts dafür zu bekommen? Das verstehe ich nicht. Wo ist die Motivation im Skill-Based Matchmaking, zu tryharten as fuck, 50-50, vielleicht 60-40 rauszugehen? Nichts dafür zu bekommen im Endeffekt. Wenn man Ranks spielt mit einem Leaderboard oder Rankanzeige und sowas, dann bekommt man ja auch was dafür, dass man tryhardet. Also das ist... Ja, genau. Und dann habe ich noch die andere Vermutung. Ich glaube ja, dass sie diese Skill-Based Matchmaking jetzt so lange tot reiten, bis ihnen was besseres eingefallen ist oder bis sie einen neuen Verkaufskund brauchen, warum man Kot 2023 kaufen soll. Und dann machen sie den Facular Stand. Könnt ihr euch noch an den Facular Stand erinnern? Facular Stand war zu MW3 eine Aussage vom damaligen Community Manager, dass sie Last Stand rausnehmen, oder zu MW2, nee, ich glaube zu MW3, dass sie Facular Stand rausnehmen, dass sie Last Stand rausnehmen. Und am Ende hieß es Final Stand und war immer noch im Game. Ja. Das habe ich übrigens damals schon nicht verstanden, warum das die Leute so feiern, weil wenn der Entwickler das wirklich für beschissen gehalten hätte, hätten sie das immer noch aus dem alten, hätten sie immer noch die Balancing ordentlich machen können im alten Game. Aber, ja. Und jetzt kommt's. Der hat aber auch viel unberechtigten Hate abgekriegt, ja. So, und wisst ihr was dann im Game war? Weiß ich, ob's Final Stand hieß? Last Stand war raus, Final Stand war drin, easy. Da haben's halt die Leute in der Hardcore gebaitet, äh. So, und so Dinge haben sie laufen. Deswegen glaube ich, das ist mit Skill-Based Matchmaking ähnlich. Also es hat seine Gründe, wie ich gerade gesagt habe, warum es das gibt, aus aktivischen Sicht, aus Spielersicht finde ich beschissen, und ich glaube in quasi ein, zwei, drei Jahren werden sie dann den Facular Stand mit Skill-Based Matchmaking machen. Fuck you Skill-Based Matchmaking. Und in Wirklichkeit haben sie dann irgendwas, was genauso abfuckt, aber einfach nur anders heißt. Ich glaube offiziell bestätigt ist es immer noch nicht, ne? Aber die werden ja auch Teufel tun, das offiziell zu bestätigen. Was, es gab noch das, wo man sich mit dem C4 auf den Boden gesprengt hat? Was? Ne. Ja ne, das war Merturdom, das war aus Quad 4, wo du ne Granate hast fallen lassen, ja. Fändest du ein, auch das ist ne gute Frage, kann ich mal kurz vor auslassen, fändest du ein Battlefield 3 Remastered geil? Nochmal das Gefühl, nein, nein, weil ich generell abgefuckt bin von zu vielen Remastered und Remakes. Es gibt zu viele, also es gibt prinzipiell schon mal viel zu viele Spiele, die aus irgendeiner Serie stammen. Sei es jetzt Assassin's Creed, For Speed, FIFA, es gibt ja gefühlt 80% der Sachen, die rauskommen, in irgendeine Serie, das geht mir schon mal auf den Keks. Dazu ist mittlerweile schon alles irgendwie Remake, Remastered, sonst wie. Ich bin der Meinung, dass ein Remastered von Battlefield 3 nicht mehr das Battlefield 3 zurückbringt, wie es neu war. Man hat das ein bisschen gesehen bei WoW Classic, WoW Classic haben die Leute auch getan, als wäre das irgendwie das gelobte Land, so WoW Classic her zurück und ich glaube von den Spielerzahlen ist WoW Classic gar nicht mal so schlecht immer noch. Also das hat der Blizzard selbst ein bisschen überrascht, aber viele haben halt im Nachhinein jetzt auch gesagt, nee, es ist zwar ein gutes Game, aber das Gefühl von WoW Classic ist es halt auch immer noch nicht, weil da gehört ja noch mehr dabei, da gehören ja auch die aktuellen Lebensumstände dabei. So nach dem Motto, man war noch in der Schule, konnte um 13 Uhr heimgehen und dann irgendwie erst mal 15 Stunden spielen und sowas, das ist halt heute nicht mehr so. Und ich glaube, das ist bei Battlefield 3 ähnlich, das Gefühl von Battlefield 3 neu wird es nicht mehr geben, deswegen bin ich der Meinung, sie sollen nicht Battlefield 3 Remasteren. Ich fände es insofern cool, wenn sie es machen würden, weil man dann wieder eine ordentliche Playerbase oder zumindest mehr als zwei Server hätte, das wäre cool und ich spiele das halt gern. Aber was ich viel besser finden würde ist, wenn die denn ein ordentliches Battlefield machen, ich meine, es kann doch nicht sein, dass sie nicht mehr in der Lage sind, ein gutes Battlefield zu machen. Das kann doch nicht sein, ich meine, gut, doch kann sein, die Leute sind alle nicht mehr da. Ihr müsst es doch hinkriegen, die sollen lieber, dazu gibt es ja noch keine News, aber ey, dann kaufe ich mir nicht. Die sollen mal ein ordentliches Battlefield machen, vor allem ein Battlefield, was gewisse Offenheit hat. Also nicht, ich meine damit nicht, dass man 50 Millionen verschiedene Waffen hat oder irgendwie riesengroße Maps, wo man sich nicht findet, sondern was ich zum Beispiel meine ist, dass man wieder, von selbst gehosteten Servern rede ich ja mal gar nicht. Das ist im Jahr 2020 ein Ding der Unmöglichkeit, dass man Server selbst hosten kann. Aber ich rede zum Beispiel dafür, dass die Server, die man sich kaufen muss, zumindest ordentliche Pluginschnittstellen haben, dass man zum Beispiel ein Sniper Limit einbauen kann, weil gerade wenn man einen ganz gut fragmentierten Server hat, das Battlefield ist ja teilweise ohne Sniper Limit gar nicht richtig spielbar. Also Sniper Limit ist eines der wichtigsten Plugins aller Zeiten gewesen und das geht aktuell nicht mehr. Server Plugins waren Poggers und dazu kommt ja auch noch, wenn der Server scheiße ist mit den Plugins, dann spielt keiner auf dem Server. Das heißt im Endeffekt setzen sich auch die Server durch mit guten Plugins-Settings, guten Mods und guten Regeln. Und gerade Sniper war richtig nice. Ja genau, das war in Overwatch schon zu spüren, dass Quickplay dich ein bisschen gerankt hat nach Können, aber nicht so krass. Also Quickplay konntest du in der Regel durchmarschieren wie sonst war, das war kein Ding. Ja es gab schon nervige Sachen, muss man halt gucken, dass man das verbessert. Aber das ging prinzipiell zu sagen, denn man sollte das Spiel so weit wie möglich abgrenzen, weil zum überwiegenden Teil hatte das schon seine Vorteile, gerade das Sniper Limit. Battlefield 3 ohne Sniper Limit ist teilweise so cancer. Da liegt dann Simone23 wieder auf Damavent Peak mit der Sniper rum, falls ich noch einer an das Video erinnern kann. Oder Simone95, ich weiß nicht, wer wieder Game Attack war, Damavent Peak mit dem Sniper im Spawn. Ne, glaube ich nicht. Dürfte eigentlich nicht so schwer sein, Battlefield 3 und Battlefield 4 Maps in einem, glaube ich nicht, das dürfte ziemlich easy sein. Soweit ich ja eh nicht weiß ob die Maps, ob die mit irgendeinem hauseigenen Editor erstellt werden oder ob das sowas ist wie 3D Studio Max und dann irgendwie konvertiert werden in Battlefield, keine Ahnung wie die das machen. Nein, auf dem Low Power Intel x86. Ja, haben wir sogar im Stream schon ausprobiert. Ja, Rush ist ja auch bester Spielmodus. Conquest kann man das ja, das ist ja noch schön an dem Server, das kann man anpassen. Also wenn man einen Conquest Server hat, lässt man es einfach raus oder passt das anders an. Das ist ja gerade das Gute da dran. Naja, und ist deswegen, also wie gesagt, ich denke sie sollten kein Remake von Battlefield 3 machen, so schön ich es finden würde, dass mal ein bisschen Spieler wieder da sind, weil wenn man hier mal gucken. Battlelog, es gibt noch eins, zwei, drei, maximal drei Server wo was drauf los ist. So, Battlefield 3. Lassen wir das mal raus und sagen Rush und dann sagen wir hier, was weiß ich, alles, alles Server. Ah, Commodate Server gibt's. What the fuck. Das ist kaputt. Okay, was auch immer. Also es gibt einen russischen Server. Neun Tom Tricks. Der hier ist ganz gut, da habe ich öfters drauf gespielt. Okay, es gibt, also man hat, sagen wir mal drei Server, die gut besucht, halbwegs gut besucht sind. Ne, vier, vier. Weil ganz ehrlich, den hier würde ich wahrscheinlich spielen, weil 32 finde ich jetzt eine gute Anzahl für Rush. BF3 Stats gibt's ja nicht mehr. Gab's ja mal diese Seite hier, BF3 Stats. Jaja, die gibt's nicht mehr, das ist ja down. Ne, Moment, das meine ich gar nicht, BF3 Stats. Gab's doch so eine Seite. Genau, die gibt's nicht mehr. BF Stats hätte. Naja, deswegen Remake vielleicht dadurch, dass es ein bisschen mehr Spieler gäbe, aber ehrlich gesagt, was mir viel lieber wäre, ein ordentliches Battlefield 6, wären wir viel lieber. So, was gucken wir uns jetzt als nächstes an? Ach komm, wo wir gerade dabei sind. Wo wir gerade dabei sind, Leute. Wir gucken uns jetzt eine Runde Battlefield an. Wo? Haben wir das nicht schon gesehen? Haben wir das nicht schon gesehen? Alter, wie die weggespringt. Das haben wir doch schon gesehen, oder? Moment, ich muss noch kurz vorspulen. Ja klar, haben wir das schon gesehen. Das ist der mit dem 4 zu 3. Jaja, klar, das haben wir schon gesehen. Okay, wollen wir mal gucken, ob es noch andere Top-Plays, Top-Plays von dem, von dem gibt's Top. Battlefield, oh ne, ne, ne. Battlefield 1 gucken wir nicht. Battlefield 5 gucken wir auch nicht. Das hatten wir schon. Wisst ihr was? Wir suchen uns einfach nach Battlefield Top-Plays bei dem auf dem Channel. Wisst ihr, das ist auch so ein Ding, was mich an YouTube nervt, dass man nicht gescheit Videos sortieren kann. Warum kann ich die Videos hier nicht nach Alter sortieren jetzt? Das ist doch voll Scheiße. Was ist das? Die Suche ist doch nicht zu gebrauchen. Vor drei Tagen das da. Ah. Exzellent. Guck mal, eine Runde Battlefield 3. In der App kannst du nicht mal Channel suchen. Ja, das ist so fail. Und, und auch das hier mit den Comments, ich hab's jetzt wieder gesehen. Ja, ne, ne, ne, ne, ne. Das bringt ja nix. Na klar kannst du hier sortieren, aber das bringt ja nix. Mal angenommen, ich will nach Top-Plays suchen und dann die Ergebnisse sortieren. Das ist ja grad das, ne? Also ich will, ich will Top-Plays suchen und dann nach Ergebnissen sortieren. Warum geht das nicht? Das ist so fail. Mich hat's übrigens letztens wieder, also vorgestern wieder genervt. Ich hab ja tatsächlich, wer's noch nicht mitbekommen hat. Ich hab's ja tatsächlich geschafft, auf YouTube mal ein Video zu machen, was jetzt vielleicht nicht das allerbeliebteste Thema war, geb ich zu, ja. Aber, okay. Und da hat's mich mal wieder genervt, dass man nicht ordentlich Comments suchen kann. Also zumindest nicht hier drinnen. Man kann über das Studio ein bisschen besser suchen, aber finden tut mir auch nix. Und zwar, ich wollte, also ich wollte einem antworten in den Kommentaren, ob er sich nen Gaming-Monitor oder nen Fernseher holen soll. So. Und hab gesagt, wo ist das denn? Und das einzige, was mir eingefallen ist, das zu machen, ist das hier. Ich lade einfach alle Comments und dann mach ich Steuerung F in der Seite. Muss ich mal vorstellen, wie hängen geblieben das ist, dass es da keine andere Möglichkeit gibt. Ich mein, wer hat sich das ausgedacht? Das mag gut funktionieren für Channels, die fünf Kommentare bekommen, aber ich bekomm ja glücklicherweise noch ein bisschen mehr. So. Genau, da wollte ich drauf antworten. Und ich hab es nicht, ich hab es nicht gefunden. So, und dann hab ich so gemacht, dann hab ich's gefunden, ja. Also, wenn ihr euch fragt, ob ihr für Gaming, Fernseher oder Monitor kauft, kauft euch unbedingt ein 144-Hertz-Monitor, alles andere Sackt. Guck mal Battlefield an. Meine Antwort war, das ist ja, was ich gerade gesagt hab, dass man sich ein Monitor kaufen soll. Captain Peng, das könnte man machen, aber es ist armselig, dass es auf YouTube nicht standardmäßig geht. Ich mein, YouTube ist eine Plattform, wo es sich um Content und Interaktion mit den Zuschauern dreht. Auf Twitch ist zwar die Interaktion noch ein bisschen höher, okay, aber warum macht man es denn dann so schwer, das zu machen? So, wir gucken jetzt ein bisschen Battlefield. Exzellent. Bam, your ass revived. Also, das ist gestellt, oder? Das kann ich mir nicht, das muss gestellt sein. Das ist gestellt. Das glaub ich euch nicht. Nein, das glaub ich euch nicht. Also, das glaub ich nicht. Also, da musste ja schon komplett Gehirntod sein. Ja. By the way, kam CSGO nicht ein Jahr später raus? Kam CSGO nicht 2012? Ja. Und was man daran sieht ist, die gut und langen Game leben kann mit ordentlichem Support. Aber da hatten wir ja keinen Bock drauf. Und Battlefield 3 hätte auf jeden Fall das Potenzial gehabt. Die hätten aus Battlefield 3 ein Service-Game machen sollen. Ich hätte nicht gedacht, dass ich das mal sage. Battlefield 3 wäre das Game gewesen. Vielleicht auch 4, okay. Aber man hätte ehrlich gesagt Battlefield 3 nach und nach als Service-Game Richtung Battlefield 4 entwickeln können. Und man hätte glaube ich so ziemlich das beste Battlefield-Game ever damit erstellen können. Was ist das überhaupt für eine Waffe? Ich wusste gar nicht, dass die überhaupt existiert. Das ist irgendwie eine DLC-Waffe, oder? Der wollte aber den da treffen, ne? Dann hab ich die Waffe nie gespielt. Oh, oh, oh. Das ist ja nice. Der ist ja nice hier. Bam. Oh, oh, oh. Das sind so Dinger. Das ist das, was Battlefield geil macht. Dass das nicht gescriptete Sachen sind, die ganz normal immer wieder in-game vorkommen. Und ich glaube, das ist das, was sie nicht verstehen. Bam. Okay, der zielt wenigstens drauf. Der glaubt zwar selbst nicht, dass er trifft, aber es war wenigstens kein sinnloser Random-Shot. Er zielt zumindest drauf, ja. Das Game ist so alt. Warum brauchen die hier 50 Milliarden Overlays drüber? Das ist die Map mit dem AC-130, oder? Das ist die Map mit dem Gunship. Die war richtig fail. Oh, der war cool. Der war cool. Wie er direkt rüberfliegt über die Artillerie, oder was? Und bam. Oder auch nicht. Nice. Einfach ein Panzer gehittet across the map. Stimmt, ja, ja. Es gibt noch die Nachtmap. Die Nachtmap gibt es noch mit AC-130. Die Map, die wir eben gesehen haben. Diese Schneemap. Diese langgezogene Schneemap, wo ich keine Ahnung habe, wie die heißt. Und die andere fällt mir gar nicht auf. Wow. Auch mehr Glück als verstanden. Armored Shield. Ja, ja, genau das kann sein. Die Panzermap war das, wo... Okay, wir springen einfach mal in die Richtung und hoffen, dass wir... Okay, das war Glück. Das war pures Glück. Ich finde es übrigens ganz gut, wenn er nicht drüber labert. Da kann ich nämlich einfach zu labern. Okay, der aimt wenigstens Richtung Heli, oder was? Was ist das überhaupt? Ein Heli? Ein Jet? Ich glaube Heli, oder? Der Qualmeister. Das ist aber ein Jet. Schreckt. Ja, ja. David, der Beste. C4 Action in Bad Company 2 war auch nice. Gerade C4 kannst du in Bad Company 2 als Sniper irgendwie drei Kilometer weit werfen. Bam. Nice. Genau das ist das Geile an Battlefield, dass solche Dinger eben, wie ich gerade vor hin schon gesagt habe, unscriptet random passieren. Und das ist, glaube ich, wo ich denke, das haben sie nicht so genau verstanden. Man hat es schon in Battlefield 4 gesehen, wo ihn eigentlich eingeleuchtet ist. Wo sie dann angefangen haben mit Only in Battlefield Moment. Wo sie dann versucht haben, das zu bewerben, aber es dort dann nicht mehr so gut hinbekommen haben. Wo sie es dann krampfhaft probiert haben, so nach dem Motto, wir wollen nicht, dass es zufällig entsteht, sondern wir wollen, dass es quasi immer wieder quasi zufällig entsteht. Ja, sowas wie Revolution Geschichten, die sie eingeführt haben und sowas. Das war schon zu gewollt irgendwo. Aber Battlefield 4 haben sie immer noch gut gemacht. Was sie, glaube ich, bis heute nicht so genau kapiert haben, dass das eigentlich die Sache ist, die Battlefield mit ausgemacht hat. Bam! Und jetzt noch in Chat rein, ne, okay. Zack! Was ist mit dem, sag mal, will sich der Heliman mal bewegen? Der Heliman, sag mal, haben die sich vorher abgesprochen? War das Absicht? Was ist mit dem Heliman los? Wow! Alter, war das halbe Team? War das das ganze Team mit dem Haus? Ah, Firestorm. Schreckt. Schuuh! Äh. Äh. Wisst ihr... Nice, nice. Und jetzt noch in Chat rein. Das sind das, ich finde das die geilsten Clips, die geilsten Clips sind immer wenn sie wieder in Chat reinhüpfen, nachdem sie einen feindlichen Heli oder ein Jet gesmort haben. Übrigens, ähm, wisst ihr wie sich das auf den Controller angehört hat, wenn Leute gut Chat fliegen konnten? Alter, das ist mein Xbox-Controller, da ist er eingestaubt. Er sieht mir, wie oft ich die Xbox One verwendet hab. Wisst ihr wie sich das angehört hat, wenn Leute, die richtig gut Chat fliegen konnten, in Battlefield 3 Chat geflogen haben? Das hat sich so angehört. Das war der Boost, weil man genau, die Leute im Chat, die viel Chat geflogen haben, wissen es wahrscheinlich jetzt, ich weiß es nämlich aus dem Kopf nicht mehr. Ich glaube man musste genau 300 kmh oder sowas haben für den engsten Turnradius in Battlefield 3. Deswegen haben die alle permanent oder 312, ja ich wusste in der Chat, weißt du was? Und die haben alle immer so gespielt, dass man genau 312, 313 hatte. Ich halte das genau 2 Minuten aus, dann tun mir die Finger weh, aber die Chat Pros in Battlefield 3, die haben das drauf. Dafür habe ich Lucio mit Mauswheel gespielt. Wer fliegt denn mit Gamepads, der Konsolenspieler? Und auf dem PC auch teilweise. Ah, Co-Comrades. Ich finde es immer geil, wenn sie rausspringen. Oh, das war nice. Zerstören, wieder reinspringen. What? 360, wo ist der 360? Auf, auf. Ok, das ist, ist das Console Graphics? Ist das Console Graphics oder jemand mit richtig beschissener Auflösung auf dem PC? Haha, Swat, das fordert mich nicht. Man konnte aber auch den Controller relativ schnell schrotten, wenn man die Buttons zu sehr, zu brutal verwendet hat. Bam, zack, der war nice. Voll durchs Cockpit durch. Nice. Nice. Das wird der Console Graphics. Wenn ich mir überlege, ich habe ja damals viel auf der Xbox 360 gespielt, ne? Und ich habe mir dann auch Battlefield 3 auf dem PC gekauft später und so was. Und könnt ihr euch das vorstellen, dass ich damals dachte, dass der Unterschied zwischen Xbox 360 und PC ja gar nicht so groß ist? Aber es ist nachvollziehbar, weil wenn du von der Xbox 360 auf den PC wechselst, dann sieht es ja einfach nur schärfer und besser aus. Dann fällt dir das gar nicht so auf, wie schlecht das eigentlich ausgeschaut hat. Wenn du allerdings jetzt vom PC auf die 360 wechselst, dann wirst du feststellen, dass das wie Augenkrebs aussieht. Ich habe, ich habe dann, wie gesagt, ich habe ja, ich habe ja sau viel 360 gespielt und dann habe ich mir noch einen PC gekauft, dann habe ich fast nur noch PC gespielt und ich habe gedacht, das ist kein großer Unterschied. Und irgendwann ein paar Monate später habe ich damit 360 wieder angemacht und festgestellt, Alter, sieht das kacke aus. Zack. Ach, den FPS-Unterschied, den hat man, finde ich, gar nicht so extrem gemerkt, dadurch, dass man es mit dem Controller gespielt hat. Na klar, ich meine, man hat schon gemerkt, dass es teilweise richtige Slowdowns und sonst was gab, aber gerade was das, was das Movement und so angeht, der Unterschied zwischen, hättest du das mit Maus gespielt an der Xbox 360, daher hättest du es mehr unspielbar gewesen. Aber mit dem Controller und zumal ich den Controller ja auch relativ langsam eingestellt habe, dass man besser trifft, ging es eigentlich. Ich meine, man hat halt fünf Minuten gebraucht, so hier einmal der Maus so macht, hat man halt mit dem Controller irgendwie so gemacht. Habt ihr es gehört? Vielleicht springt man mir aus einem Chat raus und was das für ein Spaß, Alter. Was ist mit dem Typ los? Ah, Nose-Hair-Cannons. Hahaha, AFK-Leute wieder. Ja und warum sind die immer alle AFK? Die sind wirklich blind. Die gucken sich die schöne Wolkensimulation an, ja. Boah, der hat aber seinen Bass übelst hochgestellt. Guck euch mal den Bass an. Voller Spaß. Alter, was hat der mit dem Saal? Boah, Console-Grafics. Boah, Alter. Ihhh. Oh Gott, sieht das hässlich aus. Das ist 360, Alter. Sieht das hässlich aus. Guckt euch das mal an. Boah, sieht das hässlich aus. Alter. Hahaha. Das hab ich ja noch nie gesehen, Alter, was? Das ist ja geil. Einfach durchgezogen mit dem Defi hier. Boah, ja mach noch lauter, gut an der stelle an der stelle ist es ja echt gar kunst aber nice play richtig profi streamer mit webcam hier ja ja übrigens so du grad sagst hier bei der konsole sind manche textur nicht geladen ist auf dem pc auch so gewesen dass manche objekte nicht mehr geladen wurden wenn du die wenn du die settings auf low hattest zum beispiel im tunnel von dem event peak deswegen habe ich das auch nur mit low settings gespielt wenn man dem event peak im tunnel gestanden hat dann wurden die kisten nicht geladen und man konnte durch die kisten durchgucken und die gegner sehen man konnte die gegner glaube ich nicht beschießen ohne kisten durch die durch die nicht von da bin ich mir gar nicht sicher ob das ging aber du konntest die gegner sehen in dem event peak sehen relativ viele kisten am anfang des tunnels und wenn du die settings auf low hattest wurden die kisten nicht geladen hast alles gesehen easy hab ich battlefield 3 noch installiert das ist ein nicer stream hier mit der pistol ach nee erstmal shotgun was sonst metro shotgun poggers das war poggers BÄM zack das wär richtig geil gewesen hätte die noch erwischt mit der afk mörser typen die mörser dudes mitten auf der gas was ist denn mit denen los warum stellen die sich mitten auf die gas mit dem mörser soll sich da dahinter stellen ins haus hier nebestellen irgendwo hin aber dann mit auf die gas das schreiber man die gegner was ist mit euch los nee ins haus hab ich gesagt ins haus ans haus nicht ins haus er kann sich auch ins haus stellen mit dem mörser ja leider nicht so lang das ist oder ob es gestellt ist nee wahrscheinlich ist einfach gestellt der typ ist so oft hier dabei mit der webcam das gefühlt in jedem top play dabei das ist der allseits wie der top fahrschnitt einfach so ne tupperdose drüber und dann drumherum abschneiden das sind bestimmt russische life hacks wieder am start der ist aber gut der typ der hat schon sau viel krasse clips gehabt blub blub der spielt aber bestimmt mit zwei drei leute noch zusammen hattest du damals eine hd79 kann sein ja ja kann sein damals hatte ich da amd grafikkade das war noch die zeit bevor nvidia gemeint hat wir geben dir grafikkarten umsonst schön weggesprayt am amkomm diffuse henne wollten die grad machen auf Ist doch nicht gekommen Bäm Bäm Bäm Bäm Bäm Bäm Jawoll Rex Beste Wie er die Waffen des Kitt geswitcht hat. Habt ihr gesehen wie er das Kitt geswitcht hat. Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Oh mein Gott Komm rein Richtiger Pro-Move Richtiger Pro-Move Oh mein Gott Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move Richtiger Pro-Move", "segments": [{"id": 1, "start": 30.0, "end": 52.46, "text": "So, wer jetzt nicht glauben will, dass es gerade aufgekoppelt ist, bei mir auf dem zweiten Rechner,"}, {"id": 2, "start": 52.46, "end": 72.9, "text": "der Avira Black Friday Sale. So, Crap, warum hab ich den Kram überhaupt noch installiert. So,"}, {"id": 3, "start": 72.9, "end": 81.78, "text": "aber ich find's schon geil, dass mittlerweile Viren-Scanner oder Antivirus-Hersteller eigentlich"}, {"id": 4, "start": 81.78, "end": 88.32, "text": "kein dort besser sind als irgendwelche Scammers. Du kriegst kostenlos Werbung, du kriegst Fehler"}, {"id": 5, "start": 88.32, "end": 94.04, "text": "angezeigt, die keine Fehler sind. Also, das ist schon Hardcore-Jubate, was da abläuft."}, {"id": 6, "start": 94.04, "end": 114.92, "text": "Richtig heftiger Jubate. Musik ist zu anstrengend. Iceland, wie Shopmusik. Was ist das? Ja, verlassen."}, {"id": 7, "start": 114.92, "end": 127.76, "text": "So. How to Twitch Chat, PogChamp. Das müssen wir lernen. Aus irgendwelchen Gründen aktualisiert"}, {"id": 8, "start": 127.76, "end": 132.36, "text": "der Chat bei mir nicht, aber ich seh's hier in der anderen Vorschau, dass der Chat läuft."}, {"id": 9, "start": 132.36, "end": 145.92, "text": "Twitch, please. Was ist da schon wieder los? Come on, brah. Mach ich einfach mal Refresh."}, {"id": 10, "start": 145.92, "end": 153.96, "text": "Ah, ja, ja. Gerade rechts hat er den Chat aufgemacht. Übrigens Leute, ich hab meine"}, {"id": 11, "start": 153.96, "end": 165.92, "text": "LED-Strips noch ein bisschen upgraded. Das hab ich euch ja gezeigt, auch auf Twitter,"}, {"id": 12, "start": 165.92, "end": 175.28, "text": "hier dieses, das Fake-Feuerwerk-LED-Strip. Ja, den da, ne? Hab ich euch ja gezeigt."}, {"id": 13, "start": 175.28, "end": 178.28, "text": "Haben wir jetzt sogar zusammen im Stream gebaut. Also, bei allen, die hier dabei waren, die"}, {"id": 14, "start": 178.28, "end": 182.04, "text": "kennen das. Das haben wir zusammen im Stream gebaut. Ich hab das jetzt ein bisschen geupgradet,"}, {"id": 15, "start": 182.04, "end": 187.64, "text": "weil was man hier sieht, ist, hier hab ich ja nur die Leiste an das Fenster geklebt."}, {"id": 16, "start": 187.64, "end": 194.32, "text": "Also sprich, du siehst hier die kompletten einzelnen Bildpunkte, die einzelnen Lichter,"}, {"id": 17, "start": 194.32, "end": 204.44, "text": "siehst du hier. Das sieht ein bisschen scharf und ein bisschen billig aus, um's mal so zu"}, {"id": 18, "start": 204.44, "end": 215.88, "text": "sagen. Deswegen hab ich mir jetzt folgendes noch gekauft dafür. Und zwar LED-Aluminium-Sowas"}, {"id": 19, "start": 215.88, "end": 222.12, "text": "hab ich mir gekauft, genau. Ziemlich ähnlich zu dem hier. Ich mach jetzt mal stellvertretend"}, {"id": 20, "start": 222.12, "end": 227.2, "text": "das hier auf. Das ist alles mehr oder weniger das gleiche. Sowas hier in der Richter und"}, {"id": 21, "start": 227.2, "end": 234.96, "text": "drauf zehn Stück, jeweils in Meter, ja, das könnte die tatsächlich sein. Und da ist so"}, {"id": 22, "start": 234.96, "end": 241.08, "text": "ein, wie nennt man das überhaupt? Da kommt so ein, so ein Milchglas, oder was auch immer,"}, {"id": 23, "start": 241.08, "end": 247.64, "text": "so eine Milch. Diffuso, ach das ist exzellent. Der Chat wieder hier. Big Brain Chat, exzellent."}, {"id": 24, "start": 247.64, "end": 252.28, "text": "Wahrscheinlich steht das da irgendwo und ich hätt's mal vorlesen müssen. Zumindest, das"}, {"id": 25, "start": 252.28, "end": 260.68, "text": "betreut das Licht von den LEDs noch ein bisschen. Ich bin mir jetzt gar nicht sicher, ob ich"}, {"id": 26, "start": 260.68, "end": 270.12, "text": "überall, hab ich überall die Folie abgemacht? Lull weh. Wartet mal, ich muss mal kurz gucken,"}, {"id": 27, "start": 270.12, "end": 285.6, "text": "ob ich irgendwie, ob ich die Folie abgemacht hab."}, {"id": 28, "start": 285.6, "end": 314.4, "text": "Ich denk schon. Also ich hab jetzt keine Folie mehr gefunden. Zumindest, das hab ich"}, {"id": 29, "start": 314.4, "end": 322.0, "text": "jetzt über die LEDs drüber, sodass es jetzt dementsprechend nicht mehr ganz so extrem"}, {"id": 30, "start": 322.0, "end": 327.72, "text": "die einzelnen Bildpunkte raus strechen, also die einzelnen Pixels hier raus stechen, sondern"}, {"id": 31, "start": 327.72, "end": 331.4, "text": "das ist jetzt alles ein bisschen, ich hab da jetzt grad noch kein Bild von, jetzt kann"}, {"id": 32, "start": 331.4, "end": 336.44, "text": "ich keins machen, gescheit, weil es nicht dunkel ist. Kann ich schon, aber sieht nicht"}, {"id": 33, "start": 336.44, "end": 344.36, "text": "so doll aus. Zumindest hab ich das gestern eingebaut und die Sache ist, die mein Fenster"}, {"id": 34, "start": 344.36, "end": 357.32, "text": "ist unten nur 86 cm breit und oben ist mein Fenster dann irgendwie 115 cm oder so. Nee,"}, {"id": 35, "start": 357.32, "end": 364.44, "text": "Schwachsinn. Nicht oben. Unten ist das Fenster ja gar nicht quadratisch, nein nicht rechteckig."}, {"id": 36, "start": 364.44, "end": 369.12, "text": "An der Seite ist es 115 cm und unten ist es irgendwie nur 86 cm oder so. Deswegen hab"}, {"id": 37, "start": 369.12, "end": 373.4, "text": "ich so eine Leiste genommen, hab bei einer 15 cm abgeschnitten und bei der anderen dran"}, {"id": 38, "start": 373.4, "end": 378.44, "text": "gemacht und das geht echt ganz gut, muss man sagen, das ist wirklich top und dann sieht"}, {"id": 39, "start": 378.44, "end": 382.76, "text": "es nicht mehr so billig aus, wie einfach ein LED Strip hier dran geklebt, sondern das sieht"}, {"id": 40, "start": 382.76, "end": 389.52, "text": "jetzt richtig so ordentlich aus und man kann diese Leisten auch einfach abmachen, weil"}, {"id": 41, "start": 389.52, "end": 393.92, "text": "die LED Leiste, die hat ja nur einmal Kleber hinten dran und wenn ich das abroppe ist"}, {"id": 42, "start": 393.92, "end": 409.0, "text": "halt kacke. Homo 08186 Monate. Excellent Subscription, Dankeschön für den Sub. Ja, genau und das"}, {"id": 43, "start": 409.0, "end": 412.8, "text": "hab ich gestern auch gebastelt. Eigentlich wollte ich gestern schon mal wieder Stream"}, {"id": 44, "start": 412.8, "end": 416.52, "text": "anschmeißen, aber ich hab mir gedacht, jetzt bastelt ihr erstmal das LED Zeug fertig. Ja"}, {"id": 45, "start": 416.52, "end": 422.24, "text": "ne, ich kann ein Bild machen, aber man erkennt da jetzt, wenn es so hell ist, nicht so viel."}, {"id": 46, "start": 422.24, "end": 428.52, "text": "Doch, ich kann euch ein Bild machen, wartet mal kurz, ich muss ein Handy holen zum Foto"}, {"id": 47, "start": 428.52, "end": 429.52, "text": "machen."}, {"id": 48, "start": 429.52, "end": 456.04, "text": "Das ist doch nicht ganz perfekt, ich muss das noch mal runter machen, wahrscheinlich,"}, {"id": 49, "start": 456.04, "end": 462.0, "text": "weil ich hab es erstmal nur reingepappt, um zu gucken, ob es passt und ich hab die LED"}, {"id": 50, "start": 462.0, "end": 465.68, "text": "Leisten in diesen Dinger noch gar nicht angeklebt, weil ich mir gedacht hab, ich mach es danach"}, {"id": 51, "start": 465.68, "end": 468.72, "text": "eh noch mal runter, aber es war dann gestern Abend um 20 Uhr, da hatte ich keine Bock mehr,"}, {"id": 52, "start": 468.72, "end": 476.8, "text": "das noch mal runter zu machen. Aber ich kann es euch mal zeigen, ich mach jetzt erstmal"}, {"id": 53, "start": 476.8, "end": 486.68, "text": "einen anderen Effekt, dass man auch alle LEDs sieht. So, jetzt mach ich mal kurz ein Bild"}, {"id": 54, "start": 486.68, "end": 487.68, "text": "von."}, {"id": 55, "start": 487.68, "end": 491.76, "text": "Moment, da muss ich ein Stückchen hier rüber rücken, dass man es gescheiter erkennt."}, {"id": 56, "start": 491.76, "end": 504.88, "text": "Ah, das sieht jetzt nicht so gut aus, aber ich lad euch das Bild mal hoch. Also, was"}, {"id": 57, "start": 504.88, "end": 512.16, "text": "gibt es denn für eine schöne Image Host Seite, wo man keine App für braucht, wo ich, nehm"}, {"id": 58, "start": 512.16, "end": 530.08, "text": "ich denn da immer hier, Post Image, Post Image, genau, da gehen wir jetzt hin, sagen Upload,"}, {"id": 59, "start": 530.08, "end": 541.52, "text": "Post Image, Photolibrary und dann nehmen wir das hier. Ok, so, jetzt gehen wir mal, also"}, {"id": 60, "start": 541.52, "end": 547.32, "text": "Hups, ich zeig es euch mal. Boah, alle die können ja, können die ihren Code noch mal"}, {"id": 61, "start": 547.32, "end": 559.72, "text": "länger machen, der ist ja 3 Kilometer langer Code, den ich jetzt abtippen muss. Ok, Moment,"}, {"id": 62, "start": 559.72, "end": 573.44, "text": "also, Post Image, ok, D8, 4, Y, K, H, gibt es da nicht irgendwie eine ordentliche, irgendwas"}, {"id": 63, "start": 573.44, "end": 585.24, "text": "ordentlich zum Sinken oder so, 2, 4, 2, 1, 4, 1, 1, 4, wo ist es? Upload Completed, ach"}, {"id": 64, "start": 585.24, "end": 596.96, "text": "so, ich hätte einfach nur das da schicken müssen, ach egal, ja, so sieht es jetzt aus,"}, {"id": 65, "start": 596.96, "end": 607.0, "text": "guck, ist schon besser mit den Leisten hier, ich hab jetzt ein bisschen buntiges Zeug angemacht,"}, {"id": 66, "start": 607.0, "end": 616.2, "text": "dass man es auch ganz gut sieht, also so ist es halt viel weicher, das Licht und es sieht"}, {"id": 67, "start": 616.2, "end": 620.44, "text": "auch deutlich besser, als man das da mal außen vor, das muss ich noch gucken, dass es ordentlich"}, {"id": 68, "start": 620.44, "end": 628.2, "text": "kürzt. Die Leisten sind so, ja, die Leisten sind ungefähr nur einen Zentimeter breit,"}, {"id": 69, "start": 628.2, "end": 638.16, "text": "die gucken ganz kleines bisschen aus dem Fenster raus, aber nicht so wild, ja, also so sieht"}, {"id": 70, "start": 638.16, "end": 642.96, "text": "es jetzt aus, also im Vergleich zu hier sieht man jetzt halt schon, hier sind die Lichter"}, {"id": 71, "start": 642.96, "end": 647.28, "text": "halt richtig, so richtig hart außen, das fällt jetzt nicht so auf, weil die Kamera"}, {"id": 72, "start": 647.28, "end": 652.76, "text": "noch ein bisschen blört das Ganze, weil das Licht reinleuchtet und hier ist es halt schön"}, {"id": 73, "start": 652.76, "end": 657.92, "text": "diffusst das Ganze und es sieht natürlich ordentlicher aus, wenn da Leisten drin sind"}, {"id": 74, "start": 657.92, "end": 665.6, "text": "im Fenster, als wenn da irgendwelche LED-Strips direkt im Fenster hängen. Also wie gesagt,"}, {"id": 75, "start": 665.6, "end": 668.96, "text": "hat sich gelohnt und es hält sich auch in Grenzen, ich mein, das ist wahrscheinlich"}, {"id": 76, "start": 668.96, "end": 678.52, "text": "sogar noch eine der teureren Sachen, das sind 10 Stück für 35 Euro, jeweils ein Meter,"}, {"id": 77, "start": 678.52, "end": 682.92, "text": "also 10 Meter, so Aluminium-Dinger für 35 Euro, geht es bestimmt noch billiger. Übrigens"}, {"id": 78, "start": 682.92, "end": 686.72, "text": "was witzig ist bei dieser Sache hier, die schreiben alle ihre Strips werden nicht gelb,"}, {"id": 79, "start": 686.72, "end": 690.04, "text": "die schreiben alle Anbieter, fragt man sich, ob es noch Anbieter gibt, wo die Strips überhaupt"}, {"id": 80, "start": 690.04, "end": 695.36, "text": "gelb werden, äh, die das Plastik auch überhaupt noch gelb werden, naja, so zumindest so sieht"}, {"id": 81, "start": 695.36, "end": 699.32, "text": "es jetzt aus, sieht auch viel schicker aus, du siehst die LED-Strips nicht mehr und man"}, {"id": 82, "start": 699.32, "end": 703.44, "text": "kann das wahrscheinlich auch besser abmachen, wobei ich jetzt, gestern habe ich mir noch"}, {"id": 83, "start": 703.44, "end": 711.52, "text": "ein Gehäuse ausgedruckt, gestern habe ich mir noch ein Gehäuse ausgedruckt, aber ich"}, {"id": 84, "start": 711.52, "end": 721.68, "text": "hoffe mal, das finde ich jetzt, NodeMCU Relay Case, das da, habe ich mir gestern noch ausgedruckt,"}, {"id": 85, "start": 721.68, "end": 728.28, "text": "äh, aber ohne die Relays drinnen, ich habe einfach hier ein Board rein, das passt eigentlich"}, {"id": 86, "start": 728.28, "end": 739.12, "text": "ganz gut, der, hehehe, Kyogre, viel Spaß, richtig gut, ja, sieht viel besser aus, und"}, {"id": 87, "start": 739.12, "end": 744.2, "text": "ich habe das auch ziemlich passend abgeschnitten, dabei habe ich bloß so Pima Daumen abgemessen"}, {"id": 88, "start": 744.2, "end": 749.68, "text": "mit dem Maßband, aber am Ende hat es doch ziemlich gut reingepasst, und ich war ja richtig"}, {"id": 89, "start": 749.68, "end": 756.8, "text": "froh, dass ich mir mal vor einer Weile so ein Dremel-Set gekauft habe, dieses Einsteiger-Ding,"}, {"id": 90, "start": 756.8, "end": 767.76, "text": "glaub so, ich glaub, das da, ich glaub das Ding hatte ich mir mal vor einer Weile gekauft,"}, {"id": 91, "start": 767.76, "end": 771.84, "text": "weil damit kannst du halt auch mal so ein Aluminium-Ding durchschneiden, ansonsten hast"}, {"id": 92, "start": 771.84, "end": 778.48, "text": "du ja daheim nix, wo du irgendwelche Metallsachen schneiden kannst, kannst ja schlecht mit"}, {"id": 93, "start": 778.48, "end": 783.12, "text": "dem Seitenschneider anfangen oder so, das kriegst du vielleicht irgendwie nach 3 Stunden"}, {"id": 94, "start": 783.12, "end": 790.44, "text": "mal durch, aber es sieht halt ausgefranst ohne Ende aus, so, Lechak1978, Dankeschön für"}, {"id": 95, "start": 790.44, "end": 795.0, "text": "den Sub, oh Kyogre, ich hab dich glaube ich übersehen, äh, aber das ist ja schon Hypersubscriber"}, {"id": 96, "start": 795.0, "end": 800.72, "text": "hier, Kyogre, und bei dir auch, 16 Monate, das ist ja schon hier Hyper Hypersubscriber,"}, {"id": 97, "start": 800.72, "end": 811.32, "text": "Dankeschön für die ganzen Subs, Kegmas, genau, so, damit hab ich es abgeschnitten, dann hab"}, {"id": 98, "start": 811.32, "end": 816.44, "text": "ich mir das hier als Case ausgedruckt, die Relays hab ich rausgeschmissen, also das ist"}, {"id": 99, "start": 816.44, "end": 820.16, "text": "gar nicht reingemacht, ich hab hier einen Controller reingemacht auf der Seite, und"}, {"id": 100, "start": 820.16, "end": 827.92, "text": "hier die restlichen Kabels, man sieht es hier unten auch noch, ah, ne, man sieht es hier"}, {"id": 101, "start": 827.92, "end": 833.92, "text": "unten nicht, aber hier ist das Case, hier ist das Case, und da sitzt auch noch kein"}, {"id": 102, "start": 833.92, "end": 839.08, "text": "Deckel drauf, hier ist das Case, da ist, guck, hier sieht man neben, sieht man noch den Rand"}, {"id": 103, "start": 839.08, "end": 848.96, "text": "vom Case, wenn ich es richtig, guck hier, hier sieht man noch den Rand vom Case, da"}, {"id": 104, "start": 848.96, "end": 854.28, "text": "kommt nämlich der ganze Mist rein, da wird das zugemacht, dann guckt, ok, plus noch das"}, {"id": 105, "start": 854.28, "end": 864.44, "text": "Netzteilkabel rein, und diese zwei LED-Strip-Kabel raus, und dann ist gut, tja, also, wie gesagt,"}, {"id": 106, "start": 864.44, "end": 868.6, "text": "das kann ich für LED-Strips echt nur empfehlen, gerade wenn man auf die Idee kommt, mit LED-Strips"}, {"id": 107, "start": 868.6, "end": 873.36, "text": "noch ein bisschen mehr zu beleuchten, dann ist das, stell euch mal vor, ihr wollt beispielsweise"}, {"id": 108, "start": 873.36, "end": 879.12, "text": "euer Wohnzimmer beleuchten, ne, und, keine Ahnung, ihr habt das Sofa irgendwie in der"}, {"id": 109, "start": 879.12, "end": 881.72, "text": "Mitte vom Raum stehen oder so, und wollt hinten an den Sofa einen Strip machen, einfach dran"}, {"id": 110, "start": 881.72, "end": 886.64, "text": "zu kleben ist kacke, hier mit solchen Sachen ist das viel schöner, generell ist es immer"}, {"id": 111, "start": 886.64, "end": 890.56, "text": "schöner, hab ich jetzt gemerkt, wenn man Beleuchtung macht mit LED-Strips, wenn die"}, {"id": 112, "start": 890.56, "end": 894.0, "text": "ein bisschen indirekt ist, also am besten ist eigentlich, man macht die irgendwo dahinter"}, {"id": 113, "start": 894.0, "end": 899.12, "text": "und lässt die dann gegen die Wand scheinen, oder so, die sieht viel, viel besser aus, als"}, {"id": 114, "start": 899.12, "end": 902.44, "text": "die LED-Strips direkt in den Raum scheinen zu lassen, wie wir es hier sehen, was eigentlich"}, {"id": 115, "start": 902.44, "end": 907.72, "text": "mit dem, das sieht richtig kacke aus jetzt im Nachhinein, ne, naja, man lernt nicht aus,"}, {"id": 116, "start": 907.72, "end": 913.32, "text": "ja, so, was haben wir jetzt, 12 Monate für den, für der Kommentator, underscore, excellent"}, {"id": 117, "start": 913.32, "end": 925.0, "text": "Subscription, für den Sub, und das Scam Train ist auch am Start, der Jibay Train, ja, ist"}, {"id": 118, "start": 925.0, "end": 928.88, "text": "viel, hast du vollkommen recht, ist viel angenehmer, wenn man nicht direkt in die LEDs guckt, sondern"}, {"id": 119, "start": 928.88, "end": 958.08, "text": "in diffusedes Zeug reinschaut, also, ich muss mal wieder hier, Paulgas Effekte machen, so,"}, {"id": 120, "start": 958.08, "end": 963.6, "text": "was macht dein Projekt mit den Zigbee-Thermostaten-Plans zu Fenster, Fensterkontakte habe ich schon,"}, {"id": 121, "start": 963.6, "end": 966.96, "text": "aber keine Zigbeede sind noch die alten Z-Wave-Dinger, die werde ich auch lassen, warum nicht einfach"}, {"id": 122, "start": 966.96, "end": 972.92, "text": "bei das, oh, warte mal, gerade, jetzt kann man den Stecker von dem LED-Strip draußen"}, {"id": 123, "start": 972.92, "end": 999.28, "text": "reinschneiden, so, alles klar, wir sind wieder am Start, Brings bestes Emote, schon mal halt"}, {"id": 124, "start": 999.28, "end": 1016.04, "text": "Kekwet im Chat, mit welcher Software, das ist alles, also, das ist alles mit W-LED, W-LED"}, {"id": 125, "start": 1016.04, "end": 1021.76, "text": "gibt es hier auf GitHub, das war jetzt ein ziemlich beliebtes Projekt, 3,7K, kriegste"}, {"id": 126, "start": 1021.76, "end": 1027.0, "text": "nicht umsonst, also, gibt es nicht, gibt es nicht so oft als Sterne, ist ziemlich easy,"}, {"id": 127, "start": 1027.0, "end": 1032.72, "text": "du brauchst einen Controller, LED-Strip und ein Netzteil, das wars, ein paar Kabel brauchst"}, {"id": 128, "start": 1032.72, "end": 1036.88, "text": "du noch, aber, Kabel hat ja jeder in irgendeiner Art und Weise daheim, man kann auch einfach"}, {"id": 129, "start": 1036.88, "end": 1041.72, "text": "was, was man nicht benutzt, aufschneiden und die Kabel rausnehmen oder so, ja, so sieht"}, {"id": 130, "start": 1041.72, "end": 1050.32, "text": "es aus, also, viel besser, ne, sind wir uns einig, Chat, jetzt gebt euch mal, gebt euch"}, {"id": 131, "start": 1050.32, "end": 1062.96, "text": "den Druck und macht den Scamtrain weg, ich glaube, wir brauchen noch einen Sub, Any Primors,"}, {"id": 132, "start": 1062.96, "end": 1074.68, "text": "Chuck690 hat es voll gemacht, Dankeschön, huge, Hyper Subscription, 16 Monate hier,"}, {"id": 133, "start": 1074.68, "end": 1080.92, "text": "Foggers, nice, so, irgendwas habe ich jetzt vergessen, ich wollte euch noch irgendwas"}, {"id": 134, "start": 1080.92, "end": 1090.56, "text": "erzählen, aber voll verdrängt, naja gut, ähm, übrigens, habt ihr schon dieses, ich"}, {"id": 135, "start": 1090.56, "end": 1096.04, "text": "weiß nicht, ob ich das, ich will mir das gar nicht angucken, ich zeig euch nur mal,"}, {"id": 136, "start": 1096.04, "end": 1102.88, "text": "ich zeig euch nur mal die Überschrift, dann cringet ihr schon wieder innerlich, Mediathek"}, {"id": 137, "start": 1102.88, "end": 1118.04, "text": "Frontal 21, schon mal gecringed heute, äh, Moment, wo ist das, wo ist das, Gamer, hier,"}, {"id": 138, "start": 1118.04, "end": 1132.92, "text": "das ist so dermaßen schlecht, und dann zeigen sie noch ein Video, und dann zeigen sie noch"}, {"id": 139, "start": 1132.92, "end": 1140.72, "text": "ein Video, von einem Verarschungs-Minecraft-Video, also sprich, das was die hier in dem Thumbnail"}, {"id": 140, "start": 1140.72, "end": 1149.28, "text": "haben, das ist ein Video von Youtube, wo einer das irgendwie verarscht, das ist so richtig"}, {"id": 141, "start": 1149.28, "end": 1159.96, "text": "dumm das einfach reinzunehmen, ja, dazu kommt, egal, es ist einfach Hardcore-Cringe wieder"}, {"id": 142, "start": 1159.96, "end": 1170.68, "text": "der Kram, ja, oh man, ich wills mir gar nicht geben jetzt, aber es ist wirklich schlimm,"}, {"id": 143, "start": 1170.68, "end": 1175.04, "text": "wenn ihr mal wirklich richtig Pains-Champen wollt, dann guckt euch da später an und schüttelt"}, {"id": 144, "start": 1175.04, "end": 1184.48, "text": "mal mit dem Kopf, es ist so unglaublich fail, und diesen ganzen Beitrag zeigen sie keinerlei"}, {"id": 145, "start": 1184.48, "end": 1191.04, "text": "Nazi-Games, die ja angeblich, was ja alles voll ist, also, doch, doch, doch, doch, sie"}, {"id": 146, "start": 1191.04, "end": 1198.0, "text": "zeigen eins, was aber halt offensichtlich das Propagandagame aller Zeiten ist, richtig"}, {"id": 147, "start": 1198.0, "end": 1204.6, "text": "dumm, so ein, ich weiß gar nicht was ich dazu sagen soll, so fail auch, so fail, was auch"}, {"id": 148, "start": 1204.6, "end": 1210.2, "text": "geil ist, ihr müsst euch mal, also falls, nur mal so als Tipp, für die Leute, die sich"}, {"id": 149, "start": 1210.2, "end": 1220.52, "text": "wirklich diesen Kram geben, und ihr müsst mal drauf achten, wie die das aussprechen,"}, {"id": 150, "start": 1220.52, "end": 1224.92, "text": "und zwar, also ich will das jetzt nicht im Stream gucken, das ist so ein dämlicher Beitrag,"}, {"id": 151, "start": 1224.92, "end": 1231.68, "text": "der hat Aufrufzahlen gar nicht verdient, ja, ihr müsst mal drauf hören, wenn es um, also"}, {"id": 152, "start": 1231.68, "end": 1236.92, "text": "ARD und ZTS sind halt halt ganz gut dabei, also sprich, wenn die Leute ansprechen wollen,"}, {"id": 153, "start": 1236.92, "end": 1242.12, "text": "die sagen nicht Gamer, die sagen Gamerinnen und sowas, oder, oder Playerinnen, Spielerinnen"}, {"id": 154, "start": 1242.12, "end": 1249.08, "text": "und so, aber was witzig ist, worauf ihr mal achten müsst, worauf ihr mal achten müsst,"}, {"id": 155, "start": 1249.08, "end": 1256.76, "text": "die negativen Sachen in diesem Video sind männlich, alle normalen und positiven Sachen,"}, {"id": 156, "start": 1256.76, "end": 1261.2, "text": "guckt euch mal an und beurteilt das selbst, ja, und alle normalen und positiven Sachen"}, {"id": 157, "start": 1261.2, "end": 1269.16, "text": "sind innen, es ist echter Wahnsinn, ich weiß gar nicht, was mit denen los ist, alter, also"}, {"id": 158, "start": 1269.16, "end": 1275.24, "text": "richtig hängen gebliebener Kram, ey, und wisst ihr, was mich da, was mich bei sowas"}, {"id": 159, "start": 1275.24, "end": 1282.16, "text": "immer ärgert, wenn das RTL macht und sowas, da finde ich es lustig und mich juckt es nicht,"}, {"id": 160, "start": 1282.16, "end": 1287.56, "text": "ganz ehrlich, wenn das RTL macht, es erinnert sich wahrscheinlich noch jeder an den Stinke-Gamer-Beitrag"}, {"id": 161, "start": 1287.56, "end": 1292.96, "text": "von RTL von vor ein paar Jahren, es ist ja nichts Neues hier, RTL Gamer gibt es bestimmt"}, {"id": 162, "start": 1292.96, "end": 1300.92, "text": "immer noch hier, der Tough Bericht von der Gelskrupp 2011, genau, ach guck mal, das taucht,"}, {"id": 163, "start": 1300.92, "end": 1306.88, "text": "ach nee, das ist irgendeine Reaction da drauf, okay, nee, ist was anderes, so zumindest,"}, {"id": 164, "start": 1306.88, "end": 1314.84, "text": "dieses RTL Gamer-Video, das hat mich, also ich hab mich da so ein bisschen drüber aufgeregt,"}, {"id": 165, "start": 1314.84, "end": 1320.4, "text": "gerade auch fürs Video damals, ja, aber das hat mich nicht aufgeregt, nicht großartig"}, {"id": 166, "start": 1320.4, "end": 1325.0, "text": "aufgeregt, da hab ich mir halt gedacht, alter RTL ist einfach doof, ja, und eigentlich könnte"}, {"id": 167, "start": 1325.0, "end": 1328.08, "text": "ich mir jetzt bei Frontal21 auch denken, ja gut, die sind halt einfach doof, was juckt"}, {"id": 168, "start": 1328.08, "end": 1335.4, "text": "es mich, aber was mich halt abfuckt ist, für den Scheiß bezahle ich quasi auch noch was,"}, {"id": 169, "start": 1335.4, "end": 1341.12, "text": "gezwungenermaßen, und bei RTL gucke ich halt einfach nicht, und man schadet RTL im Endeffekt"}, {"id": 170, "start": 1341.12, "end": 1346.44, "text": "ja schon am meisten, wenn man nicht guckt, im Prinzip kann aber ARD, ZDF, unöffentlich-rechtliche,"}, {"id": 171, "start": 1346.44, "end": 1349.92, "text": "größten Scheiß ever produzieren, du musst trotzdem für bezahlen, ob du es gewillst oder"}, {"id": 172, "start": 1349.92, "end": 1355.72, "text": "nicht, und das fuckt mich dabei ab, der Beitrag an sich gar nicht so sehr, aber diese Tatsache,"}, {"id": 173, "start": 1355.72, "end": 1363.48, "text": "die geht mir mega auf den Sack, richtig, richtig, ich muss mal kurz, ich muss mal kurz gucken,"}, {"id": 174, "start": 1363.48, "end": 1371.36, "text": "was sie für YouTube-Comments haben, hier, wie Rechte die Gaming-Kultur unterwandern,"}, {"id": 175, "start": 1371.36, "end": 1376.2, "text": "mein Gott, ich, nein, ich guck, ich hab das gestern geguckt, ich kann das heute nicht"}, {"id": 176, "start": 1376.2, "end": 1380.4, "text": "nochmal gucken, ich krieg absolute Anfälle, wenn ich das guck, also was haben sie was"}, {"id": 177, "start": 1380.4, "end": 1387.6, "text": "schreiben wollen, wir müssen uns mal das offizielle Reaktion-Kommentar angucken, Akenas99, ich"}, {"id": 178, "start": 1387.6, "end": 1396.36, "text": "hab absolut keine Ahnung, vor allem wird ja auch komplett unlogisch das verwendet, ja,"}, {"id": 179, "start": 1396.36, "end": 1400.56, "text": "manchmal ist es männlich, manchmal ist es weiblich, manchmal ist es innen, ich, ganz"}, {"id": 180, "start": 1400.56, "end": 1404.8, "text": "ehrlich, eigentlich gehts mir ziemlich am Arsch vorbei, wie gesagt, ist ja auch der"}, {"id": 181, "start": 1404.8, "end": 1408.6, "text": "Grund, warum ich Twitter auf Andorra stehen hab, ich hab ehrlich gesagt keine Bock auf"}, {"id": 182, "start": 1408.6, "end": 1412.84, "text": "diese vom Zaun gebrochenen Diskussionen, die es aktuell so gibt, über irgendwelche"}, {"id": 183, "start": 1412.84, "end": 1418.6, "text": "Gender-Sachen, über Rassismus-Themen, interessiert mich alles gar nicht, ist mir alles mittlerweile"}, {"id": 184, "start": 1418.6, "end": 1424.12, "text": "scheißegal, auch wenns nicht unwichtige Themen sind, aber ich kanns mir mittlerweile einfach"}, {"id": 185, "start": 1424.12, "end": 1430.2, "text": "nicht mehr geben, weil diese Sachen meistens auch nicht mit halbwegs kühlem Kopf geführt"}, {"id": 186, "start": 1430.2, "end": 1435.2, "text": "werden, sondern dass der eher um irgendwelche ideologischen Sachen geht, nach Bauchgefühl"}, {"id": 187, "start": 1435.2, "end": 1439.76, "text": "und sowas, ist einfach nicht meine Welt, die sollen alle machen, was sie wollen, ist"}, {"id": 188, "start": 1439.76, "end": 1445.04, "text": "die Sache, bin ich da seit Jahren dafür, sollen alle machen, was sie wollen, aber sollen"}, {"id": 189, "start": 1445.04, "end": 1454.84, "text": "andere Leute in Ruhe lassen, so, also, ähm, ach so, ich dachte, MWD steht für männlich-weiß-deutsch,"}, {"id": 190, "start": 1454.84, "end": 1461.16, "text": "ach, das steht für männlich-weiß-die, ja, verstehe, verstehe, Paints-Champ, guck, ich"}, {"id": 191, "start": 1461.16, "end": 1467.68, "text": "geb zu, war ein schlechter Witz, ja, gleich kommt Hashtag-Nazi-Keks, also was antworten"}, {"id": 192, "start": 1467.68, "end": 1472.96, "text": "sie denn hier drauf? Auf unseren Filmen gab es heftige Reaktionen, manche fanden das Thema"}, {"id": 193, "start": 1472.96, "end": 1477.12, "text": "gut, viele hatten Kritik mit dem Ton, andere fanden es schlecht, ja, ich fand schlecht,"}, {"id": 194, "start": 1477.12, "end": 1486.84, "text": "muss ich ehrlich sagen, ähm, weil, hab ich ja eben schon gesagt, so, teilweise verstehen"}, {"id": 195, "start": 1486.84, "end": 1493.24, "text": "wir auch in Ärgerung, kurz, wir wollen mit euch über das Thema, ach, ach, echt? Deswegen,"}, {"id": 196, "start": 1493.24, "end": 1496.6, "text": "wir wollen mit euch sprechen, deswegen haben sie auch Caesar-Interviewed in, oder was"}, {"id": 197, "start": 1496.6, "end": 1502.84, "text": "heißt Interviewed, also, gezeigt in dem Beitrag, und, äh, äh, was, äh, daraus gemacht, was"}, {"id": 198, "start": 1502.84, "end": 1506.12, "text": "sie eigentlich gar nicht sagen wollte, ja, ja, weil sie mit uns drüber reden wollte,"}, {"id": 199, "start": 1506.12, "end": 1514.32, "text": "alles klar. Also, unser Ziel war ein, bla, bla, bla, ach, übrigens, das ist auch, das"}, {"id": 200, "start": 1514.32, "end": 1519.24, "text": "ist auch zu geil, die, den Ausschnitt muss ich euch zeigen, den Ausschnitt muss ich euch"}, {"id": 201, "start": 1519.24, "end": 1530.44, "text": "zeigen, der ist so, der ist so fail, der GTA-Ausschnitt, der war relativ, hier, der GTA-Ausschnitt,"}, {"id": 202, "start": 1530.44, "end": 1549.16, "text": "das ist so geil, und, ähm, das ist so Pains-Champ, what the fuck, what the fuck, what the fuck,"}, {"id": 203, "start": 1549.16, "end": 1557.48, "text": "mach mal, haben die das in GTA nachgebaut, wo ist der Sender von, jetzt kommt's gleich,"}, {"id": 204, "start": 1557.48, "end": 1569.4, "text": "gleich, gleich, gleich wird sie, gleich wird sie richtig abgedreht, das ist so dumm, das"}, {"id": 205, "start": 1569.4, "end": 1575.64, "text": "ist so dumm, Alter, weil die, weil ja auch Gamer dafür bekannt sind, dass sie einfach"}, {"id": 206, "start": 1575.64, "end": 1581.56, "text": "rausgehen und am Hauptbahnhof irgendwelche Frauen headbutten, das ist so unglaublich"}, {"id": 207, "start": 1581.56, "end": 1587.48, "text": "fail, außerdem ist die Frau bewaffnet, vielleicht war es sogar ganz gut in dem Fall, dass sie"}, {"id": 208, "start": 1587.48, "end": 1592.68, "text": "gehadbuttet hat, vielleicht wollten sie ihn erschießen oder so, das ist so unglaublich"}, {"id": 209, "start": 1592.68, "end": 1601.48, "text": "dumm, was das ist, what the fuck, warum laufen hier Leute drauf und schlagen irgendwelche"}, {"id": 210, "start": 1601.48, "end": 1606.28, "text": "Frauen ins Gesicht, was ist das denn, ich meine, das ist GTA, was hat das in diesem"}, {"id": 211, "start": 1606.28, "end": 1612.44, "text": "Beitrag zu tun, es ist so unglaublich fail, ich weiß überhaupt nicht, was mit den Leuten"}, {"id": 212, "start": 1612.44, "end": 1628.28, "text": "los ist bei frontal 21, also, oh Gott, das ist so, das ist so kaputt, das ist so dumm,"}, {"id": 213, "start": 1628.28, "end": 1636.68, "text": "welche, ey, ohne Scheiß Leute, ich kenne wenige, wie soll man es nennen, so, so, so,"}, {"id": 214, "start": 1636.68, "end": 1644.68, "text": "man kann es nicht Community nennen, wenige Subkultur oder wie auch immer man das nennen"}, {"id": 215, "start": 1644.68, "end": 1651.56, "text": "mag, also, wo es eigentlich so egal ist, wer du bist, wie du ausschaust, woher du kommst"}, {"id": 216, "start": 1651.56, "end": 1658.04, "text": "als beim Onlinespielen, ohne Mist, beim Onlinespielen ist das scheißegal, okay, mal Russen in CS"}, {"id": 217, "start": 1658.04, "end": 1663.16, "text": "ausgenommen, ne, aber generell, es ist eigentlich fast egal, also, mal angenommen, du spielst"}, {"id": 218, "start": 1663.16, "end": 1668.36, "text": "irgendwie ein Competitive Game Online, es ist vollkommen wurscht, zumindest bei den"}, {"id": 219, "start": 1668.36, "end": 1678.52, "text": "allermeisten, ob du schwarz bist, weiß bist, lila gestreift bist, männlich, weiblich,"}, {"id": 220, "start": 1678.52, "end": 1687.96, "text": "divers, Attack Helikopter, Fahrrad, vollkommen egal, den meisten ist das Online total egal,"}, {"id": 221, "start": 1687.96, "end": 1699.32, "text": "gerade bei MMOs, wenn ich mir überlege, ich hab selten ein so, wie soll ich sagen, so"}, {"id": 222, "start": 1699.32, "end": 1704.2, "text": "gemischtes Zeug gesehen, wie als ich MMOs gespielt hab, da war wirklich alles möglich"}, {"id": 223, "start": 1704.2, "end": 1712.04, "text": "an Leuten dabei, ja, von viel Geld bis wenig Geld, von egal, welche, wie soll ich sagen,"}, {"id": 224, "start": 1712.04, "end": 1718.6, "text": "aus irgendwelchen sozialen Brennpunkten, aus junge Leute, alte Leute, deutsche, Ausländer,"}, {"id": 225, "start": 1718.6, "end": 1723.04, "text": "alles mögliche am Start, und die haben online zusammen geradet, und wen hat's interessiert?"}, {"id": 226, "start": 1723.04, "end": 1724.04, "text": "Keine Sau!"}, {"id": 227, "start": 1724.04, "end": 1733.4, "text": "Ja gut, wir reden jetzt nicht von Twitch-Streamern, dass es da wieder ganz andere Probleme gibt,"}, {"id": 228, "start": 1733.4, "end": 1739.0, "text": "sei mal dahingestellt, aber das hat ja mit Gaming an sich nichts zu tun, und dass gerade"}, {"id": 229, "start": 1739.0, "end": 1747.76, "text": "Multiplayer-Competitive-FPS generell toxik sind, as fuck, ist ja mal was ganz anderes,"}, {"id": 230, "start": 1747.76, "end": 1754.04, "text": "und man darf ja auch nicht vergessen, es ist jetzt kein exklusives Ding für Frauen, generell"}, {"id": 231, "start": 1754.04, "end": 1761.4, "text": "ist Online-Multiplayer-Shooter-Competitive-Sachen teilweise extrem toxik, guck dir Overwatch"}, {"id": 232, "start": 1761.4, "end": 1766.84, "text": "ranked an, oder guck dir CS ranked an und sonst was, da kriegst du in-game-Voice-Chat,"}, {"id": 233, "start": 1766.84, "end": 1771.32, "text": "da wird instant, wenn du ihn killst, dein Vater, deine Mutter, was weiß ich, alles beleidigt,"}, {"id": 234, "start": 1771.32, "end": 1775.12, "text": "vollkommen egal, ob du männlich oder weiblich bist, ich will jetzt aber mal nicht bestreiten,"}, {"id": 235, "start": 1775.12, "end": 1781.12, "text": "also ich kann mir tatsächlich vorstellen, dass in dem Fall sich Mädels noch dümmeres"}, {"id": 236, "start": 1781.12, "end": 1786.08, "text": "Zeug und noch mehr Zeug anhören müssen, das kann ich mir gut vorstellen, kann ich"}, {"id": 237, "start": 1786.08, "end": 1791.8, "text": "beurteilen, als Kerl ist das in dem Fall schwierig, kann ich mir vorstellen, wundert mich irgendwie"}, {"id": 238, "start": 1791.8, "end": 1795.96, "text": "auch nicht, es gibt schon unglaublich viel fertige Leute, und vielleicht fällt es auch"}, {"id": 239, "start": 1795.96, "end": 1799.76, "text": "viel, macht es auch mehr Leute Spaß irgendwelche Mädels zu beleidigen, keine Ahnung, aber"}, {"id": 240, "start": 1799.76, "end": 1804.68, "text": "insgesamt, gerade im Competitive-Matchmaking-Bereich, ich rede jetzt nicht davon, wenn man im festen"}, {"id": 241, "start": 1804.68, "end": 1811.16, "text": "Team spielt, ist toxik gedöns halt an der Tagesordnung, guckt euch LoL an, guckt euch"}, {"id": 242, "start": 1811.16, "end": 1817.56, "text": "Overwatch an, guckt euch CS ranked an oder solche, das ist alles toxik as fuck, und erst"}, {"id": 243, "start": 1817.56, "end": 1824.0, "text": "mal, erst mal unabhängig davon, ob du männlich oder weiblich bist, die Beleidigungen mögen"}, {"id": 244, "start": 1824.0, "end": 1834.72, "text": "halt unterschiedlich sein, ja, natürlich, es gibt überall toxik Spasten, es gibt überall"}, {"id": 245, "start": 1834.72, "end": 1839.6, "text": "toxik Spasten, ja, aber gerade in diesem Bereich gibt es halt besonders viel, und das"}, {"id": 246, "start": 1839.6, "end": 1843.68, "text": "ist halt der Grund, übrigens, mal ganz im ehrlich, mal ganz im ernst, wenn du jetzt"}, {"id": 247, "start": 1843.68, "end": 1848.28, "text": "hier sagst, wenn deine Ex-Freundin aufhören müsste, ihre Lieblingsspiel zu spielen, einer"}, {"id": 248, "start": 1848.28, "end": 1852.48, "text": "der Gründe, warum ich keinen Overwatch mehr spielen will, ich bin jetzt mal nicht deine"}, {"id": 249, "start": 1852.48, "end": 1857.88, "text": "Frau, also hoffe ich zumindest, einer der Gründe, warum ich nicht mehr Overwatch spielen"}, {"id": 250, "start": 1857.88, "end": 1864.08, "text": "wollte, war, weil Overwatch ranked voice chat absolut dämlich war, absolut kacke, ich hatte"}, {"id": 251, "start": 1864.08, "end": 1869.28, "text": "keinen Bock mehr, ich hatte fast schon Schiss davor, Overwatch ranked online zu spielen,"}, {"id": 252, "start": 1869.28, "end": 1873.6, "text": "das trifft nicht nur Frauen, das trifft alle, die keinen Bock haben, sich permanent mit"}, {"id": 253, "start": 1873.6, "end": 1877.96, "text": "Leuten im Internet, um irgendwelche Gaming-Sachen zu streiten, einer der Hauptgründe, warum"}, {"id": 254, "start": 1877.96, "end": 1884.92, "text": "ich keinen Overwatch ranked mehr spielen wollte, war der fucking toxic voice chat, man kann"}, {"id": 255, "start": 1884.92, "end": 1893.24, "text": "das nach einer Weile ignorieren, aber es nervt einfach unglaublich, deswegen hatte ich da"}, {"id": 256, "start": 1893.24, "end": 1901.68, "text": "keinen Bock mehr drauf, ach ja, und man darf nicht vergessen, du musstest dir auch oft"}, {"id": 257, "start": 1901.68, "end": 1907.24, "text": "genug Zeug anhören, ja, da, wo, was, was, ich, du warst auch mal ganz schnell Nazi und"}, {"id": 258, "start": 1907.24, "end": 1911.2, "text": "sowas in einem Online-Chat, weil es das erste, weil es denen die erst beste Beleidigung für"}, {"id": 259, "start": 1911.2, "end": 1916.08, "text": "Deutsche ist, die ihnen nicht einfällt, ja, aber deswegen kann man doch nicht sagen, so"}, {"id": 260, "start": 1916.08, "end": 1922.08, "text": "nach dem Motto, dass das unterwandert wird oder so, das ist halt competitive online games,"}, {"id": 261, "start": 1922.08, "end": 1926.56, "text": "gerade im Matchmaking sind einfach toxic as fuck, das ist durch die Bankwreck, es ist"}, {"id": 262, "start": 1926.56, "end": 1935.72, "text": "egal, ob es CS, LoL ist, Dota ist, sonst was, die einzigen Sachen, wo das ein bisschen,"}, {"id": 263, "start": 1935.72, "end": 1941.68, "text": "ich will nicht sagen gesittet dazugeht, aber wo das ein bisschen, nicht so offensichtlich"}, {"id": 264, "start": 1941.68, "end": 1945.24, "text": "ist in one on one games, sowas wie Starcraft und sonst was, da wird natürlich auch geflamed,"}, {"id": 265, "start": 1945.24, "end": 1954.08, "text": "wie Sau, aber da gibt es keinen in-game voice chat im Team, ja, sobald es ein PvP Spiel"}, {"id": 266, "start": 1954.08, "end": 1960.88, "text": "ist, mit ranked, gegeneinander, Team versus Team gegeneinander, dann ist es, ich habe"}, {"id": 267, "start": 1960.88, "end": 1965.68, "text": "noch kein Online-Spiel gesehen, wo das nicht so ist, wird untereinander das Team geflamed,"}, {"id": 268, "start": 1965.68, "end": 1971.16, "text": "weil jeder von sich denkt, das Team ist versaut, obwohl er ist zumindest zum Teil mitversaut,"}, {"id": 269, "start": 1971.16, "end": 1977.76, "text": "und das ist halt in vielen Sachen so, das hat aber absolut gar nichts damit zu tun und"}, {"id": 270, "start": 1977.76, "end": 1987.84, "text": "vor allem, was jetzt diese Szene, wo in GTA irgendwelche Leute random Frauen zusammenschlagen,"}, {"id": 271, "start": 1987.84, "end": 1992.56, "text": "einfach mal so, man darf nicht vergessen, es ist GTA, es ist quasi auch unabhängig"}, {"id": 272, "start": 1992.56, "end": 1997.36, "text": "davon, dass das wahrscheinlich so in einem Spiel tatsächlich passieren kann, weil das"}, {"id": 273, "start": 1997.36, "end": 2002.08, "text": "ja irgendwie so eine kriminelle Welt ist von GTA, wo es eben darum geht, auch Straftaten"}, {"id": 274, "start": 2002.08, "end": 2007.32, "text": "zu begehen, hat das alles nichts mit der Überschrift zu tun, und das ist ja der eigentliche Witz"}, {"id": 275, "start": 2007.32, "end": 2013.6, "text": "dabei, was das jetzt damit zu tun haben soll, das kann uns wahrscheinlich nicht mal frontal"}, {"id": 276, "start": 2013.6, "end": 2020.4, "text": "21 erklären, aber der Beitrag ist so unglaublich fail, und ja, wie gesagt, das ist auch der"}, {"id": 277, "start": 2020.4, "end": 2025.72, "text": "Grund, warum ich auf diese ganze Diskussion keinen Bock habe, und ich mein Twitter auf"}, {"id": 278, "start": 2025.72, "end": 2029.84, "text": "Andorra gestellt habe, weil es mir nur noch auf den Sack geht, obwohl das eigentlich nicht"}, {"id": 279, "start": 2029.84, "end": 2036.44, "text": "unwichtige Themen sind, aber mittlerweile nimmt das so unglaubliche Ausmaße an, und"}, {"id": 280, "start": 2036.44, "end": 2041.88, "text": "man kann auch bei den meisten Themen nicht normal mehr darüber sprechen, ohne dass nach"}, {"id": 281, "start": 2041.88, "end": 2049.44, "text": "zwei Minuten einer um die Ecke kommt und sagt, was weiß ich, Nazi Hammer geht ja immer,"}, {"id": 282, "start": 2049.44, "end": 2052.48, "text": "also nach dem Motto, wie, der ist nicht dafür, dann muss er ein Nazi sein, wie, der ist nicht"}, {"id": 283, "start": 2052.48, "end": 2055.84, "text": "dafür, der will bestimmt AfD, muss ein Nazi sein, aber der ist auch nicht dafür, ja dann"}, {"id": 284, "start": 2055.84, "end": 2062.8, "text": "ist er ein links-grün-versifter-gut-mensch, alter, es ist nicht mehr möglich, oftmals"}, {"id": 285, "start": 2062.8, "end": 2067.48, "text": "normale Diskussionen zu führen, ohne dass nach zwei Minuten irgendwie einer in irgendeine"}, {"id": 286, "start": 2067.48, "end": 2073.04, "text": "Ecke gestellt wird, weil er angeblich, dass das ist, richtig dumm, richtig hängen geblieben."}, {"id": 287, "start": 2073.04, "end": 2081.44, "text": "Vor allem, wie die jetzt da von diesem Frontal-21-Beitrag irgendwie auf Gamergate kommen, erschließt"}, {"id": 288, "start": 2081.44, "end": 2090.4, "text": "sich mir auch überhaupt gar nicht, die Meinungen werden immer radikaler, ich glaube, das liegt"}, {"id": 289, "start": 2090.4, "end": 2095.16, "text": "auch daran, ja, werden sie, aber ich glaube, das liegt auch daran, dass viele Leute das"}, {"id": 290, "start": 2095.16, "end": 2103.88, "text": "mittlerweile so machen wie ich und sich einfach nicht mehr daran beteiligen, also sprich,"}, {"id": 291, "start": 2103.88, "end": 2109.72, "text": "die normalen im Hirn, ja, die haben keinen Bock mehr, die sagen, leck mich, die sagen"}, {"id": 292, "start": 2109.72, "end": 2120.0, "text": "quasi, oder sie sagen, und setzen sich damit überhaupt nicht mehr auseinander, ich glaube,"}, {"id": 293, "start": 2120.0, "end": 2125.84, "text": "das ist eigentlich das Meiste, es gibt bestimmt noch sehr viele Leute, die da normal ticken"}, {"id": 294, "start": 2125.84, "end": 2134.16, "text": "im Hirn, ja, aber die beteiligen sich da nicht mehr dran, ja, und dass das immer radikaler"}, {"id": 295, "start": 2134.16, "end": 2136.2, "text": "wird, prinzipiell gebe ich dir aber recht, ja."}, {"id": 296, "start": 2136.2, "end": 2145.48, "text": "Es gab letztens eine Umfrage, ähm, sehe ich gerade, wo das gewesen ist, habe ich auch"}, {"id": 297, "start": 2145.48, "end": 2157.24, "text": "in irgendeinem Twitter-Feed-News-Artikel gelesen, ähm, was war denn das, weiß ich nicht mehr,"}, {"id": 298, "start": 2157.24, "end": 2162.0, "text": "zumindest war es eine Umfrage, wo Leute befragt wurden, ob sie sich zu heiklen Themen noch"}, {"id": 299, "start": 2162.0, "end": 2175.36, "text": "äußern und da haben, ich glaube, 52% gesagt, dass es bestimmte Themen gibt, wozu sie sich"}, {"id": 300, "start": 2175.36, "end": 2180.84, "text": "öffentlich nicht mehr äußern, weil sie Angst haben, sich dazu zu äußern, äh, ich"}, {"id": 301, "start": 2180.84, "end": 2184.68, "text": "glaube, um die 20% haben gesagt, sie sind bei allem vorsichtig, und der Rest hat gesagt,"}, {"id": 302, "start": 2184.68, "end": 2195.32, "text": "kein Problem, also, ist schon bedenklich, ja, ja, normal, ich, wisst ihr, was ich gut"}, {"id": 303, "start": 2195.32, "end": 2200.84, "text": "finde, weil, weil, ja, das, was ich, was ich, was ich wirklich gut finde in der heutigen"}, {"id": 304, "start": 2200.84, "end": 2209.48, "text": "Zeit, dass du dich viel freier, wie soll ich sagen, freier entfalten kannst, ne, also,"}, {"id": 305, "start": 2209.48, "end": 2215.96, "text": "guck mal, guck mal mich an, ich bin jetzt 36, ich sitze sonntags morgens vorm Computer,"}, {"id": 306, "start": 2215.96, "end": 2227.32, "text": "Sache keckmas, keck weh, people love, people happy, äh, mach dofe Sachen wie das hier,"}, {"id": 307, "start": 2227.32, "end": 2235.56, "text": "ganz ehrlich, 1984, als ich geboren bin, hätte das da jemand gemacht, ja, die hätten"}, {"id": 308, "start": 2235.56, "end": 2241.64, "text": "gedacht, der ist total verrückt, also, was ähnliches in der Richtung, die Leute hätten"}, {"id": 309, "start": 2241.64, "end": 2250.12, "text": "gesagt, ey, Max, mit 36, auf gehts, bam, bam, bam, Kinderzeugen hier, Nachwuchs muss jetzt"}, {"id": 310, "start": 2250.12, "end": 2257.08, "text": "endlich mal, bald gehts nicht mehr, beeil dich mal, kann doch nicht sein, 36, äh, keine,"}, {"id": 311, "start": 2257.08, "end": 2262.32, "text": "keine Frau, keine Kinder, keine Familie, sonst wie hier, und komisches Internetzeugstar,"}, {"id": 312, "start": 2262.32, "end": 2269.0, "text": "kann ja nicht sein, ähm, also, in der heutigen Zeit ist das nicht mehr, das interessiert"}, {"id": 313, "start": 2269.0, "end": 2273.76, "text": "eigentlich gar keinen, das finde ich ziemlich gut, also, du kannst dich heute schon deutlich"}, {"id": 314, "start": 2273.76, "end": 2280.72, "text": "freier von irgendwelchen gesellschaftlichen Dingern da bewegen, Gaming ist auch viel mehr"}, {"id": 315, "start": 2280.72, "end": 2285.44, "text": "Mainstream, als es das noch vor ein paar Jahren war, wahrscheinlich gibt es diese ganzen Diskussionen"}, {"id": 316, "start": 2285.44, "end": 2292.36, "text": "deswegen jetzt auch, ja, also, das, das finde ich wunderbar, ja, du kannst heute mehr oder"}, {"id": 317, "start": 2292.36, "end": 2296.68, "text": "weniger machen, was du willst, wo ich dann halt immer ein Problem mit hab, ist, wenn"}, {"id": 318, "start": 2296.68, "end": 2303.12, "text": "die Leute versuchen, andere zu bekehren, ich sag ja immer dabei, hey, wie ich das sehe,"}, {"id": 319, "start": 2303.12, "end": 2305.64, "text": "vielleicht überzeug ich den ein oder anderen, weil er sagt, hey, da hab ich ja noch gar"}, {"id": 320, "start": 2305.64, "end": 2309.28, "text": "nicht drüber nachgedacht, aber ich versuch das keinem aufzuzwingen, ich versuch doch"}, {"id": 321, "start": 2309.28, "end": 2314.44, "text": "keinem zu erzählen, es ist eine gute Sache, als 36-jähriger, sonntags morgens vom Rechner"}, {"id": 322, "start": 2314.44, "end": 2326.12, "text": "zu sitzen und zu sagen, keck wait, kann jeder machen, was er will, aber ich kanns machen"}, {"id": 323, "start": 2326.12, "end": 2332.24, "text": "heute, ohne dass ich mir permanent irgendwelches blöde Zeug anhören muss, was früher definitiv"}, {"id": 324, "start": 2332.24, "end": 2343.84, "text": "nicht so gewesen wäre, das finde ich echt gut, wenn ich mich jetzt hinstellen würde,"}, {"id": 325, "start": 2343.84, "end": 2346.68, "text": "nur so, dass man sieht, wie sich da, wie sich da die Zeiten gerne haben, wenn ich mich"}, {"id": 326, "start": 2346.68, "end": 2351.56, "text": "jetzt hinstellen würde und sag, Leute, ich bin schwul, es wird kein Jucken, es würde"}, {"id": 327, "start": 2351.56, "end": 2356.56, "text": "keinen Jucken, da sieht man doch mal, dass, wie sich das, in welche, zumindest aus meiner"}, {"id": 328, "start": 2356.56, "end": 2363.76, "text": "Sicht positive Sachen sich das die letzten Jahre überentwickelt hat, wird kein Jucken,"}, {"id": 329, "start": 2363.76, "end": 2370.16, "text": "würde man sagen, ja, okay, Max, was juckt's mich, Max, du kannst quasi dein Ding reinstecken,"}, {"id": 330, "start": 2370.16, "end": 2376.0, "text": "das ist mir doch egal, würden alle sagen, wen juckt's, so muss es auch sein, die Leute"}, {"id": 331, "start": 2376.0, "end": 2379.92, "text": "sollen machen, was sie wollen, wo ich halt immer ein Problem mit hab, wenn sie Leute"}, {"id": 332, "start": 2379.92, "end": 2385.6, "text": "überzeugen wollen, dass ihre Sache die überlegene und bessere Sache ist, das geht mir immer"}, {"id": 333, "start": 2385.6, "end": 2394.12, "text": "auf den Keks, und das ist halt an vielen Stellen so, das f**kt mich ab, deswegen gehen mir"}, {"id": 334, "start": 2394.12, "end": 2398.36, "text": "so Berichte wie bei Frontalein und 21 auch auf den Keks, weil erstens bezahle ich die"}, {"id": 335, "start": 2398.36, "end": 2405.68, "text": "mit, ich weiß, ich bezahle die für was, was ich absolut nicht teile, generell geht mir"}, {"id": 336, "start": 2405.68, "end": 2425.12, "text": "öffentlich rechtlich als Zwangsabgaben Zeug auf den Keks, naja, naja, es ist echt so,"}, {"id": 337, "start": 2425.12, "end": 2434.2, "text": "was das, diese Bekehrungssache von vielen Leuten geht mir voll auf den Sack, was von"}, {"id": 338, "start": 2434.2, "end": 2460.88, "text": "denen hat letztens doch einer Netflix getrashed, was, ich hab keine Ahnung, was geht, der ist"}, {"id": 339, "start": 2460.88, "end": 2483.04, "text": "so, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung,"}, {"id": 340, "start": 2483.04, "end": 2505.8, "text": "was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine"}, {"id": 341, "start": 2505.8, "end": 2523.06, "text": "Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich"}, {"id": 342, "start": 2523.06, "end": 2534.46, "text": "hab keine Ahnung, was geht, ich hab keine Ahnung, was geht, ich hab keine Ahnung, was"}, {"id": 343, "start": 2534.46, "end": 2539.18, "text": "Sollte man sagen, wie ist es, und nicht, was sollen die Leute davon halten?"}, {"id": 344, "start": 2539.86, "end": 2542.9, "text": "Magst du Monitor? Ich glaube, ich habe ewig nichts mehr gesehen."}, {"id": 345, "start": 2546.22, "end": 2550.02, "text": "Das ist halt was, was mir bei ARD und ZDF gerade bei Nachrichtensendungen auf den Kiks geht,"}, {"id": 346, "start": 2550.02, "end": 2551.46, "text": "oder auch teilweise bei Talkshows."}, {"id": 347, "start": 2551.82, "end": 2557.62, "text": "Dass man nicht sagt, okay, das sind unterschiedliche Ansichten vielleicht, die es da gerade gibt."}, {"id": 348, "start": 2557.62, "end": 2564.38, "text": "Nein, man versucht den Leuten gleich noch dazu zu erzählen, welche davon die korrekte ist."}, {"id": 349, "start": 2564.38, "end": 2574.62, "text": "Und das ist meiner Meinung nach nicht die Aufgabe eines öffentlich-rechtlichen Nachrichtensendungen."}, {"id": 350, "start": 2575.86, "end": 2578.62, "text": "Aber die SWR-Handwerks-Dokus, die sind wirklich cool."}, {"id": 351, "start": 2578.62, "end": 2582.62, "text": "Das sind Sachen, dafür kann ich auch, dafür bezahle ich dann auch Gebühren, das ist okay."}, {"id": 352, "start": 2582.62, "end": 2587.62, "text": "Es gibt ja auch, es gibt ja auch durchaus gute Sendung."}, {"id": 353, "start": 2593.62, "end": 2596.62, "text": "Ich wollte mal kurz Chat durchscrollen, ob ich irgendwas übersehen habe."}, {"id": 354, "start": 2596.62, "end": 2625.62, "text": "SWR-Handwerks-Dokus, ja."}, {"id": 355, "start": 2625.62, "end": 2628.62, "text": "Das ist eine typische Internet-Diskussion, ja."}, {"id": 356, "start": 2628.62, "end": 2631.62, "text": "Das ist eine typische Internet-Diskussion."}, {"id": 357, "start": 2634.62, "end": 2637.62, "text": "Da wird total übertrieben, ja."}, {"id": 358, "start": 2645.62, "end": 2647.62, "text": "Ja, so sieht es aus."}, {"id": 359, "start": 2647.62, "end": 2650.62, "text": "Ja, das frage ich mich eh oft."}, {"id": 360, "start": 2650.62, "end": 2656.62, "text": "Das frage ich mich wirklich oft, wenn ich Beiträge sehe, wo es irgendwie um Technik-Computer-Kram geht"}, {"id": 361, "start": 2656.62, "end": 2658.62, "text": "und quasi jeder zweite Satz ist falsch."}, {"id": 362, "start": 2658.62, "end": 2663.62, "text": "Dann denke ich mir immer, wie sieht das aus bei Beiträgen, wo ich mich nicht auskenne?"}, {"id": 363, "start": 2663.62, "end": 2677.62, "text": "Sind die auch alle so kacke?"}, {"id": 364, "start": 2677.62, "end": 2681.62, "text": "Kurze Frage, mit welcher Software hast du die Thermostat- und Fensterkontakte verknüpft?"}, {"id": 365, "start": 2681.62, "end": 2683.62, "text": "Hiermit."}, {"id": 366, "start": 2683.62, "end": 2685.62, "text": "Beste."}, {"id": 367, "start": 2690.62, "end": 2692.62, "text": "Musste aber viel selbst machen."}, {"id": 368, "start": 2693.62, "end": 2695.62, "text": "Musste aber viel selbst machen."}, {"id": 369, "start": 2695.62, "end": 2698.62, "text": "Mittlerweile haben die ziemlich viel im GUI drinnen."}, {"id": 370, "start": 2698.62, "end": 2701.62, "text": "Alter, ich hab irgendwas im Hals."}, {"id": 371, "start": 2701.62, "end": 2718.62, "text": "Also, mittlerweile kannst du, ne, ne, das ist nicht alles Jaml."}, {"id": 372, "start": 2718.62, "end": 2720.62, "text": "Mittlerweile kannst du sehr viel übers GUI machen."}, {"id": 373, "start": 2720.62, "end": 2723.62, "text": "Zum Beispiel die WLAN-Integration für die LED-Leistung."}, {"id": 374, "start": 2723.62, "end": 2726.62, "text": "Du kannst alles komplett übers GUI machen mittlerweile."}, {"id": 375, "start": 2726.62, "end": 2731.62, "text": "Zum Beispiel die WLAN-Integration für die LED-Leistung, du kannst ja alles komplett über das GUI machen mittlerweile."}, {"id": 376, "start": 2732.62, "end": 2735.62, "text": "Klickst du im GUI an, hinzubefügen WLAN, gibts API ein und es funktioniert."}, {"id": 377, "start": 2736.62, "end": 2743.62, "text": "Du kannst ziemlich viele Standard-Integrations mittlerweile über GUI machen, aber du brauchst auch noch für einige Sachen YAML-Files."}, {"id": 378, "start": 2744.62, "end": 2752.62, "text": "Allerdings ist das nicht so schlimm, weil du bekommst beispielsweise eine Visual Studio Code-Extension direkt im Browser zum editieren."}, {"id": 379, "start": 2752.62, "end": 2757.62, "text": "Kann man installieren, damit ist das dann auch brauchbar."}, {"id": 380, "start": 2758.62, "end": 2765.62, "text": "Die Frage kommt häufig, ne, da machen wir kein Kommando für, weil da kann ich immer ein bisschen was zu sagen, dann habe ich was zu tun."}, {"id": 381, "start": 2766.62, "end": 2767.62, "text": "Ne, das ist aber wirklich gut."}, {"id": 382, "start": 2768.62, "end": 2775.62, "text": "Es gibt noch ein paar Alternativen, sollte ich nicht vergessen zu erwähnen, es gibt noch so einen wie IOP-Broker oder es gibt Open Hub und solche Sachen."}, {"id": 383, "start": 2775.62, "end": 2781.62, "text": "Also Home Assistant ist bei weitem nicht das einzige Heimautomatisierungssystem, aber Open Hub fällt bei mir schon mal komplett raus."}, {"id": 384, "start": 2782.62, "end": 2786.62, "text": "Das ist Java und das geht ja schon mal nicht."}, {"id": 385, "start": 2787.62, "end": 2793.62, "text": "So, IOP-Broker war glaube ich Node.js, habe ich aber noch nie was groß mit gemacht."}, {"id": 386, "start": 2793.62, "end": 2802.62, "text": "Na ja, so, also, komm wir gucken uns jetzt mal ne Runde Battlefield am Anfang an."}, {"id": 387, "start": 2803.62, "end": 2806.62, "text": "Oder wir gucken uns ne Runde MW2 gesnipen an."}, {"id": 388, "start": 2811.62, "end": 2815.62, "text": "Komm wir gucken uns ne Runde MW2 gesnipen an, easy, easy."}, {"id": 389, "start": 2818.62, "end": 2819.62, "text": "Moment."}, {"id": 390, "start": 2819.62, "end": 2822.62, "text": "Moment."}, {"id": 391, "start": 2823.62, "end": 2824.62, "text": "Excellent."}, {"id": 392, "start": 2824.62, "end": 2838.62, "text": "Excellent."}, {"id": 393, "start": 2838.62, "end": 2839.62, "text": "Doch gar keine Intervention."}, {"id": 394, "start": 2840.62, "end": 2842.62, "text": "Oh, was ein Lack, habt ihrs gesehen?"}, {"id": 395, "start": 2843.62, "end": 2844.62, "text": "Hyper Lack."}, {"id": 396, "start": 2847.62, "end": 2850.62, "text": "Das hat ja ne halbe Sekunde genauer, bis er hinterher gestartet hat."}, {"id": 397, "start": 2851.62, "end": 2852.62, "text": "Guckt euch das mal an, was das für ein Lack."}, {"id": 398, "start": 2853.62, "end": 2854.62, "text": "Das ist echt nicht gut."}, {"id": 399, "start": 2855.62, "end": 2856.62, "text": "Das ist echt nicht gut."}, {"id": 400, "start": 2857.62, "end": 2858.62, "text": "Das ist echt nicht gut."}, {"id": 401, "start": 2859.62, "end": 2860.62, "text": "Das ist echt nicht gut."}, {"id": 402, "start": 2861.62, "end": 2862.62, "text": "Das ist echt nicht gut."}, {"id": 403, "start": 2863.62, "end": 2864.62, "text": "Das ist echt nicht gut."}, {"id": 404, "start": 2864.62, "end": 2867.62, "text": "Guckt euch das mal an, was das für ein Lack."}, {"id": 405, "start": 2874.62, "end": 2875.62, "text": "ACOG, excellent."}, {"id": 406, "start": 2881.62, "end": 2883.62, "text": "Die ACOG da, richtig gute Gegner."}, {"id": 407, "start": 2883.62, "end": 2890.62, "text": "Das war ein Hit."}, {"id": 408, "start": 2896.62, "end": 2899.62, "text": "Was ist das für ne Hit Registration, Alter."}, {"id": 409, "start": 2903.62, "end": 2904.62, "text": "Vorhin."}, {"id": 410, "start": 2904.62, "end": 2906.62, "text": "Vorhin."}, {"id": 411, "start": 2911.62, "end": 2912.62, "text": "Was sind denn das für Bots?"}, {"id": 412, "start": 2913.62, "end": 2915.62, "text": "Na überleg mal, wer spielt denn heut noch MW2?"}, {"id": 413, "start": 2916.62, "end": 2920.62, "text": "Das sind wahrscheinlich irgendwelche Leute, die die Xbox von ihrem Opa geerbt haben oder so."}, {"id": 414, "start": 2920.62, "end": 2935.62, "text": "Was gibt es übrigens wieder, ein neues alter EW-Net habe ich gesehen für Black Ops 2 und MW3."}, {"id": 415, "start": 2936.62, "end": 2941.62, "text": "Hab ich noch nicht ausprobiert, hab ich letztens irgendwo gelesen, dass es wieder irgendwelche modded Lobby Geschichten gibt."}, {"id": 416, "start": 2942.62, "end": 2947.62, "text": "Also nicht modded Lobby, stimmt ja nicht, modded Game auf dem PC mit extra Lobbys und so."}, {"id": 417, "start": 2947.62, "end": 2949.62, "text": "Alles Plutonium, oder?"}, {"id": 418, "start": 2950.62, "end": 2951.62, "text": "Doch, doch, doch."}, {"id": 419, "start": 2952.62, "end": 2953.62, "text": "Das kann Plutonium."}, {"id": 420, "start": 2954.62, "end": 2955.62, "text": "Dashboard."}, {"id": 421, "start": 2958.62, "end": 2963.62, "text": "Es war nicht alles gut in MW2, sowas war z.B. kacke."}, {"id": 422, "start": 2964.62, "end": 2968.62, "text": "Was übrigens auch daran lag, dass sie sich damals ordentlich ins Server sparen wollten, weil sie sich gedacht haben,"}, {"id": 423, "start": 2969.62, "end": 2971.62, "text": "kann auch jeder was sich daheim hosten."}, {"id": 424, "start": 2971.62, "end": 2978.62, "text": "Gerade in 2013 oder so, gerade in Deutschland 2013 jemand daheim hosten ey."}, {"id": 425, "start": 2985.62, "end": 2986.62, "text": "Eiss."}, {"id": 426, "start": 2986.62, "end": 3000.62, "text": "Bam, in Ess gesniped."}, {"id": 427, "start": 3000.62, "end": 3015.62, "text": "Bam, jawoll."}, {"id": 428, "start": 3015.62, "end": 3036.62, "text": "Road to Commander hat man sowas früher genannt, wenn man von Level 0 alle Games gezeigt hat zu Level 60, 70 oder was das höchste da war."}, {"id": 429, "start": 3037.62, "end": 3040.62, "text": "Ja, genau, WZG gab es damals auch noch."}, {"id": 430, "start": 3040.62, "end": 3044.62, "text": "Was im Prinzip aber auch Road to Commander war."}, {"id": 431, "start": 3045.62, "end": 3052.62, "text": "Was aber einen irgendwie kontroversen Namen hatte, wo ich auch nicht so genau weiß, was sich daran alle gestört haben."}, {"id": 432, "start": 3053.62, "end": 3054.62, "text": "Ja."}, {"id": 433, "start": 3054.62, "end": 3071.62, "text": "Mr. Sultanos sagt, jetzt hat er Bock auf MW2, glaubt mir, sobald du anfängst zu spielen lässt, ist er Bock nach,"}, {"id": 434, "start": 3072.62, "end": 3075.62, "text": "weil bei dem Spiel ist eigentlich auch viel Shit dabei."}, {"id": 435, "start": 3076.62, "end": 3078.62, "text": "Der zeigt ja wie immer nur die Games, wo es gut gelaufen ist."}, {"id": 436, "start": 3078.62, "end": 3083.62, "text": "Daniel Lull, 17 Monate, Dankeschön für den Sub."}, {"id": 437, "start": 3084.62, "end": 3086.62, "text": "17 Monate ist ja schon."}, {"id": 438, "start": 3089.62, "end": 3090.62, "text": "Ah, vorbei."}, {"id": 439, "start": 3091.62, "end": 3092.62, "text": "Bam."}, {"id": 440, "start": 3094.62, "end": 3099.62, "text": "Nein, ich hab Black Ops 2021, nein 2020."}, {"id": 441, "start": 3100.62, "end": 3102.62, "text": "Darum hab ich geholt, aber ich hab's noch nicht installiert."}, {"id": 442, "start": 3103.62, "end": 3104.62, "text": "Richtig dumm."}, {"id": 443, "start": 3104.62, "end": 3107.62, "text": "Ich wollte unbedingt die Kampagne spielen."}, {"id": 444, "start": 3108.62, "end": 3112.62, "text": "Soweit sind wir schon, dass ich in Call of Duty eine Kampagne hole."}, {"id": 445, "start": 3113.62, "end": 3115.62, "text": "Oh, Rust, Quickscope, Duell."}, {"id": 446, "start": 3116.62, "end": 3117.62, "text": "Last Nice."}, {"id": 447, "start": 3123.62, "end": 3124.62, "text": "Tango Sucker."}, {"id": 448, "start": 3125.62, "end": 3129.62, "text": "Die sagen übrigens gar nicht Tango Sucker."}, {"id": 449, "start": 3129.62, "end": 3133.62, "text": "Die sagen irgendwas anderes auf Arabisch, aber es hört sich an wie Tango Sucker."}, {"id": 450, "start": 3140.62, "end": 3141.62, "text": "Bam."}, {"id": 451, "start": 3142.62, "end": 3144.62, "text": "Habt ihr das gehört? Deine Mutter, hat er gerade gesagt."}, {"id": 452, "start": 3145.62, "end": 3147.62, "text": "Also MW2 hatte schon lustige Sound-Samples."}, {"id": 453, "start": 3155.62, "end": 3156.62, "text": "Wall-Banked."}, {"id": 454, "start": 3156.62, "end": 3157.62, "text": "Bambi."}, {"id": 455, "start": 3161.62, "end": 3165.62, "text": "Also Leute, Leute, Leute, das kann ich nicht promoten."}, {"id": 456, "start": 3166.62, "end": 3168.62, "text": "Das sind ja quasi schon fast Hardscopes."}, {"id": 457, "start": 3169.62, "end": 3174.62, "text": "Und wie wir alle wissen aus MW2-Zeiten, Hardscopes geht überhaupt nicht."}, {"id": 458, "start": 3175.62, "end": 3178.62, "text": "Du darfst das Fadenkreuz nicht sehen."}, {"id": 459, "start": 3179.62, "end": 3183.62, "text": "Nur dann ist es ein richtig ordentlich ausgeführter Quickscope."}, {"id": 460, "start": 3183.62, "end": 3188.62, "text": "Und wir wissen alle, Quickscope only ist das höchste, was man machen kann in MW2."}, {"id": 461, "start": 3192.62, "end": 3196.62, "text": "Und man muss seinen FPS auf 50 Billionen stellen."}, {"id": 462, "start": 3197.62, "end": 3201.62, "text": "Und FPS Control Freaks drauf machen für die Stick-Verlängerung."}, {"id": 463, "start": 3202.62, "end": 3203.62, "text": "Nur dann kann man richtig snipen."}, {"id": 464, "start": 3203.62, "end": 3206.62, "text": "Kennt ihr diesen Blödsinn noch mit FPS Freaks oder wie das hieß?"}, {"id": 465, "start": 3209.62, "end": 3211.62, "text": "Last Knight und Last Knight muss auch sein."}, {"id": 466, "start": 3217.62, "end": 3218.62, "text": "Kennt ihr die Dinger noch?"}, {"id": 467, "start": 3219.62, "end": 3220.62, "text": "Ja."}, {"id": 468, "start": 3221.62, "end": 3223.62, "text": "Ich weiß nicht, was das ist."}, {"id": 469, "start": 3224.62, "end": 3225.62, "text": "Ich weiß nicht, was das ist."}, {"id": 470, "start": 3226.62, "end": 3227.62, "text": "Ich weiß nicht, was das ist."}, {"id": 471, "start": 3228.62, "end": 3229.62, "text": "Ich weiß nicht, was das ist."}, {"id": 472, "start": 3229.62, "end": 3232.62, "text": "Kennt ihr die Dinger noch? Ja."}, {"id": 473, "start": 3235.62, "end": 3237.62, "text": "Diese Nippel-Aufsätze für Controller."}, {"id": 474, "start": 3239.62, "end": 3244.62, "text": "Wo man damals gedacht hat, da ist man viel präziser mit, wenn ich so einen Aufsatz auf dem Stick habe."}, {"id": 475, "start": 3246.62, "end": 3247.62, "text": "Ich habe es probiert, mir hat es nicht gefallen."}, {"id": 476, "start": 3248.62, "end": 3250.62, "text": "Ich sage nicht, dass es gar nichts bringt."}, {"id": 477, "start": 3251.62, "end": 3253.62, "text": "Also wenn man sich dran gewöhnt, vielleicht."}, {"id": 478, "start": 3253.62, "end": 3258.62, "text": "Aber, also meins war es jetzt nicht."}, {"id": 479, "start": 3259.62, "end": 3260.62, "text": "Haben die auch mal einen Xbox-Controller?"}, {"id": 480, "start": 3261.62, "end": 3262.62, "text": "So war es da, ja."}, {"id": 481, "start": 3263.62, "end": 3265.62, "text": "Da waren die Sticks halt ein bisschen länger."}, {"id": 482, "start": 3266.62, "end": 3271.62, "text": "Und da hat man sich dann eingeredet, man ist, weil man dann quasi bessere Übersetzungen hat oder so, ist man präziser."}, {"id": 483, "start": 3272.62, "end": 3275.62, "text": "Ja, ja, naja, naja, also ich weiß nicht."}, {"id": 484, "start": 3275.62, "end": 3282.62, "text": "Wo es, glaube ich, wirklich ganz gut für war, weil man Riesenhände hatte, weil dann hat man ein bisschen mehr Raum."}, {"id": 485, "start": 3283.62, "end": 3284.62, "text": "Aber ansonsten."}, {"id": 486, "start": 3284.62, "end": 3293.62, "text": "Ich muss gehen, ich werde jetzt rennen."}, {"id": 487, "start": 3294.62, "end": 3296.62, "text": "Schau, schau, schau."}, {"id": 488, "start": 3297.62, "end": 3298.62, "text": "Es ist so langsam."}, {"id": 489, "start": 3299.62, "end": 3300.62, "text": "Komm schon, geh, geh, geh."}, {"id": 490, "start": 3301.62, "end": 3302.62, "text": "Bam."}, {"id": 491, "start": 3303.62, "end": 3304.62, "text": "Die Leute oben oben."}, {"id": 492, "start": 3305.62, "end": 3306.62, "text": "Das ist gut."}, {"id": 493, "start": 3307.62, "end": 3308.62, "text": "Das ist so einfach."}, {"id": 494, "start": 3309.62, "end": 3310.62, "text": "Das ist so einfach."}, {"id": 495, "start": 3311.62, "end": 3312.62, "text": "Das ist so einfach."}, {"id": 496, "start": 3312.62, "end": 3318.62, "text": "Also eins muss man ja mal zu MW2 sagen."}, {"id": 497, "start": 3319.62, "end": 3325.62, "text": "Die Streaks, die Streaks und gerade den Nuke, die waren viel zu einfach und viel zu OP."}, {"id": 498, "start": 3332.62, "end": 3333.62, "text": "Bam."}, {"id": 499, "start": 3334.62, "end": 3335.62, "text": "Gleich weggenugt."}, {"id": 500, "start": 3335.62, "end": 3338.62, "text": "And another triple and they're spawning on top of me now."}, {"id": 501, "start": 3339.62, "end": 3340.62, "text": "What a game this is, holy crap."}, {"id": 502, "start": 3341.62, "end": 3342.62, "text": "Chat, chat, mein Chat ist weg."}, {"id": 503, "start": 3343.62, "end": 3344.62, "text": "Warum ist mein Chat weg?"}, {"id": 504, "start": 3345.62, "end": 3346.62, "text": "Mein Chat ist weg."}, {"id": 505, "start": 3347.62, "end": 3348.62, "text": "Ich muss reloaden."}, {"id": 506, "start": 3351.62, "end": 3352.62, "text": "Loki, doing well, man."}, {"id": 507, "start": 3353.62, "end": 3354.62, "text": "You're dead."}, {"id": 508, "start": 3355.62, "end": 3356.62, "text": "Wo ist mein Chat hin?"}, {"id": 509, "start": 3357.62, "end": 3358.62, "text": "Dead."}, {"id": 510, "start": 3359.62, "end": 3360.62, "text": "Watch out."}, {"id": 511, "start": 3361.62, "end": 3362.62, "text": "Jetzt ist er wieder da."}, {"id": 512, "start": 3362.62, "end": 3364.62, "text": "Was auch immer das jetzt gerade gewesen ist."}, {"id": 513, "start": 3389.62, "end": 3390.62, "text": "Nice."}, {"id": 514, "start": 3390.62, "end": 3393.62, "text": "Moment, ich hab jetzt gar nicht geguckt, ich muss gerade meinen Chat fixen."}, {"id": 515, "start": 3394.62, "end": 3396.62, "text": "Hat er das Allerwichtigste gemacht?"}, {"id": 516, "start": 3397.62, "end": 3398.62, "text": "Hat er gemessert bei der Nuke?"}, {"id": 517, "start": 3404.62, "end": 3405.62, "text": "Hat er gemessert bei der Nuke?"}, {"id": 518, "start": 3406.62, "end": 3408.62, "text": "Ansonsten ist sie nicht legit, nicht validate."}, {"id": 519, "start": 3409.62, "end": 3410.62, "text": "Validated."}, {"id": 520, "start": 3412.62, "end": 3414.62, "text": "Er hat nicht gemessert bei der Nuke."}, {"id": 521, "start": 3415.62, "end": 3416.62, "text": "Was ist das hier?"}, {"id": 522, "start": 3416.62, "end": 3417.62, "text": "Anzeige ist raus."}, {"id": 523, "start": 3417.62, "end": 3418.62, "text": "Er ist gestorben."}, {"id": 524, "start": 3418.62, "end": 3420.62, "text": "Das ist doch keine Entschuldigung dafür."}, {"id": 525, "start": 3421.62, "end": 3422.62, "text": "Man muss messern bei der Nuke."}, {"id": 526, "start": 3427.62, "end": 3429.62, "text": "Messern 360 und messern."}, {"id": 527, "start": 3429.62, "end": 3449.62, "text": "Alles noobs, ey."}, {"id": 528, "start": 3450.62, "end": 3451.62, "text": "Kann das sein?"}, {"id": 529, "start": 3452.62, "end": 3455.62, "text": "Ich glaub, ich hab nie eine Nuke-Gameplay hochgeladen, weil die immer so scheiße waren."}, {"id": 530, "start": 3455.62, "end": 3458.62, "text": "Ich hab, ich glaube, ich hatte nicht ein richtig gutes Nuke-Gameplay in MW2."}, {"id": 531, "start": 3459.62, "end": 3465.62, "text": "Das waren alles so Dinger, wo ich irgendwie 80% auf den Sack bekommen hab."}, {"id": 532, "start": 3466.62, "end": 3468.62, "text": "Dann hab ich Harrier Chopper Gunner gemacht, Nuke."}, {"id": 533, "start": 3469.62, "end": 3471.62, "text": "Und dann im Ende hatte ich dann irgendwie, frag mich nicht, keine Ahnung."}, {"id": 534, "start": 3472.62, "end": 3475.62, "text": "35, 20 oder so."}, {"id": 535, "start": 3476.62, "end": 3477.62, "text": "Ich glaub, ich hab nicht ein, kann das sein?"}, {"id": 536, "start": 3478.62, "end": 3479.62, "text": "Ich hab nicht ein Nuke-Gameplay hochgeladen."}, {"id": 537, "start": 3481.62, "end": 3483.62, "text": "Ich glaub, ich hab nicht ein Nuke-Gameplay hochgeladen."}, {"id": 538, "start": 3483.62, "end": 3486.62, "text": "Dafür hat der Friseur, glaub ich, ein paar Nuke-Gameplays hochgeladen bei mir."}, {"id": 539, "start": 3486.62, "end": 3489.62, "text": "Dann hol die Nuke nach, genau, ich mach jetzt die Xbox an und dann, easy."}, {"id": 540, "start": 3489.62, "end": 3492.22, "text": "Dafür hat der Friseur, glaube ich, ein paar Nuke-Gameplays hochgeladen bei mir."}, {"id": 541, "start": 3512.86, "end": 3514.14, "text": "Dann hol die Nuke nach."}, {"id": 542, "start": 3514.14, "end": 3516.38, "text": "Genau, ich mach jetzt die Xbox an und dann easy."}, {"id": 543, "start": 3516.38, "end": 3518.7, "text": "Easy Upload."}, {"id": 544, "start": 3538.02, "end": 3540.02, "text": "Wie kann ich den Nuke auf Nuke Town haben?"}, {"id": 545, "start": 3540.02, "end": 3540.82, "text": "Hä?"}, {"id": 546, "start": 3540.82, "end": 3558.26, "text": "Dein Videotitel ergibt für mich keinen Sinn."}, {"id": 547, "start": 3558.26, "end": 3573.06, "text": "Oh, jetzt endlich, endlich mal die richtige Intervention-Sniper."}, {"id": 548, "start": 3573.06, "end": 3576.22, "text": "Der Harrier war auch, der hat auch so ultra schnell gekillt in dem Game."}, {"id": 549, "start": 3576.22, "end": 3578.18, "text": "Das hat, du hast den Harrier gesehen."}, {"id": 550, "start": 3578.18, "end": 3582.26, "text": "Bzzzt, tot."}, {"id": 551, "start": 3582.26, "end": 3589.66, "text": "Ne, Intro ist 2020 auf YouTube nicht mehr in, kann man nicht mehr machen."}, {"id": 552, "start": 3589.66, "end": 3591.62, "text": "Haha, wir sind links checken wieder."}, {"id": 553, "start": 3591.62, "end": 3592.62, "text": "Oh."}, {"id": 554, "start": 3592.62, "end": 3596.42, "text": "Sag mal, sehe ich, dass das da irgendwie ein Clan im Gegnerteam ist?"}, {"id": 555, "start": 3596.42, "end": 3597.42, "text": "Ernsthaft?"}, {"id": 556, "start": 3597.42, "end": 3598.42, "text": "In MW2?"}, {"id": 557, "start": 3598.42, "end": 3599.42, "text": "No."}, {"id": 558, "start": 3599.42, "end": 3606.06, "text": "Okay, denn ein halber Clan ist da im Gegnerteam."}, {"id": 559, "start": 3606.06, "end": 3611.46, "text": "Und hier auch, ach ne, ach ne, okay, ach ne, okay ist dieser, ja okay, verstehe."}, {"id": 560, "start": 3611.46, "end": 3616.14, "text": "Ich hab mich verguckt, das ist wohl so ein Standardding, was viele haben jetzt, verstehe."}, {"id": 561, "start": 3616.14, "end": 3619.74, "text": "Das sind von ihm, aha, dass er überhaupt spielen kann wahrscheinlich."}, {"id": 562, "start": 3619.74, "end": 3626.38, "text": "Oh, no, no, no, I had to get off that roof."}, {"id": 563, "start": 3626.38, "end": 3628.3, "text": "Wahrscheinlich finden er sonst keine Games, wenn die nicht mitmachen."}, {"id": 564, "start": 3628.3, "end": 3640.02, "text": "Got him, got him, got him, like they have to be over, my stun missed him, dude."}, {"id": 565, "start": 3640.02, "end": 3644.82, "text": "This game was a good run, but it wasn't good enough, I almost had it, I just had to get"}, {"id": 566, "start": 3644.82, "end": 3645.82, "text": "away from that building."}, {"id": 567, "start": 3645.82, "end": 3650.06, "text": "Ist das, ist das gestelltes Sniper-Gameplay hier, gleicher Clan-Tech, Anzeige ist raus."}, {"id": 568, "start": 3650.06, "end": 3652.06, "text": "Und Intervention-Thermal."}, {"id": 569, "start": 3652.06, "end": 3658.54, "text": "Colette, let's go, baby, I'll take that start to a game any day of the week."}, {"id": 570, "start": 3658.54, "end": 3665.22, "text": "There's another one, 4-0, nice, bam, why, there's people on the other team still spawn sniping,"}, {"id": 571, "start": 3665.22, "end": 3667.22, "text": "I don't get it, oh my gosh."}, {"id": 572, "start": 3667.22, "end": 3670.14, "text": "Okay, da muss man einfach nur geradeaus gucken."}, {"id": 573, "start": 3670.14, "end": 3673.38, "text": "I think if that guy peeked, he would have killed me, just because of my luck right now."}, {"id": 574, "start": 3673.38, "end": 3678.86, "text": "I think I need to pick off one more kill here, it's been kinda slow, wow, hey, hey, it's"}, {"id": 575, "start": 3678.86, "end": 3679.86, "text": "12."}, {"id": 576, "start": 3679.86, "end": 3680.86, "text": "Cold-Blooded almost."}, {"id": 577, "start": 3680.86, "end": 3683.9, "text": "Ich muss mich mal outen, ich fand High-Rise war eine Cut-Map."}, {"id": 578, "start": 3683.9, "end": 3686.9, "text": "Got me, bruh, call these in real quick though."}, {"id": 579, "start": 3686.9, "end": 3693.9, "text": "Weil ich hab' weder gerne gesniped, noch sonst wie, ich bin gerne rumgerannt mit irgendwie"}, {"id": 580, "start": 3693.9, "end": 3701.7, "text": "einer MP5 oder einer AK-74U oder sowas und, äh, nee, Moment, das ist MW2, äh, warte mal,"}, {"id": 581, "start": 3701.7, "end": 3709.62, "text": "MW2, Akimbo-Model, nee, was auch immer, rumgerannt und die W, du konntest ja im Prinzip nur"}, {"id": 582, "start": 3709.62, "end": 3716.54, "text": "entweder ganz außen rum oder unten rum rennen, UMP war, OP, ja, ich, ich mochte High-Rise"}, {"id": 583, "start": 3716.54, "end": 3717.54, "text": "nicht."}, {"id": 584, "start": 3717.54, "end": 3728.3, "text": "Nee, ich hab' kein Cold War gespielt, aber nachdem ich schon wieder die Leute überall"}, {"id": 585, "start": 3728.3, "end": 3735.5, "text": "über Reverse-Boosten rumflamen, äh, Skill-Base-Matchmaking und dann Reverse-Boosten rumflamen, hab' ich"}, {"id": 586, "start": 3735.5, "end": 3740.9, "text": "auch keinen Bock drauf, sowas hat in Public-Matchmaking meiner Meinung nach nichts zu suchen und ist"}, {"id": 587, "start": 3740.9, "end": 3741.9, "text": "für'n Arsch."}, {"id": 588, "start": 3741.9, "end": 3749.86, "text": "Ja, gut, das ist MW2, da muss man sich nicht wundern, dass der oder, das ist MW2, das ist"}, {"id": 589, "start": 3749.86, "end": 3750.86, "text": "normal."}, {"id": 590, "start": 3750.86, "end": 3761.7, "text": "Die Map war gut, die fand ich zum Beispiel nice, ja, ich hab' vergessen, wie gesagt,"}, {"id": 591, "start": 3761.7, "end": 3762.7, "text": "Sub?"}, {"id": 592, "start": 3762.7, "end": 3763.7, "text": "Sub-Pen?"}, {"id": 593, "start": 3763.7, "end": 3764.7, "text": "War das Sub-Pen?"}, {"id": 594, "start": 3764.7, "end": 3773.46, "text": "Nee, irgendwas, wie ist das denn die Map?"}, {"id": 595, "start": 3773.46, "end": 3778.22, "text": "Sub-Base, Sub-Base, genau, irgendwas mit Sub."}, {"id": 596, "start": 3778.22, "end": 3794.06, "text": "Hahaha, was mit dem, du Closed-Alten, was macht der da?"}, {"id": 597, "start": 3794.06, "end": 3805.94, "text": "Ja, und man muss sagen, MW2, MW2 war schon ziemlich farbenfroh versus Cod 4."}, {"id": 598, "start": 3805.94, "end": 3810.66, "text": "Rust war Müll, genauso wie, und ich weiß, sehr unpopulärer Meinung, Nuketown ist auch"}, {"id": 599, "start": 3810.66, "end": 3811.66, "text": "Müll."}, {"id": 600, "start": 3811.66, "end": 3815.74, "text": "Nuketown ist nur so beliebt, Nuketown ist nicht gut spielbar, Nuketown ist nur so beliebt,"}, {"id": 601, "start": 3815.74, "end": 3821.14, "text": "weil's Instant-In-Your-Face-Action ist und die schlimmste Map, genau, hier, 13, die"}, {"id": 602, "start": 3821.14, "end": 3827.3, "text": "schlimmste Map überhaupt ist Shipment, was mir absolut nicht einleuchtet, warum man ausgerechnet"}, {"id": 603, "start": 3827.3, "end": 3831.86, "text": "so eine Tracks-Map nochmal reingebracht hat."}, {"id": 604, "start": 3831.86, "end": 3840.38, "text": "Ich mein, Shipment ist ne Map, was ein Praktikant, den man den Level-Editor installiert hat,"}, {"id": 605, "start": 3840.38, "end": 3844.18, "text": "nach 45 Minuten gebaut hat, das ist Shipment."}, {"id": 606, "start": 3844.18, "end": 3854.18, "text": "Denn Shipment ist wirklich ne Editor-Übungs-Map, achja, übrigens, der Grund dafür ist auch,"}, {"id": 607, "start": 3854.18, "end": 3861.38, "text": "oder warum ich Shipment nicht schlecht finde in MW2 ist, weil man dort seine Sachen schnell"}, {"id": 608, "start": 3861.38, "end": 3862.38, "text": "hochleveln kann."}, {"id": 609, "start": 3862.38, "end": 3871.58, "text": "Aber die Map finde ich scheiße, aber die Funktion ist okay, die Funktion ist okay,"}, {"id": 610, "start": 3871.58, "end": 3876.3, "text": "wobei halt die Sache die ist, man muss sich mal überlegen, ne, jetzt mal real-time, muss"}, {"id": 611, "start": 3876.3, "end": 3883.06, "text": "ich mal überlegen, wie verkackt muss ein Multiplayer sein, dass die Leute 24-7 Shipment"}, {"id": 612, "start": 3883.06, "end": 3887.1, "text": "spielen, weil sie die Waffen leveln müssen und ansonsten den Multiplayer nicht anrühren?"}, {"id": 613, "start": 3887.1, "end": 3892.18, "text": "Also wie schlecht muss ein Multiplayer sein, dass die Leute, die Leute wollen ihn nicht"}, {"id": 614, "start": 3892.18, "end": 3893.18, "text": "spielen?"}, {"id": 615, "start": 3893.18, "end": 3897.58, "text": "Und was machen die Leute, dass sie den Multiplayer möglichst wenig spielen wollen, 24-7 Shipment,"}, {"id": 616, "start": 3897.58, "end": 3898.78, "text": "bis die Waffen hochgelevelt sind?"}, {"id": 617, "start": 3898.78, "end": 3903.3, "text": "So richtig hängen geblieben, ne?"}, {"id": 618, "start": 3903.3, "end": 3914.58, "text": "Ich hab' noch immer den Kopf gesehen vom Gegner."}, {"id": 619, "start": 3914.58, "end": 3915.58, "text": "Easy, Chopper-Ganne."}, {"id": 620, "start": 3915.58, "end": 3936.9, "text": "Na gut, es ist, es ist MW2 Free-for-all, da wurde, da wurde auch schon rumgestellst"}, {"id": 621, "start": 3936.9, "end": 3937.9, "text": "ohne Ende."}, {"id": 622, "start": 3937.9, "end": 3950.7, "text": "Ah, Free-for-all-Nukes waren auch nicht so ohne, also Free-for-all-Nukes waren mit, mit das"}, {"id": 623, "start": 3950.7, "end": 3972.34, "text": "schwierige, das ist das Schwierigere in MW2."}, {"id": 624, "start": 3972.34, "end": 3973.78, "text": "Ich glaub, der ist da einfach gespawnt."}, {"id": 625, "start": 3973.78, "end": 3980.06, "text": "Ah, easy, easy Sniper-Kill für die Nuke."}, {"id": 626, "start": 3980.06, "end": 3981.06, "text": "Nein!"}, {"id": 627, "start": 3981.06, "end": 3982.06, "text": "Bam!"}, {"id": 628, "start": 3982.06, "end": 3983.06, "text": "Äh, doch kein Nuke?"}, {"id": 629, "start": 3983.06, "end": 3988.06, "text": "Oh, ah."}, {"id": 630, "start": 3988.06, "end": 4004.74, "text": "Jetspam-Cool-Kerl, ja, der ist echt so, ich hab' da echt keinen Nerv drauf, ich kann"}, {"id": 631, "start": 4004.74, "end": 4005.74, "text": "mir das nicht geben."}, {"id": 632, "start": 4005.74, "end": 4019.9, "text": "Also komm, also jetzt mal ganz im Ernst, was ist da los, also Gegner die nicht treffen"}, {"id": 633, "start": 4019.9, "end": 4028.1, "text": "ist ja okay, aber Gegner die einfach nur afk rumstehen, wieder nicht gemessert, zählt"}, {"id": 634, "start": 4028.1, "end": 4029.1, "text": "wieder nicht."}, {"id": 635, "start": 4029.1, "end": 4030.1, "text": "Zählt wieder nicht."}, {"id": 636, "start": 4030.1, "end": 4036.1, "text": "War nicht eine legit Nuke dabei."}, {"id": 637, "start": 4036.1, "end": 4048.5, "text": "Ja, MW2 war viel zu einfach, die Nuke, seh ich auch so, aber wirklich."}, {"id": 638, "start": 4048.5, "end": 4064.86, "text": "Also ich muss ja sagen, von der Basis her, also vom reinen Unterbau her, war Modern Warfare,"}, {"id": 639, "start": 4064.86, "end": 4068.7, "text": "oder jetzt meinetwegen auch Black Ops, wobei ich da wenig zu sagen kann, aber zumindest"}, {"id": 640, "start": 4068.7, "end": 4074.58, "text": "zu Modern Warfare, das war gar nicht so schlecht, aber die wussten nicht, was sie wollen."}, {"id": 641, "start": 4074.58, "end": 4080.86, "text": "Auf der einen Seite war das mit dem Pieken und dem Rutschen und dem Movement und dem"}, {"id": 642, "start": 4080.86, "end": 4090.5, "text": "hohen Headshot Multiplayer darauf ausgelegt, dass es eher, sagen wir mal, so eine Mischung"}, {"id": 643, "start": 4090.5, "end": 4097.94, "text": "hätte werden müssen aus Rainbow Six und CS, aber dann haben sie sich dafür entschieden,"}, {"id": 644, "start": 4097.94, "end": 4104.62, "text": "wir haben quasi einen Unterbau gebastelt für ein Game, für eine Mischung aus CS und Rainbow"}, {"id": 645, "start": 4104.62, "end": 4108.42, "text": "Six, aber wir machen einfach ganz normales Call of Duty TDM draus."}, {"id": 646, "start": 4108.42, "end": 4112.58, "text": "So, und das funktioniert halt einfach nicht, das hast du in Modern Warfare auch gesehen,"}, {"id": 647, "start": 4112.58, "end": 4116.3, "text": "dass das hinten und vorne nicht funktioniert, die Leute haben permanent nur noch am Fenster"}, {"id": 648, "start": 4116.3, "end": 4121.26, "text": "rumgeschimmelt, dann haben sie riesen Maps gemacht, wo man sich in jeder Ecke aus 70"}, {"id": 649, "start": 4121.26, "end": 4128.14, "text": "E-Winkeln abgeaimt werden kann, aber da hat der Rest halt nicht dazu gepasst. So, und dazu"}, {"id": 650, "start": 4128.14, "end": 4133.54, "text": "kam dann auch noch, dass es halt diesen ganzen üblichen Killstreak-Gramm gab, der eigentlich,"}, {"id": 651, "start": 4133.54, "end": 4139.22, "text": "wenn man ehrlich ist, in so einem Game dann eigentlich nichts verloren hätte, plus, dass"}, {"id": 652, "start": 4139.22, "end": 4143.66, "text": "es durch Skill-Based-Matchmaking sogar nahezu unmöglich war, dann noch diese Killstreaks"}, {"id": 653, "start": 4143.66, "end": 4149.26, "text": "auch noch zu bekommen, also das war echt ein Game, was total viele Widersprüche hatte"}, {"id": 654, "start": 4149.26, "end": 4157.46, "text": "in Modern Warfare. Und ich bin immer noch der Meinung, dass Skill-Based-Matchmaking absolut"}, {"id": 655, "start": 4157.46, "end": 4162.66, "text": "nichts in so einem Public-Basher-Game wie Call of Duty zu suchen hat. Du kannst das"}, {"id": 656, "start": 4162.66, "end": 4166.1, "text": "machen, warum hat man nicht einfach einen Rank-Modus? In einem Rank-Modus ist das doch"}, {"id": 657, "start": 4166.1, "end": 4171.02, "text": "top. In einem Rank-Modus hast du da nebendran auch stehen, was du für einen Rank hast und"}, {"id": 658, "start": 4171.02, "end": 4175.98, "text": "kannst dir da drauf ein abrubbeln, dass du irgendwas als ich Gold, Platin, Master, Extreme"}, {"id": 659, "start": 4175.98, "end": 4180.14, "text": "oder so bist. Im Public-Matchmaking kannst du dir da überhaupt nichts dafür kaufen."}, {"id": 660, "start": 4180.14, "end": 4189.66, "text": "Und ich erwarte ja auch nicht, dass jede Lobby gleich wie eine Reverse-Boosted-Lobby"}, {"id": 661, "start": 4189.66, "end": 4195.7, "text": "ist, aber zumindest, dass man die Chance drauf hat. Es war doch schon immer so, entweder"}, {"id": 662, "start": 4195.7, "end": 4201.86, "text": "wirst du gebashed oder du bashedst, aber so wie es jetzt aktuell ist, hat keiner so wirklich"}, {"id": 663, "start": 4201.86, "end": 4209.66, "text": "Spaß dran. Die Noobs spielen unter sich, bleiben für immer Noobs und krebsen da jeder mit"}, {"id": 664, "start": 4209.66, "end": 4215.78, "text": "ihrer 50 rum. Die guten Leute spielen weiter unter sich und jeder krebs da mit seinem 50"}, {"id": 665, "start": 4215.78, "end": 4224.58, "text": "rum. Das ist doch langweilig und frustrierend as fuck. Nach meinem Ranking-Modus, dann ist"}, {"id": 666, "start": 4224.58, "end": 4230.3, "text": "okay. Es gibt ja manchmal automatisch generierte Tour-en-Tour-Turniere und so. Sowas ist gut."}, {"id": 667, "start": 4230.3, "end": 4241.22, "text": "Sowas ist nice, ja. Aber doch nicht das normale Matchmaking. David Tree, genau das kann einem"}, {"id": 668, "start": 4241.22, "end": 4247.06, "text": "da eben auch passieren. Das finde ich auch okay. Deswegen soll es einen Unterschied"}, {"id": 669, "start": 4247.06, "end": 4254.38, "text": "geben zwischen Quickplay und Ranked. Ganz einfach. Und du musst sogar, das ist richtig,"}, {"id": 670, "start": 4254.38, "end": 4259.22, "text": "du musst sogar jede Runde tryharnen, dass du bei deinem 50-50 bleibst oder vielleicht"}, {"id": 671, "start": 4259.22, "end": 4265.62, "text": "46, da bist du ja schon gut. Da bist du ja in Modern Warfare, wenn du nicht reverse boosted"}, {"id": 672, "start": 4265.62, "end": 4277.38, "text": "mit einer 1,5er KD oder so, bist du schon ein Gottgamer. Ich finde, das ist eigentlich"}, {"id": 673, "start": 4277.38, "end": 4283.18, "text": "hauptsächlich frustrierend und langweilig zugleich, auch wenn es sich doof anhört,"}, {"id": 674, "start": 4283.18, "end": 4287.7, "text": "wenn die Noobs unter sich sind und 1,5er KDs haben und die guten Leute unter sich sind"}, {"id": 675, "start": 4287.7, "end": 4293.3, "text": "und 1,5er KDs haben, ist richtig kacke eigentlich. Ich meine, es muss was bringen, umsonst machen"}, {"id": 676, "start": 4293.3, "end": 4302.94, "text": "die das nicht. Die sind ja nicht dumm. Analysieren tun die schon. Ich habe ja auch so ein bisschen"}, {"id": 677, "start": 4302.94, "end": 4311.82, "text": "die Vermutung, ehrlich gesagt, dass man das macht, also einmal natürlich, dass man beeinflussen"}, {"id": 678, "start": 4311.82, "end": 4322.74, "text": "kann, was die Leute kaufen im Spiel. Also man versucht das so hinzudrehen, dass man eventuell"}, {"id": 679, "start": 4322.74, "end": 4326.22, "text": "Leute bekommt, die eine Waffe haben, die man noch nicht hat und die man dann freispielt,"}, {"id": 680, "start": 4326.22, "end": 4330.58, "text": "wie auch immer. Das ist bestimmt einmal eine Variante, um zu kontrollieren, was die Leute"}, {"id": 681, "start": 4330.58, "end": 4336.14, "text": "kaufen oder Anreize zu geben, was sie kaufen sollen. Da gab es sogar mal ein Patent, natürlich"}, {"id": 682, "start": 4336.14, "end": 4344.22, "text": "ist das Spekulation, ob sie das wirklich benutzen. Aber das ist bestimmt ein Aspekt von Skill-Based"}, {"id": 683, "start": 4344.22, "end": 4350.1, "text": "Matchmaking. Der andere Aspekt ist mit Sicherheit auch, dass die Leute nicht demotiviert werden,"}, {"id": 684, "start": 4350.1, "end": 4354.94, "text": "durch komplettes Zerstört werden. Was man sich halt damit erkauft, ist, dass es halt"}, {"id": 685, "start": 4354.94, "end": 4360.82, "text": "dementsprechend auch so gut wie keine Erfolgserlebnisse mehr gibt. Also gerade Public Matchmaking"}, {"id": 686, "start": 4360.82, "end": 4367.22, "text": "ist meiner Meinung nach ganz wichtig, dass es eben zerstören und zerstört werden ist."}, {"id": 687, "start": 4367.22, "end": 4371.54, "text": "Deswegen finde ich es auch kacke und es hat im Quickplay nichts zu suchen. Was man machen"}, {"id": 688, "start": 4371.54, "end": 4376.66, "text": "kann und was ich ja persönlich auch für viel sinnvoller halten würde, ist, man macht ein"}, {"id": 689, "start": 4376.66, "end": 4383.38, "text": "richtiges Skill-Based Matchmaking mit Ranks, wo man dann eben auch sieht, ok, der Typ ist"}, {"id": 690, "start": 4383.38, "end": 4388.98, "text": "so und so gut. Weil dann ist es auch motivierend zu tryharten. Wo ist denn die Motivation,"}, {"id": 691, "start": 4388.98, "end": 4395.82, "text": "zu tryharten, um nichts dafür zu bekommen? Das verstehe ich nicht. Wo ist die Motivation"}, {"id": 692, "start": 4395.82, "end": 4401.1, "text": "im Skill-Based Matchmaking, zu tryharten as fuck, 50-50, vielleicht 60-40 rauszugehen?"}, {"id": 693, "start": 4401.1, "end": 4409.5, "text": "Nichts dafür zu bekommen im Endeffekt. Wenn man Ranks spielt mit einem Leaderboard oder"}, {"id": 694, "start": 4409.5, "end": 4415.58, "text": "Rankanzeige und sowas, dann bekommt man ja auch was dafür, dass man tryhardet. Also"}, {"id": 695, "start": 4415.58, "end": 4422.7, "text": "das ist... Ja, genau. Und dann habe ich noch die andere Vermutung. Ich glaube ja, dass"}, {"id": 696, "start": 4422.7, "end": 4428.5, "text": "sie diese Skill-Based Matchmaking jetzt so lange tot reiten, bis ihnen was besseres"}, {"id": 697, "start": 4428.5, "end": 4436.06, "text": "eingefallen ist oder bis sie einen neuen Verkaufskund brauchen, warum man Kot 2023 kaufen"}, {"id": 698, "start": 4436.06, "end": 4439.82, "text": "soll. Und dann machen sie den Facular Stand. Könnt ihr euch noch an den Facular Stand"}, {"id": 699, "start": 4439.82, "end": 4447.14, "text": "erinnern? Facular Stand war zu MW3 eine Aussage vom damaligen Community Manager, dass sie"}, {"id": 700, "start": 4447.14, "end": 4452.62, "text": "Last Stand rausnehmen, oder zu MW2, nee, ich glaube zu MW3, dass sie Facular Stand rausnehmen,"}, {"id": 701, "start": 4452.62, "end": 4458.62, "text": "dass sie Last Stand rausnehmen. Und am Ende hieß es Final Stand und war immer noch im"}, {"id": 702, "start": 4458.62, "end": 4483.22, "text": "Game. Ja. Das habe ich übrigens damals schon nicht verstanden, warum das die Leute so"}, {"id": 703, "start": 4483.22, "end": 4488.98, "text": "feiern, weil wenn der Entwickler das wirklich für beschissen gehalten hätte, hätten sie"}, {"id": 704, "start": 4488.98, "end": 4491.76, "text": "das immer noch aus dem alten, hätten sie immer noch die Balancing ordentlich machen"}, {"id": 705, "start": 4491.76, "end": 4504.1, "text": "können im alten Game. Aber, ja. Und jetzt kommt's. Der hat aber auch viel unberechtigten"}, {"id": 706, "start": 4504.1, "end": 4521.06, "text": "Hate abgekriegt, ja. So, und wisst ihr was dann im Game war? Weiß ich, ob's Final Stand"}, {"id": 707, "start": 4521.06, "end": 4537.5, "text": "hieß? Last Stand war raus, Final Stand war drin, easy. Da haben's halt die Leute in der"}, {"id": 708, "start": 4537.5, "end": 4547.82, "text": "Hardcore gebaitet, äh. So, und so Dinge haben sie laufen. Deswegen glaube ich, das ist"}, {"id": 709, "start": 4547.82, "end": 4552.18, "text": "mit Skill-Based Matchmaking ähnlich. Also es hat seine Gründe, wie ich gerade gesagt"}, {"id": 710, "start": 4552.18, "end": 4556.5, "text": "habe, warum es das gibt, aus aktivischen Sicht, aus Spielersicht finde ich beschissen,"}, {"id": 711, "start": 4556.5, "end": 4562.9, "text": "und ich glaube in quasi ein, zwei, drei Jahren werden sie dann den Facular Stand mit Skill-Based"}, {"id": 712, "start": 4562.9, "end": 4568.94, "text": "Matchmaking machen. Fuck you Skill-Based Matchmaking. Und in Wirklichkeit haben sie dann irgendwas,"}, {"id": 713, "start": 4568.94, "end": 4573.66, "text": "was genauso abfuckt, aber einfach nur anders heißt. Ich glaube offiziell bestätigt ist"}, {"id": 714, "start": 4573.66, "end": 4578.26, "text": "es immer noch nicht, ne? Aber die werden ja auch Teufel tun, das offiziell zu bestätigen."}, {"id": 715, "start": 4578.26, "end": 4592.34, "text": "Was, es gab noch das, wo man sich mit dem C4 auf den Boden gesprengt hat? Was? Ne. Ja"}, {"id": 716, "start": 4592.34, "end": 4599.54, "text": "ne, das war Merturdom, das war aus Quad 4, wo du ne Granate hast fallen lassen, ja. Fändest"}, {"id": 717, "start": 4599.54, "end": 4603.9, "text": "du ein, auch das ist ne gute Frage, kann ich mal kurz vor auslassen, fändest du ein Battlefield"}, {"id": 718, "start": 4603.9, "end": 4614.38, "text": "3 Remastered geil? Nochmal das Gefühl, nein, nein, weil ich generell abgefuckt bin von"}, {"id": 719, "start": 4614.38, "end": 4620.9, "text": "zu vielen Remastered und Remakes. Es gibt zu viele, also es gibt prinzipiell schon mal"}, {"id": 720, "start": 4620.9, "end": 4626.82, "text": "viel zu viele Spiele, die aus irgendeiner Serie stammen. Sei es jetzt Assassin's Creed,"}, {"id": 721, "start": 4626.82, "end": 4631.02, "text": "For Speed, FIFA, es gibt ja gefühlt 80% der Sachen, die rauskommen, in irgendeine Serie,"}, {"id": 722, "start": 4631.02, "end": 4635.5, "text": "das geht mir schon mal auf den Keks. Dazu ist mittlerweile schon alles irgendwie Remake,"}, {"id": 723, "start": 4635.5, "end": 4641.46, "text": "Remastered, sonst wie. Ich bin der Meinung, dass ein Remastered von Battlefield 3 nicht"}, {"id": 724, "start": 4641.46, "end": 4645.26, "text": "mehr das Battlefield 3 zurückbringt, wie es neu war. Man hat das ein bisschen gesehen"}, {"id": 725, "start": 4645.26, "end": 4651.3, "text": "bei WoW Classic, WoW Classic haben die Leute auch getan, als wäre das irgendwie das gelobte"}, {"id": 726, "start": 4651.3, "end": 4655.98, "text": "Land, so WoW Classic her zurück und ich glaube von den Spielerzahlen ist WoW Classic gar"}, {"id": 727, "start": 4655.98, "end": 4660.22, "text": "nicht mal so schlecht immer noch. Also das hat der Blizzard selbst ein bisschen überrascht,"}, {"id": 728, "start": 4660.22, "end": 4666.98, "text": "aber viele haben halt im Nachhinein jetzt auch gesagt, nee, es ist zwar ein gutes Game,"}, {"id": 729, "start": 4666.98, "end": 4672.02, "text": "aber das Gefühl von WoW Classic ist es halt auch immer noch nicht, weil da gehört ja"}, {"id": 730, "start": 4672.02, "end": 4675.78, "text": "noch mehr dabei, da gehören ja auch die aktuellen Lebensumstände dabei. So nach dem Motto, man"}, {"id": 731, "start": 4675.78, "end": 4679.1, "text": "war noch in der Schule, konnte um 13 Uhr heimgehen und dann irgendwie erst mal 15 Stunden spielen"}, {"id": 732, "start": 4679.1, "end": 4683.38, "text": "und sowas, das ist halt heute nicht mehr so. Und ich glaube, das ist bei Battlefield 3"}, {"id": 733, "start": 4683.38, "end": 4688.42, "text": "ähnlich, das Gefühl von Battlefield 3 neu wird es nicht mehr geben, deswegen bin ich"}, {"id": 734, "start": 4688.42, "end": 4693.62, "text": "der Meinung, sie sollen nicht Battlefield 3 Remasteren. Ich fände es insofern cool,"}, {"id": 735, "start": 4693.62, "end": 4699.02, "text": "wenn sie es machen würden, weil man dann wieder eine ordentliche Playerbase oder zumindest"}, {"id": 736, "start": 4699.02, "end": 4706.5, "text": "mehr als zwei Server hätte, das wäre cool und ich spiele das halt gern. Aber was ich"}, {"id": 737, "start": 4706.5, "end": 4712.42, "text": "viel besser finden würde ist, wenn die denn ein ordentliches Battlefield machen, ich meine,"}, {"id": 738, "start": 4712.42, "end": 4717.02, "text": "es kann doch nicht sein, dass sie nicht mehr in der Lage sind, ein gutes Battlefield zu"}, {"id": 739, "start": 4717.02, "end": 4725.62, "text": "machen. Das kann doch nicht sein, ich meine, gut, doch kann sein, die Leute sind alle nicht"}, {"id": 740, "start": 4725.62, "end": 4735.22, "text": "mehr da. Ihr müsst es doch hinkriegen, die sollen lieber, dazu gibt es ja noch keine"}, {"id": 741, "start": 4735.22, "end": 4743.82, "text": "News, aber ey, dann kaufe ich mir nicht. Die sollen mal ein ordentliches Battlefield machen,"}, {"id": 742, "start": 4743.82, "end": 4749.88, "text": "vor allem ein Battlefield, was gewisse Offenheit hat. Also nicht, ich meine damit nicht, dass"}, {"id": 743, "start": 4749.88, "end": 4755.18, "text": "man 50 Millionen verschiedene Waffen hat oder irgendwie riesengroße Maps, wo man sich nicht"}, {"id": 744, "start": 4755.18, "end": 4760.34, "text": "findet, sondern was ich zum Beispiel meine ist, dass man wieder, von selbst gehosteten"}, {"id": 745, "start": 4760.34, "end": 4764.06, "text": "Servern rede ich ja mal gar nicht. Das ist im Jahr 2020 ein Ding der Unmöglichkeit,"}, {"id": 746, "start": 4764.06, "end": 4767.34, "text": "dass man Server selbst hosten kann. Aber ich rede zum Beispiel dafür, dass die Server,"}, {"id": 747, "start": 4767.34, "end": 4772.9, "text": "die man sich kaufen muss, zumindest ordentliche Pluginschnittstellen haben, dass man zum Beispiel"}, {"id": 748, "start": 4772.9, "end": 4778.1, "text": "ein Sniper Limit einbauen kann, weil gerade wenn man einen ganz gut fragmentierten Server"}, {"id": 749, "start": 4778.1, "end": 4783.66, "text": "hat, das Battlefield ist ja teilweise ohne Sniper Limit gar nicht richtig spielbar. Also"}, {"id": 750, "start": 4783.66, "end": 4788.14, "text": "Sniper Limit ist eines der wichtigsten Plugins aller Zeiten gewesen und das geht aktuell"}, {"id": 751, "start": 4788.14, "end": 4802.58, "text": "nicht mehr. Server Plugins waren Poggers und dazu kommt ja auch noch, wenn der Server scheiße"}, {"id": 752, "start": 4802.58, "end": 4807.22, "text": "ist mit den Plugins, dann spielt keiner auf dem Server. Das heißt im Endeffekt setzen"}, {"id": 753, "start": 4807.22, "end": 4813.26, "text": "sich auch die Server durch mit guten Plugins-Settings, guten Mods und guten Regeln. Und gerade Sniper"}, {"id": 754, "start": 4813.26, "end": 4827.66, "text": "war richtig nice. Ja genau, das war in Overwatch schon zu spüren, dass Quickplay dich ein bisschen"}, {"id": 755, "start": 4827.66, "end": 4833.46, "text": "gerankt hat nach Können, aber nicht so krass. Also Quickplay konntest du in der Regel durchmarschieren"}, {"id": 756, "start": 4833.46, "end": 4862.1, "text": "wie sonst war, das war kein Ding."}, {"id": 757, "start": 4862.1, "end": 4876.74, "text": "Ja es gab schon nervige Sachen, muss man halt gucken, dass man das verbessert. Aber das"}, {"id": 758, "start": 4876.74, "end": 4880.38, "text": "ging prinzipiell zu sagen, denn man sollte das Spiel so weit wie möglich abgrenzen,"}, {"id": 759, "start": 4880.38, "end": 4886.54, "text": "weil zum überwiegenden Teil hatte das schon seine Vorteile, gerade das Sniper Limit. Battlefield"}, {"id": 760, "start": 4886.54, "end": 4895.46, "text": "3 ohne Sniper Limit ist teilweise so cancer. Da liegt dann Simone23 wieder auf Damavent"}, {"id": 761, "start": 4895.46, "end": 4902.22, "text": "Peak mit der Sniper rum, falls ich noch einer an das Video erinnern kann. Oder Simone95,"}, {"id": 762, "start": 4902.22, "end": 4917.1, "text": "ich weiß nicht, wer wieder Game Attack war, Damavent Peak mit dem Sniper im Spawn. Ne,"}, {"id": 763, "start": 4917.1, "end": 4919.46, "text": "glaube ich nicht. Dürfte eigentlich nicht so schwer sein, Battlefield 3 und Battlefield"}, {"id": 764, "start": 4919.46, "end": 4928.1, "text": "4 Maps in einem, glaube ich nicht, das dürfte ziemlich easy sein. Soweit ich ja eh nicht"}, {"id": 765, "start": 4928.1, "end": 4935.02, "text": "weiß ob die Maps, ob die mit irgendeinem hauseigenen Editor erstellt werden oder ob das sowas ist"}, {"id": 766, "start": 4935.02, "end": 4939.02, "text": "wie 3D Studio Max und dann irgendwie konvertiert werden in Battlefield, keine Ahnung wie die"}, {"id": 767, "start": 4939.02, "end": 4958.62, "text": "das machen. Nein, auf dem Low Power Intel x86. Ja, haben wir sogar im Stream schon ausprobiert."}, {"id": 768, "start": 4958.62, "end": 4967.82, "text": "Ja, Rush ist ja auch bester Spielmodus. Conquest kann man das ja, das ist ja noch schön an"}, {"id": 769, "start": 4967.82, "end": 4973.1, "text": "dem Server, das kann man anpassen. Also wenn man einen Conquest Server hat, lässt man es"}, {"id": 770, "start": 4973.1, "end": 4986.86, "text": "einfach raus oder passt das anders an. Das ist ja gerade das Gute da dran. Naja, und"}, {"id": 771, "start": 4986.86, "end": 4991.22, "text": "ist deswegen, also wie gesagt, ich denke sie sollten kein Remake von Battlefield 3 machen,"}, {"id": 772, "start": 4991.22, "end": 4993.9, "text": "so schön ich es finden würde, dass mal ein bisschen Spieler wieder da sind, weil wenn"}, {"id": 773, "start": 4993.9, "end": 5000.42, "text": "man hier mal gucken. Battlelog, es gibt noch eins, zwei, drei, maximal drei Server wo"}, {"id": 774, "start": 5000.42, "end": 5009.94, "text": "was drauf los ist. So, Battlefield 3. Lassen wir das mal raus und sagen Rush und dann sagen"}, {"id": 775, "start": 5009.94, "end": 5024.5, "text": "wir hier, was weiß ich, alles, alles Server. Ah, Commodate Server gibt's. What the fuck."}, {"id": 776, "start": 5024.5, "end": 5051.5, "text": "Das ist kaputt. Okay, was auch immer. Also es gibt einen russischen Server. Neun Tom"}, {"id": 777, "start": 5051.5, "end": 5060.94, "text": "Tricks. Der hier ist ganz gut, da habe ich öfters drauf gespielt. Okay, es gibt, also"}, {"id": 778, "start": 5060.94, "end": 5067.5, "text": "man hat, sagen wir mal drei Server, die gut besucht, halbwegs gut besucht sind. Ne, vier,"}, {"id": 779, "start": 5067.5, "end": 5075.5, "text": "vier. Weil ganz ehrlich, den hier würde ich wahrscheinlich spielen, weil 32 finde ich"}, {"id": 780, "start": 5075.5, "end": 5091.14, "text": "jetzt eine gute Anzahl für Rush. BF3 Stats gibt's ja nicht mehr. Gab's ja mal diese Seite"}, {"id": 781, "start": 5091.14, "end": 5105.34, "text": "hier, BF3 Stats. Jaja, die gibt's nicht mehr, das ist ja down. Ne, Moment, das meine ich"}, {"id": 782, "start": 5105.34, "end": 5111.58, "text": "gar nicht, BF3 Stats. Gab's doch so eine Seite. Genau, die gibt's nicht mehr. BF Stats"}, {"id": 783, "start": 5111.58, "end": 5122.9, "text": "hätte. Naja, deswegen Remake vielleicht dadurch, dass es ein bisschen mehr Spieler gäbe, aber"}, {"id": 784, "start": 5122.9, "end": 5128.94, "text": "ehrlich gesagt, was mir viel lieber wäre, ein ordentliches Battlefield 6, wären wir"}, {"id": 785, "start": 5128.94, "end": 5133.06, "text": "viel lieber. So, was gucken wir uns jetzt als nächstes an? Ach komm, wo wir gerade"}, {"id": 786, "start": 5133.06, "end": 5146.38, "text": "dabei sind. Wo wir gerade dabei sind, Leute. Wir gucken uns jetzt eine Runde Battlefield"}, {"id": 787, "start": 5146.38, "end": 5154.02, "text": "an. Wo? Haben wir das nicht schon gesehen? Haben wir das nicht schon gesehen? Alter, wie"}, {"id": 788, "start": 5154.02, "end": 5158.54, "text": "die weggespringt. Das haben wir doch schon gesehen, oder? Moment, ich muss noch kurz"}, {"id": 789, "start": 5158.54, "end": 5167.5, "text": "vorspulen. Ja klar, haben wir das schon gesehen. Das ist der mit dem 4 zu 3. Jaja, klar, das"}, {"id": 790, "start": 5167.5, "end": 5170.98, "text": "haben wir schon gesehen. Okay, wollen wir mal gucken, ob es noch andere Top-Plays, Top-Plays"}, {"id": 791, "start": 5170.98, "end": 5176.98, "text": "von dem, von dem gibt's Top. Battlefield, oh ne, ne, ne. Battlefield 1 gucken wir nicht."}, {"id": 792, "start": 5176.98, "end": 5186.82, "text": "Battlefield 5 gucken wir auch nicht. Das hatten wir schon. Wisst ihr was? Wir suchen"}, {"id": 793, "start": 5186.82, "end": 5190.94, "text": "uns einfach nach Battlefield Top-Plays bei dem auf dem Channel. Wisst ihr, das ist auch"}, {"id": 794, "start": 5190.94, "end": 5195.26, "text": "so ein Ding, was mich an YouTube nervt, dass man nicht gescheit Videos sortieren kann."}, {"id": 795, "start": 5195.26, "end": 5202.74, "text": "Warum kann ich die Videos hier nicht nach Alter sortieren jetzt? Das ist doch voll"}, {"id": 796, "start": 5202.74, "end": 5217.82, "text": "Scheiße. Was ist das? Die Suche ist doch nicht zu gebrauchen. Vor drei Tagen das da. Ah."}, {"id": 797, "start": 5217.82, "end": 5222.9, "text": "Exzellent. Guck mal, eine Runde Battlefield 3. In der App kannst du nicht mal Channel"}, {"id": 798, "start": 5222.9, "end": 5227.78, "text": "suchen. Ja, das ist so fail. Und, und auch das hier mit den Comments, ich hab's jetzt"}, {"id": 799, "start": 5227.78, "end": 5235.42, "text": "wieder gesehen. Ja, ne, ne, ne, ne, ne. Das bringt ja nix. Na klar kannst du hier sortieren,"}, {"id": 800, "start": 5235.42, "end": 5239.18, "text": "aber das bringt ja nix. Mal angenommen, ich will nach Top-Plays suchen und dann die Ergebnisse"}, {"id": 801, "start": 5239.18, "end": 5244.94, "text": "sortieren. Das ist ja grad das, ne? Also ich will, ich will Top-Plays suchen und dann"}, {"id": 802, "start": 5244.94, "end": 5248.58, "text": "nach Ergebnissen sortieren. Warum geht das nicht? Das ist so fail. Mich hat's übrigens"}, {"id": 803, "start": 5248.58, "end": 5252.34, "text": "letztens wieder, also vorgestern wieder genervt. Ich hab ja tatsächlich, wer's noch nicht"}, {"id": 804, "start": 5252.34, "end": 5258.54, "text": "mitbekommen hat. Ich hab's ja tatsächlich geschafft, auf YouTube mal ein Video zu machen,"}, {"id": 805, "start": 5258.54, "end": 5264.42, "text": "was jetzt vielleicht nicht das allerbeliebteste Thema war, geb ich zu, ja. Aber, okay. Und"}, {"id": 806, "start": 5264.42, "end": 5271.02, "text": "da hat's mich mal wieder genervt, dass man nicht ordentlich Comments suchen kann. Also"}, {"id": 807, "start": 5271.02, "end": 5275.74, "text": "zumindest nicht hier drinnen. Man kann über das Studio ein bisschen besser suchen, aber"}, {"id": 808, "start": 5275.74, "end": 5281.1, "text": "finden tut mir auch nix. Und zwar, ich wollte, also ich wollte einem antworten in den Kommentaren,"}, {"id": 809, "start": 5281.1, "end": 5286.26, "text": "ob er sich nen Gaming-Monitor oder nen Fernseher holen soll. So. Und hab gesagt, wo ist das"}, {"id": 810, "start": 5286.26, "end": 5291.18, "text": "denn? Und das einzige, was mir eingefallen ist, das zu machen, ist das hier. Ich lade"}, {"id": 811, "start": 5291.18, "end": 5296.74, "text": "einfach alle Comments und dann mach ich Steuerung F in der Seite. Muss ich mal vorstellen, wie"}, {"id": 812, "start": 5296.74, "end": 5305.9, "text": "hängen geblieben das ist, dass es da keine andere Möglichkeit gibt. Ich mein, wer hat"}, {"id": 813, "start": 5305.9, "end": 5310.54, "text": "sich das ausgedacht? Das mag gut funktionieren für Channels, die fünf Kommentare bekommen,"}, {"id": 814, "start": 5310.54, "end": 5317.46, "text": "aber ich bekomm ja glücklicherweise noch ein bisschen mehr. So. Genau, da wollte ich"}, {"id": 815, "start": 5317.46, "end": 5324.1, "text": "drauf antworten. Und ich hab es nicht, ich hab es nicht gefunden. So, und dann hab ich"}, {"id": 816, "start": 5324.1, "end": 5331.26, "text": "so gemacht, dann hab ich's gefunden, ja. Also, wenn ihr euch fragt, ob ihr für Gaming,"}, {"id": 817, "start": 5331.26, "end": 5335.02, "text": "Fernseher oder Monitor kauft, kauft euch unbedingt ein 144-Hertz-Monitor, alles andere Sackt."}, {"id": 818, "start": 5335.02, "end": 5344.34, "text": "Guck mal Battlefield an. Meine Antwort war, das ist ja, was ich gerade gesagt hab, dass"}, {"id": 819, "start": 5344.34, "end": 5353.98, "text": "man sich ein Monitor kaufen soll. Captain Peng, das könnte man machen, aber es ist"}, {"id": 820, "start": 5353.98, "end": 5359.62, "text": "armselig, dass es auf YouTube nicht standardmäßig geht. Ich mein, YouTube ist eine Plattform,"}, {"id": 821, "start": 5359.62, "end": 5367.58, "text": "wo es sich um Content und Interaktion mit den Zuschauern dreht. Auf Twitch ist zwar"}, {"id": 822, "start": 5367.58, "end": 5371.22, "text": "die Interaktion noch ein bisschen höher, okay, aber warum macht man es denn dann so"}, {"id": 823, "start": 5371.22, "end": 5378.94, "text": "schwer, das zu machen? So, wir gucken jetzt ein bisschen Battlefield. Exzellent. Bam,"}, {"id": 824, "start": 5378.94, "end": 5389.7, "text": "your ass revived. Also, das ist gestellt, oder? Das kann ich mir nicht, das muss gestellt"}, {"id": 825, "start": 5389.7, "end": 5401.82, "text": "sein. Das ist gestellt. Das glaub ich euch nicht. Nein, das glaub ich euch nicht. Also,"}, {"id": 826, "start": 5401.82, "end": 5431.26, "text": "das glaub ich nicht. Also, da musste ja schon komplett Gehirntod sein. Ja. By the way,"}, {"id": 827, "start": 5431.26, "end": 5446.22, "text": "kam CSGO nicht ein Jahr später raus? Kam CSGO nicht 2012? Ja. Und was man daran sieht ist,"}, {"id": 828, "start": 5446.22, "end": 5456.06, "text": "die gut und langen Game leben kann mit ordentlichem Support. Aber da hatten wir ja keinen Bock"}, {"id": 829, "start": 5456.06, "end": 5465.06, "text": "drauf. Und Battlefield 3 hätte auf jeden Fall das Potenzial gehabt. Die hätten aus Battlefield"}, {"id": 830, "start": 5465.06, "end": 5469.66, "text": "3 ein Service-Game machen sollen. Ich hätte nicht gedacht, dass ich das mal sage. Battlefield"}, {"id": 831, "start": 5469.66, "end": 5473.74, "text": "3 wäre das Game gewesen. Vielleicht auch 4, okay. Aber man hätte ehrlich gesagt Battlefield"}, {"id": 832, "start": 5473.74, "end": 5480.1, "text": "3 nach und nach als Service-Game Richtung Battlefield 4 entwickeln können. Und man"}, {"id": 833, "start": 5480.1, "end": 5485.62, "text": "hätte glaube ich so ziemlich das beste Battlefield-Game ever damit erstellen können."}, {"id": 834, "start": 5485.62, "end": 5493.38, "text": "Was ist das überhaupt für eine Waffe? Ich wusste gar nicht, dass die überhaupt existiert."}, {"id": 835, "start": 5493.38, "end": 5501.7, "text": "Das ist irgendwie eine DLC-Waffe, oder?"}, {"id": 836, "start": 5501.7, "end": 5522.58, "text": "Der wollte aber den da treffen, ne? Dann hab ich die Waffe nie gespielt. Oh, oh, oh."}, {"id": 837, "start": 5522.58, "end": 5540.38, "text": "Das ist ja nice. Der ist ja nice hier. Bam. Oh, oh, oh. Das sind so Dinger. Das ist das,"}, {"id": 838, "start": 5540.38, "end": 5545.54, "text": "was Battlefield geil macht. Dass das nicht gescriptete Sachen sind, die ganz normal"}, {"id": 839, "start": 5545.54, "end": 5567.98, "text": "immer wieder in-game vorkommen. Und ich glaube, das ist das, was sie nicht verstehen. Bam."}, {"id": 840, "start": 5567.98, "end": 5586.22, "text": "Okay, der zielt wenigstens drauf. Der glaubt zwar selbst nicht, dass er trifft, aber es"}, {"id": 841, "start": 5586.22, "end": 5595.98, "text": "war wenigstens kein sinnloser Random-Shot. Er zielt zumindest drauf, ja. Das Game ist"}, {"id": 842, "start": 5595.98, "end": 5606.42, "text": "so alt. Warum brauchen die hier 50 Milliarden Overlays drüber? Das ist die Map mit dem"}, {"id": 843, "start": 5606.42, "end": 5614.94, "text": "AC-130, oder? Das ist die Map mit dem Gunship. Die war richtig fail. Oh, der war cool. Der"}, {"id": 844, "start": 5614.94, "end": 5635.18, "text": "war cool. Wie er direkt rüberfliegt über die Artillerie, oder was? Und bam. Oder auch"}, {"id": 845, "start": 5635.18, "end": 5642.78, "text": "nicht. Nice. Einfach ein Panzer gehittet across the map. Stimmt, ja, ja. Es gibt noch die"}, {"id": 846, "start": 5642.78, "end": 5650.26, "text": "Nachtmap. Die Nachtmap gibt es noch mit AC-130. Die Map, die wir eben gesehen haben. Diese"}, {"id": 847, "start": 5650.26, "end": 5658.46, "text": "Schneemap. Diese langgezogene Schneemap, wo ich keine Ahnung habe, wie die heißt. Und"}, {"id": 848, "start": 5658.46, "end": 5674.46, "text": "die andere fällt mir gar nicht auf. Wow. Auch mehr Glück als verstanden. Armored Shield."}, {"id": 849, "start": 5674.46, "end": 5685.74, "text": "Ja, ja, genau das kann sein. Die Panzermap war das, wo... Okay, wir springen einfach"}, {"id": 850, "start": 5685.74, "end": 5689.26, "text": "mal in die Richtung und hoffen, dass wir... Okay, das war Glück. Das war pures Glück."}, {"id": 851, "start": 5689.26, "end": 5695.58, "text": "Ich finde es übrigens ganz gut, wenn er nicht drüber labert. Da kann ich nämlich einfach"}, {"id": 852, "start": 5695.58, "end": 5702.66, "text": "zu labern. Okay, der aimt wenigstens Richtung Heli, oder was? Was ist das überhaupt? Ein"}, {"id": 853, "start": 5702.66, "end": 5711.98, "text": "Heli? Ein Jet? Ich glaube Heli, oder? Der Qualmeister. Das ist aber ein Jet. Schreckt."}, {"id": 854, "start": 5711.98, "end": 5727.98, "text": "Ja, ja. David, der Beste. C4 Action in Bad Company 2 war auch nice. Gerade C4 kannst"}, {"id": 855, "start": 5727.98, "end": 5731.74, "text": "du in Bad Company 2 als Sniper irgendwie drei Kilometer weit werfen."}, {"id": 856, "start": 5731.74, "end": 5761.7, "text": "Bam. Nice. Genau das ist das Geile an Battlefield, dass solche Dinger eben, wie ich gerade vor"}, {"id": 857, "start": 5761.7, "end": 5768.66, "text": "hin schon gesagt habe, unscriptet random passieren. Und das ist, glaube ich, wo ich denke, das"}, {"id": 858, "start": 5768.66, "end": 5777.26, "text": "haben sie nicht so genau verstanden. Man hat es schon in Battlefield 4 gesehen, wo"}, {"id": 859, "start": 5777.26, "end": 5782.66, "text": "ihn eigentlich eingeleuchtet ist. Wo sie dann angefangen haben mit Only in Battlefield"}, {"id": 860, "start": 5782.66, "end": 5789.54, "text": "Moment. Wo sie dann versucht haben, das zu bewerben, aber es dort dann nicht mehr so"}, {"id": 861, "start": 5789.54, "end": 5794.22, "text": "gut hinbekommen haben. Wo sie es dann krampfhaft probiert haben, so nach dem Motto, wir wollen"}, {"id": 862, "start": 5794.22, "end": 5800.62, "text": "nicht, dass es zufällig entsteht, sondern wir wollen, dass es quasi immer wieder quasi"}, {"id": 863, "start": 5800.62, "end": 5804.46, "text": "zufällig entsteht. Ja, sowas wie Revolution Geschichten, die sie eingeführt haben und"}, {"id": 864, "start": 5804.46, "end": 5811.78, "text": "sowas. Das war schon zu gewollt irgendwo. Aber Battlefield 4 haben sie immer noch gut"}, {"id": 865, "start": 5811.78, "end": 5817.34, "text": "gemacht. Was sie, glaube ich, bis heute nicht so genau kapiert haben, dass das eigentlich"}, {"id": 866, "start": 5817.34, "end": 5828.46, "text": "die Sache ist, die Battlefield mit ausgemacht hat. Bam! Und jetzt noch in Chat rein, ne,"}, {"id": 867, "start": 5828.46, "end": 5848.06, "text": "okay. Zack! Was ist mit dem, sag mal, will sich der Heliman mal bewegen? Der Heliman,"}, {"id": 868, "start": 5848.06, "end": 5853.34, "text": "sag mal, haben die sich vorher abgesprochen? War das Absicht? Was ist mit dem Heliman"}, {"id": 869, "start": 5853.34, "end": 5875.42, "text": "los? Wow! Alter, war das halbe Team? War das das ganze Team mit dem Haus? Ah, Firestorm."}, {"id": 870, "start": 5875.42, "end": 5903.18, "text": "Schreckt. Schuuh! Äh. Äh. Wisst ihr..."}, {"id": 871, "start": 5903.18, "end": 5910.74, "text": "Nice, nice. Und jetzt noch in Chat rein. Das sind das, ich finde das die geilsten Clips,"}, {"id": 872, "start": 5910.74, "end": 5915.86, "text": "die geilsten Clips sind immer wenn sie wieder in Chat reinhüpfen, nachdem sie einen feindlichen"}, {"id": 873, "start": 5915.86, "end": 5921.58, "text": "Heli oder ein Jet gesmort haben. Übrigens, ähm, wisst ihr wie sich das auf den Controller"}, {"id": 874, "start": 5921.58, "end": 5925.38, "text": "angehört hat, wenn Leute gut Chat fliegen konnten? Alter, das ist mein Xbox-Controller,"}, {"id": 875, "start": 5925.38, "end": 5933.66, "text": "da ist er eingestaubt. Er sieht mir, wie oft ich die Xbox One verwendet hab. Wisst ihr"}, {"id": 876, "start": 5933.66, "end": 5936.94, "text": "wie sich das angehört hat, wenn Leute, die richtig gut Chat fliegen konnten, in Battlefield"}, {"id": 877, "start": 5936.94, "end": 5946.3, "text": "3 Chat geflogen haben? Das hat sich so angehört. Das war der Boost, weil man genau, die Leute"}, {"id": 878, "start": 5946.3, "end": 5949.26, "text": "im Chat, die viel Chat geflogen haben, wissen es wahrscheinlich jetzt, ich weiß es nämlich"}, {"id": 879, "start": 5949.26, "end": 5953.66, "text": "aus dem Kopf nicht mehr. Ich glaube man musste genau 300 kmh oder sowas haben für den engsten"}, {"id": 880, "start": 5953.66, "end": 5960.46, "text": "Turnradius in Battlefield 3. Deswegen haben die alle permanent oder 312, ja ich wusste"}, {"id": 881, "start": 5960.46, "end": 5969.26, "text": "in der Chat, weißt du was? Und die haben alle immer so gespielt, dass man genau 312, 313"}, {"id": 882, "start": 5969.26, "end": 5979.02, "text": "hatte. Ich halte das genau 2 Minuten aus, dann tun mir die Finger weh, aber die Chat"}, {"id": 883, "start": 5979.02, "end": 5993.98, "text": "Pros in Battlefield 3, die haben das drauf. Dafür habe ich Lucio mit Mauswheel gespielt."}, {"id": 884, "start": 5993.98, "end": 6014.02, "text": "Wer fliegt denn mit Gamepads, der Konsolenspieler? Und auf dem PC auch teilweise. Ah, Co-Comrades."}, {"id": 885, "start": 6014.02, "end": 6031.3, "text": "Ich finde es immer geil, wenn sie rausspringen. Oh, das war nice. Zerstören, wieder reinspringen."}, {"id": 886, "start": 6031.3, "end": 6052.1, "text": "What? 360, wo ist der 360? Auf, auf. Ok, das ist, ist das Console Graphics? Ist das"}, {"id": 887, "start": 6052.1, "end": 6067.26, "text": "Console Graphics oder jemand mit richtig beschissener Auflösung auf dem PC? Haha, Swat, das fordert"}, {"id": 888, "start": 6067.26, "end": 6077.26, "text": "mich nicht. Man konnte aber auch den Controller relativ schnell schrotten, wenn man die Buttons"}, {"id": 889, "start": 6077.26, "end": 6093.74, "text": "zu sehr, zu brutal verwendet hat. Bam, zack, der war nice. Voll durchs Cockpit durch."}, {"id": 890, "start": 6093.74, "end": 6110.82, "text": "Nice. Nice."}, {"id": 891, "start": 6110.82, "end": 6133.18, "text": "Das wird der Console Graphics. Wenn ich mir überlege, ich habe ja damals viel auf der"}, {"id": 892, "start": 6133.18, "end": 6137.78, "text": "Xbox 360 gespielt, ne? Und ich habe mir dann auch Battlefield 3 auf dem PC gekauft später"}, {"id": 893, "start": 6137.78, "end": 6152.26, "text": "und so was. Und könnt ihr euch das vorstellen, dass ich damals dachte, dass der Unterschied"}, {"id": 894, "start": 6152.26, "end": 6161.86, "text": "zwischen Xbox 360 und PC ja gar nicht so groß ist? Aber es ist nachvollziehbar, weil wenn"}, {"id": 895, "start": 6161.86, "end": 6169.02, "text": "du von der Xbox 360 auf den PC wechselst, dann sieht es ja einfach nur schärfer und"}, {"id": 896, "start": 6169.02, "end": 6173.46, "text": "besser aus. Dann fällt dir das gar nicht so auf, wie schlecht das eigentlich ausgeschaut"}, {"id": 897, "start": 6173.46, "end": 6178.18, "text": "hat. Wenn du allerdings jetzt vom PC auf die 360 wechselst, dann wirst du feststellen,"}, {"id": 898, "start": 6178.18, "end": 6183.14, "text": "dass das wie Augenkrebs aussieht. Ich habe, ich habe dann, wie gesagt, ich habe ja, ich"}, {"id": 899, "start": 6183.14, "end": 6187.5, "text": "habe ja sau viel 360 gespielt und dann habe ich mir noch einen PC gekauft, dann habe ich"}, {"id": 900, "start": 6187.5, "end": 6194.14, "text": "fast nur noch PC gespielt und ich habe gedacht, das ist kein großer Unterschied. Und irgendwann"}, {"id": 901, "start": 6194.14, "end": 6197.1, "text": "ein paar Monate später habe ich damit 360 wieder angemacht und festgestellt, Alter,"}, {"id": 902, "start": 6197.1, "end": 6215.26, "text": "sieht das kacke aus. Zack. Ach, den FPS-Unterschied, den hat man, finde ich, gar nicht so extrem"}, {"id": 903, "start": 6215.26, "end": 6218.9, "text": "gemerkt, dadurch, dass man es mit dem Controller gespielt hat. Na klar, ich meine, man hat"}, {"id": 904, "start": 6218.9, "end": 6222.74, "text": "schon gemerkt, dass es teilweise richtige Slowdowns und sonst was gab, aber gerade was"}, {"id": 905, "start": 6222.74, "end": 6231.54, "text": "das, was das Movement und so angeht, der Unterschied zwischen, hättest du das mit Maus gespielt"}, {"id": 906, "start": 6231.54, "end": 6236.1, "text": "an der Xbox 360, daher hättest du es mehr unspielbar gewesen. Aber mit dem Controller"}, {"id": 907, "start": 6236.1, "end": 6238.82, "text": "und zumal ich den Controller ja auch relativ langsam eingestellt habe, dass man besser"}, {"id": 908, "start": 6238.82, "end": 6245.42, "text": "trifft, ging es eigentlich. Ich meine, man hat halt fünf Minuten gebraucht, so hier einmal"}, {"id": 909, "start": 6245.42, "end": 6271.42, "text": "der Maus so macht, hat man halt mit dem Controller irgendwie so gemacht. Habt ihr es gehört?"}, {"id": 910, "start": 6271.42, "end": 6286.94, "text": "Vielleicht springt man mir aus einem Chat raus und was das für ein Spaß, Alter. Was"}, {"id": 911, "start": 6286.94, "end": 6309.26, "text": "ist mit dem Typ los? Ah, Nose-Hair-Cannons. Hahaha, AFK-Leute wieder. Ja und warum sind"}, {"id": 912, "start": 6309.26, "end": 6325.42, "text": "die immer alle AFK? Die sind wirklich blind. Die gucken sich die schöne Wolkensimulation"}, {"id": 913, "start": 6325.42, "end": 6339.62, "text": "an, ja. Boah, der hat aber seinen Bass übelst hochgestellt. Guck euch mal den Bass an. Voller"}, {"id": 914, "start": 6339.62, "end": 6350.38, "text": "Spaß. Alter, was hat der mit dem Saal? Boah, Console-Grafics. Boah, Alter. Ihhh. Oh Gott,"}, {"id": 915, "start": 6350.38, "end": 6365.54, "text": "sieht das hässlich aus. Das ist 360, Alter. Sieht das hässlich aus. Guckt euch das mal"}, {"id": 916, "start": 6365.54, "end": 6394.74, "text": "an. Boah, sieht das hässlich aus. Alter. Hahaha. Das hab ich ja noch nie gesehen,"}, {"id": 917, "start": 6394.74, "end": 6409.18, "text": "Alter, was? Das ist ja geil. Einfach durchgezogen mit dem Defi hier. Boah, ja mach noch lauter,"}, {"id": 918, "start": 6409.18, "end": 6426.62, "text": "gut an der stelle an der stelle ist es ja echt gar kunst"}, {"id": 919, "start": 6426.62, "end": 6427.62, "text": "aber nice play"}, {"id": 920, "start": 6427.62, "end": 6433.62, "text": "richtig profi streamer mit webcam hier"}, {"id": 921, "start": 6433.62, "end": 6442.3, "text": "ja ja übrigens so du grad sagst hier bei der konsole sind manche textur nicht geladen"}, {"id": 922, "start": 6442.3, "end": 6445.78, "text": "ist auf dem pc auch so gewesen"}, {"id": 923, "start": 6445.78, "end": 6452.06, "text": "dass manche objekte nicht mehr geladen wurden wenn du die wenn du die settings auf low hattest"}, {"id": 924, "start": 6452.06, "end": 6457.98, "text": "zum beispiel im tunnel von dem event peak deswegen habe ich das auch nur mit low settings gespielt"}, {"id": 925, "start": 6457.98, "end": 6465.46, "text": "wenn man dem event peak im tunnel gestanden hat dann wurden die kisten nicht geladen und"}, {"id": 926, "start": 6465.46, "end": 6469.1, "text": "man konnte durch die kisten durchgucken und die gegner sehen man konnte die gegner glaube"}, {"id": 927, "start": 6469.1, "end": 6474.42, "text": "ich nicht beschießen ohne kisten durch die durch die nicht von da bin ich mir gar nicht"}, {"id": 928, "start": 6474.42, "end": 6479.62, "text": "sicher ob das ging aber du konntest die gegner sehen in dem event peak sehen relativ viele"}, {"id": 929, "start": 6479.62, "end": 6482.58, "text": "kisten am anfang des tunnels und wenn du die settings auf low hattest wurden die kisten"}, {"id": 930, "start": 6482.58, "end": 6490.54, "text": "nicht geladen hast alles gesehen easy"}, {"id": 931, "start": 6490.54, "end": 6492.1, "text": "hab ich battlefield 3 noch installiert"}, {"id": 932, "start": 6492.1, "end": 6497.74, "text": "das ist ein nicer stream hier mit der pistol"}, {"id": 933, "start": 6497.74, "end": 6500.5, "text": "ach nee erstmal shotgun"}, {"id": 934, "start": 6500.5, "end": 6501.66, "text": "was sonst metro shotgun"}, {"id": 935, "start": 6501.66, "end": 6506.9, "text": "poggers"}, {"id": 936, "start": 6506.9, "end": 6507.9, "text": "das war poggers"}, {"id": 937, "start": 6507.9, "end": 6508.9, "text": "BÄM"}, {"id": 938, "start": 6508.9, "end": 6513.94, "text": "zack das wär richtig geil gewesen hätte die noch erwischt"}, {"id": 939, "start": 6513.94, "end": 6520.86, "text": "mit der afk mörser typen"}, {"id": 940, "start": 6520.86, "end": 6532.78, "text": "die mörser dudes mitten auf der gas was ist denn mit denen los warum stellen die sich"}, {"id": 941, "start": 6532.78, "end": 6536.54, "text": "mitten auf die gas mit dem mörser soll sich da dahinter stellen ins haus hier nebestellen"}, {"id": 942, "start": 6536.54, "end": 6539.22, "text": "irgendwo hin aber dann mit auf die gas"}, {"id": 943, "start": 6539.22, "end": 6548.58, "text": "das schreiber man die gegner was ist mit euch los"}, {"id": 944, "start": 6548.58, "end": 6566.42, "text": "nee ins haus hab ich gesagt ins haus ans haus nicht ins haus"}, {"id": 945, "start": 6566.42, "end": 6570.5, "text": "er kann sich auch ins haus stellen mit dem mörser ja leider nicht so lang"}, {"id": 946, "start": 6570.5, "end": 6598.46, "text": "das ist"}, {"id": 947, "start": 6598.46, "end": 6599.46, "text": "oder ob es gestellt ist"}, {"id": 948, "start": 6599.46, "end": 6607.62, "text": "nee wahrscheinlich ist einfach gestellt"}, {"id": 949, "start": 6607.62, "end": 6627.06, "text": "der typ ist so oft hier dabei mit der webcam das gefühlt in jedem top play dabei"}, {"id": 950, "start": 6627.06, "end": 6631.26, "text": "das ist der allseits wie der top fahrschnitt einfach so ne tupperdose drüber und dann"}, {"id": 951, "start": 6631.26, "end": 6632.26, "text": "drumherum abschneiden"}, {"id": 952, "start": 6632.26, "end": 6649.18, "text": "das sind bestimmt russische life hacks wieder am start"}, {"id": 953, "start": 6649.18, "end": 6652.46, "text": "der ist aber gut der typ der hat schon sau viel krasse clips gehabt"}, {"id": 954, "start": 6652.46, "end": 6675.58, "text": "blub"}, {"id": 955, "start": 6675.58, "end": 6676.58, "text": "blub"}, {"id": 956, "start": 6676.58, "end": 6692.02, "text": "der spielt aber bestimmt mit zwei drei leute noch zusammen"}, {"id": 957, "start": 6692.02, "end": 6704.14, "text": "hattest du damals eine hd79 kann sein ja ja kann sein damals hatte ich da amd grafikkade"}, {"id": 958, "start": 6704.14, "end": 6715.98, "text": "das war noch die zeit bevor nvidia gemeint hat wir geben dir grafikkarten umsonst"}, {"id": 959, "start": 6715.98, "end": 6735.46, "text": "schön weggesprayt am amkomm diffuse henne wollten die grad machen"}, {"id": 960, "start": 6735.46, "end": 6751.58, "text": "auf"}, {"id": 961, "start": 6751.58, "end": 6753.58, "text": "Ist doch nicht gekommen"}, {"id": 962, "start": 6760.76, "end": 6764.06, "text": "Bäm Bäm Bäm Bäm Bäm Bäm Jawoll Rex Beste"}, {"id": 963, "start": 6767.42, "end": 6773.58, "text": "Wie er die Waffen des Kitt geswitcht hat. Habt ihr gesehen wie er das Kitt geswitcht hat. Richtiger Pro-Move"}, {"id": 964, "start": 6773.58, "end": 6779.58, "text": "Richtiger Pro-Move"}, {"id": 965, "start": 6779.58, "end": 6785.58, "text": "Richtiger Pro-Move"}, {"id": 966, "start": 6785.58, "end": 6793.58, "text": "Richtiger Pro-Move"}, {"id": 967, "start": 6805.98, "end": 6807.98, "text": "Oh mein Gott"}, {"id": 968, "start": 6809.5, "end": 6811.5, "text": "Komm rein"}, {"id": 969, "start": 6811.5, "end": 6819.5, "text": "Richtiger Pro-Move"}, {"id": 970, "start": 6819.5, "end": 6827.5, "text": "Richtiger Pro-Move"}, {"id": 971, "start": 6827.5, "end": 6843.5, "text": "Oh mein Gott"}, {"id": 972, "start": 6857.5, "end": 6865.5, "text": "Richtiger Pro-Move"}, {"id": 973, "start": 6865.5, "end": 6875.5, "text": "Richtiger Pro-Move"}, {"id": 974, "start": 6875.5, "end": 6885.5, "text": "Richtiger Pro-Move"}, {"id": 975, "start": 6885.5, "end": 6895.5, "text": "Richtiger Pro-Move"}, {"id": 976, "start": 6895.5, "end": 6917.5, "text": "Richtiger Pro-Move"}, {"id": 977, "start": 6925.5, "end": 6935.5, "text": "Richtiger Pro-Move"}, {"id": 978, "start": 6935.5, "end": 6945.5, "text": "Richtiger Pro-Move"}, {"id": 979, "start": 6965.5, "end": 6975.5, "text": "Richtiger Pro-Move"}, {"id": 980, "start": 6995.5, "end": 7005.5, "text": "Richtiger Pro-Move"}, {"id": 981, "start": 7005.5, "end": 7015.5, "text": "Richtiger Pro-Move"}, {"id": 982, "start": 7015.5, "end": 7025.5, "text": "Richtiger Pro-Move"}, {"id": 983, "start": 7025.5, "end": 7035.5, "text": "Richtiger Pro-Move"}, {"id": 984, "start": 7035.5, "end": 7045.5, "text": "Richtiger Pro-Move"}, {"id": 985, "start": 7045.5, "end": 7055.5, "text": "Richtiger Pro-Move"}, {"id": 986, "start": 7055.5, "end": 7065.5, "text": "Richtiger Pro-Move"}, {"id": 987, "start": 7065.5, "end": 7075.5, "text": "Richtiger Pro-Move"}, {"id": 988, "start": 7095.5, "end": 7105.5, "text": "Richtiger Pro-Move"}, {"id": 989, "start": 7105.5, "end": 7115.5, "text": "Richtiger Pro-Move"}, {"id": 990, "start": 7115.5, "end": 7125.5, "text": "Richtiger Pro-Move"}, {"id": 991, "start": 7125.5, "end": 7135.5, "text": "Richtiger Pro-Move"}, {"id": 992, "start": 7155.5, "end": 7165.5, "text": "Richtiger Pro-Move"}, {"id": 993, "start": 7165.5, "end": 7175.5, "text": "Richtiger Pro-Move"}, {"id": 994, "start": 7175.5, "end": 7185.5, "text": "Richtiger Pro-Move"}, {"id": 995, "start": 7185.5, "end": 7195.5, "text": "Richtiger Pro-Move"}, {"id": 996, "start": 7195.5, "end": 7205.5, "text": "Richtiger Pro-Move"}, {"id": 997, "start": 7205.5, "end": 7215.5, "text": "Richtiger Pro-Move"}, {"id": 998, "start": 7235.5, "end": 7245.5, "text": "Richtiger Pro-Move"}, {"id": 999, "start": 7245.5, "end": 7255.5, "text": "Richtiger Pro-Move"}, {"id": 1000, "start": 7255.5, "end": 7265.5, "text": "Richtiger Pro-Move"}, {"id": 1001, "start": 7285.5, "end": 7295.5, "text": "Richtiger Pro-Move"}, {"id": 1002, "start": 7295.5, "end": 7305.5, "text": "Richtiger Pro-Move"}, {"id": 1003, "start": 7325.5, "end": 7335.5, "text": "Richtiger Pro-Move"}, {"id": 1004, "start": 7335.5, "end": 7345.5, "text": "Richtiger Pro-Move"}, {"id": 1005, "start": 7345.5, "end": 7355.5, "text": "Richtiger Pro-Move"}, {"id": 1006, "start": 7355.5, "end": 7365.5, "text": "Richtiger Pro-Move"}, {"id": 1007, "start": 7385.5, "end": 7395.5, "text": "Richtiger Pro-Move"}, {"id": 1008, "start": 7395.5, "end": 7405.5, "text": "Richtiger Pro-Move"}, {"id": 1009, "start": 7425.5, "end": 7435.5, "text": "Richtiger Pro-Move"}, {"id": 1010, "start": 7435.5, "end": 7445.5, "text": "Richtiger Pro-Move"}, {"id": 1011, "start": 7465.5, "end": 7475.5, "text": "Richtiger Pro-Move"}, {"id": 1012, "start": 7495.5, "end": 7505.5, "text": "Richtiger Pro-Move"}, {"id": 1013, "start": 7505.5, "end": 7515.5, "text": "Richtiger Pro-Move"}, {"id": 1014, "start": 7515.5, "end": 7525.5, "text": "Richtiger Pro-Move"}, {"id": 1015, "start": 7545.5, "end": 7555.5, "text": "Richtiger Pro-Move"}, {"id": 1016, "start": 7555.5, "end": 7565.5, "text": "Richtiger Pro-Move"}, {"id": 1017, "start": 7565.5, "end": 7575.5, "text": "Richtiger Pro-Move"}, {"id": 1018, "start": 7595.5, "end": 7605.5, "text": "Richtiger Pro-Move"}, {"id": 1019, "start": 7605.5, "end": 7615.5, "text": "Richtiger Pro-Move"}, {"id": 1020, "start": 7635.5, "end": 7645.5, "text": "Richtiger Pro-Move"}, {"id": 1021, "start": 7665.5, "end": 7675.5, "text": "Richtiger Pro-Move"}, {"id": 1022, "start": 7695.5, "end": 7705.5, "text": "Richtiger Pro-Move"}, {"id": 1023, "start": 7725.5, "end": 7735.5, "text": "Richtiger Pro-Move"}, {"id": 1024, "start": 7755.5, "end": 7765.5, "text": "Richtiger Pro-Move"}, {"id": 1025, "start": 7785.5, "end": 7795.5, "text": "Richtiger Pro-Move"}, {"id": 1026, "start": 7815.5, "end": 7825.5, "text": "Richtiger Pro-Move"}, {"id": 1027, "start": 7845.5, "end": 7855.5, "text": "Richtiger Pro-Move"}, {"id": 1028, "start": 7875.5, "end": 7885.5, "text": "Richtiger Pro-Move"}, {"id": 1029, "start": 7905.5, "end": 7915.5, "text": "Richtiger Pro-Move"}, {"id": 1030, "start": 7935.5, "end": 7945.5, "text": "Richtiger Pro-Move"}, {"id": 1031, "start": 7965.5, "end": 7975.5, "text": "Richtiger Pro-Move"}, {"id": 1032, "start": 7995.5, "end": 8005.5, "text": "Richtiger Pro-Move"}, {"id": 1033, "start": 8025.5, "end": 8035.5, "text": "Richtiger Pro-Move"}, {"id": 1034, "start": 8055.5, "end": 8065.5, "text": "Richtiger Pro-Move"}, {"id": 1035, "start": 8085.5, "end": 8095.5, "text": "Richtiger Pro-Move"}, {"id": 1036, "start": 8115.5, "end": 8125.5, "text": "Richtiger Pro-Move"}, {"id": 1037, "start": 8145.5, "end": 8155.5, "text": "Richtiger Pro-Move"}, {"id": 1038, "start": 8175.5, "end": 8185.5, "text": "Richtiger Pro-Move"}, {"id": 1039, "start": 8205.5, "end": 8215.5, "text": "Richtiger Pro-Move"}, {"id": 1040, "start": 8235.5, "end": 8245.5, "text": "Richtiger Pro-Move"}, {"id": 1041, "start": 8265.5, "end": 8275.5, "text": "Richtiger Pro-Move"}, {"id": 1042, "start": 8295.5, "end": 8305.5, "text": "Richtiger Pro-Move"}, {"id": 1043, "start": 8325.5, "end": 8335.5, "text": "Richtiger Pro-Move"}, {"id": 1044, "start": 8355.5, "end": 8365.5, "text": "Richtiger Pro-Move"}, {"id": 1045, "start": 8385.5, "end": 8395.5, "text": "Richtiger Pro-Move"}, {"id": 1046, "start": 8415.5, "end": 8425.5, "text": "Richtiger Pro-Move"}, {"id": 1047, "start": 8445.5, "end": 8455.5, "text": "Richtiger Pro-Move"}, {"id": 1048, "start": 8475.5, "end": 8485.5, "text": "Richtiger Pro-Move"}, {"id": 1049, "start": 8505.5, "end": 8515.5, "text": "Richtiger Pro-Move"}, {"id": 1050, "start": 8535.5, "end": 8545.5, "text": "Richtiger Pro-Move"}, {"id": 1051, "start": 8565.5, "end": 8575.5, "text": "Richtiger Pro-Move"}, {"id": 1052, "start": 8595.5, "end": 8605.5, "text": "Richtiger Pro-Move"}, {"id": 1053, "start": 8625.5, "end": 8635.5, "text": "Richtiger Pro-Move"}, {"id": 1054, "start": 8655.5, "end": 8665.5, "text": "Richtiger Pro-Move"}, {"id": 1055, "start": 8685.5, "end": 8695.5, "text": "Richtiger Pro-Move"}, {"id": 1056, "start": 8715.5, "end": 8725.5, "text": "Richtiger Pro-Move"}, {"id": 1057, "start": 8745.5, "end": 8755.5, "text": "Richtiger Pro-Move"}, {"id": 1058, "start": 8775.5, "end": 8785.5, "text": "Richtiger Pro-Move"}, {"id": 1059, "start": 8805.5, "end": 8815.5, "text": "Richtiger Pro-Move"}, {"id": 1060, "start": 8835.5, "end": 8845.5, "text": "Richtiger Pro-Move"}, {"id": 1061, "start": 8865.5, "end": 8875.5, "text": "Richtiger Pro-Move"}, {"id": 1062, "start": 8895.5, "end": 8905.5, "text": "Richtiger Pro-Move"}, {"id": 1063, "start": 8925.5, "end": 8935.5, "text": "Richtiger Pro-Move"}, {"id": 1064, "start": 8955.5, "end": 8965.5, "text": "Richtiger Pro-Move"}, {"id": 1065, "start": 8985.5, "end": 8995.5, "text": "Richtiger Pro-Move"}, {"id": 1066, "start": 9015.5, "end": 9025.5, "text": "Richtiger Pro-Move"}, {"id": 1067, "start": 9045.5, "end": 9055.5, "text": "Richtiger Pro-Move"}, {"id": 1068, "start": 9075.5, "end": 9085.5, "text": "Richtiger Pro-Move"}, {"id": 1069, "start": 9105.5, "end": 9115.5, "text": "Richtiger Pro-Move"}, {"id": 1070, "start": 9135.5, "end": 9145.5, "text": "Richtiger Pro-Move"}, {"id": 1071, "start": 9165.5, "end": 9175.5, "text": "Richtiger Pro-Move"}, {"id": 1072, "start": 9195.5, "end": 9205.5, "text": "Richtiger Pro-Move"}, {"id": 1073, "start": 9225.5, "end": 9235.5, "text": "Richtiger Pro-Move"}, {"id": 1074, "start": 9255.5, "end": 9265.5, "text": "Richtiger Pro-Move"}, {"id": 1075, "start": 9285.5, "end": 9295.5, "text": "Richtiger Pro-Move"}, {"id": 1076, "start": 9315.5, "end": 9325.5, "text": "Richtiger Pro-Move"}, {"id": 1077, "start": 9345.5, "end": 9355.5, "text": "Richtiger Pro-Move"}, {"id": 1078, "start": 9375.5, "end": 9385.5, "text": "Richtiger Pro-Move"}, {"id": 1079, "start": 9405.5, "end": 9415.5, "text": "Richtiger Pro-Move"}, {"id": 1080, "start": 9435.5, "end": 9445.5, "text": "Richtiger Pro-Move"}, {"id": 1081, "start": 9465.5, "end": 9475.5, "text": "Richtiger Pro-Move"}, {"id": 1082, "start": 9495.5, "end": 9505.5, "text": "Richtiger Pro-Move"}, {"id": 1083, "start": 9525.5, "end": 9535.5, "text": "Richtiger Pro-Move"}, {"id": 1084, "start": 9555.5, "end": 9565.5, "text": "Richtiger Pro-Move"}, {"id": 1085, "start": 9585.5, "end": 9595.5, "text": "Richtiger Pro-Move"}, {"id": 1086, "start": 9615.5, "end": 9625.5, "text": "Richtiger Pro-Move"}, {"id": 1087, "start": 9645.5, "end": 9655.5, "text": "Richtiger Pro-Move"}, {"id": 1088, "start": 9675.5, "end": 9685.5, "text": "Richtiger Pro-Move"}, {"id": 1089, "start": 9705.5, "end": 9715.5, "text": "Richtiger Pro-Move"}, {"id": 1090, "start": 9735.5, "end": 9745.5, "text": "Richtiger Pro-Move"}, {"id": 1091, "start": 9765.5, "end": 9775.5, "text": "Richtiger Pro-Move"}, {"id": 1092, "start": 9795.5, "end": 9805.5, "text": "Richtiger Pro-Move"}, {"id": 1093, "start": 9825.5, "end": 9835.5, "text": "Richtiger Pro-Move"}, {"id": 1094, "start": 9855.5, "end": 9865.5, "text": "Richtiger Pro-Move"}, {"id": 1095, "start": 9885.5, "end": 9895.5, "text": "Richtiger Pro-Move"}, {"id": 1096, "start": 9915.5, "end": 9925.5, "text": "Richtiger Pro-Move"}, {"id": 1097, "start": 9945.5, "end": 9955.5, "text": "Richtiger Pro-Move"}, {"id": 1098, "start": 9975.5, "end": 9985.5, "text": "Richtiger Pro-Move"}, {"id": 1099, "start": 9985.5, "end": 10005.5, "text": "Richtiger Pro-Move"}, {"id": 1100, "start": 10005.5, "end": 10015.5, "text": "Richtiger Pro-Move"}, {"id": 1101, "start": 10015.5, "end": 10035.5, "text": "Richtiger Pro-Move"}, {"id": 1102, "start": 10035.5, "end": 10045.5, "text": "Richtiger Pro-Move"}, {"id": 1103, "start": 10065.5, "end": 10075.5, "text": "Richtiger Pro-Move"}, {"id": 1104, "start": 10075.5, "end": 10095.5, "text": "Richtiger Pro-Move"}, {"id": 1105, "start": 10095.5, "end": 10105.5, "text": "Richtiger Pro-Move"}, {"id": 1106, "start": 10105.5, "end": 10125.5, "text": "Richtiger Pro-Move"}, {"id": 1107, "start": 10125.5, "end": 10135.5, "text": "Richtiger Pro-Move"}, {"id": 1108, "start": 10135.5, "end": 10155.5, "text": "Richtiger Pro-Move"}, {"id": 1109, "start": 10155.5, "end": 10165.5, "text": "Richtiger Pro-Move"}, {"id": 1110, "start": 10185.5, "end": 10195.5, "text": "Richtiger Pro-Move"}, {"id": 1111, "start": 10195.5, "end": 10205.5, "text": "Richtiger Pro-Move"}, {"id": 1112, "start": 10205.5, "end": 10215.5, "text": "Richtiger Pro-Move"}, {"id": 1113, "start": 10215.5, "end": 10235.5, "text": "Richtiger Pro-Move"}, {"id": 1114, "start": 10235.5, "end": 10245.5, "text": "Richtiger Pro-Move"}, {"id": 1115, "start": 10245.5, "end": 10265.5, "text": "Richtiger Pro-Move"}, {"id": 1116, "start": 10265.5, "end": 10275.5, "text": "Richtiger Pro-Move"}, {"id": 1117, "start": 10275.5, "end": 10295.5, "text": "Richtiger Pro-Move"}, {"id": 1118, "start": 10295.5, "end": 10305.5, "text": "Richtiger Pro-Move"}, {"id": 1119, "start": 10305.5, "end": 10325.5, "text": "Richtiger Pro-Move"}, {"id": 1120, "start": 10325.5, "end": 10335.5, "text": "Richtiger Pro-Move"}, {"id": 1121, "start": 10355.5, "end": 10365.5, "text": "Richtiger Pro-Move"}, {"id": 1122, "start": 10365.5, "end": 10389.5, "text": "Richtiger Pro-Move"}, {"id": 1123, "start": 10389.5, "end": 10409.5, "text": "Richtiger Pro-Move"}, {"id": 1124, "start": 10409.5, "end": 10419.5, "text": "Richtiger Pro-Move"}, {"id": 1125, "start": 10419.5, "end": 10443.5, "text": "Richtiger Pro-Move"}, {"id": 1126, "start": 10443.5, "end": 10457.5, "text": "Richtiger Pro-Move"}, {"id": 1127, "start": 10457.5, "end": 10483.5, "text": "Richtiger Pro-Move"}, {"id": 1128, "start": 10483.5, "end": 10499.5, "text": "Richtiger Pro-Move"}, {"id": 1129, "start": 10499.5, "end": 10513.5, "text": "Richtiger Pro-Move"}, {"id": 1130, "start": 10513.5, "end": 10533.5, "text": "Richtiger Pro-Move"}, {"id": 1131, "start": 10533.5, "end": 10543.5, "text": "Richtiger Pro-Move"}, {"id": 1132, "start": 10563.5, "end": 10591.5, "text": "Richtiger Pro-Move"}, {"id": 1133, "start": 10591.5, "end": 10615.5, "text": "Richtiger Pro-Move"}, {"id": 1134, "start": 10615.5, "end": 10641.5, "text": "Richtiger Pro-Move"}, {"id": 1135, "start": 10641.5, "end": 10659.5, "text": "Richtiger Pro-Move"}, {"id": 1136, "start": 10659.5, "end": 10675.5, "text": "Richtiger Pro-Move"}, {"id": 1137, "start": 10675.5, "end": 10703.5, "text": "Richtiger Pro-Move"}, {"id": 1138, "start": 10703.5, "end": 10721.5, "text": "Richtiger Pro-Move"}, {"id": 1139, "start": 10721.5, "end": 10741.5, "text": "Richtiger Pro-Move"}, {"id": 1140, "start": 10741.5, "end": 10753.5, "text": "Richtiger Pro-Move"}, {"id": 1141, "start": 10753.5, "end": 10769.5, "text": "Richtiger Pro-Move"}, {"id": 1142, "start": 10769.5, "end": 10789.5, "text": "Richtiger Pro-Move"}, {"id": 1143, "start": 10789.5, "end": 10813.5, "text": "Richtiger Pro-Move"}, {"id": 1144, "start": 10813.5, "end": 10833.5, "text": "Richtiger Pro-Move"}, {"id": 1145, "start": 10833.5, "end": 10847.5, "text": "Richtiger Pro-Move"}, {"id": 1146, "start": 10847.5, "end": 10871.5, "text": "Richtiger Pro-Move"}, {"id": 1147, "start": 10871.5, "end": 10891.5, "text": "Richtiger Pro-Move"}, {"id": 1148, "start": 10891.5, "end": 10917.5, "text": "Richtiger Pro-Move"}, {"id": 1149, "start": 10917.5, "end": 10937.5, "text": "Richtiger Pro-Move"}, {"id": 1150, "start": 10937.5, "end": 10957.5, "text": "Richtiger Pro-Move"}, {"id": 1151, "start": 10957.5, "end": 10977.5, "text": "Richtiger Pro-Move"}, {"id": 1152, "start": 10977.5, "end": 10993.5, "text": "Richtiger Pro-Move"}, {"id": 1153, "start": 10993.5, "end": 10997.5, "text": "Richtiger Pro-Move"}, {"id": 1154, "start": 10997.5, "end": 11017.5, "text": "Richtiger Pro-Move"}, {"id": 1155, "start": 11017.5, "end": 11037.5, "text": "Richtiger Pro-Move"}, {"id": 1156, "start": 11037.5, "end": 11057.5, "text": "Richtiger Pro-Move"}, {"id": 1157, "start": 11057.5, "end": 11077.5, "text": "Richtiger Pro-Move"}, {"id": 1158, "start": 11077.5, "end": 11101.5, "text": "Richtiger Pro-Move"}, {"id": 1159, "start": 11101.5, "end": 11121.5, "text": "Richtiger Pro-Move"}, {"id": 1160, "start": 11121.5, "end": 11141.5, "text": "Richtiger Pro-Move"}, {"id": 1161, "start": 11141.5, "end": 11151.5, "text": "Richtiger Pro-Move"}, {"id": 1162, "start": 11151.5, "end": 11161.5, "text": "Richtiger Pro-Move"}, {"id": 1163, "start": 11161.5, "end": 11181.5, "text": "Richtiger Pro-Move"}, {"id": 1164, "start": 11181.5, "end": 11197.5, "text": "Richtiger Pro-Move"}, {"id": 1165, "start": 11197.5, "end": 11209.5, "text": "Richtiger Pro-Move"}, {"id": 1166, "start": 11209.5, "end": 11225.5, "text": "Richtiger Pro-Move"}, {"id": 1167, "start": 11225.5, "end": 11251.5, "text": "Richtiger Pro-Move"}, {"id": 1168, "start": 11251.5, "end": 11271.5, "text": "Richtiger Pro-Move"}, {"id": 1169, "start": 11271.5, "end": 11299.5, "text": "Richtiger Pro-Move"}, {"id": 1170, "start": 11299.5, "end": 11323.5, "text": "Richtiger Pro-Move"}, {"id": 1171, "start": 11323.5, "end": 11347.5, "text": "Richtiger Pro-Move"}, {"id": 1172, "start": 11347.5, "end": 11373.5, "text": "Richtiger Pro-Move"}, {"id": 1173, "start": 11373.5, "end": 11397.5, "text": "Richtiger Pro-Move"}, {"id": 1174, "start": 11397.5, "end": 11417.5, "text": "Richtiger Pro-Move"}, {"id": 1175, "start": 11417.5, "end": 11437.5, "text": "Richtiger Pro-Move"}, {"id": 1176, "start": 11437.5, "end": 11465.5, "text": "Richtiger Pro-Move"}, {"id": 1177, "start": 11465.5, "end": 11491.5, "text": "Richtiger Pro-Move"}, {"id": 1178, "start": 11491.5, "end": 11515.5, "text": "Richtiger Pro-Move"}, {"id": 1179, "start": 11515.5, "end": 11543.5, "text": "Richtiger Pro-Move"}, {"id": 1180, "start": 11543.5, "end": 11559.5, "text": "Richtiger Pro-Move"}, {"id": 1181, "start": 11559.5, "end": 11571.5, "text": "Richtiger Pro-Move"}, {"id": 1182, "start": 11571.5, "end": 11591.5, "text": "Richtiger Pro-Move"}, {"id": 1183, "start": 11591.5, "end": 11611.5, "text": "Richtiger Pro-Move"}, {"id": 1184, "start": 11611.5, "end": 11631.5, "text": "Richtiger Pro-Move"}, {"id": 1185, "start": 11631.5, "end": 11651.5, "text": "Richtiger Pro-Move"}, {"id": 1186, "start": 11651.5, "end": 11679.5, "text": "Richtiger Pro-Move"}, {"id": 1187, "start": 11679.5, "end": 11699.5, "text": "Richtiger Pro-Move"}, {"id": 1188, "start": 11699.5, "end": 11719.5, "text": "Richtiger Pro-Move"}, {"id": 1189, "start": 11719.5, "end": 11743.5, "text": "Richtiger Pro-Move"}, {"id": 1190, "start": 11743.5, "end": 11769.5, "text": "Richtiger Pro-Move"}, {"id": 1191, "start": 11769.5, "end": 11789.5, "text": "Richtiger Pro-Move"}, {"id": 1192, "start": 11789.5, "end": 11805.5, "text": "Richtiger Pro-Move"}, {"id": 1193, "start": 11805.5, "end": 11819.5, "text": "Richtiger Pro-Move"}, {"id": 1194, "start": 11819.5, "end": 11839.5, "text": "Richtiger Pro-Move"}, {"id": 1195, "start": 11839.5, "end": 11859.5, "text": "Richtiger Pro-Move"}, {"id": 1196, "start": 11859.5, "end": 11875.5, "text": "Richtiger Pro-Move"}, {"id": 1197, "start": 11875.5, "end": 11895.5, "text": "Richtiger Pro-Move"}, {"id": 1198, "start": 11895.5, "end": 11915.5, "text": "Richtiger Pro-Move"}, {"id": 1199, "start": 11915.5, "end": 11939.5, "text": "Richtiger Pro-Move"}, {"id": 1200, "start": 11939.5, "end": 11959.5, "text": "Richtiger Pro-Move"}, {"id": 1201, "start": 11959.5, "end": 11983.5, "text": "Richtiger Pro-Move"}, {"id": 1202, "start": 11983.5, "end": 12003.5, "text": "Richtiger Pro-Move"}, {"id": 1203, "start": 12003.5, "end": 12017.5, "text": "Richtiger Pro-Move"}, {"id": 1204, "start": 12017.5, "end": 12043.5, "text": "Richtiger Pro-Move"}, {"id": 1205, "start": 12043.5, "end": 12059.5, "text": "Richtiger Pro-Move"}, {"id": 1206, "start": 12059.5, "end": 12071.5, "text": "Richtiger Pro-Move"}, {"id": 1207, "start": 12071.5, "end": 12083.5, "text": "Richtiger Pro-Move"}, {"id": 1208, "start": 12083.5, "end": 12099.5, "text": "Richtiger Pro-Move"}, {"id": 1209, "start": 12099.5, "end": 12123.5, "text": "Richtiger Pro-Move"}, {"id": 1210, "start": 12123.5, "end": 12137.5, "text": "Richtiger Pro-Move"}, {"id": 1211, "start": 12137.5, "end": 12157.5, "text": "Richtiger Pro-Move"}, {"id": 1212, "start": 12157.5, "end": 12167.5, "text": "Richtiger Pro-Move"}, {"id": 1213, "start": 12167.5, "end": 12177.5, "text": "Richtiger Pro-Move"}, {"id": 1214, "start": 12177.5, "end": 12189.5, "text": "Richtiger Pro-Move"}, {"id": 1215, "start": 12189.5, "end": 12207.5, "text": "Richtiger Pro-Move"}, {"id": 1216, "start": 12207.5, "end": 12227.5, "text": "Richtiger Pro-Move"}, {"id": 1217, "start": 12227.5, "end": 12243.5, "text": "Richtiger Pro-Move"}, {"id": 1218, "start": 12243.5, "end": 12263.5, "text": "Richtiger Pro-Move"}, {"id": 1219, "start": 12263.5, "end": 12273.5, "text": "Richtiger Pro-Move"}, {"id": 1220, "start": 12273.5, "end": 12283.5, "text": "Richtiger Pro-Move"}, {"id": 1221, "start": 12283.5, "end": 12307.5, "text": "Richtiger Pro-Move"}, {"id": 1222, "start": 12307.5, "end": 12327.5, "text": "Richtiger Pro-Move"}, {"id": 1223, "start": 12327.5, "end": 12341.5, "text": "Richtiger Pro-Move"}, {"id": 1224, "start": 12341.5, "end": 12351.5, "text": "Richtiger Pro-Move"}, {"id": 1225, "start": 12351.5, "end": 12363.5, "text": "Richtiger Pro-Move"}, {"id": 1226, "start": 12363.5, "end": 12391.5, "text": "Richtiger Pro-Move"}, {"id": 1227, "start": 12391.5, "end": 12411.5, "text": "Richtiger Pro-Move"}, {"id": 1228, "start": 12411.5, "end": 12431.5, "text": "Richtiger Pro-Move"}, {"id": 1229, "start": 12431.5, "end": 12451.5, "text": "Richtiger Pro-Move"}, {"id": 1230, "start": 12451.5, "end": 12471.5, "text": "Richtiger Pro-Move"}, {"id": 1231, "start": 12471.5, "end": 12491.5, "text": "Richtiger Pro-Move"}, {"id": 1232, "start": 12491.5, "end": 12511.5, "text": "Richtiger Pro-Move"}, {"id": 1233, "start": 12511.5, "end": 12527.5, "text": "Richtiger Pro-Move"}, {"id": 1234, "start": 12527.5, "end": 12541.5, "text": "Richtiger Pro-Move"}, {"id": 1235, "start": 12541.5, "end": 12557.5, "text": "Richtiger Pro-Move"}, {"id": 1236, "start": 12557.5, "end": 12573.5, "text": "Richtiger Pro-Move"}, {"id": 1237, "start": 12573.5, "end": 12593.5, "text": "Richtiger Pro-Move"}, {"id": 1238, "start": 12593.5, "end": 12605.5, "text": "Richtiger Pro-Move"}, {"id": 1239, "start": 12605.5, "end": 12619.5, "text": "Richtiger Pro-Move"}, {"id": 1240, "start": 12619.5, "end": 12629.5, "text": "Richtiger Pro-Move"}, {"id": 1241, "start": 12629.5, "end": 12639.5, "text": "Richtiger Pro-Move"}, {"id": 1242, "start": 12639.5, "end": 12655.5, "text": "Richtiger Pro-Move"}, {"id": 1243, "start": 12655.5, "end": 12667.5, "text": "Richtiger Pro-Move"}, {"id": 1244, "start": 12667.5, "end": 12677.5, "text": "Richtiger Pro-Move"}, {"id": 1245, "start": 12677.5, "end": 12687.5, "text": "Richtiger Pro-Move"}, {"id": 1246, "start": 12687.5, "end": 12707.5, "text": "Richtiger Pro-Move"}, {"id": 1247, "start": 12707.5, "end": 12723.5, "text": "Richtiger Pro-Move"}, {"id": 1248, "start": 12723.5, "end": 12739.5, "text": "Richtiger Pro-Move"}, {"id": 1249, "start": 12739.5, "end": 12753.5, "text": "Richtiger Pro-Move"}, {"id": 1250, "start": 12753.5, "end": 12773.5, "text": "Richtiger Pro-Move"}, {"id": 1251, "start": 12773.5, "end": 12789.5, "text": "Richtiger Pro-Move"}, {"id": 1252, "start": 12789.5, "end": 12809.5, "text": "Richtiger Pro-Move"}, {"id": 1253, "start": 12809.5, "end": 12821.5, "text": "Richtiger Pro-Move"}, {"id": 1254, "start": 12821.5, "end": 12841.5, "text": "Richtiger Pro-Move"}, {"id": 1255, "start": 12841.5, "end": 12857.5, "text": "Richtiger Pro-Move"}, {"id": 1256, "start": 12857.5, "end": 12871.5, "text": "Richtiger Pro-Move"}, {"id": 1257, "start": 12871.5, "end": 12891.5, "text": "Richtiger Pro-Move"}, {"id": 1258, "start": 12891.5, "end": 12911.5, "text": "Richtiger Pro-Move"}, {"id": 1259, "start": 12911.5, "end": 12931.5, "text": "Richtiger Pro-Move"}, {"id": 1260, "start": 12931.5, "end": 12947.5, "text": "Richtiger Pro-Move"}, {"id": 1261, "start": 12947.5, "end": 12963.5, "text": "Richtiger Pro-Move"}, {"id": 1262, "start": 12963.5, "end": 12979.5, "text": "Richtiger Pro-Move"}, {"id": 1263, "start": 12979.5, "end": 12995.5, "text": "Richtiger Pro-Move"}, {"id": 1264, "start": 12995.5, "end": 13011.5, "text": "Richtiger Pro-Move"}, {"id": 1265, "start": 13011.5, "end": 13027.5, "text": "Richtiger Pro-Move"}, {"id": 1266, "start": 13027.5, "end": 13043.5, "text": "Richtiger Pro-Move"}, {"id": 1267, "start": 13043.5, "end": 13057.5, "text": "Richtiger Pro-Move"}, {"id": 1268, "start": 13057.5, "end": 13077.5, "text": "Richtiger Pro-Move"}, {"id": 1269, "start": 13077.5, "end": 13097.5, "text": "Richtiger Pro-Move"}, {"id": 1270, "start": 13097.5, "end": 13123.5, "text": "Richtiger Pro-Move"}, {"id": 1271, "start": 13123.5, "end": 13147.5, "text": "Richtiger Pro-Move"}, {"id": 1272, "start": 13147.5, "end": 13173.5, "text": "Richtiger Pro-Move"}, {"id": 1273, "start": 13173.5, "end": 13193.5, "text": "Richtiger Pro-Move"}, {"id": 1274, "start": 13193.5, "end": 13207.5, "text": "Richtiger Pro-Move"}, {"id": 1275, "start": 13207.5, "end": 13223.5, "text": "Richtiger Pro-Move"}, {"id": 1276, "start": 13223.5, "end": 13243.5, "text": "Richtiger Pro-Move"}, {"id": 1277, "start": 13243.5, "end": 13257.5, "text": "Richtiger Pro-Move"}, {"id": 1278, "start": 13257.5, "end": 13271.5, "text": "Richtiger Pro-Move"}, {"id": 1279, "start": 13271.5, "end": 13291.5, "text": "Richtiger Pro-Move"}, {"id": 1280, "start": 13291.5, "end": 13303.5, "text": "Richtiger Pro-Move"}, {"id": 1281, "start": 13303.5, "end": 13323.5, "text": "Richtiger Pro-Move"}, {"id": 1282, "start": 13323.5, "end": 13337.5, "text": "Richtiger Pro-Move"}, {"id": 1283, "start": 13337.5, "end": 13353.5, "text": "Richtiger Pro-Move"}, {"id": 1284, "start": 13353.5, "end": 13375.5, "text": "Richtiger Pro-Move"}, {"id": 1285, "start": 13375.5, "end": 13395.5, "text": "Richtiger Pro-Move"}, {"id": 1286, "start": 13395.5, "end": 13421.5, "text": "Richtiger Pro-Move"}, {"id": 1287, "start": 13421.5, "end": 13441.5, "text": "Richtiger Pro-Move"}, {"id": 1288, "start": 13441.5, "end": 13457.5, "text": "Richtiger Pro-Move"}, {"id": 1289, "start": 13457.5, "end": 13471.5, "text": "Richtiger Pro-Move"}, {"id": 1290, "start": 13471.5, "end": 13487.5, "text": "Richtiger Pro-Move"}, {"id": 1291, "start": 13487.5, "end": 13507.5, "text": "Richtiger Pro-Move"}, {"id": 1292, "start": 13507.5, "end": 13521.5, "text": "Richtiger Pro-Move"}, {"id": 1293, "start": 13521.5, "end": 13541.5, "text": "Richtiger Pro-Move"}, {"id": 1294, "start": 13541.5, "end": 13557.5, "text": "Richtiger Pro-Move"}, {"id": 1295, "start": 13557.5, "end": 13571.5, "text": "Richtiger Pro-Move"}, {"id": 1296, "start": 13571.5, "end": 13591.5, "text": "Richtiger Pro-Move"}, {"id": 1297, "start": 13591.5, "end": 13611.5, "text": "Richtiger Pro-Move"}, {"id": 1298, "start": 13611.5, "end": 13631.5, "text": "Richtiger Pro-Move"}, {"id": 1299, "start": 13631.5, "end": 13645.5, "text": "Richtiger Pro-Move"}, {"id": 1300, "start": 13645.5, "end": 13665.5, "text": "Richtiger Pro-Move"}, {"id": 1301, "start": 13665.5, "end": 13685.5, "text": "Richtiger Pro-Move"}, {"id": 1302, "start": 13685.5, "end": 13699.5, "text": "Richtiger Pro-Move"}, {"id": 1303, "start": 13699.5, "end": 13713.5, "text": "Richtiger Pro-Move"}, {"id": 1304, "start": 13713.5, "end": 13737.5, "text": "Richtiger Pro-Move"}, {"id": 1305, "start": 13743.5, "end": 13763.5, "text": "Richtiger Pro-Move"}, {"id": 1306, "start": 13763.5, "end": 13779.5, "text": "Richtiger Pro-Move"}, {"id": 1307, "start": 13779.5, "end": 13793.5, "text": "Richtiger Pro-Move"}, {"id": 1308, "start": 13793.5, "end": 13813.5, "text": "Richtiger Pro-Move"}, {"id": 1309, "start": 13813.5, "end": 13833.5, "text": "Richtiger Pro-Move"}, {"id": 1310, "start": 13833.5, "end": 13849.5, "text": "Richtiger Pro-Move"}, {"id": 1311, "start": 13849.5, "end": 13861.5, "text": "Richtiger Pro-Move"}, {"id": 1312, "start": 13861.5, "end": 13881.5, "text": "Richtiger Pro-Move"}, {"id": 1313, "start": 13881.5, "end": 13901.5, "text": "Richtiger Pro-Move"}, {"id": 1314, "start": 13901.5, "end": 13921.5, "text": "Richtiger Pro-Move"}, {"id": 1315, "start": 13921.5, "end": 13941.5, "text": "Richtiger Pro-Move"}, {"id": 1316, "start": 13941.5, "end": 13961.5, "text": "Richtiger Pro-Move"}, {"id": 1317, "start": 13961.5, "end": 13981.5, "text": "Richtiger Pro-Move"}, {"id": 1318, "start": 13981.5, "end": 14001.5, "text": "Richtiger Pro-Move"}, {"id": 1319, "start": 14001.5, "end": 14023.5, "text": "Richtiger Pro-Move"}, {"id": 1320, "start": 14023.5, "end": 14043.5, "text": "Richtiger Pro-Move"}, {"id": 1321, "start": 14043.5, "end": 14059.5, "text": "Richtiger Pro-Move"}, {"id": 1322, "start": 14059.5, "end": 14079.5, "text": "Richtiger Pro-Move"}, {"id": 1323, "start": 14079.5, "end": 14101.5, "text": "Richtiger Pro-Move"}, {"id": 1324, "start": 14101.5, "end": 14121.5, "text": "Richtiger Pro-Move"}, {"id": 1325, "start": 14121.5, "end": 14145.5, "text": "Richtiger Pro-Move"}, {"id": 1326, "start": 14145.5, "end": 14171.5, "text": "Richtiger Pro-Move"}, {"id": 1327, "start": 14171.5, "end": 14191.5, "text": "Richtiger Pro-Move"}, {"id": 1328, "start": 14191.5, "end": 14211.5, "text": "Richtiger Pro-Move"}, {"id": 1329, "start": 14211.5, "end": 14227.5, "text": "Richtiger Pro-Move"}, {"id": 1330, "start": 14227.5, "end": 14251.5, "text": "Richtiger Pro-Move"}, {"id": 1331, "start": 14251.5, "end": 14271.5, "text": "Richtiger Pro-Move"}, {"id": 1332, "start": 14271.5, "end": 14291.5, "text": "Richtiger Pro-Move"}, {"id": 1333, "start": 14291.5, "end": 14303.5, "text": "Richtiger Pro-Move"}, {"id": 1334, "start": 14303.5, "end": 14323.5, "text": "Richtiger Pro-Move"}, {"id": 1335, "start": 14323.5, "end": 14343.5, "text": "Richtiger Pro-Move"}, {"id": 1336, "start": 14343.5, "end": 14353.5, "text": "Richtiger Pro-Move"}, {"id": 1337, "start": 14353.5, "end": 14365.5, "text": "Richtiger Pro-Move"}, {"id": 1338, "start": 14365.5, "end": 14375.5, "text": "Richtiger Pro-Move"}, {"id": 1339, "start": 14375.5, "end": 14385.5, "text": "Richtiger Pro-Move"}, {"id": 1340, "start": 14385.5, "end": 14407.5, "text": "Richtiger Pro-Move"}, {"id": 1341, "start": 14407.5, "end": 14423.5, "text": "Richtiger Pro-Move"}, {"id": 1342, "start": 14423.5, "end": 14451.5, "text": "Richtiger Pro-Move"}, {"id": 1343, "start": 14451.5, "end": 14471.5, "text": "Richtiger Pro-Move"}, {"id": 1344, "start": 14471.5, "end": 14483.5, "text": "Richtiger Pro-Move"}]}