{"text": "So Leute, ich bin mal kurz am Start nochmal, ich hab gedacht, komm 21 Uhr, hat keinen Sinnjetzt noch irgendwie rum zu basteln bis 22, 23 Uhr, machst einfach nochmal kurz Streaman, muss das Twitch nur noch mitkriegen und ich muss mein Streaming Rechner starten,dass ich überhaupt ne Vorschau hab, so lange, dass ich den Kram hier mal eingeblendet.Moin Captain CK, ah jetzt hier, Notifications sind raus, wie es aussieht, find das immerlustig, jetzt kommen immer so 3, 4, 5 Leute auf einen Schlag so instant rein.Was jetzt, sind 2 Streams am Laufen, Anzeige ist raus und ich muss eh nochmal ne Vorschaustarten und ich bin noch nicht lang da, hab gedacht, ich mach nochmal Stream an, bevorich ins Bett geh und es hat auch keinen Sinn, rum zu basteln bis vor, weiß nicht, wie dasbei euch so ist, wenn ihr an Zeug rum bastelt, bis dann, wenn ihr schlafen geht, dann denktman die ganze Nacht über diesen Krack nach, weiß nicht, ob ihr das auch kennt und wennman vorher aufhört, ein bisschen früher, dann gehts eigentlich, aber gerade wenn manan irgendwelchen Problemen sitzt und rum bastelt und dann direkt ins Bett geht, dannist man die ganze Nacht damit beschäftigt und träumt da teilweise auch von, ich habschon ein Scheiß teilweise geträumt, weil ich bis kurz vor ins Bett gehen an irgendwelchenSachen rum gebastelt hab, so wie gesagt, ich muss so kurz mein Streaming Rechner anmachen,dass ich was sehe, exzellent, so, das funktioniert jetzt jawoll, funktioniert alles sehr gut,ja Leute, ich muss euch mal was sagen, und zwar, irgendwie, seitdem ich jetzt die letztenpaar Tage, jeden Tag, mehr oder weniger gestreamt hab, irgendwie tut mir der Hals weh, ich hoffeaber nicht, dass das am Abend zu viel reden liegt, aber was solls sein, es wird ja wohlkaum Corona sein, davon tut der Hals nicht weh, schlecht copypasted, das funktioniertim Discord, allerdings, Lowbrain, Sachen hier, das Ayaya-E-Mode vom Discord kopiert, kipp.So, ok, wunderbar, jetzt hab ich auch die Vorschau an, jetzt kann ich noch mal gucken,was es gibt, was ich aufgeschrieben hab, ich hatte heute einen ganz merkwürdigen Windows-Fehler,das hab ich zum ersten Mal gehabt, weiß nicht ob man das hier noch sieht, dieses Side-Menüverwendet eh keiner, der hat mir irgendwie erzählt, Windows Disk Error Reboot, hier,Restart to Repair Drive Errors, hab ich noch nie gesehen, ich hab keine Ahnung was dereigentlich will, das da, was ist das, ist das Smokers Smoke, ist meine Festplatte kaputtoder, so ein komisches Ding, vor allem, das ist so eine typische Kack-Windows-Fehlermeldung,richtiger Crap die Fehlermeldung, da steht nicht was genau kaputt ist, da steht nichtwelche Platte kaputt ist, da steht nichts im Endeffekt drin, schaut ihr mal Hacking 101vom Humble Bundle an, humble Bundle, gucken wir, das ist wirklich klassisch Windows dieFehlermeldung, ich mein dieses komische Notification-Center mal ehrlich, oder wie der Kaboom gesagt hat,Hand aufs Herz, das benutzt doch keine Sau oder, benutzt das jemand von euch, hab dasglaube ich schon 50 mal gefragt, aber den Kram den verwendet noch keiner, den einzigenDaseinsberechtigung die das hat, ist zum Bluetooth an und ausschalten, das einzige hier Bluetooth,was macht denn das, oh, Big Brain Modus, dass sowas jetzt eingebaut ist in Windows, es gehtnicht mehr aus, es geht nicht, ah jetzt, es geht erstmal nicht aus, ok alles klar, alsowas soll ich mir gerade gucken, Hacking 101, ach ne Moment, da, hier, das da, das HackingHumble Bundle, Hacker Mans am Start hier, exellent, Hacking Humble Bundle, ok zeig ich mal her,was gibt's denn da, hier genau, wie gesagt Bluetooth kann ich verstehen, aber ansonsten,für was, für was sonst, ja, also der hat rebooted aber keinen Checkdesk oder irgendwasgemacht, so ok was gibt's denn da, 16 Tage, Hacking Art of Explo, Exploitation, das kannich nicht aussprechen, Sicherheitslücken ausnutzen, Sicherheitslücken ausnutzen, Exploitation,die are all sitting in one boat, ja, ich weiß nicht wie man das richtig ausspricht, CarhackersHandbook, und dann irgendein so ein Olin Kokona Auto drauf, Metasploit, ok das ist wahrscheinlichecht nicht schlecht, ich kenne davon keins ehrlich gesagt, aber da ein bisschen waszuzuwissen ist nicht verkehrt, so und dann gibt's auch noch irgendwelche Aliens, so PracticalPacket Analysis, ich glaub das soll wirklich gar nicht schlecht sein, das hab ich schonmal irgendwo, falls das das ist, das hab ich schon mal irgendwo was von gehört, ja ichglaub das ist wirklich gar nicht so scheiße, ähm, macht mir nix, Practical Packet Analysis,ähm, ja kann ich auch nix zu sagen, so und jetzt wenn man noch mehr ausgibt, ok jetztmal, Leute ich muss jetzt mal was sagen, ich glaub ich hab mir noch nicht ein Humble Bundlegeholt, noch nie, wie funktioniert denn das, wenn ich jetzt ein Euro ausgebe, krieg ichdas, ok das hab ich verstanden, wirst du die Cookies, nö, das hab ich verstanden, wennman Euro bezahlt kriegt man das, so wenn man quasi 6,77 Euro bezahlt kriegt man das, abersind es 6,77 Euro oder 7,77 Euro und ist das immer, also addiert sich das immer, also sprichsind das hier 8,46 Euro oder sind das quasi 1 Euro plus 6,77 Euro plus 8,46 Euro, neeok, ah ja, ah verstehe, ok, also was gibt's denn sonst noch, dann gibt's Binary Analyseund Malware Data, Data Science, exzellent, ähm, Linux Hacker, was ist das für ein KavaAlter, ähm, Linux Command Line, ok ich hab kein, es sagt mir alles gar nichts, das istsicherlich nicht schlecht zu wissen, Verschlüsselung, warum gibt's keine 18,77 die man bezahlenkann, warum gibt's keine 13,37 die man bezahlen kann und dann gibt's hier noch Hood Kids BlackHat Go, Alter, Leute, ich muss euch jetzt mal was zeigen, fuck das übelst ab Avira,ich weiß gar nicht warum ich Avira auf meinem zweiten Rechner noch drauf hab, hier gucktmal, der Müll ploppt da laufend auf, guckt euch doch mal diesen Kack an, Pains Champ,ist das ein Anti-Virus oder ist das ein Virus, der mich irgendwie Scareware mittlerweile,was soll denn der Kack, die sollen mich in Ruhe lassen, ich deinstallier das jetzt, einfachrunter, wie gesagt auf meinem Rechner, das hab ich mal irgendwann vor 5 Jahren oder 6Jahren, immer wenn der Rechner neu war, da hat man noch Avira benutzt, hab ich das verwendet,jetzt weg, also ich kann jetzt in den Büchern nichts sagen, ich kenn davon nichts, das einzigewas mir glaub ich irgendwie bekannt vorkommt war das da und sonst kein Schimmer, ich habdas ja hier drauf hab ich dann nicht installiert, ich hab das auf dem Rechner damals vor 6 Jahrenoder 7 Jahren installiert, auf dem alten, den ich als Streaming Vorschau jetzt verwendeund da ist das halt immer noch drauf, das ist, ansonsten hat das keinen Sinn, hier habich auch nur Windows Defender drauf laufen, das reicht doch ehrlich gesagt, ach ich glaubich deinstallier das, das Relaxing Video Game Music, zeigt mal her, die hier ist mir fastschon ein bisschen zu Relaxing, aus Skyrim Stels, ok die ist mir auch ein bisschen zuRelaxing, ein bisschen Sound brauchen wir da schon im Hintergrund, so, ich muss mal kurzmein, ich muss mal ganz kurz schnell mein Tablet holen, ich hab mir hinter 2 Videosdrauf gespeichert, die ich mit euch gucken wollte, wie sieht denn Audio Setup aus, alsoich hab nen Bayer Dynamics MMX300 auf, das geht an so einen kleinen Mixer, der geht dannper USB in den Rechner und der zweite Ausgang geht in mein Audio Interface, das Audio Interfacebrauch ich zum Beispiel, dass ich dann mich selbst einspielen kann wieder auf den Hörer,dass ich nicht so rumschreie, weil das ein geschlossener Kopfhörer und da drüber kannich dann auch an der Konsole Voice Chat machen und solche Geschichten, also ich hab 3 Sachen,ich hab hier mein Headset am Start, dann so nen Minimixer und nen Audio Interface, derauch noch mal 24 Eingänge oder sowas hat, mit Adapter, schon mal kurz, ah, ah, ah,ah, ah.So also Du updates 3 Stunden Windows was updatet denn dann alles eh, man 3 Stunden, megah CommandWindows, Windows ist nicht das schnellste was upper understand angeht und auch nichtdas Fehler, äh, äh, resistenteste, ja?Aber drei Stunden ist schon ordentlich.Genau, das wollte ich gucken.Ja.Was wollte ich mir angucken?Hier könnte ich das Spiel dran strez.Wir haben hier eh nicht allzu viel Zeit.Oh, Leute, wisst ihr was?Wenn, wenn der Chat mal wieder, äh, hier, wenn der Chat mal wieder low-prane ist, da hab ich schon die passende Bestrafung für.Passt mal auf, what's new in PHP 8 müsst ihr euch dann angucken.Wenn ich mal stehlig auf dem Chat bin, dann mach ich die neuen PHP 8 Features an.Felix, 15 Monate, Dankeschön für den Sub.Das ist ja schon richtig.Äh, wen haben wir denn sonst noch hier?Leuchtpapier, zwei Monate, eine Dankeschön für den Sub.Huge.Ja, guck mal, aber man sieht mal, was ich übrigens, was ich übrigens nicht so ganz checke ist, es gibt irgendwie ein Video, vor drei Jahren, new features in PHP 8 und jetzt ist es, ist es, ist es rausgekommen vor einer Woche oder so, was auch immer.Ja, aber das ist nicht das Video, was ich gucken wollte. Ich find's, find's nicht. Ich merk mir das meistens nicht, welche Videos, ich speichere mir das einfach immer an, später angucken und, joa, ach, was weiß ich, was nix drin ist.Ich muss ja demnächst auch wieder Weihnachtsgeschenke kaufen, dann bin ich so unglaublich kreativ los, was das Ganze angeht.Zu PHP fällt dir das ein... Hä? Zeig mal her. Den Witz verstehe ich nicht. Zeig mal. Muss ich mal gucken, ob ich zu, zu low-brain bin, das zu verstehen. Also, working at Pornhub, oh, Monka Toss.Nee, nee, ich glaube, da kommt jetzt nix, das ist programmer-humor. Also, working at Pornhub, Pornhub-Adult-Content-Montreal-Links, okay, deswegen ein Job-Job-Angebot, NSFW.Okay, zu PHP? Okay, I'm interested, but... Ja, okay, jetzt hab ich's kapiert. Hat gedauert. Ja, ich mein, mal im Ernst, das ist aber wirklich so, es interessiert doch keiner, ob du bei Pornhub arbeitest, oder wenn schon, finden's die Leute wahrscheinlich eher lustig, oder cool, oder was auch immer.Also, keiner sagt doch heute, oh, du arbeitest bei Pornhub, oh, geh fort. Aber PHP-Entwickler zu sein, das sieht die Sache schon wieder anders aus. Aber vielleicht irgendwas lustiges noch zu bieten, ja.Ich brauch irgendwelche blöden Meme-Bildchen. Mein Lieblingsprogrammer-humor ist immer noch der hier. Moment, wo ist das Bild?Oh nee, wo ist das Bild? Ah, beste. Das ist immer noch mein Lieblingsprogrammer-humor-Joke. Das ist so unglaublich doof. Und die meisten Leute, die halt mit Programmieren nix am Hut haben, die checken's halt absolut null. Aber ich find den ultra lustig.Stimmt, da hast du recht hier. In den USA haben sie wahrscheinlich noch mehr Probleme mit Pornhub arbeiten, aber was auch immer. Die Australier haben ja auch ganz merkwürdige Gesetze in der Richtung, ne?Die haben ja, Australien hatte irgendwie vor ein paar Jahren so ein paar Anti-Porn-Gesetze erlassen und da sind die ganzen australischen Pornseiten umgezogen. Und ich sag, wir können das nicht mehr machen. Also, in Australien.Nicht nur das. Nicht nur das. Nicht nur das. Ich weiß aus dem Kopf nicht das. Ich hab nur noch mitgekriegt, dass viele seinen umziehen mussten aus Australien.Ja, Prins, ich hab immer noch so einen Mikrotik 10G-Switch hier. Den wollte ich ja eigentlich verlosen. Ich hab mir den vor über einem Jahr gekauft, den hier.Zehn. Zeig mal, wo ist denn der kleine? Hier, der da. Den hab ich mir vor über einem Jahr gekauft und hab gesagt, okay, ich mach ein Video zu meinem 10G-Nas-Bild und verlose danach noch irgendwie so einen Switch.So, die Sache ist nur die, ich hab den Switch nie benutzt. Also gar nicht. Ich hab das Nas-Bild auch kein Video zu aufgenommen. Ihr kennt mich ja.Das heißt, ich hab das Ding immer noch am Start und ich brauch's nicht. Und ich hab mir überlegt, ob ich das nicht vielleicht an Weihnachten irgendwie dem, dem, dem, Moment, dem irgendwie zukommen lasse.Da muss ich mir doch irgendwas ausdenken. Kostet normalerweise, glaub ich, 130 Euro oder sowas.Ja, 130 Euro. Kriegt dann irgendeiner als Weihnachtsgeschenk. Aber ich muss mir noch überlegen, wie ich das Ganze mache. Muss man doch gucken, was wir dafür machen, dass man den gewinnen kann.Wobei, gewinnen darf man ja nicht sagen. Man darf ja keine Gewinnspiele machen. Ist ja in Deutschland rechtlich nicht so. Man darf nur eine Auslobung veranstalten. Also Leute, ich veranstalte kein Gewinnspiel, ich mach eine Auslobung.Das ist in Deutschland, muss man das ja alles korrekt benennen, sonst ist die Anzeige raus. Obwohl es unterm Strich genau das gleiche ist, ne. Eigentlich total bescheuert.Programming-Challenge-Fellows. Ja, da muss ich mir aber irgendwas ausdenken. Vor allem muss ich mir die Ergebnisse angucken oder irgendwie bewerten. Krieg ich doch wieder nicht gebacken.Liegst du dann deine Adresse auf dem Paket? Hä? Ne. Achso. Meinst du auf der Verpackung? Ne. Die Verpackung hab ich ja auch schon längst aufgerobbt. Aber an sich ist der wirklich nice.Der ist halt auch kurz klein für so ein 10G-Switch, ne. Kein Lüfter, Passiv. Kannst sogar an den Schreibtisch stellen.Eine CTF. Nachdem ich ja selbst keine CTFs mache, bin ich glaube ich extrem schlecht darin CTFs zu erstellen.Oh ne, ich bin ultra müde. Ey, was ist denn los hier? Okay, wir gucken uns jetzt ein Video an. Also das ist ja eh nur kurzer Einschlafstream.Hat jemand auch noch den Weihnachts-Einkauf-Struggle vor sich? Ich bin ja immer so unglaublich unkreativ.Aber dieses Jahr muss ich den Weihnachtsgrill wenigstens nicht schenken. Oder ne, letztes Jahr auch schon nicht. Das hat sich ja von alleine wieder erledigt.Ja. Und warum hat sich das erledigt? Weil ich es wieder verkackt hab. Und ich bin einfach nicht für soziale, zwischenmenschliche Interaktionen. Ja, das kriegt das nicht hin.Die Mikrowellenschuhe, ja die waren tatsächlich gut. Das Slippy Schuhe waren das, die ich ihr da geschenkt hab. Genau die da.Richtig Big Brain Aktion war das. Die hat sich auch gefreut, ja. Aber wisst ihr, also warum ich auch weiß, dass ich das verkackt hab?Ich hab das ja schon mal vor einer Weile erzählt. Weil ich einfach absolut nicht mehr reagiert hab. Gar nicht irgendwie weil ich auf die keinen Bock hab oder so.Aber für mich sind so soziale Sachen immer extrem anstrengend. Da muss man sich Gedanken machen und sich in andere Leute reinversetzen.Na, was könnte man jetzt machen? Ach ja, vielleicht könnte man mal irgendwas machen. Da muss man irgendwie mit den Leuten ein paar Stunden am Strück, was weiß ich, sich über irgendwelche Sachen unterhalten, die einen überhaupt nicht interessieren.Und irgendwie fehlt mir der Antrieb für soziale Interaktionen. Und deswegen hab ich mich einfach nach dieser Weihnachtsgeschichte nie mehr ernsthaft gemeldet.Und da hat die sich wahrscheinlich gedacht, der spaßt. Pech gehabt. Aber hat sie auch Recht, ne?Wer braucht schon soziale Interaktionen? Genau, wer braucht schon soziale Interaktionen, wenn er den Twitch Chat hat?FeelsBatmanZ geht in der Chat wieder hier. Ja, ich find das immer total anstrengend.Weißt ihr, bei mir ist das immer so, wenn man, was weiß ich, wenn man irgendwie so, irgendwie jemanden kennenlernt oder sonst wen, dann ist man am Anfang immer noch ein bisschen motiviert.Da ist man immer noch ein bisschen aufgeregt und irgendwie noch irgendwie motiviert. Aber das dauert dann bei mir nicht lang.Dann meistens, wenn ich dann irgendwie mal paar ruhige 5 Minuten mal drüber nachgedacht hab und ich dann wieder irgendwas machen müsste für, dann denk ich mir immer, oh nee, jetzt musst du überlegen und das und hier und ach nee, mach lieber Stream an.Das ist übrigens auch so ein Ding, wo ich sag, warte mal, wo steht's denn? Genau, das ist auch so ein Ding, wo ich mir so überlege, ey, Gamer Master Race wieder, ey.Wir können das schon seit, also was heißt wir, bei euch ist ja unterschiedlich vom Alter her, aber ich kann das schon seit 25 Jahren, naja, okay, das ist jetzt vielleicht ein bisschen übertrieben seit, sagen wir mal seit 20 Jahren, ist das überhaupt kein Problem.Ich kann mich, wenn's sein muss, den ganzen Tag an den Rechner sitzen, irgendwelches Zeug spielen, ab und zu mal im Chat irgendwas schreiben und dann ist gut, da ist mein Interaktionsbedarf gedeckt.Nö, schock mich überhaupt nicht. Ja, ich hab sag mal so ein bisschen Sachen, das ist ja ab und zu mal ein bisschen zwei Minuten Smalltalk irgendwie mit Leuten in der Schlange beim Bäcker oder so, aber das reicht mir, ohne Scheiß, das reicht mir, das ist vollkommen ausreichend, ich hab da überhaupt keinen Bock drauf.Jo, Max, habt das Wort noch nicht nackt, wie lief der Craft-Q-L-Stream? Ey, ich find das extrem, extrem, Moment. Ich hab heute auch ein paar Stunden noch dran rumgebastelt.Okay, es geht nicht auf, das ist schlecht. Wenn ich keine Vorschau von den Links bekomme, dann mach ich die da drauf.Also ist das besondere, okay, Moment, das gucken wir uns jetzt mal an. Das ist, wenn es von der Bundesregierung ist, ist das immer Cringe.Ziemlich sicher, die können keine normalen Videos machen, die machen nur Cringe-Videos. Ach doch, das kenn, nee Moment, das kenn ich nicht, ich kenn irgendein anderes Video, wo sie irgendwie erzählt haben, wir gammeln zusammen auf dem Sofa oder sowas.Das ist aber ein anderes, aber auch so eins in der Richtung. Ja, das da ist das glaube ich, wir gammeln zusammen auf dem Sofa, genau, das ist, das fand ich bisschen zum Fremdschämen.Die Leute spinnen aber mittlerweile auch übelst rum. Ich bin ja immer dafür, die Sachen differenziert zu sehen, man sollte sich alle Seiten angucken, aber die Leute, die sehen mittlerweile auch echt überall irgendwelche Hate-Sachen, wo keiner ist.Hier auf dieses Video, auf Twitter, weiß ich noch, wurde übelst rumgeflammt, dann gab es letztens eine Apple-Werbung, dann hat man einen Vater gesehen mit Kind, die sich auf Weihnachten gefreut haben, das war halt ein Schwarzer, und die Leute da so, davon spüle ich mich jetzt nicht angesprochen.Apple, ihr verliert voll eure Zielgruppe aus den Augen, blablabla, die regen sich, über jeden Scheiß regen sich alle heute auf, das geht mir auch mega auf den Sack, das ist so schlimm. So, wir gucken jetzt jetzt aber.Also, zeig mal. Dieses Stück Blech wurde mir damals umgehangen, im Winter 2020. Kurz vor meinem... Er hat ein bisschen was von, Moment, habe ich den als Emote? Ja, ein bisschen von was von diesem Pain, Pain-Ha-Ha-Typ, vergessen wie er heißt.21. Geburtstag. Ich wurde für meine besonderen Leistungen im Kampf gegen Corona ausgezeichnet, und plötzlich war ich ein Held, ein Idol, ein Musterbürger. Zugetraut hätte mir das niemand. Bevor Corona ausbrach, war ich ohne Zweifel die faulste Socke, die je durch dieses Land geschlichen ist.Moment, Moment, warte mal. Okay, ich hoffe das war... Also erstens haben wir eine krasse Goldkenne an, ja? Ich versuche gerade zu erkennen, was das für ein Headset ist. Das hat kein RGB. Also, das ist schon mal Fail, Headset ohne RGB.Und die Monitore sind sehr weit auseinander. Wie soll denn das funktionieren? Normalerweise hat er drei und für die Kamera einen runtergenommen, oder was?Ich habe meine Wohnung so gut wie nie verlassen, zockte ohne Ehrgeiz und aß kalte Ravioli direkt aus der Dose, weil ich war zu faul sie mir warm zu machen. Meine Freunde...Also wir wissen doch, dass Klischeegeber zumindest mal fett müssen sie schon sein. Aber ich war auch zu faul um mich darüber aufzureden. Als dann Corona ausbrach, blieb ich der gleiche faule Sack, der ich vorher auch gewesen bin.Ohne Ehrgeiz zocken hat Reverse boosted, ja? Oh jetzt hat er RGB an, jawoll, jetzt gut. Und viel zu wenig Staub auf dem Schreibtischer.Es waren besondere Zeiten damals. Besondere, schwere Zeiten. Aber es war leicht ein Held zu sein.Na ja, was ist das? Motivationsansprache für die Leute oder was? Das ist cringe, das gucken wir jetzt nicht an. Übrigens das ist auch witzig, das ist auch ein Ding, was ich ein bisschen fragwürdig finde.Dass überall, ich meine klar, da wird geflamed und gemacht und getan, aber bei allen Sachen wo es um Corona geht oder irgendwelche kritischen Dinge oder kontroversen Dinge, sind die Kommentare auf YouTube aus.Bei der Tagesschau sind die auch aus und bei den ganzen News Sachen sind die aus. Man kann sich gut vorstellen was da in den Comments für ein Schwachsinn drin steht.Aber es wäre doch ganz gut, wenn die Leute einfach reinhauen. Warum ausschalten? Muss sich ja keiner dafür interessieren.Hättest du Bock die Kommentare zu... warum? Ich muss die doch nicht moderieren. Ich lasse die Leute einfach dumm Scheiß reinschreiben und gut ist.Ich moderiere meine Kommentare auch nicht und da ist auch viel Schwachsinn dabei. Natürlich kann man das nicht vergleichen, aber weitem nicht so viel Schwachsinn wie da, das stimmt schon.Ach, tatsächlich? Ach, das gab Comments am Anfang, ok. Ja, dann haben die dann ausgeschaltet, weil die Leute zu sehr abgegangen sind. Ja, das kann sein. Das kann sein. Ok, das verstehe ich dann sogar.Das verstehe ich, wenn man das dann abschaltet. Aber bei der Tagesschau und so ist mittlerweile alles aus. Guckt, sobald man hier hingeht, die haben doch hier immer Corona-Werbung.So, was will ich? Bam, Kommentare aus. Guckt, Kommentare aus. Und Disable-Chat. Das verstehe ich gar nicht, warum.Na klar, du hast ja viele Spinner, aber sollen sie halt spinnen. Ich meine, besser sie spinnen in den YouTube-Kommentaren als vor Ort irgendwo, ne?Also, das wird mich nicht jucken. Ja, aber die haben Livestream und auch aus. Hier, guckt mal da. Bam, Tagesschau, Kommentare aus. Ich wette mit euch. Bam, Kommentare aus. Immer.Ok, warum die immer Kommentare ausschalten? Sollen sie Leute doch dumm Schmuss schreiben lassen? Ist doch ok. Guckt mich nicht. Was ist das? Oh, gibt wieder ein Space-Extreme. Excellent.Warum watchen das nur 200 irgendwas? Das ist dann bestimmt Fake-Stream. Das ist gar kein offizieller.Ein Server-Upgrade. Oh ne, das ist immer ultra-langweilig. Das habe ich schon ein paar Mal gesehen. Die sind übelst langweilig.Da fällt mir übrigens ein, ich wollte mit dem Felix noch ein Video machen über unsere 50.000 Euro-Server aus dem Rechenzentrum. Wir haben das Video ja schon aufgenommen. Wir wollten bloß nochmal drüber labern.Und haben es immer noch nicht gemacht. Ist das irgendwie ein Super-Micro-Ding? Oder was hat er hier am Start? Ah, Bam, Samsung SSD ist in your face. So muss das sein.Was hältst du von meiner App? Ich denke nicht. Muss ich mir mal angucken. Gucken wir mal. Oh, guck mal hier. Poggers Bewertung. Keyboard-Switches-DB. Moment, was macht das?Du darfst bei euch im Rechenzentrum filmen, ja? Wir zeigen gar nichts. Wir waren quasi im Abstellraum und haben uns dahingestellt und das gefilmt. Siehst du nix? Siehst du ein Regal mit Servern? Siehst du das was?Sag mal, Keyboard-Switches-DB. Was hast du denn hier gebastelt? Make Sound-Test, Compare Specs. Ah, das ist eine coole Idee. Was ist eine coole Idee?Da kannst du dir quasi einen Sound anhören, von wie sich ein Switch anhört. Das ist eine coole Sache, das gefällt mir.Ey, das ist eine gute Idee. Weil man fragt sich immer, wenn man sich ein neues Keyboard kauft, nach dem Motto, okay, ich weiß vielleicht mit Achtung und Krache nur welche Switches da drin sind, aberwie laut die dann sind und wie die klickern und ob das irgendwie das Gehäuse vibriert beim Reiten und so. Das weiß ich ja eigentlich gar nicht. Aber hier, das finde ich eigentlich eine gute Idee.Switches-DB. Mit was hast du das gemacht? Es sieht ja ein bisschen nach Web aus, wahrscheinlich ist es Elektron oder irgendwie sowas.Könnte ich mir zumindest vorstellen.Das ist eine gute Idee.So, du hast doch richtig gute Bewertungen schon gekriegt hier. Das ist mit einer Game-Engine gemacht. Ah ja, interessant. Warum das? Weil es Cross-Platform läuft oder wie?Oder für das Video, für das Audio-Zeug. Weil vom GUI her würde ich jetzt nicht vermuten, dass da irgendeine Game-Engine drunter ist und schon gar nicht, warum man das mit einer Game-Engine macht.Aber wenn es geht, die Funktion ist ja das Wichtige. Was das läuft, ist ja fast egal. Aber warum denn?Unity wird bestimmt auch in vielen Projekten verwendet, wo kein Game ist. Deswegen könnte ich mir vorstellen, dass das mit der Engine, die du verwendet hast, auch so.Aber wie bist du da drauf gekommen? Also warum mit der Game-Engine, der Smartphone-App?Ah! Hey, das ist eigentlich gar nicht mal schlecht.Weil das GUI sieht jetzt vielleicht nicht Next-Gen-HD aus, aber vollkommen ausreichend für sowas.Ja, nice. Poggers.So, zeige ich mal her. Gibt es hier irgendwas Spannendes, was ich uns YouTube empfehlen möchte?Okay, irgendein Special-Whiskey-Video muss ich mir nicht angucken.Das ist auch so ein Ding, wo ich immer dran denken muss, warum wir das nicht gebacken kriegen mit Corona und der Schule.Das ist ein Ding, das finde ich wirklich ein bisschen arm. Man hatte sechs Monate Zeit zwischen den zwei Corona-Wellen, sich Sachen zu überlegen.Aber irgendwie muss alles wieder übers Knie gebrochen werden, sobald es jetzt wieder akut ist.Wahrscheinlich haben die da gesessen und haben gesagt, hoffentlich gibt es keine zweite Welle, hoffentlich gibt es keine zweite Welle, hoffentlich gibt es keine zweite Welle.Anstatt sich mal hinzusetzen, um was für ihr Geld zu machen und sich schon ein paar Sachen im Vorfeld zu überlegen und abzuklären, bevor es dann soweit ist.Es müssen sich jetzt irgendwelche Dinger aus den Fingern saugen.Und vor allem, dass es gefühlt jede Woche neue Regelungen gibt. Wer soll denn da noch durchblinken?Mittlerweile ist es ja so, irgendwie scheißen schon die ersten Läden drauf.Ich war heute Weihnachtsbaum kaufen und normalerweise machen die es ja im Laden immer so, du musst einen Wagen nehmen, es dürfen nur so und so viel rein und sonst was in der Richtung.Im Bauhaus vollkommen egal, einfach Mundschutz aus reingelaufen, da war Knage voll.Max bald auch auf Querdenker Demos, ey ich sag euch, wenn, also ich gehe wahrscheinlich nie auf irgendeine Offline Demo, ja.Aber wenn die auf die Idee kommen, so ganz abgedrehte Sachen zu machen, wie zum Beispiel, du darfst ohne Grund das Haus nicht mehr verlassen und zu den Gründen zählt kein Sport und sonst was, sondern nur Arztbesuch und sowas in der Richtung.Also wenn ich wirklich gar nicht mehr aus dem Haus darf ohne Arztbesuch, solchen Dingern, dann gehe ich zwar nicht auf die Querdenker Demo, aber dann wäre ich mich zumindest mal öffentlich zu ausländisch kacke finde.Aber ansonsten, ansonsten ich habe ja nichts gegen Corona Maßnahmen, gar nichts, ich finde es nur an manchen Stellen viel zu schlecht erklärt, warum man was macht und zu undurchsichtig und vor allem keine Vorbereitung.Hat ein halbes Jahr Zeit, aber keiner hat es schon was überlegt, das ist das was mir auf den Keks geht, dass es da jetzt Maßnahmen gibt, das finde ich an sich nicht schlimm.Ach genau, ja stimmt, es gibt ja noch Corona, das habe ich auch gelesen, es gibt jetzt eh für Bundestagsangestellte, glaube ich gibt es ja irgendwie noch so einen Bonus, ja, excellent.Lustigerweise, die Leute die irgendwie auf dem Zahnfleisch gehen, da ist kein Problem, aber da gibt es erstmal einen dicken Bonus, easy.Also wenn ihr wirklich auf die Idee kommt und sagt, Ausgangsperre und man darf nur noch zum Arzt und Supermarkt, dann werde ich mich auch mal öffentlich zu ausländisch kacke finde.Bis jetzt, muss ich sagen, bin ich zum größten Teil mit den Maßnahmen einverstanden, also mit den Maßnahmen an sich, die Sachen drum herum gefallen mir halt nicht.Musik, ah, excellent.Ich verstehe übrigens auch nicht, warum man in die Schule gehen darf mit 30 Leuten in der Klasse, das ist so ein Ding, wo ich mir denke, hätte man sich da nicht das letzte halbe Jahr über was überlegen können.Jetzt ist es so, die tun so, als ist das Problem jetzt erst bekannt, so irgendwie, was, es sitzen 30 Leute in der Klasse, hui, wo kommen die denn auf einmal her?Ja, da hätten wir ja gar nicht dran denken können, auf die Idee, aber wer kommt denn auf so eine Idee, dass 30 Leute in der Klasse sitzen?Nee, nee, nee, da konnte man im Vorfeld nicht dran denken, ich meine man hat ein halbes Jahr Zeit gehabt.Max, mach mal wieder mehr YouTube-Videos. Ja, ich habe eins aufgenommen, gibt es am Wochenende.Und wie wir es halt auch mit Remote-Unterricht nicht auf die Reihe kriegen, wie gesagt, das habt ihr schon gesagt, Tochter vom Kollegen in Kolumbien macht komplett Remote-Unterricht.In Deutschland sitzen sie da, alter, wie bediene ich meinen Browser jetzt nochmal, wie mache ich Teams auf, wie geht das, irgendwelche unfähigen Boomer-Lehrer am Start?Das war glaube ich das größte Problem ist.Vielleicht hast du dazu eine Idee. Oh, in Discord muss ich auch mal wieder reingucken.Glaubst du, dass man so alte BNC-Überwachungskameras an den ESP32 hängen kann, damit ihr, ähm, was wird denn da drüber übertragen, ist das VGA?Oder was geht da drüber? S-Video, VGA, was ist das?Du wirst ja das Problem haben, das analoge Signal irgendwie umzuwandeln.SDI, äh, das glaube ich nicht, dass es da irgendwas Gescheites für gibt.Du müsstest das analoge Signal irgendwie in Bilder umwandeln und das glaube ich nicht, dass das mit dem ESP32 gescheit funktioniert.Da dürfte ein Raspberry Pi mit irgendeiner Billig-Capture-Card wahrscheinlich am besten sein, die das kann.Das wundert mich nicht, sowas. Wie gesagt, Kollege von mir ist auch Lehrer und, ähm,der wurde jetzt zwangsbeurlaubt oder so, wie man es nennen mag, weil der ist höchste Corona-Risikogruppe und die haben gesagt, er darf nicht mehr in die Schule kommen.Und jetzt muss er Remote-Unterricht machen und die Schule kriegt es halt nicht gebacken, das gescheit einzurechten.Fängt ja schon an damit, dass es keine gescheiten Vorgaben gibt, was man verwendet.Ja, die einen verwenden Teams, die anderen verwenden Dings hier. Wie heißt das?Oh, ich hab's vergessen. Wie heißt dieses andere Ding, was die Leute jetzt neu verwenden, was vor Corona keine Sau kannte?Zoom, Zoom, genau. Ja, Zoom. Der Chat. Der Chat kennt sich wieder aus.Das war total unbedeutend vor Corona. Die waren halt zur richtigen Zeit am richtigen Ort, ne?Die Leute haben alles so krass oversized in das, ey.Oh, oh, das ist aber oldschool, das Ding.Ist das, ist das ein full-sized SAS-Connector oder was ist das?Ich erkenne das gar nicht, das müsste ein SAS-Connector sein.Was haben wir noch?Okay, das muss was Altes sein. RS3614. Ich glaube, das ist was relativ Altes, oder?Auf jeden Fall IBM, oder? RS, klingt irgendwie nach IBM.Ach nee, Synology Rackstation. Okay, nee, ich hab nichts gesagt, weil die IBM-Dinger hießen auch, ähm,früher, glaube ich, irgendwas mit RS.Excellent.Ah, yes. Es ist ja quasi ein Schnapper.Vor allem mit der Ausstattung. Ein Schnäppchen.So. Aber gut, wenn das ein fertiges Synology-Ding ist, dann ist das ja noch verkraftbar.Aber da sind irgendwelche SAS-Connectors hinten, oder? Für SAS-Erweiterungen.Ja, denke ich mal schon. RS war doch Dell? Nee, Dell war DL, warte mal.Nee, DL380 war HP, oder? Das war HP, bringe ich die Software-Namen.Ach ja, ja, nee, stimmt, du hast recht. RS irgendwas war Dell. Ja, ja, stimmt.Ähm, wie hießen Dinge von IBM dann früher?Warte mal, wie hieß... X, X, genau, X, X6355 war das, ja.Das hab ich grad durchgeheiligebracht. Das waren die OLLEN-IBM-Dinger.Mit dieser komischen Metallkugel vorne drin. Die hatten Server, die hatten hier oben so einMetallkugel drin. Ich weiß bis heute nicht, wo der Sinn davon war.Manche hatten das, manche hatten das nicht.oder das gab es oder das gab es nur bei uns und irgend einer war lustig und hat da wasreingesteckthier sieht man das nichtich vergesse auch immer wie die remote management lösung heißt also du hastiTrack bei Dell, Elo bei HP und ich glaube RSA ist es bei IBM oder?war das nicht RSA, das IBM Remote Ding?das war Java OnlyRSA 2, das Ding ist absoluter Crap gewesendieses hässliche DingJava Only, nur eine spezielle Java Version unterstützt im Browserdas war die letzte Java Anwendung die ich verwenden musste auf der Arbeit malein paar jahre lang und zwar das ging nur mit einer alten Browser Version wo dasJava Plugin noch ging und nach einer Weile auch nur Windowsalso du hast quasi eine Windows Installation gebraucht mit einem alten Browser und einemalten Java und einem alten Java Browser Plugin dass der Scheiße funktioniert hateasy clapdas war abartig das Ding also das war wirklich hochgradiger Kackdas war grausamwas sagst du zu hast der Frisör wieder YouTube?ich finde das nicehat er wieder was neues gemacht?ach nee das ist der Fitness Chatnee doch nichtdie habe ich schon alle gesehen ja das ist nice dass der Frisör wieder hatich wollte mit dem Fabian eigentlich am Wochenende was aufnehmen aber der hat sich noch nichtgerührt aber der wollte sich wahrscheinlich nichtfestlegen drauf irgendwie jetzt so ja am Wochenende nehmen wir was auf oder nichtecht alte Java Version gehen nicht mehraber man kann auch bestimmt noch einen Java 1.6 oder so was irgendwie downloaden oder?gibt das nicht gibt es das nicht mehr?doch hier BÄM oldschool Shit gibt es immer noch zum DownloadZackabsolut high end Java Version von 2000 oder sowarum um alles in der Welt zeigen die Advanced Warfare?warum Advanced Warfare was ist denn mit denen los weil es jetzt RTX on ist oder was?warum denn ausgerechnet Twans Warfare der größte Shit überhaupt?und es sieht auch so ausdas verstehe ich nichtwar das jetzt war das jetzt irgendwie RTX on oder so oder was was wollten die uns damitsagen?übrigens ich finde es auch geil wie die Leute wieder rumflamen sind dass die 3060 Ti irgendwiebesser ist als die was war das 2080 Super 2070 Super oder was auch immerich weiß gar nicht was mit den allen los ist wenn ich mir eine Grafikkarte vor einem Jahrgekauft habe dann war das früher vollkommen normaldass man damit rechnen musste dass die relativ schnell outdated istnur weil man das jetzt gewohnt ist die letzten paar Jahremuss das ja nicht immer so weiter gehen ich meine die letzten paar Jahre waren halt ehlächerlich was Entwicklung angehtguckt euch mal an mein mein mein zusammenbau pc zusammenbau videohabe ich was mit selbstbau habe ich es genannt oder sowas hierich weiß gar nicht wo ich es hab hierja also mein pc bild das ist drei jahre alt das letzte und das ist immer noch high endnach drei jahren überlegt euch das malguck mal das war noch zeiten wo ich viele viele videos gemacht habewarum habe ich denn warum habe ich den big shock thumbnailhier da ist es doch mein neuer rechnerso das habe ich vor über drei jahren gemacht und der rechner ist immer noch high endokay vielleicht nicht mehr high high high end aber immer noch über über die ganze eckeüberdurchschnitt ja mit den übertakten 8700k und 1080tihigh end nicht mehr okay das stimmt aber immer noch top top 5 bis 10 prozent jaerstmal 200 dislikes ja die 200 dislikes gibt es für meine krasse kameraführung glaubeichborgas kameraführung habe ich hier gemachtja das kann doch nicht sein also die letzten jahre war man es halt einfach gewohnt dassdie entwicklung nicht vorwärts geht aber man muss sich doch wirklich nicht beschwerenwenn man eine 2070 super gekauft hat vor einem jahr dass jetzt eine schnellere grafikergerade rauskommt und die weniger kostet ich habe mich früher gefreut jetzt kommt wiederboomer story ja ich weiß ich habe mich früher gefreut dass ich nach zwei jahren noch farcry spielen konnte auf meinem rechner das ist nämlich ich hatte nämlich einen rechnerder quasi schon eineinhalb zwei jahre alt war als far cry rausgekommen ist ich wollteunbedingt far cry spielen und es lief halt in low details noch da habe ich mich übelstgefreut dass es in low details noch läuftund heute ist es so nach drei jahren einmal high end pc gekauft immer noch high end pclull wenn es nach mir geht darf das ruhig wieder schneller gehen wird es aber wahrscheinlichnicht wird es aber wahrscheinlich nicht weil es immer komplizierter wird gerade bei cpusdort irgendwelche bahnbrechenden dinger zu machen früher war es einfach warum das früherso gut funktioniert hat mit cpu leistung ist ganz einfach du konntest einfach eine cpu2 jahre später eine cpu einbauen die hat doppelt so schnell getaktet hat ein paar zusätzlichebefehle gehabt und war halt einfach doppelt so schnell ohne dass man was für machen musstedas war ja der riesen vorteil von den cpus zu den zeiten wo es noch single core cpusgab aber auch immer höhere taktraten der riesen vorteil davon war niemand wusste musstewas ändern also sprich die spiele und die anwendung liefen von heute auf morgen einfachdoppelt so schnell weil die cpu doppelt so schnell getaktet war es musste keiner irgendwieanfangen multithreading optimieren oder irgendwelche speziellen befehlsetze benutzen dass es besserwird irgendwas in der rechnung nix einfach neue cpu bärmen alles doppelt so schnelldas waren wirklich easy zeiten was das angeht einfach neue cpu und so riesen sprünge gibtes ja da halt nicht mehr was sie jetzt machen ist sie bauen immer mehr kerne ein aber malganz im ernst das wird das ist jetzt auch vorbei mit mehr kerne einbauen weil spätestenswenn jetzt sagen wir mal 10 plus kerne mainstream sind dann wird sich da auch nicht mehr soviel tun weil ich mein was willst du machen was brauchst du was kannst jetzt zwar 20kerne einbauen aber wozu also was was ist der vorteil davon das bringt das bringt jaden meisten leuten gar nichts ob 10 kerne 20 kerne bei den meisten schon ob 6 kerne10 kerne 20 kerne macht kaum unterschied das heißt du kannst mit der takt rate es nichtmehr raushauen und du kannst es ab spätestens diesem jahr oder ab aller spätestens nächstenjahr kannst du es auch nicht mehr mit mehr kerne raushauen also sprich was sollen dienoch großartig machen um die cpu schneller zu machen denn bleibt ja nur das nur das üblicheüber halt gucken dass man vielleicht bisschen mehr takt hinkriegt dass man die sachen effizientermacht also sprich quasi dass die befehle die die cpu ausführt dass die quasi mit wenigertakt zyklen auskommen das ist aber alles erst bei optimierung die bringt keine quansprüngeund da müssen wir uns glaube ich darauf einstellen wenn da jetzt nicht noch irgendwie was kommtan das keiner denkt dass ich den nächsten jahren auch cpu-mäßig wieder nicht allzuviel tun wird also die die riesen sprünge von 2000 keine ahnung von von 95 bis 2010die sind vorbei ja und dass man irgendwie mal den brauchbaren quanten computer daheimhat habe ich immer eine zweifel zumindest zumindest in nächster zeit was wir das hiernoch so mitkriegen aber jetzt in nächster zeit weil damit hast du ganz andere problemekannst du den überhaupt für so general purpose berechnungen gescheit verwenden in manchensachen ist es mit sicherheit sinnvoll damit was zu machen aber für so die 015 dinge dieman daheim macht ist fraglich ob das damit überhaupt läuft oder ob es schneller läuftoder überhaupt performant läuft das ist ja alles noch zukunftsmusik ja jolly joker sechsmonate massive subscription dankeschön seh so sieht es aus flintstone das ist das wasich damit eigentlich gerade auch umschreiben wollte das ist so ja und viele sachen istfraglich ob es damit überhaupt geht also du wirst wie wir werden wir werden es wahrscheinlicherst mal nicht überleben nicht überleben werden wir es wahrscheinlich auch nicht aberwir erst mal nicht erleben dass in den quanten computer crisis abspieler crisis juckt jadann kein mehr das was dann immer dann auch immer angesagt ist ja das weiß ich nichtob sich am desktop durchsetzen wird und mal ganz davon abgesehen ob sich jetzt arm aufdem desktop durchsetzt oder ob es weiter die stink normal x8664 bleibt die grundsätzlicheproblematik dass du nicht mehr wirklich die kerne erhöhen kannst und auch nicht mehrgroßartige riesen sprünge im takt machen kann es bleibt ja bei arm gleich unabhängigdavon was man da was man da jetzt für eine cpu drin hat da sind ja alles herkömmlichecpus entweder gibt sie dem ding mehr kerne oder gibt sie den ding mehr takt viel mehrkann es nicht machen du kannst halt du kannst halt so ein paar optimierungen machen ja aberdas ist halt nix was innerhalb von einem jahr das ding mal doppelt so schnell macht oderso das ist vorbei das ist hammer nimmer man muss aber auch sagen ehrlich gesagt man brauchtes auch gar nicht mehr ich mein heutzutage sind rechner schnell genug dass man es sicherlauben kann browser mit 50 tabs laufen zu lassen und noch fünf elektron anwendung undder ram verbrauch bei 10 gigabyte ist und allein schon eidel das ding 15 prozent auslastunghat aber es juckt kein weil es nicht schnell genug istalso ich beziehe mich jetzt auf cpus das heißt ja nicht dass wir in anderen gebieten nichtfortschritte erzielen können und wenn mal einer irgendwelche big brain ideen hat wasman bei cpu so machen kann er dann geht das auch wieder aufwärts aber aktuell sehe iches halt nicht weil du konntest 1995 bis 2010 konntest du super skalieren über die taktrate2010 bis 2020 so konntest du noch noch halbwegs super skalieren über mehr cpu kerne aberdas ist vorbei viel mehr taktrate wird es erstmal immer geben und viel mehr kerne bringtes nicht so und nun ja was machen wir jetzt das wird auch so sein also ich gehe davonaus dass wir in nächsten jahren einiges sehen werden in richtung neuer neue verwendungszweckeja sowas wie walken zum beispiel oder was jetzt teilweise mit x12 machen die nächstenjahre werden wir auf jeden fall viel viel viel viel mehr machine learning geschichten sehenweil das ist was wofür sich performance wirklich lohnt also wie gesagt sowas wie rx voice undsowas das ist erst der anfang da wird es noch viel mehr sachen geben auch echtzeitbilderkennung bildklassifizierung alle möglichen geschichten also gerade was machine learningangeht wird sich die nächsten jahre extrem viel tun und da kann es eh nicht genug leistunghaben ja das kann gut sein wobei speicherbandbreite halt heute auch bei den meisten sachen nichtwirklich das problem ist nein glaube ich nicht hat sich ja auch nicht ich meine macht stadiaso wie macht stadia so aktuell lebt es noch ja ich meine du musst dir nur mal stadia destinyplayer account angucken moment mal wie hieß denn wie hieß denn diese destiny stats seitedestiny stats ne wie ist das irgendwie charles oder so das da genau war das nicht karl dergroße oder irgendwie sowas ich weiß woher ist geschichte und sowas so da gibt es beispielsweisehier also 35 prozent spielen auf steam 33 prozent spielen playstation 37 prozent spielenspielen xbox so was meinst du wie viel prozent stadia spielen moment ich muss mal kurzreinzoomen mehr reinweilen zum kann ich nicht also exzellent also hat sich die frage glaubeich ob sich das durchsetzt irgendwie schon erübrigt und destiny war eines der top dingermit ins gelauncht ist ja war umsonst weil sogar umsonst oder ist noch umsonst das nichtdas ist wahrscheinlich weniger wird aufgerundet ja und du siehst ja auch kaum einer spieltendgame hier ja das ist es das ist ja die sache game streaming ist so ein ding dashört sich von der idee gut an aber ich habe also ich habe mir damals auch vor einer weileschon gedanken darüber gemacht ich dachte auch dass im game streaming eventuell maldie zukunft liegen könnte eben gerade für die ganzen mainstream mainstream sachen aberwenn man mal ehrlich ist das ist zumindest das was ich mir dazu zusammengesprochen habeglaube ich gibt es gar nicht so viele leute für die game streaming die game streaminganspricht weil du hast die ultra casual bobs die spielen auf ihrem smartphone die interessierensich wahrscheinlich noch nicht mal für die spiele die es auf stadia oder game streaminggibt die wollen was ist denn grad das neueste geile mobile game keine ahnung ich kennemich da nicht aus ja früher war es mal fahren will aber fahren will würde ja mittlerweileabgeschaltet ja die die wollen die wollen ihr mobile gedöns spielen okay die kennendie ganzen pc spiele gar nicht wollen die gar nicht spielen so also du hast die 0815casual mobile noobs die sprichste wahrscheinlich mit stadia auch nicht großartig an so werwen spricht stadia an die leute die sich quasi für pc spiele interessieren aber keinenpc haben und wie viele gibt es davon wirklich die sagen ich ziehe stadia vor einem neuenpc bild das glaube ich da gibt es nicht so viel das müsste ja dann wirklich jemand seinder an pc games interessiert ist der allerdings mit den einbußen oder den den den rahmenbedingvon stadia leben kann der quasi pc interessiert ist aber sich dafür entscheidet nicht dasgeld für neuen pc auszugeben ich glaube das gibt es nicht viele ich glaube da gibtes nicht so viele zumal man sich die sachen auf stadia nach wie vor kaufen muss ich glaubeda gibt es echt nicht so großen ich dachte auch ursprünglich dass das ein riesen dingsein wird aber da gibt es glaube ich einfach nicht so viele leute die das anspricht mitstadia ja und geforce now war eine gute idee aber geforce now ist ja mittlerweile auch schonziemlich abgekackt weil die ganzen spieleanbieter ihre spiele rausgenommen haben am anfang fandich das eine geile idee aber mittlerweile haben wir ganz viele spiele rausgenommen ja doppeltkaufen ist eh hängen geblieben ja aber das macht keiner das ist das habe ich mir auchgedacht die idee ist interessant aber überlegt mal wenn du jemand bist der wirklich interessiertist in pc spielen dann musst du erstens niemand sein der am competitive aspekt von pc spielinteressiert ist weil bist du am competitive aspekt von pc spiel interessiert wirst duniemals stadia spielen oder generell games spielen würdest du niemals machen das heißtdu musst an pc spiel interessiert sein du musst dich dagegen entscheiden neuen pc zukaufen mit dem du ja quasi dann sogar noch besser pc spiele spielen könntest du musstquasi in den pc casual sein und ich glaube die kombination gibt es einfach nicht so oftdu musst du musst in den pc casual hipster apple fan sein so in der richtung apple verletzterweg das ist das ist komisch das passt irgendwie nicht so richtig zusammen deswegen habe ichda auch total falsch gelegen wo ich am anfang gedacht habe ja das wird ein großes ding aberwenn man genauer darüber nachdenkt gibt es da echt nicht so viel auf die stadia jetztgut passt gibt es hier stadia active player active users gibt es active users ja reaches1 million users das interessiert doch kein mensch was ich damit irgendwann registrierthatwie viel installiert hat juckt ja nicht das ja captain falcon leute die viel unterwegssind das ist auch noch vielleicht so eine nische wo ich mir das gut vorstellen aberdann darfst du halt nicht in deutschland großartig unterwegs sein weil dann hast du kein internetich meine es ist es ist zumindest definitiv nicht tot es sind 2,8 k leute online auf redditfür stadia und es gibt im minuten tag neue posts ok die spielen bomba man online ja genaudafür brauche ich stadia unbedingt da habe ich drauf gewartet dass ich bomba man onlinespielen kann auf stadiahätten sie das ding nicht xbox scarlet nennen können anstatt xbox series x oder xbox seriess oder wie auch immer es jetzt heißt was die was die für ein crap spielen hierirgendwelche gamer grills die werbung posten auf auf stadia auf dem stadia reddit achdas ist einfach nicht das ding und ich könnte mir vorstellen wenn google nicht bedenkenhätte dass man das feld nicht anderen überlassen will oder wenn man einen fuß in der gamingwelt behalten will das ist ja das was wahrscheinlich google nach wie vor will mit stadia dass keinanderer das groß macht wo vielleicht potential ist was sie noch nicht erkannt haben und dasssie einen fuß drinnen behalten ich glaube da hätte google das schon eingestellt googleist zackig mit einstellen stadia active users gibt es da irgendwie was 2020 active usersletzten monat gibt gar nichts dazu aber es ist ja schon eine gewisse sache also man kannja schon erkennen daran dass es keine aktuellen user zahlen gibt dass die nicht allzu gutsein können weil immer wenn die user zahlen gut sind veröffentlichen die hersteller userzahlen guckt euch an wo hat jahre lang user zahlen veröffentlicht und als es bergabging haben sie auch nicht mehr drauf auf wort hatte glaube ich auch am anfang irgendwelchewagen um schreibung veröffentlicht immer haben sie auch eingestellt gibt gibt einigesachen gibt ist google stadia flopp ok wenn wenn ich google frage ob google stadia einflop ist ich glaube das ist keine allzu gute idee max würdest du voter von kabel internetempfehlen kommt darauf an was du für alternativen hast was hast du denn für alternativen googlekann sich das leisten das stadia mal competitive irgendwie was reisen wir glaube ich nichtja bettel viel ist gratis für prime user wer es noch nicht hat holt euch thomas coolsieben monate excellent subscription telekom 50.000 fang ich auch schon mit 50.000 an telekom50 mbit und eins und eins ist telekom resale das ist mehr oder weniger das gleiche alsowas ich mal an deiner stelle gucken würde ob es lokalen anbieter gibt der vielleichtwas besseres hat das ist immer sinnvoll zu gucken und ansonsten ganz ehrlich würde ichwahrscheinlich voter vornehmen bei dieser auswahl telekom ja genau kilobit ne telekom ist meistensganz gut wenn die 50 mbit schreiben haben die auch 50 mbit bei voter von ist halt soein ding voter von ist halt eigentlich übelster übelster krepp krepp anbieter aber bei mirdie einzig die einzige alternative zur telekom ne halt halt lächerlich irgendwo deine meinungzu far cry 6 ich muss dir ehrlich sagen ich habe mir far cry 6 die neuesten sachen überhauptnicht mehr angeguckt wusste gar nicht dass da neugierd zu gibt den trailer fand ich ganznice was ich auch witzig finde kennt ihr schon das gerücht dass der junge aus dem far cry6 trailer der da dass es angeblich war es ist wie ihre jung war das war ja so ein ding dasging durch ganz reddit so nach dem motto da waren die da waren die ganzen big brain gameanalisten wieder wieder dabei wurde doch bestätigt wurde das also wenn sie das bestätigt haben dannhaben sie ziemlich die lore von far cry 3 durcheinander gebracht die haben die leutehaben dann auch analysiert guck mal hier er hat über dem er hat irgendwie eine wunde über demaugenbrauen und und was hat auch die wunde über den augenbrauen und und wirklich ähnlich siehtdem halt nicht darum nicht dass es bestätigt wurde weil war es wurde auf also laut far cry 3lore wurde war es auf diesen komischen insel da im urwald geboren oder so also keine ahnungletztendlich lore interessiert eh kein also mich erst recht schon mal nicht aber so bei manchengelten gucke ich ein bisschen die geschichte an aber im zweifelsfall wird die sachen totalverbogen dass es halt für einen neuen teil reinpasst bestes beispiel ist wo alter wohalt haben ihre lore auch so krass verbogen da blickt keiner mehr durch und spätestensals sie auf die idee gekommen sind noch eine alternative zeitlinie einzuführen in wo warvorbei das sage ich als jemand der nie world of warcraft groß gespielt hat hast du schonvon gpt 3 gehört das sagt mir irgendwas ich kann es gerade nicht zu und ich weiß nur dasses mit partitions tabellen in dem fall wahrscheinlich nichts zu tun hat das ist das ist in der maschinelearning geschichte das ist das war in der maschine learning geschichte ist das diek.i. ist das ist das ist das die k.i. die texte schreiben kann die irgendwelche sachenschreiben kann war die das ich krieg's ich krieg's nicht mal ganz ganz zusammen waswas mir beim thema k.i. immer wieder einfällt wenn es um k.i. geht die texte schreibenkann war dieser versuch von dem k.i. microsoft bot habt ihr das mitgekriegt das ist aberschon ein bisschen her die haben microsoft hatten einen twitter bot programmiert mitmachine learning backend und der sollte dann der sollte dann quasi zeugs auf twitter lernenso und das hat dann irgendwie zwei tage gedauert dann hat das übelst nazi kram von sich gegebender bot genau der bot der rechtsextreme genau den mein ich den mein ich das hat nicht langgedauert zwei drei tage und dann hat er irgendwelchen kram gepost und dann haben sie wieder abgeschaltetdas war schon fail microsoft nazi bot twitter twitter ane nicht past month ok ist schonso weit herguckt euch das mal an guckt euch mal an was der bot getweetet hat i fucking hate feminizationall day nice bot microsoft sehr gut programmiert excellent ja voll verschissen ne ne das warder von microsoft hier guckt microsoft ja die haben verkackt es ist schon vier jahreher hätte ich gar nicht gedacht dass das so lange her ist guckt da schreibt auch hitlerhatte recht unser zeug hier diese also der bot das ging echt in die hose ist troll botist nicht tos image screenshots von einem fail bot zu zeigen von microsoft kann keintos sein sag ich nicht ich wie gucken sie bilder von bot an oh man troll bot ja ja wenndu den heute trainierst ist wahrscheinlich noch schlimmer oh man ja das war fail suchmal nach gpt try interview ne das kann ich vielleicht im nächsten stream machen ähmich muss jetzt erstmal ins bett ich bin müde ähm ne der hat das gelernt von anderen twitterusern der hat es aus tweets gelernt von anderen leuten und da kam halt sowas raus jaalles klar leute wir sehen uns morgen bis denn machts gut ich geh pennen see you", "segments": [{"id": 1, "start": 30.0, "end": 44.36, "text": "So Leute, ich bin mal kurz am Start nochmal, ich hab gedacht, komm 21 Uhr, hat keinen Sinn"}, {"id": 2, "start": 44.36, "end": 49.52, "text": "jetzt noch irgendwie rum zu basteln bis 22, 23 Uhr, machst einfach nochmal kurz Stream"}, {"id": 3, "start": 49.52, "end": 56.52, "text": "an, muss das Twitch nur noch mitkriegen und ich muss mein Streaming Rechner starten,"}, {"id": 4, "start": 56.52, "end": 59.8, "text": "dass ich überhaupt ne Vorschau hab, so lange, dass ich den Kram hier mal eingeblendet."}, {"id": 5, "start": 59.8, "end": 67.76, "text": "Moin Captain CK, ah jetzt hier, Notifications sind raus, wie es aussieht, find das immer"}, {"id": 6, "start": 67.76, "end": 71.36, "text": "lustig, jetzt kommen immer so 3, 4, 5 Leute auf einen Schlag so instant rein."}, {"id": 7, "start": 71.36, "end": 81.24, "text": "Was jetzt, sind 2 Streams am Laufen, Anzeige ist raus und ich muss eh nochmal ne Vorschau"}, {"id": 8, "start": 81.24, "end": 86.32, "text": "starten und ich bin noch nicht lang da, hab gedacht, ich mach nochmal Stream an, bevor"}, {"id": 9, "start": 86.32, "end": 94.64, "text": "ich ins Bett geh und es hat auch keinen Sinn, rum zu basteln bis vor, weiß nicht, wie das"}, {"id": 10, "start": 94.64, "end": 102.28, "text": "bei euch so ist, wenn ihr an Zeug rum bastelt, bis dann, wenn ihr schlafen geht, dann denkt"}, {"id": 11, "start": 102.28, "end": 107.0, "text": "man die ganze Nacht über diesen Krack nach, weiß nicht, ob ihr das auch kennt und wenn"}, {"id": 12, "start": 107.0, "end": 115.12, "text": "man vorher aufhört, ein bisschen früher, dann gehts eigentlich, aber gerade wenn man"}, {"id": 13, "start": 115.12, "end": 122.2, "text": "an irgendwelchen Problemen sitzt und rum bastelt und dann direkt ins Bett geht, dann"}, {"id": 14, "start": 122.2, "end": 127.52, "text": "ist man die ganze Nacht damit beschäftigt und träumt da teilweise auch von, ich hab"}, {"id": 15, "start": 127.52, "end": 131.44, "text": "schon ein Scheiß teilweise geträumt, weil ich bis kurz vor ins Bett gehen an irgendwelchen"}, {"id": 16, "start": 131.44, "end": 138.48, "text": "Sachen rum gebastelt hab, so wie gesagt, ich muss so kurz mein Streaming Rechner anmachen,"}, {"id": 17, "start": 138.48, "end": 158.4, "text": "dass ich was sehe, exzellent, so, das funktioniert jetzt jawoll, funktioniert alles sehr gut,"}, {"id": 18, "start": 158.4, "end": 176.64, "text": "ja Leute, ich muss euch mal was sagen, und zwar, irgendwie, seitdem ich jetzt die letzten"}, {"id": 19, "start": 176.64, "end": 181.2, "text": "paar Tage, jeden Tag, mehr oder weniger gestreamt hab, irgendwie tut mir der Hals weh, ich hoffe"}, {"id": 20, "start": 181.2, "end": 186.84, "text": "aber nicht, dass das am Abend zu viel reden liegt, aber was solls sein, es wird ja wohl"}, {"id": 21, "start": 186.84, "end": 198.72, "text": "kaum Corona sein, davon tut der Hals nicht weh, schlecht copypasted, das funktioniert"}, {"id": 22, "start": 198.72, "end": 212.12, "text": "im Discord, allerdings, Lowbrain, Sachen hier, das Ayaya-E-Mode vom Discord kopiert, kipp."}, {"id": 23, "start": 212.12, "end": 229.76, "text": "So, ok, wunderbar, jetzt hab ich auch die Vorschau an, jetzt kann ich noch mal gucken,"}, {"id": 24, "start": 229.76, "end": 243.72, "text": "was es gibt, was ich aufgeschrieben hab, ich hatte heute einen ganz merkwürdigen Windows-Fehler,"}, {"id": 25, "start": 243.72, "end": 248.28, "text": "das hab ich zum ersten Mal gehabt, weiß nicht ob man das hier noch sieht, dieses Side-Menü"}, {"id": 26, "start": 248.28, "end": 260.08, "text": "verwendet eh keiner, der hat mir irgendwie erzählt, Windows Disk Error Reboot, hier,"}, {"id": 27, "start": 260.08, "end": 266.56, "text": "Restart to Repair Drive Errors, hab ich noch nie gesehen, ich hab keine Ahnung was der"}, {"id": 28, "start": 266.56, "end": 274.12, "text": "eigentlich will, das da, was ist das, ist das Smokers Smoke, ist meine Festplatte kaputt"}, {"id": 29, "start": 274.12, "end": 282.96, "text": "oder, so ein komisches Ding, vor allem, das ist so eine typische Kack-Windows-Fehlermeldung,"}, {"id": 30, "start": 282.96, "end": 287.56, "text": "richtiger Crap die Fehlermeldung, da steht nicht was genau kaputt ist, da steht nicht"}, {"id": 31, "start": 287.56, "end": 293.36, "text": "welche Platte kaputt ist, da steht nichts im Endeffekt drin, schaut ihr mal Hacking 101"}, {"id": 32, "start": 293.36, "end": 299.48, "text": "vom Humble Bundle an, humble Bundle, gucken wir, das ist wirklich klassisch Windows die"}, {"id": 33, "start": 299.48, "end": 306.28, "text": "Fehlermeldung, ich mein dieses komische Notification-Center mal ehrlich, oder wie der Kaboom gesagt hat,"}, {"id": 34, "start": 306.28, "end": 310.12, "text": "Hand aufs Herz, das benutzt doch keine Sau oder, benutzt das jemand von euch, hab das"}, {"id": 35, "start": 310.12, "end": 315.04, "text": "glaube ich schon 50 mal gefragt, aber den Kram den verwendet noch keiner, den einzigen"}, {"id": 36, "start": 315.04, "end": 328.04, "text": "Daseinsberechtigung die das hat, ist zum Bluetooth an und ausschalten, das einzige hier Bluetooth,"}, {"id": 37, "start": 328.04, "end": 339.04, "text": "was macht denn das, oh, Big Brain Modus, dass sowas jetzt eingebaut ist in Windows, es geht"}, {"id": 38, "start": 339.04, "end": 351.4, "text": "nicht mehr aus, es geht nicht, ah jetzt, es geht erstmal nicht aus, ok alles klar, also"}, {"id": 39, "start": 351.4, "end": 358.12, "text": "was soll ich mir gerade gucken, Hacking 101, ach ne Moment, da, hier, das da, das Hacking"}, {"id": 40, "start": 358.12, "end": 368.16, "text": "Humble Bundle, Hacker Mans am Start hier, exellent, Hacking Humble Bundle, ok zeig ich mal her,"}, {"id": 41, "start": 368.16, "end": 376.44, "text": "was gibt's denn da, hier genau, wie gesagt Bluetooth kann ich verstehen, aber ansonsten,"}, {"id": 42, "start": 376.44, "end": 384.2, "text": "für was, für was sonst, ja, also der hat rebooted aber keinen Checkdesk oder irgendwas"}, {"id": 43, "start": 384.2, "end": 392.28, "text": "gemacht, so ok was gibt's denn da, 16 Tage, Hacking Art of Explo, Exploitation, das kann"}, {"id": 44, "start": 392.28, "end": 400.88, "text": "ich nicht aussprechen, Sicherheitslücken ausnutzen, Sicherheitslücken ausnutzen, Exploitation,"}, {"id": 45, "start": 400.88, "end": 406.6, "text": "die are all sitting in one boat, ja, ich weiß nicht wie man das richtig ausspricht, Carhackers"}, {"id": 46, "start": 406.6, "end": 413.08, "text": "Handbook, und dann irgendein so ein Olin Kokona Auto drauf, Metasploit, ok das ist wahrscheinlich"}, {"id": 47, "start": 413.08, "end": 417.0, "text": "echt nicht schlecht, ich kenne davon keins ehrlich gesagt, aber da ein bisschen was"}, {"id": 48, "start": 417.0, "end": 425.4, "text": "zuzuwissen ist nicht verkehrt, so und dann gibt's auch noch irgendwelche Aliens, so Practical"}, {"id": 49, "start": 425.4, "end": 432.04, "text": "Packet Analysis, ich glaub das soll wirklich gar nicht schlecht sein, das hab ich schon"}, {"id": 50, "start": 432.04, "end": 438.16, "text": "mal irgendwo, falls das das ist, das hab ich schon mal irgendwo was von gehört, ja ich"}, {"id": 51, "start": 438.16, "end": 453.76, "text": "glaub das ist wirklich gar nicht so scheiße, ähm, macht mir nix, Practical Packet Analysis,"}, {"id": 52, "start": 453.76, "end": 460.32, "text": "ähm, ja kann ich auch nix zu sagen, so und jetzt wenn man noch mehr ausgibt, ok jetzt"}, {"id": 53, "start": 460.32, "end": 466.28, "text": "mal, Leute ich muss jetzt mal was sagen, ich glaub ich hab mir noch nicht ein Humble Bundle"}, {"id": 54, "start": 466.28, "end": 472.08, "text": "geholt, noch nie, wie funktioniert denn das, wenn ich jetzt ein Euro ausgebe, krieg ich"}, {"id": 55, "start": 472.08, "end": 478.88, "text": "das, ok das hab ich verstanden, wirst du die Cookies, nö, das hab ich verstanden, wenn"}, {"id": 56, "start": 478.88, "end": 485.48, "text": "man Euro bezahlt kriegt man das, so wenn man quasi 6,77 Euro bezahlt kriegt man das, aber"}, {"id": 57, "start": 485.48, "end": 495.88, "text": "sind es 6,77 Euro oder 7,77 Euro und ist das immer, also addiert sich das immer, also sprich"}, {"id": 58, "start": 495.88, "end": 505.16, "text": "sind das hier 8,46 Euro oder sind das quasi 1 Euro plus 6,77 Euro plus 8,46 Euro, nee"}, {"id": 59, "start": 505.16, "end": 524.4, "text": "ok, ah ja, ah verstehe, ok, also was gibt's denn sonst noch, dann gibt's Binary Analyse"}, {"id": 60, "start": 524.4, "end": 536.56, "text": "und Malware Data, Data Science, exzellent, ähm, Linux Hacker, was ist das für ein Kava"}, {"id": 61, "start": 536.56, "end": 543.24, "text": "Alter, ähm, Linux Command Line, ok ich hab kein, es sagt mir alles gar nichts, das ist"}, {"id": 62, "start": 543.24, "end": 550.08, "text": "sicherlich nicht schlecht zu wissen, Verschlüsselung, warum gibt's keine 18,77 die man bezahlen"}, {"id": 63, "start": 550.08, "end": 560.32, "text": "kann, warum gibt's keine 13,37 die man bezahlen kann und dann gibt's hier noch Hood Kids Black"}, {"id": 64, "start": 560.32, "end": 568.92, "text": "Hat Go, Alter, Leute, ich muss euch jetzt mal was zeigen, fuck das übelst ab Avira,"}, {"id": 65, "start": 568.92, "end": 572.36, "text": "ich weiß gar nicht warum ich Avira auf meinem zweiten Rechner noch drauf hab, hier guckt"}, {"id": 66, "start": 572.36, "end": 580.12, "text": "mal, der Müll ploppt da laufend auf, guckt euch doch mal diesen Kack an, Pains Champ,"}, {"id": 67, "start": 580.12, "end": 586.08, "text": "ist das ein Anti-Virus oder ist das ein Virus, der mich irgendwie Scareware mittlerweile,"}, {"id": 68, "start": 586.08, "end": 594.12, "text": "was soll denn der Kack, die sollen mich in Ruhe lassen, ich deinstallier das jetzt, einfach"}, {"id": 69, "start": 594.12, "end": 598.48, "text": "runter, wie gesagt auf meinem Rechner, das hab ich mal irgendwann vor 5 Jahren oder 6"}, {"id": 70, "start": 598.48, "end": 604.16, "text": "Jahren, immer wenn der Rechner neu war, da hat man noch Avira benutzt, hab ich das verwendet,"}, {"id": 71, "start": 604.16, "end": 609.6, "text": "jetzt weg, also ich kann jetzt in den Büchern nichts sagen, ich kenn davon nichts, das einzige"}, {"id": 72, "start": 609.6, "end": 618.44, "text": "was mir glaub ich irgendwie bekannt vorkommt war das da und sonst kein Schimmer, ich hab"}, {"id": 73, "start": 618.44, "end": 621.8, "text": "das ja hier drauf hab ich dann nicht installiert, ich hab das auf dem Rechner damals vor 6 Jahren"}, {"id": 74, "start": 621.8, "end": 628.36, "text": "oder 7 Jahren installiert, auf dem alten, den ich als Streaming Vorschau jetzt verwende"}, {"id": 75, "start": 628.36, "end": 637.32, "text": "und da ist das halt immer noch drauf, das ist, ansonsten hat das keinen Sinn, hier hab"}, {"id": 76, "start": 637.32, "end": 646.8, "text": "ich auch nur Windows Defender drauf laufen, das reicht doch ehrlich gesagt, ach ich glaub"}, {"id": 77, "start": 646.8, "end": 655.16, "text": "ich deinstallier das, das Relaxing Video Game Music, zeigt mal her, die hier ist mir fast"}, {"id": 78, "start": 655.16, "end": 665.28, "text": "schon ein bisschen zu Relaxing, aus Skyrim Stels, ok die ist mir auch ein bisschen zu"}, {"id": 79, "start": 665.28, "end": 685.96, "text": "Relaxing, ein bisschen Sound brauchen wir da schon im Hintergrund, so, ich muss mal kurz"}, {"id": 80, "start": 685.96, "end": 695.24, "text": "mein, ich muss mal ganz kurz schnell mein Tablet holen, ich hab mir hinter 2 Videos"}, {"id": 81, "start": 695.24, "end": 702.68, "text": "drauf gespeichert, die ich mit euch gucken wollte, wie sieht denn Audio Setup aus, also"}, {"id": 82, "start": 702.68, "end": 709.72, "text": "ich hab nen Bayer Dynamics MMX300 auf, das geht an so einen kleinen Mixer, der geht dann"}, {"id": 83, "start": 709.72, "end": 715.8, "text": "per USB in den Rechner und der zweite Ausgang geht in mein Audio Interface, das Audio Interface"}, {"id": 84, "start": 715.8, "end": 720.2, "text": "brauch ich zum Beispiel, dass ich dann mich selbst einspielen kann wieder auf den Hörer,"}, {"id": 85, "start": 720.2, "end": 723.64, "text": "dass ich nicht so rumschreie, weil das ein geschlossener Kopfhörer und da drüber kann"}, {"id": 86, "start": 723.64, "end": 727.8, "text": "ich dann auch an der Konsole Voice Chat machen und solche Geschichten, also ich hab 3 Sachen,"}, {"id": 87, "start": 727.8, "end": 734.28, "text": "ich hab hier mein Headset am Start, dann so nen Minimixer und nen Audio Interface, der"}, {"id": 88, "start": 734.28, "end": 754.68, "text": "auch noch mal 24 Eingänge oder sowas hat, mit Adapter, schon mal kurz, ah, ah, ah,"}, {"id": 89, "start": 754.68, "end": 768.24, "text": "ah, ah."}, {"id": 90, "start": 768.24, "end": 776.84, "text": "So also Du updates 3 Stunden Windows was updatet denn dann alles eh, man 3 Stunden, megah Command"}, {"id": 91, "start": 776.84, "end": 780.2, "text": "Windows, Windows ist nicht das schnellste was upper understand angeht und auch nicht"}, {"id": 92, "start": 780.2, "end": 783.52, "text": "das Fehler, äh, äh, resistenteste, ja?"}, {"id": 93, "start": 783.52, "end": 785.52, "text": "Aber drei Stunden ist schon ordentlich."}, {"id": 94, "start": 796.2, "end": 798.2, "text": "Genau, das wollte ich gucken."}, {"id": 95, "start": 800.04, "end": 800.54, "text": "Ja."}, {"id": 96, "start": 807.04, "end": 809.04, "text": "Was wollte ich mir angucken?"}, {"id": 97, "start": 809.04, "end": 811.04, "text": "Hier könnte ich das Spiel dran strez."}, {"id": 98, "start": 811.04, "end": 813.04, "text": "Wir haben hier eh nicht allzu viel Zeit."}, {"id": 99, "start": 814.56, "end": 816.56, "text": "Oh, Leute, wisst ihr was?"}, {"id": 100, "start": 816.56, "end": 824.96, "text": "Wenn, wenn der Chat mal wieder, äh, hier, wenn der Chat mal wieder low-prane ist, da hab ich schon die passende Bestrafung für."}, {"id": 101, "start": 824.96, "end": 830.08, "text": "Passt mal auf, what's new in PHP 8 müsst ihr euch dann angucken."}, {"id": 102, "start": 830.08, "end": 839.84, "text": "Wenn ich mal stehlig auf dem Chat bin, dann mach ich die neuen PHP 8 Features an."}, {"id": 103, "start": 839.84, "end": 843.12, "text": "Felix, 15 Monate, Dankeschön für den Sub."}, {"id": 104, "start": 843.12, "end": 845.12, "text": "Das ist ja schon richtig."}, {"id": 105, "start": 852.08, "end": 854.08, "text": "Äh, wen haben wir denn sonst noch hier?"}, {"id": 106, "start": 854.08, "end": 856.08, "text": "Leuchtpapier, zwei Monate, eine Dankeschön für den Sub."}, {"id": 107, "start": 856.08, "end": 858.08, "text": "Huge."}, {"id": 108, "start": 858.08, "end": 879.52, "text": "Ja, guck mal, aber man sieht mal, was ich übrigens, was ich übrigens nicht so ganz checke ist, es gibt irgendwie ein Video, vor drei Jahren, new features in PHP 8 und jetzt ist es, ist es, ist es rausgekommen vor einer Woche oder so, was auch immer."}, {"id": 109, "start": 879.52, "end": 896.0, "text": "Ja, aber das ist nicht das Video, was ich gucken wollte. Ich find's, find's nicht. Ich merk mir das meistens nicht, welche Videos, ich speichere mir das einfach immer an, später angucken und, joa, ach, was weiß ich, was nix drin ist."}, {"id": 110, "start": 896.0, "end": 903.04, "text": "Ich muss ja demnächst auch wieder Weihnachtsgeschenke kaufen, dann bin ich so unglaublich kreativ los, was das Ganze angeht."}, {"id": 111, "start": 903.04, "end": 926.48, "text": "Zu PHP fällt dir das ein... Hä? Zeig mal her. Den Witz verstehe ich nicht. Zeig mal. Muss ich mal gucken, ob ich zu, zu low-brain bin, das zu verstehen. Also, working at Pornhub, oh, Monka Toss."}, {"id": 112, "start": 926.48, "end": 939.12, "text": "Nee, nee, ich glaube, da kommt jetzt nix, das ist programmer-humor. Also, working at Pornhub, Pornhub-Adult-Content-Montreal-Links, okay, deswegen ein Job-Job-Angebot, NSFW."}, {"id": 113, "start": 939.12, "end": 968.64, "text": "Okay, zu PHP? Okay, I'm interested, but... Ja, okay, jetzt hab ich's kapiert. Hat gedauert. Ja, ich mein, mal im Ernst, das ist aber wirklich so, es interessiert doch keiner, ob du bei Pornhub arbeitest, oder wenn schon, finden's die Leute wahrscheinlich eher lustig, oder cool, oder was auch immer."}, {"id": 114, "start": 968.64, "end": 982.48, "text": "Also, keiner sagt doch heute, oh, du arbeitest bei Pornhub, oh, geh fort. Aber PHP-Entwickler zu sein, das sieht die Sache schon wieder anders aus. Aber vielleicht irgendwas lustiges noch zu bieten, ja."}, {"id": 115, "start": 982.48, "end": 1000.24, "text": "Ich brauch irgendwelche blöden Meme-Bildchen. Mein Lieblingsprogrammer-humor ist immer noch der hier. Moment, wo ist das Bild?"}, {"id": 116, "start": 1000.24, "end": 1029.68, "text": "Oh nee, wo ist das Bild? Ah, beste. Das ist immer noch mein Lieblingsprogrammer-humor-Joke. Das ist so unglaublich doof. Und die meisten Leute, die halt mit Programmieren nix am Hut haben, die checken's halt absolut null. Aber ich find den ultra lustig."}, {"id": 117, "start": 1029.68, "end": 1041.76, "text": "Stimmt, da hast du recht hier. In den USA haben sie wahrscheinlich noch mehr Probleme mit Pornhub arbeiten, aber was auch immer. Die Australier haben ja auch ganz merkwürdige Gesetze in der Richtung, ne?"}, {"id": 118, "start": 1041.76, "end": 1063.84, "text": "Die haben ja, Australien hatte irgendwie vor ein paar Jahren so ein paar Anti-Porn-Gesetze erlassen und da sind die ganzen australischen Pornseiten umgezogen. Und ich sag, wir können das nicht mehr machen. Also, in Australien."}, {"id": 119, "start": 1063.84, "end": 1072.8, "text": "Nicht nur das. Nicht nur das. Nicht nur das. Ich weiß aus dem Kopf nicht das. Ich hab nur noch mitgekriegt, dass viele seinen umziehen mussten aus Australien."}, {"id": 120, "start": 1072.8, "end": 1093.76, "text": "Ja, Prins, ich hab immer noch so einen Mikrotik 10G-Switch hier. Den wollte ich ja eigentlich verlosen. Ich hab mir den vor über einem Jahr gekauft, den hier."}, {"id": 121, "start": 1093.76, "end": 1107.2, "text": "Zehn. Zeig mal, wo ist denn der kleine? Hier, der da. Den hab ich mir vor über einem Jahr gekauft und hab gesagt, okay, ich mach ein Video zu meinem 10G-Nas-Bild und verlose danach noch irgendwie so einen Switch."}, {"id": 122, "start": 1107.2, "end": 1116.56, "text": "So, die Sache ist nur die, ich hab den Switch nie benutzt. Also gar nicht. Ich hab das Nas-Bild auch kein Video zu aufgenommen. Ihr kennt mich ja."}, {"id": 123, "start": 1116.56, "end": 1131.76, "text": "Das heißt, ich hab das Ding immer noch am Start und ich brauch's nicht. Und ich hab mir überlegt, ob ich das nicht vielleicht an Weihnachten irgendwie dem, dem, dem, Moment, dem irgendwie zukommen lasse."}, {"id": 124, "start": 1131.76, "end": 1137.84, "text": "Da muss ich mir doch irgendwas ausdenken. Kostet normalerweise, glaub ich, 130 Euro oder sowas."}, {"id": 125, "start": 1137.84, "end": 1151.84, "text": "Ja, 130 Euro. Kriegt dann irgendeiner als Weihnachtsgeschenk. Aber ich muss mir noch überlegen, wie ich das Ganze mache. Muss man doch gucken, was wir dafür machen, dass man den gewinnen kann."}, {"id": 126, "start": 1151.84, "end": 1163.84, "text": "Wobei, gewinnen darf man ja nicht sagen. Man darf ja keine Gewinnspiele machen. Ist ja in Deutschland rechtlich nicht so. Man darf nur eine Auslobung veranstalten. Also Leute, ich veranstalte kein Gewinnspiel, ich mach eine Auslobung."}, {"id": 127, "start": 1163.84, "end": 1179.84, "text": "Das ist in Deutschland, muss man das ja alles korrekt benennen, sonst ist die Anzeige raus. Obwohl es unterm Strich genau das gleiche ist, ne. Eigentlich total bescheuert."}, {"id": 128, "start": 1179.84, "end": 1189.84, "text": "Programming-Challenge-Fellows. Ja, da muss ich mir aber irgendwas ausdenken. Vor allem muss ich mir die Ergebnisse angucken oder irgendwie bewerten. Krieg ich doch wieder nicht gebacken."}, {"id": 129, "start": 1189.84, "end": 1205.84, "text": "Liegst du dann deine Adresse auf dem Paket? Hä? Ne. Achso. Meinst du auf der Verpackung? Ne. Die Verpackung hab ich ja auch schon längst aufgerobbt. Aber an sich ist der wirklich nice."}, {"id": 130, "start": 1205.84, "end": 1217.84, "text": "Der ist halt auch kurz klein für so ein 10G-Switch, ne. Kein Lüfter, Passiv. Kannst sogar an den Schreibtisch stellen."}, {"id": 131, "start": 1217.84, "end": 1236.84, "text": "Eine CTF. Nachdem ich ja selbst keine CTFs mache, bin ich glaube ich extrem schlecht darin CTFs zu erstellen."}, {"id": 132, "start": 1236.84, "end": 1248.84, "text": "Oh ne, ich bin ultra müde. Ey, was ist denn los hier? Okay, wir gucken uns jetzt ein Video an. Also das ist ja eh nur kurzer Einschlafstream."}, {"id": 133, "start": 1248.84, "end": 1261.84, "text": "Hat jemand auch noch den Weihnachts-Einkauf-Struggle vor sich? Ich bin ja immer so unglaublich unkreativ."}, {"id": 134, "start": 1261.84, "end": 1269.84, "text": "Aber dieses Jahr muss ich den Weihnachtsgrill wenigstens nicht schenken. Oder ne, letztes Jahr auch schon nicht. Das hat sich ja von alleine wieder erledigt."}, {"id": 135, "start": 1269.84, "end": 1292.84, "text": "Ja. Und warum hat sich das erledigt? Weil ich es wieder verkackt hab. Und ich bin einfach nicht für soziale, zwischenmenschliche Interaktionen. Ja, das kriegt das nicht hin."}, {"id": 136, "start": 1292.84, "end": 1302.84, "text": "Die Mikrowellenschuhe, ja die waren tatsächlich gut. Das Slippy Schuhe waren das, die ich ihr da geschenkt hab. Genau die da."}, {"id": 137, "start": 1302.84, "end": 1313.84, "text": "Richtig Big Brain Aktion war das. Die hat sich auch gefreut, ja. Aber wisst ihr, also warum ich auch weiß, dass ich das verkackt hab?"}, {"id": 138, "start": 1313.84, "end": 1325.84, "text": "Ich hab das ja schon mal vor einer Weile erzählt. Weil ich einfach absolut nicht mehr reagiert hab. Gar nicht irgendwie weil ich auf die keinen Bock hab oder so."}, {"id": 139, "start": 1325.84, "end": 1334.84, "text": "Aber für mich sind so soziale Sachen immer extrem anstrengend. Da muss man sich Gedanken machen und sich in andere Leute reinversetzen."}, {"id": 140, "start": 1334.84, "end": 1344.84, "text": "Na, was könnte man jetzt machen? Ach ja, vielleicht könnte man mal irgendwas machen. Da muss man irgendwie mit den Leuten ein paar Stunden am Strück, was weiß ich, sich über irgendwelche Sachen unterhalten, die einen überhaupt nicht interessieren."}, {"id": 141, "start": 1344.84, "end": 1356.84, "text": "Und irgendwie fehlt mir der Antrieb für soziale Interaktionen. Und deswegen hab ich mich einfach nach dieser Weihnachtsgeschichte nie mehr ernsthaft gemeldet."}, {"id": 142, "start": 1356.84, "end": 1368.84, "text": "Und da hat die sich wahrscheinlich gedacht, der spaßt. Pech gehabt. Aber hat sie auch Recht, ne?"}, {"id": 143, "start": 1368.84, "end": 1381.84, "text": "Wer braucht schon soziale Interaktionen? Genau, wer braucht schon soziale Interaktionen, wenn er den Twitch Chat hat?"}, {"id": 144, "start": 1381.84, "end": 1392.84, "text": "FeelsBatmanZ geht in der Chat wieder hier. Ja, ich find das immer total anstrengend."}, {"id": 145, "start": 1392.84, "end": 1404.84, "text": "Weißt ihr, bei mir ist das immer so, wenn man, was weiß ich, wenn man irgendwie so, irgendwie jemanden kennenlernt oder sonst wen, dann ist man am Anfang immer noch ein bisschen motiviert."}, {"id": 146, "start": 1404.84, "end": 1415.84, "text": "Da ist man immer noch ein bisschen aufgeregt und irgendwie noch irgendwie motiviert. Aber das dauert dann bei mir nicht lang."}, {"id": 147, "start": 1415.84, "end": 1431.84, "text": "Dann meistens, wenn ich dann irgendwie mal paar ruhige 5 Minuten mal drüber nachgedacht hab und ich dann wieder irgendwas machen müsste für, dann denk ich mir immer, oh nee, jetzt musst du überlegen und das und hier und ach nee, mach lieber Stream an."}, {"id": 148, "start": 1431.84, "end": 1453.84, "text": "Das ist übrigens auch so ein Ding, wo ich sag, warte mal, wo steht's denn? Genau, das ist auch so ein Ding, wo ich mir so überlege, ey, Gamer Master Race wieder, ey."}, {"id": 149, "start": 1453.84, "end": 1470.84, "text": "Wir können das schon seit, also was heißt wir, bei euch ist ja unterschiedlich vom Alter her, aber ich kann das schon seit 25 Jahren, naja, okay, das ist jetzt vielleicht ein bisschen übertrieben seit, sagen wir mal seit 20 Jahren, ist das überhaupt kein Problem."}, {"id": 150, "start": 1470.84, "end": 1487.84, "text": "Ich kann mich, wenn's sein muss, den ganzen Tag an den Rechner sitzen, irgendwelches Zeug spielen, ab und zu mal im Chat irgendwas schreiben und dann ist gut, da ist mein Interaktionsbedarf gedeckt."}, {"id": 151, "start": 1487.84, "end": 1506.84, "text": "Nö, schock mich überhaupt nicht. Ja, ich hab sag mal so ein bisschen Sachen, das ist ja ab und zu mal ein bisschen zwei Minuten Smalltalk irgendwie mit Leuten in der Schlange beim Bäcker oder so, aber das reicht mir, ohne Scheiß, das reicht mir, das ist vollkommen ausreichend, ich hab da überhaupt keinen Bock drauf."}, {"id": 152, "start": 1506.84, "end": 1528.84, "text": "Jo, Max, habt das Wort noch nicht nackt, wie lief der Craft-Q-L-Stream? Ey, ich find das extrem, extrem, Moment. Ich hab heute auch ein paar Stunden noch dran rumgebastelt."}, {"id": 153, "start": 1528.84, "end": 1536.84, "text": "Okay, es geht nicht auf, das ist schlecht. Wenn ich keine Vorschau von den Links bekomme, dann mach ich die da drauf."}, {"id": 154, "start": 1539.84, "end": 1546.84, "text": "Also ist das besondere, okay, Moment, das gucken wir uns jetzt mal an. Das ist, wenn es von der Bundesregierung ist, ist das immer Cringe."}, {"id": 155, "start": 1546.84, "end": 1570.84, "text": "Ziemlich sicher, die können keine normalen Videos machen, die machen nur Cringe-Videos. Ach doch, das kenn, nee Moment, das kenn ich nicht, ich kenn irgendein anderes Video, wo sie irgendwie erzählt haben, wir gammeln zusammen auf dem Sofa oder sowas."}, {"id": 156, "start": 1570.84, "end": 1582.84, "text": "Das ist aber ein anderes, aber auch so eins in der Richtung. Ja, das da ist das glaube ich, wir gammeln zusammen auf dem Sofa, genau, das ist, das fand ich bisschen zum Fremdschämen."}, {"id": 157, "start": 1582.84, "end": 1602.84, "text": "Die Leute spinnen aber mittlerweile auch übelst rum. Ich bin ja immer dafür, die Sachen differenziert zu sehen, man sollte sich alle Seiten angucken, aber die Leute, die sehen mittlerweile auch echt überall irgendwelche Hate-Sachen, wo keiner ist."}, {"id": 158, "start": 1602.84, "end": 1617.84, "text": "Hier auf dieses Video, auf Twitter, weiß ich noch, wurde übelst rumgeflammt, dann gab es letztens eine Apple-Werbung, dann hat man einen Vater gesehen mit Kind, die sich auf Weihnachten gefreut haben, das war halt ein Schwarzer, und die Leute da so, davon spüle ich mich jetzt nicht angesprochen."}, {"id": 159, "start": 1617.84, "end": 1632.84, "text": "Apple, ihr verliert voll eure Zielgruppe aus den Augen, blablabla, die regen sich, über jeden Scheiß regen sich alle heute auf, das geht mir auch mega auf den Sack, das ist so schlimm. So, wir gucken jetzt jetzt aber."}, {"id": 160, "start": 1632.84, "end": 1653.84, "text": "Also, zeig mal. Dieses Stück Blech wurde mir damals umgehangen, im Winter 2020. Kurz vor meinem... Er hat ein bisschen was von, Moment, habe ich den als Emote? Ja, ein bisschen von was von diesem Pain, Pain-Ha-Ha-Typ, vergessen wie er heißt."}, {"id": 161, "start": 1653.84, "end": 1681.84, "text": "21. Geburtstag. Ich wurde für meine besonderen Leistungen im Kampf gegen Corona ausgezeichnet, und plötzlich war ich ein Held, ein Idol, ein Musterbürger. Zugetraut hätte mir das niemand. Bevor Corona ausbrach, war ich ohne Zweifel die faulste Socke, die je durch dieses Land geschlichen ist."}, {"id": 162, "start": 1681.84, "end": 1703.84, "text": "Moment, Moment, warte mal. Okay, ich hoffe das war... Also erstens haben wir eine krasse Goldkenne an, ja? Ich versuche gerade zu erkennen, was das für ein Headset ist. Das hat kein RGB. Also, das ist schon mal Fail, Headset ohne RGB."}, {"id": 163, "start": 1703.84, "end": 1713.84, "text": "Und die Monitore sind sehr weit auseinander. Wie soll denn das funktionieren? Normalerweise hat er drei und für die Kamera einen runtergenommen, oder was?"}, {"id": 164, "start": 1713.84, "end": 1734.84, "text": "Ich habe meine Wohnung so gut wie nie verlassen, zockte ohne Ehrgeiz und aß kalte Ravioli direkt aus der Dose, weil ich war zu faul sie mir warm zu machen. Meine Freunde..."}, {"id": 165, "start": 1734.84, "end": 1753.84, "text": "Also wir wissen doch, dass Klischeegeber zumindest mal fett müssen sie schon sein. Aber ich war auch zu faul um mich darüber aufzureden. Als dann Corona ausbrach, blieb ich der gleiche faule Sack, der ich vorher auch gewesen bin."}, {"id": 166, "start": 1753.84, "end": 1775.84, "text": "Ohne Ehrgeiz zocken hat Reverse boosted, ja? Oh jetzt hat er RGB an, jawoll, jetzt gut. Und viel zu wenig Staub auf dem Schreibtischer."}, {"id": 167, "start": 1775.84, "end": 1790.84, "text": "Es waren besondere Zeiten damals. Besondere, schwere Zeiten. Aber es war leicht ein Held zu sein."}, {"id": 168, "start": 1790.84, "end": 1809.84, "text": "Na ja, was ist das? Motivationsansprache für die Leute oder was? Das ist cringe, das gucken wir jetzt nicht an. Übrigens das ist auch witzig, das ist auch ein Ding, was ich ein bisschen fragwürdig finde."}, {"id": 169, "start": 1809.84, "end": 1824.84, "text": "Dass überall, ich meine klar, da wird geflamed und gemacht und getan, aber bei allen Sachen wo es um Corona geht oder irgendwelche kritischen Dinge oder kontroversen Dinge, sind die Kommentare auf YouTube aus."}, {"id": 170, "start": 1824.84, "end": 1837.84, "text": "Bei der Tagesschau sind die auch aus und bei den ganzen News Sachen sind die aus. Man kann sich gut vorstellen was da in den Comments für ein Schwachsinn drin steht."}, {"id": 171, "start": 1837.84, "end": 1845.84, "text": "Aber es wäre doch ganz gut, wenn die Leute einfach reinhauen. Warum ausschalten? Muss sich ja keiner dafür interessieren."}, {"id": 172, "start": 1845.84, "end": 1860.84, "text": "Hättest du Bock die Kommentare zu... warum? Ich muss die doch nicht moderieren. Ich lasse die Leute einfach dumm Scheiß reinschreiben und gut ist."}, {"id": 173, "start": 1860.84, "end": 1876.84, "text": "Ich moderiere meine Kommentare auch nicht und da ist auch viel Schwachsinn dabei. Natürlich kann man das nicht vergleichen, aber weitem nicht so viel Schwachsinn wie da, das stimmt schon."}, {"id": 174, "start": 1876.84, "end": 1891.84, "text": "Ach, tatsächlich? Ach, das gab Comments am Anfang, ok. Ja, dann haben die dann ausgeschaltet, weil die Leute zu sehr abgegangen sind. Ja, das kann sein. Das kann sein. Ok, das verstehe ich dann sogar."}, {"id": 175, "start": 1891.84, "end": 1900.84, "text": "Das verstehe ich, wenn man das dann abschaltet. Aber bei der Tagesschau und so ist mittlerweile alles aus. Guckt, sobald man hier hingeht, die haben doch hier immer Corona-Werbung."}, {"id": 176, "start": 1900.84, "end": 1909.84, "text": "So, was will ich? Bam, Kommentare aus. Guckt, Kommentare aus. Und Disable-Chat. Das verstehe ich gar nicht, warum."}, {"id": 177, "start": 1909.84, "end": 1917.84, "text": "Na klar, du hast ja viele Spinner, aber sollen sie halt spinnen. Ich meine, besser sie spinnen in den YouTube-Kommentaren als vor Ort irgendwo, ne?"}, {"id": 178, "start": 1917.84, "end": 1931.84, "text": "Also, das wird mich nicht jucken. Ja, aber die haben Livestream und auch aus. Hier, guckt mal da. Bam, Tagesschau, Kommentare aus. Ich wette mit euch. Bam, Kommentare aus. Immer."}, {"id": 179, "start": 1931.84, "end": 1945.84, "text": "Ok, warum die immer Kommentare ausschalten? Sollen sie Leute doch dumm Schmuss schreiben lassen? Ist doch ok. Guckt mich nicht. Was ist das? Oh, gibt wieder ein Space-Extreme. Excellent."}, {"id": 180, "start": 1945.84, "end": 1954.84, "text": "Warum watchen das nur 200 irgendwas? Das ist dann bestimmt Fake-Stream. Das ist gar kein offizieller."}, {"id": 181, "start": 1954.84, "end": 1967.84, "text": "Ein Server-Upgrade. Oh ne, das ist immer ultra-langweilig. Das habe ich schon ein paar Mal gesehen. Die sind übelst langweilig."}, {"id": 182, "start": 1967.84, "end": 1978.84, "text": "Da fällt mir übrigens ein, ich wollte mit dem Felix noch ein Video machen über unsere 50.000 Euro-Server aus dem Rechenzentrum. Wir haben das Video ja schon aufgenommen. Wir wollten bloß nochmal drüber labern."}, {"id": 183, "start": 1978.84, "end": 2007.84, "text": "Und haben es immer noch nicht gemacht. Ist das irgendwie ein Super-Micro-Ding? Oder was hat er hier am Start? Ah, Bam, Samsung SSD ist in your face. So muss das sein."}, {"id": 184, "start": 2007.84, "end": 2028.84, "text": "Was hältst du von meiner App? Ich denke nicht. Muss ich mir mal angucken. Gucken wir mal. Oh, guck mal hier. Poggers Bewertung. Keyboard-Switches-DB. Moment, was macht das?"}, {"id": 185, "start": 2028.84, "end": 2046.84, "text": "Du darfst bei euch im Rechenzentrum filmen, ja? Wir zeigen gar nichts. Wir waren quasi im Abstellraum und haben uns dahingestellt und das gefilmt. Siehst du nix? Siehst du ein Regal mit Servern? Siehst du das was?"}, {"id": 186, "start": 2046.84, "end": 2060.84, "text": "Sag mal, Keyboard-Switches-DB. Was hast du denn hier gebastelt? Make Sound-Test, Compare Specs. Ah, das ist eine coole Idee. Was ist eine coole Idee?"}, {"id": 187, "start": 2060.84, "end": 2068.84, "text": "Da kannst du dir quasi einen Sound anhören, von wie sich ein Switch anhört. Das ist eine coole Sache, das gefällt mir."}, {"id": 188, "start": 2068.84, "end": 2078.84, "text": "Ey, das ist eine gute Idee. Weil man fragt sich immer, wenn man sich ein neues Keyboard kauft, nach dem Motto, okay, ich weiß vielleicht mit Achtung und Krache nur welche Switches da drin sind, aber"}, {"id": 189, "start": 2078.84, "end": 2090.84, "text": "wie laut die dann sind und wie die klickern und ob das irgendwie das Gehäuse vibriert beim Reiten und so. Das weiß ich ja eigentlich gar nicht. Aber hier, das finde ich eigentlich eine gute Idee."}, {"id": 190, "start": 2090.84, "end": 2100.84, "text": "Switches-DB. Mit was hast du das gemacht? Es sieht ja ein bisschen nach Web aus, wahrscheinlich ist es Elektron oder irgendwie sowas."}, {"id": 191, "start": 2100.84, "end": 2105.84, "text": "Könnte ich mir zumindest vorstellen."}, {"id": 192, "start": 2105.84, "end": 2111.84, "text": "Das ist eine gute Idee."}, {"id": 193, "start": 2111.84, "end": 2122.84, "text": "So, du hast doch richtig gute Bewertungen schon gekriegt hier. Das ist mit einer Game-Engine gemacht. Ah ja, interessant. Warum das? Weil es Cross-Platform läuft oder wie?"}, {"id": 194, "start": 2122.84, "end": 2132.84, "text": "Oder für das Video, für das Audio-Zeug. Weil vom GUI her würde ich jetzt nicht vermuten, dass da irgendeine Game-Engine drunter ist und schon gar nicht, warum man das mit einer Game-Engine macht."}, {"id": 195, "start": 2132.84, "end": 2144.84, "text": "Aber wenn es geht, die Funktion ist ja das Wichtige. Was das läuft, ist ja fast egal. Aber warum denn?"}, {"id": 196, "start": 2144.84, "end": 2153.84, "text": "Unity wird bestimmt auch in vielen Projekten verwendet, wo kein Game ist. Deswegen könnte ich mir vorstellen, dass das mit der Engine, die du verwendet hast, auch so."}, {"id": 197, "start": 2153.84, "end": 2163.84, "text": "Aber wie bist du da drauf gekommen? Also warum mit der Game-Engine, der Smartphone-App?"}, {"id": 198, "start": 2163.84, "end": 2168.84, "text": "Ah! Hey, das ist eigentlich gar nicht mal schlecht."}, {"id": 199, "start": 2168.84, "end": 2178.84, "text": "Weil das GUI sieht jetzt vielleicht nicht Next-Gen-HD aus, aber vollkommen ausreichend für sowas."}, {"id": 200, "start": 2178.84, "end": 2186.84, "text": "Ja, nice. Poggers."}, {"id": 201, "start": 2186.84, "end": 2196.84, "text": "So, zeige ich mal her. Gibt es hier irgendwas Spannendes, was ich uns YouTube empfehlen möchte?"}, {"id": 202, "start": 2196.84, "end": 2207.84, "text": "Okay, irgendein Special-Whiskey-Video muss ich mir nicht angucken."}, {"id": 203, "start": 2207.84, "end": 2214.84, "text": "Das ist auch so ein Ding, wo ich immer dran denken muss, warum wir das nicht gebacken kriegen mit Corona und der Schule."}, {"id": 204, "start": 2214.84, "end": 2225.84, "text": "Das ist ein Ding, das finde ich wirklich ein bisschen arm. Man hatte sechs Monate Zeit zwischen den zwei Corona-Wellen, sich Sachen zu überlegen."}, {"id": 205, "start": 2225.84, "end": 2230.84, "text": "Aber irgendwie muss alles wieder übers Knie gebrochen werden, sobald es jetzt wieder akut ist."}, {"id": 206, "start": 2230.84, "end": 2239.84, "text": "Wahrscheinlich haben die da gesessen und haben gesagt, hoffentlich gibt es keine zweite Welle, hoffentlich gibt es keine zweite Welle, hoffentlich gibt es keine zweite Welle."}, {"id": 207, "start": 2239.84, "end": 2250.84, "text": "Anstatt sich mal hinzusetzen, um was für ihr Geld zu machen und sich schon ein paar Sachen im Vorfeld zu überlegen und abzuklären, bevor es dann soweit ist."}, {"id": 208, "start": 2250.84, "end": 2257.84, "text": "Es müssen sich jetzt irgendwelche Dinger aus den Fingern saugen."}, {"id": 209, "start": 2257.84, "end": 2266.84, "text": "Und vor allem, dass es gefühlt jede Woche neue Regelungen gibt. Wer soll denn da noch durchblinken?"}, {"id": 210, "start": 2266.84, "end": 2275.84, "text": "Mittlerweile ist es ja so, irgendwie scheißen schon die ersten Läden drauf."}, {"id": 211, "start": 2275.84, "end": 2288.84, "text": "Ich war heute Weihnachtsbaum kaufen und normalerweise machen die es ja im Laden immer so, du musst einen Wagen nehmen, es dürfen nur so und so viel rein und sonst was in der Richtung."}, {"id": 212, "start": 2288.84, "end": 2295.84, "text": "Im Bauhaus vollkommen egal, einfach Mundschutz aus reingelaufen, da war Knage voll."}, {"id": 213, "start": 2295.84, "end": 2310.84, "text": "Max bald auch auf Querdenker Demos, ey ich sag euch, wenn, also ich gehe wahrscheinlich nie auf irgendeine Offline Demo, ja."}, {"id": 214, "start": 2310.84, "end": 2327.84, "text": "Aber wenn die auf die Idee kommen, so ganz abgedrehte Sachen zu machen, wie zum Beispiel, du darfst ohne Grund das Haus nicht mehr verlassen und zu den Gründen zählt kein Sport und sonst was, sondern nur Arztbesuch und sowas in der Richtung."}, {"id": 215, "start": 2327.84, "end": 2341.84, "text": "Also wenn ich wirklich gar nicht mehr aus dem Haus darf ohne Arztbesuch, solchen Dingern, dann gehe ich zwar nicht auf die Querdenker Demo, aber dann wäre ich mich zumindest mal öffentlich zu ausländisch kacke finde."}, {"id": 216, "start": 2341.84, "end": 2359.84, "text": "Aber ansonsten, ansonsten ich habe ja nichts gegen Corona Maßnahmen, gar nichts, ich finde es nur an manchen Stellen viel zu schlecht erklärt, warum man was macht und zu undurchsichtig und vor allem keine Vorbereitung."}, {"id": 217, "start": 2359.84, "end": 2370.84, "text": "Hat ein halbes Jahr Zeit, aber keiner hat es schon was überlegt, das ist das was mir auf den Keks geht, dass es da jetzt Maßnahmen gibt, das finde ich an sich nicht schlimm."}, {"id": 218, "start": 2370.84, "end": 2381.84, "text": "Ach genau, ja stimmt, es gibt ja noch Corona, das habe ich auch gelesen, es gibt jetzt eh für Bundestagsangestellte, glaube ich gibt es ja irgendwie noch so einen Bonus, ja, excellent."}, {"id": 219, "start": 2381.84, "end": 2388.84, "text": "Lustigerweise, die Leute die irgendwie auf dem Zahnfleisch gehen, da ist kein Problem, aber da gibt es erstmal einen dicken Bonus, easy."}, {"id": 220, "start": 2388.84, "end": 2403.84, "text": "Also wenn ihr wirklich auf die Idee kommt und sagt, Ausgangsperre und man darf nur noch zum Arzt und Supermarkt, dann werde ich mich auch mal öffentlich zu ausländisch kacke finde."}, {"id": 221, "start": 2403.84, "end": 2411.84, "text": "Bis jetzt, muss ich sagen, bin ich zum größten Teil mit den Maßnahmen einverstanden, also mit den Maßnahmen an sich, die Sachen drum herum gefallen mir halt nicht."}, {"id": 222, "start": 2411.84, "end": 2424.84, "text": "Musik, ah, excellent."}, {"id": 223, "start": 2424.84, "end": 2439.84, "text": "Ich verstehe übrigens auch nicht, warum man in die Schule gehen darf mit 30 Leuten in der Klasse, das ist so ein Ding, wo ich mir denke, hätte man sich da nicht das letzte halbe Jahr über was überlegen können."}, {"id": 224, "start": 2439.84, "end": 2451.84, "text": "Jetzt ist es so, die tun so, als ist das Problem jetzt erst bekannt, so irgendwie, was, es sitzen 30 Leute in der Klasse, hui, wo kommen die denn auf einmal her?"}, {"id": 225, "start": 2451.84, "end": 2456.84, "text": "Ja, da hätten wir ja gar nicht dran denken können, auf die Idee, aber wer kommt denn auf so eine Idee, dass 30 Leute in der Klasse sitzen?"}, {"id": 226, "start": 2456.84, "end": 2461.84, "text": "Nee, nee, nee, da konnte man im Vorfeld nicht dran denken, ich meine man hat ein halbes Jahr Zeit gehabt."}, {"id": 227, "start": 2461.84, "end": 2472.84, "text": "Max, mach mal wieder mehr YouTube-Videos. Ja, ich habe eins aufgenommen, gibt es am Wochenende."}, {"id": 228, "start": 2472.84, "end": 2480.84, "text": "Und wie wir es halt auch mit Remote-Unterricht nicht auf die Reihe kriegen, wie gesagt, das habt ihr schon gesagt, Tochter vom Kollegen in Kolumbien macht komplett Remote-Unterricht."}, {"id": 229, "start": 2480.84, "end": 2490.84, "text": "In Deutschland sitzen sie da, alter, wie bediene ich meinen Browser jetzt nochmal, wie mache ich Teams auf, wie geht das, irgendwelche unfähigen Boomer-Lehrer am Start?"}, {"id": 230, "start": 2490.84, "end": 2500.84, "text": "Das war glaube ich das größte Problem ist."}, {"id": 231, "start": 2500.84, "end": 2506.84, "text": "Vielleicht hast du dazu eine Idee. Oh, in Discord muss ich auch mal wieder reingucken."}, {"id": 232, "start": 2506.84, "end": 2517.84, "text": "Glaubst du, dass man so alte BNC-Überwachungskameras an den ESP32 hängen kann, damit ihr, ähm, was wird denn da drüber übertragen, ist das VGA?"}, {"id": 233, "start": 2517.84, "end": 2522.84, "text": "Oder was geht da drüber? S-Video, VGA, was ist das?"}, {"id": 234, "start": 2522.84, "end": 2526.84, "text": "Du wirst ja das Problem haben, das analoge Signal irgendwie umzuwandeln."}, {"id": 235, "start": 2526.84, "end": 2531.84, "text": "SDI, äh, das glaube ich nicht, dass es da irgendwas Gescheites für gibt."}, {"id": 236, "start": 2531.84, "end": 2539.84, "text": "Du müsstest das analoge Signal irgendwie in Bilder umwandeln und das glaube ich nicht, dass das mit dem ESP32 gescheit funktioniert."}, {"id": 237, "start": 2539.84, "end": 2550.84, "text": "Da dürfte ein Raspberry Pi mit irgendeiner Billig-Capture-Card wahrscheinlich am besten sein, die das kann."}, {"id": 238, "start": 2550.84, "end": 2558.84, "text": "Das wundert mich nicht, sowas. Wie gesagt, Kollege von mir ist auch Lehrer und, ähm,"}, {"id": 239, "start": 2558.84, "end": 2571.84, "text": "der wurde jetzt zwangsbeurlaubt oder so, wie man es nennen mag, weil der ist höchste Corona-Risikogruppe und die haben gesagt, er darf nicht mehr in die Schule kommen."}, {"id": 240, "start": 2571.84, "end": 2578.84, "text": "Und jetzt muss er Remote-Unterricht machen und die Schule kriegt es halt nicht gebacken, das gescheit einzurechten."}, {"id": 241, "start": 2578.84, "end": 2583.84, "text": "Fängt ja schon an damit, dass es keine gescheiten Vorgaben gibt, was man verwendet."}, {"id": 242, "start": 2583.84, "end": 2588.84, "text": "Ja, die einen verwenden Teams, die anderen verwenden Dings hier. Wie heißt das?"}, {"id": 243, "start": 2588.84, "end": 2594.84, "text": "Oh, ich hab's vergessen. Wie heißt dieses andere Ding, was die Leute jetzt neu verwenden, was vor Corona keine Sau kannte?"}, {"id": 244, "start": 2594.84, "end": 2599.84, "text": "Zoom, Zoom, genau. Ja, Zoom. Der Chat. Der Chat kennt sich wieder aus."}, {"id": 245, "start": 2599.84, "end": 2604.84, "text": "Das war total unbedeutend vor Corona. Die waren halt zur richtigen Zeit am richtigen Ort, ne?"}, {"id": 246, "start": 2604.84, "end": 2607.84, "text": "Die Leute haben alles so krass oversized in das, ey."}, {"id": 247, "start": 2610.84, "end": 2613.84, "text": "Oh, oh, das ist aber oldschool, das Ding."}, {"id": 248, "start": 2613.84, "end": 2618.84, "text": "Ist das, ist das ein full-sized SAS-Connector oder was ist das?"}, {"id": 249, "start": 2618.84, "end": 2622.84, "text": "Ich erkenne das gar nicht, das müsste ein SAS-Connector sein."}, {"id": 250, "start": 2622.84, "end": 2624.84, "text": "Was haben wir noch?"}, {"id": 251, "start": 2624.84, "end": 2634.84, "text": "Okay, das muss was Altes sein. RS3614. Ich glaube, das ist was relativ Altes, oder?"}, {"id": 252, "start": 2634.84, "end": 2637.84, "text": "Auf jeden Fall IBM, oder? RS, klingt irgendwie nach IBM."}, {"id": 253, "start": 2637.84, "end": 2644.84, "text": "Ach nee, Synology Rackstation. Okay, nee, ich hab nichts gesagt, weil die IBM-Dinger hießen auch, ähm,"}, {"id": 254, "start": 2644.84, "end": 2655.84, "text": "früher, glaube ich, irgendwas mit RS."}, {"id": 255, "start": 2664.84, "end": 2665.84, "text": "Excellent."}, {"id": 256, "start": 2665.84, "end": 2672.84, "text": "Ah, yes. Es ist ja quasi ein Schnapper."}, {"id": 257, "start": 2672.84, "end": 2679.84, "text": "Vor allem mit der Ausstattung. Ein Schnäppchen."}, {"id": 258, "start": 2679.84, "end": 2686.84, "text": "So. Aber gut, wenn das ein fertiges Synology-Ding ist, dann ist das ja noch verkraftbar."}, {"id": 259, "start": 2686.84, "end": 2692.84, "text": "Aber da sind irgendwelche SAS-Connectors hinten, oder? Für SAS-Erweiterungen."}, {"id": 260, "start": 2692.84, "end": 2702.84, "text": "Ja, denke ich mal schon. RS war doch Dell? Nee, Dell war DL, warte mal."}, {"id": 261, "start": 2702.84, "end": 2708.84, "text": "Nee, DL380 war HP, oder? Das war HP, bringe ich die Software-Namen."}, {"id": 262, "start": 2708.84, "end": 2713.84, "text": "Ach ja, ja, nee, stimmt, du hast recht. RS irgendwas war Dell. Ja, ja, stimmt."}, {"id": 263, "start": 2713.84, "end": 2717.84, "text": "Ähm, wie hießen Dinge von IBM dann früher?"}, {"id": 264, "start": 2717.84, "end": 2726.84, "text": "Warte mal, wie hieß... X, X, genau, X, X6355 war das, ja."}, {"id": 265, "start": 2726.84, "end": 2732.84, "text": "Das hab ich grad durchgeheiligebracht. Das waren die OLLEN-IBM-Dinger."}, {"id": 266, "start": 2732.84, "end": 2738.84, "text": "Mit dieser komischen Metallkugel vorne drin. Die hatten Server, die hatten hier oben so ein"}, {"id": 267, "start": 2738.84, "end": 2742.84, "text": "Metallkugel drin. Ich weiß bis heute nicht, wo der Sinn davon war."}, {"id": 268, "start": 2742.84, "end": 2745.84, "text": "Manche hatten das, manche hatten das nicht."}, {"id": 269, "start": 2745.84, "end": 2753.4, "text": "oder das gab es oder das gab es nur bei uns und irgend einer war lustig und hat da was"}, {"id": 270, "start": 2753.4, "end": 2754.4, "text": "reingesteckt"}, {"id": 271, "start": 2754.4, "end": 2761.36, "text": "hier sieht man das nicht"}, {"id": 272, "start": 2761.36, "end": 2766.12, "text": "ich vergesse auch immer wie die remote management lösung heißt also du hast"}, {"id": 273, "start": 2766.12, "end": 2771.84, "text": "iTrack bei Dell, Elo bei HP und ich glaube RSA ist es bei IBM oder?"}, {"id": 274, "start": 2771.84, "end": 2778.88, "text": "war das nicht RSA, das IBM Remote Ding?"}, {"id": 275, "start": 2778.88, "end": 2779.88, "text": "das war Java Only"}, {"id": 276, "start": 2779.88, "end": 2788.84, "text": "RSA 2, das Ding ist absoluter Crap gewesen"}, {"id": 277, "start": 2788.84, "end": 2789.84, "text": "dieses hässliche Ding"}, {"id": 278, "start": 2789.84, "end": 2795.96, "text": "Java Only, nur eine spezielle Java Version unterstützt im Browser"}, {"id": 279, "start": 2795.96, "end": 2802.4, "text": "das war die letzte Java Anwendung die ich verwenden musste auf der Arbeit mal"}, {"id": 280, "start": 2802.4, "end": 2809.2, "text": "ein paar jahre lang und zwar das ging nur mit einer alten Browser Version wo das"}, {"id": 281, "start": 2809.2, "end": 2812.56, "text": "Java Plugin noch ging und nach einer Weile auch nur Windows"}, {"id": 282, "start": 2812.56, "end": 2819.36, "text": "also du hast quasi eine Windows Installation gebraucht mit einem alten Browser und einem"}, {"id": 283, "start": 2819.36, "end": 2823.2, "text": "alten Java und einem alten Java Browser Plugin dass der Scheiße funktioniert hat"}, {"id": 284, "start": 2823.2, "end": 2828.04, "text": "easy clap"}, {"id": 285, "start": 2828.04, "end": 2832.0, "text": "das war abartig das Ding also das war wirklich hochgradiger Kack"}, {"id": 286, "start": 2832.0, "end": 2833.4, "text": "das war grausam"}, {"id": 287, "start": 2833.4, "end": 2841.88, "text": "was sagst du zu hast der Frisör wieder YouTube?"}, {"id": 288, "start": 2841.88, "end": 2842.88, "text": "ich finde das nice"}, {"id": 289, "start": 2842.88, "end": 2845.48, "text": "hat er wieder was neues gemacht?"}, {"id": 290, "start": 2845.48, "end": 2848.64, "text": "ach nee das ist der Fitness Chat"}, {"id": 291, "start": 2848.64, "end": 2849.64, "text": "nee doch nicht"}, {"id": 292, "start": 2849.64, "end": 2853.4, "text": "die habe ich schon alle gesehen ja das ist nice dass der Frisör wieder hat"}, {"id": 293, "start": 2853.4, "end": 2856.8, "text": "ich wollte mit dem Fabian eigentlich am Wochenende was aufnehmen aber der hat sich noch nicht"}, {"id": 294, "start": 2856.8, "end": 2859.2, "text": "gerührt aber der wollte sich wahrscheinlich nicht"}, {"id": 295, "start": 2859.2, "end": 2862.52, "text": "festlegen drauf irgendwie jetzt so ja am Wochenende nehmen wir was auf oder nicht"}, {"id": 296, "start": 2862.52, "end": 2871.2, "text": "echt alte Java Version gehen nicht mehr"}, {"id": 297, "start": 2871.2, "end": 2876.52, "text": "aber man kann auch bestimmt noch einen Java 1.6 oder so was irgendwie downloaden oder?"}, {"id": 298, "start": 2876.52, "end": 2879.52, "text": "gibt das nicht gibt es das nicht mehr?"}, {"id": 299, "start": 2879.52, "end": 2885.0, "text": "doch hier BÄM oldschool Shit gibt es immer noch zum Download"}, {"id": 300, "start": 2885.0, "end": 2886.0, "text": "Zack"}, {"id": 301, "start": 2886.0, "end": 2892.08, "text": "absolut high end Java Version von 2000 oder so"}, {"id": 302, "start": 2892.08, "end": 2909.72, "text": "warum um alles in der Welt zeigen die Advanced Warfare?"}, {"id": 303, "start": 2909.72, "end": 2921.4, "text": "warum Advanced Warfare was ist denn mit denen los weil es jetzt RTX on ist oder was?"}, {"id": 304, "start": 2921.4, "end": 2925.2, "text": "warum denn ausgerechnet Twans Warfare der größte Shit überhaupt?"}, {"id": 305, "start": 2925.2, "end": 2927.64, "text": "und es sieht auch so aus"}, {"id": 306, "start": 2927.64, "end": 2942.76, "text": "das verstehe ich nicht"}, {"id": 307, "start": 2942.76, "end": 2947.76, "text": "war das jetzt war das jetzt irgendwie RTX on oder so oder was was wollten die uns damit"}, {"id": 308, "start": 2947.76, "end": 2948.76, "text": "sagen?"}, {"id": 309, "start": 2948.76, "end": 2956.76, "text": "übrigens ich finde es auch geil wie die Leute wieder rumflamen sind dass die 3060 Ti irgendwie"}, {"id": 310, "start": 2956.76, "end": 2964.76, "text": "besser ist als die was war das 2080 Super 2070 Super oder was auch immer"}, {"id": 311, "start": 2964.76, "end": 2968.72, "text": "ich weiß gar nicht was mit den allen los ist wenn ich mir eine Grafikkarte vor einem Jahr"}, {"id": 312, "start": 2968.72, "end": 2973.16, "text": "gekauft habe dann war das früher vollkommen normal"}, {"id": 313, "start": 2973.16, "end": 2977.28, "text": "dass man damit rechnen musste dass die relativ schnell outdated ist"}, {"id": 314, "start": 2977.28, "end": 2981.28, "text": "nur weil man das jetzt gewohnt ist die letzten paar Jahre"}, {"id": 315, "start": 2981.28, "end": 2984.56, "text": "muss das ja nicht immer so weiter gehen ich meine die letzten paar Jahre waren halt eh"}, {"id": 316, "start": 2984.56, "end": 2986.32, "text": "lächerlich was Entwicklung angeht"}, {"id": 317, "start": 2986.32, "end": 2994.12, "text": "guckt euch mal an mein mein mein zusammenbau pc zusammenbau video"}, {"id": 318, "start": 2994.12, "end": 2998.52, "text": "habe ich was mit selbstbau habe ich es genannt oder sowas hier"}, {"id": 319, "start": 2998.52, "end": 3002.48, "text": "ich weiß gar nicht wo ich es hab hier"}, {"id": 320, "start": 3002.48, "end": 3012.4, "text": "ja also mein pc bild das ist drei jahre alt das letzte und das ist immer noch high end"}, {"id": 321, "start": 3012.4, "end": 3014.0, "text": "nach drei jahren überlegt euch das mal"}, {"id": 322, "start": 3014.0, "end": 3018.36, "text": "guck mal das war noch zeiten wo ich viele viele videos gemacht habe"}, {"id": 323, "start": 3018.36, "end": 3023.68, "text": "warum habe ich denn warum habe ich den big shock thumbnail"}, {"id": 324, "start": 3023.68, "end": 3027.28, "text": "hier da ist es doch mein neuer rechner"}, {"id": 325, "start": 3027.28, "end": 3033.16, "text": "so das habe ich vor über drei jahren gemacht und der rechner ist immer noch high end"}, {"id": 326, "start": 3033.16, "end": 3039.16, "text": "okay vielleicht nicht mehr high high high end aber immer noch über über die ganze ecke"}, {"id": 327, "start": 3039.16, "end": 3043.36, "text": "überdurchschnitt ja mit den übertakten 8700k und 1080ti"}, {"id": 328, "start": 3043.36, "end": 3050.68, "text": "high end nicht mehr okay das stimmt aber immer noch top top 5 bis 10 prozent ja"}, {"id": 329, "start": 3050.68, "end": 3056.56, "text": "erstmal 200 dislikes ja die 200 dislikes gibt es für meine krasse kameraführung glaube"}, {"id": 330, "start": 3056.56, "end": 3057.56, "text": "ich"}, {"id": 331, "start": 3057.56, "end": 3064.28, "text": "borgas kameraführung habe ich hier gemacht"}, {"id": 332, "start": 3064.28, "end": 3077.64, "text": "ja das kann doch nicht sein also die letzten jahre war man es halt einfach gewohnt dass"}, {"id": 333, "start": 3077.64, "end": 3081.08, "text": "die entwicklung nicht vorwärts geht aber man muss sich doch wirklich nicht beschweren"}, {"id": 334, "start": 3081.08, "end": 3085.56, "text": "wenn man eine 2070 super gekauft hat vor einem jahr dass jetzt eine schnellere grafiker"}, {"id": 335, "start": 3085.56, "end": 3089.72, "text": "gerade rauskommt und die weniger kostet ich habe mich früher gefreut jetzt kommt wieder"}, {"id": 336, "start": 3089.72, "end": 3094.2, "text": "boomer story ja ich weiß ich habe mich früher gefreut dass ich nach zwei jahren noch far"}, {"id": 337, "start": 3094.2, "end": 3098.2, "text": "cry spielen konnte auf meinem rechner das ist nämlich ich hatte nämlich einen rechner"}, {"id": 338, "start": 3098.2, "end": 3102.2, "text": "der quasi schon eineinhalb zwei jahre alt war als far cry rausgekommen ist ich wollte"}, {"id": 339, "start": 3102.2, "end": 3106.68, "text": "unbedingt far cry spielen und es lief halt in low details noch da habe ich mich übelst"}, {"id": 340, "start": 3106.68, "end": 3113.6, "text": "gefreut dass es in low details noch läuft"}, {"id": 341, "start": 3113.6, "end": 3118.72, "text": "und heute ist es so nach drei jahren einmal high end pc gekauft immer noch high end pc"}, {"id": 342, "start": 3118.72, "end": 3123.64, "text": "lull wenn es nach mir geht darf das ruhig wieder schneller gehen wird es aber wahrscheinlich"}, {"id": 343, "start": 3123.64, "end": 3131.6, "text": "nicht wird es aber wahrscheinlich nicht weil es immer komplizierter wird gerade bei cpus"}, {"id": 344, "start": 3131.6, "end": 3136.6, "text": "dort irgendwelche bahnbrechenden dinger zu machen früher war es einfach warum das früher"}, {"id": 345, "start": 3136.6, "end": 3141.44, "text": "so gut funktioniert hat mit cpu leistung ist ganz einfach du konntest einfach eine cpu"}, {"id": 346, "start": 3141.44, "end": 3145.56, "text": "2 jahre später eine cpu einbauen die hat doppelt so schnell getaktet hat ein paar zusätzliche"}, {"id": 347, "start": 3145.56, "end": 3150.08, "text": "befehle gehabt und war halt einfach doppelt so schnell ohne dass man was für machen musste"}, {"id": 348, "start": 3150.08, "end": 3156.12, "text": "das war ja der riesen vorteil von den cpus zu den zeiten wo es noch single core cpus"}, {"id": 349, "start": 3156.12, "end": 3160.56, "text": "gab aber auch immer höhere taktraten der riesen vorteil davon war niemand wusste musste"}, {"id": 350, "start": 3160.56, "end": 3164.84, "text": "was ändern also sprich die spiele und die anwendung liefen von heute auf morgen einfach"}, {"id": 351, "start": 3164.84, "end": 3168.92, "text": "doppelt so schnell weil die cpu doppelt so schnell getaktet war es musste keiner irgendwie"}, {"id": 352, "start": 3168.92, "end": 3174.24, "text": "anfangen multithreading optimieren oder irgendwelche speziellen befehlsetze benutzen dass es besser"}, {"id": 353, "start": 3174.24, "end": 3178.84, "text": "wird irgendwas in der rechnung nix einfach neue cpu bärmen alles doppelt so schnell"}, {"id": 354, "start": 3178.84, "end": 3191.76, "text": "das waren wirklich easy zeiten was das angeht einfach neue cpu und so riesen sprünge gibt"}, {"id": 355, "start": 3191.76, "end": 3196.04, "text": "es ja da halt nicht mehr was sie jetzt machen ist sie bauen immer mehr kerne ein aber mal"}, {"id": 356, "start": 3196.04, "end": 3202.12, "text": "ganz im ernst das wird das ist jetzt auch vorbei mit mehr kerne einbauen weil spätestens"}, {"id": 357, "start": 3202.12, "end": 3207.44, "text": "wenn jetzt sagen wir mal 10 plus kerne mainstream sind dann wird sich da auch nicht mehr so"}, {"id": 358, "start": 3207.44, "end": 3212.2, "text": "viel tun weil ich mein was willst du machen was brauchst du was kannst jetzt zwar 20"}, {"id": 359, "start": 3212.2, "end": 3219.64, "text": "kerne einbauen aber wozu also was was ist der vorteil davon das bringt das bringt ja"}, {"id": 360, "start": 3219.64, "end": 3224.48, "text": "den meisten leuten gar nichts ob 10 kerne 20 kerne bei den meisten schon ob 6 kerne"}, {"id": 361, "start": 3224.48, "end": 3230.28, "text": "10 kerne 20 kerne macht kaum unterschied das heißt du kannst mit der takt rate es nicht"}, {"id": 362, "start": 3230.28, "end": 3235.8, "text": "mehr raushauen und du kannst es ab spätestens diesem jahr oder ab aller spätestens nächsten"}, {"id": 363, "start": 3235.8, "end": 3242.04, "text": "jahr kannst du es auch nicht mehr mit mehr kerne raushauen also sprich was sollen die"}, {"id": 364, "start": 3242.04, "end": 3247.52, "text": "noch großartig machen um die cpu schneller zu machen denn bleibt ja nur das nur das übliche"}, {"id": 365, "start": 3247.52, "end": 3251.6, "text": "über halt gucken dass man vielleicht bisschen mehr takt hinkriegt dass man die sachen effizienter"}, {"id": 366, "start": 3251.6, "end": 3258.64, "text": "macht also sprich quasi dass die befehle die die cpu ausführt dass die quasi mit weniger"}, {"id": 367, "start": 3258.64, "end": 3268.44, "text": "takt zyklen auskommen das ist aber alles erst bei optimierung die bringt keine quansprünge"}, {"id": 368, "start": 3268.44, "end": 3272.4, "text": "und da müssen wir uns glaube ich darauf einstellen wenn da jetzt nicht noch irgendwie was kommt"}, {"id": 369, "start": 3272.4, "end": 3276.92, "text": "an das keiner denkt dass ich den nächsten jahren auch cpu-mäßig wieder nicht allzu"}, {"id": 370, "start": 3276.92, "end": 3286.0, "text": "viel tun wird also die die riesen sprünge von 2000 keine ahnung von von 95 bis 2010"}, {"id": 371, "start": 3286.0, "end": 3290.92, "text": "die sind vorbei ja und dass man irgendwie mal den brauchbaren quanten computer daheim"}, {"id": 372, "start": 3290.92, "end": 3294.96, "text": "hat habe ich immer eine zweifel zumindest zumindest in nächster zeit was wir das hier"}, {"id": 373, "start": 3294.96, "end": 3300.8, "text": "noch so mitkriegen aber jetzt in nächster zeit weil damit hast du ganz andere probleme"}, {"id": 374, "start": 3300.8, "end": 3306.6, "text": "kannst du den überhaupt für so general purpose berechnungen gescheit verwenden in manchen"}, {"id": 375, "start": 3306.6, "end": 3310.84, "text": "sachen ist es mit sicherheit sinnvoll damit was zu machen aber für so die 015 dinge die"}, {"id": 376, "start": 3310.84, "end": 3316.64, "text": "man daheim macht ist fraglich ob das damit überhaupt läuft oder ob es schneller läuft"}, {"id": 377, "start": 3316.64, "end": 3323.16, "text": "oder überhaupt performant läuft das ist ja alles noch zukunftsmusik ja jolly joker sechs"}, {"id": 378, "start": 3323.16, "end": 3336.52, "text": "monate massive subscription dankeschön seh so sieht es aus flintstone das ist das was"}, {"id": 379, "start": 3336.52, "end": 3342.56, "text": "ich damit eigentlich gerade auch umschreiben wollte das ist so ja und viele sachen ist"}, {"id": 380, "start": 3342.56, "end": 3346.52, "text": "fraglich ob es damit überhaupt geht also du wirst wie wir werden wir werden es wahrscheinlich"}, {"id": 381, "start": 3346.52, "end": 3350.88, "text": "erst mal nicht überleben nicht überleben werden wir es wahrscheinlich auch nicht aber"}, {"id": 382, "start": 3350.88, "end": 3355.16, "text": "wir erst mal nicht erleben dass in den quanten computer crisis abspieler crisis juckt ja"}, {"id": 383, "start": 3355.16, "end": 3363.16, "text": "dann kein mehr das was dann immer dann auch immer angesagt ist ja das weiß ich nicht"}, {"id": 384, "start": 3363.16, "end": 3368.32, "text": "ob sich am desktop durchsetzen wird und mal ganz davon abgesehen ob sich jetzt arm auf"}, {"id": 385, "start": 3368.32, "end": 3374.92, "text": "dem desktop durchsetzt oder ob es weiter die stink normal x8664 bleibt die grundsätzliche"}, {"id": 386, "start": 3374.92, "end": 3379.88, "text": "problematik dass du nicht mehr wirklich die kerne erhöhen kannst und auch nicht mehr"}, {"id": 387, "start": 3379.88, "end": 3385.28, "text": "großartige riesen sprünge im takt machen kann es bleibt ja bei arm gleich unabhängig"}, {"id": 388, "start": 3385.28, "end": 3392.12, "text": "davon was man da was man da jetzt für eine cpu drin hat da sind ja alles herkömmliche"}, {"id": 389, "start": 3392.12, "end": 3395.92, "text": "cpus entweder gibt sie dem ding mehr kerne oder gibt sie den ding mehr takt viel mehr"}, {"id": 390, "start": 3395.92, "end": 3400.08, "text": "kann es nicht machen du kannst halt du kannst halt so ein paar optimierungen machen ja aber"}, {"id": 391, "start": 3400.08, "end": 3404.16, "text": "das ist halt nix was innerhalb von einem jahr das ding mal doppelt so schnell macht oder"}, {"id": 392, "start": 3404.16, "end": 3410.16, "text": "so das ist vorbei das ist hammer nimmer man muss aber auch sagen ehrlich gesagt man braucht"}, {"id": 393, "start": 3410.16, "end": 3418.44, "text": "es auch gar nicht mehr ich mein heutzutage sind rechner schnell genug dass man es sich"}, {"id": 394, "start": 3418.44, "end": 3425.56, "text": "erlauben kann browser mit 50 tabs laufen zu lassen und noch fünf elektron anwendung und"}, {"id": 395, "start": 3425.56, "end": 3431.52, "text": "der ram verbrauch bei 10 gigabyte ist und allein schon eidel das ding 15 prozent auslastung"}, {"id": 396, "start": 3431.52, "end": 3444.2, "text": "hat aber es juckt kein weil es nicht schnell genug ist"}, {"id": 397, "start": 3444.2, "end": 3448.84, "text": "also ich beziehe mich jetzt auf cpus das heißt ja nicht dass wir in anderen gebieten nicht"}, {"id": 398, "start": 3448.84, "end": 3454.56, "text": "fortschritte erzielen können und wenn mal einer irgendwelche big brain ideen hat was"}, {"id": 399, "start": 3454.56, "end": 3458.52, "text": "man bei cpu so machen kann er dann geht das auch wieder aufwärts aber aktuell sehe ich"}, {"id": 400, "start": 3458.52, "end": 3467.64, "text": "es halt nicht weil du konntest 1995 bis 2010 konntest du super skalieren über die taktrate"}, {"id": 401, "start": 3467.64, "end": 3474.52, "text": "2010 bis 2020 so konntest du noch noch halbwegs super skalieren über mehr cpu kerne aber"}, {"id": 402, "start": 3474.52, "end": 3479.4, "text": "das ist vorbei viel mehr taktrate wird es erstmal immer geben und viel mehr kerne bringt"}, {"id": 403, "start": 3479.4, "end": 3492.68, "text": "es nicht so und nun ja was machen wir jetzt das wird auch so sein also ich gehe davon"}, {"id": 404, "start": 3492.68, "end": 3499.08, "text": "aus dass wir in nächsten jahren einiges sehen werden in richtung neuer neue verwendungszwecke"}, {"id": 405, "start": 3499.08, "end": 3503.88, "text": "ja sowas wie walken zum beispiel oder was jetzt teilweise mit x12 machen die nächsten"}, {"id": 406, "start": 3503.88, "end": 3508.32, "text": "jahre werden wir auf jeden fall viel viel viel viel mehr machine learning geschichten sehen"}, {"id": 407, "start": 3508.32, "end": 3513.92, "text": "weil das ist was wofür sich performance wirklich lohnt also wie gesagt sowas wie rx voice und"}, {"id": 408, "start": 3513.92, "end": 3517.44, "text": "sowas das ist erst der anfang da wird es noch viel mehr sachen geben auch echtzeit"}, {"id": 409, "start": 3517.44, "end": 3521.84, "text": "bilderkennung bildklassifizierung alle möglichen geschichten also gerade was machine learning"}, {"id": 410, "start": 3521.84, "end": 3526.56, "text": "angeht wird sich die nächsten jahre extrem viel tun und da kann es eh nicht genug leistung"}, {"id": 411, "start": 3526.56, "end": 3536.12, "text": "haben ja das kann gut sein wobei speicherbandbreite halt heute auch bei den meisten sachen nicht"}, {"id": 412, "start": 3536.12, "end": 3547.24, "text": "wirklich das problem ist nein glaube ich nicht hat sich ja auch nicht ich meine macht stadia"}, {"id": 413, "start": 3547.24, "end": 3562.24, "text": "so wie macht stadia so aktuell lebt es noch ja ich meine du musst dir nur mal stadia destiny"}, {"id": 414, "start": 3562.24, "end": 3574.84, "text": "player account angucken moment mal wie hieß denn wie hieß denn diese destiny stats seite"}, {"id": 415, "start": 3574.84, "end": 3594.92, "text": "destiny stats ne wie ist das irgendwie charles oder so das da genau war das nicht karl der"}, {"id": 416, "start": 3594.92, "end": 3603.84, "text": "große oder irgendwie sowas ich weiß woher ist geschichte und sowas so da gibt es beispielsweise"}, {"id": 417, "start": 3603.84, "end": 3611.88, "text": "hier also 35 prozent spielen auf steam 33 prozent spielen playstation 37 prozent spielen"}, {"id": 418, "start": 3611.88, "end": 3617.68, "text": "spielen xbox so was meinst du wie viel prozent stadia spielen moment ich muss mal kurz"}, {"id": 419, "start": 3617.68, "end": 3626.36, "text": "reinzoomen mehr reinweilen zum kann ich nicht also exzellent also hat sich die frage glaube"}, {"id": 420, "start": 3626.36, "end": 3630.92, "text": "ich ob sich das durchsetzt irgendwie schon erübrigt und destiny war eines der top dinger"}, {"id": 421, "start": 3630.92, "end": 3638.94, "text": "mit ins gelauncht ist ja war umsonst weil sogar umsonst oder ist noch umsonst das nicht"}, {"id": 422, "start": 3638.94, "end": 3645.64, "text": "das ist wahrscheinlich weniger wird aufgerundet ja und du siehst ja auch kaum einer spielt"}, {"id": 423, "start": 3645.64, "end": 3668.04, "text": "endgame hier ja das ist es das ist ja die sache game streaming ist so ein ding das"}, {"id": 424, "start": 3668.04, "end": 3675.6, "text": "hört sich von der idee gut an aber ich habe also ich habe mir damals auch vor einer weile"}, {"id": 425, "start": 3675.6, "end": 3682.16, "text": "schon gedanken darüber gemacht ich dachte auch dass im game streaming eventuell mal"}, {"id": 426, "start": 3682.16, "end": 3687.16, "text": "die zukunft liegen könnte eben gerade für die ganzen mainstream mainstream sachen aber"}, {"id": 427, "start": 3687.16, "end": 3692.72, "text": "wenn man mal ehrlich ist das ist zumindest das was ich mir dazu zusammengesprochen habe"}, {"id": 428, "start": 3692.72, "end": 3698.36, "text": "glaube ich gibt es gar nicht so viele leute für die game streaming die game streaming"}, {"id": 429, "start": 3698.36, "end": 3704.08, "text": "anspricht weil du hast die ultra casual bobs die spielen auf ihrem smartphone die interessieren"}, {"id": 430, "start": 3704.08, "end": 3707.44, "text": "sich wahrscheinlich noch nicht mal für die spiele die es auf stadia oder game streaming"}, {"id": 431, "start": 3707.44, "end": 3713.08, "text": "gibt die wollen was ist denn grad das neueste geile mobile game keine ahnung ich kenne"}, {"id": 432, "start": 3713.08, "end": 3716.6, "text": "mich da nicht aus ja früher war es mal fahren will aber fahren will würde ja mittlerweile"}, {"id": 433, "start": 3716.6, "end": 3723.44, "text": "abgeschaltet ja die die wollen die wollen ihr mobile gedöns spielen okay die kennen"}, {"id": 434, "start": 3723.44, "end": 3727.72, "text": "die ganzen pc spiele gar nicht wollen die gar nicht spielen so also du hast die 0815"}, {"id": 435, "start": 3727.72, "end": 3735.68, "text": "casual mobile noobs die sprichste wahrscheinlich mit stadia auch nicht großartig an so wer"}, {"id": 436, "start": 3735.68, "end": 3741.72, "text": "wen spricht stadia an die leute die sich quasi für pc spiele interessieren aber keinen"}, {"id": 437, "start": 3741.72, "end": 3753.96, "text": "pc haben und wie viele gibt es davon wirklich die sagen ich ziehe stadia vor einem neuen"}, {"id": 438, "start": 3753.96, "end": 3758.92, "text": "pc bild das glaube ich da gibt es nicht so viel das müsste ja dann wirklich jemand sein"}, {"id": 439, "start": 3758.92, "end": 3766.38, "text": "der an pc games interessiert ist der allerdings mit den einbußen oder den den den rahmenbeding"}, {"id": 440, "start": 3766.38, "end": 3771.68, "text": "von stadia leben kann der quasi pc interessiert ist aber sich dafür entscheidet nicht das"}, {"id": 441, "start": 3771.68, "end": 3782.2, "text": "geld für neuen pc auszugeben ich glaube das gibt es nicht viele ich glaube da gibt"}, {"id": 442, "start": 3782.2, "end": 3788.52, "text": "es nicht so viele zumal man sich die sachen auf stadia nach wie vor kaufen muss ich glaube"}, {"id": 443, "start": 3788.52, "end": 3792.32, "text": "da gibt es echt nicht so großen ich dachte auch ursprünglich dass das ein riesen ding"}, {"id": 444, "start": 3792.32, "end": 3796.32, "text": "sein wird aber da gibt es glaube ich einfach nicht so viele leute die das anspricht mit"}, {"id": 445, "start": 3796.32, "end": 3803.56, "text": "stadia ja und geforce now war eine gute idee aber geforce now ist ja mittlerweile auch schon"}, {"id": 446, "start": 3803.56, "end": 3812.24, "text": "ziemlich abgekackt weil die ganzen spieleanbieter ihre spiele rausgenommen haben am anfang fand"}, {"id": 447, "start": 3812.24, "end": 3820.24, "text": "ich das eine geile idee aber mittlerweile haben wir ganz viele spiele rausgenommen ja doppelt"}, {"id": 448, "start": 3820.24, "end": 3829.44, "text": "kaufen ist eh hängen geblieben ja aber das macht keiner das ist das habe ich mir auch"}, {"id": 449, "start": 3829.44, "end": 3834.0, "text": "gedacht die idee ist interessant aber überlegt mal wenn du jemand bist der wirklich interessiert"}, {"id": 450, "start": 3834.0, "end": 3839.8, "text": "ist in pc spielen dann musst du erstens niemand sein der am competitive aspekt von pc spiel"}, {"id": 451, "start": 3839.8, "end": 3845.64, "text": "interessiert ist weil bist du am competitive aspekt von pc spiel interessiert wirst du"}, {"id": 452, "start": 3845.64, "end": 3850.6, "text": "niemals stadia spielen oder generell games spielen würdest du niemals machen das heißt"}, {"id": 453, "start": 3850.6, "end": 3855.56, "text": "du musst an pc spiel interessiert sein du musst dich dagegen entscheiden neuen pc zu"}, {"id": 454, "start": 3855.56, "end": 3861.2, "text": "kaufen mit dem du ja quasi dann sogar noch besser pc spiele spielen könntest du musst"}, {"id": 455, "start": 3861.2, "end": 3871.28, "text": "quasi in den pc casual sein und ich glaube die kombination gibt es einfach nicht so oft"}, {"id": 456, "start": 3871.28, "end": 3879.8, "text": "du musst du musst in den pc casual hipster apple fan sein so in der richtung apple verletzter"}, {"id": 457, "start": 3879.8, "end": 3884.28, "text": "weg das ist das ist komisch das passt irgendwie nicht so richtig zusammen deswegen habe ich"}, {"id": 458, "start": 3884.28, "end": 3888.84, "text": "da auch total falsch gelegen wo ich am anfang gedacht habe ja das wird ein großes ding aber"}, {"id": 459, "start": 3888.84, "end": 3894.8, "text": "wenn man genauer darüber nachdenkt gibt es da echt nicht so viel auf die stadia jetzt"}, {"id": 460, "start": 3894.8, "end": 3907.44, "text": "gut passt gibt es hier stadia active player active users gibt es active users ja reaches"}, {"id": 461, "start": 3907.44, "end": 3911.8, "text": "1 million users das interessiert doch kein mensch was ich damit irgendwann registriert"}, {"id": 462, "start": 3911.8, "end": 3929.56, "text": "hat"}, {"id": 463, "start": 3929.56, "end": 3941.68, "text": "wie viel installiert hat juckt ja nicht das ja captain falcon leute die viel unterwegs"}, {"id": 464, "start": 3941.68, "end": 3945.0, "text": "sind das ist auch noch vielleicht so eine nische wo ich mir das gut vorstellen aber"}, {"id": 465, "start": 3945.0, "end": 3958.8, "text": "dann darfst du halt nicht in deutschland großartig unterwegs sein weil dann hast du kein internet"}, {"id": 466, "start": 3958.8, "end": 3964.6, "text": "ich meine es ist es ist zumindest definitiv nicht tot es sind 2,8 k leute online auf reddit"}, {"id": 467, "start": 3964.6, "end": 3974.6, "text": "für stadia und es gibt im minuten tag neue posts ok die spielen bomba man online ja genau"}, {"id": 468, "start": 3974.6, "end": 3988.76, "text": "dafür brauche ich stadia unbedingt da habe ich drauf gewartet dass ich bomba man online"}, {"id": 469, "start": 3988.76, "end": 4011.72, "text": "spielen kann auf stadia"}, {"id": 470, "start": 4011.72, "end": 4016.88, "text": "hätten sie das ding nicht xbox scarlet nennen können anstatt xbox series x oder xbox series"}, {"id": 471, "start": 4016.88, "end": 4029.76, "text": "s oder wie auch immer es jetzt heißt was die was die für ein crap spielen hier"}, {"id": 472, "start": 4029.76, "end": 4038.04, "text": "irgendwelche gamer grills die werbung posten auf auf stadia auf dem stadia reddit ach"}, {"id": 473, "start": 4038.04, "end": 4044.76, "text": "das ist einfach nicht das ding und ich könnte mir vorstellen wenn google nicht bedenken"}, {"id": 474, "start": 4044.76, "end": 4054.08, "text": "hätte dass man das feld nicht anderen überlassen will oder wenn man einen fuß in der gaming"}, {"id": 475, "start": 4054.08, "end": 4059.28, "text": "welt behalten will das ist ja das was wahrscheinlich google nach wie vor will mit stadia dass kein"}, {"id": 476, "start": 4059.28, "end": 4064.24, "text": "anderer das groß macht wo vielleicht potential ist was sie noch nicht erkannt haben und dass"}, {"id": 477, "start": 4064.24, "end": 4069.2, "text": "sie einen fuß drinnen behalten ich glaube da hätte google das schon eingestellt google"}, {"id": 478, "start": 4069.2, "end": 4081.64, "text": "ist zackig mit einstellen stadia active users gibt es da irgendwie was 2020 active users"}, {"id": 479, "start": 4081.64, "end": 4095.4, "text": "letzten monat gibt gar nichts dazu aber es ist ja schon eine gewisse sache also man kann"}, {"id": 480, "start": 4095.4, "end": 4102.48, "text": "ja schon erkennen daran dass es keine aktuellen user zahlen gibt dass die nicht allzu gut"}, {"id": 481, "start": 4102.48, "end": 4107.72, "text": "sein können weil immer wenn die user zahlen gut sind veröffentlichen die hersteller user"}, {"id": 482, "start": 4107.72, "end": 4117.36, "text": "zahlen guckt euch an wo hat jahre lang user zahlen veröffentlicht und als es bergab"}, {"id": 483, "start": 4117.36, "end": 4126.24, "text": "ging haben sie auch nicht mehr drauf auf wort hatte glaube ich auch am anfang irgendwelche"}, {"id": 484, "start": 4126.24, "end": 4131.92, "text": "wagen um schreibung veröffentlicht immer haben sie auch eingestellt gibt gibt einige"}, {"id": 485, "start": 4131.92, "end": 4149.08, "text": "sachen gibt ist google stadia flopp ok wenn wenn ich google frage ob google stadia ein"}, {"id": 486, "start": 4149.08, "end": 4154.96, "text": "flop ist ich glaube das ist keine allzu gute idee max würdest du voter von kabel internet"}, {"id": 487, "start": 4154.96, "end": 4165.04, "text": "empfehlen kommt darauf an was du für alternativen hast was hast du denn für alternativen google"}, {"id": 488, "start": 4165.04, "end": 4170.32, "text": "kann sich das leisten das stadia mal competitive irgendwie was reisen wir glaube ich nicht"}, {"id": 489, "start": 4170.32, "end": 4185.84, "text": "ja bettel viel ist gratis für prime user wer es noch nicht hat holt euch thomas cool"}, {"id": 490, "start": 4185.84, "end": 4196.48, "text": "sieben monate excellent subscription telekom 50.000 fang ich auch schon mit 50.000 an telekom"}, {"id": 491, "start": 4196.48, "end": 4202.8, "text": "50 mbit und eins und eins ist telekom resale das ist mehr oder weniger das gleiche also"}, {"id": 492, "start": 4202.8, "end": 4206.44, "text": "was ich mal an deiner stelle gucken würde ob es lokalen anbieter gibt der vielleicht"}, {"id": 493, "start": 4206.44, "end": 4210.88, "text": "was besseres hat das ist immer sinnvoll zu gucken und ansonsten ganz ehrlich würde ich"}, {"id": 494, "start": 4210.88, "end": 4221.08, "text": "wahrscheinlich voter vornehmen bei dieser auswahl telekom ja genau kilobit ne telekom ist meistens"}, {"id": 495, "start": 4221.08, "end": 4228.52, "text": "ganz gut wenn die 50 mbit schreiben haben die auch 50 mbit bei voter von ist halt so"}, {"id": 496, "start": 4228.52, "end": 4235.64, "text": "ein ding voter von ist halt eigentlich übelster übelster krepp krepp anbieter aber bei mir"}, {"id": 497, "start": 4235.64, "end": 4242.28, "text": "die einzig die einzige alternative zur telekom ne halt halt lächerlich irgendwo deine meinung"}, {"id": 498, "start": 4242.28, "end": 4249.24, "text": "zu far cry 6 ich muss dir ehrlich sagen ich habe mir far cry 6 die neuesten sachen überhaupt"}, {"id": 499, "start": 4249.24, "end": 4252.84, "text": "nicht mehr angeguckt wusste gar nicht dass da neugierd zu gibt den trailer fand ich ganz"}, {"id": 500, "start": 4252.84, "end": 4262.76, "text": "nice was ich auch witzig finde kennt ihr schon das gerücht dass der junge aus dem far cry"}, {"id": 501, "start": 4262.76, "end": 4269.08, "text": "6 trailer der da dass es angeblich war es ist wie ihre jung war das war ja so ein ding das"}, {"id": 502, "start": 4269.08, "end": 4274.24, "text": "ging durch ganz reddit so nach dem motto da waren die da waren die ganzen big brain game"}, {"id": 503, "start": 4274.24, "end": 4281.44, "text": "analisten wieder wieder dabei wurde doch bestätigt wurde das also wenn sie das bestätigt haben dann"}, {"id": 504, "start": 4281.44, "end": 4291.72, "text": "haben sie ziemlich die lore von far cry 3 durcheinander gebracht die haben die leute"}, {"id": 505, "start": 4291.72, "end": 4295.44, "text": "haben dann auch analysiert guck mal hier er hat über dem er hat irgendwie eine wunde über dem"}, {"id": 506, "start": 4295.44, "end": 4302.56, "text": "augenbrauen und und was hat auch die wunde über den augenbrauen und und wirklich ähnlich sieht"}, {"id": 507, "start": 4302.56, "end": 4311.76, "text": "dem halt nicht darum nicht dass es bestätigt wurde weil war es wurde auf also laut far cry 3"}, {"id": 508, "start": 4311.76, "end": 4316.44, "text": "lore wurde war es auf diesen komischen insel da im urwald geboren oder so also keine ahnung"}, {"id": 509, "start": 4316.44, "end": 4322.56, "text": "letztendlich lore interessiert eh kein also mich erst recht schon mal nicht aber so bei manchen"}, {"id": 510, "start": 4322.56, "end": 4327.88, "text": "gelten gucke ich ein bisschen die geschichte an aber im zweifelsfall wird die sachen total"}, {"id": 511, "start": 4327.88, "end": 4334.44, "text": "verbogen dass es halt für einen neuen teil reinpasst bestes beispiel ist wo alter wo"}, {"id": 512, "start": 4334.44, "end": 4339.32, "text": "halt haben ihre lore auch so krass verbogen da blickt keiner mehr durch und spätestens"}, {"id": 513, "start": 4339.32, "end": 4343.0, "text": "als sie auf die idee gekommen sind noch eine alternative zeitlinie einzuführen in wo war"}, {"id": 514, "start": 4343.0, "end": 4351.12, "text": "vorbei das sage ich als jemand der nie world of warcraft groß gespielt hat hast du schon"}, {"id": 515, "start": 4351.12, "end": 4355.76, "text": "von gpt 3 gehört das sagt mir irgendwas ich kann es gerade nicht zu und ich weiß nur dass"}, {"id": 516, "start": 4355.76, "end": 4362.92, "text": "es mit partitions tabellen in dem fall wahrscheinlich nichts zu tun hat das ist das ist in der maschine"}, {"id": 517, "start": 4362.92, "end": 4372.56, "text": "learning geschichte das ist das war in der maschine learning geschichte ist das die"}, {"id": 518, "start": 4372.56, "end": 4382.0, "text": "k.i. ist das ist das ist das die k.i. die texte schreiben kann die irgendwelche sachen"}, {"id": 519, "start": 4382.0, "end": 4391.44, "text": "schreiben kann war die das ich krieg's ich krieg's nicht mal ganz ganz zusammen was"}, {"id": 520, "start": 4391.44, "end": 4395.84, "text": "was mir beim thema k.i. immer wieder einfällt wenn es um k.i. geht die texte schreiben"}, {"id": 521, "start": 4395.84, "end": 4402.16, "text": "kann war dieser versuch von dem k.i. microsoft bot habt ihr das mitgekriegt das ist aber"}, {"id": 522, "start": 4402.16, "end": 4409.52, "text": "schon ein bisschen her die haben microsoft hatten einen twitter bot programmiert mit"}, {"id": 523, "start": 4409.52, "end": 4415.92, "text": "machine learning backend und der sollte dann der sollte dann quasi zeugs auf twitter lernen"}, {"id": 524, "start": 4415.92, "end": 4420.88, "text": "so und das hat dann irgendwie zwei tage gedauert dann hat das übelst nazi kram von sich gegeben"}, {"id": 525, "start": 4420.88, "end": 4427.76, "text": "der bot genau der bot der rechtsextreme genau den mein ich den mein ich das hat nicht lang"}, {"id": 526, "start": 4427.76, "end": 4433.48, "text": "gedauert zwei drei tage und dann hat er irgendwelchen kram gepost und dann haben sie wieder abgeschaltet"}, {"id": 527, "start": 4433.48, "end": 4452.04, "text": "das war schon fail microsoft nazi bot twitter twitter ane nicht past month ok ist schon"}, {"id": 528, "start": 4452.04, "end": 4463.88, "text": "so weit her"}, {"id": 529, "start": 4463.88, "end": 4471.96, "text": "guckt euch das mal an guckt euch mal an was der bot getweetet hat i fucking hate feminization"}, {"id": 530, "start": 4471.96, "end": 4481.96, "text": "all day nice bot microsoft sehr gut programmiert excellent ja voll verschissen ne ne das war"}, {"id": 531, "start": 4481.96, "end": 4491.68, "text": "der von microsoft hier guckt microsoft ja die haben verkackt es ist schon vier jahre"}, {"id": 532, "start": 4491.68, "end": 4496.4, "text": "her hätte ich gar nicht gedacht dass das so lange her ist guckt da schreibt auch hitler"}, {"id": 533, "start": 4496.4, "end": 4506.84, "text": "hatte recht unser zeug hier diese also der bot das ging echt in die hose ist troll bot"}, {"id": 534, "start": 4506.84, "end": 4512.56, "text": "ist nicht tos image screenshots von einem fail bot zu zeigen von microsoft kann kein"}, {"id": 535, "start": 4512.56, "end": 4534.6, "text": "tos sein sag ich nicht ich wie gucken sie bilder von bot an oh man troll bot ja ja wenn"}, {"id": 536, "start": 4534.6, "end": 4549.2, "text": "du den heute trainierst ist wahrscheinlich noch schlimmer oh man ja das war fail such"}, {"id": 537, "start": 4549.2, "end": 4553.96, "text": "mal nach gpt try interview ne das kann ich vielleicht im nächsten stream machen ähm"}, {"id": 538, "start": 4553.96, "end": 4562.64, "text": "ich muss jetzt erstmal ins bett ich bin müde ähm ne der hat das gelernt von anderen twitter"}, {"id": 539, "start": 4562.64, "end": 4575.8, "text": "usern der hat es aus tweets gelernt von anderen leuten und da kam halt sowas raus ja"}, {"id": 540, "start": 4592.64, "end": 4596.32, "text": "alles klar leute wir sehen uns morgen bis denn machts gut ich geh pennen see you"}]}