{"text": "Jetzt ist besser, ne? Ja. Ja, ich weiß ja, dass viele in Deutschland leider keinen ordentlichen Internetanschluss haben und deswegen 8 MB zu viel sind, deswegen sind wir mal auf 4,9 runter. Jetzt ist besser. It's war schneller. Easy. Wandel die Twitch-Server das nicht um? Doch, die Twitch-Server wandeln das um, allerdings nur, wenn du nicht auf der Originalauflösung guckst. Also du kannst... Okay, jetzt müssen wir uns wärmer angucken, ne? Also wenn du auf Source gehst, was das einzig sinnvolle ist, weil nur da ist es scharf oder richtig scharf, wenn du auf 1080p, 840 gehst, dann wandelt der das nicht um, dann ist das 8 MBit, wenn nicht auf 8 MBit. Du kannst hier drauf gehen, aber dann sieht es halt nicht so scharf aus. Warten wir mal kurz, warten bis die Werbung vorbei ist. Pause-Champ, Pause-Champ, Pause-Champ, Pause-Champ. Genau, so. Und jetzt sieht man hier, es ist halt mit, wenn man sich hier die Schrift anguckt, halt 27p nicht so wahnsinnig scharf, wohingegen, wenn man 1080p macht, ist halt hier Poggers. So, und du kannst halt nicht, das ist übrigens übelst verwirrend hier, du kannst halt nicht 1080p machen mit 8 MBit, dass es das runterrechnet, nur die anderen. Deswegen, ich muss das jetzt hier runter machen, weil das Internet in Deutschland zu sehr suckt. Lightroom, ja, MonkaS. Stimmt, ich muss den Chat aufmachen, weil ich sehe ja sonst den Chat gleich wieder nicht. Zack. So, viel besser, viel besser. So, weil wir basteln heute mal ein bisschen was und guckt mal, ich hab den 100 Viewer schon richtig, ja, ja, ja. Ja, das war G-Bait, weil ich den Stream neu gestartet hab. Da zählt es mal kurz doppelt, ansonsten dauert das immer ein bisschen. So, guckt mal, ich hab die Kamera jetzt ein bisschen anders eingestellt, Leute. Die Kamera ist jetzt so hier, guckt mal. Manchmal muss man kurz gucken, dass ich hier nicht hängen bleib, man hätte es nicht ein bisschen entwirre. Guckt mal, die Kamera ist jetzt so, die ist jetzt quasi eher so horizontal. Was ist das für ein Bildschirm schon, oder? Das ASCII Aquarium. Die Kamera ist jetzt eher so horizontal, dass die Leute nicht schlecht wird und da muss ich halt hier. WTF. Handlieg, Handlieg. Okay, gerade noch richtig, ja. War das knapp. Nee, also, man sieht jetzt so ungefähr von hier, so ungefähr hier ist der Anfang von der Matte, das geht bis hinten, also sprich, man sieht jetzt mehr oder weniger die ganze Matte und man sieht jetzt halt ziemlich gerade oben, guck mal, der Autofokus. OMEGALUL. OMEGALUL, der Autofokus spackt schon ganz schön rum. Okay, ich mach jetzt da nix dran. Ich lass das jetzt, bevor das irgendwie runterfällt oder so. Zumindest müsste jetzt der Angle von der Kamera viel besser sein als letztes Mal. Ja, I fix not ist auch wieder am Start, auf das Teil, was ich verbogen hab. Neradon, 17 Monate, das ist ja massive Subscription. Das ist ja, also was von wann bis wann arbeitest du unter der Woche? Von 7 bis 1530 ungefähr. So, also wenn ich auf die Arbeit fahr, wenn ich auf die Arbeit fahr, wenn ich im Homeoffice bin dann meistens so von 7.30 bis 16 Uhr, so. Hab ich noch, also Leute, falls ich heute Subs übers sehe, müsst ihr wieder ein bisschen nachsehen, ich bin jetzt gleich, ich guck jetzt gleich nicht auf den Bildschirm, wir gucken uns jetzt gleich hier im, wir gucken uns jetzt gleich die Kamera an. Also ich guck selbst drauf, so mit Auge, ja, ich mach Auge und ihr müsst halt über die Kamera gucken. Also ich guck grad mal, hab ich was übers sehen? Ne, ich glaub nicht. So, okay. Also, was wir heute machen, ich dreh mich mal kurz um, ich versuch euch das mal kurz zu zeigen. Und zwar, wir müssen heute mal ein bisschen was retten, was ich noch an Zeug rumliegen hab. Und zwar, also, erste Mal, erste Mal Leute, ich weiß, jetzt ist bestimmt gleich wieder, jetzt ist bestimmt gleich wieder Leak im, Leak im Tablet oder irgendwie sowas angesagt. Als erstes, obei, ich mach das Tablet einfach nicht ins Bild, lul. Ähm, weil ich muss mal den Chat einblenden im Tablet, wenn ich den Chat im Tablet nicht einblende, seh ich nix, wenn ich umgedreht bin. So. Ups, wo bloß, wo ist er? Der ist live. Ja, Vorschaubildschirm anmachen. Jetzt muss ich mir noch mal die gleiche Werbung angucken von eben. Na toll. Ne, jetzt ist es Deutschland 73 oder irgendwie sowas, was ich mir angucken muss. Sag mal, warum gibt's bei der Werbung, warum gibt's bei der Werbung kein Chat mehr dabei? Wo ist das denn jetzt? Guck du mal da. Ah, jetzt geht der Chat. Okay, alles klar, ich hab nix gesagt. Chat, Chat geht. Ach so, Moment, ich hab euch ja gar nicht eingeblendet, lul. Ah, Chat, Chat geht. Exzellent, exzellent, Chat. So, ähm, jetzt hab ich nämlich Chatvorschau, weil ohne Chatvorschau ist ziemlich, ziemlich kacke. Das seh ich nämlich nix. So, wunderbar. So, also, ich zeig euch mal, was wir am Start haben. Und, ähm, nur gucken, dass ich das Headset nicht runterschmeiß. Also, ihr habt vielleicht festgestellt, ich hab jetzt hier ein Stativ hingestellt, also sprich, das ist jetzt ein bissl, äh, bisschen gerader alles. Ich hoffe, das passt besser als das die letzten zwei Mal. Hinten sieht man noch die Steckdoseleiste rumstehen. Gut, nicht so wild. Ähm, tja, müssen wir mal gucken. Also, was ich heute am Start hab, ist folgendes. Ähm, ich hab ja letztes Jahr für den Weihnachtsbaum was gebastelt. So, Moment, das muss ich euch mal kurz, muss ich mal kurz hier ranzerren mit dem Fuß, weil ich nicht genug Kabel hab. Lol, weh. So. Genau, ich hab jetzt letztes Mal ja was gebastelt, letztes Jahr, ich mach mal ein bissl Platz, für den Weihnachtsbaum. Das hab ich damals auch auf Twitter gepostet, aber, äh, das hat, das hat ein paar Bugs gehabt, ne. Und die Farben sahen nicht kacke aus, die Helligkeit war kacke und vor allem, ähm, war mein Programmieren kacke, weil ich halt, äh, so großer C++ Fan bin bisher, ne. Also, guckt mal hier. Also, ich versuch's euch mal irgendwie drunterzulegen, da. So, das ist ein LED Strip, und zwar so ein, das ist noch ein Alter, das ist noch so einer, ein WS2811, so ein LED Strip. Sind, glaubt, nur 50 Stück. Vivo Steel, Dankeschön für den Sub-Subscriptions. Excellent. Und, wartet mal, ich muss grad mal die andere Maus noch aufs Maus-Pad stellen, dass ich die Emotes auslesen kann, ohne rüberzugehen, das ist besser. Geht das jetzt? Lass mal kurz gucken. Ja, geht, exellent. Also, hier, das ist der LED Strip, den ich ja letztes Jahr für verwendet habe, und das Problem dabei ist, ich leg das einfach hier unten mal hin, sehe ich den Chat nämlich auch, so. Oh, Moment, jetzt hört ihr, wie es heute euch doppelt, oder? Ich hab hier nämlich noch Sound an, Sound will ich hier nicht an, haben wir am Ende. So, also, das ist der LED Strip von letztem Jahr, das ist ein ganz billiger, hab ich bei Amazon gekauft, für irgendwie, fragt mich nicht, 20 Euro oder so, also kein soll ich toller LED Strip. Der Gute an dem LED Strip ist, aber er ist wasserdicht komplett, das haben die Chinesen dadurch erreicht, indem sie hier extrem viel Heißkleber reingesprayt haben, also das ist quasi halb, halb China an Heißkleber drin. Zumindest ist das dicht, das Ding ist IP68, also das kannst du, glaub ich, kannst du die IP68 nicht auch untertauchen? Ich glaub schon, zumindest ist das wasserdicht, und der Vorteil für den Weihnachtsbaum ist, dass das so ein fast schwarzes Kabel ist, und diese grünen PCBs, also diese Dinger hier drin mit dem Controller, die siehst er in dem grünen Baum gar nicht. Also das Ding eignet sich eigentlich ganz gut für den Weihnachtsbaum, die Sache ist plus da, ist plus die, dass mein Programmier, das was Programmierter ein bisschen gesagt hat, und dass ich auch keine gescheite Verpackung hatte. Ich hatte das letztes Jahr in so ein komisches Case gemacht, und hatte das dann quasi so am Weihnachtsbaum hängen nehmen. Das war natürlich jetzt nicht der Zweck der Funktion, wenn du den Kabel an so dein Weihnachtsbaum hängen hast. Gut, deswegen hab ich überlegt, bauen wir das heut mal ein bisschen besser. Ich muss übrigens aufpassen, dass ich keinen Kurzschluss fabrizier, weil da, ne, wäre nicht so gut, dann weiß ich nicht was. Was passiert, wenn man LED-Strip kurzschließt? Ist da nur, ist da nur die LED kaputt hier vorne, oder ist da der ganze Strip im Arsch? Was passiert denn dann? Chat, ihr wisst das bestimmt. Big Brain Chat, ihr wisst sowas. Leuchten da ein paar weniger? Ja, ein paar oder alle? F für den LED-Strip ist dann. So, ja, da muss ich da ein paar Klemmen drüber machen oder so, dass ich das hier nicht kurzschließe. Zumindest das sind, glaubt, 50 Stück, und da kommt noch eine Sache dazu. Das ist ein NodeMCU ESP32, und der ist mir eigentlich zu schade für einen LED-Strip. Ja, soweit so gut. Übrigens, das Ganze ist auch deutlich wackelresistent, der jetzt im Vergleich zum letzten Mal. Also, wenn ich jetzt hier gegen den Tisch mal ein bisschen hau, mein, da seht ihr zwar, ich hau jetzt schon wirklich ordentlich gegen den Tisch. Ich hab mir extra einen Tisch hierfür hingefahren. So ein, so ein, also das ist ein ziemlich massiver, schwerer. Da muss ich ja wirklich hier ordentlich, ordentlich dagegen kloppen, dass da überhaupt wackelt der Tisch. Also, ich denk mal insgesamt, dass das bessere Stream-Quali ist. Tischviolenz, ja, genau. So, also, lass mal überlegen, mit was fangen wir dann am besten an. Genau, also jetzt hab ich euch den LED-Strip gezeigt, und der sah das letzte Mal ganz gut am Baum aus. Deswegen versuch ich den jetzt mal zu retten. Man sieht schon, irgendwie ist das hier auch nicht so wahnsinnig gut verarbeitet, aber ich mein, das funktioniert. So, gut, also das ist der LED-Strip, und dann hab ich mir gedacht, wir machen jetzt folgendes, mach das hier erstmal kurz mit der, kurz irgendwo weg. So, dann hab ich mir gedacht, wir machen folgendes, also mal kurz die Tools da oben in die Ecke. Das brauchen wir bestimmt gleich. So, Seitensteiner oben in die Ecke. Ich hab hier noch so eine Box, so eine IP68-Box, und da wollte ich mal was einbauen, deswegen hab ich da auch schon mit so einem Kegelbohrerloch rein gemacht. Die Sache ist nur die, dass das nicht reingepasst hat. Und jetzt hab ich eine IP68-Box mit dem Loch. Und da dachte ich mir so, das ist optimal, um da den Controller für die LED-Steuerung rein zu machen. Äh, da hast du eine Katze. Ja, hab ich, hab ich. Klar, das ist alles hier. Also ich hab nicht irgendwelche Selbstverstümmelungsdinger oder so. Das ist alles Katzending. Und hier, Moment, wo hab ich noch was hier? Hier hat sie mich heute Mittag übelst gekratzt. Die kratzt mich nicht absichtlich, muss man sagen. Hm, ich find's gar nicht jetzt gerade. Ach hier, guck mal da. Die kratzt mich nicht absichtlich, die ist so, halt wenn die hier, weiß ich ob, hat man das jetzt eigentlich gesehen hier? Wenn die, wenn die, wenn die, wenn die Monka Spielaction macht, dann kann's mal passieren, dass die bisschen zu sehr abgeht. Und außerdem hatte ich das wahrscheinlich nie anders gelernt. Genau, also das ist jetzt keine IP68-Box mit dem Loch. Aber ich hab mir gedacht, ich mein, ich hab ja mittlerweile ziemlich viel Gedöns am Start. Wir werden das, wir versuchen das mal zu retten. Und zwar wir nehmen die Box und passen den Deckel dazu. Äh, dann hat man hier noch so ein Gummi-Ding zum abdichten. Dann nehmen wir die Box und hier machen wir dann den Controller für den LED-Strip rein. Die Sache ist nur die, der Controller hier, Moment, den ich hier beim LED-Strip dabei hab, der passt zwar, ist aber ein bisserl groß. Da passt ja sonst nix mehr rein. Deswegen hole ich gleich mal meine Technik-Box, wo ich random alles reinschmeiße, was sonst nirgendwo hingehört. Und wir gucken mal, ob wir dann noch irgendeinen kleineren Controller finden. Fing in die Kamera. Lul. Ähm, und ich hab gedacht, wir probieren das jetzt zu retten, indem wir dann den Controller einbauen für die, für die LED-Leiste. Und zwar, ich hab hier was wasserdichtes. Und zwar, wartet mal, ich muss das gerade mit dem Fuß herstellen, weil ich zu weit weggeschmissen hab. So, und zwar hab ich hier so ein Ding. So Anschlüsse fürs Netzteil, weil, also Netzteil nennt man das hier. Das ist ein 5V, 3A Netzteil, das reicht für 50 LEDs, das ist nicht so das Ding. Die Netzteile hier sind übrigens tatsächlich ganz nützlich. Das ist ein Netzteil, das kann man einstellen von 3V bis zu 12V. Hat aber maximal, müsste man hier hinten mal kurz drauf gucken, hat aber maximal 3A. Das reicht, das sind dann quasi 15 Watt, wenns keine Verluste gibt unterwegs. Das reicht für 50 LEDs, das ist kein Problem. Ich hab hier auch noch, ah Moment, muss ich mal aufstehen, muss ich mal kurz holen, wartet mal. So, wir können dann auch mal ausprobieren, weil das letzte Mal so viele Leute gefragt haben, wie viel der Kram verbraucht. Wir können auch mal heute mal gucken, wir machen jetzt einfach hinten die Steckdosenleiste rein, ich zeig euch das mal. Da kann man mal gucken, was der ganze Kram verbraucht. Aber, ja, das leg ich jetzt erstmal unten hin. Und dann gucken wir mal. Exzellent. Einfach die ganze Box mit Heißkleber füllen. Ja, das ist natürlich auch eine Variante, das ist die Chinesen-Variante, so wie die das mit der LED-Leiste gemacht haben. So, das heißt, als erstes, was wir machen müssen, ich zeig euch mal, was ich jetzt hier vor hab. Ich hab mir hier so ein, das sind so paar Stecker-Durchführungs-Dinger, ich weiß nicht, wie das heißt, wie nennt man das eigentlich offiziell hier. Was ist denn das? Oh nein, Adresse liegt. Nein, agibated. Das ist... in... in... Porgers, in Frankreich. So, vat06seamwe.de, alles klar. Vollkommen logisch, aber auf jeden Fall made in China. Zumindest, was das ist, kann ich euch schon mal zeige, wenn ichs aufkrieg. Bin grad nicht in der Lage, es zu öffnen. Äh, sag mal, warum stellt ein On-Screen-Chat manche Emotes eigentlich so klein da? Macht er? Die Emotes sehen für mich eigentlich ziemlich genauso aus wie im Twitch-Chat in der Vorschau. So, zumindest, da sind solche Dinger drin. Und ihr seht, wenn ich euch mal das beim Netzteil zeig, da kann man den Netzteilstecker nehmen und zack, der passt rein. So, und ich hab Glück. Ich hab Glück. Das Loch hier ist zwar nen Ticken zu groß, aber nicht zu groß. Also sprich, ich kann da so nen Stecker rein machen. Und, ähm... Stimmt, der stellt die Emotes mega klein da, PepeLop. Weiß ich nicht, das ist irgendein Bug. Irgendein Better-Twitch-TV-Bug oder so, keine Ahnung. Das macht der nicht schon immer so. Weiß ich nicht, was der für Schmerzen hat. Das ist Bug vom Chat, da kann ich nix machen, weil ich verwende den, ich verwende den, ich glaub, das ist der Steam-Labs-Chat. Da kann ich, kann ich nix... Was macht der mit Salami? Kann der Salami? Wie sieht's mit Salami? Salami kann er darstellen, okay. Vielleicht hat er nur Probleme mit Better-Twitch-TV-Emotes. Ich weiß es nicht. Keine Ahnung. Kein Schimmer. Naja, zumindest, ihr seht, es wackelt aber ein bisschen hier. Guck her. Ist da wackelos. So, aber das ist nicht schlimm, weil von der Idee her sind hier einmal so Dichtungs-Dinger dabei. Da kann man dann am Ende, kann man die hier durch machen. Da macht man das hier rein. Dann hat man so ein bisschen Dichtung. Kann man dann übrigens auch hier reinstecken, was total sinnlos ist. So, da hat man eine Dichtung und für die andere Seite hat man hier noch so ein paar Ringe. Da kann man das dann da reinschrauben. So, irgendwie kann man das da reinschrauben, wenn man fingerfertig genug ist, das da reinzuschrauben. Aber jetzt reinschrauben bringt ja eh nix. Genau. Also sprich, das können wir zumindest so schon mal damit verwenden. Und ich glaube, das ist ein ganz gutes Ding, um den Controller hier reinzumachen. Jetzt kommt allerdings die große Preisfrage, welchen Controller verwenden wir? Und da bin ich mir nicht so sicher. Und da bin ich mir nicht so sicher, weil, ihr habt es gerade gesehen, der eigentliche Controller, der ist zu fett. Außerdem ist mir der ESP32 auch zu schade für. Ich brauch wahrscheinlich gleich noch ne Runde Schrumpfschläuche später, wenn ich den Krams da dran löte. Das müssen wir mal ausprobieren. Wo ich meine Schlauchhose hab, muss ich dann holen. Müssen wir mal gucken. So, jetzt müssen wir nämlich mal in meine Technikbox gucken. Da, wo ich den ganzen Kram, den ich sonst nirgendwo hinschreibe, hin machen kann, rein mache. Ich hoffe, das passt hier unten drunter. Ob wir noch irgendwas finden, was wir nehmen können. Also, ich mach mal auf. Zeigst mal her. Geht das so? Na jetzt. Wenn ihr das jetzt seht, dann seh ich das aber nimmer. Das ist ein ESP2866 Note MCU. Die würde sich richtig gut dafür eignen. Allerdings ist die genauso groß wie die alte und passt nicht so wirklich da. Also, das wird auf jeden Fall sehr eng. Und nachdem wir die Öffnung hier an der Seite haben, wird das glaub ich nix. Guck mal. Also sprich, wenn ich das, wir können das mal kurz ausprobieren. Also sprich, wenn ich das da reinmache, das passt dem Leben nicht rein. Ich mein, das passt, das kann jetzt, nee, guck, das passt nicht. Oder, naja, also nee, nee, das passt nicht. Ich muss ja hier noch, ich muss ja hier noch die Stromkabel dran machen. Ich muss ja hier noch die Stromkabel dran machen. Und das irgendwie anklipsen. Also nee, nee, das wird nix. Das passt hier nicht rein. Vielleicht passt hochkant rein oder so, aber nee. Also keine Chance. Wir brauchen irgendwie, ich hoffe, wir finden noch ein bisschen kleinere. Ich hab noch ein paar, ich hab noch D1 Minis. Mal gucken, ob die funktionieren. Also das passt nicht. Also das hier ist wirklich nur so eine Notlösung, das Ding. Ich lass es mal draußen, aber ich glaube nicht, dass wir das verwenden können. So, guck mal mal weiter. Was haben wir denn da noch schönes drin? Also was haben wir denn da noch schönes drin? Relays, das brauchen wir schon mal nicht. Eine M2 brauchen wir schon mal nicht. Äh, ein übrig gebliebener TT Go Laura Board mit GPS, Poggers, mit GPS und Antenne. Eigentlich richtig, das ist eigentlich ein richtig cooles Board. Das brauchen wir nicht für, das brauchen wir heute für nichts, ja. Aber du hast, du hast einen Slot für eine Batterie, für so eine 18655 oder so. Weißt, wie heißen die, wie heißen die Batterien, die man auch in E-Zigaretten macht. 18655, 18550, irgendwie so, diese dicken Akkus. 18650, ja genau die meine ich. Kommt da rein, dann hast du eine Antenne, eine Nora Antenne, keine WLAN Antenne, WLAN hast du ja auch an Board. Und du hast noch ein GPS Modul dabei, eigentlich ziemlich, ziemlich cooles Board. Und die Kabel reißen hier schon fast durch. Gut, wir wollen das ja nicht zu lange mit irgendwelchen komischen Boards aufhalten, die wir eh nicht verwenden. So, was haben wir denn hier sonst noch? Äh, Bodenfeuchtigkeitssensor brauchen wir nicht. Äh, Sensor, Kram, was haben wir denn da noch? Relays, Relays, äh, ich hab Spannungswandler oder so. Was haben wir hier? Einen Sensor, ich müsste noch D1 Minis, aha, aha, exzellent, den brauchen wir. Das ist ein guter Controller dafür. Ich guck mal schnell durch, ob ich noch einen fertig gelöteten hab, weil da muss ich, ah, guck mal hier, Powergas noch besser. Haben wir da sonst noch was? Ich hätte noch was, ich hätte noch was mit Display, brauchen wir aber nicht wirklich. Guck mal, ok, ich hab noch genug. Reicht, easy, easy. Und ich seh gerade, Keg W, wo kommt denn der her? Da ist noch Raspberry Zero drinne. Ha, ich hab letztens einen gesucht und keinen gefunden. Falls wir noch Bewegungssensor brauchen, ne, ganz Schwachsinn, brauchen wir nicht. Ok, äh, nehmen wir mal den da und den schmeiß ich da hinten mal hin, falls der kaputt ist, man weiß ja nie. So, machen wir den ganzen Kram wieder rein. Und den anderen auch rein und dann können wir uns mal angucken, ob das funkt. Stunks. Postleitzahl League, ja, genau, Postleitzahl League. Guck hier, hier ist Postleitzahl League. Moment Leute, ich zeig's euch, Postleitzahl League. Hier, da war's irgendwo, hier, da. Sonst irgendwo, ne? So. Also. So, guck mal, wie das ganze reinpasst. Ok, das wird reinpassen. Ok, ok, wir probieren das mal aus. Ich mach das mal fest. Ich mein, das muss da eh rein, ne? Ich mach das, wobei, vielleicht soll ich, vielleicht soll ich es erstmal festlöten. Ich glaub, ich löte das erstmal fest. Bevor wir die Controller Geschichte machen, glaub ich, ich löte das Ding erstmal fest, also ich löte da zumindest einmal zwei, zwei Kabels dran, dass wir ein bisschen Platz haben. Und dann kommt, der macht das hier schäpp, oder? Guck mal, was hab ich denn da gemacht? Seht ihr das? Seht ihr das? Guck mal, wie schäpp das ist. Guck mal. Sieht man das? Wie, wie, wie schäpp, wie schäpp der ist? Äh. Er soll uns jetzt zwar nicht stören, aber der ist schon echt hardcore schäpp. Absicht. Calculated. So, wie kriegt man das jetzt hier fest? Einfach so? Ah, exellent. Guck mal, easy. Hm. Wobei, jetzt bin, ich bin ja blöd. Moment mal, Max, nein, nicht festdrehen, nicht festdrehen, erstmal, erstmal, erstmal was dranlöten. So. Also, ich würd sagen, ich mach mal kurz mein Löt, Lötstells an. Nach wie vor immer noch die gleiche Lötstation wie immer, ne? Weil ich hier quasi, jedes Mal, wenn wir sowas hier im Stream machen, wird gefragt, äh, was ist das für eine Lötstation? Das ist eine, man sieht's hier, glaub ich, man sieht's im Stream, ja? Eine, ein Erza Icon Nano. Beste, gehört dieser Lötkolben dazu. Mit wechselbarer Spitze. Poggers. So, äh, so während das Ding, und ihr seht, wie schnell das heizt, ne? Das ist schon hoch auf 880 Grad. Kein RGB-Lötkolben, aber das ist nächstes Projekt. Nicht, nicht spoilern, nicht spoilern. So, also, ich hab die Dinger schon mal verwendet, ich weiß, das da ist Ground, und das da ist, äh, ja dann mit dem Netzteil 5 Volt. Hier, der kleine in der Mitte ist quasi plus, und das da außen ist minus. Dementsprechend werd ich jetzt mal hier irgendwie sowas da dranlöten. So, irgendwie so in der Richtung. Und dann mal gucken, was wir damit machen. Wobei, ne, wir machen vorher noch mal was anderes. Nico, moin. Ähm, wir machen mal, wir machen mal was anderes. Wir gucken erstmal, wie wir das mit den Klemmen machen können. Moment. Ich hab jetzt nämlich was gekauft. Extra für den Stream, Leute, hab ich mir das gekauft. Weil wir das letzte Mal so lang Klemmen gesucht haben, ich hab mir jetzt ein Sortiment gekauft. Ein Vago-Klemmen-Sortiment. Extra für den Stream. Dass ich immer was am Start hab und nicht irgendwie welche Klemmen suchen muss. Guck mal. Wir haben doppelte, also oder einzelne, ich weiß nicht wie man das nennt. Wir haben dreifache. Wir haben, äh, und ich glaub wir haben fünffache. Die sind echt nice. Ich hab auch noch die alten, die so eierförmig sind. Aber die hier sind richtig cool. Einfach hier rein. Und was die auch gut gemacht haben, man kann jetzt hier unten rein gucken, wie weit man guckt. Ich weiß nicht, ob ich euch das jetzt gezeigt kriege. Aber ich mach mal kurz hier den, ich klapp das mal auf. Na, man sieht jetzt hier unten, ich versuch euch das jetzt mal zu zeigen ohne voll, man sieht wie weit man das Kabel drin hat. Was ganz praktisch ist, weil in dem Fall, das hier ist eigentlich ein Ticken kurz. Jetzt hätte ich noch ein bisschen weiter abisolieren müssen. Jetzt kann ich gucken, ok, passt. Klaps, Clips, Kabel drinnen. Und das ist wirklich, ihr seht ihr, das ist echt fest. Einklemmen, pock, ja. Die sind so weit, ich weiß, also nicht, ich glaub wir zweckentfremden die hier gar nicht. Ich glaub diese Sorte Klemmen sind geeignet für starre Kabel und für, wie nennt sich das, diese Litzen sind das glaub ich, Kabel, wo so ganz viele kleine Kabel, Kupferdrähtchen in einem Kabel drin sind. Ich glaub die darf man offiziell für beides verwenden, bis zu, rat mich nicht, hier stehts doch hier neben, bis zu einem Durchmesser von 1,6, nee, 1,6 Millimeter, könnte 1,6 Millimeter sein. Also das passt hier, was wir hier haben, dafür eignet sich das ganz gut. So, und wir brauchen auf jeden Fall keine einzelne Klemme, sondern wir werden wahrscheinlich zwei Dreier brauchen, weil, warte mal kurz hier, weil soweit ich mir das überlegt hab, werden wir das folgendermaßen machen, machen das Ding hier nei, machen das hier nei, zack, löten hier noch die Kabel dran und dann können wir ne Klemme irgendwie jeweils hier und hier hin machen und irgendwie dann so in die Mitte, in die Mitte machen wir den Controller, irgendwie, irgendwie so in der Richtung. Müssen wir mal gucken, wie das am besten passt. Wir können auch, wir können auch den Controller ganz in die Eck hier unten machen, oder passt der so hin? Oh, guck mal der passt so hin, nice, nice, nice, nice. Der passt glaub ich genau da in die Eck, guck mal da passt genau in die Eck hier der Controller, poggers, da kommt er hin, der kommt genau hier in die Eck hin der Controller und der ist sogar richtig fest, guck mal, wenn man den da in die Ecke einklemmt, wenn man den in die Ecke einklemmt dann fällt er nicht mal raus, den muss ich gar nicht festkleben, der ist einfach so fest. Poggers, ja, so und dann können wir die Klemmen später irgendwo, nicht hier so hin machen, guck mal das passt auch genau, das ist wie dafür gemacht, das Gehäuse ist wie dafür gemacht und hier machen wir, oh ne Moment das ist keine so gute Idee, da muss ich auf jeden Fall noch zwei Schrumpf-Schläuche gleich drüber machen, weil ansonsten gibt es hier irgendwann die Kurzschlüsse. Intended Design, ah yes, ja genau passt doch wunderbar, also so ungefähr machen wir die Anordnung da drin und ich würd sagen von hier machen wir dann quasi so ein, ok das kann ich halbieren, die Kabels und da klemmen wir dann die LEDs dran, schauen wir mal, hast mit einer Katze gespielt, ja ja, am schlimmsten heute hier, aber hier guck dir das mal an, die Katze wollts halt echt wissen, darf man das zeigen, ist das schon, ist das schon zu viel, zu viel für Toss am Liege, ja. Mach doch einen zweiten Hohlbuchsenstecker an die LEDs und noch eine zweite Buchse an das Gehäuse, ja das hab ich mir auch schon überlegt, das könnte man nämlich genau hier machen, da könnte man einen machen und da drüben könnte man einen machen, die Sache ist die, erstmal überlegen, geht das, ne das geht nicht, die LEDs brauchen drei Kabel, die LEDs brauchen plus minus und data, das geht da drüber nicht, wie wärs mal mit nem Langschluss, mit einem was, weiss nicht was ein Langschluss ist, wie gesagt ich hab von so Elektro-Kram auch nicht wirklich Ahnung, achso das Gegenteil vom Kurzschluss, null, jebaited, ich dachte das wär irgendwie ne, ich hats gerade vom Klemmen, ich hab gedacht das wär ne Klemme, wo man besonders langes Kabel reinstecken kann und dann schließen oder so, low brain Aktion, hätt ich selbst drauf kommen können, dass das Gegenteil vom Kurzschluss ist, jebaited, naja ok, also aber ich muss sagen die Idee find ich gut, weil man könnte ohne Probleme auf die andere Seite noch ein Loch machen und dort dann die LEDs, das ist eine LED Kabel rausführen, aber wisst ihr was, ich glaube wir werden es heute nicht komplett zumachen, weil ich bin mir noch nicht sicher, ob ich die LED Leiste anschließen muss an beide Seiten oder ob das bei 50 LEDs an nur einer Seite reicht, also das weiß ich noch nicht, das müssen wir dann gleich ausprobieren, deswegen wisst ihr wahrscheinlich, wenn ich das jetzt erstmal fertigbaut und ich lass es wahrscheinlich auf, oder wir machen was ganz hässliches, ich lass das LED Kabel einfach an einer Ecke rausgucken von der Box, weil erst wenn ich am Weihnachtsbaum anschließe und mir das mal in Ruhe angeguckt hab, wie das mit der Helligkeit ist und alles, dann weiß ich, oder vor allem dann weiß ich auch ob ich die Sache im Kreis lege, sodass ich mit der LED Leiste wieder an der Box rauskomme oder ob ich es eher von unten nach oben lege und quasi gar nicht mehr in die Box runter komm, muss ich mal gucken wie ich das mach, bin ich mir noch nicht ganz sicher, aber wir machen jetzt erstmal den normalen Anschluss, ok lass mal überlegen, womit fangen wir am besten an, ich würd sagen ich löte mal hier zwei Kabel dran, den machen wir wieder raus, machen wir mal die Klemmen weg, so, also, probieren wir das mal, ich muss mir unbedingt gleich noch, ich hol mal meine Schrumpfschläuche kurz, wartet mal, Schrumpfschlauchsohr, Schrumpfchamp, Schrumpfchamp auf dem Weg, Schrumpfchamp am Start, alles klar, alles klar, alles klar, alles klar, Pock-Schrumpf, Kopfhörer-Leak, OMG, liegt, ist auch so unbekannte was ich für Kopfhörer habe, so, by the way die Dinger hab ich mir gekauft, die Polster sehen nicht mal allzu gut aus, aber das sind immer noch Biodynamics MMX300 und ohne Mist die Dinger sind, ich hab sogar neue Polster hier, die Dinger sind, die hab ich seit acht Jahren und das sind die besten Headsets, das beste Headset was es gibt, das war zwar recht teuer im Vergleich zu anderen Sachen, aber, also für andere Headsets, aber das war jedes, jedes, jeder Cent wert, äh, war früher das Gaming Headset, das ist heute immer noch das Gaming Headset, es gibt meiner Meinung nach nichts besseres, so, also eine Runde für Schrumpfchamp, was braucht man da so, lasst mal gucken, ich hab jetzt keine Heißluft da, wir werden das jetzt auf die ekelige Art machen, mit dem Lötkolben, so, also guck mal was, was braucht man da für, für Schrumpfsorgen, ich würd sagen, wenn wir Glück haben, können wir einen schwarzen und einen roten nehmen oder vielleicht passen, vielleicht passen sogar die kleinen da drüber, guck mal hier, da weiß ich auch gleich sofort was plus und minus ist, ha, ha, Postchamp, Postchamp, das geht, jetzt ist nur noch die Frage, ob das auch hier drüber geht, geht das hier drüber, äh, ja, ähm, ja, ich würd sagen, kann man mit Leben, vergleichbar, wären gute Kopfhörer mit Klinkenanschluss und einem Modmic oder sowas, was, einem V-Mod-Boom-Pro, was ist das denn, Moment, das muss ich jetzt mal kurz nachgucken, was ist denn ein, ein was, V-Boom, nee, Moment, wat, V-Moda-Boom-Pro, ich kenn nur, ich kenn nur das Modmic, aber die Dinger kenn ich noch nicht, was ist das für ein, das ist quasi so ne Art Modmic, das ist quasi so ne Art Modmic, nur ne ganze Ecke günstiger als das Modmic, weil die Modmic Leute haben bisschen, finde ich, so ihre Kundschaft aus den Augen verloren, meiner Meinung nach zumindest, die, ähm, waren mal richtig nice und die Dinger sind auch noch richtig nice, aber das Problem ist bei den Modmics, die sind, find ich, mittlerweile viel zu teuer, ich mein, 80 Dollar, da wolltest du jetzt mal nett übertreiben, oder? So, ok, dann hast du noch das Uni, aber selbst 50, das im Prinzip kannst du das in Euro kaufen, ja, ist das, ist das viel zu teuer. Ich hab noch ein paar, ich hab noch drei alte Modmics, zwei hab ich mir gekauft, eins haben die mir mal geschickt und die sind glaub ich sauer, weil ich das nie gezeigt habe. Ich hab ihm gesagt, oh ja, ich würd's gern, der hat mich gefragt, ob ich ein Refuse Sample will und da hab ich gesagt, oh ja, nehm ich gerne und dann war er sauer, weil ich nie ein Refuse drüber gemacht hab. So, was kostet so ein Modmic Uno? Uni, das war aber noch nichtmal vorsätzlich irgendwie, mir hat das nicht gefallen. Guckt euch das mal, das ist viel zu, what the hell, so das ist 130, äh, dafür krieg ich ja schon komplett eigenes gutes, halbwegs gutes Mikrofon. Ja, ne, ne, ne, ne. Also dann muss ich ehrlich sagen, 35 Euro finde ich gerechtfertigt, ich hab, ich weiß halt nicht, ob das was taugt, das sieht schon ziemlich nach China, China, Plastik Kram aus, aber man weiß ja nie. Die Leute sind auf diesen Fotos immer so extrem glücklich, so, yeah, ich hab keine Ahnung, was ich hier mache, aber ich hab nen Controller in der Hand und grinse vor mich hin. Naja. Okay, äh, machen wir mal weiter. Ja, also, ich muss mich wieder umdrehen, aber, aber, ich hab jetzt übrigens meine ordentliche Abisolierzange da, nachdem wir das letzte Mal so rumgekrebst haben. Pass mal auf, der Isolierungschamp ist am Start, damit kann man, guck mal hier, der ist richtig poggers, das Ding, damit kann man das Kabel hier raus, oder, zack, ich muss jetzt mal gucken, ob man das sieht, ich muss mal kurz warten, bis mein Vorschau geladen hat, äh, sieht man nicht richtig so, guck mal, man kann es, man macht es hier bis zum Anschlag rein, drückt hier rein und jetzt, pass mal auf, zack und komplett perfekt abisoliert, so muss das sein, so muss das sein. Naja, die andere Seite übrigens viel zu lang, also, die ist wirklich nice, geht auch vom Preis, ich glaub kostet 15 Euro oder so, oder irgendwie sowas in dem Dreh. Super, Super 4 Plus, mal gucken, was das Ding kostet jetzt aktuell. Ja, größere Kabel kannst du damit nicht machen, das stimmt, also richtig dicke Kabel kannst du damit nicht machen. Gucken, was das Ding mittlerweile kostet, ich hab das auch mal in irgendeinem Angebot bekommen, Super 4, nicht Suda, Super 4 Plus. Ja, guck dir das mal an, da kannst du dich echt nicht beschweren, du kriegst das auch noch mit dem, kriegst auch noch den Super Knips, das sieht aus wie ein Knipper, ja, ist es auch, kriegst auch die Kombination, den Knipper-Seidenschneider und die Abisolierzange, naja, eigentlich gar nicht mal zu übel, also das kann man, das ist übrigens, by the way, das ist ein super Weihnachtsgeschenk für jemand, der bastelt und sowas noch nicht hat. Das ist wirklich Pock, ja, das Ding ist wirklich gut, die Kombis könnte sein lassen, ja, aber ich bin damit echt zufrieden mit diesem Teil. Ja, genau, du kannst was drehen, ge. Ups. Einfach mal so, mir war es gerade danach. Ok, also, dann machen wir das mal weg. So, wie lange brauchen wir die Kabel hier ungefähr? Ich würde sagen, wir machen, also wenn wir die Klemmen hier neben hin machen, dann brauchen wir, wie so, so, so, nicht so ein Stück, mein, kürzen können wir sie immer noch, wir machen jetzt einfach mal hier. Machen wir mal ab, im Zweifel, weil ich habe noch genug am Start, so, da müssen wir einmal noch mal den abisoliert Champ rausholen, zack, zack, zack, oh, ups, zack, wunderbar, passt, also wirklich, nice, macht richtig Bock, damit Zeug abzuesolieren, ich könnte den ganzen Tag, bam, abisolieren. Was wird gebaut? Wir bauen für den Weihnachtsbaum eine LED, Steuerung, und das kommt in die Box hier. Aber, das ist nicht so eine Leiste, wie das letzte Mal, das ist eine wasserdichte Leiste, und zwar auch, die ganzen LEDs, ich habe es hier irgendwo, die ganzen LEDs, warte mal, die ganzen LEDs sind an so einer, an so einer, äh, Schnur dran, dass man es besser um den Baum machen kann. Benutze den ESP32, ich hatte die ganze Zeit einen ESP32 dafür, aber, der ist zu groß für die Box, die Node CU, die ich da habe, und einen Tiny Pico will ich da nicht für opfern, ähm, deswegen nehmen wir jetzt hier so ein D1 Mini, der tut es auch. Ok, aber, jetzt löten wir erstmal den Krams hier fest, tja. Es stört mich ein bisschen, dass das nicht ganz drum geht, das ab, äh, der, der Schrumpfschluch, aber mal ganz im Ernst, das biegt sich im Leben hier nicht runter, das können wir eigentlich so lassen. So, und hier machen wir dann den drüber, gut, ich glaube das passt. Vielleicht, vielleicht finden wir da auch noch was, was ein bisschen, was ein bisschen besser passt, lasst mal kurz reingucken, ob wir noch irgendwas haben. Äh, wobei, ganz ehrlich, die schwarzen Schläuche gefallen mir ganz gut, da weiß ich gleich, was plus und minus ist. Die grünen werden auch noch ok, mit den roten, die sind zu klein. Na, wir bleiben bei dem, das ist ok. Das ist schon ok, machen wir das hier mal kurz weg. Also, nehmen wir mal den Löt-Champ, erstmal kurz gucken, dass der wieder hoch fährt, ich hab' den ja gefühlt vor einer halben Stunde schon eingeschaltet, aber, guck mal, der hat übrigens auch eine automatische Temperatursteuerung, was richtig pock ist, wenn er nicht benutzt wird, fährt er sich runter, und wenn man ihn dann wo dran hält, irgendwie, sagen wir mal, wenn man ihn hier so wo dran hält, ich glaube das checkt er da mit der Zeit, dann sollte er sich eigentlich wieder hochfahren, dachte ich. Dachte er, dann soll es sich automatisch wieder hochfahren, macht er nicht. Hm, macht er anscheinend nicht, juckt ihn nicht, aber, wir können ja einfach ausschalten und wieder einschalten, dann fährt er sich hoch. Dachte ich, der fährt sich automatisch wieder hoch, wenn man irgendwo dran geht. So, also, dann würde ich sagen, das da machen wir, geh mal fort, das da plus in die Mitte, das einmal Ground oben hin, so, dann werden wir erstmal ein bisschen Löt-Champ an die Kabels machen, ich hoffe, ich bin im Bild, wo, äh, was mache ich denn jetzt hier, und KS, ja, ist ein bisschen eng, dass das alles in die Kamera passt, deswegen, aber, wird schon, wird schon gehen, wird es hier entwirren. Mit dem Kram muss man ein bisschen aufpassen, weil das ist heiß, das ist jetzt halt 380 Grad heiß, das ist, im wahrsten Sinne des Wortes, Pains-Champ, wenn man das irgendwo hin kriegt. Mal gucken, ob wir das irgendwie... Excellent! Stell ich auch noch gleich. Oh, wunderbar. So, und jetzt machen wir hier auch noch was dran. So, haben wir hier auch noch was dran. Also, wie stellt man das jetzt hin, hier so, hm? So, gut. Hier unten auch noch. Das Problem ist, ich sehe nur die Hälfte, weil ich so einen scheiß Winkel hier gerade habe. Auf. Schmelz-Champ. Ah, yes. Okay, du brauchst eine dritte Hand, ich habe eine dritte Hand, die ist bloß zu weit weg, die hängt hier hinten am Tisch, das kriege ich hier nicht rein. Ich habe eine, ich habe halt so eine, die kannst du nebenan Tisch schrauben. Ich bräuchte einen, die ich hier hinstellen kann. Hast du den Chat im Blick? Ne, gerade nicht. Habe ich was übersehen? Die Matte, das ist irgendeine billige Silikon-Matte von Amazon. Der löht Dampfbeste, ja. Ich sehe, da spricht der Kenner. Soll ich mir eine AIO von Arctic holen? Du warst eher der Luftkühl-Fanboy, korrekt. Ich bin kein, ich mag keine Wasserkühlung. Aber Knippex ist doch nicht mehr die Qualität wie vor 10 Jahren. Keine Ahnung. Also die Zange ist keine Knippex-Zange, sie ist eine Yukari. Vielleicht ist das auch Knippex, keine Ahnung, kann sein. Wer weiß denn, wer da wem gehört. Aber ich muss ehrlich sagen, also ich habe jetzt, ich habe ein paar Seitenschneider von denen, ich habe hier diese, ich habe ein paar Zangen von denen, unter anderem das Teil hier. Also ich bin damit ehrlich gesagt ziemlich zufrieden. Was wird gebastelt? LED-Kette für den Weihnachtsbaum in die Kiste hier rein. So, jetzt müssen wir, wir müssen erst mal ein Stecker, wir sind gerade dabei, den Stecker hier dran zu machen. Hält die Matte auch die Temperaturen beim Löten aus? Ja, guck. Juckt ihr nicht. Die mag das vielleicht nicht, wenn da eine halbe Stunde der Lötkolb drauf liegt und warm ist, ja. Aber das geht, ist kein Problem. Kann man den Lötkolb ein bisschen sauber machen. Sollte man, sollte man nicht unbedingt unnötig Plastik verkohlen lassen dran. Ist übrigens auch ein gutes Weihnachtsgeschenk für einen, der noch keine hat. Okay, ähm, also wo sind wir jetzt hier? Warte mal, da. So viel Zeug auf einmal hier rumliegen. Also den da brauchen wir jetzt, den müssen wir jetzt, wir machen erst mal, wir machen erst mal, vielleicht soll ich, vielleicht soll ich das Gummi mal abmachen, falls das hier zu heiß wird. Das Gummi mag das bestimmt nicht, weil das ist so weit unten, dass bis das warm wird. Also dann machen wir das hier doch mal dran. Heißchamp? Heizungschamp? Hallo? Please, äh, please, heizwerden? Hallo, was ist denn das? So. Naja. Das hat man auch schon schöner gesehen. Mach das noch mal kurz ein bisschen gerader. Das Dumme ist, ich seh, ich seh das nicht richtig von hier. Ja, das ist gut jetzt. Das ist jetzt so eigentlich ganz gut. Kann man lassen. Was genau pimmst du da? Ich mach ne LED Kette, die man um den Weihnachtsbaum machen kann und dann über das Smartphone steuern oder über die Heimautomatisierung steuern. So, also der ist ordentlich dran, da machen wir den anderen jetzt noch ordentlich dran. Ich hoffe man siehts hier, weil ich sehs nicht richtig, das ist mein Problem gerade. Sieht man das hier unten stehen? Ja, ok. So, jetzt müssen wir erstmal kurz Heizchampen. Dass es hier reingeht. Ich muss mal ein bisschen vor, dass ich selbst was seh. Ah, das ist gut geworden. Das ist gut geworden hier. Guck mal. Das ist gut geworden. Der ist richtig schön drin und richtig ordentlich fest. Exzellent. So, jetzt können wir da die Schrumpfschläuche drüber machen. Dann mach die Augen zu. So, ähm. Dinge mal drüber und da. Aber das ist doch keine Kette. Alter, was ist das jetzt wieder für ein Lowbradejet? Das ist der Stromanschluss. So, guck mal ob der hier passt. Ja, ja, damit kann man leben. Guck mal, das kommt im Leben nicht da unten dran. So, normalerweise macht man sowas jetzt entweder mit so nem Heißluftgebläse oder man macht das mit nem Feuerzeug, wobei das Heißluftgebläse deutlich besser ist, um Schrumpfschläuche zu schrumpfen. Die Sache ist nur die. Ich hab kein Bock das jetzt zu holen. Ah, man könnte den auch abschneiden, aber das ist egal. So, jetzt wir machen jetzt die Billigvariante. Wir machen jetzt einfach mit dem Lötkolben dran und schrumpfen's. Ich glaub das ist so ein How to not. So. Excellent. Ups, jetzt bin ich irgendwie auf dem Chat geguckt. Aber gehen tut's. Ist eigentlich keine allzu gute Idee. Aber ihr seht, das geht. So, so, so, so, so, so, so, so, so, so, so. Ich seh, der Chat ist begeistert. So. Mit drei Minuten Arbeit wieder bewegen gespart, so sieht's aus. Ich will hier ehrlich gesagt auch im Zimmer mit geschlossenem Zeug alles, ich will hier auch kein Heißluftstelz machen. So, ne. Das ist doch jetzt was. Der ist Pepo fetter Schlauch. Hier, guckt euch das mal an. So, excellent. Wunderbar. Und jetzt können wir das. Wichtig ist, dass es auf deine Art ist. Genau, so sieht's aus. Ne, normalerweise mach ich's auch lieber mit Heißluft, aber ich hab jetzt erstens keinen Bock das zu holen und zweitens hab ich keinen Bock jetzt irgendwie noch mit Heißluft darum zu hantieren. Gut. Oh, so richtig fest ist es aber nicht, oder? Ist der etwa zu fett, der Schlauch? Ist der etwa zu fett? Aber mit Heißluft geht das schon besser. So, jetzt ist gut. Ah, das ist fest. Und der hier ist auch fest? Okay, alles klar. Sehr schön. Der Chat kennt sich mit dem fetten Schlauch aus. Excellent. Gut, also, jetzt haben wir den Kram. Jetzt können wir mal gucken, ob das hier alles schön passt. Ah, das sieht auch schon mal ganz brauchbar aus. Da müssen wir jetzt noch die Mutter drüber machen und dann müsste man das eigentlich schön zukriegen. Moment, erst mal ein bisschen. Kurz mal biegen, das ganze, das ist ein bisschen lang. So, jetzt. Aha, der ist doch gar nicht so schlecht geworden hier. Ist doch gar nicht so übel. Die Kiste hat ein bisschen gelitten, das war aber jetzt nicht ich. Seid mal her, können wir das vielleicht noch irgendwie hier so ein bisschen. Äh, passt. Ist eigentlich ziemlich gut, guck mal, man kann das sogar zumachen vorne. Jetzt bräuchte man noch irgendwie so einen kleinen Maul-Schlüssel oder so, den ich jetzt aber auch nicht da habe. Ja, jetzt ist wirklich ganz gut fest. Ja, so, excellent, jetzt haben wir das. Jetzt müssen wir mal schauen. Müssen wir mal schauen, wie wir das hier drinnen verteilen mit den Klemmen. Also, den Controller hatten wir gesagt, den Controller machen wir hier in die Ecke. Ne, das passt nicht. Den Controller müssen wir da in die Ecke machen. Hier in die Ecke kommt der Controller, passt. So, und die Klemmen machen wir auf die Seite, alles klar. Okay, also, machen wir hier mal den da rein. Mal gucken, wie machen wir das jetzt am besten. Lass mal kurz schauen. Wie kriegen wir das jetzt am besten hin? So, ich muss das, wenn ich das so hintereinander mache, ist Low-Prain. Ich muss das ja später wieder aufkriegen, wenn ich noch die zweite Sache dran machen will. Kriegen wir das vielleicht sogar so hier rein? Wartet mal. Oh, Big-Prain. Achtung, Achtung, Achtung. Boah, guckt mal. Alter, das passt ja wie angegossen, ey. Guckt mal. Lull. Ich muss überhaupt nichts festkleben. Das passt richtig gut. Wie als wäre es dafür gemacht, ey. So, jetzt kann ich, okay, dann mache ich das nämlich so. Dann machen wir das jetzt mal auf. So, machen den hier rein. Nämlich so. So. Den da machen wir da rein. Der Klemm so. Ups, falsche, falsche Seite. Moment, äh, warte mal. Soll ich das richtig rummach? Den da? Machen wir mal so. Ja, nice, nice, nice. So, und den da? Den machen wir dann anders drum. Bevor ihr irgendwie eine Anfälle kriegt, ist eh nur 5 Volt. Also, kann nix großeres passieren. Die Frage ist, wie lange hält das Ganze? Das hält. Das hält. Da mache ich mir keine Gedanken, dass das nicht hält. Also, das macht recht robusten Eindruck, das ganze Zeug. Und auch hier unten das. Das macht, das macht wirklich einen recht robusten Eindruck. Okay, nice. Wartet mal kurz. Den flaschen wir jetzt gleich noch. Ey, das passt richtig gut. Guckt mal. Als wäre es dafür gemacht, ey. Als wäre es dafür gemacht, passt das. Richtig geil. Gut, das fuddeln wir dann später rein, wenn wir die Kiste zumachen. Jetzt müssen wir den irgendwie noch ein bisschen, bisschen, bisschen rumbiegen oder so und dann mal gucken. Das ist bestimmt besser als manchina Kram, ja. So, jetzt müssen wir den, jetzt müssen wir den flaschen mit WLED vor, wisst ihr was das Coole ist? Mit, ähm, vor einer Woche ist eine neue WLED-Version rausgekommen. Die können wir uns jetzt gleich noch angucken. Kurz was trinken. Übrigens trocknen, trocknen Hals, Gachibas. Ah, exellent. So. Also, jetzt flaschen wir erstmal. Ich weiß, ich hatte ein paar kaputte Devon-Mini. Ich hoffe, das ist kein kaputtener. Sonst sehen wir einen der anderen. Also. ESP-Tool. Zack. Also. WLED, das ist die Software, die wir verwenden für Steuerung von der LED-Schreie. Und da kam vor sieben Tagen, nee vor acht Tagen, kam eine neue Version raus. Was ziemlich praktisch ist. Da können wir uns gleich die neue Version angucken. So, was brauchen wir für eine Firmware? Der Stream hat heute keine Verzögerung. Nee, ich hab das Delay von gestern rausgenommen. Gestern hatte ich ja nur Delay wegen Battlefield drin. So, also was für eine Software brauchen wir? Wir haben kein ESP-32, wir brauchen auch keinen ESP-32-Bootloader. Wir brauchen die ESP-2866-Bin. Und jetzt guck ich mal ganz kurz in den Chat, weil ich hab bestimmt die Hälfte wieder übersehen. BigBrainChampPoggers, so sieht's aus. Man schlau... Gut zu wissen, gut zu wissen. Moin, Ice? Nein, Dice eher, oder Quice? Man weiß es nicht. Ich glaube, es gab nix. Ich glaube, es gab nix in der Zwischenzeit. So, WLED-Release. Ach so, Moment. Doch, mit dem ESP-Tool kann ich das auffleschen, klar. Moin, wo kann man denn so ein Gehäuse kaufen? Was für ein Gehäuse? Was meinste für ein Gehäuse? Was meinste? Ah, du meinst das hier, du meinst die Box, oder was? Das hier? Äh, bei Amazon. Kannste bei Amazon kaufen. Du musst nur gucken, dass du nicht den ESP-Best nimmst. Du suchst IP68-Box oder Case oder irgendwie sowas, ja. Ja, und dann scrollst du dich immer durch. Sowas hier zum Beispiel. Das ist übrigens zu teuer, ne? Also, manche so eine kleine Box 9 Euro, da musst du gucken, dass du da ein bisschen weniger für bezahlst. Sowas kann man sich auch ganz gut in China bestellen. Guck mal, Aliexpress. Da kannst du nämlich in China einfach einen 10er-Pack oder so bestellen, der dann das ganze kostet. Pff, erstmal Aliexpress-Klo-Papier. Guck mal, IP68-Case. Oh, das sind die ganzen iPhone-Cases. Ach, was kann ich denn bei Aliexpress suchen? IP68-Case. Tja, also man kann das mit Sicherheit günstig kaufen. Ich weiß aber nicht, was ich suchen muss bei Aliexpress. Ja, aber so kleine Boxen sind wirklich praktisch. Musst du halt mal gucken, dass es billiger ist, weil ich sag mal so. Mehr als maximal 5 Euro pro Box will ich da nicht bezahlen. Ehrlich gesagt sollte das eigentlich noch deutlich drunter sein. Also, ein Katzenklo. Guck mal hier, das ist auch ziemlich groß. Viel zu teuer alles. Sollte eigentlich free sein, exakt. 7,99 Euro, das ist einfach zu teuer. Electronic-Case. Ja, so Dinger hier. Aber ich will das billiger haben. Ich glaube, es geht los. Aliexpress, was ist mit euch los? Black-White. Ah, das eine hat einen transparenten Deckel und das andere nicht. Versand! Keck weh. Ich glaube, es geht los. Ja, das ist halt die typische Aliexpress-Geschichte. Alles klar, Aliexpress, alles klar. Sind die noch bei Trost? Ja, so was hier. Da kommen wir doch schon eher in die Richtung hier. Das ist 11cm x 6cm x 3cm. Das sind schon eher so eine Sache. Da würde ich dann mal ein paar holen. Was ist denn mit dem Shipping hier los? Was ist denn? What the fuck? Sag mal. Was ist denn mit Aliexpress gerade los? Cool, wir gucken bei der Konkurrenz. Wir gucken bei Banggood. Sieht aus wie aus dem 3D-Drucker. Ne. Ey ne, das ist nicht aus dem 3D-Drucker. Das ist aus irgendeiner Form. IP. Electronic Case. Wir gucken mal bei Banggood. Ja, so was ist doch schon mal besser. Guck mal, es gibt sogar verschiedene Größen. Banggood Express. EU-Priority Line. Ja, was? Only One Piece left? Keck. Es ist gerade Weihnachten, ne? Das ist jetzt schon wieder zu teuer. UK. Oi, ja. Sind das nicht Aufputzgehäuse? Kannste bestimmt für alles Mögliche verwenden, ja. Aber bei den Chinesen kann man sowas immer ganz gut abgreifen. Für günstig. Ohne Box hier. So eine Box hier. Das ist nice. Genau. Und jetzt Priority. EU-Priority Line. Genau. Da würde ich mir jetzt zum Beispiel einen 10er-Pack von bestellen. Das sieht 1 zu 1 so aus wie bei Amazon. Ja, fast. Das Ding gibt es aber auch bestimmt 1 zu 1 so bei Amazon zu kaufen. Guck mal, sieht fast aus wie meins. Da ist sogar so ein Abdichtsschlauch dabei. Guck mal. Null. Oder gleiche Kram. Ja, da würde ich mir jetzt zum Beispiel so einen 10er-Pack von kaufen. Wenn man viel macht, kann man sich noch 20 kaufen, muss man aber nicht übertreiben. Und dann bezahlst du am Ende, was hast du hier, 40 Dollar? 45 Dollar bezahlst du. 45 Dollar zu Euro sind 37 Euro. Du bezahlst 37 Euro für 10 Cases. Das ist okay. Moment, ich muss jetzt nicht wirklich... Ich wollte jetzt gerade 37 durch 10 rechnen. Aber egal. Also bezahlst du 3,7... Moment. Kann das sein? Ach so Euro. Ja doch. Also bezahlst du 3,7 Euro pro. Und nachdem das EU-Priority Line ist, bezahlst du noch nicht mal Zoll. Weil der Trick bei EU-Priority Line ist folgender. Entweder kommt das aus dem EU-Warenlager und Waren aus der EU werden ja eh nicht verzollt. Also zumindest nicht, wie es mit den Sachen aus China gemacht wird. Oder die verschicken das über Niederlande, Spanien, Italien oder so. Und dort packen sie es dann oder machen sie ein neues Etikett drauf und schicken es weiter. Das geht dann aus China nach Spanien und von Spanien zu dir. Dann bezahlst du auch kein Zoll. Doch es gibt ab 1.1. neue Zollrichtlinien. Aber das was ich gerade erzählt habe ist schon für die neuen Zollrichtlinien. Also es gibt zwei Varianten. Entweder die schicken das schon aus der EU los. Die ganzen China-Händler haben... Ich weiß nicht ob es für dieses Cade Sando sagt es gibt es im Baumarkt. Kann man sich auch mal... Also ob es sich jetzt in dem Baumarkt verlohnt, keine Ahnung. Aber nur mal generell was China Geschichten geht. Das gilt nur für Versand aus China nach Deutschland. Also sprich, wenn die das vom EU-Warenlager... Was ist das für Musik gerade, Alter? Ah, Poggers. Also sprich, wenn die das aus dem EU-Warenlager los schicken und was alle großen China-Shops ja mittlerweile haben. Die haben ja alle mittlerweile einen EU-Warenlager oder immer mehr Dinger. Und die großen Versandteile bei Aliexpress ja auch mittlerweile. Dann wenn die es aus dem EU-Warenlager los schicken ist gar kein Problem. Dann kommt es aus der EU und es kostet kein Zoll. Wenn die das aus China los schicken und ihr bestellt das mit Banggood Express oder mit Banggood Express, weiß ich nicht. Dann kann es sein, dass es beim Zoll landet, weil die das verschicken quasi von China übers Schiff nach Deutschland. Dann könnte es beim Zoll landen. Aber wenn EU-Priority Line macht, dann kann es auf jeden Fall nicht beim Zoll landen, weil EU-Priority Line geht, Aliexpress macht das über PostNL und über die Niederlande, wahrscheinlich kommt das Schiff irgendwie in Rotterdam an oder so. Die China-Händler schicken das dann an ein EU-Land, was nicht Deutschland ist und dort kriegt es dann ein neues Etikett oder sowas, keine Ahnung, dass es eine Sendung aus Spanien oder Italien ist, was übrigens legal ist, muss man dazu sagen. Und euch kann da eh schon mal nichts passieren, wenn schon ist der Hersteller dran, aber da kann euch eigentlich nichts passieren. Und dann schicken die das quasi aus einem EU-Land, so als Proxy quasi, nach Deutschland und dann müsst ihr keinen Zoll bezahlen. Dafür kostet es einen Euro mehr, aber scheiß drauf, dafür landet es nicht beim Zoll. Okay, exzellent, ich würde sagen, wir machen weiter, wir sind nicht so weit gekommen. Wir wollten das ganze flashen, also, runterladen, habe ich runtergeladen, LED, alles klar, Wiki, ESP-Tool, ich muss mal kurz gucken, ob man die, ja Flash, das da müssen wir machen, Erase Flash, ich lösche mal kurz meinen Micro-Controller, Erase Flash, so, also ich stöpsel mal kurz den hier dran, also ich hab jetzt den hier am Start, den stöpsel ich hier übrigens von Eats Delivery, den stöpsel ich jetzt mal an den Rechner und dann flashen wir das Teil, exzellent Flash-Action, yes, wenn ich das Kabel dran kriege, so, gut, Erase Flash, Ups, ich muss es erstmal in die VM mounten, da, connect, jaja, kann trotz hier제, so, dann kann ich mich ganz kurz erzielen, ich mache zu dem Stöpsel die Dek해서 links EU länder kommen ich meine dann müssten die da müsste der zoll ja auch also erstens müsste der zoll jeden lkw aus spanien kontrollieren wo es probleme gibt und ich bin mir auch gar nicht sicher ob das dann legitim ist keine ahnung wüsste jetzt nicht wie dass man am zoll landen soll sei denn die greifen dass ich in spanien irgendwie direkt ab oder so zumal ich auch denke das ist alles legal also es ist ja nicht so als macht man da irgendwelche illegalen dinger oder so wenn wenn ich in spanien verkacken der land ist beim zoll naja dafür bezahlt er dafür bezahlt er ja eu priority leihen dass die das extra über spanien schenken oder italien oder so das ist ja das ist ja nicht irgendeiner das ist ja eine stelle die das öfters macht ja aber letztendlich ist es immer so wenn es an irgendeiner stelle verkackt wird da landet es beim zoll aber ich muss euch ehrlich sagen aus china ist bisher noch nichts bei mir beim zoll gelandet aus den usa bisher immer die können das einfach nicht ok also wir flaschen jetzt download wled 11 wird jetzt geflasht die ditze ditze ditze ditze ditze ditze ditze ditze ditze ditze ditze ditze ditze so wenn das geflasht ist muss ich gucken ob das teil sich als access point meldet moin mr sultanois ich gucke jetzt mal auf am tablet ob sich das teil meldet als access point da muss ich nämlich mal kurz mein wlan passwort eingeben und das mache ich nicht im stream weil es geht euch nichts an wie led jawoll schade aber chat aber chat so also moment ich muss erst mal gucken was wie led wie led password für den für den access point wie led led eins zwei drei vier connect obtaining ip signing in jawoll alles klar so jetzt stelle ich mal kurz mein wlan an wlan ein wifi settings wifi settings your network der zwischenzeit zeige ich euch eine runde fischpilzschirmschoner der kommt immer so gut an so passwort muss ich noch eingeben ein passwort mit keqw drinne eine passwörter setzen sich ja eben mittlerweile aus irgendeiner kombination von 25 stelligen twitch emotes zusammen save and connect ok mal schauen was das ding für eine ip bekommt kommen wir mal im router gucken da sind wir zack sehr schön alles klar set up hat funktioniert liegt 6 69 keine nee meine passwörter sind ein bisschen komplizierter leute das können wir vergessen das können wir knicken also ich habe eher so was in der richtung von keine ahnung keq wie kappa hd kp o poc like this 69 420 kogas ppega so ich habe echt lange passwörter die erräts du auch nicht gut also also wir haben hier den controller der controller funktioniert jetzt können wir die controller in den in die box einbauen also merken wir uns mal 60 112 60 112 unknackbar ja genau hey unknackbar ist nix aber es dauert lange außerdem habt ihr jetzt meine ip jetzt könnte jetzt könnte e hacker mann machen leute weil wir wissen ja wenn man seine ip geliegt hat ist man geliefert ja plus minus ein paar lichtjahre ich muss jetzt klugscheißen lichtjahre ist eine entfernung und keine zeit wobei ich ganz ehrlich ich sag das auch gerne aus dem markt keiner klugscheißer ich sag das auch gerne das hat sich das wusste ich bloß jetzt zwar das wusste ich jetzt bloß mal kurz kurz los werden ok zack controller am start so jetzt muss ich mal kurz gucken hier ist er frisch geflashter gude jetzt muss ich mal kurz pin layout gucken pin layout vom esp 23 vorm vorm note mcu nicht note mcu was er die 1 mini pin pin out wählen ist ein geiles prägen ja gut in dem fall muss ich ehrlich sagen juckt mich das nicht es funktioniert so gut ich habe nicht einmal in den source code reingeguckt doch bestimmt ich habe einmal in den source code reingeguckt ich habe versucht das habe ich versucht genau warum es auf dem tiny picker nicht richtig lief und da wollte ich den pin den pin den pin ändern bis ich dann drauf gekommen bin das funktioniert doch wenn ich den flash vorher gelöscht hätte also wir haben d2 da muss dann später die led leiste dran das weiß ich schon und dann haben wir noch 5 volt und ground ja gut da machen wir das doch mal 5 volt ground und dann data das heißt dann schließen wir doch jetzt mal an das macht dann machen wir das doch jetzt mal wir schließen den jetzt an die box an und machen mal das netzteil dran und gucken ob der controller startet das können wir doch jetzt mal ausprobieren was ist wled wled ist eine firmwär das was du hier siehst ist eine firmwär für microcontroller und die hat unter anderem halt einen web interface dabei wo du dann deine led strips mit steuern kannst also ist eine firmwär für für kleine controller für solche dinger hier so was da zum beispiel gibt jede menge davon und die bringt unter anderem web interface mit und da drüber kannst du dann deine led steuern wir gucken uns gleich die neue version noch an also du kannst dann effekte machen du kannst helligkeit einstellen farbe einstellen und alles aber ich würde vorschlagen guck einfach weiter zu weil wir gucken uns das gleich an so also weiter gehts im text hier so also ich wollte jetzt folgendes machen ich wollte jetzt den achso ja ne das funktioniert ja so nicht braucht man led strip wo ist mein led strip hier ah kommste her kommste her led strip da ist der led strip ich muss den led strip mal irgendwie so hinlegen dass der jetzt nicht hier so zieht led strip komm her kommste vorgas ich stelle einfach mal meine lötstation auf den led strip drauf dann kann er nicht mehr rutschen habe ich habe ich umgeschaltet ja ok also weil die sache ist die ich habe der aktuellen not mc usb 32 dran der ist einfach zu fett hierfür so deswegen machen wir das ab und stöpseln das mal an also wir haben plus also sprich 5 volt wir brauchen strom also es ist so was man was man bei diesen dingern wissen muss die pins haben je nachdem wie man den verwendet ein bisschen unterschiedliche funktionen und zwar dieser 5 volt pin hier ich bin nicht ganz sicher ob es beim demont mini so ist aber bei den not mcu ist es so ich glaube beim demont mini ist es auch so also der 5 volt pin hier unten da der da also der da hier oben 5 volt pin wenn man das ding über usb betreibt dann ist das 5 volt out wenn man das ding nicht über usb betreibt dann ist es 5 volt im also sprich ich versorge jetzt nicht etwa den led strip über den controller ich versorge den controller über den led strip so ok also 5 volt dann müssen wir hier gucken dass hier das graue ist ground gucken wo ist ground und ist da direkt daneben jemand 5 volt pin ground excellent sondern haben wir das weiße das weiße ist data für den usb für den für den led strip und data muss auf d2 warum muss es auf d2 hat keinen tieferen grund es muss auf d2 weil der typ das so programmiert hat dass es auf d2 muss hat keinen sinn also es ist halt so programmiert dass es auf d2 muss die pinnummerierung ist e fail d2 ist eigentlich die arduino nummerierung bei den esp 32 und bei den esp 266 heißen Dinge eigentlich gpio 1 2 3 4 5 6 7 8 9 10 bis 65 oder so sind das max eine echten hände ne ne das ist 3d model so ok jetzt haben wir das hier dran sondern stöpsel ich stöpsel das mal dran wie wir das jetzt gleich verwenden ok also der kontrol also ohne ohne einzubauen so der controller ist dran ich muss noch mal gucken dass ich richtig habe also 5 volt ground das hier ist 5 volt jetzt muss ich noch mal kurz gucken ob das hier passt also sprich da ist ach du scheiße das erkennt auch keiner das ist 5 volt ok passt gut also das habe ich richtig angeschlossen nicht dass ich jetzt monka monka smoke kaputt mache so und das hier ist dann was ist wo was also das ist jetzt die 2 die hier an strom dran kommt das hier ist 5 volt und das hier ist ok das hier ist ground also sprich das da der hier der muss dann hier rein gucken ob ich das jetzt hätte ich vielleicht vorher mal aufmachen soll ah gut ich kann es eigentlich kann es auch raus machen kiste kommst du her auf zack also was habe ich jetzt gesagt ist ground und verwirrt was ist eigentlich für bible samt musik die da läuft im hintergrund ground der da jetzt gucken dass es auch echt richtig anschließt das ist ground alles klar das mal kurz hier rein passt dran würde ich sagen so und dann haben wir den noch mal kurz raus machen den hier dran das muss ja dann plus 5 volt sein hier plus 5 ja ubs trotzdem richtig drin alter komm her ich muss gucken ob ich richtig reinmach so wunderbar passt ok wir schalten jetzt an wir schalten jetzt an und gucken ob es funktioniert jetzt bin ich ja mal gespannt also wir sehen ihr seht ihr ein paar leds ihr seht ihr ein paar leds ich habe jetzt alles angeschlossen so wieder späterein ubs habe ich das aufgemacht irgendwie aus versehen gerade ok ich habe nichts gesagt ist rausgegangen ja ich habe es vor eben aus versehen aufgemacht glaube ich ok also alles angeschlossen plus minus ich hoffe ich smoke nicht monka smoked gut schließe mal das netzteil dann gucken ob es ding angeht wo habe ich das netzteil das ding ist außerhalb der kamera was ist außerhalb ich so alles da alles da nee nee weiß das gar nicht glaubt dass die checkt das nicht das ist glaube ich zu zu zu 2020 da nee nee ok also ich mache mal hier netzteil dran netzteil wohlgemerkt netzteil ist auf 5 volt eingestellt und jetzt gucken wir mal ob es geht ok wenn man nicht sicher ob da überhaupt saft auf der steckdose ist stöpsel ich jetzt mal kurz lötstation an die steckdose ist gar nicht an keck weh die steckdose ist gar nicht an wo ich reingesteckt habe na super das ist natürlich big brain ok alles klar so jetzt aber jetzt aber jetzt jetzt sollte es funktionieren haben wir es richtig angesteckt ok das ding blinkt das ding blinkt das schon mal gut aber die leds gehen nicht an ok gucken wir mal ok aber das wir sollten zumindest aufs web interface kommen jetzt also web interface geht ist der data pin nicht am richtigen dran moment moment ich glaube ich habe es am falschen pin dran wo an welchen pin muss ich es denn machen ich habe es bestimmt am falschen pin pin ah d3 nee moment d4 an d4 muss es ok esp 32 muss an d4 esp 32 muss an d2 ist am falschen pin dran das ist am falschen pin leute gut zack raus pin wir brauchen den weißen ok das ist d2 ich muss an d4 das ist natürlich auch nice jetzt weiß ich auch warum das auf d4 gemacht hat guckt mal leute der hat das auf d4 gemacht dass du es direkt nebeneinander stöpseln kannst ja bei dem esp 32 muss es auch an d2 aber beim esp 36 muss an d4 so postchamp leute leute bevor ich das anstecke bevor ich das dran stecke wir brauchen mindestens 20 postchamps im chat sonst geht es nicht mindestens mindestens 20 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 alles geht es aber 16 17 18 19 20 ok also wir haben gepostchamped achtung ha und da ist an bäm aber die farben sind falsch oh mist ihr seht nix moment moment ich re-create das noch mal ich re-create das noch mal für euch so so achtung und jetzt bämm was da aber auffällt ist was da aber auffällt ist die farben sind falsch die farben sind vertauscht und das liegt glaube ich da dran dass die dinger standardmäßig auf ich habe 49 leds dass die dinger standardmäßig auf über den limiter machen wir auch raus schaumverbrauche hier dass die dinger standardmäßig auf grb stehen und nicht auf rgb wenn man es auf rgb stellt dann geht es glaube ich besser ja nice so guckt mal hat der kleine controller ein wifi modul ja das ist der einzige grund warum ich die dinger verwende weil die on board wifi haben und der esp 32 übrigens noch besser der hat sogar noch bluetooth dabei low energy bluetooth massig tpr opens und 2 cp 2 dual course also nein also 2 cpu course also der esp 32 nicht der da der da das ist ein esp 2866 hat ein kern paar cpi opens und aber wifi kannst du das auch übers handy steuern klar du kannst die webseite ohne problem auf dem handy aufmachen ich werde es in meine heim automatisierung einbinden aber ja du kannst die seite auf dem handy aufmachen und direkt so verwenden wie sie ist also ich kann es euch übrigens mal zeigen dass das funktioniert also 60 12 2 ich war es mal kurz auf dem tablet auf achtung gibt auch eine app braucht man nicht auch mal nicht und 2 168 punkt was war es jetzt punkt 60 punkt 1 2 2 tatsächlich bm was für ein geld wer verwendest du ich benutzt home assistant mit unterschiedlichsten sachen dran so guckt man sieht das jetzt also hier kannst du dann rumstellen wieder wieder lustig bist also kannst jetzt die farbe ändern auch selber blau oder hier wir bleiben aber diesem komischen orange du kannst die helligkeit machen zu zählen wir gucken uns auch gleich mal den stromverbrauch an machen wir jetzt gleich mal machen wir gleich mal hier nebenbei gucken wir uns mal die stromverbrauch an gucken wir mal da muss man gucken dass ich das hier vielleicht ein bisschen ins bild krieg wach mal den hier aus so ok mal gucken da habe ich das jetzt ins bild geschoben bekomme inwieweit sieht man das jetzt wartet mal ich muss mal kurz gucken dass man das hier sieht das funktioniert nicht da wackelt die kurz hier den iphone rausziehen hoffentlich bleibt da bleibt der stream dann an also sieht man jetzt was also aktuell aktuell brauche 4 watt der ganze strip leuchtet so jetzt machen wir mal also ich zeige euch den ganzen strip dann wenn was eingebaut haben so jetzt haben wir hier das tablet ich spiegel mich wahrscheinlich jetzt wieder irgendwo aber ok so zwar mal laut immer mal helligkeit rauf helligkeit man sieht er braucht schon ein bisschen mehr und am meisten braucht natürlich wenn man auf weiß schaltet so und da brauchen wir 15 watt 15 watt habe ich wieder geliegt ja kann schon sein 15 15 watt braucht er jetzt komplett weiß alles wenn man alles auf weiß hat aber die kabel werden jetzt nicht warm ich meine die sind auch relativ dick also das passt alles und ihr seht wenn man es dann wenn man es auf geld macht ist das ganze schon deutlich deutlich weniger liegt aber auch einfach daran weil weiß in dem fall bedeutet alle leds die da drin sind volle pulle weil weiß der hat bloß drei leds der hat rot-grün-blau und der mischt weiß da draus es gibt led strips die haben auch zuletzt nicht weiß das ist ein rgbw die brauchen tatsächlich bei weiß nicht so viel ne ne also das ding steht auf dem kopp es sind 7,7,4 watt gerade so und wir gucken uns den kram gleich an was man alles machen kann wir bauen jetzt erst mal das wieder in die box ein mein lieblings effekt bei the way ist candle multi das blinkt dann einfach nur so ein bisschen aber jede led für sich finde ich eigentlich ganz angenehm guckst du immer bei 5,8 watt also kein kein ding gut dann machen wir das tablet wieder weg und stellen wir die steckdose wieder in die eck aber erstmal wieder ab das lege ich mal da unten hin so dann muss man iphone wieder anschließen jetzt leer das wollen wir ja nicht ok sehr gut also da haben wir das schließen wir hier gerade mal wieder an dass ich gleich strom habe alles klar so und jetzt bauen wir den kram mal in die box ein und da gucken wir uns den led strip und die effekte und die neue version mal an was das alles ist ok habe ich euch aufs kamerabild geschaltet jawoll also ob du ein iphone hast ja habe ich ich habe ganz viele unterschiedliche sachen ich habe massig entfacht geräte massig ios geräte ich mache da kein unterschied also ich nehme das was ich für die sache jemals am besten gucken wir wie gut eigentlich der anschluss hier auch funktioniert sehr sehr richtig nice ich pock also dann gucken wir jetzt mal wie wir das hier machen mit der mit dem controller wie wir das hier gescheit reinkriegen also wo ich mir noch nicht sicher bin und was ich jetzt auch nicht machen werde ist eigentlich muss ich noch ein zweites loch ins gehäuse machen damit ich den led strip raus bekomme werde ich aber nicht machen weil es kann durchaus sein je nachdem wie die wie das mit der helligkeit ist und wie ich die am weihnachtsbaum verteile kann das durchaus sein dass sich die das andere ende vom led strip hier auch noch anschließen will deswegen werde ich das jetzt nicht machen weil je nachdem ob ich das machen will oder nicht brauche ich dann unterschiedlich großes loch oder irgendwas also so 100 prozentig fertig werde ich es nicht machen ich werde jetzt einfach mal das hier neben dann rausgucken lassen aber den rest bauen wir jetzt erst mal ordentlich ein ich muss das template wieder hinlegen dass ich was sehe vom chat jetzt bin ich ja quasi blind und ich darf auf twitch nicht mehr sagen blind ist nicht inclusive blind playthrough ist weg so also jetzt kommen wir aber immer das ganze ja gescheit einbauen zeig mal her also ich bin jetzt gerade ein bisschen verwirrt wir haben gesagt wir haben gesagt wir machen die ok also die klemmen wollte ich hierhin machen habe ich gesagt die klemmen machen wir dahin genau da oder wollte ich auf die anderen seite machen ne ne ne ne wollte ich nicht das den controller wollte ich dann dahin machen na warum passt das jetzt nicht mehr eben ging es doch noch jetzt sehr gut die klemmen sind hier dran und den controller wollte ich hier auf die andere seite machen quasi irgendwie so ich muss sagen das passt wirklich gut bin da ich bin da echt begeistert passen mal guck mal sogar die sogar die die kabels hier passen vom controller ist eigentlich recht nice dann rollen dann rollen wir das mal irgendwie da in die eck irgendwie hier so hin nein bleibst du zu wollen wir das hier mal irgendwie in die ecke dass da platz ist so gut und es ist drin passt so jetzt müsste ich normalerweise noch irgendwie in den zweiten zweites müsste ich wahrscheinlich auf der seite noch ein zweites loch rein machen und da kann ich es weiter sind fünf volt was soll da großartig passieren und meiner ganz davon abgesehen an sich ist das gar nicht mal so schlecht gemacht finde ich so eigentlich muss ich auf die seite noch ein loch machen und dann die led sachen rausfüllen wie gesagt das lasse ich jetzt erst mal bleiben gucke jetzt erst mal man sieht ja das kabel hat auch schon ein bisschen minimal minimal gelitten deswegen kann das kabel ruhig noch mal kurz weiter leiden aber das hier mal rein jetzt gucke ich mal wie man das hier am besten raus kriegt ist das mario kart das ist die die gewinnt das ist die win musik aus mario kater nee ist es nicht hätte dieses alter das ist das kabel gedöns piste ich gehe weg ist sie rein ich will das ich will das an der gleichen stelle machen wo ich schon mal durchs gehäuse gefuddelt habe exzellent so wunderbar und dieser kram kann darf auch hier so so exzellent so das bleibt nicht so aber ich weiß noch nicht ob ich im baum beide kabel oder ein kabel durchmachen will deswegen muss das jetzt mal leiden kurz der kann noch ein bisschen darum und der kann auch ein bisschen darum und deckel drauf ach nee moment so rups jetzt habe ich es fertig exzellent so das mache ich jetzt nicht richtig zu weil die kabel sind schon ein bisschen lidiert aber ich will noch kein zweites loch rein machen weil ich noch nicht weiß ob ich beide kabel durchmachen will oder nicht kannst du mit dem namen die leds würde ich nicht kaufen das ist ein ws 2811 strip aber den würde ich nicht mehr kaufen ich würde mir den nachfolger kaufen oder noch besser ist eigentlich wenn du den rgbw strip kauf mit rgb leds also mit der roten grünen roten blauen grünen led plus weiß aber das ist ein ws 2811 gut so das muss jetzt erstmal so bleiben bis ich weiß ob ich beide kabel durchmachen will oder nur ein kabel so und jetzt gucken wir uns mal an ob das ganze funktioniert wo man das netzteil netzteil dies achtung kommt ob ich richtig angeschlossen ab alles beim das ist nicht schick funktioniert sehr gut sehr gut exzellent und nu kann ich den kram auch mal wegmachen taugt das i fix den werkzeug naja also vieles was dabei ist ist müll ich habe beispielsweise diese komische spachtel die dabei ist alle schon verbogen das ding hier ist jetzt auch netz der absolute wahnsinn ehrlich gesagt aber und der grund warum ich es mir gekauft habe ist folgender weil dort so viele selten oder oder sagen wir mal so so viele special bits dabei sind das hier jetzt nicht den ganz normaler kreuzschlitz bit aber das der grund warum ich mir gekauft habe und für so kleine elektrosachen muss ich euch sagen ist es eigentlich ganz ist es eigentlich ganz nice kogas kann der mann hier guckt mal kogas man kann also wenn man wenn man das braucht diese kleinen bits dann ist das definitiv nice mir persönlich gefällt das wäre elektriker set deutlich besser kostet aber auch mehr allerdings dass man wäre elektriker set halt keine special bits dabei das ist halt die sache aber und das gute ist das ist auch der grund warum ich mir das fixet gekauft habe ich kann ich zeige euch das andere gleich mal du kannst mit adapter auch mit den anderen verwenden und dann ist wieder nice ja so aber hier aus chat was sagt er mal ganz davon abgesehen dass das hier natürlich müll ist da muss da muss noch ein zweites loch rein das kann ich jetzt aber noch nicht machen ist doch ein ganz gut geworden guck mal wir haben hier sogar wir haben sogar so und so nippel für das ding zack funktioniert ziemlich gut so dann machen wir mal kurz hier den ganzen kram aus dem bild und ein stöpsel stöpsel das lütze nicht in die steckdose das wäre ein bisschen blöd hier weg und nun machen wir mal die leds hier hoch auch nicht aber weg alles hier alles hier mal kurz weg so und jetzt mal die leds hier rauf weil man sieht dass ich schon ein bisschen was das sind ich weiß nicht wie viele meter das sind es sind nur 50 stück aber für ein weihnachtsbaum ist halt wirklich cool die sache ist nur die ich kann euch die effekte nicht zeigen gescheit wenn man das hier so aufeinander liegen hat deswegen müssen wir mal gucken dass wir das ein bisschen anders machen und zwar man kann ja den led strip künstlich verkürzen in der software also dass wir uns mal ein paar effekte angucken können so also mal kurz auf der kamera gucken ob man alles sieht jetzt ja zack zack und so ok das passt eigentlich ganz gut und jetzt machen wir mal folgendes jetzt gucken wir uns ein paar effekte an ich habe jetzt hier nur wie viel sind das 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 sieht man die eigentlich alle hier die unten sieht man gar nicht so hier genau gut also haben wir hier 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 16 16 leds haben wir und jetzt stellen wir mal in der software um also es geht jetzt von da nach da jetzt stellen wir mal in der software um dass der nur 16 stück verwendet kann man nämlich in die config sagt wir haben bloß 16 stück safe weg jetzt restarten wir mal weil das manchmal rumspackt und da können wir ein bisschen effekte angucken zusammen dazu mache ich mal licht aus strom raus strom rein ah ne wir haben doch noch ein bisschen mehr also können wir noch zwei stück zwei stück kann man auch dabei machen konfig hallo konfig ob es konfig led preferences 18 tag so als leuchten 18 stück jetzt können wir uns ein bisschen effekte angucken benutzt doch einfach segments ja wozu ja hast recht könnte man machen so also jetzt machen wir mal licht aus machen kurz licht aus weil ich kann es einfach von meiner heim automatisierung machen warum sollte ich das no brain dass ich aufstehen muss dafür arbeitszimmer licht aus zack licht ist aus und jetzt muss ich noch das licht am lötkolben ausschalten hier das ding extra beleuchtung dass man das schön sieht alles so gut alles da was kann man so ein paar effekte angucken also man sieht die iphone kamera ist vielleicht nicht unbedingt die beste dass jetzt als ja doch es ist gelb man erkennt das eigentlich ganz gut kann eigentlich ganz gut dass das gelb ist ok also chat ich hoffe man siehts hier fast fast postchamp postchamp muss den wir das tablet noch reinschieben dass man es noch sieht ok wunderbar also wunderbar da sind wir ich glaube man sieht soweit man irgendwie was sehen kann man sieht das color wheel brauche ich mir brauche schon ein bisschen mehr wisst ihr was wir können das ja einfach über das tablet drüber legen das stört ja nicht macht ja nichts wenn das überm tablet drüber liegt doch man sieht es nicht lull na gut also wir machen das anders ich lasse es so wir stellen es ein dann halte ich rein dann mache ich wieder raus also mein lieblingseffekt wie gesagt wir machen erst mal brightness volle pulle wird es bisschen heller kann sein dass man auf der kamera nicht so gut sieht so und jetzt können wir zum beispiel sagen effects haben wir gelb wir können einmal weiß machen ist jetzt ein bisschen bläulich vor allem auch weil der untergrund blau ist und haben wir gelb effekte so als haben wir zig dinger hier android kann machen flub flub flub flub flub flub flub er läuft halt einmal im kreis geht man jetzt auch ganz gut dass im kreis läuft und es läuft im kreis weil ich habe nur 16 16 leds eingestellt das heißt das trip ist zwar selbst viel länger aber die logik läuft auf nur 16 also man kann einstellen wie viel man will so dann gibt es noch andere effekte ganz blinken lassen ist bisschen langweilig ehrlich gesagt so dann kann man die kappa pride ach so kappa pride blink kann man machen das sei das sei ja auch ganz cool das geht dann quasi hin und zurück dann gibt es hierfür epileptische anfälle das muss man sagen das sieht bei mir auf dem anderen led strip deutlich besser aus weil da hat er hat mehr leds also es funktioniert nicht alle alle effekte auf allen led strips gleich gut weil mein anderer led strip da glaube ich 66 leds pro meter der hier ist natürlich viel weniger und da sieht man den effekt gar nicht in wirklichkeit läuft jetzt hier langsam so ein regenbogen ding durch so candle also multikandel ist eigentlich mein lieblings effekt man sieht hier jede einzelne led flackert so ein bisschen wie eine kerze finde ich eigentlich ganz ganz nice so dann machen wir mal chase das ist so ein ganz ehrlich ihr müsst mir eigentlich nicht dabei zugucken ich mache bloß die effekte ich klick die effekte jetzt einfach mal durch und ihr könnt zugucken so chase dann haben wir das ist ehrlich gesagt alles ziemlich langweilig da haben wir noch sowas hier das ist wildes geblinke auf der led kelte die zirkus variante colorful loop muss man halt ein bisschen gucken was ich auch noch gut finde ist fire wow das ist aber 16 leds ziemlich im arsch das funktioniert nicht richtig das sind zu wenig leds normalerweise läuft das langsam von hier nach hier ich mache es mal ein bisschen langsamer ändert sich nix das funktioniert mit wenigen leds nicht mit meinem anderen led strip sieht das richtig cool aus fire flicker das ist so ein bisschen wie multikandel ist auch ganz nett am weihnachtsbaum also ich habe bei dem anderen habe ich diesen fire effekt drin und das sieht mit 66 leds pro meter ziemlich nice aus fireworks ist auch cool funktioniert jetzt halt auf dem mit diesen wenigen leds nicht wirklich normalerweise normalerweise macht er jetzt das hier guckt mal normalerweise macht er das hier das hier würde er jetzt machen wenn man halt mehr leds hätte was echt nice ist was halt mit 16 leds einfach ein bisschen wenig ist wie gesagt insgesamt hat das trip 50 ist glaube ich was weiß ich drei meter oder so für den baum reicht das ja noch mehr fireworks muss man halt gucken was funktioniert muss man halt gucken was funktioniert mit den restlichen leds die bleiben gerade aus ja ich habe sie nur auf 16 leds eingestellt aber jetzt für ein stream ja kannst du kannst damit schon ganz coole sachen machen ich meine der effekt sieht so das ist jetzt lighthouse der sieht jetzt hier eigentlich ziemlich nice aus der sieht an meinem großen led strip kacke aus der macht quasi einmal koggers im kreis jetzt lightning oder es das ist der macht blitze nach das ist wirklich epilepsie warnung aber loading meri christmas ja das ist eher kakona christmas meteor sieht auf meinem großen strip kacke aus hier geht's eigentlich das lightning sinken mit echtem gewitter der witz ist ja dass das tatsächlich geht ne übrigens chat chat anzeige ist raus polizei steht vor der tür anzeige ist raus oh die musik ist aus hier los aber schnell jetzt popcorn popcorn sieht auf meinem großen strip am fenster auch cool aus sieht ja auch kacke aus kappa pride 2015 warum immer das pride ist auch als regenbogen macht jetzt verstehe ich das regenbogen macht rainbow haben wir auch noch der regenbogen effekt sieht bei dem stick bei dem strip richtig cool aus da sieht auf dem auf dem größeren led strip am fenster zum beispiel kacke aus hier ist der echt cool also wir können uns jetzt nicht alles angucken weil das hat 30 milliarde effekte so und was man dann auch noch machen kann ist folgendes ich schalte mal wieder auf sollet was man hier halt auch noch machen kann oder schalten wahrscheinlich auf candle multi was mir auch noch machen kann man kann ich zeige euch das mal man kann ich habe hier übrigens noch licht an oben fällt mir auf bei der kamera vielleicht soll ich das licht vom vom von der iphone kamera mal aus machen aber das macht nicht wirklich viel aus was ich jetzt an muss muss ich umtisch rumlaufen sonst also was man auch noch machen kann ist also das waren jetzt die ganzen effekte die ich hier gerade also ihr seht das hat wirklich massig effekte ihr könnt noch einstellen wie gesagt helligkeit oben effekt speed effekt intensity und man kann hier unten noch color palette auswählen hat man so sachen wie beispielsweise kann auch ein beach ne beach aber es gibt auch fire dann macht er quasi schon so einen eigenen farb verlaufen das ist auch ganz nice was haben wir hier aurora irgendwie auf nordlicht wer gerne nordlichter haben will aber keine nicht in norwegen ist also man kann wirklich saumäßig vieles zeug machen und man kann einfach hier oben selbst die farben auswählen hier unten ist temperatur und das ist helligkeit hier oben ist auch noch mal helligkeit das im prinzip doppelt aber ich habe ehrlich gesagt meins zum größten teil so eingestellt dass ich mal kurz weiß dass ich irgendwie ungefähr hier so auf gelb oder fack ungefähr hier so auf gelb bin in dem dreh ja so dann habe ich multikernel also genauso wie es jetzt hier ist so habe ich ungefähr dann auch am baum welche platine ein d1 mini so und was auch cool ist man kann auch segments einstellen damit kann man zum beispiel den stick in unterschiedliche abschnitte unterteilen was ganz praktisch ist wenn man beispielsweise die ersten zehn leds auslassen will oder sowas so und mal genau man hat jetzt hier seine seine seine traumeinstellung gemacht geht man hier favorites create preset das jetzt neu und kann den kram speichern und dann ist auch ganz wichtig dann geht man in led preferences stellt noch ein dass man dieses preset automatisch starten will wenn man also jetzt startet dieses preset immer automatisch und ich stelle auch die helligkeit immer komplett auf anschlag und gut ist dann speichern wir das ganze und jetzt zeige ich euch mal was passiert wenn man neu startet dann macht er nämlich die ganzen settings wieder wieder rein achtung netzteil raus netzteil rein und ihr seht zack wieder gleichen settings wie vorher ach ja und wie gesagt ich habe nur 16 leds eingestellt die anderen sind dunkel so sieht es aus chat poggers oder also wenn das mal nicht advanced christmas tree ist dann weiß ich auch nicht dann machen wir der licht an und auch wieder licht hier im zimmer jetzt haben wir der licht an wunderbar ja exzellent so sieht es aus mehr als poggers das ist schon koggers ja finde ich auch welchen durchmesser empfiehlst du für über also welchen durchmesser empfiehlst du für überbrückung was überbrückungskabel so 20 zentimeter zwischen ein meter keine ahnung habe ich keine erfahrung mit weiß ich nicht keine ahnung welchen controller verwendest du adem in oder sp sp 266 und um genau zu sein den hier wir haben vorher in der kiste gekramt und haben noch einen gefunden und das schöne ist dass der genau in die box passt guck der passt genau in die box mit allem was man so braucht rein inklusive richtig schau ich das mal an fast schon professionell im anschluss hier das da bleibt übrigens nicht so ja das ist auch nice geworden jetzt ist das sogar wasserdicht ich werde sich unter wasser und das wasser stellen ja man hat sogar man hat sogar den deckel ist das nicht nice so chat da haben wir es würde ich sagen haben wir es geschafft zwei stunden war doch relativ produktiv heute ip 99 ne ip 68 ist das ding ich habe auch noch nicht also eine sache muss man auch machen uns wirklich wasserdicht zu machen bei der box ist so eine so eine dichtungs so dichtungs ding dabei das muss man dann noch in deckel rein machen aber ich muss das ding ja eh noch mal richtig zumachen das ist ja hier gar nicht richtig zuguck den noch auf und ich habe das noch nicht richtig zugemacht weil ich noch nicht genau weiß ob ich das so lasse mit dem kabel oder ob ich das kabel einmal im kreis lege und die anders andere ende auch hier reinmacht ach ja ich wollte euch noch das wäre elektriker set zeigen das machen noch schnell und eigentlich bin ich von wäre gesponsert aber ich müsste eigentlich mittlerweile schon gesponsert werden ich hole es mal schnell also wenn man ein bisschen kohle locker hat ich finde es deutlich angenehm es kann man mit dem iphone set gar nicht vergleichen ja aber nur weil eben die frage kam von der bedienung her und von der von der haptik finde ich deutlich angenehmer als das iphone set das iphone set habe ich mir nur gekauft weil so viele bits dabei sind so aber ich ich hole es mal kurz kann eine link zum controller posten suche einfach wemus d1 mini und dank also ja ich zeige dir bei amazon ich zeige dir bei amazon aber wenn du es nicht schnell brauchst dann würde ich nicht bei amazon bestellen aber es kostet guck mal hier kannst du auch bei amazon bestellen drei stück für 12 euro nein ich habe kein sp 32 sp 26 den ich habe die gibt es auch als sp 32 aber ich habe den sp 26 hat den vorteil ist billiger und reicht für led streuung voll und ganz aus also gibt es eigentlich keine vorteile den anderen zu nehmen den da und du kannst 12 euro 12 euro drei stück ist vollkommen in ordnung kann man machen und ich ganz eher ich kann dir auch nur empfehlen nehmen wirklich das dreier pack oder vielleicht sogar das fünfer pack weil ich würde wahrscheinlich das fünfer pack nehmen erstens wenn man einmal damit angefangen hat zu basteln hört man immer auf und zweitens man macht auch schon ab und zu mal was kaputt und wenn man fünf stück hat ich mache 16 euro man schenkt oder also schadet auf jeden fall nicht ich war vorhin auch froh dass ich noch welche habe so ich war mal kurz die leds weg die man mal raus also wenn wir jetzt mal bei dem thema sind was solche solche werkzeug setz hier angeht also dieses fixe ding das haben wir relativ viele und das ist ok aber ich muss halt ehrlich sagen das einzige wofür sich das lohnt sind die ganzen bits die man zum reparieren braucht für den rest ist das eigentlich total unsinnig also dieses zeugs hier ist wirklich billig billig krepp guckt euch guckt euch das mal an ok ich habe es wieder gerade gebogen die habe ich das letzte mal komplett verbogen also das ist wirklich billiger schiena krepp da also deswegen deswegen mit schinkram nicht kaufen ja ihr habt noch so ein e wie heißt das so ein armband und elektrostatik armband also braucht ja ja offiziell wenn du die leute fragst natürlich ziehen sie sich das immer an aber ich weiß nicht wie es bei euch aussieht ich ziehe es doch schon relativ selten an es die armbänder so welche habe ich hier gut bei so welche habe ich hier so welche habe ich da genau die du geschickt hast so also dafür muss man sich den kram nicht holen das einzige was man wofür man sich dieses effekte ding holen kann ist das hier und zwar die die sammlung an bits und zwar nicht für die meist die meisten bits also hier diese normaler kreuzschnitt bitt braucht keiner hier fehlt einer habe ich irgendwo irgendwo hier rumliegen aber auch ein normaler oh nee wo ist mein bitt hin das ist so ein dreieckiger bitt den brauche ich immer wieder wo habe ich den hingeschmissen nein f den brauche ich den muss ich unbedingt wieder finden der da fehlt ist einer der wichtigsten bits überhaupt ist und dreieckiger nee nicht im schraubendreher schraubendreher ist der kreuzschnitt bitt oder die guck hier hier der kreuzschnitt bitt ist der hier der hat die bei drin der hier unten wo habe ich den monka bitt wo ist er ist er hier irgendwo scheiße ich hoffe ich habe es nicht verloren f f in den chat für den bitt fuck das wirklich doof zwar eigentlich eines der wichtigsten bits überhaupt da drin ich suche hier gerade habe ich den irgendwo am schreibtisch liegen oder so ok muss ich später mal gucken also das wäre nicht das wäre das i fix jetzt lohnt sich halt wenn man so sachen braucht wie zum beispiel so was da das hat ja normalerweise keiner oder eben hier so was so was dreieckiges damit machen die chinesen ganz gerne mal die steckdosen zu dass man sie nicht aufbekommt ist halt auch praktisch hat man normalerweise nicht woanders jetzt hier oder irgendwelche so dinger da hat man sonst auch nicht dafür ist das i fixet ganz praktisch ansonsten sind die dinger jetzt nicht so extrem dolle quali ja auch das ding hier ehrlich gesagt nicht das ist ganz nice aber preisleistung ist wirklich ok aber mein favorit ist es ehrlich gesagt nicht was ganz nützlich ist ist adapter dabei dass man dass man die bits von hier zum beispiel diesen komischen bit in anderen sachen verwenden kann man sieht schon es passt schon teilweise gar nicht richtig und so aber da ist eine feder drin ja also dafür ist es gut für solche seltenen rare bits ist auch was für simkarten austausch drinnen so ganz praktisch aber wie gesagt mein favorit ist es nicht für so normales zeugs wenn man so ein bisschen bastel kram macht was ich echt gutes set finde ist und nein ich bin nicht gesponsert aber die sollten mir langsam mal geld geben für was ich echt gutes set finde ist das vera elektriker set was ich ganz gut finde aber muss sagen da liegen jetzt auch wirklich da liegen wirklich massig massig preis dazwischen ja also wahrscheinlich 50 euro mindestens wenn ich noch mehr müssen wir gleich mal gucken auf amazon also muss man sagen für preisleistungsmäßig ist das i fixet ding gar nicht gar nicht schlecht ja so also so jetzt gucken wir uns das vera ding an das erste was uns schon mal auffällt ist eine richtig nice tasche richtig nice tasche sieht man auch gleich vorne was drinne ist ehrlich gesagt sehe ich nicht was drin ist eine spülmaschine ist angeblich drin ok also richtig nice tasche hier man sieht schon das geht auch nicht einfach mal so auf also da muss man schon ein bisschen dran ziehen so und da hat man jetzt drinne das ist mein persönliches favorite wenn man einfach irgendwie was für ein bisschen elektrobastel geschichten braucht da ist das schon nice der tool check ist auch powergas in kombination dazu passt der tool check der tool check ist optimale ergänzung dazu also was hat man hier am start man hat einmal einen phasenprüfer den ich glaube ich hier noch nicht einmal verwendet hat von deswegen ist auch immer noch das ding dran man hat so die üblichen gängige nüsse am start und wobei das für elektrobastel ein ganz gutes man hat halt hier so nen so nen so nen vera griff so nen kraftform griff wie das bei denen heißt und da kann man hier die ganzen dinger rein machen so wenn ich jetzt beispielsweise ok ich brauche jetzt mal wirklich ordentlich fetten kreuzschlitz machst du hier so und hast einen schraubendreher am start ist halt nice dann hast du auch nochmal ein paar dann hast du auch nochmal hier ein paar default bits am start die man mal brauchen kann inklusive einem halter dann hast du noch den vera halter für bits der ist der ist tatsächlich cool da kann man hier vorne wir machen das jetzt mal mit dem i fix it man ist mal mit dem i fix it kannst du hier vorne das ding rein machen aber war das der zum drücken oder war das der zum ziehen ich weiß es kann er mehr geht das aber passt gar nicht richtig ah jetzt ok genau das hast du dieses ding hier vorne drin dann ziehst hier hinter zack und dann sollte es eigentlich wieder rausgehen aber dieses i fix it ding ist irgendwie ein bisschen bisschen über über stabil ok jetzt kannst du es rausziehen guck zack i fix it ding ist ein bisschen kantig das geht irgendwie gar nicht richtig richtig rein also normalerweise ziehst du das dann nach vorne und das geht ach nee du musst den direkt ziehen ok das ist anders als beim tool check bit halter interessant also er macht den rein hinter und dann ist er fest und wir schieben wieder vorne dann gehts raus ok ich habe nichts gesagt der tool check bit halter geht glaube ich nach hinten bin ich mir relativ sicher ist auch egal zumindest hat man den ordentlichen bit halter und das das eigentlich fast nicest an dem set ist das teil das ist die kleine wäre zyklop knarre da kann man schraube schraube machen mit schraube schraube aber was richtig poggers ist man kann nicht nur schraube schraube machen man kann auch clips das ding einmal so einstellen oder auch einmal so auf 90 grad oder einmal rum oder in die ecke also sprich man kann damit theoretisch schrauben man kann damit um die ecke stelzen oder 90 grad winkel schrauben das ding ist wirklich cool also wenn man es mal braucht ist man wirklich froh wenn man das teil hat das ist wirklich nice und da hat man auch die üblichen schraubendreher dinger von den normalen ein paar talks und ein paar schraubendreher und ansonsten war es das eigentlich aber ist wirklich ist ein wirklich cooles set und in kombination mit toolcheck plus finde ich das super es gibt noch einen maul schlüssel dabei der einzige maul schlüssel glaubt von vera der links und rechts ein schlüssel hat das sind so die standardgrößen was hast hier 10 und 13 so wenn man das hat plus ein toolcheck plus ist man wirklich ziemlich gut ausgestattet und kann eigentlich alles machen was man so machen muss aber das ding finde ich cool gerade in kombination hier mit diesem anpassbaren griff hier kannst du so machen zack da draußen ja also das ding finde ich viel angenehmer ist auch qualitativ deutlich besser aber kostet natürlich ein bisschen mehr und es ist halt trotzdem eine nice geschichte ja poggers genau und wenn man sich jetzt einmal den preisunterschied anguckt dom pc 10 monat dankeschön für den sub wenn man sich jetzt mal den preis anguckt ich meine i fix it kostet was hier so ein standard i fix it das habe ich glaube ich ich glaube das hier ist das also i fix it hier wollen sie 70 euro versucht ganz schön teuer ist diesen ganzen crap also ganz ehrlich nimmt lieber das hier weil der restliche kram ist komplett useless und das der restliche kram ist billig krab das hier ist eigentlich den kram den man haben will also die das doppelte hier an preis fast für dies pass an lohnt sich überhaupt nicht so also so ein fix it ding sagen mal 60 euro so und das wäre elektriker set that was ist denn gibt es das gibt es das nicht mehr der ist übrigens auch super hier der da hier leute geht eigentlich geht eigentlich kostet kostet einfach mal 90 euro ist halt schon ein bisschen unterschied ja aber also mal ganz im ernst wenn ich wirklich den fix it pro kaufe wo halt so viel zeug dabei ist was man nicht braucht dann kann man sich fast schon einfach nur den fix it bitsatz kaufen weil der ist wirklich praktisch kauft man sich für 34 euro den und dann kauft man sich noch das elektriker set dabei dann ist man zwar 130 euro los oder 125 euro los und wenn man richtig pro ausgerüstet sein will kauft man sich noch einen kauft man sich noch tool check plus dabei und dann hat man tatsächlich wirklich alles was man braucht also der tool check plus ist eigentlich doppelt gemoppelt den brauche man dann eigentlich gar nicht mehr es sei denn ein paar ganz special special bits aber wenn ihr wenn ihr das habt plus dieses wäre elektriker set ohne scheiß also dann habt ihr 99 prozent aller schraube sachen abgedeckt das fix jetzt ist halt das coole weil du da so special sachen hast wie iphone öffnen dinger und sowas also bei dabei wenn wir gerade dabei sind auch gutes weihnachtsgeschenk ja und ich habe irgendwie mal ein fix it bit verschlammt der liegt hier bestimmt irgendwie auf dem schreibtisch und ich finde ihn nur nicht na gut hast du ein affiliate link ne sollte ich mal machen ich wollte mir sebaro schon seit einer weile mal so ein max choice liste machen wo das alles drin ist sollten wir echt machen gerade jetzt zu weihnachten gibt stonks geld also ok leute es war richtig nice dass wieder so viele dabei waren wir hatten heute spitzen spitzen dings fast 300 leute schön dass so viele dabei waren wenn es euch gefallen hat wäre natürlich auch nice wenn ihr eine runde folgert das ist nächstes mal mit auf aktuellen stand sein ihr merkt kann keinen guten sehr laut machen dass das nächste mal mit am start sein und wir sehen uns beim nächsten stream ich gehe jetzt was essen ich habe hunger bis denn wir sehen uns macht's gut zu", "segments": [{"id": 1, "start": 0.0, "end": 14.96, "text": "Jetzt ist besser, ne? Ja. Ja, ich weiß ja, dass viele in Deutschland leider keinen ordentlichen"}, {"id": 2, "start": 14.96, "end": 19.28, "text": "Internetanschluss haben und deswegen 8 MB zu viel sind, deswegen sind wir mal auf 4,9"}, {"id": 3, "start": 19.28, "end": 24.24, "text": "runter. Jetzt ist besser. It's war schneller. Easy."}, {"id": 4, "start": 24.24, "end": 34.24, "text": "Wandel die Twitch-Server das nicht um? Doch, die Twitch-Server wandeln das um, allerdings"}, {"id": 5, "start": 34.24, "end": 42.08, "text": "nur, wenn du nicht auf der Originalauflösung guckst. Also du kannst... Okay, jetzt müssen"}, {"id": 6, "start": 42.08, "end": 45.56, "text": "wir uns wärmer angucken, ne? Also wenn du auf Source gehst, was das einzig sinnvolle"}, {"id": 7, "start": 45.56, "end": 53.08, "text": "ist, weil nur da ist es scharf oder richtig scharf, wenn du auf 1080p, 840 gehst, dann"}, {"id": 8, "start": 53.08, "end": 57.52, "text": "wandelt der das nicht um, dann ist das 8 MBit, wenn nicht auf 8 MBit. Du kannst hier drauf"}, {"id": 9, "start": 57.52, "end": 61.4, "text": "gehen, aber dann sieht es halt nicht so scharf aus. Warten wir mal kurz, warten bis die Werbung"}, {"id": 10, "start": 61.4, "end": 71.44, "text": "vorbei ist. Pause-Champ, Pause-Champ, Pause-Champ, Pause-Champ. Genau, so. Und jetzt sieht man"}, {"id": 11, "start": 71.44, "end": 77.52, "text": "hier, es ist halt mit, wenn man sich hier die Schrift anguckt, halt 27p nicht so wahnsinnig"}, {"id": 12, "start": 77.52, "end": 83.16, "text": "scharf, wohingegen, wenn man 1080p macht, ist halt hier Poggers. So, und du kannst halt"}, {"id": 13, "start": 83.16, "end": 87.52, "text": "nicht, das ist übrigens übelst verwirrend hier, du kannst halt nicht 1080p machen mit"}, {"id": 14, "start": 87.52, "end": 91.24, "text": "8 MBit, dass es das runterrechnet, nur die anderen. Deswegen, ich muss das jetzt hier"}, {"id": 15, "start": 91.24, "end": 97.6, "text": "runter machen, weil das Internet in Deutschland zu sehr suckt. Lightroom, ja, MonkaS. Stimmt,"}, {"id": 16, "start": 97.6, "end": 102.64, "text": "ich muss den Chat aufmachen, weil ich sehe ja sonst den Chat gleich wieder nicht. Zack."}, {"id": 17, "start": 102.64, "end": 108.04, "text": "So, viel besser, viel besser. So, weil wir basteln heute mal ein bisschen was und guckt"}, {"id": 18, "start": 108.04, "end": 117.6, "text": "mal, ich hab den 100 Viewer schon richtig, ja, ja, ja. Ja, das war G-Bait, weil ich den"}, {"id": 19, "start": 117.6, "end": 121.56, "text": "Stream neu gestartet hab. Da zählt es mal kurz doppelt, ansonsten dauert das immer ein bisschen."}, {"id": 20, "start": 121.56, "end": 125.96, "text": "So, guckt mal, ich hab die Kamera jetzt ein bisschen anders eingestellt, Leute. Die Kamera"}, {"id": 21, "start": 125.96, "end": 130.6, "text": "ist jetzt so hier, guckt mal. Manchmal muss man kurz gucken, dass ich hier nicht hängen"}, {"id": 22, "start": 130.6, "end": 134.32, "text": "bleib, man hätte es nicht ein bisschen entwirre. Guckt mal, die Kamera ist jetzt so, die ist"}, {"id": 23, "start": 134.32, "end": 143.92, "text": "jetzt quasi eher so horizontal. Was ist das für ein Bildschirm schon, oder? Das ASCII"}, {"id": 24, "start": 143.92, "end": 150.24, "text": "Aquarium. Die Kamera ist jetzt eher so horizontal, dass die Leute nicht schlecht wird und da muss"}, {"id": 25, "start": 150.24, "end": 157.88, "text": "ich halt hier. WTF. Handlieg, Handlieg. Okay, gerade noch richtig, ja. War das knapp. Nee,"}, {"id": 26, "start": 157.88, "end": 165.36, "text": "also, man sieht jetzt so ungefähr von hier, so ungefähr hier ist der Anfang von der Matte,"}, {"id": 27, "start": 165.36, "end": 171.68, "text": "das geht bis hinten, also sprich, man sieht jetzt mehr oder weniger die ganze Matte und"}, {"id": 28, "start": 171.68, "end": 179.56, "text": "man sieht jetzt halt ziemlich gerade oben, guck mal, der Autofokus. OMEGALUL. OMEGALUL,"}, {"id": 29, "start": 179.56, "end": 189.08, "text": "der Autofokus spackt schon ganz schön rum. Okay, ich mach jetzt da nix dran. Ich lass"}, {"id": 30, "start": 189.08, "end": 195.32, "text": "das jetzt, bevor das irgendwie runterfällt oder so. Zumindest müsste jetzt der Angle"}, {"id": 31, "start": 195.32, "end": 205.32, "text": "von der Kamera viel besser sein als letztes Mal. Ja, I fix not ist auch wieder am Start,"}, {"id": 32, "start": 205.32, "end": 214.08, "text": "auf das Teil, was ich verbogen hab. Neradon, 17 Monate, das ist ja massive Subscription."}, {"id": 33, "start": 214.08, "end": 229.96, "text": "Das ist ja, also was von wann bis wann arbeitest du unter der Woche? Von 7 bis 1530 ungefähr."}, {"id": 34, "start": 229.96, "end": 239.88, "text": "So, also wenn ich auf die Arbeit fahr, wenn ich auf die Arbeit fahr, wenn ich im Homeoffice"}, {"id": 35, "start": 239.88, "end": 249.2, "text": "bin dann meistens so von 7.30 bis 16 Uhr, so. Hab ich noch, also Leute, falls ich heute"}, {"id": 36, "start": 249.2, "end": 253.24, "text": "Subs übers sehe, müsst ihr wieder ein bisschen nachsehen, ich bin jetzt gleich, ich guck"}, {"id": 37, "start": 253.24, "end": 256.64, "text": "jetzt gleich nicht auf den Bildschirm, wir gucken uns jetzt gleich hier im, wir gucken"}, {"id": 38, "start": 256.64, "end": 263.48, "text": "uns jetzt gleich die Kamera an. Also ich guck selbst drauf, so mit Auge, ja, ich mach Auge"}, {"id": 39, "start": 263.48, "end": 267.76, "text": "und ihr müsst halt über die Kamera gucken. Also ich guck grad mal, hab ich was übers"}, {"id": 40, "start": 267.76, "end": 281.84, "text": "sehen? Ne, ich glaub nicht. So, okay. Also, was wir heute machen, ich dreh mich mal kurz"}, {"id": 41, "start": 281.84, "end": 285.8, "text": "um, ich versuch euch das mal kurz zu zeigen. Und zwar, wir müssen heute mal ein bisschen"}, {"id": 42, "start": 285.8, "end": 290.36, "text": "was retten, was ich noch an Zeug rumliegen hab. Und zwar, also, erste Mal, erste Mal"}, {"id": 43, "start": 290.36, "end": 293.44, "text": "Leute, ich weiß, jetzt ist bestimmt gleich wieder, jetzt ist bestimmt gleich wieder"}, {"id": 44, "start": 293.44, "end": 301.4, "text": "Leak im, Leak im Tablet oder irgendwie sowas angesagt. Als erstes, obei, ich mach das Tablet"}, {"id": 45, "start": 301.4, "end": 305.48, "text": "einfach nicht ins Bild, lul. Ähm, weil ich muss mal den Chat einblenden im Tablet, wenn"}, {"id": 46, "start": 305.48, "end": 313.6, "text": "ich den Chat im Tablet nicht einblende, seh ich nix, wenn ich umgedreht bin. So. Ups,"}, {"id": 47, "start": 313.6, "end": 319.96, "text": "wo bloß, wo ist er? Der ist live. Ja, Vorschaubildschirm anmachen. Jetzt muss ich mir noch mal die"}, {"id": 48, "start": 319.96, "end": 325.84, "text": "gleiche Werbung angucken von eben. Na toll. Ne, jetzt ist es Deutschland 73 oder irgendwie"}, {"id": 49, "start": 325.84, "end": 331.96, "text": "sowas, was ich mir angucken muss. Sag mal, warum gibt's bei der Werbung, warum gibt's"}, {"id": 50, "start": 331.96, "end": 337.04, "text": "bei der Werbung kein Chat mehr dabei? Wo ist das denn jetzt? Guck du mal da. Ah, jetzt"}, {"id": 51, "start": 337.04, "end": 340.56, "text": "geht der Chat. Okay, alles klar, ich hab nix gesagt. Chat, Chat geht. Ach so, Moment,"}, {"id": 52, "start": 340.56, "end": 345.84, "text": "ich hab euch ja gar nicht eingeblendet, lul. Ah, Chat, Chat geht. Exzellent, exzellent,"}, {"id": 53, "start": 345.84, "end": 351.28, "text": "Chat. So, ähm, jetzt hab ich nämlich Chatvorschau, weil ohne Chatvorschau ist ziemlich, ziemlich"}, {"id": 54, "start": 351.28, "end": 360.28, "text": "kacke. Das seh ich nämlich nix. So, wunderbar. So, also, ich zeig euch mal, was wir am Start"}, {"id": 55, "start": 360.28, "end": 366.88, "text": "haben. Und, ähm, nur gucken, dass ich das Headset nicht runterschmeiß. Also, ihr habt"}, {"id": 56, "start": 366.88, "end": 370.76, "text": "vielleicht festgestellt, ich hab jetzt hier ein Stativ hingestellt, also sprich, das ist"}, {"id": 57, "start": 370.76, "end": 375.6, "text": "jetzt ein bissl, äh, bisschen gerader alles. Ich hoffe, das passt besser als das die letzten"}, {"id": 58, "start": 375.6, "end": 382.52, "text": "zwei Mal. Hinten sieht man noch die Steckdoseleiste rumstehen. Gut, nicht so wild. Ähm, tja,"}, {"id": 59, "start": 382.52, "end": 389.04, "text": "müssen wir mal gucken. Also, was ich heute am Start hab, ist folgendes. Ähm, ich hab"}, {"id": 60, "start": 389.04, "end": 394.88, "text": "ja letztes Jahr für den Weihnachtsbaum was gebastelt. So, Moment, das muss ich euch"}, {"id": 61, "start": 394.88, "end": 400.6, "text": "mal kurz, muss ich mal kurz hier ranzerren mit dem Fuß, weil ich nicht genug Kabel hab."}, {"id": 62, "start": 400.6, "end": 407.56, "text": "Lol, weh. So. Genau, ich hab jetzt letztes Mal ja was gebastelt, letztes Jahr, ich mach"}, {"id": 63, "start": 407.56, "end": 410.92, "text": "mal ein bissl Platz, für den Weihnachtsbaum. Das hab ich damals auch auf Twitter gepostet,"}, {"id": 64, "start": 410.92, "end": 416.92, "text": "aber, äh, das hat, das hat ein paar Bugs gehabt, ne. Und die Farben sahen nicht kacke"}, {"id": 65, "start": 416.92, "end": 421.56, "text": "aus, die Helligkeit war kacke und vor allem, ähm, war mein Programmieren kacke, weil ich"}, {"id": 66, "start": 421.56, "end": 426.92, "text": "halt, äh, so großer C++ Fan bin bisher, ne. Also, guckt mal hier. Also, ich versuch's"}, {"id": 67, "start": 426.92, "end": 433.56, "text": "euch mal irgendwie drunterzulegen, da. So, das ist ein LED Strip, und zwar so ein, das"}, {"id": 68, "start": 433.56, "end": 440.48, "text": "ist noch ein Alter, das ist noch so einer, ein WS2811, so ein LED Strip. Sind, glaubt,"}, {"id": 69, "start": 440.48, "end": 446.28, "text": "nur 50 Stück. Vivo Steel, Dankeschön für den Sub-Subscriptions."}, {"id": 70, "start": 446.28, "end": 462.88, "text": "Excellent. Und, wartet mal, ich muss grad mal die andere Maus noch aufs Maus-Pad stellen,"}, {"id": 71, "start": 462.88, "end": 470.04, "text": "dass ich die Emotes auslesen kann, ohne rüberzugehen, das ist besser. Geht das jetzt? Lass mal kurz"}, {"id": 72, "start": 470.04, "end": 480.08, "text": "gucken. Ja, geht, exellent. Also, hier, das ist der LED Strip, den ich ja letztes Jahr"}, {"id": 73, "start": 480.08, "end": 486.88, "text": "für verwendet habe, und das Problem dabei ist, ich leg das einfach hier unten mal hin,"}, {"id": 74, "start": 486.88, "end": 491.8, "text": "sehe ich den Chat nämlich auch, so. Oh, Moment, jetzt hört ihr, wie es heute euch doppelt,"}, {"id": 75, "start": 491.8, "end": 496.6, "text": "oder? Ich hab hier nämlich noch Sound an, Sound will ich hier nicht an, haben wir am"}, {"id": 76, "start": 496.6, "end": 500.52, "text": "Ende. So, also, das ist der LED Strip von letztem"}, {"id": 77, "start": 500.52, "end": 503.28, "text": "Jahr, das ist ein ganz billiger, hab ich bei Amazon gekauft, für irgendwie, fragt mich"}, {"id": 78, "start": 503.28, "end": 508.0, "text": "nicht, 20 Euro oder so, also kein soll ich toller LED Strip. Der Gute an dem LED Strip"}, {"id": 79, "start": 508.0, "end": 512.32, "text": "ist, aber er ist wasserdicht komplett, das haben die Chinesen dadurch erreicht, indem"}, {"id": 80, "start": 512.32, "end": 520.44, "text": "sie hier extrem viel Heißkleber reingesprayt haben, also das ist quasi halb, halb China"}, {"id": 81, "start": 520.44, "end": 527.12, "text": "an Heißkleber drin. Zumindest ist das dicht, das Ding ist IP68, also das kannst du, glaub"}, {"id": 82, "start": 527.12, "end": 532.84, "text": "ich, kannst du die IP68 nicht auch untertauchen? Ich glaub schon, zumindest ist das wasserdicht,"}, {"id": 83, "start": 532.84, "end": 538.2, "text": "und der Vorteil für den Weihnachtsbaum ist, dass das so ein fast schwarzes Kabel ist,"}, {"id": 84, "start": 538.2, "end": 547.28, "text": "und diese grünen PCBs, also diese Dinger hier drin mit dem Controller, die siehst"}, {"id": 85, "start": 547.28, "end": 551.6, "text": "er in dem grünen Baum gar nicht. Also das Ding eignet sich eigentlich ganz gut für"}, {"id": 86, "start": 551.6, "end": 557.0, "text": "den Weihnachtsbaum, die Sache ist plus da, ist plus die, dass mein Programmier, das"}, {"id": 87, "start": 557.0, "end": 562.28, "text": "was Programmierter ein bisschen gesagt hat, und dass ich auch keine gescheite Verpackung"}, {"id": 88, "start": 562.28, "end": 566.48, "text": "hatte. Ich hatte das letztes Jahr in so ein komisches Case gemacht, und hatte das dann"}, {"id": 89, "start": 566.48, "end": 572.04, "text": "quasi so am Weihnachtsbaum hängen nehmen. Das war natürlich jetzt nicht der Zweck der"}, {"id": 90, "start": 572.04, "end": 578.68, "text": "Funktion, wenn du den Kabel an so dein Weihnachtsbaum hängen hast. Gut, deswegen hab ich überlegt,"}, {"id": 91, "start": 578.68, "end": 581.96, "text": "bauen wir das heut mal ein bisschen besser. Ich muss übrigens aufpassen, dass ich keinen"}, {"id": 92, "start": 581.96, "end": 587.88, "text": "Kurzschluss fabrizier, weil da, ne, wäre nicht so gut, dann weiß ich nicht was. Was"}, {"id": 93, "start": 587.88, "end": 596.76, "text": "passiert, wenn man LED-Strip kurzschließt? Ist da nur, ist da nur die LED kaputt hier"}, {"id": 94, "start": 596.76, "end": 600.88, "text": "vorne, oder ist da der ganze Strip im Arsch? Was passiert denn dann? Chat, ihr wisst das"}, {"id": 95, "start": 600.88, "end": 607.64, "text": "bestimmt. Big Brain Chat, ihr wisst sowas. Leuchten da ein paar weniger? Ja, ein paar"}, {"id": 96, "start": 607.64, "end": 616.8, "text": "oder alle? F für den LED-Strip ist dann. So, ja, da muss ich da ein paar Klemmen drüber"}, {"id": 97, "start": 616.8, "end": 623.12, "text": "machen oder so, dass ich das hier nicht kurzschließe. Zumindest das sind, glaubt, 50 Stück, und"}, {"id": 98, "start": 623.12, "end": 628.28, "text": "da kommt noch eine Sache dazu. Das ist ein NodeMCU ESP32, und der ist mir eigentlich"}, {"id": 99, "start": 628.28, "end": 641.72, "text": "zu schade für einen LED-Strip. Ja, soweit so gut. Übrigens, das Ganze ist auch deutlich"}, {"id": 100, "start": 641.72, "end": 646.08, "text": "wackelresistent, der jetzt im Vergleich zum letzten Mal. Also, wenn ich jetzt hier gegen"}, {"id": 101, "start": 646.08, "end": 651.04, "text": "den Tisch mal ein bisschen hau, mein, da seht ihr zwar, ich hau jetzt schon wirklich ordentlich"}, {"id": 102, "start": 651.04, "end": 657.52, "text": "gegen den Tisch. Ich hab mir extra einen Tisch hierfür hingefahren. So ein, so ein,"}, {"id": 103, "start": 657.52, "end": 662.2, "text": "also das ist ein ziemlich massiver, schwerer. Da muss ich ja wirklich hier ordentlich, ordentlich"}, {"id": 104, "start": 662.2, "end": 666.36, "text": "dagegen kloppen, dass da überhaupt wackelt der Tisch. Also, ich denk mal insgesamt,"}, {"id": 105, "start": 666.36, "end": 676.28, "text": "dass das bessere Stream-Quali ist. Tischviolenz, ja, genau. So, also, lass mal überlegen,"}, {"id": 106, "start": 676.28, "end": 682.4, "text": "mit was fangen wir dann am besten an. Genau, also jetzt hab ich euch den LED-Strip gezeigt,"}, {"id": 107, "start": 682.4, "end": 687.68, "text": "und der sah das letzte Mal ganz gut am Baum aus. Deswegen versuch ich den jetzt mal zu"}, {"id": 108, "start": 687.68, "end": 692.08, "text": "retten. Man sieht schon, irgendwie ist das hier auch nicht so wahnsinnig gut verarbeitet,"}, {"id": 109, "start": 692.08, "end": 696.28, "text": "aber ich mein, das funktioniert. So, gut, also das ist der LED-Strip, und dann hab ich"}, {"id": 110, "start": 696.28, "end": 700.48, "text": "mir gedacht, wir machen jetzt folgendes, mach das hier erstmal kurz mit der, kurz irgendwo"}, {"id": 111, "start": 700.48, "end": 707.72, "text": "weg. So, dann hab ich mir gedacht, wir machen folgendes, also mal kurz die Tools da oben"}, {"id": 112, "start": 707.72, "end": 713.96, "text": "in die Ecke. Das brauchen wir bestimmt gleich. So, Seitensteiner oben in die Ecke. Ich hab"}, {"id": 113, "start": 713.96, "end": 721.92, "text": "hier noch so eine Box, so eine IP68-Box, und da wollte ich mal was einbauen, deswegen hab"}, {"id": 114, "start": 721.92, "end": 725.88, "text": "ich da auch schon mit so einem Kegelbohrerloch rein gemacht. Die Sache ist nur die, dass"}, {"id": 115, "start": 725.88, "end": 730.76, "text": "das nicht reingepasst hat. Und jetzt hab ich eine IP68-Box mit dem Loch. Und da dachte"}, {"id": 116, "start": 730.76, "end": 737.64, "text": "ich mir so, das ist optimal, um da den Controller für die LED-Steuerung rein zu machen. Äh,"}, {"id": 117, "start": 737.64, "end": 741.48, "text": "da hast du eine Katze. Ja, hab ich, hab ich. Klar, das ist alles hier. Also ich hab nicht"}, {"id": 118, "start": 741.48, "end": 747.28, "text": "irgendwelche Selbstverstümmelungsdinger oder so. Das ist alles Katzending. Und hier,"}, {"id": 119, "start": 747.28, "end": 752.0, "text": "Moment, wo hab ich noch was hier? Hier hat sie mich heute Mittag übelst gekratzt. Die"}, {"id": 120, "start": 752.0, "end": 757.28, "text": "kratzt mich nicht absichtlich, muss man sagen. Hm, ich find's gar nicht jetzt gerade. Ach"}, {"id": 121, "start": 757.28, "end": 766.2, "text": "hier, guck mal da. Die kratzt mich nicht absichtlich, die ist so, halt wenn die hier, weiß ich"}, {"id": 122, "start": 766.2, "end": 772.44, "text": "ob, hat man das jetzt eigentlich gesehen hier? Wenn die, wenn die, wenn die, wenn die Monka"}, {"id": 123, "start": 772.44, "end": 783.72, "text": "Spielaction macht, dann kann's mal passieren, dass die bisschen zu sehr abgeht. Und außerdem"}, {"id": 124, "start": 783.72, "end": 787.88, "text": "hatte ich das wahrscheinlich nie anders gelernt. Genau, also das ist jetzt keine IP68-Box mit"}, {"id": 125, "start": 787.88, "end": 792.36, "text": "dem Loch. Aber ich hab mir gedacht, ich mein, ich hab ja mittlerweile ziemlich viel Gedöns"}, {"id": 126, "start": 792.36, "end": 796.36, "text": "am Start. Wir werden das, wir versuchen das mal zu retten. Und zwar wir nehmen die Box"}, {"id": 127, "start": 796.36, "end": 800.88, "text": "und passen den Deckel dazu. Äh, dann hat man hier noch so ein Gummi-Ding zum abdichten."}, {"id": 128, "start": 800.88, "end": 806.64, "text": "Dann nehmen wir die Box und hier machen wir dann den Controller für den LED-Strip rein."}, {"id": 129, "start": 806.64, "end": 811.92, "text": "Die Sache ist nur die, der Controller hier, Moment, den ich hier beim LED-Strip dabei"}, {"id": 130, "start": 811.92, "end": 816.88, "text": "hab, der passt zwar, ist aber ein bisserl groß. Da passt ja sonst nix mehr rein. Deswegen"}, {"id": 131, "start": 816.88, "end": 821.72, "text": "hole ich gleich mal meine Technik-Box, wo ich random alles reinschmeiße, was sonst nirgendwo"}, {"id": 132, "start": 821.72, "end": 824.64, "text": "hingehört. Und wir gucken mal, ob wir dann noch irgendeinen kleineren Controller finden."}, {"id": 133, "start": 824.64, "end": 836.8, "text": "Fing in die Kamera. Lul. Ähm, und ich hab gedacht, wir probieren das jetzt zu retten,"}, {"id": 134, "start": 836.8, "end": 841.52, "text": "indem wir dann den Controller einbauen für die, für die LED-Leiste. Und zwar, ich hab"}, {"id": 135, "start": 841.52, "end": 846.0, "text": "hier was wasserdichtes. Und zwar, wartet mal, ich muss das gerade mit dem Fuß herstellen,"}, {"id": 136, "start": 846.0, "end": 855.8, "text": "weil ich zu weit weggeschmissen hab. So, und zwar hab ich hier so ein Ding. So Anschlüsse"}, {"id": 137, "start": 855.8, "end": 863.72, "text": "fürs Netzteil, weil, also Netzteil nennt man das hier. Das ist ein 5V, 3A Netzteil,"}, {"id": 138, "start": 863.72, "end": 867.72, "text": "das reicht für 50 LEDs, das ist nicht so das Ding. Die Netzteile hier sind übrigens tatsächlich"}, {"id": 139, "start": 867.72, "end": 875.84, "text": "ganz nützlich. Das ist ein Netzteil, das kann man einstellen von 3V bis zu 12V."}, {"id": 140, "start": 875.84, "end": 882.48, "text": "Hat aber maximal, müsste man hier hinten mal kurz drauf gucken, hat aber maximal 3A."}, {"id": 141, "start": 882.48, "end": 894.24, "text": "Das reicht, das sind dann quasi 15 Watt, wenns keine Verluste gibt unterwegs. Das reicht"}, {"id": 142, "start": 894.24, "end": 899.8, "text": "für 50 LEDs, das ist kein Problem. Ich hab hier auch noch, ah Moment, muss ich mal aufstehen,"}, {"id": 143, "start": 899.8, "end": 913.92, "text": "muss ich mal kurz holen, wartet mal. So, wir können dann auch mal ausprobieren, weil das"}, {"id": 144, "start": 913.92, "end": 919.24, "text": "letzte Mal so viele Leute gefragt haben, wie viel der Kram verbraucht. Wir können auch"}, {"id": 145, "start": 919.24, "end": 923.8, "text": "mal heute mal gucken, wir machen jetzt einfach hinten die Steckdosenleiste rein, ich zeig"}, {"id": 146, "start": 923.8, "end": 929.56, "text": "euch das mal. Da kann man mal gucken, was der ganze Kram verbraucht. Aber, ja, das leg"}, {"id": 147, "start": 929.56, "end": 937.52, "text": "ich jetzt erstmal unten hin. Und dann gucken wir mal. Exzellent. Einfach die ganze Box"}, {"id": 148, "start": 937.52, "end": 942.0, "text": "mit Heißkleber füllen. Ja, das ist natürlich auch eine Variante, das ist die Chinesen-Variante,"}, {"id": 149, "start": 942.0, "end": 945.4, "text": "so wie die das mit der LED-Leiste gemacht haben. So, das heißt, als erstes, was wir"}, {"id": 150, "start": 945.4, "end": 949.24, "text": "machen müssen, ich zeig euch mal, was ich jetzt hier vor hab. Ich hab mir hier so ein,"}, {"id": 151, "start": 949.24, "end": 954.68, "text": "das sind so paar Stecker-Durchführungs-Dinger, ich weiß nicht, wie das heißt, wie nennt"}, {"id": 152, "start": 954.68, "end": 961.2, "text": "man das eigentlich offiziell hier. Was ist denn das? Oh nein, Adresse liegt. Nein, agibated."}, {"id": 153, "start": 961.2, "end": 975.52, "text": "Das ist... in... in... Porgers, in Frankreich. So, vat06seamwe.de, alles klar. Vollkommen"}, {"id": 154, "start": 975.52, "end": 981.52, "text": "logisch, aber auf jeden Fall made in China. Zumindest, was das ist, kann ich euch schon"}, {"id": 155, "start": 981.52, "end": 990.44, "text": "mal zeige, wenn ichs aufkrieg. Bin grad nicht in der Lage, es zu öffnen. Äh, sag mal,"}, {"id": 156, "start": 990.44, "end": 995.08, "text": "warum stellt ein On-Screen-Chat manche Emotes eigentlich so klein da? Macht er? Die Emotes"}, {"id": 157, "start": 995.08, "end": 999.0, "text": "sehen für mich eigentlich ziemlich genauso aus wie im Twitch-Chat in der Vorschau. So,"}, {"id": 158, "start": 999.0, "end": 1004.24, "text": "zumindest, da sind solche Dinger drin. Und ihr seht, wenn ich euch mal das beim Netzteil"}, {"id": 159, "start": 1004.24, "end": 1009.72, "text": "zeig, da kann man den Netzteilstecker nehmen und zack, der passt rein. So, und ich hab"}, {"id": 160, "start": 1009.72, "end": 1016.12, "text": "Glück. Ich hab Glück. Das Loch hier ist zwar nen Ticken zu groß, aber nicht zu groß. Also"}, {"id": 161, "start": 1016.12, "end": 1027.2, "text": "sprich, ich kann da so nen Stecker rein machen. Und, ähm... Stimmt, der stellt die Emotes"}, {"id": 162, "start": 1027.2, "end": 1032.84, "text": "mega klein da, PepeLop. Weiß ich nicht, das ist irgendein Bug. Irgendein Better-Twitch-TV-Bug"}, {"id": 163, "start": 1032.84, "end": 1038.12, "text": "oder so, keine Ahnung. Das macht der nicht schon immer so. Weiß ich nicht, was der für"}, {"id": 164, "start": 1038.12, "end": 1042.6, "text": "Schmerzen hat. Das ist Bug vom Chat, da kann ich nix machen, weil ich verwende den, ich"}, {"id": 165, "start": 1042.6, "end": 1047.12, "text": "verwende den, ich glaub, das ist der Steam-Labs-Chat. Da kann ich, kann ich nix... Was macht der"}, {"id": 166, "start": 1047.12, "end": 1052.96, "text": "mit Salami? Kann der Salami? Wie sieht's mit Salami? Salami kann er darstellen, okay."}, {"id": 167, "start": 1052.96, "end": 1061.84, "text": "Vielleicht hat er nur Probleme mit Better-Twitch-TV-Emotes. Ich weiß es nicht. Keine Ahnung. Kein Schimmer."}, {"id": 168, "start": 1061.84, "end": 1068.8, "text": "Naja, zumindest, ihr seht, es wackelt aber ein bisschen hier. Guck her. Ist da wackelos."}, {"id": 169, "start": 1068.8, "end": 1076.0, "text": "So, aber das ist nicht schlimm, weil von der Idee her sind hier einmal so Dichtungs-Dinger"}, {"id": 170, "start": 1076.0, "end": 1086.48, "text": "dabei. Da kann man dann am Ende, kann man die hier durch machen. Da macht man das hier"}, {"id": 171, "start": 1086.48, "end": 1090.08, "text": "rein. Dann hat man so ein bisschen Dichtung. Kann man dann übrigens auch hier reinstecken,"}, {"id": 172, "start": 1090.08, "end": 1094.56, "text": "was total sinnlos ist. So, da hat man eine Dichtung und für die andere Seite hat man"}, {"id": 173, "start": 1094.56, "end": 1100.48, "text": "hier noch so ein paar Ringe. Da kann man das dann da reinschrauben. So, irgendwie kann"}, {"id": 174, "start": 1100.48, "end": 1106.44, "text": "man das da reinschrauben, wenn man fingerfertig genug ist, das da reinzuschrauben. Aber jetzt"}, {"id": 175, "start": 1106.44, "end": 1111.6, "text": "reinschrauben bringt ja eh nix. Genau. Also sprich, das können wir zumindest so schon"}, {"id": 176, "start": 1111.6, "end": 1116.08, "text": "mal damit verwenden. Und ich glaube, das ist ein ganz gutes Ding, um den Controller hier"}, {"id": 177, "start": 1116.08, "end": 1120.72, "text": "reinzumachen. Jetzt kommt allerdings die große Preisfrage, welchen Controller verwenden wir?"}, {"id": 178, "start": 1120.72, "end": 1128.48, "text": "Und da bin ich mir nicht so sicher. Und da bin ich mir nicht so sicher, weil, ihr habt"}, {"id": 179, "start": 1128.48, "end": 1132.8, "text": "es gerade gesehen, der eigentliche Controller, der ist zu fett. Außerdem ist mir der ESP32"}, {"id": 180, "start": 1132.8, "end": 1140.4, "text": "auch zu schade für. Ich brauch wahrscheinlich gleich noch ne Runde Schrumpfschläuche später,"}, {"id": 181, "start": 1140.4, "end": 1146.36, "text": "wenn ich den Krams da dran löte. Das müssen wir mal ausprobieren. Wo ich meine Schlauchhose"}, {"id": 182, "start": 1146.36, "end": 1150.56, "text": "hab, muss ich dann holen. Müssen wir mal gucken. So, jetzt müssen wir nämlich mal in meine"}, {"id": 183, "start": 1150.56, "end": 1156.84, "text": "Technikbox gucken. Da, wo ich den ganzen Kram, den ich sonst nirgendwo hinschreibe, hin machen"}, {"id": 184, "start": 1156.84, "end": 1161.56, "text": "kann, rein mache. Ich hoffe, das passt hier unten drunter. Ob wir noch irgendwas finden,"}, {"id": 185, "start": 1161.56, "end": 1167.4, "text": "was wir nehmen können. Also, ich mach mal auf. Zeigst mal her. Geht das so? Na jetzt. Wenn"}, {"id": 186, "start": 1167.4, "end": 1183.6, "text": "ihr das jetzt seht, dann seh ich das aber nimmer. Das ist ein ESP2866 Note MCU. Die"}, {"id": 187, "start": 1183.6, "end": 1190.08, "text": "würde sich richtig gut dafür eignen. Allerdings ist die genauso groß wie die alte und passt"}, {"id": 188, "start": 1190.08, "end": 1199.52, "text": "nicht so wirklich da. Also, das wird auf jeden Fall sehr eng. Und nachdem wir die Öffnung"}, {"id": 189, "start": 1199.52, "end": 1206.72, "text": "hier an der Seite haben, wird das glaub ich nix. Guck mal. Also sprich, wenn ich das,"}, {"id": 190, "start": 1206.72, "end": 1213.8, "text": "wir können das mal kurz ausprobieren. Also sprich, wenn ich das da reinmache, das passt"}, {"id": 191, "start": 1213.8, "end": 1220.32, "text": "dem Leben nicht rein. Ich mein, das passt, das kann jetzt, nee, guck, das passt nicht."}, {"id": 192, "start": 1220.32, "end": 1223.8, "text": "Oder, naja, also nee, nee, das passt nicht. Ich muss ja hier noch, ich muss ja hier noch"}, {"id": 193, "start": 1223.8, "end": 1229.2, "text": "die Stromkabel dran machen. Ich muss ja hier noch die Stromkabel dran machen. Und das irgendwie"}, {"id": 194, "start": 1229.2, "end": 1232.88, "text": "anklipsen. Also nee, nee, das wird nix. Das passt hier nicht rein. Vielleicht passt hochkant"}, {"id": 195, "start": 1232.88, "end": 1237.52, "text": "rein oder so, aber nee. Also keine Chance. Wir brauchen irgendwie, ich hoffe, wir finden"}, {"id": 196, "start": 1237.52, "end": 1242.04, "text": "noch ein bisschen kleinere. Ich hab noch ein paar, ich hab noch D1 Minis. Mal gucken, ob"}, {"id": 197, "start": 1242.04, "end": 1249.92, "text": "die funktionieren. Also das passt nicht. Also das hier ist wirklich nur so eine Notlösung,"}, {"id": 198, "start": 1249.92, "end": 1254.04, "text": "das Ding. Ich lass es mal draußen, aber ich glaube nicht, dass wir das verwenden können."}, {"id": 199, "start": 1254.04, "end": 1259.68, "text": "So, guck mal mal weiter. Was haben wir denn da noch schönes drin? Also was haben wir"}, {"id": 200, "start": 1259.68, "end": 1268.2, "text": "denn da noch schönes drin? Relays, das brauchen wir schon mal nicht. Eine M2 brauchen wir"}, {"id": 201, "start": 1268.2, "end": 1278.04, "text": "schon mal nicht. Äh, ein übrig gebliebener TT Go Laura Board mit GPS, Poggers, mit GPS"}, {"id": 202, "start": 1278.04, "end": 1283.16, "text": "und Antenne. Eigentlich richtig, das ist eigentlich ein richtig cooles Board. Das brauchen wir"}, {"id": 203, "start": 1283.16, "end": 1287.84, "text": "nicht für, das brauchen wir heute für nichts, ja. Aber du hast, du hast einen Slot für"}, {"id": 204, "start": 1287.84, "end": 1293.0, "text": "eine Batterie, für so eine 18655 oder so. Weißt, wie heißen die, wie heißen die Batterien,"}, {"id": 205, "start": 1293.0, "end": 1304.8, "text": "die man auch in E-Zigaretten macht. 18655, 18550, irgendwie so, diese dicken Akkus. 18650,"}, {"id": 206, "start": 1304.8, "end": 1309.12, "text": "ja genau die meine ich. Kommt da rein, dann hast du eine Antenne, eine Nora Antenne, keine"}, {"id": 207, "start": 1309.12, "end": 1315.96, "text": "WLAN Antenne, WLAN hast du ja auch an Board. Und du hast noch ein GPS Modul dabei, eigentlich"}, {"id": 208, "start": 1315.96, "end": 1321.0, "text": "ziemlich, ziemlich cooles Board. Und die Kabel reißen hier schon fast durch. Gut, wir wollen"}, {"id": 209, "start": 1321.0, "end": 1323.52, "text": "das ja nicht zu lange mit irgendwelchen komischen Boards aufhalten, die wir eh nicht verwenden."}, {"id": 210, "start": 1323.52, "end": 1333.68, "text": "So, was haben wir denn hier sonst noch? Äh, Bodenfeuchtigkeitssensor brauchen wir nicht."}, {"id": 211, "start": 1333.68, "end": 1344.72, "text": "Äh, Sensor, Kram, was haben wir denn da noch? Relays, Relays, äh, ich hab Spannungswandler"}, {"id": 212, "start": 1344.72, "end": 1355.2, "text": "oder so. Was haben wir hier? Einen Sensor, ich müsste noch D1 Minis, aha, aha, exzellent,"}, {"id": 213, "start": 1355.2, "end": 1361.72, "text": "den brauchen wir. Das ist ein guter Controller dafür. Ich guck mal schnell durch, ob ich"}, {"id": 214, "start": 1361.72, "end": 1365.72, "text": "noch einen fertig gelöteten hab, weil da muss ich, ah, guck mal hier, Powergas noch"}, {"id": 215, "start": 1365.72, "end": 1371.68, "text": "besser. Haben wir da sonst noch was? Ich hätte noch was, ich hätte noch was mit Display,"}, {"id": 216, "start": 1371.68, "end": 1382.52, "text": "brauchen wir aber nicht wirklich. Guck mal, ok, ich hab noch genug. Reicht, easy, easy."}, {"id": 217, "start": 1382.52, "end": 1389.52, "text": "Und ich seh gerade, Keg W, wo kommt denn der her? Da ist noch Raspberry Zero drinne."}, {"id": 218, "start": 1389.52, "end": 1396.44, "text": "Ha, ich hab letztens einen gesucht und keinen gefunden. Falls wir noch Bewegungssensor brauchen,"}, {"id": 219, "start": 1396.44, "end": 1402.0, "text": "ne, ganz Schwachsinn, brauchen wir nicht. Ok, äh, nehmen wir mal den da und den schmeiß"}, {"id": 220, "start": 1402.0, "end": 1406.88, "text": "ich da hinten mal hin, falls der kaputt ist, man weiß ja nie. So, machen wir den ganzen"}, {"id": 221, "start": 1406.88, "end": 1414.6, "text": "Kram wieder rein. Und den anderen auch rein und dann können wir uns mal angucken, ob das"}, {"id": 222, "start": 1414.6, "end": 1427.56, "text": "funkt. Stunks. Postleitzahl League, ja, genau, Postleitzahl League. Guck hier, hier ist"}, {"id": 223, "start": 1427.56, "end": 1431.52, "text": "Postleitzahl League. Moment Leute, ich zeig's euch, Postleitzahl League. Hier, da war's"}, {"id": 224, "start": 1431.52, "end": 1448.28, "text": "irgendwo, hier, da. Sonst irgendwo, ne? So. Also. So, guck mal, wie das ganze reinpasst."}, {"id": 225, "start": 1448.28, "end": 1463.08, "text": "Ok, das wird reinpassen. Ok, ok, wir probieren das mal aus. Ich mach das mal fest. Ich mein,"}, {"id": 226, "start": 1463.08, "end": 1467.56, "text": "das muss da eh rein, ne? Ich mach das, wobei, vielleicht soll ich, vielleicht soll ich"}, {"id": 227, "start": 1467.56, "end": 1471.72, "text": "es erstmal festlöten. Ich glaub, ich löte das erstmal fest. Bevor wir die Controller"}, {"id": 228, "start": 1471.72, "end": 1475.04, "text": "Geschichte machen, glaub ich, ich löte das Ding erstmal fest, also ich löte da zumindest"}, {"id": 229, "start": 1475.04, "end": 1480.92, "text": "einmal zwei, zwei Kabels dran, dass wir ein bisschen Platz haben. Und dann kommt, der"}, {"id": 230, "start": 1480.92, "end": 1484.68, "text": "macht das hier schäpp, oder? Guck mal, was hab ich denn da gemacht? Seht ihr das? Seht"}, {"id": 231, "start": 1484.68, "end": 1494.96, "text": "ihr das? Guck mal, wie schäpp das ist. Guck mal. Sieht man das? Wie, wie, wie schäpp,"}, {"id": 232, "start": 1494.96, "end": 1504.04, "text": "wie schäpp der ist? Äh. Er soll uns jetzt zwar nicht stören, aber der ist schon echt"}, {"id": 233, "start": 1504.04, "end": 1513.84, "text": "hardcore schäpp. Absicht. Calculated. So, wie kriegt man das jetzt hier fest? Einfach"}, {"id": 234, "start": 1513.84, "end": 1525.08, "text": "so? Ah, exellent. Guck mal, easy. Hm. Wobei, jetzt bin, ich bin ja blöd. Moment mal, Max,"}, {"id": 235, "start": 1525.08, "end": 1529.44, "text": "nein, nicht festdrehen, nicht festdrehen, erstmal, erstmal, erstmal was dranlöten."}, {"id": 236, "start": 1529.44, "end": 1538.52, "text": "So. Also, ich würd sagen, ich mach mal kurz mein Löt, Lötstells an. Nach wie vor immer"}, {"id": 237, "start": 1538.52, "end": 1542.48, "text": "noch die gleiche Lötstation wie immer, ne? Weil ich hier quasi, jedes Mal, wenn wir sowas"}, {"id": 238, "start": 1542.48, "end": 1546.6, "text": "hier im Stream machen, wird gefragt, äh, was ist das für eine Lötstation? Das ist eine,"}, {"id": 239, "start": 1546.6, "end": 1553.12, "text": "man sieht's hier, glaub ich, man sieht's im Stream, ja? Eine, ein Erza Icon Nano. Beste,"}, {"id": 240, "start": 1553.12, "end": 1560.48, "text": "gehört dieser Lötkolben dazu. Mit wechselbarer Spitze. Poggers. So, äh, so während das Ding,"}, {"id": 241, "start": 1560.48, "end": 1571.08, "text": "und ihr seht, wie schnell das heizt, ne? Das ist schon hoch auf 880 Grad. Kein RGB-Lötkolben,"}, {"id": 242, "start": 1571.08, "end": 1578.24, "text": "aber das ist nächstes Projekt. Nicht, nicht spoilern, nicht spoilern. So, also, ich hab"}, {"id": 243, "start": 1578.24, "end": 1583.44, "text": "die Dinger schon mal verwendet, ich weiß, das da ist Ground, und das da ist, äh, ja"}, {"id": 244, "start": 1583.44, "end": 1589.48, "text": "dann mit dem Netzteil 5 Volt. Hier, der kleine in der Mitte ist quasi plus, und das da außen"}, {"id": 245, "start": 1589.48, "end": 1596.28, "text": "ist minus. Dementsprechend werd ich jetzt mal hier irgendwie sowas da dranlöten. So,"}, {"id": 246, "start": 1596.28, "end": 1601.92, "text": "irgendwie so in der Richtung. Und dann mal gucken, was wir damit machen. Wobei, ne, wir"}, {"id": 247, "start": 1601.92, "end": 1609.08, "text": "machen vorher noch mal was anderes. Nico, moin. Ähm, wir machen mal, wir machen mal"}, {"id": 248, "start": 1609.08, "end": 1615.28, "text": "was anderes. Wir gucken erstmal, wie wir das mit den Klemmen machen können. Moment. Ich"}, {"id": 249, "start": 1615.28, "end": 1619.0, "text": "hab jetzt nämlich was gekauft. Extra für den Stream, Leute, hab ich mir das gekauft."}, {"id": 250, "start": 1619.0, "end": 1623.76, "text": "Weil wir das letzte Mal so lang Klemmen gesucht haben, ich hab mir jetzt ein Sortiment gekauft."}, {"id": 251, "start": 1623.76, "end": 1633.36, "text": "Ein Vago-Klemmen-Sortiment. Extra für den Stream. Dass ich immer was am Start hab und"}, {"id": 252, "start": 1633.36, "end": 1637.64, "text": "nicht irgendwie welche Klemmen suchen muss. Guck mal. Wir haben doppelte, also oder einzelne,"}, {"id": 253, "start": 1637.64, "end": 1644.08, "text": "ich weiß nicht wie man das nennt. Wir haben dreifache. Wir haben, äh, und ich glaub wir"}, {"id": 254, "start": 1644.08, "end": 1652.24, "text": "haben fünffache. Die sind echt nice. Ich hab auch noch die alten, die so eierförmig"}, {"id": 255, "start": 1652.24, "end": 1657.84, "text": "sind. Aber die hier sind richtig cool. Einfach hier rein. Und was die auch gut gemacht haben,"}, {"id": 256, "start": 1657.84, "end": 1662.44, "text": "man kann jetzt hier unten rein gucken, wie weit man guckt. Ich weiß nicht, ob ich euch"}, {"id": 257, "start": 1662.44, "end": 1668.64, "text": "das jetzt gezeigt kriege. Aber ich mach mal kurz hier den, ich klapp das mal auf. Na,"}, {"id": 258, "start": 1668.64, "end": 1672.12, "text": "man sieht jetzt hier unten, ich versuch euch das jetzt mal zu zeigen ohne voll, man sieht"}, {"id": 259, "start": 1672.12, "end": 1676.92, "text": "wie weit man das Kabel drin hat. Was ganz praktisch ist, weil in dem Fall, das hier"}, {"id": 260, "start": 1676.92, "end": 1680.56, "text": "ist eigentlich ein Ticken kurz. Jetzt hätte ich noch ein bisschen weiter abisolieren müssen."}, {"id": 261, "start": 1680.56, "end": 1686.72, "text": "Jetzt kann ich gucken, ok, passt. Klaps, Clips, Kabel drinnen. Und das ist wirklich, ihr seht"}, {"id": 262, "start": 1686.72, "end": 1697.08, "text": "ihr, das ist echt fest. Einklemmen, pock, ja. Die sind so weit, ich weiß, also nicht,"}, {"id": 263, "start": 1697.08, "end": 1700.92, "text": "ich glaub wir zweckentfremden die hier gar nicht. Ich glaub diese Sorte Klemmen sind"}, {"id": 264, "start": 1700.92, "end": 1709.32, "text": "geeignet für starre Kabel und für, wie nennt sich das, diese Litzen sind das glaub ich,"}, {"id": 265, "start": 1709.32, "end": 1715.2, "text": "Kabel, wo so ganz viele kleine Kabel, Kupferdrähtchen in einem Kabel drin sind. Ich glaub die darf"}, {"id": 266, "start": 1715.2, "end": 1721.96, "text": "man offiziell für beides verwenden, bis zu, rat mich nicht, hier stehts doch hier neben,"}, {"id": 267, "start": 1721.96, "end": 1741.04, "text": "bis zu einem Durchmesser von 1,6, nee, 1,6 Millimeter, könnte 1,6 Millimeter sein. Also"}, {"id": 268, "start": 1741.04, "end": 1745.52, "text": "das passt hier, was wir hier haben, dafür eignet sich das ganz gut. So, und wir brauchen"}, {"id": 269, "start": 1745.52, "end": 1752.92, "text": "auf jeden Fall keine einzelne Klemme, sondern wir werden wahrscheinlich zwei Dreier brauchen,"}, {"id": 270, "start": 1752.92, "end": 1758.28, "text": "weil, warte mal kurz hier, weil soweit ich mir das überlegt hab, werden wir das folgendermaßen"}, {"id": 271, "start": 1758.28, "end": 1767.2, "text": "machen, machen das Ding hier nei, machen das hier nei, zack, löten hier noch die Kabel"}, {"id": 272, "start": 1767.2, "end": 1776.4, "text": "dran und dann können wir ne Klemme irgendwie jeweils hier und hier hin machen und irgendwie"}, {"id": 273, "start": 1776.4, "end": 1781.12, "text": "dann so in die Mitte, in die Mitte machen wir den Controller, irgendwie, irgendwie so"}, {"id": 274, "start": 1781.12, "end": 1785.36, "text": "in der Richtung. Müssen wir mal gucken, wie das am besten passt. Wir können auch, wir"}, {"id": 275, "start": 1785.36, "end": 1790.04, "text": "können auch den Controller ganz in die Eck hier unten machen, oder passt der so hin?"}, {"id": 276, "start": 1790.04, "end": 1795.0, "text": "Oh, guck mal der passt so hin, nice, nice, nice, nice. Der passt glaub ich genau da in"}, {"id": 277, "start": 1795.0, "end": 1799.44, "text": "die Eck, guck mal da passt genau in die Eck hier der Controller, poggers, da kommt er"}, {"id": 278, "start": 1799.44, "end": 1804.8, "text": "hin, der kommt genau hier in die Eck hin der Controller und der ist sogar richtig fest,"}, {"id": 279, "start": 1804.8, "end": 1810.52, "text": "guck mal, wenn man den da in die Ecke einklemmt, wenn man den in die Ecke einklemmt dann fällt"}, {"id": 280, "start": 1810.52, "end": 1818.32, "text": "er nicht mal raus, den muss ich gar nicht festkleben, der ist einfach so fest. Poggers, ja, so und"}, {"id": 281, "start": 1818.32, "end": 1827.6, "text": "dann können wir die Klemmen später irgendwo, nicht hier so hin machen, guck mal das passt"}, {"id": 282, "start": 1827.6, "end": 1834.0, "text": "auch genau, das ist wie dafür gemacht, das Gehäuse ist wie dafür gemacht und hier machen"}, {"id": 283, "start": 1834.0, "end": 1838.28, "text": "wir, oh ne Moment das ist keine so gute Idee, da muss ich auf jeden Fall noch zwei Schrumpf-Schläuche"}, {"id": 284, "start": 1838.28, "end": 1844.12, "text": "gleich drüber machen, weil ansonsten gibt es hier irgendwann die Kurzschlüsse. Intended"}, {"id": 285, "start": 1844.12, "end": 1849.48, "text": "Design, ah yes, ja genau passt doch wunderbar, also so ungefähr machen wir die Anordnung"}, {"id": 286, "start": 1849.48, "end": 1857.0, "text": "da drin und ich würd sagen von hier machen wir dann quasi so ein, ok das kann ich halbieren,"}, {"id": 287, "start": 1857.0, "end": 1865.48, "text": "die Kabels und da klemmen wir dann die LEDs dran, schauen wir mal, hast mit einer Katze"}, {"id": 288, "start": 1865.48, "end": 1871.48, "text": "gespielt, ja ja, am schlimmsten heute hier, aber hier guck dir das mal an, die Katze wollts"}, {"id": 289, "start": 1871.48, "end": 1884.24, "text": "halt echt wissen, darf man das zeigen, ist das schon, ist das schon zu viel, zu viel für"}, {"id": 290, "start": 1884.24, "end": 1895.0, "text": "Toss am Liege, ja. Mach doch einen zweiten Hohlbuchsenstecker an die LEDs und noch eine"}, {"id": 291, "start": 1895.0, "end": 1898.44, "text": "zweite Buchse an das Gehäuse, ja das hab ich mir auch schon überlegt, das könnte man"}, {"id": 292, "start": 1898.44, "end": 1901.12, "text": "nämlich genau hier machen, da könnte man einen machen und da drüben könnte man einen"}, {"id": 293, "start": 1901.12, "end": 1914.2, "text": "machen, die Sache ist die, erstmal überlegen, geht das, ne das geht nicht, die LEDs brauchen"}, {"id": 294, "start": 1914.2, "end": 1924.04, "text": "drei Kabel, die LEDs brauchen plus minus und data, das geht da drüber nicht, wie wärs"}, {"id": 295, "start": 1924.04, "end": 1930.4, "text": "mal mit nem Langschluss, mit einem was, weiss nicht was ein Langschluss ist, wie gesagt"}, {"id": 296, "start": 1930.4, "end": 1939.96, "text": "ich hab von so Elektro-Kram auch nicht wirklich Ahnung, achso das Gegenteil vom Kurzschluss,"}, {"id": 297, "start": 1939.96, "end": 1944.28, "text": "null, jebaited, ich dachte das wär irgendwie ne, ich hats gerade vom Klemmen, ich hab gedacht"}, {"id": 298, "start": 1944.28, "end": 1948.32, "text": "das wär ne Klemme, wo man besonders langes Kabel reinstecken kann und dann schließen"}, {"id": 299, "start": 1948.32, "end": 1954.28, "text": "oder so, low brain Aktion, hätt ich selbst drauf kommen können, dass das Gegenteil vom"}, {"id": 300, "start": 1954.28, "end": 1965.32, "text": "Kurzschluss ist, jebaited, naja ok, also aber ich muss sagen die Idee find ich gut, weil"}, {"id": 301, "start": 1965.32, "end": 1972.88, "text": "man könnte ohne Probleme auf die andere Seite noch ein Loch machen und dort dann die LEDs,"}, {"id": 302, "start": 1972.88, "end": 1978.16, "text": "das ist eine LED Kabel rausführen, aber wisst ihr was, ich glaube wir werden es heute nicht"}, {"id": 303, "start": 1978.16, "end": 1982.68, "text": "komplett zumachen, weil ich bin mir noch nicht sicher, ob ich die LED Leiste anschließen"}, {"id": 304, "start": 1982.68, "end": 1989.8, "text": "muss an beide Seiten oder ob das bei 50 LEDs an nur einer Seite reicht, also das weiß ich"}, {"id": 305, "start": 1989.8, "end": 1994.88, "text": "noch nicht, das müssen wir dann gleich ausprobieren, deswegen wisst ihr wahrscheinlich, wenn ich"}, {"id": 306, "start": 1994.88, "end": 1998.8, "text": "das jetzt erstmal fertigbaut und ich lass es wahrscheinlich auf, oder wir machen was"}, {"id": 307, "start": 1998.8, "end": 2005.32, "text": "ganz hässliches, ich lass das LED Kabel einfach an einer Ecke rausgucken von der Box, weil"}, {"id": 308, "start": 2005.32, "end": 2008.64, "text": "erst wenn ich am Weihnachtsbaum anschließe und mir das mal in Ruhe angeguckt hab, wie"}, {"id": 309, "start": 2008.64, "end": 2012.96, "text": "das mit der Helligkeit ist und alles, dann weiß ich, oder vor allem dann weiß ich auch"}, {"id": 310, "start": 2012.96, "end": 2019.12, "text": "ob ich die Sache im Kreis lege, sodass ich mit der LED Leiste wieder an der Box rauskomme"}, {"id": 311, "start": 2019.12, "end": 2022.88, "text": "oder ob ich es eher von unten nach oben lege und quasi gar nicht mehr in die Box runter"}, {"id": 312, "start": 2022.88, "end": 2030.72, "text": "komm, muss ich mal gucken wie ich das mach, bin ich mir noch nicht ganz sicher, aber wir"}, {"id": 313, "start": 2030.72, "end": 2035.44, "text": "machen jetzt erstmal den normalen Anschluss, ok lass mal überlegen, womit fangen wir"}, {"id": 314, "start": 2035.44, "end": 2040.32, "text": "am besten an, ich würd sagen ich löte mal hier zwei Kabel dran, den machen wir wieder"}, {"id": 315, "start": 2040.32, "end": 2050.36, "text": "raus, machen wir mal die Klemmen weg, so, also, probieren wir das mal, ich muss mir unbedingt"}, {"id": 316, "start": 2050.36, "end": 2058.88, "text": "gleich noch, ich hol mal meine Schrumpfschläuche kurz, wartet mal, Schrumpfschlauchsohr, Schrumpfchamp,"}, {"id": 317, "start": 2058.88, "end": 2088.8, "text": "Schrumpfchamp auf dem Weg, Schrumpfchamp am Start, alles klar, alles klar, alles klar,"}, {"id": 318, "start": 2088.8, "end": 2101.84, "text": "alles klar, Pock-Schrumpf, Kopfhörer-Leak, OMG, liegt, ist auch so unbekannte was ich"}, {"id": 319, "start": 2101.84, "end": 2108.88, "text": "für Kopfhörer habe, so, by the way die Dinger hab ich mir gekauft, die Polster sehen nicht"}, {"id": 320, "start": 2108.88, "end": 2115.28, "text": "mal allzu gut aus, aber das sind immer noch Biodynamics MMX300 und ohne Mist die Dinger"}, {"id": 321, "start": 2115.28, "end": 2121.76, "text": "sind, ich hab sogar neue Polster hier, die Dinger sind, die hab ich seit acht Jahren"}, {"id": 322, "start": 2121.76, "end": 2127.12, "text": "und das sind die besten Headsets, das beste Headset was es gibt, das war zwar recht teuer"}, {"id": 323, "start": 2127.12, "end": 2134.56, "text": "im Vergleich zu anderen Sachen, aber, also für andere Headsets, aber das war jedes,"}, {"id": 324, "start": 2134.56, "end": 2139.6, "text": "jedes, jeder Cent wert, äh, war früher das Gaming Headset, das ist heute immer noch"}, {"id": 325, "start": 2139.6, "end": 2143.92, "text": "das Gaming Headset, es gibt meiner Meinung nach nichts besseres, so, also eine Runde"}, {"id": 326, "start": 2143.92, "end": 2148.92, "text": "für Schrumpfchamp, was braucht man da so, lasst mal gucken, ich hab jetzt keine Heißluft"}, {"id": 327, "start": 2148.92, "end": 2153.56, "text": "da, wir werden das jetzt auf die ekelige Art machen, mit dem Lötkolben, so, also guck"}, {"id": 328, "start": 2153.56, "end": 2163.84, "text": "mal was, was braucht man da für, für Schrumpfsorgen, ich würd sagen, wenn wir Glück haben, können"}, {"id": 329, "start": 2163.84, "end": 2166.52, "text": "wir einen schwarzen und einen roten nehmen oder vielleicht passen, vielleicht passen"}, {"id": 330, "start": 2166.52, "end": 2171.04, "text": "sogar die kleinen da drüber, guck mal hier, da weiß ich auch gleich sofort was plus und"}, {"id": 331, "start": 2171.04, "end": 2177.88, "text": "minus ist, ha, ha, Postchamp, Postchamp, das geht, jetzt ist nur noch die Frage, ob"}, {"id": 332, "start": 2177.88, "end": 2192.04, "text": "das auch hier drüber geht, geht das hier drüber, äh, ja, ähm, ja, ich würd sagen, kann man"}, {"id": 333, "start": 2192.04, "end": 2202.84, "text": "mit Leben, vergleichbar, wären gute Kopfhörer mit Klinkenanschluss und einem Modmic oder"}, {"id": 334, "start": 2202.84, "end": 2207.96, "text": "sowas, was, einem V-Mod-Boom-Pro, was ist das denn, Moment, das muss ich jetzt mal kurz"}, {"id": 335, "start": 2207.96, "end": 2220.52, "text": "nachgucken, was ist denn ein, ein was, V-Boom, nee, Moment, wat, V-Moda-Boom-Pro, ich kenn"}, {"id": 336, "start": 2220.52, "end": 2230.04, "text": "nur, ich kenn nur das Modmic, aber die Dinger kenn ich noch nicht, was ist das für ein,"}, {"id": 337, "start": 2230.04, "end": 2237.4, "text": "das ist quasi so ne Art Modmic, das ist quasi so ne Art Modmic, nur ne ganze Ecke günstiger"}, {"id": 338, "start": 2237.4, "end": 2243.0, "text": "als das Modmic, weil die Modmic Leute haben bisschen, finde ich, so ihre Kundschaft aus"}, {"id": 339, "start": 2243.0, "end": 2250.88, "text": "den Augen verloren, meiner Meinung nach zumindest, die, ähm, waren mal richtig nice und die"}, {"id": 340, "start": 2250.88, "end": 2256.8, "text": "Dinger sind auch noch richtig nice, aber das Problem ist bei den Modmics, die sind, find"}, {"id": 341, "start": 2256.8, "end": 2264.44, "text": "ich, mittlerweile viel zu teuer, ich mein, 80 Dollar, da wolltest du jetzt mal nett"}, {"id": 342, "start": 2264.44, "end": 2273.04, "text": "übertreiben, oder? So, ok, dann hast du noch das Uni, aber selbst 50, das im Prinzip kannst"}, {"id": 343, "start": 2273.04, "end": 2278.44, "text": "du das in Euro kaufen, ja, ist das, ist das viel zu teuer. Ich hab noch ein paar, ich"}, {"id": 344, "start": 2278.44, "end": 2282.48, "text": "hab noch drei alte Modmics, zwei hab ich mir gekauft, eins haben die mir mal geschickt"}, {"id": 345, "start": 2282.48, "end": 2289.04, "text": "und die sind glaub ich sauer, weil ich das nie gezeigt habe. Ich hab ihm gesagt, oh"}, {"id": 346, "start": 2289.04, "end": 2294.64, "text": "ja, ich würd's gern, der hat mich gefragt, ob ich ein Refuse Sample will und da hab ich"}, {"id": 347, "start": 2294.64, "end": 2297.64, "text": "gesagt, oh ja, nehm ich gerne und dann war er sauer, weil ich nie ein Refuse drüber"}, {"id": 348, "start": 2297.64, "end": 2310.2, "text": "gemacht hab. So, was kostet so ein Modmic Uno? Uni, das war aber noch nichtmal vorsätzlich"}, {"id": 349, "start": 2310.2, "end": 2316.88, "text": "irgendwie, mir hat das nicht gefallen. Guckt euch das mal, das ist viel zu, what the hell,"}, {"id": 350, "start": 2316.88, "end": 2322.48, "text": "so das ist 130, äh, dafür krieg ich ja schon komplett eigenes gutes, halbwegs gutes Mikrofon."}, {"id": 351, "start": 2322.48, "end": 2329.96, "text": "Ja, ne, ne, ne, ne. Also dann muss ich ehrlich sagen, 35 Euro finde ich gerechtfertigt,"}, {"id": 352, "start": 2329.96, "end": 2334.52, "text": "ich hab, ich weiß halt nicht, ob das was taugt, das sieht schon ziemlich nach China, China,"}, {"id": 353, "start": 2334.52, "end": 2340.44, "text": "Plastik Kram aus, aber man weiß ja nie. Die Leute sind auf diesen Fotos immer so extrem"}, {"id": 354, "start": 2340.44, "end": 2345.4, "text": "glücklich, so, yeah, ich hab keine Ahnung, was ich hier mache, aber ich hab nen Controller"}, {"id": 355, "start": 2345.4, "end": 2370.08, "text": "in der Hand und grinse vor mich hin. Naja. Okay, äh, machen wir mal weiter. Ja, also,"}, {"id": 356, "start": 2370.08, "end": 2376.08, "text": "ich muss mich wieder umdrehen, aber, aber, ich hab jetzt übrigens meine ordentliche Abisolierzange"}, {"id": 357, "start": 2376.08, "end": 2386.92, "text": "da, nachdem wir das letzte Mal so rumgekrebst haben. Pass mal auf, der Isolierungschamp ist"}, {"id": 358, "start": 2386.92, "end": 2393.56, "text": "am Start, damit kann man, guck mal hier, der ist richtig poggers, das Ding, damit kann"}, {"id": 359, "start": 2393.56, "end": 2401.16, "text": "man das Kabel hier raus, oder, zack, ich muss jetzt mal gucken, ob man das sieht, ich muss"}, {"id": 360, "start": 2401.16, "end": 2407.44, "text": "mal kurz warten, bis mein Vorschau geladen hat, äh, sieht man nicht richtig so, guck"}, {"id": 361, "start": 2407.44, "end": 2411.44, "text": "mal, man kann es, man macht es hier bis zum Anschlag rein, drückt hier rein und jetzt,"}, {"id": 362, "start": 2411.44, "end": 2420.56, "text": "pass mal auf, zack und komplett perfekt abisoliert, so muss das sein, so muss das sein. Naja,"}, {"id": 363, "start": 2420.56, "end": 2426.68, "text": "die andere Seite übrigens viel zu lang, also, die ist wirklich nice, geht auch vom Preis,"}, {"id": 364, "start": 2426.68, "end": 2434.64, "text": "ich glaub kostet 15 Euro oder so, oder irgendwie sowas in dem Dreh. Super, Super 4 Plus, mal"}, {"id": 365, "start": 2434.64, "end": 2440.84, "text": "gucken, was das Ding kostet jetzt aktuell. Ja, größere Kabel kannst du damit nicht"}, {"id": 366, "start": 2440.84, "end": 2444.12, "text": "machen, das stimmt, also richtig dicke Kabel kannst du damit nicht machen. Gucken, was"}, {"id": 367, "start": 2444.12, "end": 2449.84, "text": "das Ding mittlerweile kostet, ich hab das auch mal in irgendeinem Angebot bekommen, Super"}, {"id": 368, "start": 2449.84, "end": 2458.92, "text": "4, nicht Suda, Super 4 Plus. Ja, guck dir das mal an, da kannst du dich echt nicht beschweren,"}, {"id": 369, "start": 2458.92, "end": 2464.04, "text": "du kriegst das auch noch mit dem, kriegst auch noch den Super Knips, das sieht aus wie"}, {"id": 370, "start": 2464.04, "end": 2468.88, "text": "ein Knipper, ja, ist es auch, kriegst auch die Kombination, den Knipper-Seidenschneider"}, {"id": 371, "start": 2468.88, "end": 2474.68, "text": "und die Abisolierzange, naja, eigentlich gar nicht mal zu übel, also das kann man, das"}, {"id": 372, "start": 2474.68, "end": 2480.84, "text": "ist übrigens, by the way, das ist ein super Weihnachtsgeschenk für jemand, der bastelt"}, {"id": 373, "start": 2480.84, "end": 2493.76, "text": "und sowas noch nicht hat. Das ist wirklich Pock, ja, das Ding ist wirklich gut, die Kombis"}, {"id": 374, "start": 2493.76, "end": 2505.0, "text": "könnte sein lassen, ja, aber ich bin damit echt zufrieden mit diesem Teil. Ja, genau,"}, {"id": 375, "start": 2505.0, "end": 2532.48, "text": "du kannst was drehen, ge. Ups. Einfach mal so, mir war es gerade danach."}, {"id": 376, "start": 2532.48, "end": 2544.08, "text": "Ok, also, dann machen wir das mal weg. So, wie lange brauchen wir die Kabel hier ungefähr?"}, {"id": 377, "start": 2544.08, "end": 2551.04, "text": "Ich würde sagen, wir machen, also wenn wir die Klemmen hier neben hin machen, dann brauchen"}, {"id": 378, "start": 2551.04, "end": 2567.64, "text": "wir, wie so, so, so, nicht so ein Stück, mein, kürzen können wir sie immer noch, wir machen"}, {"id": 379, "start": 2567.64, "end": 2575.28, "text": "jetzt einfach mal hier. Machen wir mal ab, im Zweifel, weil ich habe noch genug am Start,"}, {"id": 380, "start": 2575.28, "end": 2590.8, "text": "so, da müssen wir einmal noch mal den abisoliert Champ rausholen, zack, zack, zack, oh, ups,"}, {"id": 381, "start": 2590.8, "end": 2595.12, "text": "zack, wunderbar, passt, also wirklich, nice, macht richtig Bock, damit Zeug abzuesolieren,"}, {"id": 382, "start": 2595.12, "end": 2601.96, "text": "ich könnte den ganzen Tag, bam, abisolieren. Was wird gebaut? Wir bauen für den Weihnachtsbaum"}, {"id": 383, "start": 2601.96, "end": 2607.72, "text": "eine LED, Steuerung, und das kommt in die Box hier. Aber, das ist nicht so eine Leiste,"}, {"id": 384, "start": 2607.72, "end": 2611.48, "text": "wie das letzte Mal, das ist eine wasserdichte Leiste, und zwar auch, die ganzen LEDs, ich"}, {"id": 385, "start": 2611.48, "end": 2617.2, "text": "habe es hier irgendwo, die ganzen LEDs, warte mal, die ganzen LEDs sind an so einer, an"}, {"id": 386, "start": 2617.2, "end": 2625.6, "text": "so einer, äh, Schnur dran, dass man es besser um den Baum machen kann. Benutze den ESP32,"}, {"id": 387, "start": 2625.6, "end": 2630.48, "text": "ich hatte die ganze Zeit einen ESP32 dafür, aber, der ist zu groß für die Box, die Node"}, {"id": 388, "start": 2630.48, "end": 2634.84, "text": "CU, die ich da habe, und einen Tiny Pico will ich da nicht für opfern, ähm, deswegen"}, {"id": 389, "start": 2634.84, "end": 2640.84, "text": "nehmen wir jetzt hier so ein D1 Mini, der tut es auch. Ok, aber, jetzt löten wir erstmal"}, {"id": 390, "start": 2640.84, "end": 2647.96, "text": "den Krams hier fest, tja. Es stört mich ein bisschen, dass das nicht ganz drum geht,"}, {"id": 391, "start": 2647.96, "end": 2652.88, "text": "das ab, äh, der, der Schrumpfschluch, aber mal ganz im Ernst, das biegt sich im Leben"}, {"id": 392, "start": 2652.88, "end": 2656.12, "text": "hier nicht runter, das können wir eigentlich so lassen. So, und hier machen wir dann den"}, {"id": 393, "start": 2656.12, "end": 2660.52, "text": "drüber, gut, ich glaube das passt. Vielleicht, vielleicht finden wir da auch noch was, was"}, {"id": 394, "start": 2660.52, "end": 2663.92, "text": "ein bisschen, was ein bisschen besser passt, lasst mal kurz reingucken, ob wir noch irgendwas"}, {"id": 395, "start": 2663.92, "end": 2670.76, "text": "haben. Äh, wobei, ganz ehrlich, die schwarzen Schläuche gefallen mir ganz gut, da weiß"}, {"id": 396, "start": 2670.76, "end": 2677.68, "text": "ich gleich, was plus und minus ist. Die grünen werden auch noch ok, mit den roten, die sind"}, {"id": 397, "start": 2677.68, "end": 2689.64, "text": "zu klein. Na, wir bleiben bei dem, das ist ok. Das ist schon ok, machen wir das hier mal"}, {"id": 398, "start": 2689.64, "end": 2697.12, "text": "kurz weg. Also, nehmen wir mal den Löt-Champ, erstmal kurz gucken, dass der wieder hoch"}, {"id": 399, "start": 2697.12, "end": 2700.08, "text": "fährt, ich hab' den ja gefühlt vor einer halben Stunde schon eingeschaltet, aber,"}, {"id": 400, "start": 2700.08, "end": 2704.2, "text": "guck mal, der hat übrigens auch eine automatische Temperatursteuerung, was richtig pock ist,"}, {"id": 401, "start": 2704.2, "end": 2708.0, "text": "wenn er nicht benutzt wird, fährt er sich runter, und wenn man ihn dann wo dran hält,"}, {"id": 402, "start": 2708.0, "end": 2712.2, "text": "irgendwie, sagen wir mal, wenn man ihn hier so wo dran hält, ich glaube das checkt er"}, {"id": 403, "start": 2712.2, "end": 2718.96, "text": "da mit der Zeit, dann sollte er sich eigentlich wieder hochfahren, dachte ich. Dachte er,"}, {"id": 404, "start": 2718.96, "end": 2728.12, "text": "dann soll es sich automatisch wieder hochfahren, macht er nicht. Hm, macht er anscheinend"}, {"id": 405, "start": 2728.12, "end": 2733.96, "text": "nicht, juckt ihn nicht, aber, wir können ja einfach ausschalten und wieder einschalten,"}, {"id": 406, "start": 2733.96, "end": 2738.96, "text": "dann fährt er sich hoch. Dachte ich, der fährt sich automatisch wieder hoch, wenn man irgendwo"}, {"id": 407, "start": 2738.96, "end": 2749.04, "text": "dran geht. So, also, dann würde ich sagen, das da machen wir, geh mal fort, das da plus"}, {"id": 408, "start": 2749.04, "end": 2754.12, "text": "in die Mitte, das einmal Ground oben hin, so, dann werden wir erstmal ein bisschen Löt-Champ"}, {"id": 409, "start": 2754.12, "end": 2761.08, "text": "an die Kabels machen, ich hoffe, ich bin im Bild, wo, äh, was mache ich denn jetzt"}, {"id": 410, "start": 2761.08, "end": 2768.16, "text": "hier, und KS, ja, ist ein bisschen eng, dass das alles in die Kamera passt, deswegen, aber,"}, {"id": 411, "start": 2768.16, "end": 2774.76, "text": "wird schon, wird schon gehen, wird es hier entwirren. Mit dem Kram muss man ein bisschen"}, {"id": 412, "start": 2774.76, "end": 2781.8, "text": "aufpassen, weil das ist heiß, das ist jetzt halt 380 Grad heiß, das ist, im wahrsten Sinne"}, {"id": 413, "start": 2781.8, "end": 2786.92, "text": "des Wortes, Pains-Champ, wenn man das irgendwo hin kriegt. Mal gucken, ob wir das irgendwie..."}, {"id": 414, "start": 2786.92, "end": 2806.76, "text": "Excellent! Stell ich auch noch gleich. Oh, wunderbar. So, und jetzt machen wir hier auch"}, {"id": 415, "start": 2806.76, "end": 2817.48, "text": "noch was dran. So, haben wir hier auch noch was dran. Also, wie stellt man das jetzt hin,"}, {"id": 416, "start": 2817.48, "end": 2828.6, "text": "hier so, hm? So, gut. Hier unten auch noch. Das Problem ist, ich sehe nur die Hälfte,"}, {"id": 417, "start": 2828.6, "end": 2846.16, "text": "weil ich so einen scheiß Winkel hier gerade habe. Auf. Schmelz-Champ. Ah, yes. Okay,"}, {"id": 418, "start": 2846.16, "end": 2850.44, "text": "du brauchst eine dritte Hand, ich habe eine dritte Hand, die ist bloß zu weit weg, die"}, {"id": 419, "start": 2850.44, "end": 2854.36, "text": "hängt hier hinten am Tisch, das kriege ich hier nicht rein. Ich habe eine, ich habe halt"}, {"id": 420, "start": 2854.36, "end": 2858.28, "text": "so eine, die kannst du nebenan Tisch schrauben. Ich bräuchte einen, die ich hier hinstellen"}, {"id": 421, "start": 2858.28, "end": 2868.16, "text": "kann. Hast du den Chat im Blick? Ne, gerade nicht. Habe ich was übersehen? Die Matte,"}, {"id": 422, "start": 2868.16, "end": 2877.48, "text": "das ist irgendeine billige Silikon-Matte von Amazon. Der löht Dampfbeste, ja. Ich sehe,"}, {"id": 423, "start": 2877.48, "end": 2892.04, "text": "da spricht der Kenner. Soll ich mir eine AIO von Arctic holen? Du warst eher der Luftkühl-Fanboy,"}, {"id": 424, "start": 2892.04, "end": 2903.88, "text": "korrekt. Ich bin kein, ich mag keine Wasserkühlung. Aber Knippex ist doch nicht mehr die Qualität"}, {"id": 425, "start": 2903.88, "end": 2908.04, "text": "wie vor 10 Jahren. Keine Ahnung. Also die Zange ist keine Knippex-Zange, sie ist eine"}, {"id": 426, "start": 2908.04, "end": 2911.52, "text": "Yukari. Vielleicht ist das auch Knippex, keine Ahnung, kann sein. Wer weiß denn, wer da"}, {"id": 427, "start": 2911.52, "end": 2916.44, "text": "wem gehört. Aber ich muss ehrlich sagen, also ich habe jetzt, ich habe ein paar Seitenschneider"}, {"id": 428, "start": 2916.44, "end": 2921.48, "text": "von denen, ich habe hier diese, ich habe ein paar Zangen von denen, unter anderem das Teil"}, {"id": 429, "start": 2921.48, "end": 2928.76, "text": "hier. Also ich bin damit ehrlich gesagt ziemlich zufrieden. Was wird gebastelt? LED-Kette für"}, {"id": 430, "start": 2928.76, "end": 2934.56, "text": "den Weihnachtsbaum in die Kiste hier rein. So, jetzt müssen wir, wir müssen erst mal"}, {"id": 431, "start": 2934.56, "end": 2942.72, "text": "ein Stecker, wir sind gerade dabei, den Stecker hier dran zu machen. Hält die Matte auch"}, {"id": 432, "start": 2942.72, "end": 2950.48, "text": "die Temperaturen beim Löten aus? Ja, guck. Juckt ihr nicht. Die mag das vielleicht nicht,"}, {"id": 433, "start": 2950.48, "end": 2954.52, "text": "wenn da eine halbe Stunde der Lötkolb drauf liegt und warm ist, ja. Aber das geht, ist"}, {"id": 434, "start": 2954.52, "end": 2960.72, "text": "kein Problem. Kann man den Lötkolb ein bisschen sauber machen. Sollte man, sollte man nicht"}, {"id": 435, "start": 2960.72, "end": 2965.28, "text": "unbedingt unnötig Plastik verkohlen lassen dran. Ist übrigens auch ein gutes Weihnachtsgeschenk"}, {"id": 436, "start": 2965.28, "end": 2973.44, "text": "für einen, der noch keine hat. Okay, ähm, also wo sind wir jetzt hier? Warte mal, da."}, {"id": 437, "start": 2973.44, "end": 2977.84, "text": "So viel Zeug auf einmal hier rumliegen. Also den da brauchen wir jetzt, den müssen wir"}, {"id": 438, "start": 2977.84, "end": 2981.24, "text": "jetzt, wir machen erst mal, wir machen erst mal, vielleicht soll ich, vielleicht soll"}, {"id": 439, "start": 2981.24, "end": 2985.32, "text": "ich das Gummi mal abmachen, falls das hier zu heiß wird. Das Gummi mag das bestimmt"}, {"id": 440, "start": 2985.32, "end": 2991.16, "text": "nicht, weil das ist so weit unten, dass bis das warm wird. Also dann machen wir das hier"}, {"id": 441, "start": 2991.16, "end": 3014.84, "text": "doch mal dran. Heißchamp? Heizungschamp? Hallo? Please, äh, please, heizwerden? Hallo, was"}, {"id": 442, "start": 3014.84, "end": 3024.72, "text": "ist denn das? So. Naja. Das hat man auch schon schöner gesehen. Mach das noch mal kurz"}, {"id": 443, "start": 3024.72, "end": 3045.68, "text": "ein bisschen gerader. Das Dumme ist, ich seh, ich seh das nicht richtig von hier. Ja, das"}, {"id": 444, "start": 3045.68, "end": 3050.04, "text": "ist gut jetzt. Das ist jetzt so eigentlich ganz gut. Kann man lassen. Was genau pimmst"}, {"id": 445, "start": 3050.04, "end": 3053.68, "text": "du da? Ich mach ne LED Kette, die man um den Weihnachtsbaum machen kann und dann über"}, {"id": 446, "start": 3053.68, "end": 3059.4, "text": "das Smartphone steuern oder über die Heimautomatisierung steuern. So, also der ist ordentlich dran,"}, {"id": 447, "start": 3059.4, "end": 3075.2, "text": "da machen wir den anderen jetzt noch ordentlich dran. Ich hoffe man siehts hier, weil ich"}, {"id": 448, "start": 3075.2, "end": 3086.52, "text": "sehs nicht richtig, das ist mein Problem gerade. Sieht man das hier unten stehen? Ja, ok. So,"}, {"id": 449, "start": 3086.52, "end": 3098.56, "text": "jetzt müssen wir erstmal kurz Heizchampen. Dass es hier reingeht. Ich muss mal ein bisschen"}, {"id": 450, "start": 3098.56, "end": 3116.72, "text": "vor, dass ich selbst was seh. Ah, das ist gut geworden. Das ist gut geworden hier."}, {"id": 451, "start": 3116.72, "end": 3124.0, "text": "Guck mal. Das ist gut geworden. Der ist richtig schön drin und richtig ordentlich fest. Exzellent."}, {"id": 452, "start": 3124.0, "end": 3135.44, "text": "So, jetzt können wir da die Schrumpfschläuche drüber machen. Dann mach die Augen zu. So,"}, {"id": 453, "start": 3135.44, "end": 3146.08, "text": "ähm. Dinge mal drüber und da. Aber das ist doch keine Kette. Alter, was ist das jetzt"}, {"id": 454, "start": 3146.08, "end": 3162.2, "text": "wieder für ein Lowbradejet? Das ist der Stromanschluss. So, guck mal ob der hier passt. Ja, ja, damit"}, {"id": 455, "start": 3162.2, "end": 3167.16, "text": "kann man leben. Guck mal, das kommt im Leben nicht da unten dran. So, normalerweise macht"}, {"id": 456, "start": 3167.16, "end": 3175.88, "text": "man sowas jetzt entweder mit so nem Heißluftgebläse oder man macht das mit nem Feuerzeug, wobei"}, {"id": 457, "start": 3175.88, "end": 3179.44, "text": "das Heißluftgebläse deutlich besser ist, um Schrumpfschläuche zu schrumpfen. Die Sache"}, {"id": 458, "start": 3179.44, "end": 3189.32, "text": "ist nur die. Ich hab kein Bock das jetzt zu holen. Ah, man könnte den auch abschneiden,"}, {"id": 459, "start": 3189.32, "end": 3192.8, "text": "aber das ist egal. So, jetzt wir machen jetzt die Billigvariante. Wir machen jetzt einfach"}, {"id": 460, "start": 3192.8, "end": 3203.72, "text": "mit dem Lötkolben dran und schrumpfen's. Ich glaub das ist so ein How to not. So."}, {"id": 461, "start": 3203.72, "end": 3230.88, "text": "Excellent. Ups, jetzt bin ich irgendwie auf dem Chat geguckt. Aber gehen tut's. Ist eigentlich"}, {"id": 462, "start": 3230.88, "end": 3259.24, "text": "keine allzu gute Idee. Aber ihr seht, das geht. So, so, so, so, so, so, so, so, so, so,"}, {"id": 463, "start": 3259.24, "end": 3289.0, "text": "so. Ich seh, der Chat ist begeistert. So. Mit drei Minuten Arbeit wieder bewegen gespart,"}, {"id": 464, "start": 3289.0, "end": 3298.92, "text": "so sieht's aus. Ich will hier ehrlich gesagt auch im Zimmer mit geschlossenem Zeug alles,"}, {"id": 465, "start": 3298.92, "end": 3316.92, "text": "ich will hier auch kein Heißluftstelz machen. So, ne. Das ist doch jetzt was. Der ist Pepo"}, {"id": 466, "start": 3316.92, "end": 3324.32, "text": "fetter Schlauch. Hier, guckt euch das mal an. So, excellent. Wunderbar. Und jetzt können"}, {"id": 467, "start": 3324.32, "end": 3331.52, "text": "wir das. Wichtig ist, dass es auf deine Art ist. Genau, so sieht's aus. Ne, normalerweise"}, {"id": 468, "start": 3331.52, "end": 3334.48, "text": "mach ich's auch lieber mit Heißluft, aber ich hab jetzt erstens keinen Bock das zu"}, {"id": 469, "start": 3334.48, "end": 3337.88, "text": "holen und zweitens hab ich keinen Bock jetzt irgendwie noch mit Heißluft darum zu hantieren."}, {"id": 470, "start": 3337.88, "end": 3361.24, "text": "Gut. Oh, so richtig fest ist es aber nicht, oder? Ist der etwa zu fett, der Schlauch?"}, {"id": 471, "start": 3361.24, "end": 3375.64, "text": "Ist der etwa zu fett? Aber mit Heißluft geht das schon besser. So, jetzt ist gut. Ah,"}, {"id": 472, "start": 3375.64, "end": 3396.88, "text": "das ist fest. Und der hier ist auch fest? Okay, alles klar. Sehr schön. Der Chat kennt"}, {"id": 473, "start": 3396.88, "end": 3405.72, "text": "sich mit dem fetten Schlauch aus. Excellent. Gut, also, jetzt haben wir den Kram. Jetzt"}, {"id": 474, "start": 3405.72, "end": 3414.24, "text": "können wir mal gucken, ob das hier alles schön passt. Ah, das sieht auch schon mal ganz"}, {"id": 475, "start": 3414.24, "end": 3420.4, "text": "brauchbar aus. Da müssen wir jetzt noch die Mutter drüber machen und dann müsste man"}, {"id": 476, "start": 3420.4, "end": 3433.56, "text": "das eigentlich schön zukriegen. Moment, erst mal ein bisschen. Kurz mal biegen, das ganze,"}, {"id": 477, "start": 3433.56, "end": 3452.04, "text": "das ist ein bisschen lang. So, jetzt. Aha, der ist doch gar nicht so schlecht geworden"}, {"id": 478, "start": 3452.04, "end": 3457.44, "text": "hier. Ist doch gar nicht so übel. Die Kiste hat ein bisschen gelitten, das war aber jetzt"}, {"id": 479, "start": 3457.44, "end": 3464.96, "text": "nicht ich. Seid mal her, können wir das vielleicht noch irgendwie hier so ein bisschen. Äh, passt."}, {"id": 480, "start": 3464.96, "end": 3476.32, "text": "Ist eigentlich ziemlich gut, guck mal, man kann das sogar zumachen vorne. Jetzt bräuchte"}, {"id": 481, "start": 3476.32, "end": 3483.08, "text": "man noch irgendwie so einen kleinen Maul-Schlüssel oder so, den ich jetzt aber auch nicht da"}, {"id": 482, "start": 3483.08, "end": 3502.16, "text": "habe. Ja, jetzt ist wirklich ganz gut fest. Ja, so, excellent, jetzt haben wir das. Jetzt"}, {"id": 483, "start": 3502.16, "end": 3508.84, "text": "müssen wir mal schauen. Müssen wir mal schauen, wie wir das hier drinnen verteilen mit den"}, {"id": 484, "start": 3508.84, "end": 3517.08, "text": "Klemmen. Also, den Controller hatten wir gesagt, den Controller machen wir hier in die Ecke."}, {"id": 485, "start": 3517.08, "end": 3523.2, "text": "Ne, das passt nicht. Den Controller müssen wir da in die Ecke machen. Hier in die Ecke"}, {"id": 486, "start": 3523.2, "end": 3530.04, "text": "kommt der Controller, passt. So, und die Klemmen machen wir auf die Seite, alles klar."}, {"id": 487, "start": 3530.04, "end": 3551.0, "text": "Okay, also, machen wir hier mal den da rein. Mal gucken, wie machen wir das jetzt am besten."}, {"id": 488, "start": 3551.0, "end": 3555.88, "text": "Lass mal kurz schauen. Wie kriegen wir das jetzt am besten hin? So, ich muss das, wenn"}, {"id": 489, "start": 3555.88, "end": 3559.48, "text": "ich das so hintereinander mache, ist Low-Prain. Ich muss das ja später wieder aufkriegen,"}, {"id": 490, "start": 3559.48, "end": 3562.24, "text": "wenn ich noch die zweite Sache dran machen will. Kriegen wir das vielleicht sogar so"}, {"id": 491, "start": 3562.24, "end": 3569.8, "text": "hier rein? Wartet mal. Oh, Big-Prain. Achtung, Achtung, Achtung. Boah, guckt mal. Alter,"}, {"id": 492, "start": 3569.8, "end": 3575.2, "text": "das passt ja wie angegossen, ey. Guckt mal. Lull. Ich muss überhaupt nichts festkleben."}, {"id": 493, "start": 3575.2, "end": 3587.64, "text": "Das passt richtig gut. Wie als wäre es dafür gemacht, ey. So, jetzt kann ich, okay, dann"}, {"id": 494, "start": 3587.64, "end": 3592.4, "text": "mache ich das nämlich so. Dann machen wir das jetzt mal auf. So, machen den hier rein."}, {"id": 495, "start": 3592.4, "end": 3606.12, "text": "Nämlich so. So. Den da machen wir da rein. Der Klemm so. Ups, falsche, falsche Seite."}, {"id": 496, "start": 3606.12, "end": 3618.0, "text": "Moment, äh, warte mal. Soll ich das richtig rummach? Den da? Machen wir mal so. Ja, nice,"}, {"id": 497, "start": 3618.0, "end": 3627.72, "text": "nice, nice. So, und den da? Den machen wir dann anders drum. Bevor ihr irgendwie eine"}, {"id": 498, "start": 3627.72, "end": 3635.32, "text": "Anfälle kriegt, ist eh nur 5 Volt. Also, kann nix großeres passieren. Die Frage ist,"}, {"id": 499, "start": 3635.32, "end": 3639.24, "text": "wie lange hält das Ganze? Das hält. Das hält. Da mache ich mir keine Gedanken, dass das"}, {"id": 500, "start": 3639.24, "end": 3645.12, "text": "nicht hält. Also, das macht recht robusten Eindruck, das ganze Zeug. Und auch hier unten"}, {"id": 501, "start": 3645.12, "end": 3655.32, "text": "das. Das macht, das macht wirklich einen recht robusten Eindruck. Okay, nice. Wartet mal"}, {"id": 502, "start": 3655.32, "end": 3662.88, "text": "kurz. Den flaschen wir jetzt gleich noch. Ey, das passt richtig gut. Guckt mal. Als"}, {"id": 503, "start": 3662.88, "end": 3672.08, "text": "wäre es dafür gemacht, ey. Als wäre es dafür gemacht, passt das. Richtig geil. Gut, das"}, {"id": 504, "start": 3672.08, "end": 3676.2, "text": "fuddeln wir dann später rein, wenn wir die Kiste zumachen. Jetzt müssen wir den irgendwie"}, {"id": 505, "start": 3676.2, "end": 3684.44, "text": "noch ein bisschen, bisschen, bisschen rumbiegen oder so und dann mal gucken. Das ist bestimmt"}, {"id": 506, "start": 3684.44, "end": 3689.16, "text": "besser als manchina Kram, ja. So, jetzt müssen wir den, jetzt müssen wir den flaschen mit"}, {"id": 507, "start": 3689.16, "end": 3695.72, "text": "WLED vor, wisst ihr was das Coole ist? Mit, ähm, vor einer Woche ist eine neue WLED-Version"}, {"id": 508, "start": 3695.72, "end": 3700.36, "text": "rausgekommen. Die können wir uns jetzt gleich noch angucken. Kurz was trinken. Übrigens"}, {"id": 509, "start": 3700.36, "end": 3714.76, "text": "trocknen, trocknen Hals, Gachibas. Ah, exellent. So. Also, jetzt flaschen wir erstmal. Ich"}, {"id": 510, "start": 3714.76, "end": 3720.92, "text": "weiß, ich hatte ein paar kaputte Devon-Mini. Ich hoffe, das ist kein kaputtener. Sonst"}, {"id": 511, "start": 3720.92, "end": 3732.48, "text": "sehen wir einen der anderen. Also. ESP-Tool. Zack. Also. WLED, das ist die Software, die"}, {"id": 512, "start": 3732.48, "end": 3739.76, "text": "wir verwenden für Steuerung von der LED-Schreie. Und da kam vor sieben Tagen, nee vor acht"}, {"id": 513, "start": 3739.76, "end": 3743.56, "text": "Tagen, kam eine neue Version raus. Was ziemlich praktisch ist. Da können wir uns gleich die"}, {"id": 514, "start": 3743.56, "end": 3753.64, "text": "neue Version angucken. So, was brauchen wir für eine Firmware? Der Stream hat heute keine"}, {"id": 515, "start": 3753.64, "end": 3757.0, "text": "Verzögerung. Nee, ich hab das Delay von gestern rausgenommen. Gestern hatte ich ja nur Delay"}, {"id": 516, "start": 3757.0, "end": 3761.88, "text": "wegen Battlefield drin. So, also was für eine Software brauchen wir? Wir haben kein ESP-32,"}, {"id": 517, "start": 3761.88, "end": 3772.6, "text": "wir brauchen auch keinen ESP-32-Bootloader. Wir brauchen die ESP-2866-Bin. Und jetzt guck"}, {"id": 518, "start": 3772.6, "end": 3782.72, "text": "ich mal ganz kurz in den Chat, weil ich hab bestimmt die Hälfte wieder übersehen. BigBrainChampPoggers,"}, {"id": 519, "start": 3782.72, "end": 3791.64, "text": "so sieht's aus. Man schlau... Gut zu wissen, gut zu wissen. Moin, Ice? Nein, Dice eher,"}, {"id": 520, "start": 3791.64, "end": 3801.56, "text": "oder Quice? Man weiß es nicht. Ich glaube, es gab nix. Ich glaube, es gab nix in der"}, {"id": 521, "start": 3801.56, "end": 3811.56, "text": "Zwischenzeit. So, WLED-Release. Ach so, Moment. Doch, mit dem ESP-Tool kann ich das auffleschen,"}, {"id": 522, "start": 3811.56, "end": 3817.56, "text": "klar. Moin, wo kann man denn so ein Gehäuse kaufen? Was für ein Gehäuse? Was meinste"}, {"id": 523, "start": 3817.56, "end": 3825.2, "text": "für ein Gehäuse? Was meinste? Ah, du meinst das hier, du meinst die Box, oder was? Das"}, {"id": 524, "start": 3825.2, "end": 3832.36, "text": "hier? Äh, bei Amazon. Kannste bei Amazon kaufen. Du musst nur gucken, dass du nicht den ESP-Best"}, {"id": 525, "start": 3832.36, "end": 3841.72, "text": "nimmst. Du suchst IP68-Box oder Case oder irgendwie sowas, ja. Ja, und dann scrollst"}, {"id": 526, "start": 3841.72, "end": 3845.88, "text": "du dich immer durch. Sowas hier zum Beispiel. Das ist übrigens zu teuer, ne? Also, manche"}, {"id": 527, "start": 3845.88, "end": 3850.16, "text": "so eine kleine Box 9 Euro, da musst du gucken, dass du da ein bisschen weniger für bezahlst."}, {"id": 528, "start": 3850.16, "end": 3857.32, "text": "Sowas kann man sich auch ganz gut in China bestellen. Guck mal, Aliexpress. Da kannst"}, {"id": 529, "start": 3857.32, "end": 3860.88, "text": "du nämlich in China einfach einen 10er-Pack oder so bestellen, der dann das ganze kostet."}, {"id": 530, "start": 3860.88, "end": 3871.48, "text": "Pff, erstmal Aliexpress-Klo-Papier. Guck mal, IP68-Case. Oh, das sind die ganzen iPhone-Cases."}, {"id": 531, "start": 3871.48, "end": 3889.76, "text": "Ach, was kann ich denn bei Aliexpress suchen? IP68-Case. Tja, also man kann das mit Sicherheit"}, {"id": 532, "start": 3889.76, "end": 3896.48, "text": "günstig kaufen. Ich weiß aber nicht, was ich suchen muss bei Aliexpress. Ja, aber so"}, {"id": 533, "start": 3896.48, "end": 3901.88, "text": "kleine Boxen sind wirklich praktisch. Musst du halt mal gucken, dass es billiger ist, weil"}, {"id": 534, "start": 3901.88, "end": 3907.24, "text": "ich sag mal so. Mehr als maximal 5 Euro pro Box will ich da nicht bezahlen. Ehrlich gesagt"}, {"id": 535, "start": 3907.24, "end": 3916.4, "text": "sollte das eigentlich noch deutlich drunter sein. Also, ein Katzenklo. Guck mal hier, das"}, {"id": 536, "start": 3916.4, "end": 3930.28, "text": "ist auch ziemlich groß. Viel zu teuer alles. Sollte eigentlich free sein, exakt. 7,99 Euro,"}, {"id": 537, "start": 3930.28, "end": 3944.28, "text": "das ist einfach zu teuer. Electronic-Case. Ja, so Dinger hier. Aber ich will das billiger"}, {"id": 538, "start": 3944.28, "end": 3956.44, "text": "haben. Ich glaube, es geht los. Aliexpress, was ist mit euch los? Black-White. Ah, das"}, {"id": 539, "start": 3956.44, "end": 3960.92, "text": "eine hat einen transparenten Deckel und das andere nicht. Versand! Keck weh. Ich glaube,"}, {"id": 540, "start": 3960.92, "end": 3970.04, "text": "es geht los. Ja, das ist halt die typische Aliexpress-Geschichte. Alles klar, Aliexpress,"}, {"id": 541, "start": 3970.04, "end": 3987.28, "text": "alles klar. Sind die noch bei Trost? Ja, so was hier. Da kommen wir doch schon eher in"}, {"id": 542, "start": 3987.28, "end": 4007.2, "text": "die Richtung hier. Das ist 11cm x 6cm x 3cm. Das sind schon eher so eine Sache. Da würde"}, {"id": 543, "start": 4007.2, "end": 4012.92, "text": "ich dann mal ein paar holen. Was ist denn mit dem Shipping hier los? Was ist denn? What"}, {"id": 544, "start": 4012.92, "end": 4026.8, "text": "the fuck? Sag mal. Was ist denn mit Aliexpress gerade los? Cool, wir gucken bei der Konkurrenz."}, {"id": 545, "start": 4026.8, "end": 4038.64, "text": "Wir gucken bei Banggood. Sieht aus wie aus dem 3D-Drucker. Ne. Ey ne, das ist nicht"}, {"id": 546, "start": 4038.64, "end": 4051.16, "text": "aus dem 3D-Drucker. Das ist aus irgendeiner Form. IP. Electronic Case. Wir gucken mal"}, {"id": 547, "start": 4051.16, "end": 4058.48, "text": "bei Banggood. Ja, so was ist doch schon mal besser. Guck mal, es gibt sogar verschiedene"}, {"id": 548, "start": 4058.48, "end": 4077.48, "text": "Größen. Banggood Express. EU-Priority Line. Ja, was? Only One Piece left? Keck. Es ist"}, {"id": 549, "start": 4077.48, "end": 4086.56, "text": "gerade Weihnachten, ne? Das ist jetzt schon wieder zu teuer. UK. Oi, ja. Sind das nicht"}, {"id": 550, "start": 4086.56, "end": 4093.12, "text": "Aufputzgehäuse? Kannste bestimmt für alles Mögliche verwenden, ja. Aber bei den Chinesen"}, {"id": 551, "start": 4093.12, "end": 4101.76, "text": "kann man sowas immer ganz gut abgreifen. Für günstig. Ohne Box hier. So eine Box hier."}, {"id": 552, "start": 4101.76, "end": 4111.28, "text": "Das ist nice. Genau. Und jetzt Priority. EU-Priority Line. Genau. Da würde ich mir jetzt zum Beispiel"}, {"id": 553, "start": 4111.28, "end": 4119.64, "text": "einen 10er-Pack von bestellen. Das sieht 1 zu 1 so aus wie bei Amazon. Ja, fast. Das"}, {"id": 554, "start": 4119.64, "end": 4126.24, "text": "Ding gibt es aber auch bestimmt 1 zu 1 so bei Amazon zu kaufen. Guck mal, sieht fast"}, {"id": 555, "start": 4126.24, "end": 4135.92, "text": "aus wie meins. Da ist sogar so ein Abdichtsschlauch dabei. Guck mal. Null. Oder gleiche Kram."}, {"id": 556, "start": 4135.92, "end": 4141.96, "text": "Ja, da würde ich mir jetzt zum Beispiel so einen 10er-Pack von kaufen. Wenn man viel"}, {"id": 557, "start": 4141.96, "end": 4145.68, "text": "macht, kann man sich noch 20 kaufen, muss man aber nicht übertreiben. Und dann bezahlst"}, {"id": 558, "start": 4145.68, "end": 4154.48, "text": "du am Ende, was hast du hier, 40 Dollar? 45 Dollar bezahlst du. 45 Dollar zu Euro sind"}, {"id": 559, "start": 4154.48, "end": 4164.84, "text": "37 Euro. Du bezahlst 37 Euro für 10 Cases. Das ist okay. Moment, ich muss jetzt nicht"}, {"id": 560, "start": 4164.84, "end": 4170.04, "text": "wirklich... Ich wollte jetzt gerade 37 durch 10 rechnen. Aber egal. Also bezahlst du 3,7..."}, {"id": 561, "start": 4170.04, "end": 4179.28, "text": "Moment. Kann das sein? Ach so Euro. Ja doch. Also bezahlst du 3,7 Euro pro. Und nachdem"}, {"id": 562, "start": 4179.28, "end": 4189.36, "text": "das EU-Priority Line ist, bezahlst du noch nicht mal Zoll. Weil der Trick bei EU-Priority"}, {"id": 563, "start": 4189.36, "end": 4196.72, "text": "Line ist folgender. Entweder kommt das aus dem EU-Warenlager und Waren aus der EU werden"}, {"id": 564, "start": 4196.72, "end": 4202.72, "text": "ja eh nicht verzollt. Also zumindest nicht, wie es mit den Sachen aus China gemacht wird."}, {"id": 565, "start": 4202.72, "end": 4214.0, "text": "Oder die verschicken das über Niederlande, Spanien, Italien oder so. Und dort packen"}, {"id": 566, "start": 4214.0, "end": 4217.72, "text": "sie es dann oder machen sie ein neues Etikett drauf und schicken es weiter. Das geht dann"}, {"id": 567, "start": 4217.72, "end": 4223.36, "text": "aus China nach Spanien und von Spanien zu dir. Dann bezahlst du auch kein Zoll. Doch es"}, {"id": 568, "start": 4223.36, "end": 4227.68, "text": "gibt ab 1.1. neue Zollrichtlinien. Aber das was ich gerade erzählt habe ist schon für"}, {"id": 569, "start": 4227.68, "end": 4232.68, "text": "die neuen Zollrichtlinien. Also es gibt zwei Varianten. Entweder die schicken das schon"}, {"id": 570, "start": 4232.68, "end": 4239.44, "text": "aus der EU los. Die ganzen China-Händler haben... Ich weiß nicht ob es für dieses Cade Sando"}, {"id": 571, "start": 4239.44, "end": 4242.4, "text": "sagt es gibt es im Baumarkt. Kann man sich auch mal... Also ob es sich jetzt in dem"}, {"id": 572, "start": 4242.4, "end": 4251.4, "text": "Baumarkt verlohnt, keine Ahnung. Aber nur mal generell was China Geschichten geht. Das"}, {"id": 573, "start": 4251.4, "end": 4257.16, "text": "gilt nur für Versand aus China nach Deutschland. Also sprich, wenn die das vom EU-Warenlager..."}, {"id": 574, "start": 4257.16, "end": 4266.8, "text": "Was ist das für Musik gerade, Alter? Ah, Poggers. Also sprich, wenn die das aus dem"}, {"id": 575, "start": 4266.8, "end": 4271.32, "text": "EU-Warenlager los schicken und was alle großen China-Shops ja mittlerweile haben. Die haben"}, {"id": 576, "start": 4271.32, "end": 4277.92, "text": "ja alle mittlerweile einen EU-Warenlager oder immer mehr Dinger. Und die großen Versandteile"}, {"id": 577, "start": 4277.92, "end": 4282.24, "text": "bei Aliexpress ja auch mittlerweile. Dann wenn die es aus dem EU-Warenlager los schicken"}, {"id": 578, "start": 4282.24, "end": 4287.96, "text": "ist gar kein Problem. Dann kommt es aus der EU und es kostet kein Zoll. Wenn die das aus"}, {"id": 579, "start": 4287.96, "end": 4293.36, "text": "China los schicken und ihr bestellt das mit Banggood Express oder mit Banggood Express,"}, {"id": 580, "start": 4293.36, "end": 4297.72, "text": "weiß ich nicht. Dann kann es sein, dass es beim Zoll landet, weil die das verschicken"}, {"id": 581, "start": 4297.72, "end": 4304.4, "text": "quasi von China übers Schiff nach Deutschland. Dann könnte es beim Zoll landen. Aber wenn"}, {"id": 582, "start": 4304.4, "end": 4313.36, "text": "EU-Priority Line macht, dann kann es auf jeden Fall nicht beim Zoll landen, weil EU-Priority"}, {"id": 583, "start": 4313.36, "end": 4318.32, "text": "Line geht, Aliexpress macht das über PostNL und über die Niederlande, wahrscheinlich"}, {"id": 584, "start": 4318.32, "end": 4322.96, "text": "kommt das Schiff irgendwie in Rotterdam an oder so. Die China-Händler schicken das dann"}, {"id": 585, "start": 4322.96, "end": 4328.48, "text": "an ein EU-Land, was nicht Deutschland ist und dort kriegt es dann ein neues Etikett"}, {"id": 586, "start": 4328.48, "end": 4333.24, "text": "oder sowas, keine Ahnung, dass es eine Sendung aus Spanien oder Italien ist, was übrigens"}, {"id": 587, "start": 4333.24, "end": 4339.28, "text": "legal ist, muss man dazu sagen. Und euch kann da eh schon mal nichts passieren, wenn schon"}, {"id": 588, "start": 4339.28, "end": 4345.12, "text": "ist der Hersteller dran, aber da kann euch eigentlich nichts passieren. Und dann schicken"}, {"id": 589, "start": 4345.12, "end": 4350.36, "text": "die das quasi aus einem EU-Land, so als Proxy quasi, nach Deutschland und dann müsst ihr"}, {"id": 590, "start": 4350.36, "end": 4356.04, "text": "keinen Zoll bezahlen. Dafür kostet es einen Euro mehr, aber scheiß drauf, dafür landet"}, {"id": 591, "start": 4356.04, "end": 4361.56, "text": "es nicht beim Zoll. Okay, exzellent, ich würde sagen, wir machen weiter, wir sind nicht"}, {"id": 592, "start": 4361.56, "end": 4370.08, "text": "so weit gekommen. Wir wollten das ganze flashen, also, runterladen, habe ich runtergeladen,"}, {"id": 593, "start": 4370.08, "end": 4380.44, "text": "LED, alles klar, Wiki, ESP-Tool, ich muss mal kurz gucken, ob man die, ja Flash, das"}, {"id": 594, "start": 4380.44, "end": 4393.04, "text": "da müssen wir machen, Erase Flash, ich lösche mal kurz meinen Micro-Controller, Erase Flash,"}, {"id": 595, "start": 4393.04, "end": 4399.0, "text": "so, also ich stöpsel mal kurz den hier dran, also ich hab jetzt den hier am Start, den"}, {"id": 596, "start": 4399.0, "end": 4404.36, "text": "stöpsel ich hier übrigens von Eats Delivery, den stöpsel ich jetzt mal an den Rechner"}, {"id": 597, "start": 4404.36, "end": 4424.12, "text": "und dann flashen wir das Teil, exzellent Flash-Action, yes, wenn ich das Kabel dran kriege, so, gut,"}, {"id": 598, "start": 4424.12, "end": 4446.28, "text": "Erase Flash, Ups, ich muss es erstmal in die VM mounten, da, connect, jaja, kann trotz"}, {"id": 599, "start": 4446.28, "end": 4462.12, "text": "hier제, so, dann kann ich mich ganz kurz erzielen, ich mache zu dem Stöpsel die Dek해서 links"}, {"id": 600, "start": 4462.12, "end": 4468.2, "text": "EU länder kommen ich meine dann müssten die da müsste der zoll ja auch also"}, {"id": 601, "start": 4468.2, "end": 4471.68, "text": "erstens müsste der zoll jeden lkw aus spanien kontrollieren wo es probleme"}, {"id": 602, "start": 4471.68, "end": 4475.72, "text": "gibt und ich bin mir auch gar nicht sicher ob das dann legitim ist keine"}, {"id": 603, "start": 4475.72, "end": 4478.0, "text": "ahnung"}, {"id": 604, "start": 4478.64, "end": 4482.28, "text": "wüsste jetzt nicht wie dass man am zoll landen soll sei denn die greifen dass"}, {"id": 605, "start": 4482.28, "end": 4487.84, "text": "ich in spanien irgendwie direkt ab oder so zumal ich auch denke das ist alles"}, {"id": 606, "start": 4487.84, "end": 4490.8, "text": "legal also es ist ja nicht so als macht man da irgendwelche illegalen dinger"}, {"id": 607, "start": 4490.8, "end": 4496.0, "text": "oder so wenn wenn ich in spanien verkacken der land ist beim zoll naja"}, {"id": 608, "start": 4496.0, "end": 4502.6, "text": "dafür bezahlt er dafür bezahlt er ja eu priority leihen dass die das extra"}, {"id": 609, "start": 4502.6, "end": 4506.88, "text": "über spanien schenken oder italien oder so"}, {"id": 610, "start": 4507.2, "end": 4511.72, "text": "das ist ja das ist ja nicht irgendeiner das ist ja eine stelle die das öfters"}, {"id": 611, "start": 4511.72, "end": 4516.04, "text": "macht ja aber letztendlich ist es immer so wenn es an irgendeiner stelle"}, {"id": 612, "start": 4516.04, "end": 4519.64, "text": "verkackt wird da landet es beim zoll aber ich muss euch ehrlich sagen aus china"}, {"id": 613, "start": 4519.64, "end": 4523.6, "text": "ist bisher noch nichts bei mir beim zoll gelandet aus den usa bisher immer die"}, {"id": 614, "start": 4523.6, "end": 4529.2, "text": "können das einfach nicht ok also wir flaschen jetzt"}, {"id": 615, "start": 4530.16, "end": 4537.32, "text": "download wled 11 wird jetzt geflasht"}, {"id": 616, "start": 4537.32, "end": 4551.76, "text": "die ditze ditze ditze ditze ditze ditze ditze ditze ditze ditze ditze ditze ditze"}, {"id": 617, "start": 4551.76, "end": 4565.56, "text": "so wenn das geflasht ist muss ich gucken ob das teil sich als access point"}, {"id": 618, "start": 4565.56, "end": 4575.82, "text": "meldet moin mr sultanois ich gucke jetzt mal auf am tablet ob sich das teil"}, {"id": 619, "start": 4575.82, "end": 4579.04, "text": "meldet als access point da muss ich nämlich mal kurz mein wlan"}, {"id": 620, "start": 4579.04, "end": 4584.08, "text": "passwort eingeben und das mache ich nicht im stream weil es geht euch nichts an"}, {"id": 621, "start": 4584.08, "end": 4597.04, "text": "wie led jawoll schade aber chat aber chat"}, {"id": 622, "start": 4597.04, "end": 4615.36, "text": "so also moment ich muss erst mal gucken was wie led wie led password für den"}, {"id": 623, "start": 4615.36, "end": 4631.44, "text": "für den access point wie led led eins zwei drei vier connect obtaining ip"}, {"id": 624, "start": 4631.44, "end": 4637.84, "text": "signing in jawoll alles klar so jetzt stelle ich mal kurz mein"}, {"id": 625, "start": 4637.84, "end": 4651.16, "text": "wlan an wlan ein wifi settings wifi settings your network der zwischenzeit"}, {"id": 626, "start": 4651.16, "end": 4654.96, "text": "zeige ich euch eine runde fischpilzschirmschoner der kommt immer so"}, {"id": 627, "start": 4654.96, "end": 4671.04, "text": "gut an so passwort muss ich noch eingeben ein passwort mit keqw drinne"}, {"id": 628, "start": 4675.64, "end": 4678.72, "text": "eine passwörter setzen sich ja eben mittlerweile aus irgendeiner kombination"}, {"id": 629, "start": 4678.72, "end": 4689.6, "text": "von 25 stelligen twitch emotes zusammen save and connect ok mal schauen was das"}, {"id": 630, "start": 4689.6, "end": 4693.08, "text": "ding für eine ip bekommt kommen wir mal im router gucken"}, {"id": 631, "start": 4693.08, "end": 4704.96, "text": "da sind wir zack sehr schön"}, {"id": 632, "start": 4708.96, "end": 4715.84, "text": "alles klar set up hat funktioniert liegt 6 69 keine nee meine passwörter sind"}, {"id": 633, "start": 4715.84, "end": 4721.64, "text": "ein bisschen komplizierter leute das können wir vergessen das können wir knicken"}, {"id": 634, "start": 4721.64, "end": 4729.72, "text": "also ich habe eher so was in der richtung von keine ahnung keq wie kappa"}, {"id": 635, "start": 4729.72, "end": 4739.52, "text": "hd kp o poc like this 69 420 kogas ppega so ich habe echt lange passwörter die"}, {"id": 636, "start": 4739.52, "end": 4747.2, "text": "erräts du auch nicht gut also also wir haben hier den controller der controller"}, {"id": 637, "start": 4747.2, "end": 4750.72, "text": "funktioniert jetzt können wir die controller in den in die box einbauen"}, {"id": 638, "start": 4750.72, "end": 4764.96, "text": "also merken wir uns mal 60 112 60 112 unknackbar ja genau hey unknackbar ist"}, {"id": 639, "start": 4764.96, "end": 4772.36, "text": "nix aber es dauert lange außerdem habt ihr jetzt meine ip jetzt"}, {"id": 640, "start": 4772.36, "end": 4778.16, "text": "könnte jetzt könnte e hacker mann machen leute weil wir wissen ja wenn man seine"}, {"id": 641, "start": 4778.16, "end": 4790.12, "text": "ip geliegt hat ist man geliefert ja plus minus ein paar lichtjahre ich muss jetzt"}, {"id": 642, "start": 4790.12, "end": 4795.48, "text": "klugscheißen lichtjahre ist eine entfernung und keine zeit wobei ich ganz"}, {"id": 643, "start": 4795.48, "end": 4802.12, "text": "ehrlich ich sag das auch gerne aus dem markt keiner klugscheißer"}, {"id": 644, "start": 4802.12, "end": 4812.04, "text": "ich sag das auch gerne das hat sich das wusste ich bloß jetzt zwar das wusste"}, {"id": 645, "start": 4812.04, "end": 4813.96, "text": "ich jetzt bloß mal kurz kurz los werden"}, {"id": 646, "start": 4813.96, "end": 4826.96, "text": "ok zack controller am start so jetzt muss ich mal kurz gucken"}, {"id": 647, "start": 4826.96, "end": 4833.52, "text": "hier ist er frisch geflashter gude jetzt muss ich mal kurz pin layout gucken pin"}, {"id": 648, "start": 4833.52, "end": 4842.48, "text": "layout vom esp 23 vorm vorm note mcu nicht note mcu was er die 1 mini pin pin"}, {"id": 649, "start": 4842.48, "end": 4844.68, "text": "out"}, {"id": 650, "start": 4845.16, "end": 4849.24, "text": "wählen ist ein geiles prägen ja gut in dem fall muss ich ehrlich sagen juckt"}, {"id": 651, "start": 4849.24, "end": 4851.6, "text": "mich das nicht es funktioniert so gut ich habe nicht einmal in den source code"}, {"id": 652, "start": 4851.6, "end": 4855.56, "text": "reingeguckt doch bestimmt ich habe einmal in den source code reingeguckt ich"}, {"id": 653, "start": 4855.56, "end": 4861.2, "text": "habe versucht das habe ich versucht genau warum es auf dem tiny picker nicht"}, {"id": 654, "start": 4861.2, "end": 4867.12, "text": "richtig lief und da wollte ich den pin den pin den pin ändern bis ich dann"}, {"id": 655, "start": 4867.12, "end": 4870.08, "text": "drauf gekommen bin das funktioniert doch wenn ich den flash vorher gelöscht"}, {"id": 656, "start": 4870.08, "end": 4879.48, "text": "hätte also wir haben d2 da muss dann später die led leiste dran das weiß ich"}, {"id": 657, "start": 4879.48, "end": 4890.6, "text": "schon und dann haben wir noch 5 volt und ground"}, {"id": 658, "start": 4890.6, "end": 4901.72, "text": "ja gut da machen wir das doch mal 5 volt ground und dann data"}, {"id": 659, "start": 4901.72, "end": 4905.76, "text": "das heißt dann schließen wir doch jetzt mal an das macht dann machen wir das"}, {"id": 660, "start": 4905.76, "end": 4909.24, "text": "doch jetzt mal wir schließen den jetzt an die box an und machen mal das"}, {"id": 661, "start": 4909.24, "end": 4912.68, "text": "netzteil dran und gucken ob der controller startet das können wir doch"}, {"id": 662, "start": 4912.68, "end": 4915.52, "text": "jetzt mal ausprobieren"}, {"id": 663, "start": 4918.36, "end": 4924.36, "text": "was ist wled wled ist eine firmwär das was du hier siehst ist eine firmwär"}, {"id": 664, "start": 4924.36, "end": 4930.4, "text": "für microcontroller und die hat unter anderem halt einen web interface dabei"}, {"id": 665, "start": 4930.4, "end": 4935.68, "text": "wo du dann deine led strips mit steuern kannst also ist eine firmwär für für"}, {"id": 666, "start": 4935.68, "end": 4940.68, "text": "kleine controller für solche dinger hier so was da zum beispiel gibt jede"}, {"id": 667, "start": 4940.68, "end": 4945.2, "text": "menge davon und die bringt unter anderem web interface mit und da drüber kannst"}, {"id": 668, "start": 4945.2, "end": 4948.28, "text": "du dann deine led steuern wir gucken uns gleich die neue version noch an also du"}, {"id": 669, "start": 4948.28, "end": 4954.52, "text": "kannst dann effekte machen du kannst helligkeit einstellen farbe einstellen"}, {"id": 670, "start": 4954.52, "end": 4958.68, "text": "und alles aber ich würde vorschlagen guck einfach weiter zu weil wir gucken"}, {"id": 671, "start": 4958.68, "end": 4965.56, "text": "uns das gleich an so also weiter gehts im text hier so also ich wollte jetzt"}, {"id": 672, "start": 4965.56, "end": 4969.04, "text": "folgendes machen ich wollte jetzt den"}, {"id": 673, "start": 4970.0, "end": 4973.0, "text": "achso"}, {"id": 674, "start": 4973.48, "end": 4978.76, "text": "ja ne das funktioniert ja so nicht braucht man led strip wo ist mein led strip"}, {"id": 675, "start": 4978.76, "end": 4987.68, "text": "hier ah kommste her kommste her led strip da ist der led strip ich muss den led"}, {"id": 676, "start": 4987.68, "end": 4993.64, "text": "strip mal irgendwie so hinlegen dass der jetzt nicht hier so zieht led strip"}, {"id": 677, "start": 4993.64, "end": 4999.84, "text": "komm her kommste vorgas ich stelle einfach mal meine lötstation auf den led strip"}, {"id": 678, "start": 4999.84, "end": 5005.76, "text": "drauf dann kann er nicht mehr rutschen habe ich habe ich umgeschaltet ja ok"}, {"id": 679, "start": 5005.76, "end": 5011.24, "text": "also weil die sache ist die ich habe der aktuellen not mc usb 32 dran der ist"}, {"id": 680, "start": 5011.24, "end": 5018.0, "text": "einfach zu fett hierfür so deswegen machen wir das ab und stöpseln das mal"}, {"id": 681, "start": 5018.0, "end": 5029.52, "text": "an also wir haben plus also sprich 5 volt wir brauchen strom also es ist so was"}, {"id": 682, "start": 5029.52, "end": 5033.24, "text": "man was man bei diesen dingern wissen muss"}, {"id": 683, "start": 5033.56, "end": 5037.36, "text": "die pins haben je nachdem wie man den verwendet ein bisschen unterschiedliche"}, {"id": 684, "start": 5037.36, "end": 5041.44, "text": "funktionen und zwar dieser 5 volt pin hier ich bin nicht ganz sicher ob es"}, {"id": 685, "start": 5041.44, "end": 5045.48, "text": "beim demont mini so ist aber bei den not mcu ist es so ich glaube beim demont"}, {"id": 686, "start": 5045.48, "end": 5052.24, "text": "mini ist es auch so also der 5 volt pin hier unten da der da also der da hier"}, {"id": 687, "start": 5052.24, "end": 5062.4, "text": "oben 5 volt pin wenn man das ding über usb betreibt dann ist das 5 volt out wenn"}, {"id": 688, "start": 5062.4, "end": 5070.48, "text": "man das ding nicht über usb betreibt dann ist es 5 volt im also sprich ich"}, {"id": 689, "start": 5070.48, "end": 5075.92, "text": "versorge jetzt nicht etwa den led strip über den controller ich versorge den"}, {"id": 690, "start": 5075.92, "end": 5079.8, "text": "controller über den led strip"}, {"id": 691, "start": 5080.52, "end": 5087.64, "text": "so ok also 5 volt dann müssen wir hier gucken dass hier das graue ist ground"}, {"id": 692, "start": 5087.64, "end": 5095.12, "text": "gucken wo ist ground und ist da direkt daneben"}, {"id": 693, "start": 5095.12, "end": 5102.36, "text": "jemand 5 volt pin ground excellent sondern haben wir das weiße das weiße"}, {"id": 694, "start": 5102.36, "end": 5110.96, "text": "ist data für den usb für den für den led strip und data muss auf d2 warum muss"}, {"id": 695, "start": 5110.96, "end": 5115.24, "text": "es auf d2 hat keinen tieferen grund es muss auf d2 weil der typ das so"}, {"id": 696, "start": 5115.24, "end": 5122.36, "text": "programmiert hat dass es auf d2 muss hat keinen sinn also es ist halt so"}, {"id": 697, "start": 5122.36, "end": 5127.92, "text": "programmiert dass es auf d2 muss die pinnummerierung ist e fail d2 ist"}, {"id": 698, "start": 5127.92, "end": 5133.92, "text": "eigentlich die arduino nummerierung bei den esp 32 und bei den esp 266 heißen"}, {"id": 699, "start": 5133.92, "end": 5147.24, "text": "Dinge eigentlich gpio 1 2 3 4 5 6 7 8 9 10 bis 65 oder so sind das max eine"}, {"id": 700, "start": 5147.24, "end": 5153.8, "text": "echten hände ne ne das ist 3d model so ok jetzt haben wir das hier dran"}, {"id": 701, "start": 5155.44, "end": 5160.0, "text": "sondern stöpsel ich stöpsel das mal dran wie wir das jetzt gleich verwenden"}, {"id": 702, "start": 5160.0, "end": 5165.0, "text": "ok also der kontrol also ohne ohne einzubauen so der controller ist dran ich"}, {"id": 703, "start": 5165.0, "end": 5171.36, "text": "muss noch mal gucken dass ich richtig habe also 5 volt ground das hier ist 5"}, {"id": 704, "start": 5171.36, "end": 5178.44, "text": "volt jetzt muss ich noch mal kurz gucken ob das hier passt also sprich da ist"}, {"id": 705, "start": 5178.44, "end": 5184.16, "text": "ach du scheiße das erkennt auch keiner das ist 5 volt ok passt gut also das"}, {"id": 706, "start": 5184.16, "end": 5187.88, "text": "habe ich richtig angeschlossen nicht dass ich jetzt monka monka smoke kaputt"}, {"id": 707, "start": 5187.88, "end": 5194.44, "text": "mache so und das hier ist dann was ist wo was also das ist jetzt die 2 die hier"}, {"id": 708, "start": 5194.44, "end": 5203.24, "text": "an strom dran kommt das hier ist 5 volt und das hier ist ok das hier ist"}, {"id": 709, "start": 5203.24, "end": 5214.48, "text": "ground also sprich das da der hier der muss dann hier rein gucken ob ich das"}, {"id": 710, "start": 5214.48, "end": 5221.48, "text": "jetzt hätte ich vielleicht vorher mal aufmachen soll ah gut ich kann es"}, {"id": 711, "start": 5221.48, "end": 5232.0, "text": "eigentlich kann es auch raus machen kiste kommst du her auf zack also was"}, {"id": 712, "start": 5232.0, "end": 5238.16, "text": "habe ich jetzt gesagt ist ground und verwirrt was ist eigentlich für"}, {"id": 713, "start": 5238.16, "end": 5245.4, "text": "bible samt musik die da läuft im hintergrund ground der da"}, {"id": 714, "start": 5245.4, "end": 5250.0, "text": "jetzt gucken dass es auch echt richtig anschließt"}, {"id": 715, "start": 5251.2, "end": 5255.32, "text": "das ist ground alles klar"}, {"id": 716, "start": 5255.64, "end": 5259.4, "text": "das mal kurz hier rein"}, {"id": 717, "start": 5259.4, "end": 5273.8, "text": "passt dran würde ich sagen so und dann haben wir den noch mal kurz raus machen"}, {"id": 718, "start": 5273.8, "end": 5284.12, "text": "den hier dran das muss ja dann plus 5 volt sein hier plus 5 ja"}, {"id": 719, "start": 5284.12, "end": 5296.6, "text": "ubs trotzdem richtig drin alter komm her ich muss gucken ob ich richtig"}, {"id": 720, "start": 5296.6, "end": 5307.8, "text": "reinmach so wunderbar passt ok wir schalten jetzt an wir schalten jetzt an"}, {"id": 721, "start": 5307.8, "end": 5311.36, "text": "und gucken ob es funktioniert jetzt bin ich ja mal gespannt also wir sehen ihr"}, {"id": 722, "start": 5311.36, "end": 5316.08, "text": "seht ihr ein paar leds ihr seht ihr ein paar leds ich habe jetzt alles"}, {"id": 723, "start": 5316.08, "end": 5320.64, "text": "angeschlossen so wieder späterein"}, {"id": 724, "start": 5322.48, "end": 5327.44, "text": "ubs habe ich das aufgemacht irgendwie aus versehen gerade ok ich habe nichts"}, {"id": 725, "start": 5327.44, "end": 5330.8, "text": "gesagt ist rausgegangen"}, {"id": 726, "start": 5335.52, "end": 5340.12, "text": "ja ich habe es vor eben aus versehen aufgemacht glaube ich ok also alles"}, {"id": 727, "start": 5340.12, "end": 5350.2, "text": "angeschlossen plus minus ich hoffe ich smoke nicht monka smoked gut schließe"}, {"id": 728, "start": 5350.2, "end": 5357.52, "text": "mal das netzteil dann gucken ob es ding angeht wo habe ich das netzteil das ding"}, {"id": 729, "start": 5357.52, "end": 5364.56, "text": "ist außerhalb der kamera was ist außerhalb ich so alles da alles da"}, {"id": 730, "start": 5364.56, "end": 5372.6, "text": "nee nee weiß das gar nicht glaubt dass die checkt das nicht das ist glaube ich"}, {"id": 731, "start": 5372.6, "end": 5383.44, "text": "zu zu zu 2020 da nee nee ok also ich mache mal hier netzteil dran netzteil"}, {"id": 732, "start": 5383.44, "end": 5388.6, "text": "wohlgemerkt netzteil ist auf 5 volt eingestellt und jetzt gucken wir mal ob"}, {"id": 733, "start": 5388.6, "end": 5406.0, "text": "es geht ok"}, {"id": 734, "start": 5406.0, "end": 5419.84, "text": "wenn man nicht sicher ob da überhaupt saft auf der steckdose ist stöpsel ich"}, {"id": 735, "start": 5419.84, "end": 5425.52, "text": "jetzt mal kurz lötstation an die steckdose ist gar nicht an keck weh die"}, {"id": 736, "start": 5425.52, "end": 5428.64, "text": "steckdose ist gar nicht an wo ich reingesteckt habe na super"}, {"id": 737, "start": 5428.64, "end": 5438.6, "text": "das ist natürlich big brain ok"}, {"id": 738, "start": 5439.64, "end": 5446.12, "text": "alles klar so jetzt aber jetzt aber jetzt jetzt sollte es funktionieren"}, {"id": 739, "start": 5446.12, "end": 5458.24, "text": "haben wir es richtig angesteckt"}, {"id": 740, "start": 5462.24, "end": 5465.52, "text": "ok das ding blinkt das ding blinkt das schon mal gut"}, {"id": 741, "start": 5465.52, "end": 5478.0, "text": "aber die leds gehen nicht an"}, {"id": 742, "start": 5483.0, "end": 5487.8, "text": "ok gucken wir mal ok aber das wir sollten zumindest aufs web interface kommen jetzt"}, {"id": 743, "start": 5487.8, "end": 5499.24, "text": "also web interface geht ist der data pin nicht am richtigen dran"}, {"id": 744, "start": 5508.2, "end": 5513.44, "text": "moment moment ich glaube ich habe es am falschen pin dran wo an welchen pin muss"}, {"id": 745, "start": 5513.44, "end": 5530.12, "text": "ich es denn machen ich habe es bestimmt am falschen pin pin ah d3 nee moment d4"}, {"id": 746, "start": 5530.12, "end": 5541.52, "text": "an d4 muss es ok esp 32 muss an d4 esp 32 muss an d2 ist am falschen pin dran"}, {"id": 747, "start": 5541.52, "end": 5551.76, "text": "das ist am falschen pin leute gut zack raus pin wir brauchen den weißen ok das"}, {"id": 748, "start": 5551.76, "end": 5556.56, "text": "ist d2 ich muss an d4 das ist natürlich auch nice jetzt weiß ich auch warum das"}, {"id": 749, "start": 5556.56, "end": 5560.8, "text": "auf d4 gemacht hat guckt mal leute der hat das auf d4 gemacht dass du es"}, {"id": 750, "start": 5560.8, "end": 5568.12, "text": "direkt nebeneinander stöpseln kannst ja bei dem esp 32 muss es auch an d2 aber"}, {"id": 751, "start": 5568.12, "end": 5574.52, "text": "beim esp 36 muss an d4 so postchamp leute leute bevor ich das anstecke"}, {"id": 752, "start": 5574.52, "end": 5580.4, "text": "bevor ich das dran stecke wir brauchen mindestens 20 postchamps im chat sonst"}, {"id": 753, "start": 5580.4, "end": 5598.24, "text": "geht es nicht mindestens mindestens 20 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 alles"}, {"id": 754, "start": 5598.24, "end": 5610.52, "text": "geht es aber 16 17 18 19 20 ok also wir haben gepostchamped achtung ha und da ist"}, {"id": 755, "start": 5610.52, "end": 5618.64, "text": "an bäm aber die farben sind falsch oh mist ihr seht nix moment moment ich"}, {"id": 756, "start": 5618.64, "end": 5626.88, "text": "re-create das noch mal ich re-create das noch mal für euch so so achtung und jetzt"}, {"id": 757, "start": 5626.88, "end": 5629.88, "text": "bämm"}, {"id": 758, "start": 5632.76, "end": 5641.64, "text": "was da aber auffällt ist was da aber auffällt ist die farben sind falsch die"}, {"id": 759, "start": 5641.64, "end": 5648.2, "text": "farben sind vertauscht und das liegt glaube ich da dran dass die dinger"}, {"id": 760, "start": 5648.2, "end": 5659.4, "text": "standardmäßig auf ich habe 49 leds dass die dinger standardmäßig auf über den"}, {"id": 761, "start": 5659.4, "end": 5665.28, "text": "limiter machen wir auch raus schaumverbrauche hier dass die dinger"}, {"id": 762, "start": 5665.28, "end": 5671.04, "text": "standardmäßig auf grb stehen und nicht auf rgb wenn man es auf rgb stellt dann"}, {"id": 763, "start": 5671.04, "end": 5679.56, "text": "geht es glaube ich besser ja nice so guckt mal hat der kleine"}, {"id": 764, "start": 5679.56, "end": 5682.8, "text": "controller ein wifi modul ja das ist der einzige grund warum ich die dinger"}, {"id": 765, "start": 5682.8, "end": 5688.12, "text": "verwende weil die on board wifi haben und der esp 32 übrigens noch besser der"}, {"id": 766, "start": 5688.12, "end": 5695.6, "text": "hat sogar noch bluetooth dabei low energy bluetooth massig tpr opens und 2 cp 2"}, {"id": 767, "start": 5695.6, "end": 5700.68, "text": "dual course also nein also 2 cpu course also der esp 32 nicht der da der da das"}, {"id": 768, "start": 5700.68, "end": 5710.84, "text": "ist ein esp 2866 hat ein kern paar cpi opens und aber wifi kannst du das"}, {"id": 769, "start": 5710.84, "end": 5714.44, "text": "auch übers handy steuern klar du kannst die webseite ohne problem auf dem handy"}, {"id": 770, "start": 5714.44, "end": 5718.84, "text": "aufmachen ich werde es in meine heim automatisierung einbinden aber ja du"}, {"id": 771, "start": 5718.84, "end": 5724.16, "text": "kannst die seite auf dem handy aufmachen und direkt so verwenden wie sie ist also"}, {"id": 772, "start": 5724.16, "end": 5729.16, "text": "ich kann es euch übrigens mal zeigen dass das funktioniert also 60 12 2 ich"}, {"id": 773, "start": 5729.16, "end": 5736.76, "text": "war es mal kurz auf dem tablet auf achtung gibt auch eine app braucht man"}, {"id": 774, "start": 5736.76, "end": 5754.28, "text": "nicht auch mal nicht und 2 168 punkt was war es jetzt punkt 60 punkt 1 2 2"}, {"id": 775, "start": 5754.28, "end": 5761.8, "text": "tatsächlich bm was für ein geld wer verwendest du ich benutzt home assistant"}, {"id": 776, "start": 5761.8, "end": 5766.12, "text": "mit unterschiedlichsten sachen dran so guckt"}, {"id": 777, "start": 5767.16, "end": 5772.92, "text": "man sieht das jetzt also hier kannst du dann rumstellen wieder wieder lustig"}, {"id": 778, "start": 5772.92, "end": 5777.56, "text": "bist also kannst jetzt die farbe ändern auch selber blau oder hier wir bleiben"}, {"id": 779, "start": 5777.56, "end": 5787.28, "text": "aber diesem komischen orange du kannst die helligkeit machen zu zählen wir"}, {"id": 780, "start": 5787.28, "end": 5791.72, "text": "gucken uns auch gleich mal den stromverbrauch an machen wir jetzt"}, {"id": 781, "start": 5791.72, "end": 5793.52, "text": "gleich mal machen wir gleich mal hier nebenbei"}, {"id": 782, "start": 5793.52, "end": 5798.2, "text": "gucken wir uns mal die stromverbrauch an gucken wir mal da muss man gucken dass"}, {"id": 783, "start": 5798.2, "end": 5808.84, "text": "ich das hier vielleicht ein bisschen ins bild krieg wach mal den hier aus"}, {"id": 784, "start": 5820.84, "end": 5827.52, "text": "so ok mal gucken da habe ich das jetzt ins bild geschoben bekomme inwieweit"}, {"id": 785, "start": 5827.52, "end": 5832.32, "text": "sieht man das jetzt wartet mal ich muss mal kurz gucken dass man das hier sieht"}, {"id": 786, "start": 5832.32, "end": 5837.8, "text": "das funktioniert nicht da wackelt die"}, {"id": 787, "start": 5843.96, "end": 5849.0, "text": "kurz hier den iphone rausziehen hoffentlich bleibt da bleibt der stream"}, {"id": 788, "start": 5849.0, "end": 5860.12, "text": "dann an also sieht man jetzt was also aktuell aktuell brauche 4 watt"}, {"id": 789, "start": 5861.12, "end": 5865.16, "text": "der ganze strip leuchtet"}, {"id": 790, "start": 5866.36, "end": 5871.2, "text": "so jetzt machen wir mal also ich zeige euch den ganzen strip dann wenn was"}, {"id": 791, "start": 5871.2, "end": 5874.8, "text": "eingebaut haben so jetzt haben wir hier das tablet ich spiegel mich wahrscheinlich"}, {"id": 792, "start": 5874.8, "end": 5883.6, "text": "jetzt wieder irgendwo aber ok so zwar mal laut immer mal helligkeit rauf"}, {"id": 793, "start": 5883.6, "end": 5890.48, "text": "helligkeit man sieht er braucht schon ein bisschen mehr und am meisten braucht"}, {"id": 794, "start": 5890.48, "end": 5901.04, "text": "natürlich wenn man auf weiß schaltet so und da brauchen wir 15 watt 15 watt"}, {"id": 795, "start": 5901.04, "end": 5910.24, "text": "habe ich wieder geliegt ja kann schon sein 15 15 watt braucht er jetzt"}, {"id": 796, "start": 5910.24, "end": 5915.12, "text": "komplett weiß alles wenn man alles auf weiß hat aber die kabel werden jetzt"}, {"id": 797, "start": 5915.12, "end": 5918.2, "text": "nicht warm ich meine die sind auch relativ dick also das passt alles"}, {"id": 798, "start": 5918.2, "end": 5921.12, "text": "und ihr seht wenn man es dann wenn man es auf geld macht ist das ganze schon"}, {"id": 799, "start": 5921.12, "end": 5925.76, "text": "deutlich deutlich weniger liegt aber auch einfach daran weil weiß in dem fall"}, {"id": 800, "start": 5925.76, "end": 5931.52, "text": "bedeutet alle leds die da drin sind volle pulle weil weiß der hat bloß"}, {"id": 801, "start": 5931.52, "end": 5937.24, "text": "drei leds der hat rot-grün-blau und der mischt weiß da draus es gibt led strips"}, {"id": 802, "start": 5937.24, "end": 5941.14, "text": "die haben auch zuletzt nicht weiß das ist ein rgbw die brauchen tatsächlich bei"}, {"id": 803, "start": 5941.14, "end": 5944.04, "text": "weiß nicht so viel"}, {"id": 804, "start": 5945.0, "end": 5954.52, "text": "ne ne also das ding steht auf dem kopp es sind 7,7,4 watt gerade so und wir"}, {"id": 805, "start": 5954.52, "end": 5957.52, "text": "gucken uns den kram gleich an was man alles machen kann wir bauen jetzt erst"}, {"id": 806, "start": 5957.52, "end": 5962.56, "text": "mal das wieder in die box ein mein lieblings effekt bei the way ist"}, {"id": 807, "start": 5962.56, "end": 5969.04, "text": "candle multi das blinkt dann einfach nur so ein bisschen aber jede led für sich"}, {"id": 808, "start": 5969.04, "end": 5973.12, "text": "finde ich eigentlich ganz angenehm guckst du immer bei 5,8 watt also kein"}, {"id": 809, "start": 5973.12, "end": 5981.48, "text": "kein ding gut dann machen wir das tablet wieder weg und stellen wir die steckdose"}, {"id": 810, "start": 5981.48, "end": 5984.48, "text": "wieder in die eck"}, {"id": 811, "start": 5998.76, "end": 6005.16, "text": "aber erstmal wieder ab das lege ich mal da unten hin so dann muss man iphone"}, {"id": 812, "start": 6005.16, "end": 6014.28, "text": "wieder anschließen jetzt leer das wollen wir ja nicht ok sehr gut also da"}, {"id": 813, "start": 6014.28, "end": 6018.88, "text": "haben wir das schließen wir hier gerade mal wieder an dass ich gleich strom"}, {"id": 814, "start": 6018.88, "end": 6023.8, "text": "habe alles klar so und jetzt bauen wir den kram mal in die box ein und da"}, {"id": 815, "start": 6023.8, "end": 6027.28, "text": "gucken wir uns den led strip und die effekte und die neue version mal an was"}, {"id": 816, "start": 6027.28, "end": 6031.48, "text": "das alles ist ok habe ich euch aufs kamerabild"}, {"id": 817, "start": 6031.48, "end": 6036.24, "text": "geschaltet jawoll also ob du ein iphone hast ja habe ich ich habe ganz viele"}, {"id": 818, "start": 6036.24, "end": 6039.88, "text": "unterschiedliche sachen ich habe massig entfacht geräte massig ios geräte ich"}, {"id": 819, "start": 6039.88, "end": 6043.44, "text": "mache da kein unterschied also ich nehme das was ich für die sache jemals am"}, {"id": 820, "start": 6043.44, "end": 6046.12, "text": "besten gucken wir wie gut eigentlich der anschluss hier auch funktioniert sehr"}, {"id": 821, "start": 6046.12, "end": 6052.76, "text": "sehr richtig nice ich pock also dann gucken wir jetzt mal wie wir das hier"}, {"id": 822, "start": 6052.76, "end": 6057.48, "text": "machen mit der mit dem controller wie wir das hier gescheit reinkriegen also"}, {"id": 823, "start": 6057.48, "end": 6060.16, "text": "wo ich mir noch nicht sicher bin und was ich jetzt auch nicht machen werde ist"}, {"id": 824, "start": 6060.16, "end": 6065.16, "text": "eigentlich muss ich noch ein zweites loch ins gehäuse machen damit ich den led"}, {"id": 825, "start": 6065.16, "end": 6070.32, "text": "strip raus bekomme werde ich aber nicht machen weil es kann durchaus sein je"}, {"id": 826, "start": 6070.32, "end": 6073.8, "text": "nachdem wie die wie das mit der helligkeit ist und wie ich die am"}, {"id": 827, "start": 6073.8, "end": 6078.96, "text": "weihnachtsbaum verteile kann das durchaus sein dass sich die das andere"}, {"id": 828, "start": 6078.96, "end": 6083.32, "text": "ende vom led strip hier auch noch anschließen will deswegen werde ich das"}, {"id": 829, "start": 6083.32, "end": 6087.44, "text": "jetzt nicht machen weil je nachdem ob ich das machen will oder nicht"}, {"id": 830, "start": 6087.44, "end": 6092.0, "text": "brauche ich dann unterschiedlich großes loch oder irgendwas also so 100"}, {"id": 831, "start": 6092.0, "end": 6095.6, "text": "prozentig fertig werde ich es nicht machen ich werde jetzt einfach mal das"}, {"id": 832, "start": 6095.6, "end": 6098.12, "text": "hier neben dann rausgucken lassen aber den rest bauen wir jetzt erst mal"}, {"id": 833, "start": 6098.12, "end": 6103.08, "text": "ordentlich ein ich muss das template wieder hinlegen"}, {"id": 834, "start": 6103.32, "end": 6109.36, "text": "dass ich was sehe vom chat jetzt bin ich ja quasi blind und ich darf auf twitch"}, {"id": 835, "start": 6109.36, "end": 6112.4, "text": "nicht mehr sagen blind ist nicht inclusive"}, {"id": 836, "start": 6112.4, "end": 6124.48, "text": "blind playthrough ist weg"}, {"id": 837, "start": 6124.48, "end": 6129.24, "text": "so also jetzt kommen wir aber immer das ganze ja gescheit einbauen zeig mal"}, {"id": 838, "start": 6129.24, "end": 6138.36, "text": "her also ich bin jetzt gerade ein bisschen verwirrt wir haben gesagt"}, {"id": 839, "start": 6138.36, "end": 6151.24, "text": "wir haben gesagt wir machen die ok also die klemmen wollte ich hierhin machen"}, {"id": 840, "start": 6151.24, "end": 6160.36, "text": "habe ich gesagt die klemmen machen wir dahin"}, {"id": 841, "start": 6160.36, "end": 6173.2, "text": "genau da oder wollte ich auf die anderen seite machen"}, {"id": 842, "start": 6173.2, "end": 6178.24, "text": "ne ne ne ne wollte ich nicht das den controller wollte ich dann dahin machen"}, {"id": 843, "start": 6178.24, "end": 6191.08, "text": "na warum passt das jetzt nicht mehr eben ging es doch noch jetzt sehr gut die"}, {"id": 844, "start": 6191.08, "end": 6197.76, "text": "klemmen sind hier dran und den controller wollte ich hier auf die"}, {"id": 845, "start": 6197.76, "end": 6205.96, "text": "andere seite machen quasi irgendwie so ich muss sagen das"}, {"id": 846, "start": 6205.96, "end": 6211.32, "text": "passt wirklich gut bin da ich bin da echt begeistert passen"}, {"id": 847, "start": 6211.32, "end": 6215.72, "text": "mal guck mal sogar die sogar die die kabels hier passen vom controller ist"}, {"id": 848, "start": 6215.72, "end": 6218.84, "text": "eigentlich recht nice dann rollen dann rollen wir das mal"}, {"id": 849, "start": 6218.84, "end": 6224.64, "text": "irgendwie da in die eck irgendwie hier so hin"}, {"id": 850, "start": 6224.64, "end": 6230.6, "text": "nein bleibst du zu wollen wir das hier mal irgendwie in die ecke dass da platz"}, {"id": 851, "start": 6230.6, "end": 6242.44, "text": "ist so gut und es ist drin passt so jetzt müsste ich normalerweise noch"}, {"id": 852, "start": 6242.44, "end": 6245.8, "text": "irgendwie in den zweiten zweites müsste ich wahrscheinlich auf der seite noch"}, {"id": 853, "start": 6245.8, "end": 6251.72, "text": "ein zweites loch rein machen und da kann ich es weiter sind fünf"}, {"id": 854, "start": 6251.72, "end": 6256.72, "text": "volt was soll da großartig passieren und meiner ganz davon abgesehen an sich"}, {"id": 855, "start": 6256.72, "end": 6261.16, "text": "ist das gar nicht mal so schlecht gemacht finde ich so eigentlich muss ich auf die"}, {"id": 856, "start": 6261.16, "end": 6264.92, "text": "seite noch ein loch machen und dann die led sachen rausfüllen wie gesagt das"}, {"id": 857, "start": 6264.92, "end": 6269.92, "text": "lasse ich jetzt erst mal bleiben gucke jetzt erst mal man sieht ja das kabel"}, {"id": 858, "start": 6269.92, "end": 6273.52, "text": "hat auch schon ein bisschen minimal minimal gelitten"}, {"id": 859, "start": 6273.52, "end": 6278.32, "text": "deswegen kann das kabel ruhig noch mal kurz weiter leiden"}, {"id": 860, "start": 6278.32, "end": 6286.84, "text": "aber das hier mal rein jetzt gucke ich mal wie man das hier am besten raus"}, {"id": 861, "start": 6286.84, "end": 6289.16, "text": "kriegt"}, {"id": 862, "start": 6290.32, "end": 6295.08, "text": "ist das mario kart das ist die die gewinnt das ist die win musik aus mario"}, {"id": 863, "start": 6295.08, "end": 6297.2, "text": "kater"}, {"id": 864, "start": 6297.2, "end": 6303.56, "text": "nee ist es nicht"}, {"id": 865, "start": 6303.56, "end": 6310.52, "text": "hätte dieses alter das ist das kabel gedöns piste ich gehe weg"}, {"id": 866, "start": 6310.52, "end": 6316.0, "text": "ist sie rein"}, {"id": 867, "start": 6321.04, "end": 6325.8, "text": "ich will das ich will das an der gleichen stelle machen wo ich schon mal durchs"}, {"id": 868, "start": 6325.8, "end": 6334.92, "text": "gehäuse gefuddelt habe exzellent so wunderbar und dieser kram kann darf auch"}, {"id": 869, "start": 6334.92, "end": 6340.72, "text": "hier so so exzellent so das bleibt nicht so aber ich weiß noch nicht ob ich im"}, {"id": 870, "start": 6340.72, "end": 6345.68, "text": "baum beide kabel oder ein kabel durchmachen will deswegen muss das jetzt"}, {"id": 871, "start": 6345.68, "end": 6351.84, "text": "mal leiden kurz der kann noch ein bisschen darum und der kann auch ein"}, {"id": 872, "start": 6351.84, "end": 6356.6, "text": "bisschen darum und deckel drauf"}, {"id": 873, "start": 6356.6, "end": 6360.24, "text": "ach nee moment so"}, {"id": 874, "start": 6367.28, "end": 6371.8, "text": "rups jetzt habe ich es fertig"}, {"id": 875, "start": 6375.12, "end": 6379.24, "text": "exzellent so das mache ich jetzt nicht richtig zu weil die kabel sind schon"}, {"id": 876, "start": 6379.24, "end": 6383.24, "text": "ein bisschen lidiert aber ich will noch kein zweites loch rein machen weil ich"}, {"id": 877, "start": 6383.24, "end": 6387.32, "text": "noch nicht weiß ob ich beide kabel durchmachen will oder nicht"}, {"id": 878, "start": 6390.24, "end": 6395.64, "text": "kannst du mit dem namen die leds würde ich nicht kaufen das ist ein ws 2811"}, {"id": 879, "start": 6395.64, "end": 6400.44, "text": "strip aber den würde ich nicht mehr kaufen ich würde mir den nachfolger"}, {"id": 880, "start": 6400.44, "end": 6406.52, "text": "kaufen oder noch besser ist eigentlich wenn du den rgbw strip kauf mit rgb leds"}, {"id": 881, "start": 6406.52, "end": 6413.48, "text": "also mit der roten grünen roten blauen grünen led plus weiß aber das ist ein"}, {"id": 882, "start": 6413.48, "end": 6422.48, "text": "ws 2811 gut so das muss jetzt erstmal so bleiben bis ich weiß ob ich beide kabel"}, {"id": 883, "start": 6422.48, "end": 6426.64, "text": "durchmachen will oder nur ein kabel so und jetzt gucken wir uns mal an ob das"}, {"id": 884, "start": 6426.64, "end": 6438.24, "text": "ganze funktioniert wo man das netzteil netzteil dies achtung kommt ob ich"}, {"id": 885, "start": 6438.24, "end": 6446.4, "text": "richtig angeschlossen ab alles beim das ist nicht schick funktioniert sehr gut"}, {"id": 886, "start": 6446.4, "end": 6453.52, "text": "sehr gut exzellent und nu kann ich den kram auch mal wegmachen taugt das i fix"}, {"id": 887, "start": 6453.52, "end": 6459.88, "text": "den werkzeug naja also vieles was dabei ist ist müll ich habe beispielsweise"}, {"id": 888, "start": 6459.88, "end": 6464.0, "text": "diese komische spachtel die dabei ist alle schon verbogen das ding hier ist"}, {"id": 889, "start": 6464.0, "end": 6471.48, "text": "jetzt auch netz der absolute wahnsinn ehrlich gesagt aber und der grund warum"}, {"id": 890, "start": 6471.48, "end": 6478.12, "text": "ich es mir gekauft habe ist folgender weil dort so viele selten oder oder"}, {"id": 891, "start": 6478.12, "end": 6481.72, "text": "sagen wir mal so so viele special bits dabei sind das hier jetzt nicht den"}, {"id": 892, "start": 6481.72, "end": 6487.48, "text": "ganz normaler kreuzschlitz bit aber das der grund warum ich mir gekauft habe und"}, {"id": 893, "start": 6487.48, "end": 6490.28, "text": "für so kleine elektrosachen muss ich euch sagen ist es eigentlich ganz ist es"}, {"id": 894, "start": 6490.28, "end": 6497.6, "text": "eigentlich ganz nice kogas kann der mann hier guckt mal kogas"}, {"id": 895, "start": 6501.96, "end": 6507.6, "text": "man kann also wenn man wenn man das braucht diese kleinen bits dann ist das"}, {"id": 896, "start": 6507.6, "end": 6517.52, "text": "definitiv nice mir persönlich gefällt das wäre elektriker set deutlich besser"}, {"id": 897, "start": 6517.52, "end": 6522.08, "text": "kostet aber auch mehr allerdings dass man wäre elektriker set halt keine"}, {"id": 898, "start": 6522.08, "end": 6526.68, "text": "special bits dabei das ist halt die sache aber und das gute ist das ist auch"}, {"id": 899, "start": 6526.68, "end": 6531.44, "text": "der grund warum ich mir das fixet gekauft habe ich kann ich zeige euch das"}, {"id": 900, "start": 6531.44, "end": 6536.8, "text": "andere gleich mal du kannst mit adapter auch mit den anderen verwenden und dann"}, {"id": 901, "start": 6536.8, "end": 6539.32, "text": "ist wieder nice"}, {"id": 902, "start": 6543.2, "end": 6550.96, "text": "ja so aber hier aus chat was sagt er mal ganz davon abgesehen dass das hier"}, {"id": 903, "start": 6550.96, "end": 6554.48, "text": "natürlich müll ist da muss da muss noch ein zweites loch rein das kann ich jetzt"}, {"id": 904, "start": 6554.48, "end": 6557.68, "text": "aber noch nicht machen ist doch ein ganz gut geworden guck mal wir haben hier"}, {"id": 905, "start": 6557.68, "end": 6562.72, "text": "sogar wir haben sogar so und so nippel für das ding"}, {"id": 906, "start": 6562.72, "end": 6568.72, "text": "zack funktioniert ziemlich gut so dann machen wir mal kurz hier den ganzen kram"}, {"id": 907, "start": 6568.72, "end": 6577.44, "text": "aus dem bild und ein stöpsel stöpsel das lütze nicht in die steckdose das"}, {"id": 908, "start": 6577.44, "end": 6596.4, "text": "wäre ein bisschen blöd hier weg und nun machen wir mal die leds hier hoch auch"}, {"id": 909, "start": 6596.4, "end": 6608.04, "text": "nicht aber weg alles hier alles hier mal kurz weg so und jetzt mal die leds hier"}, {"id": 910, "start": 6608.04, "end": 6612.32, "text": "rauf weil man sieht dass ich schon ein bisschen was das sind ich weiß nicht wie"}, {"id": 911, "start": 6612.32, "end": 6617.04, "text": "viele meter das sind es sind nur 50 stück aber für ein weihnachtsbaum ist"}, {"id": 912, "start": 6617.04, "end": 6620.6, "text": "halt wirklich cool die sache ist nur die ich kann euch die effekte nicht zeigen"}, {"id": 913, "start": 6620.6, "end": 6623.96, "text": "gescheit wenn man das hier so aufeinander liegen hat deswegen müssen"}, {"id": 914, "start": 6623.96, "end": 6629.36, "text": "wir mal gucken dass wir das ein bisschen anders machen und zwar man kann ja den"}, {"id": 915, "start": 6629.36, "end": 6634.4, "text": "led strip künstlich verkürzen in der software also dass wir uns mal ein paar"}, {"id": 916, "start": 6634.4, "end": 6639.72, "text": "effekte angucken können so also mal kurz auf der kamera gucken ob man alles sieht"}, {"id": 917, "start": 6639.72, "end": 6663.44, "text": "jetzt ja zack zack und so ok das passt eigentlich ganz gut und jetzt machen wir"}, {"id": 918, "start": 6663.44, "end": 6667.16, "text": "mal folgendes jetzt gucken wir uns ein paar effekte an ich habe jetzt hier nur"}, {"id": 919, "start": 6667.16, "end": 6674.84, "text": "wie viel sind das 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 sieht man die"}, {"id": 920, "start": 6674.84, "end": 6677.32, "text": "eigentlich alle hier die unten sieht man gar nicht"}, {"id": 921, "start": 6677.32, "end": 6695.16, "text": "so hier genau gut also haben wir hier 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16"}, {"id": 922, "start": 6695.16, "end": 6711.96, "text": "16 16 leds haben wir und jetzt stellen wir mal in der software um also es geht"}, {"id": 923, "start": 6711.96, "end": 6716.56, "text": "jetzt von da nach da jetzt stellen wir mal in der software um dass der nur 16"}, {"id": 924, "start": 6716.56, "end": 6723.84, "text": "stück verwendet kann man nämlich in die config sagt wir haben bloß 16 stück"}, {"id": 925, "start": 6723.84, "end": 6735.12, "text": "safe weg jetzt restarten wir mal weil das manchmal rumspackt und da können wir"}, {"id": 926, "start": 6735.12, "end": 6741.24, "text": "ein bisschen effekte angucken zusammen dazu mache ich mal licht aus"}, {"id": 927, "start": 6741.24, "end": 6744.72, "text": "strom raus strom rein"}, {"id": 928, "start": 6748.0, "end": 6751.64, "text": "ah ne wir haben doch noch ein bisschen mehr also können wir noch zwei stück"}, {"id": 929, "start": 6751.64, "end": 6756.12, "text": "zwei stück kann man auch dabei machen konfig"}, {"id": 930, "start": 6756.88, "end": 6761.08, "text": "hallo konfig"}, {"id": 931, "start": 6761.28, "end": 6768.56, "text": "ob es konfig led preferences 18 tag so als leuchten 18 stück jetzt können wir"}, {"id": 932, "start": 6768.56, "end": 6773.84, "text": "uns ein bisschen effekte angucken benutzt doch einfach segments ja wozu ja hast"}, {"id": 933, "start": 6773.84, "end": 6778.44, "text": "recht könnte man machen so also jetzt machen wir mal licht aus machen"}, {"id": 934, "start": 6778.44, "end": 6783.12, "text": "kurz licht aus weil ich kann es einfach von meiner heim automatisierung machen"}, {"id": 935, "start": 6783.12, "end": 6790.32, "text": "warum sollte ich das no brain dass ich aufstehen muss dafür"}, {"id": 936, "start": 6790.32, "end": 6801.52, "text": "arbeitszimmer licht aus zack licht ist aus und jetzt muss ich noch das licht am"}, {"id": 937, "start": 6801.52, "end": 6807.88, "text": "lötkolben ausschalten hier das ding extra beleuchtung dass man das schön"}, {"id": 938, "start": 6807.88, "end": 6813.96, "text": "sieht alles so gut"}, {"id": 939, "start": 6815.24, "end": 6819.64, "text": "alles da was kann man so ein paar effekte angucken also man sieht die iphone"}, {"id": 940, "start": 6819.64, "end": 6823.32, "text": "kamera ist vielleicht nicht unbedingt die beste dass jetzt als ja doch es ist"}, {"id": 941, "start": 6823.32, "end": 6827.0, "text": "gelb man erkennt das eigentlich ganz gut kann eigentlich ganz gut dass das gelb"}, {"id": 942, "start": 6827.0, "end": 6836.68, "text": "ist ok also chat ich hoffe man siehts hier fast fast postchamp postchamp muss"}, {"id": 943, "start": 6836.68, "end": 6840.64, "text": "den wir das tablet noch reinschieben dass man es noch sieht"}, {"id": 944, "start": 6845.76, "end": 6848.32, "text": "ok wunderbar"}, {"id": 945, "start": 6857.2, "end": 6864.2, "text": "also wunderbar da sind wir ich glaube man sieht soweit man irgendwie was sehen"}, {"id": 946, "start": 6864.2, "end": 6868.96, "text": "kann man sieht das color wheel"}, {"id": 947, "start": 6874.36, "end": 6876.08, "text": "brauche ich mir brauche schon ein bisschen mehr"}, {"id": 948, "start": 6876.08, "end": 6878.84, "text": "wisst ihr was wir können das ja einfach über das tablet drüber legen das"}, {"id": 949, "start": 6878.84, "end": 6884.16, "text": "stört ja nicht macht ja nichts wenn das überm tablet drüber liegt"}, {"id": 950, "start": 6884.16, "end": 6888.08, "text": "doch man sieht es nicht lull na gut also wir machen das anders ich lasse es so"}, {"id": 951, "start": 6888.08, "end": 6892.96, "text": "wir stellen es ein dann halte ich rein dann mache ich wieder raus also mein"}, {"id": 952, "start": 6892.96, "end": 6897.92, "text": "lieblingseffekt wie gesagt wir machen erst mal brightness volle pulle wird es"}, {"id": 953, "start": 6897.92, "end": 6903.36, "text": "bisschen heller kann sein dass man auf der kamera nicht so gut sieht so und"}, {"id": 954, "start": 6903.36, "end": 6908.0, "text": "jetzt können wir zum beispiel sagen effects haben wir gelb wir können einmal"}, {"id": 955, "start": 6908.0, "end": 6912.24, "text": "weiß machen ist jetzt ein bisschen bläulich vor allem auch weil der"}, {"id": 956, "start": 6912.24, "end": 6919.08, "text": "untergrund blau ist und haben wir gelb effekte"}, {"id": 957, "start": 6919.08, "end": 6923.04, "text": "so als haben wir zig dinger hier android kann machen flub flub flub flub flub flub"}, {"id": 958, "start": 6923.04, "end": 6927.9, "text": "flub er läuft halt einmal im kreis geht man jetzt auch ganz gut dass im kreis"}, {"id": 959, "start": 6927.9, "end": 6932.64, "text": "läuft und es läuft im kreis weil ich habe nur 16 16 leds eingestellt das"}, {"id": 960, "start": 6932.64, "end": 6938.84, "text": "heißt das trip ist zwar selbst viel länger aber die logik läuft auf nur 16"}, {"id": 961, "start": 6938.84, "end": 6946.48, "text": "also man kann einstellen wie viel man will so dann gibt es noch andere effekte"}, {"id": 962, "start": 6946.48, "end": 6952.28, "text": "ganz blinken lassen ist bisschen langweilig ehrlich gesagt so dann kann man die kappa pride"}, {"id": 963, "start": 6956.08, "end": 6963.28, "text": "ach so kappa pride blink kann man machen das sei das sei ja auch ganz cool das geht dann"}, {"id": 964, "start": 6963.28, "end": 6970.2, "text": "quasi hin und zurück dann gibt es hierfür epileptische anfälle"}, {"id": 965, "start": 6970.2, "end": 6979.44, "text": "das muss man sagen das sieht bei mir auf dem anderen led strip deutlich besser aus weil"}, {"id": 966, "start": 6979.44, "end": 6984.84, "text": "da hat er hat mehr leds also es funktioniert nicht alle alle effekte auf allen led strips"}, {"id": 967, "start": 6984.84, "end": 6992.16, "text": "gleich gut weil mein anderer led strip da glaube ich 66 leds pro meter der hier ist natürlich viel"}, {"id": 968, "start": 6992.16, "end": 6996.72, "text": "weniger und da sieht man den effekt gar nicht in wirklichkeit läuft jetzt hier langsam so ein"}, {"id": 969, "start": 6996.72, "end": 7003.12, "text": "regenbogen ding durch so candle also multikandel ist eigentlich mein lieblings effekt man sieht"}, {"id": 970, "start": 7003.12, "end": 7008.92, "text": "hier jede einzelne led flackert so ein bisschen wie eine kerze finde ich eigentlich ganz ganz nice"}, {"id": 971, "start": 7013.28, "end": 7018.88, "text": "so dann machen wir mal chase das ist so ein ganz ehrlich ihr müsst mir eigentlich nicht"}, {"id": 972, "start": 7018.88, "end": 7022.08, "text": "dabei zugucken ich mache bloß die effekte ich klick die effekte jetzt einfach mal durch"}, {"id": 973, "start": 7022.08, "end": 7027.48, "text": "und ihr könnt zugucken so chase dann haben wir das ist ehrlich gesagt alles ziemlich"}, {"id": 974, "start": 7027.48, "end": 7035.32, "text": "langweilig da haben wir noch sowas hier das ist wildes geblinke auf der led kelte die zirkus"}, {"id": 975, "start": 7035.32, "end": 7053.72, "text": "variante colorful loop muss man halt ein bisschen gucken was ich auch noch gut finde ist fire"}, {"id": 976, "start": 7053.72, "end": 7064.96, "text": "wow das ist aber 16 leds ziemlich im arsch das funktioniert nicht richtig das sind zu wenig leds"}, {"id": 977, "start": 7064.96, "end": 7069.8, "text": "normalerweise läuft das langsam von hier nach hier ich mache es mal ein bisschen langsamer"}, {"id": 978, "start": 7071.8, "end": 7072.76, "text": "ändert sich nix"}, {"id": 979, "start": 7075.32, "end": 7081.8, "text": "das funktioniert mit wenigen leds nicht mit meinem anderen led strip sieht das richtig cool aus"}, {"id": 980, "start": 7081.8, "end": 7089.56, "text": "fire flicker das ist so ein bisschen wie multikandel ist auch ganz nett am weihnachtsbaum"}, {"id": 981, "start": 7094.36, "end": 7099.64, "text": "also ich habe bei dem anderen habe ich diesen fire effekt drin und das sieht mit 66 leds pro"}, {"id": 982, "start": 7099.64, "end": 7106.76, "text": "meter ziemlich nice aus fireworks ist auch cool funktioniert jetzt halt auf dem mit diesen"}, {"id": 983, "start": 7106.76, "end": 7113.52, "text": "wenigen leds nicht wirklich normalerweise normalerweise macht er jetzt das hier guckt"}, {"id": 984, "start": 7113.52, "end": 7119.2, "text": "mal normalerweise macht er das hier das hier würde er jetzt machen"}, {"id": 985, "start": 7122.92, "end": 7124.2, "text": "wenn man halt mehr leds hätte"}, {"id": 986, "start": 7128.2, "end": 7129.2, "text": "was echt nice ist"}, {"id": 987, "start": 7129.2, "end": 7138.32, "text": "was halt mit 16 leds einfach ein bisschen wenig ist wie gesagt insgesamt hat das"}, {"id": 988, "start": 7138.32, "end": 7142.08, "text": "trip 50 ist glaube ich was weiß ich drei meter oder so für den baum reicht das ja"}, {"id": 989, "start": 7142.08, "end": 7161.16, "text": "noch mehr fireworks muss man halt gucken was funktioniert muss man halt gucken was funktioniert"}, {"id": 990, "start": 7161.16, "end": 7166.48, "text": "mit den restlichen leds die bleiben gerade aus ja ich habe sie nur auf 16 leds eingestellt"}, {"id": 991, "start": 7166.48, "end": 7174.48, "text": "aber jetzt für ein stream ja kannst du kannst damit schon ganz coole sachen machen ich meine"}, {"id": 992, "start": 7174.48, "end": 7179.56, "text": "der effekt sieht so das ist jetzt lighthouse der sieht jetzt hier eigentlich ziemlich nice aus"}, {"id": 993, "start": 7179.56, "end": 7182.4, "text": "der sieht an meinem großen led strip kacke aus"}, {"id": 994, "start": 7187.28, "end": 7193.6, "text": "der macht quasi einmal koggers im kreis jetzt lightning oder es das ist der macht blitze nach"}, {"id": 995, "start": 7193.6, "end": 7205.0, "text": "das ist wirklich epilepsie warnung aber loading meri christmas ja das ist eher kakona christmas"}, {"id": 996, "start": 7208.68, "end": 7212.72, "text": "meteor sieht auf meinem großen strip kacke aus hier geht's eigentlich"}, {"id": 997, "start": 7218.8, "end": 7222.64, "text": "das lightning sinken mit echtem gewitter der witz ist ja dass das tatsächlich geht"}, {"id": 998, "start": 7222.64, "end": 7228.64, "text": "ne übrigens chat chat anzeige ist raus"}, {"id": 999, "start": 7231.56, "end": 7233.88, "text": "polizei steht vor der tür anzeige ist raus"}, {"id": 1000, "start": 7233.88, "end": 7251.04, "text": "oh die musik ist aus hier los aber schnell jetzt"}, {"id": 1001, "start": 7251.04, "end": 7262.64, "text": "popcorn popcorn sieht auf meinem großen strip am fenster auch cool aus"}, {"id": 1002, "start": 7262.64, "end": 7272.32, "text": "sieht ja auch kacke aus kappa pride 2015 warum immer das pride ist auch als regenbogen macht"}, {"id": 1003, "start": 7272.32, "end": 7279.44, "text": "jetzt verstehe ich das regenbogen macht rainbow haben wir auch noch"}, {"id": 1004, "start": 7279.44, "end": 7288.4, "text": "der regenbogen effekt sieht bei dem stick bei dem strip richtig cool aus da sieht auf dem auf dem"}, {"id": 1005, "start": 7288.4, "end": 7297.12, "text": "größeren led strip am fenster zum beispiel kacke aus hier ist der echt cool also wir können uns"}, {"id": 1006, "start": 7297.12, "end": 7305.68, "text": "jetzt nicht alles angucken weil das hat 30 milliarde effekte so und was man dann auch"}, {"id": 1007, "start": 7305.68, "end": 7310.04, "text": "noch machen kann ist folgendes ich schalte mal wieder auf sollet was man hier halt auch"}, {"id": 1008, "start": 7310.04, "end": 7315.44, "text": "noch machen kann oder schalten wahrscheinlich auf candle multi was mir auch noch machen kann"}, {"id": 1009, "start": 7315.44, "end": 7325.04, "text": "man kann ich zeige euch das mal man kann ich habe hier übrigens noch licht an oben fällt mir auf"}, {"id": 1010, "start": 7325.04, "end": 7332.56, "text": "bei der kamera vielleicht soll ich das licht vom vom von der iphone kamera mal aus machen aber das"}, {"id": 1011, "start": 7332.56, "end": 7341.96, "text": "macht nicht wirklich viel aus was ich jetzt an muss muss ich umtisch rumlaufen sonst also was man"}, {"id": 1012, "start": 7341.96, "end": 7345.36, "text": "auch noch machen kann ist also das waren jetzt die ganzen effekte die ich hier gerade also ihr seht das"}, {"id": 1013, "start": 7345.36, "end": 7350.0, "text": "hat wirklich massig effekte ihr könnt noch einstellen wie gesagt helligkeit oben effekt speed"}, {"id": 1014, "start": 7350.0, "end": 7356.0, "text": "effekt intensity und man kann hier unten noch color palette auswählen hat man so sachen wie"}, {"id": 1015, "start": 7356.0, "end": 7366.28, "text": "beispielsweise kann auch ein beach ne beach aber es gibt auch fire dann macht er quasi schon so"}, {"id": 1016, "start": 7366.28, "end": 7378.72, "text": "einen eigenen farb verlaufen das ist auch ganz nice was haben wir hier aurora irgendwie auf"}, {"id": 1017, "start": 7378.72, "end": 7386.16, "text": "nordlicht wer gerne nordlichter haben will aber keine nicht in norwegen ist also man kann wirklich"}, {"id": 1018, "start": 7386.16, "end": 7391.24, "text": "saumäßig vieles zeug machen und man kann einfach hier oben selbst die farben auswählen hier unten"}, {"id": 1019, "start": 7391.24, "end": 7396.52, "text": "ist temperatur und das ist helligkeit hier oben ist auch noch mal helligkeit das im prinzip doppelt"}, {"id": 1020, "start": 7396.52, "end": 7411.68, "text": "aber ich habe ehrlich gesagt meins zum größten teil so eingestellt dass ich mal kurz weiß dass"}, {"id": 1021, "start": 7411.68, "end": 7421.28, "text": "ich irgendwie ungefähr hier so auf gelb oder fack ungefähr hier so auf gelb bin in dem dreh ja so"}, {"id": 1022, "start": 7421.28, "end": 7426.56, "text": "dann habe ich multikernel also genauso wie es jetzt hier ist so habe ich ungefähr dann auch am baum"}, {"id": 1023, "start": 7426.56, "end": 7437.16, "text": "welche platine ein d1 mini so und was auch cool ist man kann auch segments einstellen damit kann"}, {"id": 1024, "start": 7437.16, "end": 7442.24, "text": "man zum beispiel den stick in unterschiedliche abschnitte unterteilen was ganz praktisch ist"}, {"id": 1025, "start": 7442.24, "end": 7448.64, "text": "wenn man beispielsweise die ersten zehn leds auslassen will oder sowas so und mal genau man"}, {"id": 1026, "start": 7448.64, "end": 7455.28, "text": "hat jetzt hier seine seine seine traumeinstellung gemacht geht man hier favorites create preset das"}, {"id": 1027, "start": 7455.28, "end": 7466.64, "text": "jetzt neu und kann den kram speichern und dann ist auch ganz wichtig dann geht man in led preferences"}, {"id": 1028, "start": 7466.64, "end": 7478.68, "text": "stellt noch ein dass man dieses preset automatisch starten will wenn man also jetzt startet dieses"}, {"id": 1029, "start": 7478.68, "end": 7483.92, "text": "preset immer automatisch und ich stelle auch die helligkeit immer komplett auf anschlag und gut"}, {"id": 1030, "start": 7483.92, "end": 7489.84, "text": "ist dann speichern wir das ganze und jetzt zeige ich euch mal was passiert wenn man neu startet"}, {"id": 1031, "start": 7489.84, "end": 7500.48, "text": "dann macht er nämlich die ganzen settings wieder wieder rein achtung netzteil raus netzteil rein"}, {"id": 1032, "start": 7500.48, "end": 7506.48, "text": "und ihr seht zack wieder gleichen settings wie vorher ach ja und wie gesagt ich habe nur 16 leds"}, {"id": 1033, "start": 7506.48, "end": 7518.12, "text": "eingestellt die anderen sind dunkel so sieht es aus chat poggers oder also wenn das mal nicht"}, {"id": 1034, "start": 7518.12, "end": 7527.72, "text": "advanced christmas tree ist dann weiß ich auch nicht dann machen wir der licht an"}, {"id": 1035, "start": 7533.96, "end": 7537.24, "text": "und auch wieder licht hier im zimmer"}, {"id": 1036, "start": 7537.24, "end": 7549.84, "text": "jetzt haben wir der licht an wunderbar ja exzellent so sieht es aus"}, {"id": 1037, "start": 7549.84, "end": 7561.56, "text": "mehr als poggers das ist schon koggers ja finde ich auch welchen durchmesser empfiehlst du für"}, {"id": 1038, "start": 7561.56, "end": 7571.16, "text": "über also welchen durchmesser empfiehlst du für überbrückung was überbrückungskabel so 20"}, {"id": 1039, "start": 7571.16, "end": 7575.64, "text": "zentimeter zwischen ein meter keine ahnung habe ich keine erfahrung mit"}, {"id": 1040, "start": 7575.64, "end": 7591.08, "text": "weiß ich nicht keine ahnung welchen controller verwendest du adem in oder sp sp 266 und um genau"}, {"id": 1041, "start": 7591.08, "end": 7603.2, "text": "zu sein den hier wir haben vorher in der kiste gekramt und haben noch einen gefunden und das"}, {"id": 1042, "start": 7603.2, "end": 7610.76, "text": "schöne ist dass der genau in die box passt guck der passt genau in die box mit allem was man so"}, {"id": 1043, "start": 7610.76, "end": 7618.76, "text": "braucht rein inklusive richtig schau ich das mal an fast schon professionell im anschluss hier"}, {"id": 1044, "start": 7618.76, "end": 7627.36, "text": "das da bleibt übrigens nicht so ja das ist auch nice geworden jetzt ist das sogar wasserdicht"}, {"id": 1045, "start": 7627.36, "end": 7635.76, "text": "ich werde sich unter wasser und das wasser stellen ja man hat sogar man hat sogar den deckel"}, {"id": 1046, "start": 7635.76, "end": 7660.12, "text": "ist das nicht nice so chat da haben wir es würde ich sagen haben wir es geschafft"}, {"id": 1047, "start": 7660.12, "end": 7669.32, "text": "zwei stunden war doch relativ produktiv heute ip 99 ne ip 68 ist das ding ich habe auch noch"}, {"id": 1048, "start": 7669.32, "end": 7673.32, "text": "nicht also eine sache muss man auch machen uns wirklich wasserdicht zu machen bei der"}, {"id": 1049, "start": 7673.32, "end": 7679.12, "text": "box ist so eine so eine dichtungs so dichtungs ding dabei das muss man dann noch in deckel rein"}, {"id": 1050, "start": 7679.12, "end": 7684.96, "text": "machen aber ich muss das ding ja eh noch mal richtig zumachen das ist ja hier gar nicht"}, {"id": 1051, "start": 7684.96, "end": 7690.16, "text": "richtig zuguck den noch auf und ich habe das noch nicht richtig zugemacht weil ich noch nicht genau"}, {"id": 1052, "start": 7690.16, "end": 7697.36, "text": "weiß ob ich das so lasse mit dem kabel oder ob ich das kabel einmal im kreis lege und die"}, {"id": 1053, "start": 7697.36, "end": 7705.44, "text": "anders andere ende auch hier reinmacht ach ja ich wollte euch noch das wäre elektriker set"}, {"id": 1054, "start": 7705.44, "end": 7709.44, "text": "zeigen das machen noch schnell und eigentlich bin ich von wäre gesponsert aber ich müsste"}, {"id": 1055, "start": 7709.44, "end": 7715.08, "text": "eigentlich mittlerweile schon gesponsert werden ich hole es mal schnell also wenn man ein bisschen"}, {"id": 1056, "start": 7715.08, "end": 7721.44, "text": "kohle locker hat ich finde es deutlich angenehm es kann man mit dem iphone set gar nicht vergleichen"}, {"id": 1057, "start": 7721.44, "end": 7725.92, "text": "ja aber nur weil eben die frage kam von der bedienung her und von der von der haptik finde"}, {"id": 1058, "start": 7725.92, "end": 7729.68, "text": "ich deutlich angenehmer als das iphone set das iphone set habe ich mir nur gekauft weil so viele"}, {"id": 1059, "start": 7729.68, "end": 7746.76, "text": "bits dabei sind so aber ich ich hole es mal kurz"}, {"id": 1060, "start": 7759.68, "end": 7780.68, "text": "kann eine link zum controller posten suche einfach wemus d1 mini und dank also ja ich"}, {"id": 1061, "start": 7780.68, "end": 7789.38, "text": "zeige dir bei amazon ich zeige dir bei amazon aber wenn du es nicht schnell brauchst dann"}, {"id": 1062, "start": 7789.38, "end": 7795.84, "text": "würde ich nicht bei amazon bestellen aber es kostet guck mal hier kannst du auch bei amazon"}, {"id": 1063, "start": 7795.84, "end": 7806.64, "text": "bestellen drei stück für 12 euro nein ich habe kein sp 32 sp 26 den ich habe die gibt es auch"}, {"id": 1064, "start": 7806.64, "end": 7812.64, "text": "als sp 32 aber ich habe den sp 26 hat den vorteil ist billiger und reicht für led streuung voll und"}, {"id": 1065, "start": 7812.64, "end": 7820.24, "text": "ganz aus also gibt es eigentlich keine vorteile den anderen zu nehmen den da und du kannst 12"}, {"id": 1066, "start": 7820.24, "end": 7830.2, "text": "euro 12 euro drei stück ist vollkommen in ordnung kann man machen und ich ganz eher ich kann dir"}, {"id": 1067, "start": 7830.2, "end": 7836.72, "text": "auch nur empfehlen nehmen wirklich das dreier pack oder vielleicht sogar das fünfer pack weil"}, {"id": 1068, "start": 7836.72, "end": 7841.2, "text": "ich würde wahrscheinlich das fünfer pack nehmen erstens wenn man einmal damit angefangen hat zu"}, {"id": 1069, "start": 7841.2, "end": 7846.08, "text": "basteln hört man immer auf und zweitens man macht auch schon ab und zu mal was kaputt und wenn man"}, {"id": 1070, "start": 7846.08, "end": 7856.36, "text": "fünf stück hat ich mache 16 euro man schenkt oder also schadet auf jeden fall nicht ich war"}, {"id": 1071, "start": 7856.36, "end": 7864.36, "text": "vorhin auch froh dass ich noch welche habe so ich war mal kurz die leds weg die man mal raus"}, {"id": 1072, "start": 7864.36, "end": 7873.84, "text": "also wenn wir jetzt mal bei dem thema sind was solche solche werkzeug setz hier angeht also"}, {"id": 1073, "start": 7873.84, "end": 7883.08, "text": "dieses fixe ding das haben wir relativ viele und das ist ok aber ich muss halt ehrlich sagen das"}, {"id": 1074, "start": 7883.08, "end": 7890.04, "text": "einzige wofür sich das lohnt sind die ganzen bits die man zum reparieren braucht für den rest ist"}, {"id": 1075, "start": 7890.04, "end": 7897.24, "text": "das eigentlich total unsinnig also dieses zeugs hier ist wirklich billig billig krepp guckt euch"}, {"id": 1076, "start": 7897.24, "end": 7903.04, "text": "guckt euch das mal an ok ich habe es wieder gerade gebogen die habe ich das letzte mal"}, {"id": 1077, "start": 7903.04, "end": 7908.64, "text": "komplett verbogen also das ist wirklich billiger schiena krepp da also deswegen deswegen mit"}, {"id": 1078, "start": 7908.64, "end": 7913.2, "text": "schinkram nicht kaufen ja ihr habt noch so ein e wie heißt das so ein armband und elektrostatik"}, {"id": 1079, "start": 7913.2, "end": 7920.64, "text": "armband also braucht ja ja offiziell wenn du die leute fragst natürlich ziehen sie sich das immer"}, {"id": 1080, "start": 7920.64, "end": 7927.6, "text": "an aber ich weiß nicht wie es bei euch aussieht ich ziehe es doch schon relativ selten an es die"}, {"id": 1081, "start": 7927.6, "end": 7939.6, "text": "armbänder so welche habe ich hier gut bei so welche habe ich hier so welche habe ich da genau"}, {"id": 1082, "start": 7939.6, "end": 7946.44, "text": "die du geschickt hast so also dafür muss man sich den kram nicht holen das einzige was man"}, {"id": 1083, "start": 7946.44, "end": 7953.72, "text": "wofür man sich dieses effekte ding holen kann ist das hier und zwar die die sammlung an bits"}, {"id": 1084, "start": 7953.72, "end": 7958.8, "text": "und zwar nicht für die meist die meisten bits also hier diese normaler kreuzschnitt"}, {"id": 1085, "start": 7958.8, "end": 7964.44, "text": "bitt braucht keiner hier fehlt einer habe ich irgendwo irgendwo hier rumliegen aber auch ein"}, {"id": 1086, "start": 7964.44, "end": 7971.28, "text": "normaler oh nee wo ist mein bitt hin das ist so ein dreieckiger bitt den brauche ich immer wieder"}, {"id": 1087, "start": 7971.28, "end": 7980.88, "text": "wo habe ich den hingeschmissen nein f den brauche ich den muss ich unbedingt wieder finden der da"}, {"id": 1088, "start": 7980.88, "end": 7986.4, "text": "fehlt ist einer der wichtigsten bits überhaupt ist und dreieckiger nee nicht im schraubendreher"}, {"id": 1089, "start": 7986.4, "end": 7992.36, "text": "schraubendreher ist der kreuzschnitt bitt oder die guck hier hier der kreuzschnitt bitt ist der"}, {"id": 1090, "start": 7992.36, "end": 8005.24, "text": "hier der hat die bei drin der hier unten wo habe ich den monka bitt wo ist er ist er hier"}, {"id": 1091, "start": 8005.24, "end": 8023.12, "text": "irgendwo scheiße ich hoffe ich habe es nicht verloren f f in den chat für den bitt fuck"}, {"id": 1092, "start": 8023.12, "end": 8034.4, "text": "das wirklich doof zwar eigentlich eines der wichtigsten bits überhaupt da drin ich suche"}, {"id": 1093, "start": 8034.4, "end": 8044.2, "text": "hier gerade habe ich den irgendwo am schreibtisch liegen oder so ok muss ich später mal gucken also"}, {"id": 1094, "start": 8044.2, "end": 8052.12, "text": "das wäre nicht das wäre das i fix jetzt lohnt sich halt wenn man so sachen braucht wie zum"}, {"id": 1095, "start": 8052.12, "end": 8059.48, "text": "beispiel so was da das hat ja normalerweise keiner oder eben hier so was so was dreieckiges damit"}, {"id": 1096, "start": 8059.48, "end": 8066.32, "text": "machen die chinesen ganz gerne mal die steckdosen zu dass man sie nicht aufbekommt ist halt auch"}, {"id": 1097, "start": 8066.32, "end": 8075.56, "text": "praktisch hat man normalerweise nicht woanders jetzt hier oder irgendwelche so dinger da hat"}, {"id": 1098, "start": 8075.56, "end": 8085.88, "text": "man sonst auch nicht dafür ist das i fixet ganz praktisch ansonsten sind die dinger jetzt nicht"}, {"id": 1099, "start": 8085.88, "end": 8092.8, "text": "so extrem dolle quali ja auch das ding hier ehrlich gesagt nicht das ist ganz nice aber"}, {"id": 1100, "start": 8092.8, "end": 8101.0, "text": "preisleistung ist wirklich ok aber mein favorit ist es ehrlich gesagt nicht was ganz nützlich"}, {"id": 1101, "start": 8101.0, "end": 8108.56, "text": "ist ist adapter dabei dass man dass man die bits von hier zum beispiel diesen komischen bit in"}, {"id": 1102, "start": 8108.56, "end": 8112.04, "text": "anderen sachen verwenden kann man sieht schon es passt schon teilweise gar nicht richtig und so"}, {"id": 1103, "start": 8112.04, "end": 8125.92, "text": "aber da ist eine feder drin ja also dafür ist es gut für solche seltenen rare bits ist auch was"}, {"id": 1104, "start": 8125.92, "end": 8131.04, "text": "für simkarten austausch drinnen so ganz praktisch aber wie gesagt mein favorit ist es nicht für so"}, {"id": 1105, "start": 8131.04, "end": 8137.68, "text": "normales zeugs wenn man so ein bisschen bastel kram macht was ich echt gutes set finde ist und"}, {"id": 1106, "start": 8137.68, "end": 8141.6, "text": "nein ich bin nicht gesponsert aber die sollten mir langsam mal geld geben für was ich echt"}, {"id": 1107, "start": 8141.6, "end": 8150.36, "text": "gutes set finde ist das vera elektriker set was ich ganz gut finde aber muss sagen da liegen"}, {"id": 1108, "start": 8150.36, "end": 8155.92, "text": "jetzt auch wirklich da liegen wirklich massig massig preis dazwischen ja also wahrscheinlich"}, {"id": 1109, "start": 8155.92, "end": 8161.04, "text": "50 euro mindestens wenn ich noch mehr müssen wir gleich mal gucken auf amazon also muss man"}, {"id": 1110, "start": 8161.04, "end": 8170.32, "text": "sagen für preisleistungsmäßig ist das i fixet ding gar nicht gar nicht schlecht ja so also so"}, {"id": 1111, "start": 8170.32, "end": 8173.92, "text": "jetzt gucken wir uns das vera ding an das erste was uns schon mal auffällt ist eine richtig nice"}, {"id": 1112, "start": 8173.92, "end": 8180.4, "text": "tasche richtig nice tasche sieht man auch gleich vorne was drinne ist ehrlich gesagt sehe ich"}, {"id": 1113, "start": 8180.4, "end": 8187.04, "text": "nicht was drin ist eine spülmaschine ist angeblich drin ok also richtig nice tasche hier man sieht"}, {"id": 1114, "start": 8187.04, "end": 8191.6, "text": "schon das geht auch nicht einfach mal so auf also da muss man schon ein bisschen dran ziehen so und"}, {"id": 1115, "start": 8191.6, "end": 8197.68, "text": "da hat man jetzt drinne das ist mein persönliches favorite wenn man einfach irgendwie was für ein"}, {"id": 1116, "start": 8197.68, "end": 8203.96, "text": "bisschen elektrobastel geschichten braucht da ist das schon nice der tool check ist auch powergas"}, {"id": 1117, "start": 8203.96, "end": 8209.92, "text": "in kombination dazu passt der tool check der tool check ist optimale ergänzung dazu also was hat"}, {"id": 1118, "start": 8209.92, "end": 8215.0, "text": "man hier am start man hat einmal einen phasenprüfer den ich glaube ich hier noch nicht einmal verwendet"}, {"id": 1119, "start": 8215.0, "end": 8221.24, "text": "hat von deswegen ist auch immer noch das ding dran man hat so die üblichen gängige nüsse am start"}, {"id": 1120, "start": 8221.24, "end": 8228.48, "text": "und wobei das für elektrobastel ein ganz gutes man hat halt hier so nen so nen so nen vera griff"}, {"id": 1121, "start": 8228.48, "end": 8234.48, "text": "so nen kraftform griff wie das bei denen heißt und da kann man hier die ganzen dinger rein machen"}, {"id": 1122, "start": 8234.48, "end": 8239.6, "text": "so wenn ich jetzt beispielsweise ok ich brauche jetzt mal wirklich ordentlich fetten kreuzschlitz"}, {"id": 1123, "start": 8239.6, "end": 8249.68, "text": "machst du hier so und hast einen schraubendreher am start ist halt nice dann hast du auch nochmal"}, {"id": 1124, "start": 8249.68, "end": 8258.56, "text": "ein paar dann hast du auch nochmal hier ein paar default bits am start die man mal brauchen kann"}, {"id": 1125, "start": 8258.56, "end": 8265.24, "text": "inklusive einem halter dann hast du noch den vera halter für bits der ist der ist tatsächlich"}, {"id": 1126, "start": 8265.24, "end": 8270.2, "text": "cool da kann man hier vorne wir machen das jetzt mal mit dem i fix it man ist mal mit dem i fix it"}, {"id": 1127, "start": 8270.2, "end": 8275.04, "text": "kannst du hier vorne das ding rein machen aber war das der zum drücken oder war das der zum"}, {"id": 1128, "start": 8275.04, "end": 8284.28, "text": "ziehen ich weiß es kann er mehr geht das aber passt gar nicht richtig ah jetzt ok genau das hast du"}, {"id": 1129, "start": 8284.28, "end": 8289.0, "text": "dieses ding hier vorne drin dann ziehst hier hinter zack und dann sollte es eigentlich wieder"}, {"id": 1130, "start": 8289.0, "end": 8301.0, "text": "rausgehen aber dieses i fix it ding ist irgendwie ein bisschen bisschen über über stabil ok jetzt"}, {"id": 1131, "start": 8301.0, "end": 8309.44, "text": "kannst du es rausziehen guck zack i fix it ding ist ein bisschen kantig das geht irgendwie gar"}, {"id": 1132, "start": 8309.44, "end": 8313.72, "text": "nicht richtig richtig rein also normalerweise ziehst du das dann nach vorne und das geht"}, {"id": 1133, "start": 8313.72, "end": 8321.16, "text": "ach nee du musst den direkt ziehen ok das ist anders als beim tool check bit halter interessant"}, {"id": 1134, "start": 8321.16, "end": 8325.6, "text": "also er macht den rein hinter und dann ist er fest und wir schieben wieder vorne dann gehts raus ok"}, {"id": 1135, "start": 8325.6, "end": 8329.56, "text": "ich habe nichts gesagt der tool check bit halter geht glaube ich nach hinten bin ich mir relativ"}, {"id": 1136, "start": 8329.56, "end": 8337.12, "text": "sicher ist auch egal zumindest hat man den ordentlichen bit halter und das das eigentlich"}, {"id": 1137, "start": 8337.12, "end": 8350.4, "text": "fast nicest an dem set ist das teil das ist die kleine wäre zyklop knarre da kann man schraube"}, {"id": 1138, "start": 8350.4, "end": 8356.84, "text": "schraube machen mit schraube schraube aber was richtig poggers ist man kann nicht nur schraube"}, {"id": 1139, "start": 8356.84, "end": 8366.68, "text": "schraube machen man kann auch clips das ding einmal so einstellen oder auch einmal so auf"}, {"id": 1140, "start": 8366.68, "end": 8372.68, "text": "90 grad oder einmal rum oder in die ecke also sprich man kann damit theoretisch schrauben"}, {"id": 1141, "start": 8372.68, "end": 8380.4, "text": "man kann damit um die ecke stelzen oder 90 grad winkel schrauben das ding ist wirklich cool also"}, {"id": 1142, "start": 8380.4, "end": 8390.44, "text": "wenn man es mal braucht ist man wirklich froh wenn man das teil hat das ist wirklich nice und da"}, {"id": 1143, "start": 8390.44, "end": 8395.96, "text": "hat man auch die üblichen schraubendreher dinger von den normalen ein paar talks und ein paar"}, {"id": 1144, "start": 8395.96, "end": 8406.68, "text": "schraubendreher und ansonsten war es das eigentlich aber ist wirklich ist ein wirklich cooles set und"}, {"id": 1145, "start": 8406.68, "end": 8410.44, "text": "in kombination mit toolcheck plus finde ich das super es gibt noch einen maul schlüssel dabei der"}, {"id": 1146, "start": 8410.44, "end": 8414.04, "text": "einzige maul schlüssel glaubt von vera der links und rechts ein schlüssel hat das sind so die"}, {"id": 1147, "start": 8414.04, "end": 8420.88, "text": "standardgrößen was hast hier 10 und 13 so wenn man das hat plus ein toolcheck plus ist man wirklich"}, {"id": 1148, "start": 8420.88, "end": 8427.92, "text": "ziemlich gut ausgestattet und kann eigentlich alles machen was man so machen muss aber das ding"}, {"id": 1149, "start": 8427.92, "end": 8437.44, "text": "finde ich cool gerade in kombination hier mit diesem anpassbaren griff hier kannst du so machen"}, {"id": 1150, "start": 8437.44, "end": 8443.28, "text": "zack da draußen ja also das ding finde ich viel angenehmer ist auch qualitativ deutlich besser"}, {"id": 1151, "start": 8443.28, "end": 8451.76, "text": "aber kostet natürlich ein bisschen mehr und es ist halt trotzdem eine nice geschichte ja"}, {"id": 1152, "start": 8451.76, "end": 8458.12, "text": "poggers genau und wenn man sich jetzt einmal den preisunterschied anguckt dom pc 10 monat"}, {"id": 1153, "start": 8458.12, "end": 8464.72, "text": "dankeschön für den sub wenn man sich jetzt mal den preis anguckt ich meine i fix it kostet was hier"}, {"id": 1154, "start": 8464.72, "end": 8474.48, "text": "so ein standard i fix it das habe ich glaube ich ich glaube das hier ist das also i fix it hier"}, {"id": 1155, "start": 8474.48, "end": 8479.48, "text": "wollen sie 70 euro versucht ganz schön teuer ist diesen ganzen crap also ganz ehrlich nimmt"}, {"id": 1156, "start": 8479.48, "end": 8485.16, "text": "lieber das hier weil der restliche kram ist komplett useless und das der restliche kram"}, {"id": 1157, "start": 8485.16, "end": 8491.92, "text": "ist billig krab das hier ist eigentlich den kram den man haben will also die das doppelte"}, {"id": 1158, "start": 8491.92, "end": 8498.16, "text": "hier an preis fast für dies pass an lohnt sich überhaupt nicht so also so ein fix it ding sagen"}, {"id": 1159, "start": 8498.16, "end": 8510.76, "text": "mal 60 euro so und das wäre elektriker set that"}, {"id": 1160, "start": 8510.76, "end": 8531.92, "text": "was ist denn gibt es das gibt es das nicht mehr der ist übrigens auch super hier der da hier leute"}, {"id": 1161, "start": 8531.92, "end": 8541.52, "text": "geht eigentlich geht eigentlich kostet kostet einfach mal 90 euro ist halt schon ein bisschen"}, {"id": 1162, "start": 8541.52, "end": 8550.36, "text": "unterschied ja aber also mal ganz im ernst wenn ich wirklich den fix it pro kaufe wo halt so"}, {"id": 1163, "start": 8550.36, "end": 8558.2, "text": "viel zeug dabei ist was man nicht braucht dann kann man sich fast schon einfach nur den fix"}, {"id": 1164, "start": 8558.2, "end": 8563.84, "text": "it bitsatz kaufen weil der ist wirklich praktisch kauft man sich für 34 euro den"}, {"id": 1165, "start": 8563.84, "end": 8575.16, "text": "und dann kauft man sich noch das elektriker set dabei dann ist man zwar 130 euro los oder"}, {"id": 1166, "start": 8575.16, "end": 8584.68, "text": "125 euro los und wenn man richtig pro ausgerüstet sein will kauft man sich noch einen kauft man"}, {"id": 1167, "start": 8584.68, "end": 8591.36, "text": "sich noch tool check plus dabei und dann hat man tatsächlich wirklich alles was man braucht also"}, {"id": 1168, "start": 8591.36, "end": 8596.92, "text": "der tool check plus ist eigentlich doppelt gemoppelt den brauche man dann eigentlich gar"}, {"id": 1169, "start": 8596.92, "end": 8601.92, "text": "nicht mehr es sei denn ein paar ganz special special bits aber wenn ihr wenn ihr das habt"}, {"id": 1170, "start": 8601.92, "end": 8607.04, "text": "plus dieses wäre elektriker set ohne scheiß also dann habt ihr 99 prozent aller schraube"}, {"id": 1171, "start": 8607.04, "end": 8619.48, "text": "sachen abgedeckt das fix jetzt ist halt das coole weil du da so special sachen hast wie"}, {"id": 1172, "start": 8619.48, "end": 8626.4, "text": "iphone öffnen dinger und sowas also bei dabei wenn wir gerade dabei sind auch gutes weihnachtsgeschenk"}, {"id": 1173, "start": 8626.4, "end": 8639.08, "text": "ja und ich habe irgendwie mal ein fix it bit verschlammt der liegt hier bestimmt"}, {"id": 1174, "start": 8639.08, "end": 8648.84, "text": "irgendwie auf dem schreibtisch und ich finde ihn nur nicht na gut hast du ein affiliate link"}, {"id": 1175, "start": 8648.84, "end": 8654.24, "text": "ne sollte ich mal machen ich wollte mir sebaro schon seit einer weile mal so ein max choice"}, {"id": 1176, "start": 8654.24, "end": 8658.92, "text": "liste machen wo das alles drin ist sollten wir echt machen gerade jetzt zu weihnachten gibt"}, {"id": 1177, "start": 8658.92, "end": 8667.08, "text": "stonks geld also ok leute es war richtig nice dass wieder so viele dabei waren wir hatten"}, {"id": 1178, "start": 8667.08, "end": 8673.84, "text": "heute spitzen spitzen dings fast 300 leute schön dass so viele dabei waren wenn es euch gefallen"}, {"id": 1179, "start": 8673.84, "end": 8679.52, "text": "hat wäre natürlich auch nice wenn ihr eine runde folgert das ist nächstes mal mit auf"}, {"id": 1180, "start": 8679.52, "end": 8685.36, "text": "aktuellen stand sein ihr merkt kann keinen guten sehr laut machen dass das nächste mal mit am start sein und"}, {"id": 1181, "start": 8685.36, "end": 8690.68, "text": "wir sehen uns beim nächsten stream ich gehe jetzt was essen ich habe hunger"}, {"id": 1182, "start": 8690.68, "end": 8711.0, "text": "bis denn wir sehen uns macht's gut zu"}]}