{"text": "So So So So So So So Hier Also Ist jetzt Jetzt hat es das gecheckt Alter Twitch Mensch ey Das sind exakt die gleichen Settings Genau das gleiche was ich das letzte Mal hatte Jetzt wills hoffentlich Ist jetzt 1080 und sieht besser aus Ja ne Meine Güte ey Übelster Sack Ok jetzt aber Ok ich glaube wir Destroyen den Server gerade so ein bisschen Kann das sein? Ist das Möglich? Ok jetzt machen wir Trick 17 Man kann nämlich hier hinten rumstelzen Das Übrigens der Grund Das Übrigens der Grund warum ich eigentlich Immer Delay hab Habt ihr die Waffe Rumlenken gesehen? Ha Die flüchten Einfach Sie sind Einfach geflüchtet habt ihr das gesehen? Ich denke nicht dass sich jemand streamschreibt Doch Und wie ey letztens der Wahnsinn Ich hätte auch nicht gedacht das Leute in Battlefield 3 Ich mein Streamschreiben in Battlefield 3 Da fällt mir gar kein Vergleich Zu ein Das ist Omega 0 aber es gibt Leute die machen das Hier Der Kreisel Der Kreisel Springer Au Kurz regnen Doch Doch das ist das Schlimme das haben mich Leute gestreamschreibt Ich kanns mir nicht Ich kanns mir auch nicht erklären aber das Doch war eigentlich Total hängen geblieben weil man sich vorstellt das Battlefield 3 Battlefield 3 ist es Battlefield 3 man Wo Ok wo stelle ich Sie Bestimmt oben Wo ist hier was Ich brauch erst kurz um rein zu kommen ich weiß nicht wo es genau rumgestellts hat what the hell oh ich wollt den heli-typ schneiden oder rausballern jetzt wenn es gebashed kleinen stells aus fuck grenade fuck grenade okay da drüben ach wir haben noch gar nicht beides ah das hat mich verwirrt dachte wir hatten beides gleich kommt da pass auf pass auf pass auf gleich kommt da von der seite hätte ich nicht gedacht dass da irgendeiner ist nice thx was hier los wisst ihr was cool wäre wenn man shit wenn man die lay nachträglich rein machen könnte die was ist hier los team play sehe ich das richtig jetzt hier ist team play angesagt einfach einfach legit legit team play nein alter legit team play guck mal hier ich wäre sogar chain rest guckt euch an jetzt wollen sie es wissen jetzt wollen sie es echt wissen aber mein squad macht das mein squad macht das easy easy win bringt sich die gegner also heute sind gar nicht so viele prime hoops am start jetzt trick 17 absprung zone das nicht ich weiß was ich das nächste mal machen das nächste mal also ich mach wieder mit die lay uns ich werde das einfach vorher so lange neu starten bis tritts das gecheckt hat kippen moving dieser komische well feel 3 ansage am ende der runde immer kippen moving also mal ganz im ernst hier das ist ja drei kilometer weit was geht mit was ist mit den leuten kann los hier durch das warn nice sehr gut hast du den gekrappt exquisite hallo bettel field please kann den repair ich kann ihn auch repairen ich gehe mal hier als engie oh nein das war jetzt doch wollte eigentlich als engie rein weil der hat der hat schon einen drin oder jetzt haben wir repair repair gem hat gut funktioniert ok jolo mode ja genau netz rein netz rein perfekt perfekt h going hmm hallo aber die läge hänne die lege hänne funst noch Haben die grad... Fuck, die haben schon wieder diffuset. Der Chat ist wieder richtig geil grade. Ich warte mal bis wir unten sind hier. Der Chat ist wieder richtig geil. So richtig typisch deutscher Chat. Wieder alles so am rumflamen. Alter, was ist hier los? Ey, what the fuck? Das ist doch nicht normal. Du wirst hier wirklich überall beschossen. Aber, diesmal muss man echt sagen... Die Gegner sind besser. Die Gegner sind besser. Ach, Wolle. Das ist doch wirklich kein Ding, ey. Aber ich muss ohne Scheiß, ich muss Delay reinmachen. Ich weiß nur, dass ich mir immer einbilde, dass irgendeiner guckt, wo man lang läuft. Sackt richtig. Ich bin mal... Nee, jetzt kommt's. Ja, jetzt kommt nochmal Defender, der immer wenn piek, ne? Jetzt kommt nochmal Defender, der immer wenn piek. Ja. Schauen wir mal. Wir brauchen Motivationsmusik. Kirby. Ja, perfekt. Ja, perfekt. Jetzt kann nichts mehr schief gehen, Leute. Cat Jam. Cat Jam. Die sind da schon mit dem fucking Auto am Start, ey. Da geht er an B. Okay, Moment, ich hör nix. Dude, Dude, Dude, Dude, Dude. Haha, was ist das? Battlefield, Alter. Was ist mit dem Dude hinter der Mauer los? Boah. Da unten war was drin. Alter, das ist irgendeiner der random Server, die da eben so am Start ist. Tja, das fragt man sich. Kommt man hier nochmal raus? Ich bin mal gespannt, was mit Venise Unleashed ist. Am Ende des Jahres, also quasi nächste Woche oder so, wer weiß nicht, wann das kommt. Venise. Ey, die Gegner sind ja ultra scharf drauf. Was ist denn hier los? Ey, die Gegner sind ja ultra scharf drauf. Was ist denn hier los? Die Gegner sind mega heiß. Auf einen, da oben kann ich jetzt, wobei doch. What? Den hab ich überhaupt nicht gesehen. Die Gegner sind mega heiß drauf hier. Okay, aber es ist auf jeden Fall auf der rechten Seite was los. War der, war der da oben drin? Massive Nade. Huge Nade war das. Beste. Guckt euch das mal an, wo man hier getroffen wird. Nee. Da ist er. Nein. Nein. Nein. Nein. Nein. Nee. Das ist glaube ich nicht das. Woher wissen die das? Muss Stream Snipes sein, Lul. Wo wirst du denn hier alles getroffen? Doch definitiv nicht normal. Achtung. Fuck. Ich dachte das wäre unser Dude. Äh, wenn nicht dann nicht, komm nächste Woche. Nee, das nächste, übernächste Woche. Es gibt ja nicht mehr so viele Tage. Ich hab gesagt Ende Dezember. Oh nee. Okay, YOLO Modus. YOLO Modus. Vergiss es. What the hell. Okay. Jetzt müssen wir hier rüber. Guck, die sind schon dran. Da vorne war einer. Die kommen hier nicht rein, ne? What? Alter, du wirst hier wirklich von allen Seiten gebashed. Mann, da geht nix rein. Nice. Hahaha. MonkaS, what is happening? Also an den Stellen wo man hier gehitted wird. Das ist nicht normal. Äh. What? Ey. What the fuck geht hier gerade ab? Das ist doch nicht normal. Was ist hier los? Äh. Das ist ja eines der monkaessigsten Runden aller Zeit. Und by the way, was soll eigentlich eine monkaessige Runde sein? Ja, eine Runde die halt monkaess ist. Keine Ahnung. Monkaess kann ja alles sein. MonkaW geht auch. Oder MonkaGiga. Okay. Okay. Da kommt ein Auto. Ein fucking Auto. Ein Auto. Ah. Ah. Er ist einfach ein Auto am Start. Der Auto, Dude. Der ist immer noch am Start. Alter. Ist ja eskaliert man nicht so. Okay, okay. Oh shit. Ja. Messer. Jawoll, ich hab noch einen gemessert. Alter, was ist das für eine Runde? Die Anti-Henne war am Start. Das ist eine coole Runde. Die Rekorn war mal. Äh. Rekorn? Was war nochmal Rekorn? Controls? Ah, alt F10. Boah ey. Also das war ja mal anstrengend hoch 10. Richtig heftig, ne? So war es nur in Battlefield. Ja, so sieht es aus. Nice Team. GG Eats. Im Zweifelsfall wisst ihr, wenn man knapp gewinnt, ist das immer... Also wenn man knapp gewinnt, egal wie knapp, mit einem Punkt ist es immer GG Eats. Wenn man verliert, ist das Hack. Oh, Nose-Hair-Cannels. Also Defender. Ich brauche übrigens noch eine gute Engi-Klasse. Was nimmt man da? M4? M4 und dann? Was macht man da dran? Ich hab das schon wieder komplett. Tactical Light, Alter. Laser Sight, Suppressor. Olo Stels. ACR? Gab es überhaupt eine ACR in Battlefield 3? Ich kann mich doch auch noch mal dran erinnern. Ah Moment, Moment, Moment. Ich hätte mal meinen E-Class-Stels mitnehmen müssen. Oh Moment, die M4 ist Burst? Ernsthaft? Oh ne, oder? Alter, ist das schlecht? Ich hab's schon wieder ganz vergessen, der Kack, der war ja Burst, ey. Mega-Kack-Waffe. Rums. Wow, wow, der lebt ja noch. Dacht, das ist unser Dude. Dacht, das ist unser, unser Luftabwehr-Stels, Mann. Okay, okay, okay. Okay, okay, okay. Okay, okay, okay. Ich geb zu, kindesweise Fail. Ich switche mal kurz auf irgendwas, wo ich auch was killen kann. Okay, die Mann jetzt Legehenne. Stabile Legehenne. Stabile Legehenne. Der Dude ist immer noch da. Oh, oh, ich versuch, ich versuch die 2, okay, ich geh jetzt. Oh, ich Das überleb ich net, das überleb ich net. Einmal auf der Strasse stehen geblieben, bam, down. Keine Chance. Okay, okay, okay. Okay, okay, okay. Okay, okay, okay. Okay, okay, okay. Okay, okay, okay. Okay, okay, okay. Okay, okay, okay. Okay, okay, okay. Okay, okay. Okay, okay, okay. Okay, okay, okay. Wow! Okay, okay, okay, okay. Okay, okay, okay. 나 나 나 나 Aber was geht hier eigentlich gerade? Kann mir das irgend einer mal legit erklären was hier gerade abgeht? Auf der Gas stehen bleibt immer ein Fehler, ohja das stimmt. Jetzt kannst du nicht diffusen, keine Chance. Oh fuck, ich hätte dich protekten sollen, ich hab gedacht das kriegen wir eh nicht. Ich dachte das kriegen wir eh nicht. Wisst ihr mal, in dem einen Moment wo es drauf ankommt, nicht geteamplayert. Auf die Gas stehen, das ist auch so typisch hässlich, auf die Gas stehen, zu lange auf die Gas gestanden. So was kriegen die denn jetzt, die haben jetzt ne Heli und wieder ne M-Track und Heli. Ich komm aus Frankfurt, auf die Gas, okay das ist jetzt Fail, der M-Track kann ja nur hier hoch. Okay vielleicht switchen wir doch mal lieber auf Engineer wieder, aber mal mit einer gescheiten Waffe. Was ist denn da gescheit, AK-74U, ist das Ding jetzt down? Ich blick hier grad echt nicht durch, das ist mir zu hoch, was hier grad abgeht, das ist mir echt zu hoch. Shit Grenade, ich camp jetzt das M-Com ab, weil wenn die hier smokeen, die smokeen ja nicht auf Spaß an der Freude. Guck hier, lege Hände, lege Hände, aber da über Range sagt der, das kann ich ja nicht mal wiederbeleben. Ich dachte da ist jetzt was, hier ist doch auch was, okay sorry ich seh nix. Hatte man eigentlich Auto-Health-Track oder musste man hier echt zu einem Medic rennen? Ich glaub man hatte Auto-Health-Track, aber richtig lahm, so irgendwie gefühlt in einer halben Minute oder so, oh eine nice Pose, Achtung, Yolo stellt's. Ja ist ja klar Battlefield, natürlich, okay die Waffen, die Standard-NG-Waffen sind irgendwie ziemlich der Sack. Was war man da, was ist ne gute NG-Waffe, ich kann mich auch nicht dran erinnern, was ist ne gute NG-Waffe, P90 war halt gut, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne. Eher, Eher Müll Okay, das können wir nicht mehr. Das können wir nicht mehr holen. Keine Chance. Guck dir an Okay, ich muss jetzt wieder. Ich spiele, wisst ihr was? Wir machen jetzt M16. Bäm! M16 Ich stelle es nicht. Einmal wieder M16. Ne, ne. Ich spiele kein M16. M16 ist mir zu, zu low Wow What? What? Ich blicke gar nicht mehr durch, wo die Gegner sind gerade. Alles hier am Jumpshotten und tun und machen Kann man hier irgendwie durch? Der Schneiber, man Wir stehen, wir bleiben jetzt einfach im Container stehen. Lul, weh. Container stellts Aber du musst aufpassen, dass die nicht durchpushen Excellent, Container stellts Okay, wir dürfen jetzt nicht zu weit. Okay, wir müssen aufpassen. Okay, wir müssen aufpassen. Okay, wir müssen aufpassen Okay, ich bin jetzt nicht ganz sicher, von wo die kommen Aber ich hoffe wir können mal backragen Achtung, Achtung Fuck, ich hätte nicht schießen sollen, ich hätte Messern. Ich hätte Messer und Bäm in your face Messern müssen. Hi Happen, 14 Monate, Dankeschön. Ich hätte nicht schießen dürfen, das wäre dumm Hi Hapsore Ja, was wir haben die Fuse, ich glaube es ist ja da Nice, so muss es sein Oh blöd blöd In der S kriegen sie geschossen Die tighten roofing Jawoll. F. den E R. ist over hier Ich bin engagiert, ich bin engagiert. Okay. Wow. Haha, keine Chance, ich hab nicht mehr durchgeholt, hier haben wir 30 Milliarden Gegner. Medic Klasse so OP, Medic Beste. Medic ist bäm bä bä bäm. Nostalgie, das Mikro hat so guten Ton. Ach, ich glaube, das lässt sich sicherlich irgendwie ändern, dass das Mikro so gute Qualität hat. Also wenn ihr wollt, wenn ihr wollt, ich kann das Mikro vor ein schlechtere Quali machen. Dankeschön für die 6 Monate, das Sandor. Der weiß, dass ich hier oben bin, der Dude, äh, wow, äh, das ist eine gute Idee, was hier, wo ist der Baum hin? Ey, das ist ja die POG-Position hier, ich bin in der POG-Position, oh ne, Alter, warum sterben hier gerade alle? Nein, oh nice, jetzt, Massive, ah, meine Maus, ma Maus ging nicht. Boah, aber das ist, das ist schon echt hardcore anstrengende Runden gerade. Nein, die haben gelegt, M-Komm, lege Henne. Wo ist die Lege Henne, Alter, hier ist der nicht normal. Okay, Yolo, jo, voll die Granate direkt in die Fräse, okay, eigentlich müssen wir nur B halten, dann ist easy, wir sollten uns jetzt nicht da reinwerfen wie die Dummen, so wie wir es gerade machen und einfach, und einfach B-Däffen, einfach, einfach B-Däffen. Na, siehste, siehste, wir waren richtig dumm, sind wir gewesen, richtig dumm. Richtig dumm waren wir, wir waren Low-Brain-Champ waren wir, extremer Low-Brain-Champ, oh nice, nice, wir haben es gehalten. Sag mal, was ist denn hier gerade los? Boah, Alter, was sind das hier für Runden gerade, das ist ja verschwitzter als Warzone oder Modern Warfare Skill-Based Matchmaking, äh, meine Güte, das sind ja die stressigsten Battle-Vielrunden seit 5 Jahren. Ey, ich bleib jetzt defensiv, ich mach's jetzt defensiv, die müssen zu uns kommen. Ja, easy, anstrengende Sache, Granatenspam auf das M-Com, äh, deswegen ist es eigentlich auch fast, also es ist fast, normalerweise ist es, also es ist sauber, sowas ist nicht unmöglich, aber es ist schwer, das zu diffusen, wenn die Gegner geschallt sind. Ist typisch deutsch, die sitzen im Handtuch vom Rechner, ja, kommt echt so an, fühlt sich echt so an. Ich speichere mir den Grammar, das ist immer ganz gut, dass ich Hintergrundmaterial habe, ich muss nur gucken, dass ich die Festplatte, weil, oh nee, Moment, ich muss jetzt aufpassen, wenn ich in den Ordner reingehe, Leute, wenn ich in den Ordner reingehe, muss ich aufpassen, Battlefield 3. Nee, nee, ich gehe nicht in meinen Recording-Ordner, das hatten wir schonmal. Sehr gute Runden, macht Spaß, ja, ist nice, oh, Karg Island, hm, war man da, oh, oh, oh, whoa. Kevin Pan, auf geht's, Bam, wa, baam, wa, baam. Ach nee, nicht Karg Island, da sind wir noch los Herr Kaddles, Attacker jetzt. Half-Life 3, Confirmed, ja, ich, Leute. Ich Confirme offiziell, Half-Life 3 Endlich, endlich ist es so weit, ich hab's Confirmed Lieg hier bitte alle jetzt revealed videos zu machen Belfill logik Nein nein nein lasst mich in ruhe lasst Nein ich bin in meine eigene granate gerannt ich kacke ich werde durchgekommen ich werde durchgekommen aber ich habe mich selbst genähtet okay die war ob die war nicht unten ich hab mich selbst ineiget bei der big brain durch Fenster ging nicht durch Fenster was ist hier gerade los nicht sterben wollen ich sterben die sterben ich sterben Perfekt perfekt, Pockers Pockers Pockers Pockers Pock! Pock like this! Pock Pock Pock Oh YOLO! YOLO! Pock Pock Pock Pock Pock Champ Champ Pock Pock Massive Pock Pog, lege Hände! Pog! Immer noch Pog! Immer noch Pog! Ha, zu spät Pog! Nice! Okay, das war Massive Lege Ende des Jahrtausends. Die legigste Lege in aller Zeit. Die Partie hat schon 20 Billionen Eier pro Sekunde. Okay, okay, nice. Keep on moving! Keep on moving! Alter, spring! Krasser Elite Soldat! Das ist so ein Massive Elite Soldier, dass er nicht über so ein Ding springen kann. Okay, nice, nice, nice. Pog, Pog! Wo ist der Dude? In the ass? Over here? Let's go! Let's go! Lege Hände, Action! Okay, ich versuch zu decken. Da kommt ein Auto. Ist der auf dem Dach? Ist die Henne auf dem Dach? Ich glaub die Henne ist auf dem Dach. Die Henne ist auf dem Dach. Die Henne ist durchs Dach getroppt. Aber wir haben's. Easy! Nice! Oh, mein Team geht gut ab. Ich krieg da... Ich seh nix, so viel Wraiths. Der Schneiber, Dude, da ist er. Der Tod? Ja, hier. Einmal ne Runde T-Bang. Das muss jetzt sein. Gibt's eigentlich noch was anderes außer für Comrade und Kokona in Battlefield 3 oder sind das nur Russen und Amis? Wie sieht's mit Franzosen, Deutschen, Chinesen und allem in Battlefield 3 aus? Gabs die da? Yolo, Raz, Bob. Keine allzu gute Idee. Nur Russen und US, okay. Gibt es keine Chinesen in Battlefield 3? Ja, keine Chinesen. Oh, Zen Crossing, Zen Crossing. Excellent, Zen Crossing. Keine Chinesen aus China. Whoa, Sliderman. Nicht Spiderman, das war Sliderman. Richtiger Sliderman. Sag mal, was ist hier los? Wir stürzen uns ja hier. Wie wir uns auf die M-Coms stürzen, ey. Pause-Champ. Ja, leucht mir in die Fresse, ist gut. Sag mal. Ist hier, ist hier, ist es jetzt, jetzt ist echt hier. Jetzt ist offen. Jetzt. Wieder Belebungs-Champ. Sarix, nee, der Stefan, ja, liegt Sliderman, nicht Spiderman, Sliderman. Okay, ich bin weg. Ich bin raus, Leute, ich bin raus, Leute. Ich bleib im Loch liegen. Was ist offen, Polen oder China? In dem Fall würde ich sagen Russland, oder? Wo ist, wo ist Nosha Canals? Sag mal. Oh, ich hab ihn zu spät gesehen. Wo liegt Nosha Canals? Oh, Fatal, nice Posi, nice Posi hier. Seh schon, mein Team geht ab. Oh, oh, oh. Monarch, S, Triple, Triple S. Sag mal, was ist denn hier gerade? Meine Güte, der Marcel Davis, der eins und eins, der echte, der echte eins und eins Marcel Davis. Danke für den Sub. Subscription. Hier. Nein. Auch nicht. Hier. Komm, wir machen, wir machen Reparaturs. Oh, was war das jetzt? Ich wollte sagen, wir machen Reparaturs-Champ, aber so ganz hat das nicht funktioniert. Oh, big brain drop, big brain, massive brain. Massive brain drop vom Dach. Poggers. Okay. Sag mal. Battlefield, jetzt komm Mensch. Dach drop, big brain drop, würde ich sagen. Okay, pass mal auf. Exzellent. Weiß nicht, wo der Dude ist. Wo ist der Dude? Irgendwo da. Oh, voll rein gerannt. Einfach Stellzer ohne Cyberpunk. Ja. Yep. Dach drop, der Dach drop, der beste Drop aller Zeiten. Weiß nicht, ob der da noch lebt. Pog. Der Dach drop, aber der Dach drop ist Pog. Du kriegst da oben als Defender, du kriegst die nicht runter. Du kriegst die nicht runter, kannst vergessen. Du kannst vergessen, du kriegst die nicht runter. Oh, oder doch? Oder nicht? Du kriegst die nicht runter. What the hell? Oh Mann. Die haben einen Heli? Okay, die haben unseren Heli. Wo liegt Terran Heim? Ich würde sagen in Südafrika. Ah fuck. Warum haben die unseren Heli? Die sollten nicht unseren Heli haben. Also wenn die unser Heli haben, ist schlecht. Aber, aber wisst ihr was wir machen? Wir sind ja, wir haben ja exzellent, exzellent Zeugs am Start. Wenn die unseren Heli haben, dann stellts, oh nee, ich hab wieder die M4, nooo. Ach nee, das ist die Auto M4 jetzt. Bam, Bitch. Boah. Jetzt sind sie rausgesprungen. Das Ding macht zu wenig Damage. Oh, okay. Jetzt kann ich wieder was anderes reinspringen. Boah, anstrengend. Okay, gehen wir mal wieder hier rein. Der Schützturm ist besetzt. Achtung, ich zeig euch jetzt mal, Moment, wo sind wir denn jetzt hier? Okay, Pog, Pogrute. Steh auf. Okay, Pogrute Leute. Pogrute. Postchamp in Chat hier. Pogrute. Ist der auf dem Dach? Ist da ein Typ auf dem Dach? Okay, Pogrute. Pogrute, passt auf. Passt auf. Postchamp, Pausierungschamp. Dumm ist jetzt alle, die Stream gucken. Ich leake jetzt, ich leake jetzt bestes Strap aller Zeiten. Vor allem, die funktioniert wirklich nur, wenn keiner guckt. Ist klar, du hast da zufällig hingeguckt, alter. Ach nee, der sitzt auf dem Dach. Fuck, er macht Dachchamp. Okay, das ist schlecht. Passt mal auf hier, bester, bester Champ, bester Champ. Beste. Ah, diese Kack. Kack, AA-Champ. Das ist beste, das ist beste, beste Pose hier. Wo war der Typ? Da kommt gleich was. Leute, da kommt gleich was. Weiß nicht so genau von wo. Oh fuck, ich wollte dich holen, aber ich kann dich, ich kann dich holen. Ich bleib safe, dass du respawnen kannst. Oder auch so. Okay, das war zu viel. Das war zu viel ist gut. Aber die sind ziemlich defensiv gerade. Die Runden sind wirklich nicht, also die machen echt Bock. Da ist mal was los hier. Oh, Rep-Champ. Bunsenbrenner-Champ am Start. Ja. Der Flammenback wird nie behoben. Ich könnte ja jetzt eigentlich abspringen, aber mach ich nicht. What the hell? Was war das? Kann mir das mal einer erklären? Warum hat der Dude gerade eine Granate geschmissen zwischendurch? Ich hab nichts anderes gemacht, wie Heel-Champ durchzudrücken. Fettfinger. Auf G, also von D auf G, da musst du schon ganz schön fetter Finger haben. Massive Finger brauchst du da. Achtung. Ja, ist klar, Belfill, ist klar, Belfill. Okay, top. Fettfinger plus Brain-Lag. Vielleicht, vielleicht, vielleicht. Oh, Porgas, Porgas-Posi, Porgas-Posi. Alter, ich hab hier Heel-Champ. Jetzt müssen wir nur noch dran. Mag ich schon wieder on? Ja, ja, ja. Oh nee. Sterbe-Champ haben wir gemacht. Was ist denn hier hinter mir los? Ich hatte gerade Laser-Pointer im Gesicht. Da werd ich immer ein bisschen nervös, wenn ich Laser-Pointer im Gesicht habe in dem Game. Weiß ich, ob das noch jemand kennt. Laser-Pointer im Gesicht verspricht meistens nichts Gutes. Shit, Alter. Die haben echt Massive-Defense, die Jungs hier. Nee, nee, nee, Kollege, so lass mich nicht jebaiten von dir. Fuck. Das letzte ist aber auch echt brutal, ey. Wir haben die Runde übrigens eh schon gewonnen. Wir sind viel weitergekommen als die. Easy Win. Ich hab Urlaub, ja. Guck zu mir, Tasswood. Ist Tasswood der gegnerische Fahrzeugmann? Weil 47.8 ist schon mal ne Hausnummer. Ich retz dich, ich retz dich. Nein. Nee, ich hab wirklich Urlaub. Ich hab kein Homeoffice, ich hab wirklich Urlaub. Bis Januar. Urlaub bis Jan. Punkt. Poqours. Ja, aber richtiger Poqours. Mega anstrengende Runde. Es sollte mehr Infantry-Only-Server in Battlefield 3 geben. Ja, ehrlich gesagt braucht man gar keine Infantry-Only-Server, solange man nicht die Maps spielt, wo die ganze Zeit nur Heli und Jett stellt. Deswegen mag ich auch ehrlich gesagt Firestorm und Caspian Border nicht. Sagt mal, Battlefield 3 ist noch im Prime, oder? Es ist Prime bis Januar, glaub ich. Seh ich das richtig? Ja. Das ist geil. Der Analyst glaubt, dass sich Battlefield 6 schlechter verkaufen wird. Da muss man richtig krasser Analyst für sein. Nach dem Fail von Battlefield 1. Massive Analyst muss man dafür sein, dass man da auf die Idee kommt, dass ich Battlefield 3 nochmal so gut verkaufe. Huge Analyse braucht man da. Kommen wir da rein? Kommen wir da rein? Oh nice, nice. Schwerstes M-Com im ganzen Game, Alter. Schwerstes M-Com im ganzen Spiel. Schwerstes M-Com im ganzen Spiel. Poqours, Poqours, Poqours, Poqours. Das brauchen wir, brauchen wir. Wir müssen gucken, dass da keiner von hinten kommt. Ich hab das Gefühl, die kommen gleich von hinten rein. Bam! Schwerstes M-Com im ganzen Spiel. Nice. Man kann übertreiben, aber es ist definitiv eines der schwersten M-Coms im ganzen Spiel. Chat, True0W oder stimmt nicht? Die anderen sind auch nicht super easy. NotFalls0W, okay. Kann ich auch mitleben. Hallo, Panzer? Aaaaaaah! You got G-Baded, Junge. Oh. You got richtig G-Baded, der Amtrak. Der will jetzt, pass auf, pass auf, der will andersrum fahren. Null. Der hat halt unseren Amtrak, oder? Ist das nicht eigentlich unser Amtrak? Das ist unser Amtrak. Okay, dann wird das auch ganz schön schwer jetzt. Alter, ich würde dich ja wiederholen, ne? Hinten kommt was, hinten kommt was. Sag mal, das ist echt gerade die Tri-Hard Season angebrochen hier. Monka! Waffel, LoL, Yolo, Swag. Wer sagt denn noch LoL heutzutage? Okay, Boomer, Alter. Boomer confirmed. Boomer, guckt euch mal an meine huge flank strats. Sag mal, das Erbsen hier darf auch mal sterben. Sag mal, the fuck? Wie viel halten die noch aus? Oh, nice. TRX, TRX, TRX. Ich würde dich gerne holen, aber ich kann nicht. Fuck, Mann. Fuck, Mann. Fuck, Mann. Fuck, Mann. Fuck, Mann. Shit. Oh, krieg ich nen Rats, Leute? Das wär massive nice. Poggers Rats. Achtung, den aim ich ab. Den aim ich ab, den dude. Abge-aimt, jawoll. Achtung, Yolo, Yolo Rats. Jawoll, nice. Ey, wir waren da so krass von hinten drin. Also jetzt nicht falsch verstehen, ne? Und es hat nix gebracht. Der Rats train, guckt euch an. Der Rats train, wie es rennt, der Rats train. Okay. I drill in you asshole, yeah. Fuck in the ass, ey. Ey, ich blick nicht mal durch, wo Gegner sind. Machs gut, Stripes. Oh, er ist da tot. Oh, lege Henne, die lege Henne ist da. Oh, was? Du Scheiße. Rats, ich bin gerätzt worden und er hat schon zwei Laserpointer in der Fresse, ey. Oh, was ist das? Lass mich weg. Alter, ey. Okay, Kniebeugen. Ich würde sagen T-Bag. Hier, Medic. Also die Runden heute sind echt monka stressig. Okay, okay. Wisst ihr, was wir jetzt machen? Okay, ich mach jetzt und jetzt. Ah shit, das war knapp. Das Erbsen-Hirn wieder. Das Erbsen-Hirn wieder. Alter, aber heute ist wirklich schlimm. Guckt euch das mal an. Wie oft wurde ich wiederbelebt? 50 Mal. Aber das ist halt, das ist halt echt nice Teamplay gerade. Nice, nice. Wie er durchgelaufen ist. Wie er durchgelaufen ist. Massive. Achtung, Achtung, die kommen hier gleich rein. Wo ist er? Wo ist er? Wo ist er? Nice. Okay, ich sehe jetzt hier ehrlich gesagt nix, aber ich hab das Fenster gut drinne. Da kommt nichts mehr dran, ey. Wenn die mich hier nicht aus dem Haus rausbaschen. Nice. So muss es sein. Du bist nicht ganz sicher von wo das jetzt gekommen ist. Noch mal flank action. Nee, da kann nichts mehr sein. Okay, wir warten hier bis es aufgeht. Leider habe ich den Timing nicht mehr drinne, sonst würde ich jetzt schon loslaufen. Okay, komm wir probieren es. Vielleicht bin ich ein bisschen früh. Nice. Damit hast du nicht gerechnet, dass ich schon da bin, Alter. Damit hast du nicht gerechnet. Kollegen, damit habt ihr nicht gerechnet. Das war ein guter Play, ich muss dazugeben. Jetzt campen wir erstmal hier schön ab in der Ecke. What? Hinter mir? Da ist echt einer. Oh nee, jetzt habe ich die Poggers Posi aufgegeben. Für nix. Das ist auch schwierig. Das ist wirklich schwierig hier. Aber wir machen jetzt Trick 17. Passt auf, Trick 17. Ich zeige es euch mal. Poggers Posi. Hier, guck. Kannst man eigentlich auch hier rüberspringen, dachte ich. Aber kann man anscheinend. Du wolltest mich flanken, Alter. Fuck, der andere hat mich geflankt. Ist gerade mein ganzes Team am M-Com gestorben. Ich glaube schon. Aber das ist auch echt schwierig hier. Das ist auch wirklich schwer. Also hier ist es wirklich schwer reinzukommen. Da musst du einmal komplett reinrushen, alles killen und dann legen. Dafür könnte ich es dann auch nicht mehr wieder erobern. Aber das ist schon echt schwierig. Oh nice. Also wir pushen da wirklich gut ran. Ich mache nochmal meine Poggers, mein Poggers flank. Ich sehe nichts mehr. Wow. Wow. Wow. So nah sehe ich ungern die Granate. Moment, wo ist der Dude? Fuck. Dachte, ist nichts mehr. Aber die haben sich halt gut geheidet. Auch geiler Satz. Gut geheidet Leute, merkt euch das mal. Ihr müsst euch gut heiden. Oh ein exquisite spawnbeacon. Haben sie gut geheidet würde ich sagen. Haben sie echt gut geheidet. Fuck. Das hätte ich nicht probieren sollen. Das hätte ich nicht probieren sollen. Ok. Können wir noch irgendeine big play Aktion machen? Ich habe eine Idee Leute. Ich habe eine Idee. Perfekte Pose, perfekte Pose für den play. Perfekte Pose. Wir gehen jetzt hier rein. Ok, da steht eine Tür. Fuck. Fuck. Fuck von unten. Shit. Ok, ich rappe jetzt. Ich rappe jetzt. Ah nee, zu spät. Das ist auch eine echt schwere. MonkaS, ich sehe nichts. What is happening? Battlefield? Battlefield? Ja? Ah. Ok, das hat es gebracht. Battlefield physics. Battlefield physics. Oh mein Leute, wir sind wieder am Start. Poggers. Die Poggers Leute sind am Start. Was? Nein oder? Oh wie close. Wie close. Und wir hatten auch schon gelegt und dann hatten sie defused. Wir hätten auch noch mal liegen können. Echt close. GG. Ist das jetzt Eats? Nee, das ist nicht Eats. Das ist einfach GG clap. Lowry. Das m-com ist zauschwer. Also das ist wirklich hart. Ich meine, wisst ihr was? So wie dieses m-com hat sich Blizzard für Overwatch 2CP Maps gedacht. So müssen die alle sein. Vergleicht mal dieses m-com mit Spawns auf 2CP in Overwatch. Ich weiß Overwatch in 2020 null. Aber die Dinger sind alle so. Richtig. True null w. Also guckt euch das an. Blizzard hat gedacht. Ah ok. Excellent. Scheiß Spawn. Scheiß m-com Platzierung. So machen wir jede Map. Ah da hat Blizzard gedacht. So big brain. So muss das sein. So hier. Schwerstes m-com. Schwerstes m-com. Also ich finde das hier ist sogar noch schwerer. Deswegen müssen wir gleich schön rein aimen. Ok das war dumm. Das war richtig dumm da rein zu rennen. Dann sterbe ich auch noch. Und die Gegner pushen durch. Das andere ist egal. A ist vollkommen egal. A ist total egal auf der Map. A kannst du eh nicht halten. Du musst B halten. Du musst B halten. Das ist vollkommen egal. A juckt nicht. A juckt absolut gar nicht. Du musst mal gucken. Die pushen nämlich bestimmt gleich von der Seite und solche. Oh nee. Smoke. MonkaS Smoke. Ok die anderen Dude stehen da alle rum. Passt schon. Da kommt noch was. Da kommt noch was. Eine Leute nicht alle immer gleich vor und gleich zurück. Ok der LMG Dude macht das. Also gut gemacht können die an das m-com eigentlich nicht dran. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Die kommen jetzt aber das ist Support der ist bestimmt zu blöd zum Klassen-switchen und kann nicht retten. Ja exellent. Perfekt. So. So. Macht was. Au. Au. Au. Hier ist schon was drinne. Ist da was oben? Nee oder? Oh. Oh. Oh. Ich habe immer übelst Angst dass mein Team da vorne irgendwelche Yolo-Push Aktionen macht die komplette Runde verkackt. Oh nein nein nein. Es sind auch ganz schön wenig an B jetzt dran. Fuck. Wir haben zu viel außen rumgegammelt. Wie viel Rush Server gibt es noch? So 5 würde ich sagen. Ok vorne ist was. Vorne ist ganz schön was angesagt. Oh MQ. M-Track. Ok lass mich durch. Achtung Yolo. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Baschen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Gracias. Oh, oh, hier ist ganz schön viel, ganz schön viel. Habt ihr das gehört, I get fucked in the ass over hier hat er gesagt. Wenn er das so sieht. Nein, aber ich hab noch einen gebashed. Rats, Rats, Rats, Rats. Die haben uns aber echt gut von der ganzen Seite drin. Fetel, Fetel, Fetel, Fetel, die sterben neben dem Stimme. Sechs, fünf, vier, drei, zwei, klick, klick, klick, klick, klick, klick, klick, klick, klick, klick. Exzellent. Okay, jetzt haben sie es. Aber habt ihr gesehen, wie schwer es ist da durchzukommen? Das ist wirklich brutal, ey. Das M-Com ist echt krass. die haben es aber ich glaube die haben es ungewollt alter wo retten der dude rum ich glaube die haben das ungewollt ganz gut gemacht die haben nämlich von allen drei seiten mehr oder weniger gleichzeitig gepusht was eigentlich ziemlich poggers ist ja klar ich dachte wir können ein bisschen kills farmen aber nie ist nichts keine kills farmen die night captain peng wie kommt es eigentlich dass du so niedriges level hast da kommt einem schreck da kommt einfach die ganze map exploded gerade so muss es mache krasse push so an nein ich habe diese kack igla dabei das sagt warum habe ich warum habe ich die igla ok kill mich please oder stimmt das war richtig dumm dass ich die igla am start hatte rpg brauma oder rippe jetzt gerade wieder richtig hat die gegner bambam bepusht bepusht ja so krasse schneiber du sie am arsch der welt ihn gibt es hier natürlich auch ok keine chance hier was zu reißen der typ kann hier einfach seine koggers runden drehen ohne dass was was wir müssen tank den tank bashing anti anti tank koggers das wird nichts kriegt ihr nicht dauern keine chance allein grad geht in panzer ich switch wieder oder was heißt allein wir probieren sie aber das geht gerade nicht muss ich muss jetzt lieber ich muss jetzt erstmal ein bisschen was bashen alter gebashed werden müssen da ist der lrw am start scheiße da machst du nix gegen gerade der joggle alter hier da ist er der joggle terran highway achtung jolo jolo mode ha ha ich bin durchgekommen ja ja natürlich natürlich das das hat nicht gereicht gut ich habe auch nicht gut getroffen aber trotzdem wenn das war ja ganz magazin in die richtung gesprayt kill assist 22 also der der lv du da macht das richtig das war jetzt einfach mal random in die richtung der test wird hier ein 33 bämbel bämbel der fistet uns richtig hast du bämbel viel drei oder bämbel viel vier mehr gespielt bämbel viel drei eindeutig war der kack baum macht der baum da jetzt kann er mal sterben erinnern wir jetzt vielleicht endlich mal tot die machen rap champ des todes dahinten die da ich habe alle alle grenades raus postchamp postchamp postchamp postchamp lull aber hier irgendwo grenades hier hier hier ich brauche granaten aller bämbel jetzt aber wird er echt mal zeit oh sind die an b ok jetzt kann ich das ist der atme mit gottmaut kommt aber echt fast so vor jetzt drücken sie jetzt übrigens test wird beste posi genau da muss was machen die haben das ok das ist der untere der untere ist erstmal egal der wills wissen der test wird jetzt haben sie beides gelegt das ist erster map loss hier monka oh ne doch nicht ich sag nix wahrscheinlich erster map loss du kommst nicht in esl es gibt doch nicht mal mehr eine esl für das game mlg legit gibt es auch nicht mehr gabs das jemals für battlefield 3 gabs das jemals für battlefield 3 überhaupt ja kann ich mich nicht dran erinnern esl wire ja erinner mich nicht daran so ein crap eine esl wire verzeihen ich kenne so ein hässliches windows programm esl wire ne das da das ist so das ist woodface ist das richtiger woodface esl wire so siehts aus so ein krasser woodface gibt es gar nicht wir mussten das für overwatch immer verwenden wir haben ja ab und zu die weekly cups gespielt an overwatch und wir mussten das immer für die cups verwenden und einmal hatten wir über eine stunde delay das weiß ich noch in victor's 137 darstift für prime über eine stunde delay weil bei uns das nicht lief also bei einer kommt einer ist nicht ins game gekommen mit wire und bis sich dann irgendwie einer dazu bequemt hat uns mitzuteilen dass wir es auch ohne wire spielen dürfen hat eine stunde gedauert und irgendwie 50 neustarts oder so aber echt esl wire so so ein krasser pains champ das gibt es gar nicht aber ehrlich gesagt so richtig so richtig so richtig krass aktiv eigentlich nur sie sind eins und zwei achtung achtung pence haben wir die haben wir die jetzt dauernd haben wir die dauerntest wurde es raus ohne test wurde es jetzt bauern ok easy win easy spawn rap ink spawn rap ink easy easy win also leute stellt euch auf die langweilige spawn rap runde ein ha ha ha ha der kill alter der kill habt ihr es gesehen null keck keck triple you into ach stimmt man konnte ja leute in den büschchen hier nicht ratzen was sterben die denn jetzt auf einmal oh flank, flank action, flankerinos massive flank, oh, big brain place von den gegnern huge flank so muss es machen aber ich glaube das hilft auch nicht viel die attacker hatten ein LRV und soll ich euch mal sagen ich bin der meinung die attacker brauchen fast ein LRV so oft das ist so krasses spawn rape action hier das ist nicht normal also oftmals auf metro nicht immer manchmal wirst auch zerstört es war auch das zweite mkomm war auch dahinten irgendwo in der alpha noch ich weiß bis heute ehrlich gesagt nicht warum ich die ähre hatte battlefield 3 alpha spielen zu können vielleicht weil ich damals youtube videos gemacht habe oh das kam von der seite oder wow von wo schießt mich ja was dahinten was das für ein geiler schneibertyp dahinten ok chat ist spannend die runde also ist es extrem intens warum sage ich was extrem intens metro spawn rape runde guck mal wo unsere leute rumgammeln wo wo seid ihr also ich würde sagen die runde muss ich unbedingt aufnehmen und auf youtube als hintergrund verwenden bei einem video wo ich will dass die leute mir zuhören weil das gameplay wegen gucken sie sich das nicht an huge schneiber was ist passiert in du ahi ok nice gute runde gute runde gg it's it's gg gg good game good game superspannende real wie hota dankeschön für den sub massive runde das hoffe ich auch ganz ehrlich bettel für schick skill based matchmaking darf man das überhaupt sagen auf twitch sowas hängen gebliebenes in so einem arcade baller game wie die color of duty oder bettel vieler scheiß auf skill based matchmaking der größte kacke die sollen einfach machen wie jeder das bisher gemacht war was geht man macht den rank modus man macht den rank modus und in diesem rank modus kann man schwitzen tryharten bis einem dahinter platzt ja aber in einem normalen quickplay quick match will ich random shit haben und auch mal bisschen noobs zerstören ich sag eigentlich gar nicht mal jede runde einfach random ja weil ich mein ich werd auch massig runden zerstört aber ich will nicht dieses 50 aufhack ich will nicht dieses 50 50 haben das 50 50 ist das schlimmste aller zeiten du kannst dich freuen wenn du 2a kd hast kann so geil wasch nice runde nice runde vor allem in color of duty verstehe ich nicht ein game was auf kill streaks also auf auf ultra basch runden aufsetzt wie kommt man auf die idee in ein spiel mit kill streaks in ein spiel mit kill streaks wie kommt man auf die idee skill best matchmaking einzubauen mein skill best matchmaking sorgt dafür dass man keine kill streaks erreicht oder vielleicht alle 50 runden mal irgendwie chopper gunner oder so wo ist der sinn warum macht man sich die mühe und überhaupt ein game was auf auf krassen krassen streaks und gebasche basiert und dann sagt man ach nee haben wir umsonst programmiert easy wir machen skill best matchmaking rein so dass es 90 prozent vom game useless ist ja es sind punkte streaks ja ihr habt recht es sind punkte streaks aber guck mal du erreichst ja auch so kaum den chopper gunner richtig dumm und ich bin der meinung keiner hat spaß ich sag es euch wie es ist okay meiner mein nach aber ich sag es euch trotzdem wie es ist selbst die noobs haben keinen spaß wer hat spaß daran die ganze zeit so 50 50 runden zu haben ich finde woran man das gut sieht dass die meist gefeierte map in modern warfare war für shipment ist shipment eine map die der praktikant auf dem klo als er dünnschiss hatte erstellt hat und danach als er eine viertel stunde auf dem klo war kam er raus als ich hab shipment erstellt so und die wird gefeiert warum wird die gefeiert weil man darauf seine waffen leveln kann darauf kam das ist der einzige grund shipment ist gameplay technisch eine absolute kack map by the way unpopuläre meinung nuketown auch aber shipment ist ja die offensichtlich offensichtlichste test map überhaupt ja und das shipment so beliebt ist liegt einzeln daran die leute wollen diesen scheiß im multiplayer gar nicht spielen die wollen ihre waffen leveln und gut ist deswegen ist shipment populär der multiplayer wird nur gespielt captain peng du müsstest du nehmen mal sprint rein am besten weil ich hab ich hab ammo ane du hast granaten okay alles klar fast sprint wäre auch noch nice jetzt haben wir den joggel der joggel jetzt kann uns nix passieren wenn der joggel am start ist meine route ist da übelst verschissen what the hell ist hier wieder los oh jetzt wird von der seite reingepusht seiten pusher sind am start hier ist nix mehr dran wie haben wir schon angelegt lull wie du okay die kriegen grad echt auf den sack die kriegen grad echt ganz gut auf den sack kein cute mod stimmt der sebaro ist ja ganz ja ah der sebaro muss bestimmt muss bestimmt informatik stellz lärm unter mir ist was oh nee fuck jetzt blitz falls noch raus geht immer raus er macht nichts verrennen oh nice dankeschön dankeschön hallo battlefield ich glaube die sind noch hinter uns oh granate das war hinter der wand please okay battlefield logisch ist nicht immer logisch okay jetzt jetzt werden sie ja instant tryhard die gegner jetzt eben noch voll auf den sack gekriegt und jetzt der tryhard mode raus oh was okay die battlefield für sie was ist was leute ich bin absolut verwirrt was geht was geht hier gerade wollte er gerade mich messen und deswegen habe ich so einen boost bekommen oder so okay captain pang ich komm bei dir mit what is happening ja das frag ich mich ernsthaft komm her komm her fuck ich dachte da oben ist was hallo please move keep on moving oh der macht die legehenne der macht die richtig echte legit first class legehenne die massive big brain legehenne ist am start die war gerade auf b hol auf ey what the f**k hei hei hei hei hei hei ok ok ich camp mir mal kurz hier oben einen ab ich kann da nicht runter, ich, leute, leute, ich kann da nicht runter ich, ich kann euch aber, ich kann euch aber bei mir spawnen lassen frex out auf auf auf auf auf post jam post jam post jam wo seid ihr? haben wir hier ne muni kiste? ah nice nade gib granate, gib granate hallo muni kiste please granate aufladen mist max wo ist dein noob tube? ich hab kein noob tube in dem game glaub ich hab mich nicht mal unlocked 320 hast du steil an mich unlocked ok ok jetzt achtung achtung jetzt massive champ massive champ jetzt kommts jetzt NEIN der sitzt, der sitzt da hinten und wartet bis einer rausläuft alter lull damit hätte ich ja im leben nicht gerechnet, dass da so ein kleiner stellzermann drinne ist im leben nicht im leben nicht moment falsche richtung wo ich hier lange oh das sind 30 an enemies jetzt wirds aber grad anstrengend massive nade hinten in den tunnel jawoll die kommt gut die kommt gut bam ok die sind schon alle weg spring champ spring champ ich wusste es genau dass ihr da seid leute ich wusste es ich wusste es ich hab euch predicted massive prediktungs champ ey meine granate war um die ecke ok ok ok ok post champ post champ post champ jetzt um die ecke oh oh oh oh oh safe safe alter fall da oh oh alter fall da jetzt jetzt ne nade oh nein shotgun noob nein nicht wirklich nee wirklich an der stelle bietet sich tatsächlich an judentag äh bietet sich tatsächlich an dass man shotgun spielt warum nicht why not fuck wir müssen eigentlich hier lang stelsen jetzt kann man hier durch die tür durch die tür den tür bash machen oh nice der tür bash der door bash ist real der door bash achtung gleich kommen um die ecke bam der door bash auf komm komm komm um die ecke komm nur um die ecke ich muss euch bashen ich laufe da jetzt nicht hin ich aim jetzt einfach nur wie der letzte kack um die ecke ab komm raus komm raus okay ich hab keinen bock keep on moving ha passen sich durch die tür durch ordinate ordinate keep on moving okay jetzt ey wie sie sich da wie sie sich da stapeln an der ecke achtung huge flank massive flank herino ich bin zu dick gewesen, ich hab schon um die ecke geguckt hat um die Ecke geguckt, bevor ich um die Ecke gekommen bin. Deswegen wurde das nix. Oh ja! Flankchamp, Flankierungschamp! Massive Flankierungschamp! Massive Flankierungschamp am Start! Huge! Spotted the Hostile Schieber! Lo-lo-lo-lo! Oh! Äh, was wollten wir? Firestorm, Kack, Island, Dema, Vent, Peek, äh, Firestorm, Firestorm, Caspian. Komm, Caspianborder hatten wir lange nicht mehr. Nice Runde! Hat aber auch wieder Bock gemacht. Du-du-du-du-du-du-du. Ja, Veltel-Error flankt so hart und killt die Gegner schon im Spawn-Menü. So sieht's aus. So sieht's aus. So, mal gucken ob ich noch Platz auf der Platte hab. Ach ja, ja, brauch ja kaum was, brauch ja. So, was kommt denn jetzt? Das war die Hinrunde Metro. Das war die Hinrunde Metro. Ich hab Hunger, wisst ihr das? Warte mal ab was für ne Map kommt. Eigentlich hab ich weder auf Firestorm noch auf Caspianborder Bock. Dema, Vent, Peek. Ok, Dema, Vent, Peek könnte man sich vielleicht nochmal geben. Dema, Vent, Peek könnte man sich nochmal geben, ja. Gestern Space Extreme geschaut. Nee, aber ich hab die Zusammenfassung geguckt. Es war richtig nice. Dieses, äh, wie heißt das? Spaceship-Landung hat halt nicht ganz hingehauen, aber der Rest sah schon geil aus, ne? Das Ding sieht überhaupt nicht aus. Das Ding sieht überhaupt nicht wie so ne 115 Rakete aus. Das sieht halt so richtig futuristisch aus. Und, äh, auch der Antrieb sieht überhaupt nicht so raketenmäßig aus. Das sieht eher so Bunsenbrenner-mäßig aus. Echt nice. Ich guck meistens nur die Zusammenfassung. Ich guck meistens nur die Zusammenfassung, weil ansonsten die anderen Streams gehen irgendwie von 85 Billiarden Minuten. Oh,Oh,Oh,Oh. B,B,B,B,B,B,B, B,B,B,B,B,B,B,B,B,B,B,B,B,B,B,B,B. Okay, verschissen. Das Ding sieht aus wie ein Getreidesilo. Ah, naja, es, es, es find halt cool, dass es so glänzt. Oh, Dachchamp am Start. Ah, naja, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es. Oh, Dachchamp am Start! Ein exzellenter Dachchamp! Ich warte jetzt hier einfach. Warum soll ich hier rausgehen? What the hell ist das? Oh fuck, die haben schon gelegt! Okay, okay, okay, okay. Postchamp, Postchamp. Wir brauchen Big-Prain-Aktion Leute. Only Big-Prain-Aktion. Die retten uns jetzt. Wir brauchen wirklich Big-Prain-Aktion. Sonst geht's nicht. Only Big...oh. Wir brauchen irgendwie eine richtig massive 500 IQ-Aktion, dass wir die Gegner hier wieder raus der Base kriegen. Irgendwas, irgendwas richtig Big-Prainiges brauchen wir da jetzt. Weil sonst haben wir die Base verloren. Die stehen da mit dem Auto drin und alles. Only Big-Prain brauchen wir jetzt. Scheiße, guck. Wie viel, wie viel 5 Billionen Gegner sind hier am Start? 5 Trillionen Gegner. Ey, der Tasteful, der will's aber echt wissen immer. Der will's immer voll wissen, der Dude. Letzte Runde hatten halt fast alle guten Spieler auf einer Seite. Das war halt busy, busy einseitig, ne. So, mal gucken, ob das jetzt hinhaut. Mal gucken, ob hier Big-Prain-Aktion. Massive-Prain-Aktion jetzt hier, Leute. Oh, da kommt was. Oh, jetzt wollen sie zu mir. Jetzt wollen sie mich bashen. Die haben gelegt, die haben die Legehände gemacht in der Zwischenzeit. Guckt mal, während wir hier rumgenoopt haben, haben die die Legehände gemacht. Es ist keiner mehr hinten. Während wir gebashed haben, haben die die Legehände gemacht. Das ist doch scheiße. Richtig Low-Prain-Aim. Ich hab schon versucht, während ich den einen gekillt hab, auf den anderen rüberzuziehen. Das war ziemlich bescheuert. Der Flank war wieder, der Flank war wieder next level. Der Flank war gut. Oh, es ist auch noch A. Bei A geht klar. A geht voll klar. Okay, ich mach wieder, ich mach wieder Big-Prain-Flank. Der Automann, der kriegt diese Runde richtig was gerissen. What the fuck, Battlefield, please. Das war so ein geiler Flank gerade, aber nope. Aber kein Bock. Oh, das Auto, das Auto, nein. Richtiges Oldschool-Film, ja, macht auch Bock. Guck mal, der Chat wieder geflamet wird wieder. Okay. Big-Prain, Big-Prain, Diffuse, Diffuse-Champ. Hä? Oh, oh nee, Smoke-Champ. Okay, da drüben ist nix mehr. Wo sind, sind die auf dem Dach hier, kann das sein? Ich kann den nicht gerätzen, oh shit. Versuch euch zu holen, Jungs. Der ist da rechts unten in der Ecke. Man. Obrit, Obrit, basht sie weg. Okay, 29 noch. 29 geht, 29 geht. Pause-Champ. Ach so, das ist einer von mir. What the fuck? Wo, wo, wo? Da will er, da will er einfach drauf landen. Nee, nee, so einfach geht's ja nicht hier. Landungs-Champ können wir nicht so einfach durchgehen lassen. Fadel, ich hol dich. Woa, wie schnell der wieder am Start war. Ich fass es nicht. Ach, das war recht so ein Dude. Nee. Wisst ihr, was ich auch nice an Battlefield 3 finde? Dass jeder nen Kill kriegt. Also sprich, der, nee nee, Spaß, also der, der wiederbelebt wird, kriegt keinen Death. Aber du kriegst den Kill, was echt nice ist. Da fühlt sich keiner irgendwie verarscht. Du kriegst den Kill, weil du hast ihn ja auch gekillt. Und er kriegt keinen Death, weil er wiederbelebt wurde. Find ich eigentlich fair. Find ich echt fair. Hallo. Nice Champ. Nice. Kann ich mir das später als Wiederholung ansehen? Ja. Ja, ja, kannst du? Kannst du? Wobei, die Runde jetzt ist vielleicht nicht gerade wert, sich als Wiederholung anzugucken. Wir hatten schon richtig nice Runden heute. Und der Stream ist als Watt da. Ich hab ja keine Musik laufen. Wie lange sind wir eigentlich schon? On. Zwei Stunden. Dann hab ich ein paar Mal neu, statt zweieinhalb Stunden oder so. Und jetzt? Oh, jetzt Demavent Peak Attacker. Jawoll. Hab ich Bock drauf. Wie sieht es an der Cheaterfront in Battlefield 3 aus? Also wir hatten nur zwei Cheater. Einen hatte ich Offstream, einen hatten wir Onstream. Vorhin hatte ich einen, der mit einem LMG One-Shotted hat, across map. Also das war schon, und immer wieder. Das war schon recht verdächtig. Aber wahrscheinlich war der einfach nur besser als ich. Das wahrscheinlich, man muss ja nicht immer alles als Cheater bezeichnen. Kann schon mal sein, across the map mit dem LMG. 50 Mal hintereinander in 30 Sekunden. Kann schon mal passieren. Lucky, kann schon mal passieren. Wir sollten auch so einen geilen Autofahrt-Champ machen, wie die. Jetzt seh ich schon Big Brain, Runde am Start. Also übrigens der Heli. Alter, kann ich mal den Dude erwischen da drin? Nice Charge, exquisite. Komm runter. Lege Henne, die Lege Henne is real. Kann man den durch? Nee, oder? 0W Ich retze nicht, kann ich retzen? Das war knapp. Ich leg mich mal kurz hin. Ja ja ja, PogChamp, erwische ich ihn? Nein. Hallo, springen please. Elite Soldat, kletter da mal hoch. Huge Elite Soldier. In your face, man. Richtig schön ins Gesicht. Jawoll, genau, wo war hier der Aufgang? Das ist nämlich auch Pogger-Scooter hier. Ich weiß immer nicht, ob die vom Hersteller so gedacht war oder nicht. Aber ich geh jetzt einfach mal von aus. Der Joggl wieder. Sterb-Champ. Ich hoffe, die haben nicht den Heli. Oh, Fatal Error, Alter, Alter, Alter. Jetzt, ja ja, jetzt übertreibt man nicht. Meine Güte. Oh, der macht Lege Henne. Nein, nein, ich... Warum guckst du denn hier her, wenn wir grad Lege Henne auf der anderen Seite machen? Max, kennst du noch deinen YouTube-Channel? Ich weiß nicht mehr, wie hieß der nochmal? Ich kann nämlich nicht mehr richtig dran erinnern. In your ass. Alter, was ist denn hier grad los? Katze FPS war mein YouTube-Channel. Ah, stimmt. Ja, jetzt gut, dass du's gesagt hast. Jetzt fällt's mir wieder ein. Jetzt fällt's mir wieder ein. Jetzt hab ich's wieder. Wie, wir haben nichts bekommen? In den Kopf, Alter. Aber voll in den Kopf. Nice, Dankeschön. Voll den Ass gesaved hat er mir. Voll den Ass gesaved. Okay. Yolo. Nein, nein, nein, nein. Oh. Bash FPS, stimmt, Bash FPS war's. Aber wir sind nicht mehr in der Base drinnen. Fuck. Ah, Captain Peng ist weg, wie's aussieht. Okay, Leute, dann ist das letzte Runde. Letzte Runde. Ich muss was essen, ich hab Hunger. Letzte Runde. Mal gucken, wie lange die geht. Die Map hat ja mehr oder weniger erst angefangen. Und werde ich Cyberpunk spielen? Ja, aber wahrscheinlich nicht, jetzt und nicht on stream. Oder eventuell, eventuell kauf ich mir ein Spiel so da abends. Aber nicht im Stream. Gleich Basejump. Basejump Champ gibt's erst, wenn wir das hier geschafft haben. Die defusen, oder? Oh, jetzt haben sie mich gereckt. Richtig gereckt, geschreckt. Oh nein, die Homs disarmed. Ich dachte, gleich gehen sie in die Luft. Was? Fuck, man. Warum war das eigentlich nicht im Kopf gerade? Nice. Das war ne Pogger-Slay-Gehände nochmal, ha? Next. Oh, was ist da hinten? Was machen die dann hier? Backrate Champ? Oh, nee, alle schon tot. Jetzt, Basejump. Basejump. Oder wie die Wiebs sagen, Basejump. Oh, der war schlecht, oder? Der war schlecht, aber ich fand's lustig. Basejump. Oh, fuck. Abrutsch, Champ. Das ist runtergefallen. Okay, drei Stunden später. Oh, nee. Basejump, genau. M-Com-Champ. Guck mal, wir sind fast dran. Jetzt easy, easy, die haben uns nicht gespottet. Die haben uns nicht gespottet. Easy plan, easy plan. Und jetzt zeig ich euch Poggers Position. What? Als wär ich da drauf gewesen. Als wär ich da drauf gewesen. Wollt euch eigentlich die Poggers Posi zeigen? Nein. Fail spawned. Wie genau hat der das geschafft, da zu sterben? Das ist ein Claymore. Wo ist der Camp Champ? Irgendwo war der Camp Champ hier. Der war doch eben einer hier. Hallo? Okay, dann nicht. Okay, jetzt aber. Alter, guck mal hier mein Team. Mein Team macht das easy alleine, gar kein Problem. N64 stones, ja. Der Joggl. Okay. Rennchamp. Achtung, jetzt zeig ich euch die Poggers Posi. Hier ist die Poggers Posi, hier. Wenn man trifft schon. Die Posi da ist echt OP. Ohne Mist. Ohne Mist, die Posi ist gut. Der Spieler ist einfach nur schlecht. Der es euch zeigt. Die haben unseren Heli geklaut, by the way. Die Posi ist richtig gut. Die können nicht reinschießen vom spawnen. Hier siehst du alles. Hallo, Battlefield. Okay, gehen wir rechts. Oh nee, geht doch gar nicht auf. Die passt vom Timing her. Können wir losrennen? Nice. Hier ist ein Panzer. Ja, ja, ja. Okay, nix da, nix da. Postchamp, Postchamp, Postchamp, wie kommen wir durch? Fuck, Muni alle. Du bist nicht der Beste, was egal ist, aber du hast mega Spielverständnis. Dankeschön, Chat. Nice. Das höre ich gerne. Ich habe auch ewig nicht gespielt. Stimmt, der Beste bin ich nicht. Ich behaupte es wenigstens auch nicht. Was ist denn hier los? Eine Güte war in den Klumpen. Monka, S, da steht direkt ein Panzer und will mir ins Gesicht schießen. Was ist denn? Der Tasmod wieder, der Tasmod. Tasmod 226, jawoll. Ich bin eigentlich total ungern in diesen Kacktunnels drin. Am liebsten bin ich ehrlich gesagt auf der anderen Seite. Da wo der LKW ist. Hätte ja klappen können, hätte ja klappen können. Drehst du mal um? Heli, Mann, dreh mal um, ich will dich rausballern. Okay. Ach Gott, gibt es doch nicht. Warum drücken die jetzt auf einmal easy clap die erste Runde und jetzt sowas? Was soll ich an? Der hat jetzt 5 Kills an uns gefarmt, der Grimpy. Moment, legt das M. Komm, der Fatal, Alter. Der Fatal, Fatale M-Komplett. Oh nice, huge. Alter. Alter, wie fatal er das macht einfach nur. Okay. Skill-Best-Matchmaking. Stellt euch vor, Battlefield mit Skill-Best-Matchmaking. Ich kann es mir kaum Schlimmeres vorstellen. Ich kann es mir kaum Schlimmer vorstellen. Da war was. Oh, von hinten. Von hinten Anstelltschamp. Oh, oh. Okay Leute, ich lasse euch spawnen bei mir, ich kann jetzt gerade nicht raus. Ich lasse euch spawnen. Da ist einfach mal so ein Panzer vor mir. Nein. Zu spät gesehen. Auf der Xbox und der Playstation ist das Spiel tot. Ich weiß es nicht. Ich habe, seit ich das auf dem PC spiele, nicht mehr auf der Konsole gespielt. Reparatur-Champ. Den Bug mit der Flamme gibt es übrigens immer noch. Oh, jetzt kommt Big Brain Plays, ich sehe es von hinten in den Tunnel. Massive Plays. Fatal, du musst jetzt die 505-Head-611-Head-Plays machen. Wollen wir den Heli hier wirklich stehen lassen? Wir sollten den Heli hier nicht stehen lassen, Leute. Ha, gleiche Idee. Alter, ist die UMP scheiße. Was ein Crap. Oh mein Gott, ist die UMP schlecht. Jetzt sollten wir es aber haben. Yolo, Yolo-Champ. Okay, ich sehe nichts. Ich sehe gar nichts. Da ist noch was dran. Schreckt, Pence-Man. Jaja, macht ihr mal. Haut die Granaten raus, alles gut. Panzer, schreck dich. Falls du überhaupt beschädigst, ist das gar nicht beschädigt. Keep on moving. Nochmal Engie. Okay, ich stelle es jetzt einfach mit meinem Panzer. Auf, Panzer, let's go. What the hell? Von wo? Ach, da ist hinter uns noch der Dude. Fuck. Okay, huge, huge jump. Massive Champ. Okay, okay, wo geht hier was? Achtung, B, B Leute, ich sage es euch. Jetzt, die lege Henne, die lege Henne geht durch. Und jetzt muss ich das aufs Dach, aufs Dach. Die lege Henne macht das. Easy. Andere Seite. Easy, easy win, easy win, ich sage es euch, Leute. Was? Diffusungs Champ. Nicht wirklich, oder ihr habt nicht wirklich diffusen. Okay, ich wusste gar nicht, wo der Typ ist. Das war gar kein easy win. Ich hoffe echt, Venise Unleashed kommt raus. Ich sage euch, es wäre so geil, wenn ihr mit Battlefield 3 ein bisschen was wieder reißen könntest auf YouTube. Aber ich glaube es ja nicht. Ganz ehrlich, das spiele ich von 2011. Die Leute, die heute am Start sind und sowas wie Warthorn und so feiern. Ich meine, Warthorn ist schon mit das brauchbarste Call of Duty-Sei seit Jahren, ja. Aber... Hallo. Aber trotzdem. Aua. Easy clap. Nee, die Runde schafft es nicht auf YouTube, so geil war die Runde nicht. Bei Venise Unleashed kann man selber hosten, ja. Ich bin mir halt nicht ganz sicher. Wenn das einfach nur Modding-Tools sind, dann wird das nichts großartig bringen. Weil ganz ehrlich, wer setzt sich jetzt hin nach dem Release und macht dann noch ein Jahr einen Battlefield 3 Mod? Ich meine, dann ist das Spiel 20 Jahre, ähm, 10 Jahre alt. Also eigentlich müsste das rauskommen und irgendwie auch ein bisschen was bieten, wo die Leute wieder sagen, oh ja, da muss ich jetzt. Nee Leute, ich mache Schluss, ich gehe jetzt essen, ich habe übelst Hunger. War aber ultra nice wieder, hat Spaß gemacht. Schön, dass so viele am Start gewesen sind. Ähm... Jo, wir sehen uns dann. Bis dann. Aua, mach es gut. See you.", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "So"}, {"id": 2, "start": 2.0, "end": 4.0, "text": "So"}, {"id": 3, "start": 4.0, "end": 6.0, "text": "So"}, {"id": 4, "start": 6.0, "end": 8.0, "text": "So"}, {"id": 5, "start": 8.0, "end": 10.0, "text": "So"}, {"id": 6, "start": 10.0, "end": 12.0, "text": "So"}, {"id": 7, "start": 12.0, "end": 14.0, "text": "So"}, {"id": 8, "start": 14.0, "end": 16.0, "text": "Hier"}, {"id": 9, "start": 16.0, "end": 18.0, "text": "Also"}, {"id": 10, "start": 18.0, "end": 20.0, "text": "Ist jetzt"}, {"id": 11, "start": 20.0, "end": 22.0, "text": "Jetzt hat es das gecheckt"}, {"id": 12, "start": 22.0, "end": 24.0, "text": "Alter Twitch Mensch ey"}, {"id": 13, "start": 24.0, "end": 26.0, "text": "Das sind exakt die gleichen Settings"}, {"id": 14, "start": 26.0, "end": 28.0, "text": "Genau das gleiche was ich das letzte Mal hatte"}, {"id": 15, "start": 28.0, "end": 30.0, "text": "Jetzt wills hoffentlich"}, {"id": 16, "start": 30.0, "end": 32.0, "text": "Ist jetzt 1080 und sieht besser aus"}, {"id": 17, "start": 32.0, "end": 34.0, "text": "Ja ne"}, {"id": 18, "start": 36.0, "end": 38.0, "text": "Meine Güte ey"}, {"id": 19, "start": 38.0, "end": 40.0, "text": "Übelster Sack"}, {"id": 20, "start": 44.0, "end": 46.0, "text": "Ok jetzt aber"}, {"id": 21, "start": 46.0, "end": 48.0, "text": "Ok ich glaube wir"}, {"id": 22, "start": 48.0, "end": 50.0, "text": "Destroyen den Server gerade so ein bisschen"}, {"id": 23, "start": 50.0, "end": 52.0, "text": "Kann das sein? Ist das"}, {"id": 24, "start": 52.0, "end": 74.0, "text": "Möglich?"}, {"id": 25, "start": 74.0, "end": 76.0, "text": "Ok jetzt machen wir Trick 17"}, {"id": 26, "start": 76.0, "end": 78.0, "text": "Man kann nämlich hier hinten rumstelzen"}, {"id": 27, "start": 78.0, "end": 80.0, "text": "Das"}, {"id": 28, "start": 80.0, "end": 82.0, "text": "Übrigens der Grund"}, {"id": 29, "start": 82.0, "end": 84.0, "text": "Das Übrigens der Grund warum ich eigentlich"}, {"id": 30, "start": 84.0, "end": 86.0, "text": "Immer Delay hab"}, {"id": 31, "start": 86.0, "end": 88.0, "text": "Habt ihr die Waffe"}, {"id": 32, "start": 88.0, "end": 90.0, "text": "Rumlenken gesehen?"}, {"id": 33, "start": 102.0, "end": 104.0, "text": "Ha"}, {"id": 34, "start": 104.0, "end": 106.0, "text": "Die flüchten"}, {"id": 35, "start": 106.0, "end": 108.0, "text": "Einfach"}, {"id": 36, "start": 108.0, "end": 110.0, "text": "Sie sind"}, {"id": 37, "start": 110.0, "end": 112.0, "text": "Einfach geflüchtet habt ihr das gesehen?"}, {"id": 38, "start": 114.0, "end": 116.0, "text": "Ich denke nicht dass sich jemand streamschreibt"}, {"id": 39, "start": 116.0, "end": 118.0, "text": "Doch"}, {"id": 40, "start": 118.0, "end": 120.0, "text": "Und wie ey letztens der Wahnsinn"}, {"id": 41, "start": 120.0, "end": 122.0, "text": "Ich hätte auch nicht gedacht das Leute in Battlefield 3"}, {"id": 42, "start": 122.0, "end": 124.0, "text": "Ich mein Streamschreiben in Battlefield 3"}, {"id": 43, "start": 126.0, "end": 128.0, "text": "Da fällt mir gar kein Vergleich"}, {"id": 44, "start": 128.0, "end": 130.0, "text": "Zu ein"}, {"id": 45, "start": 130.0, "end": 132.0, "text": "Das ist Omega 0 aber es gibt"}, {"id": 46, "start": 132.0, "end": 140.0, "text": "Leute die machen das"}, {"id": 47, "start": 140.0, "end": 142.0, "text": "Hier"}, {"id": 48, "start": 142.0, "end": 144.0, "text": "Der Kreisel"}, {"id": 49, "start": 144.0, "end": 146.0, "text": "Der Kreisel Springer"}, {"id": 50, "start": 150.0, "end": 152.0, "text": "Au"}, {"id": 51, "start": 156.0, "end": 158.0, "text": "Kurz regnen"}, {"id": 52, "start": 158.0, "end": 160.0, "text": "Doch"}, {"id": 53, "start": 160.0, "end": 162.0, "text": "Doch das ist das Schlimme das haben mich"}, {"id": 54, "start": 162.0, "end": 164.0, "text": "Leute gestreamschreibt"}, {"id": 55, "start": 164.0, "end": 166.0, "text": "Ich kanns mir nicht"}, {"id": 56, "start": 166.0, "end": 168.0, "text": "Ich kanns mir auch nicht erklären aber das"}, {"id": 57, "start": 168.0, "end": 170.0, "text": "Doch war eigentlich"}, {"id": 58, "start": 170.0, "end": 172.0, "text": "Total hängen geblieben weil man sich vorstellt das"}, {"id": 59, "start": 172.0, "end": 174.0, "text": "Battlefield 3"}, {"id": 60, "start": 174.0, "end": 176.0, "text": "Battlefield 3 ist es"}, {"id": 61, "start": 176.0, "end": 178.0, "text": "Battlefield 3 man"}, {"id": 62, "start": 178.0, "end": 181.0, "text": "Wo"}, {"id": 63, "start": 187.0, "end": 189.0, "text": "Ok wo stelle ich"}, {"id": 64, "start": 189.0, "end": 191.0, "text": "Sie"}, {"id": 65, "start": 191.0, "end": 193.0, "text": "Bestimmt oben"}, {"id": 66, "start": 198.0, "end": 200.0, "text": "Wo ist hier was"}, {"id": 67, "start": 200.0, "end": 202.0, "text": "Ich brauch erst kurz um rein zu kommen"}, {"id": 68, "start": 202.0, "end": 221.08, "text": "ich weiß nicht wo es genau rumgestellts hat what the hell"}, {"id": 69, "start": 221.08, "end": 225.62, "text": "oh ich wollt den heli-typ schneiden oder rausballern"}, {"id": 70, "start": 225.62, "end": 235.92, "text": "jetzt wenn es gebashed kleinen stells aus"}, {"id": 71, "start": 235.92, "end": 246.44, "text": "fuck grenade fuck grenade"}, {"id": 72, "start": 246.44, "end": 256.28, "text": "okay da drüben ach wir haben noch gar nicht beides ah das hat mich verwirrt dachte wir hatten beides"}, {"id": 73, "start": 256.28, "end": 258.8, "text": "gleich kommt da pass auf pass auf pass auf gleich kommt da"}, {"id": 74, "start": 258.8, "end": 268.56, "text": "von der seite hätte ich nicht gedacht dass da irgendeiner ist nice thx"}, {"id": 75, "start": 268.56, "end": 277.68, "text": "was hier los wisst ihr was cool wäre wenn man"}, {"id": 76, "start": 277.68, "end": 284.52, "text": "shit wenn man die lay nachträglich rein machen könnte die was ist hier los"}, {"id": 77, "start": 284.52, "end": 289.6, "text": "team play sehe ich das richtig jetzt hier ist team play angesagt einfach einfach legit legit"}, {"id": 78, "start": 289.6, "end": 301.04, "text": "team play nein alter legit team play guck mal hier ich wäre sogar chain rest"}, {"id": 79, "start": 301.04, "end": 313.6, "text": "guckt euch an jetzt wollen sie es wissen jetzt wollen sie es echt wissen aber mein squad macht"}, {"id": 80, "start": 313.6, "end": 322.92, "text": "das mein squad macht das easy easy win bringt sich die gegner also heute sind gar nicht so"}, {"id": 81, "start": 322.92, "end": 332.48, "text": "viele prime hoops am start jetzt trick 17 absprung zone"}, {"id": 82, "start": 332.48, "end": 341.28, "text": "das nicht ich weiß was ich das nächste mal machen das nächste mal also ich mach"}, {"id": 83, "start": 341.28, "end": 346.56, "text": "wieder mit die lay uns ich werde das einfach vorher so lange neu starten bis"}, {"id": 84, "start": 346.56, "end": 350.36, "text": "tritts das gecheckt hat"}, {"id": 85, "start": 350.36, "end": 356.68, "text": "kippen moving dieser komische well feel 3 ansage am ende der runde immer kippen"}, {"id": 86, "start": 356.68, "end": 381.96, "text": "moving also mal ganz im ernst hier das ist ja drei kilometer weit was geht mit"}, {"id": 87, "start": 381.96, "end": 406.92, "text": "was ist mit den leuten kann los hier durch das warn nice sehr gut hast du den gekrappt exquisite"}, {"id": 88, "start": 406.92, "end": 420.76, "text": "hallo bettel field please kann den repair ich kann ihn auch repairen ich gehe mal hier als"}, {"id": 89, "start": 420.76, "end": 435.52, "text": "engie oh nein das war jetzt doch wollte eigentlich als engie rein weil der hat der hat schon einen"}, {"id": 90, "start": 435.52, "end": 464.76, "text": "drin oder jetzt haben wir repair repair gem hat gut funktioniert"}, {"id": 91, "start": 464.76, "end": 477.84, "text": "ok jolo mode"}, {"id": 92, "start": 477.84, "end": 501.64, "text": "ja genau netz rein netz rein perfekt perfekt"}, {"id": 93, "start": 501.64, "end": 515.76, "text": "h going hmm"}, {"id": 94, "start": 515.76, "end": 530.56, "text": "hallo aber die läge hänne die lege hänne funst noch"}, {"id": 95, "start": 530.56, "end": 532.56, "text": "Haben die grad..."}, {"id": 96, "start": 532.56, "end": 534.56, "text": "Fuck, die haben schon wieder diffuset."}, {"id": 97, "start": 535.88, "end": 537.88, "text": "Der Chat ist wieder richtig geil grade."}, {"id": 98, "start": 540.92, "end": 542.92, "text": "Ich warte mal bis wir unten sind hier."}, {"id": 99, "start": 543.48, "end": 544.92, "text": "Der Chat ist wieder richtig geil."}, {"id": 100, "start": 544.92, "end": 546.92, "text": "So richtig typisch deutscher Chat."}, {"id": 101, "start": 546.92, "end": 573.56, "text": "Wieder alles so am rumflamen."}, {"id": 102, "start": 573.56, "end": 575.56, "text": "Alter, was ist hier los?"}, {"id": 103, "start": 575.56, "end": 577.56, "text": "Ey, what the fuck?"}, {"id": 104, "start": 577.56, "end": 579.56, "text": "Das ist doch nicht normal."}, {"id": 105, "start": 579.56, "end": 581.56, "text": "Du wirst hier wirklich überall beschossen."}, {"id": 106, "start": 585.56, "end": 587.56, "text": "Aber, diesmal muss man echt sagen..."}, {"id": 107, "start": 589.56, "end": 591.56, "text": "Die Gegner sind besser."}, {"id": 108, "start": 593.56, "end": 595.56, "text": "Die Gegner sind besser."}, {"id": 109, "start": 597.56, "end": 599.56, "text": "Ach, Wolle."}, {"id": 110, "start": 599.56, "end": 601.56, "text": "Das ist doch wirklich kein Ding, ey."}, {"id": 111, "start": 601.56, "end": 603.56, "text": "Aber ich muss ohne Scheiß, ich muss Delay reinmachen."}, {"id": 112, "start": 603.56, "end": 607.56, "text": "Ich weiß nur, dass ich mir immer einbilde, dass irgendeiner guckt, wo man lang läuft."}, {"id": 113, "start": 607.56, "end": 609.56, "text": "Sackt richtig."}, {"id": 114, "start": 609.56, "end": 611.56, "text": "Ich bin mal... Nee, jetzt kommt's."}, {"id": 115, "start": 615.56, "end": 619.56, "text": "Ja, jetzt kommt nochmal Defender, der immer wenn piek, ne?"}, {"id": 116, "start": 623.56, "end": 625.56, "text": "Jetzt kommt nochmal Defender, der immer wenn piek."}, {"id": 117, "start": 625.56, "end": 627.56, "text": "Ja."}, {"id": 118, "start": 629.56, "end": 631.56, "text": "Schauen wir mal."}, {"id": 119, "start": 633.56, "end": 635.56, "text": "Wir brauchen Motivationsmusik."}, {"id": 120, "start": 635.56, "end": 637.56, "text": "Kirby."}, {"id": 121, "start": 649.56, "end": 651.56, "text": "Ja, perfekt."}, {"id": 122, "start": 651.56, "end": 653.56, "text": "Ja, perfekt."}, {"id": 123, "start": 661.56, "end": 663.56, "text": "Jetzt kann nichts mehr schief gehen, Leute."}, {"id": 124, "start": 669.56, "end": 671.56, "text": "Cat Jam."}, {"id": 125, "start": 671.56, "end": 673.56, "text": "Cat Jam."}, {"id": 126, "start": 673.56, "end": 689.56, "text": "Die sind da schon mit dem fucking Auto am Start, ey."}, {"id": 127, "start": 703.56, "end": 705.56, "text": "Da geht er an B."}, {"id": 128, "start": 719.56, "end": 721.56, "text": "Okay, Moment, ich hör nix."}, {"id": 129, "start": 721.56, "end": 729.56, "text": "Dude, Dude, Dude, Dude, Dude."}, {"id": 130, "start": 733.56, "end": 735.56, "text": "Haha, was ist das?"}, {"id": 131, "start": 735.56, "end": 751.56, "text": "Battlefield, Alter."}, {"id": 132, "start": 751.56, "end": 753.56, "text": "Was ist mit dem Dude hinter der Mauer los?"}, {"id": 133, "start": 781.56, "end": 783.56, "text": "Boah."}, {"id": 134, "start": 789.56, "end": 791.56, "text": "Da unten war was drin."}, {"id": 135, "start": 795.56, "end": 801.56, "text": "Alter, das ist irgendeiner der random Server, die da eben so am Start ist."}, {"id": 136, "start": 801.56, "end": 803.56, "text": "Tja, das fragt man sich."}, {"id": 137, "start": 805.56, "end": 807.56, "text": "Kommt man hier nochmal raus?"}, {"id": 138, "start": 815.56, "end": 819.56, "text": "Ich bin mal gespannt, was mit Venise Unleashed ist."}, {"id": 139, "start": 819.56, "end": 829.56, "text": "Am Ende des Jahres, also quasi nächste Woche oder so, wer weiß nicht, wann das kommt."}, {"id": 140, "start": 829.56, "end": 831.56, "text": "Venise."}, {"id": 141, "start": 835.56, "end": 837.56, "text": "Ey, die Gegner sind ja ultra scharf drauf."}, {"id": 142, "start": 837.56, "end": 839.56, "text": "Was ist denn hier los?"}, {"id": 143, "start": 839.56, "end": 841.56, "text": "Ey, die Gegner sind ja ultra scharf drauf."}, {"id": 144, "start": 841.56, "end": 843.56, "text": "Was ist denn hier los?"}, {"id": 145, "start": 863.56, "end": 865.56, "text": "Die Gegner sind mega heiß."}, {"id": 146, "start": 865.56, "end": 867.56, "text": "Auf einen, da oben kann ich jetzt, wobei doch."}, {"id": 147, "start": 869.56, "end": 871.56, "text": "What?"}, {"id": 148, "start": 873.56, "end": 875.56, "text": "Den hab ich überhaupt nicht gesehen."}, {"id": 149, "start": 877.56, "end": 879.56, "text": "Die Gegner sind mega heiß drauf hier."}, {"id": 150, "start": 885.56, "end": 887.56, "text": "Okay, aber es ist auf jeden Fall auf der rechten Seite was los."}, {"id": 151, "start": 887.56, "end": 889.56, "text": "War der, war der da oben drin?"}, {"id": 152, "start": 893.56, "end": 895.56, "text": "Massive Nade."}, {"id": 153, "start": 895.56, "end": 897.56, "text": "Huge Nade war das."}, {"id": 154, "start": 897.56, "end": 899.56, "text": "Beste."}, {"id": 155, "start": 899.56, "end": 901.56, "text": "Guckt euch das mal an, wo man hier getroffen wird."}, {"id": 156, "start": 901.56, "end": 903.56, "text": "Nee."}, {"id": 157, "start": 903.56, "end": 905.56, "text": "Da ist er."}, {"id": 158, "start": 905.56, "end": 907.56, "text": "Nein."}, {"id": 159, "start": 907.56, "end": 909.56, "text": "Nein."}, {"id": 160, "start": 909.56, "end": 911.56, "text": "Nein."}, {"id": 161, "start": 911.56, "end": 913.56, "text": "Nein."}, {"id": 162, "start": 913.56, "end": 915.56, "text": "Nein."}, {"id": 163, "start": 915.56, "end": 917.56, "text": "Nee."}, {"id": 164, "start": 917.56, "end": 919.56, "text": "Das ist glaube ich nicht das."}, {"id": 165, "start": 919.56, "end": 921.56, "text": "Woher wissen die das?"}, {"id": 166, "start": 921.56, "end": 923.56, "text": "Muss Stream Snipes sein, Lul."}, {"id": 167, "start": 929.56, "end": 931.56, "text": "Wo wirst du denn hier alles getroffen?"}, {"id": 168, "start": 935.56, "end": 937.56, "text": "Doch definitiv nicht normal."}, {"id": 169, "start": 939.56, "end": 941.56, "text": "Achtung."}, {"id": 170, "start": 941.56, "end": 943.56, "text": "Fuck."}, {"id": 171, "start": 943.56, "end": 945.56, "text": "Ich dachte das wäre unser Dude."}, {"id": 172, "start": 947.56, "end": 949.56, "text": "Äh, wenn nicht dann nicht, komm nächste Woche."}, {"id": 173, "start": 949.56, "end": 951.56, "text": "Nee, das nächste, übernächste Woche."}, {"id": 174, "start": 951.56, "end": 953.56, "text": "Es gibt ja nicht mehr so viele Tage."}, {"id": 175, "start": 953.56, "end": 955.56, "text": "Ich hab gesagt Ende Dezember."}, {"id": 176, "start": 955.56, "end": 957.56, "text": "Oh nee."}, {"id": 177, "start": 957.56, "end": 959.56, "text": "Okay, YOLO Modus."}, {"id": 178, "start": 959.56, "end": 961.56, "text": "YOLO Modus."}, {"id": 179, "start": 961.56, "end": 971.56, "text": "Vergiss es."}, {"id": 180, "start": 977.56, "end": 979.56, "text": "What the hell."}, {"id": 181, "start": 979.56, "end": 981.56, "text": "Okay."}, {"id": 182, "start": 981.56, "end": 983.56, "text": "Jetzt müssen wir hier rüber."}, {"id": 183, "start": 983.56, "end": 985.56, "text": "Guck, die sind schon dran."}, {"id": 184, "start": 985.56, "end": 995.56, "text": "Da vorne war einer."}, {"id": 185, "start": 995.56, "end": 997.56, "text": "Die kommen hier nicht rein, ne?"}, {"id": 186, "start": 997.56, "end": 999.56, "text": "What?"}, {"id": 187, "start": 999.56, "end": 1001.56, "text": "Alter, du wirst hier wirklich von allen Seiten gebashed."}, {"id": 188, "start": 1003.56, "end": 1005.56, "text": "Mann, da geht nix rein."}, {"id": 189, "start": 1005.56, "end": 1013.56, "text": "Nice."}, {"id": 190, "start": 1035.56, "end": 1037.56, "text": "Hahaha."}, {"id": 191, "start": 1045.56, "end": 1047.56, "text": "MonkaS, what is happening?"}, {"id": 192, "start": 1055.56, "end": 1057.56, "text": "Also an den Stellen wo man hier gehitted wird."}, {"id": 193, "start": 1057.56, "end": 1059.56, "text": "Das ist nicht normal."}, {"id": 194, "start": 1059.56, "end": 1061.56, "text": "Äh."}, {"id": 195, "start": 1061.56, "end": 1065.56, "text": "What?"}, {"id": 196, "start": 1091.56, "end": 1093.56, "text": "Ey."}, {"id": 197, "start": 1093.56, "end": 1095.56, "text": "What the fuck geht hier gerade ab?"}, {"id": 198, "start": 1095.56, "end": 1097.56, "text": "Das ist doch nicht normal."}, {"id": 199, "start": 1103.56, "end": 1105.56, "text": "Was ist hier los?"}, {"id": 200, "start": 1105.56, "end": 1107.56, "text": "Äh."}, {"id": 201, "start": 1107.56, "end": 1109.56, "text": "Das ist ja"}, {"id": 202, "start": 1109.56, "end": 1111.56, "text": "eines der monkaessigsten Runden aller Zeit."}, {"id": 203, "start": 1111.56, "end": 1113.56, "text": "Und by the way, was soll eigentlich"}, {"id": 204, "start": 1113.56, "end": 1115.56, "text": "eine monkaessige Runde sein?"}, {"id": 205, "start": 1117.56, "end": 1119.56, "text": "Ja, eine Runde die halt monkaess ist."}, {"id": 206, "start": 1119.56, "end": 1121.56, "text": "Keine Ahnung."}, {"id": 207, "start": 1121.56, "end": 1123.56, "text": "Monkaess kann ja alles sein."}, {"id": 208, "start": 1123.56, "end": 1125.56, "text": "MonkaW geht auch."}, {"id": 209, "start": 1125.56, "end": 1127.56, "text": "Oder MonkaGiga."}, {"id": 210, "start": 1129.56, "end": 1131.56, "text": "Okay."}, {"id": 211, "start": 1131.56, "end": 1133.56, "text": "Okay."}, {"id": 212, "start": 1147.56, "end": 1149.56, "text": "Da kommt ein Auto."}, {"id": 213, "start": 1149.56, "end": 1151.56, "text": "Ein fucking Auto."}, {"id": 214, "start": 1151.56, "end": 1153.56, "text": "Ein Auto."}, {"id": 215, "start": 1153.56, "end": 1157.56, "text": "Ah."}, {"id": 216, "start": 1157.56, "end": 1159.56, "text": "Ah."}, {"id": 217, "start": 1167.56, "end": 1169.56, "text": "Er ist einfach ein Auto"}, {"id": 218, "start": 1169.56, "end": 1171.56, "text": "am Start."}, {"id": 219, "start": 1173.56, "end": 1175.56, "text": "Der Auto, Dude."}, {"id": 220, "start": 1175.56, "end": 1177.56, "text": "Der ist immer noch am Start."}, {"id": 221, "start": 1179.56, "end": 1181.56, "text": "Alter."}, {"id": 222, "start": 1181.56, "end": 1183.56, "text": "Ist ja"}, {"id": 223, "start": 1183.56, "end": 1185.56, "text": "eskaliert man nicht so."}, {"id": 224, "start": 1197.56, "end": 1199.56, "text": "Okay, okay."}, {"id": 225, "start": 1203.56, "end": 1205.56, "text": "Oh shit."}, {"id": 226, "start": 1205.56, "end": 1207.56, "text": "Ja."}, {"id": 227, "start": 1209.56, "end": 1211.56, "text": "Messer."}, {"id": 228, "start": 1211.56, "end": 1213.56, "text": "Jawoll, ich hab noch einen gemessert."}, {"id": 229, "start": 1213.56, "end": 1215.56, "text": "Alter, was ist das für eine Runde?"}, {"id": 230, "start": 1217.56, "end": 1219.56, "text": "Die Anti-Henne war am Start."}, {"id": 231, "start": 1219.56, "end": 1221.56, "text": "Das ist eine coole Runde. Die Rekorn war mal."}, {"id": 232, "start": 1221.56, "end": 1223.56, "text": "Äh."}, {"id": 233, "start": 1223.56, "end": 1225.56, "text": "Rekorn?"}, {"id": 234, "start": 1225.56, "end": 1227.56, "text": "Was war nochmal Rekorn?"}, {"id": 235, "start": 1227.56, "end": 1235.56, "text": "Controls?"}, {"id": 236, "start": 1235.56, "end": 1237.56, "text": "Ah, alt F10."}, {"id": 237, "start": 1243.56, "end": 1245.56, "text": "Boah ey. Also das war ja mal"}, {"id": 238, "start": 1245.56, "end": 1247.56, "text": "anstrengend hoch 10."}, {"id": 239, "start": 1249.56, "end": 1251.56, "text": "Richtig heftig, ne?"}, {"id": 240, "start": 1251.56, "end": 1253.56, "text": "So war es nur in Battlefield."}, {"id": 241, "start": 1253.56, "end": 1255.56, "text": "Ja, so sieht es aus."}, {"id": 242, "start": 1255.56, "end": 1257.56, "text": "Nice Team."}, {"id": 243, "start": 1257.56, "end": 1259.56, "text": "GG Eats."}, {"id": 244, "start": 1259.56, "end": 1261.56, "text": "Im Zweifelsfall wisst ihr,"}, {"id": 245, "start": 1261.56, "end": 1263.56, "text": "wenn man knapp gewinnt, ist das immer..."}, {"id": 246, "start": 1265.56, "end": 1267.56, "text": "Also wenn man knapp gewinnt, egal wie knapp,"}, {"id": 247, "start": 1267.56, "end": 1269.56, "text": "mit einem Punkt ist es immer"}, {"id": 248, "start": 1269.56, "end": 1271.56, "text": "GG Eats."}, {"id": 249, "start": 1271.56, "end": 1273.56, "text": "Wenn man verliert, ist das Hack."}, {"id": 250, "start": 1273.56, "end": 1295.56, "text": "Oh, Nose-Hair-Cannels."}, {"id": 251, "start": 1295.56, "end": 1297.56, "text": "Also Defender."}, {"id": 252, "start": 1297.56, "end": 1299.56, "text": "Ich brauche übrigens"}, {"id": 253, "start": 1299.56, "end": 1301.56, "text": "noch eine gute Engi-Klasse."}, {"id": 254, "start": 1301.56, "end": 1303.56, "text": "Was nimmt man da? M4?"}, {"id": 255, "start": 1307.56, "end": 1309.56, "text": "M4 und dann? Was macht man da dran?"}, {"id": 256, "start": 1309.56, "end": 1311.56, "text": "Ich hab das schon wieder komplett."}, {"id": 257, "start": 1311.56, "end": 1313.56, "text": "Tactical Light, Alter."}, {"id": 258, "start": 1313.56, "end": 1315.56, "text": "Laser Sight, Suppressor."}, {"id": 259, "start": 1317.56, "end": 1319.56, "text": "Olo Stels."}, {"id": 260, "start": 1321.56, "end": 1323.56, "text": "ACR? Gab es überhaupt"}, {"id": 261, "start": 1323.56, "end": 1325.56, "text": "eine ACR in Battlefield 3?"}, {"id": 262, "start": 1325.56, "end": 1327.56, "text": "Ich kann mich doch auch noch mal dran erinnern."}, {"id": 263, "start": 1329.56, "end": 1331.56, "text": "Ah Moment, Moment, Moment."}, {"id": 264, "start": 1331.56, "end": 1333.56, "text": "Ich hätte mal meinen E-Class-Stels"}, {"id": 265, "start": 1333.56, "end": 1335.56, "text": "mitnehmen müssen."}, {"id": 266, "start": 1335.56, "end": 1337.56, "text": "Oh Moment, die M4 ist"}, {"id": 267, "start": 1337.56, "end": 1339.56, "text": "Burst? Ernsthaft?"}, {"id": 268, "start": 1339.56, "end": 1341.56, "text": "Oh ne, oder?"}, {"id": 269, "start": 1349.56, "end": 1351.56, "text": "Alter, ist das schlecht?"}, {"id": 270, "start": 1351.56, "end": 1353.56, "text": "Ich hab's schon wieder ganz vergessen,"}, {"id": 271, "start": 1353.56, "end": 1355.56, "text": "der Kack, der war ja Burst, ey."}, {"id": 272, "start": 1355.56, "end": 1357.56, "text": "Mega-Kack-Waffe."}, {"id": 273, "start": 1363.56, "end": 1365.56, "text": "Rums."}, {"id": 274, "start": 1367.56, "end": 1369.56, "text": "Wow, wow, der lebt ja noch."}, {"id": 275, "start": 1369.56, "end": 1371.56, "text": "Dacht, das ist unser Dude."}, {"id": 276, "start": 1371.56, "end": 1373.56, "text": "Dacht, das ist unser, unser Luftabwehr-Stels,"}, {"id": 277, "start": 1373.56, "end": 1375.56, "text": "Mann."}, {"id": 278, "start": 1375.56, "end": 1377.56, "text": "Okay, okay, okay."}, {"id": 279, "start": 1377.56, "end": 1379.56, "text": "Okay, okay, okay."}, {"id": 280, "start": 1379.56, "end": 1381.56, "text": "Okay, okay, okay."}, {"id": 281, "start": 1381.56, "end": 1383.56, "text": "Ich geb zu, kindesweise Fail."}, {"id": 282, "start": 1385.56, "end": 1387.56, "text": "Ich switche mal kurz auf"}, {"id": 283, "start": 1387.56, "end": 1389.56, "text": "irgendwas, wo ich auch was killen kann."}, {"id": 284, "start": 1391.56, "end": 1393.56, "text": "Okay, die Mann jetzt"}, {"id": 285, "start": 1393.56, "end": 1395.56, "text": "Legehenne."}, {"id": 286, "start": 1395.56, "end": 1397.56, "text": "Stabile Legehenne."}, {"id": 287, "start": 1397.56, "end": 1399.56, "text": "Stabile Legehenne."}, {"id": 288, "start": 1407.56, "end": 1409.56, "text": "Der Dude ist immer noch da."}, {"id": 289, "start": 1409.56, "end": 1411.56, "text": "Oh, oh, ich versuch,"}, {"id": 290, "start": 1411.56, "end": 1413.56, "text": "ich versuch die 2, okay, ich geh jetzt."}, {"id": 291, "start": 1413.56, "end": 1415.56, "text": "Oh, ich"}, {"id": 292, "start": 1415.56, "end": 1417.56, "text": "Das überleb ich net,"}, {"id": 293, "start": 1417.56, "end": 1419.56, "text": "das überleb ich net. Einmal auf der"}, {"id": 294, "start": 1419.56, "end": 1421.56, "text": "Strasse stehen geblieben, bam, down."}, {"id": 295, "start": 1421.56, "end": 1423.56, "text": "Keine Chance."}, {"id": 296, "start": 1425.56, "end": 1427.56, "text": "Okay, okay, okay."}, {"id": 297, "start": 1427.56, "end": 1429.56, "text": "Okay, okay, okay."}, {"id": 298, "start": 1429.56, "end": 1431.56, "text": "Okay, okay, okay."}, {"id": 299, "start": 1431.56, "end": 1433.56, "text": "Okay, okay, okay."}, {"id": 300, "start": 1433.56, "end": 1435.56, "text": "Okay, okay, okay."}, {"id": 301, "start": 1435.56, "end": 1437.56, "text": "Okay, okay, okay."}, {"id": 302, "start": 1437.56, "end": 1439.56, "text": "Okay, okay, okay."}, {"id": 303, "start": 1439.56, "end": 1441.56, "text": "Okay, okay, okay."}, {"id": 304, "start": 1441.56, "end": 1443.56, "text": "Okay, okay."}, {"id": 305, "start": 1443.56, "end": 1445.56, "text": "Okay, okay, okay."}, {"id": 306, "start": 1445.56, "end": 1447.56, "text": "Okay, okay, okay."}, {"id": 307, "start": 1447.56, "end": 1449.56, "text": "Wow!"}, {"id": 308, "start": 1451.56, "end": 1453.56, "text": "Okay, okay, okay, okay."}, {"id": 309, "start": 1453.56, "end": 1455.56, "text": "Okay, okay, okay."}, {"id": 310, "start": 1457.56, "end": 1459.56, "text": "나"}, {"id": 311, "start": 1459.56, "end": 1461.56, "text": "나"}, {"id": 312, "start": 1461.56, "end": 1463.56, "text": "나"}, {"id": 313, "start": 1463.56, "end": 1465.56, "text": "나"}, {"id": 314, "start": 1465.56, "end": 1474.8, "text": "Aber was geht hier eigentlich gerade?"}, {"id": 315, "start": 1474.8, "end": 1481.2, "text": "Kann mir das irgend einer mal legit erklären was hier gerade abgeht?"}, {"id": 316, "start": 1481.2, "end": 1485.96, "text": "Auf der Gas stehen bleibt immer ein Fehler, ohja das stimmt."}, {"id": 317, "start": 1485.96, "end": 1507.36, "text": "Jetzt kannst du nicht diffusen, keine Chance."}, {"id": 318, "start": 1515.96, "end": 1519.48, "text": "Oh fuck, ich hätte dich protekten sollen, ich hab gedacht das kriegen wir eh nicht."}, {"id": 319, "start": 1519.48, "end": 1522.08, "text": "Ich dachte das kriegen wir eh nicht."}, {"id": 320, "start": 1522.08, "end": 1528.96, "text": "Wisst ihr mal, in dem einen Moment wo es drauf ankommt, nicht geteamplayert."}, {"id": 321, "start": 1528.96, "end": 1554.0, "text": "Auf die Gas stehen, das ist auch so typisch hässlich, auf die Gas stehen, zu lange auf"}, {"id": 322, "start": 1554.0, "end": 1555.0, "text": "die Gas gestanden."}, {"id": 323, "start": 1555.0, "end": 1567.88, "text": "So was kriegen die denn jetzt, die haben jetzt ne Heli und wieder ne M-Track und Heli."}, {"id": 324, "start": 1567.88, "end": 1590.24, "text": "Ich komm aus Frankfurt, auf die Gas, okay das ist jetzt Fail, der M-Track kann ja nur"}, {"id": 325, "start": 1590.24, "end": 1591.24, "text": "hier hoch."}, {"id": 326, "start": 1591.24, "end": 1608.84, "text": "Okay vielleicht switchen wir doch mal lieber auf Engineer wieder, aber mal mit einer gescheiten"}, {"id": 327, "start": 1608.84, "end": 1609.84, "text": "Waffe."}, {"id": 328, "start": 1609.84, "end": 1629.32, "text": "Was ist denn da gescheit, AK-74U, ist das Ding jetzt down?"}, {"id": 329, "start": 1629.32, "end": 1649.28, "text": "Ich blick hier grad echt nicht durch, das ist mir zu hoch, was hier grad abgeht, das"}, {"id": 330, "start": 1649.28, "end": 1650.84, "text": "ist mir echt zu hoch."}, {"id": 331, "start": 1650.84, "end": 1669.36, "text": "Shit Grenade, ich camp jetzt das M-Com ab, weil wenn die hier smokeen, die smokeen ja"}, {"id": 332, "start": 1669.36, "end": 1670.6, "text": "nicht auf Spaß an der Freude."}, {"id": 333, "start": 1670.6, "end": 1688.28, "text": "Guck hier, lege Hände, lege Hände, aber da über Range sagt der, das kann ich ja nicht"}, {"id": 334, "start": 1688.28, "end": 1689.28, "text": "mal wiederbeleben."}, {"id": 335, "start": 1689.28, "end": 1712.32, "text": "Ich dachte da ist jetzt was, hier ist doch auch was, okay sorry ich seh nix."}, {"id": 336, "start": 1712.32, "end": 1717.36, "text": "Hatte man eigentlich Auto-Health-Track oder musste man hier echt zu einem Medic rennen?"}, {"id": 337, "start": 1717.36, "end": 1728.48, "text": "Ich glaub man hatte Auto-Health-Track, aber richtig lahm, so irgendwie gefühlt in einer"}, {"id": 338, "start": 1728.48, "end": 1745.84, "text": "halben Minute oder so, oh eine nice Pose, Achtung, Yolo stellt's."}, {"id": 339, "start": 1745.84, "end": 1756.52, "text": "Ja ist ja klar Battlefield, natürlich, okay die Waffen, die Standard-NG-Waffen sind irgendwie"}, {"id": 340, "start": 1756.52, "end": 1757.52, "text": "ziemlich der Sack."}, {"id": 341, "start": 1757.52, "end": 1764.16, "text": "Was war man da, was ist ne gute NG-Waffe, ich kann mich auch nicht dran erinnern, was"}, {"id": 342, "start": 1764.16, "end": 1773.12, "text": "ist ne gute NG-Waffe, P90 war halt gut, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne, ne,"}, {"id": 343, "start": 1773.12, "end": 1783.48, "text": "ne, ne, ne, ne, ne, ne, ne."}, {"id": 344, "start": 1783.48, "end": 1785.48, "text": "Eher, Eher Müll"}, {"id": 345, "start": 1788.04, "end": 1792.56, "text": "Okay, das können wir nicht mehr. Das können wir nicht mehr holen. Keine Chance. Guck dir an"}, {"id": 346, "start": 1804.84, "end": 1810.2, "text": "Okay, ich muss jetzt wieder. Ich spiele, wisst ihr was? Wir machen jetzt M16. Bäm! M16"}, {"id": 347, "start": 1810.2, "end": 1816.36, "text": "Ich stelle es nicht. Einmal wieder M16. Ne, ne. Ich spiele kein M16. M16 ist mir zu, zu low"}, {"id": 348, "start": 1821.32, "end": 1823.32, "text": "Wow"}, {"id": 349, "start": 1823.32, "end": 1836.84, "text": "What? What? Ich blicke gar nicht mehr durch, wo die Gegner sind gerade. Alles hier am Jumpshotten und tun und machen"}, {"id": 350, "start": 1849.64, "end": 1851.64, "text": "Kann man hier irgendwie durch?"}, {"id": 351, "start": 1851.64, "end": 1853.64, "text": "Der Schneiber, man"}, {"id": 352, "start": 1866.2, "end": 1871.68, "text": "Wir stehen, wir bleiben jetzt einfach im Container stehen. Lul, weh. Container stellts"}, {"id": 353, "start": 1873.44, "end": 1875.44, "text": "Aber du musst aufpassen, dass die nicht durchpushen"}, {"id": 354, "start": 1875.44, "end": 1877.44, "text": "Excellent, Container stellts"}, {"id": 355, "start": 1877.44, "end": 1902.96, "text": "Okay, wir dürfen jetzt nicht zu weit. Okay, wir müssen aufpassen. Okay, wir müssen aufpassen. Okay, wir müssen aufpassen"}, {"id": 356, "start": 1907.44, "end": 1935.2, "text": "Okay, ich bin jetzt nicht ganz sicher, von wo die kommen"}, {"id": 357, "start": 1938.4, "end": 1942.64, "text": "Aber ich hoffe wir können mal backragen"}, {"id": 358, "start": 1946.96, "end": 1948.96, "text": "Achtung, Achtung"}, {"id": 359, "start": 1957.36, "end": 1962.0, "text": "Fuck, ich hätte nicht schießen sollen, ich hätte Messern. Ich hätte Messer und Bäm in your face"}, {"id": 360, "start": 1962.0, "end": 1967.36, "text": "Messern müssen. Hi Happen, 14 Monate, Dankeschön. Ich hätte nicht schießen dürfen, das wäre dumm"}, {"id": 361, "start": 1967.36, "end": 1991.36, "text": "Hi Hapsore"}, {"id": 362, "start": 1991.36, "end": 1996.64, "text": "Ja, was wir haben die Fuse, ich glaube es ist ja da"}, {"id": 363, "start": 2002.88, "end": 2005.44, "text": "Nice, so muss es sein"}, {"id": 364, "start": 2009.12, "end": 2011.12, "text": "Oh blöd blöd"}, {"id": 365, "start": 2013.84, "end": 2015.84, "text": "In der S kriegen sie geschossen"}, {"id": 366, "start": 2015.84, "end": 2018.56, "text": "Die tighten roofing"}, {"id": 367, "start": 2022.4, "end": 2026.4, "text": "Jawoll. F. den E R. ist over hier"}, {"id": 368, "start": 2026.4, "end": 2047.28, "text": "Ich bin engagiert, ich bin engagiert."}, {"id": 369, "start": 2047.28, "end": 2048.28, "text": "Okay."}, {"id": 370, "start": 2048.28, "end": 2049.28, "text": "Wow."}, {"id": 371, "start": 2049.28, "end": 2062.44, "text": "Haha, keine Chance, ich hab nicht mehr durchgeholt, hier haben wir 30 Milliarden Gegner."}, {"id": 372, "start": 2062.44, "end": 2066.36, "text": "Medic Klasse so OP, Medic Beste."}, {"id": 373, "start": 2066.36, "end": 2070.24, "text": "Medic ist bäm bä bä bäm."}, {"id": 374, "start": 2070.24, "end": 2072.12, "text": "Nostalgie, das Mikro hat so guten Ton."}, {"id": 375, "start": 2072.12, "end": 2075.4, "text": "Ach, ich glaube, das lässt sich sicherlich irgendwie ändern, dass das Mikro so gute"}, {"id": 376, "start": 2075.4, "end": 2076.4, "text": "Qualität hat."}, {"id": 377, "start": 2076.4, "end": 2097.32, "text": "Also wenn ihr wollt, wenn ihr wollt, ich kann das Mikro vor ein schlechtere Quali machen."}, {"id": 378, "start": 2097.32, "end": 2112.88, "text": "Dankeschön für die 6 Monate, das Sandor."}, {"id": 379, "start": 2112.88, "end": 2134.16, "text": "Der weiß, dass ich hier oben bin, der Dude, äh, wow, äh, das ist eine gute Idee, was"}, {"id": 380, "start": 2134.16, "end": 2135.16, "text": "hier, wo ist der Baum hin?"}, {"id": 381, "start": 2135.16, "end": 2160.96, "text": "Ey, das ist ja die POG-Position hier, ich bin in der POG-Position, oh ne, Alter, warum"}, {"id": 382, "start": 2160.96, "end": 2161.96, "text": "sterben hier gerade alle?"}, {"id": 383, "start": 2161.96, "end": 2177.64, "text": "Nein, oh nice, jetzt, Massive, ah, meine Maus, ma Maus ging nicht."}, {"id": 384, "start": 2177.64, "end": 2181.6, "text": "Boah, aber das ist, das ist schon echt hardcore anstrengende Runden gerade."}, {"id": 385, "start": 2181.6, "end": 2184.28, "text": "Nein, die haben gelegt, M-Komm, lege Henne."}, {"id": 386, "start": 2184.28, "end": 2193.8, "text": "Wo ist die Lege Henne, Alter, hier ist der nicht normal."}, {"id": 387, "start": 2193.8, "end": 2200.68, "text": "Okay, Yolo, jo, voll die Granate direkt in die Fräse, okay, eigentlich müssen wir nur"}, {"id": 388, "start": 2200.68, "end": 2204.52, "text": "B halten, dann ist easy, wir sollten uns jetzt nicht da reinwerfen wie die Dummen, so wie"}, {"id": 389, "start": 2204.52, "end": 2208.92, "text": "wir es gerade machen und einfach, und einfach B-Däffen, einfach, einfach B-Däffen."}, {"id": 390, "start": 2208.92, "end": 2214.04, "text": "Na, siehste, siehste, wir waren richtig dumm, sind wir gewesen, richtig dumm."}, {"id": 391, "start": 2214.04, "end": 2230.48, "text": "Richtig dumm waren wir, wir waren Low-Brain-Champ waren wir, extremer Low-Brain-Champ, oh nice,"}, {"id": 392, "start": 2230.48, "end": 2231.48, "text": "nice, wir haben es gehalten."}, {"id": 393, "start": 2231.48, "end": 2244.36, "text": "Sag mal, was ist denn hier gerade los?"}, {"id": 394, "start": 2244.36, "end": 2253.92, "text": "Boah, Alter, was sind das hier für Runden gerade, das ist ja verschwitzter als Warzone"}, {"id": 395, "start": 2253.92, "end": 2261.36, "text": "oder Modern Warfare Skill-Based Matchmaking, äh, meine Güte, das sind ja die stressigsten"}, {"id": 396, "start": 2261.36, "end": 2263.0, "text": "Battle-Vielrunden seit 5 Jahren."}, {"id": 397, "start": 2263.0, "end": 2291.08, "text": "Ey, ich bleib jetzt defensiv, ich mach's jetzt defensiv, die müssen zu uns kommen."}, {"id": 398, "start": 2291.08, "end": 2309.88, "text": "Ja, easy, anstrengende Sache, Granatenspam auf das M-Com, äh, deswegen ist es eigentlich"}, {"id": 399, "start": 2309.88, "end": 2314.44, "text": "auch fast, also es ist fast, normalerweise ist es, also es ist sauber, sowas ist nicht"}, {"id": 400, "start": 2314.44, "end": 2318.12, "text": "unmöglich, aber es ist schwer, das zu diffusen, wenn die Gegner geschallt sind."}, {"id": 401, "start": 2318.12, "end": 2325.56, "text": "Ist typisch deutsch, die sitzen im Handtuch vom Rechner, ja, kommt echt so an, fühlt"}, {"id": 402, "start": 2325.56, "end": 2326.56, "text": "sich echt so an."}, {"id": 403, "start": 2326.56, "end": 2337.44, "text": "Ich speichere mir den Grammar, das ist immer ganz gut, dass ich Hintergrundmaterial habe,"}, {"id": 404, "start": 2337.44, "end": 2346.68, "text": "ich muss nur gucken, dass ich die Festplatte, weil, oh nee, Moment, ich muss jetzt aufpassen,"}, {"id": 405, "start": 2346.68, "end": 2351.4, "text": "wenn ich in den Ordner reingehe, Leute, wenn ich in den Ordner reingehe, muss ich aufpassen,"}, {"id": 406, "start": 2351.4, "end": 2352.4, "text": "Battlefield 3."}, {"id": 407, "start": 2352.4, "end": 2355.52, "text": "Nee, nee, ich gehe nicht in meinen Recording-Ordner, das hatten wir schonmal."}, {"id": 408, "start": 2355.52, "end": 2384.88, "text": "Sehr gute Runden, macht Spaß, ja, ist nice, oh, Karg Island, hm, war man da, oh, oh, oh,"}, {"id": 409, "start": 2384.88, "end": 2385.88, "text": "whoa."}, {"id": 410, "start": 2385.88, "end": 2390.94, "text": "Kevin Pan, auf geht's, Bam, wa, baam, wa, baam."}, {"id": 411, "start": 2390.94, "end": 2396.42, "text": "Ach nee, nicht Karg Island, da sind wir noch los Herr Kaddles, Attacker jetzt."}, {"id": 412, "start": 2396.42, "end": 2398.86, "text": "Half-Life 3, Confirmed, ja, ich, Leute."}, {"id": 413, "start": 2398.86, "end": 2405.26, "text": "Ich Confirme offiziell, Half-Life 3 Endlich, endlich ist es so weit, ich hab's"}, {"id": 414, "start": 2405.26, "end": 2407.26, "text": "Confirmed"}, {"id": 415, "start": 2409.7, "end": 2412.86, "text": "Lieg hier bitte alle jetzt revealed videos zu machen"}, {"id": 416, "start": 2416.5, "end": 2418.5, "text": "Belfill logik"}, {"id": 417, "start": 2429.58, "end": 2431.86, "text": "Nein nein nein lasst mich in ruhe lasst"}, {"id": 418, "start": 2431.86, "end": 2440.62, "text": "Nein ich bin in meine eigene granate gerannt ich kacke ich werde durchgekommen ich werde durchgekommen aber ich habe mich selbst"}, {"id": 419, "start": 2441.18, "end": 2443.18, "text": "genähtet"}, {"id": 420, "start": 2443.18, "end": 2460.74, "text": "okay die war ob die war nicht unten ich hab mich selbst ineiget bei der big brain"}, {"id": 421, "start": 2461.56, "end": 2463.56, "text": "durch Fenster ging nicht durch Fenster"}, {"id": 422, "start": 2466.24, "end": 2469.7, "text": "was ist hier gerade los nicht sterben wollen ich sterben die sterben ich sterben"}, {"id": 423, "start": 2469.7, "end": 2472.3, "text": "Perfekt perfekt, Pockers Pockers Pockers Pockers"}, {"id": 424, "start": 2472.3, "end": 2474.6, "text": "Pock! Pock like this!"}, {"id": 425, "start": 2482.6, "end": 2484.6, "text": "Pock Pock Pock"}, {"id": 426, "start": 2484.7, "end": 2486.7, "text": "Oh YOLO! YOLO!"}, {"id": 427, "start": 2486.7, "end": 2491.3, "text": "Pock Pock Pock Pock Pock"}, {"id": 428, "start": 2492.3, "end": 2494.3, "text": "Champ Champ"}, {"id": 429, "start": 2494.3, "end": 2496.3, "text": "Pock Pock"}, {"id": 430, "start": 2496.3, "end": 2498.3, "text": "Massive Pock"}, {"id": 431, "start": 2498.3, "end": 2500.3, "text": "Pog, lege Hände!"}, {"id": 432, "start": 2513.8, "end": 2514.3, "text": "Pog!"}, {"id": 433, "start": 2518.3, "end": 2520.3, "text": "Immer noch Pog! Immer noch Pog!"}, {"id": 434, "start": 2520.3, "end": 2533.3, "text": "Ha, zu spät Pog! Nice! Okay, das war Massive Lege Ende des Jahrtausends. Die legigste Lege"}, {"id": 435, "start": 2533.3, "end": 2537.3, "text": "in aller Zeit. Die Partie hat schon 20 Billionen Eier pro Sekunde."}, {"id": 436, "start": 2537.3, "end": 2557.3, "text": "Okay, okay, nice. Keep on moving! Keep on moving!"}, {"id": 437, "start": 2557.3, "end": 2568.3, "text": "Alter, spring! Krasser Elite Soldat! Das ist so ein Massive Elite Soldier, dass er nicht"}, {"id": 438, "start": 2568.3, "end": 2573.3, "text": "über so ein Ding springen kann. Okay, nice, nice, nice. Pog, Pog!"}, {"id": 439, "start": 2576.3, "end": 2584.3, "text": "Wo ist der Dude? In the ass? Over here? Let's go! Let's go! Lege Hände, Action!"}, {"id": 440, "start": 2584.3, "end": 2597.3, "text": "Okay, ich versuch zu decken. Da kommt ein Auto. Ist der auf dem Dach? Ist die Henne auf"}, {"id": 441, "start": 2597.3, "end": 2615.3, "text": "dem Dach? Ich glaub die Henne ist auf dem Dach. Die Henne ist auf dem Dach. Die Henne ist"}, {"id": 442, "start": 2615.3, "end": 2627.3, "text": "durchs Dach getroppt. Aber wir haben's. Easy! Nice! Oh, mein Team geht gut ab. Ich krieg"}, {"id": 443, "start": 2627.3, "end": 2647.3, "text": "da... Ich seh nix, so viel Wraiths. Der Schneiber, Dude, da ist er. Der Tod? Ja, hier. Einmal"}, {"id": 444, "start": 2647.3, "end": 2656.7, "text": "ne Runde T-Bang. Das muss jetzt sein. Gibt's eigentlich noch was anderes außer"}, {"id": 445, "start": 2656.7, "end": 2662.9, "text": "für Comrade und Kokona in Battlefield 3 oder sind das nur Russen und Amis? Wie sieht's"}, {"id": 446, "start": 2662.9, "end": 2683.1, "text": "mit Franzosen, Deutschen, Chinesen und allem in Battlefield 3 aus? Gabs die da? Yolo, Raz,"}, {"id": 447, "start": 2683.1, "end": 2693.5, "text": "Bob. Keine allzu gute Idee. Nur Russen und US, okay. Gibt es keine Chinesen in Battlefield"}, {"id": 448, "start": 2693.5, "end": 2704.86, "text": "3? Ja, keine Chinesen. Oh, Zen Crossing, Zen Crossing. Excellent, Zen Crossing. Keine"}, {"id": 449, "start": 2704.86, "end": 2727.5, "text": "Chinesen aus China. Whoa, Sliderman. Nicht Spiderman, das war Sliderman. Richtiger Sliderman."}, {"id": 450, "start": 2727.5, "end": 2735.5, "text": "Sag mal, was ist hier los? Wir stürzen uns ja hier. Wie wir uns auf die M-Coms stürzen,"}, {"id": 451, "start": 2735.5, "end": 2751.5, "text": "ey. Pause-Champ. Ja, leucht mir in die Fresse, ist gut."}, {"id": 452, "start": 2751.5, "end": 2766.06, "text": "Sag mal. Ist hier, ist hier, ist es jetzt, jetzt ist echt hier. Jetzt ist offen."}, {"id": 453, "start": 2766.06, "end": 2784.5, "text": "Jetzt. Wieder Belebungs-Champ. Sarix, nee, der Stefan, ja, liegt Sliderman,"}, {"id": 454, "start": 2784.5, "end": 2803.5, "text": "nicht Spiderman, Sliderman. Okay, ich bin weg. Ich bin raus, Leute, ich bin raus, Leute."}, {"id": 455, "start": 2803.5, "end": 2810.1, "text": "Ich bleib im Loch liegen. Was ist offen, Polen oder China? In dem Fall würde ich sagen Russland,"}, {"id": 456, "start": 2810.1, "end": 2832.14, "text": "oder? Wo ist, wo ist Nosha Canals? Sag mal. Oh, ich hab ihn zu spät gesehen. Wo liegt"}, {"id": 457, "start": 2832.14, "end": 2848.54, "text": "Nosha Canals? Oh, Fatal, nice Posi, nice Posi hier. Seh schon, mein Team geht ab."}, {"id": 458, "start": 2848.54, "end": 2863.54, "text": "Oh, oh, oh. Monarch, S, Triple, Triple S. Sag mal, was ist denn hier gerade? Meine Güte,"}, {"id": 459, "start": 2863.54, "end": 2872.06, "text": "der Marcel Davis, der eins und eins, der echte, der echte eins und eins Marcel Davis. Danke"}, {"id": 460, "start": 2872.06, "end": 2889.02, "text": "für den Sub. Subscription. Hier. Nein. Auch nicht. Hier. Komm, wir machen, wir machen Reparaturs."}, {"id": 461, "start": 2889.02, "end": 2896.34, "text": "Oh, was war das jetzt? Ich wollte sagen, wir machen Reparaturs-Champ, aber so ganz hat"}, {"id": 462, "start": 2896.34, "end": 2917.1, "text": "das nicht funktioniert. Oh, big brain drop, big brain, massive brain. Massive brain drop"}, {"id": 463, "start": 2917.1, "end": 2937.38, "text": "vom Dach. Poggers. Okay. Sag mal. Battlefield, jetzt komm Mensch."}, {"id": 464, "start": 2937.38, "end": 2960.14, "text": "Dach drop, big brain drop, würde ich sagen. Okay, pass mal auf. Exzellent. Weiß nicht,"}, {"id": 465, "start": 2960.14, "end": 2976.54, "text": "wo der Dude ist. Wo ist der Dude? Irgendwo da. Oh, voll rein gerannt. Einfach Stellzer"}, {"id": 466, "start": 2976.54, "end": 2995.78, "text": "ohne Cyberpunk. Ja. Yep. Dach drop, der Dach drop, der beste Drop aller Zeiten. Weiß nicht,"}, {"id": 467, "start": 2995.78, "end": 3010.94, "text": "ob der da noch lebt. Pog. Der Dach drop, aber der Dach drop ist Pog. Du kriegst da oben"}, {"id": 468, "start": 3010.94, "end": 3013.78, "text": "als Defender, du kriegst die nicht runter. Du kriegst die nicht runter, kannst vergessen."}, {"id": 469, "start": 3013.78, "end": 3020.78, "text": "Du kannst vergessen, du kriegst die nicht runter. Oh, oder doch? Oder nicht? Du kriegst"}, {"id": 470, "start": 3020.78, "end": 3037.46, "text": "die nicht runter. What the hell? Oh Mann. Die haben einen Heli? Okay, die haben unseren"}, {"id": 471, "start": 3037.46, "end": 3057.18, "text": "Heli. Wo liegt Terran Heim? Ich würde sagen in Südafrika. Ah fuck. Warum haben die unseren"}, {"id": 472, "start": 3057.18, "end": 3063.42, "text": "Heli? Die sollten nicht unseren Heli haben. Also wenn die unser Heli haben, ist schlecht."}, {"id": 473, "start": 3063.42, "end": 3070.62, "text": "Aber, aber wisst ihr was wir machen? Wir sind ja, wir haben ja exzellent, exzellent Zeugs"}, {"id": 474, "start": 3070.62, "end": 3080.5, "text": "am Start. Wenn die unseren Heli haben, dann stellts, oh nee, ich hab wieder die M4, nooo."}, {"id": 475, "start": 3080.5, "end": 3107.14, "text": "Ach nee, das ist die Auto M4 jetzt. Bam, Bitch. Boah. Jetzt sind sie rausgesprungen."}, {"id": 476, "start": 3107.14, "end": 3123.38, "text": "Das Ding macht zu wenig Damage."}, {"id": 477, "start": 3123.38, "end": 3140.62, "text": "Oh, okay. Jetzt kann ich wieder was anderes reinspringen."}, {"id": 478, "start": 3140.62, "end": 3154.5, "text": "Boah, anstrengend. Okay, gehen wir mal wieder hier rein. Der Schützturm ist besetzt. Achtung,"}, {"id": 479, "start": 3154.5, "end": 3160.06, "text": "ich zeig euch jetzt mal, Moment, wo sind wir denn jetzt hier? Okay, Pog, Pogrute. Steh"}, {"id": 480, "start": 3160.06, "end": 3171.66, "text": "auf. Okay, Pogrute Leute. Pogrute. Postchamp in Chat hier. Pogrute. Ist der auf dem Dach?"}, {"id": 481, "start": 3171.66, "end": 3188.62, "text": "Ist da ein Typ auf dem Dach? Okay, Pogrute. Pogrute, passt auf. Passt auf. Postchamp,"}, {"id": 482, "start": 3188.62, "end": 3195.78, "text": "Pausierungschamp. Dumm ist jetzt alle, die Stream gucken. Ich leake jetzt, ich leake"}, {"id": 483, "start": 3195.78, "end": 3201.62, "text": "jetzt bestes Strap aller Zeiten. Vor allem, die funktioniert wirklich nur, wenn keiner"}, {"id": 484, "start": 3201.62, "end": 3213.14, "text": "guckt. Ist klar, du hast da zufällig hingeguckt, alter. Ach nee, der sitzt auf dem Dach. Fuck,"}, {"id": 485, "start": 3213.14, "end": 3218.42, "text": "er macht Dachchamp. Okay, das ist schlecht."}, {"id": 486, "start": 3243.14, "end": 3267.02, "text": "Passt mal auf hier, bester, bester Champ, bester Champ. Beste. Ah, diese Kack."}, {"id": 487, "start": 2266.08, "end": 3300.62, "text": "Kack, AA-Champ. Das ist beste, das ist beste, beste Pose hier."}, {"id": 488, "start": 3300.62, "end": 3319.98, "text": "Wo war der Typ? Da kommt gleich was. Leute, da kommt gleich was. Weiß nicht so genau"}, {"id": 489, "start": 3319.98, "end": 3327.02, "text": "von wo. Oh fuck, ich wollte dich holen, aber ich kann dich, ich kann dich holen. Ich bleib"}, {"id": 490, "start": 3327.02, "end": 3349.78, "text": "safe, dass du respawnen kannst. Oder auch so. Okay, das war zu viel. Das war zu viel"}, {"id": 491, "start": 3349.78, "end": 3357.18, "text": "ist gut. Aber die sind ziemlich defensiv gerade. Die Runden sind wirklich nicht, also die machen"}, {"id": 492, "start": 3357.18, "end": 3370.74, "text": "echt Bock. Da ist mal was los hier. Oh, Rep-Champ. Bunsenbrenner-Champ am Start."}, {"id": 493, "start": 3370.74, "end": 3397.18, "text": "Ja. Der Flammenback wird nie behoben. Ich könnte ja jetzt eigentlich abspringen, aber"}, {"id": 494, "start": 3397.18, "end": 3410.46, "text": "mach ich nicht. What the hell? Was war das? Kann mir das mal einer erklären? Warum hat"}, {"id": 495, "start": 3410.46, "end": 3420.38, "text": "der Dude gerade eine Granate geschmissen zwischendurch? Ich hab nichts anderes gemacht, wie Heel-Champ"}, {"id": 496, "start": 3420.38, "end": 3431.34, "text": "durchzudrücken. Fettfinger. Auf G, also von D auf G, da musst du schon ganz schön fetter"}, {"id": 497, "start": 3431.34, "end": 3452.22, "text": "Finger haben. Massive Finger brauchst du da. Achtung. Ja, ist klar, Belfill, ist klar,"}, {"id": 498, "start": 3452.22, "end": 3474.66, "text": "Belfill. Okay, top. Fettfinger plus Brain-Lag. Vielleicht, vielleicht, vielleicht. Oh, Porgas,"}, {"id": 499, "start": 3474.66, "end": 3494.74, "text": "Porgas-Posi, Porgas-Posi. Alter, ich hab hier Heel-Champ. Jetzt müssen wir nur noch"}, {"id": 500, "start": 3494.74, "end": 3517.42, "text": "dran. Mag ich schon wieder on? Ja, ja, ja. Oh nee. Sterbe-Champ haben wir gemacht. Was"}, {"id": 501, "start": 3517.42, "end": 3522.7, "text": "ist denn hier hinter mir los? Ich hatte gerade Laser-Pointer im Gesicht. Da werd ich immer"}, {"id": 502, "start": 3522.7, "end": 3527.42, "text": "ein bisschen nervös, wenn ich Laser-Pointer im Gesicht habe in dem Game. Weiß ich, ob"}, {"id": 503, "start": 3527.42, "end": 3544.66, "text": "das noch jemand kennt. Laser-Pointer im Gesicht verspricht meistens nichts Gutes. Shit, Alter."}, {"id": 504, "start": 3544.66, "end": 3564.3, "text": "Die haben echt Massive-Defense, die Jungs hier. Nee, nee, nee, Kollege, so lass mich nicht"}, {"id": 505, "start": 3564.3, "end": 3577.86, "text": "jebaiten von dir. Fuck. Das letzte ist aber auch echt brutal, ey. Wir haben die Runde"}, {"id": 506, "start": 3577.86, "end": 3585.62, "text": "übrigens eh schon gewonnen. Wir sind viel weitergekommen als die. Easy Win. Ich hab"}, {"id": 507, "start": 3585.62, "end": 3603.9, "text": "Urlaub, ja. Guck zu mir, Tasswood. Ist Tasswood der gegnerische Fahrzeugmann? Weil 47.8 ist"}, {"id": 508, "start": 3603.9, "end": 3628.66, "text": "schon mal ne Hausnummer. Ich retz dich, ich retz dich. Nein. Nee, ich hab wirklich Urlaub."}, {"id": 509, "start": 3628.66, "end": 3645.1, "text": "Ich hab kein Homeoffice, ich hab wirklich Urlaub. Bis Januar. Urlaub bis Jan. Punkt."}, {"id": 510, "start": 3645.1, "end": 3658.54, "text": "Poqours. Ja, aber richtiger Poqours. Mega anstrengende Runde. Es sollte mehr Infantry-Only-Server"}, {"id": 511, "start": 3658.54, "end": 3666.18, "text": "in Battlefield 3 geben. Ja, ehrlich gesagt braucht man gar keine Infantry-Only-Server,"}, {"id": 512, "start": 3666.18, "end": 3673.02, "text": "solange man nicht die Maps spielt, wo die ganze Zeit nur Heli und Jett stellt. Deswegen"}, {"id": 513, "start": 3673.02, "end": 3681.14, "text": "mag ich auch ehrlich gesagt Firestorm und Caspian Border nicht. Sagt mal, Battlefield"}, {"id": 514, "start": 3681.14, "end": 3705.58, "text": "3 ist noch im Prime, oder? Es ist Prime bis Januar, glaub ich. Seh ich das richtig? Ja."}, {"id": 515, "start": 3705.58, "end": 3717.14, "text": "Das ist geil. Der Analyst glaubt, dass sich Battlefield 6 schlechter verkaufen wird. Da"}, {"id": 516, "start": 3717.14, "end": 3725.02, "text": "muss man richtig krasser Analyst für sein. Nach dem Fail von Battlefield 1. Massive Analyst"}, {"id": 517, "start": 3725.02, "end": 3730.54, "text": "muss man dafür sein, dass man da auf die Idee kommt, dass ich Battlefield 3 nochmal so gut"}, {"id": 518, "start": 3730.54, "end": 3752.78, "text": "verkaufe. Huge Analyse braucht man da. Kommen wir da rein? Kommen wir da rein? Oh nice, nice."}, {"id": 519, "start": 3752.78, "end": 3762.02, "text": "Schwerstes M-Com im ganzen Game, Alter. Schwerstes M-Com im ganzen Spiel. Schwerstes M-Com im"}, {"id": 520, "start": 3762.02, "end": 3773.02, "text": "ganzen Spiel. Poqours, Poqours, Poqours, Poqours. Das brauchen wir, brauchen wir. Wir müssen"}, {"id": 521, "start": 3773.02, "end": 3776.46, "text": "gucken, dass da keiner von hinten kommt. Ich hab das Gefühl, die kommen gleich von hinten"}, {"id": 522, "start": 3776.46, "end": 3786.7, "text": "rein. Bam! Schwerstes M-Com im ganzen Spiel. Nice. Man kann übertreiben, aber es ist definitiv"}, {"id": 523, "start": 3786.7, "end": 3804.1, "text": "eines der schwersten M-Coms im ganzen Spiel. Chat, True0W oder stimmt nicht? Die anderen"}, {"id": 524, "start": 3804.1, "end": 3828.78, "text": "sind auch nicht super easy. NotFalls0W, okay. Kann ich auch mitleben. Hallo, Panzer? Aaaaaaah!"}, {"id": 525, "start": 3828.78, "end": 3844.34, "text": "You got G-Baded, Junge. Oh. You got richtig G-Baded, der Amtrak. Der will jetzt, pass"}, {"id": 526, "start": 3844.34, "end": 3863.22, "text": "auf, pass auf, der will andersrum fahren. Null. Der hat halt unseren Amtrak, oder? Ist"}, {"id": 527, "start": 3863.22, "end": 3867.66, "text": "das nicht eigentlich unser Amtrak? Das ist unser Amtrak. Okay, dann wird das auch ganz"}, {"id": 528, "start": 3867.66, "end": 3890.34, "text": "schön schwer jetzt. Alter, ich würde dich ja wiederholen, ne? Hinten kommt was, hinten"}, {"id": 529, "start": 3890.34, "end": 3914.94, "text": "kommt was. Sag mal, das ist echt gerade die Tri-Hard Season angebrochen hier. Monka! Waffel,"}, {"id": 530, "start": 3914.94, "end": 3940.14, "text": "LoL, Yolo, Swag. Wer sagt denn noch LoL heutzutage? Okay, Boomer, Alter. Boomer confirmed. Boomer,"}, {"id": 531, "start": 3940.14, "end": 3959.22, "text": "guckt euch mal an meine huge flank strats. Sag mal, das Erbsen hier darf auch mal sterben."}, {"id": 532, "start": 3959.22, "end": 3987.02, "text": "Sag mal, the fuck? Wie viel halten die noch aus? Oh, nice. TRX, TRX, TRX. Ich würde dich"}, {"id": 533, "start": 3987.02, "end": 4016.5, "text": "gerne holen, aber ich kann nicht. Fuck, Mann. Fuck, Mann. Fuck, Mann. Fuck, Mann. Fuck,"}, {"id": 534, "start": 4016.5, "end": 4024.82, "text": "Mann. Shit. Oh, krieg ich nen Rats, Leute? Das wär massive nice. Poggers Rats. Achtung,"}, {"id": 535, "start": 4024.82, "end": 4046.86, "text": "den aim ich ab. Den aim ich ab, den dude. Abge-aimt, jawoll. Achtung, Yolo, Yolo Rats."}, {"id": 536, "start": 4046.86, "end": 4053.94, "text": "Jawoll, nice. Ey, wir waren da so krass von hinten drin. Also jetzt nicht falsch verstehen,"}, {"id": 537, "start": 4053.94, "end": 4071.3, "text": "ne? Und es hat nix gebracht. Der Rats train, guckt euch an. Der Rats train, wie es rennt,"}, {"id": 538, "start": 4071.3, "end": 4089.98, "text": "der Rats train. Okay. I drill in you asshole, yeah. Fuck in the ass, ey. Ey, ich blick"}, {"id": 539, "start": 4089.98, "end": 4099.62, "text": "nicht mal durch, wo Gegner sind. Machs gut, Stripes. Oh, er ist da tot. Oh, lege Henne,"}, {"id": 540, "start": 4099.62, "end": 4108.5, "text": "die lege Henne ist da. Oh, was? Du Scheiße. Rats, ich bin gerätzt worden und er hat schon"}, {"id": 541, "start": 4108.5, "end": 4132.14, "text": "zwei Laserpointer in der Fresse, ey. Oh, was ist das? Lass mich weg."}, {"id": 542, "start": 4132.14, "end": 4154.66, "text": "Alter, ey. Okay, Kniebeugen. Ich würde sagen T-Bag. Hier, Medic. Also die Runden heute"}, {"id": 543, "start": 4154.66, "end": 4165.38, "text": "sind echt monka stressig. Okay, okay. Wisst ihr, was wir jetzt machen? Okay, ich mach jetzt"}, {"id": 544, "start": 4165.38, "end": 4180.7, "text": "und jetzt. Ah shit, das war knapp. Das Erbsen-Hirn wieder. Das Erbsen-Hirn wieder. Alter, aber"}, {"id": 545, "start": 4180.7, "end": 4184.86, "text": "heute ist wirklich schlimm. Guckt euch das mal an. Wie oft wurde ich wiederbelebt? 50"}, {"id": 546, "start": 4184.86, "end": 4192.86, "text": "Mal. Aber das ist halt, das ist halt echt nice Teamplay gerade. Nice, nice. Wie er"}, {"id": 547, "start": 4192.86, "end": 4204.78, "text": "durchgelaufen ist. Wie er durchgelaufen ist. Massive. Achtung, Achtung, die kommen hier"}, {"id": 548, "start": 4204.78, "end": 4233.34, "text": "gleich rein. Wo ist er? Wo ist er? Wo ist er? Nice. Okay, ich sehe jetzt hier ehrlich"}, {"id": 549, "start": 4233.34, "end": 4244.26, "text": "gesagt nix, aber ich hab das Fenster gut drinne. Da kommt nichts mehr dran, ey. Wenn die mich"}, {"id": 550, "start": 4244.26, "end": 4258.74, "text": "hier nicht aus dem Haus rausbaschen. Nice. So muss es sein. Du bist nicht ganz sicher"}, {"id": 551, "start": 4258.74, "end": 4264.82, "text": "von wo das jetzt gekommen ist. Noch mal flank action. Nee, da kann nichts mehr sein. Okay,"}, {"id": 552, "start": 4264.82, "end": 4269.02, "text": "wir warten hier bis es aufgeht. Leider habe ich den Timing nicht mehr drinne, sonst würde"}, {"id": 553, "start": 4269.02, "end": 4273.98, "text": "ich jetzt schon loslaufen. Okay, komm wir probieren es. Vielleicht bin ich ein bisschen"}, {"id": 554, "start": 4273.98, "end": 4284.62, "text": "früh. Nice. Damit hast du nicht gerechnet, dass ich schon da bin, Alter. Damit hast du"}, {"id": 555, "start": 4284.62, "end": 4299.54, "text": "nicht gerechnet. Kollegen, damit habt ihr nicht gerechnet."}, {"id": 556, "start": 4299.54, "end": 4317.94, "text": "Das war ein guter Play, ich muss dazugeben. Jetzt campen wir erstmal hier schön ab in"}, {"id": 557, "start": 4317.94, "end": 4333.22, "text": "der Ecke. What? Hinter mir? Da ist echt einer. Oh nee, jetzt habe ich die Poggers Posi aufgegeben."}, {"id": 558, "start": 4333.22, "end": 4351.42, "text": "Für nix. Das ist auch schwierig. Das ist wirklich schwierig hier. Aber wir machen"}, {"id": 559, "start": 4351.42, "end": 4367.26, "text": "jetzt Trick 17. Passt auf, Trick 17. Ich zeige es euch mal. Poggers Posi. Hier, guck. Kannst"}, {"id": 560, "start": 4367.26, "end": 4381.94, "text": "man eigentlich auch hier rüberspringen, dachte ich. Aber kann man anscheinend. Du wolltest"}, {"id": 561, "start": 4381.94, "end": 4389.54, "text": "mich flanken, Alter. Fuck, der andere hat mich geflankt. Ist gerade mein ganzes Team"}, {"id": 562, "start": 4389.54, "end": 4403.42, "text": "am M-Com gestorben. Ich glaube schon. Aber das ist auch echt schwierig hier. Das ist"}, {"id": 563, "start": 4403.42, "end": 4411.62, "text": "auch wirklich schwer. Also hier ist es wirklich schwer reinzukommen. Da musst du einmal komplett"}, {"id": 564, "start": 4411.62, "end": 4414.58, "text": "reinrushen, alles killen und dann legen. Dafür könnte ich es dann auch nicht mehr"}, {"id": 565, "start": 4414.58, "end": 4422.7, "text": "wieder erobern. Aber das ist schon echt schwierig. Oh nice. Also wir pushen da wirklich gut ran."}, {"id": 566, "start": 4422.7, "end": 4451.82, "text": "Ich mache nochmal meine Poggers, mein Poggers flank. Ich sehe nichts mehr. Wow. Wow. Wow."}, {"id": 567, "start": 4451.82, "end": 4480.58, "text": "So nah sehe ich ungern die Granate. Moment, wo ist der Dude? Fuck. Dachte, ist nichts"}, {"id": 568, "start": 4480.58, "end": 4485.58, "text": "mehr. Aber die haben sich halt gut geheidet. Auch geiler Satz. Gut geheidet Leute, merkt"}, {"id": 569, "start": 4485.58, "end": 4493.88, "text": "euch das mal. Ihr müsst euch gut heiden. Oh ein exquisite spawnbeacon. Haben sie gut"}, {"id": 570, "start": 4493.88, "end": 4507.1, "text": "geheidet würde ich sagen. Haben sie echt gut geheidet. Fuck. Das hätte ich nicht probieren"}, {"id": 571, "start": 4507.1, "end": 4516.9, "text": "sollen. Das hätte ich nicht probieren sollen. Ok. Können wir noch irgendeine big play Aktion"}, {"id": 572, "start": 4516.9, "end": 4521.58, "text": "machen? Ich habe eine Idee Leute. Ich habe eine Idee. Perfekte Pose, perfekte Pose für"}, {"id": 573, "start": 4521.58, "end": 4542.46, "text": "den play. Perfekte Pose. Wir gehen jetzt hier rein. Ok, da steht eine Tür. Fuck. Fuck."}, {"id": 574, "start": 4542.46, "end": 4568.7, "text": "Fuck von unten. Shit. Ok, ich rappe jetzt. Ich rappe jetzt. Ah nee, zu spät. Das ist"}, {"id": 575, "start": 4568.7, "end": 4586.02, "text": "auch eine echt schwere. MonkaS, ich sehe nichts. What is happening? Battlefield? Battlefield?"}, {"id": 576, "start": 4586.02, "end": 4613.54, "text": "Ja? Ah. Ok, das hat es gebracht. Battlefield physics. Battlefield physics. Oh mein Leute,"}, {"id": 577, "start": 4613.54, "end": 4630.62, "text": "wir sind wieder am Start. Poggers. Die Poggers Leute sind am Start. Was? Nein oder? Oh wie"}, {"id": 578, "start": 4630.62, "end": 4636.82, "text": "close. Wie close. Und wir hatten auch schon gelegt und dann hatten sie defused. Wir hätten"}, {"id": 579, "start": 4636.82, "end": 4646.74, "text": "auch noch mal liegen können. Echt close. GG. Ist das jetzt Eats? Nee, das ist nicht Eats."}, {"id": 580, "start": 4646.74, "end": 4663.14, "text": "Das ist einfach GG clap. Lowry. Das m-com ist zauschwer. Also das ist wirklich hart."}, {"id": 581, "start": 4663.14, "end": 4671.98, "text": "Ich meine, wisst ihr was? So wie dieses m-com hat sich Blizzard für Overwatch 2CP Maps"}, {"id": 582, "start": 4671.98, "end": 4681.62, "text": "gedacht. So müssen die alle sein. Vergleicht mal dieses m-com mit Spawns auf 2CP in Overwatch."}, {"id": 583, "start": 4681.62, "end": 4690.58, "text": "Ich weiß Overwatch in 2020 null. Aber die Dinger sind alle so. Richtig. True null w."}, {"id": 584, "start": 4690.58, "end": 4698.18, "text": "Also guckt euch das an. Blizzard hat gedacht. Ah ok. Excellent. Scheiß Spawn. Scheiß m-com"}, {"id": 585, "start": 4698.18, "end": 4705.3, "text": "Platzierung. So machen wir jede Map. Ah da hat Blizzard gedacht. So big brain. So muss"}, {"id": 586, "start": 4705.3, "end": 4721.54, "text": "das sein. So hier. Schwerstes m-com. Schwerstes m-com. Also ich finde das hier ist sogar noch"}, {"id": 587, "start": 4721.54, "end": 4741.66, "text": "schwerer. Deswegen müssen wir gleich schön rein aimen. Ok das war dumm. Das war richtig"}, {"id": 588, "start": 4741.66, "end": 4747.38, "text": "dumm da rein zu rennen. Dann sterbe ich auch noch. Und die Gegner pushen durch. Das andere"}, {"id": 589, "start": 4747.38, "end": 4754.1, "text": "ist egal. A ist vollkommen egal. A ist total egal auf der Map. A kannst du eh nicht halten."}, {"id": 590, "start": 4754.1, "end": 4773.86, "text": "Du musst B halten. Du musst B halten. Das ist vollkommen egal. A juckt nicht. A juckt"}, {"id": 591, "start": 4773.86, "end": 4782.58, "text": "absolut gar nicht. Du musst mal gucken. Die pushen nämlich bestimmt gleich von der Seite"}, {"id": 592, "start": 4782.58, "end": 4796.18, "text": "und solche. Oh nee. Smoke. MonkaS Smoke. Ok die anderen Dude stehen da alle rum. Passt"}, {"id": 593, "start": 4796.18, "end": 4804.78, "text": "schon. Da kommt noch was. Da kommt noch was. Eine Leute nicht alle immer gleich vor und"}, {"id": 594, "start": 4804.78, "end": 4816.3, "text": "gleich zurück. Ok der LMG Dude macht das. Also gut gemacht können die an das m-com eigentlich"}, {"id": 595, "start": 4816.3, "end": 4826.3, "text": "nicht dran. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp. Knapp."}, {"id": 596, "start": 4826.3, "end": 4830.02, "text": "Die kommen jetzt aber das ist Support der ist bestimmt zu blöd zum Klassen-switchen"}, {"id": 597, "start": 4830.02, "end": 4843.54, "text": "und kann nicht retten. Ja exellent. Perfekt. So. So. Macht was. Au. Au. Au. Hier ist schon"}, {"id": 598, "start": 4843.54, "end": 4867.06, "text": "was drinne. Ist da was oben? Nee oder? Oh. Oh. Oh. Ich habe immer übelst Angst dass"}, {"id": 599, "start": 4867.06, "end": 4871.38, "text": "mein Team da vorne irgendwelche Yolo-Push Aktionen macht die komplette Runde verkackt."}, {"id": 600, "start": 4871.38, "end": 4879.74, "text": "Oh nein nein nein. Es sind auch ganz schön wenig an B jetzt dran. Fuck. Wir haben zu"}, {"id": 601, "start": 4879.74, "end": 4893.78, "text": "viel außen rumgegammelt. Wie viel Rush Server gibt es noch? So 5 würde ich sagen. Ok vorne"}, {"id": 602, "start": 4893.78, "end": 4909.78, "text": "ist was. Vorne ist ganz schön was angesagt. Oh MQ. M-Track. Ok lass mich durch. Achtung"}, {"id": 603, "start": 4909.78, "end": 4913.14, "text": "Yolo. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen."}, {"id": 604, "start": 4913.14, "end": 4927.12, "text": "Bashen. Bashen. Baschen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen."}, {"id": 605, "start": 4927.12, "end": 4937.28, "text": "Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Bashen. Gracias."}, {"id": 606, "start": 4937.28, "end": 4946.76, "text": "Oh, oh, hier ist ganz schön viel, ganz schön viel."}, {"id": 607, "start": 4946.76, "end": 4963.2, "text": "Habt ihr das gehört, I get fucked in the ass over hier hat er gesagt."}, {"id": 608, "start": 4963.2, "end": 4971.16, "text": "Wenn er das so sieht. Nein, aber ich hab noch einen gebashed."}, {"id": 609, "start": 4971.16, "end": 4976.36, "text": "Rats, Rats, Rats, Rats. Die haben uns aber echt gut von der ganzen Seite drin."}, {"id": 610, "start": 4976.36, "end": 4993.6, "text": "Fetel, Fetel, Fetel, Fetel, die sterben neben dem Stimme. Sechs, fünf, vier, drei, zwei, klick, klick, klick, klick, klick, klick, klick, klick, klick, klick. Exzellent."}, {"id": 611, "start": 4993.6, "end": 5000.22, "text": "Okay, jetzt haben sie es. Aber habt ihr gesehen, wie schwer es ist da durchzukommen?"}, {"id": 612, "start": 5000.22, "end": 5004.5, "text": "Das ist wirklich brutal, ey. Das M-Com ist echt krass."}, {"id": 613, "start": 5004.5, "end": 5011.14, "text": "die haben es aber ich glaube die haben es ungewollt alter wo retten der dude rum ich"}, {"id": 614, "start": 5011.14, "end": 5016.38, "text": "glaube die haben das ungewollt ganz gut gemacht die haben nämlich von allen drei seiten mehr"}, {"id": 615, "start": 5016.38, "end": 5042.18, "text": "oder weniger gleichzeitig gepusht was eigentlich ziemlich poggers ist ja klar"}, {"id": 616, "start": 5042.18, "end": 5051.02, "text": "ich dachte wir können ein bisschen kills farmen aber nie ist nichts keine kills farmen"}, {"id": 617, "start": 5051.02, "end": 5056.58, "text": "die night"}, {"id": 618, "start": 5056.58, "end": 5064.02, "text": "captain peng wie kommt es eigentlich dass du so niedriges level hast"}, {"id": 619, "start": 5064.02, "end": 5092.94, "text": "da kommt einem schreck da kommt einfach die ganze map exploded gerade so muss es mache"}, {"id": 620, "start": 5092.94, "end": 5095.02, "text": "krasse push so an"}, {"id": 621, "start": 5107.02, "end": 5117.38, "text": "nein ich habe diese kack igla dabei das sagt warum habe ich warum habe ich die igla ok kill"}, {"id": 622, "start": 5117.38, "end": 5125.14, "text": "mich please oder stimmt das war richtig dumm dass ich die igla am start hatte"}, {"id": 623, "start": 5125.14, "end": 5148.66, "text": "rpg brauma oder rippe jetzt gerade wieder richtig hat die gegner bambam bepusht bepusht"}, {"id": 624, "start": 5148.66, "end": 5159.06, "text": "ja so krasse schneiber du sie am arsch der welt ihn gibt es hier natürlich auch"}, {"id": 625, "start": 5159.06, "end": 5176.74, "text": "ok keine chance hier was zu reißen der typ kann hier einfach seine koggers runden drehen"}, {"id": 626, "start": 5176.74, "end": 5193.06, "text": "ohne dass was was wir müssen tank den tank bashing anti anti tank koggers"}, {"id": 627, "start": 5206.74, "end": 5217.06, "text": "das wird nichts kriegt ihr nicht dauern keine chance allein grad geht in panzer ich switch"}, {"id": 628, "start": 5217.06, "end": 5221.74, "text": "wieder oder was heißt allein wir probieren sie aber das geht gerade nicht muss ich muss"}, {"id": 629, "start": 5221.74, "end": 5224.06, "text": "jetzt lieber ich muss jetzt erstmal ein bisschen was bashen alter"}, {"id": 630, "start": 5224.06, "end": 5250.7, "text": "gebashed werden müssen da ist der lrw am start scheiße"}, {"id": 631, "start": 5250.7, "end": 5254.86, "text": "da machst du nix gegen gerade der joggle alter hier da ist er der joggle"}, {"id": 632, "start": 5254.86, "end": 5260.18, "text": "terran highway"}, {"id": 633, "start": 5260.18, "end": 5288.22, "text": "achtung jolo jolo mode ha ha ich bin durchgekommen"}, {"id": 634, "start": 5288.22, "end": 5304.74, "text": "ja ja natürlich natürlich das das hat nicht gereicht gut ich habe auch nicht gut getroffen"}, {"id": 635, "start": 5304.74, "end": 5310.9, "text": "aber trotzdem wenn das war ja ganz magazin in die richtung gesprayt kill assist 22"}, {"id": 636, "start": 5310.9, "end": 5325.02, "text": "also der der lv du da macht das richtig"}, {"id": 637, "start": 5325.02, "end": 5341.7, "text": "das war jetzt einfach mal random in die richtung"}, {"id": 638, "start": 5341.7, "end": 5359.86, "text": "der test wird hier ein 33 bämbel bämbel der fistet uns richtig"}, {"id": 639, "start": 5359.86, "end": 5373.78, "text": "hast du bämbel viel drei oder bämbel viel vier mehr gespielt bämbel viel drei eindeutig"}, {"id": 640, "start": 5373.78, "end": 5390.78, "text": "war der kack baum macht der baum da"}, {"id": 641, "start": 5390.78, "end": 5407.22, "text": "jetzt kann er mal sterben"}, {"id": 642, "start": 5407.22, "end": 5421.82, "text": "erinnern wir jetzt vielleicht endlich mal tot die machen rap champ des todes dahinten"}, {"id": 643, "start": 5421.82, "end": 5441.14, "text": "die da ich habe alle alle grenades raus postchamp postchamp postchamp postchamp lull aber hier"}, {"id": 644, "start": 5441.14, "end": 5466.1, "text": "irgendwo grenades hier hier hier ich brauche granaten aller bämbel jetzt aber wird er echt"}, {"id": 645, "start": 5466.1, "end": 5477.54, "text": "mal zeit oh sind die an b"}, {"id": 646, "start": 5477.54, "end": 5487.06, "text": "ok jetzt kann ich das ist der atme mit gottmaut kommt aber echt fast so vor"}, {"id": 647, "start": 5487.06, "end": 5504.34, "text": "jetzt drücken sie jetzt übrigens test wird beste posi genau da muss was machen die haben"}, {"id": 648, "start": 5504.34, "end": 5521.34, "text": "das ok das ist der untere der untere ist erstmal egal"}, {"id": 649, "start": 5521.34, "end": 5529.3, "text": "der wills wissen der test wird jetzt haben sie beides gelegt das ist erster map loss"}, {"id": 650, "start": 5529.3, "end": 5553.62, "text": "hier monka oh ne doch nicht ich sag nix"}, {"id": 651, "start": 5553.62, "end": 5562.26, "text": "wahrscheinlich erster map loss du kommst nicht in esl es gibt doch nicht mal mehr eine esl"}, {"id": 652, "start": 5562.26, "end": 5574.34, "text": "für das game mlg legit gibt es auch nicht mehr gabs das jemals für battlefield 3 gabs"}, {"id": 653, "start": 5574.34, "end": 5599.94, "text": "das jemals für battlefield 3 überhaupt ja kann ich mich nicht dran erinnern esl wire"}, {"id": 654, "start": 5599.94, "end": 5605.62, "text": "ja erinner mich nicht daran so ein crap eine esl wire verzeihen ich kenne so ein hässliches"}, {"id": 655, "start": 5605.62, "end": 5621.34, "text": "windows programm esl wire ne das da das ist so das ist woodface ist das richtiger woodface"}, {"id": 656, "start": 5621.34, "end": 5632.94, "text": "esl wire so siehts aus so ein krasser woodface gibt es gar nicht wir mussten das für overwatch"}, {"id": 657, "start": 5632.94, "end": 5637.94, "text": "immer verwenden wir haben ja ab und zu die weekly cups gespielt an overwatch und wir"}, {"id": 658, "start": 5637.94, "end": 5643.26, "text": "mussten das immer für die cups verwenden und einmal hatten wir über eine stunde delay"}, {"id": 659, "start": 5643.26, "end": 5647.82, "text": "das weiß ich noch in victor's 137 darstift für prime über eine stunde delay weil bei"}, {"id": 660, "start": 5647.82, "end": 5652.7, "text": "uns das nicht lief also bei einer kommt einer ist nicht ins game gekommen mit wire und bis"}, {"id": 661, "start": 5652.7, "end": 5656.26, "text": "sich dann irgendwie einer dazu bequemt hat uns mitzuteilen dass wir es auch ohne wire"}, {"id": 662, "start": 5656.26, "end": 5669.06, "text": "spielen dürfen hat eine stunde gedauert und irgendwie 50 neustarts oder so"}, {"id": 663, "start": 5669.06, "end": 5684.7, "text": "aber echt esl wire so so ein krasser pains champ das gibt es gar nicht"}, {"id": 664, "start": 5684.7, "end": 5702.98, "text": "aber ehrlich gesagt so richtig so richtig so richtig krass aktiv eigentlich nur sie sind"}, {"id": 665, "start": 5702.98, "end": 5728.82, "text": "eins und zwei achtung achtung pence haben wir die haben wir die jetzt dauernd haben wir"}, {"id": 666, "start": 5728.82, "end": 5737.74, "text": "die dauerntest wurde es raus ohne test wurde es jetzt bauern ok easy win easy spawn rap"}, {"id": 667, "start": 5737.74, "end": 5747.02, "text": "ink spawn rap ink easy easy win also leute stellt euch auf die langweilige spawn rap"}, {"id": 668, "start": 5747.02, "end": 5758.54, "text": "runde ein ha ha ha ha der kill alter der kill habt ihr es gesehen null keck keck triple"}, {"id": 669, "start": 5758.54, "end": 5784.68, "text": "you into"}, {"id": 670, "start": 5784.68, "end": 5796.96, "text": "ach stimmt man konnte ja leute in den büschchen hier nicht ratzen"}, {"id": 671, "start": 5796.96, "end": 5799.76, "text": "was sterben die denn jetzt auf einmal"}, {"id": 672, "start": 5799.76, "end": 5802.88, "text": "oh flank, flank action, flankerinos"}, {"id": 673, "start": 5802.88, "end": 5817.28, "text": "massive flank, oh, big brain place von den gegnern"}, {"id": 674, "start": 5817.28, "end": 5818.84, "text": "huge flank"}, {"id": 675, "start": 5818.84, "end": 5823.08, "text": "so muss es machen"}, {"id": 676, "start": 5823.08, "end": 5826.8, "text": "aber ich glaube das hilft auch nicht viel"}, {"id": 677, "start": 5826.8, "end": 5835.48, "text": "die attacker hatten ein LRV und soll ich euch mal sagen ich bin der meinung die attacker"}, {"id": 678, "start": 5835.48, "end": 5843.24, "text": "brauchen fast ein LRV so oft das ist so krasses spawn rape action hier das ist nicht normal also"}, {"id": 679, "start": 5843.24, "end": 5849.8, "text": "oftmals auf metro nicht immer manchmal wirst auch zerstört es war auch das zweite mkomm war"}, {"id": 680, "start": 5849.8, "end": 5856.78, "text": "auch dahinten irgendwo in der alpha noch ich weiß bis heute ehrlich gesagt nicht warum ich"}, {"id": 681, "start": 5856.78, "end": 5860.84, "text": "die ähre hatte battlefield 3 alpha spielen zu können vielleicht weil ich damals youtube videos"}, {"id": 682, "start": 5860.84, "end": 5868.16, "text": "gemacht habe"}, {"id": 683, "start": 5868.16, "end": 5870.48, "text": "oh das kam von der seite oder"}, {"id": 684, "start": 5870.48, "end": 5872.48, "text": "wow"}, {"id": 685, "start": 5872.48, "end": 5874.8, "text": "von wo schießt mich ja was"}, {"id": 686, "start": 5874.8, "end": 5881.68, "text": "dahinten"}, {"id": 687, "start": 5881.68, "end": 5898.84, "text": "was das für ein geiler schneibertyp dahinten"}, {"id": 688, "start": 5898.84, "end": 5900.88, "text": "ok chat"}, {"id": 689, "start": 5900.88, "end": 5905.04, "text": "ist spannend die runde"}, {"id": 690, "start": 5905.04, "end": 5909.4, "text": "also ist es extrem intens"}, {"id": 691, "start": 5909.4, "end": 5913.84, "text": "warum sage ich was"}, {"id": 692, "start": 5913.84, "end": 5919.48, "text": "extrem intens metro spawn rape runde"}, {"id": 693, "start": 5919.48, "end": 5928.0, "text": "guck mal wo unsere leute rumgammeln"}, {"id": 694, "start": 5928.0, "end": 5929.8, "text": "wo"}, {"id": 695, "start": 5929.8, "end": 5936.56, "text": "wo seid ihr"}, {"id": 696, "start": 5936.56, "end": 5940.76, "text": "also ich würde sagen die runde muss ich unbedingt aufnehmen und auf youtube als"}, {"id": 697, "start": 5940.76, "end": 5942.64, "text": "hintergrund verwenden"}, {"id": 698, "start": 5942.64, "end": 5945.84, "text": "bei einem video wo ich will dass die leute mir zuhören weil das gameplay wegen gucken"}, {"id": 699, "start": 5945.84, "end": 5960.68, "text": "sie sich das nicht an"}, {"id": 700, "start": 5960.68, "end": 5976.64, "text": "huge schneiber"}, {"id": 701, "start": 5976.64, "end": 5984.88, "text": "was ist passiert"}, {"id": 702, "start": 5984.88, "end": 5993.56, "text": "in du"}, {"id": 703, "start": 5993.56, "end": 5996.0, "text": "ahi ok"}, {"id": 704, "start": 5996.0, "end": 6006.4, "text": "nice gute runde gute runde gg it's"}, {"id": 705, "start": 6006.4, "end": 6015.04, "text": "it's gg gg good game good game"}, {"id": 706, "start": 6015.04, "end": 6018.04, "text": "superspannende real"}, {"id": 707, "start": 6018.04, "end": 6019.52, "text": "wie hota"}, {"id": 708, "start": 6019.52, "end": 6029.16, "text": "dankeschön für den sub"}, {"id": 709, "start": 6029.16, "end": 6030.16, "text": "massive runde"}, {"id": 710, "start": 6030.16, "end": 6039.0, "text": "das hoffe ich auch ganz ehrlich bettel für schick skill based matchmaking darf man"}, {"id": 711, "start": 6039.0, "end": 6040.0, "text": "das überhaupt sagen auf twitch"}, {"id": 712, "start": 6040.0, "end": 6047.6, "text": "sowas hängen gebliebenes in so einem arcade baller game wie die color of duty oder"}, {"id": 713, "start": 6047.6, "end": 6048.6, "text": "bettel vieler"}, {"id": 714, "start": 6048.6, "end": 6056.72, "text": "scheiß auf skill based matchmaking der größte kacke die sollen einfach machen wie jeder"}, {"id": 715, "start": 6056.72, "end": 6063.12, "text": "das bisher gemacht war was geht man macht den rank modus man macht den rank modus und"}, {"id": 716, "start": 6063.12, "end": 6071.0, "text": "in diesem rank modus kann man schwitzen tryharten bis einem dahinter platzt ja aber in einem"}, {"id": 717, "start": 6071.0, "end": 6079.76, "text": "normalen quickplay quick match will ich random shit haben und auch mal bisschen noobs zerstören"}, {"id": 718, "start": 6079.76, "end": 6084.16, "text": "ich sag eigentlich gar nicht mal jede runde einfach random ja weil ich mein ich werd auch"}, {"id": 719, "start": 6084.16, "end": 6088.76, "text": "massig runden zerstört aber ich will nicht dieses 50 aufhack ich will nicht dieses 50"}, {"id": 720, "start": 6088.76, "end": 6095.36, "text": "50 haben das 50 50 ist das schlimmste aller zeiten du kannst dich freuen wenn du 2a kd"}, {"id": 721, "start": 6095.36, "end": 6100.24, "text": "hast kann so geil wasch nice runde nice runde vor allem in color of duty verstehe ich nicht"}, {"id": 722, "start": 6100.24, "end": 6106.12, "text": "ein game was auf kill streaks also auf auf ultra basch runden aufsetzt wie kommt man"}, {"id": 723, "start": 6106.12, "end": 6113.16, "text": "auf die idee in ein spiel mit kill streaks in ein spiel mit kill streaks wie kommt man"}, {"id": 724, "start": 6113.16, "end": 6117.44, "text": "auf die idee skill best matchmaking einzubauen mein skill best matchmaking sorgt dafür dass"}, {"id": 725, "start": 6117.44, "end": 6121.92, "text": "man keine kill streaks erreicht oder vielleicht alle 50 runden mal irgendwie chopper gunner"}, {"id": 726, "start": 6121.92, "end": 6127.36, "text": "oder so wo ist der sinn warum macht man sich die mühe und überhaupt ein game was auf auf"}, {"id": 727, "start": 6127.36, "end": 6132.04, "text": "krassen krassen streaks und gebasche basiert und dann sagt man ach nee haben wir umsonst"}, {"id": 728, "start": 6132.04, "end": 6137.12, "text": "programmiert easy wir machen skill best matchmaking rein so dass es 90 prozent vom game useless"}, {"id": 729, "start": 6137.12, "end": 6142.48, "text": "ist ja es sind punkte streaks ja ihr habt recht es sind punkte streaks aber guck mal du"}, {"id": 730, "start": 6142.48, "end": 6151.96, "text": "erreichst ja auch so kaum den chopper gunner richtig dumm und ich bin der meinung keiner"}, {"id": 731, "start": 6151.96, "end": 6156.2, "text": "hat spaß ich sag es euch wie es ist okay meiner mein nach aber ich sag es euch trotzdem"}, {"id": 732, "start": 6156.2, "end": 6164.12, "text": "wie es ist selbst die noobs haben keinen spaß wer hat spaß daran die ganze zeit so 50 50"}, {"id": 733, "start": 6164.12, "end": 6174.08, "text": "runden zu haben ich finde woran man das gut sieht dass die meist gefeierte map in modern"}, {"id": 734, "start": 6174.08, "end": 6179.72, "text": "warfare war für shipment ist shipment eine map die der praktikant auf dem klo als er"}, {"id": 735, "start": 6179.72, "end": 6183.8, "text": "dünnschiss hatte erstellt hat und danach als er eine viertel stunde auf dem klo war kam"}, {"id": 736, "start": 6183.8, "end": 6189.72, "text": "er raus als ich hab shipment erstellt so und die wird gefeiert warum wird die gefeiert"}, {"id": 737, "start": 6189.72, "end": 6195.48, "text": "weil man darauf seine waffen leveln kann darauf kam das ist der einzige grund shipment ist"}, {"id": 738, "start": 6195.48, "end": 6202.4, "text": "gameplay technisch eine absolute kack map by the way unpopuläre meinung nuketown auch"}, {"id": 739, "start": 6202.4, "end": 6210.8, "text": "aber shipment ist ja die offensichtlich offensichtlichste test map überhaupt ja und das shipment so"}, {"id": 740, "start": 6210.8, "end": 6215.2, "text": "beliebt ist liegt einzeln daran die leute wollen diesen scheiß im multiplayer gar nicht"}, {"id": 741, "start": 6215.2, "end": 6220.48, "text": "spielen die wollen ihre waffen leveln und gut ist deswegen ist shipment populär der"}, {"id": 742, "start": 6220.48, "end": 6225.88, "text": "multiplayer wird nur gespielt captain peng du müsstest du nehmen mal sprint rein am"}, {"id": 743, "start": 6225.88, "end": 6232.28, "text": "besten weil ich hab ich hab ammo ane du hast granaten okay alles klar fast sprint wäre"}, {"id": 744, "start": 6232.28, "end": 6237.44, "text": "auch noch nice jetzt haben wir den joggel der joggel jetzt kann uns nix passieren wenn"}, {"id": 745, "start": 6237.44, "end": 6263.72, "text": "der joggel am start ist meine route ist da übelst verschissen"}, {"id": 746, "start": 6263.72, "end": 6272.48, "text": "what the hell ist hier wieder los"}, {"id": 747, "start": 6272.48, "end": 6284.76, "text": "oh jetzt wird von der seite reingepusht seiten pusher sind am start"}, {"id": 748, "start": 6284.76, "end": 6306.92, "text": "hier ist nix mehr dran wie haben wir schon angelegt lull"}, {"id": 749, "start": 6306.92, "end": 6320.32, "text": "wie du okay die kriegen grad echt auf den sack die kriegen grad echt ganz gut auf den"}, {"id": 750, "start": 6320.32, "end": 6325.92, "text": "sack"}, {"id": 751, "start": 6325.92, "end": 6333.28, "text": "kein cute mod stimmt der sebaro ist ja ganz ja ah der sebaro muss bestimmt muss bestimmt"}, {"id": 752, "start": 6333.28, "end": 6340.08, "text": "informatik stellz lärm"}, {"id": 753, "start": 6340.08, "end": 6356.08, "text": "unter mir ist was"}, {"id": 754, "start": 6356.08, "end": 6365.72, "text": "oh nee fuck jetzt blitz falls noch raus geht"}, {"id": 755, "start": 6365.72, "end": 6373.48, "text": "immer raus er macht nichts verrennen oh nice dankeschön dankeschön"}, {"id": 756, "start": 6373.48, "end": 6374.48, "text": "hallo battlefield"}, {"id": 757, "start": 6374.48, "end": 6390.28, "text": "ich glaube die sind noch hinter uns"}, {"id": 758, "start": 6390.28, "end": 6408.24, "text": "oh granate das war hinter der wand please"}, {"id": 759, "start": 6408.24, "end": 6410.36, "text": "okay battlefield logisch ist nicht immer logisch"}, {"id": 760, "start": 6410.36, "end": 6418.36, "text": "okay jetzt jetzt werden sie ja instant tryhard die gegner jetzt eben noch voll auf den sack"}, {"id": 761, "start": 6418.36, "end": 6425.52, "text": "gekriegt und jetzt der tryhard mode raus"}, {"id": 762, "start": 6425.52, "end": 6432.8, "text": "oh was okay die battlefield für sie"}, {"id": 763, "start": 6432.8, "end": 6443.52, "text": "was ist was leute ich bin absolut verwirrt was geht was geht hier gerade"}, {"id": 764, "start": 6443.52, "end": 6450.44, "text": "wollte er gerade mich messen und deswegen habe ich so einen boost bekommen oder so"}, {"id": 765, "start": 6450.44, "end": 6463.92, "text": "okay captain pang ich komm bei dir mit"}, {"id": 766, "start": 6463.92, "end": 6472.16, "text": "what is happening ja das frag ich mich ernsthaft"}, {"id": 767, "start": 6472.16, "end": 6475.4, "text": "komm her komm her"}, {"id": 768, "start": 6475.4, "end": 6476.4, "text": "fuck ich dachte da oben ist was"}, {"id": 769, "start": 6476.4, "end": 6484.92, "text": "hallo please move keep on moving"}, {"id": 770, "start": 6484.92, "end": 6492.88, "text": "oh der macht die legehenne"}, {"id": 771, "start": 6492.88, "end": 6503.52, "text": "der macht die richtig echte legit first class legehenne"}, {"id": 772, "start": 6503.52, "end": 6507.52, "text": "die massive big brain legehenne ist am start die war gerade auf b"}, {"id": 773, "start": 6507.52, "end": 6534.6, "text": "hol auf"}, {"id": 774, "start": 6534.6, "end": 6536.6, "text": "ey what the f**k"}, {"id": 775, "start": 6540.6, "end": 6542.6, "text": "hei hei hei"}, {"id": 776, "start": 6544.6, "end": 6546.6, "text": "hei hei hei"}, {"id": 777, "start": 6554.6, "end": 6556.6, "text": "ok ok ich camp mir mal kurz hier oben einen ab"}, {"id": 778, "start": 6560.6, "end": 6562.6, "text": "ich kann da nicht runter, ich, leute, leute, ich kann da nicht runter"}, {"id": 779, "start": 6562.6, "end": 6564.6, "text": "ich, ich kann euch aber, ich kann euch aber bei mir spawnen lassen"}, {"id": 780, "start": 6572.6, "end": 6574.6, "text": "frex out"}, {"id": 781, "start": 6578.6, "end": 6580.6, "text": "auf auf auf auf auf"}, {"id": 782, "start": 6580.6, "end": 6582.6, "text": "post jam post jam post jam wo seid ihr?"}, {"id": 783, "start": 6588.6, "end": 6590.6, "text": "haben wir hier ne muni kiste? ah nice nade"}, {"id": 784, "start": 6590.6, "end": 6592.6, "text": "gib granate, gib granate"}, {"id": 785, "start": 6596.6, "end": 6598.6, "text": "hallo"}, {"id": 786, "start": 6598.6, "end": 6600.6, "text": "muni kiste please"}, {"id": 787, "start": 6600.6, "end": 6602.6, "text": "granate aufladen"}, {"id": 788, "start": 6610.6, "end": 6612.6, "text": "mist"}, {"id": 789, "start": 6612.6, "end": 6614.6, "text": "max wo ist dein noob tube?"}, {"id": 790, "start": 6614.6, "end": 6616.6, "text": "ich hab kein noob tube in dem game"}, {"id": 791, "start": 6616.6, "end": 6618.6, "text": "glaub ich hab mich nicht mal unlocked"}, {"id": 792, "start": 6618.6, "end": 6620.6, "text": "320 hast du steil an mich unlocked"}, {"id": 793, "start": 6620.6, "end": 6622.6, "text": "ok ok jetzt"}, {"id": 794, "start": 6622.6, "end": 6624.6, "text": "achtung achtung"}, {"id": 795, "start": 6624.6, "end": 6626.6, "text": "jetzt massive champ massive champ"}, {"id": 796, "start": 6628.6, "end": 6630.6, "text": "jetzt kommts jetzt NEIN"}, {"id": 797, "start": 6630.6, "end": 6632.6, "text": "der sitzt, der sitzt da hinten"}, {"id": 798, "start": 6632.6, "end": 6634.6, "text": "und wartet bis einer rausläuft"}, {"id": 799, "start": 6634.6, "end": 6636.6, "text": "alter"}, {"id": 800, "start": 6636.6, "end": 6638.6, "text": "lull"}, {"id": 801, "start": 6638.6, "end": 6640.6, "text": "damit hätte ich ja im leben nicht"}, {"id": 802, "start": 6640.6, "end": 6642.6, "text": "gerechnet, dass da so ein kleiner"}, {"id": 803, "start": 6642.6, "end": 6644.6, "text": "stellzermann drinne ist"}, {"id": 804, "start": 6644.6, "end": 6646.6, "text": "im leben nicht"}, {"id": 805, "start": 6646.6, "end": 6660.6, "text": "im leben nicht"}, {"id": 806, "start": 6660.6, "end": 6684.6, "text": "moment falsche richtung wo ich hier lange"}, {"id": 807, "start": 6684.6, "end": 6686.6, "text": "oh das sind 30"}, {"id": 808, "start": 6686.6, "end": 6704.6, "text": "an enemies"}, {"id": 809, "start": 6704.6, "end": 6722.6, "text": "jetzt wirds aber grad anstrengend"}, {"id": 810, "start": 6722.6, "end": 6724.6, "text": "massive nade hinten in den tunnel jawoll"}, {"id": 811, "start": 6724.6, "end": 6726.6, "text": "die kommt gut die kommt gut"}, {"id": 812, "start": 6726.6, "end": 6728.6, "text": "bam ok die sind schon alle weg"}, {"id": 813, "start": 6728.6, "end": 6734.6, "text": "spring champ spring champ"}, {"id": 814, "start": 6734.6, "end": 6736.6, "text": "ich wusste es genau dass ihr da seid"}, {"id": 815, "start": 6736.6, "end": 6738.6, "text": "leute ich wusste es"}, {"id": 816, "start": 6738.6, "end": 6740.6, "text": "ich wusste es"}, {"id": 817, "start": 6740.6, "end": 6742.6, "text": "ich hab euch predicted"}, {"id": 818, "start": 6744.6, "end": 6746.6, "text": "massive prediktungs champ"}, {"id": 819, "start": 6746.6, "end": 6754.6, "text": "ey meine granate war um die ecke"}, {"id": 820, "start": 6754.6, "end": 6756.6, "text": "ok ok ok ok"}, {"id": 821, "start": 6756.6, "end": 6758.6, "text": "post champ post champ post champ"}, {"id": 822, "start": 6758.6, "end": 6760.6, "text": "jetzt um die ecke"}, {"id": 823, "start": 6760.6, "end": 6762.6, "text": "oh oh oh oh oh"}, {"id": 824, "start": 6762.6, "end": 6764.6, "text": "safe safe"}, {"id": 825, "start": 6768.6, "end": 6770.6, "text": "alter fall da"}, {"id": 826, "start": 6770.6, "end": 6772.6, "text": "oh"}, {"id": 827, "start": 6772.6, "end": 6774.6, "text": "oh"}, {"id": 828, "start": 6774.6, "end": 6776.6, "text": "alter fall da"}, {"id": 829, "start": 6776.6, "end": 6778.6, "text": "jetzt jetzt ne nade"}, {"id": 830, "start": 6794.6, "end": 6796.6, "text": "oh nein shotgun noob"}, {"id": 831, "start": 6796.6, "end": 6798.6, "text": "nein nicht wirklich"}, {"id": 832, "start": 6798.6, "end": 6800.6, "text": "nee wirklich"}, {"id": 833, "start": 6800.6, "end": 6802.6, "text": "an der stelle"}, {"id": 834, "start": 6802.6, "end": 6804.6, "text": "bietet sich tatsächlich an judentag"}, {"id": 835, "start": 6804.6, "end": 6806.6, "text": "äh bietet sich tatsächlich an dass"}, {"id": 836, "start": 6806.6, "end": 6808.6, "text": "man shotgun spielt warum nicht"}, {"id": 837, "start": 6810.6, "end": 6812.6, "text": "why not"}, {"id": 838, "start": 6824.6, "end": 6826.6, "text": "fuck"}, {"id": 839, "start": 6828.6, "end": 6830.6, "text": "wir müssen eigentlich"}, {"id": 840, "start": 6830.6, "end": 6832.6, "text": "hier lang stelsen jetzt"}, {"id": 841, "start": 6832.6, "end": 6834.6, "text": "kann man hier durch die tür"}, {"id": 842, "start": 6834.6, "end": 6836.6, "text": "durch die tür den tür bash machen"}, {"id": 843, "start": 6836.6, "end": 6838.6, "text": "oh nice der tür bash"}, {"id": 844, "start": 6838.6, "end": 6840.6, "text": "der door bash ist real"}, {"id": 845, "start": 6842.6, "end": 6844.6, "text": "der door bash achtung gleich kommen"}, {"id": 846, "start": 6844.6, "end": 6846.6, "text": "um die ecke bam"}, {"id": 847, "start": 6846.6, "end": 6848.6, "text": "der door bash"}, {"id": 848, "start": 6848.6, "end": 6850.6, "text": "auf komm komm komm um die ecke"}, {"id": 849, "start": 6850.6, "end": 6852.6, "text": "komm nur um die ecke ich muss euch bashen"}, {"id": 850, "start": 6852.6, "end": 6854.6, "text": "ich laufe da jetzt nicht hin"}, {"id": 851, "start": 6854.6, "end": 6856.6, "text": "ich aim jetzt einfach nur wie der letzte kack"}, {"id": 852, "start": 6856.6, "end": 6858.6, "text": "um die ecke ab"}, {"id": 853, "start": 6858.6, "end": 6860.6, "text": "komm raus"}, {"id": 854, "start": 6860.6, "end": 6862.6, "text": "komm raus okay ich hab keinen bock"}, {"id": 855, "start": 6866.6, "end": 6868.6, "text": "keep on moving"}, {"id": 856, "start": 6872.6, "end": 6874.6, "text": "ha passen sich durch die tür"}, {"id": 857, "start": 6874.6, "end": 6876.6, "text": "durch"}, {"id": 858, "start": 6882.6, "end": 6884.6, "text": "ordinate"}, {"id": 859, "start": 6884.6, "end": 6888.6, "text": "ordinate"}, {"id": 860, "start": 6890.6, "end": 6892.6, "text": "keep on moving"}, {"id": 861, "start": 6892.6, "end": 6894.6, "text": "okay jetzt"}, {"id": 862, "start": 6894.6, "end": 6896.6, "text": "ey wie sie sich da"}, {"id": 863, "start": 6896.6, "end": 6898.6, "text": "wie sie sich da stapeln an der ecke"}, {"id": 864, "start": 6900.6, "end": 6902.6, "text": "achtung huge flank"}, {"id": 865, "start": 6902.6, "end": 6904.6, "text": "massive flank herino"}, {"id": 866, "start": 6908.6, "end": 6910.6, "text": "ich bin zu"}, {"id": 867, "start": 6910.6, "end": 6912.6, "text": "dick gewesen, ich hab schon um die ecke geguckt"}, {"id": 868, "start": 6912.6, "end": 6915.6, "text": "hat um die Ecke geguckt, bevor ich um die Ecke gekommen bin."}, {"id": 869, "start": 6918.4, "end": 6919.9, "text": "Deswegen wurde das nix."}, {"id": 870, "start": 6921.7, "end": 6922.3, "text": "Oh ja!"}, {"id": 871, "start": 6924.1, "end": 6925.9, "text": "Flankchamp, Flankierungschamp!"}, {"id": 872, "start": 6930.9, "end": 6932.3, "text": "Massive Flankierungschamp!"}, {"id": 873, "start": 6932.3, "end": 6938.6, "text": "Massive Flankierungschamp am Start!"}, {"id": 874, "start": 6944.6, "end": 6945.6, "text": "Huge!"}, {"id": 875, "start": 6945.6, "end": 6953.6, "text": "Spotted the Hostile Schieber!"}, {"id": 876, "start": 6955.6, "end": 6957.1, "text": "Lo-lo-lo-lo! Oh!"}, {"id": 877, "start": 6957.6, "end": 6966.1, "text": "Äh, was wollten wir? Firestorm, Kack, Island, Dema, Vent, Peek, äh, Firestorm, Firestorm, Caspian."}, {"id": 878, "start": 6966.1, "end": 6968.1, "text": "Komm, Caspianborder hatten wir lange nicht mehr."}, {"id": 879, "start": 6972.1, "end": 6973.1, "text": "Nice Runde!"}, {"id": 880, "start": 6973.1, "end": 6976.1, "text": "Hat aber auch wieder Bock gemacht."}, {"id": 881, "start": 6981.1, "end": 6983.1, "text": "Du-du-du-du-du-du-du."}, {"id": 882, "start": 6985.6, "end": 6990.1, "text": "Ja, Veltel-Error flankt so hart und killt die Gegner schon im Spawn-Menü."}, {"id": 883, "start": 6992.1, "end": 6993.1, "text": "So sieht's aus."}, {"id": 884, "start": 6994.1, "end": 6996.1, "text": "So sieht's aus."}, {"id": 885, "start": 6996.1, "end": 7001.1, "text": "So, mal gucken ob ich noch Platz auf der Platte hab."}, {"id": 886, "start": 7004.1, "end": 7006.1, "text": "Ach ja, ja, brauch ja kaum was, brauch ja."}, {"id": 887, "start": 7015.1, "end": 7018.1, "text": "So, was kommt denn jetzt? Das war die Hinrunde Metro."}, {"id": 888, "start": 7021.1, "end": 7023.1, "text": "Das war die Hinrunde Metro."}, {"id": 889, "start": 7023.1, "end": 7025.1, "text": "Ich hab Hunger, wisst ihr das?"}, {"id": 890, "start": 7027.1, "end": 7032.1, "text": "Warte mal ab was für ne Map kommt. Eigentlich hab ich weder auf Firestorm noch auf Caspianborder Bock."}, {"id": 891, "start": 7034.1, "end": 7038.1, "text": "Dema, Vent, Peek. Ok, Dema, Vent, Peek könnte man sich vielleicht nochmal geben."}, {"id": 892, "start": 7038.1, "end": 7044.1, "text": "Dema, Vent, Peek könnte man sich nochmal geben, ja."}, {"id": 893, "start": 7044.1, "end": 7048.1, "text": "Gestern Space Extreme geschaut. Nee, aber ich hab die Zusammenfassung geguckt."}, {"id": 894, "start": 7048.1, "end": 7057.1, "text": "Es war richtig nice. Dieses, äh, wie heißt das? Spaceship-Landung hat halt nicht ganz hingehauen, aber der Rest sah schon geil aus, ne?"}, {"id": 895, "start": 7058.1, "end": 7060.1, "text": "Das Ding sieht überhaupt nicht aus."}, {"id": 896, "start": 7060.1, "end": 7067.1, "text": "Das Ding sieht überhaupt nicht wie so ne 115 Rakete aus. Das sieht halt so richtig futuristisch aus."}, {"id": 897, "start": 7067.1, "end": 7074.1, "text": "Und, äh, auch der Antrieb sieht überhaupt nicht so raketenmäßig aus. Das sieht eher so Bunsenbrenner-mäßig aus."}, {"id": 898, "start": 7075.1, "end": 7078.1, "text": "Echt nice. Ich guck meistens nur die Zusammenfassung."}, {"id": 899, "start": 7080.1, "end": 7086.1, "text": "Ich guck meistens nur die Zusammenfassung, weil ansonsten die anderen Streams gehen irgendwie von 85 Billiarden Minuten."}, {"id": 900, "start": 7086.1, "end": 7092.1, "text": "Oh,Oh,Oh,Oh. B,B,B,B,B,B,B, B,B,B,B,B,B,B,B,B,B,B,B,B,B,B,B,B."}, {"id": 901, "start": 7096.1, "end": 7098.1, "text": "Okay, verschissen."}, {"id": 902, "start": 7099.1, "end": 7101.1, "text": "Das Ding sieht aus wie ein Getreidesilo."}, {"id": 903, "start": 7102.1, "end": 7106.1, "text": "Ah, naja, es, es, es find halt cool, dass es so glänzt."}, {"id": 904, "start": 7110.1, "end": 7112.1, "text": "Oh, Dachchamp am Start."}, {"id": 905, "start": 7112.1, "end": 7115.1, "text": "Ah, naja, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es, es."}, {"id": 906, "start": 7115.1, "end": 7117.1, "text": "Oh, Dachchamp am Start!"}, {"id": 907, "start": 7118.6, "end": 7120.6, "text": "Ein exzellenter Dachchamp!"}, {"id": 908, "start": 7140.6, "end": 7142.1, "text": "Ich warte jetzt hier einfach."}, {"id": 909, "start": 7142.1, "end": 7143.6, "text": "Warum soll ich hier rausgehen?"}, {"id": 910, "start": 7143.6, "end": 7145.1, "text": "What the hell ist das?"}, {"id": 911, "start": 7145.1, "end": 7167.6, "text": "Oh fuck, die haben schon gelegt!"}, {"id": 912, "start": 7167.6, "end": 7176.1, "text": "Okay, okay, okay, okay."}, {"id": 913, "start": 7176.1, "end": 7177.6, "text": "Postchamp, Postchamp."}, {"id": 914, "start": 7177.6, "end": 7180.1, "text": "Wir brauchen Big-Prain-Aktion Leute."}, {"id": 915, "start": 7180.1, "end": 7181.6, "text": "Only Big-Prain-Aktion."}, {"id": 916, "start": 7181.6, "end": 7182.6, "text": "Die retten uns jetzt."}, {"id": 917, "start": 7182.6, "end": 7185.1, "text": "Wir brauchen wirklich Big-Prain-Aktion."}, {"id": 918, "start": 7185.1, "end": 7186.6, "text": "Sonst geht's nicht."}, {"id": 919, "start": 7190.1, "end": 7191.6, "text": "Only Big...oh."}, {"id": 920, "start": 7191.6, "end": 7196.6, "text": "Wir brauchen irgendwie eine richtig massive 500 IQ-Aktion,"}, {"id": 921, "start": 7196.6, "end": 7201.1, "text": "dass wir die Gegner hier wieder raus der Base kriegen."}, {"id": 922, "start": 7201.1, "end": 7205.1, "text": "Irgendwas, irgendwas richtig Big-Prainiges brauchen wir da jetzt."}, {"id": 923, "start": 7205.1, "end": 7208.6, "text": "Weil sonst haben wir die Base verloren."}, {"id": 924, "start": 7208.6, "end": 7213.1, "text": "Die stehen da mit dem Auto drin und alles."}, {"id": 925, "start": 7213.1, "end": 7217.1, "text": "Only Big-Prain brauchen wir jetzt."}, {"id": 926, "start": 7217.1, "end": 7219.1, "text": "Scheiße, guck."}, {"id": 927, "start": 7219.1, "end": 7228.6, "text": "Wie viel, wie viel 5 Billionen Gegner sind hier am Start?"}, {"id": 928, "start": 7228.6, "end": 7233.6, "text": "5 Trillionen Gegner."}, {"id": 929, "start": 7233.6, "end": 7239.1, "text": "Ey, der Tasteful, der will's aber echt wissen immer."}, {"id": 930, "start": 7239.1, "end": 7250.1, "text": "Der will's immer voll wissen, der Dude."}, {"id": 931, "start": 7250.1, "end": 7253.1, "text": "Letzte Runde hatten halt fast alle guten Spieler auf einer Seite."}, {"id": 932, "start": 7253.1, "end": 7269.1, "text": "Das war halt busy, busy einseitig, ne."}, {"id": 933, "start": 7269.1, "end": 7273.1, "text": "So, mal gucken, ob das jetzt hinhaut."}, {"id": 934, "start": 7273.1, "end": 7280.1, "text": "Mal gucken, ob hier Big-Prain-Aktion."}, {"id": 935, "start": 7280.1, "end": 7288.1, "text": "Massive-Prain-Aktion jetzt hier, Leute."}, {"id": 936, "start": 7288.1, "end": 7317.1, "text": "Oh, da kommt was."}, {"id": 937, "start": 7317.1, "end": 7320.1, "text": "Oh, jetzt wollen sie zu mir."}, {"id": 938, "start": 7320.1, "end": 7325.1, "text": "Jetzt wollen sie mich bashen."}, {"id": 939, "start": 7325.1, "end": 7329.1, "text": "Die haben gelegt, die haben die Legehände gemacht in der Zwischenzeit."}, {"id": 940, "start": 7329.1, "end": 7333.1, "text": "Guckt mal, während wir hier rumgenoopt haben, haben die die Legehände gemacht."}, {"id": 941, "start": 7333.1, "end": 7337.1, "text": "Es ist keiner mehr hinten."}, {"id": 942, "start": 7337.1, "end": 7355.1, "text": "Während wir gebashed haben, haben die die Legehände gemacht."}, {"id": 943, "start": 7355.1, "end": 7371.1, "text": "Das ist doch scheiße."}, {"id": 944, "start": 7371.1, "end": 7386.1, "text": "Richtig Low-Prain-Aim."}, {"id": 945, "start": 7386.1, "end": 7392.1, "text": "Ich hab schon versucht, während ich den einen gekillt hab, auf den anderen rüberzuziehen."}, {"id": 946, "start": 7392.1, "end": 7393.1, "text": "Das war ziemlich bescheuert."}, {"id": 947, "start": 7393.1, "end": 7396.1, "text": "Der Flank war wieder, der Flank war wieder next level."}, {"id": 948, "start": 7396.1, "end": 7402.1, "text": "Der Flank war gut."}, {"id": 949, "start": 7402.1, "end": 7406.1, "text": "Oh, es ist auch noch A."}, {"id": 950, "start": 7406.1, "end": 7408.1, "text": "Bei A geht klar."}, {"id": 951, "start": 7408.1, "end": 7413.1, "text": "A geht voll klar."}, {"id": 952, "start": 7413.1, "end": 7419.1, "text": "Okay, ich mach wieder, ich mach wieder Big-Prain-Flank."}, {"id": 953, "start": 7419.1, "end": 7447.1, "text": "Der Automann, der kriegt diese Runde richtig was gerissen."}, {"id": 954, "start": 7447.1, "end": 7452.1, "text": "What the fuck, Battlefield, please."}, {"id": 955, "start": 7452.1, "end": 7455.1, "text": "Das war so ein geiler Flank gerade, aber nope."}, {"id": 956, "start": 7455.1, "end": 7464.1, "text": "Aber kein Bock."}, {"id": 957, "start": 7464.1, "end": 7469.1, "text": "Oh, das Auto, das Auto, nein."}, {"id": 958, "start": 7469.1, "end": 7475.1, "text": "Richtiges Oldschool-Film, ja, macht auch Bock."}, {"id": 959, "start": 7475.1, "end": 7483.1, "text": "Guck mal, der Chat wieder geflamet wird wieder."}, {"id": 960, "start": 7483.1, "end": 7488.1, "text": "Okay."}, {"id": 961, "start": 7488.1, "end": 7498.1, "text": "Big-Prain, Big-Prain, Diffuse, Diffuse-Champ."}, {"id": 962, "start": 7498.1, "end": 7499.1, "text": "Hä?"}, {"id": 963, "start": 7499.1, "end": 7514.1, "text": "Oh, oh nee, Smoke-Champ."}, {"id": 964, "start": 7514.1, "end": 7519.1, "text": "Okay, da drüben ist nix mehr."}, {"id": 965, "start": 7519.1, "end": 7527.1, "text": "Wo sind, sind die auf dem Dach hier, kann das sein?"}, {"id": 966, "start": 7527.1, "end": 7530.1, "text": "Ich kann den nicht gerätzen, oh shit."}, {"id": 967, "start": 7530.1, "end": 7534.1, "text": "Versuch euch zu holen, Jungs."}, {"id": 968, "start": 7534.1, "end": 7541.1, "text": "Der ist da rechts unten in der Ecke."}, {"id": 969, "start": 7541.1, "end": 7545.1, "text": "Man."}, {"id": 970, "start": 7545.1, "end": 7551.1, "text": "Obrit, Obrit, basht sie weg."}, {"id": 971, "start": 7551.1, "end": 7553.1, "text": "Okay, 29 noch."}, {"id": 972, "start": 7553.1, "end": 7556.1, "text": "29 geht, 29 geht."}, {"id": 973, "start": 7556.1, "end": 7563.1, "text": "Pause-Champ."}, {"id": 974, "start": 7563.1, "end": 7567.1, "text": "Ach so, das ist einer von mir."}, {"id": 975, "start": 7567.1, "end": 7568.1, "text": "What the fuck?"}, {"id": 976, "start": 7568.1, "end": 7578.1, "text": "Wo, wo, wo?"}, {"id": 977, "start": 7578.1, "end": 7580.1, "text": "Da will er, da will er einfach drauf landen."}, {"id": 978, "start": 7580.1, "end": 7583.1, "text": "Nee, nee, so einfach geht's ja nicht hier."}, {"id": 979, "start": 7583.1, "end": 7591.1, "text": "Landungs-Champ können wir nicht so einfach durchgehen lassen."}, {"id": 980, "start": 7591.1, "end": 7597.1, "text": "Fadel, ich hol dich."}, {"id": 981, "start": 7597.1, "end": 7600.1, "text": "Woa, wie schnell der wieder am Start war."}, {"id": 982, "start": 7600.1, "end": 7601.1, "text": "Ich fass es nicht."}, {"id": 983, "start": 7601.1, "end": 7603.1, "text": "Ach, das war recht so ein Dude."}, {"id": 984, "start": 7603.1, "end": 7604.1, "text": "Nee."}, {"id": 985, "start": 7604.1, "end": 7606.1, "text": "Wisst ihr, was ich auch nice an Battlefield 3 finde?"}, {"id": 986, "start": 7606.1, "end": 7608.1, "text": "Dass jeder nen Kill kriegt."}, {"id": 987, "start": 7608.1, "end": 7612.1, "text": "Also sprich, der, nee nee, Spaß, also der, der wiederbelebt wird, kriegt keinen Death."}, {"id": 988, "start": 7612.1, "end": 7616.1, "text": "Aber du kriegst den Kill, was echt nice ist."}, {"id": 989, "start": 7616.1, "end": 7619.1, "text": "Da fühlt sich keiner irgendwie verarscht."}, {"id": 990, "start": 7619.1, "end": 7623.1, "text": "Du kriegst den Kill, weil du hast ihn ja auch gekillt."}, {"id": 991, "start": 7623.1, "end": 7626.1, "text": "Und er kriegt keinen Death, weil er wiederbelebt wurde."}, {"id": 992, "start": 7626.1, "end": 7632.1, "text": "Find ich eigentlich fair."}, {"id": 993, "start": 7632.1, "end": 7638.1, "text": "Find ich echt fair."}, {"id": 994, "start": 7638.1, "end": 7642.1, "text": "Hallo."}, {"id": 995, "start": 7642.1, "end": 7661.1, "text": "Nice Champ."}, {"id": 996, "start": 7661.1, "end": 7664.1, "text": "Nice."}, {"id": 997, "start": 7664.1, "end": 7667.1, "text": "Kann ich mir das später als Wiederholung ansehen?"}, {"id": 998, "start": 7667.1, "end": 7669.1, "text": "Ja."}, {"id": 999, "start": 7669.1, "end": 7673.1, "text": "Ja, ja, kannst du?"}, {"id": 1000, "start": 7673.1, "end": 7674.1, "text": "Kannst du?"}, {"id": 1001, "start": 7674.1, "end": 7678.1, "text": "Wobei, die Runde jetzt ist vielleicht nicht gerade wert, sich als Wiederholung anzugucken."}, {"id": 1002, "start": 7678.1, "end": 7681.1, "text": "Wir hatten schon richtig nice Runden heute."}, {"id": 1003, "start": 7681.1, "end": 7683.1, "text": "Und der Stream ist als Watt da."}, {"id": 1004, "start": 7683.1, "end": 7692.1, "text": "Ich hab ja keine Musik laufen."}, {"id": 1005, "start": 7692.1, "end": 7693.1, "text": "Wie lange sind wir eigentlich schon?"}, {"id": 1006, "start": 7693.1, "end": 7696.1, "text": "On."}, {"id": 1007, "start": 7696.1, "end": 7697.1, "text": "Zwei Stunden."}, {"id": 1008, "start": 7697.1, "end": 7702.1, "text": "Dann hab ich ein paar Mal neu, statt zweieinhalb Stunden oder so."}, {"id": 1009, "start": 7702.1, "end": 7703.1, "text": "Und jetzt?"}, {"id": 1010, "start": 7703.1, "end": 7705.1, "text": "Oh, jetzt Demavent Peak Attacker."}, {"id": 1011, "start": 7705.1, "end": 7706.1, "text": "Jawoll."}, {"id": 1012, "start": 7706.1, "end": 7711.1, "text": "Hab ich Bock drauf."}, {"id": 1013, "start": 7711.1, "end": 7713.1, "text": "Wie sieht es an der Cheaterfront in Battlefield 3 aus?"}, {"id": 1014, "start": 7713.1, "end": 7714.1, "text": "Also wir hatten nur zwei Cheater."}, {"id": 1015, "start": 7714.1, "end": 7718.1, "text": "Einen hatte ich Offstream, einen hatten wir Onstream."}, {"id": 1016, "start": 7718.1, "end": 7721.1, "text": "Vorhin hatte ich einen, der mit einem LMG One-Shotted hat, across map."}, {"id": 1017, "start": 7721.1, "end": 7723.1, "text": "Also das war schon, und immer wieder."}, {"id": 1018, "start": 7723.1, "end": 7727.1, "text": "Das war schon recht verdächtig."}, {"id": 1019, "start": 7727.1, "end": 7732.1, "text": "Aber wahrscheinlich war der einfach nur besser als ich."}, {"id": 1020, "start": 7732.1, "end": 7735.1, "text": "Das wahrscheinlich, man muss ja nicht immer alles als Cheater bezeichnen."}, {"id": 1021, "start": 7735.1, "end": 7738.1, "text": "Kann schon mal sein, across the map mit dem LMG."}, {"id": 1022, "start": 7738.1, "end": 7741.1, "text": "50 Mal hintereinander in 30 Sekunden."}, {"id": 1023, "start": 7741.1, "end": 7745.1, "text": "Kann schon mal passieren."}, {"id": 1024, "start": 7745.1, "end": 7750.1, "text": "Lucky, kann schon mal passieren."}, {"id": 1025, "start": 7750.1, "end": 7760.1, "text": "Wir sollten auch so einen geilen Autofahrt-Champ machen, wie die."}, {"id": 1026, "start": 7760.1, "end": 7762.1, "text": "Jetzt seh ich schon Big Brain, Runde am Start."}, {"id": 1027, "start": 7762.1, "end": 7774.1, "text": "Also übrigens der Heli."}, {"id": 1028, "start": 7774.1, "end": 7785.1, "text": "Alter, kann ich mal den Dude erwischen da drin?"}, {"id": 1029, "start": 7785.1, "end": 7788.1, "text": "Nice Charge, exquisite."}, {"id": 1030, "start": 7788.1, "end": 7792.1, "text": "Komm runter."}, {"id": 1031, "start": 7792.1, "end": 7803.1, "text": "Lege Henne, die Lege Henne is real."}, {"id": 1032, "start": 7803.1, "end": 7819.1, "text": "Kann man den durch? Nee, oder?"}, {"id": 1033, "start": 7819.1, "end": 7834.1, "text": "0W"}, {"id": 1034, "start": 7834.1, "end": 7841.1, "text": "Ich retze nicht, kann ich retzen?"}, {"id": 1035, "start": 7841.1, "end": 7845.1, "text": "Das war knapp."}, {"id": 1036, "start": 7845.1, "end": 7856.1, "text": "Ich leg mich mal kurz hin."}, {"id": 1037, "start": 7856.1, "end": 7861.1, "text": "Ja ja ja, PogChamp, erwische ich ihn? Nein."}, {"id": 1038, "start": 7861.1, "end": 7863.1, "text": "Hallo, springen please."}, {"id": 1039, "start": 7863.1, "end": 7873.1, "text": "Elite Soldat, kletter da mal hoch."}, {"id": 1040, "start": 7873.1, "end": 7878.1, "text": "Huge Elite Soldier."}, {"id": 1041, "start": 7878.1, "end": 7887.1, "text": "In your face, man."}, {"id": 1042, "start": 7887.1, "end": 7897.1, "text": "Richtig schön ins Gesicht."}, {"id": 1043, "start": 7897.1, "end": 7903.1, "text": "Jawoll, genau, wo war hier der Aufgang?"}, {"id": 1044, "start": 7903.1, "end": 7905.1, "text": "Das ist nämlich auch Pogger-Scooter hier."}, {"id": 1045, "start": 7905.1, "end": 7909.1, "text": "Ich weiß immer nicht, ob die vom Hersteller so gedacht war oder nicht."}, {"id": 1046, "start": 7909.1, "end": 7913.1, "text": "Aber ich geh jetzt einfach mal von aus."}, {"id": 1047, "start": 7913.1, "end": 7918.1, "text": "Der Joggl wieder."}, {"id": 1048, "start": 7918.1, "end": 7922.1, "text": "Sterb-Champ."}, {"id": 1049, "start": 7922.1, "end": 7929.1, "text": "Ich hoffe, die haben nicht den Heli."}, {"id": 1050, "start": 7929.1, "end": 7932.1, "text": "Oh, Fatal Error, Alter, Alter, Alter."}, {"id": 1051, "start": 7932.1, "end": 7934.1, "text": "Jetzt, ja ja, jetzt übertreibt man nicht."}, {"id": 1052, "start": 7934.1, "end": 7940.1, "text": "Meine Güte."}, {"id": 1053, "start": 7940.1, "end": 7942.1, "text": "Oh, der macht Lege Henne."}, {"id": 1054, "start": 7942.1, "end": 7944.1, "text": "Nein, nein, ich..."}, {"id": 1055, "start": 7944.1, "end": 7948.1, "text": "Warum guckst du denn hier her, wenn wir grad Lege Henne auf der anderen Seite machen?"}, {"id": 1056, "start": 7948.1, "end": 7954.1, "text": "Max, kennst du noch deinen YouTube-Channel?"}, {"id": 1057, "start": 7954.1, "end": 7957.1, "text": "Ich weiß nicht mehr, wie hieß der nochmal?"}, {"id": 1058, "start": 7957.1, "end": 7962.1, "text": "Ich kann nämlich nicht mehr richtig dran erinnern."}, {"id": 1059, "start": 7962.1, "end": 7986.1, "text": "In your ass."}, {"id": 1060, "start": 7986.1, "end": 7991.1, "text": "Alter, was ist denn hier grad los?"}, {"id": 1061, "start": 7991.1, "end": 7993.1, "text": "Katze FPS war mein YouTube-Channel."}, {"id": 1062, "start": 7993.1, "end": 7994.1, "text": "Ah, stimmt."}, {"id": 1063, "start": 7994.1, "end": 7995.1, "text": "Ja, jetzt gut, dass du's gesagt hast."}, {"id": 1064, "start": 7995.1, "end": 7997.1, "text": "Jetzt fällt's mir wieder ein."}, {"id": 1065, "start": 7997.1, "end": 8004.1, "text": "Jetzt fällt's mir wieder ein."}, {"id": 1066, "start": 8004.1, "end": 8016.1, "text": "Jetzt hab ich's wieder."}, {"id": 1067, "start": 8016.1, "end": 8034.1, "text": "Wie, wir haben nichts bekommen?"}, {"id": 1068, "start": 8034.1, "end": 8040.1, "text": "In den Kopf, Alter."}, {"id": 1069, "start": 8040.1, "end": 8054.1, "text": "Aber voll in den Kopf."}, {"id": 1070, "start": 8054.1, "end": 8055.1, "text": "Nice, Dankeschön."}, {"id": 1071, "start": 8055.1, "end": 8060.1, "text": "Voll den Ass gesaved hat er mir."}, {"id": 1072, "start": 8060.1, "end": 8064.1, "text": "Voll den Ass gesaved."}, {"id": 1073, "start": 8064.1, "end": 8065.1, "text": "Okay."}, {"id": 1074, "start": 8065.1, "end": 8066.1, "text": "Yolo."}, {"id": 1075, "start": 8066.1, "end": 8068.1, "text": "Nein, nein, nein, nein."}, {"id": 1076, "start": 8068.1, "end": 8071.1, "text": "Oh."}, {"id": 1077, "start": 8071.1, "end": 8080.1, "text": "Bash FPS, stimmt, Bash FPS war's."}, {"id": 1078, "start": 8080.1, "end": 8083.1, "text": "Aber wir sind nicht mehr in der Base drinnen."}, {"id": 1079, "start": 8083.1, "end": 8084.1, "text": "Fuck."}, {"id": 1080, "start": 8084.1, "end": 8087.1, "text": "Ah, Captain Peng ist weg, wie's aussieht."}, {"id": 1081, "start": 8087.1, "end": 8089.1, "text": "Okay, Leute, dann ist das letzte Runde."}, {"id": 1082, "start": 8089.1, "end": 8091.1, "text": "Letzte Runde."}, {"id": 1083, "start": 8091.1, "end": 8093.1, "text": "Ich muss was essen, ich hab Hunger."}, {"id": 1084, "start": 8093.1, "end": 8094.1, "text": "Letzte Runde."}, {"id": 1085, "start": 8094.1, "end": 8095.1, "text": "Mal gucken, wie lange die geht."}, {"id": 1086, "start": 8095.1, "end": 8098.1, "text": "Die Map hat ja mehr oder weniger erst angefangen."}, {"id": 1087, "start": 8098.1, "end": 8101.1, "text": "Und werde ich Cyberpunk spielen?"}, {"id": 1088, "start": 8101.1, "end": 8103.1, "text": "Ja, aber wahrscheinlich nicht, jetzt und nicht on stream."}, {"id": 1089, "start": 8103.1, "end": 8110.1, "text": "Oder eventuell, eventuell kauf ich mir ein Spiel so da abends."}, {"id": 1090, "start": 8110.1, "end": 8113.1, "text": "Aber nicht im Stream."}, {"id": 1091, "start": 8113.1, "end": 8114.1, "text": "Gleich Basejump."}, {"id": 1092, "start": 8114.1, "end": 8119.1, "text": "Basejump Champ gibt's erst, wenn wir das hier geschafft haben."}, {"id": 1093, "start": 8119.1, "end": 8142.1, "text": "Die defusen, oder?"}, {"id": 1094, "start": 8142.1, "end": 8157.1, "text": "Oh, jetzt haben sie mich gereckt."}, {"id": 1095, "start": 8157.1, "end": 8159.1, "text": "Richtig gereckt, geschreckt."}, {"id": 1096, "start": 8159.1, "end": 8165.1, "text": "Oh nein, die Homs disarmed."}, {"id": 1097, "start": 8165.1, "end": 8176.1, "text": "Ich dachte, gleich gehen sie in die Luft."}, {"id": 1098, "start": 8176.1, "end": 8194.1, "text": "Was?"}, {"id": 1099, "start": 8194.1, "end": 8195.1, "text": "Fuck, man."}, {"id": 1100, "start": 8195.1, "end": 8204.1, "text": "Warum war das eigentlich nicht im Kopf gerade?"}, {"id": 1101, "start": 8204.1, "end": 8205.1, "text": "Nice."}, {"id": 1102, "start": 8205.1, "end": 8220.1, "text": "Das war ne Pogger-Slay-Gehände nochmal, ha?"}, {"id": 1103, "start": 8220.1, "end": 8224.1, "text": "Next."}, {"id": 1104, "start": 8224.1, "end": 8225.1, "text": "Oh, was ist da hinten?"}, {"id": 1105, "start": 8225.1, "end": 8227.1, "text": "Was machen die dann hier?"}, {"id": 1106, "start": 8227.1, "end": 8230.1, "text": "Backrate Champ?"}, {"id": 1107, "start": 8230.1, "end": 8232.1, "text": "Oh, nee, alle schon tot."}, {"id": 1108, "start": 8232.1, "end": 8239.1, "text": "Jetzt, Basejump."}, {"id": 1109, "start": 8239.1, "end": 8241.1, "text": "Basejump."}, {"id": 1110, "start": 8241.1, "end": 8244.1, "text": "Oder wie die Wiebs sagen, Basejump."}, {"id": 1111, "start": 8244.1, "end": 8246.1, "text": "Oh, der war schlecht, oder?"}, {"id": 1112, "start": 8246.1, "end": 8249.1, "text": "Der war schlecht, aber ich fand's lustig."}, {"id": 1113, "start": 8249.1, "end": 8250.1, "text": "Basejump."}, {"id": 1114, "start": 8250.1, "end": 8251.1, "text": "Oh, fuck."}, {"id": 1115, "start": 8251.1, "end": 8252.1, "text": "Abrutsch, Champ."}, {"id": 1116, "start": 8252.1, "end": 8257.1, "text": "Das ist runtergefallen."}, {"id": 1117, "start": 8257.1, "end": 8259.1, "text": "Okay, drei Stunden später."}, {"id": 1118, "start": 8259.1, "end": 8265.1, "text": "Oh, nee."}, {"id": 1119, "start": 8265.1, "end": 8278.1, "text": "Basejump, genau."}, {"id": 1120, "start": 8278.1, "end": 8279.1, "text": "M-Com-Champ."}, {"id": 1121, "start": 8279.1, "end": 8281.1, "text": "Guck mal, wir sind fast dran."}, {"id": 1122, "start": 8281.1, "end": 8283.1, "text": "Jetzt easy, easy, die haben uns nicht gespottet."}, {"id": 1123, "start": 8283.1, "end": 8284.1, "text": "Die haben uns nicht gespottet."}, {"id": 1124, "start": 8284.1, "end": 8287.1, "text": "Easy plan, easy plan."}, {"id": 1125, "start": 8287.1, "end": 8290.1, "text": "Und jetzt zeig ich euch Poggers Position."}, {"id": 1126, "start": 8290.1, "end": 8291.1, "text": "What?"}, {"id": 1127, "start": 8291.1, "end": 8294.1, "text": "Als wär ich da drauf gewesen."}, {"id": 1128, "start": 8294.1, "end": 8303.1, "text": "Als wär ich da drauf gewesen."}, {"id": 1129, "start": 8303.1, "end": 8305.1, "text": "Wollt euch eigentlich die Poggers Posi zeigen?"}, {"id": 1130, "start": 8305.1, "end": 8311.1, "text": "Nein."}, {"id": 1131, "start": 8311.1, "end": 8314.1, "text": "Fail spawned."}, {"id": 1132, "start": 8314.1, "end": 8323.1, "text": "Wie genau hat der das geschafft, da zu sterben?"}, {"id": 1133, "start": 8323.1, "end": 8337.1, "text": "Das ist ein Claymore."}, {"id": 1134, "start": 8337.1, "end": 8339.1, "text": "Wo ist der Camp Champ?"}, {"id": 1135, "start": 8339.1, "end": 8347.1, "text": "Irgendwo war der Camp Champ hier."}, {"id": 1136, "start": 8347.1, "end": 8351.1, "text": "Der war doch eben einer hier."}, {"id": 1137, "start": 8351.1, "end": 8356.1, "text": "Hallo?"}, {"id": 1138, "start": 8356.1, "end": 8367.1, "text": "Okay, dann nicht."}, {"id": 1139, "start": 8367.1, "end": 8368.1, "text": "Okay, jetzt aber."}, {"id": 1140, "start": 8368.1, "end": 8369.1, "text": "Alter, guck mal hier mein Team."}, {"id": 1141, "start": 8369.1, "end": 8374.1, "text": "Mein Team macht das easy alleine, gar kein Problem."}, {"id": 1142, "start": 8374.1, "end": 8382.1, "text": "N64 stones, ja."}, {"id": 1143, "start": 8382.1, "end": 8386.1, "text": "Der Joggl."}, {"id": 1144, "start": 8386.1, "end": 8387.1, "text": "Okay."}, {"id": 1145, "start": 8387.1, "end": 8393.1, "text": "Rennchamp."}, {"id": 1146, "start": 8393.1, "end": 8395.1, "text": "Achtung, jetzt zeig ich euch die Poggers Posi."}, {"id": 1147, "start": 8395.1, "end": 8403.1, "text": "Hier ist die Poggers Posi, hier."}, {"id": 1148, "start": 8403.1, "end": 8404.1, "text": "Wenn man trifft schon."}, {"id": 1149, "start": 8404.1, "end": 8406.1, "text": "Die Posi da ist echt OP."}, {"id": 1150, "start": 8406.1, "end": 8413.1, "text": "Ohne Mist."}, {"id": 1151, "start": 8413.1, "end": 8415.1, "text": "Ohne Mist, die Posi ist gut."}, {"id": 1152, "start": 8415.1, "end": 8417.1, "text": "Der Spieler ist einfach nur schlecht."}, {"id": 1153, "start": 8417.1, "end": 8419.1, "text": "Der es euch zeigt."}, {"id": 1154, "start": 8419.1, "end": 8429.1, "text": "Die haben unseren Heli geklaut, by the way."}, {"id": 1155, "start": 8429.1, "end": 8430.1, "text": "Die Posi ist richtig gut."}, {"id": 1156, "start": 8430.1, "end": 8432.1, "text": "Die können nicht reinschießen vom spawnen."}, {"id": 1157, "start": 8432.1, "end": 8435.1, "text": "Hier siehst du alles."}, {"id": 1158, "start": 8435.1, "end": 8441.1, "text": "Hallo, Battlefield."}, {"id": 1159, "start": 8441.1, "end": 8442.1, "text": "Okay, gehen wir rechts."}, {"id": 1160, "start": 8442.1, "end": 8444.1, "text": "Oh nee, geht doch gar nicht auf."}, {"id": 1161, "start": 8444.1, "end": 8445.1, "text": "Die passt vom Timing her."}, {"id": 1162, "start": 8445.1, "end": 8447.1, "text": "Können wir losrennen?"}, {"id": 1163, "start": 8447.1, "end": 8451.1, "text": "Nice."}, {"id": 1164, "start": 8451.1, "end": 8459.1, "text": "Hier ist ein Panzer."}, {"id": 1165, "start": 8459.1, "end": 8467.1, "text": "Ja, ja, ja."}, {"id": 1166, "start": 8467.1, "end": 8470.1, "text": "Okay, nix da, nix da."}, {"id": 1167, "start": 8470.1, "end": 8477.1, "text": "Postchamp, Postchamp, Postchamp, wie kommen wir durch?"}, {"id": 1168, "start": 8477.1, "end": 8482.1, "text": "Fuck, Muni alle."}, {"id": 1169, "start": 8482.1, "end": 8486.1, "text": "Du bist nicht der Beste, was egal ist, aber du hast mega Spielverständnis."}, {"id": 1170, "start": 8486.1, "end": 8487.1, "text": "Dankeschön, Chat."}, {"id": 1171, "start": 8487.1, "end": 8488.1, "text": "Nice."}, {"id": 1172, "start": 8488.1, "end": 8490.1, "text": "Das höre ich gerne."}, {"id": 1173, "start": 8490.1, "end": 8492.1, "text": "Ich habe auch ewig nicht gespielt."}, {"id": 1174, "start": 8492.1, "end": 8495.1, "text": "Stimmt, der Beste bin ich nicht."}, {"id": 1175, "start": 8495.1, "end": 8504.1, "text": "Ich behaupte es wenigstens auch nicht."}, {"id": 1176, "start": 8504.1, "end": 8505.1, "text": "Was ist denn hier los?"}, {"id": 1177, "start": 8505.1, "end": 8509.1, "text": "Eine Güte war in den Klumpen."}, {"id": 1178, "start": 8509.1, "end": 8522.1, "text": "Monka, S, da steht direkt ein Panzer und will mir ins Gesicht schießen."}, {"id": 1179, "start": 8522.1, "end": 8529.1, "text": "Was ist denn?"}, {"id": 1180, "start": 8529.1, "end": 8535.1, "text": "Der Tasmod wieder, der Tasmod."}, {"id": 1181, "start": 8535.1, "end": 8546.1, "text": "Tasmod 226, jawoll."}, {"id": 1182, "start": 8546.1, "end": 8554.1, "text": "Ich bin eigentlich total ungern in diesen Kacktunnels drin."}, {"id": 1183, "start": 8554.1, "end": 8559.1, "text": "Am liebsten bin ich ehrlich gesagt auf der anderen Seite."}, {"id": 1184, "start": 8559.1, "end": 8566.1, "text": "Da wo der LKW ist."}, {"id": 1185, "start": 8566.1, "end": 8569.1, "text": "Hätte ja klappen können, hätte ja klappen können."}, {"id": 1186, "start": 8569.1, "end": 8570.1, "text": "Drehst du mal um?"}, {"id": 1187, "start": 8570.1, "end": 8573.1, "text": "Heli, Mann, dreh mal um, ich will dich rausballern."}, {"id": 1188, "start": 8573.1, "end": 8586.1, "text": "Okay."}, {"id": 1189, "start": 8586.1, "end": 8590.1, "text": "Ach Gott, gibt es doch nicht."}, {"id": 1190, "start": 8590.1, "end": 8599.1, "text": "Warum drücken die jetzt auf einmal easy clap die erste Runde und jetzt sowas?"}, {"id": 1191, "start": 8599.1, "end": 8600.1, "text": "Was soll ich an?"}, {"id": 1192, "start": 8600.1, "end": 8602.1, "text": "Der hat jetzt 5 Kills an uns gefarmt, der Grimpy."}, {"id": 1193, "start": 8602.1, "end": 8604.1, "text": "Moment, legt das M."}, {"id": 1194, "start": 8604.1, "end": 8606.1, "text": "Komm, der Fatal, Alter."}, {"id": 1195, "start": 8606.1, "end": 8610.1, "text": "Der Fatal, Fatale M-Komplett."}, {"id": 1196, "start": 8610.1, "end": 8615.1, "text": "Oh nice, huge."}, {"id": 1197, "start": 8615.1, "end": 8619.1, "text": "Alter."}, {"id": 1198, "start": 8619.1, "end": 8623.1, "text": "Alter, wie fatal er das macht einfach nur."}, {"id": 1199, "start": 8623.1, "end": 8625.1, "text": "Okay."}, {"id": 1200, "start": 8625.1, "end": 8628.1, "text": "Skill-Best-Matchmaking."}, {"id": 1201, "start": 8628.1, "end": 8631.1, "text": "Stellt euch vor, Battlefield mit Skill-Best-Matchmaking."}, {"id": 1202, "start": 8631.1, "end": 8636.1, "text": "Ich kann es mir kaum Schlimmeres vorstellen."}, {"id": 1203, "start": 8636.1, "end": 8641.1, "text": "Ich kann es mir kaum Schlimmer vorstellen."}, {"id": 1204, "start": 8641.1, "end": 8656.1, "text": "Da war was."}, {"id": 1205, "start": 8656.1, "end": 8658.1, "text": "Oh, von hinten."}, {"id": 1206, "start": 8658.1, "end": 8663.1, "text": "Von hinten Anstelltschamp."}, {"id": 1207, "start": 8663.1, "end": 8665.1, "text": "Oh, oh."}, {"id": 1208, "start": 8665.1, "end": 8668.1, "text": "Okay Leute, ich lasse euch spawnen bei mir, ich kann jetzt gerade nicht raus."}, {"id": 1209, "start": 8668.1, "end": 8678.1, "text": "Ich lasse euch spawnen."}, {"id": 1210, "start": 8678.1, "end": 8685.1, "text": "Da ist einfach mal so ein Panzer vor mir."}, {"id": 1211, "start": 8685.1, "end": 8687.1, "text": "Nein."}, {"id": 1212, "start": 8687.1, "end": 8689.1, "text": "Zu spät gesehen."}, {"id": 1213, "start": 8689.1, "end": 8692.1, "text": "Auf der Xbox und der Playstation ist das Spiel tot."}, {"id": 1214, "start": 8692.1, "end": 8694.1, "text": "Ich weiß es nicht."}, {"id": 1215, "start": 8694.1, "end": 8705.1, "text": "Ich habe, seit ich das auf dem PC spiele, nicht mehr auf der Konsole gespielt."}, {"id": 1216, "start": 8705.1, "end": 8718.1, "text": "Reparatur-Champ."}, {"id": 1217, "start": 8718.1, "end": 8723.1, "text": "Den Bug mit der Flamme gibt es übrigens immer noch."}, {"id": 1218, "start": 8723.1, "end": 8728.1, "text": "Oh, jetzt kommt Big Brain Plays, ich sehe es von hinten in den Tunnel."}, {"id": 1219, "start": 8728.1, "end": 8730.1, "text": "Massive Plays."}, {"id": 1220, "start": 8730.1, "end": 8748.1, "text": "Fatal, du musst jetzt die 505-Head-611-Head-Plays machen."}, {"id": 1221, "start": 8748.1, "end": 8754.1, "text": "Wollen wir den Heli hier wirklich stehen lassen?"}, {"id": 1222, "start": 8754.1, "end": 8758.1, "text": "Wir sollten den Heli hier nicht stehen lassen, Leute."}, {"id": 1223, "start": 8758.1, "end": 8765.1, "text": "Ha, gleiche Idee."}, {"id": 1224, "start": 8765.1, "end": 8767.1, "text": "Alter, ist die UMP scheiße."}, {"id": 1225, "start": 8767.1, "end": 8775.1, "text": "Was ein Crap."}, {"id": 1226, "start": 8775.1, "end": 8778.1, "text": "Oh mein Gott, ist die UMP schlecht."}, {"id": 1227, "start": 8778.1, "end": 8783.1, "text": "Jetzt sollten wir es aber haben."}, {"id": 1228, "start": 8783.1, "end": 8790.1, "text": "Yolo, Yolo-Champ."}, {"id": 1229, "start": 8790.1, "end": 8792.1, "text": "Okay, ich sehe nichts."}, {"id": 1230, "start": 8792.1, "end": 8794.1, "text": "Ich sehe gar nichts."}, {"id": 1231, "start": 8794.1, "end": 8802.1, "text": "Da ist noch was dran."}, {"id": 1232, "start": 8802.1, "end": 8810.1, "text": "Schreckt, Pence-Man."}, {"id": 1233, "start": 8810.1, "end": 8813.1, "text": "Jaja, macht ihr mal."}, {"id": 1234, "start": 8813.1, "end": 8824.1, "text": "Haut die Granaten raus, alles gut."}, {"id": 1235, "start": 8824.1, "end": 8828.1, "text": "Panzer, schreck dich."}, {"id": 1236, "start": 8828.1, "end": 8839.1, "text": "Falls du überhaupt beschädigst, ist das gar nicht beschädigt."}, {"id": 1237, "start": 8839.1, "end": 8842.1, "text": "Keep on moving."}, {"id": 1238, "start": 8842.1, "end": 8844.1, "text": "Nochmal Engie."}, {"id": 1239, "start": 8844.1, "end": 8849.1, "text": "Okay, ich stelle es jetzt einfach mit meinem Panzer."}, {"id": 1240, "start": 8849.1, "end": 8863.1, "text": "Auf, Panzer, let's go."}, {"id": 1241, "start": 8863.1, "end": 8864.1, "text": "What the hell?"}, {"id": 1242, "start": 8864.1, "end": 8866.1, "text": "Von wo?"}, {"id": 1243, "start": 8866.1, "end": 8868.1, "text": "Ach, da ist hinter uns noch der Dude."}, {"id": 1244, "start": 8868.1, "end": 8880.1, "text": "Fuck."}, {"id": 1245, "start": 8880.1, "end": 8890.1, "text": "Okay, huge, huge jump."}, {"id": 1246, "start": 8890.1, "end": 8894.1, "text": "Massive Champ."}, {"id": 1247, "start": 8894.1, "end": 8902.1, "text": "Okay, okay, wo geht hier was?"}, {"id": 1248, "start": 8902.1, "end": 8905.1, "text": "Achtung, B, B Leute, ich sage es euch."}, {"id": 1249, "start": 8905.1, "end": 8910.1, "text": "Jetzt, die lege Henne, die lege Henne geht durch."}, {"id": 1250, "start": 8910.1, "end": 8914.1, "text": "Und jetzt muss ich das aufs Dach, aufs Dach."}, {"id": 1251, "start": 8914.1, "end": 8916.1, "text": "Die lege Henne macht das."}, {"id": 1252, "start": 8916.1, "end": 8919.1, "text": "Easy."}, {"id": 1253, "start": 8919.1, "end": 8927.1, "text": "Andere Seite."}, {"id": 1254, "start": 8927.1, "end": 8944.1, "text": "Easy, easy win, easy win, ich sage es euch, Leute."}, {"id": 1255, "start": 8944.1, "end": 8950.1, "text": "Was?"}, {"id": 1256, "start": 8950.1, "end": 8960.1, "text": "Diffusungs Champ."}, {"id": 1257, "start": 8960.1, "end": 8969.1, "text": "Nicht wirklich, oder ihr habt nicht wirklich diffusen."}, {"id": 1258, "start": 8969.1, "end": 8984.1, "text": "Okay, ich wusste gar nicht, wo der Typ ist."}, {"id": 1259, "start": 8984.1, "end": 8986.1, "text": "Das war gar kein easy win."}, {"id": 1260, "start": 8986.1, "end": 8988.1, "text": "Ich hoffe echt, Venise Unleashed kommt raus."}, {"id": 1261, "start": 8988.1, "end": 8993.1, "text": "Ich sage euch, es wäre so geil, wenn ihr mit Battlefield 3 ein bisschen was wieder reißen könntest auf YouTube."}, {"id": 1262, "start": 8993.1, "end": 8994.1, "text": "Aber ich glaube es ja nicht."}, {"id": 1263, "start": 8994.1, "end": 8997.1, "text": "Ganz ehrlich, das spiele ich von 2011."}, {"id": 1264, "start": 8997.1, "end": 9000.1, "text": "Die Leute, die heute am Start sind und sowas wie Warthorn und so feiern."}, {"id": 1265, "start": 9000.1, "end": 9005.1, "text": "Ich meine, Warthorn ist schon mit das brauchbarste Call of Duty-Sei seit Jahren, ja."}, {"id": 1266, "start": 9005.1, "end": 9008.1, "text": "Aber..."}, {"id": 1267, "start": 9008.1, "end": 9017.1, "text": "Hallo."}, {"id": 1268, "start": 9017.1, "end": 9029.1, "text": "Aber trotzdem."}, {"id": 1269, "start": 9029.1, "end": 9036.1, "text": "Aua."}, {"id": 1270, "start": 9036.1, "end": 9051.1, "text": "Easy clap."}, {"id": 1271, "start": 9051.1, "end": 9056.1, "text": "Nee, die Runde schafft es nicht auf YouTube, so geil war die Runde nicht."}, {"id": 1272, "start": 9056.1, "end": 9059.1, "text": "Bei Venise Unleashed kann man selber hosten, ja."}, {"id": 1273, "start": 9059.1, "end": 9061.1, "text": "Ich bin mir halt nicht ganz sicher."}, {"id": 1274, "start": 9061.1, "end": 9067.1, "text": "Wenn das einfach nur Modding-Tools sind, dann wird das nichts großartig bringen."}, {"id": 1275, "start": 9067.1, "end": 9072.1, "text": "Weil ganz ehrlich, wer setzt sich jetzt hin nach dem Release und macht dann noch ein Jahr einen Battlefield 3 Mod?"}, {"id": 1276, "start": 9072.1, "end": 9078.1, "text": "Ich meine, dann ist das Spiel 20 Jahre, ähm, 10 Jahre alt."}, {"id": 1277, "start": 9078.1, "end": 9084.1, "text": "Also eigentlich müsste das rauskommen und irgendwie auch ein bisschen was bieten, wo die Leute wieder sagen, oh ja, da muss ich jetzt."}, {"id": 1278, "start": 9084.1, "end": 9088.1, "text": "Nee Leute, ich mache Schluss, ich gehe jetzt essen, ich habe übelst Hunger."}, {"id": 1279, "start": 9088.1, "end": 9091.1, "text": "War aber ultra nice wieder, hat Spaß gemacht."}, {"id": 1280, "start": 9091.1, "end": 9094.1, "text": "Schön, dass so viele am Start gewesen sind."}, {"id": 1281, "start": 9094.1, "end": 9097.1, "text": "Ähm..."}, {"id": 1282, "start": 9097.1, "end": 9101.1, "text": "Jo, wir sehen uns dann."}, {"id": 1283, "start": 9101.1, "end": 9103.1, "text": "Bis dann."}, {"id": 1284, "start": 9103.1, "end": 9105.1, "text": "Aua, mach es gut."}, {"id": 1285, "start": 9105.1, "end": 9119.1, "text": "See you."}]}