{"text": "Einfach nur so. Massive Pog. Huge Big Pog. Big Brain Pog. So. Ach guck mal Levelcap hat ein Video zugemacht. Das seh ich ja jetzt erst. Levelcap hat da ein Video zugemacht. Nice. Aber guck mal sogar bei Levelcap haben wir 74k gesehen und nur 300 Leute kommentiert. Das ist ja Kommentare hab ich ja fast so ähnlich viele und Aufrufe hab ich die Hälfte oder so. Levelcap hat ein bisschen mehr Subs als ich. Hä heut kein VU. Ich hab den ganzen Tag Monster Sanctuary stills gemacht. Das Game macht echt Bock. Prime Werbung feels Batman. Prime Werbung ist gut. Wenn du Prime Werbung bekommst und Amazon Prime hast kannst du kostenlos Twitch Primes haben. Nee Patrick ich glaub das muss ich nicht streamen das ist ultra langweilig zuzugucken. Ich guck das ehrlich gesagt beim Fabian auch nur weil ich es entspannt finde und es halt der Fabian ist. Aber ansonsten ist das glaube ich ziemlich langweilig. Prime. Übrigens habt ihr schon gehört der Rundfunk Beitrag wird nicht erhöht. Der Rundfunk Beitrag wird nicht erhöht hab ich gehört. Und zwar es war ja irgendwie so morgen Kobold stream. Ich weiß noch nicht genau ob morgen oder übermorgen. Morgen muss ich relativ viel Zeug machen. Aber vielleicht kriegen wir das morgen gebacken. Also ich hab das nur so am Rande verfolgt. Ich persönlich find's ja gut. Ich find's ja super. Ich bin ja eh kein großartiger Fan vom öffentlich-rechtlichen Programm. Ich hab prinzipiell nichts dagegen dass es den öffentlich-rechtlichen Rundfunk gibt. Ich find das auch an sich von der Idee her gar nicht schlecht. Ich find's auch so dieses selbstgefällige Handaufhalten nach dem Motto Ja wenn wir mehr haben wollen dann gib uns gefällig mehr. Das nervt mich ehrlich gesagt ein bisschen. Deswegen find ich das nice. Und ich hab's ja nur so am Rande verfolgt. Und wisst ihr was das geile ist? Wie übelst total pepega style das gelaufen ist. Dass das jetzt nicht erhöht wurde. Und dass sie jetzt geklagt haben und das ganze noch abgelehnt wurde. Also pass mal auf. Ich hab mir das auch morgen mal in Ruhe durchgelesen. Es ist ja irgendwie so wie es dazu gekommen ist, dass der Rundfunkbeitrag nicht erhöht wird. Es gibt eine Kommission die rechnet aus wie viel der Rundfunkbeitrag erhöht werden muss. Dass ARD und ZDF und die Öffentlich-Rechtlichen ihren Betrieb aufrechterhalten können auch die nächsten Jahre. Das Ding nennt sich wohl Kev. Kann sein dass ich ein bisschen was falsch verstanden hab. Und die haben ausgerechnet, dass der Rundfunkbeitrag für nächstes Jahr um 86 Cent steigen darf. ARD und ZDF die wollten sogar noch mehr haben, aber Kev hat gesagt, ne 86 Cent. Also die haben das super krass Calculator-Hackerman-Geschichte gemacht. Und sind jetzt irgendwie auf 86 Cent gekommen. Also die sind schon massive brained, 86 Cent. Fehlt bloß noch ein Komma, 86,57 Cent oder sowas. Über 86 Cent wollten sie den Kram erhöhen. Dazu müssen aber wohl alle Länder zustimmen. Und es haben auch alle Länder zugestimmt. Bis auf Sachsen-Anhalt oder so. Und dort wollten sie nicht zustimmen, weil ein Argument was sie gebracht haben ist. Was im Osten war es auf jeden Fall. Und ein Argument die sie gebracht haben ist, also die CDU. Und ich glaube die CDU und die Grünen oder die CDU und die SPD regiert da. Ich glaube die CDU und die Grünen sinds. Und die CDU hat gesagt, ihnen gefällt die Darstellung vom Osten nicht in öffentlich-rechtlichen Sendungen. So und jetzt, und jetzt wirds richtig pepega. Jetzt wirds richtig pepega. Also, dann sollte abgestimmt werden. Man denkt, und es wird ja auch berichtet, dass Sachsen-Anhalt die Erhöhung des Rundfunkbeitrags abgelehnt hat. Das stimmt gar nicht, das hab ich auch gesagt. Aber jetzt wirds richtig pepega. Die sind doch irgendwie mit den Grünen zusammen in der Koalition in Sachsen-Anhalt. Und die sollten jetzt darüber abstimmen. Und wie gesagt, die CDU ist nicht dafür, die Grünen und die SPD wollens, dass das erhöht wird. Und die AfD ist aber auch dagegen. So und CDU plus AfD hätten genug Stimmen um das abzulehnen. Jetzt ist aber das Problem, dass die Grünen und die SPD einen riesen Aufriss gemacht haben wohl in Sachsen. Sachsen oder Sachsen-Anhalt, wo war es denn jetzt eigentlich? Was? Sachsen-Anhalt? Sachsen-Anhalt war es, genau. Also, die Grünen und die SPD haben einen riesen Aufriss gemacht in Sachsen-Anhalt. Dass es ja absolut nicht sein darf, nicht geht, dass man zusammen für das gleiche abstimmt, wo auch die AfD abstimmt. Und dementsprechend haben sie dann gesagt, hier, wenn ihr das macht, dann lösen wir die Regierung auf, so nach dem Motto. Und jetzt, was jetzt passiert ist, ist, der Antrag wurde nicht abgelehnt, denn der Antrag wurde zurückgezogen. Die CDU hat den Antrag zurückgezogen, damit sie nicht zusammen mit der AfD dagegen stimmen muss. Und dadurch, dass die Sache jetzt nicht abgestimmt wurde und dementsprechend wurde auch nicht zugestimmt, weil es wurde nicht abgestimmt. Es wurde nicht dagegen gestimmt, es wurde nicht abgestimmt. Das heißt, es haben alle abgestimmt, alle waren dafür, außer Sachsen-Anhalt, die haben nicht abgestimmt. Und dementsprechend haben sie auch nicht dafür abgestimmt. So, also das erste war schon absolut wir, was da wieder für komische Dinge im Hintergrund laufen. Und dann, daraufhin, daraufhin hat dann ARD und ZDF gesagt, wie ihr wollt nicht zustimmen. Das geht aber nicht. Ihr habt gefällig zuzustimmen. Wobei ich mich dann ganz ehrlich frage, wenn, wenn das ja, kurz die Halo-Musik vielleicht einen Ticken leiser mache. Also wenn das ja so ist, dass die Länder zustimmen müssen, dann kann man sich halt echt fragen, warum gibt es das überhaupt? Weil, was hat es für einen Sinn, wenn man eine Abstimmung macht, wo man zustimmen muss? Na gut. Zumindest, jetzt hat ARD und ZDF, haben wohl einen Eilantrag gestellt, beim Bundesverfassungsgericht. Und, also sprich, die müssen sich da unbedingt ganz furchtbar schnell drum kümmern. Und jetzt hat das Bundesverfassungsgericht diesen Eilantrag abgelehnt. Aber auch geil, mit welcher Begründung, die haben gesagt, die haben gesagt, ja, schön und gut Eilantrag, aber der ist nicht ausreichend begründet. Also sprich, das Bundesverfassungsgericht ist der Meinung, die ARD hat nicht ausreichend begründet, warum es erforderlich ist, dass man jetzt das im Eilverfahren erscheidet. Denn, ähm, es war ihnen nicht klar, warum es notwendig ist, dass es ausgerechnet jetzt sofort erhöht werden muss. Und nicht erst, wenn sie entschieden haben. Also haben sie das ganze abgelehnt. So, das heißt natürlich nicht, dass es nicht doch erhöht werden könnte noch, weil das eigentliche Verfahren, das kommt ja noch, aber das dauert ja auch ein bisschen. Aber ein richtiger, mega pepega Vorgang. Man muss sich auch mal überlegen, ne? Das sind zwar nur 86 Cent, oder 86, ich glaube 86 Cent, die sie das erhöht haben wollen, aber insgesamt, die kriegen das, was der Blockhunter sagt, die kriegen um die 8 Milliarden, das ist übertrieben viel. Und ich finde es prinzipiell okay, dass es so etwas wie einen öffentlich-rechtlichen Rundfunk gibt, aber da wird so selbstverständlich mittlerweile Geld eingezogen. Und man ist der Meinung, man ist quasi so der hier der von Gott gegebene, äh, Einsammler, ähm, das kann es ja nur auch nicht sein. Deswegen, ich freue mich, ich freue mich, dass sie das abgelehnt haben. Ich freue mich echt, dass sie das abgelehnt haben. Weil so selbstverständlich, vor allem weil ich es halt mega dreist finde, dass die überhaupt vor das Gericht gegangen sind. So nach dem Motto, wozu gibt es denn überhaupt die Abstimmung, wenn man danach eh dagegen klagt? Ah, naja gut. Also da habe ich mich gefreut, als ich das gesehen habe. Japepega-Verein, ähm, 8 Milliarden für Sturm der Liebe. Äh, die machen ja schon, die machen ja auch durchaus halbwegs gescheite Sachen im öffentlich-rechtlichen, muss man sagen. Es gibt ja doch ein paar gescheite Sendungen, die ich auch ganz gerne gucke. Zum Beispiel, ähm, im SWR gibt es ab und zu mal sowas, wo sie alte Handwerksleute zeigen, so nach dem Motto, Keine Ahnung, der letzte Schuhmacher aus, äh, frag mich nicht, aus dem letzten Furzdorf, den es jetzt noch gibt und sowas. Also die haben ab und zu mal ganz interessante Beiträge. Aber ich muss euch ehrlich sagen, ich glaube ein Großteil davon, man das braucht sei mal echt dahingestellt. Ja, es gibt schon ein paar ganz, es gibt schon ein paar ganz gute Sachen. Aber mal ganz im Ernst, es gibt auch viel Scheiße, was man nicht bräuchte. Deswegen, da sollen sie halt ein paar Einschnitte machen in ihrem Programm, durch die 86 Cent weniger. Warum auch immer. Wurdet ihr doch safe auf YouTube empfohlen, die Doku? Ja, klar. Was ist denn da dran, einseitig betrachtet? Ich meine, mit 8 Milliarden kannst du schon einiges an Dokus machen. Also ich finde das gut. Vor allem, es gab einen Interview mit dem, das habe ich auch heute Morgen irgendwo gesehen, der, ich glaube bei der Welt, gab es einen Interview mit dem, sogar Ministerpräsident von Sachsen-Anhalt, und der hat berichtet, wie das gelaufen ist, als die ARD ihn besucht hat. Also sprich, die sind da vorbeigekommen und wollten ihnen quasi erklären, warum sie doch gefällig zuzustimmen haben. Und er war halt der Meinung, es kann ja nicht sein, dass man ihnen da mit einer Selbstverständlichkeit erzählt, dass sie als gewählte Abgeordnete da irgendwie zustimmen müssen. Das ging mir auf den Sack und das kann ich verstehen. Also es ist ja nicht so, als kriegen die von heute auf morgen gar kein Geld mehr. Aber ich, ich habe mich da echt drüber gefreut. Es gibt ein paar Sachen, die gucke ich gerne, aber im Großen und Ganzen hätte ich auch keine Schmerzen, wenn es ein paar sinnlose Sendungen weniger gibt. Zumal ich es eh allgemein ziemlich frech finde, das muss ich jetzt aber sagen, dass man, man hat es ja geändert. Früher ging es ja noch darum, wer einen Fernseher hat, mit dem man das empfangen kann, und mittlerweile musst du ja pro Haushalt zahlen. Das ist nur eine Anpassung an die Inflation. Ja, es ist vor allem eine Anpassung, dass die ihre Renten bezahlen können. Es ist ja gar nicht mal so, als kommt es jetzt wahnsinnig gut dem Programm zugute. Die müssen ja auch ihre ehemaligen Mitarbeiter bezahlen. Jetzt kommt es jetzt wahnsinnig gut dem Programm zugute. Die müssen ja auch ihre ehemaligen Mitarbeiter bezahlen. Gute mal, Zwischenfrage. Sollte man, wenn man CentOS aktuell privat nutzt, das ist eine gute Frage. Yes, das stream send os wurde sollte man im aktuellen sent os 8 nutz auf sent os wechselt dir bleibt nichts anderes übrig hoch umgehend ist jetzt runter dir bleibt nicht dir bleibt nichts anderes übrig ja der kell verdient auch kohle das stimmt schon ob das ob das jetzt auch gerechtfertigt ist einmal hingestellt auf der anderen seite denke ich mir das ist die überste position das ist vergleichbar mit anderen sachen ist auch ok ich bin zum beispiel niemand der prinzipiell auf manager gehälter gehältern rum hated oder auf auf vorstands gehältern oder so natürlich kann man sich darüber streiten dass man sagt hey warum verdient der typ keine ahnung 2 2 millionen plus irgendwie sonst was während er 5000 leute entlassen hat aber und das ist der unterschied eigentlich sollte man die leute die diesen position sind gar nicht so sehr dafür haten weil die wurden auch eingestellt den geschäftsführer der da am start ist der wurde eingestellt der ist nicht einfach da irgendwie gesporn eigentlich muss man sauer sein auf die leute die den typ eingestellt haben und den ganzen scheiß mitmachen wenn man auf irgendjemand sauer sein will und dazu kommt dass diese position auch nicht so viele leute gibt die das machen wollen also da bin ich nicht dafür dass man prinzipiell sinnlos um sich schicken dass alles alles schlecht findet nur weil es mal leute gibt die halt position haben wo man viel verdient aber gerade wenn das so gezwungenermaßen ist ja niemand zwingt einen irgendwo was einzukaufen wenn man mit den praktiken nicht zufrieden ist aber du hast halt beim öffentlich rechtlichen keinerlei auswahl das auch so was was ein bisschen sauer aufstößt und wenn man dann sieht wo da das wurde die kohle rausgehauen wird ja also ich freue mich drüber dass es nicht so selbstverständlich geht die erhöhen kann durchaus sein dass die erhöhen kommt ist nicht nach der großartigen was dagegen hätte wenn das so entschieden wird aber dass das nicht mehr so automatisch kommt finde ich eigentlich ganz gut warum heißt du hier wo bloß weil du den account ist den ich erstellt habe als ich gar nicht streamen wollte und irgendwann habe ich mir gedacht komm wir fangen jetzt mal an bisschen stream so an und dann hieß ich halt noch so ich habe mich auch nicht umbenannt weil ich mir auch dachte hey wenn dann leute von youtube kommen dann nur die gescheiten ja also dir bleibt nichts anderes übrig wie auf cento stream zu wechseln gibt ja nichts mehr gibt dir nichts anderes kannst du nichts anderes machen du könntest jetzt also meine frage warum muss es denn ausgerechnet cento es sein im privaten vielleicht gibt es rocky linux bis dahin ja aber rocky linux gibt es ja noch gar nicht das ist ja nur in der findungsphase aktuell noch da ist ja also dass das raus ist bis das andere eingestellt ist das müssen wir erst mal gucken du kannst ja aktuell auch gar nicht auf rocky linux umsteigen gibt es ja noch gar nicht aber warum warum muss es denn warum muss es denn cento es sein was hältst du denn zum beispiel von obuntu server ist ja mein persönlicher favorit ja ich mag obuntu allerdings nicht auf dem desktop nur als server auf dem desktop sacks oder sagen wir es anders auf dem desktop gefällt mir es nicht debian besser als obuntu server jetzt würde ich so pauschal nicht sagen ich würde weder sagen dass das eine oder das andere so wahnsinnig viel besser ist es hat alles seine vorteile der eine große vorteil von obuntu ist dass sie halt einmal ihre lts geschichten damit mit relativ aktueller software wo teilweise debian schon wirklich richtig alt ist aber auf der anderen seite es macht keinen großen unterschied ganz ehrlich so der unterschied zwischen obuntu server und debian ist jetzt nicht so wirklich groß was denn für des tops also wenn du wenn du was haben willst was obuntu based ist ne mint cinnamon wenn du es auf hardware installierst oder oder sagen wir mal xf ce mate wenn du es in der vm installierst ansonsten kannst du dir auch mal elementary angucken wenn du auf mac os bedienung stehst oder wenn du kein problem mit china linux hast dann auch deep in so als einsteiger distribution ich persönlich mach mal kurz ein update ich persönlich stehe auf manjaro mit i3 wm ups alter warum kein gnome kannst du machen aber mint hat kein gnome mint hat mate das ist ja quasi gnome mint hat xf ce und cinnamon ist cinnamon nicht sogar ein gnome shell bin ich mir gar nicht so sicher da bitte es noch vom aufnehmen vom letzten video hier lull ich bin gar nicht so sicher ist ob das nicht vielleicht doch eine gnome shell ist ich mach mal kurz nebenbei ein update lasst euch mal nicht stören exzellent wie das war es schon hatte die bin ich bei mir drauf hast man link nicht dass ich mitbekommen hätte dass man mal abdehnen exzellent ok wir kriegen auf der startseite mal neues video empfohlen so muss es sein nur zu den manjaro in der vm glaube ich ja richtig warum eigentlich ja weil man mit linux manche sachen besser machen kann angenehmer machen kann als unter windows ich mache alle möglichen also alles was ich an technik sachen macht mache ich eigentlich unter linux sei es microcontroller zeug programmieren sei es mittlerweile auch ganz normales dotnet development mache ich unter linux ist einfach für mich viel angenehmer als unter windows so und die anderen sachen mache ich auch was hat der für schmerzen die anderen sachen mache ich halt unter windows gerade weil halt wenns gerade wenns um spiele und solche geschichten geht das mit linux ja öfters mal problem behaftet achso dual boot naja gut das größte problem am dual boot ist es gibt zwar also es gibt ein problem an dual boot eine eine sache die die dual boot nicht so sinnvoll macht also das problem an dual boot ist die zeit die es braucht zu booten weil ich meine im ernst guck mal des umschalten zwischen windows und linux ist halt na das dauert zwei sekunden dual boot bist du mal vorne weg 30 sekunden mindestens 30 sekunden beschäftigt mit runterfahren hochfahren und das nächste was halt nice to have ist also brauche ich nicht unter 30 sekunden allein schon windows runterfahren dauert dauert 10 sekunden ähm dann musst du dein password eintippen beim booten also ich habe mein password voll verschlüsselt dann fahre ich das ding hoch dann lockt er sich im window manager ein 30 sekunden 30 sekunden ist denke ich schon mal ganz gut es ist aber im prinzip ist es vollkommen egal ob es 20 oder 30 sekunden sind es ist auf jeden fall schneller als so so und das andere was auch nicht so schön ist es gibt keine so wirklichen vorteile von linux native gebootet versus vm zu dem was ich verwende weil was hätte ich für einen vorteil wenn ich jetzt anstatt linux in der vm linux auf dem richtigen auf der richtigen hardware laufen lasse der einzige vorteil den ich mir denken könnte ist vielleicht habe ich glück dass ich grafikkarte die die grafikkarten decoder verwenden könnte unter linux mit dem browser also sprich dass ich weniger cpuauslastung hätte bei youtube videos im browser unter linux einmal ganz im ernst wenn es da ein problem ich gucke das gucke ich halt youtube unter windows ist jetzt auch nicht so das problem ja das ist eigentlich kein vorteil so wirklich mehr performance wenn der pc schlecht ist ja gut wenn du mit der übelsten grücke darum krebs dann kann man sich das mal überlegen aber ich habe hier nicht umsonst 6 kerne 32 g ram eine schnelle ssd also ich habe ich habe kaum vorteile durch du den boot außer dass es dauert so weil was ich jetzt machen kann ist halt ich kann hier mein mein mein entwicklungszeug aufmachen und gedöns und shell und und natürlich das allerwichtigste auf der welt das ascii aquarium in fullscreen so kann ich jetzt hier unter unter linux machen so und wenn ich dann sag aha moment wir spielen jetzt eine runde battlefield das spiel ohne battlefield easy das geht sag ich das einfach desktop gewechselt und gut ist übrigens ich sag es ja immer wieder warum heißt das eigentlich virtuelle desktops weil das einzige was nicht virtuell ist ist der desktop der desktop ist überall gleich bei virtuellen desktops also es ist alles außer den desktops außerdem desktop virtuell warum nennt man das nicht virtuelle virtuell alles außer desktops oder irgendwie anders kann man sich was anderes überlegen für virtuelle desktop passt halt überhaupt nicht ja voller zugriff auf den ram ist jetzt für meine linux vm jetzt nicht so das problem weil meine linux vm hat 16 gigabyte ram was brauchst du mehr virtuelle arbeitsoberfläche wie heißt denn eigentlich unter windows nicht da heißt new desktop und das einzige was halt nicht virtuell ist ist tatsächlich der desktop failfisch aber leute ich will euch ich will euch ja nicht planten mein wie ging das noch mal auf github ach so man konnte kein darkstream machen wenn man das eingeloggt ist kann das sein sauerei viel besser na viel besser ich hoffe ihr seid nicht geplendet jetzt und wie gesagt nachdem ich da kaum einen vorteil hätte dadurch dass ich linux in native laufen lasst bei mir und dual boot einfach lange dauert zumal überlegt mal wenn ich dual boot machen würde da könnte ich ja gar nicht unter windows streamen oder hier einfach anschmeißen dann auf linux wechsel hin und her das wird ja gar nicht funktionieren was ist heute geplant wir gucken uns einfach nur ein paar sachen an und dann ist gut ich bin ziemlich kaputt also ich werde doch nichts großartiges machen ich habe mir nur gedacht schweiz gestern nicht on was heute einfach schmeißt einfach mal dein stream an und gut ist es gibt es eigentlich so aktuell für github trends ja bei 16 gigabyte ram und dann noch vms ne ich habe 16 gigabyte ram in der vm und 32 gigabyte auf dem samt system aber auch aber auch mal im ernst aber auch wenn du nur 16 g hast also wenn du nur 16 g auf dem host hast das reicht auch kannst auch ohne probleme 8 g auf dem host 8 g in der vm oder sogar nur 4 g in der vm je nachdem was du da drin machen willst also ist jetzt ja nicht so als kommst du mit einer linux vm und windows im host irgendwie an den limit mit 16 g guckt euch das mal an ich habe jetzt gerade mal 20 g auslastung und davon ist die hälfte wahrscheinlich irgendwas was im cache rumgammeln und gar nicht verwendet wird ich habe einen 8700 k ich hätte gerne 9000 5900 x aber ja der aktuellen hardware situation geschuldet neuen rechner bauen ist noch nicht gibt es ja mittlerweile wieder welche wir nähern uns wieder normalen preisen kann das sein ach ne machen wir nicht normalerweise kostet 599 das kostet 700 alter 100 euro mehr ihr habt sie doch nicht mehr alle ihr habt sie doch nicht mal das sehe ich nicht siehst du deswegen habe ich mir noch keinen rechner gekauft ich sehe ich sehe das einfach nicht ein aktuell klar könnte ich mir das leisten war mache ich aber nicht das sehe ich nicht ein also den scheiß habe ich keinen bock zumal man ja auch mal ehrlich sagen muss mein rechner den ich jetzt habe der ist ja nicht schlecht ich meine 32 g ram ein 8700 k bissl übertaktet wo aktuell nicht übertaktet 6 kerne ssd das ist ja nicht schlecht oder so das gehört bestimmt immer noch zu den top fünf prozent der systemen dies aktuell gibt wenn du chrome benutzt dann brauchst du alle 32 g ram und quatsch ich weiß dass es g bade ist aber so schlimm ist es auch nicht gibt es eigentlich für github trends zeigt mal her dass du für eine grafika 1080 t ich habe die 2080 übersprung und ich werde mir jetzt 30 90 kaufen wenn ich neuen pc kaufe ich weiß ja schon genau was ich rein mache also ich mache in meinen neuen pc kommt ne kommt in 5900 x also das ding was man gerade auf geiz hat also ich mache 5900 x rein das ding ich mache 39 sich rein weil es geht also ehrlich gesagt ist der hauptsächlich grund weil es geht eventuell eventuell wenn die 30 80 ti rausbringen die quasi ähnlich ähnliche performance hat bissl schneller in bissl langsamer in höheren auflösungen ok dann greife ich vielleicht auch zu 30 80 die dann hätte ich gerne 64 g ram drin einfach weil es geht ja und unterlegen halbwegs gescheites mainboard ja also ich rechne mal so mit mit um die 4000 euro für den neuen pc aber ich sehe es halt nicht ein jetzt zu kaufen und und noch mal 1000 euro drauf zu legen das ist total für den arsch mal guck mal ich glaube ich glaube der preis passt sich mittlerweile halbwegs wieder an das geht ja mittlerweile schon wieder halbwegs wobei man halt sagen muss 1600 euro für eine grafika aber mal im ernst wenn du die auswahl hast zwischen hast du eine wasserkühlung ne ich bin kein kein großartiger wasserkühlungs fern wenn du die auswahl hast zwischen na 30 90 geht in eine rtx 30 90 ohne neuen iphone mit 256 g was kaufste dann chat was würdet ihr kaufen also ich würde die grafikkarte kaufen sage ich euch ganz ganz klar ich gebe zu bescheuern der vergleich beides ehrlich gesagt preisleistungsmäßig überhaupt nicht angemessen aber ich würde die grafikkarte kaufen fortnight skins das natürlich auch eine variante kann man auch machen zwei produkte in der vergleich liste was so das war mal irgendwie ultra teuren mainboards ja also ich will mir die gpu kaufen ach ja hier ich weiß ich hast du was zur virtualisierung gefragt ach so vor allem workstation ja ja vor allem workstation ich habe mir sogar letztens ein cd key gekauft gekauft wohlgemerkt und jetzt keine porsche irgendwie ernsthaft gekauft denn vor allem workstation 16 pro key habe ich mir letztens gekauft und zwar bei software bei software kong sogar billiger ich glaube damals hat es nur 16 euro gekostet oder so software kong also wenn das nicht eine vertrauenswürdige sache ist dann weiß ich auch nicht warum ist hier neben mit fingerabdruck exzellent software kong ich mache aber keine werbung für software kong ich wollte euch bloß mal kurz zeigen wenn ich die nächste mal müssen die nächsten mal müssen die mich bezahlen für das zeige findet ihr nicht auch dass es echt vertrauenswürdige seite ist ich finde ich finde schon ich finde ist ist nah dran am offiziellen shop man darf halt nicht vergessen offiziell offiziell kostet der kram glaube ich 240 euro oder so 220 euro also man muss es nicht übertreiben ach ja übrigens ob der key funktioniert kann ich euch nicht sagen weil ich habe immer noch vor allem bei workstation 15 ich habe den key nur gekauft weil er gerade günstiger war und irgendwie um 16 euro gekostet hat support laufzeit kannst du übrigens komplett knicken braucht kein mensch wer braucht dafür support ja was wollen die ich will keine so gibt es auch so gibt es auch support stufe keine ach guck mal ich könnte auch upgraden ich könnte auch upgraden von 15 ne aber das sehe ich nicht ein er ist zu teuer zeig mal bitte dein heizungsmonitoring habe ich euch eigentlich in letzter zeit schon mal gezeigt wie ich meine heizung überwache zum beispiel kann man gerade sehen dass die pumpe in der heizung grad 35 prozent am pumpen ist weil wir heizung an haben im ganzen haus muss warmwasser rumpumpen man sieht dass das abgas aktuell auf 44 grad ist dass der brenner am brennen ist die kessel temperatur bei 44 grad liegt und die abgas temperatur die wassertemperatur aktuell so zwischen 47 55 48 grad schwankt es hat keine keine fehler praktisch ich glaube ich speichere das mal gucken wie lange ich das speicher ich speichere das ja tatsächlich schon ein bisschen glaube ich speichere das einen monat oder so zwei monate weiß gar nicht wie viel wie lange ich den kram aufhebe ja heizungsüberwachung exzellent so muss das sein wie kommst du an deine daten nachdem ich die leute jetzt nicht nerven will dem ich immer das gleiche erzähle ich werde es noch mal ganz ich werde es noch mal ganz kurz umreißen wie ich das mache weil ich habe das jetzt schon oft erzählt also ich habe den raspberry pi unten im keller hängen an der heizung das ist eine wiesmann heizung und damit du das ganze auslesen kannst brauchst du ein wiesmann opto link kabel das kannst du ja entweder selbst bauen auf ebay kaufen oder das offizielle kaufen offizielle kostet hier gerade 70 euro was viel zu viel ist das ist im prinzip ein stick noch mal das usb kabel mit zwei infrarot leds obendran ja also überhaupt nichts überhaupt nichts dolles und das gibt es auch oftmals deutlich billiger auf ebay aber so ein kabel brauchst du oder selbst bauen gibt es auch anleitungen für dann brauchst du ein raspberry pi 0 mit mit wie control d auf github also von github das ding hier und das ist das teil was kommuniziert mit der heizung da sind die meisten sachen schon drinnen die meisten wiesmann heizung sind vorkonfiguriert muss man auswählen was man haben will und das macht dann diese kommunikation mit diesem opto link kabel jede heizung hat ja vorne so einen stecker wo man das hier sowas wo man das dran steckt so sieht das dann aus ja und da bekomme ich die daten her da musste die daten noch umwursten so dass grafana versteht aber das ist dann was individuelles warum lässt du dich einfach unter dem diagramm die aktuellen werte anzeigen könnte ich auch machen das sieht so aus weil ich das vor einem jahr oder so mal so eingerichtet habe und seitdem nichts mehr gemacht habe ich kann da sicherlich noch einiges einiges machen man hier siehst ja die aktuellen werte ehrlich gesagt interessiert mich hauptsächlich die wassertemperatur weil die ursprüngliche sache warum ich das überhaupt gebaut habe war weil die heizung ausserzer hatte und wir sind ja auch drauf gekommen woran das ganze lag da war wohl der interne kontrol zumindest meinte der heizungs mann das vielleicht wollte er uns auch einfach auf was neues für ein paar hundert euro verkaufen irgendwie der interne steuerung controller war im arsch hat er gesagt kann mir viel erzählen wenn der tag lang ist ich habe keine möglichkeit das zu überprüfen vielleicht hat er mich einfach auch nur jebaited und wirklichkeit war gar nix was aber witzig war der wollte mir dann auch gleich noch der heizungs der heißt der heizungs stonks mann wollte mir auch gleich noch die offizielle wiesmann lösung aufschwätzen zum smart monitoring der heizung da habe ich dann mein ipad raus geholt beziehungsweise unten das ipad was da liegt habe ich das habe ich das die webseite aufgemacht habe gesagt hier gucke mal brauche ich nett so sieht meine heizungsüberwachung aus und da hat er gemeint ja aber mit der offiziellen wiesmann heizungsüberwachung dann würde er auch eher immer direkt sehen was meine heizung für für probleme hat ja da kann das kann ich verschmerzen das kann ich verschmerzen wenn er das nicht direkt sieht ist schon ok ich rufe dir an wenn was ist zumindest wisst ihr was das geile ist wisst ihr was das geile ist jetzt ist es so dass das offizielle wiesmann ding zur heizungs monitoring ist eingestellt das gibt es nicht mehr das verkaufen die nicht mehr also ich hätte irgend so eine legacy technologie da am hals gehabt jetzt welche db benutzt du für grafana das prometheus das ist da ist prometheus drunter ich mache das meiste an monitoring hier mit prometheus deswegen das hier auch ja zum beispiel wann die zertifikate ablaufen ist auch mit prometheus läuft übrigens bald ab man unify controller läuft in 23 tagen das zertifikat ab saurei soll das denn was ist der unterschied zwischen prometheus influx db influx db ist ein time series database prometheus ist ein time series database die eigentlich dafür mit mit monitoring infrastruktur drum herum da sind eigentlich zwei unterschiedliche geschichten prometheus gibt es beispielsweise auch ganz viele fertige checks und agents die gucken wann laufen zertifikate ab wie ist die filesystem auslastung und sowas ja genau so sieht so sieht es aus so schaut eine heizungsüberwachung aus genau nur weil es der chat wieder mal sehen wollte excellent youtube video incoming könnte ich ich glaube das ist eigentlich ohne scheiß das ist eine gute idee weil ich finde sowas macht optisch auch ein bisschen was her wenn ich einfach erkläre wie ich das gemacht habe dann sagen die leute wieder massiv hier big brain ja die meisten leute schreiben dann wieder so kommentare wie ich habe zwar keine ahnung was der max in seinem video erzählt aber aber ich finde es trotzdem cool oder sowas in der richtung aber vielleicht finden es auch wirklich ein paar leute interessant falls sowas bauen wollen ja wusste ich auch nicht wie gesagt ich habe keine wasserkühlung ich habe keine wasserkühlung ich mag keine wasserkühlung so ich wollte mal kurz gucken was trendet denn was trendet denn so oft getappt zeigt doch mal her wo wir gerade dabei sind moin lois plois hast du noch weitere raspberry pies in verwendung ja und ich habe auch irgendwo ein textdokument wo drin steht welche weil ich das öfters gefragt werde und jedes mal wenn ich das textdokument suche finde ich es nicht was witzig ist weil eigentlich so langsam müsste ich mir mal merken was könnte das sein test doc ist das auf der alten vm ernsthaft wirklich ich finde ich finde es ja witzig dass der dass der chat besser weiß wo ich meine sachen habe als ich selbst ok mal gucken ob der chat recht hat der chat ist ja bekanntlich bekanntlichermaßen massive iq tier schaue ob das tests da ist es heißt so ein bisschen anders es heißt pysp warum auch immer aber der chat wusste dass ich auf der alten vm habe das ist aber übrigens nicht so ganz aktuell was da drin steht also ich habe einen raspberry pie mit der kamera fürs hof tor dran das ist ein raspberry pie 0w mit mit wlan ich habe den 0w mit unten im keller für die heizungssteuerung da macht übrigens nicht nur wirklich heizungssteuerung der macht auch das w steht für wireless ja der macht auch noch luftfeuchtigkeitssensor und so gedöns im keller weil keller ist bei uns saumäßig hohe luftfeuchtigkeit drin dann habe ich ein octopie für den 3d drucker dann habe ich als singleboard computer noch ein odroid hc2 das ist übrigens richtig cool das ding das ist ja so so ein teil also deutlich kleiner als ein raspberry pie allerdings mit einem gehäuse wo man eine festplatte rein machen kann oder eine ssd oder was auch immer das ist ganz cool das habe ich drüben im einsatz zum fernsehprogramm aufnehmen und abspielen im wohnzimmer dann habe ich raspberry pie 3 als unify controller hier habe ich raspberry pie 4 neben mir stehen für so testsachen die wir immer im stream machen genau und dann habe ich noch ein paar esps und gedöns am start aber das müssen wir jetzt ja nicht noch hier näher näher ausführen alles und es kann durchaus sein dass ich mittlerweile noch wo ein hab und kann ich dran denke gar nicht sicher habe ich noch irgendwo einen ich glaube nicht ich habe noch ein paar auf vorrat wenn ich was wenn ich welche brauche also sollte mal irgendwie wieder was cooles anstehen hätte ich noch welche ich habe sogar noch raspberry pie 2 übrig und alles ding aber den kannst du nicht gut gebrauchen weil er hat kein wlan und im prinzip sagt so ziemlich alles ohne wlan also ich wollte mal kurz durch gucken was trendet denn aktuell gerade auf github oder oder wie die coolen leute sagen github also react server juckt mich nicht um was um im maps me offline open street maps maps für ios ok wüsste jetzt nicht wozu ich das brauche außer dass es offline ist aber ich habe meine wander app drauf und ich habe google maps das reicht mir eigentlich nicht github nicht github jit jithub was übrigens komplett verkehrt ist man spricht das git aus und ich und ich jit aber es gibt ja auch leute die sagen gyra oder java oder oder jiff oder was auch immer noch was maps mir würde verkaufen deswegen kriegen sich alle auf echt please update your app review ok es sind es sind alle aber auf was machen die da wieder mail punkt r u a die gekommen sind am start sehe ich das richtig exzellent oder oder anstatt ubuntu ja stimmt das habe ich auch ganz vergessen oder anstatt ubuntu jubantu jubantu ist auch ganz beliebt ja also was haben wir sonst noch zu bieten an aktuellen cross platform customizable science fiction terminal emulator ich will kein science fiction terminal emulator ich will einfach ein terminal emulator der gut funktioniert und der muss auch nicht ehrlich ehrlich gesagt muss der auch nicht in java script sein was ist das 3 3 7 hast aber schnell gemerkt ok das ist wahrscheinlich irgend so ein gag oder weil da hast ja auch schon gleich hier matrix bildschirm schon eingebaut ganz wichtig wie lang wie viel neue programmier sprachen im jahr gibt es so auf github 50 ok und warum braucht man wie lang wie sie ok man kann tetris drin bauen exzellent guck mal es hat ein ui framework dabei ok das ist natürlich schon mal ganz nice aber man sieht halt schon man sieht halt schon auf der vorschau dass das font rendering sagt ich das mal an wobei ich habe nichts gesagt das font rendering ist gut das sah nur in der vorschau kacke aus das ist tatsächlich ganz in ordnung guck mal wieder mal was neues für cross platform ui aber wahrscheinlich aber wahrscheinlich ohne die wichtigsten sachen ne das ist anscheinend cross platform für alles mögliche für das gibt es für windows windows mac linux ja eigentlich eine coole sache wie gesagt es gibt ja leider zu wenig cross platform gui geschichten die ordentlich funktionieren aber es wird wahrscheinlich alles wichtige fehlen was man für ein richtig gutes cross platform gui framework braucht es wird wahrscheinlich kein web view haben ich habe nichts gesagt es hat direkt web view am anfang und wahrscheinlich auch keine möglichkeit irgendwelchen 3d content rein zu rendern aber es ist ja auch alpha software es gibt halt keine gescheiten cross platform frameworks es gibt cute das problem an cute ist es c plus plus und alles was in c plus plus ist sagt prinzipiell weil es c plus plus ist ich hoffe wir sind uns einig chat sonst müssen wir wieder von vorne anfangen sonst müssen wir wieder mit der riesen langen diskussion anfangen warum c plus plus sagt und die zweite alternative ist halt nur mal electron und das hast du eine web anwendung die erste mal 400 mb ram braucht für einen text editor ja in zukunft und das ist das warum ich flatter persönlich sehr nice finde in zukunft wird vielleicht flatter mal richtig gut und das auch auf dem desktop wohlgemerkt da bin ich echt gespannt drauf ja dieses ganze dotnet samarin gezeugt kannst du vergessen zumal zumal das schon beispielsweise linux als target gar nicht richtig gescheit supportet ist und dann auch nur mit gtk als zwischenstep und so ganz ganz merkwürdiger zeug und man hofft ja dass microsoft jetzt mit mit maui heißt das glaube ich ein gescheites cross platform gui framework rausbringt aber ich glaube ja nicht dass das ein gescheites cross platform gui framework sein wird weil das basiert wohl auf dem gleichen kram wie samarin und samarin sackt auf dem desktop ja also bleibt cute und electron übrig und vielleicht in zukunft flatter also flatter ist da wohl mit eindeutig die beste alternative zu weil electron zwar einfach zu entwickeln aber irgendwann ist er auch mal gut mit noch mehr browser auf dem desktop und cute ist c++ und damit schon mal prinzipiell kacke so die zwei die zwei sachen hast du zur auswahl was ziemlich sagt ich habe jetzt ich habe jetzt letztens gesehen dass leute sogar anfangen schon game engines zu verwenden für cross platform gui frameworks weil es nicht gescheites gibt also so weit sind wir schon wir hatten noch letztens wir hatten noch letztens sogar einen im chat hier der meinte dass er seine letzte android schrägstrich cross platform gui app mit godot godot oder wie man das ausspricht gemacht hat und das wohl ganz gut funktionieren muss da kannst du auch rate tracing für fürs font rendering machen ja sowas was haben wir da noch für trends auf github dies ist es heute nur ist es heute ah today deep learning projects okay lang juckt mich nicht bärt es gibt bärt von google bärt bärt von google research gibt's 10 wird niemals verschwinden das ist auch ok aber c++ kann ruhig verschwinden bärt tensorflore pretrained models vor bärt ok was genau ist bärt bärt ich habe keine ahnung was bärt ist es sieht übelst big brain scientific aus aber ich habe keine ahnung was bärt ist was ist bärt es hat schon mal guten namen react gedöns ok machine learning open source re implementation of roller coaster tycoon 2 wusste du wusstet ihr dass das erste roller coaster tycoon komplett in assembler programm oder zu 95 prozent in assembler programmiert war wieso ist c++ so schlecht im vergleich zu anderen spanern root bite ich weiß genau dass du mich eigentlich nur tschie baiten willst weil du bist öfters da und du hast garantiert schon meine c++ friends gehört und ich habe eigentlich keinen bock halt wieder davon anzufangen warum kein command glaube weil es noch keiner geklippt hat ja mal gucken ist das in welcher sprache haben sie das gemacht source android wenn das jetzt c++ ist dann krieg ich anfälle es ist c++ was sonst muss das sein müsste die welt immer so quälen ja jeder gute wechler es machen würde genau deswegen machst du auch so viel in c++ so was gibt es denn sonst noch schönes also generell muss man eins sagen man kann also ich würde ja gerne wetten abschließen auf github trends patrick ich wusste dass du das sagst ich wusste dass du das sagst weil es gab ja gar nicht viel auswahl jetzt als antwort ich wusste dass du du konntest entweder sagen so nach dem wortel ja big brain oder ja ich bin kein guter entwickler ja ich auch nicht sieht man ja ich habe sie im stream oft genug probiert ein bisschen c++ und ich bin jedes mal verzweifelt an irgendwelchen c++ besonderheiten gibt es eigentlich irgendwelche bekannten spiele die in sie scharp entwickelt sind ja zum beispiel heartstone ziemlich viele also quasi alles was unity ist und unity ist ganz schön viel die auf letztes glaube ich in c++ ja das wundert mich auch nicht die chinesen sind ja schmerzfrei die chinesen juckt auch nicht wenn wenn 50 prozent der programmierer sterben bis zur fertigstellung des produktes den egal da kann ich auf c++ verwenden das ist eine sehr gute frage hier welche programmiersprache würdet ihr als erstes empfehlen da kann man eigentlich nicht so ein gemeintes des kommt ganz entscheidend darauf an ultra lauch prings exzellent also ultra lauch es kommt darauf an was du machen willst wenn du ja was willst du machen also es kommt drauf an wenn du sachen web anwendung machen willst dann ist pyson nicht unbedingt das sinnvollste da würde ich eindeutig mit javascript anfangen weil da kannst du zumindest das bisschen backend was du brauchst kannst du auch in javascript machen und um javascript css html kommst du eh nicht rum wenn du windows desktop anwendung machen willst ist pyson auch nicht das beste kommt wirklich ganz entscheidend darauf an was zu machen willst prinzipiell würde ich allerdings sagen das beste zum einsteigen ist aktuell wirklich javascript mit html und css zusammen weil man kommt heute überhaupt nicht mehr um frontend sachen vorbei und ich stelle es mir ein bisschen motivierender vor wenn man eben direkt sieht was passiert naja gut wenn du was machen willst was also wenn du jetzt schon weißt mit auto it oder bist du bestimmt nicht der einzige also wenn du quasi das machen willst du als berufsvorbereitung weil du dann die bessere chancen ausrechnest dann würde ich da nicht zweimal überlegen wenn du weißt das wird genau dann lernt das es ist auf jeden fall nicht verkehrt damit anzufangen also pyson ist eine super sprache es ist saumäßig viel eingebaut also pyson wirklich ein super standard library ich hab letztens mal was mit pyson gemacht und war echt begeistert dass die einen ip calculator und einen csv parser mit drinne hatten also da konnte ich mich echt nicht beschweren und ja es ist es ist auf jeden fall eine super sprache zum einstieg es gibt ein paar dinge die kannst du in pyson nicht wirklich gut machen sagen wir zum beispiel desktop gui sachen ja ich mein gehen tut alles mit allem irgendwie aber ist jetzt vielleicht nicht so nicht so gut dafür aber gerade was machine learning sachen angeht also hat jetzt zwar mit maschinenbau nichts zu tun aber gerade im machine learning bereich ist pyson extrem angesagt und im wissenschaftlichen bereich auch sehr gut ich habe patrick du willst lachen ich habe auch mit zu ähnlichen dinge angefangen damals ich wollte für dark einen bot bauen der die dark war ein mmo was ich damals gespielt haben im friseur zusammen weil ich zeige euch mal einen screenshot ihr werdet kringen wenn ihr das seht den screenshot oder die screenshots von dem game das sieht halt das ist ein game von 2000 von 2002 er sieht halt aus wie ein game von 2002 aber bestes mmo alter bestes so sah das aus genau bestes mmo gibt es nix alle leute auf dem porter ja und ich wollte auch einen bot basteln denn die spiele hersteller also die entwickler mystic entertainment war das glaube ich damals noch bevor sie von ea gekauft wurden die waren der meinung sie verbieten das minimieren da wo die häuser gehackt worden sie verbieten es dass man das spiel schließt und ich wollte damals den bot für dark programmieren der den chat der das chat log passt und im hintergrund für mich sachen macht also ich war ich habe dann zum beispiel den chat geschrieben so nach dem motto nächstes lied so sinngemäß ja dann im hintergrund mein musik player was angeklickt aber das hat das hat auch schlecht als recht funktioniert ja und dann haben sie eingeführt dass man das spiel minimieren darf und dann war das komplett useless wird nicht java in der webentwicklung gehätet java wird java wird allgemein gehätet aber man muss halt sagen java ist nicht so scheiße wie das wie das immer getan wird es gibt wahrscheinlich einfach nur viele unfähige java programmierer und viele scheiß java anwendung aber gerade im enterprise umfeld und auch viele webseiten backends twitter zum beispiel twitter läuft auf java komplett oder zumindest auf auf der java vm weiß ich ob sie selbst in java programmiert haben aber im enterprise umfeld ist java saumäßig beliebt und also wie gesagt ich würde ja gerne auf github trends wetten denn dann kann man auf zwei sachen wetten oder könnte man auf zwei sachen wetten es sind ganz viele machine learning sachen dabei und es sind chinesische repos dabei jetzt irgendwie an diesem teil da hier doch guck du kannst darauf tippen machine learning und chinesische repos in java weil java ist in china voll am boomen ich weiß nicht warum die chinesen also die sind ja die sind ja an sich echt bisschen masochistisch veranlagt die machen sachen in c++ und in java also wenn ich die auswahl hätte zwischen c++ und java dann ist kein wunder dass ich dann würde ich bei foxconn auch vom dach springen also da kannst ja du hast ja eigentlich gar keine auswahl ist ja unmenschlich aber wenn ich die okay also jetzt mal ehrlich wenn ich den auswahl wenn ich die auswahl zwischen java und c++ hätte dann würde ich mich für java entscheiden aber auch nur weil c++ so absoluter bullshit ist und java mittlerweile gar nicht so kacke ich flame java einfach nur gerne wie findest du pearl ähnlich schlimm ähnlich schlimm c++ oder brainfuck c++ brainfuck ist ja keine sprache darum zu arbeiten sehr gut gut c++ auch nicht hast du schon mal was mit rust gemacht ja habe ich aber nie war es fertiges und auch schon eine ganze weile her da war rust 1.0 noch gar nicht raus rust ist richtig geile sprache aber rust ist nur für leute mit 150 iq plus the game wird mir da bestimmt zustimmen rust ist wirklich für die massive brain leute ist eine coole sache aber big brain alarm ja das finde ich auch aber es ist nicht so es ist nicht so kacke wie c++ by the way bei uns auf der arbeit auch ganz viel in dieser kombination ja ich habe keine ahnung von java und spring boot ich habe nur eine sache gelernt mittlerweile in meiner big brain death ops tätigkeit dass java die sache mit spring boot umgedreht hat früher war es so du hast du hast einen application server gebraucht wurde der dann deine java anwendung gestartet hat und mit spring boot ist es umgedreht du startest deine java anwendung die den application server mit eingebaut hat next level shit ich habe keine ahnung was das genau bedeutet aber scheinbar so zu sein habe ich schon öfters gehört also das ist eine deutliche sache ich rede von was wo ich keine ahnung von ab alter betin 2 was hältst du von kronklin das was ich bis jetzt gesehen habe ziemlich nice inspiriert von vielen anderen sprachen aber gut zusammengeklaut finde ich cool also wenn ich die ausweiten mit java und kotlin bin ich nur kotlin verwenden aber ich habe damit nichts großartig gemacht bisher das gleiche gilt übrigens für swift mit swift habe ich auch noch nicht viel gemacht oder besser gesagt gar nichts gemacht aber was ich von swift sehe finde ich auch ganz nice java oder c++ java auf jeden fall java ich bin zwar ich bin zwar nicht scharf drauf aber alles ist besser als c++ also alles was ernsthaft dafür gedacht ist um es zu programmieren und nicht 50 jahre alt ist also ja kobold ist auch noch ätzender und brainfuck ist nicht zu programmieren gedacht aber es ist so ziemlich alles jede moderne sprache angenehmer als c++ ja sehe ich auch so ruby on rails ruby on rails ist cool ruby on rails mag ich leider hat ruby selbst so ein bisschen den anschluss verloren und rails hat nicht mal den hype den es mal vor ein paar jahren hatte aber ruby on rails mag ich was sind denn die besseren ok da kann ich was zu sagen also jetzt natürlich ist das alles echt ultra subjektiv muss man sagen es mag sicherlich sogar leute auf der welt geben die c++ mögen ich werde es zwar nie nachvollziehen können aber das mag mag irgendwo in irgendwelchen verdrehten hirnen mag das so sein ja aber lass mal überlegen was ist was sind schöne was sind schöne sprachen ruby ist eine schöne sprache c sharp ist eine leise sprache c ist eine leise sprache go ist eine leise sprache pyson ist eine leise sprache javascript ist mittlerweile auch ganz ok was hat man von rust ist auch ganz gut haben wir jetzt noch so vergessen an mainstream sachen type type script ja type script type script auch dazu pp pp mit lara will markt ganz gut gehen habe ich aber kaum erfahrungen mit ja so das sind zumindest die sprachen in denen ich jemand in denen ich schon mal ein bisschen was gemacht habe wo ich zu sagen kann dass ich die ganz nice finde anhand was mist man sprach iq needed das da gibt es da gibt es einen guten indikator für go ist übrigens auch ganz ok go hat so ein paar dinger die ich nicht ganz nachvollziehen kann aber an sich ist ok es gibt eine sache wo man das ganz einfach daran nachvollziehen kann wie viele doppelt dreifach vierfach mehr deutigkeiten klammern haben oder speziell oder sonderzeichen haben in c++ haben die sich nämlich gedacht dass man möglichst oft die gleichen zeichen für unterschiedliche sachen verwenden sollte zum beispiel in und ist ganz beliebt in c++ so ein und zeichen in c++ kann glaube ich mindestens fünf verschiedene bedeutungen haben die komplett unterschiedlich sind aber komplett da haben die sich gedacht im gremium so muss das sein exquisite haben abends dann im gremium gesessen haben sie ihr weinglas geschwenken haben sie überlegt wir brauchen noch einen operator wo man automatisch in lambda funktionen variablen captured was nehmen wir dafür wir könnten das irgendwie versuchen automatisch zu machen oder wir könnten irgendwie dafür was gut lesbares uns ausdenken ach nee lass mal den und nehmen das ist übrigens herz auch eine coole frage warum wir so sind dann viele spiele in c++ programmiert historisch vieles ist halt mal in c++ wie unreal zum beispiel es hat sich historisch auch irgendwie etabliert aber so ziemlich keiner macht es gerne also es gibt kaum jemand der wirklich gerne c++ programmiert auch bei der spielerentwicklung viele sind da halt mehr oder weniger gezwungen zu es gibt bestimmt den ein oder anderen ja der chat chat ist klar ist klar jetzt kommen jetzt kommen sie wieder alle an ich mag c++ ich mag brainfuck ich mag alles jeder jeder was er will wenn ihr wenn ihr c++ macht was in c++ wie gesagt kann ich nicht viel zu sagen ruby typescript ist auch ganz gut unterschied c der hauptunterschied zwischen c und c++ ist c ist ziemlich minimalistisch und in sich selbst logisch und c++ ist aufgeplädt und unlogisch und mehrdeutig wieso ist c++ so schlecht weil es undurchdachter crap ist ja skala wenn man gerne klammern mag dann ist skala nice ja waren meine led strips die blinken habe ich gerade an hier am fenster das ding ich muss dir ehrlich sagen habe ich mir noch gar nicht großartig angeguckt github workspaces gut job ja ja ich auch auch mein beileid hier was ist denn die alternative zu c++ ja kommt drauf an was man machen will ich mag c sharp c sharp ist keine wirkliche alternative zu c++ also spielt ein bisschen anderen eine richtung aber ich finde c sharp ist so ist ein super als wegsprache es gibt fast fast nichts was man nicht in c sharp machen kann es gibt umgedreht auch kaum was was man nicht in c++ machen kann zusätzlich wirst du aber in c++ noch verrückt im kopf ja das stimmt ich war man kann cute auch verwenden vor allem das alte dass ich erst das die cute forms geschichte kann vergessen wie es heißt die kann man auch verwenden ohne auf die und auf den restlichen c++ kram scheißen aber es ist trotzdem nervig halo halo soundtrack ja das kommt tatsächlich noch dabei dass gerade was performance angeht c++ wirklich nicht übel ist allerdings muss man sagen c++ kann man sich halt auch ziemlich einfach ins bein schießen und und man muss halt auch wirklich sagen dass gerade durch unity und durch die anpassung die microsoft generell an c sharp in letzter zeit gemacht hat dass performance mäßig zwar immer noch ein unterschied ist also du kannst in der regel davon ausgehen dass ein c++ kram doch noch schneller ist als in c sharp pro kram allein schon weil du die ganzen runtime checks nicht hast aber es ist jetzt nicht nur dass da welten dazwischen liegen also deswegen sage ich ja ich finde ich finde c sharp ist wirklich ein absolut super als wegsprache es gibt fast nichts was du damit nicht machen kannst natürlich gibt es ein paar sachen du kannst wird du wirst keinen bootloader in c sharp programmieren das wirst du aber wahrscheinlich auch nicht in c++ machen wahrscheinlich auch nicht einmal in c machen weil du da genau wissen musst sampler mäßig was nacheinander ausgeführt wird aber im prinzip kannst du mit c sharp nahezu alles machen und alles auch ganz gut übrigens auch noch ein punkt wo c++ nahezu unangefochten ist ist also c und c++ aber je nachdem was auch c++ ist microcontroller programmierung microcontroller programmierung gerade so die beliebten esp 32 dinger und so was da kommt dann c++ auch nicht so wirklich bei ja alex das ist der unterschied zwischen zwischen theorie und praxis theoretisch ja praktisch nein theoretisch ja weil du in einer vollständigen sprache quasi alles berechnen kannst was du mit so einem computer berechnen kannst aber das bringt dir jetzt nicht so viel wenn deine sprache beispielsweise keine keine c style betriebssystem api aufrufe machen kann weil dann kannst du mit deiner sprache eben nichts callen außer das was deine sprache eben kann ja deine sprache mag zwar alles berechnen können aber greif mal auf ein usb gerät zu mit deiner sprache viel spaß nein nein ich hatte aber schon mal ein wo das standardmäßig mit drauf ist aber ich habe noch nie noch nie damit rum gewurstet zwar zeigt was haben was haben wir sonst noch für interessante github trends dos box pure aha exzellent für retro retro arch und cast aha kann ich mein eigenes youtube auf machen ich warte schon die ganze zeit drauf chat wir machen unser eigenes twitch easy easy money easy live kein problem oh das ist doch das ist doch garantiert monka tost oder das sind doch bestimmt irgendwelche ip tv channels drin die man nicht sehen sollte oder nicht sehen darf ohne in dem land zu sein oder oder irgendwas da ist bestimmt monka tost mit drinne taskbar groups obas ist das könnte das für windows was taugen der macht es richtig ja no comment message so muss es sein einfach leere comment message machen nicht so wie ich da mist reinschreiben einfach leer lassen aha ok für leute die viele unterschiedliche programme aufhaben könnte das tatsächlich ganz nice sein sieht ein bisschen aus wie bei was du auf dem iphone machen kannst mit diesen gruppen auf dem startbildschirm oder auf dem desktop willst du heute noch battlefield 3 nee ich gehe jetzt eine halbe stunde ins bett und vorher gehe ich noch mal aufs klo heute spiele ich kein battlefield 3 mehr nee warum haben wir kobold stream und an weihnachten spielen wir wieder battlefield 3 oder vielleicht mal über mal ein kobold stream space x ab die haben eine api was macht man damit warum gibt es warum gibt es eine art warum hat space x ab kann ich damit auch raketen fernsteuern achso das ist einfach nur dass man sich angucken kann was wie wann gestartet ist und sowas ok was ist was ist die net is cloud net is cloud musik habe ich nie gehört noch mehr c++ ok da ist diese woche nicht so wirklich spannendes dabei die sind heute nicht so wirklich was spannendes dabei also richtig spannend sind einfach eher so die weekly und monthly trends gleiche graben auch nicht so spannend auch nicht so spannend bevy rust gedöns firefox ist für ios ok warum trendet das tinder permission studio code trendet exellent so muss das sein da melden wir uns dann auch demnächst mal an für die hotten programmer grills vs inda wobei es ja nicht wie sind da heißt aber ich finde vs inda könnte es auch sein ja dann schreiben wir dann fünfzeiten assembler um die um die hotten programmer wishlist zu die code grills zu beeindrucken easy easy bitcoin trendet warum auch immer packer also wirklich spannend ist es nicht was da heute so trendet ehrlich gesagt ist es ziemlich langweilig weil bitcoin gerade durch die decke geht zeigt mal macht es das oh tatsächlich warum denn ausgerechnet jetzt ich weiß ich eigentlich hätte ich mittlerweile gelernt lernen müssen dass das einem keiner so genau jemand erklären kann über bitcoin immer an den chat gibt es ein clip in dem maxand sound und stickerboard zeigt hä was meinst du das hier warum so sieht das aus ja ja so sieht das aus und ganz wichtig die bahn ist auch mit am start aha ich habe von krypto zeug echt kein plan hat er was dazu gesagt also leute ja leute wisst ihr was also ich gehe jetzt eben ich wollte nur noch mal streben dass ich jetzt nicht wieder dass es nicht wieder einschläft ihr kennt das ja erkennt mich ja wenn ich wenn ich nicht streben und dann ein paar tage nicht gestriemt habe kein video gemacht habe dann dann schläft das ganze immer so ein weil ich dann denke ah nee heute heute wieder nicht und so ich habe jetzt einfach nur mal eine runde streben angemacht dass ich nicht wieder in diese in diesen modus verfalle es ist jetzt 21.50 leute ich gehe jetzt noch mal aufs klo dann gehe ich pennen morgen ist weihnachten ich weiß nicht ob wir den kobold stream morgen machen oder übermorgen müssen wir mal schauen wir brauchen auch outro musik oder outro musik brauchen wir leute outro musik muss muss sein also chat wir sehen uns machts gut see you", "segments": [{"id": 1, "start": 0.0, "end": 8.0, "text": "Einfach nur so. Massive Pog. Huge Big Pog. Big Brain Pog."}, {"id": 2, "start": 8.0, "end": 16.0, "text": "So. Ach guck mal Levelcap hat ein Video zugemacht."}, {"id": 3, "start": 16.0, "end": 25.0, "text": "Das seh ich ja jetzt erst. Levelcap hat da ein Video zugemacht. Nice."}, {"id": 4, "start": 25.0, "end": 33.0, "text": "Aber guck mal sogar bei Levelcap haben wir 74k gesehen und nur 300 Leute kommentiert."}, {"id": 5, "start": 33.0, "end": 41.0, "text": "Das ist ja Kommentare hab ich ja fast so ähnlich viele und Aufrufe hab ich die Hälfte oder so."}, {"id": 6, "start": 41.0, "end": 47.0, "text": "Levelcap hat ein bisschen mehr Subs als ich."}, {"id": 7, "start": 47.0, "end": 59.0, "text": "Hä heut kein VU. Ich hab den ganzen Tag Monster Sanctuary stills gemacht."}, {"id": 8, "start": 59.0, "end": 65.0, "text": "Das Game macht echt Bock. Prime Werbung feels Batman. Prime Werbung ist gut."}, {"id": 9, "start": 65.0, "end": 71.0, "text": "Wenn du Prime Werbung bekommst und Amazon Prime hast kannst du kostenlos Twitch Primes haben."}, {"id": 10, "start": 71.0, "end": 77.0, "text": "Nee Patrick ich glaub das muss ich nicht streamen das ist ultra langweilig zuzugucken."}, {"id": 11, "start": 77.0, "end": 81.0, "text": "Ich guck das ehrlich gesagt beim Fabian auch nur weil ich es entspannt finde und es halt der Fabian ist."}, {"id": 12, "start": 81.0, "end": 87.0, "text": "Aber ansonsten ist das glaube ich ziemlich langweilig."}, {"id": 13, "start": 87.0, "end": 93.0, "text": "Prime. Übrigens habt ihr schon gehört der Rundfunk Beitrag wird nicht erhöht."}, {"id": 14, "start": 93.0, "end": 109.0, "text": "Der Rundfunk Beitrag wird nicht erhöht hab ich gehört."}, {"id": 15, "start": 109.0, "end": 115.0, "text": "Und zwar es war ja irgendwie so morgen Kobold stream."}, {"id": 16, "start": 115.0, "end": 119.0, "text": "Ich weiß noch nicht genau ob morgen oder übermorgen. Morgen muss ich relativ viel Zeug machen."}, {"id": 17, "start": 119.0, "end": 123.0, "text": "Aber vielleicht kriegen wir das morgen gebacken."}, {"id": 18, "start": 123.0, "end": 129.0, "text": "Also ich hab das nur so am Rande verfolgt. Ich persönlich find's ja gut. Ich find's ja super."}, {"id": 19, "start": 129.0, "end": 135.0, "text": "Ich bin ja eh kein großartiger Fan vom öffentlich-rechtlichen Programm."}, {"id": 20, "start": 135.0, "end": 139.0, "text": "Ich hab prinzipiell nichts dagegen dass es den öffentlich-rechtlichen Rundfunk gibt."}, {"id": 21, "start": 139.0, "end": 143.0, "text": "Ich find das auch an sich von der Idee her gar nicht schlecht."}, {"id": 22, "start": 143.0, "end": 149.0, "text": "Ich find's auch so dieses selbstgefällige Handaufhalten nach dem Motto"}, {"id": 23, "start": 149.0, "end": 155.0, "text": "Ja wenn wir mehr haben wollen dann gib uns gefällig mehr. Das nervt mich ehrlich gesagt ein bisschen."}, {"id": 24, "start": 155.0, "end": 157.0, "text": "Deswegen find ich das nice."}, {"id": 25, "start": 157.0, "end": 161.0, "text": "Und ich hab's ja nur so am Rande verfolgt. Und wisst ihr was das geile ist?"}, {"id": 26, "start": 161.0, "end": 167.0, "text": "Wie übelst total pepega style das gelaufen ist."}, {"id": 27, "start": 167.0, "end": 169.0, "text": "Dass das jetzt nicht erhöht wurde."}, {"id": 28, "start": 169.0, "end": 173.0, "text": "Und dass sie jetzt geklagt haben und das ganze noch abgelehnt wurde."}, {"id": 29, "start": 173.0, "end": 175.0, "text": "Also pass mal auf."}, {"id": 30, "start": 175.0, "end": 179.0, "text": "Ich hab mir das auch morgen mal in Ruhe durchgelesen."}, {"id": 31, "start": 179.0, "end": 187.0, "text": "Es ist ja irgendwie so wie es dazu gekommen ist, dass der Rundfunkbeitrag nicht erhöht wird."}, {"id": 32, "start": 187.0, "end": 197.0, "text": "Es gibt eine Kommission die rechnet aus wie viel der Rundfunkbeitrag erhöht werden muss."}, {"id": 33, "start": 197.0, "end": 205.0, "text": "Dass ARD und ZDF und die Öffentlich-Rechtlichen ihren Betrieb aufrechterhalten können auch die nächsten Jahre."}, {"id": 34, "start": 205.0, "end": 207.0, "text": "Das Ding nennt sich wohl Kev."}, {"id": 35, "start": 207.0, "end": 211.0, "text": "Kann sein dass ich ein bisschen was falsch verstanden hab."}, {"id": 36, "start": 211.0, "end": 221.0, "text": "Und die haben ausgerechnet, dass der Rundfunkbeitrag für nächstes Jahr um 86 Cent steigen darf."}, {"id": 37, "start": 221.0, "end": 227.0, "text": "ARD und ZDF die wollten sogar noch mehr haben, aber Kev hat gesagt, ne 86 Cent."}, {"id": 38, "start": 227.0, "end": 233.0, "text": "Also die haben das super krass Calculator-Hackerman-Geschichte gemacht."}, {"id": 39, "start": 233.0, "end": 239.0, "text": "Und sind jetzt irgendwie auf 86 Cent gekommen."}, {"id": 40, "start": 239.0, "end": 243.0, "text": "Also die sind schon massive brained, 86 Cent."}, {"id": 41, "start": 243.0, "end": 247.0, "text": "Fehlt bloß noch ein Komma, 86,57 Cent oder sowas."}, {"id": 42, "start": 247.0, "end": 251.0, "text": "Über 86 Cent wollten sie den Kram erhöhen."}, {"id": 43, "start": 251.0, "end": 257.0, "text": "Dazu müssen aber wohl alle Länder zustimmen."}, {"id": 44, "start": 257.0, "end": 261.0, "text": "Und es haben auch alle Länder zugestimmt."}, {"id": 45, "start": 261.0, "end": 265.0, "text": "Bis auf Sachsen-Anhalt oder so."}, {"id": 46, "start": 265.0, "end": 273.0, "text": "Und dort wollten sie nicht zustimmen, weil ein Argument was sie gebracht haben ist."}, {"id": 47, "start": 273.0, "end": 277.0, "text": "Was im Osten war es auf jeden Fall."}, {"id": 48, "start": 277.0, "end": 281.0, "text": "Und ein Argument die sie gebracht haben ist, also die CDU."}, {"id": 49, "start": 281.0, "end": 285.0, "text": "Und ich glaube die CDU und die Grünen oder die CDU und die SPD regiert da."}, {"id": 50, "start": 285.0, "end": 287.0, "text": "Ich glaube die CDU und die Grünen sinds."}, {"id": 51, "start": 287.0, "end": 295.0, "text": "Und die CDU hat gesagt, ihnen gefällt die Darstellung vom Osten nicht in öffentlich-rechtlichen Sendungen."}, {"id": 52, "start": 295.0, "end": 299.0, "text": "So und jetzt, und jetzt wirds richtig pepega."}, {"id": 53, "start": 299.0, "end": 301.0, "text": "Jetzt wirds richtig pepega."}, {"id": 54, "start": 301.0, "end": 305.0, "text": "Also, dann sollte abgestimmt werden."}, {"id": 55, "start": 305.0, "end": 313.0, "text": "Man denkt, und es wird ja auch berichtet, dass Sachsen-Anhalt die Erhöhung des Rundfunkbeitrags abgelehnt hat."}, {"id": 56, "start": 313.0, "end": 315.0, "text": "Das stimmt gar nicht, das hab ich auch gesagt."}, {"id": 57, "start": 315.0, "end": 317.0, "text": "Aber jetzt wirds richtig pepega."}, {"id": 58, "start": 317.0, "end": 323.0, "text": "Die sind doch irgendwie mit den Grünen zusammen in der Koalition in Sachsen-Anhalt."}, {"id": 59, "start": 323.0, "end": 327.0, "text": "Und die sollten jetzt darüber abstimmen."}, {"id": 60, "start": 327.0, "end": 333.0, "text": "Und wie gesagt, die CDU ist nicht dafür, die Grünen und die SPD wollens, dass das erhöht wird."}, {"id": 61, "start": 333.0, "end": 336.0, "text": "Und die AfD ist aber auch dagegen."}, {"id": 62, "start": 336.0, "end": 343.0, "text": "So und CDU plus AfD hätten genug Stimmen um das abzulehnen."}, {"id": 63, "start": 343.0, "end": 349.0, "text": "Jetzt ist aber das Problem, dass die Grünen und die SPD einen riesen Aufriss gemacht haben wohl in Sachsen."}, {"id": 64, "start": 349.0, "end": 357.0, "text": "Sachsen oder Sachsen-Anhalt, wo war es denn jetzt eigentlich?"}, {"id": 65, "start": 357.0, "end": 359.0, "text": "Was? Sachsen-Anhalt?"}, {"id": 66, "start": 359.0, "end": 361.0, "text": "Sachsen-Anhalt war es, genau."}, {"id": 67, "start": 361.0, "end": 366.0, "text": "Also, die Grünen und die SPD haben einen riesen Aufriss gemacht in Sachsen-Anhalt."}, {"id": 68, "start": 366.0, "end": 377.0, "text": "Dass es ja absolut nicht sein darf, nicht geht, dass man zusammen für das gleiche abstimmt, wo auch die AfD abstimmt."}, {"id": 69, "start": 377.0, "end": 386.0, "text": "Und dementsprechend haben sie dann gesagt, hier, wenn ihr das macht, dann lösen wir die Regierung auf, so nach dem Motto."}, {"id": 70, "start": 386.0, "end": 396.0, "text": "Und jetzt, was jetzt passiert ist, ist, der Antrag wurde nicht abgelehnt, denn der Antrag wurde zurückgezogen."}, {"id": 71, "start": 396.0, "end": 404.0, "text": "Die CDU hat den Antrag zurückgezogen, damit sie nicht zusammen mit der AfD dagegen stimmen muss."}, {"id": 72, "start": 404.0, "end": 415.0, "text": "Und dadurch, dass die Sache jetzt nicht abgestimmt wurde und dementsprechend wurde auch nicht zugestimmt, weil es wurde nicht abgestimmt."}, {"id": 73, "start": 415.0, "end": 418.0, "text": "Es wurde nicht dagegen gestimmt, es wurde nicht abgestimmt."}, {"id": 74, "start": 418.0, "end": 423.0, "text": "Das heißt, es haben alle abgestimmt, alle waren dafür, außer Sachsen-Anhalt, die haben nicht abgestimmt."}, {"id": 75, "start": 423.0, "end": 428.0, "text": "Und dementsprechend haben sie auch nicht dafür abgestimmt."}, {"id": 76, "start": 428.0, "end": 435.0, "text": "So, also das erste war schon absolut wir, was da wieder für komische Dinge im Hintergrund laufen."}, {"id": 77, "start": 435.0, "end": 443.0, "text": "Und dann, daraufhin, daraufhin hat dann ARD und ZDF gesagt, wie ihr wollt nicht zustimmen."}, {"id": 78, "start": 443.0, "end": 447.0, "text": "Das geht aber nicht. Ihr habt gefällig zuzustimmen."}, {"id": 79, "start": 447.0, "end": 454.0, "text": "Wobei ich mich dann ganz ehrlich frage, wenn, wenn das ja, kurz die Halo-Musik vielleicht einen Ticken leiser mache."}, {"id": 80, "start": 454.0, "end": 465.0, "text": "Also wenn das ja so ist, dass die Länder zustimmen müssen, dann kann man sich halt echt fragen, warum gibt es das überhaupt?"}, {"id": 81, "start": 465.0, "end": 471.0, "text": "Weil, was hat es für einen Sinn, wenn man eine Abstimmung macht, wo man zustimmen muss? Na gut."}, {"id": 82, "start": 471.0, "end": 480.0, "text": "Zumindest, jetzt hat ARD und ZDF, haben wohl einen Eilantrag gestellt, beim Bundesverfassungsgericht."}, {"id": 83, "start": 480.0, "end": 488.0, "text": "Und, also sprich, die müssen sich da unbedingt ganz furchtbar schnell drum kümmern."}, {"id": 84, "start": 488.0, "end": 492.0, "text": "Und jetzt hat das Bundesverfassungsgericht diesen Eilantrag abgelehnt."}, {"id": 85, "start": 492.0, "end": 507.0, "text": "Aber auch geil, mit welcher Begründung, die haben gesagt, die haben gesagt, ja, schön und gut Eilantrag, aber der ist nicht ausreichend begründet."}, {"id": 86, "start": 507.0, "end": 518.0, "text": "Also sprich, das Bundesverfassungsgericht ist der Meinung, die ARD hat nicht ausreichend begründet, warum es erforderlich ist, dass man jetzt das im Eilverfahren erscheidet."}, {"id": 87, "start": 518.0, "end": 528.0, "text": "Denn, ähm, es war ihnen nicht klar, warum es notwendig ist, dass es ausgerechnet jetzt sofort erhöht werden muss."}, {"id": 88, "start": 528.0, "end": 531.0, "text": "Und nicht erst, wenn sie entschieden haben. Also haben sie das ganze abgelehnt."}, {"id": 89, "start": 531.0, "end": 542.0, "text": "So, das heißt natürlich nicht, dass es nicht doch erhöht werden könnte noch, weil das eigentliche Verfahren, das kommt ja noch, aber das dauert ja auch ein bisschen."}, {"id": 90, "start": 542.0, "end": 548.0, "text": "Aber ein richtiger, mega pepega Vorgang. Man muss sich auch mal überlegen, ne?"}, {"id": 91, "start": 548.0, "end": 563.0, "text": "Das sind zwar nur 86 Cent, oder 86, ich glaube 86 Cent, die sie das erhöht haben wollen, aber insgesamt, die kriegen das, was der Blockhunter sagt, die kriegen um die 8 Milliarden, das ist übertrieben viel."}, {"id": 92, "start": 563.0, "end": 572.0, "text": "Und ich finde es prinzipiell okay, dass es so etwas wie einen öffentlich-rechtlichen Rundfunk gibt, aber da wird so selbstverständlich mittlerweile Geld eingezogen."}, {"id": 93, "start": 572.0, "end": 582.0, "text": "Und man ist der Meinung, man ist quasi so der hier der von Gott gegebene, äh, Einsammler, ähm, das kann es ja nur auch nicht sein."}, {"id": 94, "start": 582.0, "end": 587.0, "text": "Deswegen, ich freue mich, ich freue mich, dass sie das abgelehnt haben."}, {"id": 95, "start": 587.0, "end": 590.0, "text": "Ich freue mich echt, dass sie das abgelehnt haben."}, {"id": 96, "start": 590.0, "end": 597.0, "text": "Weil so selbstverständlich, vor allem weil ich es halt mega dreist finde, dass die überhaupt vor das Gericht gegangen sind."}, {"id": 97, "start": 597.0, "end": 602.0, "text": "So nach dem Motto, wozu gibt es denn überhaupt die Abstimmung, wenn man danach eh dagegen klagt?"}, {"id": 98, "start": 606.0, "end": 612.0, "text": "Ah, naja gut. Also da habe ich mich gefreut, als ich das gesehen habe."}, {"id": 99, "start": 614.0, "end": 620.0, "text": "Japepega-Verein, ähm, 8 Milliarden für Sturm der Liebe."}, {"id": 100, "start": 620.0, "end": 628.0, "text": "Äh, die machen ja schon, die machen ja auch durchaus halbwegs gescheite Sachen im öffentlich-rechtlichen, muss man sagen."}, {"id": 101, "start": 628.0, "end": 631.0, "text": "Es gibt ja doch ein paar gescheite Sendungen, die ich auch ganz gerne gucke."}, {"id": 102, "start": 631.0, "end": 640.0, "text": "Zum Beispiel, ähm, im SWR gibt es ab und zu mal sowas, wo sie alte Handwerksleute zeigen, so nach dem Motto,"}, {"id": 103, "start": 640.0, "end": 650.0, "text": "Keine Ahnung, der letzte Schuhmacher aus, äh, frag mich nicht, aus dem letzten Furzdorf, den es jetzt noch gibt und sowas."}, {"id": 104, "start": 650.0, "end": 653.0, "text": "Also die haben ab und zu mal ganz interessante Beiträge."}, {"id": 105, "start": 653.0, "end": 660.0, "text": "Aber ich muss euch ehrlich sagen, ich glaube ein Großteil davon, man das braucht sei mal echt dahingestellt."}, {"id": 106, "start": 663.0, "end": 666.0, "text": "Ja, es gibt schon ein paar ganz, es gibt schon ein paar ganz gute Sachen."}, {"id": 107, "start": 666.0, "end": 670.0, "text": "Aber mal ganz im Ernst, es gibt auch viel Scheiße, was man nicht bräuchte."}, {"id": 108, "start": 670.0, "end": 676.0, "text": "Deswegen, da sollen sie halt ein paar Einschnitte machen in ihrem Programm, durch die 86 Cent weniger."}, {"id": 109, "start": 677.0, "end": 679.0, "text": "Warum auch immer."}, {"id": 110, "start": 682.0, "end": 686.0, "text": "Wurdet ihr doch safe auf YouTube empfohlen, die Doku? Ja, klar."}, {"id": 111, "start": 686.0, "end": 699.0, "text": "Was ist denn da dran, einseitig betrachtet? Ich meine, mit 8 Milliarden kannst du schon einiges an Dokus machen."}, {"id": 112, "start": 704.0, "end": 706.0, "text": "Also ich finde das gut."}, {"id": 113, "start": 706.0, "end": 718.0, "text": "Vor allem, es gab einen Interview mit dem, das habe ich auch heute Morgen irgendwo gesehen, der, ich glaube bei der Welt,"}, {"id": 114, "start": 718.0, "end": 725.0, "text": "gab es einen Interview mit dem, sogar Ministerpräsident von Sachsen-Anhalt,"}, {"id": 115, "start": 725.0, "end": 729.0, "text": "und der hat berichtet, wie das gelaufen ist, als die ARD ihn besucht hat."}, {"id": 116, "start": 729.0, "end": 738.0, "text": "Also sprich, die sind da vorbeigekommen und wollten ihnen quasi erklären, warum sie doch gefällig zuzustimmen haben."}, {"id": 117, "start": 738.0, "end": 744.0, "text": "Und er war halt der Meinung, es kann ja nicht sein, dass man ihnen da mit einer Selbstverständlichkeit erzählt,"}, {"id": 118, "start": 744.0, "end": 747.0, "text": "dass sie als gewählte Abgeordnete da irgendwie zustimmen müssen."}, {"id": 119, "start": 747.0, "end": 750.0, "text": "Das ging mir auf den Sack und das kann ich verstehen."}, {"id": 120, "start": 750.0, "end": 754.0, "text": "Also es ist ja nicht so, als kriegen die von heute auf morgen gar kein Geld mehr."}, {"id": 121, "start": 754.0, "end": 757.0, "text": "Aber ich, ich habe mich da echt drüber gefreut."}, {"id": 122, "start": 757.0, "end": 763.0, "text": "Es gibt ein paar Sachen, die gucke ich gerne, aber im Großen und Ganzen hätte ich auch keine Schmerzen,"}, {"id": 123, "start": 763.0, "end": 766.0, "text": "wenn es ein paar sinnlose Sendungen weniger gibt."}, {"id": 124, "start": 768.0, "end": 773.0, "text": "Zumal ich es eh allgemein ziemlich frech finde, das muss ich jetzt aber sagen, dass man, man hat es ja geändert."}, {"id": 125, "start": 773.0, "end": 777.0, "text": "Früher ging es ja noch darum, wer einen Fernseher hat, mit dem man das empfangen kann,"}, {"id": 126, "start": 777.0, "end": 780.0, "text": "und mittlerweile musst du ja pro Haushalt zahlen."}, {"id": 127, "start": 780.0, "end": 787.0, "text": "Das ist nur eine Anpassung an die Inflation. Ja, es ist vor allem eine Anpassung, dass die ihre Renten bezahlen können."}, {"id": 128, "start": 787.0, "end": 793.0, "text": "Es ist ja gar nicht mal so, als kommt es jetzt wahnsinnig gut dem Programm zugute."}, {"id": 129, "start": 793.0, "end": 796.0, "text": "Die müssen ja auch ihre ehemaligen Mitarbeiter bezahlen."}, {"id": 130, "start": 796.0, "end": 799.0, "text": "Jetzt kommt es jetzt wahnsinnig gut dem Programm zugute."}, {"id": 131, "start": 799.0, "end": 802.0, "text": "Die müssen ja auch ihre ehemaligen Mitarbeiter bezahlen."}, {"id": 132, "start": 816.0, "end": 823.0, "text": "Gute mal, Zwischenfrage. Sollte man, wenn man CentOS aktuell privat nutzt, das ist eine gute Frage."}, {"id": 133, "start": 823.0, "end": 831.32, "text": "Yes, das stream send os wurde sollte man im aktuellen sent os 8 nutz auf sent os wechselt"}, {"id": 134, "start": 831.32, "end": 833.16, "text": "dir bleibt nichts anderes übrig"}, {"id": 135, "start": 833.16, "end": 837.5, "text": "hoch umgehend ist jetzt runter"}, {"id": 136, "start": 837.5, "end": 841.76, "text": "dir bleibt nicht dir bleibt nichts anderes übrig"}, {"id": 137, "start": 841.76, "end": 855.24, "text": "ja der kell verdient auch kohle das stimmt schon ob das ob das jetzt auch gerechtfertigt ist"}, {"id": 138, "start": 855.24, "end": 863.36, "text": "einmal hingestellt auf der anderen seite denke ich mir das ist die überste position das ist"}, {"id": 139, "start": 863.36, "end": 868.44, "text": "vergleichbar mit anderen sachen ist auch ok ich bin zum beispiel niemand der prinzipiell auf"}, {"id": 140, "start": 868.44, "end": 874.68, "text": "manager gehälter gehältern rum hated oder auf auf vorstands gehältern oder so natürlich kann"}, {"id": 141, "start": 874.68, "end": 881.08, "text": "man sich darüber streiten dass man sagt hey warum verdient der typ keine ahnung 2 2 millionen plus"}, {"id": 142, "start": 881.08, "end": 886.88, "text": "irgendwie sonst was während er 5000 leute entlassen hat aber und das ist der unterschied"}, {"id": 143, "start": 886.88, "end": 895.6, "text": "eigentlich sollte man die leute die diesen position sind gar nicht so sehr dafür haten weil die"}, {"id": 144, "start": 895.6, "end": 900.88, "text": "wurden auch eingestellt den geschäftsführer der da am start ist der wurde eingestellt der"}, {"id": 145, "start": 900.88, "end": 906.28, "text": "ist nicht einfach da irgendwie gesporn eigentlich muss man sauer sein auf die leute die den typ"}, {"id": 146, "start": 906.28, "end": 912.72, "text": "eingestellt haben und den ganzen scheiß mitmachen wenn man auf irgendjemand sauer sein will und"}, {"id": 147, "start": 912.72, "end": 918.88, "text": "dazu kommt dass diese position auch nicht so viele leute gibt die das machen wollen also da bin ich"}, {"id": 148, "start": 918.88, "end": 922.72, "text": "nicht dafür dass man prinzipiell sinnlos um sich schicken dass alles alles schlecht findet nur"}, {"id": 149, "start": 922.72, "end": 926.56, "text": "weil es mal leute gibt die halt position haben wo man viel verdient aber gerade wenn das so"}, {"id": 150, "start": 926.56, "end": 933.32, "text": "gezwungenermaßen ist ja niemand zwingt einen irgendwo was einzukaufen wenn man mit den"}, {"id": 151, "start": 933.32, "end": 938.04, "text": "praktiken nicht zufrieden ist aber du hast halt beim öffentlich rechtlichen keinerlei auswahl"}, {"id": 152, "start": 938.04, "end": 946.68, "text": "das auch so was was ein bisschen sauer aufstößt und wenn man dann sieht wo da das wurde die kohle"}, {"id": 153, "start": 946.68, "end": 953.64, "text": "rausgehauen wird ja also ich freue mich drüber dass es nicht so selbstverständlich geht die"}, {"id": 154, "start": 953.64, "end": 960.36, "text": "erhöhen kann durchaus sein dass die erhöhen kommt ist nicht nach der großartigen was dagegen"}, {"id": 155, "start": 960.36, "end": 965.92, "text": "hätte wenn das so entschieden wird aber dass das nicht mehr so automatisch kommt finde ich"}, {"id": 156, "start": 965.92, "end": 974.52, "text": "eigentlich ganz gut warum heißt du hier wo bloß weil du den account ist den ich erstellt habe"}, {"id": 157, "start": 974.52, "end": 979.0, "text": "als ich gar nicht streamen wollte und irgendwann habe ich mir gedacht komm wir fangen jetzt mal"}, {"id": 158, "start": 979.0, "end": 983.08, "text": "an bisschen stream so an und dann hieß ich halt noch so ich habe mich auch nicht umbenannt weil"}, {"id": 159, "start": 983.08, "end": 994.0, "text": "ich mir auch dachte hey wenn dann leute von youtube kommen dann nur die gescheiten ja also"}, {"id": 160, "start": 994.0, "end": 1000.48, "text": "dir bleibt nichts anderes übrig wie auf cento stream zu wechseln gibt ja nichts mehr gibt"}, {"id": 161, "start": 1000.48, "end": 1006.0, "text": "dir nichts anderes kannst du nichts anderes machen du könntest jetzt also meine frage warum"}, {"id": 162, "start": 1006.0, "end": 1012.12, "text": "muss es denn ausgerechnet cento es sein im privaten vielleicht gibt es rocky linux bis dahin ja aber"}, {"id": 163, "start": 1012.12, "end": 1022.56, "text": "rocky linux gibt es ja noch gar nicht das ist ja nur in der findungsphase aktuell noch da ist ja"}, {"id": 164, "start": 1022.56, "end": 1029.92, "text": "also dass das raus ist bis das andere eingestellt ist das müssen wir erst mal gucken du kannst ja"}, {"id": 165, "start": 1029.92, "end": 1035.68, "text": "aktuell auch gar nicht auf rocky linux umsteigen gibt es ja noch gar nicht aber warum warum muss"}, {"id": 166, "start": 1035.68, "end": 1043.76, "text": "es denn warum muss es denn cento es sein was hältst du denn zum beispiel von obuntu server"}, {"id": 167, "start": 1043.76, "end": 1055.88, "text": "ist ja mein persönlicher favorit ja ich mag obuntu allerdings nicht auf dem desktop nur als server"}, {"id": 168, "start": 1055.88, "end": 1067.04, "text": "auf dem desktop sacks oder sagen wir es anders auf dem desktop gefällt mir es nicht debian besser"}, {"id": 169, "start": 1067.04, "end": 1073.6, "text": "als obuntu server jetzt würde ich so pauschal nicht sagen ich würde weder sagen dass das eine"}, {"id": 170, "start": 1073.6, "end": 1077.28, "text": "oder das andere so wahnsinnig viel besser ist es hat alles seine vorteile der eine große"}, {"id": 171, "start": 1077.28, "end": 1082.32, "text": "vorteil von obuntu ist dass sie halt einmal ihre lts geschichten damit mit relativ aktueller"}, {"id": 172, "start": 1082.32, "end": 1087.32, "text": "software wo teilweise debian schon wirklich richtig alt ist aber auf der anderen seite"}, {"id": 173, "start": 1087.32, "end": 1091.12, "text": "es macht keinen großen unterschied ganz ehrlich so der unterschied zwischen obuntu server und"}, {"id": 174, "start": 1091.12, "end": 1102.28, "text": "debian ist jetzt nicht so wirklich groß was denn für des tops also wenn du wenn du was"}, {"id": 175, "start": 1102.28, "end": 1108.28, "text": "haben willst was obuntu based ist ne mint cinnamon wenn du es auf hardware installierst oder oder"}, {"id": 176, "start": 1108.28, "end": 1114.4, "text": "sagen wir mal xf ce mate wenn du es in der vm installierst ansonsten kannst du dir auch mal"}, {"id": 177, "start": 1114.4, "end": 1121.16, "text": "elementary angucken wenn du auf mac os bedienung stehst oder wenn du kein problem mit china linux"}, {"id": 178, "start": 1121.16, "end": 1129.08, "text": "hast dann auch deep in so als einsteiger distribution ich persönlich mach mal kurz ein update ich"}, {"id": 179, "start": 1129.08, "end": 1148.28, "text": "persönlich stehe auf manjaro mit i3 wm ups alter warum kein gnome kannst du machen aber mint hat"}, {"id": 180, "start": 1148.28, "end": 1157.08, "text": "kein gnome mint hat mate das ist ja quasi gnome mint hat xf ce und cinnamon ist cinnamon nicht"}, {"id": 181, "start": 1157.08, "end": 1167.4, "text": "sogar ein gnome shell bin ich mir gar nicht so sicher da bitte es noch vom aufnehmen vom"}, {"id": 182, "start": 1167.4, "end": 1173.16, "text": "letzten video hier lull ich bin gar nicht so sicher ist ob das nicht vielleicht doch eine"}, {"id": 183, "start": 1173.16, "end": 1178.88, "text": "gnome shell ist ich mach mal kurz nebenbei ein update lasst euch mal nicht stören"}, {"id": 184, "start": 1178.88, "end": 1191.08, "text": "exzellent wie das war es schon hatte die bin ich bei mir drauf hast man link nicht dass ich"}, {"id": 185, "start": 1191.08, "end": 1199.64, "text": "mitbekommen hätte dass man mal abdehnen exzellent ok wir kriegen auf der startseite mal neues"}, {"id": 186, "start": 1199.64, "end": 1209.44, "text": "video empfohlen so muss es sein nur zu den manjaro in der vm glaube ich ja richtig warum"}, {"id": 187, "start": 1209.44, "end": 1213.64, "text": "eigentlich ja weil man mit linux manche sachen besser machen kann angenehmer machen kann"}, {"id": 188, "start": 1213.64, "end": 1218.72, "text": "als unter windows ich mache alle möglichen also alles was ich an technik sachen macht"}, {"id": 189, "start": 1218.72, "end": 1222.88, "text": "mache ich eigentlich unter linux sei es microcontroller zeug programmieren sei es mittlerweile auch"}, {"id": 190, "start": 1222.88, "end": 1228.92, "text": "ganz normales dotnet development mache ich unter linux ist einfach für mich viel angenehmer"}, {"id": 191, "start": 1228.92, "end": 1240.56, "text": "als unter windows so und die anderen sachen mache ich auch was hat der für schmerzen"}, {"id": 192, "start": 1240.56, "end": 1246.16, "text": "die anderen sachen mache ich halt unter windows gerade weil halt wenns gerade wenns um spiele"}, {"id": 193, "start": 1246.16, "end": 1255.16, "text": "und solche geschichten geht das mit linux ja öfters mal problem behaftet achso dual"}, {"id": 194, "start": 1255.16, "end": 1262.0, "text": "boot naja gut das größte problem am dual boot ist es gibt zwar also es gibt ein problem"}, {"id": 195, "start": 1262.0, "end": 1268.64, "text": "an dual boot eine eine sache die die dual boot nicht so sinnvoll macht also das problem"}, {"id": 196, "start": 1268.64, "end": 1273.92, "text": "an dual boot ist die zeit die es braucht zu booten weil ich meine im ernst guck mal des"}, {"id": 197, "start": 1273.92, "end": 1279.56, "text": "umschalten zwischen windows und linux ist halt na das dauert zwei sekunden dual boot"}, {"id": 198, "start": 1279.56, "end": 1283.68, "text": "bist du mal vorne weg 30 sekunden mindestens 30 sekunden beschäftigt mit runterfahren"}, {"id": 199, "start": 1283.68, "end": 1292.48, "text": "hochfahren und das nächste was halt nice to have ist"}, {"id": 200, "start": 1292.48, "end": 1301.36, "text": "also brauche ich nicht unter 30 sekunden allein schon windows runterfahren dauert"}, {"id": 201, "start": 1301.36, "end": 1308.2, "text": "dauert 10 sekunden ähm dann musst du dein password eintippen beim booten also ich habe"}, {"id": 202, "start": 1308.2, "end": 1315.2, "text": "mein password voll verschlüsselt dann fahre ich das ding hoch dann lockt er sich im window"}, {"id": 203, "start": 1315.2, "end": 1321.64, "text": "manager ein 30 sekunden 30 sekunden ist denke ich schon mal ganz gut es ist aber im"}, {"id": 204, "start": 1321.64, "end": 1327.68, "text": "prinzip ist es vollkommen egal ob es 20 oder 30 sekunden sind es ist auf jeden fall schneller"}, {"id": 205, "start": 1327.68, "end": 1338.12, "text": "als so so und das andere was auch nicht so schön ist es gibt keine so wirklichen vorteile"}, {"id": 206, "start": 1338.12, "end": 1345.16, "text": "von linux native gebootet versus vm zu dem was ich verwende weil was hätte ich für"}, {"id": 207, "start": 1345.16, "end": 1351.08, "text": "einen vorteil wenn ich jetzt anstatt linux in der vm linux auf dem richtigen auf der"}, {"id": 208, "start": 1351.08, "end": 1357.0, "text": "richtigen hardware laufen lasse der einzige vorteil den ich mir denken könnte ist vielleicht"}, {"id": 209, "start": 1357.0, "end": 1366.52, "text": "habe ich glück dass ich grafikkarte die die grafikkarten decoder verwenden könnte unter"}, {"id": 210, "start": 1366.52, "end": 1371.12, "text": "linux mit dem browser also sprich dass ich weniger cpuauslastung hätte bei youtube videos"}, {"id": 211, "start": 1371.12, "end": 1375.6, "text": "im browser unter linux einmal ganz im ernst wenn es da ein problem ich gucke das gucke"}, {"id": 212, "start": 1375.6, "end": 1381.44, "text": "ich halt youtube unter windows ist jetzt auch nicht so das problem ja das ist eigentlich"}, {"id": 213, "start": 1381.44, "end": 1387.28, "text": "kein vorteil so wirklich mehr performance wenn der pc schlecht ist ja gut wenn du mit"}, {"id": 214, "start": 1387.28, "end": 1390.4, "text": "der übelsten grücke darum krebs dann kann man sich das mal überlegen aber ich habe"}, {"id": 215, "start": 1390.4, "end": 1398.92, "text": "hier nicht umsonst 6 kerne 32 g ram eine schnelle ssd also ich habe ich habe kaum vorteile durch"}, {"id": 216, "start": 1398.92, "end": 1404.76, "text": "du den boot außer dass es dauert so weil was ich jetzt machen kann ist halt ich kann hier"}, {"id": 217, "start": 1404.76, "end": 1409.32, "text": "mein mein mein entwicklungszeug aufmachen und gedöns und shell und und natürlich das"}, {"id": 218, "start": 1409.32, "end": 1414.36, "text": "allerwichtigste auf der welt das ascii aquarium in fullscreen so kann ich jetzt hier unter"}, {"id": 219, "start": 1414.36, "end": 1419.88, "text": "unter linux machen so und wenn ich dann sag aha moment wir spielen jetzt eine runde battlefield"}, {"id": 220, "start": 1419.88, "end": 1423.76, "text": "das spiel ohne battlefield easy das geht sag ich das einfach desktop gewechselt und gut"}, {"id": 221, "start": 1423.76, "end": 1432.32, "text": "ist übrigens ich sag es ja immer wieder warum heißt das eigentlich virtuelle desktops weil"}, {"id": 222, "start": 1432.32, "end": 1438.36, "text": "das einzige was nicht virtuell ist ist der desktop der desktop ist überall gleich bei"}, {"id": 223, "start": 1438.36, "end": 1445.04, "text": "virtuellen desktops also es ist alles außer den desktops außerdem desktop virtuell warum"}, {"id": 224, "start": 1445.04, "end": 1455.08, "text": "nennt man das nicht virtuelle virtuell alles außer desktops oder irgendwie anders kann"}, {"id": 225, "start": 1455.08, "end": 1472.28, "text": "man sich was anderes überlegen für virtuelle desktop passt halt überhaupt nicht ja voller"}, {"id": 226, "start": 1472.28, "end": 1476.76, "text": "zugriff auf den ram ist jetzt für meine linux vm jetzt nicht so das problem weil meine linux"}, {"id": 227, "start": 1476.76, "end": 1487.72, "text": "vm hat 16 gigabyte ram was brauchst du mehr virtuelle arbeitsoberfläche wie heißt denn"}, {"id": 228, "start": 1487.72, "end": 1492.08, "text": "eigentlich unter windows nicht da heißt new desktop und das einzige was halt nicht virtuell"}, {"id": 229, "start": 1492.08, "end": 1498.52, "text": "ist ist tatsächlich der desktop failfisch aber leute ich will euch ich will euch ja nicht"}, {"id": 230, "start": 1498.52, "end": 1504.24, "text": "planten mein wie ging das noch mal auf github ach so man konnte kein darkstream machen wenn"}, {"id": 231, "start": 1504.24, "end": 1514.56, "text": "man das eingeloggt ist kann das sein sauerei viel besser na viel besser ich hoffe ihr seid"}, {"id": 232, "start": 1514.56, "end": 1525.6, "text": "nicht geplendet jetzt und wie gesagt nachdem ich da kaum einen vorteil hätte dadurch dass"}, {"id": 233, "start": 1525.6, "end": 1533.12, "text": "ich linux in native laufen lasst bei mir und dual boot einfach lange dauert zumal überlegt"}, {"id": 234, "start": 1533.12, "end": 1540.56, "text": "mal wenn ich dual boot machen würde da könnte ich ja gar nicht unter windows streamen oder"}, {"id": 235, "start": 1540.56, "end": 1545.8, "text": "hier einfach anschmeißen dann auf linux wechsel hin und her das wird ja gar nicht funktionieren"}, {"id": 236, "start": 1545.8, "end": 1552.08, "text": "was ist heute geplant wir gucken uns einfach nur ein paar sachen an und dann ist gut ich"}, {"id": 237, "start": 1552.08, "end": 1555.92, "text": "bin ziemlich kaputt also ich werde doch nichts großartiges machen ich habe mir nur gedacht"}, {"id": 238, "start": 1555.92, "end": 1560.84, "text": "schweiz gestern nicht on was heute einfach schmeißt einfach mal dein stream an und gut"}, {"id": 239, "start": 1560.84, "end": 1571.76, "text": "ist es gibt es eigentlich so aktuell für github trends ja bei 16 gigabyte ram und dann"}, {"id": 240, "start": 1571.76, "end": 1580.68, "text": "noch vms ne ich habe 16 gigabyte ram in der vm und 32 gigabyte auf dem samt system aber"}, {"id": 241, "start": 1580.68, "end": 1587.4, "text": "auch aber auch mal im ernst aber auch wenn du nur 16 g hast also wenn du nur 16 g auf"}, {"id": 242, "start": 1587.4, "end": 1594.4, "text": "dem host hast das reicht auch kannst auch ohne probleme 8 g auf dem host 8 g in der vm oder"}, {"id": 243, "start": 1594.4, "end": 1599.24, "text": "sogar nur 4 g in der vm je nachdem was du da drin machen willst also ist jetzt ja nicht"}, {"id": 244, "start": 1599.24, "end": 1605.72, "text": "so als kommst du mit einer linux vm und windows im host irgendwie an den limit mit 16 g guckt"}, {"id": 245, "start": 1605.72, "end": 1610.76, "text": "euch das mal an ich habe jetzt gerade mal 20 g auslastung und davon ist die hälfte wahrscheinlich"}, {"id": 246, "start": 1610.76, "end": 1619.68, "text": "irgendwas was im cache rumgammeln und gar nicht verwendet wird ich habe einen 8700 k"}, {"id": 247, "start": 1619.68, "end": 1627.8, "text": "ich hätte gerne 9000 5900 x aber ja der aktuellen hardware situation geschuldet neuen rechner"}, {"id": 248, "start": 1627.8, "end": 1643.6, "text": "bauen ist noch nicht gibt es ja mittlerweile wieder welche"}, {"id": 249, "start": 1643.6, "end": 1649.96, "text": "wir nähern uns wieder normalen preisen kann das sein ach ne machen wir nicht normalerweise"}, {"id": 250, "start": 1649.96, "end": 1658.64, "text": "kostet 599 das kostet 700 alter 100 euro mehr ihr habt sie doch nicht mehr alle ihr habt"}, {"id": 251, "start": 1658.64, "end": 1661.88, "text": "sie doch nicht mal das sehe ich nicht siehst du deswegen habe ich mir noch keinen rechner"}, {"id": 252, "start": 1661.88, "end": 1666.72, "text": "gekauft ich sehe ich sehe das einfach nicht ein aktuell klar könnte ich mir das leisten"}, {"id": 253, "start": 1666.72, "end": 1670.48, "text": "war mache ich aber nicht das sehe ich nicht ein also den scheiß habe ich keinen bock"}, {"id": 254, "start": 1670.48, "end": 1673.92, "text": "zumal man ja auch mal ehrlich sagen muss mein rechner den ich jetzt habe der ist ja nicht"}, {"id": 255, "start": 1673.92, "end": 1683.96, "text": "schlecht ich meine 32 g ram ein 8700 k bissl übertaktet wo aktuell nicht übertaktet 6"}, {"id": 256, "start": 1683.96, "end": 1691.88, "text": "kerne ssd das ist ja nicht schlecht oder so das gehört bestimmt immer noch zu den top"}, {"id": 257, "start": 1691.88, "end": 1698.08, "text": "fünf prozent der systemen dies aktuell gibt wenn du chrome benutzt dann brauchst du alle"}, {"id": 258, "start": 1698.08, "end": 1706.32, "text": "32 g ram und quatsch ich weiß dass es g bade ist aber so schlimm ist es auch nicht gibt"}, {"id": 259, "start": 1706.32, "end": 1712.6, "text": "es eigentlich für github trends zeigt mal her dass du für eine grafika 1080 t ich habe"}, {"id": 260, "start": 1712.6, "end": 1718.0, "text": "die 2080 übersprung und ich werde mir jetzt 30 90 kaufen wenn ich neuen pc kaufe ich"}, {"id": 261, "start": 1718.0, "end": 1722.0, "text": "weiß ja schon genau was ich rein mache also ich mache in meinen neuen pc kommt ne kommt"}, {"id": 262, "start": 1722.0, "end": 1730.36, "text": "in 5900 x also das ding was man gerade auf geiz hat also ich mache 5900 x rein das ding"}, {"id": 263, "start": 1730.36, "end": 1735.84, "text": "ich mache 39 sich rein weil es geht also ehrlich gesagt ist der hauptsächlich grund weil es"}, {"id": 264, "start": 1735.84, "end": 1745.44, "text": "geht eventuell eventuell wenn die 30 80 ti rausbringen die quasi ähnlich ähnliche"}, {"id": 265, "start": 1745.44, "end": 1753.0, "text": "performance hat bissl schneller in bissl langsamer in höheren auflösungen ok dann greife ich"}, {"id": 266, "start": 1753.0, "end": 1758.68, "text": "vielleicht auch zu 30 80 die dann hätte ich gerne 64 g ram drin einfach weil es geht"}, {"id": 267, "start": 1758.68, "end": 1766.24, "text": "ja und unterlegen halbwegs gescheites mainboard ja also ich rechne mal so mit mit um die 4000"}, {"id": 268, "start": 1766.24, "end": 1772.32, "text": "euro für den neuen pc aber ich sehe es halt nicht ein jetzt zu kaufen und und noch mal"}, {"id": 269, "start": 1772.32, "end": 1778.24, "text": "1000 euro drauf zu legen das ist total für den arsch mal guck mal ich glaube ich glaube"}, {"id": 270, "start": 1778.24, "end": 1784.6, "text": "der preis passt sich mittlerweile halbwegs wieder an das geht ja mittlerweile schon wieder"}, {"id": 271, "start": 1784.6, "end": 1788.92, "text": "halbwegs wobei man halt sagen muss 1600 euro für eine grafika aber mal im ernst wenn du"}, {"id": 272, "start": 1788.92, "end": 1794.76, "text": "die auswahl hast zwischen hast du eine wasserkühlung ne ich bin kein kein großartiger wasserkühlungs"}, {"id": 273, "start": 1794.76, "end": 1804.8, "text": "fern wenn du die auswahl hast zwischen na 30 90 geht in eine rtx 30 90 ohne neuen iphone"}, {"id": 274, "start": 1804.8, "end": 1810.96, "text": "mit 256 g was kaufste dann chat was würdet ihr kaufen also ich würde die grafikkarte"}, {"id": 275, "start": 1810.96, "end": 1821.16, "text": "kaufen sage ich euch ganz ganz klar ich gebe zu bescheuern der vergleich beides ehrlich"}, {"id": 276, "start": 1821.16, "end": 1826.2, "text": "gesagt preisleistungsmäßig überhaupt nicht angemessen aber ich würde die grafikkarte"}, {"id": 277, "start": 1826.2, "end": 1839.44, "text": "kaufen fortnight skins das natürlich auch eine variante kann man auch machen zwei produkte"}, {"id": 278, "start": 1839.44, "end": 1846.44, "text": "in der vergleich liste was so das war mal irgendwie ultra teuren mainboards ja also"}, {"id": 279, "start": 1846.44, "end": 1855.8, "text": "ich will mir die gpu kaufen ach ja hier ich weiß ich hast du was zur virtualisierung"}, {"id": 280, "start": 1855.8, "end": 1863.0, "text": "gefragt ach so vor allem workstation ja ja vor allem workstation ich habe mir sogar"}, {"id": 281, "start": 1863.0, "end": 1870.4, "text": "letztens ein cd key gekauft gekauft wohlgemerkt und jetzt keine porsche irgendwie ernsthaft"}, {"id": 282, "start": 1870.4, "end": 1875.44, "text": "gekauft denn vor allem workstation 16 pro key habe ich mir letztens gekauft und zwar"}, {"id": 283, "start": 1875.44, "end": 1891.92, "text": "bei software bei software kong sogar billiger ich glaube damals hat es nur 16 euro gekostet"}, {"id": 284, "start": 1891.92, "end": 1896.8, "text": "oder so software kong also wenn das nicht eine vertrauenswürdige sache ist dann weiß"}, {"id": 285, "start": 1896.8, "end": 1907.68, "text": "ich auch nicht warum ist hier neben mit fingerabdruck exzellent software kong ich mache aber keine"}, {"id": 286, "start": 1907.68, "end": 1912.84, "text": "werbung für software kong ich wollte euch bloß mal kurz zeigen wenn ich die nächste"}, {"id": 287, "start": 1912.84, "end": 1919.68, "text": "mal müssen die nächsten mal müssen die mich bezahlen für das zeige findet ihr nicht"}, {"id": 288, "start": 1919.68, "end": 1928.4, "text": "auch dass es echt vertrauenswürdige seite ist ich finde ich finde schon ich finde ist"}, {"id": 289, "start": 1928.4, "end": 1937.4, "text": "ist nah dran am offiziellen shop man darf halt nicht vergessen offiziell offiziell kostet"}, {"id": 290, "start": 1937.4, "end": 1951.24, "text": "der kram glaube ich 240 euro oder so 220 euro also man muss es nicht übertreiben ach ja"}, {"id": 291, "start": 1951.24, "end": 1954.04, "text": "übrigens ob der key funktioniert kann ich euch nicht sagen weil ich habe immer noch"}, {"id": 292, "start": 1954.04, "end": 1958.2, "text": "vor allem bei workstation 15 ich habe den key nur gekauft weil er gerade günstiger war"}, {"id": 293, "start": 1958.2, "end": 1967.0, "text": "und irgendwie um 16 euro gekostet hat support laufzeit kannst du übrigens komplett knicken"}, {"id": 294, "start": 1967.0, "end": 1976.08, "text": "braucht kein mensch wer braucht dafür support ja was wollen die ich will keine so gibt es"}, {"id": 295, "start": 1976.08, "end": 1985.2, "text": "auch so gibt es auch support stufe keine ach guck mal ich könnte auch upgraden ich könnte"}, {"id": 296, "start": 1985.2, "end": 1996.2, "text": "auch upgraden von 15 ne aber das sehe ich nicht ein er ist zu teuer zeig mal bitte dein"}, {"id": 297, "start": 1996.2, "end": 1997.2, "text": "heizungsmonitoring"}, {"id": 298, "start": 1997.2, "end": 2007.56, "text": "habe ich euch eigentlich in letzter zeit schon mal gezeigt wie ich meine heizung überwache"}, {"id": 299, "start": 2007.56, "end": 2016.04, "text": "zum beispiel kann man gerade sehen dass die pumpe in der heizung grad 35 prozent am pumpen"}, {"id": 300, "start": 2016.04, "end": 2021.2, "text": "ist weil wir heizung an haben im ganzen haus muss warmwasser rumpumpen man sieht dass das"}, {"id": 301, "start": 2021.2, "end": 2027.36, "text": "abgas aktuell auf 44 grad ist dass der brenner am brennen ist die kessel temperatur bei 44"}, {"id": 302, "start": 2027.36, "end": 2040.76, "text": "grad liegt und die abgas temperatur die wassertemperatur aktuell so zwischen 47 55 48 grad schwankt"}, {"id": 303, "start": 2040.76, "end": 2052.08, "text": "es hat keine keine fehler praktisch ich glaube ich speichere das mal gucken wie lange ich"}, {"id": 304, "start": 2052.08, "end": 2057.16, "text": "das speicher ich speichere das ja tatsächlich schon ein bisschen glaube ich speichere das"}, {"id": 305, "start": 2057.16, "end": 2065.96, "text": "einen monat oder so zwei monate weiß gar nicht wie viel wie lange ich den kram aufhebe"}, {"id": 306, "start": 2065.96, "end": 2083.8, "text": "ja heizungsüberwachung exzellent so muss das sein wie kommst du an deine daten nachdem"}, {"id": 307, "start": 2083.8, "end": 2088.2, "text": "ich die leute jetzt nicht nerven will dem ich immer das gleiche erzähle ich werde es noch"}, {"id": 308, "start": 2088.2, "end": 2093.2, "text": "mal ganz ich werde es noch mal ganz kurz umreißen wie ich das mache weil ich habe das jetzt"}, {"id": 309, "start": 2093.2, "end": 2097.28, "text": "schon oft erzählt also ich habe den raspberry pi unten im keller hängen an der heizung"}, {"id": 310, "start": 2097.28, "end": 2101.52, "text": "das ist eine wiesmann heizung und damit du das ganze auslesen kannst brauchst du ein"}, {"id": 311, "start": 2101.52, "end": 2107.52, "text": "wiesmann opto link kabel das kannst du ja entweder selbst bauen auf ebay kaufen oder"}, {"id": 312, "start": 2107.52, "end": 2114.76, "text": "das offizielle kaufen offizielle kostet hier gerade 70 euro was viel zu viel ist das ist"}, {"id": 313, "start": 2114.76, "end": 2119.92, "text": "im prinzip ein stick noch mal das usb kabel mit zwei infrarot leds obendran ja also überhaupt"}, {"id": 314, "start": 2119.92, "end": 2125.28, "text": "nichts überhaupt nichts dolles und das gibt es auch oftmals deutlich billiger auf ebay"}, {"id": 315, "start": 2125.28, "end": 2130.6, "text": "aber so ein kabel brauchst du oder selbst bauen gibt es auch anleitungen für dann brauchst"}, {"id": 316, "start": 2130.6, "end": 2141.76, "text": "du ein raspberry pi 0 mit mit wie control d auf github also von github das ding hier"}, {"id": 317, "start": 2141.76, "end": 2147.28, "text": "und das ist das teil was kommuniziert mit der heizung da sind die meisten sachen schon"}, {"id": 318, "start": 2147.28, "end": 2152.36, "text": "drinnen die meisten wiesmann heizung sind vorkonfiguriert muss man auswählen was man"}, {"id": 319, "start": 2152.36, "end": 2157.48, "text": "haben will und das macht dann diese kommunikation mit diesem opto link kabel jede heizung hat"}, {"id": 320, "start": 2157.48, "end": 2162.36, "text": "ja vorne so einen stecker wo man das hier sowas wo man das dran steckt so sieht das"}, {"id": 321, "start": 2162.36, "end": 2169.28, "text": "dann aus ja und da bekomme ich die daten her da musste die daten noch umwursten so dass"}, {"id": 322, "start": 2169.28, "end": 2178.52, "text": "grafana versteht aber das ist dann was individuelles warum lässt du dich einfach unter dem diagramm"}, {"id": 323, "start": 2178.52, "end": 2183.32, "text": "die aktuellen werte anzeigen könnte ich auch machen das sieht so aus weil ich das vor"}, {"id": 324, "start": 2183.32, "end": 2187.88, "text": "einem jahr oder so mal so eingerichtet habe und seitdem nichts mehr gemacht habe ich kann"}, {"id": 325, "start": 2187.88, "end": 2192.32, "text": "da sicherlich noch einiges einiges machen man hier siehst ja die aktuellen werte ehrlich"}, {"id": 326, "start": 2192.32, "end": 2197.44, "text": "gesagt interessiert mich hauptsächlich die wassertemperatur weil die ursprüngliche"}, {"id": 327, "start": 2197.44, "end": 2203.52, "text": "sache warum ich das überhaupt gebaut habe war weil die heizung ausserzer hatte und wir"}, {"id": 328, "start": 2203.52, "end": 2208.76, "text": "sind ja auch drauf gekommen woran das ganze lag da war wohl der interne kontrol zumindest"}, {"id": 329, "start": 2208.76, "end": 2212.24, "text": "meinte der heizungs mann das vielleicht wollte er uns auch einfach auf was neues für ein"}, {"id": 330, "start": 2212.24, "end": 2217.04, "text": "paar hundert euro verkaufen irgendwie der interne steuerung controller war im arsch"}, {"id": 331, "start": 2217.04, "end": 2221.84, "text": "hat er gesagt kann mir viel erzählen wenn der tag lang ist ich habe keine möglichkeit"}, {"id": 332, "start": 2221.84, "end": 2227.68, "text": "das zu überprüfen vielleicht hat er mich einfach auch nur jebaited und wirklichkeit"}, {"id": 333, "start": 2227.68, "end": 2235.84, "text": "war gar nix was aber witzig war der wollte mir dann auch gleich noch der heizungs der"}, {"id": 334, "start": 2235.84, "end": 2240.24, "text": "heißt der heizungs stonks mann wollte mir auch gleich noch die offizielle wiesmann"}, {"id": 335, "start": 2240.24, "end": 2246.8, "text": "lösung aufschwätzen zum smart monitoring der heizung da habe ich dann mein ipad raus"}, {"id": 336, "start": 2246.8, "end": 2252.0, "text": "geholt beziehungsweise unten das ipad was da liegt habe ich das habe ich das die webseite"}, {"id": 337, "start": 2252.0, "end": 2256.68, "text": "aufgemacht habe gesagt hier gucke mal brauche ich nett so sieht meine heizungsüberwachung"}, {"id": 338, "start": 2256.68, "end": 2262.72, "text": "aus und da hat er gemeint ja aber mit der offiziellen wiesmann heizungsüberwachung"}, {"id": 339, "start": 2262.72, "end": 2270.24, "text": "dann würde er auch eher immer direkt sehen was meine heizung für für probleme hat ja"}, {"id": 340, "start": 2270.24, "end": 2274.56, "text": "da kann das kann ich verschmerzen das kann ich verschmerzen wenn er das nicht direkt"}, {"id": 341, "start": 2274.56, "end": 2282.2, "text": "sieht ist schon ok ich rufe dir an wenn was ist zumindest wisst ihr was das geile ist"}, {"id": 342, "start": 2282.2, "end": 2290.0, "text": "wisst ihr was das geile ist jetzt ist es so dass das offizielle wiesmann ding zur heizungs"}, {"id": 343, "start": 2290.0, "end": 2295.96, "text": "monitoring ist eingestellt das gibt es nicht mehr das verkaufen die nicht mehr also ich"}, {"id": 344, "start": 2295.96, "end": 2302.84, "text": "hätte irgend so eine legacy technologie da am hals gehabt jetzt welche db benutzt du"}, {"id": 345, "start": 2302.84, "end": 2323.52, "text": "für grafana das prometheus das ist da ist prometheus drunter"}, {"id": 346, "start": 2323.52, "end": 2335.0, "text": "ich mache das meiste an monitoring hier mit prometheus deswegen das hier auch ja zum"}, {"id": 347, "start": 2335.0, "end": 2344.56, "text": "beispiel wann die zertifikate ablaufen ist auch mit prometheus läuft übrigens bald"}, {"id": 348, "start": 2344.56, "end": 2357.88, "text": "ab man unify controller läuft in 23 tagen das zertifikat ab saurei soll das denn was"}, {"id": 349, "start": 2357.88, "end": 2362.72, "text": "ist der unterschied zwischen prometheus influx db influx db ist ein time series database"}, {"id": 350, "start": 2362.72, "end": 2367.24, "text": "prometheus ist ein time series database die eigentlich dafür mit mit monitoring infrastruktur"}, {"id": 351, "start": 2367.24, "end": 2377.96, "text": "drum herum da sind eigentlich zwei unterschiedliche geschichten prometheus gibt es beispielsweise"}, {"id": 352, "start": 2377.96, "end": 2383.92, "text": "auch ganz viele fertige checks und agents die gucken wann laufen zertifikate ab wie"}, {"id": 353, "start": 2383.92, "end": 2393.76, "text": "ist die filesystem auslastung und sowas ja genau so sieht so sieht es aus so schaut"}, {"id": 354, "start": 2393.76, "end": 2403.4, "text": "eine heizungsüberwachung aus genau nur weil es der chat wieder mal sehen wollte"}, {"id": 355, "start": 2403.4, "end": 2413.88, "text": "excellent youtube video incoming könnte ich ich glaube das ist eigentlich ohne scheiß"}, {"id": 356, "start": 2413.88, "end": 2418.52, "text": "das ist eine gute idee weil ich finde sowas macht optisch auch ein bisschen was her wenn"}, {"id": 357, "start": 2418.52, "end": 2423.84, "text": "ich einfach erkläre wie ich das gemacht habe dann sagen die leute wieder massiv hier big"}, {"id": 358, "start": 2423.84, "end": 2428.32, "text": "brain ja die meisten leute schreiben dann wieder so kommentare wie ich habe zwar keine"}, {"id": 359, "start": 2428.32, "end": 2433.16, "text": "ahnung was der max in seinem video erzählt aber aber ich finde es trotzdem cool oder"}, {"id": 360, "start": 2433.16, "end": 2437.0, "text": "sowas in der richtung aber vielleicht finden es auch wirklich ein paar leute interessant"}, {"id": 361, "start": 2437.0, "end": 2452.88, "text": "falls sowas bauen wollen ja wusste ich auch nicht wie gesagt ich habe keine wasserkühlung"}, {"id": 362, "start": 2452.88, "end": 2460.4, "text": "ich habe keine wasserkühlung ich mag keine wasserkühlung so ich wollte mal kurz gucken"}, {"id": 363, "start": 2460.4, "end": 2465.68, "text": "was trendet denn was trendet denn so oft getappt zeigt doch mal her wo wir gerade dabei sind"}, {"id": 364, "start": 2465.68, "end": 2475.52, "text": "moin lois plois hast du noch weitere raspberry pies in verwendung ja und ich habe auch irgendwo"}, {"id": 365, "start": 2475.52, "end": 2482.56, "text": "ein textdokument wo drin steht welche weil ich das öfters gefragt werde und jedes mal"}, {"id": 366, "start": 2482.56, "end": 2493.0, "text": "wenn ich das textdokument suche finde ich es nicht was witzig ist weil eigentlich so"}, {"id": 367, "start": 2493.0, "end": 2507.16, "text": "langsam müsste ich mir mal merken was könnte das sein test doc ist das auf der alten vm"}, {"id": 368, "start": 2507.16, "end": 2516.04, "text": "ernsthaft wirklich ich finde ich finde es ja witzig dass der dass der chat besser weiß"}, {"id": 369, "start": 2516.04, "end": 2521.32, "text": "wo ich meine sachen habe als ich selbst ok mal gucken ob der chat recht hat der chat"}, {"id": 370, "start": 2521.32, "end": 2539.6, "text": "ist ja bekanntlich bekanntlichermaßen massive iq tier schaue ob das tests da ist es heißt"}, {"id": 371, "start": 2539.6, "end": 2548.84, "text": "so ein bisschen anders es heißt pysp warum auch immer aber der chat wusste dass ich"}, {"id": 372, "start": 2548.84, "end": 2553.32, "text": "auf der alten vm habe das ist aber übrigens nicht so ganz aktuell was da drin steht also"}, {"id": 373, "start": 2553.32, "end": 2559.28, "text": "ich habe einen raspberry pie mit der kamera fürs hof tor dran das ist ein raspberry pie"}, {"id": 374, "start": 2559.28, "end": 2567.88, "text": "0w mit mit wlan ich habe den 0w mit unten im keller für die heizungssteuerung da macht"}, {"id": 375, "start": 2567.88, "end": 2576.32, "text": "übrigens nicht nur wirklich heizungssteuerung der macht auch das w steht für wireless ja"}, {"id": 376, "start": 2576.32, "end": 2582.04, "text": "der macht auch noch luftfeuchtigkeitssensor und so gedöns im keller weil keller ist bei"}, {"id": 377, "start": 2582.04, "end": 2587.44, "text": "uns saumäßig hohe luftfeuchtigkeit drin dann habe ich ein octopie für den 3d drucker"}, {"id": 378, "start": 2587.44, "end": 2591.64, "text": "dann habe ich als singleboard computer noch ein odroid hc2 das ist übrigens richtig cool"}, {"id": 379, "start": 2591.64, "end": 2603.84, "text": "das ding das ist ja so so ein teil also deutlich kleiner als ein raspberry pie allerdings"}, {"id": 380, "start": 2603.84, "end": 2608.88, "text": "mit einem gehäuse wo man eine festplatte rein machen kann oder eine ssd oder was auch immer"}, {"id": 381, "start": 2608.88, "end": 2616.0, "text": "das ist ganz cool das habe ich drüben im einsatz zum fernsehprogramm aufnehmen und abspielen"}, {"id": 382, "start": 2616.0, "end": 2622.04, "text": "im wohnzimmer dann habe ich raspberry pie 3 als unify controller hier habe ich raspberry"}, {"id": 383, "start": 2622.04, "end": 2627.88, "text": "pie 4 neben mir stehen für so testsachen die wir immer im stream machen genau und"}, {"id": 384, "start": 2627.88, "end": 2632.04, "text": "dann habe ich noch ein paar esps und gedöns am start aber das müssen wir jetzt ja nicht"}, {"id": 385, "start": 2632.04, "end": 2638.48, "text": "noch hier näher näher ausführen alles und es kann durchaus sein dass ich mittlerweile"}, {"id": 386, "start": 2638.48, "end": 2647.2, "text": "noch wo ein hab und kann ich dran denke gar nicht sicher habe ich noch irgendwo einen"}, {"id": 387, "start": 2647.2, "end": 2655.84, "text": "ich glaube nicht ich habe noch ein paar auf vorrat wenn ich was wenn ich welche brauche"}, {"id": 388, "start": 2655.84, "end": 2660.88, "text": "also sollte mal irgendwie wieder was cooles anstehen hätte ich noch welche ich habe sogar"}, {"id": 389, "start": 2660.88, "end": 2665.2, "text": "noch raspberry pie 2 übrig und alles ding aber den kannst du nicht gut gebrauchen weil"}, {"id": 390, "start": 2665.2, "end": 2671.68, "text": "er hat kein wlan und im prinzip sagt so ziemlich alles ohne wlan also ich wollte mal kurz durch"}, {"id": 391, "start": 2671.68, "end": 2677.2, "text": "gucken was trendet denn aktuell gerade auf github oder oder wie die coolen leute sagen"}, {"id": 392, "start": 2677.2, "end": 2691.36, "text": "github also react server juckt mich nicht um was um im maps me offline open street maps"}, {"id": 393, "start": 2691.36, "end": 2696.56, "text": "maps für ios ok wüsste jetzt nicht wozu ich das brauche außer dass es offline ist"}, {"id": 394, "start": 2696.56, "end": 2703.76, "text": "aber ich habe meine wander app drauf und ich habe google maps das reicht mir eigentlich"}, {"id": 395, "start": 2703.76, "end": 2713.72, "text": "nicht github nicht github jit jithub was übrigens komplett verkehrt ist man spricht"}, {"id": 396, "start": 2713.72, "end": 2720.0, "text": "das git aus und ich und ich jit aber es gibt ja auch leute die sagen gyra oder java oder"}, {"id": 397, "start": 2720.0, "end": 2729.76, "text": "oder jiff oder was auch immer noch was maps mir würde verkaufen deswegen kriegen sich"}, {"id": 398, "start": 2729.76, "end": 2755.44, "text": "alle auf echt please update your app review ok es sind es sind alle aber auf was machen"}, {"id": 399, "start": 2755.44, "end": 2772.8, "text": "die da wieder mail punkt r u a die gekommen sind am start sehe ich das richtig exzellent"}, {"id": 400, "start": 2772.8, "end": 2777.84, "text": "oder oder anstatt ubuntu ja stimmt das habe ich auch ganz vergessen oder anstatt ubuntu"}, {"id": 401, "start": 2777.84, "end": 2783.84, "text": "jubantu jubantu ist auch ganz beliebt ja also was haben wir sonst noch zu bieten an aktuellen"}, {"id": 402, "start": 2783.84, "end": 2791.16, "text": "cross platform customizable science fiction terminal emulator ich will kein science fiction"}, {"id": 403, "start": 2791.16, "end": 2796.12, "text": "terminal emulator ich will einfach ein terminal emulator der gut funktioniert und der muss"}, {"id": 404, "start": 2796.12, "end": 2809.88, "text": "auch nicht ehrlich ehrlich gesagt muss der auch nicht in java script sein was ist das"}, {"id": 405, "start": 2809.88, "end": 2820.88, "text": "3 3 7 hast aber schnell gemerkt ok das ist wahrscheinlich irgend so ein gag oder weil"}, {"id": 406, "start": 2820.88, "end": 2831.92, "text": "da hast ja auch schon gleich hier matrix bildschirm schon eingebaut ganz wichtig wie lang wie"}, {"id": 407, "start": 2831.92, "end": 2841.88, "text": "viel neue programmier sprachen im jahr gibt es so auf github 50 ok und warum braucht man"}, {"id": 408, "start": 2841.88, "end": 2862.4, "text": "wie lang wie sie ok man kann tetris drin bauen exzellent guck mal es hat ein ui framework"}, {"id": 409, "start": 2862.4, "end": 2875.0, "text": "dabei ok das ist natürlich schon mal ganz nice aber man sieht halt schon man sieht"}, {"id": 410, "start": 2875.0, "end": 2885.08, "text": "halt schon auf der vorschau dass das font rendering sagt ich das mal an wobei ich habe"}, {"id": 411, "start": 2885.08, "end": 2891.6, "text": "nichts gesagt das font rendering ist gut das sah nur in der vorschau kacke aus das ist"}, {"id": 412, "start": 2891.6, "end": 2898.56, "text": "tatsächlich ganz in ordnung guck mal wieder mal was neues für cross platform ui aber"}, {"id": 413, "start": 2898.56, "end": 2909.08, "text": "wahrscheinlich aber wahrscheinlich ohne die wichtigsten sachen ne das ist anscheinend"}, {"id": 414, "start": 2909.08, "end": 2921.92, "text": "cross platform für alles mögliche für das gibt es für windows windows mac linux ja eigentlich"}, {"id": 415, "start": 2921.92, "end": 2925.76, "text": "eine coole sache wie gesagt es gibt ja leider zu wenig cross platform gui geschichten die"}, {"id": 416, "start": 2925.76, "end": 2931.8, "text": "ordentlich funktionieren aber es wird wahrscheinlich alles wichtige fehlen was man für ein richtig"}, {"id": 417, "start": 2931.8, "end": 2935.36, "text": "gutes cross platform gui framework braucht es wird wahrscheinlich kein web view haben"}, {"id": 418, "start": 2935.36, "end": 2944.08, "text": "ich habe nichts gesagt es hat direkt web view am anfang und wahrscheinlich auch keine möglichkeit"}, {"id": 419, "start": 2944.08, "end": 2951.16, "text": "irgendwelchen 3d content rein zu rendern aber es ist ja auch alpha software es gibt halt"}, {"id": 420, "start": 2951.16, "end": 2956.88, "text": "keine gescheiten cross platform frameworks es gibt cute das problem an cute ist es c plus"}, {"id": 421, "start": 2956.88, "end": 2965.16, "text": "plus und alles was in c plus plus ist sagt prinzipiell weil es c plus plus ist ich hoffe"}, {"id": 422, "start": 2965.16, "end": 2969.48, "text": "wir sind uns einig chat sonst müssen wir wieder von vorne anfangen sonst müssen wir wieder"}, {"id": 423, "start": 2969.48, "end": 2976.48, "text": "mit der riesen langen diskussion anfangen warum c plus plus sagt und die zweite alternative"}, {"id": 424, "start": 2976.48, "end": 2982.76, "text": "ist halt nur mal electron und das hast du eine web anwendung die erste mal 400 mb ram braucht"}, {"id": 425, "start": 2982.76, "end": 2991.36, "text": "für einen text editor ja in zukunft und das ist das warum ich flatter persönlich sehr"}, {"id": 426, "start": 2991.36, "end": 3000.12, "text": "nice finde in zukunft wird vielleicht flatter mal richtig gut und das auch auf dem desktop"}, {"id": 427, "start": 3000.12, "end": 3006.92, "text": "wohlgemerkt da bin ich echt gespannt drauf ja dieses ganze dotnet samarin gezeugt kannst"}, {"id": 428, "start": 3006.92, "end": 3012.88, "text": "du vergessen zumal zumal das schon beispielsweise linux als target gar nicht richtig gescheit"}, {"id": 429, "start": 3012.88, "end": 3019.0, "text": "supportet ist und dann auch nur mit gtk als zwischenstep und so ganz ganz merkwürdiger"}, {"id": 430, "start": 3019.0, "end": 3034.36, "text": "zeug und man hofft ja dass microsoft jetzt mit mit maui heißt das glaube ich ein gescheites"}, {"id": 431, "start": 3034.36, "end": 3042.92, "text": "cross platform gui framework rausbringt aber ich glaube ja nicht dass das ein gescheites"}, {"id": 432, "start": 3042.92, "end": 3051.52, "text": "cross platform gui framework sein wird weil das basiert wohl auf dem gleichen kram wie"}, {"id": 433, "start": 3051.52, "end": 3057.96, "text": "samarin und samarin sackt auf dem desktop ja also bleibt cute und electron übrig und"}, {"id": 434, "start": 3057.96, "end": 3062.36, "text": "vielleicht in zukunft flatter also flatter ist da wohl mit eindeutig die beste alternative"}, {"id": 435, "start": 3062.36, "end": 3069.72, "text": "zu weil electron zwar einfach zu entwickeln aber irgendwann ist er auch mal gut mit noch"}, {"id": 436, "start": 3069.72, "end": 3075.6, "text": "mehr browser auf dem desktop und cute ist c++ und damit schon mal prinzipiell kacke so"}, {"id": 437, "start": 3075.6, "end": 3079.52, "text": "die zwei die zwei sachen hast du zur auswahl was ziemlich sagt ich habe jetzt ich habe"}, {"id": 438, "start": 3079.52, "end": 3083.92, "text": "jetzt letztens gesehen dass leute sogar anfangen schon game engines zu verwenden für cross"}, {"id": 439, "start": 3083.92, "end": 3097.52, "text": "platform gui frameworks weil es nicht gescheites gibt also so weit sind wir schon wir hatten"}, {"id": 440, "start": 3097.52, "end": 3105.28, "text": "noch letztens wir hatten noch letztens sogar einen im chat hier der meinte dass er seine"}, {"id": 441, "start": 3105.28, "end": 3116.2, "text": "letzte android schrägstrich cross platform gui app mit godot godot oder wie man das"}, {"id": 442, "start": 3116.2, "end": 3127.48, "text": "ausspricht gemacht hat und das wohl ganz gut funktionieren muss da kannst du auch rate"}, {"id": 443, "start": 3127.48, "end": 3133.2, "text": "tracing für fürs font rendering machen ja sowas was haben wir da noch für trends auf"}, {"id": 444, "start": 3133.2, "end": 3141.36, "text": "github dies ist es heute nur ist es heute ah today deep learning projects okay lang juckt"}, {"id": 445, "start": 3141.36, "end": 3149.04, "text": "mich nicht bärt es gibt bärt von google bärt bärt von google research gibt's 10 wird niemals"}, {"id": 446, "start": 3149.04, "end": 3154.96, "text": "verschwinden das ist auch ok aber c++ kann ruhig verschwinden bärt tensorflore pretrained"}, {"id": 447, "start": 3154.96, "end": 3168.28, "text": "models vor bärt ok was genau ist bärt bärt ich habe keine ahnung was bärt ist es sieht"}, {"id": 448, "start": 3168.28, "end": 3172.52, "text": "übelst big brain scientific aus aber ich habe keine ahnung was bärt ist was ist bärt"}, {"id": 449, "start": 3172.52, "end": 3190.52, "text": "es hat schon mal guten namen react gedöns ok machine learning open source re implementation"}, {"id": 450, "start": 3190.52, "end": 3199.56, "text": "of roller coaster tycoon 2 wusste du wusstet ihr dass das erste roller coaster tycoon komplett"}, {"id": 451, "start": 3199.56, "end": 3211.48, "text": "in assembler programm oder zu 95 prozent in assembler programmiert war wieso ist c++"}, {"id": 452, "start": 3211.48, "end": 3216.08, "text": "so schlecht im vergleich zu anderen spanern root bite ich weiß genau dass du mich eigentlich"}, {"id": 453, "start": 3216.08, "end": 3222.16, "text": "nur tschie baiten willst weil du bist öfters da und du hast garantiert schon meine c++"}, {"id": 454, "start": 3222.16, "end": 3237.2, "text": "friends gehört und ich habe eigentlich keinen bock halt wieder davon anzufangen warum kein"}, {"id": 455, "start": 3237.2, "end": 3244.84, "text": "command glaube weil es noch keiner geklippt hat ja mal gucken ist das in welcher sprache"}, {"id": 456, "start": 3244.84, "end": 3272.36, "text": "haben sie das gemacht source android wenn das jetzt c++ ist dann krieg ich anfälle"}, {"id": 457, "start": 3272.36, "end": 3283.36, "text": "es ist c++ was sonst muss das sein müsste die welt immer so quälen ja jeder gute wechler"}, {"id": 458, "start": 3283.36, "end": 3297.82, "text": "es machen würde genau deswegen machst du auch so viel in c++ so was gibt es denn sonst"}, {"id": 459, "start": 3297.82, "end": 3303.86, "text": "noch schönes also generell muss man eins sagen man kann also ich würde ja gerne wetten"}, {"id": 460, "start": 3303.86, "end": 3309.16, "text": "abschließen auf github trends patrick ich wusste dass du das sagst ich wusste dass"}, {"id": 461, "start": 3309.16, "end": 3315.64, "text": "du das sagst weil es gab ja gar nicht viel auswahl jetzt als antwort ich wusste dass"}, {"id": 462, "start": 3315.64, "end": 3320.12, "text": "du du konntest entweder sagen so nach dem wortel ja big brain oder ja ich bin kein guter"}, {"id": 463, "start": 3320.12, "end": 3325.44, "text": "entwickler ja ich auch nicht sieht man ja ich habe sie im stream oft genug probiert ein"}, {"id": 464, "start": 3325.44, "end": 3332.52, "text": "bisschen c++ und ich bin jedes mal verzweifelt an irgendwelchen c++ besonderheiten gibt es"}, {"id": 465, "start": 3332.52, "end": 3338.56, "text": "eigentlich irgendwelche bekannten spiele die in sie scharp entwickelt sind ja zum beispiel"}, {"id": 466, "start": 3338.56, "end": 3356.16, "text": "heartstone ziemlich viele also quasi alles was unity ist und unity ist ganz schön viel"}, {"id": 467, "start": 3356.16, "end": 3361.24, "text": "die auf letztes glaube ich in c++ ja das wundert mich auch nicht die chinesen sind ja schmerzfrei"}, {"id": 468, "start": 3361.24, "end": 3365.56, "text": "die chinesen juckt auch nicht wenn wenn 50 prozent der programmierer sterben bis zur"}, {"id": 469, "start": 3365.56, "end": 3372.0, "text": "fertigstellung des produktes den egal da kann ich auf c++ verwenden das ist eine sehr gute"}, {"id": 470, "start": 3372.0, "end": 3383.0, "text": "frage hier"}, {"id": 471, "start": 3383.0, "end": 3386.64, "text": "welche programmiersprache würdet ihr als erstes empfehlen da kann man eigentlich nicht"}, {"id": 472, "start": 3386.64, "end": 3394.72, "text": "so ein gemeintes des kommt ganz entscheidend darauf an ultra lauch prings exzellent also"}, {"id": 473, "start": 3394.72, "end": 3404.52, "text": "ultra lauch es kommt darauf an was du machen willst wenn du ja was willst du machen also"}, {"id": 474, "start": 3404.52, "end": 3412.64, "text": "es kommt drauf an wenn du sachen web anwendung machen willst dann ist pyson nicht unbedingt"}, {"id": 475, "start": 3412.64, "end": 3416.64, "text": "das sinnvollste da würde ich eindeutig mit javascript anfangen weil da kannst du zumindest"}, {"id": 476, "start": 3416.64, "end": 3420.88, "text": "das bisschen backend was du brauchst kannst du auch in javascript machen und um javascript"}, {"id": 477, "start": 3420.88, "end": 3428.4, "text": "css html kommst du eh nicht rum wenn du windows desktop anwendung machen willst ist pyson"}, {"id": 478, "start": 3428.4, "end": 3434.72, "text": "auch nicht das beste kommt wirklich ganz entscheidend darauf an was zu machen willst prinzipiell"}, {"id": 479, "start": 3434.72, "end": 3439.64, "text": "würde ich allerdings sagen das beste zum einsteigen ist aktuell wirklich javascript"}, {"id": 480, "start": 3439.64, "end": 3446.68, "text": "mit html und css zusammen weil man kommt heute überhaupt nicht mehr um frontend sachen vorbei"}, {"id": 481, "start": 3446.68, "end": 3451.12, "text": "und ich stelle es mir ein bisschen motivierender vor wenn man eben direkt sieht was passiert"}, {"id": 482, "start": 3451.12, "end": 3460.88, "text": "naja gut wenn du was machen willst was also wenn du jetzt schon weißt mit auto it oder"}, {"id": 483, "start": 3460.88, "end": 3467.84, "text": "bist du bestimmt nicht der einzige also wenn du quasi das machen willst du als berufsvorbereitung"}, {"id": 484, "start": 3467.84, "end": 3472.72, "text": "weil du dann die bessere chancen ausrechnest dann würde ich da nicht zweimal überlegen"}, {"id": 485, "start": 3472.72, "end": 3477.0, "text": "wenn du weißt das wird genau dann lernt das es ist auf jeden fall nicht verkehrt damit"}, {"id": 486, "start": 3477.0, "end": 3486.76, "text": "anzufangen also pyson ist eine super sprache es ist saumäßig viel eingebaut also pyson"}, {"id": 487, "start": 3486.76, "end": 3490.48, "text": "wirklich ein super standard library ich hab letztens mal was mit pyson gemacht und war"}, {"id": 488, "start": 3490.48, "end": 3497.96, "text": "echt begeistert dass die einen ip calculator und einen csv parser mit drinne hatten also"}, {"id": 489, "start": 3497.96, "end": 3504.12, "text": "da konnte ich mich echt nicht beschweren und ja es ist es ist auf jeden fall eine super"}, {"id": 490, "start": 3504.12, "end": 3509.0, "text": "sprache zum einstieg es gibt ein paar dinge die kannst du in pyson nicht wirklich gut"}, {"id": 491, "start": 3509.0, "end": 3515.4, "text": "machen sagen wir zum beispiel desktop gui sachen ja ich mein gehen tut alles mit allem"}, {"id": 492, "start": 3515.4, "end": 3519.92, "text": "irgendwie aber ist jetzt vielleicht nicht so nicht so gut dafür aber gerade was machine"}, {"id": 493, "start": 3519.92, "end": 3525.12, "text": "learning sachen angeht also hat jetzt zwar mit maschinenbau nichts zu tun aber gerade"}, {"id": 494, "start": 3525.12, "end": 3530.28, "text": "im machine learning bereich ist pyson extrem angesagt und im wissenschaftlichen bereich"}, {"id": 495, "start": 3530.28, "end": 3553.0, "text": "auch sehr gut ich habe patrick du willst lachen ich habe auch mit zu ähnlichen dinge angefangen"}, {"id": 496, "start": 3553.0, "end": 3560.6, "text": "damals ich wollte für dark einen bot bauen der die dark war ein mmo was ich damals gespielt"}, {"id": 497, "start": 3560.6, "end": 3566.2, "text": "haben im friseur zusammen weil ich zeige euch mal einen screenshot ihr werdet kringen wenn"}, {"id": 498, "start": 3566.2, "end": 3570.28, "text": "ihr das seht den screenshot oder die screenshots von dem game das sieht halt das ist ein game"}, {"id": 499, "start": 3570.28, "end": 3589.12, "text": "von 2000 von 2002 er sieht halt aus wie ein game von 2002 aber bestes mmo alter bestes"}, {"id": 500, "start": 3589.12, "end": 3600.2, "text": "so sah das aus genau bestes mmo gibt es nix alle leute auf dem porter ja und ich"}, {"id": 501, "start": 3600.2, "end": 3608.48, "text": "wollte auch einen bot basteln denn die spiele hersteller also die entwickler mystic entertainment"}, {"id": 502, "start": 3608.48, "end": 3613.0, "text": "war das glaube ich damals noch bevor sie von ea gekauft wurden die waren der meinung sie"}, {"id": 503, "start": 3613.0, "end": 3622.64, "text": "verbieten das minimieren da wo die häuser gehackt worden sie verbieten es dass man das"}, {"id": 504, "start": 3622.64, "end": 3627.72, "text": "spiel schließt und ich wollte damals den bot für dark programmieren der den chat der"}, {"id": 505, "start": 3627.72, "end": 3632.8, "text": "das chat log passt und im hintergrund für mich sachen macht also ich war ich habe dann"}, {"id": 506, "start": 3632.8, "end": 3637.24, "text": "zum beispiel den chat geschrieben so nach dem motto nächstes lied so sinngemäß ja dann"}, {"id": 507, "start": 3637.24, "end": 3646.04, "text": "im hintergrund mein musik player was angeklickt aber das hat das hat auch schlecht als recht"}, {"id": 508, "start": 3646.04, "end": 3649.44, "text": "funktioniert ja und dann haben sie eingeführt dass man das spiel minimieren darf und dann"}, {"id": 509, "start": 3649.44, "end": 3665.6, "text": "war das komplett useless wird nicht java in der webentwicklung gehätet java wird java"}, {"id": 510, "start": 3665.6, "end": 3674.08, "text": "wird allgemein gehätet aber man muss halt sagen java ist nicht so scheiße wie das wie"}, {"id": 511, "start": 3674.08, "end": 3678.12, "text": "das immer getan wird es gibt wahrscheinlich einfach nur viele unfähige java programmierer"}, {"id": 512, "start": 3678.12, "end": 3686.04, "text": "und viele scheiß java anwendung aber gerade im enterprise umfeld und auch viele webseiten"}, {"id": 513, "start": 3686.04, "end": 3692.44, "text": "backends twitter zum beispiel twitter läuft auf java komplett oder zumindest auf auf"}, {"id": 514, "start": 3692.44, "end": 3707.28, "text": "der java vm weiß ich ob sie selbst in java programmiert haben"}, {"id": 515, "start": 3707.28, "end": 3711.52, "text": "aber im enterprise umfeld ist java saumäßig beliebt und also wie gesagt ich würde ja"}, {"id": 516, "start": 3711.52, "end": 3716.08, "text": "gerne auf github trends wetten denn dann kann man auf zwei sachen wetten oder könnte man"}, {"id": 517, "start": 3716.08, "end": 3720.8, "text": "auf zwei sachen wetten es sind ganz viele machine learning sachen dabei und es sind"}, {"id": 518, "start": 3720.8, "end": 3727.4, "text": "chinesische repos dabei jetzt irgendwie an diesem teil da hier doch guck du kannst darauf"}, {"id": 519, "start": 3727.4, "end": 3734.2, "text": "tippen machine learning und chinesische repos in java weil java ist in china voll am boomen"}, {"id": 520, "start": 3734.2, "end": 3738.36, "text": "ich weiß nicht warum die chinesen also die sind ja die sind ja an sich echt bisschen"}, {"id": 521, "start": 3738.36, "end": 3744.92, "text": "masochistisch veranlagt die machen sachen in c++ und in java also wenn ich die auswahl"}, {"id": 522, "start": 3744.92, "end": 3749.72, "text": "hätte zwischen c++ und java dann ist kein wunder dass ich dann würde ich bei foxconn"}, {"id": 523, "start": 3749.72, "end": 3755.84, "text": "auch vom dach springen also da kannst ja du hast ja eigentlich gar keine auswahl ist ja"}, {"id": 524, "start": 3755.84, "end": 3763.4, "text": "unmenschlich aber wenn ich die okay also jetzt mal ehrlich wenn ich den auswahl wenn ich"}, {"id": 525, "start": 3763.4, "end": 3770.24, "text": "die auswahl zwischen java und c++ hätte dann würde ich mich für java entscheiden aber"}, {"id": 526, "start": 3770.24, "end": 3778.92, "text": "auch nur weil c++ so absoluter bullshit ist und java mittlerweile gar nicht so kacke ich"}, {"id": 527, "start": 3778.92, "end": 3785.84, "text": "flame java einfach nur gerne wie findest du pearl ähnlich schlimm ähnlich schlimm"}, {"id": 528, "start": 3785.84, "end": 3795.28, "text": "c++ oder brainfuck c++ brainfuck ist ja keine sprache darum zu arbeiten sehr gut gut c++"}, {"id": 529, "start": 3795.28, "end": 3811.64, "text": "auch nicht hast du schon mal was mit rust gemacht ja habe ich aber nie war es fertiges und auch"}, {"id": 530, "start": 3811.64, "end": 3816.56, "text": "schon eine ganze weile her da war rust 1.0 noch gar nicht raus rust ist richtig geile"}, {"id": 531, "start": 3816.56, "end": 3821.96, "text": "sprache aber rust ist nur für leute mit 150 iq plus"}, {"id": 532, "start": 3821.96, "end": 3830.04, "text": "the game wird mir da bestimmt zustimmen rust ist wirklich für die massive brain leute"}, {"id": 533, "start": 3830.04, "end": 3848.08, "text": "ist eine coole sache aber big brain alarm ja das finde ich auch aber es ist nicht so"}, {"id": 534, "start": 3848.08, "end": 3857.88, "text": "es ist nicht so kacke wie c++ by the way bei uns auf der arbeit auch ganz"}, {"id": 535, "start": 3857.88, "end": 3863.04, "text": "viel in dieser kombination ja ich habe keine ahnung von java und spring boot ich habe nur"}, {"id": 536, "start": 3863.04, "end": 3871.26, "text": "eine sache gelernt mittlerweile in meiner big brain death ops tätigkeit dass java die sache"}, {"id": 537, "start": 3871.26, "end": 3875.72, "text": "mit spring boot umgedreht hat früher war es so du hast du hast einen application server"}, {"id": 538, "start": 3875.72, "end": 3881.56, "text": "gebraucht wurde der dann deine java anwendung gestartet hat und mit spring boot ist es umgedreht"}, {"id": 539, "start": 3881.56, "end": 3887.72, "text": "du startest deine java anwendung die den application server mit eingebaut hat next level"}, {"id": 540, "start": 3887.72, "end": 3893.64, "text": "shit ich habe keine ahnung was das genau bedeutet aber scheinbar so zu sein habe ich schon öfters"}, {"id": 541, "start": 3893.64, "end": 3897.12, "text": "gehört also das ist eine deutliche sache ich rede von was wo ich keine ahnung von ab"}, {"id": 542, "start": 3897.12, "end": 3910.32, "text": "alter betin 2 was hältst du von kronklin das was ich bis jetzt gesehen habe ziemlich nice"}, {"id": 543, "start": 3910.32, "end": 3916.72, "text": "inspiriert von vielen anderen sprachen aber gut zusammengeklaut finde ich cool also wenn"}, {"id": 544, "start": 3916.72, "end": 3920.88, "text": "ich die ausweiten mit java und kotlin bin ich nur kotlin verwenden aber ich habe damit"}, {"id": 545, "start": 3920.88, "end": 3925.4, "text": "nichts großartig gemacht bisher das gleiche gilt übrigens für swift mit swift habe ich"}, {"id": 546, "start": 3925.4, "end": 3929.32, "text": "auch noch nicht viel gemacht oder besser gesagt gar nichts gemacht aber was ich von swift"}, {"id": 547, "start": 3929.32, "end": 3935.2, "text": "sehe finde ich auch ganz nice java oder c++ java auf jeden fall java ich bin zwar ich"}, {"id": 548, "start": 3935.2, "end": 3942.84, "text": "bin zwar nicht scharf drauf aber alles ist besser als c++ also alles was ernsthaft dafür"}, {"id": 549, "start": 3942.84, "end": 3948.44, "text": "gedacht ist um es zu programmieren und nicht 50 jahre alt ist also ja kobold ist auch noch"}, {"id": 550, "start": 3948.44, "end": 3953.36, "text": "ätzender und brainfuck ist nicht zu programmieren gedacht aber es ist so ziemlich alles jede"}, {"id": 551, "start": 3953.36, "end": 3965.84, "text": "moderne sprache angenehmer als c++ ja sehe ich auch so ruby on rails ruby on rails ist"}, {"id": 552, "start": 3965.84, "end": 3973.32, "text": "cool ruby on rails mag ich leider hat ruby selbst so ein bisschen den anschluss verloren"}, {"id": 553, "start": 3973.32, "end": 3978.36, "text": "und rails hat nicht mal den hype den es mal vor ein paar jahren hatte aber ruby on rails"}, {"id": 554, "start": 3978.36, "end": 3985.56, "text": "mag ich was sind denn die besseren ok da kann ich was zu sagen also jetzt natürlich ist"}, {"id": 555, "start": 3985.56, "end": 3991.24, "text": "das alles echt ultra subjektiv muss man sagen es mag sicherlich sogar leute auf der welt"}, {"id": 556, "start": 3991.24, "end": 3999.04, "text": "geben die c++ mögen ich werde es zwar nie nachvollziehen können aber das mag mag irgendwo"}, {"id": 557, "start": 3999.04, "end": 4005.72, "text": "in irgendwelchen verdrehten hirnen mag das so sein ja aber lass mal überlegen was ist"}, {"id": 558, "start": 4005.72, "end": 4009.8, "text": "was sind schöne was sind schöne sprachen ruby ist eine schöne sprache c sharp ist eine"}, {"id": 559, "start": 4009.8, "end": 4021.32, "text": "leise sprache c ist eine leise sprache go ist eine leise sprache pyson ist eine leise sprache"}, {"id": 560, "start": 4021.32, "end": 4033.0, "text": "javascript ist mittlerweile auch ganz ok was hat man von rust ist auch ganz gut haben wir"}, {"id": 561, "start": 4033.0, "end": 4040.0, "text": "jetzt noch so vergessen an mainstream sachen type type script ja type script type script"}, {"id": 562, "start": 4040.0, "end": 4049.0, "text": "auch dazu pp pp mit lara will markt ganz gut gehen habe ich aber kaum erfahrungen mit"}, {"id": 563, "start": 4049.0, "end": 4053.24, "text": "ja so das sind zumindest die sprachen in denen ich jemand in denen ich schon mal ein bisschen"}, {"id": 564, "start": 4053.24, "end": 4062.68, "text": "was gemacht habe wo ich zu sagen kann dass ich die ganz nice finde anhand was mist man"}, {"id": 565, "start": 4062.68, "end": 4070.0, "text": "sprach iq needed das da gibt es da gibt es einen guten indikator für go ist übrigens"}, {"id": 566, "start": 4070.0, "end": 4074.4, "text": "auch ganz ok go hat so ein paar dinger die ich nicht ganz nachvollziehen kann aber an"}, {"id": 567, "start": 4074.4, "end": 4080.12, "text": "sich ist ok es gibt eine sache wo man das ganz einfach daran nachvollziehen kann wie"}, {"id": 568, "start": 4080.12, "end": 4089.24, "text": "viele doppelt dreifach vierfach mehr deutigkeiten klammern haben oder speziell oder sonderzeichen"}, {"id": 569, "start": 4089.24, "end": 4097.2, "text": "haben in c++ haben die sich nämlich gedacht dass man möglichst oft die gleichen zeichen"}, {"id": 570, "start": 4097.2, "end": 4103.92, "text": "für unterschiedliche sachen verwenden sollte zum beispiel in und ist ganz beliebt in c++"}, {"id": 571, "start": 4103.92, "end": 4109.16, "text": "so ein und zeichen in c++ kann glaube ich mindestens fünf verschiedene bedeutungen"}, {"id": 572, "start": 4109.16, "end": 4117.56, "text": "haben die komplett unterschiedlich sind aber komplett da haben die sich gedacht im gremium"}, {"id": 573, "start": 4117.56, "end": 4123.76, "text": "so muss das sein exquisite haben abends dann im gremium gesessen haben sie ihr weinglas"}, {"id": 574, "start": 4123.76, "end": 4130.68, "text": "geschwenken haben sie überlegt wir brauchen noch einen operator wo man automatisch in"}, {"id": 575, "start": 4130.68, "end": 4137.72, "text": "lambda funktionen variablen captured was nehmen wir dafür wir könnten das irgendwie versuchen"}, {"id": 576, "start": 4137.72, "end": 4143.44, "text": "automatisch zu machen oder wir könnten irgendwie dafür was gut lesbares uns ausdenken ach"}, {"id": 577, "start": 4143.44, "end": 4154.68, "text": "nee lass mal den und nehmen das ist übrigens herz auch eine coole frage warum wir so sind"}, {"id": 578, "start": 4154.68, "end": 4160.12, "text": "dann viele spiele in c++ programmiert historisch vieles ist halt mal in c++ wie unreal zum"}, {"id": 579, "start": 4160.12, "end": 4167.56, "text": "beispiel es hat sich historisch auch irgendwie etabliert aber so ziemlich keiner macht es"}, {"id": 580, "start": 4167.56, "end": 4175.8, "text": "gerne also es gibt kaum jemand der wirklich gerne c++ programmiert auch bei der spielerentwicklung"}, {"id": 581, "start": 4175.8, "end": 4185.56, "text": "viele sind da halt mehr oder weniger gezwungen zu es gibt bestimmt den ein oder anderen"}, {"id": 582, "start": 4185.56, "end": 4190.24, "text": "ja der chat chat ist klar ist klar jetzt kommen jetzt kommen sie wieder alle an ich mag c++"}, {"id": 583, "start": 4190.24, "end": 4198.48, "text": "ich mag brainfuck ich mag alles jeder jeder was er will wenn ihr wenn ihr c++ macht was"}, {"id": 584, "start": 4198.48, "end": 4215.88, "text": "in c++ wie gesagt kann ich nicht viel zu sagen ruby typescript ist auch ganz gut unterschied"}, {"id": 585, "start": 4215.88, "end": 4222.56, "text": "c der hauptunterschied zwischen c und c++ ist c ist ziemlich minimalistisch und in sich"}, {"id": 586, "start": 4222.56, "end": 4237.76, "text": "selbst logisch und c++ ist aufgeplädt und unlogisch und mehrdeutig wieso ist c++ so"}, {"id": 587, "start": 4237.76, "end": 4250.44, "text": "schlecht weil es undurchdachter crap ist ja skala wenn man gerne klammern mag dann ist"}, {"id": 588, "start": 4250.44, "end": 4268.96, "text": "skala nice ja waren meine led strips die blinken habe ich gerade an hier am fenster das ding"}, {"id": 589, "start": 4268.96, "end": 4272.44, "text": "ich muss dir ehrlich sagen habe ich mir noch gar nicht großartig angeguckt github workspaces"}, {"id": 590, "start": 4272.44, "end": 4297.88, "text": "gut job ja ja ich auch auch mein beileid hier was ist denn die alternative zu c++ ja kommt"}, {"id": 591, "start": 4297.88, "end": 4303.52, "text": "drauf an was man machen will ich mag c sharp c sharp ist keine wirkliche alternative zu"}, {"id": 592, "start": 4303.52, "end": 4311.72, "text": "c++ also spielt ein bisschen anderen eine richtung aber ich finde c sharp ist so ist"}, {"id": 593, "start": 4311.72, "end": 4318.92, "text": "ein super als wegsprache es gibt fast fast nichts was man nicht in c sharp machen kann"}, {"id": 594, "start": 4318.92, "end": 4323.4, "text": "es gibt umgedreht auch kaum was was man nicht in c++ machen kann zusätzlich wirst du aber"}, {"id": 595, "start": 4323.4, "end": 4330.88, "text": "in c++ noch verrückt im kopf ja das stimmt ich war man kann cute auch verwenden vor allem"}, {"id": 596, "start": 4330.88, "end": 4339.48, "text": "das alte dass ich erst das die cute forms geschichte kann vergessen wie es heißt die"}, {"id": 597, "start": 4339.48, "end": 4344.08, "text": "kann man auch verwenden ohne auf die und auf den restlichen c++ kram scheißen aber es"}, {"id": 598, "start": 4344.08, "end": 4361.48, "text": "ist trotzdem nervig halo halo soundtrack ja das kommt tatsächlich noch dabei dass gerade"}, {"id": 599, "start": 4361.48, "end": 4366.24, "text": "was performance angeht c++ wirklich nicht übel ist allerdings muss man sagen c++ kann"}, {"id": 600, "start": 4366.24, "end": 4370.58, "text": "man sich halt auch ziemlich einfach ins bein schießen und und man muss halt auch wirklich"}, {"id": 601, "start": 4370.58, "end": 4376.6, "text": "sagen dass gerade durch unity und durch die anpassung die microsoft generell an c sharp"}, {"id": 602, "start": 4376.6, "end": 4380.68, "text": "in letzter zeit gemacht hat dass performance mäßig zwar immer noch ein unterschied ist"}, {"id": 603, "start": 4380.68, "end": 4385.48, "text": "also du kannst in der regel davon ausgehen dass ein c++ kram doch noch schneller ist"}, {"id": 604, "start": 4385.48, "end": 4390.08, "text": "als in c sharp pro kram allein schon weil du die ganzen runtime checks nicht hast aber"}, {"id": 605, "start": 4390.08, "end": 4396.12, "text": "es ist jetzt nicht nur dass da welten dazwischen liegen also deswegen sage ich ja ich finde"}, {"id": 606, "start": 4396.12, "end": 4400.28, "text": "ich finde c sharp ist wirklich ein absolut super als wegsprache es gibt fast nichts was"}, {"id": 607, "start": 4400.28, "end": 4404.08, "text": "du damit nicht machen kannst natürlich gibt es ein paar sachen du kannst wird du wirst"}, {"id": 608, "start": 4404.08, "end": 4409.12, "text": "keinen bootloader in c sharp programmieren das wirst du aber wahrscheinlich auch nicht"}, {"id": 609, "start": 4409.12, "end": 4415.24, "text": "in c++ machen wahrscheinlich auch nicht einmal in c machen weil du da genau wissen musst"}, {"id": 610, "start": 4415.24, "end": 4418.92, "text": "sampler mäßig was nacheinander ausgeführt wird aber im prinzip kannst du mit c sharp"}, {"id": 611, "start": 4418.92, "end": 4431.52, "text": "nahezu alles machen und alles auch ganz gut übrigens auch noch ein punkt wo c++ nahezu"}, {"id": 612, "start": 4431.52, "end": 4439.8, "text": "unangefochten ist ist also c und c++ aber je nachdem was auch c++ ist microcontroller"}, {"id": 613, "start": 4439.8, "end": 4452.52, "text": "programmierung"}, {"id": 614, "start": 4452.52, "end": 4458.32, "text": "microcontroller programmierung gerade so die beliebten esp 32 dinger und so was da"}, {"id": 615, "start": 4458.32, "end": 4464.52, "text": "kommt dann c++ auch nicht so wirklich bei ja alex das ist der unterschied zwischen zwischen"}, {"id": 616, "start": 4464.52, "end": 4475.52, "text": "theorie und praxis theoretisch ja praktisch nein theoretisch ja weil du in einer vollständigen"}, {"id": 617, "start": 4475.52, "end": 4479.88, "text": "sprache quasi alles berechnen kannst was du mit so einem computer berechnen kannst"}, {"id": 618, "start": 4479.88, "end": 4486.0, "text": "aber das bringt dir jetzt nicht so viel wenn deine sprache beispielsweise keine keine"}, {"id": 619, "start": 4486.0, "end": 4492.2, "text": "c style betriebssystem api aufrufe machen kann weil dann kannst du mit deiner sprache"}, {"id": 620, "start": 4492.2, "end": 4496.96, "text": "eben nichts callen außer das was deine sprache eben kann ja deine sprache mag zwar alles"}, {"id": 621, "start": 4496.96, "end": 4513.36, "text": "berechnen können aber greif mal auf ein usb gerät zu mit deiner sprache viel spaß"}, {"id": 622, "start": 4513.36, "end": 4517.48, "text": "nein nein ich hatte aber schon mal ein wo das standardmäßig mit drauf ist aber ich"}, {"id": 623, "start": 4517.48, "end": 4522.44, "text": "habe noch nie noch nie damit rum gewurstet zwar zeigt was haben was haben wir sonst noch"}, {"id": 624, "start": 4522.44, "end": 4541.8, "text": "für interessante github trends dos box pure aha exzellent für retro retro arch"}, {"id": 625, "start": 4541.8, "end": 4549.32, "text": "und cast aha kann ich mein eigenes youtube auf machen ich warte schon die ganze zeit"}, {"id": 626, "start": 4549.32, "end": 4565.92, "text": "drauf chat wir machen unser eigenes twitch easy easy money easy live kein problem oh"}, {"id": 627, "start": 4565.92, "end": 4571.08, "text": "das ist doch das ist doch garantiert monka tost oder das sind doch bestimmt irgendwelche"}, {"id": 628, "start": 4571.08, "end": 4576.64, "text": "ip tv channels drin die man nicht sehen sollte oder nicht sehen darf ohne in dem land zu"}, {"id": 629, "start": 4576.64, "end": 4590.72, "text": "sein oder oder irgendwas da ist bestimmt monka tost mit drinne"}, {"id": 630, "start": 4590.72, "end": 4598.08, "text": "taskbar groups obas ist das könnte das für windows was taugen der macht es richtig ja"}, {"id": 631, "start": 4598.08, "end": 4607.0, "text": "no comment message so muss es sein einfach leere comment message machen nicht so wie"}, {"id": 632, "start": 4607.0, "end": 4622.52, "text": "ich da mist reinschreiben einfach leer lassen aha"}, {"id": 633, "start": 4622.52, "end": 4627.68, "text": "ok für leute die viele unterschiedliche programme aufhaben könnte das tatsächlich ganz nice"}, {"id": 634, "start": 4627.68, "end": 4632.72, "text": "sein sieht ein bisschen aus wie bei was du auf dem iphone machen kannst mit diesen gruppen"}, {"id": 635, "start": 4632.72, "end": 4638.88, "text": "auf dem startbildschirm oder auf dem desktop willst du heute noch battlefield 3 nee ich"}, {"id": 636, "start": 4638.88, "end": 4644.48, "text": "gehe jetzt eine halbe stunde ins bett und vorher gehe ich noch mal aufs klo heute spiele"}, {"id": 637, "start": 4644.48, "end": 4648.84, "text": "ich kein battlefield 3 mehr nee warum haben wir kobold stream und an weihnachten spielen"}, {"id": 638, "start": 4648.84, "end": 4659.56, "text": "wir wieder battlefield 3 oder vielleicht mal über mal ein kobold stream space x ab die"}, {"id": 639, "start": 4659.56, "end": 4667.0, "text": "haben eine api was macht man damit warum gibt es warum gibt es eine art warum hat space"}, {"id": 640, "start": 4667.0, "end": 4682.96, "text": "x ab kann ich damit auch raketen fernsteuern achso das ist einfach nur dass man sich angucken"}, {"id": 641, "start": 4682.96, "end": 4702.2, "text": "kann was wie wann gestartet ist und sowas ok"}, {"id": 642, "start": 4702.2, "end": 4710.96, "text": "was ist was ist die net is cloud net is cloud musik habe ich nie gehört noch mehr c++ ok"}, {"id": 643, "start": 4710.96, "end": 4714.04, "text": "da ist diese woche nicht so wirklich spannendes dabei die sind heute nicht so wirklich was"}, {"id": 644, "start": 4714.04, "end": 4721.68, "text": "spannendes dabei also richtig spannend sind einfach eher so die weekly und monthly trends"}, {"id": 645, "start": 4721.68, "end": 4738.28, "text": "gleiche graben auch nicht so spannend auch nicht so spannend bevy rust gedöns firefox"}, {"id": 646, "start": 4738.28, "end": 4753.72, "text": "ist für ios ok warum trendet das tinder permission studio code trendet exellent so muss das sein"}, {"id": 647, "start": 4753.72, "end": 4763.16, "text": "da melden wir uns dann auch demnächst mal an für die hotten programmer grills vs inda"}, {"id": 648, "start": 4763.16, "end": 4771.92, "text": "wobei es ja nicht wie sind da heißt aber ich finde vs inda könnte es auch sein ja dann"}, {"id": 649, "start": 4771.92, "end": 4779.92, "text": "schreiben wir dann fünfzeiten assembler um die um die hotten programmer wishlist zu die"}, {"id": 650, "start": 4779.92, "end": 4796.4, "text": "code grills zu beeindrucken easy easy bitcoin trendet warum auch immer packer also wirklich"}, {"id": 651, "start": 4796.4, "end": 4807.96, "text": "spannend ist es nicht was da heute so trendet ehrlich gesagt ist es ziemlich langweilig"}, {"id": 652, "start": 4807.96, "end": 4814.88, "text": "weil bitcoin gerade durch die decke geht zeigt mal macht es das oh tatsächlich warum denn"}, {"id": 653, "start": 4814.88, "end": 4821.4, "text": "ausgerechnet jetzt ich weiß ich eigentlich hätte ich mittlerweile gelernt lernen müssen"}, {"id": 654, "start": 4821.4, "end": 4831.68, "text": "dass das einem keiner so genau jemand erklären kann über bitcoin immer an den chat gibt"}, {"id": 655, "start": 4831.68, "end": 4846.68, "text": "es ein clip in dem maxand sound und stickerboard zeigt hä was meinst du das hier warum so sieht"}, {"id": 656, "start": 4846.68, "end": 4868.88, "text": "das aus ja ja so sieht das aus und ganz wichtig die bahn ist auch mit am start"}, {"id": 657, "start": 4868.88, "end": 4885.0, "text": "aha ich habe von krypto zeug echt kein plan hat er was dazu gesagt"}, {"id": 658, "start": 4885.0, "end": 4907.68, "text": "also leute ja leute wisst ihr was also ich gehe jetzt eben ich wollte nur noch mal streben"}, {"id": 659, "start": 4907.68, "end": 4911.4, "text": "dass ich jetzt nicht wieder dass es nicht wieder einschläft ihr kennt das ja erkennt"}, {"id": 660, "start": 4911.4, "end": 4917.48, "text": "mich ja wenn ich wenn ich nicht streben und dann ein paar tage nicht gestriemt habe kein"}, {"id": 661, "start": 4917.48, "end": 4922.44, "text": "video gemacht habe dann dann schläft das ganze immer so ein weil ich dann denke ah"}, {"id": 662, "start": 4922.44, "end": 4927.2, "text": "nee heute heute wieder nicht und so ich habe jetzt einfach nur mal eine runde streben angemacht"}, {"id": 663, "start": 4927.2, "end": 4932.56, "text": "dass ich nicht wieder in diese in diesen modus verfalle es ist jetzt 21.50 leute ich gehe"}, {"id": 664, "start": 4932.56, "end": 4935.64, "text": "jetzt noch mal aufs klo dann gehe ich pennen morgen ist weihnachten ich weiß nicht ob"}, {"id": 665, "start": 4935.64, "end": 4946.68, "text": "wir den kobold stream morgen machen oder übermorgen müssen wir mal schauen"}, {"id": 666, "start": 4946.68, "end": 4952.08, "text": "wir brauchen auch outro musik oder outro musik brauchen wir leute outro musik muss muss sein"}, {"id": 667, "start": 4952.08, "end": 4967.72, "text": "also chat wir sehen uns machts gut see you"}]}