{"text": "Habe mir gedacht, komm, jetzt in den paar Wochen, also eigentlich ist es ja um genau zu sein, eine Woche, wo alle daheim sind, da gucke ich mal, dass ich das nach Möglichkeit mache, dass ich jeden Tag streamsoar.Morgen mache ich ein neues Video, weiß auch schon was.Übrigens, soll ich euch mal was sagen Leute, soll ich euch mal was poggers-mäßiges verraten?Okay, Twitch hat noch gar nicht kapiert, dass der Stream on ist, dann warte ich noch mal kurz.So Twitch, haben wir es jetzt kapiert irgendwann?Nope, Twitch ist wieder geil, Twitch ist wieder offen, zack.70720p, Twitch please, komm an.Warten wir mal kurz ab, bis es 1080p ist.Auf Twitch, 1080p please.Excellent.1080p, wunderbar.Jetzt müssen wir nur noch, jetzt müssen wir nur noch gucken.Seit wann macht VLC dann irgendwie so ein komisches Announcement daneben?Wer bei Microsoft oder bei VLC hat sich gedacht, das ist eine gute Idee.Guck mal, es gibt jetzt ein Announcement, wenn das minimiert ist, was ist denn das für ein Kack?What the fuck?Was interessiert mich denn, dass da jetzt was anfängt zu spielen, das ist mir doch vollkommen egal.Okay, das muss ich dem VLC irgendwie abgewöhnen, das ist ja ultra nervig.Wie gewöhnt man das dann dem VLC ab?Okay, dann muss ich mal kurz gucken, dann legen wir los.VLC, Loop, Announce, Windows, Disable, nicht nach was ich suchen soll.How to disable pop-up track notifications, okay.Okay, Moment, wo muss ich hin?Preferences, Alter, die VLC-Settings, wer hat stets wieder ausgedacht?VLC-Settings, all, okay und jetzt was?Interfaces, wo ist das denn überhaupt?Interfaces, seht ihr das hier irgendwie, Interfaces, main interface, cute interfaceund jetzt was?Show notification pop-upShow notification pop-up on track changeSeht ihr das irgendwo?Ich sehe diese Option hier gar nicht davon.Choose never, ach Moment.Show notification pop-up und, ne.Seht ihr das irgendwo diese Option?Show notification pop-up on track changeChoose never in the drop named ShowAh, Show notification pop-up on track changeWhen minimized, never, bam.Sollen wir mal gucken, ob das jetzt funktioniert?Mal gucken, ob der jetzt diesen komischen pop-up da nicht mal zeigt.Es blinkt noch, okay, damit kann ich leben, wenn er blinkt, es ist mir ehrlich gesagt egal, ob das blinkt.Okay, kann man das blinken noch? Kann man das?Holds, loop, blink, disable.Ich habe echt keine Ahnung, warum so ein Plutzin standardmäßig voreingestellt ist.How to star?Plex, blink, taskbar, disable.On file change, okay, excel, also.Disabled, bring to front, what?Race, nach Race soll ich suchen.Also ganz ehrlich, so geil VLC ist, aber die Settings sind echt eine komplette Zumutung.Wo?Hier, never.So und jetzt?Und, und, und, gehts jetzt?Alter, es funktioniert.Alter, ey, also VLC-Settings ist wirklich absolute Zumutung.Wer sich das ausgedacht hat.So, gucken wir mal, ob es gescheite Server gibt.Ich habe mir übrigens keinen Server gemacht heute.Ich habe heute den ganzen Tag Pokemon-Fake-Game gespielt.Dieses Game ist übrigens richtig geil.Also wer nach dem Game sucht, wo er ein bisschen solo grinden kann, ist das reine Single, ne, es stimmt nicht, es ist nicht reine Single-Player.Es ist, es hat Multiplayer, aber ich weiß nicht, wie oft er gespielt wird, ja.Und wer auf so Monster, RPGs und Monstersammel-Games steht und sowas, ist das richtig poggers.Sieht zwar alt aus, ist aber neu.Hat, glaube ich, 100 Monster.Kannst upgraden, kannst skillen, kannst Zeug machen.Also hat auch richtig, also extrem, wie soll ich sagen, so tiefes Kampf, also tief gehaltenes Kampfsystem, richtig nice.Und kostet nur 29 Euro.Ne, 20 Euro sogar.Also geschenkt für das Game, echt poggers.Also wer auf RPGs jeglicher Art steht und ein bisschen was so mit Retro, Pixel-Look anfangen kann, kann ich jetzt echt nur wärmstens empfehlen.Und man siehts hier auch, guckt euch mal die Rezession an, ey.Positive, positive, positive, positive.Die heulen immer rum, Alter.Wisst ihr, wisst ihr, ich muss, ich muss erst mal was loswerden.Da, da muss ich, da muss ich auch, da muss ich auch ein Video mal zumachen.Ähm, wo hab ich denn hier mein Weihnachtskalender?Mein, wo hab ich denn hier mein Weihnachtskalender?Ey, da muss, ohne Mist, da muss ich echt ein Video zumachen.Und zwar, weil mir das echt...So auf den Kicks geht, dass die Leute heute bei jedem Spiel, was nicht offensichtlich easy as fuck ist, rumheulen, dass es nicht schaffbar ist.Also wenn das Game nicht so krass easy ist, dass du es auf dem Klo mit der linken Arschbacke spielen kannst,kommst du dann, oh nein, das ist unspielbar, oh, was hat sich der Programmierer nur dabei gedacht?Ich seh das überhaupt nicht ein, mich mit aus dem Game auseinanderzusetzen, soll hier übelst Cry-Action.Das ist der Wahnsinn, okay, keine Ahnung, was mit dem Typ jetzt ist.Aber wisst ihr, was der schlimmste, also eines der schlimmsten, äh, Simirefuse oder generell Spiele, wo sie abgegangen sind, in letzter Zeit ist das drauf.Äh, ich finde, das ist das beste Classic-RPG seit Jahren gewesen, ohne Scheiß, ja.Das hier, so.Und die haben rumgeweint, Alter.Die haben rumgeheult wegen dem ersten Fight.Und das Game sagt dir, im ersten Fight, sagt dir das Game, okay, manche Fights muss man mit etwas, ähm, äh, ja, besonderen Mitteln angehen.Und man soll mal, das Game sagt halt nicht, diese Gegner sind empfindlich gegen Feuerschaden.Dieses, der NPC am Anfang sagt dir aber, äh, so nach dem Motto, nehm besser ein paar, äh, explosive Flaschen mit oder, oder so nach dem Motto, geh zum Alchemist und kauf dir ein paar explosive, äh, Potions.So, das sagt dann, das sagt dann der NPC, bevor man in den ersten Dungeon reingeht von dem Game, ja.Und, das haben die alle nicht gelesen.Und, das haben die alle nicht gelesen. Und da sind sie da beide an, die Leute in den Steam, in den, in den, in den Steam-Reviews, die sind halt an den ersten Spinnen verrecknet im RPG.Und haben gleich erstmal, äh, ein Negativ-Review gemacht.Das ist echter Wahnsinn, also.Mittlerweile, ich halte es, ich, ich kann mir das immer hier angucken, der Kram.Dieses wirklich, wie gesagt, Spiel, was du nicht beim Kacken auf der linken Arschpacke spielen kannst, wird rumgeheult, dass es zu schwer ist.Absolut Ultra-Kack-Weh.Cube World. Irgendwie ist Cube World nicht dieser Minecraft-Clone, der nie fertig geworden ist?Ach doch, Moment, Moment. Cube World ist mittlerweile fertig, aber es ist von dem Game eigentlich nichts mehr übrig geblieben, was es mal gut gemacht hat, ne?Die haben irgendwie alles entfernt, kann es sein? Ich, ich erinnere mich, ich erinnere mich dunkel.Hab ich nie gespielt. Wie gesagt, ihr wisst ja, Minecraft ist nicht meins.Generell muss ich sagen, also richtig, die meisten krassen Mainstream-Games sind nicht meins.So, schauen wir mal, was haben wir hier zu bieten? Player.Excellent. Gibt es Nachtmaps? Ich brauche wieder Nachtmaps. Nachtmaps waren so, Poggers.Ist ja genso. Also, Night. Wie ist der Kram? Night-Time. Random-Night-Time gibt es auch noch, okay.Auch geil. Noshakannels Team Deathmatch. Was läuft? Sand-Crossing. Alles klar.Das klingt logisch. Okay, ich muss mal kurz die Musik ausmachen.Musik. Off. Bam.Allerdings 64-Mann-Sand-Crossing stelle ich mir ein bisschen Clusterfuck-mäßig vor.Ich spiele ja normalerweise kein TDM, aber die Nachtmaps haben es mir echt angetan.Okay. Random-Spawn-Point. What the... Wow, wow, wow. Alter, Alter. Ist ja gut.Spawns rein, du wirst von der Seite angebashed. Was? Alter, nein. Der hat meine Nachtsicht,der hat meine Nachtsicht, stellt sich nicht gemerkt. Ich habe meinen OP-Nachtsicht-Visier nicht am Start.Wie gibt es denn sowas hier? Wie kann denn sowas sein? Ich brauche meine Nachtsicht-Visier.Kann man da schon immer durchhüpfen? Oder war das jetzt ein krasser Battlefield-Bug?Ich glaube, das war Battlefield-Bug, oder? Normalerweise soll man da nicht durchspringen können.By the way, man kann nicht... Man kann nicht... Oh, oh, oh. Gehst du weg, Alter? Gehst du fort?Man kann nicht spotten. Aha. Weggestreifwort. Man kann wieder nicht spotten. Ich habe keine Ahnung,was die mit den Servern immer machen, aber warum schaltet man... Ernsthaft, warum schaltet manSpotting aus? Guck mal, du siehst den Battlefield überhaupt nichts. Du kannst überhaupt nichts mehr spotten.Das ist mega der Sack. Du siehst ja nichts. Das Game ist halt auf Spotten ausgelegt.Du musst Spotterino machen, sonst geht das nicht. Wir pushen mal ein bisschen.Ah, da kann man rauf. Ich wollte gerade sagen, da gibt es hier geile Leiter.Oh nee, das gibt ganz, ganz, ganz, ganz schlimmes Rumgekämpfe hier. Ich weiß es. Ich weiß es jetzt schon.Aber, immer ernsthaft, Zen-Crossing, das ist so hell hier, brauchst du gar keine Nachtsicht-Visier.Null W. Alter, ich muss nachladen. Zu viel, zu viel, zu viel hier los.Oh, ich sollte sie vielleicht nicht blocken. Man muss aber echt... Man muss aber... Oh nee, da hinten.Moment, was zum... Ich bin mir jetzt nicht ganz sicher, ehrlich gesagt.Seit wann gibt es BF4-Maps in Battlefield 3? Das ist keine Battlefield-4-Map.Oder haben die die mal Remaked oder so für Battlefield 4? Nee, glaub nicht. Oder gab's ein paar da auch für Battlefield 4?Nee, oder? Nee, glaub's nicht.Fuck. Ich hätte, ich hätte mir die Mini-Pack-Kiste früher legen sollen.Äh, Moment, wo? Wo stellst denn der Dude lang? Yeah! Easy win, easy life.Battlefield 3, also ich muss sagen, when it's unleashed macht ultra Bock, wenn man halt das spielt, was nicht vanilla ist.Also wenn du beispielsweise Nacht-Maps spielst oder so, das ist wie ein neues Game. Die Nacht-Maps ohne Plaufilter.Richtig geil. Einfach mal was komplett anderes. Sieht anders aus, spielt sich anders, fühlt sich anders an.Richtig poggers. Richtig, richtig poggers.Ja, aber warum die das Spotting auch so viel sauber ausmachen, verstehe ich nicht, weil Battlefield, gerade Battlefield 3 ohne Spotting ist schon ein bisschen...Würde ich? Moin Mark, sag mal, hast du dir Cold War gekauft?Hallo, ich möchte es minimieren. What the fuck?Okay, darf das nicht verschieben? Ich wollte ja eigentlich nur das Icon zeigen, dass du siehst, ja, ich hab's mir gekauft.Okay, also merkt euch, verschiebt das Fenster nicht, das ist nicht dafür ausgelegt, das Fenster zu verschieben.Ich mag's nicht.Also, Text, Night, Nighttime, jawoll. Ja, was kam jetzt für eine Map, ich hab gar nicht geguckt.Ich hoffe, ich hoffe es... Och nee. Och nee, nicht schon wieder. Moment, was musste man dafür nochmal machen?Mods Ordner löschen? Oder irgendwas? Erstmal ausmachen. Man musste doch irgendwie...Okay, mein, Appdater. War doch irgendwie so ein komischer Bug, ne?Appdater, dann müsste man hier Local... Wenn es anleashed Mods Ordner sollte man löschen.Excellent. Doomquake Unreal 23, ja, seh ich auch so.Ich hab's ja in einem der letzten Videos gesagt, die müssen, oder die hätten, also nicht die Venice Unleashed Leute, sondern DICE damals,die hätten Battlefield 3 als Service Game machen sollen, also das, was man heute als Service Game nennt, und einfach 3-4 Jahre supporten.Und den ganzen Scheiß, den sie dann jetzt in Battlefield 4 eingebaut haben, den hätten sie ohne Probleme auch in Battlefield 3 einbauen können.Oh, Bazaar kommt jetzt. Rite Time Bazaar. Und das wär doch nice gewesen. Alter Pli...Sag mal, ist Bazaar bugged? Ist Grand Bazaar bugged?Das hatten wir doch gestern auch schon. Grand Bazaar hat übelst rumgeschissen, ne?Das hatten wir doch gestern auch schon. Das hatten wir doch gestern auch schon, den Mist.Haben wir aus? Okay, dann können wir auf dem Server nicht spielen, das ist natürlich ziemlicher Crap.Du bist auf dem Server ohne Bugs? Hä? Ich hatte noch nie nen Bazaar Green Screen, ohne Scheiß. Gucken wir mal was mit dem anderen.Wo spielen denn hier grad Leute? One Bullet Headshot? Nee, nee. Das Game ist nicht da drauf ausgelegt, ganz ehrlich.Aus dem Sitzen dann da alle wie verrückt rum. Night Time Bazaar, ja. Epi Centrum Bazaar war auch...Epi Centrum Night Time war auch richtig geil. Komm jetzt, Pause Champ, kein Green Screen. Und? Und? Aha!Okay, also machen wir mal was. Loadout? Oh komm, wir machen mal die cheesigste Waffe im ganzen Game, Alter.Wir machen jetzt M16. Äh, warte mal, M16? M16 ist doch, ist die Burst Fire Mode? Ja. Ich will die normale M16, wo ist denn die?Wo ist meine, wo ist die M16? Ah, da. Ähm, so. Wir machen jetzt die cheesigste Waffe im ganzen Game.Null W. Jawoll! Jetzt kann nix mehr schief gehen, Alter. M16, M16, Nachtvisier. Passt mal auf.Moment, ist das One Shot Headshot oder so? What the fuck, please? Oh, K220 können wir auch spielen, das ist auch eine gute Idee.So eine Burst Waffe, da kann ich mein NA aimen. What the hell? Ich erkenne gar nicht, wo hier was ist.Ey, das sackt. Wow, wow. Die gehen ja, was ist denn schon wieder mit den Gegnern los?Okay, okay, das waren wir. Oh, fuck. Oh, die machen Rats-Action. What the fuck? Okay, komm raus.Ich hab extra mein, ich hab extra mein geiles Stels-Visier drauf. Komm mal, der will Flank-Action wieder machen.Ah. Sag mal, das ist doch nicht normal gerade. Was ist mit den Gegnern los? Moment, was habe ich denn für einen Ping?Na ja, 43, das geht eigentlich. Sag mal, ist NoFate nicht der Erfinder von dem Game? Von Venice Unleashed? Oder wie war das nochmal?Oder einer der Venice Unleashed Typen? Ah, Moment, ich dachte, das geht hier. Geht aber nicht.Achtung, komm rum. Nice, gebashed haben wir sie.Ich weiß, ich mag meine M416 besser. Ich mag meine M416 lieber. Leute, mir kommt so vor, als haben die das heller gemacht, als braucht man das Nacht-Visier gar nicht mehr.Wonka S. Spielst du so mit Fabian? Wir spielen gerade das gleiche Spiel, aber wir spielen das Single-Player quasi parallel nebeneinander.Ey, die sind krass, die Gegner. Das geht doch nicht an, wie krass die einem across the map den Kopf schießen. Ist hier gerade die Battlefield-Elite am Start.Ich hab schon eine M16 rausgeholt. Ich mach jetzt bisschen Run-and-Gun-Action, besser.Gehen wir mal hier aufs Haus. Alles klar. Excellent, excellent. Pausierungs-Champ.Die M16 ist halt geil. Du musst einfach nur nach unten ziehen. Guck mal, wie easy. Dauerfeuer auf einem Spot zu bleiben. Recoil ist overrated.Oh, jetzt hab ich meinen ganzen Muni verschossen. Das war natürlich auch äußerst clever von mir.Ja, die M16 ist long distance. Das stimmt schon. Achtung, Reds-Champ. Ich glaube, ich mach das Visier wieder runter.Erst mal schön von hinten gebessert, Alter. Okay, ne, ne, ne, ne. Gefällt mir nicht. Customize.Spielen wir mal was? Könnten wir mal was Ausgefallenes? KH2001. Hab ich, glaube ich, nie gespielt in dem Game, richtig?Das war Burst, ne, das Ding. Hallo, Battlefield, please. Oh, da wird wer geburstet.Macht die wenigstens besonders Damage im Burst oder ist die einfach nur Burst und schlecht und auch noch schlechter als andere Waffen?Ich kann mich, ich kann, ja zumindest einen richtig langen Reload, was ziemlich sackt. Ah ja, by the way, und, und, und der Reload dauert lange.Stream Snipes mich, easy as fuck, Stream Snipes mich macht. Das ist echt dumm, dass man die nicht spotten kann.Wisst ihr das? Das ist richtig hängen geblieben, dass man die Gegner nicht spotten kann.Okay, okay, ich, ich bin mir nicht ganz sicher, wo wir hier lang können, aber ich, ich, ich Pause-Champe mal hier um die Ecke.Äh, ich hab ne dumme Perk, ich brauch Anti-Suppression. Braucht das Anti-Suppression-Perk und Waffen mit langen Reloads sacken im Battlefield-Reihe.Aber ist da oben was? Äh, ich speichere mir mal das Game, weil ich, wie gesagt, ich mach morgen ein Video über die Nachtmaps.Wow, wow, wow, wow, wow, Pause-Champe steht in der Ecke. Ja, ja, ist ja gut, sehr gut, sehr gut.Sag mal, jetzt seh ich, da seh ich den übelst scharf hier wieder. Übelst scharfe Gegner. Guckst du um die Ecke, bist down.Wie, der ist nicht tot? Hab ich das richtig gesehen? Das hat nicht gereicht ihn zu killen. Von wo, please? Guck mal, da ist doch gar nichts.Oh, da kommt jetzt was, Achtung. Ey, die sind so krass drauf, die Gegner. Reingejoined, bam, Q-Chat 17-2, kann ich mitleben, kann ich mitleben.Ich glaub, die machen jetzt hier Attacke, weil der Venice Unleashed Gründer drauf ist. Glaub ich, da machen die jetzt hier, als gibt's keinen Morgen mehr. Die machen Skill-Best-Matchmaking gerade.Die machen komplett, die eskalieren voll Skill-Best-Matchmaking. Guckt's euch an, komplette Eskalation. Ich warte jetzt, bis da einer rauskommt und dann wieder wegsnipe.Guck da, bam, bam, bam. Achtung, jetzt, jetzt, jetzt. Massive Jump, Massive Jump. Was? Alter, von da kann mich gar keiner treffen. Wie soll denn das gehen?Haben die Ecke gekugelt oder gekurfte Kugeln oder wie? Okay, die Waffe sackt, guckt euch das mal an. Reingebörstet in die Gegner, stirbt nichts. Chat, wie sieht's eigentlich mit euch aus?Habt ihr auch schon mal gespielt? Oder habt ihr bloß zugeguckt?Äh, Doktor Magic, Dankeschön für den Sub. Wo sind wir hier, wo sind wir? Post-Champ, Post-Champ, Post-Champ.Hier Leute, wisst ihr was? Man darf nicht zu schnell tappen, man muss, man braucht so ein, äh ne, ich hab da nicht den Tapfinger für. Man muss, man muss so ein, passt mal auf, man muss so ein Special-Tap-Rhythmus haben.Wenn man zu schnell tappt, sagt man muss, man muss irgendwie so, also dann macht man nämlich quasi Dauerfeuer. Wenn man zu schnell tappt, dann nicht. Wenn man zu schnell tappt, dann jampt das Ding oder irgendwie.Mal wallbangen. Guckt ihr, habt ihr gesehen, ich muss, ich muss so ein gewisses Rhythmus, muss ich, muss ich schießen, dann, dann ist kein Problem.Man sieht nichts, ne? 1490 nicht besser, doch, doch, doch, doch, doch. Das können wir mal machen, wir können mal ne Runde 1490 spielen.Bisschen, bisschen Variations hier. Aber ich speichere mir den ganzen Kram mal, weil das brauch ich fürs Wit. Das Problem ist dadurch, dass man nicht spotten kann, sieht man die Gegner im Dunkeln nicht.Und insofern lohnt sich eigentlich Nachtsichtvisier hier schon. 1490 Poggers.Oh. Alter. Oh, da ist ganz schön viel.Den Kopf. Kurzum die Ecke stellst du.Die Waffe gefällt mir nicht, das macht keinen Bock mit dem Ding. Lul, der denkt jetzt auch, was ist mit dem los. Heck. Ich seh schon. Please ban Q-Chat.Bleibt man hier eigentlich an allem hängen grad. Okay, pass auf, pass auf Leute.Wow, MonkaS. Und vorne, ach du Scheiß. Okay, andere Waffe Leute, andere Waffe. Weg, weg. Okay, was, was, was können wir mal probieren? 1490, jawoll. Nice, 1490 ist Pog.Accessories. Komm, wir machen mal Night-Visier. Night-Visier auf der A. Alter.Da kriegen sie auf den Sarg. Ja, Battle Royale, ganz ehrlich, ich brauch kein Battle Royale in dem Spiel. Ich bin eh kein großartiger Battle Royale Fan. Und es ist, ich find's halt fraglich, braucht man echt in jedem Game einen Battle Royale?Die sollen lieber, ganz im Ernst, die sollen sich lieber einen richtig coolen Modus ausdenken, der zu Battlefield passt und der irgendwie neu ist. Ich sag euch mal, ich fand beispielsweise Squad Rush, ich sag jetzt nicht, dass ich Squad Rush machen soll, weil Squad Rush ist kein Mainstream-Modus.Ich fand Squad Rush richtig geil, wenn man das so semi-kompetitiv, kompetitiv ist doof in Battlefield, aber wenn man einfach mit ein paar Leuten im guten Squad zusammen spielen will.Da fand ich Squad Rush richtig poggers. Und ich glaube man könnte auch Squad Rush mit ein paar Tweaks einen echt geilen Modus machen. Annie, warum sollen wir Annie bann? Warum? Cheatet der? Wo ist der überhaupt?Spielt man die allen Firmen in Battlefield auch auf Burst, dir bleibt nichts anderes da übrig, die ist Burst Only.Kark Island TDM! Ach du Scheiße! Äh, hallo Game? Game? Post-Camp? Game? Hallo?Ah, da ist er immer. Hat ein bisschen gedauert.Ok, wo sind wir überhaupt? Seht ihr mal, wie geil die Map aussieht in der Nacht-Variante? Ist doch richtig nice, oder?187 in your face! Ok, jetzt muss ich mich gleich speichern, easy. 1,94 Kills.Ich brauch jetzt gleich noch so ein 1,94 Triggermakro, wie die ganzen Pros haben. Nein, mach ich nicht. Kein Triggermakro, das ist für Lowbops. Aber es gibt viele, die haben sowas.Ey, warum geht ihr weg? Geht nicht weg, Leute. Kommt wieder her. Alter, ich aim euch ab. Kommt wieder her. Kommt gefällig.Kommt fällig wieder her. Oh MonkaS! Was hast du eigentlich für ein Monitor? Ich hab einen BenQ... 2, 4, äh, nee, 2, ah, keine Ahnung.Äh, chat, SL, irgendwas? Chat weiß es besser als ich immer, sowas. Ich meine schon, hart wie man den Kopf schießen kann, ne, mit der AN.Die AN ist schon ne geile Waffe, oder? Müsste schon zugeben. Die AN ist schon cool.Nur für Nahkampf ist sie nicht so wirklich gut.Jaja, die schießt nicht so schnell. Oh wei, doch, die schießt sogar relativ schnell, wenn man den Triggermodus da richtig drin hat.Den ich nicht drin hab. Oh geil, hier gibt's Muni. Alles klar, alles klar.Das sind alles... Äh... Ah, ich hab, nee, ich hab das richtige Perk.Leute, ich werd jetzt gleich einmal mal switchen wieder. Ich switch gleich auf M416, weil ich die einfach gewohnt bin und hier auf dem Server wirklich viele gute Leute sind, das merkt man auch.Jetzt merkst du, dass hier gescheite Leute sind. Alter, jetzt alle down, oder was? Lul, weh. Moment, gibt's noch diese Brücke?Alter, ich seh nix mehr. Ich seh nix mehr vor lauter Geplitze. Okay, ich glaub Nacht, ich glaub Nachtsicht ist doch nicht so das geilste, das ist auch hell genug.Ähm, lass mal überbrüten. Wisst ihr was halt das Geile ist? Das ist so ein komplett neues Ding. Was nimmt man da? ACOG? PKA?Ja, nice spawn, nice spawn, GG, Eats. Easy, easy, easy, easy.Hohohoho, deleteen alle. Deleteen den Kopf gerade. Ich hab Schiss, Leute. Das ACOG Visier, ja.Das schneibern sie am Arsch der Welt. Wir sind eigentlich die Vanilla Surfer bestückt, ist eine sehr gute Frage, keiner weiß es.Lul. Es ist schon ein bisschen konfus, ne? Minimal.Ein bisschen konfus ist es schon. Waffe, die ich nicht kenn und vor allem gibt's eigentlich Tages-TDM hier drauf, ja, ne?Ich stell wieder meine M416. Da weiß ich wenigstens, was ich machen muss.Ja, ist übelst geil. Okay, genug Experimente, Leute, genug Experimente. Wobei, wie sind die G3 gewesen? Hat die getaugt?Oder die war eine AK-74? Wir spielen Scheiß auf Stats, Leute. Wir probieren jetzt mal ein bisschen rum.Ich muss mal gucken. Ich will ein bisschen schauen, was ich da anbiete zu spielen. Na, kostenlos ist es nicht. Der Mod ist an sich kostenlos, aber du brauchst Battlefield 3, ne?Soll ich euch mal was sagen? Kack-Islands, übelsteuerschen Map für TDM. Das Spiel ist ja Nose-Hair-Candles gleich viel lieber.Gegner? Okay. Ah ne, hier ist aus, he? The Schneiberman. Achtung, huge, huge nade. Die nicht, ne, krasse nade, Max.Massive nade.Oh ne, okay, das Ding macht keinen Damage. Braucht das Base-Game, ja. War die AK brauchbar in dem Spiel?Ich hab ja auch ewig nicht mehr gespielt, wenn du das so willst. Und wenn, hab ich ein paar Runden gespielt. Die Vollklasse M416, easy win.Lass mal überlegen. Also, AK war gut, M490 war gut, M16 war gut, M416 war gut. Ich glaub, das waren die guten Assault-Waffen. Schon was vergessen?Guckt zu euch an, die Schneiber-Dudes. Wie sie mir schon in der S-Snipe und snipen wollen.Auge? Nein, Quatsch, die Auge war nicht gut. Die Auge war höchstens brauchbar. Ich glaub, das, was ich grade aufgezählt hab, waren so die Tier-1-Waffen. Oder S-Tier, die S-Tier-Waffen. Oder?Geh mal jetzt, hier ist das Nachtsicht-Spiel. Woah, woah, woah. Da haben sie, haben sie gestürmt.Klitsching outside of map. Ob das Klitsching ist? Ich bin hier noch drin. Die passen auch noch richtig auf hier.Ok Leute, wisst ihr was? Genug Experimente, easy. Gehen wir zurück. Wir müssen jetzt mal ein paar Sachen killen hier.Ab. Alles klar. Ok.Mp-7? Gab's überhaupt ne Mp-7 in dem Spiel?Ah, tatsächlich. Mp, Alter, wie war die Mp-7 nochmal? Ich kann mich ja null mehr dran erinnern. Iiih, was denn das?Moment, Moment. Ich glaub, ich bin im Hardcore-Server gelandet. Bin ich im Hardcore-Server gelandet? Oh ja, fuck.Wieso spielst du nicht ausschließlich 120Hz? Weil 120Hz gibt's kaum Server und die sind sehr, also sehr anspruchsvoll, das Game auf 120Hz.Das heißt, die meisten größeren Spiele, wo die gibt es gar nicht in.Ok, ok Leute. Lol, das ist ein Hardcore-Server. Nein, jetzt ist das Ding leer. Ok, probieren wir mal. Mp-7, Alter, ok.Erstmal in ordentlich Squat. Jawoll. Join. Excellent. Äh, hallo? Darf ich, darf ich nicht bei euch spawnen? Wie wär's?Äh, ok. Ich, ich glaub, das ist Hardcore, ja? Ich glaub, das ist Hardcore. Jaaa. Magaziner, hatte das ein Magaziner weiter in dem Spiel? Ich kann mich da überhaupt nicht mehr dran erinnern.Das ist Battlefield 3 Mods, ja? Kannst du... Extended Mac? Massive. Oh, jetzt Codra Visier, jawoll.Oh, ist das nice. Komm mal, so schnell wie ich sterb, das ist Hardcore. Oh, hier, das ist ja angehustet.Ich spiel ungern Hardcore. Oh, nice. Was? Wir gucken mal, was es sonst noch so gibt.Weißt du, was kann man sonst noch spielen? Ähm... One Sh... Nee, das ist mir zu doof, da hab ich keine Bock.One Bullet Headshot, das ist sackdack, das heißt Battlefield nicht für ausgelegt. Also vor allem Battlefield 3 nicht. Zombie Server?Das hat mit Zombie, glaub ich, gar nichts zu tun. Das heißt einfach nur, einfach nur Zombie, Zombie RS. Hardcore Mix.Hm. Aber wisst ihr, was ich cool finde, dass es gut besucht ist? Sind das eigentlich für Server Pings hier, please?Operation 925 Gun Master. Oh, Gun Master hätte ich jetzt aber wieder Bock drauf. Was ist der Unterschied zur normalen Battlefield 3? Kommt drauf an, auf welchem Server du spielst.Du kannst einen Server erstellen, der genauso ist wie normales Battlefield 3. What the fuck, was geht jetzt gerade ab?Du kannst Server erstellen ohne Plaufilter, ohne Suppression, mit irgendwelchen Mods drauf. Du kannst die Maps bei Nacht spielen. Also eigentlich ganz cool, ganz cool.Guck mal, was wir für einen Ping haben. Ich will jetzt mal ein bisschen M7 spielen. Ich kann mich an die ganzen Waffen nicht mehr erinnern, Leute.Ich spiele AEK. M416, fertig. Mehr hab ich, glaub ich, das letzte Jahr in dem Spiel gar nicht gespielt. Guck mal, 32er Ping, 29er Ping. Okay, damit kann man leben.Hier mit Pistol, äh, 0W oder Gegner.Ich glaube, unter mir. Oh, oh, oh, das ist ja hoch. Das ist ja richtig hoch. Gegner, please. Wo sind die Gegner? Die Map ist zu groß.Bam, damit hätte er nicht gerechnet. Was war denn das? Ah, Burst Pistol.MonkaS, Alter.Gun Master, äh. Sag mal, das ist doch mehr als 33er Ping. Das ist ja mal, äh, Poggers Gelegge.Letzter Schuss. Zack, Bam, in your face. Whoa, whoa. One, one shot, headshot in your face, Alter. Nice.Ich wird Gun Master, ja. Wir gewinnen jetzt. Easy win.Es ist aber, der Modus ist ja im Prinzip übelst unbalanced, ne. Wenn du hinten dran bist und die Leute sind schon bei Assault Rifles und so, dann hast du halt richtig gefickt.Oh, by the way, mit dem Ding komm ich null klar.Gegner, please. Auf der Map könnten wir das ohne Probleme mit ein bisschen mehr Leuten spielen.Okay, alles klar.Easy flank, easy flank. Easy flank. Alles tot, excellent.Ich hätte ja gerne eine gescheite Waffe. Das wäre schon. Oh, guck mal, da ist Horst Seehofer. Ich wusste gar nicht, dass der Battlefield 3 spielt.Alter, ich komm mit dem Ding da klar. Nicht meine Kills klauen, Leute. Nicht. Nicht. Oh, nice, huge.Nicht meine Kills. Was ist denn das, was ich da hab? Was hab ich da für eine Waffe?Wollt ihr mich veräppeln? Oh, da kommen Gegner. Horst Seehofer, Alter, lass mir meine Kills.Come on, suppression assist, suppression assist, suppression assist. Der Horst, ey. Der Horst, ich fass das nicht.Der Horst. Der Horst macht einfach hier die Kills.Okay, ich glaub, hier kommt nichts mehr. Jaja, wir spawnen jetzt da hinten schon.Oh, nice hier jetzt, Leute. Jetzt wird's gebasht. Oh, jetzt wird's gebasht, jetzt wird's gebasht, gebasht, gebasht, gebasht. Bäm. Spast. Gespast ist er, ey. Er wurde gespast.Okay. Oh nee, da kommt ein Gegner auf der anderen Seite. Oh, ich muss weg.Weggespast.Da kommt ein Gegner. Oh, wir haben eine gescheite Waffe, Leute. Ich glaub's jetzt, wir haben eine gescheite Waffe.Nice, nice, nice. Ne Skar. Oh, nein, jetzt bin ich in den Gegner gesprungen. Ich kack, kacknubisch. Aber guck mal, hier 51. Das muss mir erstmal einer nachmachen.Der Max kann's noch.Moment, da war ein Gegner.Was haben wir jetzt? Leute, was ist das? Was ist das? ACR? Nee, TAR. TAR-21. TAR-21? Was ist TAR? Ja, M-TAR-21. Poggers. Exquisite war das.Boah, wie das zieht, ey.Was haben wir jetzt? Ich die Waffen alle nicht mehr kennen.Ich kenn die Waffen alle nicht mehr. Monka. Monka Giga, ey.Okay, was haben wir denn jetzt gerade? Skar.Alter, was sind das für Kackwaffen? Wer soll denn damit spielen? Alter, wer spielt denn damit? Was ist das? What the hell? LMG? LMG legit?Alter, wer spielt denn mit sowas? Das kannst du doch mal voll vergessen, Alter. Wie willst du damit spielen?Nee, ernsthaft, ey.Nee, ey, das ist doch der Witz. LMG legit. Einfach mal in die Richtung gesprayt. Was ist das? L86? L86?L86, ja, ja, ja. Leute, sind wir Erster? Oh nice, Alter. Wir rasieren.Rasier FPS. 12 Volt. Was ist das? Was ist das für ein Ding? Oh, Singelschuss. Schneiber?Was ist das? Alter, ich kenn die ganzen Waffen nicht mehr. Wahnsinn. M417? Ernsthaft, sowas gibt's?Warum sollte man M417 spielen, wenn man M416 spielen kann? Gibt doch überhaupt keinen Sinn.Oh nein, oh nein. Leute, Leute, wir sind verloren, Schneiber. Ich kann nicht schneiden in dem Game. Ich kann absolut nicht schneiden.Wenn ich schneide, bin ich down.Alter, warum war das kein Treffer? Ist das mit Bullet Drop? Ist das ohne Bullet Drop?Schneiber, wir sind verloren, Leute. Hardscoped, es wird Hardscoped. Warum sind das keine Treffer, Leute?Ernsthaft? Okay. Oh, Shit. Jetzt kommen wir mit dem Granatwerfer.Oh Mann, KS, please. Kein Granatwerfer.Ist das ein Smoke oder was? Die Dinge explodieren ja gar nicht.Ey, die Dinge explodieren nicht. Oh, easy. Messer? What? Ein fucking Messer. Ist das euer Ernst?Wirklich, dass ich ein Messer-Kill mache jetzt, oder wie? Nee, oder? Ernsthaft? Ach, du Scheiße.Ein Messer-Kill. Als wäre dieser Spielmodus nicht an sich schon... Alter, ein Messer-Kill.Der schießt Splittergranaten echt? Was ist der Unterschied? Ich kann mich echt nicht mehr dran erinnern.Okay, okay. Messer-Run. Wie soll das hier funktionieren? Alter, du hast riesige Wege, ey.Den Scheiß hätten sie sich echt sparen können mit dem Messer. Ich meine, fuck.Yeah, fam, du Suckeler. Krase Movement-Skills, Alter. Krase Movement-Skills.Q-Chat. Der Q-Chat hat gewonnen, Leute. Der Q-Chat hat gewonnen. Endlich hat der Q-Chat gewonnen.E-Sport Ready. Who is this guy? Aber ernsthaft, also, die Sniper-Kills, ne?Also, ich hätte wetten können, ich war drauf. Also zumindest, ich habe auch vorbeigeschossen, klar.Ich war bei gefühlt, klar, 90% der Schüsse drauf, aber die haben nix gemacht. Please, andere Map.Habt ihr jetzt gesehen, wie ich's ja outmoved hab hier? Outmoved. Oh, Gunmaster, Epicenter, nice.Wir gucken uns das gleich nochmal im Stream an, ich sag schon mal drauf.Jetzt ist mir egal, ob ich gewinne. Juckt mich nicht. Easy Win. Wir haben den Win schon. Wir haben den Win.Ihr klaut mir doch nicht die Kills, Leute. So unfair. Alle klauen mir die Kills. Sie wollen nicht, dass ich nochmal gewinne.Ich sag's euch, die gönnen mir es nicht. Die gönnen mir es einfach nicht.Die gönnen mir es nicht. Ich hab theoretisch schon 5 Kills gemacht, aber kein Kill wurde mir gegönnt.Die volle Gönnung. Where is he? Epicenter. Ich mag die Map.Wo sieht man nochmal, wie viele Kills man machen muss? Unten? Heißt das jetzt, ich muss 2 Kills noch machen?Ich hab keinen Plan von dem Spiel. Da sitzt er. Da stellt er, der Stelser. Wahnsinn.Stels Action. Ey. Kein Kill wird mir gegönnt.Guck mal hier. 2-3-0. 0 hat Twitch Prime. Danke schön. Ey. Ich komm mir verarscht vor.Jawoll, aber ich hab den Kill wenigstens. Achso, auf welcher Stufe das ist. Ah, verstehe.Noch mehr Kills mit dem Crap. Die ersten sind schon auf Assault Rifles und alles.Achtung, Achtung. Ey. Please. Gönnt mir Kills. Alter.Aber wenn der Minimap steht, zahlen. Ah, verstehe. Jawoll. Alter, PP-Guard.Ich komm mir dem Ding nicht klar, weil das nicht direkt auslöst. Ich komm mir dem Ding wirklich nicht klar.Das ist, wenn du da hinziehst, das... Ja, ich hab 15 Millisekunden eingestellt.15 Millisekunden. Beweger-Aim. So sieht's aus, Leute. Achtung. Massive-Flank. Massive-Flank. Massive-Flank-Action.Nichts hittet. Letzte Runde gewonnen und jetzt gräbs mir mit 4-7 rum.Wie, das war kein Kill?Alter, what the, what the hell?Jawoll. Ey, wir haben eine automatische Waffe. Nice.Ah gut, der Typ, der ist ja noch, der ist ja noch, hat ja noch weniger Kills.Alright. Auch von hinten wird, wird, wird sich angestellt.Jawoll. P90. Jawoll, jetzt wird gerusht, Leute. Jetzt wird gerusht. P90-Rush ist real.Oh. Haben wir uns gerade gegenseitig umgespaßt? Kann das sein? Haben wir uns gerade gegenseitig umgespaßt?Ich hab nur noch mal einen Schuss-Sound gehört und es war vorbei.Okay, wir holen auf, Leute. Ich sag's euch, wir holen auf. Wir holen jetzt auf. Easy-Easy-Win. Easy-Win mit der Spaß.Nee, nee, hier können wir nicht lang. Wir müssen irgendwo in die Mitte.Keiner da. Achtung. Alter, das ist ja Wahnsinn, ey.Es ist ja fast schon, es ist ja fast schon Call of Duty TDM hier. Okay, hier können wir nicht lang, hier können wir nicht lang. Ja, ja, ist gut.Nein, nein, nein, hier können wir nicht lang mit der Spaß.Alter. Einmal drauf, noch mal drauf. Please, game. Das ist bestimmt ein Mod. Das ist bestimmt ein Mod.Der hat gemerkt, dass ich die letzte Runde gewonnen hab und jetzt hat er sich gedacht Bam, Max, jetzt nicht mehr.Ist so, ist so. True, null W. Moment, Moment, Moment. Ich weiß, was wir jetzt machen. Wir machen die Flank-Action auf Doom.Please, game. Lass mich doch irgendwas killen. Was soll ich denn noch machen? Was soll ich denn noch machen außer da draufschießen?Alter, 29 jetzt. Viel Spaß, der Tooth muss besser killen machen. Nee, nee, nee, da gehen wir nicht lang. True, null W. Haben wir eine Granate? Nee.Das wäre zum Beispiel ein guter Mod. Also hier könnte man gut ansetzen für einen Mod und einfach Gungame ein bisschen weniger ppega machen.Please, komm los mit dem Kill. Könnte Gungame echt ein bisschen weniger ppega machen.Ja, ist alles tot, wenn ich hier anrücke. Okay. True. Okay, der Messer Dude braucht halt noch ein bisschen.Oh nein, der Messer Dude hat es geschafft. Shit. Okay, eine Runde spielen wir noch. Eine Runde Gungame spielen wir noch.Was geben wir uns denn danach? Danach, ich will danach unbedingt mal Rush Night Mode spielen, falls es einen Server gibt.Wie findest du Venice Unleashed bis jetzt oder Venice Unleashed? Extrem nice. Poggers finde ich das. Poggers.So eine geile Runde und jetzt sowas hier. Okay, eine Runde Gungame machen wir noch.Seit acht Jahren bist du relativ lange dabei. Ich meine, es kann vor 2010 keiner am Start gewesen sein auf YouTube, da gab es den Channel noch nicht.Okay, Map. Wo gehen wir lang? Okay. Einfach, einfach random geradeaus. Easy.Wo immer die Gegner herkommen, irgendwo, irgendwo von hier kommen sie.Jawoll, ich habe einen Kill. Easy, doppeltes. Auch noch doppelt Headshot in your face. So geht es gut los. So geht es gut los.Ich finde ja die besten Maps für Gungames sind die Close Quarters Maps.Fuck, da habe ich veraimt. Aber Close Quarters ist das Nice, das Nicest. Die sind nämlich die Maps auch irgendwie für ausgelegt auf sowas.Oh Mann, diese Auslöserverzögerung killt mich.Das beste Pistol in dem Game ist immer noch die G18.Das beste Pistol ist die G18. Da kann mir keiner was erzählen. Ich darf wieder nichts killen, alles klar.Die ersten haben schon wieder Assault Rifles eher. Sucker Modus, Sucker Modus.Seit Battlefield 1 Videos? Ätzhaft? Ich habe Battlefield 1 Videos gemacht, ich habe das Game doch gar nicht.Fuck, irgendwo hinter mir stellt es da rum. Wir haben aufgeholt ein bisschen. Man muss diese Pistolphase irgendwie hinkriegen.Und das Game spawnt einen viel zu weit außen. Es ist ja 30 Kilometer unterwegs bis du irgendwo bist.Also Gun Game ist echt der optimale Modus für die Close Quarters Maps. Da oben ist ein Gegner und auf der anderen Seite.Oh, es ist Spaß, Spaß, Alter, Spaß. Okay, Spaß. Das ist nicht der neue Mod, das ist aber, also ja, das ist der neue Mod.Das ist aber, glaube ich, ein klassisches Gun Game, das ist so wie immer. Nur, dass der Blaufilter weg ist.Ey, die Spaß, die soll die Schwann hinten, Alter. Die soll die Schwann hinten gefälligst, wenn ich im Nahkampf auf dich draufballere.Wozu ist die denn sonst gut?Pepega, ey. Richtiges Pepega Game. Hallo, runter. Massive Pepega-Stellz. Und man kann nicht mal bei den Leuten spawnen.So, also das ist wirklich was, wo man als Modder einen richtig geilen Modus drauf machen kann. Erstens die Leute ordentlich spawnen lassen. Wieso? Waffen Rotation ändern.Okay, hier kann ich nichts machen, bin ich zu weit weg. Generell Waffen ändern.Ich meine, so ein richtiges Pepega. Wer da oben sitzt mit dem Assault Rifle, der ist einfach easy win, easy life.Oh, jetzt haben wir einen Assault Rifle. Ist das so mit dem Kopf, mit der Magne? Was ist denn das? Hab ich eine ACR? Ist das eine ACR? Gerne.Oh.Was haben wir jetzt? Scar? Scar?Na Leute, kaum haben wir eine gescheite Waffe, geht's ja auch.Wir gehen jetzt einfach hoch ins Haus, Beste.Okay, wir müssen hoch ins Haus, wir müssen hoch ins Haus, unbedingt. Unbedingt.Noch eins hoch, noch eins hoch.Okay, Sucker Weapon. Weil hier oben können sie nichts machen.Please, lass mir doch mal was da.Kann man hier oben aus dem Fenster stelzen? Fenster gucken oder so?Oh, LMG legit, LMG legit. LMG legit, was sollen wir jetzt machen?Pass mal auf hier. Bisschen risikoreich, wo wir da gerade rumstehen.Okay, ich muss runter, ich muss runter, hier siehst du nichts, hier siehst du nichts, hier siehst du nichts.Jawoll, jawoll. Kommt jetzt Schneiber oder was ist das? Was ist das?Ah, das ist 417 mit da.Okay, Bullet Travel Time. Kommt her, kommt her, kommt her, kleinen PP Gas.Erstmal, erstmal schön weg Schneibt.Ich hasse Sniper. Warum sind das teilweise keine Kills?Oh nee, der eine ist schon mal 30 Kills. Please, lass mich doch was killen. Jawoll, jetzt hier, Grenade.Massive Nadespam, der Poggers Nadespam ist am Start. Ich spamme einfach Nades rein.Bam, oh nee. Okay, YOLO Messer. Nein, der YOLO Messer-Modus hat nicht geklappt.Nice, wenn dir das Weihnachtsvideo gefallen hat. Pogchamping.Ey, wie soll man hier einen Messer-Kill machen? Please. Wie soll man hier einen Messer-Kill machen?Moment, der ist mit der R93 am Start. Also ich betrachte mich einfach als Gewinner, weil Messer-Kills nicht gehen.Alter, Messer-Kills.Kannst dich mal richtig anstelzen hier. Okay, Achtung, der da jetzt. Der Dude, der jetzt hier kommt.Alter, wie soll ich hier Messer-Kills machen? Wie, wie? Oh nein. Alter, kommt er. Achtung.Bam, easy Messer-Kill in your ass, Alter. Easy clap.Ja, ich würde das Messer ja werfen. Ja, es wäre das Gun Game auf, ähm, auf einer Close. Ich guck mal, was für eine Map jetzt kommt.Pausierungs-Champ. Easy, ihr wisst ja, ihr wisst ja, wie das ist, Leute. Wenn man gewinnt, wenn man gewinnt, ist das prinzipiell easy.Und ansonsten cheaten die anderen. Sind wir uns einig, oder?Jawoll. Was kommt denn für eine Map? Please, eine gescheite Map. Irgendeine Close Quarters Map.Pass auf, jetzt kommt wahrscheinlich Caspian Border Gun Master und dann einmal über die ganze Map rennen.Tuller Market. Tuller Market ist auch Epicenter-Dings. Aftermath DLC, oder?Was waren das für Maps? Ich kann mich so gar nicht mehr dran erinnern.Aber fällt euch auf, wie neu das Spiel aussieht ohne den Plaufilter.Sagen wir mal, ist da ein Gegner in uns gespawnt gerade?Da ist ein Gegner in uns gespawnt. Was?Ich brauche Leben.Saka-Waffe. Ich komme mit dem Ding null klar, mit der Waffe.Ok, nice, nice. Post-Champ, Post-Champ.Ok, wo ist der Dude? Da oben. Wie kommt man hier rauf? Treppen-Champ.Oh, habt ihr den gesehen? Was? Ein Aimer-Dude, hä?Massive-Aimer-Dude.Was ein krasser Dude. Du hast nur vor Schreck abgedrückt.Ich habe schon in die Richtung geschossen. Ganz random war es nicht.Pass auf, und jetzt kriegen wir wieder keine Kills mit der Shotgun.Jetzt kriegen wir wieder keine Kills mit der Shotgun. Ich sehe es schon kommen.Übelsgeil geowned. Kleiner Speichern. Übelsgeil geowned, aber nee.Bashed würde ich mal sagen.Achtung, Achtung. Flankierungs-Stells. Flank-Stells.Nichts mehr darstellt. Nice.Alles tot. Nice geflankt.Oh, Post-Champ, Post-Champ.Nein, da sitzt er noch. Ich dachte, er ist weg.Jetzt kommen die dreckigen Shotguns.Aber das ist eine Map. Die geht. Da kann man das drauf spielen.Alles danke. Alter, lass mir Kills, please.In den Kopf gespasst.Der letzte Kill muss ein Messer sein, ja. Deswegen kannst du die ziemlich gut aufholen.What? Alter, die gönnen mir nichts. Leute, die gönnen mir nichts an Kills.Bäm, jawoll. Die gönnen mir nichts.Da auf dem Dach. Dach-Stells. Nice Dach-Stells. Easy.Okay, wir gehen in die Mitte. Wir müssen uns beeilen. Die sind uns auf den Fersen, Leute. Die sind uns auf den Fersen.Was? Instant Replay ist off? Nvidia, please. Was ist mit euch los?PP-Gas, Alter. Jetzt hat einfach mal ein Shadowplay ausgeschaltet. Warte mal, ist die Festplatte voll?Nö. Einfach so. Hat sich gedacht. Hat sich gedacht, jetzt ist eine gute Zeit, Shadowplay auszuschalten.Aber ich hab's ja im Stream, ich hab's ja im Stream, kein Problem.Da ist doch ein Dude in deinem Auto gewesen gerade. Ist das die auch hier?Lulwee, wo kommt der her? Festplatten League, oh fuck. Jetzt ist es raus, Leute. Ich hab eine D-Festplatte.Fuck, und jetzt? Was mach ich jetzt? Wie kann ich dieses League jemals wieder gerade rücken?Jetzt ist es vorbei. Jetzt legit, legit vorbei. Weil wir rennen hier einfach gerade richtig PP-Gas durch die Mitte, ne?Ich seh dich nicht, Alter. Ich seh dich nicht. Okay, nice kill assist. Oh, oh, pause jam.Okay, keine Ahnung, was da abgeht. Ich bleib jetzt hier einfach stehen, das ist eine ganz gute Pose.Warum aimt man so krass schnell mit dem LMG? Guckt euch das mal an.Massive-Aim-Champ. Das war kein Kill. Lul. Ja, klar.Ich muss noch ein PC vom Media Markt holen. Ja, genau.Kill assist, kill assist, kill assist. Jawoll, kill assist, kill assist, kill. Sicherlich auch wieder kill assist.Einfach kill assist.Okay, wir stellts jetzt durch die Mitte. Mitte stellts.Alter, gönnt mir doch was. Gönnt mir was. Jawoll.Okay, ich seh nix. Ich seh nix vor lauter Sand.Alter. Guckt euch das mal an. So ne nice Runde, ne? Und random irgendwelche...Ah, Mr. Army ist vor mir. Okay, ne, der ist gut, den kenn ich. Den hatten wir schon ein paar Mal in-game.Aber viel Spaß, du musst jetzt besser Kills machen, Lulwe. Good job. Good luck. HF.Äh, okay, war's wahr. Battlefield, gut. Gibt keine Kills.Okay, M416, easy.Okay, alles klar. Ah, shit. Mann, mittleren Alters tilted beim Ego-Shooter. Mann, mittleren Alters owned junge Tryhards, würde ich eher sagen.Leute, lasst mir doch mal irgendwas übrig.Ey, ist das krass? Please, willst du was? Ja, na klar. Zweimal reingeschossen, nicht ein Hit-Rack.Es ist halt Battlefield, wie sagt man schon, wie es lebt und leibt und lebt und lebt und lebt und liebt und... Ach, keine Ahnung, gewiss, was ich mein.Jetzt geht einfach wieder nix, ne? Krass geowned und jetzt... Oh ne, Schneiberman. Schneiber, oh Gott, der Schneiberman ist am Start.Mann, mittleren Alters werden Kills gestohlen, ja. Aber richtig close.Oh fuck, habt ihr gesehen, wie explodiert ist der Typ? Der ist einfach geplatzt.Aber ist das die China-Sniper, oder? Die China-Sniper.Was? Alter. Kill-Steal. Bam, nice. Flick-Sword.Nicer Kill-Steal, GG. By the way, wer hat sich diesen Drecksgranatwerfer ausgedacht, ne? Der wirft ja keine Granaten, der schießt ja Handgranaten, das ist richtig dumm, das Ding.Das ist richtig pepega, das Teil da. Richtig pepega, das Ding. Wie soll man damit was töten, ne? Guck mal, und Mr. Army ist beim... ist am Start mit dem Messer. Das ist das neue Addon, ja?Aber kann man besser, kann man Direct Impact machen mit dem Nade-Launcher?Damit tötest du doch nichts. Nein. Ich hab ihn vor mir in Messern sehen. Das ist we nice, korrekt, Salomon, we nice.Also, diesen Modus könnte man nochmal ein Vielfaches besser machen, wenn man die... wenn man... also Messer und Granatwerfer... ne, lass den Granatwerfer drinne.Okay, lass den Granatwerfer drinne, aber mach nicht den Granaten... also nicht den Granaten-Granatwerfer rein, sondern den Frag-Granatenwerfer, damit kann man wenigstens was killen.So, und macht vielleicht die DMR und Sniper-Sachen weniger und Messer weg. Dann ist das ein richtig poggers Modus.Der Granatenwerfer wirft Granaten... ja, es gibt im Battlefield, du hast Smoke, Smoke-Granatenwerfer, so ein Shotgun-Granatenwerfer, wobei, ne, der ist glaub ich nur Underbarrel, ne?So ein Frag-Granatenwerfer, der direkt explodiert... also der Granaten-Granatenwerfer ist halt... der verschießt Handgranaten. Das ist... oh nein, Siebertauer, ne, ist das Siebertauer?Also der verschießt Handgranaten, wie ne richtige Granate, also richtig dumm, die explodieren auch nicht gleich. Die Frags, die explodieren wenigstens gleich.Ne, Messer ist dumm. Ganz ehrlich, Messer ist dumm, du rennst teilweise 3 Stunden rum.Oh, Alter, der wills aber wissen. Hatte Gunmaster nicht mehrere Presets? Durchaus möglich, aber das sackt gerade. Alter, die Dudes, was ist hier los?Wo bin ich jetzt? Skill-Best-Matchmaking-MLG-Finals oder was hier gerade? Da Jumpshotten so um die Ecke, the fuck?Jumpshotten um die Ecke? Die Jumpshotten einfach um die Ecke? Auf dieser Map kann man schwitzen kommen, aber heftig, ja. Vor allem wenn man diese Dreckswaffe hier hat.Schreckt, Alter, schreckt. Each in your face schreckt. Bam, in den Kopf, Alter.Wie, alles weg? Wie, alles weg, jetzt wo ich da bin, alles weg? Oh nix wie fort hier, ich hab ihn gesehen da in der Mitte. Treppe.Die Map ist geil, die Map ist geil, ewig nicht mehr gespielt, aber die Map ist geil. We nice. Oha, hinter mir einfach.We nice unleashed. Ich blicke nicht mehr durch, das ist zu viel hier. Gerade, das ist zu viel.What is happening? Ah fuck. We nice unleashed ist am Start.Ja klar, spawnen sie zu dritt vor mir und schießen sie in den Kopf. Sehr gut, sehr gut Battlefield. Nice. We nice, um nicht zu sagen we nice.Spaß, Alter, jetzt kommen die Spaß. Spaß auf der Map ist richtig Spaß, Alter. Massive Spaß. Ja klar. Huge, huge Spaß.Alter, der erste ist schon mit 17. Das sind die Zebra Tower Experts, 24 in Zebra Tower, GG. Zebra Tower for life, sie haben das im Game Attack gehabt bei der Xbox.Reload in der Dusche, exquisite.Okay, ACR, jetzt sind wir wieder competitive. Jetzt können wir wieder was machen. Fuck. Ich hätte aimen sollen, Spell Field, da kann man aber eigentlich aus der Hüfte sprayen.Wir sind nicht so gut, wir sind nicht so gut gerade. Was?Ich bin verwirrt. Alter, das Game macht mich fertig. Die ist anstrengend, die ist echt anstrengend. Die Map ist anstrengend. Was haben wir denn? ACR. Okay, ACR kann man sprayen, ACR kann man sprayen.Ja, die Map ist der Wahnsinn von allen Seiten.Was ist das? Ta?Monarch.Die Map ist stressig, die Map ist Stress pur, Leute.Fuck. Alter, Mr. Army, der hat es drauf hier. Der hat bestimmt früher Zebra Tower 24 in Zebra gemacht.Na klar, na klar, na klar.Kein Kill, Alter, was ist das? Klick, klick, klick, klick, klick, klick, klick, klick, klick. Go, go, go. Hier, dafür kannst du dir einfache Messerkills machen.Delete, Alter. Wir haben 20, der ist schon mit 30 am Start, Alter, what the fuck.Kommst du, kommst du raus? Kommt ihr, kommt ihr, ich bleibe jetzt einfach hier. Kommt her, kommt her, ich will, ich will.Okay. Er muss Messerkills machen.Okay, Leute. Wir schauen jetzt, was es noch für Server gibt.Das ist aber anstrengend. Also, Zebra Tower Gun Game. So, was haben wir noch Schönes?So. Was war denn das? Conquer, Rush. Hardcore Medics.Okay, 64 Mann ist mir zu viel. Gun Master Map Rotation. Ach Quatsch, ich kacknup, das ist doch gerade wo wir drauf gewesen sind.Oh, was jetzt? Es geht Glas kaputt. Es geht ganz viel Glas kaputt in Battlefield gerade. Der Plaufelder ist eine Server Einstellung, ja?Scrap Metal. Quatsch, was war das nochmal für eine Map? Ach, das Ding, Alter, die Spawnen. Hey, lass mich nicht nach vorne, ich will nicht vorne hin.Ich will nicht vorne hin. Faire Spawn, Faire Spawn würde ich sagen. Oh, ist das Faire Spawn. Massive Faire Spawn.Oh Leute, mein Hirn ist kaputt, ich kann immer. Ich kann kein Gun Game mehr spielen, ich brauch was anderes.What the fuck? Soll ich den noch machen oder drauf schießen?Ich muss was anderes spielen gleich. Letzte Runde Gun Game, ich krieg keine mehr. Es ist zu anstrengend.Ich bin halt mittlerweile 36, da geht es nicht mehr.Okay.Hier fallen sie alle um mich um. Mr. Army wieder hier. 9-1-0-W. Ah nee, wir sind auch später reingejoint.Aber trotzdem.Wo sind denn Gegner? Hallo? Haben wir mal ein paar Gegner? So zur Abwechslung?Ein Gegner, please. Gegner? Gibt's nicht.Gibt's keine. Ist das das, was die mit vertikales Gameplay meinten früher? So vertikal, dass du keinen Gegner findest?Ich kann ja mal spielen, der Modus. Ich muss raus, ist mir zu anstrengend. Mr. Army easy win. Die Runde haben wir schon gewonnen.Okay, alles klar. Gibt's nichts. Ich hab gedacht Battlefield kann auch so öfter schießen. Was spielen wir denn danach? Wir brauchen irgendeinen anderen Server.Übrigens auch eine Sache, die man nur auf dem PC machen kann, dieses rumgesperrmen nach links, rechts.Leute hat irgendjemand eine Ahnung, was ich da für eine Waffe hab? Ist das die Wal als VSV? Was ist denn das?Das Wal? Da gehört mir nichts. Hier gehört mir alle nichts.Was ist das normal für eine Waffe? Engineer? Der Mr. Army geht ab. Ist das Engineer Waffe?Nee, das ist keine PDW. Das kann wirklich PP-19 sein. Ach, das ist so eine Waffe, die für alle ist.Okay. Boah ey, das ist mir zu anstrengend. Also letzte Runde Gun Game. Die Wins waren ultra nice, aber auf der anderen SeiteWenn die hier nicht gleich... Ja, na klar. Ich hab Legit vornehm gestanden und ihm mit der Spass ins Gesicht geschossen.Nichts passiert. Man müsste Army schon wieder bei 19. Aber wenigstens, wenigstens ist das ein Team-Win.Ich hab keine Ahnung, wo hier was abgeht, aber zumindest ist nichts hier.Ich kann mir vorstellen, ohne Mist, wenn man Gun Game öfter spielt, dann weiß man, wo man lang rennen muss. Mein Problem ist ja aktuell, ich hab null den Flow drinnen, wo hier was geht.Ist er beim Messer? Oh, er ist beim Messer, null. Jawoll, er hat in your face. Okay Leute, ich muss auf den anderen Server. Das wird zu anstrengend. Das ist mir zu anstrengend. Das pack ich für meine alten Tage nicht mehr.So, was haben wir denn zu bieten? Hardcore Demoman Peak Rush. Wir gucken nochmal, was es für Nachtmaps gibt. Das war spitz am nicest.Bei einem Schuss hast du direkt hitted.Okay, komm, wir gehen uns nochmal kurz ne Runde.Also, wenn es einen Mod gibt, wo man Custom-Waffen-Rotation machen kann, dann würd ich mir sogar nen Gun Game Server holen. Irgendwas, was halt nicht ganz so random ist.Äh, äh, äh, äh.Konnte man eigentlich hier hoch springen? Wow.Okay, easy win. Also, auf der Map bringt das Nachtsicht-Visier meiner Meinung nach richtig was. Weil hier hast du mit Mündungsfeuer im dunklen. Du siehst die Gegner nicht.Also, hier find ich's nice. Ich mein, es geht, aber hier lohnt sich. Auf den anderen Nachtmaps sind eigentlich hell genug.MonkaS, was war das denn gerade?Okay. Danach kommt's Infrarot-Visier raus, Leute. Ich sag's euch.Mit Mr. Ami bist du wieder am Start eigentlich. Ich kann den Squad wechseln. Sieh mal. Ein nicest Teammate.Ach, du bist Russ. Russland.Du bist kein Comrade. Äh, ich switch einfach rüber. Easy. Ah, nee. Team-Switching ist disabled.Keg-Tribble-Ur. Kids-Switching ist das. Okay, easy win.Mal gucken. Lul, wie größer Keg-Way ist im Gegner-Team. Nice. So muss es sein.Ja, es gibt ja keinen gescheiten Server. Ich hab nichts gefunden. Rush war so was ganz bescheuertes mit Headshot, One-Shot-Headshot.Ja, wenn's wieder einen Cat24-Live-Server gibt, bin ich sofort am Start.Alter, mir ist übelst zu warm hier, ey. Stimmt, ich könnte mir einfach einen leeren Server suchen.Ja, warte mal, ich guck mal, was für eine Map als nächstes kommt. Ich guck mal, was für eine Map als nächstes kommt.Wenn ich da keinen Bock drauf hab, dann füllen wir irgendeinen Rush-Server.Ich muss die nur füllen. Easy, machen wir gleich. Sand-Crossing.Okay, Moment. Das spielen wir jetzt noch.Oder wie viele Tickets hatten das? Wie viele hatten der? Wie viele Tickets hatten das Ding?Ich war jetzt nämlich kein Bock auf ein 20-Minuten-Game.Gibt's so was wie Info? Man sieht ja noch was.Nice Spawn. Exquisite.Perfekter Spawn.Ein extrem nicer Spawn.300. Oh, das ist ein bisschen viel. Nee, ich glaub, das spielen wir jetzt nicht mehr.Wir gehen auf den anderen Server.Mal kurz hier schnell was bashen oder gebashed werden.Hier oben geht's ja gerne mal lang.Da kommt gleich von unten was. Den werden wir jetzt erfreuen.Mit der G18 ins Gesicht ballern.Jo, Leute, wir füllen den anderen Server.Night-Time, Night-Time. Mach was Neues. Das brauch ich auch.Ich brauch ja ein bisschen Gameplay-Material.Da ist einfach cooler, wenn's Night-Time ist. Das ist was Neues.Also, dann suchen wir Game Mode.Rush, Rush.Der ist, der ist, glaub ich, schnell.Ach so, okay, dann warten wir kurz.Der da, ne?Also, das heißt, der restartet gleich mit mit oder restart die Runde neu mit mit Night-Time.Ach komm, du bist ja sogar bei mir im Team. Nice, exellent.Jetzt gibt's Richter. Ach so, ach so, da boot sich der Server neu. Okay, verstehe, verstehe.Klar.Ja, dann warten wir kurz, bis er wieder da ist.Top, morgen mach ich ein Video zu NS Unleashed Night-Time Maps. Ich hab jetzt genug Gameplay.Da ist er.Ich hab jetzt genug Gameplay für...Noshark, Candles, Gone Dark, Gone Wrong, Gone Sexual kommt da in den Titel.Dann wird geklickt.Startet jetzt eh neu, ne?Ami, ich will zu Mr. Ami.Kann man Teams wechseln?Mr. Ami, ich wechsle jetzt einfach zu dir rüber, Null W.Oh nein, Team Switching ist disabled.Jetzt haben wir die ganzen Poggers-Spieler gegen uns.Oh, Defender. Captain Poggers ist da. Okay, easy win.Easy win.Sag mal, die Maps, ne? Die haben nix an den Maps geändert, oder? Die sahen schon immer so geil aus Night-Time.Oh, mein Finger juckt. Jaja, A ist egal.Oh, die sind schon drin. Oh, Leute, please. Was ist jetzt hier?Beste Name im Spiel, keckw0w.Bester. Es ist ja auch true. Es ist ja auch true0w.Das ist halt echt so. Das ist halt echt so.Es ist Fakt0w größer keckw0w. Ist einfach so.Ist einfach so.Ist einfach die Wahrheit.Wo ist denn der krasse LLW, Dude?Oh, da ist er. Da ist er. Der LLW, Dude.Unlucky, unlucky. Immer alles unlucky.Äh, was? Battlefield, Battlefield, was möchtest du mir sagen?Battlefield, was möchtest du mir sagen gerade?Any primers? Das ist das, was mich interessiert.Die keckers jucken mich nicht so, aber die primers interessieren mich.Oh nee, die sind schon rumgestellt.Keine keckers. Geh mal weg hier. Achtung, Achtung, Achtung.Big, big plane moves kommt jetzt.Oh, wir haben uns gegenseitig gepackt. LLW keckwer hat mich gekillt.Ich würde sagen, die Attacker sind ein bisschen besser.Oh fuck, ich bin in die falsche Richtung. Ich dachte, hier sind die Attacker.Und jetzt ist der LLW, Dude, wieder da. Jetzt, wo ich Engineer rausgeswitcht habe.Was ist mit dem Wasser los? Es ist Nighttime. Es ist dunkel auf der Map.Da rechnet die Battlefield Engine nicht mit. Deswegen sieht es so ein bisschen kacke aus.Sag mal, ist aus irgendeinem Fall ein Grund, ist das Spotting aus?Oder ist das Spotting irgendwie anders?Das Spotting kommt mir übelst merkwürdig vor. Du guckst in die Gegnerrichtung, drückst Q und irgendwie wird nichts markiert.Oder es ist Spotting drin, aber das ist irgendeine andere Sorte von Default Spotting.Nicht 3D Spotting, sondern normales.By the way, das ist absolut Spaß befreit gerade.Metal, nix Metal hier. Müssen wir die nächste Runde mal ein bisschen anders machen.So, ich probiere es noch mal als Engine.Pass auf, hier kommt es gleich um die Ecke gestellt. Die warten schon da unten.Naja, ich probiere gerade, wir müssen irgendwie den LRV kaputt machen. Sonst funktioniert das nicht.Die treffen alle so gut im Vergleich zu irgendwelchen Random Dudes.Oh, er ist down.Lass mich doch mal reinspornen.Was ist denn hier los? Du kannst auf die Gegner schießen und auf einmal wirst du von allen Seiten gebashed?Richtig cute Chat, cutest Chat.Leute, da musst du drauf pushen, in your face.Also das einzige was wir machen können ist B-Defenden, was anderes geht hier gerade nicht.Was? MonkaS?Ja klar, aber ich meine immerhin, jetzt kommt der Rats Train, jetzt kommt der Rats Train.Ich hätte Granate reinschmeißen müssen vorher, da hätten sie nicht hinterher raschen können.Ah, der Captain Peng macht das jetzt.Okay, mehr kann ich nicht killen gerade.MonkaS, da leben ja immer noch welche.Cobol ist richtig geil, habe ich gehört. Wo hast du das gehört?Aber Hauptsache ich bin erster, der Rest interessiert mich nicht.Okay, mehr Kills als die OP Attacker, easy, easy.Okay, easy loss, easy loss.Ich meine, Battle Log hatte einen Vorteil. Man konnte, wenn man sagt, ah nee, ist nicht so meins, man konnte einfach ins Battle Log gehen.Und sagen, easy Server suchen für nächste Runde. Das war cool.Ich überlege mir gerade, warum man sich dafür entschieden hat einen In-Game Server Browser zu... wahrscheinlich weil man keinen Bock hatte Battle Log nachzubauen.Gehe ich mal von aus. Battle Log API nachbauen, was man braucht, dass es funktioniert. Ich glaube, da hat keiner Bock drauf gehabt.Zumal Battle Log bei Release, weiß ich noch, bei Release wurde richtig rumgeflamet. Battle Log, so eine Scheiße, das muss man bei einem Browser machen.Dabei, also im Nachhinein betrachtet, ist Battle Log eigentlich ganz cool gewesen.Ich würde ja jetzt LLV fahren, aber ich kann kein LLV fahren, weil ich kein Equipment ausgerüstet habe für LLV.Und bis ich das ausgerüstet habe, geht die Runde schon los.Man hätte eine Battle Log Erweiterung.Ja, das hätte man machen können. Wobei man braucht auch Battle Log gar nicht mehr installiert, oder?Ok, jetzt haben wir ein Problem.Richtiges Mindset, genau das richtige Mindset brauchen wir.Oh, die pushen hoch. Ich habe da eine Granate getroffen, die pushen hoch.Alter, aber man merkt die Tickrate. In einem normalen Battlefield wäre ich jetzt tot gewesen.Und man merkt doch, dass die Gegner gut sind, weil die haben ganz gutes Timing. Auch was Peaks angeht, das haben die normalen random Dudes nicht.Ja, A ist egal. A juckt nicht.Ach, 3D-Spotting ist aus. Jetzt kapiere ich das auch. Ich wundere mich als, warum das so komisch ist.Alter, wo stehen wir denn hier?Boah, der Dauman. Ich kriege hier Anfälle.Aber Captain Paul, du hast eine gute Pose. Trepp dich. Aber ich muss dich gar nicht treppen.Ich finde das Battlefield 3 ist echt schwierig ohne richtiges Spotting.Jetzt bräuchte ich das Infrarot-Gunner. Wobei gibt es überhaupt einen Infrarot für einen Gunner?Weil ohne Spotting, du siehst nichts. Du hast keine Ahnung, wo du Gegner rumstellst.Ich gehe mal kurz ans Seitenfenster.Ich würde dich jetzt retten.Das Problem ist in der Nacht, dass du gar nichts siehst. Du findest noch nicht mal Gegner.Gerade weil es dunkel ist, hast du recht. Es ist nicht schlecht ohne 3D-Spotting.Wir verwenden Infrarotgeschiss. Dafür ist es ja letztendlich da.Eigentlich ist es ganz gut. Battlefield 3 ohne Spotting. Du hast mal Squad gespielt.Das kann man nicht vergleichen. Das sind zwei unterschiedliche Spiele. Du hast mal Schach gespielt.Das ist genau so ein geiler Vergleich. Wie kann man Schach ohne 3D-Spotting spielen?Wir müssen das balancen. Das macht keinen Spaß.Die nächste Runde ist.Gestern die Runde war cool. Die war übelst close auf Demavent Peak.Ich habe nichts ausgerüstet für den LV. Ich überlasse das andere.Was ist hier gerade los?Alles Hex. Weißt du wie das ist?Bewegt euch. Nicht stehen bleiben.Wann kommt der Community-Server? Ich weiß es noch nicht.Ich muss mich damit auseinandersetzen. Wie man das macht und ordentlich konfiguriert.Ich muss hier gar nicht raus.Ich spiele doch hier kein CS. Das ist Eckenpieken Deluxe.Wir müssen das balancen. Das macht keinen Spaß.Das ist nicht Hardcore. Man denkt es wäre Hardcore.Nachtsackt nicht. Nachtsackt ist mega nice.Ich werde mich hier hinstellen und warten bis die Runde vorbei ist.Was gibt es hier?Ich weiß nicht mehr wie das ging. Was ist das für ein Kommando für in-game FPS?Render. Ich will mal gucken ob das matcht.Die Info hatte ich vorher probiert.Die Gun-Game-Runden waren anstrengend.Der Mercedes-AMG.Ich glaube das ist trotzdem die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube mehr als 200 FPS reichen wir in dem Fall.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.Ich glaube das war die letzte Runde.", "segments": [{"id": 1, "start": 0.0, "end": 14.0, "text": "Habe mir gedacht, komm, jetzt in den paar Wochen, also eigentlich ist es ja um genau zu sein, eine Woche, wo alle daheim sind, da gucke ich mal, dass ich das nach Möglichkeit mache, dass ich jeden Tag streamsoar."}, {"id": 2, "start": 14.0, "end": 19.0, "text": "Morgen mache ich ein neues Video, weiß auch schon was."}, {"id": 3, "start": 19.0, "end": 26.0, "text": "Übrigens, soll ich euch mal was sagen Leute, soll ich euch mal was poggers-mäßiges verraten?"}, {"id": 4, "start": 26.0, "end": 30.0, "text": "Okay, Twitch hat noch gar nicht kapiert, dass der Stream on ist, dann warte ich noch mal kurz."}, {"id": 5, "start": 48.0, "end": 51.0, "text": "So Twitch, haben wir es jetzt kapiert irgendwann?"}, {"id": 6, "start": 51.0, "end": 56.0, "text": "Nope, Twitch ist wieder geil, Twitch ist wieder offen, zack."}, {"id": 7, "start": 60.0, "end": 65.0, "text": "70720p, Twitch please, komm an."}, {"id": 8, "start": 66.0, "end": 70.0, "text": "Warten wir mal kurz ab, bis es 1080p ist."}, {"id": 9, "start": 74.0, "end": 77.0, "text": "Auf Twitch, 1080p please."}, {"id": 10, "start": 78.0, "end": 80.0, "text": "Excellent."}, {"id": 11, "start": 80.0, "end": 83.0, "text": "1080p, wunderbar."}, {"id": 12, "start": 83.0, "end": 86.0, "text": "Jetzt müssen wir nur noch, jetzt müssen wir nur noch gucken."}, {"id": 13, "start": 89.0, "end": 93.0, "text": "Seit wann macht VLC dann irgendwie so ein komisches Announcement daneben?"}, {"id": 14, "start": 96.0, "end": 100.0, "text": "Wer bei Microsoft oder bei VLC hat sich gedacht, das ist eine gute Idee."}, {"id": 15, "start": 100.0, "end": 105.0, "text": "Guck mal, es gibt jetzt ein Announcement, wenn das minimiert ist, was ist denn das für ein Kack?"}, {"id": 16, "start": 105.0, "end": 107.0, "text": "What the fuck?"}, {"id": 17, "start": 107.0, "end": 111.0, "text": "Was interessiert mich denn, dass da jetzt was anfängt zu spielen, das ist mir doch vollkommen egal."}, {"id": 18, "start": 117.0, "end": 122.0, "text": "Okay, das muss ich dem VLC irgendwie abgewöhnen, das ist ja ultra nervig."}, {"id": 19, "start": 127.0, "end": 129.0, "text": "Wie gewöhnt man das dann dem VLC ab?"}, {"id": 20, "start": 131.0, "end": 133.0, "text": "Okay, dann muss ich mal kurz gucken, dann legen wir los."}, {"id": 21, "start": 133.0, "end": 141.0, "text": "VLC, Loop, Announce, Windows, Disable, nicht nach was ich suchen soll."}, {"id": 22, "start": 143.0, "end": 147.0, "text": "How to disable pop-up track notifications, okay."}, {"id": 23, "start": 149.0, "end": 151.0, "text": "Okay, Moment, wo muss ich hin?"}, {"id": 24, "start": 154.0, "end": 159.0, "text": "Preferences, Alter, die VLC-Settings, wer hat stets wieder ausgedacht?"}, {"id": 25, "start": 159.0, "end": 163.0, "text": "VLC-Settings, all, okay und jetzt was?"}, {"id": 26, "start": 163.0, "end": 166.0, "text": "Interfaces, wo ist das denn überhaupt?"}, {"id": 27, "start": 168.0, "end": 176.0, "text": "Interfaces, seht ihr das hier irgendwie, Interfaces, main interface, cute interface"}, {"id": 28, "start": 177.0, "end": 179.0, "text": "und jetzt was?"}, {"id": 29, "start": 179.0, "end": 182.0, "text": "Show notification pop-up"}, {"id": 30, "start": 182.0, "end": 185.0, "text": "Show notification pop-up on track change"}, {"id": 31, "start": 188.0, "end": 190.0, "text": "Seht ihr das irgendwo?"}, {"id": 32, "start": 194.0, "end": 197.0, "text": "Ich sehe diese Option hier gar nicht davon."}, {"id": 33, "start": 197.0, "end": 199.0, "text": "Choose never, ach Moment."}, {"id": 34, "start": 199.0, "end": 203.0, "text": "Show notification pop-up und, ne."}, {"id": 35, "start": 206.0, "end": 208.0, "text": "Seht ihr das irgendwo diese Option?"}, {"id": 36, "start": 208.0, "end": 212.0, "text": "Show notification pop-up on track change"}, {"id": 37, "start": 212.0, "end": 215.0, "text": "Choose never in the drop named Show"}, {"id": 38, "start": 219.0, "end": 223.0, "text": "Ah, Show notification pop-up on track change"}, {"id": 39, "start": 223.0, "end": 225.0, "text": "When minimized, never, bam."}, {"id": 40, "start": 225.0, "end": 228.0, "text": "Sollen wir mal gucken, ob das jetzt funktioniert?"}, {"id": 41, "start": 230.0, "end": 234.0, "text": "Mal gucken, ob der jetzt diesen komischen pop-up da nicht mal zeigt."}, {"id": 42, "start": 234.0, "end": 239.0, "text": "Es blinkt noch, okay, damit kann ich leben, wenn er blinkt, es ist mir ehrlich gesagt egal, ob das blinkt."}, {"id": 43, "start": 239.0, "end": 242.0, "text": "Okay, kann man das blinken noch? Kann man das?"}, {"id": 44, "start": 242.0, "end": 245.0, "text": "Holds, loop, blink, disable."}, {"id": 45, "start": 245.0, "end": 249.0, "text": "Ich habe echt keine Ahnung, warum so ein Plutzin standardmäßig voreingestellt ist."}, {"id": 46, "start": 251.0, "end": 253.0, "text": "How to star?"}, {"id": 47, "start": 257.0, "end": 263.0, "text": "Plex, blink, taskbar, disable."}, {"id": 48, "start": 263.0, "end": 266.0, "text": "On file change, okay, excel, also."}, {"id": 49, "start": 266.0, "end": 270.0, "text": "Disabled, bring to front, what?"}, {"id": 50, "start": 272.0, "end": 275.0, "text": "Race, nach Race soll ich suchen."}, {"id": 51, "start": 275.0, "end": 282.0, "text": "Also ganz ehrlich, so geil VLC ist, aber die Settings sind echt eine komplette Zumutung."}, {"id": 52, "start": 282.0, "end": 284.0, "text": "Wo?"}, {"id": 53, "start": 284.0, "end": 287.0, "text": "Hier, never."}, {"id": 54, "start": 287.0, "end": 289.0, "text": "So und jetzt?"}, {"id": 55, "start": 289.0, "end": 292.0, "text": "Und, und, und, gehts jetzt?"}, {"id": 56, "start": 294.0, "end": 296.0, "text": "Alter, es funktioniert."}, {"id": 57, "start": 296.0, "end": 300.0, "text": "Alter, ey, also VLC-Settings ist wirklich absolute Zumutung."}, {"id": 58, "start": 300.0, "end": 303.0, "text": "Wer sich das ausgedacht hat."}, {"id": 59, "start": 303.0, "end": 306.0, "text": "So, gucken wir mal, ob es gescheite Server gibt."}, {"id": 60, "start": 306.0, "end": 308.0, "text": "Ich habe mir übrigens keinen Server gemacht heute."}, {"id": 61, "start": 308.0, "end": 311.0, "text": "Ich habe heute den ganzen Tag Pokemon-Fake-Game gespielt."}, {"id": 62, "start": 311.0, "end": 314.0, "text": "Dieses Game ist übrigens richtig geil."}, {"id": 63, "start": 314.0, "end": 321.0, "text": "Also wer nach dem Game sucht, wo er ein bisschen solo grinden kann, ist das reine Single, ne, es stimmt nicht, es ist nicht reine Single-Player."}, {"id": 64, "start": 321.0, "end": 327.0, "text": "Es ist, es hat Multiplayer, aber ich weiß nicht, wie oft er gespielt wird, ja."}, {"id": 65, "start": 327.0, "end": 335.0, "text": "Und wer auf so Monster, RPGs und Monstersammel-Games steht und sowas, ist das richtig poggers."}, {"id": 66, "start": 335.0, "end": 338.0, "text": "Sieht zwar alt aus, ist aber neu."}, {"id": 67, "start": 338.0, "end": 340.0, "text": "Hat, glaube ich, 100 Monster."}, {"id": 68, "start": 340.0, "end": 344.0, "text": "Kannst upgraden, kannst skillen, kannst Zeug machen."}, {"id": 69, "start": 344.0, "end": 351.0, "text": "Also hat auch richtig, also extrem, wie soll ich sagen, so tiefes Kampf, also tief gehaltenes Kampfsystem, richtig nice."}, {"id": 70, "start": 351.0, "end": 353.0, "text": "Und kostet nur 29 Euro."}, {"id": 71, "start": 353.0, "end": 355.0, "text": "Ne, 20 Euro sogar."}, {"id": 72, "start": 355.0, "end": 358.0, "text": "Also geschenkt für das Game, echt poggers."}, {"id": 73, "start": 358.0, "end": 367.0, "text": "Also wer auf RPGs jeglicher Art steht und ein bisschen was so mit Retro, Pixel-Look anfangen kann, kann ich jetzt echt nur wärmstens empfehlen."}, {"id": 74, "start": 367.0, "end": 370.0, "text": "Und man siehts hier auch, guckt euch mal die Rezession an, ey."}, {"id": 75, "start": 370.0, "end": 373.0, "text": "Positive, positive, positive, positive."}, {"id": 76, "start": 383.0, "end": 385.0, "text": "Die heulen immer rum, Alter."}, {"id": 77, "start": 385.0, "end": 389.0, "text": "Wisst ihr, wisst ihr, ich muss, ich muss erst mal was loswerden."}, {"id": 78, "start": 389.0, "end": 392.0, "text": "Da, da muss ich, da muss ich auch, da muss ich auch ein Video mal zumachen."}, {"id": 79, "start": 392.0, "end": 397.0, "text": "Ähm, wo hab ich denn hier mein Weihnachtskalender?"}, {"id": 80, "start": 397.0, "end": 401.0, "text": "Mein, wo hab ich denn hier mein Weihnachtskalender?"}, {"id": 81, "start": 411.0, "end": 414.0, "text": "Ey, da muss, ohne Mist, da muss ich echt ein Video zumachen."}, {"id": 82, "start": 414.0, "end": 419.0, "text": "Und zwar, weil mir das echt..."}, {"id": 83, "start": 419.0, "end": 429.0, "text": "So auf den Kicks geht, dass die Leute heute bei jedem Spiel, was nicht offensichtlich easy as fuck ist, rumheulen, dass es nicht schaffbar ist."}, {"id": 84, "start": 429.0, "end": 435.0, "text": "Also wenn das Game nicht so krass easy ist, dass du es auf dem Klo mit der linken Arschbacke spielen kannst,"}, {"id": 85, "start": 435.0, "end": 439.0, "text": "kommst du dann, oh nein, das ist unspielbar, oh, was hat sich der Programmierer nur dabei gedacht?"}, {"id": 86, "start": 439.0, "end": 445.0, "text": "Ich seh das überhaupt nicht ein, mich mit aus dem Game auseinanderzusetzen, soll hier übelst Cry-Action."}, {"id": 87, "start": 445.0, "end": 449.0, "text": "Das ist der Wahnsinn, okay, keine Ahnung, was mit dem Typ jetzt ist."}, {"id": 88, "start": 449.0, "end": 458.0, "text": "Aber wisst ihr, was der schlimmste, also eines der schlimmsten, äh, Simirefuse oder generell Spiele, wo sie abgegangen sind, in letzter Zeit ist das drauf."}, {"id": 89, "start": 458.0, "end": 465.0, "text": "Äh, ich finde, das ist das beste Classic-RPG seit Jahren gewesen, ohne Scheiß, ja."}, {"id": 90, "start": 465.0, "end": 467.0, "text": "Das hier, so."}, {"id": 91, "start": 467.0, "end": 471.0, "text": "Und die haben rumgeweint, Alter."}, {"id": 92, "start": 471.0, "end": 475.0, "text": "Die haben rumgeheult wegen dem ersten Fight."}, {"id": 93, "start": 475.0, "end": 485.0, "text": "Und das Game sagt dir, im ersten Fight, sagt dir das Game, okay, manche Fights muss man mit etwas, ähm, äh, ja, besonderen Mitteln angehen."}, {"id": 94, "start": 485.0, "end": 490.0, "text": "Und man soll mal, das Game sagt halt nicht, diese Gegner sind empfindlich gegen Feuerschaden."}, {"id": 95, "start": 490.0, "end": 505.0, "text": "Dieses, der NPC am Anfang sagt dir aber, äh, so nach dem Motto, nehm besser ein paar, äh, explosive Flaschen mit oder, oder so nach dem Motto, geh zum Alchemist und kauf dir ein paar explosive, äh, Potions."}, {"id": 96, "start": 505.0, "end": 510.0, "text": "So, das sagt dann, das sagt dann der NPC, bevor man in den ersten Dungeon reingeht von dem Game, ja."}, {"id": 97, "start": 510.0, "end": 513.0, "text": "Und, das haben die alle nicht gelesen."}, {"id": 98, "start": 513.0, "end": 522.0, "text": "Und, das haben die alle nicht gelesen. Und da sind sie da beide an, die Leute in den Steam, in den, in den, in den Steam-Reviews, die sind halt an den ersten Spinnen verrecknet im RPG."}, {"id": 99, "start": 522.0, "end": 530.0, "text": "Und haben gleich erstmal, äh, ein Negativ-Review gemacht."}, {"id": 100, "start": 530.0, "end": 532.0, "text": "Das ist echter Wahnsinn, also."}, {"id": 101, "start": 532.0, "end": 537.0, "text": "Mittlerweile, ich halte es, ich, ich kann mir das immer hier angucken, der Kram."}, {"id": 102, "start": 537.0, "end": 544.0, "text": "Dieses wirklich, wie gesagt, Spiel, was du nicht beim Kacken auf der linken Arschpacke spielen kannst, wird rumgeheult, dass es zu schwer ist."}, {"id": 103, "start": 544.0, "end": 551.0, "text": "Absolut Ultra-Kack-Weh."}, {"id": 104, "start": 551.0, "end": 556.0, "text": "Cube World. Irgendwie ist Cube World nicht dieser Minecraft-Clone, der nie fertig geworden ist?"}, {"id": 105, "start": 556.0, "end": 564.0, "text": "Ach doch, Moment, Moment. Cube World ist mittlerweile fertig, aber es ist von dem Game eigentlich nichts mehr übrig geblieben, was es mal gut gemacht hat, ne?"}, {"id": 106, "start": 564.0, "end": 572.0, "text": "Die haben irgendwie alles entfernt, kann es sein? Ich, ich erinnere mich, ich erinnere mich dunkel."}, {"id": 107, "start": 572.0, "end": 576.0, "text": "Hab ich nie gespielt. Wie gesagt, ihr wisst ja, Minecraft ist nicht meins."}, {"id": 108, "start": 576.0, "end": 583.0, "text": "Generell muss ich sagen, also richtig, die meisten krassen Mainstream-Games sind nicht meins."}, {"id": 109, "start": 583.0, "end": 587.0, "text": "So, schauen wir mal, was haben wir hier zu bieten? Player."}, {"id": 110, "start": 587.0, "end": 602.0, "text": "Excellent. Gibt es Nachtmaps? Ich brauche wieder Nachtmaps. Nachtmaps waren so, Poggers."}, {"id": 111, "start": 602.0, "end": 616.0, "text": "Ist ja genso. Also, Night. Wie ist der Kram? Night-Time. Random-Night-Time gibt es auch noch, okay."}, {"id": 112, "start": 616.0, "end": 624.0, "text": "Auch geil. Noshakannels Team Deathmatch. Was läuft? Sand-Crossing. Alles klar."}, {"id": 113, "start": 624.0, "end": 629.0, "text": "Das klingt logisch. Okay, ich muss mal kurz die Musik ausmachen."}, {"id": 114, "start": 629.0, "end": 633.0, "text": "Musik. Off. Bam."}, {"id": 115, "start": 633.0, "end": 638.0, "text": "Allerdings 64-Mann-Sand-Crossing stelle ich mir ein bisschen Clusterfuck-mäßig vor."}, {"id": 116, "start": 638.0, "end": 651.0, "text": "Ich spiele ja normalerweise kein TDM, aber die Nachtmaps haben es mir echt angetan."}, {"id": 117, "start": 651.0, "end": 662.0, "text": "Okay. Random-Spawn-Point. What the... Wow, wow, wow. Alter, Alter. Ist ja gut."}, {"id": 118, "start": 662.0, "end": 668.0, "text": "Spawns rein, du wirst von der Seite angebashed. Was? Alter, nein. Der hat meine Nachtsicht,"}, {"id": 119, "start": 668.0, "end": 673.0, "text": "der hat meine Nachtsicht, stellt sich nicht gemerkt. Ich habe meinen OP-Nachtsicht-Visier nicht am Start."}, {"id": 120, "start": 673.0, "end": 683.0, "text": "Wie gibt es denn sowas hier? Wie kann denn sowas sein? Ich brauche meine Nachtsicht-Visier."}, {"id": 121, "start": 683.0, "end": 692.0, "text": "Kann man da schon immer durchhüpfen? Oder war das jetzt ein krasser Battlefield-Bug?"}, {"id": 122, "start": 692.0, "end": 703.0, "text": "Ich glaube, das war Battlefield-Bug, oder? Normalerweise soll man da nicht durchspringen können."}, {"id": 123, "start": 703.0, "end": 709.0, "text": "By the way, man kann nicht... Man kann nicht... Oh, oh, oh. Gehst du weg, Alter? Gehst du fort?"}, {"id": 124, "start": 709.0, "end": 727.0, "text": "Man kann nicht spotten. Aha. Weggestreifwort. Man kann wieder nicht spotten. Ich habe keine Ahnung,"}, {"id": 125, "start": 727.0, "end": 730.0, "text": "was die mit den Servern immer machen, aber warum schaltet man... Ernsthaft, warum schaltet man"}, {"id": 126, "start": 730.0, "end": 735.0, "text": "Spotting aus? Guck mal, du siehst den Battlefield überhaupt nichts. Du kannst überhaupt nichts mehr spotten."}, {"id": 127, "start": 735.0, "end": 745.0, "text": "Das ist mega der Sack. Du siehst ja nichts. Das Game ist halt auf Spotten ausgelegt."}, {"id": 128, "start": 745.0, "end": 761.0, "text": "Du musst Spotterino machen, sonst geht das nicht. Wir pushen mal ein bisschen."}, {"id": 129, "start": 761.0, "end": 771.0, "text": "Ah, da kann man rauf. Ich wollte gerade sagen, da gibt es hier geile Leiter."}, {"id": 130, "start": 771.0, "end": 780.0, "text": "Oh nee, das gibt ganz, ganz, ganz, ganz schlimmes Rumgekämpfe hier. Ich weiß es. Ich weiß es jetzt schon."}, {"id": 131, "start": 780.0, "end": 790.0, "text": "Aber, immer ernsthaft, Zen-Crossing, das ist so hell hier, brauchst du gar keine Nachtsicht-Visier."}, {"id": 132, "start": 790.0, "end": 804.0, "text": "Null W. Alter, ich muss nachladen. Zu viel, zu viel, zu viel hier los."}, {"id": 133, "start": 804.0, "end": 822.0, "text": "Oh, ich sollte sie vielleicht nicht blocken. Man muss aber echt... Man muss aber... Oh nee, da hinten."}, {"id": 134, "start": 822.0, "end": 830.0, "text": "Moment, was zum... Ich bin mir jetzt nicht ganz sicher, ehrlich gesagt."}, {"id": 135, "start": 830.0, "end": 838.0, "text": "Seit wann gibt es BF4-Maps in Battlefield 3? Das ist keine Battlefield-4-Map."}, {"id": 136, "start": 838.0, "end": 848.0, "text": "Oder haben die die mal Remaked oder so für Battlefield 4? Nee, glaub nicht. Oder gab's ein paar da auch für Battlefield 4?"}, {"id": 137, "start": 848.0, "end": 862.0, "text": "Nee, oder? Nee, glaub's nicht."}, {"id": 138, "start": 862.0, "end": 868.0, "text": "Fuck. Ich hätte, ich hätte mir die Mini-Pack-Kiste früher legen sollen."}, {"id": 139, "start": 868.0, "end": 881.0, "text": "Äh, Moment, wo? Wo stellst denn der Dude lang? Yeah! Easy win, easy life."}, {"id": 140, "start": 881.0, "end": 889.0, "text": "Battlefield 3, also ich muss sagen, when it's unleashed macht ultra Bock, wenn man halt das spielt, was nicht vanilla ist."}, {"id": 141, "start": 889.0, "end": 896.0, "text": "Also wenn du beispielsweise Nacht-Maps spielst oder so, das ist wie ein neues Game. Die Nacht-Maps ohne Plaufilter."}, {"id": 142, "start": 896.0, "end": 906.0, "text": "Richtig geil. Einfach mal was komplett anderes. Sieht anders aus, spielt sich anders, fühlt sich anders an."}, {"id": 143, "start": 906.0, "end": 918.0, "text": "Richtig poggers. Richtig, richtig poggers."}, {"id": 144, "start": 918.0, "end": 928.0, "text": "Ja, aber warum die das Spotting auch so viel sauber ausmachen, verstehe ich nicht, weil Battlefield, gerade Battlefield 3 ohne Spotting ist schon ein bisschen..."}, {"id": 145, "start": 928.0, "end": 935.0, "text": "Würde ich? Moin Mark, sag mal, hast du dir Cold War gekauft?"}, {"id": 146, "start": 935.0, "end": 940.0, "text": "Hallo, ich möchte es minimieren. What the fuck?"}, {"id": 147, "start": 940.0, "end": 949.0, "text": "Okay, darf das nicht verschieben? Ich wollte ja eigentlich nur das Icon zeigen, dass du siehst, ja, ich hab's mir gekauft."}, {"id": 148, "start": 949.0, "end": 955.0, "text": "Okay, also merkt euch, verschiebt das Fenster nicht, das ist nicht dafür ausgelegt, das Fenster zu verschieben."}, {"id": 149, "start": 955.0, "end": 959.0, "text": "Ich mag's nicht."}, {"id": 150, "start": 959.0, "end": 972.0, "text": "Also, Text, Night, Nighttime, jawoll. Ja, was kam jetzt für eine Map, ich hab gar nicht geguckt."}, {"id": 151, "start": 972.0, "end": 984.0, "text": "Ich hoffe, ich hoffe es... Och nee. Och nee, nicht schon wieder. Moment, was musste man dafür nochmal machen?"}, {"id": 152, "start": 984.0, "end": 994.0, "text": "Mods Ordner löschen? Oder irgendwas? Erstmal ausmachen. Man musste doch irgendwie..."}, {"id": 153, "start": 994.0, "end": 999.0, "text": "Okay, mein, Appdater. War doch irgendwie so ein komischer Bug, ne?"}, {"id": 154, "start": 999.0, "end": 1008.0, "text": "Appdater, dann müsste man hier Local... Wenn es anleashed Mods Ordner sollte man löschen."}, {"id": 155, "start": 1008.0, "end": 1015.0, "text": "Excellent. Doomquake Unreal 23, ja, seh ich auch so."}, {"id": 156, "start": 1015.0, "end": 1023.0, "text": "Ich hab's ja in einem der letzten Videos gesagt, die müssen, oder die hätten, also nicht die Venice Unleashed Leute, sondern DICE damals,"}, {"id": 157, "start": 1023.0, "end": 1029.0, "text": "die hätten Battlefield 3 als Service Game machen sollen, also das, was man heute als Service Game nennt, und einfach 3-4 Jahre supporten."}, {"id": 158, "start": 1029.0, "end": 1036.0, "text": "Und den ganzen Scheiß, den sie dann jetzt in Battlefield 4 eingebaut haben, den hätten sie ohne Probleme auch in Battlefield 3 einbauen können."}, {"id": 159, "start": 1036.0, "end": 1043.0, "text": "Oh, Bazaar kommt jetzt. Rite Time Bazaar. Und das wär doch nice gewesen. Alter Pli..."}, {"id": 160, "start": 1043.0, "end": 1052.0, "text": "Sag mal, ist Bazaar bugged? Ist Grand Bazaar bugged?"}, {"id": 161, "start": 1052.0, "end": 1072.0, "text": "Das hatten wir doch gestern auch schon. Grand Bazaar hat übelst rumgeschissen, ne?"}, {"id": 162, "start": 1072.0, "end": 1086.0, "text": "Das hatten wir doch gestern auch schon. Das hatten wir doch gestern auch schon, den Mist."}, {"id": 163, "start": 1086.0, "end": 1095.0, "text": "Haben wir aus? Okay, dann können wir auf dem Server nicht spielen, das ist natürlich ziemlicher Crap."}, {"id": 164, "start": 1095.0, "end": 1110.0, "text": "Du bist auf dem Server ohne Bugs? Hä? Ich hatte noch nie nen Bazaar Green Screen, ohne Scheiß. Gucken wir mal was mit dem anderen."}, {"id": 165, "start": 1110.0, "end": 1118.0, "text": "Wo spielen denn hier grad Leute? One Bullet Headshot? Nee, nee. Das Game ist nicht da drauf ausgelegt, ganz ehrlich."}, {"id": 166, "start": 1118.0, "end": 1129.0, "text": "Aus dem Sitzen dann da alle wie verrückt rum. Night Time Bazaar, ja. Epi Centrum Bazaar war auch..."}, {"id": 167, "start": 1129.0, "end": 1152.0, "text": "Epi Centrum Night Time war auch richtig geil. Komm jetzt, Pause Champ, kein Green Screen. Und? Und? Aha!"}, {"id": 168, "start": 1152.0, "end": 1163.0, "text": "Okay, also machen wir mal was. Loadout? Oh komm, wir machen mal die cheesigste Waffe im ganzen Game, Alter."}, {"id": 169, "start": 1163.0, "end": 1185.0, "text": "Wir machen jetzt M16. Äh, warte mal, M16? M16 ist doch, ist die Burst Fire Mode? Ja. Ich will die normale M16, wo ist denn die?"}, {"id": 170, "start": 1185.0, "end": 1199.0, "text": "Wo ist meine, wo ist die M16? Ah, da. Ähm, so. Wir machen jetzt die cheesigste Waffe im ganzen Game."}, {"id": 171, "start": 1199.0, "end": 1217.0, "text": "Null W. Jawoll! Jetzt kann nix mehr schief gehen, Alter. M16, M16, Nachtvisier. Passt mal auf."}, {"id": 172, "start": 1217.0, "end": 1231.0, "text": "Moment, ist das One Shot Headshot oder so? What the fuck, please? Oh, K220 können wir auch spielen, das ist auch eine gute Idee."}, {"id": 173, "start": 1231.0, "end": 1251.0, "text": "So eine Burst Waffe, da kann ich mein NA aimen. What the hell? Ich erkenne gar nicht, wo hier was ist."}, {"id": 174, "start": 1251.0, "end": 1265.0, "text": "Ey, das sackt. Wow, wow. Die gehen ja, was ist denn schon wieder mit den Gegnern los?"}, {"id": 175, "start": 1265.0, "end": 1282.0, "text": "Okay, okay, das waren wir. Oh, fuck. Oh, die machen Rats-Action. What the fuck? Okay, komm raus."}, {"id": 176, "start": 1282.0, "end": 1300.0, "text": "Ich hab extra mein, ich hab extra mein geiles Stels-Visier drauf. Komm mal, der will Flank-Action wieder machen."}, {"id": 177, "start": 1300.0, "end": 1317.0, "text": "Ah. Sag mal, das ist doch nicht normal gerade. Was ist mit den Gegnern los? Moment, was habe ich denn für einen Ping?"}, {"id": 178, "start": 1317.0, "end": 1335.0, "text": "Na ja, 43, das geht eigentlich. Sag mal, ist NoFate nicht der Erfinder von dem Game? Von Venice Unleashed? Oder wie war das nochmal?"}, {"id": 179, "start": 1335.0, "end": 1349.0, "text": "Oder einer der Venice Unleashed Typen? Ah, Moment, ich dachte, das geht hier. Geht aber nicht."}, {"id": 180, "start": 1365.0, "end": 1390.0, "text": "Achtung, komm rum. Nice, gebashed haben wir sie."}, {"id": 181, "start": 1390.0, "end": 1413.0, "text": "Ich weiß, ich mag meine M416 besser. Ich mag meine M416 lieber. Leute, mir kommt so vor, als haben die das heller gemacht, als braucht man das Nacht-Visier gar nicht mehr."}, {"id": 182, "start": 1413.0, "end": 1433.0, "text": "Wonka S. Spielst du so mit Fabian? Wir spielen gerade das gleiche Spiel, aber wir spielen das Single-Player quasi parallel nebeneinander."}, {"id": 183, "start": 1433.0, "end": 1449.0, "text": "Ey, die sind krass, die Gegner. Das geht doch nicht an, wie krass die einem across the map den Kopf schießen. Ist hier gerade die Battlefield-Elite am Start."}, {"id": 184, "start": 1449.0, "end": 1467.0, "text": "Ich hab schon eine M16 rausgeholt. Ich mach jetzt bisschen Run-and-Gun-Action, besser."}, {"id": 185, "start": 1467.0, "end": 1486.0, "text": "Gehen wir mal hier aufs Haus. Alles klar. Excellent, excellent. Pausierungs-Champ."}, {"id": 186, "start": 1486.0, "end": 1503.0, "text": "Die M16 ist halt geil. Du musst einfach nur nach unten ziehen. Guck mal, wie easy. Dauerfeuer auf einem Spot zu bleiben. Recoil ist overrated."}, {"id": 187, "start": 1503.0, "end": 1518.0, "text": "Oh, jetzt hab ich meinen ganzen Muni verschossen. Das war natürlich auch äußerst clever von mir."}, {"id": 188, "start": 1518.0, "end": 1540.0, "text": "Ja, die M16 ist long distance. Das stimmt schon. Achtung, Reds-Champ. Ich glaube, ich mach das Visier wieder runter."}, {"id": 189, "start": 1540.0, "end": 1553.0, "text": "Erst mal schön von hinten gebessert, Alter. Okay, ne, ne, ne, ne. Gefällt mir nicht. Customize."}, {"id": 190, "start": 1553.0, "end": 1574.0, "text": "Spielen wir mal was? Könnten wir mal was Ausgefallenes? KH2001. Hab ich, glaube ich, nie gespielt in dem Game, richtig?"}, {"id": 191, "start": 1574.0, "end": 1597.0, "text": "Das war Burst, ne, das Ding. Hallo, Battlefield, please. Oh, da wird wer geburstet."}, {"id": 192, "start": 1597.0, "end": 1609.0, "text": "Macht die wenigstens besonders Damage im Burst oder ist die einfach nur Burst und schlecht und auch noch schlechter als andere Waffen?"}, {"id": 193, "start": 1609.0, "end": 1630.0, "text": "Ich kann mich, ich kann, ja zumindest einen richtig langen Reload, was ziemlich sackt. Ah ja, by the way, und, und, und der Reload dauert lange."}, {"id": 194, "start": 1630.0, "end": 1640.0, "text": "Stream Snipes mich, easy as fuck, Stream Snipes mich macht. Das ist echt dumm, dass man die nicht spotten kann."}, {"id": 195, "start": 1640.0, "end": 1653.0, "text": "Wisst ihr das? Das ist richtig hängen geblieben, dass man die Gegner nicht spotten kann."}, {"id": 196, "start": 1653.0, "end": 1662.0, "text": "Okay, okay, ich, ich bin mir nicht ganz sicher, wo wir hier lang können, aber ich, ich, ich Pause-Champe mal hier um die Ecke."}, {"id": 197, "start": 1662.0, "end": 1680.0, "text": "Äh, ich hab ne dumme Perk, ich brauch Anti-Suppression. Braucht das Anti-Suppression-Perk und Waffen mit langen Reloads sacken im Battlefield-Reihe."}, {"id": 198, "start": 1680.0, "end": 1694.0, "text": "Aber ist da oben was? Äh, ich speichere mir mal das Game, weil ich, wie gesagt, ich mach morgen ein Video über die Nachtmaps."}, {"id": 199, "start": 1694.0, "end": 1712.0, "text": "Wow, wow, wow, wow, wow, Pause-Champe steht in der Ecke. Ja, ja, ist ja gut, sehr gut, sehr gut."}, {"id": 200, "start": 1712.0, "end": 1730.0, "text": "Sag mal, jetzt seh ich, da seh ich den übelst scharf hier wieder. Übelst scharfe Gegner. Guckst du um die Ecke, bist down."}, {"id": 201, "start": 1730.0, "end": 1744.0, "text": "Wie, der ist nicht tot? Hab ich das richtig gesehen? Das hat nicht gereicht ihn zu killen. Von wo, please? Guck mal, da ist doch gar nichts."}, {"id": 202, "start": 1744.0, "end": 1762.0, "text": "Oh, da kommt jetzt was, Achtung. Ey, die sind so krass drauf, die Gegner. Reingejoined, bam, Q-Chat 17-2, kann ich mitleben, kann ich mitleben."}, {"id": 203, "start": 1762.0, "end": 1776.0, "text": "Ich glaub, die machen jetzt hier Attacke, weil der Venice Unleashed Gründer drauf ist. Glaub ich, da machen die jetzt hier, als gibt's keinen Morgen mehr. Die machen Skill-Best-Matchmaking gerade."}, {"id": 204, "start": 1776.0, "end": 1802.0, "text": "Die machen komplett, die eskalieren voll Skill-Best-Matchmaking. Guckt's euch an, komplette Eskalation. Ich warte jetzt, bis da einer rauskommt und dann wieder wegsnipe."}, {"id": 205, "start": 1802.0, "end": 1816.0, "text": "Guck da, bam, bam, bam. Achtung, jetzt, jetzt, jetzt. Massive Jump, Massive Jump. Was? Alter, von da kann mich gar keiner treffen. Wie soll denn das gehen?"}, {"id": 206, "start": 1816.0, "end": 1832.0, "text": "Haben die Ecke gekugelt oder gekurfte Kugeln oder wie? Okay, die Waffe sackt, guckt euch das mal an. Reingebörstet in die Gegner, stirbt nichts. Chat, wie sieht's eigentlich mit euch aus?"}, {"id": 207, "start": 1832.0, "end": 1851.0, "text": "Habt ihr auch schon mal gespielt? Oder habt ihr bloß zugeguckt?"}, {"id": 208, "start": 1851.0, "end": 1867.0, "text": "Äh, Doktor Magic, Dankeschön für den Sub. Wo sind wir hier, wo sind wir? Post-Champ, Post-Champ, Post-Champ."}, {"id": 209, "start": 1867.0, "end": 1881.0, "text": "Hier Leute, wisst ihr was? Man darf nicht zu schnell tappen, man muss, man braucht so ein, äh ne, ich hab da nicht den Tapfinger für. Man muss, man muss so ein, passt mal auf, man muss so ein Special-Tap-Rhythmus haben."}, {"id": 210, "start": 1881.0, "end": 1902.0, "text": "Wenn man zu schnell tappt, sagt man muss, man muss irgendwie so, also dann macht man nämlich quasi Dauerfeuer. Wenn man zu schnell tappt, dann nicht. Wenn man zu schnell tappt, dann jampt das Ding oder irgendwie."}, {"id": 211, "start": 1902.0, "end": 1917.0, "text": "Mal wallbangen. Guckt ihr, habt ihr gesehen, ich muss, ich muss so ein gewisses Rhythmus, muss ich, muss ich schießen, dann, dann ist kein Problem."}, {"id": 212, "start": 1917.0, "end": 1933.0, "text": "Man sieht nichts, ne? 1490 nicht besser, doch, doch, doch, doch, doch. Das können wir mal machen, wir können mal ne Runde 1490 spielen."}, {"id": 213, "start": 1933.0, "end": 1948.0, "text": "Bisschen, bisschen Variations hier. Aber ich speichere mir den ganzen Kram mal, weil das brauch ich fürs Wit. Das Problem ist dadurch, dass man nicht spotten kann, sieht man die Gegner im Dunkeln nicht."}, {"id": 214, "start": 1948.0, "end": 1963.0, "text": "Und insofern lohnt sich eigentlich Nachtsichtvisier hier schon. 1490 Poggers."}, {"id": 215, "start": 1963.0, "end": 1984.0, "text": "Oh. Alter. Oh, da ist ganz schön viel."}, {"id": 216, "start": 1984.0, "end": 1997.0, "text": "Den Kopf. Kurzum die Ecke stellst du."}, {"id": 217, "start": 1997.0, "end": 2023.0, "text": "Die Waffe gefällt mir nicht, das macht keinen Bock mit dem Ding. Lul, der denkt jetzt auch, was ist mit dem los. Heck. Ich seh schon. Please ban Q-Chat."}, {"id": 218, "start": 2023.0, "end": 2031.0, "text": "Bleibt man hier eigentlich an allem hängen grad. Okay, pass auf, pass auf Leute."}, {"id": 219, "start": 2031.0, "end": 2051.0, "text": "Wow, MonkaS. Und vorne, ach du Scheiß. Okay, andere Waffe Leute, andere Waffe. Weg, weg. Okay, was, was, was können wir mal probieren? 1490, jawoll. Nice, 1490 ist Pog."}, {"id": 220, "start": 2051.0, "end": 2068.0, "text": "Accessories. Komm, wir machen mal Night-Visier. Night-Visier auf der A. Alter."}, {"id": 221, "start": 2068.0, "end": 2086.0, "text": "Da kriegen sie auf den Sarg. Ja, Battle Royale, ganz ehrlich, ich brauch kein Battle Royale in dem Spiel. Ich bin eh kein großartiger Battle Royale Fan. Und es ist, ich find's halt fraglich, braucht man echt in jedem Game einen Battle Royale?"}, {"id": 222, "start": 2086.0, "end": 2106.0, "text": "Die sollen lieber, ganz im Ernst, die sollen sich lieber einen richtig coolen Modus ausdenken, der zu Battlefield passt und der irgendwie neu ist. Ich sag euch mal, ich fand beispielsweise Squad Rush, ich sag jetzt nicht, dass ich Squad Rush machen soll, weil Squad Rush ist kein Mainstream-Modus."}, {"id": 223, "start": 2106.0, "end": 2121.0, "text": "Ich fand Squad Rush richtig geil, wenn man das so semi-kompetitiv, kompetitiv ist doof in Battlefield, aber wenn man einfach mit ein paar Leuten im guten Squad zusammen spielen will."}, {"id": 224, "start": 2121.0, "end": 2140.0, "text": "Da fand ich Squad Rush richtig poggers. Und ich glaube man könnte auch Squad Rush mit ein paar Tweaks einen echt geilen Modus machen. Annie, warum sollen wir Annie bann? Warum? Cheatet der? Wo ist der überhaupt?"}, {"id": 225, "start": 2140.0, "end": 2152.0, "text": "Spielt man die allen Firmen in Battlefield auch auf Burst, dir bleibt nichts anderes da übrig, die ist Burst Only."}, {"id": 226, "start": 2152.0, "end": 2181.0, "text": "Kark Island TDM! Ach du Scheiße! Äh, hallo Game? Game? Post-Camp? Game? Hallo?"}, {"id": 227, "start": 2181.0, "end": 2194.0, "text": "Ah, da ist er immer. Hat ein bisschen gedauert."}, {"id": 228, "start": 2194.0, "end": 2212.0, "text": "Ok, wo sind wir überhaupt? Seht ihr mal, wie geil die Map aussieht in der Nacht-Variante? Ist doch richtig nice, oder?"}, {"id": 229, "start": 2212.0, "end": 2228.0, "text": "187 in your face! Ok, jetzt muss ich mich gleich speichern, easy. 1,94 Kills."}, {"id": 230, "start": 2228.0, "end": 2244.0, "text": "Ich brauch jetzt gleich noch so ein 1,94 Triggermakro, wie die ganzen Pros haben. Nein, mach ich nicht. Kein Triggermakro, das ist für Lowbops. Aber es gibt viele, die haben sowas."}, {"id": 231, "start": 2244.0, "end": 2263.0, "text": "Ey, warum geht ihr weg? Geht nicht weg, Leute. Kommt wieder her. Alter, ich aim euch ab. Kommt wieder her. Kommt gefällig."}, {"id": 232, "start": 2263.0, "end": 2280.0, "text": "Kommt fällig wieder her. Oh MonkaS! Was hast du eigentlich für ein Monitor? Ich hab einen BenQ... 2, 4, äh, nee, 2, ah, keine Ahnung."}, {"id": 233, "start": 2280.0, "end": 2304.0, "text": "Äh, chat, SL, irgendwas? Chat weiß es besser als ich immer, sowas. Ich meine schon, hart wie man den Kopf schießen kann, ne, mit der AN."}, {"id": 234, "start": 2304.0, "end": 2325.0, "text": "Die AN ist schon ne geile Waffe, oder? Müsste schon zugeben. Die AN ist schon cool."}, {"id": 235, "start": 2325.0, "end": 2335.0, "text": "Nur für Nahkampf ist sie nicht so wirklich gut."}, {"id": 236, "start": 2335.0, "end": 2346.0, "text": "Jaja, die schießt nicht so schnell. Oh wei, doch, die schießt sogar relativ schnell, wenn man den Triggermodus da richtig drin hat."}, {"id": 237, "start": 2346.0, "end": 2366.0, "text": "Den ich nicht drin hab. Oh geil, hier gibt's Muni. Alles klar, alles klar."}, {"id": 238, "start": 2376.0, "end": 2395.0, "text": "Das sind alles... Äh... Ah, ich hab, nee, ich hab das richtige Perk."}, {"id": 239, "start": 2395.0, "end": 2419.0, "text": "Leute, ich werd jetzt gleich einmal mal switchen wieder. Ich switch gleich auf M416, weil ich die einfach gewohnt bin und hier auf dem Server wirklich viele gute Leute sind, das merkt man auch."}, {"id": 240, "start": 2419.0, "end": 2442.0, "text": "Jetzt merkst du, dass hier gescheite Leute sind. Alter, jetzt alle down, oder was? Lul, weh. Moment, gibt's noch diese Brücke?"}, {"id": 241, "start": 2442.0, "end": 2452.0, "text": "Alter, ich seh nix mehr. Ich seh nix mehr vor lauter Geplitze. Okay, ich glaub Nacht, ich glaub Nachtsicht ist doch nicht so das geilste, das ist auch hell genug."}, {"id": 242, "start": 2452.0, "end": 2465.0, "text": "Ähm, lass mal überbrüten. Wisst ihr was halt das Geile ist? Das ist so ein komplett neues Ding. Was nimmt man da? ACOG? PKA?"}, {"id": 243, "start": 2465.0, "end": 2475.0, "text": "Ja, nice spawn, nice spawn, GG, Eats. Easy, easy, easy, easy."}, {"id": 244, "start": 2475.0, "end": 2504.0, "text": "Hohohoho, deleteen alle. Deleteen den Kopf gerade. Ich hab Schiss, Leute. Das ACOG Visier, ja."}, {"id": 245, "start": 2504.0, "end": 2518.0, "text": "Das schneibern sie am Arsch der Welt. Wir sind eigentlich die Vanilla Surfer bestückt, ist eine sehr gute Frage, keiner weiß es."}, {"id": 246, "start": 2518.0, "end": 2538.0, "text": "Lul. Es ist schon ein bisschen konfus, ne? Minimal."}, {"id": 247, "start": 2538.0, "end": 2551.0, "text": "Ein bisschen konfus ist es schon. Waffe, die ich nicht kenn und vor allem gibt's eigentlich Tages-TDM hier drauf, ja, ne?"}, {"id": 248, "start": 2551.0, "end": 2572.0, "text": "Ich stell wieder meine M416. Da weiß ich wenigstens, was ich machen muss."}, {"id": 249, "start": 2572.0, "end": 2583.0, "text": "Ja, ist übelst geil. Okay, genug Experimente, Leute, genug Experimente. Wobei, wie sind die G3 gewesen? Hat die getaugt?"}, {"id": 250, "start": 2583.0, "end": 2605.0, "text": "Oder die war eine AK-74? Wir spielen Scheiß auf Stats, Leute. Wir probieren jetzt mal ein bisschen rum."}, {"id": 251, "start": 2605.0, "end": 2618.0, "text": "Ich muss mal gucken. Ich will ein bisschen schauen, was ich da anbiete zu spielen. Na, kostenlos ist es nicht. Der Mod ist an sich kostenlos, aber du brauchst Battlefield 3, ne?"}, {"id": 252, "start": 2618.0, "end": 2644.0, "text": "Soll ich euch mal was sagen? Kack-Islands, übelsteuerschen Map für TDM. Das Spiel ist ja Nose-Hair-Candles gleich viel lieber."}, {"id": 253, "start": 2644.0, "end": 2670.0, "text": "Gegner? Okay. Ah ne, hier ist aus, he? The Schneiberman. Achtung, huge, huge nade. Die nicht, ne, krasse nade, Max."}, {"id": 254, "start": 2670.0, "end": 2683.0, "text": "Massive nade."}, {"id": 255, "start": 2683.0, "end": 2707.0, "text": "Oh ne, okay, das Ding macht keinen Damage. Braucht das Base-Game, ja. War die AK brauchbar in dem Spiel?"}, {"id": 256, "start": 2707.0, "end": 2717.0, "text": "Ich hab ja auch ewig nicht mehr gespielt, wenn du das so willst. Und wenn, hab ich ein paar Runden gespielt. Die Vollklasse M416, easy win."}, {"id": 257, "start": 2717.0, "end": 2736.0, "text": "Lass mal überlegen. Also, AK war gut, M490 war gut, M16 war gut, M416 war gut. Ich glaub, das waren die guten Assault-Waffen. Schon was vergessen?"}, {"id": 258, "start": 2736.0, "end": 2744.0, "text": "Guckt zu euch an, die Schneiber-Dudes. Wie sie mir schon in der S-Snipe und snipen wollen."}, {"id": 259, "start": 2744.0, "end": 2767.0, "text": "Auge? Nein, Quatsch, die Auge war nicht gut. Die Auge war höchstens brauchbar. Ich glaub, das, was ich grade aufgezählt hab, waren so die Tier-1-Waffen. Oder S-Tier, die S-Tier-Waffen. Oder?"}, {"id": 260, "start": 2767.0, "end": 2775.0, "text": "Geh mal jetzt, hier ist das Nachtsicht-Spiel. Woah, woah, woah. Da haben sie, haben sie gestürmt."}, {"id": 261, "start": 2775.0, "end": 2797.0, "text": "Klitsching outside of map. Ob das Klitsching ist? Ich bin hier noch drin. Die passen auch noch richtig auf hier."}, {"id": 262, "start": 2797.0, "end": 2812.0, "text": "Ok Leute, wisst ihr was? Genug Experimente, easy. Gehen wir zurück. Wir müssen jetzt mal ein paar Sachen killen hier."}, {"id": 263, "start": 2812.0, "end": 2836.0, "text": "Ab. Alles klar. Ok."}, {"id": 264, "start": 2836.0, "end": 2845.0, "text": "Mp-7? Gab's überhaupt ne Mp-7 in dem Spiel?"}, {"id": 265, "start": 2845.0, "end": 2864.0, "text": "Ah, tatsächlich. Mp, Alter, wie war die Mp-7 nochmal? Ich kann mich ja null mehr dran erinnern. Iiih, was denn das?"}, {"id": 266, "start": 2864.0, "end": 2875.0, "text": "Moment, Moment. Ich glaub, ich bin im Hardcore-Server gelandet. Bin ich im Hardcore-Server gelandet? Oh ja, fuck."}, {"id": 267, "start": 2875.0, "end": 2885.0, "text": "Wieso spielst du nicht ausschließlich 120Hz? Weil 120Hz gibt's kaum Server und die sind sehr, also sehr anspruchsvoll, das Game auf 120Hz."}, {"id": 268, "start": 2885.0, "end": 2896.0, "text": "Das heißt, die meisten größeren Spiele, wo die gibt es gar nicht in."}, {"id": 269, "start": 2896.0, "end": 2915.0, "text": "Ok, ok Leute. Lol, das ist ein Hardcore-Server. Nein, jetzt ist das Ding leer. Ok, probieren wir mal. Mp-7, Alter, ok."}, {"id": 270, "start": 2915.0, "end": 2927.0, "text": "Erstmal in ordentlich Squat. Jawoll. Join. Excellent. Äh, hallo? Darf ich, darf ich nicht bei euch spawnen? Wie wär's?"}, {"id": 271, "start": 2927.0, "end": 2949.0, "text": "Äh, ok. Ich, ich glaub, das ist Hardcore, ja? Ich glaub, das ist Hardcore. Jaaa. Magaziner, hatte das ein Magaziner weiter in dem Spiel? Ich kann mich da überhaupt nicht mehr dran erinnern."}, {"id": 272, "start": 2949.0, "end": 2969.0, "text": "Das ist Battlefield 3 Mods, ja? Kannst du... Extended Mac? Massive. Oh, jetzt Codra Visier, jawoll."}, {"id": 273, "start": 2969.0, "end": 2984.0, "text": "Oh, ist das nice. Komm mal, so schnell wie ich sterb, das ist Hardcore. Oh, hier, das ist ja angehustet."}, {"id": 274, "start": 2984.0, "end": 2998.0, "text": "Ich spiel ungern Hardcore. Oh, nice. Was? Wir gucken mal, was es sonst noch so gibt."}, {"id": 275, "start": 2998.0, "end": 3006.0, "text": "Weißt du, was kann man sonst noch spielen? Ähm... One Sh... Nee, das ist mir zu doof, da hab ich keine Bock."}, {"id": 276, "start": 3006.0, "end": 3017.0, "text": "One Bullet Headshot, das ist sackdack, das heißt Battlefield nicht für ausgelegt. Also vor allem Battlefield 3 nicht. Zombie Server?"}, {"id": 277, "start": 3017.0, "end": 3030.0, "text": "Das hat mit Zombie, glaub ich, gar nichts zu tun. Das heißt einfach nur, einfach nur Zombie, Zombie RS. Hardcore Mix."}, {"id": 278, "start": 3030.0, "end": 3038.0, "text": "Hm. Aber wisst ihr, was ich cool finde, dass es gut besucht ist? Sind das eigentlich für Server Pings hier, please?"}, {"id": 279, "start": 3038.0, "end": 3048.0, "text": "Operation 925 Gun Master. Oh, Gun Master hätte ich jetzt aber wieder Bock drauf. Was ist der Unterschied zur normalen Battlefield 3? Kommt drauf an, auf welchem Server du spielst."}, {"id": 280, "start": 3048.0, "end": 3054.0, "text": "Du kannst einen Server erstellen, der genauso ist wie normales Battlefield 3. What the fuck, was geht jetzt gerade ab?"}, {"id": 281, "start": 3054.0, "end": 3066.0, "text": "Du kannst Server erstellen ohne Plaufilter, ohne Suppression, mit irgendwelchen Mods drauf. Du kannst die Maps bei Nacht spielen. Also eigentlich ganz cool, ganz cool."}, {"id": 282, "start": 3066.0, "end": 3071.0, "text": "Guck mal, was wir für einen Ping haben. Ich will jetzt mal ein bisschen M7 spielen. Ich kann mich an die ganzen Waffen nicht mehr erinnern, Leute."}, {"id": 283, "start": 3071.0, "end": 3096.0, "text": "Ich spiele AEK. M416, fertig. Mehr hab ich, glaub ich, das letzte Jahr in dem Spiel gar nicht gespielt. Guck mal, 32er Ping, 29er Ping. Okay, damit kann man leben."}, {"id": 284, "start": 3096.0, "end": 3111.0, "text": "Hier mit Pistol, äh, 0W oder Gegner."}, {"id": 285, "start": 3111.0, "end": 3136.0, "text": "Ich glaube, unter mir. Oh, oh, oh, das ist ja hoch. Das ist ja richtig hoch. Gegner, please. Wo sind die Gegner? Die Map ist zu groß."}, {"id": 286, "start": 3136.0, "end": 3158.0, "text": "Bam, damit hätte er nicht gerechnet. Was war denn das? Ah, Burst Pistol."}, {"id": 287, "start": 3158.0, "end": 3174.0, "text": "MonkaS, Alter."}, {"id": 288, "start": 3174.0, "end": 3192.0, "text": "Gun Master, äh. Sag mal, das ist doch mehr als 33er Ping. Das ist ja mal, äh, Poggers Gelegge."}, {"id": 289, "start": 3192.0, "end": 3205.0, "text": "Letzter Schuss. Zack, Bam, in your face. Whoa, whoa. One, one shot, headshot in your face, Alter. Nice."}, {"id": 290, "start": 3205.0, "end": 3211.0, "text": "Ich wird Gun Master, ja. Wir gewinnen jetzt. Easy win."}, {"id": 291, "start": 3211.0, "end": 3222.0, "text": "Es ist aber, der Modus ist ja im Prinzip übelst unbalanced, ne. Wenn du hinten dran bist und die Leute sind schon bei Assault Rifles und so, dann hast du halt richtig gefickt."}, {"id": 292, "start": 3222.0, "end": 3239.0, "text": "Oh, by the way, mit dem Ding komm ich null klar."}, {"id": 293, "start": 3239.0, "end": 3249.0, "text": "Gegner, please. Auf der Map könnten wir das ohne Probleme mit ein bisschen mehr Leuten spielen."}, {"id": 294, "start": 3249.0, "end": 3260.0, "text": "Okay, alles klar."}, {"id": 295, "start": 3260.0, "end": 3272.0, "text": "Easy flank, easy flank. Easy flank. Alles tot, excellent."}, {"id": 296, "start": 3272.0, "end": 3288.0, "text": "Ich hätte ja gerne eine gescheite Waffe. Das wäre schon. Oh, guck mal, da ist Horst Seehofer. Ich wusste gar nicht, dass der Battlefield 3 spielt."}, {"id": 297, "start": 3288.0, "end": 3302.0, "text": "Alter, ich komm mit dem Ding da klar. Nicht meine Kills klauen, Leute. Nicht. Nicht. Oh, nice, huge."}, {"id": 298, "start": 3302.0, "end": 3305.0, "text": "Nicht meine Kills. Was ist denn das, was ich da hab? Was hab ich da für eine Waffe?"}, {"id": 299, "start": 3305.0, "end": 3320.0, "text": "Wollt ihr mich veräppeln? Oh, da kommen Gegner. Horst Seehofer, Alter, lass mir meine Kills."}, {"id": 300, "start": 3320.0, "end": 3348.0, "text": "Come on, suppression assist, suppression assist, suppression assist. Der Horst, ey. Der Horst, ich fass das nicht."}, {"id": 301, "start": 3348.0, "end": 3356.0, "text": "Der Horst. Der Horst macht einfach hier die Kills."}, {"id": 302, "start": 3356.0, "end": 3365.0, "text": "Okay, ich glaub, hier kommt nichts mehr. Jaja, wir spawnen jetzt da hinten schon."}, {"id": 303, "start": 3365.0, "end": 3379.0, "text": "Oh, nice hier jetzt, Leute. Jetzt wird's gebasht. Oh, jetzt wird's gebasht, jetzt wird's gebasht, gebasht, gebasht, gebasht. Bäm. Spast. Gespast ist er, ey. Er wurde gespast."}, {"id": 304, "start": 3379.0, "end": 3386.0, "text": "Okay. Oh nee, da kommt ein Gegner auf der anderen Seite. Oh, ich muss weg."}, {"id": 305, "start": 3386.0, "end": 3401.0, "text": "Weggespast."}, {"id": 306, "start": 3401.0, "end": 3423.0, "text": "Da kommt ein Gegner. Oh, wir haben eine gescheite Waffe, Leute. Ich glaub's jetzt, wir haben eine gescheite Waffe."}, {"id": 307, "start": 3423.0, "end": 3434.0, "text": "Nice, nice, nice. Ne Skar. Oh, nein, jetzt bin ich in den Gegner gesprungen. Ich kack, kacknubisch. Aber guck mal, hier 51. Das muss mir erstmal einer nachmachen."}, {"id": 308, "start": 3434.0, "end": 3439.0, "text": "Der Max kann's noch."}, {"id": 309, "start": 3439.0, "end": 3448.0, "text": "Moment, da war ein Gegner."}, {"id": 310, "start": 3448.0, "end": 3470.0, "text": "Was haben wir jetzt? Leute, was ist das? Was ist das? ACR? Nee, TAR. TAR-21. TAR-21? Was ist TAR? Ja, M-TAR-21. Poggers. Exquisite war das."}, {"id": 311, "start": 3470.0, "end": 3478.0, "text": "Boah, wie das zieht, ey."}, {"id": 312, "start": 3478.0, "end": 3496.0, "text": "Was haben wir jetzt? Ich die Waffen alle nicht mehr kennen."}, {"id": 313, "start": 3496.0, "end": 3504.0, "text": "Ich kenn die Waffen alle nicht mehr. Monka. Monka Giga, ey."}, {"id": 314, "start": 3504.0, "end": 3522.0, "text": "Okay, was haben wir denn jetzt gerade? Skar."}, {"id": 315, "start": 3522.0, "end": 3541.0, "text": "Alter, was sind das für Kackwaffen? Wer soll denn damit spielen? Alter, wer spielt denn damit? Was ist das? What the hell? LMG? LMG legit?"}, {"id": 316, "start": 3541.0, "end": 3558.0, "text": "Alter, wer spielt denn mit sowas? Das kannst du doch mal voll vergessen, Alter. Wie willst du damit spielen?"}, {"id": 317, "start": 3558.0, "end": 3571.0, "text": "Nee, ernsthaft, ey."}, {"id": 318, "start": 3571.0, "end": 3592.0, "text": "Nee, ey, das ist doch der Witz. LMG legit. Einfach mal in die Richtung gesprayt. Was ist das? L86? L86?"}, {"id": 319, "start": 3592.0, "end": 3609.0, "text": "L86, ja, ja, ja. Leute, sind wir Erster? Oh nice, Alter. Wir rasieren."}, {"id": 320, "start": 3609.0, "end": 3637.0, "text": "Rasier FPS. 12 Volt. Was ist das? Was ist das für ein Ding? Oh, Singelschuss. Schneiber?"}, {"id": 321, "start": 3637.0, "end": 3652.0, "text": "Was ist das? Alter, ich kenn die ganzen Waffen nicht mehr. Wahnsinn. M417? Ernsthaft, sowas gibt's?"}, {"id": 322, "start": 3652.0, "end": 3661.0, "text": "Warum sollte man M417 spielen, wenn man M416 spielen kann? Gibt doch überhaupt keinen Sinn."}, {"id": 323, "start": 3661.0, "end": 3669.0, "text": "Oh nein, oh nein. Leute, Leute, wir sind verloren, Schneiber. Ich kann nicht schneiden in dem Game. Ich kann absolut nicht schneiden."}, {"id": 324, "start": 3669.0, "end": 3684.0, "text": "Wenn ich schneide, bin ich down."}, {"id": 325, "start": 3684.0, "end": 3703.0, "text": "Alter, warum war das kein Treffer? Ist das mit Bullet Drop? Ist das ohne Bullet Drop?"}, {"id": 326, "start": 3703.0, "end": 3717.0, "text": "Schneiber, wir sind verloren, Leute. Hardscoped, es wird Hardscoped. Warum sind das keine Treffer, Leute?"}, {"id": 327, "start": 3717.0, "end": 3739.0, "text": "Ernsthaft? Okay. Oh, Shit. Jetzt kommen wir mit dem Granatwerfer."}, {"id": 328, "start": 3739.0, "end": 3765.0, "text": "Oh Mann, KS, please. Kein Granatwerfer."}, {"id": 329, "start": 3765.0, "end": 3778.0, "text": "Ist das ein Smoke oder was? Die Dinge explodieren ja gar nicht."}, {"id": 330, "start": 3778.0, "end": 3786.0, "text": "Ey, die Dinge explodieren nicht. Oh, easy. Messer? What? Ein fucking Messer. Ist das euer Ernst?"}, {"id": 331, "start": 3786.0, "end": 3798.0, "text": "Wirklich, dass ich ein Messer-Kill mache jetzt, oder wie? Nee, oder? Ernsthaft? Ach, du Scheiße."}, {"id": 332, "start": 3798.0, "end": 3813.0, "text": "Ein Messer-Kill. Als wäre dieser Spielmodus nicht an sich schon... Alter, ein Messer-Kill."}, {"id": 333, "start": 3813.0, "end": 3817.0, "text": "Der schießt Splittergranaten echt? Was ist der Unterschied? Ich kann mich echt nicht mehr dran erinnern."}, {"id": 334, "start": 3817.0, "end": 3831.0, "text": "Okay, okay. Messer-Run. Wie soll das hier funktionieren? Alter, du hast riesige Wege, ey."}, {"id": 335, "start": 3831.0, "end": 3851.0, "text": "Den Scheiß hätten sie sich echt sparen können mit dem Messer. Ich meine, fuck."}, {"id": 336, "start": 3851.0, "end": 3863.0, "text": "Yeah, fam, du Suckeler. Krase Movement-Skills, Alter. Krase Movement-Skills."}, {"id": 337, "start": 3863.0, "end": 3880.0, "text": "Q-Chat. Der Q-Chat hat gewonnen, Leute. Der Q-Chat hat gewonnen. Endlich hat der Q-Chat gewonnen."}, {"id": 338, "start": 3880.0, "end": 3894.0, "text": "E-Sport Ready. Who is this guy? Aber ernsthaft, also, die Sniper-Kills, ne?"}, {"id": 339, "start": 3894.0, "end": 3907.0, "text": "Also, ich hätte wetten können, ich war drauf. Also zumindest, ich habe auch vorbeigeschossen, klar."}, {"id": 340, "start": 3907.0, "end": 3919.0, "text": "Ich war bei gefühlt, klar, 90% der Schüsse drauf, aber die haben nix gemacht. Please, andere Map."}, {"id": 341, "start": 3919.0, "end": 3930.0, "text": "Habt ihr jetzt gesehen, wie ich's ja outmoved hab hier? Outmoved. Oh, Gunmaster, Epicenter, nice."}, {"id": 342, "start": 3930.0, "end": 3935.0, "text": "Wir gucken uns das gleich nochmal im Stream an, ich sag schon mal drauf."}, {"id": 343, "start": 3935.0, "end": 3963.0, "text": "Jetzt ist mir egal, ob ich gewinne. Juckt mich nicht. Easy Win. Wir haben den Win schon. Wir haben den Win."}, {"id": 344, "start": 3963.0, "end": 3973.0, "text": "Ihr klaut mir doch nicht die Kills, Leute. So unfair. Alle klauen mir die Kills. Sie wollen nicht, dass ich nochmal gewinne."}, {"id": 345, "start": 3973.0, "end": 3988.0, "text": "Ich sag's euch, die gönnen mir es nicht. Die gönnen mir es einfach nicht."}, {"id": 346, "start": 3988.0, "end": 4007.0, "text": "Die gönnen mir es nicht. Ich hab theoretisch schon 5 Kills gemacht, aber kein Kill wurde mir gegönnt."}, {"id": 347, "start": 4007.0, "end": 4021.0, "text": "Die volle Gönnung. Where is he? Epicenter. Ich mag die Map."}, {"id": 348, "start": 4021.0, "end": 4028.0, "text": "Wo sieht man nochmal, wie viele Kills man machen muss? Unten? Heißt das jetzt, ich muss 2 Kills noch machen?"}, {"id": 349, "start": 4028.0, "end": 4040.0, "text": "Ich hab keinen Plan von dem Spiel. Da sitzt er. Da stellt er, der Stelser. Wahnsinn."}, {"id": 350, "start": 4040.0, "end": 4065.0, "text": "Stels Action. Ey. Kein Kill wird mir gegönnt."}, {"id": 351, "start": 4065.0, "end": 4091.0, "text": "Guck mal hier. 2-3-0. 0 hat Twitch Prime. Danke schön. Ey. Ich komm mir verarscht vor."}, {"id": 352, "start": 4091.0, "end": 4099.0, "text": "Jawoll, aber ich hab den Kill wenigstens. Achso, auf welcher Stufe das ist. Ah, verstehe."}, {"id": 353, "start": 4099.0, "end": 4113.0, "text": "Noch mehr Kills mit dem Crap. Die ersten sind schon auf Assault Rifles und alles."}, {"id": 354, "start": 4113.0, "end": 4132.0, "text": "Achtung, Achtung. Ey. Please. Gönnt mir Kills. Alter."}, {"id": 355, "start": 4132.0, "end": 4150.0, "text": "Aber wenn der Minimap steht, zahlen. Ah, verstehe. Jawoll. Alter, PP-Guard."}, {"id": 356, "start": 4150.0, "end": 4157.0, "text": "Ich komm mir dem Ding nicht klar, weil das nicht direkt auslöst. Ich komm mir dem Ding wirklich nicht klar."}, {"id": 357, "start": 4157.0, "end": 4167.0, "text": "Das ist, wenn du da hinziehst, das... Ja, ich hab 15 Millisekunden eingestellt."}, {"id": 358, "start": 4167.0, "end": 4189.0, "text": "15 Millisekunden. Beweger-Aim. So sieht's aus, Leute. Achtung. Massive-Flank. Massive-Flank. Massive-Flank-Action."}, {"id": 359, "start": 4189.0, "end": 4209.0, "text": "Nichts hittet. Letzte Runde gewonnen und jetzt gräbs mir mit 4-7 rum."}, {"id": 360, "start": 4209.0, "end": 4226.0, "text": "Wie, das war kein Kill?"}, {"id": 361, "start": 4226.0, "end": 4242.0, "text": "Alter, what the, what the hell?"}, {"id": 362, "start": 4242.0, "end": 4256.0, "text": "Jawoll. Ey, wir haben eine automatische Waffe. Nice."}, {"id": 363, "start": 4256.0, "end": 4273.0, "text": "Ah gut, der Typ, der ist ja noch, der ist ja noch, hat ja noch weniger Kills."}, {"id": 364, "start": 4273.0, "end": 4286.0, "text": "Alright. Auch von hinten wird, wird, wird sich angestellt."}, {"id": 365, "start": 4286.0, "end": 4307.0, "text": "Jawoll. P90. Jawoll, jetzt wird gerusht, Leute. Jetzt wird gerusht. P90-Rush ist real."}, {"id": 366, "start": 4307.0, "end": 4316.0, "text": "Oh. Haben wir uns gerade gegenseitig umgespaßt? Kann das sein? Haben wir uns gerade gegenseitig umgespaßt?"}, {"id": 367, "start": 4316.0, "end": 4332.0, "text": "Ich hab nur noch mal einen Schuss-Sound gehört und es war vorbei."}, {"id": 368, "start": 4332.0, "end": 4347.0, "text": "Okay, wir holen auf, Leute. Ich sag's euch, wir holen auf. Wir holen jetzt auf. Easy-Easy-Win. Easy-Win mit der Spaß."}, {"id": 369, "start": 4347.0, "end": 4361.0, "text": "Nee, nee, hier können wir nicht lang. Wir müssen irgendwo in die Mitte."}, {"id": 370, "start": 4361.0, "end": 4384.0, "text": "Keiner da. Achtung. Alter, das ist ja Wahnsinn, ey."}, {"id": 371, "start": 4384.0, "end": 4394.0, "text": "Es ist ja fast schon, es ist ja fast schon Call of Duty TDM hier. Okay, hier können wir nicht lang, hier können wir nicht lang. Ja, ja, ist gut."}, {"id": 372, "start": 4394.0, "end": 4401.0, "text": "Nein, nein, nein, hier können wir nicht lang mit der Spaß."}, {"id": 373, "start": 4401.0, "end": 4414.0, "text": "Alter. Einmal drauf, noch mal drauf. Please, game. Das ist bestimmt ein Mod. Das ist bestimmt ein Mod."}, {"id": 374, "start": 4414.0, "end": 4426.0, "text": "Der hat gemerkt, dass ich die letzte Runde gewonnen hab und jetzt hat er sich gedacht Bam, Max, jetzt nicht mehr."}, {"id": 375, "start": 4426.0, "end": 4439.0, "text": "Ist so, ist so. True, null W. Moment, Moment, Moment. Ich weiß, was wir jetzt machen. Wir machen die Flank-Action auf Doom."}, {"id": 376, "start": 4439.0, "end": 4456.0, "text": "Please, game. Lass mich doch irgendwas killen. Was soll ich denn noch machen? Was soll ich denn noch machen außer da draufschießen?"}, {"id": 377, "start": 4456.0, "end": 4470.0, "text": "Alter, 29 jetzt. Viel Spaß, der Tooth muss besser killen machen. Nee, nee, nee, da gehen wir nicht lang. True, null W. Haben wir eine Granate? Nee."}, {"id": 378, "start": 4470.0, "end": 4481.0, "text": "Das wäre zum Beispiel ein guter Mod. Also hier könnte man gut ansetzen für einen Mod und einfach Gungame ein bisschen weniger ppega machen."}, {"id": 379, "start": 4481.0, "end": 4497.0, "text": "Please, komm los mit dem Kill. Könnte Gungame echt ein bisschen weniger ppega machen."}, {"id": 380, "start": 4497.0, "end": 4522.0, "text": "Ja, ist alles tot, wenn ich hier anrücke. Okay. True. Okay, der Messer Dude braucht halt noch ein bisschen."}, {"id": 381, "start": 4522.0, "end": 4537.0, "text": "Oh nein, der Messer Dude hat es geschafft. Shit. Okay, eine Runde spielen wir noch. Eine Runde Gungame spielen wir noch."}, {"id": 382, "start": 4537.0, "end": 4548.0, "text": "Was geben wir uns denn danach? Danach, ich will danach unbedingt mal Rush Night Mode spielen, falls es einen Server gibt."}, {"id": 383, "start": 4548.0, "end": 4562.0, "text": "Wie findest du Venice Unleashed bis jetzt oder Venice Unleashed? Extrem nice. Poggers finde ich das. Poggers."}, {"id": 384, "start": 4562.0, "end": 4587.0, "text": "So eine geile Runde und jetzt sowas hier. Okay, eine Runde Gungame machen wir noch."}, {"id": 385, "start": 4587.0, "end": 4605.0, "text": "Seit acht Jahren bist du relativ lange dabei. Ich meine, es kann vor 2010 keiner am Start gewesen sein auf YouTube, da gab es den Channel noch nicht."}, {"id": 386, "start": 4605.0, "end": 4623.0, "text": "Okay, Map. Wo gehen wir lang? Okay. Einfach, einfach random geradeaus. Easy."}, {"id": 387, "start": 4623.0, "end": 4640.0, "text": "Wo immer die Gegner herkommen, irgendwo, irgendwo von hier kommen sie."}, {"id": 388, "start": 4640.0, "end": 4659.0, "text": "Jawoll, ich habe einen Kill. Easy, doppeltes. Auch noch doppelt Headshot in your face. So geht es gut los. So geht es gut los."}, {"id": 389, "start": 4659.0, "end": 4678.0, "text": "Ich finde ja die besten Maps für Gungames sind die Close Quarters Maps."}, {"id": 390, "start": 4678.0, "end": 4703.0, "text": "Fuck, da habe ich veraimt. Aber Close Quarters ist das Nice, das Nicest. Die sind nämlich die Maps auch irgendwie für ausgelegt auf sowas."}, {"id": 391, "start": 4703.0, "end": 4727.0, "text": "Oh Mann, diese Auslöserverzögerung killt mich."}, {"id": 392, "start": 4727.0, "end": 4741.0, "text": "Das beste Pistol in dem Game ist immer noch die G18."}, {"id": 393, "start": 4741.0, "end": 4764.0, "text": "Das beste Pistol ist die G18. Da kann mir keiner was erzählen. Ich darf wieder nichts killen, alles klar."}, {"id": 394, "start": 4764.0, "end": 4774.0, "text": "Die ersten haben schon wieder Assault Rifles eher. Sucker Modus, Sucker Modus."}, {"id": 395, "start": 4774.0, "end": 4803.0, "text": "Seit Battlefield 1 Videos? Ätzhaft? Ich habe Battlefield 1 Videos gemacht, ich habe das Game doch gar nicht."}, {"id": 396, "start": 4803.0, "end": 4821.0, "text": "Fuck, irgendwo hinter mir stellt es da rum. Wir haben aufgeholt ein bisschen. Man muss diese Pistolphase irgendwie hinkriegen."}, {"id": 397, "start": 4821.0, "end": 4834.0, "text": "Und das Game spawnt einen viel zu weit außen. Es ist ja 30 Kilometer unterwegs bis du irgendwo bist."}, {"id": 398, "start": 4834.0, "end": 4855.0, "text": "Also Gun Game ist echt der optimale Modus für die Close Quarters Maps. Da oben ist ein Gegner und auf der anderen Seite."}, {"id": 399, "start": 4855.0, "end": 4871.0, "text": "Oh, es ist Spaß, Spaß, Alter, Spaß. Okay, Spaß. Das ist nicht der neue Mod, das ist aber, also ja, das ist der neue Mod."}, {"id": 400, "start": 4871.0, "end": 4899.0, "text": "Das ist aber, glaube ich, ein klassisches Gun Game, das ist so wie immer. Nur, dass der Blaufilter weg ist."}, {"id": 401, "start": 4899.0, "end": 4907.0, "text": "Ey, die Spaß, die soll die Schwann hinten, Alter. Die soll die Schwann hinten gefälligst, wenn ich im Nahkampf auf dich draufballere."}, {"id": 402, "start": 4907.0, "end": 4913.0, "text": "Wozu ist die denn sonst gut?"}, {"id": 403, "start": 4913.0, "end": 4932.0, "text": "Pepega, ey. Richtiges Pepega Game. Hallo, runter. Massive Pepega-Stellz. Und man kann nicht mal bei den Leuten spawnen."}, {"id": 404, "start": 4932.0, "end": 4945.0, "text": "So, also das ist wirklich was, wo man als Modder einen richtig geilen Modus drauf machen kann. Erstens die Leute ordentlich spawnen lassen. Wieso? Waffen Rotation ändern."}, {"id": 405, "start": 4945.0, "end": 4965.0, "text": "Okay, hier kann ich nichts machen, bin ich zu weit weg. Generell Waffen ändern."}, {"id": 406, "start": 4965.0, "end": 4979.0, "text": "Ich meine, so ein richtiges Pepega. Wer da oben sitzt mit dem Assault Rifle, der ist einfach easy win, easy life."}, {"id": 407, "start": 4979.0, "end": 4995.0, "text": "Oh, jetzt haben wir einen Assault Rifle. Ist das so mit dem Kopf, mit der Magne? Was ist denn das? Hab ich eine ACR? Ist das eine ACR? Gerne."}, {"id": 408, "start": 4995.0, "end": 5017.0, "text": "Oh."}, {"id": 409, "start": 5017.0, "end": 5033.0, "text": "Was haben wir jetzt? Scar? Scar?"}, {"id": 410, "start": 5033.0, "end": 5049.0, "text": "Na Leute, kaum haben wir eine gescheite Waffe, geht's ja auch."}, {"id": 411, "start": 5049.0, "end": 5071.0, "text": "Wir gehen jetzt einfach hoch ins Haus, Beste."}, {"id": 412, "start": 5071.0, "end": 5095.0, "text": "Okay, wir müssen hoch ins Haus, wir müssen hoch ins Haus, unbedingt. Unbedingt."}, {"id": 413, "start": 5095.0, "end": 5105.0, "text": "Noch eins hoch, noch eins hoch."}, {"id": 414, "start": 5105.0, "end": 5131.0, "text": "Okay, Sucker Weapon. Weil hier oben können sie nichts machen."}, {"id": 415, "start": 5131.0, "end": 5143.0, "text": "Please, lass mir doch mal was da."}, {"id": 416, "start": 5143.0, "end": 5162.0, "text": "Kann man hier oben aus dem Fenster stelzen? Fenster gucken oder so?"}, {"id": 417, "start": 5162.0, "end": 5178.0, "text": "Oh, LMG legit, LMG legit. LMG legit, was sollen wir jetzt machen?"}, {"id": 418, "start": 5178.0, "end": 5195.0, "text": "Pass mal auf hier. Bisschen risikoreich, wo wir da gerade rumstehen."}, {"id": 419, "start": 5195.0, "end": 5212.0, "text": "Okay, ich muss runter, ich muss runter, hier siehst du nichts, hier siehst du nichts, hier siehst du nichts."}, {"id": 420, "start": 5212.0, "end": 5222.0, "text": "Jawoll, jawoll. Kommt jetzt Schneiber oder was ist das? Was ist das?"}, {"id": 421, "start": 5222.0, "end": 5236.0, "text": "Ah, das ist 417 mit da."}, {"id": 422, "start": 5236.0, "end": 5255.0, "text": "Okay, Bullet Travel Time. Kommt her, kommt her, kommt her, kleinen PP Gas."}, {"id": 423, "start": 5255.0, "end": 5281.0, "text": "Erstmal, erstmal schön weg Schneibt."}, {"id": 424, "start": 5281.0, "end": 5297.0, "text": "Ich hasse Sniper. Warum sind das teilweise keine Kills?"}, {"id": 425, "start": 5297.0, "end": 5313.0, "text": "Oh nee, der eine ist schon mal 30 Kills. Please, lass mich doch was killen. Jawoll, jetzt hier, Grenade."}, {"id": 426, "start": 5313.0, "end": 5328.0, "text": "Massive Nadespam, der Poggers Nadespam ist am Start. Ich spamme einfach Nades rein."}, {"id": 427, "start": 5328.0, "end": 5351.0, "text": "Bam, oh nee. Okay, YOLO Messer. Nein, der YOLO Messer-Modus hat nicht geklappt."}, {"id": 428, "start": 5351.0, "end": 5367.0, "text": "Nice, wenn dir das Weihnachtsvideo gefallen hat. Pogchamping."}, {"id": 429, "start": 5367.0, "end": 5375.0, "text": "Ey, wie soll man hier einen Messer-Kill machen? Please. Wie soll man hier einen Messer-Kill machen?"}, {"id": 430, "start": 5375.0, "end": 5389.0, "text": "Moment, der ist mit der R93 am Start. Also ich betrachte mich einfach als Gewinner, weil Messer-Kills nicht gehen."}, {"id": 431, "start": 5389.0, "end": 5400.0, "text": "Alter, Messer-Kills."}, {"id": 432, "start": 5400.0, "end": 5415.0, "text": "Kannst dich mal richtig anstelzen hier. Okay, Achtung, der da jetzt. Der Dude, der jetzt hier kommt."}, {"id": 433, "start": 5415.0, "end": 5438.0, "text": "Alter, wie soll ich hier Messer-Kills machen? Wie, wie? Oh nein. Alter, kommt er. Achtung."}, {"id": 434, "start": 5438.0, "end": 5450.0, "text": "Bam, easy Messer-Kill in your ass, Alter. Easy clap."}, {"id": 435, "start": 5450.0, "end": 5470.0, "text": "Ja, ich würde das Messer ja werfen. Ja, es wäre das Gun Game auf, ähm, auf einer Close. Ich guck mal, was für eine Map jetzt kommt."}, {"id": 436, "start": 5470.0, "end": 5485.0, "text": "Pausierungs-Champ. Easy, ihr wisst ja, ihr wisst ja, wie das ist, Leute. Wenn man gewinnt, wenn man gewinnt, ist das prinzipiell easy."}, {"id": 437, "start": 5485.0, "end": 5497.0, "text": "Und ansonsten cheaten die anderen. Sind wir uns einig, oder?"}, {"id": 438, "start": 5497.0, "end": 5502.0, "text": "Jawoll. Was kommt denn für eine Map? Please, eine gescheite Map. Irgendeine Close Quarters Map."}, {"id": 439, "start": 5502.0, "end": 5507.0, "text": "Pass auf, jetzt kommt wahrscheinlich Caspian Border Gun Master und dann einmal über die ganze Map rennen."}, {"id": 440, "start": 5507.0, "end": 5519.0, "text": "Tuller Market. Tuller Market ist auch Epicenter-Dings. Aftermath DLC, oder?"}, {"id": 441, "start": 5519.0, "end": 5522.0, "text": "Was waren das für Maps? Ich kann mich so gar nicht mehr dran erinnern."}, {"id": 442, "start": 5522.0, "end": 5531.0, "text": "Aber fällt euch auf, wie neu das Spiel aussieht ohne den Plaufilter."}, {"id": 443, "start": 5531.0, "end": 5540.0, "text": "Sagen wir mal, ist da ein Gegner in uns gespawnt gerade?"}, {"id": 444, "start": 5540.0, "end": 5563.0, "text": "Da ist ein Gegner in uns gespawnt. Was?"}, {"id": 445, "start": 5563.0, "end": 5576.0, "text": "Ich brauche Leben."}, {"id": 446, "start": 5576.0, "end": 5588.0, "text": "Saka-Waffe. Ich komme mit dem Ding null klar, mit der Waffe."}, {"id": 447, "start": 5588.0, "end": 5608.0, "text": "Ok, nice, nice. Post-Champ, Post-Champ."}, {"id": 448, "start": 5608.0, "end": 5615.0, "text": "Ok, wo ist der Dude? Da oben. Wie kommt man hier rauf? Treppen-Champ."}, {"id": 449, "start": 5615.0, "end": 5625.0, "text": "Oh, habt ihr den gesehen? Was? Ein Aimer-Dude, hä?"}, {"id": 450, "start": 5625.0, "end": 5651.0, "text": "Massive-Aimer-Dude."}, {"id": 451, "start": 5651.0, "end": 5664.0, "text": "Was ein krasser Dude. Du hast nur vor Schreck abgedrückt."}, {"id": 452, "start": 5664.0, "end": 5668.0, "text": "Ich habe schon in die Richtung geschossen. Ganz random war es nicht."}, {"id": 453, "start": 5668.0, "end": 5671.0, "text": "Pass auf, und jetzt kriegen wir wieder keine Kills mit der Shotgun."}, {"id": 454, "start": 5671.0, "end": 5674.0, "text": "Jetzt kriegen wir wieder keine Kills mit der Shotgun. Ich sehe es schon kommen."}, {"id": 455, "start": 5674.0, "end": 5686.0, "text": "Übelsgeil geowned. Kleiner Speichern. Übelsgeil geowned, aber nee."}, {"id": 456, "start": 5686.0, "end": 5693.0, "text": "Bashed würde ich mal sagen."}, {"id": 457, "start": 5693.0, "end": 5698.0, "text": "Achtung, Achtung. Flankierungs-Stells. Flank-Stells."}, {"id": 458, "start": 5698.0, "end": 5707.0, "text": "Nichts mehr darstellt. Nice."}, {"id": 459, "start": 5707.0, "end": 5719.0, "text": "Alles tot. Nice geflankt."}, {"id": 460, "start": 5719.0, "end": 5729.0, "text": "Oh, Post-Champ, Post-Champ."}, {"id": 461, "start": 5729.0, "end": 5738.0, "text": "Nein, da sitzt er noch. Ich dachte, er ist weg."}, {"id": 462, "start": 5738.0, "end": 5746.0, "text": "Jetzt kommen die dreckigen Shotguns."}, {"id": 463, "start": 5746.0, "end": 5757.0, "text": "Aber das ist eine Map. Die geht. Da kann man das drauf spielen."}, {"id": 464, "start": 5757.0, "end": 5776.0, "text": "Alles danke. Alter, lass mir Kills, please."}, {"id": 465, "start": 5776.0, "end": 5783.0, "text": "In den Kopf gespasst."}, {"id": 466, "start": 5783.0, "end": 5794.0, "text": "Der letzte Kill muss ein Messer sein, ja. Deswegen kannst du die ziemlich gut aufholen."}, {"id": 467, "start": 5794.0, "end": 5801.0, "text": "What? Alter, die gönnen mir nichts. Leute, die gönnen mir nichts an Kills."}, {"id": 468, "start": 5801.0, "end": 5819.0, "text": "Bäm, jawoll. Die gönnen mir nichts."}, {"id": 469, "start": 5819.0, "end": 5833.0, "text": "Da auf dem Dach. Dach-Stells. Nice Dach-Stells. Easy."}, {"id": 470, "start": 5833.0, "end": 5839.0, "text": "Okay, wir gehen in die Mitte. Wir müssen uns beeilen. Die sind uns auf den Fersen, Leute. Die sind uns auf den Fersen."}, {"id": 471, "start": 5839.0, "end": 5851.0, "text": "Was? Instant Replay ist off? Nvidia, please. Was ist mit euch los?"}, {"id": 472, "start": 5851.0, "end": 5859.0, "text": "PP-Gas, Alter. Jetzt hat einfach mal ein Shadowplay ausgeschaltet. Warte mal, ist die Festplatte voll?"}, {"id": 473, "start": 5859.0, "end": 5868.0, "text": "Nö. Einfach so. Hat sich gedacht. Hat sich gedacht, jetzt ist eine gute Zeit, Shadowplay auszuschalten."}, {"id": 474, "start": 5868.0, "end": 5880.0, "text": "Aber ich hab's ja im Stream, ich hab's ja im Stream, kein Problem."}, {"id": 475, "start": 5880.0, "end": 5894.0, "text": "Da ist doch ein Dude in deinem Auto gewesen gerade. Ist das die auch hier?"}, {"id": 476, "start": 5894.0, "end": 5907.0, "text": "Lulwee, wo kommt der her? Festplatten League, oh fuck. Jetzt ist es raus, Leute. Ich hab eine D-Festplatte."}, {"id": 477, "start": 5907.0, "end": 5915.0, "text": "Fuck, und jetzt? Was mach ich jetzt? Wie kann ich dieses League jemals wieder gerade rücken?"}, {"id": 478, "start": 5915.0, "end": 5932.0, "text": "Jetzt ist es vorbei. Jetzt legit, legit vorbei. Weil wir rennen hier einfach gerade richtig PP-Gas durch die Mitte, ne?"}, {"id": 479, "start": 5932.0, "end": 5951.0, "text": "Ich seh dich nicht, Alter. Ich seh dich nicht. Okay, nice kill assist. Oh, oh, pause jam."}, {"id": 480, "start": 5951.0, "end": 5957.0, "text": "Okay, keine Ahnung, was da abgeht. Ich bleib jetzt hier einfach stehen, das ist eine ganz gute Pose."}, {"id": 481, "start": 5957.0, "end": 5964.0, "text": "Warum aimt man so krass schnell mit dem LMG? Guckt euch das mal an."}, {"id": 482, "start": 5964.0, "end": 5974.0, "text": "Massive-Aim-Champ. Das war kein Kill. Lul. Ja, klar."}, {"id": 483, "start": 5974.0, "end": 5981.0, "text": "Ich muss noch ein PC vom Media Markt holen. Ja, genau."}, {"id": 484, "start": 5981.0, "end": 5989.0, "text": "Kill assist, kill assist, kill assist. Jawoll, kill assist, kill assist, kill. Sicherlich auch wieder kill assist."}, {"id": 485, "start": 5989.0, "end": 5994.0, "text": "Einfach kill assist."}, {"id": 486, "start": 5994.0, "end": 6011.0, "text": "Okay, wir stellts jetzt durch die Mitte. Mitte stellts."}, {"id": 487, "start": 6011.0, "end": 6031.0, "text": "Alter, gönnt mir doch was. Gönnt mir was. Jawoll."}, {"id": 488, "start": 6031.0, "end": 6047.0, "text": "Okay, ich seh nix. Ich seh nix vor lauter Sand."}, {"id": 489, "start": 6047.0, "end": 6066.0, "text": "Alter. Guckt euch das mal an. So ne nice Runde, ne? Und random irgendwelche..."}, {"id": 490, "start": 6066.0, "end": 6071.0, "text": "Ah, Mr. Army ist vor mir. Okay, ne, der ist gut, den kenn ich. Den hatten wir schon ein paar Mal in-game."}, {"id": 491, "start": 6071.0, "end": 6081.0, "text": "Aber viel Spaß, du musst jetzt besser Kills machen, Lulwe. Good job. Good luck. HF."}, {"id": 492, "start": 6081.0, "end": 6099.0, "text": "Äh, okay, war's wahr. Battlefield, gut. Gibt keine Kills."}, {"id": 493, "start": 6099.0, "end": 6120.0, "text": "Okay, M416, easy."}, {"id": 494, "start": 6120.0, "end": 6149.0, "text": "Okay, alles klar. Ah, shit. Mann, mittleren Alters tilted beim Ego-Shooter. Mann, mittleren Alters owned junge Tryhards, würde ich eher sagen."}, {"id": 495, "start": 6149.0, "end": 6162.0, "text": "Leute, lasst mir doch mal irgendwas übrig."}, {"id": 496, "start": 6162.0, "end": 6180.0, "text": "Ey, ist das krass? Please, willst du was? Ja, na klar. Zweimal reingeschossen, nicht ein Hit-Rack."}, {"id": 497, "start": 6180.0, "end": 6191.0, "text": "Es ist halt Battlefield, wie sagt man schon, wie es lebt und leibt und lebt und lebt und lebt und liebt und... Ach, keine Ahnung, gewiss, was ich mein."}, {"id": 498, "start": 6191.0, "end": 6207.0, "text": "Jetzt geht einfach wieder nix, ne? Krass geowned und jetzt... Oh ne, Schneiberman. Schneiber, oh Gott, der Schneiberman ist am Start."}, {"id": 499, "start": 6207.0, "end": 6216.0, "text": "Mann, mittleren Alters werden Kills gestohlen, ja. Aber richtig close."}, {"id": 500, "start": 6216.0, "end": 6231.0, "text": "Oh fuck, habt ihr gesehen, wie explodiert ist der Typ? Der ist einfach geplatzt."}, {"id": 501, "start": 6231.0, "end": 6249.0, "text": "Aber ist das die China-Sniper, oder? Die China-Sniper."}, {"id": 502, "start": 6249.0, "end": 6263.0, "text": "Was? Alter. Kill-Steal. Bam, nice. Flick-Sword."}, {"id": 503, "start": 6263.0, "end": 6284.0, "text": "Nicer Kill-Steal, GG. By the way, wer hat sich diesen Drecksgranatwerfer ausgedacht, ne? Der wirft ja keine Granaten, der schießt ja Handgranaten, das ist richtig dumm, das Ding."}, {"id": 504, "start": 6284.0, "end": 6303.0, "text": "Das ist richtig pepega, das Teil da. Richtig pepega, das Ding. Wie soll man damit was töten, ne? Guck mal, und Mr. Army ist beim... ist am Start mit dem Messer. Das ist das neue Addon, ja?"}, {"id": 505, "start": 6303.0, "end": 6315.0, "text": "Aber kann man besser, kann man Direct Impact machen mit dem Nade-Launcher?"}, {"id": 506, "start": 6315.0, "end": 6330.0, "text": "Damit tötest du doch nichts. Nein. Ich hab ihn vor mir in Messern sehen. Das ist we nice, korrekt, Salomon, we nice."}, {"id": 507, "start": 6330.0, "end": 6341.0, "text": "Also, diesen Modus könnte man nochmal ein Vielfaches besser machen, wenn man die... wenn man... also Messer und Granatwerfer... ne, lass den Granatwerfer drinne."}, {"id": 508, "start": 6341.0, "end": 6358.0, "text": "Okay, lass den Granatwerfer drinne, aber mach nicht den Granaten... also nicht den Granaten-Granatwerfer rein, sondern den Frag-Granatenwerfer, damit kann man wenigstens was killen."}, {"id": 509, "start": 6358.0, "end": 6377.0, "text": "So, und macht vielleicht die DMR und Sniper-Sachen weniger und Messer weg. Dann ist das ein richtig poggers Modus."}, {"id": 510, "start": 6377.0, "end": 6388.0, "text": "Der Granatenwerfer wirft Granaten... ja, es gibt im Battlefield, du hast Smoke, Smoke-Granatenwerfer, so ein Shotgun-Granatenwerfer, wobei, ne, der ist glaub ich nur Underbarrel, ne?"}, {"id": 511, "start": 6388.0, "end": 6396.0, "text": "So ein Frag-Granatenwerfer, der direkt explodiert... also der Granaten-Granatenwerfer ist halt... der verschießt Handgranaten. Das ist... oh nein, Siebertauer, ne, ist das Siebertauer?"}, {"id": 512, "start": 6396.0, "end": 6405.0, "text": "Also der verschießt Handgranaten, wie ne richtige Granate, also richtig dumm, die explodieren auch nicht gleich. Die Frags, die explodieren wenigstens gleich."}, {"id": 513, "start": 6405.0, "end": 6420.0, "text": "Ne, Messer ist dumm. Ganz ehrlich, Messer ist dumm, du rennst teilweise 3 Stunden rum."}, {"id": 514, "start": 6420.0, "end": 6437.0, "text": "Oh, Alter, der wills aber wissen. Hatte Gunmaster nicht mehrere Presets? Durchaus möglich, aber das sackt gerade. Alter, die Dudes, was ist hier los?"}, {"id": 515, "start": 6437.0, "end": 6453.0, "text": "Wo bin ich jetzt? Skill-Best-Matchmaking-MLG-Finals oder was hier gerade? Da Jumpshotten so um die Ecke, the fuck?"}, {"id": 516, "start": 6453.0, "end": 6474.0, "text": "Jumpshotten um die Ecke? Die Jumpshotten einfach um die Ecke? Auf dieser Map kann man schwitzen kommen, aber heftig, ja. Vor allem wenn man diese Dreckswaffe hier hat."}, {"id": 517, "start": 6474.0, "end": 6485.0, "text": "Schreckt, Alter, schreckt. Each in your face schreckt. Bam, in den Kopf, Alter."}, {"id": 518, "start": 6504.0, "end": 6520.0, "text": "Wie, alles weg? Wie, alles weg, jetzt wo ich da bin, alles weg? Oh nix wie fort hier, ich hab ihn gesehen da in der Mitte. Treppe."}, {"id": 519, "start": 6520.0, "end": 6541.0, "text": "Die Map ist geil, die Map ist geil, ewig nicht mehr gespielt, aber die Map ist geil. We nice. Oha, hinter mir einfach."}, {"id": 520, "start": 6541.0, "end": 6556.0, "text": "We nice unleashed. Ich blicke nicht mehr durch, das ist zu viel hier. Gerade, das ist zu viel."}, {"id": 521, "start": 6556.0, "end": 6575.0, "text": "What is happening? Ah fuck. We nice unleashed ist am Start."}, {"id": 522, "start": 6575.0, "end": 6597.0, "text": "Ja klar, spawnen sie zu dritt vor mir und schießen sie in den Kopf. Sehr gut, sehr gut Battlefield. Nice. We nice, um nicht zu sagen we nice."}, {"id": 523, "start": 6597.0, "end": 6612.0, "text": "Spaß, Alter, jetzt kommen die Spaß. Spaß auf der Map ist richtig Spaß, Alter. Massive Spaß. Ja klar. Huge, huge Spaß."}, {"id": 524, "start": 6612.0, "end": 6635.0, "text": "Alter, der erste ist schon mit 17. Das sind die Zebra Tower Experts, 24 in Zebra Tower, GG. Zebra Tower for life, sie haben das im Game Attack gehabt bei der Xbox."}, {"id": 525, "start": 6635.0, "end": 6649.0, "text": "Reload in der Dusche, exquisite."}, {"id": 526, "start": 6649.0, "end": 6669.0, "text": "Okay, ACR, jetzt sind wir wieder competitive. Jetzt können wir wieder was machen. Fuck. Ich hätte aimen sollen, Spell Field, da kann man aber eigentlich aus der Hüfte sprayen."}, {"id": 527, "start": 6669.0, "end": 6689.0, "text": "Wir sind nicht so gut, wir sind nicht so gut gerade. Was?"}, {"id": 528, "start": 6689.0, "end": 6716.0, "text": "Ich bin verwirrt. Alter, das Game macht mich fertig. Die ist anstrengend, die ist echt anstrengend. Die Map ist anstrengend. Was haben wir denn? ACR. Okay, ACR kann man sprayen, ACR kann man sprayen."}, {"id": 529, "start": 6716.0, "end": 6727.0, "text": "Ja, die Map ist der Wahnsinn von allen Seiten."}, {"id": 530, "start": 6727.0, "end": 6738.0, "text": "Was ist das? Ta?"}, {"id": 531, "start": 6738.0, "end": 6747.0, "text": "Monarch."}, {"id": 532, "start": 6747.0, "end": 6758.0, "text": "Die Map ist stressig, die Map ist Stress pur, Leute."}, {"id": 533, "start": 6758.0, "end": 6776.0, "text": "Fuck. Alter, Mr. Army, der hat es drauf hier. Der hat bestimmt früher Zebra Tower 24 in Zebra gemacht."}, {"id": 534, "start": 6776.0, "end": 6793.0, "text": "Na klar, na klar, na klar."}, {"id": 535, "start": 6793.0, "end": 6810.0, "text": "Kein Kill, Alter, was ist das? Klick, klick, klick, klick, klick, klick, klick, klick, klick. Go, go, go. Hier, dafür kannst du dir einfache Messerkills machen."}, {"id": 536, "start": 6810.0, "end": 6826.0, "text": "Delete, Alter. Wir haben 20, der ist schon mit 30 am Start, Alter, what the fuck."}, {"id": 537, "start": 6826.0, "end": 6840.0, "text": "Kommst du, kommst du raus? Kommt ihr, kommt ihr, ich bleibe jetzt einfach hier. Kommt her, kommt her, ich will, ich will."}, {"id": 538, "start": 6840.0, "end": 6856.0, "text": "Okay. Er muss Messerkills machen."}, {"id": 539, "start": 6856.0, "end": 6860.0, "text": "Okay, Leute. Wir schauen jetzt, was es noch für Server gibt."}, {"id": 540, "start": 6860.0, "end": 6873.0, "text": "Das ist aber anstrengend. Also, Zebra Tower Gun Game. So, was haben wir noch Schönes?"}, {"id": 541, "start": 6873.0, "end": 6882.0, "text": "So. Was war denn das? Conquer, Rush. Hardcore Medics."}, {"id": 542, "start": 6882.0, "end": 6902.0, "text": "Okay, 64 Mann ist mir zu viel. Gun Master Map Rotation. Ach Quatsch, ich kacknup, das ist doch gerade wo wir drauf gewesen sind."}, {"id": 543, "start": 6902.0, "end": 6922.0, "text": "Oh, was jetzt? Es geht Glas kaputt. Es geht ganz viel Glas kaputt in Battlefield gerade. Der Plaufelder ist eine Server Einstellung, ja?"}, {"id": 544, "start": 6922.0, "end": 6939.0, "text": "Scrap Metal. Quatsch, was war das nochmal für eine Map? Ach, das Ding, Alter, die Spawnen. Hey, lass mich nicht nach vorne, ich will nicht vorne hin."}, {"id": 545, "start": 6939.0, "end": 6965.0, "text": "Ich will nicht vorne hin. Faire Spawn, Faire Spawn würde ich sagen. Oh, ist das Faire Spawn. Massive Faire Spawn."}, {"id": 546, "start": 6965.0, "end": 6974.0, "text": "Oh Leute, mein Hirn ist kaputt, ich kann immer. Ich kann kein Gun Game mehr spielen, ich brauch was anderes."}, {"id": 547, "start": 6974.0, "end": 6980.0, "text": "What the fuck? Soll ich den noch machen oder drauf schießen?"}, {"id": 548, "start": 6980.0, "end": 6988.0, "text": "Ich muss was anderes spielen gleich. Letzte Runde Gun Game, ich krieg keine mehr. Es ist zu anstrengend."}, {"id": 549, "start": 6988.0, "end": 6996.0, "text": "Ich bin halt mittlerweile 36, da geht es nicht mehr."}, {"id": 550, "start": 6996.0, "end": 7022.0, "text": "Okay."}, {"id": 551, "start": 7022.0, "end": 7030.0, "text": "Hier fallen sie alle um mich um. Mr. Army wieder hier. 9-1-0-W. Ah nee, wir sind auch später reingejoint."}, {"id": 552, "start": 7030.0, "end": 7036.0, "text": "Aber trotzdem."}, {"id": 553, "start": 7036.0, "end": 7054.0, "text": "Wo sind denn Gegner? Hallo? Haben wir mal ein paar Gegner? So zur Abwechslung?"}, {"id": 554, "start": 7054.0, "end": 7067.0, "text": "Ein Gegner, please. Gegner? Gibt's nicht."}, {"id": 555, "start": 7067.0, "end": 7089.0, "text": "Gibt's keine. Ist das das, was die mit vertikales Gameplay meinten früher? So vertikal, dass du keinen Gegner findest?"}, {"id": 556, "start": 7089.0, "end": 7105.0, "text": "Ich kann ja mal spielen, der Modus. Ich muss raus, ist mir zu anstrengend. Mr. Army easy win. Die Runde haben wir schon gewonnen."}, {"id": 557, "start": 7105.0, "end": 7130.0, "text": "Okay, alles klar. Gibt's nichts. Ich hab gedacht Battlefield kann auch so öfter schießen. Was spielen wir denn danach? Wir brauchen irgendeinen anderen Server."}, {"id": 558, "start": 7130.0, "end": 7150.0, "text": "Übrigens auch eine Sache, die man nur auf dem PC machen kann, dieses rumgesperrmen nach links, rechts."}, {"id": 559, "start": 7150.0, "end": 7165.0, "text": "Leute hat irgendjemand eine Ahnung, was ich da für eine Waffe hab? Ist das die Wal als VSV? Was ist denn das?"}, {"id": 560, "start": 7165.0, "end": 7190.0, "text": "Das Wal? Da gehört mir nichts. Hier gehört mir alle nichts."}, {"id": 561, "start": 7190.0, "end": 7219.0, "text": "Was ist das normal für eine Waffe? Engineer? Der Mr. Army geht ab. Ist das Engineer Waffe?"}, {"id": 562, "start": 7219.0, "end": 7233.0, "text": "Nee, das ist keine PDW. Das kann wirklich PP-19 sein. Ach, das ist so eine Waffe, die für alle ist."}, {"id": 563, "start": 7233.0, "end": 7261.0, "text": "Okay. Boah ey, das ist mir zu anstrengend. Also letzte Runde Gun Game. Die Wins waren ultra nice, aber auf der anderen Seite"}, {"id": 564, "start": 7261.0, "end": 7270.0, "text": "Wenn die hier nicht gleich... Ja, na klar. Ich hab Legit vornehm gestanden und ihm mit der Spass ins Gesicht geschossen."}, {"id": 565, "start": 7270.0, "end": 7293.0, "text": "Nichts passiert. Man müsste Army schon wieder bei 19. Aber wenigstens, wenigstens ist das ein Team-Win."}, {"id": 566, "start": 7293.0, "end": 7310.0, "text": "Ich hab keine Ahnung, wo hier was abgeht, aber zumindest ist nichts hier."}, {"id": 567, "start": 7310.0, "end": 7329.0, "text": "Ich kann mir vorstellen, ohne Mist, wenn man Gun Game öfter spielt, dann weiß man, wo man lang rennen muss. Mein Problem ist ja aktuell, ich hab null den Flow drinnen, wo hier was geht."}, {"id": 568, "start": 7329.0, "end": 7345.0, "text": "Ist er beim Messer? Oh, er ist beim Messer, null. Jawoll, er hat in your face. Okay Leute, ich muss auf den anderen Server. Das wird zu anstrengend. Das ist mir zu anstrengend. Das pack ich für meine alten Tage nicht mehr."}, {"id": 569, "start": 7345.0, "end": 7370.0, "text": "So, was haben wir denn zu bieten? Hardcore Demoman Peak Rush. Wir gucken nochmal, was es für Nachtmaps gibt. Das war spitz am nicest."}, {"id": 570, "start": 7370.0, "end": 7380.0, "text": "Bei einem Schuss hast du direkt hitted."}, {"id": 571, "start": 7380.0, "end": 7387.0, "text": "Okay, komm, wir gehen uns nochmal kurz ne Runde."}, {"id": 572, "start": 7387.0, "end": 7407.0, "text": "Also, wenn es einen Mod gibt, wo man Custom-Waffen-Rotation machen kann, dann würd ich mir sogar nen Gun Game Server holen. Irgendwas, was halt nicht ganz so random ist."}, {"id": 573, "start": 7407.0, "end": 7419.0, "text": "Äh, äh, äh, äh."}, {"id": 574, "start": 7419.0, "end": 7441.0, "text": "Konnte man eigentlich hier hoch springen? Wow."}, {"id": 575, "start": 7441.0, "end": 7454.0, "text": "Okay, easy win. Also, auf der Map bringt das Nachtsicht-Visier meiner Meinung nach richtig was. Weil hier hast du mit Mündungsfeuer im dunklen. Du siehst die Gegner nicht."}, {"id": 576, "start": 7454.0, "end": 7483.0, "text": "Also, hier find ich's nice. Ich mein, es geht, aber hier lohnt sich. Auf den anderen Nachtmaps sind eigentlich hell genug."}, {"id": 577, "start": 7483.0, "end": 7509.0, "text": "MonkaS, was war das denn gerade?"}, {"id": 578, "start": 7509.0, "end": 7525.0, "text": "Okay. Danach kommt's Infrarot-Visier raus, Leute. Ich sag's euch."}, {"id": 579, "start": 7525.0, "end": 7554.0, "text": "Mit Mr. Ami bist du wieder am Start eigentlich. Ich kann den Squad wechseln. Sieh mal. Ein nicest Teammate."}, {"id": 580, "start": 7554.0, "end": 7569.0, "text": "Ach, du bist Russ. Russland."}, {"id": 581, "start": 7569.0, "end": 7584.0, "text": "Du bist kein Comrade. Äh, ich switch einfach rüber. Easy. Ah, nee. Team-Switching ist disabled."}, {"id": 582, "start": 7584.0, "end": 7603.0, "text": "Keg-Tribble-Ur. Kids-Switching ist das. Okay, easy win."}, {"id": 583, "start": 7603.0, "end": 7615.0, "text": "Mal gucken. Lul, wie größer Keg-Way ist im Gegner-Team. Nice. So muss es sein."}, {"id": 584, "start": 7615.0, "end": 7631.0, "text": "Ja, es gibt ja keinen gescheiten Server. Ich hab nichts gefunden. Rush war so was ganz bescheuertes mit Headshot, One-Shot-Headshot."}, {"id": 585, "start": 7631.0, "end": 7640.0, "text": "Ja, wenn's wieder einen Cat24-Live-Server gibt, bin ich sofort am Start."}, {"id": 586, "start": 7640.0, "end": 7646.0, "text": "Alter, mir ist übelst zu warm hier, ey. Stimmt, ich könnte mir einfach einen leeren Server suchen."}, {"id": 587, "start": 7646.0, "end": 7652.0, "text": "Ja, warte mal, ich guck mal, was für eine Map als nächstes kommt. Ich guck mal, was für eine Map als nächstes kommt."}, {"id": 588, "start": 7652.0, "end": 7659.0, "text": "Wenn ich da keinen Bock drauf hab, dann füllen wir irgendeinen Rush-Server."}, {"id": 589, "start": 7659.0, "end": 7665.0, "text": "Ich muss die nur füllen. Easy, machen wir gleich. Sand-Crossing."}, {"id": 590, "start": 7665.0, "end": 7669.0, "text": "Okay, Moment. Das spielen wir jetzt noch."}, {"id": 591, "start": 7669.0, "end": 7674.0, "text": "Oder wie viele Tickets hatten das? Wie viele hatten der? Wie viele Tickets hatten das Ding?"}, {"id": 592, "start": 7674.0, "end": 7684.0, "text": "Ich war jetzt nämlich kein Bock auf ein 20-Minuten-Game."}, {"id": 593, "start": 7684.0, "end": 7690.0, "text": "Gibt's so was wie Info? Man sieht ja noch was."}, {"id": 594, "start": 7690.0, "end": 7697.0, "text": "Nice Spawn. Exquisite."}, {"id": 595, "start": 7697.0, "end": 7702.0, "text": "Perfekter Spawn."}, {"id": 596, "start": 7702.0, "end": 7711.0, "text": "Ein extrem nicer Spawn."}, {"id": 597, "start": 7711.0, "end": 7716.0, "text": "300. Oh, das ist ein bisschen viel. Nee, ich glaub, das spielen wir jetzt nicht mehr."}, {"id": 598, "start": 7716.0, "end": 7725.0, "text": "Wir gehen auf den anderen Server."}, {"id": 599, "start": 7725.0, "end": 7742.0, "text": "Mal kurz hier schnell was bashen oder gebashed werden."}, {"id": 600, "start": 7742.0, "end": 7749.0, "text": "Hier oben geht's ja gerne mal lang."}, {"id": 601, "start": 7749.0, "end": 7753.0, "text": "Da kommt gleich von unten was. Den werden wir jetzt erfreuen."}, {"id": 602, "start": 7753.0, "end": 7758.0, "text": "Mit der G18 ins Gesicht ballern."}, {"id": 603, "start": 7758.0, "end": 7764.0, "text": "Jo, Leute, wir füllen den anderen Server."}, {"id": 604, "start": 7764.0, "end": 7768.0, "text": "Night-Time, Night-Time. Mach was Neues. Das brauch ich auch."}, {"id": 605, "start": 7768.0, "end": 7772.0, "text": "Ich brauch ja ein bisschen Gameplay-Material."}, {"id": 606, "start": 7772.0, "end": 7777.0, "text": "Da ist einfach cooler, wenn's Night-Time ist. Das ist was Neues."}, {"id": 607, "start": 7777.0, "end": 7783.0, "text": "Also, dann suchen wir Game Mode."}, {"id": 608, "start": 7783.0, "end": 7796.0, "text": "Rush, Rush."}, {"id": 609, "start": 7796.0, "end": 7802.0, "text": "Der ist, der ist, glaub ich, schnell."}, {"id": 610, "start": 7802.0, "end": 7807.0, "text": "Ach so, okay, dann warten wir kurz."}, {"id": 611, "start": 7807.0, "end": 7815.0, "text": "Der da, ne?"}, {"id": 612, "start": 7815.0, "end": 7826.0, "text": "Also, das heißt, der restartet gleich mit mit oder restart die Runde neu mit mit Night-Time."}, {"id": 613, "start": 7826.0, "end": 7835.0, "text": "Ach komm, du bist ja sogar bei mir im Team. Nice, exellent."}, {"id": 614, "start": 7835.0, "end": 7844.0, "text": "Jetzt gibt's Richter. Ach so, ach so, da boot sich der Server neu. Okay, verstehe, verstehe."}, {"id": 615, "start": 7844.0, "end": 7846.0, "text": "Klar."}, {"id": 616, "start": 7846.0, "end": 7852.0, "text": "Ja, dann warten wir kurz, bis er wieder da ist."}, {"id": 617, "start": 7852.0, "end": 7859.0, "text": "Top, morgen mach ich ein Video zu NS Unleashed Night-Time Maps. Ich hab jetzt genug Gameplay."}, {"id": 618, "start": 7859.0, "end": 7862.0, "text": "Da ist er."}, {"id": 619, "start": 7862.0, "end": 7865.0, "text": "Ich hab jetzt genug Gameplay für..."}, {"id": 620, "start": 7865.0, "end": 7870.0, "text": "Noshark, Candles, Gone Dark, Gone Wrong, Gone Sexual kommt da in den Titel."}, {"id": 621, "start": 7870.0, "end": 7893.0, "text": "Dann wird geklickt."}, {"id": 622, "start": 7893.0, "end": 7897.0, "text": "Startet jetzt eh neu, ne?"}, {"id": 623, "start": 7897.0, "end": 7902.0, "text": "Ami, ich will zu Mr. Ami."}, {"id": 624, "start": 7902.0, "end": 7910.0, "text": "Kann man Teams wechseln?"}, {"id": 625, "start": 7910.0, "end": 7914.0, "text": "Mr. Ami, ich wechsle jetzt einfach zu dir rüber, Null W."}, {"id": 626, "start": 7914.0, "end": 7921.0, "text": "Oh nein, Team Switching ist disabled."}, {"id": 627, "start": 7921.0, "end": 7928.0, "text": "Jetzt haben wir die ganzen Poggers-Spieler gegen uns."}, {"id": 628, "start": 7928.0, "end": 7933.0, "text": "Oh, Defender. Captain Poggers ist da. Okay, easy win."}, {"id": 629, "start": 7933.0, "end": 7938.0, "text": "Easy win."}, {"id": 630, "start": 7938.0, "end": 7952.0, "text": "Sag mal, die Maps, ne? Die haben nix an den Maps geändert, oder? Die sahen schon immer so geil aus Night-Time."}, {"id": 631, "start": 7952.0, "end": 7966.0, "text": "Oh, mein Finger juckt. Jaja, A ist egal."}, {"id": 632, "start": 7966.0, "end": 7976.0, "text": "Oh, die sind schon drin. Oh, Leute, please. Was ist jetzt hier?"}, {"id": 633, "start": 7976.0, "end": 7981.0, "text": "Beste Name im Spiel, keckw0w."}, {"id": 634, "start": 7981.0, "end": 7987.0, "text": "Bester. Es ist ja auch true. Es ist ja auch true0w."}, {"id": 635, "start": 7987.0, "end": 7996.0, "text": "Das ist halt echt so. Das ist halt echt so."}, {"id": 636, "start": 7996.0, "end": 8005.0, "text": "Es ist Fakt0w größer keckw0w. Ist einfach so."}, {"id": 637, "start": 8005.0, "end": 8012.0, "text": "Ist einfach so."}, {"id": 638, "start": 8012.0, "end": 8029.0, "text": "Ist einfach die Wahrheit."}, {"id": 639, "start": 8029.0, "end": 8041.0, "text": "Wo ist denn der krasse LLW, Dude?"}, {"id": 640, "start": 8041.0, "end": 8052.0, "text": "Oh, da ist er. Da ist er. Der LLW, Dude."}, {"id": 641, "start": 8052.0, "end": 8074.0, "text": "Unlucky, unlucky. Immer alles unlucky."}, {"id": 642, "start": 8074.0, "end": 8085.0, "text": "Äh, was? Battlefield, Battlefield, was möchtest du mir sagen?"}, {"id": 643, "start": 8085.0, "end": 8095.0, "text": "Battlefield, was möchtest du mir sagen gerade?"}, {"id": 644, "start": 8095.0, "end": 8104.0, "text": "Any primers? Das ist das, was mich interessiert."}, {"id": 645, "start": 8104.0, "end": 8121.0, "text": "Die keckers jucken mich nicht so, aber die primers interessieren mich."}, {"id": 646, "start": 8121.0, "end": 8134.0, "text": "Oh nee, die sind schon rumgestellt."}, {"id": 647, "start": 8134.0, "end": 8139.0, "text": "Keine keckers. Geh mal weg hier. Achtung, Achtung, Achtung."}, {"id": 648, "start": 8139.0, "end": 8151.0, "text": "Big, big plane moves kommt jetzt."}, {"id": 649, "start": 8151.0, "end": 8158.0, "text": "Oh, wir haben uns gegenseitig gepackt. LLW keckwer hat mich gekillt."}, {"id": 650, "start": 8158.0, "end": 8175.0, "text": "Ich würde sagen, die Attacker sind ein bisschen besser."}, {"id": 651, "start": 8175.0, "end": 8180.0, "text": "Oh fuck, ich bin in die falsche Richtung. Ich dachte, hier sind die Attacker."}, {"id": 652, "start": 8180.0, "end": 8195.0, "text": "Und jetzt ist der LLW, Dude, wieder da. Jetzt, wo ich Engineer rausgeswitcht habe."}, {"id": 653, "start": 8195.0, "end": 8199.0, "text": "Was ist mit dem Wasser los? Es ist Nighttime. Es ist dunkel auf der Map."}, {"id": 654, "start": 8199.0, "end": 8216.0, "text": "Da rechnet die Battlefield Engine nicht mit. Deswegen sieht es so ein bisschen kacke aus."}, {"id": 655, "start": 8216.0, "end": 8231.0, "text": "Sag mal, ist aus irgendeinem Fall ein Grund, ist das Spotting aus?"}, {"id": 656, "start": 8231.0, "end": 8251.0, "text": "Oder ist das Spotting irgendwie anders?"}, {"id": 657, "start": 8251.0, "end": 8258.0, "text": "Das Spotting kommt mir übelst merkwürdig vor. Du guckst in die Gegnerrichtung, drückst Q und irgendwie wird nichts markiert."}, {"id": 658, "start": 8258.0, "end": 8269.0, "text": "Oder es ist Spotting drin, aber das ist irgendeine andere Sorte von Default Spotting."}, {"id": 659, "start": 8269.0, "end": 8287.0, "text": "Nicht 3D Spotting, sondern normales."}, {"id": 660, "start": 8287.0, "end": 8294.0, "text": "By the way, das ist absolut Spaß befreit gerade."}, {"id": 661, "start": 8294.0, "end": 8302.0, "text": "Metal, nix Metal hier. Müssen wir die nächste Runde mal ein bisschen anders machen."}, {"id": 662, "start": 8302.0, "end": 8309.0, "text": "So, ich probiere es noch mal als Engine."}, {"id": 663, "start": 8309.0, "end": 8324.0, "text": "Pass auf, hier kommt es gleich um die Ecke gestellt. Die warten schon da unten."}, {"id": 664, "start": 8324.0, "end": 8352.0, "text": "Naja, ich probiere gerade, wir müssen irgendwie den LRV kaputt machen. Sonst funktioniert das nicht."}, {"id": 665, "start": 8352.0, "end": 8357.0, "text": "Die treffen alle so gut im Vergleich zu irgendwelchen Random Dudes."}, {"id": 666, "start": 8357.0, "end": 8362.0, "text": "Oh, er ist down."}, {"id": 667, "start": 8362.0, "end": 8368.0, "text": "Lass mich doch mal reinspornen."}, {"id": 668, "start": 8368.0, "end": 8393.0, "text": "Was ist denn hier los? Du kannst auf die Gegner schießen und auf einmal wirst du von allen Seiten gebashed?"}, {"id": 669, "start": 8393.0, "end": 8406.0, "text": "Richtig cute Chat, cutest Chat."}, {"id": 670, "start": 8406.0, "end": 8418.0, "text": "Leute, da musst du drauf pushen, in your face."}, {"id": 671, "start": 8418.0, "end": 8441.0, "text": "Also das einzige was wir machen können ist B-Defenden, was anderes geht hier gerade nicht."}, {"id": 672, "start": 8441.0, "end": 8466.0, "text": "Was? MonkaS?"}, {"id": 673, "start": 8466.0, "end": 8473.0, "text": "Ja klar, aber ich meine immerhin, jetzt kommt der Rats Train, jetzt kommt der Rats Train."}, {"id": 674, "start": 8473.0, "end": 8478.0, "text": "Ich hätte Granate reinschmeißen müssen vorher, da hätten sie nicht hinterher raschen können."}, {"id": 675, "start": 8478.0, "end": 8502.0, "text": "Ah, der Captain Peng macht das jetzt."}, {"id": 676, "start": 8502.0, "end": 8507.0, "text": "Okay, mehr kann ich nicht killen gerade."}, {"id": 677, "start": 8507.0, "end": 8510.0, "text": "MonkaS, da leben ja immer noch welche."}, {"id": 678, "start": 8510.0, "end": 8521.0, "text": "Cobol ist richtig geil, habe ich gehört. Wo hast du das gehört?"}, {"id": 679, "start": 8521.0, "end": 8526.0, "text": "Aber Hauptsache ich bin erster, der Rest interessiert mich nicht."}, {"id": 680, "start": 8526.0, "end": 8538.0, "text": "Okay, mehr Kills als die OP Attacker, easy, easy."}, {"id": 681, "start": 8538.0, "end": 8543.0, "text": "Okay, easy loss, easy loss."}, {"id": 682, "start": 8543.0, "end": 8554.0, "text": "Ich meine, Battle Log hatte einen Vorteil. Man konnte, wenn man sagt, ah nee, ist nicht so meins, man konnte einfach ins Battle Log gehen."}, {"id": 683, "start": 8554.0, "end": 8559.0, "text": "Und sagen, easy Server suchen für nächste Runde. Das war cool."}, {"id": 684, "start": 8559.0, "end": 8579.0, "text": "Ich überlege mir gerade, warum man sich dafür entschieden hat einen In-Game Server Browser zu... wahrscheinlich weil man keinen Bock hatte Battle Log nachzubauen."}, {"id": 685, "start": 8579.0, "end": 8591.0, "text": "Gehe ich mal von aus. Battle Log API nachbauen, was man braucht, dass es funktioniert. Ich glaube, da hat keiner Bock drauf gehabt."}, {"id": 686, "start": 8591.0, "end": 8603.0, "text": "Zumal Battle Log bei Release, weiß ich noch, bei Release wurde richtig rumgeflamet. Battle Log, so eine Scheiße, das muss man bei einem Browser machen."}, {"id": 687, "start": 8603.0, "end": 8611.0, "text": "Dabei, also im Nachhinein betrachtet, ist Battle Log eigentlich ganz cool gewesen."}, {"id": 688, "start": 8611.0, "end": 8618.0, "text": "Ich würde ja jetzt LLV fahren, aber ich kann kein LLV fahren, weil ich kein Equipment ausgerüstet habe für LLV."}, {"id": 689, "start": 8618.0, "end": 8625.0, "text": "Und bis ich das ausgerüstet habe, geht die Runde schon los."}, {"id": 690, "start": 8625.0, "end": 8631.0, "text": "Man hätte eine Battle Log Erweiterung."}, {"id": 691, "start": 8631.0, "end": 8648.0, "text": "Ja, das hätte man machen können. Wobei man braucht auch Battle Log gar nicht mehr installiert, oder?"}, {"id": 692, "start": 8648.0, "end": 8651.0, "text": "Ok, jetzt haben wir ein Problem."}, {"id": 693, "start": 8651.0, "end": 8658.0, "text": "Richtiges Mindset, genau das richtige Mindset brauchen wir."}, {"id": 694, "start": 8658.0, "end": 8666.0, "text": "Oh, die pushen hoch. Ich habe da eine Granate getroffen, die pushen hoch."}, {"id": 695, "start": 8666.0, "end": 8682.0, "text": "Alter, aber man merkt die Tickrate. In einem normalen Battlefield wäre ich jetzt tot gewesen."}, {"id": 696, "start": 8682.0, "end": 8692.0, "text": "Und man merkt doch, dass die Gegner gut sind, weil die haben ganz gutes Timing. Auch was Peaks angeht, das haben die normalen random Dudes nicht."}, {"id": 697, "start": 8712.0, "end": 8722.0, "text": "Ja, A ist egal. A juckt nicht."}, {"id": 698, "start": 8722.0, "end": 8734.0, "text": "Ach, 3D-Spotting ist aus. Jetzt kapiere ich das auch. Ich wundere mich als, warum das so komisch ist."}, {"id": 699, "start": 8734.0, "end": 8742.0, "text": "Alter, wo stehen wir denn hier?"}, {"id": 700, "start": 8742.0, "end": 8752.0, "text": "Boah, der Dauman. Ich kriege hier Anfälle."}, {"id": 701, "start": 8752.0, "end": 8770.0, "text": "Aber Captain Paul, du hast eine gute Pose. Trepp dich. Aber ich muss dich gar nicht treppen."}, {"id": 702, "start": 8770.0, "end": 8786.0, "text": "Ich finde das Battlefield 3 ist echt schwierig ohne richtiges Spotting."}, {"id": 703, "start": 8786.0, "end": 8798.0, "text": "Jetzt bräuchte ich das Infrarot-Gunner. Wobei gibt es überhaupt einen Infrarot für einen Gunner?"}, {"id": 704, "start": 8798.0, "end": 8806.0, "text": "Weil ohne Spotting, du siehst nichts. Du hast keine Ahnung, wo du Gegner rumstellst."}, {"id": 705, "start": 8806.0, "end": 8818.0, "text": "Ich gehe mal kurz ans Seitenfenster."}, {"id": 706, "start": 8818.0, "end": 8828.0, "text": "Ich würde dich jetzt retten."}, {"id": 707, "start": 8828.0, "end": 8836.0, "text": "Das Problem ist in der Nacht, dass du gar nichts siehst. Du findest noch nicht mal Gegner."}, {"id": 708, "start": 8836.0, "end": 8850.0, "text": "Gerade weil es dunkel ist, hast du recht. Es ist nicht schlecht ohne 3D-Spotting."}, {"id": 709, "start": 8850.0, "end": 8874.0, "text": "Wir verwenden Infrarotgeschiss. Dafür ist es ja letztendlich da."}, {"id": 710, "start": 8874.0, "end": 8880.0, "text": "Eigentlich ist es ganz gut. Battlefield 3 ohne Spotting. Du hast mal Squad gespielt."}, {"id": 711, "start": 8880.0, "end": 8884.0, "text": "Das kann man nicht vergleichen. Das sind zwei unterschiedliche Spiele. Du hast mal Schach gespielt."}, {"id": 712, "start": 8884.0, "end": 8896.0, "text": "Das ist genau so ein geiler Vergleich. Wie kann man Schach ohne 3D-Spotting spielen?"}, {"id": 713, "start": 8896.0, "end": 8910.0, "text": "Wir müssen das balancen. Das macht keinen Spaß."}, {"id": 714, "start": 8910.0, "end": 8926.0, "text": "Die nächste Runde ist."}, {"id": 715, "start": 8926.0, "end": 8936.0, "text": "Gestern die Runde war cool. Die war übelst close auf Demavent Peak."}, {"id": 716, "start": 8936.0, "end": 8946.0, "text": "Ich habe nichts ausgerüstet für den LV. Ich überlasse das andere."}, {"id": 717, "start": 8946.0, "end": 8956.0, "text": "Was ist hier gerade los?"}, {"id": 718, "start": 8956.0, "end": 8968.0, "text": "Alles Hex. Weißt du wie das ist?"}, {"id": 719, "start": 8968.0, "end": 8990.0, "text": "Bewegt euch. Nicht stehen bleiben."}, {"id": 720, "start": 8990.0, "end": 9012.0, "text": "Wann kommt der Community-Server? Ich weiß es noch nicht."}, {"id": 721, "start": 9012.0, "end": 9036.0, "text": "Ich muss mich damit auseinandersetzen. Wie man das macht und ordentlich konfiguriert."}, {"id": 722, "start": 9036.0, "end": 9052.0, "text": "Ich muss hier gar nicht raus."}, {"id": 723, "start": 9052.0, "end": 9064.0, "text": "Ich spiele doch hier kein CS. Das ist Eckenpieken Deluxe."}, {"id": 724, "start": 9064.0, "end": 9092.0, "text": "Wir müssen das balancen. Das macht keinen Spaß."}, {"id": 725, "start": 9092.0, "end": 9114.0, "text": "Das ist nicht Hardcore. Man denkt es wäre Hardcore."}, {"id": 726, "start": 9114.0, "end": 9130.0, "text": "Nachtsackt nicht. Nachtsackt ist mega nice."}, {"id": 727, "start": 9130.0, "end": 9144.0, "text": "Ich werde mich hier hinstellen und warten bis die Runde vorbei ist."}, {"id": 728, "start": 9144.0, "end": 9160.0, "text": "Was gibt es hier?"}, {"id": 729, "start": 9160.0, "end": 9174.0, "text": "Ich weiß nicht mehr wie das ging. Was ist das für ein Kommando für in-game FPS?"}, {"id": 730, "start": 9174.0, "end": 9190.0, "text": "Render. Ich will mal gucken ob das matcht."}, {"id": 731, "start": 9190.0, "end": 9206.0, "text": "Die Info hatte ich vorher probiert."}, {"id": 732, "start": 9206.0, "end": 9222.0, "text": "Die Gun-Game-Runden waren anstrengend."}, {"id": 733, "start": 9222.0, "end": 9236.0, "text": "Der Mercedes-AMG."}, {"id": 734, "start": 9236.0, "end": 9252.0, "text": "Ich glaube das ist trotzdem die letzte Runde."}, {"id": 735, "start": 9252.0, "end": 9268.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 736, "start": 9268.0, "end": 9284.0, "text": "Ich glaube mehr als 200 FPS reichen wir in dem Fall."}, {"id": 737, "start": 9284.0, "end": 9298.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 738, "start": 9298.0, "end": 9314.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 739, "start": 9314.0, "end": 9328.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 740, "start": 9328.0, "end": 9344.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 741, "start": 9344.0, "end": 9358.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 742, "start": 9358.0, "end": 9374.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 743, "start": 9374.0, "end": 9388.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 744, "start": 9388.0, "end": 9404.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 745, "start": 9404.0, "end": 9430.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 746, "start": 9430.0, "end": 9452.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 747, "start": 9452.0, "end": 9472.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 748, "start": 9472.0, "end": 9496.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 749, "start": 9496.0, "end": 9516.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 750, "start": 9516.0, "end": 9532.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 751, "start": 9532.0, "end": 9554.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 752, "start": 9554.0, "end": 9574.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 753, "start": 9574.0, "end": 9594.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 754, "start": 9594.0, "end": 9618.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 755, "start": 9618.0, "end": 9638.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 756, "start": 9638.0, "end": 9652.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 757, "start": 9652.0, "end": 9668.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 758, "start": 9668.0, "end": 9682.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 759, "start": 9682.0, "end": 9698.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 760, "start": 9698.0, "end": 9712.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 761, "start": 9712.0, "end": 9728.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 762, "start": 9728.0, "end": 9750.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 763, "start": 9750.0, "end": 9766.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 764, "start": 9766.0, "end": 9794.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 765, "start": 9794.0, "end": 9814.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 766, "start": 9814.0, "end": 9834.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 767, "start": 9834.0, "end": 9858.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 768, "start": 9858.0, "end": 9878.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 769, "start": 9878.0, "end": 9902.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 770, "start": 9902.0, "end": 9922.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 771, "start": 9922.0, "end": 9942.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 772, "start": 9942.0, "end": 9962.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 773, "start": 9962.0, "end": 9982.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 774, "start": 9982.0, "end": 10002.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 775, "start": 10002.0, "end": 10022.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 776, "start": 10022.0, "end": 10042.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 777, "start": 10042.0, "end": 10062.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 778, "start": 10062.0, "end": 10082.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 779, "start": 10082.0, "end": 10102.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 780, "start": 10102.0, "end": 10122.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 781, "start": 10122.0, "end": 10142.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 782, "start": 10142.0, "end": 10170.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 783, "start": 10170.0, "end": 10190.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 784, "start": 10190.0, "end": 10210.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 785, "start": 10210.0, "end": 10230.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 786, "start": 10230.0, "end": 10258.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 787, "start": 10258.0, "end": 10278.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 788, "start": 10278.0, "end": 10298.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 789, "start": 10298.0, "end": 10318.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 790, "start": 10318.0, "end": 10338.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 791, "start": 10338.0, "end": 10358.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 792, "start": 10358.0, "end": 10378.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 793, "start": 10378.0, "end": 10398.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 794, "start": 10398.0, "end": 10418.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 795, "start": 10418.0, "end": 10438.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 796, "start": 10438.0, "end": 10458.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 797, "start": 10458.0, "end": 10478.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 798, "start": 10478.0, "end": 10498.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 799, "start": 10498.0, "end": 10518.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 800, "start": 10518.0, "end": 10538.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 801, "start": 10538.0, "end": 10558.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 802, "start": 10558.0, "end": 10578.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 803, "start": 10578.0, "end": 10598.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 804, "start": 10598.0, "end": 10618.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 805, "start": 10618.0, "end": 10638.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 806, "start": 10638.0, "end": 10658.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 807, "start": 10658.0, "end": 10678.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 808, "start": 10678.0, "end": 10698.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 809, "start": 10698.0, "end": 10718.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 810, "start": 10718.0, "end": 10738.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 811, "start": 10738.0, "end": 10758.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 812, "start": 10758.0, "end": 10778.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 813, "start": 10778.0, "end": 10786.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 814, "start": 10786.0, "end": 10806.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 815, "start": 10806.0, "end": 10826.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 816, "start": 10826.0, "end": 10846.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 817, "start": 10846.0, "end": 10862.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 818, "start": 10862.0, "end": 10882.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 819, "start": 10882.0, "end": 10902.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 820, "start": 10902.0, "end": 10930.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 821, "start": 10930.0, "end": 10950.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 822, "start": 10950.0, "end": 10970.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 823, "start": 10970.0, "end": 10990.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 824, "start": 10990.0, "end": 11010.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 825, "start": 11010.0, "end": 11030.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 826, "start": 11030.0, "end": 11050.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 827, "start": 11050.0, "end": 11070.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 828, "start": 11070.0, "end": 11090.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 829, "start": 11090.0, "end": 11110.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 830, "start": 11110.0, "end": 11130.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 831, "start": 11130.0, "end": 11150.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 832, "start": 11150.0, "end": 11170.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 833, "start": 11170.0, "end": 11190.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 834, "start": 11190.0, "end": 11210.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 835, "start": 11210.0, "end": 11230.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 836, "start": 11230.0, "end": 11250.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 837, "start": 11250.0, "end": 11270.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 838, "start": 11270.0, "end": 11290.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 839, "start": 11290.0, "end": 11310.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 840, "start": 11310.0, "end": 11330.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 841, "start": 11330.0, "end": 11350.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 842, "start": 11350.0, "end": 11370.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 843, "start": 11370.0, "end": 11390.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 844, "start": 11390.0, "end": 11410.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 845, "start": 11410.0, "end": 11430.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 846, "start": 11430.0, "end": 11450.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 847, "start": 11450.0, "end": 11470.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 848, "start": 11470.0, "end": 11490.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 849, "start": 11490.0, "end": 11510.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 850, "start": 11510.0, "end": 11530.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 851, "start": 11530.0, "end": 11550.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 852, "start": 11550.0, "end": 11570.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 853, "start": 11570.0, "end": 11590.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 854, "start": 11590.0, "end": 11610.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 855, "start": 11610.0, "end": 11630.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 856, "start": 11630.0, "end": 11650.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 857, "start": 11650.0, "end": 11670.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 858, "start": 11670.0, "end": 11690.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 859, "start": 11690.0, "end": 11710.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 860, "start": 11710.0, "end": 11730.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 861, "start": 11730.0, "end": 11750.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 862, "start": 11750.0, "end": 11770.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 863, "start": 11770.0, "end": 11790.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 864, "start": 11790.0, "end": 11810.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 865, "start": 11810.0, "end": 11830.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 866, "start": 11830.0, "end": 11850.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 867, "start": 11850.0, "end": 11870.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 868, "start": 11870.0, "end": 11890.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 869, "start": 11890.0, "end": 11910.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 870, "start": 11910.0, "end": 11930.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 871, "start": 11930.0, "end": 11950.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 872, "start": 11950.0, "end": 11970.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 873, "start": 11970.0, "end": 11990.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 874, "start": 11990.0, "end": 12010.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 875, "start": 12020.0, "end": 12040.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 876, "start": 12040.0, "end": 12060.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 877, "start": 12060.0, "end": 12080.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 878, "start": 12080.0, "end": 12100.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 879, "start": 12100.0, "end": 12120.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 880, "start": 12120.0, "end": 12140.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 881, "start": 12140.0, "end": 12160.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 882, "start": 12160.0, "end": 12180.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 883, "start": 12180.0, "end": 12200.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 884, "start": 12200.0, "end": 12220.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 885, "start": 12220.0, "end": 12240.0, "text": "Ich glaube das war die letzte Runde."}, {"id": 886, "start": 12240.0, "end": 12252.0, "text": "Ich glaube das war die letzte Runde."}]}