{"text": "Poggers am Start. Kann man das alles starten? So, exquisite. Alles klar. Gut. Ja, funktioniert alles. Perfekt. Also, heute, heute machen wir mal so eine Mischung aus, äh, wir basteln was und wir machen Linux mäßig was. Wird ja mal wieder Zeit. Bisschen Informatik, kurz. Stream. Erstmal warten wir, bis Twitch kapiert hat, dass der Stream on ist. Gebaidet aktuell. Ich sehe in der Vorschau noch nichts. Ah, jetzt, jetzt. Okay, jetzt ist alles da. Nice. You got gebaided. Übrigens, Chet, ihr werdet gar nicht gebaided. Ich habe euch gebaided, indem ihr dachtet, ihr werdet gebaided, aber ihr wurdet gar nicht gebaided. Konnte man mir folgen so weit, ja. Weil es ist genau das, was im Titel steht. Kommt jetzt dran. Zwar, ich habe wieder meine Poggers-Cam an. Wackelt das? Wackelt das? Äh, da wackelt nichts, oder? Hallo, Chet? Finger-Reveal. Und noch andere Finger-Reveal. Ja, die Katz, die Katz hat wieder zugeschlagen, guck mal. Die Katz, die Katz wollte es wieder wissen, äh. Ja, wortwörtlich. Ja, zugeschlagen, ja. Mach schon mal die Linux-VM an. Also folgendes, Leute. Ist die Kamera falsch rum? Nee, passt. Die Kamera ist so rum, wie sie immer ist, ne. Unten ist oben hier, das haben wir schon immer so. Wenn man es rumdreht, ist es glaube ich noch verwirrender. Ich setze euch im Prinzip gegenüber, wenn man so will, ja. Also ihr sitzt, ihr sitzt da quasi, wo die Kamera ist. In euch wäre geiler, ich weiß nicht, ob das so geil wäre. Sicherlich Geschmacksfrage. So, Poggers. Poggers-VM an. So, also. Ja, das machen wir alles mal zu. Ich glaube, Weihnachten ist jetzt vorbei. Ich habe übrigens nix eingebaut zum Refreshen von diesem Hintergrundbild. Ich muss neu starten, dass sich das Hintergrundbild. Refresht. Natürlich auch super ist. Seit wann ist eigentlich dieses Nvidia-Ding so scharf drauf, auch in einer VM ein Overlay anzuzeigen? Das wollte es sonst nie. Und ich kann es ja nicht mal abschalten, doch. Alter. Please Nvidia, lass mich doch einfach das Overlay ausschalten. Overlay off, off, okay. Jetzt, gut. Jawoll. So, Firefox starten. Firefox starten. Ja. Vermitteln starten. Ja. Alles klar. Exzellent. Okay. Also, ich habe mir folgendes Gehäuse gekauft, Schatt. Ich zeige es euch mal kurz. Also, man sieht hier schon das ganze, ganze Bass-Los-Grams. Aber wir müssen vorher noch was anderes machen. Und zwar doch ein bisschen wackelt der... Oh, ich habe den Tisch nicht richtig. Oh Mist. Ich sehe es gerade. Der Tisch steht nicht fest. Ah. Mr. Wacklors. Das ist aber schlecht. Weil wenn ich... Dann darf ich nicht am Tisch wackeln. Auch gut. Ähm. Weil ihr seht, der Tisch an sich ist echt massiv. Das ist so ein Tisch. Den kann man... Also man sieht es natürlich, ich habe da die blaue Unterlage heute nicht drauf, ne. Aber das ist so was, wo du normalerweise in der Küche kannst du Fleisch drauf mit einem Beil zerteilen und sowas. Bam. Also, das ist wirklich massiv das Teil. Das hatte ich doch hinten im Garten stehen. Das Problem ist nur, ich habe es jetzt auf der einen Seite auf dem Teppich und auf der anderen Seite nicht auf dem Teppich. Das heißt, gerade wenn ich jetzt hier hinten drauf drücke, dann wackelt es ein bisschen. Schlecht. Da darf ich halt einfach nicht am Tisch wackeln. Excellent. Äh. Danke für die Subs. 15 Monate haben wir hier. Den haben wir da am Start. Ich mache mal kurz den Chat auf. Leute, ich bin verwirrt. Wo läuft denn gerade die Musik? Wo läuft denn gerade die Musik? Es ist kein Browser mit Musik offen. Ihr hört die Musik aber auch, oder? Und OBS läuft auch nicht? Hä? Ah, OBS ist hier. OBS hat es minimiert, okay. Aber wo ist die, wo ist der Browser mit der Musik? Habe ich den aus Versehen verschoben hinter die, ach hier, hinter der VM. 0W, Alter, da soll erstmal einer drauf kommen. Okay, jetzt, jetzt habe ich es kapiert. Alles klar. Gut. Genau, jetzt kann ich mal den Chat aufmachen. Ja, danke schön für die Subs, Leute. Also, den haben wir hier am Start. Clocks HD, 15 Monate, das ist ja schon. Wo haben wir das? Hyper Subscription. Oh, die Musik ist übrigens viel zu laut, ne? Die Musik ist viel zu laut. Der Halo Soundtrack, der will es gerade wissen. Okay, gut. So, dann haben wir den Clocks HD, 15 Monate, danke schön für den Sub. Und der Kommentator, auch 13 Monate, auch schon Hyper Subscription. Massive IQ Subscriptions, ich sehe es schon hier. Wahnsinn. Tja, was wir heute machen ist folgendes. Gehe mal kurz auf die Kamera. Also, ich habe mir den Raspberry Pi Gehäuse gekauft, ein 4er Raspberry Pi Gehäuse. Noch eins. Und zwar das da. Das ist nicht eins von den Bekannten. Die Bekannte ist ja einmal dieses FLIR Gehäuse und das Argon Case. So, ich halte es mal so hoch, dass man es ein bisschen besser sieht. Das ist ein IC-Box-Dings-Enclosure, das ist aber relativ günstig. Das kostet plus, glaube ich, 20 Euro. Und es kühlt angeblich den ganzen Raspberry Pi 4, weil ich habe nämlich ein Problem. Ja, Hände liegt, ich weiß. Ich habe nämlich ein Problem. Ich habe hier für meinen UniFi Controller, also ich habe ja zwei, ich habe ja zwei und wahrscheinlich bald drei UniFi Access Points und dazu habe ich den Controller für die Steuerung von dieser ganzen Geschichte laufen auf dem Raspberry Pi. Dann haben wir letztens im Stream ein bisschen programmiert für die Kameraüberwachung und das ist jetzt mittlerweile so weit, dass man es benutzen kann. Leute, der Halo Soundtrack ist mir ein bisschen zu anstrengend gerade. Da kann ich das besser. Exzellent. Haha, Eis-Eier-Eier. Das ist das Beste an Better Twitch TV. Twitch baut so ein Kram nicht ein. Guck mal sogar mein Chat unterstützt. Leute, welches E-Mode war letztens klein im Chat? Pains-Champ, Paws-Champ? Der Paws-Champ war klein. Lasst mal ausprobieren, Leute. Ist der Paws-Champ immer noch klein? Paws-Champ? Der Paws-Champ ist immer noch broken. Guck mal, der Paws-Champ ist kaputt. Seht ihr das? Der Paws-Champ klitscht, Alter. Ah, yes. Ja, Mario Galaxy Musik Beste. Ja, komisch, dass das klitscht. Naja, kann man nix machen. Also, lasst mal überlegen, wo bin ich jetzt stehen geblieben. Genau. Also, ich habe ein Problem. Ich habe hier unten im Wohnzimmer, habe ich den Raspberry Pi 3 stehen. Der macht Unify. Ich kann euch jetzt kein Bild von meinem Access, von meiner Oberfläche zeigen, da leak ich wahrscheinlich zu viel. Webfronten, hoffentlich kann... Oh, geil. Google Auto-Vervollstigung. Ja, das sieht dann so in der Richtung aus. Da kann man seine Access-Points mit verwalten. So, das ist das eine, was der Raspberry Pi macht. Und der macht auch gleichzeitig Frontend für meine Überwachungskameras. So, und... Und er hat noch einen Reverse-Proxy. Er hat noch für Zertifikate einen Proxy davor, aber man weiß ja noch, ob wir das heute machen. Die Sache ist nur die. Ich habe jetzt meine Kamera-Überwachungs-Software aufgebohrt und die macht ja jetzt nicht nur Anzeigen von den ganzen Kameras im Haus, sondern die macht ja jetzt mittlerweile auch Bewegungserkennung, Aufnahme und bis zu 11 Sekunden Buffer-Rückwärts-Aufnahme. Und ich habe jetzt das Problem, dass mir das Ganze ab und zu mal abkackt, so alle 2-3 Tage, weil der Speicher leer ist. Also, mir kackt dort nicht wirklich ab mit Out-of-Memory. Ist ein bisschen doof. Das Unify-Zeug braucht halt massig RAM. Das brauche ich mit 500 MB oder so. Und der Raspberry Pi 3 hat halt nur 1G. Ist ein bisschen doof. So, und deswegen habe ich mir gedacht, warum nehme ich nicht einfach meinen Raspberry Pi 4, den ich hier schon die ganze Zeit rumliegen habe. Ich habe mal alles, was wir heute so brauchen, in die Box gepackt. Excellent Box. Nicht zu wechseln mit Icy Box. Mach mal kurz den Keks ein bisschen weg, dass man den noch sieht. Sieht man den noch? Excellent. So ist das nice. Also, guck mal, hier ist die Box. Ich mach das mal hier weg. Ich hoffe, dass man alles sieht. Ich muss mal kurz gucken, von wo bis wo man sieht. Ich habe halt meine Unterlage ja nicht da. Von wo bis wo sieht man was? Hand ab hier. Okay, das passt. Ich kann so die Hand drauflegen, als wenn ich hier hinhalte. Passt eigentlich ganz gut. Genau. Welche Version des Unify-Controllers fährst du? Das ist eine gute Frage. Wenn der 6er in letzter Zeit rausgekommen ist, dann habe ich den noch nicht. Dann habe ich noch den 5er. Vielleicht installieren wir jetzt aber den 6er. Da kann ich nämlich bei der Gelegenheit gleich ausprobieren, ob der Import klappt vom Alten. Weil dann habe ich ja noch beide laufen. Das ist eigentlich eine gute Gelegenheit, das jetzt mal zu machen. Oder was sagt ihr? Taugt der 6er mittlerweile schon? Ich weiß es nicht. Ich habe es mir noch nicht angeguckt. Zumindest habe ich alles in die Box reingemacht, was wir heute brauchen. Einmal brauchen wir den Raspberry Pi 4. Den habe ich ja schon eine Weile am Start. Den haben wir im Stream auch schon relativ oft mal verwendet. Das ist ein Netzteil. Ich glaube das ist sogar das offizielle Netzteil, was man dabei kriegt. Könnte das sein? Ist das das offizielle Pi-Netzteil? Es steht da meistens drauf. Ist es nicht. Ist egal. Ist alles made in China und ist halt so ein ganz normales 5V, 3A Netzteil, falls man das überhaupt erkennt hier. Kamera please. Hau mal den Finger. Guck doch das mal an. Und Kartoss. Und das ist dabei. Das ist auch empfehlenswert für den Raspberry Pi 4, weil der ist ein bisschen wärmer und ein bisschen stromhungriger als die Teile davor. Deswegen habe ich hier oben auch mal so ein Messgerät dran, wo man dann gucken kann, was das Ding so verbraucht. Habe ich mir noch nie angeguckt. Keine Ahnung. Der alte braucht ja kaum was. Wie gesagt, was hältst du von UDM Pro? Ist das die Treemachine? Habe ich mir noch nicht angeguckt. Ich weiß, ich weiß nur, weil ich ein paar Videos zugesehen habe. Das ist Unified Treemachine. Kein Schimmer. Ups. O.K.S. Durcheinander mit den ganzen Desktops. Habe ich noch nicht näher angeguckt. Ja, ich glaube nicht, dass ich da großartige Verwendung für... Ach, dieses Ding. Der Eimer war das. Genau. War das früher nicht in Switchbau? Nee, der Eimer ist das. Genau. Also da sehe ich jetzt aktuell nicht so die Wahnsinnsverwendung für. Hat das wenigstens PoE? Kennt sich jemand mit Regex aus? Pause du mal. Pause du mal den Regex. Fangen wir uns jetzt an zusammen. Hat das PoE? Ohne PoE ist natürlich ein bisschen doof, ne? Also ich meine, PoE... Guck mal die PoE an. Was für PSU hast du genau, das was bei diesem Raspberry Pi Set drin war? Guck mal PoE an. PoE? Ey mein, Verwendungszweck dafür habe ich nicht wirklich, ne? Guck mir das jetzt nur an, weil der Chat mich gefragt hat. Ah, das Ding meinte ich. Das habe ich schon mal in einem Video gesehen, ja. Ja, das ist die Rackbauform. Hat die PoE? Ach, was... Juck mich nicht, lass es auf dem Raspberry Pi 4 laufen. Oh, der Regex. Der Regex ist Big Brain Neko Rock. Also das müssen wir uns jetzt mal kurz zusammen angucken. Der Neko Rock fragt, was ist das für ein Regex? Und jetzt mache ich mal Big... Fege? Ich habe das richtig ausgesprochen. Ähm... Ihh! Ah! Hilfe! Es ist auch Kobold. Ah, weg, weg, weg. Und diese kacke Schriftart, Alter. Moment, Moment, Moment. Bevor wir weitermachen. Font. Ah, yes. Okay, okay, okay. Es kommt schon ein bisschen besser. Ich muss Kobold wegmachen. Kobold, gehst sofort. Okay, also diesen Regex. Kann man Highlighting machen für Regex? Gibt es Regex Highlighter? Oh. Da kann ich nämlich erklären, was der Regex macht. Glaube zumindest zu verstehen, was er macht. Irgendwie so. First Code Regex Highlighter. Regex 101, genau. Also, bye. Excellent. Also ich kanns mal versuchen zu erklären, was der Regex macht. Ach so, Netzteil in deinem Main PC. Netzteil in meinem Main PC ist, ich glaube, irgendein Be Quiet oder ein Sea Sonic. Ich glaube ein Be Quiet. Irgendein 600 Watt Be Quiet Ding. Keine Ahnung. Hilt FPS. Dankeschön für den Sub. Exquisite Subscription. Also, ich vermute mal, dass dieser Regex folgendes macht. Start. So, dann ist wichtig diese Gruppe. Das ist eine Back Tracks und das ist eine Matching Crew. Also, ist das Back Track? Da bin ich mir jetzt nicht ganz sicher, ob das Rückwärtssuche ist. Das kommt auf die Regex Implementierung an. Oder ist es startet nicht? Da bin ich mir jetzt nicht ganz sicher. Gucken wir mal. Das ist auf jeden Fall ein bisschen advanced. Also, ist ein Negative Look Ahead, was jetzt irgendwie schon bescheuert klingt. Der guckt, ob das da vorkommt. Genau. Also, Big Brain Regex. Das sind Hoffmann 128. Ich bin auch lost. Ok. Also. Ok. Ok. Verstehe. Verstehe. Also, das Ding stellt sicher, dass es nicht matcht. Also sprich, dass es nicht matcht. Dass es nicht any Characters matcht. Except Line Terminators. Also, ok, das leuchtet mir jetzt auch nicht so. Ich meine, das erkenne ich. Das ist eine Back Reference. Das bedeutet, dass was hier gematched wird, dieses Zeichen, was hier gematched wird, das setzt er da wieder ein. Das ist echt Massive Big Brain Regex, das Ding. Nielsen FPS 5 Monate. Dankeschön. Da bräuchte mir jetzt mal irgendeinen Input Text, um das so ein bisschen. Also, der guckt wahrscheinlich, ob es New Line ist. Das ist non-creedy match. Das ist glaube ich ein bisschen umständlich gemacht. Das könnte man wahrscheinlich einfacher machen. Also, der guckt, ob es nicht non-creedy auf alles matcht. What the fuck. Ähm, außer Line Terminators. Also, könnte das hier eigentlich die Umschreibung sein von, man guckt, ob es ein New Line ist. Der matcht das erste Zeichen nach einem New Line oder irgendwie sowas. Und dann beliebe ich viele non-creedy bis zu dem Zeichen, was er als erstes nach dem New Line gematched hat. Könnte das sowas in der Richtung sein. Das soll New Line matchen. Und das ist das erste Zeichen nach dem New Line. Gefolgt von beliebig vielen Zeichen, maximal bis zu dem, was er als erstes gematched hat, nochmal. Also sprich, es kommt ein New Line, dann kommt irgendein Zeichen und dann guckt er von diesem Zeichen so viel, bis das Zeichen nochmal kommt. Äh, das ist übrigens Fail. So macht man das nicht, by the way. Das hier ist eine Gruppe aus Zeichen. Das ist nicht etwa das String Festo eher. Der guckt, ob F oder E oder S und da ist eigentlich ein und und oder dazwischen. Also sprich, das da würde sowohl matchen auf Festo eher als auch auf A, S, O, F oder sogar auf F, F, F, F würde es matchen. Also das macht man übrigens so nicht. Falls, falls das die Intention dahinter ist, bin ich mir jetzt nicht sicher. Und das dann beliebe ich oft hintereinander bis zum Zeilenende. So würde ich diesen Rage jetzt mal interpretieren. Ob das jetzt stimmt, sei mal dahingestellt. Das würde sogar auf A ja ja matchen, ne. Das würde aber auf ja alles matchen, was man sich irgendwie zusammensetzen kann auf diesen Zeichen. So, so viel zum Thema Rage im Text. Nils, ich hoffe, das hat dir geholfen. Mehr kann ich dir jetzt grad nicht dazu sagen. Also, weiter im Text. Wo sind wir denn stehen geblieben? Kommen wir mal zum eigentlichen Thema. Genau, ich will meinen Unify Controller austauschen, Raspberry Pi zu Raspberry Pi 4, weil da nicht nur mein Unify Controller drauf laufen soll, sondern auch mein Kameratool und ein Proxy mit Zertifikaten drauf. Ach ne, der Nils hat es gar nicht gefragt, der Niko hat es gefragt. Jetzt hab ich es verwechselt. Ja, also, das ist auch ein kack Ragex. Aber ich glaube, der Ragex ist falsch. Wie gesagt, ich glaube, der Ragex ist falsch. Ich glaube nicht, dass man wirklich eine Zeichengruppe haben will, sondern ich glaube, man möchte wirklich exakt den String matchen, was dann im Prinzip das da wäre. Eventuell willst du noch Case Insensitive davor machen. Allerdings musstest du das dann in Klammern setzen, damit das Sternchen wieder funktioniert. Ja. Schau den Link oben an. Ach, das ist nicht eine Challenge. Kreuzwort Rätsel Challenge, all okay. What the fuck? Ach, das ist das ist Ragex Kreuzwort Rätsel. Das habe ich auch mal früher ab und zu gemacht. Das ist wirklich Big Brain. Das ist wirklich Massive Brain. Brauchst du dafür, dass das funktioniert? Ich dachte, das wäre ein Ragex irgendwie aus einem Programm von dir. Ne, ne, dann ist klar, dann ist klar, dass das soll wirklich so sein. Das soll wirklich so sein. Das ist in dem Fall sogar richtig. Das ist ein R oder ein A oder ein Z, allerdings beliebigt oft hintereinander. Ne, das mache ich jetzt nicht. Ich mache jetzt keine Ragex Kreuzwort Rätsel, Leute. Das halte ich brainmäßig im Stream nicht aus. Wir kommen jetzt aber Dankeschön für die Hypersubscriptions ab, Neko Rock. So, also kommen wir zum eigentlichen Thema zurück. Wie gesagt, ich will mein Raspberry Pi austauschen durch den Raspberry Pi 4, weil mir der RAM ausgeht mit Unify, Proxy und einem Kameratool, was jetzt auch Bewegungserkennung macht. Und deswegen müssen wir das mal ausprobieren, weil ich habe zwar hier auf dem Raspberry Pi 4, ich drehe mich mal kurz um, ich habe hier jetzt zwar schon diese komischen Passivkühler da drauf. Ihr seht es ja da, diese kleinen Kühler. Und der wird aber trotzdem ziemlich warm. Deswegen habe ich mir jetzt so ein Gehäuse gekauft. Das hier. Und das Gehäuse ist, wie gesagt, ich habe mir das gekauft, weil es das eigentliche, hast du noch Delay im Stream drin? Ne, habe ich nicht. Kein Delay im Stream. Kein Delay. Kein Delay. So, und da habe ich mir dieses Gehäuse hier gekauft. Das einzige, was gerade lieferbar war. Wie gesagt, das ist nicht das allerbeliebteste Gehäuse. Ich mache mal kurz ein bisschen Platz hier. Das ist nicht das allerbeliebteste Raspberry Pi Gehäuse, aber es war lieferbar und es kühlt wohl, also es führt wohl die Wärme über das Gehäuse ab. Also sprich, das ist ähnlich wie zum Beispiel dieses Flir Case. Nur mit dem Unterschied, dass es ein bisschen billiger ist oder ungefähr genauso viel kostet. Ein Moment. Billiger ist und lieferbar ist. Die anderen Sachen sind alle ganze Ecke teurer oder mit Lüfter. So. Und deswegen will ich das Ganze jetzt mal ausprobieren. Aber bevor wir das mit dem Gehäuse machen, müssen wir natürlich erstmal ausprobieren, wie warm wird denn das Ding eigentlich unter Last? Das probieren wir jetzt mal schnell aus. Ich glaube, wir haben das schon mal ausprobiert im Stream und das wurde quasi bis ans Runtertakten warm. Also sprich, das wurde so warm, dass der Raspberry Pi die Leistung gar nicht komplett ausfahren konnte. Also das wird wirklich warm. Das heißt, das ist das erste, was wir machen. Bevor wir das ins Gehäuse machen, gucken wir mal, wie warm das Ding wirklich wird. Dazu schließe ich es jetzt einfach hier neben. Dazu müssen wir jetzt die SD-Karte mal flashen. Ich zeige euch noch mal die anderen Sachen, die ich in der Kiste drin habe, weil ich habe ja gesagt, der soll auch Aufnahmen von den Kameras machen und so. Also ich habe noch eine Sandisk-SSD mit 240G. Das reicht. Ich nehme ja nur auf, wenn Motion Detection ist. Besser als eine komische Magnetfestplatte da dran zu hängen. Und ich habe noch einen USB auf SATA. Da können wir das dann anschließen. So und jetzt das Beste, das sind übrigens die restlichen Kleinteile fürs Gehäuse. Und das Beste, was wir unbedingt brauchen ist die gute Samsung Pro Endurance Mikro-SD-Karte. Beste. Die allerbeste. Und ich kann euch nur empfehlen, wenn euch schon mal ein Raspberry Pi verrecktes oder eine SD-Karte verrecktes oder so, kauft euch die Dinger. Die sind nicht wahnsinnig teuer. Die sind teuer als normale SD-Karten. Aber die halten wirklich gut. Das heißt das erste, was wir jetzt machen ist ein aktuelles Raspbian runterladen, was hier übrigens nicht mehr Raspbian heißt, sondern Raspberry Pi OS oder so. Vielleicht nehmen wir auch gleich das 64-bit, wenn es das mittlerweile in default gibt. NilsFPS fragt, ich wollte mir einen ESP32 NodeMCU kaufen, um den mit WLED zu verwenden. Muss ich da auf Aliexpress aufpassen, welchen ESP oder kann ich einfach den billigsten nehmen? Du kannst den der regelnden billigsten nehmen, musst aber mal gucken, ob du da jetzt wirklich Aliexpress und warten willst oder ob es dich auch bei Amazon tut, weil der Kram ist ja auch in Deutschland nicht teuer. Eigentlich nur für den Zapp 08MAX07. Wenn du NodeMCU nimmst, dann kriegst der eh immer mehr oder weniger das gleiche, auch wenn es da ein paar Nachbauten davon gibt. Du könntest dir auch überlegen, ob du lieber einen ESP32 nimmst, das ist zwar der Unterschied ein bisschen teurer und für WLED nicht unbedingt notwendig, eigentlich gesagt vollkommen egal, aber wenn du einfach was anderes machen willst, ich baste lieber mit dem ESP32 als mit dem ESP266. Aber du kannst dir auch bei Amazon welche kaufen, der Kram ist ja jetzt so ultra teuer, das gibt es sicherlich noch günstiger auch hier bei Amazon. Gut, das ist kein NodeMCU, das ist ein D1 Mini, den finde ich eigentlich gesagt noch sogar praktischer für WLED. Auf Aliexpress ist es ein bisschen billiger, das stimmt schon, muss man überlegen. Also wie gesagt, NodeMCU kannst du wenig verkehrt machen. Ich finde die hier auch nicht schlecht, weil die kleiner sind. Kann man mehrere WLED Instanzen sünken? Ja, kann man. Du kannst quasi dein ganzes Haus miteinander sünken, wenn du WLED verwendest. Nice, sehr gut. Home Assistant Beste. Habe ich mittlerweile auch mal ganzen Kram drinne. So also, wo gibt es den Download? Download vor Ubuntu? Was möchten die... Sag mal, warum machen die eigentlich ihre Download-Seite immer anders? Können wir nicht einfach mal ganz normal den Download giffen? So, Raspberry Pi OS Lite wollen wir haben. Inkline. Kann man eigentlich, weiß das jemand von euch, ist eigentlich 64-Bit mittlerweile Default beim Raspberry Pi 4 oder nicht? Also sprich, ist das jetzt ein 64-Bit, was ich da kriege? Ist das jetzt ein 64-Bit? Ich habe schon eine Weile nichts mehr heruntergeladen. Beta. Ehrlich gesagt ist mir das vollkommen egal. Doch, doch, der Pi 4 läuft ohne Probleme mit 32-Bit. Zur Release gab es ja sogar nur 32-Bit. Das dennoch, wenn du kannst es mit Hue machen, du bist aber halt, das ist halt der Unterschied, du kannst es immer mit fertigen Lösungen machen, aber du bist halt auf Githai und Verderben dem Hersteller ausgeliefert. Wenn du da keine Probleme mit hast und zufrieden bist, was der Hersteller liefert, kannst du das machen. Keine Ahnung wie ich da sonst danach suchen soll, Images. Ist das jetzt offiziell? Arm 64 ist das letzte vom 28.05.? Ah, Raspberry Lite Arm 64. 28.08.? Hä? Ich bin verwirrt. Ich will einfach, ich will einfach. Ist das jetzt schon raus oder nicht? Okay, was sagt man Wikipedia? 32-Bit. Okay. 64. Okay, 64-Bit ist Beta. Das nehmen wir nicht, dann nehmen wir das normale, alles gut. Gut, dann flashen wir das Ganze jetzt mal schnell. Mal kurz, hab ich jetzt eigentlich, hab ich es eigentlich dome geloadet jetzt? Buster, da ist es. Exzellent. Ich mach mal einen SD-Karten-Reader ran und dann flashen wir das Ganze mal. Hat den SD-Karten-Reader jetzt erkannt? Transient, jawoll. Edge Shore. Flashchamp machen wir jetzt. Genau, so sieht es aus. Flashchamp. Flash vom File. Downloads. Wo haben wir es denn hier? Ah, da haben wir schon, wir haben es schon öfters mal runtergeladen. Select Target. 64G, jawoll, passt. Select. Bam. Guck mal kurz, Chat, während das so vor sich hinflasht, da ich nichts übersehen hab. Aber Philips Hue hat sich nicht beliebt gemacht, um vielleicht das Thema nochmal aufzugreifen. Ich hab letztens ein Video geguckt, dass die beispielsweise alte Bridges, ich will nicht sagen kaputt geflasht haben, aber teilweise useless gefirmware updatet haben und sowas. Ich kann es aus erster Hand nicht berichten, ich hab keine. Ich verlasse mich da mal rein auf YouTube-Videos, die ich geguckt hab. Aber das ist ja mittlerweile gängige Praxis. Guckt euch mal Apple und alte iPhones an, die immer langsamer werden. ABAP Stream. Ist ABAP nicht das Cobalt von SAP? Dazu kann ich nur sagen, das muss echt nicht sein. Äh, wäre es eigentlich möglich eine SSD an einen Raspberry Pi mit einem Adapter anzuschließen, um das OS auf die SSD zu machen? Ja, kein Problem, geht mittlerweile. Haben wir sogar im Stream schon gemacht, kein Problem, funktioniert. Es war eine Zeit lang Beta für den Raspberry Pi 4, mit dem Raspberry Pi 3 geht es schon lange. Für den Raspberry Pi 4 war das eine Zeit lang Beta, aber mittlerweile ist es live, also man kann von SSD booten. Aber ich will nicht von SSD booten, ich will ja mehr oder weniger einfach mein altes Raspberry Pi 3, da Zeug da umziehen. Ich mach auf die SSD komplett Videos, vielleicht Logs noch drauf, aber komplett die Videoaufnahmen. Also nicht für Gameplay oder so, sondern halt die Kamera Videoaufnahmen. So. Willst du wirklich eine SSD opfern, ja? Ich hab genug SSDs. Machst du mal ein Stream, wo du ein Spiel programmierst? Ich hab von Spieleprogrammierung keinen Plan. Felix Spitzer, keine Ahnung, was mit AliExpress ist, aber so wie ich die Chinesen kenne, scheißen die auf alles und liefern weiter aus. Aber keine Ahnung, hab ich gar nicht mitgekriegt. Max wie lernt man am besten programmieren? Okay, dazu, letztens hatte einer eine richtig gute Idee. Letztens hatte einer, ich glaub der Patrick sogar, eine richtig gute Idee gehabt im Discord, und zwar wir könnten mal eine Seite basteln im Stream für Programmiereinsteiger, wo man auswählen kann, auf welchem Betriebssystem ist man, was will man machen, welche Vorkenntnisse hat man, und da schlägt es einem vor, welche Programmiersprache ich empfehlen würde, beziehungsweise mit was ich einsteigen würde. Das sollten wir echt mal machen, das glaube ich eine gute Sache, ich bin mir gar nicht sicher, ob es sowas überhaupt schon gibt. Also, am besten ist, du überlegst dir, was du machen willst. Und wenn du weißt, was du machen willst, in welche Richtung du was machen willst, dann kannst du dir auch was überlegen, wie du anfängst. Wenn du wirklich gar keine Ahnung hast, also wenn du weder weißt, ob du was Raspberry-Pi-Controller-mäßiges machen willst, ob du Desktop-Anwendungen machen willst, ob du Web-Anwendungen machen willst, also wenn du gar nichts weißt, wenn du einfach nur ein bisschen basteln willst, ein bisschen rantasten willst, dann finde ich ist das beste, was man heutzutage machen kann, JavaScript, HTML, CSS, weil dann sieht man direkt, was passiert. Und die Basics lernt man auch mit JavaScript, man kann sich über JavaScript viel streiten, wenn der Tag lang ist, aber da sieht man wenigstens, was passiert. Ja, es gibt jede Menge anderen Programmiersprachen, die auch toll zum Einstieg sind, aber was hast du denn von so einem peinsten Kommando-Zeilen-Tool? Das ist so unimpressive irgendwie. Das heißt, die meisten Leute glaube ich fahren am besten damit, wenn sie einfach mit JavaScript und CSS und HTML anfangen, weil dann siehst du direkt, was. Ja, das ist eh der Witz, ja, also ganz im Ernst, letztens wo Amazon ausgefallen ist und die Leute teilweise nicht mal ihren Staubsauger mehr anschalten konnte, das war halt echt... Da denke ich mir auch immer, Pech, wenn man sich so abhängig von Cloud-Geschichten macht. Luke Vorringer, Twitch Prime, danke für den Sub. Exquisite Subscription, Massive IQ Increase für den Chat wieder. Du brauchst Cobalt für die Berufsschule, was ist denn das für eine Oldschool Berufsschule, die Cobalt macht, Alter? Ups. Ich sollte dieses Soundboard-Ding wegmachen, das ist nämlich direkt über... Also ich hab... Und das direkt übereinander, deswegen verdrücke ich mich öfters mal. Ja, Hue ist teuer, das kommt auch noch dabei. Das träumt beide, Alter. Quinn 31, nee 131, oh, was hab ich nicht, Quinn, das ist wahrscheinlich G-Win, oder Gewinn, ach, was, keine Ahnung. Dankeschön für den Sub. 3 Monate, Massive Subscription. Warum will Twitch jetzt von mir, dass ich meinen Sub teile? Musst du nicht. Das ist rein optional. Kannst du einfach sagen, Max, gib dir meinen Sub, Hals, Maul, ist auch okay. So, Homer0818, exzellent, aber richtig exquisite, exzellent. Oh, das Scam Train ist am Start, Leute. Das Scam Train ist 490% komplett. Alter, ich bin ja schon, bin ja ganz aufgeregt. Lasst euch scammen, alles subben. Any Primers, alle reinzahmen, Leute, jetzt. Lasst euch scammen von Twitch ne Runde. Morgen gibt's nix mehr, Leute. Ab morgen könnt ihr nicht mehr subben. Das geht, nee, nee, Moment, was war heute ist der 29. In drei Tagen könnt ihr nicht mehr subben. Nie wieder. Nie wieder. Ihr müsst jetzt subben, sonst gibt's nix mehr. So, als ist es, wie immer, funktioniert. Der Kilven hat Abos gegiftet. Fünf Stück, wenn ich das richtig sehe. Dankeschön, nice, Massive. Wie gesagt, heute ist der IQ Increase vom Chat ja wieder absolut next level. Wir hatten was gekriegt. Also Dankeschön, Kilven. Fünf Stück. Asarex kriegt was, Dummi kriegt was. Dummi kenn ich, glaub ich, den kenn ich von Mashed aus dem Stream. Der kommt mir irgendwie bekannt vor vom Namen her. Canetus, Mark Pla und Ero X. Ero X ist auch öfters da. Der Eichler natürlich auch. Der hat zwar nix gekriegt, der ist ja schon sub, aber nur weil ich ihn grad seh. Huge, ja. Kofax hat auch vier Monate Subscribed. Dankeschön. Am ersten Januar ist Corona vorbei. Moment, per Definition war ja Corona schon vorbei, glaub, am 25. November oder so, weil bis dahin sollte das Ganze ja nur gehen. Alter, der Hype Train ist auf Stufe 4. Der levelt auf. Vielleicht braucht der noch ein Skilltree. Was machen das hier gerade? Was hab ich denn hier? Das hat ernsthaft ein Menü oben? Hab ich schon nie gesehen. Na gut, das ist eine Elektronenanwendung. Elektronenanwendungen haben immer so Dinger. Herwing, sechs Monate. Dankeschön für den Sub. Jetzt geht's aber ab hier. Unic, auch am Start. Prime Subscription. So viel Big Prime Subs. Dankeschön, Unic. Leider kein Prime. Leute, ernsthaft. Ich find's super, wenn alle, also jeder, der da ist, find ich gut. Mit oder ohne Sub. Natürlich mit Sub mehr. Nein, Quatsch. Topics, vier Monate. Dankeschön für den Sub. Und jetzt kommt noch ClocksHD. Hat ein Abo verschenkt. Wer hat's denn gekriegt? Der Speed Rider. Exzellent. Warum auch immer. Weiß nicht, warum ich da grad drauf gedrückt hab. Und jetzt, um den Chat noch mal zu schocken. So, also jetzt machen wir mal was Sinnvolles. Also wir haben geflasht. Wir haben geflasht. Es geht ja weiter. Es geht immer weiter mit Abos, ey. Meine Güte. Was haben wir jetzt hier am Start? SirLawrens hat Subscribed. Drei Monate hier. Massive IQ, schon wieder. Dann haben wir noch, wen haben wir sonst noch? ClocksHD. Hat noch zwei Stufe 1 Abos verschenkt. Und zwar an Teddy Jupp. Oder Kup. Und an Phipps2. Phipps2 ist auch auf der Star. Exquisite. Dankeschön für die ganzen Subs, Leute. Aber gut, sonst kommen wir ja zu gar nix mehr heute. Der Scam Train ist schon auf Stufe 5. Wie gesagt, der Scam Train. Final Level. Leute. Morgen gibt's nix mehr. Final Level. Es ist der Final Level ist jetzt. Ich hab noch nie gesehen, was passiert, wenn das Final Level auf 5 kommt. Oder gibt's Level 5 Emotes. Guckt euch das mal an. Level 5 Emotes sehen aber echt kacke aus. Die sehen aus, als hat die Twitch bei Fiverr beauftragt oder so. Oder? Also ich mein. Das können echt schon Fiverr sein. Die sehen nicht gut aus. Kost geht auf 40er-Lohn. Immer nice. Ich glaub, langsam, langsam, langsam weiß ich, wie man das baitet. Speed Raider. 3 Euro. Dankeschön. Exzellent. 100 Topics auch. Animierter Pogchamp. Wenn das 5 voll ist, geht die Prozentszahl einfach über 100 weiter. Haha, ganz bestimmt. Ja, das müssen wir ausprobieren. Ich glaube, der Eichler hat nicht recht. Nee, nee, das stimmt nicht, Leute. Ich glaub, ich dem Eichler nicht. Der Eichler erzählt bestimmt Mist. Nein, Chat, ich glaub euch das. Ich glaub's erst, wenn ich sehe. Ich hatt' auch die Level 5 Hype-Train, ja. Richtig unauffälliger Bait, ja. Okay, Leute. Warum ist der Hype-Train auf Level 5 und 300 Viewer? Der Hype-Train ist auf Level 5, weil grad mehrere Leute Subs gegiftet haben. 300 Viewer wahrscheinlich, weil die Leute Zeit haben. Gerade so zwischen Weihnachten und Silvester. Wie kann ich Virtualisierung einem Noob erklären, also was das heißt? Sag einfach, er hat noch einen zweiten PC in seinem PC. So doofs klingt, aber hey, wie willst du's einem richtigen Noob erklären? Sag, du hast einfach noch einen PC in seinem PC drin. Fertig. Das kapieren die dann. Tinkerbell 3. Oh, Leute. In your face. Der Scam-Train ist voll. Wo sind wir? Tinkerbell 3. Dankeschön für den Sub. Prime-Subscription. Massive. Und M-Bits hat 5 Subs gegiftet und zwar Scheiterhaufen aufs Money gekriegt. Oh, das geht tatsächlich über... Was ist das für Scam-Mas, Alter? 125. Lull. Richtiger Scam-Mas. So, also wir haben was gekriegt. Dankeschön für die 5 Subs auf jeden Fall schon. Scheiterhaufen auf die Fehos-Petin. Kuluna Florian. Der ist auch auf der Star. Der hat's auf jeden Fall auch verdient. Massive-Bits. Dankeschön, Dankeschön. Alles, Leute. Wie kann ich mehrere Pies VPN-mäßig zu einem Server connecten? OpenVPN. Äh, nee. Ja, also OpenVPN geht auch, aber neben das hier. Im WireGuard ist eine Ecke einfacher als OpenVPN. Ab jetzt Full-Stream-Streamer auf Twitch. Leute, ich muss euch mal was verraten. Ich, ähm, hab jetzt ja Urlaub gehabt. Seit... Seit wann hatte ich denn Urlaub? Seit... Oh, ich hab ja noch Urlaub. Ähm, ich glaub seit... Seit hier so... Also ich hab jetzt seit über ne Monat Urlaub und ich hab mir jetzt im Dezember ein bisschen Gedanken zugemacht, ne? Und zwar hab ich mir überlegt, ich geh ja aktuell nur noch 4 Tage die Woche arbeiten, das wisst ihr ja. Und ich hab mir überlegt, ob ich jetzt... Ich mein, geldmäßig hab ich das nicht wirklich nötig, der... Was heißt nicht nötig? Zu viel Kohle kann man nie haben, ne? Was ich sagen will ist, also ich bin jetzt da nicht unbedingt drauf angewiesen auf die Kohle und also ich halt auch noch nen Tag weniger aus. Also ich bin mir grad am überlegen, ob ich nicht anstatt 4 Tage nur 3 Tage arbeite. Chef guckt Stream, ja gut. Selbst wenn der Stream gucken sollte. Ich weiß ja noch gar nicht, ob ich's mache und außerdem ist er der Erste, der's erfährt. So, aber jetzt machen wir mal weiter mit der ganzen Geschichte hier. Also, kannst du mir eventuell einen Tipp geben, wie ich auf dem Pi meinen MQTT-Broker subscriben kann? Ja, du musst erstmal die richtigen Emotes verwenden für. Und mir Daten in eine NoSQL-Datenbank schreiben kann. Ja, also... Warte mal. Also, deinen MQTT-Broker subscriben kannst du mit... damit. Mosquito-Sub. Und die Daten in der NoSQL-Datenbank schreiben, ist halt die Frage, in welcher Form die Daten vorliegen. Da musst du wahrscheinlich was kleines programmieren, in einer Sprache deiner Wahl, die ein MQTT-Client hat und ein MongoDB-Client. Äh ja, Clasibau kann ich sagen. Es gibt da nichts, was dagegen spricht. Kannst du empfehlen, sagt Venice. Oder Vanish. Ich hab zufälligerweise einen E-Mote, was ich eh nicht anhör. Der Aquara-Cube war der Renner. Ja, ich hab immer noch nicht ausprobiert. So, ok, jetzt fangen wir mal an. Also, ich hab jetzt... Ich hab jetzt die Micro-SD-Karte geflasht. Und was wir jetzt machen, ist folgendes. Zack. Zack. Dann wir erstmal die alte SD-Karte raus machen und das Ganze... Oh, ich brauch ja noch ein Netzwerkkabel. Hab ich hier noch ein Netzwerkkabel? Ich glaub, ich hab ja noch ein Netzwerkkabel. So, jetzt machen wir die alte SD-Karte erstmal raus. Zack, ich schmeiß es mal besser hier in die Kiste, sonst wird das nix. So, und hier, die richtig gute Samsung Endurance... Oh, fuck. Au. Autsch. Ich hab grad voll mein Knie gegen den Tisch gehault. Ich glaub, man hat's gesehen. Hier, die gute Samsung Endurance Pro. Kommt da jetzt rein. Oh, ich hab noch was vergessen, Leute. Ich hab das Wichtigste vergessen. Systema-Chat. Der Scamtrain hat mich so abgelenkt, dass ich das Wichtigste vergessen hab. What the fuck? Ich hab SSH nicht aktiviert. Da kann das ja nicht funktionieren. Wisste, Leute, das Wichtigste hab ich vergessen. Ich muss jetzt die SD-Karte, und das müsst ihr auch machen, wenn ihr euch den Raspberry Pi 4 oder 3 oder was auch immer installiert. Nachdem ihr das geflasht habt, müsst ihr eine Sache machen. Ihr müsst euch die SD-Karte mounten. Was ist es denn? Dev-SDB. Das könnt ihr auch im grafischen Tool machen, das ist vollkommen egal. So, und jetzt müsst ihr da machen, touch SSH, weil ansonsten ist SSH nicht an. Ihr könnt euch auch an den Raspberry Pi nicht einloggen. Wenn ihr da Desktop installiert, Desktop-System drauf installiert habt, ist es egal, weil dann habt ihr wahrscheinlich auch Tastatur und Monitor dran. Hab ich aber nicht, und insofern muss das sein. Kannst du mal einen Spiegel zeigen? Nein, gibt's nicht. Aber ich hab mich schon so oft gespiegelt, Leute. So, also. Sind wir hier. Geht es euch auch so? Steckt ihr das auch immer komplett falsch rum rein? Zack, so. Und jetzt muss ich mal ein Netzwerkkabel holen, kurz. Warte mal, Netzwerkkabel. Ja. Haben wir das nicht geändert sogar zwischen dem Dreier und dem Zweier oder dem Dreier und dem Vierer, warum die SD-Karte rein muss oder an welcher Stelle die SD-Karte reinkommt? Mir ist irgendwie so, als ist das bei den Alten anders gewesen. Aber kann auch sein, dass ich das komplett durchladen bringe. So, also. Netzwerkkabel ist dran. Die SSD mal mal gleich dran. Ich schließe jetzt erstmal hier eine Runde Strom an. So, der Kicks guckt zu. Passt auf. So, ich leg das mal irgendwie so ein bisschen hoch kann. Übrigens, macht nicht den Fehler, den ich einmal gemacht hab. Ich mach mal kurz nochmal Strom raus, nur auf Nummer sicher zu gehen. Macht nicht den Fehler, den ich einmal mit dem Raspberry Pi Zero gemacht hab. Und zwar, ich hab ein Raspberry Pi Zero mal genommen und so auf Metall unterdings gelegt. Und ihr seht ja, wie viele Kontakte das Ding unten hat. Und das mag das nicht, wenn man die kurz schließt. Also ich hab den Raspberry Pi Zero in eine Metallkiste gelegt. So. Und hab's eingeschaltet und das hat kurz, kurz, ähm, bisschen geraucht. Also nicht wirklich viel. So mal ganz kurz so ein bisschen, dann war's vorbei. Aus, aus ist gewesen. Aus war. So, also stöpseln wir das mal an. Exzellent. Seht ihr, wie viel das verbraucht? Ein bisschen, ne? Wir machen's mal andersrum. Hallo? Ah. Nice. Okay, schalten wir mal an. Da, leuchtet, ist an. Weiß ich auch nicht, ob man das sieht, dass das leuchtet. Aber es sollte, man sollte es sehen, dass das leuchtet. Da, da unten guckt er. Ich glaub, das Licht ist ein bisschen hell. So, der sollte jetzt eigentlich booten und wir sollten uns darauf connecten können. Dramatische Musik dazu, ja. Oh, das ist die Mario, ähm, Geisterhausmusik, oder? Also wir sollten jetzt eigentlich mit dieser IP auf den Pile kommen, wenn das stimmt. Äh, sieht schlecht aus. Aber der bootet noch, oder? Guck mal Leute. Der, also, der hatte da zwei LEDs unten, da sieht man's ja. Das Licht ist jetzt ein bisschen hell, da sieht man's nicht wirklich. Ja, da ist so eine grüne und eine rote LED. Und normalerweise ist so, wenn du Strom anmachst, die rote geht immer an und die grüne ist quasi eure Festplattenaktivität beziehungsweise eure MicroSD oder eure Disk, Disk, Storage, was auch immer Aktivität. Und normalerweise, wenn du das erst nochmal anschaltest, blinkt der wie verrückt auf der, auf der grünen und irgendwann ist er fertig blinken mit der grünen und dann könnt ihr euch eigentlich sicher sein, ok, er hat gebootet, aber, äh, ah, ok, er hat doch gebootet. Oh fuck, IP liegt, Leute, schon wieder, schon wieder IP liegt, was machen wir denn jetzt? Anzeige ist raus. Ich, ich, ich lösche mal wieder meine neuen Hosts. Default Passwort ist übrigens immer Raspberry. Das heißt, ich hab jetzt nicht nur die IP geleakt, ich hab jetzt sogar das Passwort geleakt. Jetzt wird's aber kritisch langsam. Der Chat ist bestimmt schon eingeloggt, oder? Seid ihr schon drin, Chat? So wie ich euch kenne, so wie ich euch kenne bestimmt. SSHKGN-R. Echt, löst das das? Das hab ich, das wusste ich gar nicht. Ah, du kannst extra den Hostname löschen. Exquisite. Das ist ne richtige Hackermans wieder im Chat am Start. So, Upt, Upgrade, wir machen erst mal ein Update. RS Revo, das wusste ich nicht. Siehste mal, hier lernt man auch was. Massive Brain Chat. Und wisst ihr warum? Nur wegen den vielen Subs. Ohne die Subs wäre einfach das IQ Level im Chat auch nicht hoch genug, dass das überhaupt klappen würde. Aber jetzt, mittlerweile, ist das, geht das. Demnächst, demnächst platzt's. So, wir lassen ihn erst mal Upgrade machen. Wo wir gerade dabei sind, ich guck mal kurz wie schnell, wie schnell die SD ist, die Micro SD, Endurance Micro SD Karte. Okay, also, wir schauen jetzt mal, wie warm der Raspberry Pi wird und wie schnell die Micro SD Karte ist. Und dann gucken wir, wie warm die mit dem Gehäuse hier wird, ne? Also, Ziel ist jetzt, ich teste mal, wie warm das Ding wird, mit den einfachen Passivkühlern und dem Stehen der Luft. Und dann gucken wir mal, wie warm das ganze mit dem Gehäuse wird. Aber erst mal muss der updaten. Wie konnte man sich CPU Temp anziehen? VC, V, VC, GEN, CPU, VC, GEN, Measure Temp. Genau. Eins Sub, plus eins IQ. Ne, ne, das ist doch nicht nur plus eins. Mittlerweile sind wir schon deutlich weiter. Also, ich mein, wenn du dir den Chat mal anguckst, nur, jetzt mal ohne Spaß, Leute, guckt euch mal meinen Chat an und dann geht mal in irgendeinen anderen Channel. Also, da sieht man ja mal richtig, dass mein Chat einfach massive high IQ ist und wenn du das direkt mit anderen Channels vergleichst. Wieso kein Boot von der SSD? Weil ich die SSD komplett für Videoaufnahmen verwende. Eventuell mach ich die Logs später noch drauf. Muss ich mal gucken. Also, ich mach, und ich kann mein altes, ich zieh mein altes Zeugs einfach um, wahrscheinlich vom alten Raspberry. Ähm, klar, das kannst du mit der SSD auch machen. Aber so ist mir das ganze lieber. SSD komplett für Videos und System-Unified-Zeug auf die MicroSD. Was für, das ist das ganz normale 32-Bit Raspberry Pi OS. Ja, genau, vergleicht mal den Chat mit Knossi-Chat, Alter. Wobei man das nicht vergleichen kann. Das ist so, wie wenn man Big Brain Arte-Doku mit RTL2 vergleicht. Alles hat irgendwie seine Daseinsberechtigung. Ah, die Musik. Unified-Controller, ja. Also, auf den Pi kommt drauf, der Unified-Controller, ein Proxy für Zertifikate. Äh, nö, nicht im Docker, aus dem Repo. Vielleicht auch im Docker, ganz ehrlich, hab ich mir noch gar nicht großartig angeguckt, aber wahrscheinlich nicht. Die haben offizielle Repos für den Raspberry Pi, ich werd's wahrscheinlich einfach darüber installieren. Und meine Kameraüberwachungssoftware. Das, was auch der hauptsächliche Grund ist, warum ich das jetzt umziehe, weil mein Raspberry Pi 3 unten zu viel nicht RAM hat, um Bewegungserkennung richtig zu machen, mit den Kameras. Da mach's gleich Arte-Doku. Ja, so genau, würd ich das jetzt nicht vergleichen. Aber zumindest kein RTL2. So, also, jetzt haben wir den Kram geupdatet, sehr gut. Wollte das, hat das Kernel-Update gemacht oder so? Sollen wir mal neu starten im Zweiten? Komm, wir starten mal neu, sicher, sicher ist sicher. Aber ist ja nie. So, und dann gucken wir mal, wie warm der ganze Kram wird. Just Jinx Twitch Prime, danke schön für den Sub. Plus 1 IQ. Du musst in einer Woche wieder arbeiten. Ja, ich auch. Also ich muss am fünften, nee, Moment, 0w, das ist schlimm mittlerweile. Ich sag ernsthaft 0w. Also ich sag jetzt nicht einfach nur 0w, weil ich im Twitch-Chat on bin. Ich sag einfach manchmal vor mich hin 0w, nicht hängen geblieben. Hier, am fünften muss ich wieder. Ja, ich muss auch am fünften wieder. Ah, da ist er wieder. Das ist so, ich hab letztens morgens im Bad gestanden, das ist kein Witz, Leute. Ich hab letztens morgens im Bad gestanden und hab mir Socken angezogen und hab festgestellt, dass die Socken nicht zueinander passen. Und ich hab wirklich laut gesagt 0w. Ich hab nicht gelacht oder so. Ich hab einfach nur gesagt 0w und hab die Socken gewechselt. Richtig richtig hängen geblieben, ne. Geht mir genauso 0w. Übrigens mal so als Tipp, wer auch nur Raspberry Pi am Start hat und eben auf den Keks geht, dass man immer das Passport eingeben muss beim Login. Macht einfach ssh-copy-id, loggt euch einmal noch ein und dann wird festgestellt, danach könnt ihr euch immer ohne Passport einloggen. Pause jetzt, ihr habt einen ssh-key generiert, was aber eigentlich normal sein sollte. Ihr habt früher in der Schule immer xd gesagt, ne, das hab ich nie. Beim nächsten GitHub Review einfach 0w und dann ablehnen. Das ist eine gute Idee, ja. Das müsste ich echt machen. Bei manchen Leuten kann ich's machen, weil ich weiß, die gucken auch Twitch. Das mach ich nächstes Mal. Nächster Pullrequest, der kommt. Nächster Pullrequest, der kommt, schreibe ich rein, 0w größer kekw-close. Oh, ich hab grad fast ein Stück vor meinem Schreibtisch abgebrochen. Also, wo sind wir stehen geblieben? Und zwar, also, wir wollten gucken, wie warm das Ding wird. vc-gen-measure-temp. Aktuell ist das, aktuell schwankt das zwischen, ja, so um die 48 Grad. Das heißt, wir installieren jetzt erstmal die allerwichtigsten Dinger, die man braucht. Schreibtisch, ne, nur ein bisschen die Farbe ab. Ich hab doch einen Stuhl mit Armlehnen und ich hab die Armlehne grad unter den Schreibtisch reingeklemmt, weil es halt genau von der Höhe passt und dann hab ich rumgedreht und es ist unten ein bisschen Farbe abgegangen, also nix wildes. So, wir installieren jetzt erstmal die wichtigen Dinger, die man immer braucht, falls es nicht eh schon alles drauf ist. Also, ich hab noch was vergessen. Eines meiner Lieblings, Debian-Pakete. Oh, Bowser-Musik. Genau, weil, wenn ich jetzt rebooten will, dann sagt er, nein, nein, rebooten ist nicht, geb erst nochmal den Namen vom Rechner ein. Das finde ich jetzt persönlich ganz nützlich, da kann man nicht aus Versehen, dann rebootet man nicht aus Versehen, weil mir ist es schon oft passiert, dass ich rebooten wollte und festgestellt hab, oh Mist, ich war im falschen Tab, deswegen ist das hier echt praktisch. So, ok, also schauen wir mal, wie warm das Ganze wird. Ups. Vc-Gen. Abinstall, was machen wir hier, Suspension oder so. Wir machen erstmal, wir testen erstmal von Hand. Also, der Raspberry Pi 4, der hat vier CPU-Kerne, die werden wir jetzt einfach mal alle auslasten. Jetzt nicht so komplett, Strasberry hab ich schon nie verwendet. Gibt's aber gar nicht, oder? Also, was ich mach, ist meistens Echo zwei hoch, blablabla, nach bc. What? Bc ist nicht installiert, was das? Bc ist ein Kommandozahlen-Rechner. So. So. Jetzt gucken wir hier noch. CPU-Auslastung, alles klar. So, und jetzt starten wir das Ganze viermal. Ups. So. Bam. Jetzt haben wir ordentlich CPU-Auslastung, mal gucken. Abinstall Stress und dann führt man's einfach nur aus mit Stress. Also, ich hab Suspension öfters verwendet, aber Stress. Stress klingt so nach Haftbefehl-Track. Na, SL haben wir schon oft genug. Ok, wie warm wird's denn, wie warm wird's denn mit so Low-Prain-Auslastung, ja? Ich mein, wir haben nur 100% auf allen vier Kern, da geht natürlich noch ein bisserl mehr. Wie warm wird denn das Ganze? 64, 64°, 65°. Leute, was solls mal machen? Au. Alter. Ey, der ist wirklich warm. Das hier geht's nicht so. Aber, Alter, der ist wirklich warm. Also, mal gucken, mal gucken, ob sich die Temperatur ändert, wenn ich den Finger drauf halte. Au. Alter, ich kann den, guck mal, guck mal, seh, die Temperatur geht runter, wenn ich den Finger drauf mach. Finger drauf. Ah, ich kann den Finger nicht lang drauf machen, Alter, 70°. Haustier, eher Katzer zugeschlagen. Jetzt passen wir mal auf, mal gucken, mal gucken, was passiert. Hast du nicht den Infrarot-Thermometer? Nein, nein, hab ich nicht. Wo ist die Abisolierzange? Ein guter Hinweisproxy, die Abisolierzange. Du meinst, du meinst, um es korrekt auszusprechen, der Abisolierzamp, der Abisolierzamp, der ist hier. Exzellent, Abisolierzamp. Bäm. Ich hab jetzt leider nichts da zum Abisolieren, sonst würd ich jetzt einfach, einfach, weil es geht, was Abisolieren. Wo ist der Abisolierzamp in Action? Hab ich irgendwo was? Leute, wartet mal, der Abisolierzamp will abisolieren. Einfach Finger abisolieren. Einfach nur, einfach nur, weil es geht hier, so. Abisolierzamp. So, jetzt hätten wir das auch geklärt. So, also, es ist ziemlich, ziemlich warm mittlerweile, würd ich sagen. Der Raspberry Pi, so 75 Grad. 75 Grad, das merkt man auch schon mit dem Finger, wenn man da drauf geht. Also, das kannst du, du kannst den Finger nicht drauf lassen, geht nicht. Du kannst den Finger eine Sekunde drauf machen, dann ist es vorbei. Teste das mal. GetConf gibt's nicht. GetConf ist doch irgendein GTK Ding, oder? Oh, tatsächlich, nee, ist nicht. Report. Okay, also, dann machen wir das jetzt mal mit Stress. Liegt dir ein Eistauer zu. Ich hab hier ein Gehäuse, das probieren wir jetzt mal aus. Also, 77 Grad, jetzt probieren wir das mal mit Stress. Abinstall Stress. Wie führt man einen Stress aus? Einfach nur Stress ausführen, ich hab das noch nie verwendet. Stress. Ah, Stress, Minus Minus CPU 4, oder? Oder einfach nur Minus Minus CPU und er macht an. Bäm, Stress, gib ihm. Er geht noch ein bisschen mehr hoch als einfach nur mit meinem PC. Sariks, das macht doch im Endeffekt einfach nur für jeden CPU Kern. Ach nee, nee, nee, nee, Moment. Das startet für jeden CPU Kern. Yes und piped nach Def Null. Joa, kann man auch machen. Abonniert Stufe 1 Nelson und Munz. Dankeschön für den Sub. Okay, also sagen wir mal so, 75 Grad ist vorbei. Was ist denn, was ist denn so Max Temp? Pie. Ich mein, man darf jetzt nicht vergessen, der liegt offen da. Wenn der dann unten im Wohnzimmer in der Ecke liegt, wird es auf jeden Fall noch wärmer. 85 wird runtergetaktet, okay. Mal gucken, was passiert, wenn man pustet. Das geht direkt ein bisschen runter. Pustchamp. Okay, also sagen wir mal so, 75 Grad, 75 Grad, easy. Meckert er irgendwie, dass er zu warm wird oder so? Nee. Macht er noch nicht. Noctua-Fan drauf, da bekommen wir den unter Null Grad. Wisst ihr, was witzig ist? Wartet mal, wartet mal. Eingestaubt. Bisschen eingestaubt, aber Lüftungsfan ist am Start. Also unter einem kleineren machen wir es jetzt nicht. Der Lüft das große Raspberry Pi. Die Sache ist die, ich weiß gar nicht, wo ich den anschließen soll. Kann ich den da irgendwie dran anschließen? Was braucht der? 12 Volt, das sind 12 Volt-Fan, den kann ich da gar nicht dran anschließen. 12 Volt-Fan, der geht überhaupt nicht da dran. Ja gut, dann lüften wir jetzt nicht, sonst hätte ich einen Lüftungs-Champ gemacht. Wir testen jetzt das, was wir eigentlich testen wollen, weil wir haben ja noch ein bisschen was vor uns. Wir testen jetzt das Gehäuse. Also, der hat jetzt lang genug gelüftet, lang genug, lang genug gebrutzelt. 75 Grad, okay, 75 Grad, das kann ich mitleben. Alles klar. So, dann machen wir den Stresstest mal aus. Der sollte jetzt wieder ein bisschen runter gehen. Ja, geht auch direkt runter. Alles klar. So, jetzt würde ich sagen, bauen wir den Kram mal ins Gehäuse ein und gucken, ob es kühler bleibt. Kann man das im laufenden Betrieb machen? Ich glaube nicht. Alter, wie das quietscht, exzellent Bauweise. Kannst du immer noch ganz schön warm das Ding? WD-40, im Zweifelsfall kannst du... WD-40 ist ja für viele so Allheilmittel. Dabei ist das gar kein gutes Schmiermittel. Oder, nee, warte mal, war das umgedreht? Was ich jetzt durch dann erbringe? War das nicht so, dass das Feuchtigkeit entzogen hat? So. Also, jetzt ist die Sache. Ich habe keine Ahnung, wie das funktioniert. Da ist nichts dabei bei dem Gehäuse. Also, die Klemmen brauchen wir jetzt auf jeden Fall nicht. Und die alte MicroSD brauchen wir jetzt auch nicht. Aber... Was? Das ist ja der... Okay, das ist der mickrigste Schraubendreher, den ich je gesehen habe. Alter, was ist das denn? Guck dir das mal an. Dazu fällt mir nur noch ein jetzt hier. Cute. Cute Schraubendreher. Ja. Also, habt ihr jetzt übrigens gesehen, der Raspberry Pi braucht unter Last, gucken wir uns das Ganze nochmal an, unter Last 5,7 Watt. Also, man sieht, der Unterschied zwischen so einem ESP32 und einem Raspberry Pi ist schon enorm. Aber, weil das hatten wir letztens mal im Stream. Aber, im Vergleich zu so einem normalen Rechner, den man sonst so hat, ist das immer noch ziemlich wenig. Wobei man sagen muss, man kriegt auch die aktuelle x86 Low Power Intel Plattform, die kriegst du auf ähnliche Werte. Ich hab so ein x86, so ein ganz billiges Low Power Board von Intel. Es braucht auch nur 7-8 Watt. Eidl, wohlgemerkt, ne? Der Raspberry Pi unter Volllast. So, mal die Musik wieder an, die Musik jetzt aus. Gut, dann machen wir mal aus und bauen das ins Gehäuse ein. Ich hab keine Ahnung, wie es funktioniert. Machen wir hier mal ab. So geil, das Zeug hier hinten ist warm. Alles warm an dem Raspberry Pi gerade. Okay, ich hab keine Ahnung, wie das funktioniert. Also, wir haben hier so komische, ich würd mal sagen, das sind so passiv, so kühler, um es im Gehäuse zu verbinden. Ich guck mal, ob hier irgendwo ein Handbuch drin ist oder so. Oh ja, Cute Book ist da drin. Alles klar. Ach, ihr seht ja gar nix. Ihr seht ja gar nix. Ihr seht ja gar nix. Guck mal hier. Cute Book ist da drin. Exquisite Chat. Alles klar. How was your experience with IC Box? Gut, also das hier ist exzellent Anleitung. So funktioniert's. Also, man macht den, okay, also das ist, glaub ich, Danger. Danger. Das sind die Amis, guckt mal. Warning. Ich kanns im Kopf nicht lesen. Directly hazardous situation causing death or serious injury. Also, Tod oder schwerste Verletzung. Ich weiß ja nicht. Also, ich bin mir da nicht so ganz sicher, ehrlich gesagt. Okay, wenn sie meinen. Und das nächste ist Make cause. Okay, also das hier, Danger, bedeutet, es ist direkt zum Tod oder schwere Verletzung. Warning ist, kann zu schweren Verletzungen und Tod führen. Äh, Achtung. Es ist möglich, dass es zu kleinen Verletzungen kommt. Aha, alles klar. Jetzt übertreibt's man nicht. Das ist ein fucking Metallgehäuse. Okay, also wie funktioniert's denn? Steht da irgendwo was drin? Safety information. Sieh ich auch, jetzt gibt's das ganze auch noch. Hier. Warn vor allem, eine unmittelbar gefährliche Situation, die zum Tod oder zu schweren Verletzungen führt. Alles klar. Quick installation guide. Äh. Ah, okay. Big brain champ. Da steht's, wie's geht. Also, das machen wir jetzt. Also, so wie ich das sehe, müssen wir dazu. Ich seh nur die Hälfte von hier oben. Also, place den Raspberry Pi da unten drinnen. Ich würd mal sagen, das ist unten, weil das hat Füßchen. Das heißt, der Raspberry Pi muss da so rum rein. Viel, ich mein, viel anders, viel anders kann's ja nicht funktionieren, ne? Setzen Sie das Raspberry Pi Port wie gezeigt in das Unterteil ein. Haben wir. Richten Sie das Raspberry Pi Port aus und befestigen Sie es mit den vier beiliegenden großen Schrauben. Wo sind da große Schrauben? Das da. Massive. Alter, das ist ja die größten Schrauben aller Zeiten hier. Viel größer geht's ja kaum noch. Da brauchen wir, oh ja, guck mal. Oh, sind die große Schrauben, meine Güte. Riesige Schraube. Da muss ich jetzt den Cute Schraubenzieher für verwenden oder. Okay, das ist nicht mal magnetisch. Kann ich jemand, kann ich jemand anderen? Oh, fuck. Runter geschmissen. Kann ich jemand anderen für verwenden? Passt der da nicht auch rein? Passt doch. Easy, nimm ich doch mal einen anderen. Schraubchamp. Zack. Ach, jetzt weiß ich warum die großen Schrauben sagen, es gibt auch noch kleine Schrauben, die halt im Prinzip einfach nur noch kleiner sind. Alter, es ist wirklich kacke hier zu machen, weil ich stehe jetzt gerade über der Beleuchtung und gucke durch die Beleuchtung durch und versuche das irgendwie zu machen. Ich sehe nur die Hälfte, aber der Chat freut sich bestimmt. Hallo, kann ich hier reingehen, please? Oh, exellent. Kein Gross, naja, das ist normaler, ja. Kann ich aber auch mitleben. Oh, nächste Schraube. Das ist ja nicht so, als wäre das super kompliziert. Zack. Und jetzt die letzte Schraube. Kommt das da unten hin? Jetzt sehe ich wenigstens auch ein bisschen was, wenn ich das so halte. Alles klar. Zack, da ist er drin. Sitzt, basst, kackelt und hat Luft, hat Opa jetzt dazu gesagt. So, was kommt als nächstes? Jetzt brauchen wir diese komischen Kühlblöcke und bringen sie auf beiden glatten Seiten des kleinen und großen Kühlkörpers die mitgelieferten Wärmelight Pets in entsprechender Größe auf. Wo sind da Wärmelight? Ach, hier, guck mal, da sind Wärmelight. Exquisite Wärmelight Pets. Der hier? Nee, der ist nicht aus dem Werkzeugkörper vom Aldi. Ich weiß nicht, wo der her ist. Ich habe da auch keinen Set zu, den habe ich schon ewig. Das kann sogar sein, dass der mal aus dem Aldi ist. Den nehme ich für alles, wo man irgendwie einfach was kleines braucht. Wenn ich keinen Bock habe, irgendwie einen Set rauszuholen oder so. So, jetzt haben wir hier die Wärmelight-Dinger, wenn die noch rausgehen. Siehst ihr was? Exquisite, einfach aufreißen. Hä? Was ist das für eine Wurst, Alter? Wie soll denn das da jetzt dran passen? Hm. Also, wie geht es weiter? Was? Bringen Sie auf beiden glatten Seiten des großen Krügel... Okay, also Sie wollen wirklich, dass man dieses Zeug da drauf macht? Na gut, machen wir. Reißen wir ab. Haben die geschrieben, auf beiden Seiten oder auf einer Seite? Das Präzisions-Werra-Schraubendreher-Set ist richtig poggers. Ich bin ja auch Werra-Fan, das wollte ich mir auch schon eine Weile mal kaufen, ja. Ich habe ja sonst auch volles Werra-Equipment. Bringen Sie auf beiden glatten Seiten. Okay, das heißt, ich soll da und da jetzt so ein Ding drauf packen? Wie funzt das überhaupt, so? Ist das das Wärmelight-Pad? Mache ich das jetzt richtig so? Excellent. Massive. Alles klar. Ich glaube, das da unten ist einfach Ersatz, falls man das mal wechseln muss. Okay. Jetzt kommt das andere, jetzt kommt das fette. Wenn man das irgendwie abkriegt. Oh. Alles klar. Erstmal abgerissen. Was ist denn für ein Gebabe, ey? Wer hat sich das ausgedacht? Okay, sehr gut. Und jetzt? Und jetzt? Wie geht es weiter? Wie geht es weiter? Und jetzt muss man das so auf... Oh, ich muss die alten Dinger erst mal abmachen. Lull. Guck mal, da sind ja noch welche drauf. Kann ich die da vielleicht drauf lassen? Bis auf die da? Bis auf die da? Also, wir müssen das einmal... Den kann ich auf jeden Fall drauf lassen. Aber den muss ich... Oh, scheiße. One KS. Okay, ich hab's abgekriegt. Das ist das alte Wärmelight-Pad. Und welchen muss ich jetzt noch abmachen? Guckt mal. Den da. Also sprich, den da, hä? Den? Den oberen muss ich noch abmachen. Anleitungs-Champ, ja. So, also. Da, da. Das heißt, ich setze den Kram da jetzt einfach mal so drauf. Ich hoffe, das will jetzt nicht von mir geputzt werden oder sowas vorher. Den da. Und den da. Wahnsinnig schön ist das jetzt nicht, aber hält. Okay. Haben wir gemacht. Alles klar. Place Top Aluminium Case. Alles klar, das war's schon. Easy. Und jetzt einfach das Ding drauf. Wie rum? So rum, hä? Und ne, wie rum? Auf den Verwirrungs-Champ. Auf den... Das Große. Das Hohe Oben. Also so. Das macht schon richtig. So. Naja. Naja. Oder. Au. Alles klar. Ich putze das noch mal kurz hier ab. Was wollen die jetzt? So rum. Ich hatte es schon richtig. Wie soll ich das jetzt platzieren, so dass ich die Schrauben zu machen kann? Ja hab ich doch. Hab ich doch. So. Passt. Close-Champ. So. Da ist zu. Und jetzt muss ich Schrauben rein machen. Okay, jetzt muss ich den Cute-Schraubendreher verwenden. Weil, ganz ehrlich, diese Mini-Furz-Schrauben. Alter, ich hab ja schon ewig keinen Schrauben, der nicht mal magnetisch ist. Da wirst du ja verrückt. Fine-Motor-Skills-Over-9000. Okay, ein Vorteil hat dieses... Ach du Gro... So scheiße. Damit kannst du ja nichts drehen, ey. Was ist das? Ich hol gleich mal ein Set raus. Ordentlich gemacht. Kleine Furz-Scheiße. Okay, sehr gut. Excellent. Drehmoment gleich Null. Ich glaube, das kann man nicht mal Moment nennen. Okay, ist es drin? Alles klar. So, und jetzt mach ich mal kurz schnell die andere noch rein hier. Ah, hier kann man die... Hier könnte man jetzt irgendwie die GPIO-Sachen dran machen. Okay, das ist gar nicht mal so doof. Okay, wisst ihr, was das erste ist, was ich von diesem ganzen Set in Müll... In Müll buxieren werde. Süßes Teil hier, ey. iFixit-Set holen. Ich hab ein iFixit-Set. Ich hab ein iFixit-Set, ich hab ein Vera Tool-Check+, ich hab das Vera-Elektriker-Set und noch ein paar Bits. Ich hab da genug für, aber ich hab keinen Bock jetzt rauszugehen und das zu holen. So. Fertig, Champ. Alles klar. Wir haben es geschafft. Guck mal, das kannst du sogar hier theoretisch irgendwo in die Wand schrauben oder so, wenn du willst. So, und mal gucken, was wir jetzt für Temperaturen haben. Jetzt bin ich mal gespannt. Jetzt bin ich mal gespannt, was wir da jetzt rauskriegen. Also. Erst mal hier einstöpseln. Und wo haben wir es hier? Strom einstöpseln. Sieht man da irgendwie LEDs? Guck mal. Das ist aber passiv gekühlt. Schalter. Hm. Das ist natürlich doof. LEDs sieht man jetzt gar nicht. Ist ein bisschen blöd. Ah doch, LEDs sieht man. Ich weiß nicht, ob ihr die LEDs seht. Man sieht da ein bisschen LEDs drin. Das passt. Jetzt ist er an. Okay, schauen wir mal. Jetzt gucken wir mal, wie die Temperatur jetzt ist. Ups. Gucken wir mal. Warten wir mal, bis das Teil wieder da ist. Schau mal, EFT getriggert. Nö, nicht, nicht, dass ich wüsste. Okay, schauen wir mal. Wie warm wird das Ganze denn jetzt? Zack. Machen wir es mal so. So. Okay, Stress. Jetzt sind wir mit 35 Grad schon mal ein bisschen kühler. Und jetzt mal mit voller Pulle. Also ich würde jetzt erwarten, dass der ehrlich gesagt um die 60 Grad bleibt und dann ist er auch gut, ja. Also wenn überhaupt. Das dauert jetzt ein bisschen, bis es hoch geht, weil das kann natürlich den ganzen Kram jetzt erst mal. Der kann natürlich jetzt den Kram wunderbar an das ganze Gehäuse abgeben. Ich räume mal kurz ein. Was ist das? Ach, Füßchen oder so? Braucht man nicht. Der kann das jetzt halt wunderbar ans Gehäuse abgeben. Das heißt, dass es jetzt warm wird, braucht es halt ein bisschen. Aber ihr seht es am Stromverbrauch, dass der volle Pulle hat. Also vielleicht bleibt er sogar eine ganze Ecke unter 60. Ja guck mal, 47. Das hat sich schon mal gelohnt. Was ich mit der Hand gemacht habe, ich habe heute mit meiner Katz Wilde Fang die Hand Sachen gespielt. Okay, das bleibt eine ganze Ecke kühler. Das hat sich gelohnt. Das hat sich gelohnt. Und man muss doch jetzt auch mal sagen, jetzt mal ernsthaft Leute, so scheiße sieht das Gehäuse doch gar nicht aus. Das sieht doch eigentlich wirklich in Ordnung aus. Kann man sich nicht beschweren, oder? Ich finde es eigentlich ein ganz nettes Case und kostet nicht viel. 20 Euro oder so. Und das da drinnen sieht ein bisschen kacke aus mit diesen Pads. Weil man es halt einfach sieht. Auf der anderen Seite, man hätte es auch zumachen können, dann sieht man es nicht. Oder was man hätte machen können, merkt ihr, dass das Gehäuse warm wird? Minimal, nicht wirklich großartig, weil hat ja auch viel Flasche zum abgeben hier. Das Clear Case macht es besser. Das Clear Case hat direkt im Gehäuse sowas hier eingebaut, was man auf die CPU drückt. Immer noch die Katze von den Videos, die du aus dem Bett-Sofa kommst. Nee, leider nicht mehr. An Katzen, ich hatte die hier. Das ist die von den Videos, die ich früher mal gemacht habe. Danach hatte ich die. Die hat es leider nicht so lange ausgehalten. Und dann jetzt habe ich die hier. Das ist auch schon das zweite Jahr, wo ich die wieder habe. Schicko. Diggerkatze. Schmitty2802, Dankeschön für den Sub. Ok, es wird langsam wärmer. Jetzt noch Noctua-Lüfter montieren. Es wird langsam wärmer und ich merke das auch. Ich merke schon, dass es, gerade hier, wo die CPU ist, lauwarm wird. Aber ansonsten eigentlich kein großartiges Ding. Schon in Ordnung. Ja. Was auch witzig ist, man sieht, dass die Temperatur geht runter, wenn ich die Hand drauf lege. Nicht wirklich. Merkt man nicht. So. Du brauchst nun sowas. Nee, nee, brauch ich nicht. Ich weiß genau, was es ist, was mir zeigen willst. Nee, brauch ich nicht. Also, wäre sicherlich cool, aber die Dinger sind teuer ohne Ende. 30 Euro? Echt? So billig ist das? Ich habe mal geguckt, das letzte Mal, wo ich nach sowas geguckt habe, hat das irgendwie 280 Euro gekostet oder sowas. Infrarot-Thermometer-Optik. Ok, das ist cool. Sowas wäre wirklich nice. Kommt wieder ein Garten-Haus-Tour. Vielleicht, ja, wenn ich gucke, dass ich nicht so viel reveale. Ok. Tja, also das Gehäuse gefällt mir, das hat was. Da können wir jetzt mit der eigentlichen Sache weitermachen. Ich lasse den mal weiterlaufen. Ich mach mal ein bisschen, ich mach mal ein bisschen den ganzen Crap hier weg, dass der nicht im Weg liegt. Wobei, den da, den lassen wir mal kurz draußen. Zeug weg, weg. Schmeißen wir mal hier unten auf die Erd. Alles klar. Gut. Das heißt, wir haben das Ding jetzt, ja doch, ein bisschen warm wird es. Aber ganz ehrlich, jetzt nicht so in dem Rahmen, dass man da nicht die Hand drauf lassen könnte. Und vor allem, das Ding hat ja auch nicht Volllast die ganze Zeit. Matt kann durchaus sein. Exzellent. So, da brauchen wir hier alles nicht. So, gut. Ich hab, was hab ich noch übrig? Noch zwei Schrauben. Gut, die sind wahrscheinlich Bonus. Die brauchen wir wahrscheinlich für nix, weil, ne, ist ja überall dran. Was ist denn das da eigentlich hier hinten? Vielleicht wegen dem Sensor zum hinten rausführen oder so. Ehrlich gesagt kein Schimmer, wofür das Loch da hinten drin ist. Man weiß es nicht. Ach guck mal, man sieht ja die LEDs da durch. Poggers. Guck mal, das ist ja richtig durchdacht. Das seh ich ja jetzt zum ersten Mal. Die haben sogar Löcher für die LEDs gemacht. Könntest du mal wieder ein Video von einem Serverraum machen? Am Serverraum hat sich nicht so viel geändert, aber PC Setup würd ich ja gerne machen, aber dazu müsstest du erst mal ein neues PC kaufen. Gibt dir aktuell nix. LED Champ, ja. Was auch witzig ist, man sieht, dass der Verbrauch ein bisschen hoch geht, je nachdem wie warm das ganze Ding wird. Also der braucht potenziell mehr, wenn er wärmer wird. Ok, dann würd ich mal sagen, schließen wir mal. Hier ist das die Erde. Oder was machen wir jetzt eigentlich? Ich überleg gerade. Was machst du gerade? Also gerade haben wir getestet, ob das Gehäuse wirklich was bringt, von der Wärme her. Und es bleibt 20 Grad kühler. Ja komm, wir machen jetzt schonmal die SSD dran. Da brauchen wir den Adapters. Ja, Adapters. Zack. Und welchen USB Anschluss nennen wir da jetzt? Ja, unteren USB 3. Alles klar. Können wir das vielleicht sogar so machen? Geht das? Ah, nicht wirklich. Warte mal, ich machs mal obendran. Mach das mal obendran. Dass es ein bisschen mehr Radius gibt. Ja, ok. Ne im Moment Kabelbinder, ich dachte gerade an was anderes. Wir haben doch hier noch so ein Pad übrig. Wir haben hier noch so ein Pad. Wir haben einmal so ein Pad für die Füßchen. Und wir haben auch so zwei Pads. Dann machen wir einfach zwei Pads dran. Das hält nicht richtig glaube ich. Besser wäre ja wenn man das reinschrauben könnte irgendwie. Ok Leute, ich hab ne Idee. Ich hab ne Idee. Pass mal auf. Massive Idee. So. Ah. Achtung. Next. Ah. Druck doch ein Gehäuse. Ne. Gedruckt das Gehäuse nicht aus Metall. Mach mal einfach so. Komm mal her. Jetzt mach mal einfach so. Da. Komm noch eins hin. Ah. Ah. Hallo. Oh ne. Da ist noch. Oh fuck wie krieg ich denn das jetzt ab? Monka. Jetzt. Ok. X. Hyper Giga. Ah. Ah. Sieht ein bisschen aus wie beim Zahnarzt jetzt. Oh nu. Oh nu. Pock Champ. Ist das nicht nice? Pock Moment. Ja. Guck mal. Ist das nicht cool? Jetzt haben wir die SSD hier unten dran mit Wärmeleitpads. Und es ist, ohne Mist, es ist sogar relativ fest das Ding. Wir drücken jetzt mal. Wir drücken jetzt mal ordentlich das Ding fest. Das ist fest. Massive fest. Nice. Das steht ja dann eh so da. Das geht nicht ab. Passt. Nice. Pock Champ Moment. Alles klar. Gut. Geällt mir. Alles klar. Jetzt haben wir das. Gehen wir mal rüber. Wir sind immer noch bei 58 Grad. Alles in Ordnung. Passt. Doch hält. Hält. Kann Ding. Hält sogar richtig gut. Ach so Moment ich solls euch vielleicht mal zeigen. Hält richtig gut. So. Gut. Jetzt hätten wir das. Also bleibt auch schön kühl. Ähm. Können wir mal gucken, als was er die erkannt hat. SDA hat er das ganze erkannt. Also. Machen wir mal. MKFS. Jetzt haben wir es total. Machen wir das nächste FS drauf oder machen wir ein X4. X4. X4 kannst du immer gut lesen. DEF SDA. Um mal zu kurz zu überprüfen, dass auch wirklich das Richtige ist. Gucken wir mal was er da erkannt hat. Vmware. Warum ist da Vmware drauf? Ah. Wisst ihr was? Das ist die SSD, wo wir mal den ESX auf dem Raspberry Pi getestet haben. Könnt ihr euch da noch dran erinnern? Wir haben noch mal das ESX Bild für den Raspberry Pi getestet. Ah gut. Dann machen wir das. Das fliegt jetzt weg. MKFS. X4. DEF SDA. Bäm. Found GPT Partitionable Proceed. Yes. ESXI. Ja, haben wir mal ausprobiert. So. Fertig. Jetzt gucken wir mal wie schnell das ganze ist. Mount. DEF SDA auf Mount. DEF SDA. Kann Windows X4 eigentlich lesen? Nein. Mich würde es auch sehr wundern wenn das Microsoft einbauen würde. Wir machen das ohne Idee. Wir machen die Big Brain Anzeige wie schnell die SSD ist. Wir sagen CAT DEF 0 nach PV und das umgeleitet nach Image Bin. Also, die SSD ist nicht allzu schnell. Moment bin ich überhaupt auf der SSD jetzt drauf? Auf Mount. Ja. Ok, Geschwindigkeit von der SSD ist jetzt nicht die geilste. Was aber höchstwahrscheinlich an der SSD liegt, das ist ja auch so eine Low Budget SSD. Wobei ich mich halt frage, was geht maximal über den USB 3? So viel mehr dürfte das doch gar nicht sein, oder? Das ist doch ein 3.0er oder was hat denn der? Was hat denn der für korrekte USB Speck? USB 3.0 Port. Moment, Moment, Moment. Wir wissen alle, dass das nicht USB 3.0 heißt. Wir wissen alle, dass das USB 3.2 Gen 1 ist. Also lügt uns nicht an Raspberry Pi. Alles klar, ok funktioniert. Also für Videos ist das Ganze auf jeden Fall schnell genug. Bin ich zufrieden mit. USB ist echt grausam. So und jetzt ganz wichtig abinstall Prometheus Note Exporter. Das kommt natürlich auch noch ins Monitoring rein. Prometheus ist ein cooles Dashboard. Ohne Dashboard geht hier nix. Big Brain Dashboard. Tu mal so als hättest du Ahnung davon was was. Ja wenn du was wissen willst, frag. Ansonsten was wir grob gemacht haben ist, ich hab ehrlich gesagt nur eine Raspberry Pi 4 in den Gehäuse eingebaut bis jetzt und geguckt ob das kühler bleibt CPU Temperatur mäßig wie vorher und es bleibt deutlich kühler. Es bleibt 20 Grad kühler. Achja und dann haben wir eine SSD unten dran gepappt. Das war's. So. Twitch hat mir grad vorgeschlagen, dass ich das posten soll. Warum auch immer. So also wie viel RAM haben wir am Start? 4G. Also sprich das ist ein mittlerer Raspberry Pi 4, das ist nicht die 8G Variante. Und ich muss euch ehrlich sagen Hand aufs Herz die 8G Variante, das Geld kann man sich sparen, weil was kannst du mit einem Raspberry Pi 4 großartig machen, was wirklich 8G braucht, wo du mit 4 nicht auskommst. Mir fällt ehrlich gesagt nicht allzu viel zu ein. Wie viel hat das gekreuzt? Ich glaub 20 Euro oder so. Gucken wir mal. Pi IC Box. 15, ja, ne, das ist nicht, das da ist das. Das ist gar nicht mehr lieferbar, guck mal. Haha, lull. Ist ausverkauft mittlerweile. Aber das hier geht bestimmt auch. Moment, das ist mit Lüfter, oder? Das ist mit Lüfter? Ne, das ist ja Kackkonstruktion. Das ist ja ne richtige Pepega-Konstruktion. Also das ist ja schon ne richtige Pepega-Konstruktion. Warum sollte ich denn da Passivkühler hin machen und das Gehäuse dann oben drauf, das muss wenn schon verbunden sein mit dem Gehäuse. Richtig Pepega-Konstruktion, ja. Also wie gesagt, ich hab das hier. IC Box, IC Box, so, da gibt's bestimmt noch mehr. Ja, 19 Euro. Wie gesagt, ich glaube ich hab's bei Amazon für 20 Euro gekauft, halt inklusive Versand und allem, wie es halt bei Amazon immer ist. Wenn du ein richtig gutes Gehäuse haben willst, also das hier ist meiner Meinung nach das Beste. Ne, nein, das 50, das da. Das kostet aber nicht. Also das finde ich persönlich das Beste, aber das war nicht mehr lieferbar. Du bist mit dem hier ganz zufrieden. Boah, kann man alles nehmen. So, also. Wir haben Prometos installiert, jetzt können wir das Ganze ins Monitoring hinzufügen. Jetzt installieren wir noch Unify, ich bin mir nicht ganz sicher ob Unify überhaupt dabei ist, standardmäßig glaube ich nicht. Ne, da brauchen wir nämlich extra Debian-Repos, kann ich mir noch dunkel dran erinnern. Raspberry Pi, Unify, Repos. Installing Unify-Control und Raspberry Pi, genau das wollen wir machen. Accept. Jaja, geht's fort. Blablabla. Leute, es ist so weit. Es ist so weit. Wir kommen nicht drum herum. Ich ahne Schlimmes. Was macht der denn da alles? Das mussten wir doch glaube ich gar nicht machen. Komm, warum machen die das so kompliziert? Konnte man nicht einfach abinstall Unify machen? Das war doch easy as fuck. Ja, genau. So in der Richtung. Es ist schon zwei Jahre her wo ich das inszeniert habe, zum letzten Mal. Aber das war total easy. Jaja, blablabla. Fuck. Was machen die denn da für komplizierte Dinge? Das war doch total, das da muss man machen, genau das war alles. Mehr musste man nicht machen. Wobei man sich das hier auch sparen kann, ehrlich gesagt. Man sagt einfach ETC. Abt. Sources List. Oh, kein Wim installiert. Direkt hinterher. Unify Installation Scripts. Oh, kein Install Script. Das kommt einfach über das Repo und Gutes. Hast du noch Kontakt zum Friseur? Klar. Natürlich. Abt. Oh. Bam. Ohne Echo. Zack. Update. Fertig, mehr mussten wir noch gar nicht machen. Hätte ich schon gewonnen? Achso, ja, ja, ja. Den Key können wir auch noch importieren. Das geht doch. Moment, Moment, Moment. Das ging doch anders. Man konnte doch Key Import machen. How to import Abt. Key. Was ist das wieder für eine komische Anleitung? Abt. Key. Na gut, komm. Easy. Machen wir es so. So. Und jetzt Abt. Update. Und nun können wir Unify Installation Script machen. Der Kabu muss einen Klassen Guide weitermachen. Ich glaube, der ist da durch mit der Sache. Ah, das muss man noch installieren. Okay. Hat er wahrscheinlich schon? Nee, hat er noch nicht. Abt. Install. Unify. Genau. Abt. Update haben wir schon gemacht. So, und jetzt soll unsere Unify Kontrolle haben. Abt. Install. Unify. Achso, warte mal, welche Version ist das jetzt? Was ist jetzt Version Nummer? Seht ihr irgendwas? 6. Oh, oh, oh. Wie gesagt, ich habe auf dem alten noch 5. Mal gucken, ob sich meine Config importieren lässt. Das werde ich jetzt aber nicht on stream machen, weil dann leake ich alle möglichen Sachen. Bin mal gespannt, ob sich da meine Config importieren lässt. So, bei der Gelegenheit wollen wir gerade hoch, wo wir gerade dabei sind. Welche Window Manager? Das ist E3WM. Wir machen mal einen Eintrag in der fstub, dass er die SSD jedes Mal mountet. Etc fstub. Leute, gibt es irgendjemand auf dieser Welt, der fstub Einträge aus dem Kopf kann? Ich kann das nie, ich muss immer nachgucken. Ich kann mir auch immer nicht merken, was das hier hinten bedeutet. Ich weiß, dass er abbricht beim booten oder weiter bootet und wenn das nicht mounten kann, kann mir das nie merken. Echt nicht, ich kriege es nicht gemacht. Also, wir können das ja schon mal kopieren, zum größten Teil. Hoch. Es hängt. Na klar, du... Ja, ja, ist klar, Leute. Wobei wir machen es vielleicht... Ach komm, wir machen es mal mit dem mount MNT. X4. Also MNT. Also PartitionUI muss anders sein. Warte mal, also es gibt doch... Das ist doch auch, ob er automatisch Checkdisk macht oder nicht, ne? Ich kann mir das nicht merken. Archwiki ist beste, ja, das stimmt. Also, FSCK, genau, also. Soll er ein automatisches FSCK machen, ist okay, es passt, darf er machen. Genau, 2 ist, wenn er fehlt, schlägt, dann... Was bedeutet 2? Das wäre natürlich noch eine gute Erklärung dafür. Ah, die Reihenfolge, okay, dann ist das 2, ist in Ordnung. It's checked by dumb und das fehlt... Immer. Du kannst no fail... Ah, ich kann... Ohne Scheiß, ich kann mir diesen Kram im Kopf nicht merken. No fail an der Stelle? Nee, ne? So, zumindest brauchen wir jetzt erstmal die PartitionUI. Kommt mit hier die Kram mal aus. DLK, all die, was hat man da? Ja, die brauchen wir. UUID, zack, zack, zack, genau. Guck mal, ob das funktioniert, was ich da gebastelt hab. Was ist mit meiner Maus los? Ah, warum ist in dem Wim standardmäßig Maus-Support an? Was ist das denn für Pepega-Settings? So, der sollte jetzt eigentlich meine SSD mounten bei jedem Boot, wenn ich das richtig gemacht hab. Schauen wir mal, ob ich das richtig gemacht hab. Rebooten wir mal. Hat das Unify-Zeug installiert? Hat das Unify-Zeug installiert? Da läuft Unify-Zeug, ja. Netstat läuft da auch Unify-Zeug. System, CTL, Status, Unify. Failed. Oh, ich hab keinen Java installiert. Monka-A. Mount-A bringt mir grad nix, weil es ist schon gemountet. Aber du hast recht, ich könnte es einfach mal anmounten. Und dann machen wir Mount-A. Exzellent. Und es hat funktioniert. Sehr gut. Warum hat der Java bitteschön nicht als Abhängigkeiten drinne? Ist doch total bescheuert, wenn die schon Pakete haben. Und es muss anscheinend 8 sein. Das andere geht nicht. Was ist Monka-A? Wir bräuchten das Emote, ja. Alter, was will der von mir? Stopp. Start. Ah, easy, jetzt funktioniert's. Netstat. Bam. Da läuft's. Ganz viel Java. 1, 2, 1, 2, 1, 2, 1, 4, 7. Bam. Ach nee. Was, HTTPS? Nee, nee, nee. 80, 80. Jawoll. Restore vom Backup machen wir. Restore vom Backup. Das mach ich aber nicht on stream, sag ich euch gleich. Da lieg ich alle möglichen WLAN-Keys und Sachen im Zweifelsfall, da hab ich keinen Bock drauf. Okay, aber Unify-Controller läuft, ist schon mal ganz gut. Und jetzt gucken wir mal. Leute, meint ihr, meint ihr, es funktioniert, dass ich jetzt in meinem Dashboard den neuen Raspberry Pi sehe? Also ich hab legit noch nicht nachgeguckt. Ich hab den Prometos-Agent installiert und ich hab im Vorfeld schon in meine Config die feste IP, also die DACP-IP von dem Raspberry Pi reingeschrieben. Das hab ich schon gemacht. Gucken wir mal. Grafana. Manage. Node-Exporter. Da isser. Massive Dashboard. Big Brain Dashboard haben wir jetzt. So muss das sein. Stellen wir's mal auf 15 Minuten. Jawoll. Da kamen die ganzen Statistik-Fans, die können sich jetzt freuen. Auch gleich die Mario-Krusel-Musik am Start. Guck mal, wir haben jetzt richtig schönes Dashboard für den Raspberry Pi. Exquisite. Und wisst ihr was cool ist, dass sogar die Temperatur drin steht irgendwo. Hier, guck mal, wir haben sogar die Temperatur drin stehen. Wie konnte man hier nochmals Light-Theme machen? Wo konnte man das nochmal auf Light-Theme umschalten? Ich will mal gucken, wie es mit Light aussieht. Light-Theme. Was bringt das Dashboard? Du kannst zum Beispiel gucken, wenn ein Raspberry Pi abkackt. Natürlich sind's jetzt ein bisschen Overkill, was da drin ist. Du kannst zum Beispiel gucken, wenn ein Raspberry Pi abkackt, was die letzten Werte waren. Und vielleicht kommst du dann drauf. Ah, okay. Übrigens, das ist der falsche. Und dann siehst du dann zum Beispiel, okay, irgendwie ist ihm der Ram ausgegangen. Zum Beispiel, würdest du dann sehen. Du kannst hier einstellen. Ich geh jetzt mal auf den. Du kannst hier einstellen. Letzte 24 Stunden, letzte 7 Stunden. Ich glaub, ich hab 30 Tage. Ich glaub, 30 Tage hebt er auf bei mir die Daten. Und da kann ich dann nachgucken, okay, was war denn? Da seh ich, ah, guck mal, da hing jetzt 2 Stunden auf 100% CPU-Last und Ram war voll und Load ging hoch und irgendwann ist er halt abgekackt. Und du kannst zum Beispiel auch gucken, ob's zu warm wird. Hardware-Temperature-Monitor. Pass mal auf, wir machen jetzt mal Folgendes. Ich stell jetzt mal runter auf 5 Minuten. Und jetzt gehen wir mal da hin und sagen Stress. Es geht rauf. Und wenn wir jetzt hier kurz warten. Wie gesagt, ich weiß gar nicht, ob der automatisch refresht, ehrlich gesagt. Oder in welchem Intervall der collectet. Müssen wir mal schauen. Ah, Auto-Refresh, alle 5 Sekunden, easy. Jetzt warten wir mal, bis der refreshed hat, dass der die. Guck hier, guck, Temperatur geht schon hoch. So, und das coole daran ist, ich könnte mich jetzt ja auch benachrichtigen lassen, also ich könnte jetzt zum Beispiel sagen, okay, Hardware-Monitor. Wie macht man das jetzt eigentlich in so einem Graf? Ach nee, ich bin gar nicht eingeloggt, deswegen darf ich das nicht editieren. Ich logg mich mal kurz ein. Massive Passport, Leute, kommt hier nie drauf. Guck mal, CPU sehe ich jetzt zu 100%, ist rot und sonst was. Hardware-Stats, Hardware-Temperatur. Edit. So, und ich könnte jetzt auch sagen, Alert. Ah, okay, es funktioniert nicht. Wenn ich mich alerten lassen will, dann muss ich ein eigenes Dashboard nur für die eine Sache basteln. Was auch immer. Atmen, atmen, ja. Schwert zu erraten. Das ist Prometheus unter, unten drunter. Guck, man sieht, jetzt geht direkt die Temperatur hoch. Das Dashboard ist Grafana. Ich hab da überhaupt nichts gemacht, das ist das Standard Grafana-Dashboard. Man muss das nicht von Hand aus. Nein, nein, nein, ich hab das doch nicht von Hand gemacht, dieses Dashboard. Glaubt ihr doch nicht selbst. Hier, gehst dahin, kopierst dir die ID, gehst da rein, das ist total easy, guck mal. Du gehst in deinen Dashboards rein. Discard. Du sagst Import, suchst dir hier von der offiziellen Seite, von der offiziellen Seite suchst du dir ein schönes Dashboard raus, was du haben willst. Kannst hier durchsuchen, was du für Dashboards haben willst. Kannst du auch, sag mal, sortieren nach Reviews, Ratings, sonst was. Und dann sagst du, oh, dieses Dashboard gefällt mir, weil das 6 Millionen Downloads hat. Und dann kopierst du dir die ID von dem Dashboard, sagst Import vom Grafana, Load, dann sagt der, ah, das gibt's schon. Dann denkst du dir einen anderen Namen aus, CACW, Dashboard, weil ich hab's ja schon mal importiert. Dann changst es irgendwo anders hin, ist eigentlich egal. Und sagst die Data Source, sagst Import. Fertig. Schon hast du das Dashboard da. Das war's. Also mehr musst du nicht machen. Meinst du, glaubst du nicht selbst, dass ich das selbst angelegt hab? Also Dashboards, die ich selbst angelegt hab, sehen dann zum Beispiel so aus. Das ist für meine Heizung. Das ist auch schon ein bisschen größer. Das brauchst auch schon so eine halbe Stunde für. Aber das andere würd ich im Leben nicht anlegen. Ansonsten sehen meine Dashboards so aus. Zertifikatablauf für meine Domains. Dann hab ich Plattenplatz im Wohnzimmer. Also nix Großartiges, ja. Das CACW-Dashboard wird übrigens jetzt wieder gelöscht. Also. Wunderbar. Wisst ihr, jetzt haben wir sogar richtig schickes, richtig schickes Monitoring von unserem Raspberry Pi. Und ihr werdet sehen, CPU-Temperatur, seht ihr das hier? Wir gehen mal hoch auf 15 Minuten. Seitdem ich das hier gestartet hab, ging die CPU-Temperatur ordentlich hoch. Und sowas kann man dann halt überwachen. Na zum Beispiel könnte ich jetzt auch sagen, ja okay, mal mal, Alerting Rules. Das geht echt nur, das geht echt nur über Dashboards. Okay, das sackt ein bisschen. Das ist jetzt einer der Nachteile, die ich gefunden hab von diesem komischen Alerting im Grafana. Die sagen ja selbst, das ist dafür nicht gemacht. Natürlich doof, wenn ich hier nix hinzufügen kann. Ja, beispielsweise bei den Zertifikaten hab ich das so gemacht. Ich weiß nicht, ob ich das zeigen kann. Es können sein, dass ich irgendwelche Credentials drinstehen hab. Also ich lass das mal kurz. Da hab ich eingestellt, es soll mich benachrichtigen, hat einen gewissen Wert. Was jetzt aber anscheinend in diesem Dashboard so nicht funktioniert. Weil es ein Template Dashboard ist. Bald wegen. Kann ich mitleben. Exquisite. Wie kommt Grafana dann an die ganzen Daten? Das ist über Prometheus. Wie gesagt, ich hab ja vorhin hier den, ich hab vorhin den Nodexporter installiert. Der sorgt dafür, dass man vom Raspberry Pi diese ganzen Infos abrufen kann. Und dann hab ich hier auf einer anderen Kiste hab ich Prometheus, der einsammelt, installiert. Und Grafana greift direkt auf die Prometheus-Datenbank zu. Und für die Heizung im Keller hab ich den Prometheus-Exporter programmiert, der quasi das gleiche macht, aber halt nur für Heizungsdaten. Ist gar nicht so kompliziert. Deswegen find ich persönlich auch mit die angenehmste Monitoringlösung für daheim. Weil du daheim jetzt nicht so wahnsinnig viel brauchst und vieles halt einfach geht. Ja. Ist doch wirklich ganz praktisch. Jetzt sehen wir hier sogar die Temperatur von dem Ding und man sieht ja auch direkt hier, flupp, jetzt sind wir aber 62 Grad. Und hier, da ging's los hier, hier waren wir aber 948 und hier zack auf 64 hoch. Ja und zum Beispiel, wenn man jetzt die, wenn jetzt mein Raspberry Pi abkacken würde oder hängen bleiben würde oder so und ich guck mir das hier an und stell fest, ah Moment, der hatte irgendwie 85 Grad CPU bevor er abgekackt ist, dann weiß ich, dann stimmt irgendwas nicht. Ne, mit Audio-Settings hab ich in der Lidung keine Ahnung. Raspberry Pi 2 hat relativ wenig Use-Cases, weil der kein WLAN hat. Also weniger Use-Cases. Du kannst einen Unify-Controller machen, wie ich hier mache, wenn du die Sachen damit kontrollieren willst. P-Hole ist ziemlicher Müll, finde ich, weil mittlerweile Twitch und YouTube nicht mehr ordentlich geblockt werden. YouTube geht glaube ich mittlerweile halbwegs wieder, aber Twitch geht gar nicht. Ja und ansonsten, ehrlich gesagt, das was man halt braucht. Also es hat wenig Sinn zu sagen, hey ich hab eine Raspberry Pi, um ihn zu haben und ich suche jetzt was, was ich da drauf machen will. Umgedreht ist sinnvoller, wenn man sagt, ok, das und das stört mich, ich hol mir jetzt eine Raspberry Pi für so ein Projekt, was für jeden was bringt. Schwierig, ja. Weißt du aber, ich kann dir einen Tipp geben. Geh mal auf das self-hosted Reddit und lese dir da mal ein bisschen was durch, weil da gibt es ganz viele Tipps, was die Leute daheim bei sich so laufen haben und was sich auch für eine Raspberry Pi ereignet. Ziemlich beliebtes, beliebtes Subreddit. Die Musik ist ja übelst, übelst epische, epische Bowser Musik für Grafana Grafen. Du hast da ein SSL-Zert, das ab 25.05. abgelaufen ist. Echt? Wo habe ich das? Ah, was? Weil, du wirst extern überhaupt nichts finden. Da läuft ja extern nichts. Wie heißt das Subreddit self-hosted? Ja, gut, ok. Also Raspberry Pi wird gemonitort, wunderbar. Wir haben noch genug Platz, RAM ist auch noch da, CPU ist busy, weil wir gerade Benchmark laufen lassen. So, und das hier, Leute, das ist der aktuelle Raspberry Pi, der mein UniFi macht und mein Kamerazeug und der ist halt regelmäßig am Limit. Swap ist aus irgendwelchen Gründen schon volle Pulle und RAM ist gerade 65%, aber unter unglücklichen Umständen ist das halt auch mal voll und out of memory. Ist das internal only resolvable? Ne, das ist schon ein ganz normal registrierter Domain, aber da läuft halt nichts drauf. Also sprich, kann sie nicht aufnehmen, weil kein DNS sich dafür zuständig fühlt. Ah, zum Beispiel intern löst Wiki auf, auf eine IP, aber wenn du sagst, mal den Google DNS fragst, dann sagt er halt, ja, ne, Cloudflare ist dafür zuständig, aber ich habe keine IP dafür. Was sagst du zu KFC-Konsole? Den Sinn habe ich nicht verstanden. KFC hat eine Konsole mit Hähnchenwärmer, weiß ich, ob ihr das schon gesehen habt. Da gibt es, was kostet der Kram? Da gibt es eine Konsole mit Hähnchenwärmer. Warum auch immer. Man weiß es nicht so genau. So, welche OS ist das auf dem Raspberry Pi? Das ist ganz normal das Raspberry-Pi-OS, wie es mittlerweile heißt. 2 und 3, spit, fertig, aus. Da ist auch noch ein PC drunter, was anderes hätte mich auch gewundert. Natürlich ist da ein PC drunter. Unter der Xbox und der PS4 ist ja auch noch ein PC drunter, mit dem Unterschied, dass da kein normales PC-Zeug draufläuft, dass du da extra Sachen dafür machen musst. Dass für KFC jemand sagt, wir entwickeln für die KFC-Konsole gezielt Spiele, ist ja auch topisch. Ganz normaler PC drunter, das wundert mich auch nicht. Okay Leute, ein Sony ist nicht Power-PC. Es war, Xbox 360 und PS3 waren beides CPUs von IBM. Und die Xbox war mehr oder weniger ein 1-1-Power-PC. Die PS3 war was neu zusammengestricktes. Und ab der PS4 und der Xbox, fragt mich nicht, Xbox X, Xbox S, Xbox One, habt ihr Xbox One? Ist es alles ganz normal, x86-AMD-CPUs. Tja Leute, funktioniert alles, wunderbar. Unify-Controller scheint prinzipiell zu laufen, kann ich jetzt im Stream nicht großartig weiter ausprobieren. Oh, der Load geht ganz schön ruff hier. Und, Monitoring von Pi funktioniert, Temperatur ist gut. Ich würde sagen, erfolgreicher Stream, aber es ist nicht. Oh, Leute, ohne Scheiß, das Gehäuse ist ordentlich warm mittlerweile schon. Guck mal, das hat jetzt 65 Grad, das Gehäuse. Lul, weh. Guckt euch das mal an, wie warm der ganze Scheiß mittlerweile wird. Von wegen 20 Grad kühler. Meint ihr, das könnte daran liegen, dass unten die SSD dran hängt? Nee, oder? Ich mein, unten hängt die SSD dran, aber daran wird es ja wohl kaum liegen. Die Wärme müsste ja nach oben raus. Es wird schon ordentlich warm, Leute. Es wird schon ordentlich warm. Also, noch, man kann noch den Finger drauf lassen, aber wenn es noch ein bisschen wärmer wird, ehrlich gesagt, muss man den Finger runter nehmen. Also, man kann ihn gerade, ah, es wird schon ziemlich heiß. Also, man kann ihn gerade noch drauf lassen. Captain Steve von der neuen abonniert Twitch Prime, danke schön für den Sub. Plus 1 IQ für den Chat wieder. Jetzt müssen wir mal gucken, ob man ein Ei drauf purzeln kann. Kein Wunder bei 100% CPU Last. Guck mal, man sieht direkt, wenn ich die Hand drauf mache, dann wird es noch wärmer. Das wird schon ordentlich warm, das Teil, ne? Aber da, wenn man da pustet, es geht bestimmt schnell runter. Wartet mal, probieren wir aus jetzt. Na ja. Ja, geht direkt runter. Ich meine, nicht, dass es irgendwas funktioniert. Nee, nicht, dass es irgendwas bringen würde, wenn ich puste auf das Gehäuse, aber es funktioniert. Und das Coole ist, das sieht man sogar hier im Graph, guckt mal. Letzten, letzten 5 Minuten, hier. So, und flupp, bisschen runter. Pustchamp. Nein, ich baue da nix dran. Das bleibt genauso wie es ist, weil ich finde ehrlich gesagt die Kombi ziemlich nice. Die SSD ist hier unten dran gepappt mit den Pads. Der Pie steht da oben drauf, bleibt relativ kühl in dem Gehäuse, optimal für meinen UniFi-Controller und zum Video aufnehmen. Meine Video-Software mache ich da jetzt nicht drauf, weil da müsste ich die Kameras hinzufügen oder leake ich wieder was und das will ich ja nicht. Sieht richtig cool aus, ne? Und die SSD, ihr seht es hier, guck mal, die ist auch ordentlich... Okay, jetzt habe ich es abgedrückt. Das war jetzt nicht so dumm-Champ, dass ich die abgemacht habe, aber Low-Brain-Champ war das gerade, dass ich die jetzt abgemacht habe, aber... Ja, okay, hält wieder. Also diese Wärme da mit Pads sind ich so wirklich für ab und wieder dran machen gedacht, aber das wird ja eh einfach so, wie es ist, in der Ecke stehen. So, Chat, ich gucke jetzt nochmal kurz in Chat, ob ich irgendwelche Sachen übersehen habe hier. Was machst du mit dem UniFi-Controller? Ja, die Access Points konfigurieren. Ups, Musik ist aus. Die Access Points konfigurieren mache ich damit. Was sonst, ne? Ich habe aktuell zwei Access Points, ich will mir aber noch einen dritten kaufen für den Hof und ist ganz praktisch. Ehrlich gesagt, ich finde es ein bisschen doof, dass man überhaupt einen UniFi-Controller braucht. Mir persönlich wäre es lieber, man könnte die Dinge einfach über das Web-Interface konfigurieren, geht ja nur so zum Teil über Kommandozeile oder mit der Smartphone-App, aber ich denke mal, spätestens ab drei Access Points ist es wirklich nützlich. Bei zwei hält es sich ehrlich gesagt noch in Grenzen. Die könnte ich auch schnell von Hand konfigurieren. Hast du immer noch den Edge-Switch? Ja, ich habe einen ES16XG, korrekt. Das Ding habe ich seit drei Jahren oder so. Exzellent-Switch. Wobei ich mir mittlerweile einen Mikrotik-Switch kaufen wolle. Würde, würde, nicht wolle, wolle, würde anstatt dem. Oder diesen Switch, den letztens einer im Stream gezeigt hat, diesen Aura-Irgendwas-Ding, was ich noch nie gehört habe vorher. Der sah auch nice aus. Wie heißt das Tool für die Text-Tabs? Meinst du das hier? Das hier? Das ist TMUX. Oder wie auch immer man das ausspricht. Eines der besten Features daran ist, guck mal, ich kann so eine Session in den Hintergrund schieben, mich ausloggen, mich wieder einloggen und an der gleichen Stelle mit der Session weitermachen, ohne dass die Sachen abkacken da drin. Ist eigentlich fast das Beste da dran. So, also wie gesagt, von Audio-Settings-Unterlienung habe ich keinen Plan. Das hatten wir schon, das ganz normale Offizielle. Ich habe das dann nicht richtig verstanden. Die kannst du nur intern auflösen. Der Cloudflare-DNSs sind dafür zuständig, dass ich extern Zertifikate ausstellen kann. Wenn man überhaupt keinen Plan von der Materie hat, wie schafft man einen guten Einstieg? Kein Plan von was? Also was willst du machen? Ich mein, Materie ist jetzt groß und viel. Kommt darauf an, was. Oder in welche Richtung, besser gesagt. Achso, du hast ein Geschenk bekommen. Sprich, du hast den Raspberry Pi übrig und willst einfach mal irgendwie ein bisschen was damit machen, wenn du dafür keinen Use-Case hast. Es ist auch schwierig. Raspberry Pi 2 hat halt keinen W-Lan. Ohne W-Lan ist halt alles ein bisschen eingeschränkt, ehrlich gesagt. Komm nicht auf die Ideen, Media Center zu basteln. Dafür sind die Raspberry Pies absolut Schrott. Hier werden dir viele Leute was anderes sagen, aber meiner Meinung nach sind die Dinger Schrott, leckt ohne Ende und ist lahm as fuck. Für den Nas sind die Dinger auch nicht gut, selbst der neueste nicht. Tja, gut, vielleicht willst du wirklich mal ein bisschen Sachen daheim laufen lassen. Ja, vielleicht willst du dir mal einen Wiki selber hosten oder irgendeinen Filesync selber hosten oder was auch immer. Tja, was lohnt sich so großartig? Schwier zu sagen. Okay, das restliche sein hatte ich glaube ich schon alle beantwortet, oder? Ja. Ich hätte damals mit... Das Interface ist alles laggy wie Sau. Das ist das eigentliche Problem. Gehen tut alles, aber das Interface, also kann man, wenn eine Kodi oder so drauf hat, das ist laggy as fuck, wenn du das mal vergleichst mit einem Android TV oder sowas. Ja und nee, also die Edge Switche sind darauf ausgelegt, dass du sie selbst per Commando-Zeile und Web-Interface konfigurieren kannst, aber es gibt mittlerweile was, es gibt mittlerweile sowas in der Richtung so als Übersichts-Dashboard auch für Edge-Switche und es hat auch eine beschränkte Interoperabilität mit UniFi. Ja, kann man mal, wie gesagt, ist halt nicht frei was man braucht. Okay, tja Leute, also ich würde sagen, war mal erfolgreich für heute, funktioniert wunderbar, das Ding bleibt bei 65 Grad irgendwie hängen, sieht man ja auch hier, letzten 5 Minuten, um die 65 Grad warm, hier 30 Minuten, hier haben wir eingeschaltet, hier habe ich mal gepustet ein bisschen, jetzt geht es wieder hoch, wunderbar, gefällt mir, erfolgreicher Stream würde ich sagen. Mit Materie meine ich beispielsweise, was du beruflich machst oder hier im Stream, na okay, das was ich beruflich mache hat mit dem was ich im Stream mache überhaupt nichts zu tun, also nur ganz am Rande und wenn du einstiegst so ein bisschen, ja gut, ich kann jetzt natürlich sagen, was ein guter Einstieg für das was ich hier im Stream mache. Ehrlich gesagt, eine Idee haben was man machen will, weil ansonsten ist es echt schwierig so ins blaue rein. Wenn du zum Beispiel sagst, ja ich möchte zum Beispiel keine Ahnung, Fernsehaufnahmen auf dem zentralen Server haben, okay, oder wenn du sagst, ja ich will, keine Ahnung, Dateien sünden zwischen Tablets und meinem Desktop, mit irgendwas, was ich selbst hoste, okay, das ergibt auch Sinn, oder ich will irgendwie einen Kalender hosten, was auch immer, ja kann man da was zu sagen, aber so generell ins breite ist echt schwierig da jetzt was zu sagen. Du kannst dir Self-hosted, Reddit und Data Horder Reddit ein bisschen durchlesen, da kommt man ganz gut manchmal auf Ideen, aber ansonsten ist gar nicht so einfach. Unified Dream Machine Pro Meinung, haben wir uns ganz am Anfang vom Stream schonmal angeguckt und ich konnte dazu bloß sagen, dass ich für mich da halt keinen Anwendungszweck hab und ja, ich jetzt auch nicht genau wüsste wozu ich das mir kaufen sollte. Was ich nicht verstanden habe ist, ob es PoE hat für die Access Points. Ist der Pi echt zu schwach für eine NAS? An Nextcloud kannst du machen, aber Nextcloud finde ich halt persönlich an sich ein ziemliches kack Produkt. Das einzige was man von Nextcloud verwenden kann ist CalDAV und eventuell den File Sync Desktop Client. Die anderen Sachen sind so halb fertig. Also die ganzen Nextcloud Apps, die sind ja, wenn man jetzt hochkommt zu 80% so wie man sie haben will. Wenn ich mir dran denke, dass die Notizen App jahrelang nicht durchsuchbar war, solche Dinger. Also alles außer wirklich die absoluten Basic Funktionalitäten von Nextcloud sind meiner Meinung nach nicht verwendbar und als NAS, doch, du kannst das als NAS verwenden. Das funktioniert. Ich meine, du hast ja immerhin, hast du ja mittlerweile zwei, weiß nicht ob man das sieht, du hast ja zwei USB 3 Anschlüsse und ein Gigabit Netzwerk, was ja erstmal schon ein riesen Fortschritt ist zu den restlichen Raspberry, zu den älteren Raspberry, alter ist das warm mittlerweile, zu den älteren Raspberry Pi's, also wie es wackelt, als Emulator für alte Games, ja das funktioniert, bis zu einem gewissen, in einem gewissen Rahmen, ja. Du kannst das schon als NAS verwenden. Das Problem ist also warum ich, warum es sich meiner Meinung nach nicht als NAS eignet, ist folgendes. Erstens, du hast an sich eh ein bisschen wenig IO Anschlüsse, das ist das erste, was prinzipiell bei den Raspberry Pi's ein bisschen problematisch ist und die haben, also wir reden jetzt mal nur vom Raspberry Pi 4, die älteren sind noch weniger geeignet und die haben beim Raspberry Pi 4 an dem gespart, was am allerwichtigsten für einen NAS ist oder mit am wichtigsten für einen NAS ist, die haben in der CPU, die haben sich keine Krypto Extensions geleistet, also sprich, die haben zwar einen halbwegs aktuellen, in der halbwegs aktuellen Abend-CPU drinne, aber du hast keine Krypto Extensions, das heißt, du kannst deine Festplatten im NAS nicht verschlüsseln, was für mich eines der wichtigsten Funktionen ist, weil ich will im Zweifelsfall eine Festplatte nehmen können, einfach in den Müll schmeißen, ohne dass ich mir Gedanken machen muss. Oder auch mal in den Rucksack schmeißen und irgendwo mit hinnehmen oder sowas, ja, unabhängig davon, was drauf ist oder sonst was und du kannst um Raspberry Pi nichts ordentlich betreiben mit Verschlüsselung, weil es dann lahm as fuck ist. Also mit lahm meine ich, du hast dann 30 MB die Sekunde oder so, also du hast dann so USB 2 Geschwindigkeit und das Ding ist brummt auf Anschlag, ja, deswegen eignet es sich meiner Meinung nach nicht für einen NAS. Also die zwei Sachen, du hast wenig I.O. Ports und du hast keine Krypto Extensions und das in Kombination ist halt Müll. Dein alter Office-PC hat mit Sicherheit auch am Vielfaches mehr Leistung als Raspberry Pi, die Dinger sind ja nicht so, es ist ja nicht so, als wäre es in Raspberry Pi so ultra krass der Bringer, was Leistung angeht, ne, also die sind okay für das, was sie machen, aber jeder olle Desktop-PC steckt so ein Teil easy in die Tasche, ne. Ein billiger, wir haben es glaube ich mal ausprobiert, mit ich glaube irgendeinem Suspension oder so war das. Mein billigstes x86-Port, wirklich low end, was 80 Euro kosten mit CPU drauf, war glaube ich 6 mal schneller oder 7, 6, 7 oder 8 mal schneller bei diesem Standard Suspension-Markt als bei Raspberry Pi. Zwei war glaube ich schon ein Dreier, kein Vierer. Also das ist jetzt nicht so, als die Dinger ultra schnell, nur das meiste, reicht natürlich. Guck mal, wir sind jetzt schon bei, seht ihr, seht ihr, wie viel wir jetzt auf einmal verbrauchen, wir sind jetzt bei 6,8, das heißt, es ist wirklich ein Unterschied, wie warm das Ding wird, umso wärmer das Teilen wird, ah gut, jetzt ist auch eine SSD dran, stimmt, dürfen wir nicht vergessen, aber umso wärmer das Teilen wird, umso mehr verbraucht er. Ich mach mal die CPU aus bitte, ich wollte mich ein bisschen nicht übertreiben. Also nein, nein, ich mach nicht die CPU aus, ich mach die volle Auslastung der CPU mal aus, mal gucken, wie schnell er runter geht. Er war jetzt bei max 67 Grad und 60, ah ok, Hälschengrenzen. Tja Leute, also weiß nicht, ob es noch irgendwelche Fragen oder sonst was gibt im Chat, weil ansonsten würde ich sagen, der Stream war erfolgreich, easy, hat funktioniert alles. Dann wache ich mich jetzt nämlich gleich vom Acker, weil ich hab Hunger. Peppofett. Ja, macht er, ab 85 Grad, 80 oder 85 Grad, drosselt er sich runter. Gucken wir mal, ob der Friseur streamt. Der Frasier, da ist er, Leute, der originale, echte, der echte Frasier. Spielt Pokemon Clone Game, ist übrigens richtig nice, das Game, das hab ich mir auch gekauft, das macht mega Bock. Monster Sanctuary kann ich echt nur empfehlen, ist eins der besten so Indie Games des Jahres. Richtig top, also mega poggers Game. Ist nicht pay to win. Hat überhaupt keine, hat überhaupt keinerlei, keinerlei DLCs oder sonst was. Ok Leute, wir raiden jetzt den Fabian. Wenn ich meine Tastatur schaffe auf Deutsch umzustellen. Raid, I freezee. Wir raiden jetzt den Fabian und ich gebe was essen. War richtig nice das Stream, ja schön, wenn es euch gefallen hat. Wir sehen uns im nächsten Stream, bis dann, machts gut, see you.", "segments": [{"id": 1, "start": 0.0, "end": 6.5600000000000005, "text": "Poggers am Start. Kann man das alles starten?"}, {"id": 2, "start": 13.12, "end": 21.36, "text": "So, exquisite. Alles klar. Gut. Ja, funktioniert alles. Perfekt."}, {"id": 3, "start": 21.36, "end": 30.12, "text": "Also, heute, heute machen wir mal so eine Mischung aus, äh, wir basteln was und wir machen Linux"}, {"id": 4, "start": 30.12, "end": 36.12, "text": "mäßig was. Wird ja mal wieder Zeit. Bisschen Informatik, kurz. Stream."}, {"id": 5, "start": 36.12, "end": 45.68, "text": "Erstmal warten wir, bis Twitch kapiert hat, dass der Stream on ist. Gebaidet aktuell. Ich"}, {"id": 6, "start": 45.68, "end": 52.08, "text": "sehe in der Vorschau noch nichts. Ah, jetzt, jetzt. Okay, jetzt ist alles da. Nice. You got"}, {"id": 7, "start": 52.08, "end": 71.84, "text": "gebaided. Übrigens, Chet, ihr werdet gar nicht gebaided. Ich habe euch gebaided, indem ihr"}, {"id": 8, "start": 71.84, "end": 78.92, "text": "dachtet, ihr werdet gebaided, aber ihr wurdet gar nicht gebaided. Konnte man mir folgen so"}, {"id": 9, "start": 78.92, "end": 85.04, "text": "weit, ja. Weil es ist genau das, was im Titel steht. Kommt jetzt dran. Zwar, ich habe wieder"}, {"id": 10, "start": 85.04, "end": 102.64, "text": "meine Poggers-Cam an. Wackelt das? Wackelt das? Äh, da wackelt nichts, oder? Hallo, Chet?"}, {"id": 11, "start": 102.64, "end": 120.36, "text": "Finger-Reveal. Und noch andere Finger-Reveal. Ja, die Katz, die Katz hat wieder zugeschlagen,"}, {"id": 12, "start": 120.36, "end": 133.04, "text": "guck mal. Die Katz, die Katz wollte es wieder wissen, äh. Ja, wortwörtlich. Ja, zugeschlagen,"}, {"id": 13, "start": 133.04, "end": 147.56, "text": "ja. Mach schon mal die Linux-VM an. Also folgendes, Leute. Ist die Kamera falsch rum? Nee, passt."}, {"id": 14, "start": 147.56, "end": 153.96, "text": "Die Kamera ist so rum, wie sie immer ist, ne. Unten ist oben hier, das haben wir schon immer"}, {"id": 15, "start": 153.96, "end": 170.24, "text": "so. Wenn man es rumdreht, ist es glaube ich noch verwirrender. Ich setze euch im Prinzip"}, {"id": 16, "start": 170.24, "end": 178.96, "text": "gegenüber, wenn man so will, ja. Also ihr sitzt, ihr sitzt da quasi, wo die Kamera ist."}, {"id": 17, "start": 178.96, "end": 185.92, "text": "In euch wäre geiler, ich weiß nicht, ob das so geil wäre. Sicherlich Geschmacksfrage."}, {"id": 18, "start": 185.92, "end": 197.84, "text": "So, Poggers. Poggers-VM an. So, also. Ja, das machen wir alles mal zu. Ich glaube, Weihnachten"}, {"id": 19, "start": 197.84, "end": 202.12, "text": "ist jetzt vorbei. Ich habe übrigens nix eingebaut zum Refreshen von diesem Hintergrundbild."}, {"id": 20, "start": 202.12, "end": 210.4, "text": "Ich muss neu starten, dass sich das Hintergrundbild. Refresht. Natürlich auch super ist. Seit wann"}, {"id": 21, "start": 210.4, "end": 215.48, "text": "ist eigentlich dieses Nvidia-Ding so scharf drauf, auch in einer VM ein Overlay anzuzeigen?"}, {"id": 22, "start": 215.48, "end": 228.6, "text": "Das wollte es sonst nie. Und ich kann es ja nicht mal abschalten, doch. Alter. Please Nvidia,"}, {"id": 23, "start": 228.6, "end": 237.64, "text": "lass mich doch einfach das Overlay ausschalten. Overlay off, off, okay. Jetzt, gut. Jawoll."}, {"id": 24, "start": 237.64, "end": 249.92, "text": "So, Firefox starten. Firefox starten. Ja. Vermitteln starten. Ja. Alles klar. Exzellent. Okay."}, {"id": 25, "start": 249.92, "end": 255.52, "text": "Also, ich habe mir folgendes Gehäuse gekauft, Schatt. Ich zeige es euch mal kurz. Also,"}, {"id": 26, "start": 255.52, "end": 259.92, "text": "man sieht hier schon das ganze, ganze Bass-Los-Grams. Aber wir müssen vorher noch was anderes machen."}, {"id": 27, "start": 259.92, "end": 263.48, "text": "Und zwar doch ein bisschen wackelt der... Oh, ich habe den Tisch nicht richtig. Oh Mist."}, {"id": 28, "start": 263.48, "end": 270.28, "text": "Ich sehe es gerade. Der Tisch steht nicht fest. Ah. Mr. Wacklors. Das ist aber schlecht."}, {"id": 29, "start": 270.28, "end": 275.8, "text": "Weil wenn ich... Dann darf ich nicht am Tisch wackeln. Auch gut. Ähm. Weil ihr seht, der"}, {"id": 30, "start": 275.8, "end": 282.08, "text": "Tisch an sich ist echt massiv. Das ist so ein Tisch. Den kann man... Also man sieht es"}, {"id": 31, "start": 282.08, "end": 287.0, "text": "natürlich, ich habe da die blaue Unterlage heute nicht drauf, ne. Aber das ist so was,"}, {"id": 32, "start": 287.0, "end": 293.68, "text": "wo du normalerweise in der Küche kannst du Fleisch drauf mit einem Beil zerteilen und"}, {"id": 33, "start": 293.68, "end": 297.92, "text": "sowas. Bam. Also, das ist wirklich massiv das Teil. Das hatte ich doch hinten im Garten"}, {"id": 34, "start": 297.92, "end": 301.88, "text": "stehen. Das Problem ist nur, ich habe es jetzt auf der einen Seite auf dem Teppich und auf"}, {"id": 35, "start": 301.88, "end": 306.6, "text": "der anderen Seite nicht auf dem Teppich. Das heißt, gerade wenn ich jetzt hier hinten drauf"}, {"id": 36, "start": 306.6, "end": 312.2, "text": "drücke, dann wackelt es ein bisschen. Schlecht. Da darf ich halt einfach nicht am Tisch wackeln."}, {"id": 37, "start": 312.2, "end": 318.24, "text": "Excellent. Äh. Danke für die Subs. 15 Monate haben wir hier. Den haben wir da am Start."}, {"id": 38, "start": 318.24, "end": 331.24, "text": "Ich mache mal kurz den Chat auf. Leute, ich bin verwirrt. Wo läuft denn gerade die Musik?"}, {"id": 39, "start": 331.24, "end": 342.16, "text": "Wo läuft denn gerade die Musik? Es ist kein Browser mit Musik offen. Ihr hört die Musik"}, {"id": 40, "start": 342.16, "end": 363.2, "text": "aber auch, oder? Und OBS läuft auch nicht? Hä? Ah, OBS ist hier. OBS hat es minimiert,"}, {"id": 41, "start": 363.2, "end": 376.6, "text": "okay. Aber wo ist die, wo ist der Browser mit der Musik? Habe ich den aus Versehen verschoben"}, {"id": 42, "start": 376.6, "end": 386.92, "text": "hinter die, ach hier, hinter der VM. 0W, Alter, da soll erstmal einer drauf kommen. Okay,"}, {"id": 43, "start": 386.92, "end": 393.52, "text": "jetzt, jetzt habe ich es kapiert. Alles klar. Gut. Genau, jetzt kann ich mal den Chat aufmachen."}, {"id": 44, "start": 393.52, "end": 399.8, "text": "Ja, danke schön für die Subs, Leute. Also, den haben wir hier am Start. Clocks HD, 15"}, {"id": 45, "start": 399.8, "end": 407.48, "text": "Monate, das ist ja schon. Wo haben wir das? Hyper Subscription. Oh, die Musik ist übrigens"}, {"id": 46, "start": 407.48, "end": 415.8, "text": "viel zu laut, ne? Die Musik ist viel zu laut. Der Halo Soundtrack, der will es gerade wissen."}, {"id": 47, "start": 415.8, "end": 427.4, "text": "Okay, gut. So, dann haben wir den Clocks HD, 15 Monate, danke schön für den Sub. Und"}, {"id": 48, "start": 427.4, "end": 434.68, "text": "der Kommentator, auch 13 Monate, auch schon Hyper Subscription. Massive IQ Subscriptions,"}, {"id": 49, "start": 434.68, "end": 447.12, "text": "ich sehe es schon hier. Wahnsinn. Tja, was wir heute machen ist folgendes. Gehe mal kurz"}, {"id": 50, "start": 447.12, "end": 452.76, "text": "auf die Kamera. Also, ich habe mir den Raspberry Pi Gehäuse gekauft, ein 4er Raspberry Pi"}, {"id": 51, "start": 452.76, "end": 461.08, "text": "Gehäuse. Noch eins. Und zwar das da. Das ist nicht eins von den Bekannten. Die Bekannte"}, {"id": 52, "start": 461.08, "end": 466.6, "text": "ist ja einmal dieses FLIR Gehäuse und das Argon Case. So, ich halte es mal so hoch,"}, {"id": 53, "start": 466.6, "end": 471.8, "text": "dass man es ein bisschen besser sieht. Das ist ein IC-Box-Dings-Enclosure, das ist aber"}, {"id": 54, "start": 471.8, "end": 479.48, "text": "relativ günstig. Das kostet plus, glaube ich, 20 Euro. Und es kühlt angeblich den"}, {"id": 55, "start": 479.48, "end": 484.04, "text": "ganzen Raspberry Pi 4, weil ich habe nämlich ein Problem. Ja, Hände liegt, ich weiß."}, {"id": 56, "start": 484.04, "end": 488.08, "text": "Ich habe nämlich ein Problem. Ich habe hier für meinen UniFi Controller, also ich habe"}, {"id": 57, "start": 488.08, "end": 499.48, "text": "ja zwei, ich habe ja zwei und wahrscheinlich bald drei UniFi Access Points und dazu habe"}, {"id": 58, "start": 499.48, "end": 504.52, "text": "ich den Controller für die Steuerung von dieser ganzen Geschichte laufen auf dem Raspberry"}, {"id": 59, "start": 504.52, "end": 513.08, "text": "Pi. Dann haben wir letztens im Stream ein bisschen programmiert für die Kameraüberwachung"}, {"id": 60, "start": 513.08, "end": 519.4, "text": "und das ist jetzt mittlerweile so weit, dass man es benutzen kann. Leute, der Halo Soundtrack"}, {"id": 61, "start": 519.4, "end": 543.84, "text": "ist mir ein bisschen zu anstrengend gerade. Da kann ich das besser. Exzellent. Haha, Eis-Eier-Eier."}, {"id": 62, "start": 543.84, "end": 549.16, "text": "Das ist das Beste an Better Twitch TV. Twitch baut so ein Kram nicht ein. Guck mal sogar"}, {"id": 63, "start": 549.16, "end": 556.36, "text": "mein Chat unterstützt. Leute, welches E-Mode war letztens klein im Chat? Pains-Champ, Paws-Champ?"}, {"id": 64, "start": 556.36, "end": 559.92, "text": "Der Paws-Champ war klein. Lasst mal ausprobieren, Leute. Ist der Paws-Champ immer noch klein?"}, {"id": 65, "start": 559.92, "end": 567.04, "text": "Paws-Champ? Der Paws-Champ ist immer noch broken. Guck mal, der Paws-Champ ist kaputt."}, {"id": 66, "start": 567.04, "end": 588.36, "text": "Seht ihr das? Der Paws-Champ klitscht, Alter. Ah, yes. Ja, Mario Galaxy Musik Beste. Ja,"}, {"id": 67, "start": 588.36, "end": 594.08, "text": "komisch, dass das klitscht. Naja, kann man nix machen. Also, lasst mal überlegen, wo"}, {"id": 68, "start": 594.08, "end": 599.78, "text": "bin ich jetzt stehen geblieben. Genau. Also, ich habe ein Problem. Ich habe hier unten"}, {"id": 69, "start": 599.78, "end": 608.68, "text": "im Wohnzimmer, habe ich den Raspberry Pi 3 stehen. Der macht Unify. Ich kann euch jetzt"}, {"id": 70, "start": 608.68, "end": 612.08, "text": "kein Bild von meinem Access, von meiner Oberfläche zeigen, da leak ich wahrscheinlich zu viel."}, {"id": 71, "start": 612.08, "end": 617.76, "text": "Webfronten, hoffentlich kann... Oh, geil. Google Auto-Vervollstigung. Ja, das sieht"}, {"id": 72, "start": 617.76, "end": 622.12, "text": "dann so in der Richtung aus. Da kann man seine Access-Points mit verwalten. So, das ist das"}, {"id": 73, "start": 622.12, "end": 626.24, "text": "eine, was der Raspberry Pi macht. Und der macht auch gleichzeitig Frontend für meine"}, {"id": 74, "start": 626.24, "end": 636.72, "text": "Überwachungskameras. So, und... Und er hat noch einen Reverse-Proxy. Er hat noch für"}, {"id": 75, "start": 636.72, "end": 640.36, "text": "Zertifikate einen Proxy davor, aber man weiß ja noch, ob wir das heute machen. Die Sache"}, {"id": 76, "start": 640.36, "end": 647.16, "text": "ist nur die. Ich habe jetzt meine Kamera-Überwachungs-Software aufgebohrt und die macht ja jetzt nicht nur"}, {"id": 77, "start": 647.16, "end": 654.0, "text": "Anzeigen von den ganzen Kameras im Haus, sondern die macht ja jetzt mittlerweile auch Bewegungserkennung,"}, {"id": 78, "start": 654.0, "end": 659.32, "text": "Aufnahme und bis zu 11 Sekunden Buffer-Rückwärts-Aufnahme. Und ich habe jetzt das Problem, dass mir das"}, {"id": 79, "start": 659.32, "end": 665.4, "text": "Ganze ab und zu mal abkackt, so alle 2-3 Tage, weil der Speicher leer ist. Also, mir kackt"}, {"id": 80, "start": 665.4, "end": 671.16, "text": "dort nicht wirklich ab mit Out-of-Memory. Ist ein bisschen doof. Das Unify-Zeug braucht"}, {"id": 81, "start": 671.16, "end": 677.4, "text": "halt massig RAM. Das brauche ich mit 500 MB oder so. Und der Raspberry Pi 3 hat halt nur"}, {"id": 82, "start": 677.4, "end": 684.04, "text": "1G. Ist ein bisschen doof. So, und deswegen habe ich mir gedacht, warum nehme ich nicht"}, {"id": 83, "start": 684.04, "end": 689.88, "text": "einfach meinen Raspberry Pi 4, den ich hier schon die ganze Zeit rumliegen habe. Ich habe"}, {"id": 84, "start": 689.88, "end": 695.84, "text": "mal alles, was wir heute so brauchen, in die Box gepackt. Excellent Box. Nicht zu wechseln"}, {"id": 85, "start": 695.84, "end": 703.84, "text": "mit Icy Box. Mach mal kurz den Keks ein bisschen weg, dass man den noch sieht. Sieht man den"}, {"id": 86, "start": 703.84, "end": 708.88, "text": "noch? Excellent. So ist das nice. Also, guck mal, hier ist die Box. Ich mach das mal hier"}, {"id": 87, "start": 708.88, "end": 712.92, "text": "weg. Ich hoffe, dass man alles sieht. Ich muss mal kurz gucken, von wo bis wo man sieht."}, {"id": 88, "start": 712.92, "end": 720.04, "text": "Ich habe halt meine Unterlage ja nicht da. Von wo bis wo sieht man was? Hand ab hier."}, {"id": 89, "start": 720.04, "end": 726.0, "text": "Okay, das passt. Ich kann so die Hand drauflegen, als wenn ich hier hinhalte. Passt eigentlich"}, {"id": 90, "start": 726.0, "end": 734.16, "text": "ganz gut. Genau. Welche Version des Unify-Controllers fährst du? Das ist eine gute Frage. Wenn der"}, {"id": 91, "start": 734.16, "end": 738.96, "text": "6er in letzter Zeit rausgekommen ist, dann habe ich den noch nicht. Dann habe ich noch"}, {"id": 92, "start": 738.96, "end": 742.72, "text": "den 5er. Vielleicht installieren wir jetzt aber den 6er. Da kann ich nämlich bei der"}, {"id": 93, "start": 742.72, "end": 750.48, "text": "Gelegenheit gleich ausprobieren, ob der Import klappt vom Alten. Weil dann habe ich ja noch"}, {"id": 94, "start": 750.48, "end": 756.24, "text": "beide laufen. Das ist eigentlich eine gute Gelegenheit, das jetzt mal zu machen. Oder"}, {"id": 95, "start": 756.24, "end": 764.2, "text": "was sagt ihr? Taugt der 6er mittlerweile schon? Ich weiß es nicht. Ich habe es mir noch nicht"}, {"id": 96, "start": 764.2, "end": 769.48, "text": "angeguckt. Zumindest habe ich alles in die Box reingemacht, was wir heute brauchen. Einmal"}, {"id": 97, "start": 769.48, "end": 773.52, "text": "brauchen wir den Raspberry Pi 4. Den habe ich ja schon eine Weile am Start. Den haben"}, {"id": 98, "start": 773.52, "end": 778.92, "text": "wir im Stream auch schon relativ oft mal verwendet. Das ist ein Netzteil. Ich glaube das ist sogar"}, {"id": 99, "start": 778.92, "end": 783.96, "text": "das offizielle Netzteil, was man dabei kriegt. Könnte das sein? Ist das das offizielle"}, {"id": 100, "start": 783.96, "end": 791.2, "text": "Pi-Netzteil? Es steht da meistens drauf. Ist es nicht. Ist egal. Ist alles made in China"}, {"id": 101, "start": 791.2, "end": 803.12, "text": "und ist halt so ein ganz normales 5V, 3A Netzteil, falls man das überhaupt erkennt hier. Kamera"}, {"id": 102, "start": 803.12, "end": 816.6, "text": "please. Hau mal den Finger. Guck doch das mal an. Und Kartoss. Und das ist dabei. Das"}, {"id": 103, "start": 816.6, "end": 827.24, "text": "ist auch empfehlenswert für den Raspberry Pi 4, weil der ist ein bisschen wärmer und"}, {"id": 104, "start": 827.24, "end": 831.92, "text": "ein bisschen stromhungriger als die Teile davor. Deswegen habe ich hier oben auch mal"}, {"id": 105, "start": 831.92, "end": 838.76, "text": "so ein Messgerät dran, wo man dann gucken kann, was das Ding so verbraucht. Habe ich"}, {"id": 106, "start": 838.76, "end": 843.76, "text": "mir noch nie angeguckt. Keine Ahnung. Der alte braucht ja kaum was. Wie gesagt, was hältst"}, {"id": 107, "start": 843.76, "end": 848.4, "text": "du von UDM Pro? Ist das die Treemachine? Habe ich mir noch nicht angeguckt. Ich weiß,"}, {"id": 108, "start": 848.4, "end": 853.2, "text": "ich weiß nur, weil ich ein paar Videos zugesehen habe. Das ist Unified Treemachine. Kein Schimmer."}, {"id": 109, "start": 853.2, "end": 870.8, "text": "Ups. O.K.S. Durcheinander mit den ganzen Desktops. Habe ich noch nicht näher angeguckt. Ja,"}, {"id": 110, "start": 870.8, "end": 875.52, "text": "ich glaube nicht, dass ich da großartige Verwendung für... Ach, dieses Ding. Der Eimer war das."}, {"id": 111, "start": 875.52, "end": 882.4, "text": "Genau. War das früher nicht in Switchbau? Nee, der Eimer ist das. Genau. Also da sehe"}, {"id": 112, "start": 882.4, "end": 889.64, "text": "ich jetzt aktuell nicht so die Wahnsinnsverwendung für. Hat das wenigstens PoE? Kennt sich"}, {"id": 113, "start": 889.64, "end": 893.52, "text": "jemand mit Regex aus? Pause du mal. Pause du mal den Regex. Fangen wir uns jetzt an"}, {"id": 114, "start": 893.52, "end": 907.28, "text": "zusammen. Hat das PoE? Ohne PoE ist natürlich ein bisschen doof, ne? Also ich meine, PoE..."}, {"id": 115, "start": 907.28, "end": 924.12, "text": "Guck mal die PoE an. Was für PSU hast du genau, das was bei diesem Raspberry Pi Set drin war?"}, {"id": 116, "start": 924.12, "end": 929.52, "text": "Guck mal PoE an. PoE? Ey mein, Verwendungszweck dafür habe ich nicht wirklich, ne? Guck mir"}, {"id": 117, "start": 929.52, "end": 934.04, "text": "das jetzt nur an, weil der Chat mich gefragt hat. Ah, das Ding meinte ich. Das habe ich"}, {"id": 118, "start": 934.04, "end": 941.12, "text": "schon mal in einem Video gesehen, ja. Ja, das ist die Rackbauform. Hat die PoE? Ach,"}, {"id": 119, "start": 941.12, "end": 950.04, "text": "was... Juck mich nicht, lass es auf dem Raspberry Pi 4 laufen. Oh, der Regex. Der Regex ist"}, {"id": 120, "start": 950.04, "end": 953.72, "text": "Big Brain Neko Rock. Also das müssen wir uns jetzt mal kurz zusammen angucken. Der Neko"}, {"id": 121, "start": 953.72, "end": 959.8, "text": "Rock fragt, was ist das für ein Regex? Und jetzt mache ich mal Big... Fege? Ich habe"}, {"id": 122, "start": 959.8, "end": 971.0, "text": "das richtig ausgesprochen. Ähm... Ihh! Ah! Hilfe! Es ist auch Kobold. Ah, weg, weg, weg."}, {"id": 123, "start": 971.0, "end": 976.0, "text": "Und diese kacke Schriftart, Alter. Moment, Moment, Moment. Bevor wir weitermachen. Font."}, {"id": 124, "start": 976.0, "end": 986.6, "text": "Ah, yes. Okay, okay, okay. Es kommt schon ein bisschen besser. Ich muss Kobold wegmachen."}, {"id": 125, "start": 986.6, "end": 993.96, "text": "Kobold, gehst sofort. Okay, also diesen Regex. Kann man Highlighting machen für Regex? Gibt"}, {"id": 126, "start": 993.96, "end": 1004.24, "text": "es Regex Highlighter? Oh. Da kann ich nämlich erklären, was der Regex macht. Glaube zumindest"}, {"id": 127, "start": 1004.24, "end": 1017.4, "text": "zu verstehen, was er macht. Irgendwie so. First Code Regex Highlighter. Regex 101, genau."}, {"id": 128, "start": 1017.4, "end": 1033.6, "text": "Also, bye. Excellent. Also ich kanns mal versuchen zu erklären, was der Regex macht. Ach so,"}, {"id": 129, "start": 1033.6, "end": 1038.92, "text": "Netzteil in deinem Main PC. Netzteil in meinem Main PC ist, ich glaube, irgendein Be Quiet"}, {"id": 130, "start": 1038.92, "end": 1044.32, "text": "oder ein Sea Sonic. Ich glaube ein Be Quiet. Irgendein 600 Watt Be Quiet Ding. Keine Ahnung."}, {"id": 131, "start": 1044.32, "end": 1051.92, "text": "Hilt FPS. Dankeschön für den Sub. Exquisite Subscription. Also, ich vermute mal, dass"}, {"id": 132, "start": 1051.92, "end": 1058.56, "text": "dieser Regex folgendes macht. Start. So, dann ist wichtig diese Gruppe. Das ist eine Back"}, {"id": 133, "start": 1058.56, "end": 1067.0, "text": "Tracks und das ist eine Matching Crew. Also, ist das Back Track? Da bin ich mir jetzt nicht"}, {"id": 134, "start": 1067.0, "end": 1074.56, "text": "ganz sicher, ob das Rückwärtssuche ist. Das kommt auf die Regex Implementierung an. Oder"}, {"id": 135, "start": 1074.56, "end": 1086.0, "text": "ist es startet nicht? Da bin ich mir jetzt nicht ganz sicher. Gucken wir mal. Das ist"}, {"id": 136, "start": 1086.0, "end": 1094.28, "text": "auf jeden Fall ein bisschen advanced. Also, ist ein Negative Look Ahead, was jetzt irgendwie"}, {"id": 137, "start": 1094.28, "end": 1102.96, "text": "schon bescheuert klingt. Der guckt, ob das da vorkommt. Genau. Also, Big Brain Regex."}, {"id": 138, "start": 1102.96, "end": 1117.12, "text": "Das sind Hoffmann 128. Ich bin auch lost. Ok. Also. Ok. Ok. Verstehe. Verstehe. Also,"}, {"id": 139, "start": 1117.12, "end": 1126.8, "text": "das Ding stellt sicher, dass es nicht matcht. Also sprich, dass es nicht matcht. Dass es"}, {"id": 140, "start": 1126.8, "end": 1140.0, "text": "nicht any Characters matcht. Except Line Terminators. Also, ok, das leuchtet mir jetzt auch nicht"}, {"id": 141, "start": 1140.0, "end": 1144.84, "text": "so. Ich meine, das erkenne ich. Das ist eine Back Reference. Das bedeutet, dass was hier"}, {"id": 142, "start": 1144.84, "end": 1156.08, "text": "gematched wird, dieses Zeichen, was hier gematched wird, das setzt er da wieder ein. Das ist"}, {"id": 143, "start": 1156.08, "end": 1164.68, "text": "echt Massive Big Brain Regex, das Ding. Nielsen FPS 5 Monate. Dankeschön. Da bräuchte mir"}, {"id": 144, "start": 1164.68, "end": 1170.88, "text": "jetzt mal irgendeinen Input Text, um das so ein bisschen. Also, der guckt wahrscheinlich,"}, {"id": 145, "start": 1170.88, "end": 1177.24, "text": "ob es New Line ist. Das ist non-creedy match. Das ist glaube ich ein bisschen umständlich"}, {"id": 146, "start": 1177.24, "end": 1184.84, "text": "gemacht. Das könnte man wahrscheinlich einfacher machen. Also, der guckt, ob es nicht non-creedy"}, {"id": 147, "start": 1184.84, "end": 1191.98, "text": "auf alles matcht. What the fuck. Ähm, außer Line Terminators. Also, könnte das hier eigentlich"}, {"id": 148, "start": 1191.98, "end": 1199.32, "text": "die Umschreibung sein von, man guckt, ob es ein New Line ist. Der matcht das erste Zeichen"}, {"id": 149, "start": 1199.32, "end": 1208.84, "text": "nach einem New Line oder irgendwie sowas. Und dann beliebe ich viele non-creedy bis zu"}, {"id": 150, "start": 1208.84, "end": 1213.32, "text": "dem Zeichen, was er als erstes nach dem New Line gematched hat. Könnte das sowas in"}, {"id": 151, "start": 1213.32, "end": 1225.52, "text": "der Richtung sein. Das soll New Line matchen. Und das ist das erste Zeichen nach dem New"}, {"id": 152, "start": 1225.52, "end": 1232.48, "text": "Line. Gefolgt von beliebig vielen Zeichen, maximal bis zu dem, was er als erstes gematched"}, {"id": 153, "start": 1232.48, "end": 1236.72, "text": "hat, nochmal. Also sprich, es kommt ein New Line, dann kommt irgendein Zeichen und dann"}, {"id": 154, "start": 1236.72, "end": 1244.64, "text": "guckt er von diesem Zeichen so viel, bis das Zeichen nochmal kommt. Äh, das ist übrigens"}, {"id": 155, "start": 1244.64, "end": 1251.04, "text": "Fail. So macht man das nicht, by the way. Das hier ist eine Gruppe aus Zeichen. Das"}, {"id": 156, "start": 1251.04, "end": 1259.12, "text": "ist nicht etwa das String Festo eher. Der guckt, ob F oder E oder S und da ist eigentlich"}, {"id": 157, "start": 1259.12, "end": 1268.0, "text": "ein und und oder dazwischen. Also sprich, das da würde sowohl matchen auf Festo eher"}, {"id": 158, "start": 1268.0, "end": 1275.96, "text": "als auch auf A, S, O, F oder sogar auf F, F, F, F würde es matchen. Also das macht"}, {"id": 159, "start": 1275.96, "end": 1279.32, "text": "man übrigens so nicht. Falls, falls das die Intention dahinter ist, bin ich mir jetzt"}, {"id": 160, "start": 1279.32, "end": 1286.56, "text": "nicht sicher. Und das dann beliebe ich oft hintereinander bis zum Zeilenende. So würde"}, {"id": 161, "start": 1286.56, "end": 1291.48, "text": "ich diesen Rage jetzt mal interpretieren. Ob das jetzt stimmt, sei mal dahingestellt."}, {"id": 162, "start": 1291.48, "end": 1309.72, "text": "Das würde sogar auf A ja ja matchen, ne. Das würde aber auf ja alles matchen, was"}, {"id": 163, "start": 1309.72, "end": 1315.76, "text": "man sich irgendwie zusammensetzen kann auf diesen Zeichen. So, so viel zum Thema Rage"}, {"id": 164, "start": 1315.76, "end": 1319.24, "text": "im Text. Nils, ich hoffe, das hat dir geholfen. Mehr kann ich dir jetzt grad nicht dazu sagen."}, {"id": 165, "start": 1319.24, "end": 1324.84, "text": "Also, weiter im Text. Wo sind wir denn stehen geblieben? Kommen wir mal zum eigentlichen"}, {"id": 166, "start": 1324.84, "end": 1332.12, "text": "Thema. Genau, ich will meinen Unify Controller austauschen, Raspberry Pi zu Raspberry Pi"}, {"id": 167, "start": 1332.12, "end": 1338.32, "text": "4, weil da nicht nur mein Unify Controller drauf laufen soll, sondern auch mein Kameratool"}, {"id": 168, "start": 1338.32, "end": 1346.0, "text": "und ein Proxy mit Zertifikaten drauf. Ach ne, der Nils hat es gar nicht gefragt, der"}, {"id": 169, "start": 1346.0, "end": 1352.96, "text": "Niko hat es gefragt. Jetzt hab ich es verwechselt. Ja, also, das ist auch ein kack Ragex. Aber"}, {"id": 170, "start": 1352.96, "end": 1358.48, "text": "ich glaube, der Ragex ist falsch. Wie gesagt, ich glaube, der Ragex ist falsch. Ich glaube"}, {"id": 171, "start": 1358.48, "end": 1362.04, "text": "nicht, dass man wirklich eine Zeichengruppe haben will, sondern ich glaube, man möchte"}, {"id": 172, "start": 1362.04, "end": 1369.08, "text": "wirklich exakt den String matchen, was dann im Prinzip das da wäre. Eventuell willst"}, {"id": 173, "start": 1369.08, "end": 1377.12, "text": "du noch Case Insensitive davor machen. Allerdings musstest du das dann in Klammern setzen,"}, {"id": 174, "start": 1377.12, "end": 1393.2, "text": "damit das Sternchen wieder funktioniert. Ja. Schau den Link oben an. Ach, das ist nicht"}, {"id": 175, "start": 1393.2, "end": 1400.6, "text": "eine Challenge. Kreuzwort Rätsel Challenge, all okay. What the fuck? Ach, das ist das"}, {"id": 176, "start": 1400.6, "end": 1408.24, "text": "ist Ragex Kreuzwort Rätsel. Das habe ich auch mal früher ab und zu gemacht. Das ist"}, {"id": 177, "start": 1408.24, "end": 1412.88, "text": "wirklich Big Brain. Das ist wirklich Massive Brain. Brauchst du dafür, dass das funktioniert?"}, {"id": 178, "start": 1412.88, "end": 1417.44, "text": "Ich dachte, das wäre ein Ragex irgendwie aus einem Programm von dir. Ne, ne, dann"}, {"id": 179, "start": 1417.44, "end": 1424.24, "text": "ist klar, dann ist klar, dass das soll wirklich so sein. Das soll wirklich so sein. Das ist"}, {"id": 180, "start": 1424.24, "end": 1431.32, "text": "in dem Fall sogar richtig. Das ist ein R oder ein A oder ein Z, allerdings beliebigt oft"}, {"id": 181, "start": 1431.32, "end": 1434.28, "text": "hintereinander. Ne, das mache ich jetzt nicht. Ich mache jetzt keine Ragex Kreuzwort Rätsel,"}, {"id": 182, "start": 1434.28, "end": 1439.4, "text": "Leute. Das halte ich brainmäßig im Stream nicht aus. Wir kommen jetzt aber Dankeschön"}, {"id": 183, "start": 1439.4, "end": 1450.28, "text": "für die Hypersubscriptions ab, Neko Rock. So, also kommen wir zum eigentlichen Thema"}, {"id": 184, "start": 1450.28, "end": 1453.56, "text": "zurück. Wie gesagt, ich will mein Raspberry Pi austauschen durch den Raspberry Pi 4, weil"}, {"id": 185, "start": 1453.56, "end": 1461.24, "text": "mir der RAM ausgeht mit Unify, Proxy und einem Kameratool, was jetzt auch Bewegungserkennung"}, {"id": 186, "start": 1461.24, "end": 1472.4, "text": "macht. Und deswegen müssen wir das mal ausprobieren, weil ich habe zwar hier auf dem Raspberry"}, {"id": 187, "start": 1472.4, "end": 1477.08, "text": "Pi 4, ich drehe mich mal kurz um, ich habe hier jetzt zwar schon diese komischen Passivkühler"}, {"id": 188, "start": 1477.08, "end": 1489.96, "text": "da drauf. Ihr seht es ja da, diese kleinen Kühler. Und der wird aber trotzdem ziemlich"}, {"id": 189, "start": 1489.96, "end": 1500.44, "text": "warm. Deswegen habe ich mir jetzt so ein Gehäuse gekauft. Das hier. Und das Gehäuse"}, {"id": 190, "start": 1500.44, "end": 1505.52, "text": "ist, wie gesagt, ich habe mir das gekauft, weil es das eigentliche, hast du noch Delay"}, {"id": 191, "start": 1505.52, "end": 1528.16, "text": "im Stream drin? Ne, habe ich nicht. Kein Delay im Stream. Kein Delay. Kein Delay. So, und"}, {"id": 192, "start": 1528.16, "end": 1532.84, "text": "da habe ich mir dieses Gehäuse hier gekauft. Das einzige, was gerade lieferbar war. Wie"}, {"id": 193, "start": 1532.84, "end": 1535.68, "text": "gesagt, das ist nicht das allerbeliebteste Gehäuse. Ich mache mal kurz ein bisschen"}, {"id": 194, "start": 1535.68, "end": 1541.4, "text": "Platz hier. Das ist nicht das allerbeliebteste Raspberry Pi Gehäuse, aber es war lieferbar"}, {"id": 195, "start": 1541.4, "end": 1547.96, "text": "und es kühlt wohl, also es führt wohl die Wärme über das Gehäuse ab. Also sprich,"}, {"id": 196, "start": 1547.96, "end": 1558.2, "text": "das ist ähnlich wie zum Beispiel dieses Flir Case. Nur mit dem Unterschied, dass es"}, {"id": 197, "start": 1558.2, "end": 1562.92, "text": "ein bisschen billiger ist oder ungefähr genauso viel kostet. Ein Moment. Billiger ist und"}, {"id": 198, "start": 1562.92, "end": 1575.32, "text": "lieferbar ist. Die anderen Sachen sind alle ganze Ecke teurer oder mit Lüfter. So. Und"}, {"id": 199, "start": 1575.32, "end": 1578.6, "text": "deswegen will ich das Ganze jetzt mal ausprobieren. Aber bevor wir das mit dem Gehäuse machen,"}, {"id": 200, "start": 1578.6, "end": 1581.44, "text": "müssen wir natürlich erstmal ausprobieren, wie warm wird denn das Ding eigentlich unter"}, {"id": 201, "start": 1581.44, "end": 1588.32, "text": "Last? Das probieren wir jetzt mal schnell aus. Ich glaube, wir haben das schon mal ausprobiert"}, {"id": 202, "start": 1588.32, "end": 1601.24, "text": "im Stream und das wurde quasi bis ans Runtertakten warm. Also sprich, das wurde so warm, dass"}, {"id": 203, "start": 1601.24, "end": 1610.44, "text": "der Raspberry Pi die Leistung gar nicht komplett ausfahren konnte. Also das wird wirklich warm."}, {"id": 204, "start": 1610.44, "end": 1615.96, "text": "Das heißt, das ist das erste, was wir machen. Bevor wir das ins Gehäuse machen, gucken wir"}, {"id": 205, "start": 1615.96, "end": 1619.16, "text": "mal, wie warm das Ding wirklich wird. Dazu schließe ich es jetzt einfach hier neben."}, {"id": 206, "start": 1619.16, "end": 1623.56, "text": "Dazu müssen wir jetzt die SD-Karte mal flashen. Ich zeige euch noch mal die anderen Sachen,"}, {"id": 207, "start": 1623.56, "end": 1627.96, "text": "die ich in der Kiste drin habe, weil ich habe ja gesagt, der soll auch Aufnahmen von den"}, {"id": 208, "start": 1627.96, "end": 1641.52, "text": "Kameras machen und so. Also ich habe noch eine Sandisk-SSD mit 240G. Das reicht. Ich"}, {"id": 209, "start": 1641.52, "end": 1645.84, "text": "nehme ja nur auf, wenn Motion Detection ist. Besser als eine komische Magnetfestplatte"}, {"id": 210, "start": 1645.84, "end": 1658.8, "text": "da dran zu hängen. Und ich habe noch einen USB auf SATA. Da können wir das dann anschließen."}, {"id": 211, "start": 1658.8, "end": 1663.52, "text": "So und jetzt das Beste, das sind übrigens die restlichen Kleinteile fürs Gehäuse. Und"}, {"id": 212, "start": 1663.52, "end": 1679.52, "text": "das Beste, was wir unbedingt brauchen ist die gute Samsung Pro Endurance Mikro-SD-Karte."}, {"id": 213, "start": 1679.52, "end": 1689.72, "text": "Beste. Die allerbeste. Und ich kann euch nur empfehlen, wenn euch schon mal ein Raspberry"}, {"id": 214, "start": 1689.72, "end": 1694.76, "text": "Pi verrecktes oder eine SD-Karte verrecktes oder so, kauft euch die Dinger. Die sind nicht"}, {"id": 215, "start": 1694.76, "end": 1701.72, "text": "wahnsinnig teuer. Die sind teuer als normale SD-Karten. Aber die halten wirklich gut. Das"}, {"id": 216, "start": 1701.72, "end": 1705.16, "text": "heißt das erste, was wir jetzt machen ist ein aktuelles Raspbian runterladen, was hier"}, {"id": 217, "start": 1705.16, "end": 1712.84, "text": "übrigens nicht mehr Raspbian heißt, sondern Raspberry Pi OS oder so. Vielleicht nehmen"}, {"id": 218, "start": 1712.84, "end": 1719.08, "text": "wir auch gleich das 64-bit, wenn es das mittlerweile in default gibt. NilsFPS fragt, ich wollte"}, {"id": 219, "start": 1719.08, "end": 1726.2, "text": "mir einen ESP32 NodeMCU kaufen, um den mit WLED zu verwenden. Muss ich da auf Aliexpress"}, {"id": 220, "start": 1726.2, "end": 1729.72, "text": "aufpassen, welchen ESP oder kann ich einfach den billigsten nehmen? Du kannst den der"}, {"id": 221, "start": 1729.72, "end": 1736.04, "text": "regelnden billigsten nehmen, musst aber mal gucken, ob du da jetzt wirklich Aliexpress"}, {"id": 222, "start": 1736.04, "end": 1739.44, "text": "und warten willst oder ob es dich auch bei Amazon tut, weil der Kram ist ja auch in Deutschland"}, {"id": 223, "start": 1739.44, "end": 1753.2, "text": "nicht teuer. Eigentlich nur für den Zapp 08MAX07. Wenn du NodeMCU nimmst, dann kriegst"}, {"id": 224, "start": 1753.2, "end": 1755.96, "text": "der eh immer mehr oder weniger das gleiche, auch wenn es da ein paar Nachbauten davon"}, {"id": 225, "start": 1755.96, "end": 1762.72, "text": "gibt. Du könntest dir auch überlegen, ob du lieber einen ESP32 nimmst, das ist zwar"}, {"id": 226, "start": 1762.72, "end": 1767.08, "text": "der Unterschied ein bisschen teurer und für WLED nicht unbedingt notwendig, eigentlich"}, {"id": 227, "start": 1767.08, "end": 1770.88, "text": "gesagt vollkommen egal, aber wenn du einfach was anderes machen willst, ich baste lieber"}, {"id": 228, "start": 1770.88, "end": 1778.48, "text": "mit dem ESP32 als mit dem ESP266. Aber du kannst dir auch bei Amazon welche kaufen,"}, {"id": 229, "start": 1778.48, "end": 1782.08, "text": "der Kram ist ja jetzt so ultra teuer, das gibt es sicherlich noch günstiger auch hier"}, {"id": 230, "start": 1782.08, "end": 1791.4, "text": "bei Amazon. Gut, das ist kein NodeMCU, das ist ein D1 Mini, den finde ich eigentlich"}, {"id": 231, "start": 1791.4, "end": 1800.68, "text": "gesagt noch sogar praktischer für WLED. Auf Aliexpress ist es ein bisschen billiger,"}, {"id": 232, "start": 1800.68, "end": 1805.6, "text": "das stimmt schon, muss man überlegen. Also wie gesagt, NodeMCU kannst du wenig verkehrt"}, {"id": 233, "start": 1805.6, "end": 1811.2, "text": "machen. Ich finde die hier auch nicht schlecht, weil die kleiner sind. Kann man mehrere WLED"}, {"id": 234, "start": 1811.2, "end": 1819.32, "text": "Instanzen sünken? Ja, kann man. Du kannst quasi dein ganzes Haus miteinander sünken,"}, {"id": 235, "start": 1819.32, "end": 1832.56, "text": "wenn du WLED verwendest. Nice, sehr gut. Home Assistant Beste. Habe ich mittlerweile"}, {"id": 236, "start": 1832.56, "end": 1839.0, "text": "auch mal ganzen Kram drinne. So also, wo gibt es den Download? Download vor Ubuntu? Was"}, {"id": 237, "start": 1839.0, "end": 1844.12, "text": "möchten die... Sag mal, warum machen die eigentlich ihre Download-Seite immer anders? Können"}, {"id": 238, "start": 1844.12, "end": 1851.12, "text": "wir nicht einfach mal ganz normal den Download giffen? So, Raspberry Pi OS Lite wollen wir"}, {"id": 239, "start": 1851.12, "end": 1858.48, "text": "haben. Inkline. Kann man eigentlich, weiß das jemand von euch, ist eigentlich 64-Bit"}, {"id": 240, "start": 1858.48, "end": 1875.72, "text": "mittlerweile Default beim Raspberry Pi 4 oder nicht? Also sprich, ist das jetzt ein 64-Bit,"}, {"id": 241, "start": 1875.72, "end": 1890.16, "text": "was ich da kriege? Ist das jetzt ein 64-Bit? Ich habe schon eine Weile nichts mehr heruntergeladen."}, {"id": 242, "start": 1890.16, "end": 1916.6, "text": "Beta. Ehrlich gesagt ist mir das vollkommen egal. Doch, doch, der Pi 4 läuft ohne Probleme"}, {"id": 243, "start": 1916.6, "end": 1926.16, "text": "mit 32-Bit. Zur Release gab es ja sogar nur 32-Bit. Das dennoch, wenn du kannst es mit"}, {"id": 244, "start": 1926.16, "end": 1930.88, "text": "Hue machen, du bist aber halt, das ist halt der Unterschied, du kannst es immer mit fertigen"}, {"id": 245, "start": 1930.88, "end": 1934.64, "text": "Lösungen machen, aber du bist halt auf Githai und Verderben dem Hersteller ausgeliefert."}, {"id": 246, "start": 1934.64, "end": 1938.16, "text": "Wenn du da keine Probleme mit hast und zufrieden bist, was der Hersteller liefert, kannst du"}, {"id": 247, "start": 1938.16, "end": 1958.88, "text": "das machen. Keine Ahnung wie ich da sonst danach suchen soll, Images. Ist das jetzt offiziell?"}, {"id": 248, "start": 1958.88, "end": 1972.64, "text": "Arm 64 ist das letzte vom 28.05.? Ah, Raspberry Lite Arm 64. 28.08.? Hä? Ich bin verwirrt."}, {"id": 249, "start": 1972.64, "end": 2000.68, "text": "Ich will einfach, ich will einfach. Ist das jetzt schon raus oder nicht? Okay, was sagt"}, {"id": 250, "start": 2000.68, "end": 2021.16, "text": "man Wikipedia? 32-Bit. Okay. 64. Okay, 64-Bit ist Beta. Das nehmen wir nicht, dann nehmen"}, {"id": 251, "start": 2021.16, "end": 2027.28, "text": "wir das normale, alles gut. Gut, dann flashen wir das Ganze jetzt mal schnell. Mal kurz,"}, {"id": 252, "start": 2027.28, "end": 2033.0, "text": "hab ich jetzt eigentlich, hab ich es eigentlich dome geloadet jetzt? Buster, da ist es. Exzellent."}, {"id": 253, "start": 2033.0, "end": 2047.32, "text": "Ich mach mal einen SD-Karten-Reader ran und dann flashen wir das Ganze mal. Hat den SD-Karten-Reader"}, {"id": 254, "start": 2047.32, "end": 2057.52, "text": "jetzt erkannt? Transient, jawoll. Edge Shore. Flashchamp machen wir jetzt. Genau, so sieht"}, {"id": 255, "start": 2057.52, "end": 2064.84, "text": "es aus. Flashchamp. Flash vom File. Downloads. Wo haben wir es denn hier? Ah, da haben wir"}, {"id": 256, "start": 2064.84, "end": 2074.52, "text": "schon, wir haben es schon öfters mal runtergeladen. Select Target. 64G, jawoll, passt. Select."}, {"id": 257, "start": 2074.52, "end": 2087.8, "text": "Bam. Guck mal kurz, Chat, während das so vor sich hinflasht, da ich nichts übersehen"}, {"id": 258, "start": 2087.8, "end": 2095.44, "text": "hab. Aber Philips Hue hat sich nicht beliebt gemacht, um vielleicht das Thema nochmal"}, {"id": 259, "start": 2095.44, "end": 2101.0, "text": "aufzugreifen. Ich hab letztens ein Video geguckt, dass die beispielsweise alte Bridges,"}, {"id": 260, "start": 2101.0, "end": 2105.04, "text": "ich will nicht sagen kaputt geflasht haben, aber teilweise useless gefirmware updatet"}, {"id": 261, "start": 2105.04, "end": 2109.84, "text": "haben und sowas. Ich kann es aus erster Hand nicht berichten, ich hab keine. Ich verlasse"}, {"id": 262, "start": 2109.84, "end": 2114.44, "text": "mich da mal rein auf YouTube-Videos, die ich geguckt hab. Aber das ist ja mittlerweile"}, {"id": 263, "start": 2114.44, "end": 2118.28, "text": "gängige Praxis. Guckt euch mal Apple und alte iPhones an, die immer langsamer werden."}, {"id": 264, "start": 2118.28, "end": 2135.28, "text": "ABAP Stream. Ist ABAP nicht das Cobalt von SAP? Dazu kann ich nur sagen, das muss echt"}, {"id": 265, "start": 2135.28, "end": 2141.36, "text": "nicht sein. Äh, wäre es eigentlich möglich eine SSD an einen Raspberry Pi mit einem"}, {"id": 266, "start": 2141.36, "end": 2144.92, "text": "Adapter anzuschließen, um das OS auf die SSD zu machen? Ja, kein Problem, geht mittlerweile."}, {"id": 267, "start": 2144.92, "end": 2149.2, "text": "Haben wir sogar im Stream schon gemacht, kein Problem, funktioniert. Es war eine Zeit lang"}, {"id": 268, "start": 2149.2, "end": 2154.48, "text": "Beta für den Raspberry Pi 4, mit dem Raspberry Pi 3 geht es schon lange. Für den Raspberry"}, {"id": 269, "start": 2154.48, "end": 2159.76, "text": "Pi 4 war das eine Zeit lang Beta, aber mittlerweile ist es live, also man kann von SSD booten."}, {"id": 270, "start": 2159.76, "end": 2165.0, "text": "Aber ich will nicht von SSD booten, ich will ja mehr oder weniger einfach mein altes Raspberry"}, {"id": 271, "start": 2165.0, "end": 2171.32, "text": "Pi 3, da Zeug da umziehen. Ich mach auf die SSD komplett Videos, vielleicht Logs noch"}, {"id": 272, "start": 2171.32, "end": 2177.92, "text": "drauf, aber komplett die Videoaufnahmen. Also nicht für Gameplay oder so, sondern halt"}, {"id": 273, "start": 2177.92, "end": 2194.36, "text": "die Kamera Videoaufnahmen. So. Willst du wirklich eine SSD opfern, ja? Ich hab genug SSDs. Machst"}, {"id": 274, "start": 2194.36, "end": 2198.0, "text": "du mal ein Stream, wo du ein Spiel programmierst? Ich hab von Spieleprogrammierung keinen Plan."}, {"id": 275, "start": 2198.0, "end": 2215.92, "text": "Felix Spitzer, keine Ahnung, was mit AliExpress ist, aber so wie ich die Chinesen kenne, scheißen"}, {"id": 276, "start": 2215.92, "end": 2230.12, "text": "die auf alles und liefern weiter aus. Aber keine Ahnung, hab ich gar nicht mitgekriegt."}, {"id": 277, "start": 2230.12, "end": 2235.12, "text": "Max wie lernt man am besten programmieren? Okay, dazu, letztens hatte einer eine richtig"}, {"id": 278, "start": 2235.12, "end": 2241.56, "text": "gute Idee. Letztens hatte einer, ich glaub der Patrick sogar, eine richtig gute Idee"}, {"id": 279, "start": 2241.56, "end": 2247.84, "text": "gehabt im Discord, und zwar wir könnten mal eine Seite basteln im Stream für Programmiereinsteiger,"}, {"id": 280, "start": 2247.84, "end": 2253.6, "text": "wo man auswählen kann, auf welchem Betriebssystem ist man, was will man machen, welche Vorkenntnisse"}, {"id": 281, "start": 2253.6, "end": 2259.16, "text": "hat man, und da schlägt es einem vor, welche Programmiersprache ich empfehlen würde, beziehungsweise"}, {"id": 282, "start": 2259.16, "end": 2262.68, "text": "mit was ich einsteigen würde. Das sollten wir echt mal machen, das glaube ich eine gute"}, {"id": 283, "start": 2262.68, "end": 2267.72, "text": "Sache, ich bin mir gar nicht sicher, ob es sowas überhaupt schon gibt. Also, am besten"}, {"id": 284, "start": 2267.72, "end": 2273.88, "text": "ist, du überlegst dir, was du machen willst. Und wenn du weißt, was du machen willst, in"}, {"id": 285, "start": 2273.88, "end": 2277.92, "text": "welche Richtung du was machen willst, dann kannst du dir auch was überlegen, wie du"}, {"id": 286, "start": 2277.92, "end": 2283.16, "text": "anfängst. Wenn du wirklich gar keine Ahnung hast, also wenn du weder weißt, ob du was"}, {"id": 287, "start": 2283.16, "end": 2286.96, "text": "Raspberry-Pi-Controller-mäßiges machen willst, ob du Desktop-Anwendungen machen willst, ob"}, {"id": 288, "start": 2286.96, "end": 2289.76, "text": "du Web-Anwendungen machen willst, also wenn du gar nichts weißt, wenn du einfach nur"}, {"id": 289, "start": 2289.76, "end": 2295.0, "text": "ein bisschen basteln willst, ein bisschen rantasten willst, dann finde ich ist das"}, {"id": 290, "start": 2295.0, "end": 2300.36, "text": "beste, was man heutzutage machen kann, JavaScript, HTML, CSS, weil dann sieht man direkt, was"}, {"id": 291, "start": 2300.36, "end": 2305.0, "text": "passiert. Und die Basics lernt man auch mit JavaScript, man kann sich über JavaScript"}, {"id": 292, "start": 2305.0, "end": 2309.64, "text": "viel streiten, wenn der Tag lang ist, aber da sieht man wenigstens, was passiert. Ja,"}, {"id": 293, "start": 2309.64, "end": 2314.48, "text": "es gibt jede Menge anderen Programmiersprachen, die auch toll zum Einstieg sind, aber was"}, {"id": 294, "start": 2314.48, "end": 2320.68, "text": "hast du denn von so einem peinsten Kommando-Zeilen-Tool? Das ist so unimpressive irgendwie. Das heißt,"}, {"id": 295, "start": 2320.68, "end": 2324.24, "text": "die meisten Leute glaube ich fahren am besten damit, wenn sie einfach mit JavaScript und"}, {"id": 296, "start": 2324.24, "end": 2333.04, "text": "CSS und HTML anfangen, weil dann siehst du direkt, was. Ja, das ist eh der Witz, ja,"}, {"id": 297, "start": 2333.04, "end": 2337.48, "text": "also ganz im Ernst, letztens wo Amazon ausgefallen ist und die Leute teilweise nicht mal ihren"}, {"id": 298, "start": 2337.48, "end": 2343.56, "text": "Staubsauger mehr anschalten konnte, das war halt echt... Da denke ich mir auch immer,"}, {"id": 299, "start": 2343.56, "end": 2352.96, "text": "Pech, wenn man sich so abhängig von Cloud-Geschichten macht. Luke Vorringer, Twitch Prime, danke"}, {"id": 300, "start": 2352.96, "end": 2363.6, "text": "für den Sub. Exquisite Subscription, Massive IQ Increase für den Chat wieder. Du brauchst"}, {"id": 301, "start": 2363.6, "end": 2366.92, "text": "Cobalt für die Berufsschule, was ist denn das für eine Oldschool Berufsschule, die"}, {"id": 302, "start": 2366.92, "end": 2376.48, "text": "Cobalt macht, Alter? Ups. Ich sollte dieses Soundboard-Ding wegmachen, das ist nämlich"}, {"id": 303, "start": 2376.48, "end": 2383.48, "text": "direkt über... Also ich hab... Und das direkt übereinander, deswegen verdrücke ich mich"}, {"id": 304, "start": 2383.48, "end": 2401.08, "text": "öfters mal. Ja, Hue ist teuer, das kommt auch noch dabei. Das träumt beide, Alter."}, {"id": 305, "start": 2401.08, "end": 2410.96, "text": "Quinn 31, nee 131, oh, was hab ich nicht, Quinn, das ist wahrscheinlich G-Win, oder"}, {"id": 306, "start": 2410.96, "end": 2417.52, "text": "Gewinn, ach, was, keine Ahnung. Dankeschön für den Sub. 3 Monate, Massive Subscription."}, {"id": 307, "start": 2417.52, "end": 2424.2, "text": "Warum will Twitch jetzt von mir, dass ich meinen Sub teile? Musst du nicht. Das ist"}, {"id": 308, "start": 2424.2, "end": 2434.12, "text": "rein optional. Kannst du einfach sagen, Max, gib dir meinen Sub, Hals, Maul, ist auch okay."}, {"id": 309, "start": 2434.12, "end": 2442.76, "text": "So, Homer0818, exzellent, aber richtig exquisite, exzellent. Oh, das Scam Train ist am Start,"}, {"id": 310, "start": 2442.76, "end": 2449.52, "text": "Leute. Das Scam Train ist 490% komplett. Alter, ich bin ja schon, bin ja ganz aufgeregt."}, {"id": 311, "start": 2449.52, "end": 2459.36, "text": "Lasst euch scammen, alles subben. Any Primers, alle reinzahmen, Leute, jetzt. Lasst euch"}, {"id": 312, "start": 2459.36, "end": 2465.72, "text": "scammen von Twitch ne Runde. Morgen gibt's nix mehr, Leute. Ab morgen könnt ihr nicht"}, {"id": 313, "start": 2465.72, "end": 2471.28, "text": "mehr subben. Das geht, nee, nee, Moment, was war heute ist der 29. In drei Tagen könnt"}, {"id": 314, "start": 2471.28, "end": 2476.6, "text": "ihr nicht mehr subben. Nie wieder. Nie wieder. Ihr müsst jetzt subben, sonst gibt's nix"}, {"id": 315, "start": 2476.6, "end": 2486.36, "text": "mehr. So, als ist es, wie immer, funktioniert. Der Kilven hat Abos gegiftet. Fünf Stück,"}, {"id": 316, "start": 2486.36, "end": 2491.44, "text": "wenn ich das richtig sehe. Dankeschön, nice, Massive. Wie gesagt, heute ist der IQ Increase"}, {"id": 317, "start": 2491.44, "end": 2496.6, "text": "vom Chat ja wieder absolut next level. Wir hatten was gekriegt. Also Dankeschön, Kilven."}, {"id": 318, "start": 2496.6, "end": 2502.36, "text": "Fünf Stück. Asarex kriegt was, Dummi kriegt was. Dummi kenn ich, glaub ich, den kenn ich"}, {"id": 319, "start": 2502.36, "end": 2507.08, "text": "von Mashed aus dem Stream. Der kommt mir irgendwie bekannt vor vom Namen her. Canetus, Mark Pla"}, {"id": 320, "start": 2507.08, "end": 2514.76, "text": "und Ero X. Ero X ist auch öfters da. Der Eichler natürlich auch. Der hat zwar nix"}, {"id": 321, "start": 2514.76, "end": 2519.76, "text": "gekriegt, der ist ja schon sub, aber nur weil ich ihn grad seh. Huge, ja. Kofax hat auch"}, {"id": 322, "start": 2519.76, "end": 2537.24, "text": "vier Monate Subscribed. Dankeschön. Am ersten Januar ist Corona vorbei. Moment, per Definition"}, {"id": 323, "start": 2537.24, "end": 2543.96, "text": "war ja Corona schon vorbei, glaub, am 25. November oder so, weil bis dahin sollte das"}, {"id": 324, "start": 2543.96, "end": 2553.04, "text": "Ganze ja nur gehen. Alter, der Hype Train ist auf Stufe 4. Der levelt auf. Vielleicht"}, {"id": 325, "start": 2553.04, "end": 2563.24, "text": "braucht der noch ein Skilltree. Was machen das hier gerade? Was hab ich denn hier? Das"}, {"id": 326, "start": 2563.24, "end": 2567.64, "text": "hat ernsthaft ein Menü oben? Hab ich schon nie gesehen. Na gut, das ist eine Elektronenanwendung."}, {"id": 327, "start": 2567.64, "end": 2572.72, "text": "Elektronenanwendungen haben immer so Dinger. Herwing, sechs Monate. Dankeschön für den"}, {"id": 328, "start": 2572.72, "end": 2584.76, "text": "Sub. Jetzt geht's aber ab hier. Unic, auch am Start. Prime Subscription. So viel Big"}, {"id": 329, "start": 2584.76, "end": 2591.16, "text": "Prime Subs. Dankeschön, Unic. Leider kein Prime. Leute, ernsthaft. Ich find's super,"}, {"id": 330, "start": 2591.16, "end": 2600.6, "text": "wenn alle, also jeder, der da ist, find ich gut. Mit oder ohne Sub. Natürlich mit Sub"}, {"id": 331, "start": 2600.6, "end": 2610.12, "text": "mehr. Nein, Quatsch. Topics, vier Monate. Dankeschön für den Sub. Und jetzt kommt"}, {"id": 332, "start": 2610.12, "end": 2617.92, "text": "noch ClocksHD. Hat ein Abo verschenkt. Wer hat's denn gekriegt? Der Speed Rider. Exzellent."}, {"id": 333, "start": 2617.92, "end": 2627.72, "text": "Warum auch immer. Weiß nicht, warum ich da grad drauf gedrückt hab. Und jetzt, um"}, {"id": 334, "start": 2627.72, "end": 2635.64, "text": "den Chat noch mal zu schocken. So, also jetzt machen wir mal was Sinnvolles. Also wir haben"}, {"id": 335, "start": 2635.64, "end": 2644.36, "text": "geflasht. Wir haben geflasht. Es geht ja weiter. Es geht immer weiter mit Abos, ey. Meine"}, {"id": 336, "start": 2644.36, "end": 2649.72, "text": "Güte. Was haben wir jetzt hier am Start? SirLawrens hat Subscribed. Drei Monate hier."}, {"id": 337, "start": 2649.72, "end": 2656.92, "text": "Massive IQ, schon wieder. Dann haben wir noch, wen haben wir sonst noch? ClocksHD. Hat"}, {"id": 338, "start": 2656.92, "end": 2664.6, "text": "noch zwei Stufe 1 Abos verschenkt. Und zwar an Teddy Jupp. Oder Kup. Und an Phipps2. Phipps2"}, {"id": 339, "start": 2664.6, "end": 2668.96, "text": "ist auch auf der Star. Exquisite. Dankeschön für die ganzen Subs, Leute. Aber gut, sonst"}, {"id": 340, "start": 2668.96, "end": 2674.08, "text": "kommen wir ja zu gar nix mehr heute. Der Scam Train ist schon auf Stufe 5. Wie gesagt, der"}, {"id": 341, "start": 2674.08, "end": 2682.6, "text": "Scam Train. Final Level. Leute. Morgen gibt's nix mehr. Final Level. Es ist der Final Level"}, {"id": 342, "start": 2682.6, "end": 2689.36, "text": "ist jetzt. Ich hab noch nie gesehen, was passiert, wenn das Final Level auf 5 kommt. Oder gibt's"}, {"id": 343, "start": 2689.36, "end": 2695.08, "text": "Level 5 Emotes. Guckt euch das mal an. Level 5 Emotes sehen aber echt kacke aus. Die sehen"}, {"id": 344, "start": 2695.08, "end": 2704.96, "text": "aus, als hat die Twitch bei Fiverr beauftragt oder so. Oder? Also ich mein. Das können"}, {"id": 345, "start": 2704.96, "end": 2711.6, "text": "echt schon Fiverr sein. Die sehen nicht gut aus. Kost geht auf 40er-Lohn. Immer nice."}, {"id": 346, "start": 2711.6, "end": 2718.68, "text": "Ich glaub, langsam, langsam, langsam weiß ich, wie man das baitet. Speed Raider. 3 Euro."}, {"id": 347, "start": 2718.68, "end": 2735.52, "text": "Dankeschön. Exzellent. 100 Topics auch. Animierter Pogchamp. Wenn das 5 voll ist, geht die Prozentszahl"}, {"id": 348, "start": 2735.52, "end": 2751.72, "text": "einfach über 100 weiter. Haha, ganz bestimmt. Ja, das müssen wir ausprobieren. Ich glaube,"}, {"id": 349, "start": 2751.72, "end": 2755.6, "text": "der Eichler hat nicht recht. Nee, nee, das stimmt nicht, Leute. Ich glaub, ich dem Eichler"}, {"id": 350, "start": 2755.6, "end": 2762.6, "text": "nicht. Der Eichler erzählt bestimmt Mist. Nein, Chat, ich glaub euch das. Ich glaub's"}, {"id": 351, "start": 2762.6, "end": 2777.2, "text": "erst, wenn ich sehe. Ich hatt' auch die Level 5 Hype-Train, ja. Richtig unauffälliger"}, {"id": 352, "start": 2777.2, "end": 2789.36, "text": "Bait, ja. Okay, Leute. Warum ist der Hype-Train auf Level 5 und 300 Viewer? Der Hype-Train"}, {"id": 353, "start": 2789.36, "end": 2794.56, "text": "ist auf Level 5, weil grad mehrere Leute Subs gegiftet haben. 300 Viewer wahrscheinlich,"}, {"id": 354, "start": 2794.56, "end": 2802.12, "text": "weil die Leute Zeit haben. Gerade so zwischen Weihnachten und Silvester. Wie kann ich Virtualisierung"}, {"id": 355, "start": 2802.12, "end": 2807.0, "text": "einem Noob erklären, also was das heißt? Sag einfach, er hat noch einen zweiten PC"}, {"id": 356, "start": 2807.0, "end": 2813.84, "text": "in seinem PC. So doofs klingt, aber hey, wie willst du's einem richtigen Noob erklären?"}, {"id": 357, "start": 2813.84, "end": 2821.08, "text": "Sag, du hast einfach noch einen PC in seinem PC drin. Fertig. Das kapieren die dann. Tinkerbell"}, {"id": 358, "start": 2821.08, "end": 2829.28, "text": "3. Oh, Leute. In your face. Der Scam-Train ist voll. Wo sind wir? Tinkerbell 3. Dankeschön"}, {"id": 359, "start": 2829.28, "end": 2839.0, "text": "für den Sub. Prime-Subscription. Massive. Und M-Bits hat 5 Subs gegiftet und zwar Scheiterhaufen"}, {"id": 360, "start": 2839.0, "end": 2847.4, "text": "aufs Money gekriegt. Oh, das geht tatsächlich über... Was ist das für Scam-Mas, Alter? 125."}, {"id": 361, "start": 2847.4, "end": 2856.88, "text": "Lull. Richtiger Scam-Mas. So, also wir haben was gekriegt. Dankeschön für die 5 Subs"}, {"id": 362, "start": 2856.88, "end": 2866.56, "text": "auf jeden Fall schon. Scheiterhaufen auf die Fehos-Petin. Kuluna Florian. Der ist auch"}, {"id": 363, "start": 2866.56, "end": 2870.96, "text": "auf der Star. Der hat's auf jeden Fall auch verdient. Massive-Bits. Dankeschön, Dankeschön."}, {"id": 364, "start": 2870.96, "end": 2877.52, "text": "Alles, Leute. Wie kann ich mehrere Pies VPN-mäßig zu einem Server connecten? OpenVPN. Äh,"}, {"id": 365, "start": 2877.52, "end": 2887.0, "text": "nee. Ja, also OpenVPN geht auch, aber neben das hier. Im WireGuard ist eine Ecke einfacher"}, {"id": 366, "start": 2887.0, "end": 2893.92, "text": "als OpenVPN. Ab jetzt Full-Stream-Streamer auf Twitch. Leute, ich muss euch mal was verraten."}, {"id": 367, "start": 2893.92, "end": 2902.8, "text": "Ich, ähm, hab jetzt ja Urlaub gehabt. Seit... Seit wann hatte ich denn Urlaub? Seit... Oh,"}, {"id": 368, "start": 2902.8, "end": 2908.52, "text": "ich hab ja noch Urlaub. Ähm, ich glaub seit... Seit hier so... Also ich hab jetzt seit über"}, {"id": 369, "start": 2908.52, "end": 2914.36, "text": "ne Monat Urlaub und ich hab mir jetzt im Dezember ein bisschen Gedanken zugemacht, ne? Und"}, {"id": 370, "start": 2914.36, "end": 2918.8, "text": "zwar hab ich mir überlegt, ich geh ja aktuell nur noch 4 Tage die Woche arbeiten, das wisst"}, {"id": 371, "start": 2918.8, "end": 2925.4, "text": "ihr ja. Und ich hab mir überlegt, ob ich jetzt... Ich mein, geldmäßig hab ich das nicht wirklich"}, {"id": 372, "start": 2925.4, "end": 2929.6, "text": "nötig, der... Was heißt nicht nötig? Zu viel Kohle kann man nie haben, ne? Was ich sagen"}, {"id": 373, "start": 2929.6, "end": 2936.64, "text": "will ist, also ich bin jetzt da nicht unbedingt drauf angewiesen auf die Kohle und also ich"}, {"id": 374, "start": 2936.64, "end": 2942.0, "text": "halt auch noch nen Tag weniger aus. Also ich bin mir grad am überlegen, ob ich nicht anstatt"}, {"id": 375, "start": 2942.0, "end": 2956.6, "text": "4 Tage nur 3 Tage arbeite. Chef guckt Stream, ja gut. Selbst wenn der Stream gucken sollte."}, {"id": 376, "start": 2956.6, "end": 2962.2, "text": "Ich weiß ja noch gar nicht, ob ich's mache und außerdem ist er der Erste, der's erfährt."}, {"id": 377, "start": 2962.2, "end": 2967.44, "text": "So, aber jetzt machen wir mal weiter mit der ganzen Geschichte hier. Also, kannst du mir"}, {"id": 378, "start": 2967.44, "end": 2973.4, "text": "eventuell einen Tipp geben, wie ich auf dem Pi meinen MQTT-Broker subscriben kann? Ja,"}, {"id": 379, "start": 2973.4, "end": 2978.8, "text": "du musst erstmal die richtigen Emotes verwenden für. Und mir Daten in eine NoSQL-Datenbank"}, {"id": 380, "start": 2978.8, "end": 2993.96, "text": "schreiben kann. Ja, also... Warte mal. Also, deinen MQTT-Broker subscriben kannst du mit..."}, {"id": 381, "start": 2993.96, "end": 3001.52, "text": "damit. Mosquito-Sub. Und die Daten in der NoSQL-Datenbank schreiben, ist halt die Frage, in welcher Form"}, {"id": 382, "start": 3001.52, "end": 3007.48, "text": "die Daten vorliegen. Da musst du wahrscheinlich was kleines programmieren, in einer Sprache"}, {"id": 383, "start": 3007.48, "end": 3016.52, "text": "deiner Wahl, die ein MQTT-Client hat und ein MongoDB-Client. Äh ja, Clasibau kann ich"}, {"id": 384, "start": 3016.52, "end": 3025.52, "text": "sagen. Es gibt da nichts, was dagegen spricht. Kannst du empfehlen, sagt Venice. Oder Vanish."}, {"id": 385, "start": 3025.52, "end": 3039.6, "text": "Ich hab zufälligerweise einen E-Mote, was ich eh nicht anhör. Der Aquara-Cube war der"}, {"id": 386, "start": 3039.6, "end": 3044.08, "text": "Renner. Ja, ich hab immer noch nicht ausprobiert. So, ok, jetzt fangen wir mal an. Also, ich"}, {"id": 387, "start": 3044.08, "end": 3050.4, "text": "hab jetzt... Ich hab jetzt die Micro-SD-Karte geflasht. Und was wir jetzt machen, ist folgendes."}, {"id": 388, "start": 3050.4, "end": 3057.28, "text": "Zack. Zack. Dann wir erstmal die alte SD-Karte raus machen und das Ganze... Oh, ich brauch"}, {"id": 389, "start": 3057.28, "end": 3059.92, "text": "ja noch ein Netzwerkkabel. Hab ich hier noch ein Netzwerkkabel? Ich glaub, ich hab ja noch"}, {"id": 390, "start": 3059.92, "end": 3066.4, "text": "ein Netzwerkkabel. So, jetzt machen wir die alte SD-Karte erstmal raus. Zack, ich schmeiß"}, {"id": 391, "start": 3066.4, "end": 3072.48, "text": "es mal besser hier in die Kiste, sonst wird das nix. So, und hier, die richtig gute Samsung"}, {"id": 392, "start": 3072.48, "end": 3078.6, "text": "Endurance... Oh, fuck. Au. Autsch. Ich hab grad voll mein Knie gegen den Tisch gehault."}, {"id": 393, "start": 3078.6, "end": 3085.6, "text": "Ich glaub, man hat's gesehen. Hier, die gute Samsung Endurance Pro. Kommt da jetzt rein."}, {"id": 394, "start": 3085.6, "end": 3090.56, "text": "Oh, ich hab noch was vergessen, Leute. Ich hab das Wichtigste vergessen. Systema-Chat."}, {"id": 395, "start": 3090.56, "end": 3096.36, "text": "Der Scamtrain hat mich so abgelenkt, dass ich das Wichtigste vergessen hab. What the fuck?"}, {"id": 396, "start": 3096.36, "end": 3100.24, "text": "Ich hab SSH nicht aktiviert. Da kann das ja nicht funktionieren. Wisste, Leute, das Wichtigste"}, {"id": 397, "start": 3100.24, "end": 3104.64, "text": "hab ich vergessen. Ich muss jetzt die SD-Karte, und das müsst ihr auch machen, wenn ihr euch"}, {"id": 398, "start": 3104.64, "end": 3109.44, "text": "den Raspberry Pi 4 oder 3 oder was auch immer installiert. Nachdem ihr das geflasht habt,"}, {"id": 399, "start": 3109.44, "end": 3122.44, "text": "müsst ihr eine Sache machen. Ihr müsst euch die SD-Karte mounten. Was ist es denn? Dev-SDB."}, {"id": 400, "start": 3122.44, "end": 3131.96, "text": "Das könnt ihr auch im grafischen Tool machen, das ist vollkommen egal. So, und jetzt müsst"}, {"id": 401, "start": 3131.96, "end": 3137.88, "text": "ihr da machen, touch SSH, weil ansonsten ist SSH nicht an. Ihr könnt euch auch an den"}, {"id": 402, "start": 3137.88, "end": 3142.96, "text": "Raspberry Pi nicht einloggen. Wenn ihr da Desktop installiert, Desktop-System drauf"}, {"id": 403, "start": 3142.96, "end": 3146.32, "text": "installiert habt, ist es egal, weil dann habt ihr wahrscheinlich auch Tastatur und Monitor"}, {"id": 404, "start": 3146.32, "end": 3154.88, "text": "dran. Hab ich aber nicht, und insofern muss das sein. Kannst du mal einen Spiegel zeigen?"}, {"id": 405, "start": 3154.88, "end": 3169.88, "text": "Nein, gibt's nicht. Aber ich hab mich schon so oft gespiegelt, Leute. So, also. Sind"}, {"id": 406, "start": 3169.88, "end": 3176.24, "text": "wir hier. Geht es euch auch so? Steckt ihr das auch immer komplett falsch rum rein?"}, {"id": 407, "start": 3176.24, "end": 3184.4, "text": "Zack, so. Und jetzt muss ich mal ein Netzwerkkabel holen, kurz. Warte mal, Netzwerkkabel."}, {"id": 408, "start": 3206.24, "end": 3224.2, "text": "Ja. Haben wir das nicht geändert sogar zwischen dem Dreier und dem Zweier oder dem Dreier"}, {"id": 409, "start": 3224.2, "end": 3229.04, "text": "und dem Vierer, warum die SD-Karte rein muss oder an welcher Stelle die SD-Karte reinkommt?"}, {"id": 410, "start": 3229.04, "end": 3232.96, "text": "Mir ist irgendwie so, als ist das bei den Alten anders gewesen. Aber kann auch sein,"}, {"id": 411, "start": 3232.96, "end": 3241.12, "text": "dass ich das komplett durchladen bringe. So, also. Netzwerkkabel ist dran. Die SSD mal"}, {"id": 412, "start": 3241.12, "end": 3247.0, "text": "mal gleich dran. Ich schließe jetzt erstmal hier eine Runde Strom an. So, der Kicks guckt"}, {"id": 413, "start": 3247.0, "end": 3255.6, "text": "zu. Passt auf. So, ich leg das mal irgendwie so ein bisschen hoch kann. Übrigens, macht"}, {"id": 414, "start": 3255.6, "end": 3259.44, "text": "nicht den Fehler, den ich einmal gemacht hab. Ich mach mal kurz nochmal Strom raus, nur"}, {"id": 415, "start": 3259.44, "end": 3263.24, "text": "auf Nummer sicher zu gehen. Macht nicht den Fehler, den ich einmal mit dem Raspberry Pi"}, {"id": 416, "start": 3263.24, "end": 3271.08, "text": "Zero gemacht hab. Und zwar, ich hab ein Raspberry Pi Zero mal genommen und so auf Metall unterdings"}, {"id": 417, "start": 3271.08, "end": 3279.24, "text": "gelegt. Und ihr seht ja, wie viele Kontakte das Ding unten hat. Und das mag das nicht,"}, {"id": 418, "start": 3279.24, "end": 3289.36, "text": "wenn man die kurz schließt. Also ich hab den Raspberry Pi Zero in eine Metallkiste gelegt."}, {"id": 419, "start": 3289.36, "end": 3296.4, "text": "So. Und hab's eingeschaltet und das hat kurz, kurz, ähm, bisschen geraucht. Also nicht"}, {"id": 420, "start": 3296.4, "end": 3301.52, "text": "wirklich viel. So mal ganz kurz so ein bisschen, dann war's vorbei. Aus, aus ist gewesen."}, {"id": 421, "start": 3301.52, "end": 3308.84, "text": "Aus war. So, also stöpseln wir das mal an. Exzellent. Seht ihr, wie viel das verbraucht?"}, {"id": 422, "start": 3308.84, "end": 3321.64, "text": "Ein bisschen, ne? Wir machen's mal andersrum. Hallo? Ah. Nice. Okay, schalten wir mal an."}, {"id": 423, "start": 3321.64, "end": 3325.2, "text": "Da, leuchtet, ist an. Weiß ich auch nicht, ob man das sieht, dass das leuchtet. Aber"}, {"id": 424, "start": 3325.2, "end": 3331.52, "text": "es sollte, man sollte es sehen, dass das leuchtet. Da, da unten guckt er. Ich glaub, das Licht"}, {"id": 425, "start": 3331.52, "end": 3337.2, "text": "ist ein bisschen hell. So, der sollte jetzt eigentlich booten und wir sollten uns darauf"}, {"id": 426, "start": 3337.2, "end": 3346.92, "text": "connecten können. Dramatische Musik dazu, ja. Oh, das ist die Mario, ähm, Geisterhausmusik,"}, {"id": 427, "start": 3346.92, "end": 3366.6, "text": "oder? Also wir sollten jetzt eigentlich mit dieser IP auf den Pile kommen, wenn das stimmt."}, {"id": 428, "start": 3366.6, "end": 3375.88, "text": "Äh, sieht schlecht aus. Aber der bootet noch, oder? Guck mal Leute. Der, also, der hatte"}, {"id": 429, "start": 3375.88, "end": 3380.08, "text": "da zwei LEDs unten, da sieht man's ja. Das Licht ist jetzt ein bisschen hell, da sieht"}, {"id": 430, "start": 3380.08, "end": 3387.76, "text": "man's nicht wirklich. Ja, da ist so eine grüne und eine rote LED. Und normalerweise ist so,"}, {"id": 431, "start": 3387.76, "end": 3392.16, "text": "wenn du Strom anmachst, die rote geht immer an und die grüne ist quasi eure Festplattenaktivität"}, {"id": 432, "start": 3392.16, "end": 3397.68, "text": "beziehungsweise eure MicroSD oder eure Disk, Disk, Storage, was auch immer Aktivität. Und"}, {"id": 433, "start": 3397.68, "end": 3403.0, "text": "normalerweise, wenn du das erst nochmal anschaltest, blinkt der wie verrückt auf der, auf der grünen"}, {"id": 434, "start": 3403.0, "end": 3406.0, "text": "und irgendwann ist er fertig blinken mit der grünen und dann könnt ihr euch eigentlich"}, {"id": 435, "start": 3406.0, "end": 3415.6, "text": "sicher sein, ok, er hat gebootet, aber, äh, ah, ok, er hat doch gebootet. Oh fuck, IP"}, {"id": 436, "start": 3415.6, "end": 3424.44, "text": "liegt, Leute, schon wieder, schon wieder IP liegt, was machen wir denn jetzt? Anzeige"}, {"id": 437, "start": 3424.44, "end": 3432.84, "text": "ist raus. Ich, ich, ich lösche mal wieder meine neuen Hosts. Default Passwort ist übrigens"}, {"id": 438, "start": 3432.84, "end": 3436.72, "text": "immer Raspberry. Das heißt, ich hab jetzt nicht nur die IP geleakt, ich hab jetzt sogar"}, {"id": 439, "start": 3436.72, "end": 3445.52, "text": "das Passwort geleakt. Jetzt wird's aber kritisch langsam. Der Chat ist bestimmt schon eingeloggt,"}, {"id": 440, "start": 3445.52, "end": 3452.72, "text": "oder? Seid ihr schon drin, Chat? So wie ich euch kenne, so wie ich euch kenne bestimmt."}, {"id": 441, "start": 3452.72, "end": 3465.08, "text": "SSHKGN-R. Echt, löst das das? Das hab ich, das wusste ich gar nicht. Ah, du kannst extra"}, {"id": 442, "start": 3465.08, "end": 3471.4, "text": "den Hostname löschen. Exquisite. Das ist ne richtige Hackermans wieder im Chat am Start."}, {"id": 443, "start": 3471.4, "end": 3478.76, "text": "So, Upt, Upgrade, wir machen erst mal ein Update. RS Revo, das wusste ich nicht. Siehste mal,"}, {"id": 444, "start": 3478.76, "end": 3483.92, "text": "hier lernt man auch was. Massive Brain Chat. Und wisst ihr warum? Nur wegen den vielen"}, {"id": 445, "start": 3483.92, "end": 3489.44, "text": "Subs. Ohne die Subs wäre einfach das IQ Level im Chat auch nicht hoch genug, dass das überhaupt"}, {"id": 446, "start": 3489.44, "end": 3502.4, "text": "klappen würde. Aber jetzt, mittlerweile, ist das, geht das. Demnächst, demnächst platzt's."}, {"id": 447, "start": 3502.4, "end": 3508.8, "text": "So, wir lassen ihn erst mal Upgrade machen. Wo wir gerade dabei sind, ich guck mal kurz"}, {"id": 448, "start": 3508.8, "end": 3522.56, "text": "wie schnell, wie schnell die SD ist, die Micro SD, Endurance Micro SD Karte. Okay, also,"}, {"id": 449, "start": 3522.56, "end": 3525.72, "text": "wir schauen jetzt mal, wie warm der Raspberry Pi wird und wie schnell die Micro SD Karte"}, {"id": 450, "start": 3525.72, "end": 3532.64, "text": "ist. Und dann gucken wir, wie warm die mit dem Gehäuse hier wird, ne? Also, Ziel ist"}, {"id": 451, "start": 3532.64, "end": 3536.72, "text": "jetzt, ich teste mal, wie warm das Ding wird, mit den einfachen Passivkühlern und dem Stehen"}, {"id": 452, "start": 3536.72, "end": 3541.08, "text": "der Luft. Und dann gucken wir mal, wie warm das ganze mit dem Gehäuse wird. Aber erst"}, {"id": 453, "start": 3541.08, "end": 3549.84, "text": "mal muss der updaten. Wie konnte man sich CPU Temp anziehen? VC, V, VC, GEN, CPU, VC,"}, {"id": 454, "start": 3549.84, "end": 3560.88, "text": "GEN, Measure Temp. Genau. Eins Sub, plus eins IQ. Ne, ne, das ist doch nicht nur plus eins."}, {"id": 455, "start": 3560.88, "end": 3566.64, "text": "Mittlerweile sind wir schon deutlich weiter. Also, ich mein, wenn du dir den Chat mal anguckst,"}, {"id": 456, "start": 3566.64, "end": 3573.72, "text": "nur, jetzt mal ohne Spaß, Leute, guckt euch mal meinen Chat an und dann geht mal in irgendeinen"}, {"id": 457, "start": 3573.72, "end": 3579.64, "text": "anderen Channel. Also, da sieht man ja mal richtig, dass mein Chat einfach massive high"}, {"id": 458, "start": 3579.64, "end": 3586.76, "text": "IQ ist und wenn du das direkt mit anderen Channels vergleichst. Wieso kein Boot von"}, {"id": 459, "start": 3586.76, "end": 3591.8, "text": "der SSD? Weil ich die SSD komplett für Videoaufnahmen verwende. Eventuell mach ich die Logs später"}, {"id": 460, "start": 3591.8, "end": 3597.12, "text": "noch drauf. Muss ich mal gucken. Also, ich mach, und ich kann mein altes, ich zieh mein"}, {"id": 461, "start": 3597.12, "end": 3601.8, "text": "altes Zeugs einfach um, wahrscheinlich vom alten Raspberry. Ähm, klar, das kannst du"}, {"id": 462, "start": 3601.8, "end": 3607.8, "text": "mit der SSD auch machen. Aber so ist mir das ganze lieber. SSD komplett für Videos und"}, {"id": 463, "start": 3607.8, "end": 3621.04, "text": "System-Unified-Zeug auf die MicroSD. Was für, das ist das ganz normale 32-Bit Raspberry"}, {"id": 464, "start": 3621.04, "end": 3629.48, "text": "Pi OS. Ja, genau, vergleicht mal den Chat mit Knossi-Chat, Alter. Wobei man das nicht"}, {"id": 465, "start": 3629.48, "end": 3639.28, "text": "vergleichen kann. Das ist so, wie wenn man Big Brain Arte-Doku mit RTL2 vergleicht. Alles"}, {"id": 466, "start": 3639.28, "end": 3650.8, "text": "hat irgendwie seine Daseinsberechtigung. Ah, die Musik. Unified-Controller, ja. Also,"}, {"id": 467, "start": 3650.8, "end": 3657.44, "text": "auf den Pi kommt drauf, der Unified-Controller, ein Proxy für Zertifikate. Äh, nö, nicht"}, {"id": 468, "start": 3657.44, "end": 3662.0, "text": "im Docker, aus dem Repo. Vielleicht auch im Docker, ganz ehrlich, hab ich mir noch gar"}, {"id": 469, "start": 3662.0, "end": 3666.04, "text": "nicht großartig angeguckt, aber wahrscheinlich nicht. Die haben offizielle Repos für den"}, {"id": 470, "start": 3666.04, "end": 3670.72, "text": "Raspberry Pi, ich werd's wahrscheinlich einfach darüber installieren. Und meine Kameraüberwachungssoftware."}, {"id": 471, "start": 3670.72, "end": 3676.96, "text": "Das, was auch der hauptsächliche Grund ist, warum ich das jetzt umziehe, weil mein Raspberry"}, {"id": 472, "start": 3676.96, "end": 3687.56, "text": "Pi 3 unten zu viel nicht RAM hat, um Bewegungserkennung richtig zu machen, mit den Kameras. Da mach's"}, {"id": 473, "start": 3687.56, "end": 3694.08, "text": "gleich Arte-Doku. Ja, so genau, würd ich das jetzt nicht vergleichen. Aber zumindest"}, {"id": 474, "start": 3694.08, "end": 3704.0, "text": "kein RTL2. So, also, jetzt haben wir den Kram geupdatet, sehr gut. Wollte das, hat das"}, {"id": 475, "start": 3704.0, "end": 3708.04, "text": "Kernel-Update gemacht oder so? Sollen wir mal neu starten im Zweiten? Komm, wir starten"}, {"id": 476, "start": 3708.04, "end": 3716.2, "text": "mal neu, sicher, sicher ist sicher. Aber ist ja nie. So, und dann gucken wir mal, wie warm"}, {"id": 477, "start": 3716.2, "end": 3733.2, "text": "der ganze Kram wird. Just Jinx Twitch Prime, danke schön für den Sub. Plus 1 IQ. Du musst"}, {"id": 478, "start": 3733.2, "end": 3745.36, "text": "in einer Woche wieder arbeiten. Ja, ich auch. Also ich muss am fünften, nee, Moment, 0w,"}, {"id": 479, "start": 3745.36, "end": 3751.0, "text": "das ist schlimm mittlerweile. Ich sag ernsthaft 0w. Also ich sag jetzt nicht einfach nur 0w,"}, {"id": 480, "start": 3751.0, "end": 3758.0, "text": "weil ich im Twitch-Chat on bin. Ich sag einfach manchmal vor mich hin 0w, nicht hängen geblieben."}, {"id": 481, "start": 3758.0, "end": 3772.12, "text": "Hier, am fünften muss ich wieder. Ja, ich muss auch am fünften wieder. Ah, da ist er"}, {"id": 482, "start": 3772.12, "end": 3776.4, "text": "wieder. Das ist so, ich hab letztens morgens im Bad gestanden, das ist kein Witz, Leute."}, {"id": 483, "start": 3776.4, "end": 3780.76, "text": "Ich hab letztens morgens im Bad gestanden und hab mir Socken angezogen und hab festgestellt,"}, {"id": 484, "start": 3780.76, "end": 3786.72, "text": "dass die Socken nicht zueinander passen. Und ich hab wirklich laut gesagt 0w. Ich hab nicht"}, {"id": 485, "start": 3786.72, "end": 3797.24, "text": "gelacht oder so. Ich hab einfach nur gesagt 0w und hab die Socken gewechselt. Richtig"}, {"id": 486, "start": 3797.24, "end": 3807.32, "text": "richtig hängen geblieben, ne. Geht mir genauso 0w. Übrigens mal so als Tipp, wer auch nur"}, {"id": 487, "start": 3807.32, "end": 3810.92, "text": "Raspberry Pi am Start hat und eben auf den Keks geht, dass man immer das Passport eingeben"}, {"id": 488, "start": 3810.92, "end": 3819.56, "text": "muss beim Login. Macht einfach ssh-copy-id, loggt euch einmal noch ein und dann wird festgestellt,"}, {"id": 489, "start": 3819.56, "end": 3822.6, "text": "danach könnt ihr euch immer ohne Passport einloggen. Pause jetzt, ihr habt einen ssh-key"}, {"id": 490, "start": 3822.6, "end": 3828.16, "text": "generiert, was aber eigentlich normal sein sollte. Ihr habt früher in der Schule immer"}, {"id": 491, "start": 3828.16, "end": 3841.88, "text": "xd gesagt, ne, das hab ich nie. Beim nächsten GitHub Review einfach 0w und dann ablehnen."}, {"id": 492, "start": 3841.88, "end": 3849.16, "text": "Das ist eine gute Idee, ja. Das müsste ich echt machen. Bei manchen Leuten kann ich's"}, {"id": 493, "start": 3849.16, "end": 3853.68, "text": "machen, weil ich weiß, die gucken auch Twitch. Das mach ich nächstes Mal. Nächster Pullrequest,"}, {"id": 494, "start": 3853.68, "end": 3860.72, "text": "der kommt. Nächster Pullrequest, der kommt, schreibe ich rein, 0w größer kekw-close."}, {"id": 495, "start": 3860.72, "end": 3871.32, "text": "Oh, ich hab grad fast ein Stück vor meinem Schreibtisch abgebrochen. Also, wo sind wir"}, {"id": 496, "start": 3871.32, "end": 3876.64, "text": "stehen geblieben? Und zwar, also, wir wollten gucken, wie warm das Ding wird. vc-gen-measure-temp."}, {"id": 497, "start": 3876.64, "end": 3884.16, "text": "Aktuell ist das, aktuell schwankt das zwischen, ja, so um die 48 Grad. Das heißt, wir installieren"}, {"id": 498, "start": 3884.16, "end": 3889.48, "text": "jetzt erstmal die allerwichtigsten Dinger, die man braucht. Schreibtisch, ne, nur ein"}, {"id": 499, "start": 3889.48, "end": 3895.88, "text": "bisschen die Farbe ab. Ich hab doch einen Stuhl mit Armlehnen und ich hab die Armlehne"}, {"id": 500, "start": 3895.88, "end": 3900.32, "text": "grad unter den Schreibtisch reingeklemmt, weil es halt genau von der Höhe passt und"}, {"id": 501, "start": 3900.32, "end": 3904.16, "text": "dann hab ich rumgedreht und es ist unten ein bisschen Farbe abgegangen, also nix wildes."}, {"id": 502, "start": 3904.16, "end": 3909.04, "text": "So, wir installieren jetzt erstmal die wichtigen Dinger, die man immer braucht, falls es nicht"}, {"id": 503, "start": 3909.04, "end": 3918.4, "text": "eh schon alles drauf ist. Also, ich hab noch was vergessen. Eines meiner Lieblings, Debian-Pakete."}, {"id": 504, "start": 3918.4, "end": 3937.84, "text": "Oh, Bowser-Musik. Genau, weil, wenn ich jetzt rebooten will, dann sagt er, nein, nein, rebooten"}, {"id": 505, "start": 3937.84, "end": 3944.28, "text": "ist nicht, geb erst nochmal den Namen vom Rechner ein. Das finde ich jetzt persönlich"}, {"id": 506, "start": 3944.28, "end": 3949.48, "text": "ganz nützlich, da kann man nicht aus Versehen, dann rebootet man nicht aus Versehen, weil"}, {"id": 507, "start": 3949.48, "end": 3953.24, "text": "mir ist es schon oft passiert, dass ich rebooten wollte und festgestellt hab, oh Mist, ich"}, {"id": 508, "start": 3953.24, "end": 3960.56, "text": "war im falschen Tab, deswegen ist das hier echt praktisch. So, ok, also schauen wir mal,"}, {"id": 509, "start": 3960.56, "end": 3977.2, "text": "wie warm das Ganze wird. Ups. Vc-Gen. Abinstall, was machen wir hier, Suspension oder so. Wir"}, {"id": 510, "start": 3977.2, "end": 3981.0, "text": "machen erstmal, wir testen erstmal von Hand. Also, der Raspberry Pi 4, der hat vier CPU-Kerne,"}, {"id": 511, "start": 3981.0, "end": 3987.84, "text": "die werden wir jetzt einfach mal alle auslasten. Jetzt nicht so komplett, Strasberry hab ich"}, {"id": 512, "start": 3987.84, "end": 3998.08, "text": "schon nie verwendet. Gibt's aber gar nicht, oder? Also, was ich mach, ist meistens Echo"}, {"id": 513, "start": 3998.08, "end": 4007.8, "text": "zwei hoch, blablabla, nach bc. What? Bc ist nicht installiert, was das? Bc ist ein Kommandozahlen-Rechner."}, {"id": 514, "start": 4007.8, "end": 4023.24, "text": "So. So. Jetzt gucken wir hier noch. CPU-Auslastung, alles klar. So, und jetzt starten wir das Ganze"}, {"id": 515, "start": 4023.24, "end": 4035.0, "text": "viermal. Ups. So. Bam. Jetzt haben wir ordentlich CPU-Auslastung, mal gucken. Abinstall Stress"}, {"id": 516, "start": 4035.0, "end": 4039.52, "text": "und dann führt man's einfach nur aus mit Stress. Also, ich hab Suspension öfters verwendet,"}, {"id": 517, "start": 4039.52, "end": 4052.96, "text": "aber Stress. Stress klingt so nach Haftbefehl-Track. Na, SL haben wir schon oft genug. Ok, wie warm"}, {"id": 518, "start": 4052.96, "end": 4060.64, "text": "wird's denn, wie warm wird's denn mit so Low-Prain-Auslastung, ja? Ich mein, wir haben nur 100% auf allen"}, {"id": 519, "start": 4060.64, "end": 4068.08, "text": "vier Kern, da geht natürlich noch ein bisserl mehr. Wie warm wird denn das Ganze? 64, 64°,"}, {"id": 520, "start": 4068.08, "end": 4096.72, "text": "65°. Leute, was solls mal machen? Au. Alter. Ey, der ist wirklich warm. Das hier geht's"}, {"id": 521, "start": 4096.72, "end": 4112.32, "text": "nicht so. Aber, Alter, der ist wirklich warm. Also, mal gucken, mal gucken, ob sich die Temperatur"}, {"id": 522, "start": 4112.32, "end": 4117.0, "text": "ändert, wenn ich den Finger drauf halte. Au. Alter, ich kann den, guck mal, guck mal,"}, {"id": 523, "start": 4117.0, "end": 4120.2, "text": "seh, die Temperatur geht runter, wenn ich den Finger drauf mach. Finger drauf. Ah,"}, {"id": 524, "start": 4120.2, "end": 4132.72, "text": "ich kann den Finger nicht lang drauf machen, Alter, 70°. Haustier, eher Katzer zugeschlagen."}, {"id": 525, "start": 4132.72, "end": 4139.24, "text": "Jetzt passen wir mal auf, mal gucken, mal gucken, was passiert. Hast du nicht den Infrarot-Thermometer?"}, {"id": 526, "start": 4139.24, "end": 4146.24, "text": "Nein, nein, hab ich nicht. Wo ist die Abisolierzange? Ein guter Hinweisproxy, die Abisolierzange."}, {"id": 527, "start": 4146.24, "end": 4151.36, "text": "Du meinst, du meinst, um es korrekt auszusprechen, der Abisolierzamp, der Abisolierzamp, der"}, {"id": 528, "start": 4151.36, "end": 4167.6, "text": "ist hier. Exzellent, Abisolierzamp. Bäm. Ich hab jetzt leider nichts da zum Abisolieren,"}, {"id": 529, "start": 4167.6, "end": 4175.28, "text": "sonst würd ich jetzt einfach, einfach, weil es geht, was Abisolieren. Wo ist der Abisolierzamp"}, {"id": 530, "start": 4175.28, "end": 4192.28, "text": "in Action? Hab ich irgendwo was? Leute, wartet mal, der Abisolierzamp will abisolieren. Einfach"}, {"id": 531, "start": 4192.28, "end": 4202.56, "text": "Finger abisolieren. Einfach nur, einfach nur, weil es geht hier, so. Abisolierzamp. So,"}, {"id": 532, "start": 4202.56, "end": 4216.96, "text": "jetzt hätten wir das auch geklärt. So, also, es ist ziemlich, ziemlich warm mittlerweile,"}, {"id": 533, "start": 4216.96, "end": 4221.8, "text": "würd ich sagen. Der Raspberry Pi, so 75 Grad. 75 Grad, das merkt man auch schon mit dem"}, {"id": 534, "start": 4221.8, "end": 4225.6, "text": "Finger, wenn man da drauf geht. Also, das kannst du, du kannst den Finger nicht drauf"}, {"id": 535, "start": 4225.6, "end": 4233.44, "text": "lassen, geht nicht. Du kannst den Finger eine Sekunde drauf machen, dann ist es vorbei."}, {"id": 536, "start": 4233.44, "end": 4241.36, "text": "Teste das mal. GetConf gibt's nicht. GetConf ist doch irgendein GTK Ding, oder? Oh, tatsächlich,"}, {"id": 537, "start": 4241.36, "end": 4258.76, "text": "nee, ist nicht. Report. Okay, also, dann machen wir das jetzt mal mit Stress. Liegt dir ein"}, {"id": 538, "start": 4258.76, "end": 4262.4, "text": "Eistauer zu. Ich hab hier ein Gehäuse, das probieren wir jetzt mal aus. Also, 77 Grad,"}, {"id": 539, "start": 4262.4, "end": 4270.48, "text": "jetzt probieren wir das mal mit Stress. Abinstall Stress. Wie führt man einen Stress aus? Einfach"}, {"id": 540, "start": 4270.48, "end": 4276.4, "text": "nur Stress ausführen, ich hab das noch nie verwendet. Stress. Ah, Stress, Minus Minus"}, {"id": 541, "start": 4276.4, "end": 4302.04, "text": "CPU 4, oder? Oder einfach nur Minus Minus CPU und er macht an. Bäm, Stress, gib ihm."}, {"id": 542, "start": 4302.04, "end": 4311.8, "text": "Er geht noch ein bisschen mehr hoch als einfach nur mit meinem PC. Sariks, das macht doch"}, {"id": 543, "start": 4311.8, "end": 4322.52, "text": "im Endeffekt einfach nur für jeden CPU Kern. Ach nee, nee, nee, nee, Moment. Das startet"}, {"id": 544, "start": 4322.52, "end": 4331.84, "text": "für jeden CPU Kern. Yes und piped nach Def Null. Joa, kann man auch machen. Abonniert"}, {"id": 545, "start": 4331.84, "end": 4339.96, "text": "Stufe 1 Nelson und Munz. Dankeschön für den Sub. Okay, also sagen wir mal so, 75 Grad"}, {"id": 546, "start": 4339.96, "end": 4348.36, "text": "ist vorbei. Was ist denn, was ist denn so Max Temp? Pie. Ich mein, man darf jetzt nicht"}, {"id": 547, "start": 4348.36, "end": 4354.76, "text": "vergessen, der liegt offen da. Wenn der dann unten im Wohnzimmer in der Ecke liegt, wird"}, {"id": 548, "start": 4354.76, "end": 4361.52, "text": "es auf jeden Fall noch wärmer. 85 wird runtergetaktet, okay. Mal gucken, was passiert, wenn man pustet."}, {"id": 549, "start": 4361.52, "end": 4380.2, "text": "Das geht direkt ein bisschen runter. Pustchamp. Okay, also sagen wir mal so, 75 Grad, 75 Grad,"}, {"id": 550, "start": 4380.2, "end": 4386.48, "text": "easy. Meckert er irgendwie, dass er zu warm wird oder so? Nee. Macht er noch nicht."}, {"id": 551, "start": 4386.48, "end": 4397.36, "text": "Noctua-Fan drauf, da bekommen wir den unter Null Grad. Wisst ihr, was witzig ist? Wartet"}, {"id": 552, "start": 4397.36, "end": 4422.8, "text": "mal, wartet mal. Eingestaubt. Bisschen eingestaubt, aber Lüftungsfan ist am Start. Also unter"}, {"id": 553, "start": 4422.8, "end": 4433.76, "text": "einem kleineren machen wir es jetzt nicht. Der Lüft das große Raspberry Pi. Die Sache"}, {"id": 554, "start": 4433.76, "end": 4438.76, "text": "ist die, ich weiß gar nicht, wo ich den anschließen soll. Kann ich den da irgendwie dran anschließen?"}, {"id": 555, "start": 4438.76, "end": 4446.44, "text": "Was braucht der? 12 Volt, das sind 12 Volt-Fan, den kann ich da gar nicht dran anschließen."}, {"id": 556, "start": 4446.44, "end": 4458.52, "text": "12 Volt-Fan, der geht überhaupt nicht da dran. Ja gut, dann lüften wir jetzt nicht, sonst"}, {"id": 557, "start": 4458.52, "end": 4475.12, "text": "hätte ich einen Lüftungs-Champ gemacht. Wir testen jetzt das, was wir eigentlich testen"}, {"id": 558, "start": 4475.12, "end": 4480.2, "text": "wollen, weil wir haben ja noch ein bisschen was vor uns. Wir testen jetzt das Gehäuse."}, {"id": 559, "start": 4480.2, "end": 4486.88, "text": "Also, der hat jetzt lang genug gelüftet, lang genug, lang genug gebrutzelt. 75 Grad,"}, {"id": 560, "start": 4486.88, "end": 4495.12, "text": "okay, 75 Grad, das kann ich mitleben. Alles klar. So, dann machen wir den Stresstest mal"}, {"id": 561, "start": 4495.12, "end": 4506.04, "text": "aus. Der sollte jetzt wieder ein bisschen runter gehen. Ja, geht auch direkt runter. Alles klar."}, {"id": 562, "start": 4506.04, "end": 4510.24, "text": "So, jetzt würde ich sagen, bauen wir den Kram mal ins Gehäuse ein und gucken, ob es"}, {"id": 563, "start": 4510.24, "end": 4519.08, "text": "kühler bleibt. Kann man das im laufenden Betrieb machen? Ich glaube nicht. Alter, wie das quietscht,"}, {"id": 564, "start": 4519.08, "end": 4534.28, "text": "exzellent Bauweise. Kannst du immer noch ganz schön warm das Ding? WD-40, im Zweifelsfall"}, {"id": 565, "start": 4534.28, "end": 4539.28, "text": "kannst du... WD-40 ist ja für viele so Allheilmittel. Dabei ist das gar kein gutes Schmiermittel."}, {"id": 566, "start": 4539.28, "end": 4545.92, "text": "Oder, nee, warte mal, war das umgedreht? Was ich jetzt durch dann erbringe? War das"}, {"id": 567, "start": 4545.92, "end": 4563.84, "text": "nicht so, dass das Feuchtigkeit entzogen hat? So. Also, jetzt ist die Sache. Ich habe keine"}, {"id": 568, "start": 4563.84, "end": 4569.48, "text": "Ahnung, wie das funktioniert. Da ist nichts dabei bei dem Gehäuse. Also, die Klemmen"}, {"id": 569, "start": 4569.48, "end": 4576.36, "text": "brauchen wir jetzt auf jeden Fall nicht. Und die alte MicroSD brauchen wir jetzt auch nicht."}, {"id": 570, "start": 4576.36, "end": 4582.24, "text": "Aber... Was? Das ist ja der... Okay, das ist der mickrigste Schraubendreher, den ich je"}, {"id": 571, "start": 4582.24, "end": 4589.36, "text": "gesehen habe. Alter, was ist das denn? Guck dir das mal an. Dazu fällt mir nur noch ein"}, {"id": 572, "start": 4589.36, "end": 4608.96, "text": "jetzt hier. Cute. Cute Schraubendreher. Ja. Also, habt ihr jetzt übrigens gesehen, der"}, {"id": 573, "start": 4608.96, "end": 4616.32, "text": "Raspberry Pi braucht unter Last, gucken wir uns das Ganze nochmal an, unter Last 5,7 Watt."}, {"id": 574, "start": 4616.32, "end": 4622.12, "text": "Also, man sieht, der Unterschied zwischen so einem ESP32 und einem Raspberry Pi ist schon"}, {"id": 575, "start": 4622.12, "end": 4627.96, "text": "enorm. Aber, weil das hatten wir letztens mal im Stream. Aber, im Vergleich zu so einem"}, {"id": 576, "start": 4627.96, "end": 4632.0, "text": "normalen Rechner, den man sonst so hat, ist das immer noch ziemlich wenig. Wobei man sagen"}, {"id": 577, "start": 4632.0, "end": 4638.0, "text": "muss, man kriegt auch die aktuelle x86 Low Power Intel Plattform, die kriegst du auf"}, {"id": 578, "start": 4638.0, "end": 4646.88, "text": "ähnliche Werte. Ich hab so ein x86, so ein ganz billiges Low Power Board von Intel. Es"}, {"id": 579, "start": 4646.88, "end": 4656.64, "text": "braucht auch nur 7-8 Watt. Eidl, wohlgemerkt, ne? Der Raspberry Pi unter Volllast. So,"}, {"id": 580, "start": 4656.64, "end": 4668.8, "text": "mal die Musik wieder an, die Musik jetzt aus. Gut, dann machen wir mal aus und bauen das"}, {"id": 581, "start": 4668.8, "end": 4673.08, "text": "ins Gehäuse ein. Ich hab keine Ahnung, wie es funktioniert. Machen wir hier mal ab."}, {"id": 582, "start": 4673.08, "end": 4683.48, "text": "So geil, das Zeug hier hinten ist warm. Alles warm an dem Raspberry Pi gerade. Okay, ich"}, {"id": 583, "start": 4683.48, "end": 4688.76, "text": "hab keine Ahnung, wie das funktioniert. Also, wir haben hier so komische, ich würd mal sagen,"}, {"id": 584, "start": 4688.76, "end": 4693.8, "text": "das sind so passiv, so kühler, um es im Gehäuse zu verbinden. Ich guck mal, ob hier irgendwo"}, {"id": 585, "start": 4693.8, "end": 4703.44, "text": "ein Handbuch drin ist oder so. Oh ja, Cute Book ist da drin. Alles klar. Ach, ihr seht"}, {"id": 586, "start": 4703.44, "end": 4713.4, "text": "ja gar nix. Ihr seht ja gar nix. Ihr seht ja gar nix. Guck mal hier. Cute Book ist da"}, {"id": 587, "start": 4713.4, "end": 4733.6, "text": "drin. Exquisite Chat. Alles klar. How was your experience with IC Box? Gut, also das hier"}, {"id": 588, "start": 4733.6, "end": 4743.84, "text": "ist exzellent Anleitung. So funktioniert's. Also, man macht den, okay, also das ist, glaub"}, {"id": 589, "start": 4743.84, "end": 4752.56, "text": "ich, Danger. Danger. Das sind die Amis, guckt mal. Warning. Ich kanns im Kopf nicht lesen."}, {"id": 590, "start": 4752.56, "end": 4763.92, "text": "Directly hazardous situation causing death or serious injury. Also, Tod oder schwerste"}, {"id": 591, "start": 4763.92, "end": 4772.24, "text": "Verletzung. Ich weiß ja nicht. Also, ich bin mir da nicht so ganz sicher, ehrlich gesagt."}, {"id": 592, "start": 4772.24, "end": 4787.56, "text": "Okay, wenn sie meinen. Und das nächste ist Make cause. Okay, also das hier, Danger, bedeutet,"}, {"id": 593, "start": 4787.56, "end": 4795.44, "text": "es ist direkt zum Tod oder schwere Verletzung. Warning ist, kann zu schweren Verletzungen"}, {"id": 594, "start": 4795.44, "end": 4804.32, "text": "und Tod führen. Äh, Achtung. Es ist möglich, dass es zu kleinen Verletzungen kommt. Aha,"}, {"id": 595, "start": 4804.32, "end": 4819.88, "text": "alles klar. Jetzt übertreibt's man nicht. Das ist ein fucking Metallgehäuse. Okay,"}, {"id": 596, "start": 4819.88, "end": 4824.36, "text": "also wie funktioniert's denn? Steht da irgendwo was drin? Safety information. Sieh ich auch,"}, {"id": 597, "start": 4824.36, "end": 4829.8, "text": "jetzt gibt's das ganze auch noch. Hier. Warn vor allem, eine unmittelbar gefährliche Situation,"}, {"id": 598, "start": 4829.8, "end": 4841.64, "text": "die zum Tod oder zu schweren Verletzungen führt. Alles klar. Quick installation guide. Äh."}, {"id": 599, "start": 4841.64, "end": 4852.24, "text": "Ah, okay. Big brain champ. Da steht's, wie's geht. Also, das machen wir jetzt. Also,"}, {"id": 600, "start": 4852.24, "end": 4859.16, "text": "so wie ich das sehe, müssen wir dazu. Ich seh nur die Hälfte von hier oben. Also, place"}, {"id": 601, "start": 4859.16, "end": 4864.2, "text": "den Raspberry Pi da unten drinnen. Ich würd mal sagen, das ist unten, weil das hat Füßchen."}, {"id": 602, "start": 4864.2, "end": 4870.96, "text": "Das heißt, der Raspberry Pi muss da so rum rein. Viel, ich mein, viel anders, viel anders"}, {"id": 603, "start": 4870.96, "end": 4879.92, "text": "kann's ja nicht funktionieren, ne? Setzen Sie das Raspberry Pi Port wie gezeigt in"}, {"id": 604, "start": 4879.92, "end": 4888.8, "text": "das Unterteil ein. Haben wir. Richten Sie das Raspberry Pi Port aus und befestigen Sie"}, {"id": 605, "start": 4888.8, "end": 4895.48, "text": "es mit den vier beiliegenden großen Schrauben. Wo sind da große Schrauben? Das da. Massive."}, {"id": 606, "start": 4895.48, "end": 4899.32, "text": "Alter, das ist ja die größten Schrauben aller Zeiten hier. Viel größer geht's ja"}, {"id": 607, "start": 4899.32, "end": 4907.56, "text": "kaum noch. Da brauchen wir, oh ja, guck mal. Oh, sind die große Schrauben, meine Güte."}, {"id": 608, "start": 4907.56, "end": 4917.48, "text": "Riesige Schraube. Da muss ich jetzt den Cute Schraubenzieher für verwenden oder. Okay,"}, {"id": 609, "start": 4917.48, "end": 4922.0, "text": "das ist nicht mal magnetisch. Kann ich jemand, kann ich jemand anderen? Oh, fuck. Runter"}, {"id": 610, "start": 4922.0, "end": 4926.92, "text": "geschmissen. Kann ich jemand anderen für verwenden? Passt der da nicht auch rein? Passt"}, {"id": 611, "start": 4926.92, "end": 4945.84, "text": "doch. Easy, nimm ich doch mal einen anderen. Schraubchamp. Zack. Ach, jetzt weiß ich warum"}, {"id": 612, "start": 4945.84, "end": 4950.68, "text": "die großen Schrauben sagen, es gibt auch noch kleine Schrauben, die halt im Prinzip"}, {"id": 613, "start": 4950.68, "end": 4957.52, "text": "einfach nur noch kleiner sind. Alter, es ist wirklich kacke hier zu machen, weil ich stehe"}, {"id": 614, "start": 4957.52, "end": 4964.16, "text": "jetzt gerade über der Beleuchtung und gucke durch die Beleuchtung durch und versuche das"}, {"id": 615, "start": 4964.16, "end": 4989.56, "text": "irgendwie zu machen. Ich sehe nur die Hälfte, aber der Chat freut sich bestimmt. Hallo,"}, {"id": 616, "start": 4989.56, "end": 5001.44, "text": "kann ich hier reingehen, please? Oh, exellent. Kein Gross, naja, das ist normaler, ja. Kann"}, {"id": 617, "start": 5001.44, "end": 5007.68, "text": "ich aber auch mitleben. Oh, nächste Schraube. Das ist ja nicht so, als wäre das super kompliziert."}, {"id": 618, "start": 5007.68, "end": 5024.52, "text": "Zack. Und jetzt die letzte Schraube. Kommt das da unten hin? Jetzt sehe ich wenigstens"}, {"id": 619, "start": 5024.52, "end": 5032.32, "text": "auch ein bisschen was, wenn ich das so halte. Alles klar. Zack, da ist er drin. Sitzt, basst,"}, {"id": 620, "start": 5032.32, "end": 5039.24, "text": "kackelt und hat Luft, hat Opa jetzt dazu gesagt. So, was kommt als nächstes? Jetzt brauchen"}, {"id": 621, "start": 5039.24, "end": 5045.08, "text": "wir diese komischen Kühlblöcke und bringen sie auf beiden glatten Seiten des kleinen"}, {"id": 622, "start": 5045.08, "end": 5050.0, "text": "und großen Kühlkörpers die mitgelieferten Wärmelight Pets in entsprechender Größe"}, {"id": 623, "start": 5050.0, "end": 5056.76, "text": "auf. Wo sind da Wärmelight? Ach, hier, guck mal, da sind Wärmelight. Exquisite Wärmelight"}, {"id": 624, "start": 5056.76, "end": 5068.64, "text": "Pets. Der hier? Nee, der ist nicht aus dem Werkzeugkörper vom Aldi. Ich weiß nicht,"}, {"id": 625, "start": 5068.64, "end": 5075.08, "text": "wo der her ist. Ich habe da auch keinen Set zu, den habe ich schon ewig. Das kann sogar"}, {"id": 626, "start": 5075.08, "end": 5081.72, "text": "sein, dass der mal aus dem Aldi ist. Den nehme ich für alles, wo man irgendwie einfach"}, {"id": 627, "start": 5081.72, "end": 5087.04, "text": "was kleines braucht. Wenn ich keinen Bock habe, irgendwie einen Set rauszuholen oder"}, {"id": 628, "start": 5087.04, "end": 5096.68, "text": "so. So, jetzt haben wir hier die Wärmelight-Dinger, wenn die noch rausgehen. Siehst ihr was? Exquisite,"}, {"id": 629, "start": 5096.68, "end": 5112.92, "text": "einfach aufreißen. Hä? Was ist das für eine Wurst, Alter? Wie soll denn das da jetzt"}, {"id": 630, "start": 5112.92, "end": 5137.32, "text": "dran passen? Hm. Also, wie geht es weiter? Was? Bringen Sie auf beiden glatten Seiten"}, {"id": 631, "start": 5137.32, "end": 5141.52, "text": "des großen Krügel... Okay, also Sie wollen wirklich, dass man dieses Zeug da drauf macht?"}, {"id": 632, "start": 5141.52, "end": 5149.16, "text": "Na gut, machen wir. Reißen wir ab. Haben die geschrieben, auf beiden Seiten oder auf"}, {"id": 633, "start": 5149.16, "end": 5159.68, "text": "einer Seite? Das Präzisions-Werra-Schraubendreher-Set ist richtig poggers. Ich bin ja auch Werra-Fan,"}, {"id": 634, "start": 5159.68, "end": 5164.36, "text": "das wollte ich mir auch schon eine Weile mal kaufen, ja. Ich habe ja sonst auch volles"}, {"id": 635, "start": 5164.36, "end": 5170.2, "text": "Werra-Equipment. Bringen Sie auf beiden glatten Seiten. Okay, das heißt, ich soll da und"}, {"id": 636, "start": 5170.2, "end": 5177.08, "text": "da jetzt so ein Ding drauf packen? Wie funzt das überhaupt, so? Ist das das Wärmelight-Pad?"}, {"id": 637, "start": 5177.08, "end": 5187.24, "text": "Mache ich das jetzt richtig so? Excellent. Massive. Alles klar. Ich glaube, das da unten"}, {"id": 638, "start": 5187.24, "end": 5202.04, "text": "ist einfach Ersatz, falls man das mal wechseln muss. Okay. Jetzt kommt das andere, jetzt kommt"}, {"id": 639, "start": 5202.04, "end": 5229.2, "text": "das fette. Wenn man das irgendwie abkriegt. Oh. Alles klar. Erstmal abgerissen. Was ist"}, {"id": 640, "start": 5229.2, "end": 5237.72, "text": "denn für ein Gebabe, ey? Wer hat sich das ausgedacht? Okay, sehr gut. Und jetzt? Und"}, {"id": 641, "start": 5237.72, "end": 5244.56, "text": "jetzt? Wie geht es weiter? Wie geht es weiter? Und jetzt muss man das so auf... Oh, ich muss"}, {"id": 642, "start": 5244.56, "end": 5251.04, "text": "die alten Dinger erst mal abmachen. Lull. Guck mal, da sind ja noch welche drauf. Kann"}, {"id": 643, "start": 5251.04, "end": 5257.16, "text": "ich die da vielleicht drauf lassen? Bis auf die da? Bis auf die da? Also, wir müssen"}, {"id": 644, "start": 5257.16, "end": 5264.0, "text": "das einmal... Den kann ich auf jeden Fall drauf lassen. Aber den muss ich... Oh, scheiße."}, {"id": 645, "start": 5264.0, "end": 5273.56, "text": "One KS. Okay, ich hab's abgekriegt. Das ist das alte Wärmelight-Pad. Und welchen muss"}, {"id": 646, "start": 5273.56, "end": 5285.8, "text": "ich jetzt noch abmachen? Guckt mal. Den da. Also sprich, den da, hä? Den? Den oberen"}, {"id": 647, "start": 5285.8, "end": 5301.24, "text": "muss ich noch abmachen. Anleitungs-Champ, ja. So, also. Da, da. Das heißt, ich setze"}, {"id": 648, "start": 5301.24, "end": 5307.84, "text": "den Kram da jetzt einfach mal so drauf. Ich hoffe, das will jetzt nicht von mir geputzt"}, {"id": 649, "start": 5307.84, "end": 5321.84, "text": "werden oder sowas vorher. Den da. Und den da. Wahnsinnig schön ist das jetzt nicht, aber"}, {"id": 650, "start": 5321.84, "end": 5332.92, "text": "hält. Okay. Haben wir gemacht. Alles klar. Place Top Aluminium Case. Alles klar, das"}, {"id": 651, "start": 5332.92, "end": 5355.96, "text": "war's schon. Easy. Und jetzt einfach das Ding drauf. Wie rum? So rum, hä? Und ne, wie rum?"}, {"id": 652, "start": 5355.96, "end": 5367.6, "text": "Auf den Verwirrungs-Champ. Auf den... Das Große. Das Hohe Oben. Also so. Das macht"}, {"id": 653, "start": 5367.6, "end": 5393.92, "text": "schon richtig. So. Naja. Naja. Oder. Au. Alles klar. Ich putze das noch mal kurz hier"}, {"id": 654, "start": 5393.92, "end": 5412.36, "text": "ab. Was wollen die jetzt? So rum. Ich hatte es schon richtig. Wie soll ich das jetzt"}, {"id": 655, "start": 5412.36, "end": 5429.4, "text": "platzieren, so dass ich die Schrauben zu machen kann? Ja hab ich doch. Hab ich doch. So. Passt."}, {"id": 656, "start": 5429.4, "end": 5438.32, "text": "Close-Champ. So. Da ist zu. Und jetzt muss ich Schrauben rein machen. Okay, jetzt muss"}, {"id": 657, "start": 5438.32, "end": 5447.2, "text": "ich den Cute-Schraubendreher verwenden. Weil, ganz ehrlich, diese Mini-Furz-Schrauben. Alter,"}, {"id": 658, "start": 5447.2, "end": 5452.16, "text": "ich hab ja schon ewig keinen Schrauben, der nicht mal magnetisch ist. Da wirst du ja verrückt."}, {"id": 659, "start": 5452.16, "end": 5471.64, "text": "Fine-Motor-Skills-Over-9000. Okay, ein Vorteil hat dieses... Ach du Gro... So scheiße. Damit"}, {"id": 660, "start": 5471.64, "end": 5484.12, "text": "kannst du ja nichts drehen, ey. Was ist das? Ich hol gleich mal ein Set raus. Ordentlich"}, {"id": 661, "start": 5484.12, "end": 5500.16, "text": "gemacht. Kleine Furz-Scheiße. Okay, sehr gut. Excellent. Drehmoment gleich Null. Ich glaube,"}, {"id": 662, "start": 5500.16, "end": 5517.28, "text": "das kann man nicht mal Moment nennen. Okay, ist es drin? Alles klar. So, und jetzt mach"}, {"id": 663, "start": 5517.28, "end": 5529.84, "text": "ich mal kurz schnell die andere noch rein hier. Ah, hier kann man die... Hier könnte man jetzt"}, {"id": 664, "start": 5529.84, "end": 5544.68, "text": "irgendwie die GPIO-Sachen dran machen. Okay, das ist gar nicht mal so doof. Okay, wisst"}, {"id": 665, "start": 5544.68, "end": 5549.56, "text": "ihr, was das erste ist, was ich von diesem ganzen Set in Müll... In Müll buxieren werde."}, {"id": 666, "start": 5549.56, "end": 5565.88, "text": "Süßes Teil hier, ey. iFixit-Set holen. Ich hab ein iFixit-Set. Ich hab ein iFixit-Set,"}, {"id": 667, "start": 5565.88, "end": 5571.32, "text": "ich hab ein Vera Tool-Check+, ich hab das Vera-Elektriker-Set und noch ein paar Bits."}, {"id": 668, "start": 5571.32, "end": 5580.04, "text": "Ich hab da genug für, aber ich hab keinen Bock jetzt rauszugehen und das zu holen. So."}, {"id": 669, "start": 5580.04, "end": 5586.24, "text": "Fertig, Champ. Alles klar. Wir haben es geschafft. Guck mal, das kannst du sogar hier theoretisch"}, {"id": 670, "start": 5586.24, "end": 5589.56, "text": "irgendwo in die Wand schrauben oder so, wenn du willst. So, und mal gucken, was wir jetzt"}, {"id": 671, "start": 5589.56, "end": 5597.16, "text": "für Temperaturen haben. Jetzt bin ich mal gespannt. Jetzt bin ich mal gespannt, was"}, {"id": 672, "start": 5597.16, "end": 5609.2, "text": "wir da jetzt rauskriegen. Also. Erst mal hier einstöpseln. Und wo haben wir es hier? Strom"}, {"id": 673, "start": 5609.2, "end": 5618.44, "text": "einstöpseln. Sieht man da irgendwie LEDs? Guck mal. Das ist aber passiv gekühlt. Schalter."}, {"id": 674, "start": 5618.44, "end": 5633.6, "text": "Hm. Das ist natürlich doof. LEDs sieht man jetzt gar nicht. Ist ein bisschen blöd."}, {"id": 675, "start": 5633.6, "end": 5650.16, "text": "Ah doch, LEDs sieht man. Ich weiß nicht, ob ihr die LEDs seht. Man sieht da ein bisschen"}, {"id": 676, "start": 5650.16, "end": 5656.0, "text": "LEDs drin. Das passt. Jetzt ist er an. Okay, schauen wir mal. Jetzt gucken wir mal, wie"}, {"id": 677, "start": 5656.0, "end": 5671.32, "text": "die Temperatur jetzt ist. Ups. Gucken wir mal. Warten wir mal, bis das Teil wieder da"}, {"id": 678, "start": 5671.32, "end": 5686.28, "text": "ist. Schau mal, EFT getriggert. Nö, nicht, nicht, dass ich wüsste. Okay, schauen wir"}, {"id": 679, "start": 5686.28, "end": 5708.0, "text": "mal. Wie warm wird das Ganze denn jetzt? Zack. Machen wir es mal so. So. Okay, Stress. Jetzt"}, {"id": 680, "start": 5708.0, "end": 5716.64, "text": "sind wir mit 35 Grad schon mal ein bisschen kühler. Und jetzt mal mit voller Pulle. Also"}, {"id": 681, "start": 5716.64, "end": 5721.32, "text": "ich würde jetzt erwarten, dass der ehrlich gesagt um die 60 Grad bleibt und dann ist"}, {"id": 682, "start": 5721.32, "end": 5732.56, "text": "er auch gut, ja. Also wenn überhaupt. Das dauert jetzt ein bisschen, bis es hoch geht,"}, {"id": 683, "start": 5732.56, "end": 5738.16, "text": "weil das kann natürlich den ganzen Kram jetzt erst mal. Der kann natürlich jetzt den Kram"}, {"id": 684, "start": 5738.16, "end": 5751.0, "text": "wunderbar an das ganze Gehäuse abgeben. Ich räume mal kurz ein. Was ist das? Ach, Füßchen"}, {"id": 685, "start": 5751.0, "end": 5755.36, "text": "oder so? Braucht man nicht. Der kann das jetzt halt wunderbar ans Gehäuse abgeben. Das heißt,"}, {"id": 686, "start": 5755.36, "end": 5768.16, "text": "dass es jetzt warm wird, braucht es halt ein bisschen. Aber ihr seht es am Stromverbrauch,"}, {"id": 687, "start": 5768.16, "end": 5776.04, "text": "dass der volle Pulle hat. Also vielleicht bleibt er sogar eine ganze Ecke unter 60."}, {"id": 688, "start": 5776.04, "end": 5782.2, "text": "Ja guck mal, 47. Das hat sich schon mal gelohnt. Was ich mit der Hand gemacht habe, ich habe"}, {"id": 689, "start": 5782.2, "end": 5796.6, "text": "heute mit meiner Katz Wilde Fang die Hand Sachen gespielt. Okay, das bleibt eine ganze Ecke"}, {"id": 690, "start": 5796.6, "end": 5799.68, "text": "kühler. Das hat sich gelohnt. Das hat sich gelohnt. Und man muss doch jetzt auch mal sagen,"}, {"id": 691, "start": 5799.68, "end": 5803.48, "text": "jetzt mal ernsthaft Leute, so scheiße sieht das Gehäuse doch gar nicht aus. Das sieht"}, {"id": 692, "start": 5803.48, "end": 5806.56, "text": "doch eigentlich wirklich in Ordnung aus. Kann man sich nicht beschweren, oder? Ich finde"}, {"id": 693, "start": 5806.56, "end": 5814.8, "text": "es eigentlich ein ganz nettes Case und kostet nicht viel. 20 Euro oder so. Und das da drinnen"}, {"id": 694, "start": 5814.8, "end": 5822.4, "text": "sieht ein bisschen kacke aus mit diesen Pads. Weil man es halt einfach sieht. Auf der anderen"}, {"id": 695, "start": 5822.4, "end": 5825.6, "text": "Seite, man hätte es auch zumachen können, dann sieht man es nicht. Oder was man hätte"}, {"id": 696, "start": 5825.6, "end": 5830.48, "text": "machen können, merkt ihr, dass das Gehäuse warm wird? Minimal, nicht wirklich großartig,"}, {"id": 697, "start": 5830.48, "end": 5844.04, "text": "weil hat ja auch viel Flasche zum abgeben hier. Das Clear Case macht es besser. Das"}, {"id": 698, "start": 5844.04, "end": 5852.0, "text": "Clear Case hat direkt im Gehäuse sowas hier eingebaut, was man auf die CPU drückt. Immer"}, {"id": 699, "start": 5852.0, "end": 5856.68, "text": "noch die Katze von den Videos, die du aus dem Bett-Sofa kommst. Nee, leider nicht mehr."}, {"id": 700, "start": 5856.68, "end": 5869.08, "text": "An Katzen, ich hatte die hier. Das ist die von den Videos, die ich früher mal gemacht"}, {"id": 701, "start": 5869.08, "end": 5875.44, "text": "habe. Danach hatte ich die. Die hat es leider nicht so lange ausgehalten. Und dann jetzt"}, {"id": 702, "start": 5875.44, "end": 5887.84, "text": "habe ich die hier. Das ist auch schon das zweite Jahr, wo ich die wieder habe. Schicko."}, {"id": 703, "start": 5887.84, "end": 5900.96, "text": "Diggerkatze. Schmitty2802, Dankeschön für den Sub. Ok, es wird langsam wärmer. Jetzt"}, {"id": 704, "start": 5900.96, "end": 5907.36, "text": "noch Noctua-Lüfter montieren. Es wird langsam wärmer und ich merke das auch. Ich merke"}, {"id": 705, "start": 5907.36, "end": 5914.72, "text": "schon, dass es, gerade hier, wo die CPU ist, lauwarm wird. Aber ansonsten eigentlich kein"}, {"id": 706, "start": 5914.72, "end": 5927.24, "text": "großartiges Ding. Schon in Ordnung. Ja. Was auch witzig ist, man sieht, dass die Temperatur"}, {"id": 707, "start": 5927.24, "end": 5947.6, "text": "geht runter, wenn ich die Hand drauf lege. Nicht wirklich. Merkt man nicht. So. Du brauchst"}, {"id": 708, "start": 5947.6, "end": 5952.04, "text": "nun sowas. Nee, nee, brauch ich nicht. Ich weiß genau, was es ist, was mir zeigen willst."}, {"id": 709, "start": 5952.04, "end": 5957.88, "text": "Nee, brauch ich nicht. Also, wäre sicherlich cool, aber die Dinger sind teuer ohne Ende."}, {"id": 710, "start": 5957.88, "end": 5970.76, "text": "30 Euro? Echt? So billig ist das? Ich habe mal geguckt, das letzte Mal, wo ich nach sowas"}, {"id": 711, "start": 5970.76, "end": 5977.64, "text": "geguckt habe, hat das irgendwie 280 Euro gekostet oder sowas. Infrarot-Thermometer-Optik. Ok,"}, {"id": 712, "start": 5977.64, "end": 5984.92, "text": "das ist cool. Sowas wäre wirklich nice. Kommt wieder ein Garten-Haus-Tour. Vielleicht,"}, {"id": 713, "start": 5984.92, "end": 5993.32, "text": "ja, wenn ich gucke, dass ich nicht so viel reveale. Ok. Tja, also das Gehäuse gefällt"}, {"id": 714, "start": 5993.32, "end": 5998.72, "text": "mir, das hat was. Da können wir jetzt mit der eigentlichen Sache weitermachen. Ich lasse"}, {"id": 715, "start": 5998.72, "end": 6001.44, "text": "den mal weiterlaufen. Ich mach mal ein bisschen, ich mach mal ein bisschen den ganzen Crap"}, {"id": 716, "start": 6001.44, "end": 6008.88, "text": "hier weg, dass der nicht im Weg liegt. Wobei, den da, den lassen wir mal kurz draußen."}, {"id": 717, "start": 6008.88, "end": 6020.6, "text": "Zeug weg, weg. Schmeißen wir mal hier unten auf die Erd. Alles klar. Gut. Das heißt,"}, {"id": 718, "start": 6020.6, "end": 6029.76, "text": "wir haben das Ding jetzt, ja doch, ein bisschen warm wird es. Aber ganz ehrlich, jetzt nicht"}, {"id": 719, "start": 6029.76, "end": 6034.28, "text": "so in dem Rahmen, dass man da nicht die Hand drauf lassen könnte. Und vor allem, das Ding"}, {"id": 720, "start": 6034.28, "end": 6045.84, "text": "hat ja auch nicht Volllast die ganze Zeit. Matt kann durchaus sein. Exzellent. So, da"}, {"id": 721, "start": 6045.84, "end": 6050.04, "text": "brauchen wir hier alles nicht. So, gut. Ich hab, was hab ich noch übrig? Noch zwei Schrauben."}, {"id": 722, "start": 6050.04, "end": 6054.28, "text": "Gut, die sind wahrscheinlich Bonus. Die brauchen wir wahrscheinlich für nix, weil, ne, ist"}, {"id": 723, "start": 6054.28, "end": 6060.96, "text": "ja überall dran. Was ist denn das da eigentlich hier hinten? Vielleicht wegen dem Sensor"}, {"id": 724, "start": 6060.96, "end": 6065.88, "text": "zum hinten rausführen oder so. Ehrlich gesagt kein Schimmer, wofür das Loch da hinten drin"}, {"id": 725, "start": 6065.88, "end": 6073.0, "text": "ist. Man weiß es nicht. Ach guck mal, man sieht ja die LEDs da durch. Poggers. Guck mal,"}, {"id": 726, "start": 6073.0, "end": 6077.72, "text": "das ist ja richtig durchdacht. Das seh ich ja jetzt zum ersten Mal. Die haben sogar"}, {"id": 727, "start": 6077.72, "end": 6083.88, "text": "Löcher für die LEDs gemacht. Könntest du mal wieder ein Video von einem Serverraum"}, {"id": 728, "start": 6083.88, "end": 6087.32, "text": "machen? Am Serverraum hat sich nicht so viel geändert, aber PC Setup würd ich ja gerne"}, {"id": 729, "start": 6087.32, "end": 6092.8, "text": "machen, aber dazu müsstest du erst mal ein neues PC kaufen. Gibt dir aktuell nix. LED"}, {"id": 730, "start": 6092.8, "end": 6099.04, "text": "Champ, ja. Was auch witzig ist, man sieht, dass der Verbrauch ein bisschen hoch geht,"}, {"id": 731, "start": 6099.04, "end": 6104.12, "text": "je nachdem wie warm das ganze Ding wird. Also der braucht potenziell mehr, wenn er wärmer"}, {"id": 732, "start": 6104.12, "end": 6115.84, "text": "wird. Ok, dann würd ich mal sagen, schließen wir mal. Hier ist das die Erde. Oder was"}, {"id": 733, "start": 6115.84, "end": 6123.4, "text": "machen wir jetzt eigentlich? Ich überleg gerade. Was machst du gerade? Also gerade haben"}, {"id": 734, "start": 6123.4, "end": 6129.88, "text": "wir getestet, ob das Gehäuse wirklich was bringt, von der Wärme her. Und es bleibt"}, {"id": 735, "start": 6129.88, "end": 6143.6, "text": "20 Grad kühler. Ja komm, wir machen jetzt schonmal die SSD dran. Da brauchen wir den"}, {"id": 736, "start": 6143.6, "end": 6155.76, "text": "Adapters. Ja, Adapters. Zack. Und welchen USB Anschluss nennen wir da jetzt? Ja, unteren"}, {"id": 737, "start": 6155.76, "end": 6168.08, "text": "USB 3. Alles klar. Können wir das vielleicht sogar so machen? Geht das? Ah, nicht wirklich."}, {"id": 738, "start": 6168.08, "end": 6186.84, "text": "Warte mal, ich machs mal obendran. Mach das mal obendran. Dass es ein bisschen mehr Radius"}, {"id": 739, "start": 6186.84, "end": 6205.2, "text": "gibt. Ja, ok. Ne im Moment Kabelbinder, ich dachte gerade an was anderes. Wir haben doch"}, {"id": 740, "start": 6205.2, "end": 6212.28, "text": "hier noch so ein Pad übrig. Wir haben hier noch so ein Pad. Wir haben einmal so ein Pad"}, {"id": 741, "start": 6212.28, "end": 6223.16, "text": "für die Füßchen. Und wir haben auch so zwei Pads. Dann machen wir einfach zwei Pads dran."}, {"id": 742, "start": 6223.16, "end": 6231.24, "text": "Das hält nicht richtig glaube ich. Besser wäre ja wenn man das reinschrauben könnte"}, {"id": 743, "start": 6231.24, "end": 6255.8, "text": "irgendwie. Ok Leute, ich hab ne Idee. Ich hab ne Idee. Pass mal auf. Massive Idee. So."}, {"id": 744, "start": 6255.8, "end": 6282.48, "text": "Ah. Achtung. Next. Ah. Druck doch ein Gehäuse. Ne. Gedruckt das Gehäuse nicht aus Metall."}, {"id": 745, "start": 6282.48, "end": 6295.92, "text": "Mach mal einfach so. Komm mal her. Jetzt mach mal einfach so. Da. Komm noch eins hin. Ah."}, {"id": 746, "start": 6295.92, "end": 6309.36, "text": "Ah. Hallo. Oh ne. Da ist noch. Oh fuck wie krieg ich denn das jetzt ab? Monka. Jetzt."}, {"id": 747, "start": 6309.36, "end": 6323.92, "text": "Ok. X. Hyper Giga. Ah. Ah. Sieht ein bisschen aus wie beim Zahnarzt jetzt. Oh nu. Oh nu."}, {"id": 748, "start": 6323.92, "end": 6339.36, "text": "Pock Champ. Ist das nicht nice? Pock Moment. Ja. Guck mal. Ist das nicht cool? Jetzt haben"}, {"id": 749, "start": 6339.36, "end": 6343.24, "text": "wir die SSD hier unten dran mit Wärmeleitpads. Und es ist, ohne Mist, es ist sogar relativ"}, {"id": 750, "start": 6343.24, "end": 6349.48, "text": "fest das Ding. Wir drücken jetzt mal. Wir drücken jetzt mal ordentlich das Ding fest."}, {"id": 751, "start": 6349.48, "end": 6354.88, "text": "Das ist fest. Massive fest. Nice. Das steht ja dann eh so da. Das geht nicht ab. Passt."}, {"id": 752, "start": 6354.88, "end": 6372.04, "text": "Nice. Pock Champ Moment. Alles klar. Gut. Geällt mir. Alles klar. Jetzt haben wir das."}, {"id": 753, "start": 6372.04, "end": 6377.96, "text": "Gehen wir mal rüber. Wir sind immer noch bei 58 Grad. Alles in Ordnung. Passt. Doch hält."}, {"id": 754, "start": 6377.96, "end": 6386.88, "text": "Hält. Kann Ding. Hält sogar richtig gut. Ach so Moment ich solls euch vielleicht mal"}, {"id": 755, "start": 6386.88, "end": 6407.88, "text": "zeigen. Hält richtig gut. So. Gut. Jetzt hätten wir das. Also bleibt auch schön kühl."}, {"id": 756, "start": 6407.88, "end": 6419.52, "text": "Ähm. Können wir mal gucken, als was er die erkannt hat. SDA hat er das ganze erkannt."}, {"id": 757, "start": 6419.52, "end": 6430.08, "text": "Also. Machen wir mal. MKFS. Jetzt haben wir es total. Machen wir das nächste FS drauf"}, {"id": 758, "start": 6430.08, "end": 6437.04, "text": "oder machen wir ein X4. X4. X4 kannst du immer gut lesen. DEF SDA. Um mal zu kurz zu überprüfen,"}, {"id": 759, "start": 6437.04, "end": 6442.88, "text": "dass auch wirklich das Richtige ist. Gucken wir mal was er da erkannt hat. Vmware. Warum"}, {"id": 760, "start": 6442.88, "end": 6449.76, "text": "ist da Vmware drauf? Ah. Wisst ihr was? Das ist die SSD, wo wir mal den ESX auf dem Raspberry"}, {"id": 761, "start": 6449.76, "end": 6454.4, "text": "Pi getestet haben. Könnt ihr euch da noch dran erinnern? Wir haben noch mal das ESX"}, {"id": 762, "start": 6454.4, "end": 6461.4, "text": "Bild für den Raspberry Pi getestet. Ah gut. Dann machen wir das. Das fliegt jetzt weg."}, {"id": 763, "start": 6461.4, "end": 6473.44, "text": "MKFS. X4. DEF SDA. Bäm. Found GPT Partitionable Proceed. Yes. ESXI. Ja, haben wir mal ausprobiert."}, {"id": 764, "start": 6473.44, "end": 6487.28, "text": "So. Fertig. Jetzt gucken wir mal wie schnell das ganze ist. Mount. DEF SDA auf Mount."}, {"id": 765, "start": 6487.28, "end": 6495.28, "text": "DEF SDA. Kann Windows X4 eigentlich lesen? Nein. Mich würde es auch sehr wundern wenn"}, {"id": 766, "start": 6495.28, "end": 6503.12, "text": "das Microsoft einbauen würde. Wir machen das ohne Idee. Wir machen die Big Brain Anzeige"}, {"id": 767, "start": 6503.12, "end": 6519.12, "text": "wie schnell die SSD ist. Wir sagen CAT DEF 0 nach PV und das umgeleitet nach Image Bin."}, {"id": 768, "start": 6519.12, "end": 6527.8, "text": "Also, die SSD ist nicht allzu schnell. Moment bin ich überhaupt auf der SSD jetzt drauf?"}, {"id": 769, "start": 6527.8, "end": 6542.84, "text": "Auf Mount. Ja. Ok, Geschwindigkeit von der SSD ist jetzt nicht die geilste. Was aber"}, {"id": 770, "start": 6542.84, "end": 6554.12, "text": "höchstwahrscheinlich an der SSD liegt, das ist ja auch so eine Low Budget SSD. Wobei"}, {"id": 771, "start": 6554.12, "end": 6559.52, "text": "ich mich halt frage, was geht maximal über den USB 3? So viel mehr dürfte das doch gar"}, {"id": 772, "start": 6559.52, "end": 6567.52, "text": "nicht sein, oder? Das ist doch ein 3.0er oder was hat denn der? Was hat denn der für"}, {"id": 773, "start": 6567.52, "end": 6580.96, "text": "korrekte USB Speck? USB 3.0 Port. Moment, Moment, Moment. Wir wissen alle, dass das"}, {"id": 774, "start": 6580.96, "end": 6589.8, "text": "nicht USB 3.0 heißt. Wir wissen alle, dass das USB 3.2 Gen 1 ist. Also lügt uns nicht"}, {"id": 775, "start": 6589.8, "end": 6600.24, "text": "an Raspberry Pi. Alles klar, ok funktioniert. Also für Videos ist das Ganze auf jeden Fall"}, {"id": 776, "start": 6600.24, "end": 6611.88, "text": "schnell genug. Bin ich zufrieden mit. USB ist echt grausam. So und jetzt ganz wichtig"}, {"id": 777, "start": 6611.88, "end": 6634.0, "text": "abinstall Prometheus Note Exporter. Das kommt natürlich auch noch ins Monitoring rein. Prometheus"}, {"id": 778, "start": 6634.0, "end": 6650.52, "text": "ist ein cooles Dashboard. Ohne Dashboard geht hier nix. Big Brain Dashboard. Tu mal so als"}, {"id": 779, "start": 6650.52, "end": 6654.32, "text": "hättest du Ahnung davon was was. Ja wenn du was wissen willst, frag. Ansonsten was wir"}, {"id": 780, "start": 6654.32, "end": 6658.56, "text": "grob gemacht haben ist, ich hab ehrlich gesagt nur eine Raspberry Pi 4 in den Gehäuse eingebaut"}, {"id": 781, "start": 6658.56, "end": 6665.04, "text": "bis jetzt und geguckt ob das kühler bleibt CPU Temperatur mäßig wie vorher und es bleibt"}, {"id": 782, "start": 6665.04, "end": 6670.52, "text": "deutlich kühler. Es bleibt 20 Grad kühler. Achja und dann haben wir eine SSD unten dran"}, {"id": 783, "start": 6670.52, "end": 6685.8, "text": "gepappt. Das war's. So. Twitch hat mir grad vorgeschlagen, dass ich das posten soll."}, {"id": 784, "start": 6685.8, "end": 6691.36, "text": "Warum auch immer. So also wie viel RAM haben wir am Start? 4G. Also sprich das ist ein"}, {"id": 785, "start": 6691.36, "end": 6695.08, "text": "mittlerer Raspberry Pi 4, das ist nicht die 8G Variante. Und ich muss euch ehrlich sagen"}, {"id": 786, "start": 6695.08, "end": 6702.28, "text": "Hand aufs Herz die 8G Variante, das Geld kann man sich sparen, weil was kannst du mit einem"}, {"id": 787, "start": 6702.28, "end": 6708.56, "text": "Raspberry Pi 4 großartig machen, was wirklich 8G braucht, wo du mit 4 nicht auskommst. Mir"}, {"id": 788, "start": 6708.56, "end": 6716.16, "text": "fällt ehrlich gesagt nicht allzu viel zu ein. Wie viel hat das gekreuzt? Ich glaub 20 Euro"}, {"id": 789, "start": 6716.16, "end": 6731.16, "text": "oder so. Gucken wir mal. Pi IC Box. 15, ja, ne, das ist nicht, das da ist das. Das ist"}, {"id": 790, "start": 6731.16, "end": 6737.52, "text": "gar nicht mehr lieferbar, guck mal. Haha, lull. Ist ausverkauft mittlerweile. Aber das hier"}, {"id": 791, "start": 6737.52, "end": 6747.44, "text": "geht bestimmt auch. Moment, das ist mit Lüfter, oder? Das ist mit Lüfter? Ne, das ist ja Kackkonstruktion."}, {"id": 792, "start": 6747.44, "end": 6756.2, "text": "Das ist ja ne richtige Pepega-Konstruktion. Also das ist ja schon ne richtige Pepega-Konstruktion."}, {"id": 793, "start": 6756.2, "end": 6760.2, "text": "Warum sollte ich denn da Passivkühler hin machen und das Gehäuse dann oben drauf, das"}, {"id": 794, "start": 6760.2, "end": 6768.8, "text": "muss wenn schon verbunden sein mit dem Gehäuse. Richtig Pepega-Konstruktion, ja. Also wie gesagt,"}, {"id": 795, "start": 6768.8, "end": 6782.8, "text": "ich hab das hier. IC Box, IC Box, so, da gibt's bestimmt noch mehr. Ja, 19 Euro. Wie gesagt,"}, {"id": 796, "start": 6782.8, "end": 6786.96, "text": "ich glaube ich hab's bei Amazon für 20 Euro gekauft, halt inklusive Versand und allem,"}, {"id": 797, "start": 6786.96, "end": 6793.76, "text": "wie es halt bei Amazon immer ist. Wenn du ein richtig gutes Gehäuse haben willst, also"}, {"id": 798, "start": 6793.76, "end": 6818.8, "text": "das hier ist meiner Meinung nach das Beste. Ne, nein, das 50, das da. Das kostet aber"}, {"id": 799, "start": 6818.8, "end": 6829.28, "text": "nicht. Also das finde ich persönlich das Beste, aber das war nicht mehr lieferbar. Du bist"}, {"id": 800, "start": 6829.28, "end": 6843.92, "text": "mit dem hier ganz zufrieden. Boah, kann man alles nehmen. So, also. Wir haben Prometos"}, {"id": 801, "start": 6843.92, "end": 6847.56, "text": "installiert, jetzt können wir das Ganze ins Monitoring hinzufügen. Jetzt installieren wir"}, {"id": 802, "start": 6847.56, "end": 6851.24, "text": "noch Unify, ich bin mir nicht ganz sicher ob Unify überhaupt dabei ist, standardmäßig"}, {"id": 803, "start": 6851.24, "end": 6859.08, "text": "glaube ich nicht. Ne, da brauchen wir nämlich extra Debian-Repos, kann ich mir noch dunkel"}, {"id": 804, "start": 6859.08, "end": 6870.52, "text": "dran erinnern. Raspberry Pi, Unify, Repos. Installing Unify-Control und Raspberry Pi,"}, {"id": 805, "start": 6870.52, "end": 6880.08, "text": "genau das wollen wir machen. Accept. Jaja, geht's fort. Blablabla. Leute, es ist so weit."}, {"id": 806, "start": 6880.08, "end": 6901.64, "text": "Es ist so weit. Wir kommen nicht drum herum. Ich ahne Schlimmes. Was macht der denn da"}, {"id": 807, "start": 6901.64, "end": 6905.52, "text": "alles? Das mussten wir doch glaube ich gar nicht machen. Komm, warum machen die das so"}, {"id": 808, "start": 6905.52, "end": 6913.12, "text": "kompliziert? Konnte man nicht einfach abinstall Unify machen? Das war doch easy as fuck. Ja,"}, {"id": 809, "start": 6913.12, "end": 6923.36, "text": "genau. So in der Richtung. Es ist schon zwei Jahre her wo ich das inszeniert habe, zum"}, {"id": 810, "start": 6923.36, "end": 6948.32, "text": "letzten Mal. Aber das war total easy. Jaja, blablabla. Fuck. Was machen die denn da für"}, {"id": 811, "start": 6948.32, "end": 6952.68, "text": "komplizierte Dinge? Das war doch total, das da muss man machen, genau das war alles. Mehr"}, {"id": 812, "start": 6952.68, "end": 6966.08, "text": "musste man nicht machen. Wobei man sich das hier auch sparen kann, ehrlich gesagt. Man"}, {"id": 813, "start": 6966.08, "end": 6982.52, "text": "sagt einfach ETC. Abt. Sources List. Oh, kein Wim installiert. Direkt hinterher. Unify Installation"}, {"id": 814, "start": 6982.52, "end": 6988.32, "text": "Scripts. Oh, kein Install Script. Das kommt einfach über das Repo und Gutes. Hast du"}, {"id": 815, "start": 6988.32, "end": 7004.08, "text": "noch Kontakt zum Friseur? Klar. Natürlich. Abt. Oh. Bam. Ohne Echo. Zack. Update. Fertig,"}, {"id": 816, "start": 7004.08, "end": 7009.36, "text": "mehr mussten wir noch gar nicht machen. Hätte ich schon gewonnen? Achso, ja, ja, ja. Den"}, {"id": 817, "start": 7009.36, "end": 7021.92, "text": "Key können wir auch noch importieren. Das geht doch. Moment, Moment, Moment. Das ging"}, {"id": 818, "start": 7021.92, "end": 7030.6, "text": "doch anders. Man konnte doch Key Import machen. How to import Abt. Key. Was ist das wieder"}, {"id": 819, "start": 7030.6, "end": 7047.76, "text": "für eine komische Anleitung? Abt. Key. Na gut, komm. Easy. Machen wir es so. So. Und"}, {"id": 820, "start": 7047.76, "end": 7056.56, "text": "jetzt Abt. Update. Und nun können wir Unify Installation"}, {"id": 821, "start": 7056.56, "end": 7062.16, "text": "Script machen. Der Kabu muss einen Klassen Guide weitermachen. Ich glaube, der ist da"}, {"id": 822, "start": 7062.16, "end": 7080.36, "text": "durch mit der Sache. Ah, das muss man noch installieren. Okay. Hat er wahrscheinlich"}, {"id": 823, "start": 7080.36, "end": 7091.0, "text": "schon? Nee, hat er noch nicht. Abt. Install. Unify. Genau. Abt. Update haben wir schon gemacht."}, {"id": 824, "start": 7091.0, "end": 7102.6, "text": "So, und jetzt soll unsere Unify Kontrolle haben. Abt. Install. Unify. Achso, warte mal, welche"}, {"id": 825, "start": 7102.6, "end": 7111.8, "text": "Version ist das jetzt? Was ist jetzt Version Nummer? Seht ihr irgendwas? 6. Oh, oh, oh."}, {"id": 826, "start": 7111.8, "end": 7117.72, "text": "Wie gesagt, ich habe auf dem alten noch 5. Mal gucken, ob sich meine Config importieren"}, {"id": 827, "start": 7117.72, "end": 7121.88, "text": "lässt. Das werde ich jetzt aber nicht on stream machen, weil dann leake ich alle möglichen"}, {"id": 828, "start": 7121.88, "end": 7149.44, "text": "Sachen. Bin mal gespannt, ob sich da meine Config importieren lässt. So, bei der Gelegenheit"}, {"id": 829, "start": 7149.44, "end": 7163.64, "text": "wollen wir gerade hoch, wo wir gerade dabei sind. Welche Window Manager? Das ist E3WM."}, {"id": 830, "start": 7163.64, "end": 7173.36, "text": "Wir machen mal einen Eintrag in der fstub, dass er die SSD jedes Mal mountet. Etc fstub."}, {"id": 831, "start": 7173.36, "end": 7178.68, "text": "Leute, gibt es irgendjemand auf dieser Welt, der fstub Einträge aus dem Kopf kann? Ich"}, {"id": 832, "start": 7178.68, "end": 7182.28, "text": "kann das nie, ich muss immer nachgucken. Ich kann mir auch immer nicht merken, was das"}, {"id": 833, "start": 7182.28, "end": 7190.48, "text": "hier hinten bedeutet. Ich weiß, dass er abbricht beim booten oder weiter bootet und wenn das"}, {"id": 834, "start": 7190.48, "end": 7196.84, "text": "nicht mounten kann, kann mir das nie merken. Echt nicht, ich kriege es nicht gemacht."}, {"id": 835, "start": 7196.84, "end": 7209.96, "text": "Also, wir können das ja schon mal kopieren, zum größten Teil. Hoch. Es hängt. Na klar,"}, {"id": 836, "start": 7209.96, "end": 7213.64, "text": "du... Ja, ja, ist klar, Leute. Wobei wir machen es vielleicht... Ach komm, wir machen es mal"}, {"id": 837, "start": 7213.64, "end": 7231.92, "text": "mit dem mount MNT. X4. Also MNT. Also PartitionUI muss anders sein. Warte mal, also es gibt"}, {"id": 838, "start": 7231.92, "end": 7239.4, "text": "doch... Das ist doch auch, ob er automatisch Checkdisk macht oder nicht, ne? Ich kann mir"}, {"id": 839, "start": 7239.4, "end": 7254.24, "text": "das nicht merken. Archwiki ist beste, ja, das stimmt. Also, FSCK, genau, also. Soll er"}, {"id": 840, "start": 7254.24, "end": 7260.6, "text": "ein automatisches FSCK machen, ist okay, es passt, darf er machen. Genau, 2 ist, wenn"}, {"id": 841, "start": 7260.6, "end": 7272.8, "text": "er fehlt, schlägt, dann... Was bedeutet 2? Das wäre natürlich noch eine gute Erklärung"}, {"id": 842, "start": 7272.8, "end": 7287.28, "text": "dafür. Ah, die Reihenfolge, okay, dann ist das 2, ist in Ordnung. It's checked by dumb"}, {"id": 843, "start": 7287.28, "end": 7296.6, "text": "und das fehlt... Immer. Du kannst no fail... Ah, ich kann... Ohne Scheiß, ich kann mir"}, {"id": 844, "start": 7296.6, "end": 7306.56, "text": "diesen Kram im Kopf nicht merken. No fail an der Stelle? Nee, ne? So, zumindest brauchen"}, {"id": 845, "start": 7306.56, "end": 7317.6, "text": "wir jetzt erstmal die PartitionUI. Kommt mit hier die Kram mal aus. DLK, all die, was"}, {"id": 846, "start": 7317.6, "end": 7336.48, "text": "hat man da? Ja, die brauchen wir. UUID, zack, zack, zack, genau. Guck mal, ob das funktioniert,"}, {"id": 847, "start": 7336.48, "end": 7343.64, "text": "was ich da gebastelt hab. Was ist mit meiner Maus los? Ah, warum ist in dem Wim standardmäßig"}, {"id": 848, "start": 7343.64, "end": 7355.84, "text": "Maus-Support an? Was ist das denn für Pepega-Settings? So, der sollte jetzt eigentlich meine SSD"}, {"id": 849, "start": 7355.84, "end": 7364.32, "text": "mounten bei jedem Boot, wenn ich das richtig gemacht hab. Schauen wir mal, ob ich das richtig"}, {"id": 850, "start": 7364.32, "end": 7382.8, "text": "gemacht hab. Rebooten wir mal. Hat das Unify-Zeug installiert? Hat das Unify-Zeug installiert?"}, {"id": 851, "start": 7382.8, "end": 7393.04, "text": "Da läuft Unify-Zeug, ja. Netstat läuft da auch Unify-Zeug. System, CTL, Status, Unify."}, {"id": 852, "start": 7393.04, "end": 7403.2, "text": "Failed. Oh, ich hab keinen Java installiert. Monka-A. Mount-A bringt mir grad nix, weil"}, {"id": 853, "start": 7403.2, "end": 7407.8, "text": "es ist schon gemountet. Aber du hast recht, ich könnte es einfach mal anmounten. Und dann"}, {"id": 854, "start": 7407.8, "end": 7415.92, "text": "machen wir Mount-A. Exzellent. Und es hat funktioniert. Sehr gut. Warum hat der Java"}, {"id": 855, "start": 7415.92, "end": 7420.8, "text": "bitteschön nicht als Abhängigkeiten drinne? Ist doch total bescheuert, wenn die schon"}, {"id": 856, "start": 7420.8, "end": 7445.52, "text": "Pakete haben. Und es muss anscheinend 8 sein. Das andere geht nicht. Was ist Monka-A? Wir"}, {"id": 857, "start": 7445.52, "end": 7464.48, "text": "bräuchten das Emote, ja. Alter, was will der von mir? Stopp. Start. Ah, easy, jetzt"}, {"id": 858, "start": 7464.48, "end": 7476.32, "text": "funktioniert's. Netstat. Bam. Da läuft's. Ganz viel Java. 1, 2, 1, 2, 1, 2, 1, 4, 7."}, {"id": 859, "start": 7476.32, "end": 7486.76, "text": "Bam. Ach nee. Was, HTTPS? Nee, nee, nee. 80, 80. Jawoll. Restore vom Backup machen"}, {"id": 860, "start": 7486.76, "end": 7492.36, "text": "wir. Restore vom Backup. Das mach ich aber nicht on stream, sag ich euch gleich. Da"}, {"id": 861, "start": 7492.36, "end": 7496.08, "text": "lieg ich alle möglichen WLAN-Keys und Sachen im Zweifelsfall, da hab ich keinen Bock drauf."}, {"id": 862, "start": 7496.08, "end": 7503.24, "text": "Okay, aber Unify-Controller läuft, ist schon mal ganz gut. Und jetzt gucken wir mal. Leute,"}, {"id": 863, "start": 7503.24, "end": 7508.32, "text": "meint ihr, meint ihr, es funktioniert, dass ich jetzt in meinem Dashboard den neuen Raspberry"}, {"id": 864, "start": 7508.32, "end": 7515.4, "text": "Pi sehe? Also ich hab legit noch nicht nachgeguckt. Ich hab den Prometos-Agent installiert und"}, {"id": 865, "start": 7515.4, "end": 7522.08, "text": "ich hab im Vorfeld schon in meine Config die feste IP, also die DACP-IP von dem Raspberry"}, {"id": 866, "start": 7522.08, "end": 7533.12, "text": "Pi reingeschrieben. Das hab ich schon gemacht. Gucken wir mal. Grafana. Manage. Node-Exporter."}, {"id": 867, "start": 7533.12, "end": 7544.88, "text": "Da isser. Massive Dashboard. Big Brain Dashboard haben wir jetzt. So muss das sein. Stellen"}, {"id": 868, "start": 7544.88, "end": 7550.12, "text": "wir's mal auf 15 Minuten. Jawoll. Da kamen die ganzen Statistik-Fans, die können sich"}, {"id": 869, "start": 7550.12, "end": 7561.36, "text": "jetzt freuen. Auch gleich die Mario-Krusel-Musik am Start. Guck mal, wir haben jetzt richtig"}, {"id": 870, "start": 7561.36, "end": 7567.04, "text": "schönes Dashboard für den Raspberry Pi. Exquisite. Und wisst ihr was cool ist, dass"}, {"id": 871, "start": 7567.04, "end": 7572.28, "text": "sogar die Temperatur drin steht irgendwo. Hier, guck mal, wir haben sogar die Temperatur"}, {"id": 872, "start": 7572.28, "end": 7585.32, "text": "drin stehen. Wie konnte man hier nochmals Light-Theme machen? Wo konnte man das nochmal"}, {"id": 873, "start": 7585.32, "end": 7601.88, "text": "auf Light-Theme umschalten? Ich will mal gucken, wie es mit Light aussieht. Light-Theme. Was"}, {"id": 874, "start": 7601.88, "end": 7607.44, "text": "bringt das Dashboard? Du kannst zum Beispiel gucken, wenn ein Raspberry Pi abkackt. Natürlich"}, {"id": 875, "start": 7607.44, "end": 7610.72, "text": "sind's jetzt ein bisschen Overkill, was da drin ist. Du kannst zum Beispiel gucken, wenn"}, {"id": 876, "start": 7610.72, "end": 7616.04, "text": "ein Raspberry Pi abkackt, was die letzten Werte waren. Und vielleicht kommst du dann"}, {"id": 877, "start": 7616.04, "end": 7621.6, "text": "drauf. Ah, okay. Übrigens, das ist der falsche. Und dann siehst du dann zum Beispiel, okay,"}, {"id": 878, "start": 7621.6, "end": 7627.56, "text": "irgendwie ist ihm der Ram ausgegangen. Zum Beispiel, würdest du dann sehen. Du kannst"}, {"id": 879, "start": 7627.56, "end": 7631.92, "text": "hier einstellen. Ich geh jetzt mal auf den. Du kannst hier einstellen. Letzte 24 Stunden,"}, {"id": 880, "start": 7631.92, "end": 7635.64, "text": "letzte 7 Stunden. Ich glaub, ich hab 30 Tage. Ich glaub, 30 Tage hebt er auf bei mir die"}, {"id": 881, "start": 7635.64, "end": 7640.72, "text": "Daten. Und da kann ich dann nachgucken, okay, was war denn? Da seh ich, ah, guck mal, da"}, {"id": 882, "start": 7640.72, "end": 7645.68, "text": "hing jetzt 2 Stunden auf 100% CPU-Last und Ram war voll und Load ging hoch und irgendwann"}, {"id": 883, "start": 7645.68, "end": 7656.08, "text": "ist er halt abgekackt. Und du kannst zum Beispiel auch gucken, ob's zu warm wird. Hardware-Temperature-Monitor."}, {"id": 884, "start": 7656.08, "end": 7662.88, "text": "Pass mal auf, wir machen jetzt mal Folgendes. Ich stell jetzt mal runter auf 5 Minuten. Und"}, {"id": 885, "start": 7662.88, "end": 7677.16, "text": "jetzt gehen wir mal da hin und sagen Stress. Es geht rauf. Und wenn wir jetzt hier kurz"}, {"id": 886, "start": 7677.16, "end": 7681.28, "text": "warten. Wie gesagt, ich weiß gar nicht, ob der automatisch refresht, ehrlich gesagt."}, {"id": 887, "start": 7681.28, "end": 7688.56, "text": "Oder in welchem Intervall der collectet. Müssen wir mal schauen. Ah, Auto-Refresh, alle 5"}, {"id": 888, "start": 7688.56, "end": 7701.12, "text": "Sekunden, easy. Jetzt warten wir mal, bis der refreshed hat, dass der die. Guck hier, guck,"}, {"id": 889, "start": 7701.12, "end": 7713.16, "text": "Temperatur geht schon hoch. So, und das coole daran ist, ich könnte mich jetzt ja auch benachrichtigen"}, {"id": 890, "start": 7713.16, "end": 7717.8, "text": "lassen, also ich könnte jetzt zum Beispiel sagen, okay, Hardware-Monitor. Wie macht"}, {"id": 891, "start": 7717.8, "end": 7720.8, "text": "man das jetzt eigentlich in so einem Graf? Ach nee, ich bin gar nicht eingeloggt, deswegen"}, {"id": 892, "start": 7720.8, "end": 7726.88, "text": "darf ich das nicht editieren. Ich logg mich mal kurz ein. Massive Passport, Leute, kommt"}, {"id": 893, "start": 7726.88, "end": 7738.8, "text": "hier nie drauf. Guck mal, CPU sehe ich jetzt zu 100%, ist rot und sonst was. Hardware-Stats,"}, {"id": 894, "start": 7738.8, "end": 7753.24, "text": "Hardware-Temperatur. Edit. So, und ich könnte jetzt auch sagen, Alert. Ah, okay, es funktioniert"}, {"id": 895, "start": 7753.24, "end": 7757.76, "text": "nicht. Wenn ich mich alerten lassen will, dann muss ich ein eigenes Dashboard nur für"}, {"id": 896, "start": 7757.76, "end": 7779.2, "text": "die eine Sache basteln. Was auch immer. Atmen, atmen, ja. Schwert zu erraten. Das ist Prometheus"}, {"id": 897, "start": 7779.2, "end": 7784.56, "text": "unter, unten drunter. Guck, man sieht, jetzt geht direkt die Temperatur hoch. Das Dashboard"}, {"id": 898, "start": 7784.56, "end": 7794.84, "text": "ist Grafana. Ich hab da überhaupt nichts gemacht, das ist das Standard Grafana-Dashboard."}, {"id": 899, "start": 7794.84, "end": 7798.52, "text": "Man muss das nicht von Hand aus. Nein, nein, nein, ich hab das doch nicht von Hand gemacht,"}, {"id": 900, "start": 7798.52, "end": 7807.8, "text": "dieses Dashboard. Glaubt ihr doch nicht selbst. Hier, gehst dahin, kopierst dir die ID, gehst"}, {"id": 901, "start": 7807.8, "end": 7814.72, "text": "da rein, das ist total easy, guck mal. Du gehst in deinen Dashboards rein. Discard. Du sagst"}, {"id": 902, "start": 7814.72, "end": 7820.56, "text": "Import, suchst dir hier von der offiziellen Seite, von der offiziellen Seite suchst du"}, {"id": 903, "start": 7820.56, "end": 7825.6, "text": "dir ein schönes Dashboard raus, was du haben willst. Kannst hier durchsuchen, was du für"}, {"id": 904, "start": 7825.6, "end": 7834.72, "text": "Dashboards haben willst. Kannst du auch, sag mal, sortieren nach Reviews, Ratings, sonst"}, {"id": 905, "start": 7834.72, "end": 7839.72, "text": "was. Und dann sagst du, oh, dieses Dashboard gefällt mir, weil das 6 Millionen Downloads"}, {"id": 906, "start": 7839.72, "end": 7851.72, "text": "hat. Und dann kopierst du dir die ID von dem Dashboard, sagst Import vom Grafana, Load,"}, {"id": 907, "start": 7851.72, "end": 7857.8, "text": "dann sagt der, ah, das gibt's schon. Dann denkst du dir einen anderen Namen aus, CACW,"}, {"id": 908, "start": 7857.8, "end": 7862.84, "text": "Dashboard, weil ich hab's ja schon mal importiert. Dann changst es irgendwo anders hin, ist eigentlich"}, {"id": 909, "start": 7862.84, "end": 7870.12, "text": "egal. Und sagst die Data Source, sagst Import. Fertig. Schon hast du das Dashboard da. Das"}, {"id": 910, "start": 7870.12, "end": 7873.96, "text": "war's. Also mehr musst du nicht machen. Meinst du, glaubst du nicht selbst, dass ich das"}, {"id": 911, "start": 7873.96, "end": 7879.0, "text": "selbst angelegt hab? Also Dashboards, die ich selbst angelegt hab, sehen dann zum Beispiel"}, {"id": 912, "start": 7879.0, "end": 7886.04, "text": "so aus. Das ist für meine Heizung. Das ist auch schon ein bisschen größer. Das brauchst"}, {"id": 913, "start": 7886.04, "end": 7892.28, "text": "auch schon so eine halbe Stunde für. Aber das andere würd ich im Leben nicht anlegen."}, {"id": 914, "start": 7892.28, "end": 7900.08, "text": "Ansonsten sehen meine Dashboards so aus. Zertifikatablauf für meine Domains. Dann hab ich Plattenplatz"}, {"id": 915, "start": 7900.08, "end": 7909.92, "text": "im Wohnzimmer. Also nix Großartiges, ja. Das CACW-Dashboard wird übrigens jetzt wieder"}, {"id": 916, "start": 7909.92, "end": 7927.0, "text": "gelöscht. Also. Wunderbar. Wisst ihr, jetzt haben wir sogar richtig schickes, richtig"}, {"id": 917, "start": 7927.0, "end": 7931.8, "text": "schickes Monitoring von unserem Raspberry Pi. Und ihr werdet sehen, CPU-Temperatur,"}, {"id": 918, "start": 7931.8, "end": 7937.12, "text": "seht ihr das hier? Wir gehen mal hoch auf 15 Minuten. Seitdem ich das hier gestartet"}, {"id": 919, "start": 7937.12, "end": 7942.4, "text": "hab, ging die CPU-Temperatur ordentlich hoch. Und sowas kann man dann halt überwachen."}, {"id": 920, "start": 7942.4, "end": 7953.64, "text": "Na zum Beispiel könnte ich jetzt auch sagen, ja okay, mal mal, Alerting Rules. Das geht"}, {"id": 921, "start": 7953.64, "end": 7960.96, "text": "echt nur, das geht echt nur über Dashboards. Okay, das sackt ein bisschen. Das ist jetzt"}, {"id": 922, "start": 7960.96, "end": 7966.44, "text": "einer der Nachteile, die ich gefunden hab von diesem komischen Alerting im Grafana."}, {"id": 923, "start": 7966.44, "end": 7972.24, "text": "Die sagen ja selbst, das ist dafür nicht gemacht. Natürlich doof, wenn ich hier nix hinzufügen"}, {"id": 924, "start": 7972.24, "end": 7979.64, "text": "kann. Ja, beispielsweise bei den Zertifikaten hab ich das so gemacht. Ich weiß nicht, ob"}, {"id": 925, "start": 7979.64, "end": 7984.2, "text": "ich das zeigen kann. Es können sein, dass ich irgendwelche Credentials drinstehen hab."}, {"id": 926, "start": 7984.2, "end": 7988.48, "text": "Also ich lass das mal kurz. Da hab ich eingestellt, es soll mich benachrichtigen, hat einen gewissen"}, {"id": 927, "start": 7988.48, "end": 7993.4, "text": "Wert. Was jetzt aber anscheinend in diesem Dashboard so nicht funktioniert. Weil es"}, {"id": 928, "start": 7993.4, "end": 8016.92, "text": "ein Template Dashboard ist. Bald wegen. Kann ich mitleben. Exquisite. Wie kommt Grafana"}, {"id": 929, "start": 8016.92, "end": 8021.4, "text": "dann an die ganzen Daten? Das ist über Prometheus. Wie gesagt, ich hab ja vorhin hier den, ich"}, {"id": 930, "start": 8021.4, "end": 8032.88, "text": "hab vorhin den Nodexporter installiert. Der sorgt dafür, dass man vom Raspberry Pi diese"}, {"id": 931, "start": 8032.88, "end": 8041.2, "text": "ganzen Infos abrufen kann. Und dann hab ich hier auf einer anderen Kiste hab ich Prometheus,"}, {"id": 932, "start": 8041.2, "end": 8049.92, "text": "der einsammelt, installiert. Und Grafana greift direkt auf die Prometheus-Datenbank zu. Und"}, {"id": 933, "start": 8049.92, "end": 8055.96, "text": "für die Heizung im Keller hab ich den Prometheus-Exporter programmiert, der quasi das gleiche macht,"}, {"id": 934, "start": 8055.96, "end": 8059.96, "text": "aber halt nur für Heizungsdaten. Ist gar nicht so kompliziert. Deswegen find ich persönlich"}, {"id": 935, "start": 8059.96, "end": 8066.04, "text": "auch mit die angenehmste Monitoringlösung für daheim. Weil du daheim jetzt nicht so"}, {"id": 936, "start": 8066.04, "end": 8073.36, "text": "wahnsinnig viel brauchst und vieles halt einfach geht. Ja. Ist doch wirklich ganz praktisch."}, {"id": 937, "start": 8073.36, "end": 8080.24, "text": "Jetzt sehen wir hier sogar die Temperatur von dem Ding und man sieht ja auch direkt hier,"}, {"id": 938, "start": 8080.24, "end": 8088.2, "text": "flupp, jetzt sind wir aber 62 Grad. Und hier, da ging's los hier, hier waren wir aber 948"}, {"id": 939, "start": 8088.2, "end": 8095.12, "text": "und hier zack auf 64 hoch. Ja und zum Beispiel, wenn man jetzt die, wenn jetzt mein Raspberry"}, {"id": 940, "start": 8095.12, "end": 8099.48, "text": "Pi abkacken würde oder hängen bleiben würde oder so und ich guck mir das hier an und stell"}, {"id": 941, "start": 8099.48, "end": 8105.44, "text": "fest, ah Moment, der hatte irgendwie 85 Grad CPU bevor er abgekackt ist, dann weiß ich,"}, {"id": 942, "start": 8105.44, "end": 8112.64, "text": "dann stimmt irgendwas nicht. Ne, mit Audio-Settings hab ich in der Lidung keine Ahnung. Raspberry"}, {"id": 943, "start": 8112.64, "end": 8122.96, "text": "Pi 2 hat relativ wenig Use-Cases, weil der kein WLAN hat. Also weniger Use-Cases. Du"}, {"id": 944, "start": 8122.96, "end": 8128.36, "text": "kannst einen Unify-Controller machen, wie ich hier mache, wenn du die Sachen damit"}, {"id": 945, "start": 8128.36, "end": 8134.68, "text": "kontrollieren willst. P-Hole ist ziemlicher Müll, finde ich, weil mittlerweile Twitch"}, {"id": 946, "start": 8134.68, "end": 8137.8, "text": "und YouTube nicht mehr ordentlich geblockt werden. YouTube geht glaube ich mittlerweile"}, {"id": 947, "start": 8137.8, "end": 8143.84, "text": "halbwegs wieder, aber Twitch geht gar nicht. Ja und ansonsten, ehrlich gesagt, das was"}, {"id": 948, "start": 8143.84, "end": 8151.64, "text": "man halt braucht. Also es hat wenig Sinn zu sagen, hey ich hab eine Raspberry Pi, um ihn"}, {"id": 949, "start": 8151.64, "end": 8157.44, "text": "zu haben und ich suche jetzt was, was ich da drauf machen will. Umgedreht ist sinnvoller,"}, {"id": 950, "start": 8157.44, "end": 8161.08, "text": "wenn man sagt, ok, das und das stört mich, ich hol mir jetzt eine Raspberry Pi für so"}, {"id": 951, "start": 8161.08, "end": 8170.44, "text": "ein Projekt, was für jeden was bringt. Schwierig, ja. Weißt du aber, ich kann dir einen Tipp"}, {"id": 952, "start": 8170.44, "end": 8176.0, "text": "geben. Geh mal auf das self-hosted Reddit und lese dir da mal ein bisschen was durch,"}, {"id": 953, "start": 8176.0, "end": 8180.04, "text": "weil da gibt es ganz viele Tipps, was die Leute daheim bei sich so laufen haben und"}, {"id": 954, "start": 8180.04, "end": 8192.0, "text": "was sich auch für eine Raspberry Pi ereignet. Ziemlich beliebtes, beliebtes Subreddit. Die"}, {"id": 955, "start": 8192.0, "end": 8202.28, "text": "Musik ist ja übelst, übelst epische, epische Bowser Musik für Grafana Grafen. Du hast"}, {"id": 956, "start": 8202.28, "end": 8226.96, "text": "da ein SSL-Zert, das ab 25.05. abgelaufen ist. Echt? Wo habe ich das? Ah, was? Weil,"}, {"id": 957, "start": 8226.96, "end": 8245.64, "text": "du wirst extern überhaupt nichts finden. Da läuft ja extern nichts. Wie heißt das Subreddit"}, {"id": 958, "start": 8245.64, "end": 8254.24, "text": "self-hosted? Ja, gut, ok. Also Raspberry Pi wird gemonitort, wunderbar. Wir haben noch"}, {"id": 959, "start": 8254.24, "end": 8260.92, "text": "genug Platz, RAM ist auch noch da, CPU ist busy, weil wir gerade Benchmark laufen lassen."}, {"id": 960, "start": 8260.92, "end": 8266.32, "text": "So, und das hier, Leute, das ist der aktuelle Raspberry Pi, der mein UniFi macht und mein"}, {"id": 961, "start": 8266.32, "end": 8270.04, "text": "Kamerazeug und der ist halt regelmäßig am Limit. Swap ist aus irgendwelchen Gründen"}, {"id": 962, "start": 8270.04, "end": 8278.84, "text": "schon volle Pulle und RAM ist gerade 65%, aber unter unglücklichen Umständen ist das"}, {"id": 963, "start": 8278.84, "end": 8294.68, "text": "halt auch mal voll und out of memory. Ist das internal only resolvable? Ne, das ist schon"}, {"id": 964, "start": 8294.68, "end": 8303.72, "text": "ein ganz normal registrierter Domain, aber da läuft halt nichts drauf. Also sprich, kann"}, {"id": 965, "start": 8303.72, "end": 8311.96, "text": "sie nicht aufnehmen, weil kein DNS sich dafür zuständig fühlt. Ah, zum Beispiel intern"}, {"id": 966, "start": 8311.96, "end": 8321.64, "text": "löst Wiki auf, auf eine IP, aber wenn du sagst, mal den Google DNS fragst, dann sagt"}, {"id": 967, "start": 8321.64, "end": 8328.2, "text": "er halt, ja, ne, Cloudflare ist dafür zuständig, aber ich habe keine IP dafür. Was sagst du"}, {"id": 968, "start": 8328.2, "end": 8335.88, "text": "zu KFC-Konsole? Den Sinn habe ich nicht verstanden. KFC hat eine Konsole mit Hähnchenwärmer,"}, {"id": 969, "start": 8335.88, "end": 8343.28, "text": "weiß ich, ob ihr das schon gesehen habt. Da gibt es, was kostet der Kram? Da gibt es"}, {"id": 970, "start": 8343.28, "end": 8358.04, "text": "eine Konsole mit Hähnchenwärmer. Warum auch immer. Man weiß es nicht so genau. So, welche"}, {"id": 971, "start": 8358.04, "end": 8364.68, "text": "OS ist das auf dem Raspberry Pi? Das ist ganz normal das Raspberry-Pi-OS, wie es mittlerweile"}, {"id": 972, "start": 8364.68, "end": 8373.16, "text": "heißt. 2 und 3, spit, fertig, aus. Da ist auch noch ein PC drunter, was anderes hätte"}, {"id": 973, "start": 8373.16, "end": 8379.52, "text": "mich auch gewundert. Natürlich ist da ein PC drunter. Unter der Xbox und der PS4 ist"}, {"id": 974, "start": 8379.52, "end": 8383.32, "text": "ja auch noch ein PC drunter, mit dem Unterschied, dass da kein normales PC-Zeug draufläuft,"}, {"id": 975, "start": 8383.32, "end": 8388.2, "text": "dass du da extra Sachen dafür machen musst. Dass für KFC jemand sagt, wir entwickeln"}, {"id": 976, "start": 8388.2, "end": 8393.28, "text": "für die KFC-Konsole gezielt Spiele, ist ja auch topisch. Ganz normaler PC drunter, das"}, {"id": 977, "start": 8393.28, "end": 8407.08, "text": "wundert mich auch nicht. Okay Leute, ein Sony ist nicht Power-PC. Es war, Xbox 360 und PS3"}, {"id": 978, "start": 8407.08, "end": 8413.96, "text": "waren beides CPUs von IBM. Und die Xbox war mehr oder weniger ein 1-1-Power-PC. Die PS3"}, {"id": 979, "start": 8413.96, "end": 8422.64, "text": "war was neu zusammengestricktes. Und ab der PS4 und der Xbox, fragt mich nicht, Xbox X,"}, {"id": 980, "start": 8422.64, "end": 8441.76, "text": "Xbox S, Xbox One, habt ihr Xbox One? Ist es alles ganz normal, x86-AMD-CPUs. Tja Leute,"}, {"id": 981, "start": 8441.76, "end": 8447.16, "text": "funktioniert alles, wunderbar. Unify-Controller scheint prinzipiell zu laufen, kann ich jetzt"}, {"id": 982, "start": 8447.16, "end": 8463.4, "text": "im Stream nicht großartig weiter ausprobieren. Oh, der Load geht ganz schön ruff hier. Und,"}, {"id": 983, "start": 8463.4, "end": 8470.24, "text": "Monitoring von Pi funktioniert, Temperatur ist gut. Ich würde sagen, erfolgreicher Stream,"}, {"id": 984, "start": 8470.24, "end": 8477.28, "text": "aber es ist nicht. Oh, Leute, ohne Scheiß, das Gehäuse ist ordentlich warm mittlerweile"}, {"id": 985, "start": 8477.28, "end": 8483.88, "text": "schon. Guck mal, das hat jetzt 65 Grad, das Gehäuse. Lul, weh. Guckt euch das mal an,"}, {"id": 986, "start": 8483.88, "end": 8493.52, "text": "wie warm der ganze Scheiß mittlerweile wird. Von wegen 20 Grad kühler. Meint ihr, das"}, {"id": 987, "start": 8493.52, "end": 8500.32, "text": "könnte daran liegen, dass unten die SSD dran hängt? Nee, oder? Ich mein, unten hängt"}, {"id": 988, "start": 8500.32, "end": 8510.0, "text": "die SSD dran, aber daran wird es ja wohl kaum liegen. Die Wärme müsste ja nach oben raus."}, {"id": 989, "start": 8510.0, "end": 8519.72, "text": "Es wird schon ordentlich warm, Leute. Es wird schon ordentlich warm. Also, noch, man kann"}, {"id": 990, "start": 8519.72, "end": 8524.28, "text": "noch den Finger drauf lassen, aber wenn es noch ein bisschen wärmer wird, ehrlich gesagt,"}, {"id": 991, "start": 8524.28, "end": 8530.12, "text": "muss man den Finger runter nehmen. Also, man kann ihn gerade, ah, es wird schon ziemlich"}, {"id": 992, "start": 8530.12, "end": 8537.84, "text": "heiß. Also, man kann ihn gerade noch drauf lassen. Captain Steve von der neuen abonniert"}, {"id": 993, "start": 8537.84, "end": 8546.32, "text": "Twitch Prime, danke schön für den Sub. Plus 1 IQ für den Chat wieder. Jetzt müssen wir"}, {"id": 994, "start": 8546.32, "end": 8556.28, "text": "mal gucken, ob man ein Ei drauf purzeln kann. Kein Wunder bei 100% CPU Last. Guck mal, man"}, {"id": 995, "start": 8556.28, "end": 8567.4, "text": "sieht direkt, wenn ich die Hand drauf mache, dann wird es noch wärmer. Das wird schon ordentlich"}, {"id": 996, "start": 8567.4, "end": 8573.08, "text": "warm, das Teil, ne? Aber da, wenn man da pustet, es geht bestimmt schnell runter. Wartet mal,"}, {"id": 997, "start": 8573.08, "end": 8602.8, "text": "probieren wir aus jetzt. Na ja. Ja, geht direkt runter."}, {"id": 998, "start": 8602.8, "end": 8609.08, "text": "Ich meine, nicht, dass es irgendwas funktioniert. Nee, nicht, dass es irgendwas bringen würde,"}, {"id": 999, "start": 8609.08, "end": 8611.44, "text": "wenn ich puste auf das Gehäuse, aber es funktioniert."}, {"id": 1000, "start": 8611.44, "end": 8625.2, "text": "Und das Coole ist, das sieht man sogar hier im Graph, guckt mal. Letzten, letzten 5 Minuten,"}, {"id": 1001, "start": 8625.2, "end": 8638.04, "text": "hier. So, und flupp, bisschen runter. Pustchamp. Nein, ich baue da nix dran. Das bleibt genauso"}, {"id": 1002, "start": 8638.04, "end": 8642.84, "text": "wie es ist, weil ich finde ehrlich gesagt die Kombi ziemlich nice. Die SSD ist hier"}, {"id": 1003, "start": 8642.84, "end": 8647.92, "text": "unten dran gepappt mit den Pads. Der Pie steht da oben drauf, bleibt relativ kühl in dem"}, {"id": 1004, "start": 8647.92, "end": 8660.56, "text": "Gehäuse, optimal für meinen UniFi-Controller und zum Video aufnehmen. Meine Video-Software"}, {"id": 1005, "start": 8660.56, "end": 8664.44, "text": "mache ich da jetzt nicht drauf, weil da müsste ich die Kameras hinzufügen oder leake ich"}, {"id": 1006, "start": 8664.44, "end": 8671.88, "text": "wieder was und das will ich ja nicht. Sieht richtig cool aus, ne? Und die SSD, ihr seht"}, {"id": 1007, "start": 8671.88, "end": 8678.24, "text": "es hier, guck mal, die ist auch ordentlich... Okay, jetzt habe ich es abgedrückt. Das war"}, {"id": 1008, "start": 8678.24, "end": 8684.08, "text": "jetzt nicht so dumm-Champ, dass ich die abgemacht habe, aber Low-Brain-Champ war das gerade,"}, {"id": 1009, "start": 8684.08, "end": 8692.64, "text": "dass ich die jetzt abgemacht habe, aber... Ja, okay, hält wieder. Also diese Wärme"}, {"id": 1010, "start": 8692.64, "end": 8696.04, "text": "da mit Pads sind ich so wirklich für ab und wieder dran machen gedacht, aber das wird"}, {"id": 1011, "start": 8696.04, "end": 8701.84, "text": "ja eh einfach so, wie es ist, in der Ecke stehen. So, Chat, ich gucke jetzt nochmal"}, {"id": 1012, "start": 8701.84, "end": 8715.0, "text": "kurz in Chat, ob ich irgendwelche Sachen übersehen habe hier. Was machst du mit dem UniFi-Controller?"}, {"id": 1013, "start": 8715.0, "end": 8735.92, "text": "Ja, die Access Points konfigurieren. Ups, Musik ist aus. Die Access Points konfigurieren"}, {"id": 1014, "start": 8735.92, "end": 8742.16, "text": "mache ich damit. Was sonst, ne? Ich habe aktuell zwei Access Points, ich will mir aber noch"}, {"id": 1015, "start": 8742.16, "end": 8749.2, "text": "einen dritten kaufen für den Hof und ist ganz praktisch. Ehrlich gesagt, ich finde es"}, {"id": 1016, "start": 8749.2, "end": 8752.68, "text": "ein bisschen doof, dass man überhaupt einen UniFi-Controller braucht. Mir persönlich"}, {"id": 1017, "start": 8752.68, "end": 8756.24, "text": "wäre es lieber, man könnte die Dinge einfach über das Web-Interface konfigurieren, geht"}, {"id": 1018, "start": 8756.24, "end": 8763.52, "text": "ja nur so zum Teil über Kommandozeile oder mit der Smartphone-App, aber ich denke mal,"}, {"id": 1019, "start": 8763.52, "end": 8770.48, "text": "spätestens ab drei Access Points ist es wirklich nützlich. Bei zwei hält es sich"}, {"id": 1020, "start": 8770.48, "end": 8780.12, "text": "ehrlich gesagt noch in Grenzen. Die könnte ich auch schnell von Hand konfigurieren. Hast"}, {"id": 1021, "start": 8780.12, "end": 8790.68, "text": "du immer noch den Edge-Switch? Ja, ich habe einen ES16XG, korrekt. Das Ding habe ich seit"}, {"id": 1022, "start": 8790.68, "end": 8797.56, "text": "drei Jahren oder so. Exzellent-Switch. Wobei ich mir mittlerweile einen Mikrotik-Switch"}, {"id": 1023, "start": 8797.56, "end": 8804.68, "text": "kaufen wolle. Würde, würde, nicht wolle, wolle, würde anstatt dem. Oder diesen Switch,"}, {"id": 1024, "start": 8804.68, "end": 8808.84, "text": "den letztens einer im Stream gezeigt hat, diesen Aura-Irgendwas-Ding, was ich noch nie"}, {"id": 1025, "start": 8808.84, "end": 8817.04, "text": "gehört habe vorher. Der sah auch nice aus. Wie heißt das Tool für die Text-Tabs? Meinst"}, {"id": 1026, "start": 8817.04, "end": 8828.84, "text": "du das hier? Das hier? Das ist TMUX. Oder wie auch immer man das ausspricht. Eines der"}, {"id": 1027, "start": 8828.84, "end": 8835.08, "text": "besten Features daran ist, guck mal, ich kann so eine Session in den Hintergrund schieben,"}, {"id": 1028, "start": 8835.08, "end": 8842.12, "text": "mich ausloggen, mich wieder einloggen und an der gleichen Stelle mit der Session weitermachen,"}, {"id": 1029, "start": 8842.12, "end": 8853.56, "text": "ohne dass die Sachen abkacken da drin. Ist eigentlich fast das Beste da dran. So, also"}, {"id": 1030, "start": 8853.56, "end": 8862.28, "text": "wie gesagt, von Audio-Settings-Unterlienung habe ich keinen Plan. Das hatten wir schon,"}, {"id": 1031, "start": 8862.28, "end": 8869.48, "text": "das ganz normale Offizielle. Ich habe das dann nicht richtig verstanden. Die kannst"}, {"id": 1032, "start": 8869.48, "end": 8874.56, "text": "du nur intern auflösen. Der Cloudflare-DNSs sind dafür zuständig, dass ich extern Zertifikate"}, {"id": 1033, "start": 8874.56, "end": 8888.0, "text": "ausstellen kann. Wenn man überhaupt keinen Plan von der Materie hat, wie schafft man"}, {"id": 1034, "start": 8888.0, "end": 8895.8, "text": "einen guten Einstieg? Kein Plan von was? Also was willst du machen? Ich mein, Materie"}, {"id": 1035, "start": 8895.8, "end": 8903.88, "text": "ist jetzt groß und viel. Kommt darauf an, was. Oder in welche Richtung, besser gesagt."}, {"id": 1036, "start": 8903.88, "end": 8913.64, "text": "Achso, du hast ein Geschenk bekommen. Sprich, du hast den Raspberry Pi übrig und willst"}, {"id": 1037, "start": 8913.64, "end": 8918.04, "text": "einfach mal irgendwie ein bisschen was damit machen, wenn du dafür keinen Use-Case hast."}, {"id": 1038, "start": 8918.04, "end": 8922.2, "text": "Es ist auch schwierig. Raspberry Pi 2 hat halt keinen W-Lan. Ohne W-Lan ist halt alles"}, {"id": 1039, "start": 8922.2, "end": 8928.8, "text": "ein bisschen eingeschränkt, ehrlich gesagt. Komm nicht auf die Ideen, Media Center zu"}, {"id": 1040, "start": 8928.8, "end": 8934.8, "text": "basteln. Dafür sind die Raspberry Pies absolut Schrott. Hier werden dir viele Leute was anderes"}, {"id": 1041, "start": 8934.8, "end": 8940.28, "text": "sagen, aber meiner Meinung nach sind die Dinger Schrott, leckt ohne Ende und ist lahm"}, {"id": 1042, "start": 8940.28, "end": 8949.6, "text": "as fuck. Für den Nas sind die Dinger auch nicht gut, selbst der neueste nicht. Tja,"}, {"id": 1043, "start": 8949.6, "end": 8953.0, "text": "gut, vielleicht willst du wirklich mal ein bisschen Sachen daheim laufen lassen. Ja,"}, {"id": 1044, "start": 8953.0, "end": 8959.16, "text": "vielleicht willst du dir mal einen Wiki selber hosten oder irgendeinen Filesync selber hosten"}, {"id": 1045, "start": 8959.16, "end": 8977.4, "text": "oder was auch immer. Tja, was lohnt sich so großartig? Schwier zu sagen. Okay, das restliche"}, {"id": 1046, "start": 8977.4, "end": 8992.28, "text": "sein hatte ich glaube ich schon alle beantwortet, oder? Ja. Ich hätte damals mit... Das Interface"}, {"id": 1047, "start": 8992.28, "end": 8998.44, "text": "ist alles laggy wie Sau. Das ist das eigentliche Problem. Gehen tut alles, aber das Interface,"}, {"id": 1048, "start": 8998.44, "end": 9001.88, "text": "also kann man, wenn eine Kodi oder so drauf hat, das ist laggy as fuck, wenn du das mal"}, {"id": 1049, "start": 9001.88, "end": 9013.08, "text": "vergleichst mit einem Android TV oder sowas. Ja und nee, also die Edge Switche sind darauf"}, {"id": 1050, "start": 9013.08, "end": 9018.96, "text": "ausgelegt, dass du sie selbst per Commando-Zeile und Web-Interface konfigurieren kannst, aber"}, {"id": 1051, "start": 9018.96, "end": 9024.16, "text": "es gibt mittlerweile was, es gibt mittlerweile sowas in der Richtung so als Übersichts-Dashboard"}, {"id": 1052, "start": 9024.16, "end": 9031.96, "text": "auch für Edge-Switche und es hat auch eine beschränkte Interoperabilität mit UniFi."}, {"id": 1053, "start": 9031.96, "end": 9053.48, "text": "Ja, kann man mal, wie gesagt, ist halt nicht frei was man braucht. Okay, tja Leute, also"}, {"id": 1054, "start": 9053.48, "end": 9059.76, "text": "ich würde sagen, war mal erfolgreich für heute, funktioniert wunderbar, das Ding bleibt"}, {"id": 1055, "start": 9059.76, "end": 9065.64, "text": "bei 65 Grad irgendwie hängen, sieht man ja auch hier, letzten 5 Minuten, um die 65 Grad"}, {"id": 1056, "start": 9065.64, "end": 9070.8, "text": "warm, hier 30 Minuten, hier haben wir eingeschaltet, hier habe ich mal gepustet ein bisschen, jetzt"}, {"id": 1057, "start": 9070.8, "end": 9079.64, "text": "geht es wieder hoch, wunderbar, gefällt mir, erfolgreicher Stream würde ich sagen. Mit"}, {"id": 1058, "start": 9079.64, "end": 9083.6, "text": "Materie meine ich beispielsweise, was du beruflich machst oder hier im Stream, na okay, das was"}, {"id": 1059, "start": 9083.6, "end": 9087.64, "text": "ich beruflich mache hat mit dem was ich im Stream mache überhaupt nichts zu tun, also"}, {"id": 1060, "start": 9087.64, "end": 9096.12, "text": "nur ganz am Rande und wenn du einstiegst so ein bisschen, ja gut, ich kann jetzt natürlich"}, {"id": 1061, "start": 9096.12, "end": 9105.0, "text": "sagen, was ein guter Einstieg für das was ich hier im Stream mache. Ehrlich gesagt,"}, {"id": 1062, "start": 9105.0, "end": 9111.2, "text": "eine Idee haben was man machen will, weil ansonsten ist es echt schwierig so ins blaue"}, {"id": 1063, "start": 9111.2, "end": 9118.16, "text": "rein. Wenn du zum Beispiel sagst, ja ich möchte zum Beispiel keine Ahnung, Fernsehaufnahmen"}, {"id": 1064, "start": 9118.16, "end": 9122.2, "text": "auf dem zentralen Server haben, okay, oder wenn du sagst, ja ich will, keine Ahnung,"}, {"id": 1065, "start": 9122.2, "end": 9127.64, "text": "Dateien sünden zwischen Tablets und meinem Desktop, mit irgendwas, was ich selbst hoste,"}, {"id": 1066, "start": 9127.64, "end": 9132.8, "text": "okay, das ergibt auch Sinn, oder ich will irgendwie einen Kalender hosten, was auch immer,"}, {"id": 1067, "start": 9132.8, "end": 9137.64, "text": "ja kann man da was zu sagen, aber so generell ins breite ist echt schwierig da jetzt was"}, {"id": 1068, "start": 9137.64, "end": 9143.44, "text": "zu sagen. Du kannst dir Self-hosted, Reddit und Data Horder Reddit ein bisschen durchlesen,"}, {"id": 1069, "start": 9143.44, "end": 9150.68, "text": "da kommt man ganz gut manchmal auf Ideen, aber ansonsten ist gar nicht so einfach. Unified"}, {"id": 1070, "start": 9150.68, "end": 9156.28, "text": "Dream Machine Pro Meinung, haben wir uns ganz am Anfang vom Stream schonmal angeguckt"}, {"id": 1071, "start": 9156.28, "end": 9163.32, "text": "und ich konnte dazu bloß sagen, dass ich für mich da halt keinen Anwendungszweck hab und"}, {"id": 1072, "start": 9163.32, "end": 9170.44, "text": "ja, ich jetzt auch nicht genau wüsste wozu ich das mir kaufen sollte. Was ich nicht verstanden"}, {"id": 1073, "start": 9170.44, "end": 9177.6, "text": "habe ist, ob es PoE hat für die Access Points. Ist der Pi echt zu schwach für eine NAS?"}, {"id": 1074, "start": 9177.6, "end": 9182.36, "text": "An Nextcloud kannst du machen, aber Nextcloud finde ich halt persönlich an sich ein ziemliches"}, {"id": 1075, "start": 9182.36, "end": 9190.28, "text": "kack Produkt. Das einzige was man von Nextcloud verwenden kann ist CalDAV und eventuell den"}, {"id": 1076, "start": 9190.28, "end": 9197.4, "text": "File Sync Desktop Client. Die anderen Sachen sind so halb fertig. Also die ganzen Nextcloud"}, {"id": 1077, "start": 9197.4, "end": 9204.52, "text": "Apps, die sind ja, wenn man jetzt hochkommt zu 80% so wie man sie haben will. Wenn ich"}, {"id": 1078, "start": 9204.52, "end": 9212.28, "text": "mir dran denke, dass die Notizen App jahrelang nicht durchsuchbar war, solche Dinger. Also"}, {"id": 1079, "start": 9212.28, "end": 9217.28, "text": "alles außer wirklich die absoluten Basic Funktionalitäten von Nextcloud sind meiner Meinung nach nicht"}, {"id": 1080, "start": 9217.28, "end": 9228.72, "text": "verwendbar und als NAS, doch, du kannst das als NAS verwenden. Das funktioniert. Ich meine,"}, {"id": 1081, "start": 9228.72, "end": 9233.8, "text": "du hast ja immerhin, hast du ja mittlerweile zwei, weiß nicht ob man das sieht, du hast"}, {"id": 1082, "start": 9233.8, "end": 9240.08, "text": "ja zwei USB 3 Anschlüsse und ein Gigabit Netzwerk, was ja erstmal schon ein riesen"}, {"id": 1083, "start": 9240.08, "end": 9243.16, "text": "Fortschritt ist zu den restlichen Raspberry, zu den älteren Raspberry, alter ist das warm"}, {"id": 1084, "start": 9243.16, "end": 9252.4, "text": "mittlerweile, zu den älteren Raspberry Pi's, also wie es wackelt, als Emulator für alte"}, {"id": 1085, "start": 9252.4, "end": 9258.6, "text": "Games, ja das funktioniert, bis zu einem gewissen, in einem gewissen Rahmen, ja. Du kannst das"}, {"id": 1086, "start": 9258.6, "end": 9262.08, "text": "schon als NAS verwenden. Das Problem ist also warum ich, warum es sich meiner Meinung nach"}, {"id": 1087, "start": 9262.08, "end": 9268.6, "text": "nicht als NAS eignet, ist folgendes. Erstens, du hast an sich eh ein bisschen wenig IO Anschlüsse,"}, {"id": 1088, "start": 9268.6, "end": 9271.28, "text": "das ist das erste, was prinzipiell bei den Raspberry Pi's ein bisschen problematisch"}, {"id": 1089, "start": 9271.28, "end": 9276.4, "text": "ist und die haben, also wir reden jetzt mal nur vom Raspberry Pi 4, die älteren sind"}, {"id": 1090, "start": 9276.4, "end": 9281.72, "text": "noch weniger geeignet und die haben beim Raspberry Pi 4 an dem gespart, was am allerwichtigsten"}, {"id": 1091, "start": 9281.72, "end": 9285.28, "text": "für einen NAS ist oder mit am wichtigsten für einen NAS ist, die haben in der CPU,"}, {"id": 1092, "start": 9285.28, "end": 9290.12, "text": "die haben sich keine Krypto Extensions geleistet, also sprich, die haben zwar einen halbwegs"}, {"id": 1093, "start": 9290.12, "end": 9295.24, "text": "aktuellen, in der halbwegs aktuellen Abend-CPU drinne, aber du hast keine Krypto Extensions,"}, {"id": 1094, "start": 9295.24, "end": 9299.0, "text": "das heißt, du kannst deine Festplatten im NAS nicht verschlüsseln, was für mich eines"}, {"id": 1095, "start": 9299.0, "end": 9302.96, "text": "der wichtigsten Funktionen ist, weil ich will im Zweifelsfall eine Festplatte nehmen können,"}, {"id": 1096, "start": 9302.96, "end": 9307.88, "text": "einfach in den Müll schmeißen, ohne dass ich mir Gedanken machen muss. Oder auch mal"}, {"id": 1097, "start": 9307.88, "end": 9312.2, "text": "in den Rucksack schmeißen und irgendwo mit hinnehmen oder sowas, ja, unabhängig davon,"}, {"id": 1098, "start": 9312.2, "end": 9317.48, "text": "was drauf ist oder sonst was und du kannst um Raspberry Pi nichts ordentlich betreiben"}, {"id": 1099, "start": 9317.48, "end": 9327.24, "text": "mit Verschlüsselung, weil es dann lahm as fuck ist. Also mit lahm meine ich, du hast"}, {"id": 1100, "start": 9327.24, "end": 9333.32, "text": "dann 30 MB die Sekunde oder so, also du hast dann so USB 2 Geschwindigkeit und das Ding"}, {"id": 1101, "start": 9333.32, "end": 9337.96, "text": "ist brummt auf Anschlag, ja, deswegen eignet es sich meiner Meinung nach nicht für einen"}, {"id": 1102, "start": 9337.96, "end": 9348.72, "text": "NAS. Also die zwei Sachen, du hast wenig I.O. Ports und du hast keine Krypto Extensions"}, {"id": 1103, "start": 9348.72, "end": 9360.2, "text": "und das in Kombination ist halt Müll. Dein alter Office-PC hat mit Sicherheit auch am"}, {"id": 1104, "start": 9360.2, "end": 9364.16, "text": "Vielfaches mehr Leistung als Raspberry Pi, die Dinger sind ja nicht so, es ist ja nicht"}, {"id": 1105, "start": 9364.16, "end": 9370.32, "text": "so, als wäre es in Raspberry Pi so ultra krass der Bringer, was Leistung angeht, ne,"}, {"id": 1106, "start": 9370.32, "end": 9375.72, "text": "also die sind okay für das, was sie machen, aber jeder olle Desktop-PC steckt so ein"}, {"id": 1107, "start": 9375.72, "end": 9386.4, "text": "Teil easy in die Tasche, ne. Ein billiger, wir haben es glaube ich mal ausprobiert, mit"}, {"id": 1108, "start": 9386.4, "end": 9394.28, "text": "ich glaube irgendeinem Suspension oder so war das. Mein billigstes x86-Port, wirklich low"}, {"id": 1109, "start": 9394.28, "end": 9402.0, "text": "end, was 80 Euro kosten mit CPU drauf, war glaube ich 6 mal schneller oder 7, 6, 7 oder"}, {"id": 1110, "start": 9402.0, "end": 9408.36, "text": "8 mal schneller bei diesem Standard Suspension-Markt als bei Raspberry Pi. Zwei war glaube ich"}, {"id": 1111, "start": 9408.36, "end": 9417.36, "text": "schon ein Dreier, kein Vierer. Also das ist jetzt nicht so, als die Dinger ultra schnell,"}, {"id": 1112, "start": 9417.36, "end": 9441.4, "text": "nur das meiste, reicht natürlich. Guck mal, wir sind jetzt schon bei, seht ihr, seht ihr,"}, {"id": 1113, "start": 9441.4, "end": 9445.44, "text": "wie viel wir jetzt auf einmal verbrauchen, wir sind jetzt bei 6,8, das heißt, es ist"}, {"id": 1114, "start": 9445.44, "end": 9449.8, "text": "wirklich ein Unterschied, wie warm das Ding wird, umso wärmer das Teilen wird, ah gut,"}, {"id": 1115, "start": 9449.8, "end": 9453.0, "text": "jetzt ist auch eine SSD dran, stimmt, dürfen wir nicht vergessen, aber umso wärmer das"}, {"id": 1116, "start": 9453.0, "end": 9463.28, "text": "Teilen wird, umso mehr verbraucht er. Ich mach mal die CPU aus bitte, ich wollte mich"}, {"id": 1117, "start": 9463.28, "end": 9468.88, "text": "ein bisschen nicht übertreiben. Also nein, nein, ich mach nicht die CPU aus, ich mach"}, {"id": 1118, "start": 9468.88, "end": 9472.24, "text": "die volle Auslastung der CPU mal aus, mal gucken, wie schnell er runter geht. Er war"}, {"id": 1119, "start": 9472.24, "end": 9488.0, "text": "jetzt bei max 67 Grad und 60, ah ok, Hälschengrenzen. Tja Leute, also weiß nicht, ob es noch irgendwelche"}, {"id": 1120, "start": 9488.0, "end": 9491.88, "text": "Fragen oder sonst was gibt im Chat, weil ansonsten würde ich sagen, der Stream war"}, {"id": 1121, "start": 9491.88, "end": 9498.2, "text": "erfolgreich, easy, hat funktioniert alles. Dann wache ich mich jetzt nämlich gleich vom"}, {"id": 1122, "start": 9498.2, "end": 9514.56, "text": "Acker, weil ich hab Hunger. Peppofett. Ja, macht er, ab 85 Grad, 80 oder 85 Grad, drosselt"}, {"id": 1123, "start": 9514.56, "end": 9527.76, "text": "er sich runter. Gucken wir mal, ob der Friseur streamt. Der Frasier, da ist er, Leute, der"}, {"id": 1124, "start": 9527.76, "end": 9542.44, "text": "originale, echte, der echte Frasier. Spielt Pokemon Clone Game, ist übrigens richtig"}, {"id": 1125, "start": 9542.44, "end": 9547.08, "text": "nice, das Game, das hab ich mir auch gekauft, das macht mega Bock. Monster Sanctuary kann"}, {"id": 1126, "start": 9547.08, "end": 9554.08, "text": "ich echt nur empfehlen, ist eins der besten so Indie Games des Jahres. Richtig top, also"}, {"id": 1127, "start": 9554.08, "end": 9560.64, "text": "mega poggers Game. Ist nicht pay to win. Hat überhaupt keine, hat überhaupt keinerlei,"}, {"id": 1128, "start": 9560.64, "end": 9572.08, "text": "keinerlei DLCs oder sonst was. Ok Leute, wir raiden jetzt den Fabian. Wenn ich meine Tastatur"}, {"id": 1129, "start": 9572.08, "end": 9588.28, "text": "schaffe auf Deutsch umzustellen. Raid, I freezee. Wir raiden jetzt den Fabian und ich gebe"}, {"id": 1130, "start": 9588.28, "end": 9595.28, "text": "was essen. War richtig nice das Stream, ja schön, wenn es euch gefallen hat. Wir sehen"}, {"id": 1131, "start": 9595.28, "end": 9603.96, "text": "uns im nächsten Stream, bis dann, machts gut, see you."}]}