{"text": "Oh man, headset ist mir total verknotet. Wie geht das eigentlich? Ich mach nix und eine Woche später ist es wieder verknotet. Ich weiß, jetzt kommen die ersten Leute und sagen, Max, Wireless, null weh, aber gerade hier will ich keinen Wireless-Headset haben. MMX300, bester, Digga, MMX300 fühl ich, Alter, ja. Moin Leute, wer ist am Start, der Phipps ist da, der Mark, Michael, 50 Billionen, der Moritz, ja, Chat geht wieder, gestern hat es ziemlich ripp gewesen, Twitch, es ging bestimmt eine halbe Stunde nicht. Also Twitch allgemein hatte richtig Probleme gestern Abend wieder. So ist das halt, wenn man anstatt testmäßig einfach mal kurz live deploit, haben sich bei Twitch gedacht, ach so eine kleine Änderung wird schon nix kaputt machen und BÄM, alles kaputt, wer kennt es nicht? Mir ist übrigens aufgefallen, wenn ich auf Twitch, auf mein Channel gehe, ist es irgendwie ein bisschen abenseelig und zwar, guck mal, wie funktioniert das hier, null, man sollte eigentlich von ausgehen, dass ich das nach, keine Ahnung, drei Jahren oder so weiß, aber anscheinend nicht. Vielleicht soll ich die Emotes auch mal ein bisschen kleiner machen. Ja, also wie gesagt, man sollte von ausgehen, dass ich das irgendwann weiß, aber nein, ich weiß es nicht und ehrlich gesagt, ich weiß gar nicht, was soll ich überhaupt auf mein Twitch Profil draufschreiben, was schreiben denn andere da auf ihr Twitch Profil so drauf? Wer wird mir denn hier empfohlen? Kenn die alle nicht, wer ist das? Was schreibt man so auf sein Twitch Profil drauf? Long have we waited, now which you baited, keine Ahnung, weiß nicht, was man so auf sein Twitch Profil draufschreiben sollte. Vielleicht, vielleicht einen Streaming Plan, wenn man einen hat, aber ich habe ja keinen Streaming Plan, oh Sellout, das ist eine richtig gute Idee, das mache ich später. PC Specs, Mikrofon, Maus, Tastatur, Audiointerface, kommt alles drauf, das ist eine gute Idee, das ist eine echt gute Idee, wenn man nicht weiß, was man drauf machen soll, dann einfach alles Sellout Space verwenden, ja, das ist eine gute Idee, das mache ich nachher, aber ansonsten habe ich echt keine Ahnung, was ich auf mein Profil schreiben soll, wie laut? Natürlich mit Reflings, mit was denn sonst? Ich mache doch keine Sellout Amazon Links ohne Reflings. Was normalerweise gestreamt, gezockt wird, ja, das ist halt irgendwie übelst random, ich meine, da kann er nichts draufschreiben. Ist der Twitch Chat kaputt? Ne. Ah, gbait, gbait, verstehe, ein gbait versucht, der sich selbst entgbaitet, auch nicht schlecht. Ja, wenn man sich mal anguckt, die letzten Streams, da ist ja alles Mögliche dabei, Linux Stels, irgendwie, also gut, es ist der Silvester Stream, Battlefield 3, da ist ja wirklich alle möglichen Sachen, da kann man ja echt nichts irgendwie davon ableiten, ne? Gibt es im Jahr 2021 neue Technik-Gadgets, mit Sicherheit, gibt es laufend, muss einfach bei Aliexpress gucken und solange du dich nicht kaputtlachst über den komischen Titel der Sachen auf Aliexpress, einfach bestellen, die Seitentitel auf Aliexpress sind ja immer das Beste. Super Low Power PC, Intel, AMD, PC, Gehäuse, Rechner, Computer, PC oder sowas steht dann da oben, bei Aliexpress im Titel, das kannst du immer, und im Endeffekt, was ist es dann an? Es ist da eine Smartwatch oder sowas. What the fuck, wir haben, Moment, Moment, wir haben ein Ausrufezeichen für den Dark 3-Shot, das spiele ich doch gar nicht mehr, null W, Alter, also zumindest habe ich das schon eine Weile nicht mehr gespielt und das ist aber immer noch der beste Server, wenn das einer spielen will, weil da sind nämlich Spieler drauf, die haben abends immer noch so 1300 oder so Spieler, was für so ein uralt Game-Free-Shot mäßig ziemlich gut ist. Ich meine, das ist besser als die offiziellen Server, die offiziellen Server haben ein paar hundert oder so. Chat, was gucken wir, komm, wir lassen dann mal, ich habe hier schon mal ein, wir lassen dann mal ein bisschen über die Server Setups von Leuten. Desaster, Serverroom Cleaning, ne, das muss ich mir nicht angucken, mein Serverroom sieht ja auch nicht gerade schön aus, das muss ich mir jetzt hier nicht noch im Video anschauen. Upgrade-Time, das war langweilig, 6 Jahre alt Computer in den Server konvertieren ist ja nicht schwierig, einfach den Kram drauf installieren, den man 24-7 laufen lassen will, aber das Zeug braucht halt meistens unsinnig, viel Strom oder ist lahm oder ist laut, nix dabei, nix dabei, Server Rack Tour Network Setup, Alter, what the fuck, wie alt ist der? Der ist doch keine 14, oder, darf der überhaupt schon Youtube-Videos machen? Aber immerhin, Server Rack, das gucken wir uns jetzt mal schnell an, Alter, der ist höchstens 12, Alter, aber Server Rack am Start, nicht schlecht, der fängt schon früh an, oder es ist das Server Rack vom Vater, man weiß es nicht genau, aber das ist zumindest mal einer der jüngeren Comments turned off, wahrscheinlich weil die Leute sich lustig drüber gemacht haben, weil er so jung ist, aber who cares, ja, ich mein, immerhin, das ist wenigstens mal einer, der noch durchblickt dann, es war dann hier am Start, Unify Gedöns, irgendeinen Cisco Switch, wie spricht man Cisco eigentlich cool aus, Amazon kann man cool aussprechen und solche Sachen und Ubuntu kann man Ubuntu aussprechen, wie spricht man, wie spricht man ein Cisco cool aus, gibt es da, da muss es doch irgendwas, eine coole Aussprache geben für, aber immerhin, der plickt wenigstens, der plickt wenigstens mal später durch was computermäßig angeht, wenn man mit 12 schon, ich schätze den jetzt einfach mal auf 12, keine Ahnung, wenn man mit 12 schon hier mit Server Rack am Start ist und Netzwerk Setup und so macht, das Kabel sieht ein bisschen wählsmäßig aus, sieht aus wie ein 3D gedruckter Stecker, ist doch in Ordnung, top, wenigstens einer, der noch mal durchblickt, Sysco, oh ne, ne, das klingt ja richtig cringe, ok, nächstes dabei, dann gucken wir uns jetzt durch das Setup von anderen Leuten an, Alter ich bin auch müde, Cisco, ja das stimmt, die Leute haben auf Deutsch früher immer Cisco ausgesprochen, ja kann schon sein oder aber, der Vater ist, oder die Mutter, wahrscheinlicher ist der Vater, ist halt auch so technikinteressiert und hat den Kram schon am Start, also, Pasi hat gefragt, was würdest du nutzen um mit, oh ich hab den Chat nicht offen oder, hab ich den Chat offen, Moment, ja, hab ich aber Glück gehabt hier, was würdest du nutzen um Streamling mit Chatterino am Fernsehtwitch zu schauen, warum nicht einfach die Twitch App, ich weiß mag jetzt für meine Verhältnisse sehr konventionell klingen, ja, warum nicht einfach die Twitch App, ja, also das ist eine gute Frage, also wie gesagt, ich hab jetzt noch Urlaub heute und morgen, am Dienstag muss ich wieder arbeiten gehen und ich hab hier mal absolut keinen Bock, also Pläne, ja gut, ich hoffe halt, ich weiß nicht wie ich das alles sagen soll, also das steht und fällt damit, dass mir gute Themen einfallen wo ich Bock hab drauf aufzunehmen, ich werd heute ein Video aufnehmen zum Ende von Flash, Flash ist ja jetzt dead, Flash ist ja dead jetzt letztendlich, seit Dezember und ich werd mal ein Video zu machen, erst nochmal kurz drüber sagen warum Flash so kacke war und dann mal gucken wie man aktuell Flash Sachen spielen kann, wir haben das meiner Meinung nach zum größten Teil einer Person zu verdanken, warum es das jetzt soweit ist, warum es kein Flash mehr gibt und wisst ihr wem, also meiner Ansicht nach zumindest, hauptsächlich RIP Spielaffe, Spielaffe, ja das gabs ja noch, also ich bin der Meinung, dass wir das tatsächlich eines der Sachen die wir echt Steve Jobs zu verdanken haben, als der damals gesagt hat auf dem iPhone kommt dieser Scheiß erst gar nicht drauf, das war der Anfang vom Ende von Flash, was hast du auf deinem Server drauf, meistens Ubuntu, RIP Penner Game, ne Moment das Penner Game war doch nicht Flash oder, das Penner Game ist doch das wo dir die Leute auf irgendeine Seite gelockt hast und hast ihnen dann Geld abgenommen oder, kennt ihr noch diese komischen Affiliate oder ich weiß nicht wie man diese nennt, diese Games wo man irgendwelche Leuten eine Link geschickt hat, haha funny funny look, look hier, dann hast du dir eine Link geschickt und dann kam dann raus, Max hatte ihn 150 Big Brain Dollar gestohlen, kennt ihr diese Sorte von Games noch wo sich alle versucht haben gegenseitig auf irgendwelche unbekannten Links zu locken um ihnen dann im Game In-Game Währung zu klauen, was eigentlich überhaupt keinen Sinn hatte, weil du hattest im Prinzip kein Game sondern nur diese Scam Seite, excellent, Penner Game, was war das Penner Game, ich kenn das überhaupt nicht mehr, ach das Ding, Moment, stop das hab ich nicht gespielt, aber ich kenn das noch, ich kenn das noch, das waren so Dinge die hab ich komplett ignoriert, das Penner Game genau, ich kann mich dran erinnern, das linke, das da, Penner Game, ach das ist Penner Game 2, oh nein, das hier, ich kann mich noch dunkel dran erinnern, aber dazu hat man noch gar kein Flash gebraucht oder, das Browserspiel des Jahres 2006, es gab mal ne Zeit, da waren so Weltraum Browserspiele total beliebt, wo man dann irgendwie so mit ein paar Leuten angefangen hat und versucht hat irgendwelche, also rein 2D und rein Browser Webseiten, also nichts animiert und sonst was, ja sowas in der, ne warte, ne Dark, ne, ne, ne, ne, ne, das mein ich nicht, da bewegt sich ja sogar noch was, ne ich mein sowas, wie ist das, oh Game oder so, oh Game, Space, ne, das da, so Dinge haben die Leute da gespielt, ja, da hat sich nix bewegt, das war übelst, übelst Fail, du konntest dann auswählen, greife Gegner an und dann kam dann 3 Tage später zurück, Angriffe erfolgreich und solche Sachen, das ganze Game sei im Endeffekt, das ganze Game sei, krasser Screenshot, sei im Endeffekt nach Text aus, ja ich jetzt, klar das kennen paar, das war so 2005 oder so wo man den Kram gespielt hat oder noch früher und man fand das damals übelst, so übelst nice MMO mäßig, MMOs ist auch so ein Ding, ich finde MMOs haben so extrem nachgelassen und jetzt nicht so nach dem Hinblick, früher war alles besser so und ich kann das sogar begründen, also ich finde das eines der größten Aspekte in MMOs ist eben, dass das Massive Multiplayer ist, also sprich, dass es nicht darum geht, dass ich solo mit meinem Character vor mich hin queste, von Level 1 bis, keine Ahnung, 100 oder wie weit das geht, sondern dass man zum größten Teil mit anderen Leuten eben, ich weiß hört sich jetzt doof aus meinem Mund an, ja, dass man mit anderen Leuten interagieren muss, ihr wisst, ich mag andere Leute eigentlich nicht und ich interagiere auch nicht gern mit anderen Menschen, aber in MMOs ist das anders, in MMOs ist okay, in MMOs kannst du Leute einfach muten, wenn sie auf den Sack gehen, Camelot Unchained Soon, ja genau, das kommt nie raus, ich sag's dir nie, es wäre nice, wenn das rauskommt, aber ich, nee, ich sag mal mein Desktop mal kurz, weil ich weiß, der Chat mag meinen Desktop, so weiter und ich finde, eines der, also mit das Anfang vom Ende war in MMOs, wo sich Dungeon Finder etabliert haben, breit über alle MMOs, Dungeon Finder ist so eigentlich, geht komplett konträr so der ursprünglichen Idee von MMOs, nämlich, dass man die Leute kennt, mit denen man spielt und dass man halt eben so eine gewisse Server Zusammengehörigkeit hat und weiß, wer denn Spaß ist und wer gut spielt und sowas, das war mit Dungeon Finder komplett vorbei, klar, spätestens wenn du schwierige Sachen machst, ist es dann trotzdem wieder so, aber es ist halt mittlerweile in MMOs total anonym und gerade durch irgendwelche riesen Server Cluster und on the way Clustering und sowas, das führt dazu, dass im Endeffekt MMOs bloß noch sind Buff, Go Go, Kack Noob, Shit Tank, Shit Heal, Shit DPS, was auch immer, es ist nicht so, dass es nicht früher in MMOs auch Dappen gegeben hat, aber das Problem hat sich dadurch, dass man die Leute auf dem Server kannte, relativ schnell von selbst erledigt. Liko sagt, wenn alles klappt werde ich auf Endian zügeln, was? Ach umziehen, zügeln, habe ich schon nie gehört, in der ersten Wohnung möchte ich auch an Smart Home einrichten, kannst du nicht mal so eine Übersicht machen, Musik, Staubsauger und Licht interessiert mich, oh ne, das ist schwierig, ich habe das Problem, wenn ich mal mein Smart Home Zeug zeige, da sind auch Standort und alles mögliche drin, da habe ich Angst, dass ich zig Sachen leake, die ich nicht leaken will. Ich bin vom Radar verschoben, ich mache seit einem Monat wieder Videos, guck mal hier, Massive Upload Rate, ich habe jetzt immerhin geschafft 1, 2, 3, 4, 5, 6, 7, 8 Videos zu machen im letzten Monat, davor nicht wirklich, davor habe ich nichts gemacht, aber immerhin, ok eine Produkt Übersicht, ist auch schwierig, da müsste ich mir erstmal Gedanken machen, was ich alles habe, kann ich nicht so aus dem Ärmel schütteln, kann man sich bei dir auch IT Berufsberatung einholen, jetzt ganz einfach, mach kein IT, mach was mit Holz, das ist jetzt Big Brain Frage, was würdest du einem 20-jährigen Max sagen, wenn du könntest, das ist so eine Frage, wie beim Vorstellungsgespräch, wo sehen sie sich in 20 Jahren, ich würde einem 20-jährigen Max sagen, er soll mit YouTube anfangen und nicht zwischendurch immer wieder aufhören. Wartest du auch auf das Apple Smart Home mit Noise Cancelling, was, nö, ich habe ein Heizungsdashboard, ja, jaja, das kennst du doch, das Heizungsdashboard, ihr wollt mich nur debaten, ihr wollt mich nur debaten, dass ich meine Heizungsüberwachung mal wieder zeige, by the way, das ist meine Heizungsüberwachung, hat, sag mal, hat Grafana irgendwelche CSS Probleme, normalerweise hat man doch gar, hat man doch nicht so komische Rahmen hier drum herum, das sah doch gestern noch anders aus, oder? Ich habe hier eingestellt, dass ich meinen Container automatisch updatet, vielleicht haben die irgendeine neue Version rausgebracht, das hat jetzt irgendwie CSS updatet, ich guck mal, ob ich das alte Grafana von gestern noch auf hab, was hast du bisher in Home Assistant integriert? Ja, da ist es noch offen, die Temperatur vom Gartenteich, Außentemperatur, Lichter an und aus, Heizung teilweise, Presence Detection, ich muss mal kurz nebenbei aufmachen, sonst vergess ich bestimmt die Hälfte, genau, Heizung an und aus, Heizung zeitgesteuert, Licht teilweise zeitgesteuert, Staubsauger aufladen, Kameraübersicht, wobei das macht einen extra Popup auf, weil das eingebaute, die eingebaute Kameraübersicht von Home Assistant sackt, ok, nee, ich hab nix gesagt, what the fuck, Grafana sah gestern schon genauso aus wie heute, ich hab das nur irgendwie nicht gecheckt, wie war der Fazit von der Distro gestern, Fail, also die Tiling Geschichte geht, aber die XFCE Geschichte war grausam, echt richtig massiv grausam, so, also was hab ich noch in meinem Home Assistant, wie gesagt, dann hab ich unten noch ein paar automatische Steckdosen, zum Beispiel zum Staubsauger aufladen, ich mein jetzt nicht mein Roborock Staubsauger, der ist da auch integriert, ich mein normalen Staubsauger, zum rumschieben mit Akku, da hab ich so gemacht, da hab ich unten in der Küche eine von diesen Steckdosen, die wir mal im Stream geflasht haben und ich hab so eine Steckdose mit, die misst, wie viel Watt das Gerät grad dahinter verbraucht und wenn das unter 5 fällt für mindestens 5 Minuten, dann schaltet es die Steckdose aus, weil dann weiß ich, der Staubsauger ist voll geladen, ist eigentlich ganz praktisch, da muss ich das nicht den ganzen Tag anlassen, so, dann hab ich LED Beleuchtung drinnen, hier bei mir vom Fenster, vom Weihnachtsbaum und allgemein Beleuchtung, äh, zum Beispiel vom Wohnzimmer, Arbeitszimmer, dann hab ich meine Heizungsübersicht drinnen, Wettervorhersage, wobei ich die kaum benutze, aktuelle Temperatur draußen, aktuelle Temperatur im Fischteich, das ist tatsächlich recht wichtig, die aktuelle Temperatur im Fischteich, ähm, ich muss gerade mal gucken, ob der ZZ etwas getan hat, ne, ja, ähm, die aktuelle Temperatur im Fischteich ist tatsächlich relativ wichtig, weil dann weiß man, ob man zudecken muss oder nicht, weil wenn das zufriert, gehts kaputt, so, Temperatur, Thermostat Wohnzimmer hab ich drinnen, ich kann mein Elgato Ringlight kontrollieren, was ich hier für Aufnahmen teilweise verwende, äh, Heizlüfter Badezimmer, Presence Detection, Klimaanlage an, bzw. hauptsächlich anschalten im Sommer, wenn ich auf dem Weg bin, Heimmittags, das brauchen wir grad nicht, weil Homeoffice, ähm, ich geh mal kurz Configuration gucken, oh, das war so zum größten Teil, was ich, ich hab noch mehr Sachen drinnen, aber die sind halt einfach nur da und werden grad nicht benutzt, ich hab hier auch die ganzen Steckdosen drinnen, auch die ganzen Steckdosenleisten, die wir hier im Stream geflasht haben, also sprich da, wo ich jetzt hier gerade mein, äh, da dran, der Switch auf dem Tisch ist dran, die externe Festplatte ist dran, der Raspberry Pi ist dran und da oben kommt dann halt bei der anderen Steckdose halt Server drinnen und, äh, LED-Leiste und so, die hab ich auch alle drin, die kann ich schalten, aber da passiert nichts automatisch, jo, genau, so siehts aus. Wolltest du nicht ein neues Gartenvideo machen mit Schnee? Leg da, es liegt kein Schnee. Wie updatest du Docker-Container automatisch hiermit? Damit. Du startest einfach einen Container, dem du dann sagst, welche Container automatisch updaten soll, eigentlich ziemlich, ziemlich einfach. Du brauchst einfach ein Kommando und sagst ihm hier, also wenn du es über Compose machst, noch einfacher, Container Ruby. Ja, damit. Gib noch ein paar andere, aber das so, mit das verbreitetste. Watchtower, Watchtower, sind das nicht die Zeugen Jehovas, die irgendwas von Watchtower erzählen? Weiß ich, wie ich da jetzt drauf komme, aber. So, ähm. Hast du mal I3 als WM in einem DE probiert? Nee. Hab ich nicht. Schnee probiert. Also was ich machen würde ist, was aber glaub ich nicht geht, wenn man, wenn man I3 in Compass laufen lassen könnte. Das wäre Poggers. Dann könnte ich nämlich endlich Wobbly Windows wieder verwenden. Und wir wissen ja alle, Wobbly Windows ist der beste Effekt, den es gibt. Die 0815 Windows-Pleps kennen das gar nicht. Muss ich euch mal zeigen. Wobbly Windows, das ist das beste Feature, was es gibt. Ja, seht ihr das? Ja, so muss das sein. Wobbly Windows. Auch wobble mal ein bisschen. Exzellent. Vor 10 Jahren hat man gedacht, das wäre der neueste Shit und jeder Desktop muss so aussehen. Damals hatte man auch seinen Desktop als Würfel gemacht und sowas. Ich glaube, das hat er hier auch. Weiß nicht, ob er es zeigt. Oh, jawoll. Guck mal, wie das fließt. Woopgessem, also. Ja, Wobbly Windows. Und auch ganz wichtig, Compels 3D Cube. Irgendwie sahen, was witzig ist, ohne Scheiß, Linux Desktop-Distros sahen vor 10 Jahren viel futuristischer und fancier als heute. Oh, hier. Flup, flup. Wobbly, ich hoffe an Wobbly Windows. Ach du Scheiße, was ist das für ein Launcher? Und ein Copyright ist, der guckt sich nicht ernsthaft Markus Lanz an jetzt hier. Der muss sein 3D Cube zeigen. Das ist der beste Effekt. Hier, hier. Jetzt. Ah, okay, das war der Task-Switcher, der war auch nice. 3D Cube, zeig den 3D Cube, Alter. Beste. Rain-Calender, oder wie dieses Ding hieß, hat er auch am Start. Ich fand das echt nice, ja. Das hätte man durchaus weiterverfolgen können und nicht so komisch ein Einheitslook, wie sie es mit Gnome 3 gemacht haben. Und im Prinzip ist ja das meiste Zeug auf dem Desktop unter Linux auch nicht wirklich brauchbar. Das ist so halb fertiger Kram immer. Da fand ich Compels, Compels war richtig geil. Komm, zeig 3D Cube, Alter. Ich will den 3D Cube sehen. Wo ist der 3D Cube? Hier. Genau, wenn du Desktops geswitcht hast. Ja, genau, du konntest Desktops switchen. Nicht einfach nur Desktops switchen. Erster Desktops, zweiter Desktops, dritter Desktops. Nein, nein, du hast deine Desktops geswitcht auf einem Würfel. Das war richtig futuristisch, Alter. 03D, genau. Das ist doch geil gewesen. Gibt es das heute überhaupt noch? Compels war das beste. Ich weiß gar nicht, warum das irgendwie so eingeschlafen ist. Compels war das beste. Also wenn das mit I3 gehen würde, hätte ich sofort auch Compels wieder am Start. Aber leider funktioniert I3 und Compels nicht richtig zusammen. Das war was, oder? Das ist so richtig stylish gewesen. Ich kann mir das heute immer noch den ganzen Tag angucken. Ja, also wie gesagt vor 10 Jahren war Linux noch viel, viel geiler eigentlich als heute. Da konntest du wenigstens so abgedrehte Sachen wie Compels machen. Da gab es dann noch diesen Barrel Compels Fork, die noch abgedrehtere Sachen gemacht haben. Du konntest sogar die Fenster... Compels... Burning... Burn effect. Du konntest sogar die Fenster abbrennen lassen und so. Das war auch richtig cool. Okay, es laggt. Okay, es laggt, aber ich glaube man kann sich vorstellen was passiert. Außer dass es laggt, es f**kt bei dem Typ. Hallo, wie wärs wenn du noch ein bisschen mehr zeigst? Ist ja schön und gut, dass ihr 30 Millionen Videos drüber macht, aber wie wärs einfach mal den Effekt zu zeigen? Was hat der denn damit zu tun? Ja genau, guckt euch das mal an. Fenster einfaden lassen mit Flammeffekt und löschen und so. Der Typ, das ist richtig Hackerman Desktop. Das sieht wenigstens aus wie in irgendeinem Hackerfilm, der Desktop. Ich meine Usability gleich Null, aber sieht cool aus. Und es ruckelt. Ja, das war schon nice. Ja, hat sich leider nicht so wirklich durchgesetzt. Eigentlich ziemlicher Sack. Kommt jetzt zwar echt poggers. So, was gucken wir uns jetzt mal an? Da fehlt C-Matrix. Gucken wir uns jetzt an. Okay, das hatten wir schon. Aufwachsen. Ach, ich hab Aufwachen mit Asi-YouTuber gelesen. Aufwachsen mit Asi-YouTubern. Was gucken wir uns jetzt an? What? Nope. Wie alle ihr sind, warte Häuschen. RIP Adobe Flash. Da mach ich heute ein Video zu. Hoffe ich, dass ich das gebacken krieg. Gaming Chairs. Irgendeiner, der sich aufregt über Leute, die sich aufregen. Ah, wir gucken uns mal eine Runde Lockpicken an. Excellent. Reaction Channel. Ja, ich hab schon einen neuen Channel. Max Reaction ist schon am Start. Mit Reaction kannst du heute Klicks machen. React FPS. Wo waren wir jetzt gerade? Machst du noch was mit ESP-Stuff? Ja, ich hab total viel mit ESP-Zeug hier am Start. Mein ganzes LED Zeug ist ja... Ich hab meine ollen ESP866 ausgebuddelt für die ganzen LED Sachen. Ist auch auf Archive Org ein paar Flash-Games mit dem Emulator zu zeigen. Du meinst diesen Rust Emulator? Muss ich mal ausprobieren. Okay, wenn es wenn, dass ich jetzt mal ein ESP. Okay, wenn es, wenn es zwei Minuten geht, weiß ich jetzt schon. Der pustet das Schloss einmal an und es ist offen. Warum ist ein ESP viel zu schade? Der Kram kostet 2,50 Euro oder so. Und ist kleiner. Ja gut, der Witz ist ja, niemand wird anfangen daran rumzuschnibbeln. Wahrscheinlich kannst du da, wie gesagt, der wackelt, wir kennen ja die Videos von ihm, der wackelt wahrscheinlich jetzt einfach mal am Schlüssel und das Ding ist auf. Ja, aber dein Arduino Uno ist riesengroß. Sackt. Ah, yes. Okay, wir sind in der Mitte, also starten wir dort. Ein kleines Klick aus 6. Postchamp, Postchamp. Klick aus 5. Vielleicht etwas aus 4. Nichts aus 3. 2. 1 ist verbunden. Okay, ein schönes Klick da. Arbeit unseren Weg zurück, nichts aus 2. M, Office, einfach. Einfach. Okay Leute, wie ihr gesehen habt, hat es wirklich nicht lange gedauert. Das sagt, diese Typen der Locks, wie auch die Tools und Skills, die es benötigen, zu öffnen, sind ziemlich unkommenslos in nur ein paar Ländern, wie das UK. Und ich denke, sie werden noch mehr unkommenslos in der Zukunft. Es kann also nicht so schlecht eine Option sein. In jedem Fall, das ist alles, was ich für euch heute habe. Wenn ihr irgendwelche Fragen oder Kommentare darüber habt... Ich meine, der Typ kann es auch. Ich kann es nicht einschätzen, weil ich selbst absolut keine Lockpicking Skills habe. Aber es sieht, in der Regel kann man sich das davon ableiten, wenn was total einfach aussieht, was aber eigentlich nicht einfach ist, dann kann man daraus Schlussfolgen, der Typ kann es. Ansonsten, wenn was schwierig ist und jemand struggled übelst rumweist, okay, der kann es auch, aber da muss ich Mühe geben. Aber wenn Sachen, die schwierig sind, so aussehen, als sind sie easy as fuck, dann kann es der Typ meistens richtig gut. Und bei dem sieht es immer so aus, als ist easy as fuck alles. In Skyrim erschließt sich jetzt zwar der Zusammenhang zwischen Skyrim und Lockpicking nicht so wirklich, aber nice. Was ist jetzt los? Kurz Exquisite Trink zuführen. Okay, eins gucken wir doch an. Ich gucke den gerne, den Typ. Ach Lockpicking in Skyrim, verstehe. Exzellent. Das ist, ich habe es wieder nicht gecheckt, Leute. Du meinst Schlösserknacken in Skyrim? Ach so. Ja. Das ist Max Lockpicking Skill in Skyrim. Ha, ha, lul, was ist das? What the fuck? Warum? Warum geht das einfach so auf, wenn man da was reinschiebt? Mal schon so kurz die Musik ausmachen. Nee, Obama. Ah, ja. Asda. Aha, aha. Ist Jackal, man. Der atmet immer so in seinem Mikrofon. Jetzt bin ich nicht, es ist das Video. Anzeige es raus. Und Fork, das auf der Seite von den Rädern bleibt. Wenn ich den Fork in die Kode-Räder drücke, kann ich sie decodeieren, einfach durch die Räder zu drehen und für den leichten Spot in der Reise zu fühlen. Das ist nicht besonders einfach, aber das kann schon gemacht werden. Jetzt suche ich einen Räder, der verbinden ist. Ich suche den leichten Spot, wenn ich das mache. Wieso sie die nicht auffüllen, ja, das ist eine ordentliche Frage. Zusammenschweißen, vielleicht zu teuer. Okay, das nächste was die machen ist, die machen das neben zu, schicken ihm das Schloss zu und er braucht dann anstatt 2 Minuten, 2,15. Kannst du mal eine Wette machen, ich bin süchtig lol. Ja, können wir machen, ich wette, ich bekomme die nächsten 5 Minuten 5 Subs, wenn ich recht habe, musst du mir 15 geben. Ach, nicht so eine Wette, okay, Channel Points, verstehe, verstehe. Channel Points wetten? Ach, du meinst diese Sachen mit, wird die nächste Runde gewonnen und dann kann man Channel Points setzen und dann kann man dann bei großen Channel Points gewinnen, wenn man richtig liegt. Ja, okay, aber die Sache ist die, auf was wollen wir Channel Points wetten? Predictions, was wollen wir predikten? Gefällt dir Max das nächste Video oder was willst du gerade predikten, Alter? Coldflip, ich weiß was wir machen, easy, random generator, 27, 26, Leute ist das wirklich random, wir haben 27 und 26, ich predikte aus 2 Resultaten, das kann nicht random sein, fake random. Das nächste muss 25 sein, Alter was ist denn heute los, wieviel Likes hat das nächste Video, das könnte man tatsächlich gut predikten, aber dann müsste man sagen, wieviel Likes hat das nächste Video und danach sagen wir 1 Stunde. Und dann müssten wir das Video freischalten live im Stream, was nicht geht, weil ich das nächste Video noch gar nicht aufgenommen habe. Na gut, gucken wir mal weiter, ich überlege mir das mit Channel Points setzen, das ist glaube ich gar nicht so verkehrt, da kann man mit den Channel Points wenigstens was machen. Ich habe übrigens unendlich Channel Points, kann ich dann da auch mitmachen, das wäre ein bisschen unfair oder? Kann ich mitmachen, heute Abend startet wieder Awesome Gamestop Quick, ja ich muss ehrlich sagen, seit die so über korrekt sind und Speedrunning gerade bei diesen Events eher Familienunterhaltung ist und so richtig mainstreamig, gucke ich das nicht mehr so gerne. Dein Timeout, die Timeouts gibt es nur, wenn ein Mod da ist, das heißt ich vermute mal, aber wenn du unbedingt getimeoutet werden willst, kann man das machen, natürlich. Oh, jetzt werden auch noch deine Nachrichten gelöscht, ja gut, das wusste ich gar nicht, dass die Nachrichten auch gelöscht werden. Gut, jetzt müsst ihr 5 Minuten timeoutet, exellent, ich wusste nicht, dass es auch deine Nachrichten gelöscht, aber ich habe hier alles gesehen. Wie untimeoutet man eigentlich jemand, ah hier unban, unban, angel9, guck mal mal, ja jetzt kannste wieder was schreiben, aber 10 Minuten stimmt, 600 Sekunden, ja. Quickmuffs, so was schauen wir uns als nächstes an, aufwachsen mit azizyoutube, ok das Video ist von 2016, mal gucken, wie viel wahres da noch dran ist. Ich predikte jetzt einfach mal, es ist eigentlich nur noch schlimmer geworden und es sind andere Typen mittlerweile, 2016 weiß ich gar nicht mehr, was war 2016? War 2016 der Bombenprank von ApoRed? Das könnte doch so 2016 in dem Dreh gewesen sein, oder? Wo er sich da so richtig in die Scheiße geritten hat. Onkos, so laut, aha, das stimmt. Das stimmt, YouTube gibt es seit wann? 2007? 2005, ok, 2006, sagen wir mal ab 2006 gibt es die, ja das bedeutet, die Leute, die im Jahr geboren sind, wo YouTube quasi aufgemacht ist, sind heute 14. Was heißt, das ist exakt, aber so was von exakt, die Zielgruppe von manchen Channels. Who Cares Simon Desue, Alter, ok, es war 2016, den Typ gibt es immer noch, aber ich glaube, wie viel Views hat Simon Desue noch? Wie hieß das Half-Cast-Germany, gell? Alter, der Typ, ey, das kann ich mir nicht geben, das ist, das ist, das Playboy Penthouse eines Milliardärs in Dubai. Alter, wie soll ich das angucken? Ok, übelst, übelst langweilig. Ja, also, ich glaube mittlerweile sind andere Sachen angesagt, aber eins muss man Simon Desue mal wirklich zu gut halten, der Typ hat sich verdammt lang in diesem Genre gehalten. Der macht seit, frag mich nicht, 2009 oder so YouTube-Videos, also ewig, länger als ich, natürlich auch erfolgreicher als ich, ja, und der war schon immer in diesem komischen Kindergarten-Genre zugange, ja, und das hat er durchgehalten, 10 Jahre, das muss er erst mal schaffen. Und halbwegs relevant bleiben dabei, also, das schafft auch nicht jeder. Moin, Shinobo. Ach, ja, stimmt, war das der Typ, der den Leuten irgendwie, genau, da war doch was, 1000 Euro und Xbox, ich kann mich erinnern, der hat den Leuten noch irgendwie Geld gegeben, dass sie irgendwelche Sachen reacten oder irgendwas, ich kann mich da überhaupt nicht mehr richtig dran erinnern. Ehrlich gesagt, ich verfolge ja YouTube Deutschland und ASI YouTube Deutschland, er ist recht schon nie richtig, ja. Das einzige woran ich mich wirklich noch erinnern kann ist der Bomben-Prank von ApoRed, das war ja an Blödheit echt kaum zu überbieten und da hätte er sich echt denken können, dass das nach hinten losgeht. Er wollte das verlosen und hat es nicht verstickt, stimmt, ja, stimmt, stimmt, sowas war da. Okay, jetzt erzähl mal. Das war 2016 wohlgemerkt. Ja, die Startseite sieht heute nicht viel anders aus, wenn du dir die Trends anguckst, warte mal, wir müssen mich hier mal kurz, wobei, ich kriege das glaube ich gar nicht richtig empfohlen, weil ich es auf Englisch gestellt habe. Ah, okay, ne doch. Ja, ich mein, das ist auch nicht besser, was da heute am Start ist. Schock, Schock, so ein Schock, alter, sie fliegt ohne Deniz. Der arme Deniz, alter, was soll er denn machen? So, ich habe mein Traumauto gekauft, ah, das wollte ich auch schon immer mal wissen. YouTube Rewind, who cares, unsere Haustour. Ah, okay, ich mein, das kann ja noch ganz interessant sein, wenn man den Leuten folgt. Ich werde auch nach einer Haustour gefragt, ich will keine Haustour machen, alter. Dann gibt es hier Apache. Ich dachte immer, das ist ein Webserver, aber anscheinend ist das auch irgendein krasser Hip-Hop-Gangsta-Man oder so. Wobei, ne, der Hintergrund sieht nicht so Hip-Hop-mäßig aus. Oder doch, keine Ahnung, können wir das jetzt nicht anhören? Harry Styles. Ist Harry Styles, also mal ganz davon abgesehen, dass der Name sich Übels Gatschi Bass anhört, ist das nicht dieser ehemalige Boy-Group-Typ? Ist das nicht dieser ehemalige Boy-Group-Typ, wo vor ein paar Jahren alle gedacht haben, sie müssen sich jetzt irgendwie, keine Ahnung, von der Brücke stürzen, als der die Boy-Group verlassen hat? War das One Direction? Kann das echt? Ja, könnte sein. Wo sie alle geheult haben. So ein bisschen früher wie Robbie und Take That, falls das noch einer kennt. Das ist aber, what the fuck ist? Warum ist da ein Arsch in der Kamera? Oder ist das überhaupt kein Hintern? Okay, Justin Bieber-Dings. Super Bowl Highlights, okay. Krakona? Anyone? Neun Gemüse, die du im Januar sehen und fortziehen... Warum nicht? Nico ist am Start. Die Neujahrsansprache. Die Sache ist halt die, jetzt mal ganz im Ernst, mich interessiert absolut nichts von dem, was in dem Trend ist. Nix. Juck mich nicht, juck mich nicht, juck mich nicht, juck mich nicht, juck mich nicht, auch nicht, auch nicht, auch nicht, auch nicht, auch nicht.. ...nicht, nicht, okay, wenn ich vegan bin, dann wird's vielleicht angucken. Juckt mich nicht, juckt mich auch nicht, juckt mich nicht, auch das nix, Superbowl erst recht nicht, auch nicht, auch nicht Also das sind eure shops, was juckt, mein shop, was, was wollen die meinen shop, die kennen meinen shop doch gar nicht Juckt mich nicht, auch nicht, auch nicht, auch nicht, auch nicht Was macht, ist das Ist das der Ach nee, nee, ich dachte das ist der gerät, ich dachte das ist der, das ist aber gar nicht der gerät, das ist irgendein anderer typ Der gerät hieß, hieß anders Juckt mich alles nicht, alles, alter, ist ja nix dabei Q&A, Jahresrückblick, Sellys Welt Ich weiß nicht mal, dass, ich wusste bis eben gar nicht mal, dass den channel überhaupt gibt Aber ich bin da auch, bin da auch, tatsächlich nicht die Zielgruppe, interessiert mich nicht Freak Kicker Swipeout Challenge Okay, ich habe keine Ahnung was es ist, deswegen würde ich vielleicht mal aufmachen und reingucken und feststellen, dass ich nicht gucken werde Juckt mich nicht, juckt mich auch nicht Sind das die Lochis Leute sind, sind das die Lochis, nee oder, das sind nicht die Lochis Weil, man erkennt die ja teilweise gar nicht, weil die sind ja mittlerweile auch schon älter Sind das die Lochis doch, oder Immerhin, immerhin war irgendjemand, den ich da noch erkenne, Alter Juckt mich nicht, zerstört das, juckt mich auch nicht, Schnee, okay World Dart Championship, das ist eher was für Marcel Skorpion, Prostitution Das, der hat auch eine Dart-Channel jetzt, Dart interessiert mich auch nicht, guten Rutsch ins neue Jahr Interessiert mich nicht, interessiert mich nicht, interessiert mich auch nicht Interessiert mich auch nicht, es ist nichts dabei, Alter, nix was in den Trends ist, was mich interessiert Recently Trending, ja das ist das was wir schon geguckt haben Und das sind jetzt glaube ich eher so Sachen, die ein bisschen angepasst sind, na wobei, die Geissens, gibt es das überhaupt noch große Scheiße Okay, das habe ich gesehen, zumindest den Anfang, oh Mann, was ein Haufen Crap, Alter Also weiter, gucken wir mal, gucken wir mal was 2016 war, Glitterbomb 3.0, nee das habe ich noch nicht gesehen, lohnt sich das zu gucken, das ist der Typ, der seine Paket-Lieferanten zu-Sprayt mit Zeug Hey, mein Stellenangebote-Ding war wohl relativ gut präsent im Algorithmus, also man sieht, es hat sich die letzten vier Jahre da nix getan in der Richtung Ja, ich muss ehrlich sagen, vielleicht bin ich da auch, vielleicht bin ich da auch irgendwie so ein bisschen, ich bin ja eh nicht ganz normal, das haben wir ja schon oft genug festgestellt, aber so wirklich Vorbilder, wo ich gesagt habe, ich will das so machen wie die, wüsste ich jetzt gar nicht Es ist ja auch so, auch, sagen wir mal, viele sagen ja, okay, ich finde die Bands, die hören irgendwie eine Musikrichtung, die haben ein paar Lieblingsbands, und gucken sich dann auch an, was haben die für Mitglieder, was machen die so, und orientieren sich dann da dran, also mich hat ehrlich gesagt noch nie richtig interessiert, was die Leute machen aus den Bands, die ich gerne höre, das war überlegen, hatte ich irgendwelche Vorbilder? Das müsste einem ja eigentlich ziemlich schnell einfallen, oder? Der Papa, nee, nein, ich weiß nicht, ob du dabei warst, wo ich die paar Stories von meinem Vater schon erzählt habe, nee, nicht wirklich Ich habe, es gab sicherlich Sachen, die ich ganz cool fand, was Leute gemacht haben, aber ich weiß nicht, kann ich mir echt nicht dran erinnern Da gelangte, für all diese Medien gab es eine Redaktion, ein Rat diverser Experten, die dazu da waren, einzuschätzen, ob die übermittelte Botschaft auch recht zufertigen und moralisch zu vertreten ist Irgendwelche Experten machen wahrscheinlich auch aktuell das Programm in ARD und ZDF, und was da rauskommt, sieht man ja Da gibt es dann das Traumschiff 5.0 jetzt mit Florian Silbereisen und sowas Ja, Broadcast Yourself ist ja auch gar nicht mehr, Broadcast Yourself ist vorbei Alter, was sind das denn für Lappen, Alter Da sieht ja einer lauchiger aus als der andere, wer ist das, okay, den gibt es noch, der hat heute bestimmt 5 Millionen Abos oder so, von dem habe ich schon mal was gehört Was macht der da hinten? Alter, wie schafft man das eigentlich, so krass unsympathisch in einem Video auszuschauen, und ich meine, das ist nicht die Optik von den Leuten, einfach nur wie sie rum eiern Ja, das stimmt Ja, das stimmt Ich finde es aber ganz ehrlich, es gab, es gab zu allen Zeiten Trash überall Ich meine, auf YouTube ist es halt besonders präsent und es bekommen vor allem alle Altersgruppen mit, das war früher nicht so, aber bei uns gab es auch so viel Billig-Trash-Kacke Ich meine, was bei uns damals total angesagt war, wenn man irgendwelche doofen Sprüche aus TV total sich gemerkt hat und dann random auf dem Schulhof gebracht hat So, und auch wenn ich TV total geil fand, zu den Zeiten, wohlgemerkt zu den Zeiten, wo es das noch nicht täglich gab, das wurde ja auch mit der Zeit dann echt, naja, nicht, sondern nicht toll Da war auch viel Trash dabei Ich finde, ich finde, man muss es nicht schlechter reden, also man muss es nicht so sehr übertreiben Ja, Crap haben sich alle schon angeguckt und ich glaube, bleibende Schäden trägt da keiner davon, wenn er YouTube guckt Das läuft eher darauf raus, dass die Leute nach ein paar Jahren einfach der Sache so übertrüssig sind, dass sie sich den Scheiß nicht mehr geben können Es gab schon viele Channels, die hatten den richtigen Boom und sind jetzt weg vom Fenster Wie gesagt, deswegen kann man wirklich nur mal echt sagen, so Hut ab von Simon Desue, der es geschafft hat, mit Kindergartenprogramm über 10 Jahre da gut relevant zu bleiben, musste er erst mal schaffen So schlimm sind die doch gar nicht Ich hab vergessen, wer es ist, war das Apecrime? War das, nee, nee, oder? Alter, der ist überhaupt nicht mehr angesagt mittlerweile, okay, das ist 2016 Und ich muss euch ehrlich sagen, so schlimm ist der Typ doch gar nicht gewesen Das war halt der erste, der so extrem den Sellout gemacht hat und dieses, oh Leute, ich liebe alle meine Abos und ihr seid die besten und ich wäre nichts ohne euch Das war halt einer der ersten, der damit angefangen hat, aber okay, irgendwie, irgendwie, das ist einer der Leute, irgendwie hab ich dem sogar noch halbwegs abgekauft Oh Gott, KS Freak, okay, es gibt ein paar Leute, die kann ich echt nicht ab Ja und? Ja, da ist schon was dran, aber mal ganz ehrlich, es ist nur einfach so, wenn du nix sagst, machen es viele Leute nicht Und es ist halt gerade auf YouTube, YouTube ist eines, das darf man nicht vergessen YouTube ist eines der kompetitivsten Plattformen, die es überhaupt nur gibt Und nachdem so Sachen wie Likes, Comments und vor allem Watchtime halt ganz entscheidend beeinflussen, wie sich deine Sachen in Zukunft entwickeln, finde ich nicht verwerflich, so diese Optimierung irgendwie zu machen Ja, natürlich ist das ein bisschen affig, aber das finde ich irgendwie noch alles legitim Die nächste Dimension des Ganzen ist dann Product Placement, das mal und mal nicht gekennzeichnet in ungefähr immer derselben Art und Weise präsentiert wird Kapi Klaus fragt, du meintest mal, du verdienst mit YouTube so viel wie mit deinem Shop, stimmt das noch? Nee, nee, nee, nee, überhaupt nicht, also wenn ich das jetzt hochrechnen würde, was ich im Dezember verdient habe aus Twitch, aus YouTube und aus Amazon Ich habe ja übelst einen Amazon Sellout gemacht, ja, dann kommt es ungefähr so hin, wie wenn ich sagen wir mal zwölf Monats, nee, nee, nee Eher acht Monats Gehälter, nur wenn ich Dezember hochrechnen würde, ja, ich habe einfach zu wenig gemacht dieses Jahr oder generell die letzten sechs Jahre habe ich einfach zu wenig gemacht, nee, nee, das stimmt schon lange nicht mehr Ich glaube das niedrigste was ich mal mit YouTube verdient habe war sechzehn Euro im Monat oder zwölf Euro oder so, also reines YouTube AdSense, aber es ist ja auch so, dass die meisten Leute ihr hauptsächliches Geld nicht durch YouTube AdSense machen Das meiste ist Reflinks und irgendwelche Sponsorships, Placements und sonstige Sachen, nee, aber selbst wenn ich die Twitch Subs zusammenrechne, Sellout mit Amazon, Reflinks und YouTube, da komme ich wenn es hoch kommt auf acht Monats Gehälter oder so Was ich, also wie gesagt wenn ich diesen einen Monat hochrechne und wie gesagt ich habe ja diesen Monat auch nicht viel gemacht, also ja, nein, nein, nein, nein, nein, nein, nein, nein, nein, so war das nicht gemeint, so war das nicht gemeint Wenn ich das was ich im Dezember verdient hätte, quasi hochrechne, so über das Jahr, also das was ich im Dezember verdient hätte mal zwölf, dann würde ich ungefähr auf acht Monats Gelder von meinem normalen kommen Nein, nein, nein, das hätte, also ohne Scheiß, hätte ich im Dezember, hätte ich im Dezember für acht Monate Geld verdient, dann würde ich nicht mehr arbeiten gehen Wenn ich mit diesem Mini Aufwand, wo waren wir denn jetzt überhaupt, Alter, ETF, wenn ich mit diesem Mini Aufwand, bin ich jetzt dumm Ah hier, wenn ich mit diesem Mini Aufwand so viel verdient hätte wie in acht Monaten, dann würde ich echt nicht mehr arbeiten gehen Heute schon Schnee geschummt, es gibt keinen Schnee, bei uns ist nichts Es soll ja angeblich schneien, guck mal, aber macht es nicht, also es hätte schneien sollen, aber hat es nicht Guck hier, hier ist Schnee, gucken, gucken ob das heute noch schneit Nö, ha, ha, Postchamp? Nö, gibt kein Schnee, Standort liegt, ja schon wieder Nö, gibt kein Schnee, wie gesagt, wenn Schnee gibt, ich mach, ohne Scheiß, ich mach ein Schneestellensvideo, ok guck mal weiter, Product Placement Alter, Vera, wenn ich die, es gibt Leute, die triggern mich echt, wenn ich sie sehe, also Vera ist eine, eine Person davon Ja das, ok, das war 2016 echt ein Problem, mittlerweile sind sie da ein bisschen vorsichtiger geworden, weil das auch so, auch Fokus von, ähm, also rechtlichen, rechtlichen Fokus jetzt gekriegt hat Früher, früher war das so, da konnte Dagi Bee so mal sagen, so ha, ich war heute einkaufen, ich hab zufällig diese schöne, günstige Uhr gefunden bei XY, guckt sie euch mal an, das geht heute nicht mehr so ohne weiteres Ui, hier ist diese mega coole Sonnencreme, die ich mir gekauft habe, wenn ihr die haben wollt, ich hab sie, weil ich ja so scheiße freundlich bin, mal in die Beschreibung gepackt So oder so ähnlich läuft das meistens ab, und das haben auch die Pubertierenden gemerkt, wenn auch nicht bewusst, was macht man denn, wenn man ein großes Vorbild gefunden hat, richtig, man ahmt es nach Und das ist auf YouTube, wisst ihr, wisst ihr was das, was das erste ist, was die Leute machen, wenn sie den YouTube-Channel gerne gucken Ich wette mit euch, dass das, dass das so ist Die gehen in eine Suchmaschine ihrer Wahl und geben den Namen des Channels ein mit der Kombination Porn Ich kann es mir so richtig vorstellen, das dürfte heißt, die Leute gucken, jeder 100 pro, guckt, in dem Alter direkt danach, 100 pro Ach du Scheiße, ok, ok, ok, ich geb zu, das Timing war jetzt schlecht Penobel ist unterwegs Kauft euch ein paar Kabelbinder, kann ich da nur dazu sagen Dieses Eistee Und was ich auch noch sagen wollte Bildschirm mit Kamera abfilmen, oh Minecraft, was sonst Like a Phoenix, apropos, was ist eigentlich aus Belle Delphie geworden Tja, da musst du bei ihr auf Onlyfans gucken Ich habe gehört, es gibt neuen Content Holt euch Spotify, das ist kostenlos, das gibt es bei Facebook Und Minecraft, das ist halt eine gekraftete Version Ok, es interessiert mich jetzt einfach mal, gibt es diesen Typ noch aus dem Video? Marcel Hille, der ist heute bestimmt krasser Minecraft-YouTuber Oh nee Ok, ich hab nichts gesagt Ach du Scheiße, warum Eine gekraftete Version Und damals haben sie Lisa Cat oder so noch gebannt, weil sie zu jung war für YouTube Die sind ja heute 8 oder so Nur wenn ihr mir jetzt auf meiner PayPal Link Ach du Scheiße Ich pack die rein und dann könnt ihr mir halt, also ich weiß nicht, ihr könnt mir halt Geld senden Warum Diese Teenager und Kinder sind die nächste Stufe What the fuck Die Fans von Dagi Bee, KSFleek und Leon Machère, sie sind auch noch Fans von YouTube selbst Oder eher von dem YouTube, welches sie glauben Danny Burnage gibt es doch auch nicht mehr, doch, doch, den gibt es noch Der macht jetzt aber nur funny Let's Plays auf seinen anderen Channels Um zu kennen Als man Fan von Batman oder Pokemon war, hat man seiner Fan liebefreien Lauf gelassen Indem man gewisse Dinge einfach nachgespielt hat Mittlerweile ist die technische Entwicklung so absurd, dass man YouTube Star auf YouTube selbst spielen kann Was man dann sieht, ist oftmals psychologisch sehr interessant Alter, was machen die ganzen Kinder auf YouTube Was ist denn da los Was What the fuck Ich kann dazu aber null sagen, weil ich habe noch auf keinem Gerät bisher TikTok verwendet Ich kenne nur immer irgendwelche Cringe Ausschnitte, die man ab und zu mal in YouTube Compilations sieht und sowas Nein, wir haben keinen Schnee Was ist denn da jetzt eigentlich raus geworden Sollte TikTok in den USA nicht irgendwie eingestellt werden oder so Was ist da jetzt eigentlich rausgekommen Oder wollte Microsoft nicht TikTok kaufen oder irgendwas in der Richtung Die Richts hat es verboten Achso ja okay easy Dann hat sich das ja erledigt Musik anspeisen Musik Damit hast du ja quasi schon widersprochen Also wenn du sagst, es ist egal welchen Content man produziert Solange man Sachen macht, die im Trend sind Dann ist es eben nicht egal welchen Content man produziert Sondern man muss Content produzieren, die mega im Trend sind Zum Beispiel hättest du vor vier Jahren Fidget Spinner Tricks machen müssen Oder sowas Ich weiß nicht, wenn man das immer nicht lang das her ist Du bekommst immer TikTok Links geschickt Ja das liegt ja wahrscheinlich auch daran, weil du Freunde hast, die TikTok angucken Ich habe erstens keine Freunde und zweitens keine, die TikTok angucken Also insofern hat sich das erledigt easy Easy Heute musst du eine Hydraulikpresse besitzen Stimmt, das gucke ich tatsächlich auch manchmal gerne Das gucke ich auch manchmal diese Videos Die sind eigentlich richtig hängen geblieben Der macht einfach Videos, wo er irgendwelche Dinge zerdrückt mit seiner Hydraulikpresse Das ist alles Das kommt einfach gut an So Crap Das gibt es doch, ja das ist voll angesagt Übrigens einfach mal 65 Tonnen Das ist Kilo, ja das sind Kilo, keine Kakao einhalten Das ist Satisfying, das ist auch so ein Trend der letzten Jahre Satisfying Genau, da siehst du dann Leute, die schleifen irgendwas ab Die drehmeln irgendwas, die machen irgendwelche Dinge Die machen irgendwelche Omelettes oder so Diese Videos sind auch voll im Trend ASMR geht auch gut ab Ja und wisst ihr gerade was man bei ASMR Content gut sieht Sobald ein gewisses Video oder Themengebiet, ein gewisses Genre eine Beliebtheit erreicht hat Kommen die Boopcam Streamer Ihr müsst das mal vergleichen, wie der Content vor 5 Jahren ausgesehen hat, wie der Content jetzt aussieht 90% der neuen ASMR Channels sind irgendwelche Camgirls Die versuchen damit auch noch ein bisschen Geld zu machen Das ist echter Wahnsinn Und nebenbei noch Onlyfans bewerben ASMR ist so cringe Ich muss euch ehrlich sagen, ein paar Channels gucke ich mir auch ganz gern an Aber das meiste kann man sich echt nicht geben So, also Das ist in Skandinavien, natürlich benutzt der richtige Einhalten, jawoll Zum Glück Gehen wir aus den USA, dann werden das jetzt Ounces oder sowas Ich weiß nicht, in was haben die Amis ihre Hydraulik pressen Wehrfoot per Inch oder was auch immer Ich weiß nicht Pound per Squarefeet Ach du große Scheiße Wie rechnet man sowas überhaupt um Ja ASMR Eating Videos mag ich auch nicht Und was ich auch absolut nicht ab kann Wo wir gerade wieder beim Thema sind Seitdem die ganzen Camgirls, die zusätzlich noch ASMR Content machen, am Start sind Gibt es dann irgendwie Ear-Licking-Videos Das ist jetzt kein Witz, ich gebe es jetzt nicht in YouTube ein Ich will euch nicht so sehr belasten chat Aber wer mal wirklich ganz hart cringen will, gibt das ein in die Suche Das ist, ich weiß nicht warum das so beliebt ist Ich kann es nicht nachvollziehen Die lecken die ihr Mikro ab, ne die lecken bei ihrem Mikro Ne ne mach ich nicht So was gucken wir uns jetzt als nächstes an, zeig mal her 14 Leute in Xbox Live Extended haben, exellent Ne wir gucken uns jetzt ne Runde Battlefield Top Plays an Ich brauch jetzt, ich brauch ne Runde Battlefield Top Plays, easy Jawoll, gib mir, gib mir 10 Minuten Battlefield Top Plays, das muss jetzt sein Barbershop war eines der besten ASMR Der Barbershop der ist wirklich, der ist ja uralt Aber der ist wirklich audio technisch wirklich gut aufgenommen Das ist so einer der ersten 3D Sounds, Surround Sounds Dinger Oder nicht Surround Sounds, Binaural Videos auf YouTube Der ist wirklich gut Das ist auch kein ASMR Video, das ist eher so ne Tech Demo von ihrem Audio Setup Wo der Typ links und rechts rumläuft, das muss man sich mal in Ruhe an, das ist wirklich gut gemacht Sollen wir das Battlefield Video gucken? Da Exellent Den mach ich absichtlich nicht so laut, weil der Typ hat immer commentary, immer exakt das gleiche, ich laber einfach eh drüber Was wird denn wohl Battlefield 6? Die machen Modern Warfare Setting, bin ich mir ziemlich sicher Und ich glaube sie werden es verkacken Auch wenn ich mir wünsche, dass ein geiles Battlefield rauskommt Aber ich kann mir nicht vorstellen, dass sie es nach den letzten Battlefields und den letzten verkackten Sachen jetzt auf einmal da was Gutes rauskommt Ich hab die Hoffnung aufgegeben Ich hoffe ich werde eines besseren belehrt Ja allein der Knife Countdown fand ich auch übelst doof in Battlefield 4 Der Heli Typ, oh, oh, ich glaub gleich machts bumm Und was man da auch gesehen hat ist, dass der Chat ist weg, aber die Angels sind noch da Jetzt Battlefield Logik Cod hat doch massig Konkurrenz, das ist doch kaum, Warzone hat Call of Duty gerettet, das war auf den Weg in die Bedeutungslosigkeit Nach den letzten Teilen, Warzone ist das einzige was es gerettet hat Das Castle Border, ah ne, ne das ist die Satellitenschüssel Map, die inspiriert war von dem echten Teleskop was jetzt eingestürzt ist What the fuck Was ist das So ein Glück hätt ich auch mal gerne Ok ey, diese Glück musst du wirklich erstmal haben, ich schieß nie vorbei und dann fliegt jemand anderes rein Das sollte eigentlich nicht erlaubt sein Ich will, dass bei jeder Rakete, die ich misse, dass einer reinfliegt Jetzt wird, jetzt wird Er wurde umgemörsert Let's go Ah, jonna erzitter Battlefield Logik Das ist so Dinger, ich find kacke, dass das in den neuen Battlefields nicht mehr geht So hängen geblieben, die Battlefield Physics waren, aber irgendwie war das nice What Hä Jetzt wirds gegenseitig geneift Ja die Battlefield Physics waren schon nice, das geht ja in den neuen nicht mehr Hä Ich hab keine Ahnung was da passiert ist, ich hab keinen Plastenschimmer Ich würd eher drauf tippen, der Typ der ihn geneift hat, hat grad disconnected oder crash Oh, Bad Company 2 Musik, beste Hahaha, Teamkills, Moment Ah ne, ich dachte es wäre der Captain Peng aus dem Chat gewesen, der Name sieht so ähnlich aus, ne, ist er aber nicht Ne, ne Aber ich muss sagen es sah auf den ersten Blick schon ähnlich aus Ja bitte den Clip noch dunkler machen, dass man noch mehr sieht Wenn man jetzt noch was sehen würde, wär halt Poggers Ja, Flo690 wahrscheinlich armor oder so Oh, what Oh, Poggers am Start Wisst ihr was ich an den Snipern in Battlefield geil finde, so an diesen, die Animationen sind immer so smooth Ah man sieht es nicht mehr, die haben es richtig gut gemacht Auch wenn ich kaum Sniper spiel, aber die Animationen sind immer echt nice Bam, oh, das war cool, er ist Pilot und dann Gunner rausgebasht 360 NoScope Das war cool Das ist, das ist, also ich sag mal, der hat das sicherlich predicted ein bisschen, aber da war schon zu 90% Glück, dass der sich nicht bewegt hat Oder Setup ist auch durchaus möglich Sieht aus wie Call of Duty 4, die erste Mission Wie sind sie schneiben lassen? Warum, aber das ist Spawn Immunity gewesen Der hat, der hat, der hat seinen Name auch ein bisschen verkackt, warum hat er sich nicht Ariane Kek oder Ariane Kek genannt oder so Der hätte es richtig Twitch-konform Namen haben können Ariane Kek wäre doch was gewesen, oder Ariane Kek Aber nein, er macht Ariane Kek Die hören sich auch an, dann schlafen sie gleich ein beim Spiel, oder? We use Discord No, no, no, no Discord Die an aufwachen Stream gucken müssen Okay, das ist jetzt Lucky Hit, Lucky Hit gibt das jetzt Der schießt einfach random Der schießt einfach random in die Richtung Alter, jetzt übertreibt das aber Hyper Gatschi Ja, das war einfach random in den Himmel geschossen Also meiner Meinung nach ist das kein Top Play, das ist Top Luck Ich meine, es ist cool zu sehen, aber es ist einfach Top Luck, kein Top Play Das war auch mehr Glück als verstanden Und jetzt, und jetzt noch in den Chat rein, oh Mist, das wäre cool gewesen, wäre jetzt noch in den Chat zurückgekommen Äh, what? Fliegt der jetzt noch rein? Ja, okay Also ich finde die Killstreaks Clips, die rasant starten besser, wo einfach Leute irgendwie zwanzig Leute wegbashing Ich bin mir ziemlich sicher, die haben diese Map nur noch mal Remaked Ich meine, das ist ja glaube ich ursprünglich eine Battlefield 2 Map, die gab es in Battlefield 3 und in Battlefield 4 Und ich bin mir ziemlich sicher, dass sie die nur noch mal Remaked haben, weil sie wollten eine Map mit Sandsturm machen Und sie hatten keine Map für Sandsturm und da haben sie gesagt, lass uns einfach Guilford Format nehmen und machen Sandsturm drauf Das einzige Grund warum die noch drin ist, weil die zeigen wollen, wie cool ihren Sandsturm ist Das Konsole, das hat so viel Motionblur, ja, Playstation Watch what happens next, Battlefield Entwickler hassen diesen Trick Lifehacks, die dein Leben verändert werden Hä? Was? Das habe ich nicht gecheckt Wie genau ist der andere jetzt gestorben? Was ist Motionblur Bewegungsunschärfe? Der hat die Turbinen angemacht, ah Na ja, den hätte ich vielleicht auch noch gehitted Moment, warum überlebt der das? Oh, wann gibt es Venice Unleashed Surfing Maps? MarioLE, Twitch Prime, Dankeschön für den Zap Battlefield Surfing Maps, das wäre es doch noch Und jetzt in den Jet reinspringen Nice, so Clips mag ich, die sind cool Die sind richtig nice Eine Runde TV Missiles Man muss ja schon sagen, manche Leute können extrem gut Jet und Heli fliegen in dem Game Ich kann es ja gar nicht, ich habe es auch nie großartig probiert, weil ich am liebsten Infanterie spiele Aber das war gar keine TV Missile Stimmt, es kann keine TV Missile gewesen sein, weil keiner die TV Missile gesteuert hat Und jetzt in den Jet, jawoll, nice Zack Wow, das war aber ganz schön weit weg Ich meine, guckt euch mal, das Game ist jetzt auch irgendwie 6 Jahre alt oder so, sieht immer noch extrem geil aus Das könnte auch ein Ace Combat sein oder sowas Wird Max DPS zum Overwatch 2 wieder belebt? Ich weiß nicht, ob ich Overwatch 2 spielen werde, eventuell Aber dann werde ich es mir erst mal in Ruhe angucken Aber ich glaube ehrlich gesagt nicht, dass Overwatch 2 so krass einschlägt, wie man in Overwatch 1 Ist das Fake? Ist das Fake, Leute? Ist das Fake? Ist das Setup? Ich meine, der Typ, der steht am Arsch der Welt und der Heli steht am Arsch der Welt und hovert einfach da vor sich hin Und ansonsten passiert auch grad nichts so richtig Das ist Setup, was macht der Heli denn da? Und das Server ist ja auch leer Ja oder weniger, scripted, ja Guck mal, warum fliegt der Jet so? So fliegt doch keiner im Jet Warum sollte so jemand fliegen im Jet? Professional Battlefield Streamer, guckt euch das mal an, mit High Quality Facecam und allem NA-Aimed, so wie ich, das hätte ich 1 zu 1 NA-Aimed von mir sein können Ja, catch uns mal in der nächsten Episode, exellent Ich weiß nicht, ich bin schon mal noch übelst grün Normalerweise wache ich nach, wie lange sind wir jetzt jetzt? 1,5 Stunden wache ich meistens langsam auf, ne? Making Lego Car Climb, was? Ach hier, nicht Climb, Climb Making Lego Car Climb Obstacles Hast du Bitcoin? Ich hätte gerne Bitcoin, gibst du mir welche ab? Ah, yes, es sieht zwar absolut nicht mehr aus wie ein Lego Auto, aber es kommt das Buch hoch Okay, da brauchst du ziemlich gut gummierte Reifen und hohe Übersetzung, dass du da hochkommst Oh no Was kommt als nächstes? AI trainiert Lego bauen Oh Wie soll das funktionieren? Oh jetzt kommt Big Brain Konstruktion Ich habe keine Ahnung, was er da macht, aber es sieht gut aus Was? Das ist ja mal Big Brain, Alter Oh, oh, wie das geht? Oh, MonkaS Oh Insane, nice, oh jetzt will er es wissen Oh Das hätte ich nicht gedacht, dass er so einfach über das einzelne hochstehende Buch kommt Spagat und jetzt Massive Big Brain Lego Konstruktion hier Oh Oh Nice Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh", "segments": [{"id": 1, "start": 30.0, "end": 50.0, "text": "Oh man, headset ist mir total verknotet."}, {"id": 2, "start": 50.0, "end": 51.48, "text": "Wie geht das eigentlich?"}, {"id": 3, "start": 51.48, "end": 54.16, "text": "Ich mach nix und eine Woche später ist es wieder verknotet."}, {"id": 4, "start": 54.16, "end": 61.24, "text": "Ich weiß, jetzt kommen die ersten Leute und sagen, Max, Wireless, null weh, aber gerade"}, {"id": 5, "start": 61.24, "end": 67.04, "text": "hier will ich keinen Wireless-Headset haben."}, {"id": 6, "start": 67.04, "end": 73.4, "text": "MMX300, bester, Digga, MMX300 fühl ich, Alter, ja."}, {"id": 7, "start": 73.4, "end": 79.96, "text": "Moin Leute, wer ist am Start, der Phipps ist da, der Mark, Michael, 50 Billionen, der Moritz,"}, {"id": 8, "start": 79.96, "end": 85.68, "text": "ja, Chat geht wieder, gestern hat es ziemlich ripp gewesen, Twitch, es ging bestimmt eine"}, {"id": 9, "start": 85.68, "end": 86.68, "text": "halbe Stunde nicht."}, {"id": 10, "start": 86.68, "end": 92.48, "text": "Also Twitch allgemein hatte richtig Probleme gestern Abend wieder."}, {"id": 11, "start": 92.48, "end": 98.6, "text": "So ist das halt, wenn man anstatt testmäßig einfach mal kurz live deploit, haben sich"}, {"id": 12, "start": 98.6, "end": 104.76, "text": "bei Twitch gedacht, ach so eine kleine Änderung wird schon nix kaputt machen und BÄM, alles"}, {"id": 13, "start": 104.76, "end": 106.44, "text": "kaputt, wer kennt es nicht?"}, {"id": 14, "start": 106.44, "end": 114.52, "text": "Mir ist übrigens aufgefallen, wenn ich auf Twitch, auf mein Channel gehe, ist es irgendwie"}, {"id": 15, "start": 114.52, "end": 120.36, "text": "ein bisschen abenseelig und zwar, guck mal, wie funktioniert das hier, null, man sollte"}, {"id": 16, "start": 120.36, "end": 128.12, "text": "eigentlich von ausgehen, dass ich das nach, keine Ahnung, drei Jahren oder so weiß, aber"}, {"id": 17, "start": 128.12, "end": 129.12, "text": "anscheinend nicht."}, {"id": 18, "start": 129.12, "end": 133.0, "text": "Vielleicht soll ich die Emotes auch mal ein bisschen kleiner machen."}, {"id": 19, "start": 133.0, "end": 146.6, "text": "Ja, also wie gesagt, man sollte von ausgehen, dass ich das irgendwann weiß, aber nein,"}, {"id": 20, "start": 146.6, "end": 152.16, "text": "ich weiß es nicht und ehrlich gesagt, ich weiß gar nicht, was soll ich überhaupt auf"}, {"id": 21, "start": 152.16, "end": 157.48, "text": "mein Twitch Profil draufschreiben, was schreiben denn andere da auf ihr Twitch Profil so drauf?"}, {"id": 22, "start": 157.48, "end": 164.44, "text": "Wer wird mir denn hier empfohlen?"}, {"id": 23, "start": 164.44, "end": 165.44, "text": "Kenn die alle nicht, wer ist das?"}, {"id": 24, "start": 165.44, "end": 173.12, "text": "Was schreibt man so auf sein Twitch Profil drauf?"}, {"id": 25, "start": 173.12, "end": 183.12, "text": "Long have we waited, now which you baited, keine Ahnung, weiß nicht, was man so auf"}, {"id": 26, "start": 183.12, "end": 184.64, "text": "sein Twitch Profil draufschreiben sollte."}, {"id": 27, "start": 184.64, "end": 191.92, "text": "Vielleicht, vielleicht einen Streaming Plan, wenn man einen hat, aber ich habe ja keinen"}, {"id": 28, "start": 191.92, "end": 198.6, "text": "Streaming Plan, oh Sellout, das ist eine richtig gute Idee, das mache ich später."}, {"id": 29, "start": 198.6, "end": 204.36, "text": "PC Specs, Mikrofon, Maus, Tastatur, Audiointerface, kommt alles drauf, das ist eine gute Idee,"}, {"id": 30, "start": 204.36, "end": 207.96, "text": "das ist eine echt gute Idee, wenn man nicht weiß, was man drauf machen soll, dann einfach"}, {"id": 31, "start": 207.96, "end": 218.68, "text": "alles Sellout Space verwenden, ja, das ist eine gute Idee, das mache ich nachher, aber"}, {"id": 32, "start": 218.68, "end": 225.04, "text": "ansonsten habe ich echt keine Ahnung, was ich auf mein Profil schreiben soll, wie laut?"}, {"id": 33, "start": 225.04, "end": 231.16, "text": "Natürlich mit Reflings, mit was denn sonst?"}, {"id": 34, "start": 231.16, "end": 235.72, "text": "Ich mache doch keine Sellout Amazon Links ohne Reflings."}, {"id": 35, "start": 235.72, "end": 240.2, "text": "Was normalerweise gestreamt, gezockt wird, ja, das ist halt irgendwie übelst random,"}, {"id": 36, "start": 240.2, "end": 242.32, "text": "ich meine, da kann er nichts draufschreiben."}, {"id": 37, "start": 242.32, "end": 244.6, "text": "Ist der Twitch Chat kaputt?"}, {"id": 38, "start": 244.6, "end": 245.6, "text": "Ne."}, {"id": 39, "start": 245.6, "end": 252.88, "text": "Ah, gbait, gbait, verstehe, ein gbait versucht, der sich selbst entgbaitet, auch nicht schlecht."}, {"id": 40, "start": 252.88, "end": 257.4, "text": "Ja, wenn man sich mal anguckt, die letzten Streams, da ist ja alles Mögliche dabei, Linux"}, {"id": 41, "start": 257.4, "end": 266.04, "text": "Stels, irgendwie, also gut, es ist der Silvester Stream, Battlefield 3, da ist ja wirklich alle"}, {"id": 42, "start": 266.04, "end": 273.64, "text": "möglichen Sachen, da kann man ja echt nichts irgendwie davon ableiten, ne?"}, {"id": 43, "start": 273.64, "end": 283.24, "text": "Gibt es im Jahr 2021 neue Technik-Gadgets, mit Sicherheit, gibt es laufend, muss einfach"}, {"id": 44, "start": 283.24, "end": 289.24, "text": "bei Aliexpress gucken und solange du dich nicht kaputtlachst über den komischen Titel"}, {"id": 45, "start": 289.24, "end": 295.84, "text": "der Sachen auf Aliexpress, einfach bestellen, die Seitentitel auf Aliexpress sind ja immer"}, {"id": 46, "start": 295.84, "end": 296.84, "text": "das Beste."}, {"id": 47, "start": 296.84, "end": 308.4, "text": "Super Low Power PC, Intel, AMD, PC, Gehäuse, Rechner, Computer, PC oder sowas steht dann"}, {"id": 48, "start": 308.4, "end": 313.2, "text": "da oben, bei Aliexpress im Titel, das kannst du immer, und im Endeffekt, was ist es dann"}, {"id": 49, "start": 313.2, "end": 314.2, "text": "an?"}, {"id": 50, "start": 314.2, "end": 315.44, "text": "Es ist da eine Smartwatch oder sowas."}, {"id": 51, "start": 315.44, "end": 321.64, "text": "What the fuck, wir haben, Moment, Moment, wir haben ein Ausrufezeichen für den Dark"}, {"id": 52, "start": 321.64, "end": 329.6, "text": "3-Shot, das spiele ich doch gar nicht mehr, null W, Alter, also zumindest habe ich das"}, {"id": 53, "start": 329.6, "end": 334.6, "text": "schon eine Weile nicht mehr gespielt und das ist aber immer noch der beste Server, wenn"}, {"id": 54, "start": 334.6, "end": 339.56, "text": "das einer spielen will, weil da sind nämlich Spieler drauf, die haben abends immer noch"}, {"id": 55, "start": 339.56, "end": 347.44, "text": "so 1300 oder so Spieler, was für so ein uralt Game-Free-Shot mäßig ziemlich gut ist."}, {"id": 56, "start": 347.44, "end": 351.12, "text": "Ich meine, das ist besser als die offiziellen Server, die offiziellen Server haben ein paar"}, {"id": 57, "start": 351.12, "end": 352.12, "text": "hundert oder so."}, {"id": 58, "start": 352.12, "end": 359.28, "text": "Chat, was gucken wir, komm, wir lassen dann mal, ich habe hier schon mal ein, wir lassen"}, {"id": 59, "start": 359.28, "end": 364.32, "text": "dann mal ein bisschen über die Server Setups von Leuten."}, {"id": 60, "start": 364.32, "end": 374.72, "text": "Desaster, Serverroom Cleaning, ne, das muss ich mir nicht angucken, mein Serverroom sieht"}, {"id": 61, "start": 374.72, "end": 379.44, "text": "ja auch nicht gerade schön aus, das muss ich mir jetzt hier nicht noch im Video anschauen."}, {"id": 62, "start": 379.44, "end": 388.72, "text": "Upgrade-Time, das war langweilig, 6 Jahre alt Computer in den Server konvertieren ist"}, {"id": 63, "start": 388.72, "end": 393.24, "text": "ja nicht schwierig, einfach den Kram drauf installieren, den man 24-7 laufen lassen will,"}, {"id": 64, "start": 393.24, "end": 399.04, "text": "aber das Zeug braucht halt meistens unsinnig, viel Strom oder ist lahm oder ist laut, nix"}, {"id": 65, "start": 399.04, "end": 409.04, "text": "dabei, nix dabei, Server Rack Tour Network Setup, Alter, what the fuck, wie alt ist der?"}, {"id": 66, "start": 409.04, "end": 416.64, "text": "Der ist doch keine 14, oder, darf der überhaupt schon Youtube-Videos machen?"}, {"id": 67, "start": 416.64, "end": 427.0, "text": "Aber immerhin, Server Rack, das gucken wir uns jetzt mal schnell an, Alter, der ist höchstens"}, {"id": 68, "start": 427.0, "end": 436.72, "text": "12, Alter, aber Server Rack am Start, nicht schlecht, der fängt schon früh an, oder es"}, {"id": 69, "start": 436.72, "end": 442.96, "text": "ist das Server Rack vom Vater, man weiß es nicht genau, aber das ist zumindest mal einer"}, {"id": 70, "start": 442.96, "end": 447.12, "text": "der jüngeren Comments turned off, wahrscheinlich weil die Leute sich lustig drüber gemacht"}, {"id": 71, "start": 447.12, "end": 450.92, "text": "haben, weil er so jung ist, aber who cares, ja, ich mein, immerhin, das ist wenigstens"}, {"id": 72, "start": 450.92, "end": 457.36, "text": "mal einer, der noch durchblickt dann, es war dann hier am Start, Unify Gedöns, irgendeinen"}, {"id": 73, "start": 457.36, "end": 464.88, "text": "Cisco Switch, wie spricht man Cisco eigentlich cool aus, Amazon kann man cool aussprechen"}, {"id": 74, "start": 464.88, "end": 472.28, "text": "und solche Sachen und Ubuntu kann man Ubuntu aussprechen, wie spricht man, wie spricht"}, {"id": 75, "start": 472.28, "end": 479.08, "text": "man ein Cisco cool aus, gibt es da, da muss es doch irgendwas, eine coole Aussprache geben"}, {"id": 76, "start": 479.08, "end": 489.24, "text": "für, aber immerhin, der plickt wenigstens, der plickt wenigstens mal später durch was"}, {"id": 77, "start": 489.24, "end": 493.32, "text": "computermäßig angeht, wenn man mit 12 schon, ich schätze den jetzt einfach mal auf 12,"}, {"id": 78, "start": 493.32, "end": 500.76, "text": "keine Ahnung, wenn man mit 12 schon hier mit Server Rack am Start ist und Netzwerk Setup"}, {"id": 79, "start": 500.76, "end": 507.0, "text": "und so macht, das Kabel sieht ein bisschen wählsmäßig aus, sieht aus wie ein 3D gedruckter"}, {"id": 80, "start": 507.0, "end": 515.72, "text": "Stecker, ist doch in Ordnung, top, wenigstens einer, der noch mal durchblickt, Sysco, oh"}, {"id": 81, "start": 515.72, "end": 533.56, "text": "ne, ne, das klingt ja richtig cringe, ok, nächstes dabei, dann gucken wir uns jetzt"}, {"id": 82, "start": 533.56, "end": 548.36, "text": "durch das Setup von anderen Leuten an, Alter ich bin auch müde, Cisco, ja das stimmt,"}, {"id": 83, "start": 548.36, "end": 561.6, "text": "die Leute haben auf Deutsch früher immer Cisco ausgesprochen, ja kann schon sein oder"}, {"id": 84, "start": 561.6, "end": 568.24, "text": "aber, der Vater ist, oder die Mutter, wahrscheinlicher ist der Vater, ist halt auch so technikinteressiert"}, {"id": 85, "start": 568.24, "end": 574.48, "text": "und hat den Kram schon am Start, also, Pasi hat gefragt, was würdest du nutzen um mit,"}, {"id": 86, "start": 574.48, "end": 579.84, "text": "oh ich hab den Chat nicht offen oder, hab ich den Chat offen, Moment, ja, hab ich aber"}, {"id": 87, "start": 579.84, "end": 586.96, "text": "Glück gehabt hier, was würdest du nutzen um Streamling mit Chatterino am Fernsehtwitch"}, {"id": 88, "start": 586.96, "end": 604.08, "text": "zu schauen, warum nicht einfach die Twitch App, ich weiß mag jetzt für meine Verhältnisse"}, {"id": 89, "start": 604.08, "end": 624.8, "text": "sehr konventionell klingen, ja, warum nicht einfach die Twitch App, ja, also das ist eine"}, {"id": 90, "start": 624.8, "end": 628.92, "text": "gute Frage, also wie gesagt, ich hab jetzt noch Urlaub heute und morgen, am Dienstag"}, {"id": 91, "start": 628.92, "end": 638.44, "text": "muss ich wieder arbeiten gehen und ich hab hier mal absolut keinen Bock, also Pläne,"}, {"id": 92, "start": 638.44, "end": 648.44, "text": "ja gut, ich hoffe halt, ich weiß nicht wie ich das alles sagen soll, also das steht und"}, {"id": 93, "start": 648.44, "end": 653.52, "text": "fällt damit, dass mir gute Themen einfallen wo ich Bock hab drauf aufzunehmen, ich werd"}, {"id": 94, "start": 653.52, "end": 673.48, "text": "heute ein Video aufnehmen zum Ende von Flash, Flash ist ja jetzt dead, Flash ist ja dead"}, {"id": 95, "start": 673.48, "end": 683.4, "text": "jetzt letztendlich, seit Dezember und ich werd mal ein Video zu machen, erst nochmal"}, {"id": 96, "start": 683.4, "end": 690.32, "text": "kurz drüber sagen warum Flash so kacke war und dann mal gucken wie man aktuell Flash"}, {"id": 97, "start": 690.32, "end": 710.64, "text": "Sachen spielen kann, wir haben das meiner Meinung nach zum größten Teil einer Person"}, {"id": 98, "start": 710.64, "end": 716.88, "text": "zu verdanken, warum es das jetzt soweit ist, warum es kein Flash mehr gibt und wisst ihr"}, {"id": 99, "start": 716.88, "end": 728.32, "text": "wem, also meiner Ansicht nach zumindest, hauptsächlich RIP Spielaffe, Spielaffe, ja das gabs ja noch,"}, {"id": 100, "start": 728.32, "end": 731.88, "text": "also ich bin der Meinung, dass wir das tatsächlich eines der Sachen die wir echt Steve Jobs zu"}, {"id": 101, "start": 731.88, "end": 736.24, "text": "verdanken haben, als der damals gesagt hat auf dem iPhone kommt dieser Scheiß erst gar"}, {"id": 102, "start": 736.24, "end": 751.04, "text": "nicht drauf, das war der Anfang vom Ende von Flash, was hast du auf deinem Server drauf,"}, {"id": 103, "start": 751.04, "end": 759.68, "text": "meistens Ubuntu, RIP Penner Game, ne Moment das Penner Game war doch nicht Flash oder,"}, {"id": 104, "start": 759.68, "end": 763.0, "text": "das Penner Game ist doch das wo dir die Leute auf irgendeine Seite gelockt hast und hast"}, {"id": 105, "start": 763.0, "end": 767.84, "text": "ihnen dann Geld abgenommen oder, kennt ihr noch diese komischen Affiliate oder ich weiß"}, {"id": 106, "start": 767.84, "end": 771.8, "text": "nicht wie man diese nennt, diese Games wo man irgendwelche Leuten eine Link geschickt"}, {"id": 107, "start": 771.8, "end": 776.56, "text": "hat, haha funny funny look, look hier, dann hast du dir eine Link geschickt und dann kam"}, {"id": 108, "start": 776.56, "end": 783.92, "text": "dann raus, Max hatte ihn 150 Big Brain Dollar gestohlen, kennt ihr diese Sorte von Games"}, {"id": 109, "start": 783.92, "end": 787.8, "text": "noch wo sich alle versucht haben gegenseitig auf irgendwelche unbekannten Links zu locken"}, {"id": 110, "start": 787.8, "end": 792.96, "text": "um ihnen dann im Game In-Game Währung zu klauen, was eigentlich überhaupt keinen Sinn hatte,"}, {"id": 111, "start": 792.96, "end": 812.28, "text": "weil du hattest im Prinzip kein Game sondern nur diese Scam Seite, excellent, Penner Game,"}, {"id": 112, "start": 812.28, "end": 823.48, "text": "was war das Penner Game, ich kenn das überhaupt nicht mehr, ach das Ding, Moment, stop das"}, {"id": 113, "start": 823.48, "end": 828.72, "text": "hab ich nicht gespielt, aber ich kenn das noch, ich kenn das noch, das waren so Dinge"}, {"id": 114, "start": 828.72, "end": 839.32, "text": "die hab ich komplett ignoriert, das Penner Game genau, ich kann mich dran erinnern, das"}, {"id": 115, "start": 839.32, "end": 861.56, "text": "linke, das da, Penner Game, ach das ist Penner Game 2, oh nein, das hier, ich kann mich noch"}, {"id": 116, "start": 861.56, "end": 868.2, "text": "dunkel dran erinnern, aber dazu hat man noch gar kein Flash gebraucht oder, das Browserspiel"}, {"id": 117, "start": 868.2, "end": 875.28, "text": "des Jahres 2006, es gab mal ne Zeit, da waren so Weltraum Browserspiele total beliebt, wo"}, {"id": 118, "start": 875.28, "end": 879.76, "text": "man dann irgendwie so mit ein paar Leuten angefangen hat und versucht hat irgendwelche,"}, {"id": 119, "start": 879.76, "end": 887.68, "text": "also rein 2D und rein Browser Webseiten, also nichts animiert und sonst was, ja sowas"}, {"id": 120, "start": 887.68, "end": 899.6, "text": "in der, ne warte, ne Dark, ne, ne, ne, ne, ne, das mein ich nicht, da bewegt sich ja sogar"}, {"id": 121, "start": 899.6, "end": 912.0, "text": "noch was, ne ich mein sowas, wie ist das, oh Game oder so, oh Game, Space, ne, das da,"}, {"id": 122, "start": 912.0, "end": 917.92, "text": "so Dinge haben die Leute da gespielt, ja, da hat sich nix bewegt, das war übelst, übelst"}, {"id": 123, "start": 917.92, "end": 922.92, "text": "Fail, du konntest dann auswählen, greife Gegner an und dann kam dann 3 Tage später"}, {"id": 124, "start": 922.92, "end": 930.64, "text": "zurück, Angriffe erfolgreich und solche Sachen, das ganze Game sei im Endeffekt, das ganze"}, {"id": 125, "start": 930.64, "end": 938.48, "text": "Game sei, krasser Screenshot, sei im Endeffekt nach Text aus, ja ich jetzt, klar das kennen"}, {"id": 126, "start": 938.48, "end": 945.4, "text": "paar, das war so 2005 oder so wo man den Kram gespielt hat oder noch früher und man fand"}, {"id": 127, "start": 945.4, "end": 956.28, "text": "das damals übelst, so übelst nice MMO mäßig, MMOs ist auch so ein Ding, ich finde MMOs"}, {"id": 128, "start": 956.28, "end": 961.72, "text": "haben so extrem nachgelassen und jetzt nicht so nach dem Hinblick, früher war alles besser"}, {"id": 129, "start": 961.72, "end": 968.64, "text": "so und ich kann das sogar begründen, also ich finde das eines der größten Aspekte in MMOs"}, {"id": 130, "start": 968.64, "end": 975.08, "text": "ist eben, dass das Massive Multiplayer ist, also sprich, dass es nicht darum geht, dass"}, {"id": 131, "start": 975.08, "end": 980.16, "text": "ich solo mit meinem Character vor mich hin queste, von Level 1 bis, keine Ahnung, 100"}, {"id": 132, "start": 980.16, "end": 986.08, "text": "oder wie weit das geht, sondern dass man zum größten Teil mit anderen Leuten eben, ich"}, {"id": 133, "start": 986.08, "end": 990.12, "text": "weiß hört sich jetzt doof aus meinem Mund an, ja, dass man mit anderen Leuten interagieren"}, {"id": 134, "start": 990.12, "end": 994.24, "text": "muss, ihr wisst, ich mag andere Leute eigentlich nicht und ich interagiere auch nicht gern"}, {"id": 135, "start": 994.24, "end": 999.12, "text": "mit anderen Menschen, aber in MMOs ist das anders, in MMOs ist okay, in MMOs kannst du"}, {"id": 136, "start": 999.12, "end": 1008.28, "text": "Leute einfach muten, wenn sie auf den Sack gehen, Camelot Unchained Soon, ja genau, das"}, {"id": 137, "start": 1008.28, "end": 1015.88, "text": "kommt nie raus, ich sag's dir nie, es wäre nice, wenn das rauskommt, aber ich, nee,"}, {"id": 138, "start": 1015.88, "end": 1023.48, "text": "ich sag mal mein Desktop mal kurz, weil ich weiß, der Chat mag meinen Desktop, so weiter"}, {"id": 139, "start": 1023.48, "end": 1029.12, "text": "und ich finde, eines der, also mit das Anfang vom Ende war in MMOs, wo sich Dungeon Finder"}, {"id": 140, "start": 1029.12, "end": 1035.76, "text": "etabliert haben, breit über alle MMOs, Dungeon Finder ist so eigentlich, geht komplett konträr"}, {"id": 141, "start": 1035.76, "end": 1040.04, "text": "so der ursprünglichen Idee von MMOs, nämlich, dass man die Leute kennt, mit denen man spielt"}, {"id": 142, "start": 1040.04, "end": 1044.72, "text": "und dass man halt eben so eine gewisse Server Zusammengehörigkeit hat und weiß, wer denn"}, {"id": 143, "start": 1044.72, "end": 1051.68, "text": "Spaß ist und wer gut spielt und sowas, das war mit Dungeon Finder komplett vorbei, klar,"}, {"id": 144, "start": 1051.68, "end": 1055.36, "text": "spätestens wenn du schwierige Sachen machst, ist es dann trotzdem wieder so, aber es ist"}, {"id": 145, "start": 1055.36, "end": 1061.44, "text": "halt mittlerweile in MMOs total anonym und gerade durch irgendwelche riesen Server Cluster"}, {"id": 146, "start": 1061.44, "end": 1068.8, "text": "und on the way Clustering und sowas, das führt dazu, dass im Endeffekt MMOs bloß noch sind"}, {"id": 147, "start": 1068.8, "end": 1078.96, "text": "Buff, Go Go, Kack Noob, Shit Tank, Shit Heal, Shit DPS, was auch immer, es ist nicht so,"}, {"id": 148, "start": 1078.96, "end": 1085.92, "text": "dass es nicht früher in MMOs auch Dappen gegeben hat, aber das Problem hat sich dadurch,"}, {"id": 149, "start": 1085.92, "end": 1089.4, "text": "dass man die Leute auf dem Server kannte, relativ schnell von selbst erledigt."}, {"id": 150, "start": 1089.4, "end": 1101.64, "text": "Liko sagt, wenn alles klappt werde ich auf Endian zügeln, was?"}, {"id": 151, "start": 1101.64, "end": 1109.6, "text": "Ach umziehen, zügeln, habe ich schon nie gehört, in der ersten Wohnung möchte ich"}, {"id": 152, "start": 1109.6, "end": 1113.88, "text": "auch an Smart Home einrichten, kannst du nicht mal so eine Übersicht machen, Musik, Staubsauger"}, {"id": 153, "start": 1113.88, "end": 1117.04, "text": "und Licht interessiert mich, oh ne, das ist schwierig, ich habe das Problem, wenn ich"}, {"id": 154, "start": 1117.04, "end": 1123.32, "text": "mal mein Smart Home Zeug zeige, da sind auch Standort und alles mögliche drin, da habe"}, {"id": 155, "start": 1123.32, "end": 1126.04, "text": "ich Angst, dass ich zig Sachen leake, die ich nicht leaken will."}, {"id": 156, "start": 1126.04, "end": 1137.24, "text": "Ich bin vom Radar verschoben, ich mache seit einem Monat wieder Videos, guck mal hier,"}, {"id": 157, "start": 1137.24, "end": 1146.48, "text": "Massive Upload Rate, ich habe jetzt immerhin geschafft 1, 2, 3, 4, 5, 6, 7, 8 Videos zu"}, {"id": 158, "start": 1146.48, "end": 1156.56, "text": "machen im letzten Monat, davor nicht wirklich, davor habe ich nichts gemacht, aber immerhin,"}, {"id": 159, "start": 1156.56, "end": 1161.48, "text": "ok eine Produkt Übersicht, ist auch schwierig, da müsste ich mir erstmal Gedanken machen,"}, {"id": 160, "start": 1161.48, "end": 1167.72, "text": "was ich alles habe, kann ich nicht so aus dem Ärmel schütteln, kann man sich bei dir"}, {"id": 161, "start": 1167.72, "end": 1176.2, "text": "auch IT Berufsberatung einholen, jetzt ganz einfach, mach kein IT, mach was mit Holz,"}, {"id": 162, "start": 1176.2, "end": 1190.6, "text": "das ist jetzt Big Brain Frage, was würdest du einem 20-jährigen Max sagen, wenn du könntest,"}, {"id": 163, "start": 1190.6, "end": 1202.96, "text": "das ist so eine Frage, wie beim Vorstellungsgespräch, wo sehen sie sich in 20 Jahren, ich würde"}, {"id": 164, "start": 1202.96, "end": 1207.56, "text": "einem 20-jährigen Max sagen, er soll mit YouTube anfangen und nicht zwischendurch immer wieder"}, {"id": 165, "start": 1207.56, "end": 1208.56, "text": "aufhören."}, {"id": 166, "start": 1208.56, "end": 1226.76, "text": "Wartest du auch auf das Apple Smart Home mit Noise Cancelling, was, nö, ich habe ein"}, {"id": 167, "start": 1226.76, "end": 1239.32, "text": "Heizungsdashboard, ja, jaja, das kennst du doch, das Heizungsdashboard, ihr wollt mich"}, {"id": 168, "start": 1239.32, "end": 1246.32, "text": "nur debaten, ihr wollt mich nur debaten, dass ich meine Heizungsüberwachung mal wieder"}, {"id": 169, "start": 1246.32, "end": 1261.76, "text": "zeige, by the way, das ist meine Heizungsüberwachung, hat, sag mal, hat Grafana irgendwelche CSS"}, {"id": 170, "start": 1261.76, "end": 1269.16, "text": "Probleme, normalerweise hat man doch gar, hat man doch nicht so komische Rahmen hier"}, {"id": 171, "start": 1269.16, "end": 1280.72, "text": "drum herum, das sah doch gestern noch anders aus, oder?"}, {"id": 172, "start": 1280.72, "end": 1283.56, "text": "Ich habe hier eingestellt, dass ich meinen Container automatisch updatet, vielleicht"}, {"id": 173, "start": 1283.56, "end": 1288.4, "text": "haben die irgendeine neue Version rausgebracht, das hat jetzt irgendwie CSS updatet, ich guck"}, {"id": 174, "start": 1288.4, "end": 1293.12, "text": "mal, ob ich das alte Grafana von gestern noch auf hab, was hast du bisher in Home Assistant"}, {"id": 175, "start": 1293.12, "end": 1294.12, "text": "integriert?"}, {"id": 176, "start": 1294.12, "end": 1308.28, "text": "Ja, da ist es noch offen, die Temperatur vom Gartenteich, Außentemperatur, Lichter an"}, {"id": 177, "start": 1308.28, "end": 1316.4, "text": "und aus, Heizung teilweise, Presence Detection, ich muss mal kurz nebenbei aufmachen, sonst"}, {"id": 178, "start": 1316.4, "end": 1325.6, "text": "vergess ich bestimmt die Hälfte, genau, Heizung an und aus, Heizung zeitgesteuert, Licht teilweise"}, {"id": 179, "start": 1325.6, "end": 1335.32, "text": "zeitgesteuert, Staubsauger aufladen, Kameraübersicht, wobei das macht einen extra Popup auf, weil"}, {"id": 180, "start": 1335.32, "end": 1341.56, "text": "das eingebaute, die eingebaute Kameraübersicht von Home Assistant sackt, ok, nee, ich hab"}, {"id": 181, "start": 1341.56, "end": 1346.8, "text": "nix gesagt, what the fuck, Grafana sah gestern schon genauso aus wie heute, ich hab das nur"}, {"id": 182, "start": 1346.8, "end": 1355.6, "text": "irgendwie nicht gecheckt, wie war der Fazit von der Distro gestern, Fail, also die Tiling"}, {"id": 183, "start": 1355.6, "end": 1361.96, "text": "Geschichte geht, aber die XFCE Geschichte war grausam, echt richtig massiv grausam,"}, {"id": 184, "start": 1361.96, "end": 1367.16, "text": "so, also was hab ich noch in meinem Home Assistant, wie gesagt, dann hab ich unten noch ein paar"}, {"id": 185, "start": 1367.16, "end": 1370.64, "text": "automatische Steckdosen, zum Beispiel zum Staubsauger aufladen, ich mein jetzt nicht"}, {"id": 186, "start": 1370.64, "end": 1376.88, "text": "mein Roborock Staubsauger, der ist da auch integriert, ich mein normalen Staubsauger,"}, {"id": 187, "start": 1376.88, "end": 1382.16, "text": "zum rumschieben mit Akku, da hab ich so gemacht, da hab ich unten in der Küche eine von diesen"}, {"id": 188, "start": 1382.16, "end": 1388.32, "text": "Steckdosen, die wir mal im Stream geflasht haben und ich hab so eine Steckdose mit, die"}, {"id": 189, "start": 1388.32, "end": 1397.76, "text": "misst, wie viel Watt das Gerät grad dahinter verbraucht und wenn das unter 5 fällt für"}, {"id": 190, "start": 1397.76, "end": 1401.88, "text": "mindestens 5 Minuten, dann schaltet es die Steckdose aus, weil dann weiß ich, der Staubsauger"}, {"id": 191, "start": 1401.88, "end": 1406.64, "text": "ist voll geladen, ist eigentlich ganz praktisch, da muss ich das nicht den ganzen Tag anlassen,"}, {"id": 192, "start": 1406.64, "end": 1412.88, "text": "so, dann hab ich LED Beleuchtung drinnen, hier bei mir vom Fenster, vom Weihnachtsbaum"}, {"id": 193, "start": 1412.88, "end": 1419.68, "text": "und allgemein Beleuchtung, äh, zum Beispiel vom Wohnzimmer, Arbeitszimmer, dann hab ich"}, {"id": 194, "start": 1419.68, "end": 1426.56, "text": "meine Heizungsübersicht drinnen, Wettervorhersage, wobei ich die kaum benutze, aktuelle Temperatur"}, {"id": 195, "start": 1426.56, "end": 1431.96, "text": "draußen, aktuelle Temperatur im Fischteich, das ist tatsächlich recht wichtig, die aktuelle"}, {"id": 196, "start": 1431.96, "end": 1443.52, "text": "Temperatur im Fischteich, ähm, ich muss gerade mal gucken, ob der ZZ etwas getan hat,"}, {"id": 197, "start": 1443.52, "end": 1452.84, "text": "ne, ja, ähm, die aktuelle Temperatur im Fischteich ist tatsächlich relativ wichtig, weil dann"}, {"id": 198, "start": 1452.84, "end": 1459.36, "text": "weiß man, ob man zudecken muss oder nicht, weil wenn das zufriert, gehts kaputt, so, Temperatur,"}, {"id": 199, "start": 1459.36, "end": 1464.44, "text": "Thermostat Wohnzimmer hab ich drinnen, ich kann mein Elgato Ringlight kontrollieren,"}, {"id": 200, "start": 1464.44, "end": 1473.56, "text": "was ich hier für Aufnahmen teilweise verwende, äh, Heizlüfter Badezimmer, Presence Detection,"}, {"id": 201, "start": 1473.56, "end": 1479.52, "text": "Klimaanlage an, bzw. hauptsächlich anschalten im Sommer, wenn ich auf dem Weg bin, Heimmittags,"}, {"id": 202, "start": 1479.52, "end": 1486.32, "text": "das brauchen wir grad nicht, weil Homeoffice, ähm, ich geh mal kurz Configuration gucken,"}, {"id": 203, "start": 1486.32, "end": 1495.92, "text": "oh, das war so zum größten Teil, was ich, ich hab noch mehr Sachen drinnen, aber die"}, {"id": 204, "start": 1495.92, "end": 1501.28, "text": "sind halt einfach nur da und werden grad nicht benutzt, ich hab hier auch die ganzen Steckdosen"}, {"id": 205, "start": 1501.28, "end": 1507.08, "text": "drinnen, auch die ganzen Steckdosenleisten, die wir hier im Stream geflasht haben, also"}, {"id": 206, "start": 1507.08, "end": 1514.04, "text": "sprich da, wo ich jetzt hier gerade mein, äh, da dran, der Switch auf dem Tisch ist"}, {"id": 207, "start": 1514.04, "end": 1520.96, "text": "dran, die externe Festplatte ist dran, der Raspberry Pi ist dran und da oben kommt dann"}, {"id": 208, "start": 1520.96, "end": 1526.32, "text": "halt bei der anderen Steckdose halt Server drinnen und, äh, LED-Leiste und so, die hab"}, {"id": 209, "start": 1526.32, "end": 1531.68, "text": "ich auch alle drin, die kann ich schalten, aber da passiert nichts automatisch, jo, genau,"}, {"id": 210, "start": 1531.68, "end": 1537.24, "text": "so siehts aus. Wolltest du nicht ein neues Gartenvideo machen mit Schnee? Leg da, es"}, {"id": 211, "start": 1537.24, "end": 1552.68, "text": "liegt kein Schnee. Wie updatest du Docker-Container automatisch hiermit? Damit. Du startest einfach"}, {"id": 212, "start": 1552.68, "end": 1558.76, "text": "einen Container, dem du dann sagst, welche Container automatisch updaten soll, eigentlich"}, {"id": 213, "start": 1558.76, "end": 1563.6, "text": "ziemlich, ziemlich einfach. Du brauchst einfach ein Kommando und sagst ihm hier, also wenn"}, {"id": 214, "start": 1563.6, "end": 1573.4, "text": "du es über Compose machst, noch einfacher, Container Ruby. Ja, damit. Gib noch ein paar"}, {"id": 215, "start": 1573.4, "end": 1582.72, "text": "andere, aber das so, mit das verbreitetste. Watchtower, Watchtower, sind das nicht die"}, {"id": 216, "start": 1582.72, "end": 1588.56, "text": "Zeugen Jehovas, die irgendwas von Watchtower erzählen? Weiß ich, wie ich da jetzt drauf"}, {"id": 217, "start": 1588.56, "end": 1604.64, "text": "komme, aber. So, ähm. Hast du mal I3 als WM in einem DE probiert? Nee. Hab ich nicht."}, {"id": 218, "start": 1604.64, "end": 1614.08, "text": "Schnee probiert. Also was ich machen würde ist, was aber glaub ich nicht geht, wenn"}, {"id": 219, "start": 1614.08, "end": 1619.88, "text": "man, wenn man I3 in Compass laufen lassen könnte. Das wäre Poggers. Dann könnte ich"}, {"id": 220, "start": 1619.88, "end": 1624.4, "text": "nämlich endlich Wobbly Windows wieder verwenden. Und wir wissen ja alle, Wobbly Windows ist"}, {"id": 221, "start": 1624.4, "end": 1635.08, "text": "der beste Effekt, den es gibt. Die 0815 Windows-Pleps kennen das gar nicht. Muss ich euch mal zeigen."}, {"id": 222, "start": 1635.08, "end": 1647.36, "text": "Wobbly Windows, das ist das beste Feature, was es gibt. Ja, seht ihr das? Ja, so muss"}, {"id": 223, "start": 1647.36, "end": 1658.52, "text": "das sein. Wobbly Windows. Auch wobble mal ein bisschen. Exzellent. Vor 10 Jahren hat"}, {"id": 224, "start": 1658.52, "end": 1663.0, "text": "man gedacht, das wäre der neueste Shit und jeder Desktop muss so aussehen. Damals hatte"}, {"id": 225, "start": 1663.0, "end": 1666.68, "text": "man auch seinen Desktop als Würfel gemacht und sowas. Ich glaube, das hat er hier auch."}, {"id": 226, "start": 1666.68, "end": 1680.28, "text": "Weiß nicht, ob er es zeigt. Oh, jawoll. Guck mal, wie das fließt. Woopgessem, also."}, {"id": 227, "start": 1680.28, "end": 1696.96, "text": "Ja, Wobbly Windows. Und auch ganz wichtig, Compels 3D Cube. Irgendwie sahen, was witzig"}, {"id": 228, "start": 1696.96, "end": 1704.36, "text": "ist, ohne Scheiß, Linux Desktop-Distros sahen vor 10 Jahren viel futuristischer und fancier"}, {"id": 229, "start": 1704.36, "end": 1724.88, "text": "als heute. Oh, hier. Flup, flup. Wobbly, ich hoffe an Wobbly Windows. Ach du Scheiße, was"}, {"id": 230, "start": 1724.88, "end": 1731.6, "text": "ist das für ein Launcher? Und ein Copyright ist, der guckt sich nicht ernsthaft Markus"}, {"id": 231, "start": 1731.6, "end": 1739.12, "text": "Lanz an jetzt hier. Der muss sein 3D Cube zeigen. Das ist der beste Effekt. Hier, hier."}, {"id": 232, "start": 1739.12, "end": 1747.52, "text": "Jetzt. Ah, okay, das war der Task-Switcher, der war auch nice. 3D Cube, zeig den 3D Cube,"}, {"id": 233, "start": 1747.52, "end": 1754.04, "text": "Alter. Beste. Rain-Calender, oder wie dieses Ding hieß, hat er auch am Start. Ich fand"}, {"id": 234, "start": 1754.04, "end": 1759.52, "text": "das echt nice, ja. Das hätte man durchaus weiterverfolgen können und nicht so komisch"}, {"id": 235, "start": 1759.52, "end": 1766.96, "text": "ein Einheitslook, wie sie es mit Gnome 3 gemacht haben. Und im Prinzip ist ja das meiste Zeug"}, {"id": 236, "start": 1766.96, "end": 1772.4, "text": "auf dem Desktop unter Linux auch nicht wirklich brauchbar. Das ist so halb fertiger Kram immer."}, {"id": 237, "start": 1772.4, "end": 1778.2, "text": "Da fand ich Compels, Compels war richtig geil. Komm, zeig 3D Cube, Alter. Ich will den 3D"}, {"id": 238, "start": 1778.2, "end": 1786.72, "text": "Cube sehen. Wo ist der 3D Cube? Hier. Genau, wenn du Desktops geswitcht hast. Ja, genau,"}, {"id": 239, "start": 1786.72, "end": 1791.32, "text": "du konntest Desktops switchen. Nicht einfach nur Desktops switchen. Erster Desktops,"}, {"id": 240, "start": 1791.32, "end": 1797.0, "text": "zweiter Desktops, dritter Desktops. Nein, nein, du hast deine Desktops geswitcht auf"}, {"id": 241, "start": 1797.0, "end": 1806.72, "text": "einem Würfel. Das war richtig futuristisch, Alter. 03D, genau. Das ist doch geil gewesen."}, {"id": 242, "start": 1806.72, "end": 1812.72, "text": "Gibt es das heute überhaupt noch? Compels war das beste. Ich weiß gar nicht, warum das"}, {"id": 243, "start": 1812.72, "end": 1833.28, "text": "irgendwie so eingeschlafen ist. Compels war das beste. Also wenn das mit I3 gehen würde,"}, {"id": 244, "start": 1833.28, "end": 1839.12, "text": "hätte ich sofort auch Compels wieder am Start. Aber leider funktioniert I3 und Compels nicht"}, {"id": 245, "start": 1839.12, "end": 1860.88, "text": "richtig zusammen. Das war was, oder? Das ist so richtig stylish gewesen. Ich kann mir"}, {"id": 246, "start": 1860.88, "end": 1868.56, "text": "das heute immer noch den ganzen Tag angucken. Ja, also wie gesagt vor 10 Jahren war Linux"}, {"id": 247, "start": 1868.56, "end": 1873.8, "text": "noch viel, viel geiler eigentlich als heute. Da konntest du wenigstens so abgedrehte Sachen"}, {"id": 248, "start": 1873.8, "end": 1879.04, "text": "wie Compels machen. Da gab es dann noch diesen Barrel Compels Fork, die noch abgedrehtere"}, {"id": 249, "start": 1879.04, "end": 1885.44, "text": "Sachen gemacht haben. Du konntest sogar die Fenster... Compels... Burning... Burn effect."}, {"id": 250, "start": 1885.44, "end": 1894.4, "text": "Du konntest sogar die Fenster abbrennen lassen und so. Das war auch richtig cool. Okay,"}, {"id": 251, "start": 1894.4, "end": 1900.32, "text": "es laggt. Okay, es laggt, aber ich glaube man kann sich vorstellen was passiert. Außer"}, {"id": 252, "start": 1900.32, "end": 1907.64, "text": "dass es laggt, es f**kt bei dem Typ. Hallo, wie wärs wenn du noch ein bisschen mehr zeigst?"}, {"id": 253, "start": 1907.64, "end": 1918.28, "text": "Ist ja schön und gut, dass ihr 30 Millionen Videos drüber macht, aber wie wärs einfach"}, {"id": 254, "start": 1918.28, "end": 1927.16, "text": "mal den Effekt zu zeigen? Was hat der denn damit zu tun? Ja genau, guckt euch das mal"}, {"id": 255, "start": 1927.16, "end": 1934.56, "text": "an. Fenster einfaden lassen mit Flammeffekt und löschen und so. Der Typ, das ist richtig"}, {"id": 256, "start": 1934.56, "end": 1946.72, "text": "Hackerman Desktop. Das sieht wenigstens aus wie in irgendeinem Hackerfilm, der Desktop."}, {"id": 257, "start": 1946.72, "end": 1959.88, "text": "Ich meine Usability gleich Null, aber sieht cool aus. Und es ruckelt. Ja, das war schon"}, {"id": 258, "start": 1959.88, "end": 1966.08, "text": "nice. Ja, hat sich leider nicht so wirklich durchgesetzt. Eigentlich ziemlicher Sack."}, {"id": 259, "start": 1966.08, "end": 1977.52, "text": "Kommt jetzt zwar echt poggers. So, was gucken wir uns jetzt mal an? Da fehlt C-Matrix."}, {"id": 260, "start": 1977.52, "end": 1983.8, "text": "Gucken wir uns jetzt an. Okay, das hatten wir schon. Aufwachsen. Ach, ich hab Aufwachen"}, {"id": 261, "start": 1983.8, "end": 1993.84, "text": "mit Asi-YouTuber gelesen. Aufwachsen mit Asi-YouTubern. Was gucken wir uns jetzt an? What? Nope."}, {"id": 262, "start": 1993.84, "end": 2000.28, "text": "Wie alle ihr sind, warte Häuschen. RIP Adobe Flash. Da mach ich heute ein Video zu. Hoffe"}, {"id": 263, "start": 2000.28, "end": 2007.28, "text": "ich, dass ich das gebacken krieg. Gaming Chairs. Irgendeiner, der sich aufregt über"}, {"id": 264, "start": 2007.28, "end": 2012.8, "text": "Leute, die sich aufregen. Ah, wir gucken uns mal eine Runde Lockpicken an. Excellent."}, {"id": 265, "start": 2012.8, "end": 2019.08, "text": "Reaction Channel. Ja, ich hab schon einen neuen Channel. Max Reaction ist schon am Start."}, {"id": 266, "start": 2019.08, "end": 2032.72, "text": "Mit Reaction kannst du heute Klicks machen. React FPS. Wo waren wir jetzt gerade? Machst"}, {"id": 267, "start": 2032.72, "end": 2037.92, "text": "du noch was mit ESP-Stuff? Ja, ich hab total viel mit ESP-Zeug hier am Start. Mein ganzes"}, {"id": 268, "start": 2037.92, "end": 2050.12, "text": "LED Zeug ist ja... Ich hab meine ollen ESP866 ausgebuddelt für die ganzen LED Sachen. Ist"}, {"id": 269, "start": 2050.12, "end": 2053.96, "text": "auch auf Archive Org ein paar Flash-Games mit dem Emulator zu zeigen. Du meinst diesen"}, {"id": 270, "start": 2053.96, "end": 2064.96, "text": "Rust Emulator? Muss ich mal ausprobieren. Okay, wenn es wenn, dass ich jetzt mal ein"}, {"id": 271, "start": 2064.96, "end": 2070.68, "text": "ESP. Okay, wenn es, wenn es zwei Minuten geht, weiß ich jetzt schon. Der pustet das Schloss"}, {"id": 272, "start": 2070.68, "end": 2087.8, "text": "einmal an und es ist offen. Warum ist ein ESP viel zu schade? Der Kram kostet 2,50 Euro"}, {"id": 273, "start": 2087.8, "end": 2110.44, "text": "oder so. Und ist kleiner. Ja gut, der Witz ist ja, niemand wird anfangen daran rumzuschnibbeln."}, {"id": 274, "start": 2110.44, "end": 2113.72, "text": "Wahrscheinlich kannst du da, wie gesagt, der wackelt, wir kennen ja die Videos von ihm,"}, {"id": 275, "start": 2113.72, "end": 2119.12, "text": "der wackelt wahrscheinlich jetzt einfach mal am Schlüssel und das Ding ist auf. Ja,"}, {"id": 276, "start": 2119.12, "end": 2141.88, "text": "aber dein Arduino Uno ist riesengroß. Sackt. Ah, yes."}, {"id": 277, "start": 2141.88, "end": 2150.0, "text": "Okay, wir sind in der Mitte, also starten wir dort. Ein kleines Klick aus 6. Postchamp, Postchamp."}, {"id": 278, "start": 2150.0, "end": 2163.8, "text": "Klick aus 5. Vielleicht etwas aus 4. Nichts aus 3. 2. 1 ist verbunden. Okay, ein schönes"}, {"id": 279, "start": 2163.8, "end": 2173.36, "text": "Klick da. Arbeit unseren Weg zurück, nichts aus 2. M, Office, einfach. Einfach. Okay Leute,"}, {"id": 280, "start": 2173.36, "end": 2178.46, "text": "wie ihr gesehen habt, hat es wirklich nicht lange gedauert. Das sagt, diese Typen der Locks,"}, {"id": 281, "start": 2178.46, "end": 2182.82, "text": "wie auch die Tools und Skills, die es benötigen, zu öffnen, sind ziemlich unkommenslos in"}, {"id": 282, "start": 2182.82, "end": 2188.56, "text": "nur ein paar Ländern, wie das UK. Und ich denke, sie werden noch mehr unkommenslos"}, {"id": 283, "start": 2188.56, "end": 2194.84, "text": "in der Zukunft. Es kann also nicht so schlecht eine Option sein. In jedem Fall, das ist alles,"}, {"id": 284, "start": 2194.84, "end": 2199.04, "text": "was ich für euch heute habe. Wenn ihr irgendwelche Fragen oder Kommentare darüber habt..."}, {"id": 285, "start": 2199.04, "end": 2203.72, "text": "Ich meine, der Typ kann es auch. Ich kann es nicht einschätzen, weil ich selbst absolut"}, {"id": 286, "start": 2203.72, "end": 2212.72, "text": "keine Lockpicking Skills habe. Aber es sieht, in der Regel kann man sich das davon ableiten,"}, {"id": 287, "start": 2212.72, "end": 2217.64, "text": "wenn was total einfach aussieht, was aber eigentlich nicht einfach ist, dann kann man"}, {"id": 288, "start": 2217.64, "end": 2223.8, "text": "daraus Schlussfolgen, der Typ kann es. Ansonsten, wenn was schwierig ist und jemand struggled"}, {"id": 289, "start": 2223.8, "end": 2229.24, "text": "übelst rumweist, okay, der kann es auch, aber da muss ich Mühe geben. Aber wenn Sachen,"}, {"id": 290, "start": 2229.24, "end": 2233.28, "text": "die schwierig sind, so aussehen, als sind sie easy as fuck, dann kann es der Typ meistens"}, {"id": 291, "start": 2233.28, "end": 2246.48, "text": "richtig gut. Und bei dem sieht es immer so aus, als ist easy as fuck alles. In Skyrim"}, {"id": 292, "start": 2246.48, "end": 2255.32, "text": "erschließt sich jetzt zwar der Zusammenhang zwischen Skyrim und Lockpicking nicht so wirklich,"}, {"id": 293, "start": 2255.32, "end": 2283.32, "text": "aber nice. Was ist jetzt los? Kurz Exquisite Trink zuführen. Okay, eins gucken wir doch"}, {"id": 294, "start": 2283.32, "end": 2292.72, "text": "an. Ich gucke den gerne, den Typ. Ach Lockpicking in Skyrim, verstehe. Exzellent. Das ist, ich"}, {"id": 295, "start": 2292.72, "end": 2302.16, "text": "habe es wieder nicht gecheckt, Leute. Du meinst Schlösserknacken in Skyrim? Ach so. Ja."}, {"id": 296, "start": 2302.16, "end": 2330.6, "text": "Das ist Max Lockpicking Skill in Skyrim. Ha, ha, lul, was ist das? What the fuck?"}, {"id": 297, "start": 2330.6, "end": 2349.0, "text": "Warum? Warum geht das einfach so auf, wenn man da was reinschiebt? Mal schon so kurz die"}, {"id": 298, "start": 2349.0, "end": 2369.84, "text": "Musik ausmachen. Nee, Obama. Ah, ja. Asda."}, {"id": 299, "start": 2379.0, "end": 2399.32, "text": "Aha, aha. Ist Jackal, man."}, {"id": 300, "start": 2399.32, "end": 2421.76, "text": "Der atmet immer so in seinem Mikrofon. Jetzt bin ich nicht, es ist das Video."}, {"id": 301, "start": 2421.76, "end": 2439.04, "text": "Anzeige es raus."}, {"id": 302, "start": 2439.04, "end": 2457.08, "text": "Und"}, {"id": 303, "start": 2457.08, "end": 2460.84, "text": "Fork, das auf der Seite von den Rädern bleibt."}, {"id": 304, "start": 2460.84, "end": 2464.44, "text": "Wenn ich den Fork in die Kode-Räder drücke, kann ich sie decodeieren,"}, {"id": 305, "start": 2464.44, "end": 2468.84, "text": "einfach durch die Räder zu drehen und für den leichten Spot in der Reise zu fühlen."}, {"id": 306, "start": 2468.84, "end": 2475.8, "text": "Das ist nicht besonders einfach, aber das kann schon gemacht werden."}, {"id": 307, "start": 2475.8, "end": 2480.28, "text": "Jetzt suche ich einen Räder, der verbinden ist."}, {"id": 308, "start": 2480.28, "end": 2504.84, "text": "Ich suche den leichten Spot, wenn ich das mache."}, {"id": 309, "start": 2504.84, "end": 2517.08, "text": "Wieso sie die nicht auffüllen, ja, das ist eine ordentliche Frage."}, {"id": 310, "start": 2517.08, "end": 2523.16, "text": "Zusammenschweißen, vielleicht zu teuer."}, {"id": 311, "start": 2523.16, "end": 2548.44, "text": "Okay, das nächste was die machen ist, die machen das neben zu, schicken ihm das Schloss zu und er braucht dann anstatt 2 Minuten, 2,15."}, {"id": 312, "start": 2548.44, "end": 2565.24, "text": "Kannst du mal eine Wette machen, ich bin süchtig lol."}, {"id": 313, "start": 2565.24, "end": 2584.44, "text": "Ja, können wir machen, ich wette, ich bekomme die nächsten 5 Minuten 5 Subs, wenn ich recht habe, musst du mir 15 geben."}, {"id": 314, "start": 2584.44, "end": 2601.72, "text": "Ach, nicht so eine Wette, okay, Channel Points, verstehe, verstehe."}, {"id": 315, "start": 2601.72, "end": 2619.0, "text": "Channel Points wetten? Ach, du meinst diese Sachen mit, wird die nächste Runde gewonnen und dann kann man Channel Points setzen und dann kann man dann bei großen Channel Points gewinnen, wenn man richtig liegt."}, {"id": 316, "start": 2619.0, "end": 2645.32, "text": "Ja, okay, aber die Sache ist die, auf was wollen wir Channel Points wetten? Predictions, was wollen wir predikten? Gefällt dir Max das nächste Video oder was willst du gerade predikten, Alter?"}, {"id": 317, "start": 2645.32, "end": 2669.72, "text": "Coldflip, ich weiß was wir machen, easy, random generator, 27, 26, Leute ist das wirklich random, wir haben 27 und 26, ich predikte aus 2 Resultaten, das kann nicht random sein, fake random."}, {"id": 318, "start": 2669.72, "end": 2697.88, "text": "Das nächste muss 25 sein, Alter was ist denn heute los, wieviel Likes hat das nächste Video, das könnte man tatsächlich gut predikten, aber dann müsste man sagen, wieviel Likes hat das nächste Video und danach sagen wir 1 Stunde."}, {"id": 319, "start": 2697.88, "end": 2708.36, "text": "Und dann müssten wir das Video freischalten live im Stream, was nicht geht, weil ich das nächste Video noch gar nicht aufgenommen habe."}, {"id": 320, "start": 2708.36, "end": 2728.92, "text": "Na gut, gucken wir mal weiter, ich überlege mir das mit Channel Points setzen, das ist glaube ich gar nicht so verkehrt, da kann man mit den Channel Points wenigstens was machen."}, {"id": 321, "start": 2728.92, "end": 2739.4, "text": "Ich habe übrigens unendlich Channel Points, kann ich dann da auch mitmachen, das wäre ein bisschen unfair oder?"}, {"id": 322, "start": 2758.92, "end": 2782.36, "text": "Kann ich mitmachen, heute Abend startet wieder Awesome Gamestop Quick, ja ich muss ehrlich sagen, seit die so über korrekt sind und Speedrunning gerade bei diesen Events eher Familienunterhaltung ist und so richtig mainstreamig, gucke ich das nicht mehr so gerne."}, {"id": 323, "start": 2782.36, "end": 2795.48, "text": "Dein Timeout, die Timeouts gibt es nur, wenn ein Mod da ist, das heißt ich vermute mal, aber wenn du unbedingt getimeoutet werden willst, kann man das machen, natürlich."}, {"id": 324, "start": 2795.48, "end": 2808.44, "text": "Oh, jetzt werden auch noch deine Nachrichten gelöscht, ja gut, das wusste ich gar nicht, dass die Nachrichten auch gelöscht werden."}, {"id": 325, "start": 2808.44, "end": 2822.68, "text": "Gut, jetzt müsst ihr 5 Minuten timeoutet, exellent, ich wusste nicht, dass es auch deine Nachrichten gelöscht, aber ich habe hier alles gesehen."}, {"id": 326, "start": 2822.68, "end": 2849.4, "text": "Wie untimeoutet man eigentlich jemand, ah hier unban, unban, angel9, guck mal mal, ja jetzt kannste wieder was schreiben, aber 10 Minuten stimmt, 600 Sekunden, ja."}, {"id": 327, "start": 2849.4, "end": 2862.36, "text": "Quickmuffs, so was schauen wir uns als nächstes an, aufwachsen mit azizyoutube, ok das Video ist von 2016, mal gucken, wie viel wahres da noch dran ist."}, {"id": 328, "start": 2862.36, "end": 2872.2, "text": "Ich predikte jetzt einfach mal, es ist eigentlich nur noch schlimmer geworden und es sind andere Typen mittlerweile, 2016 weiß ich gar nicht mehr, was war 2016?"}, {"id": 329, "start": 2872.2, "end": 2882.92, "text": "War 2016 der Bombenprank von ApoRed? Das könnte doch so 2016 in dem Dreh gewesen sein, oder? Wo er sich da so richtig in die Scheiße geritten hat."}, {"id": 330, "start": 2882.92, "end": 2909.72, "text": "Onkos, so laut, aha, das stimmt."}, {"id": 331, "start": 2909.72, "end": 2935.64, "text": "Das stimmt, YouTube gibt es seit wann? 2007? 2005, ok, 2006, sagen wir mal ab 2006 gibt es die, ja das bedeutet, die Leute, die im Jahr geboren sind, wo YouTube quasi aufgemacht ist, sind heute 14."}, {"id": 332, "start": 2935.64, "end": 2944.28, "text": "Was heißt, das ist exakt, aber so was von exakt, die Zielgruppe von manchen Channels."}, {"id": 333, "start": 2944.28, "end": 2966.44, "text": "Who Cares Simon Desue, Alter, ok, es war 2016, den Typ gibt es immer noch, aber ich glaube, wie viel Views hat Simon Desue noch? Wie hieß das Half-Cast-Germany, gell?"}, {"id": 334, "start": 2966.44, "end": 2979.56, "text": "Alter, der Typ, ey, das kann ich mir nicht geben, das ist, das ist, das Playboy Penthouse eines Milliardärs in Dubai."}, {"id": 335, "start": 2979.56, "end": 3002.92, "text": "Alter, wie soll ich das angucken? Ok, übelst, übelst langweilig. Ja, also, ich glaube mittlerweile sind andere Sachen angesagt, aber eins muss man Simon Desue mal wirklich zu gut halten, der Typ hat sich verdammt lang in diesem Genre gehalten."}, {"id": 336, "start": 3002.92, "end": 3024.84, "text": "Der macht seit, frag mich nicht, 2009 oder so YouTube-Videos, also ewig, länger als ich, natürlich auch erfolgreicher als ich, ja, und der war schon immer in diesem komischen Kindergarten-Genre zugange, ja, und das hat er durchgehalten, 10 Jahre, das muss er erst mal schaffen."}, {"id": 337, "start": 3024.84, "end": 3053.16, "text": "Und halbwegs relevant bleiben dabei, also, das schafft auch nicht jeder. Moin, Shinobo. Ach, ja, stimmt, war das der Typ, der den Leuten irgendwie, genau, da war doch was, 1000 Euro und Xbox, ich kann mich erinnern, der hat den Leuten noch irgendwie Geld gegeben, dass sie irgendwelche Sachen reacten oder irgendwas, ich kann mich da überhaupt nicht mehr richtig dran erinnern."}, {"id": 338, "start": 3053.16, "end": 3071.64, "text": "Ehrlich gesagt, ich verfolge ja YouTube Deutschland und ASI YouTube Deutschland, er ist recht schon nie richtig, ja. Das einzige woran ich mich wirklich noch erinnern kann ist der Bomben-Prank von ApoRed, das war ja an Blödheit echt kaum zu überbieten und da hätte er sich echt denken können, dass das nach hinten losgeht."}, {"id": 339, "start": 3071.64, "end": 3087.4, "text": "Er wollte das verlosen und hat es nicht verstickt, stimmt, ja, stimmt, stimmt, sowas war da."}, {"id": 340, "start": 3087.4, "end": 3115.24, "text": "Okay, jetzt erzähl mal. Das war 2016 wohlgemerkt. Ja, die Startseite sieht heute nicht viel anders aus, wenn du dir die Trends anguckst, warte mal, wir müssen mich hier mal kurz, wobei, ich kriege das glaube ich gar nicht richtig empfohlen, weil ich es auf Englisch gestellt habe."}, {"id": 341, "start": 3115.24, "end": 3138.68, "text": "Ah, okay, ne doch. Ja, ich mein, das ist auch nicht besser, was da heute am Start ist. Schock, Schock, so ein Schock, alter, sie fliegt ohne Deniz. Der arme Deniz, alter, was soll er denn machen?"}, {"id": 342, "start": 3138.68, "end": 3161.64, "text": "So, ich habe mein Traumauto gekauft, ah, das wollte ich auch schon immer mal wissen. YouTube Rewind, who cares, unsere Haustour. Ah, okay, ich mein, das kann ja noch ganz interessant sein, wenn man den Leuten folgt. Ich werde auch nach einer Haustour gefragt, ich will keine Haustour machen, alter."}, {"id": 343, "start": 3161.64, "end": 3179.08, "text": "Dann gibt es hier Apache. Ich dachte immer, das ist ein Webserver, aber anscheinend ist das auch irgendein krasser Hip-Hop-Gangsta-Man oder so. Wobei, ne, der Hintergrund sieht nicht so Hip-Hop-mäßig aus. Oder doch, keine Ahnung, können wir das jetzt nicht anhören?"}, {"id": 344, "start": 3179.08, "end": 3208.52, "text": "Harry Styles. Ist Harry Styles, also mal ganz davon abgesehen, dass der Name sich Übels Gatschi Bass anhört, ist das nicht dieser ehemalige Boy-Group-Typ? Ist das nicht dieser ehemalige Boy-Group-Typ, wo vor ein paar Jahren alle gedacht haben, sie müssen sich jetzt irgendwie, keine Ahnung, von der Brücke stürzen, als der die Boy-Group verlassen hat? War das One Direction? Kann das echt? Ja, könnte sein. Wo sie alle geheult haben."}, {"id": 345, "start": 3208.52, "end": 3219.0, "text": "So ein bisschen früher wie Robbie und Take That, falls das noch einer kennt. Das ist aber, what the fuck ist? Warum ist da ein Arsch in der Kamera? Oder ist das überhaupt kein Hintern?"}, {"id": 346, "start": 3219.0, "end": 3227.72, "text": "Okay, Justin Bieber-Dings. Super Bowl Highlights, okay. Krakona? Anyone?"}, {"id": 347, "start": 3227.72, "end": 3238.84, "text": "Neun Gemüse, die du im Januar sehen und fortziehen... Warum nicht?"}, {"id": 348, "start": 3238.84, "end": 3262.36, "text": "Nico ist am Start. Die Neujahrsansprache. Die Sache ist halt die, jetzt mal ganz im Ernst, mich interessiert absolut nichts von dem, was in dem Trend ist."}, {"id": 349, "start": 3262.36, "end": 3272.28, "text": "Nix. Juck mich nicht, juck mich nicht, juck mich nicht, juck mich nicht, juck mich nicht, auch nicht, auch nicht, auch nicht, auch nicht, auch nicht.."}, {"id": 350, "start": 3272.28, "end": 3275.8, "text": "...nicht, nicht, okay, wenn ich vegan bin, dann wird's vielleicht angucken."}, {"id": 351, "start": 3275.8, "end": 3281.96, "text": "Juckt mich nicht, juckt mich auch nicht, juckt mich nicht, auch das nix, Superbowl erst recht nicht, auch nicht, auch nicht"}, {"id": 352, "start": 3282.24, "end": 3288.92, "text": "Also das sind eure shops, was juckt, mein shop, was, was wollen die meinen shop, die kennen meinen shop doch gar nicht"}, {"id": 353, "start": 3290.0, "end": 3293.12, "text": "Juckt mich nicht, auch nicht, auch nicht, auch nicht, auch nicht"}, {"id": 354, "start": 3294.72, "end": 3296.72, "text": "Was macht, ist das"}, {"id": 355, "start": 3297.48, "end": 3299.48, "text": "Ist das der"}, {"id": 356, "start": 3299.48, "end": 3305.48, "text": "Ach nee, nee, ich dachte das ist der gerät, ich dachte das ist der, das ist aber gar nicht der gerät, das ist irgendein anderer typ"}, {"id": 357, "start": 3308.48, "end": 3310.48, "text": "Der gerät hieß, hieß anders"}, {"id": 358, "start": 3311.12, "end": 3313.96, "text": "Juckt mich alles nicht, alles, alter, ist ja nix dabei"}, {"id": 359, "start": 3315.08, "end": 3317.56, "text": "Q&A, Jahresrückblick, Sellys Welt"}, {"id": 360, "start": 3318.44, "end": 3321.72, "text": "Ich weiß nicht mal, dass, ich wusste bis eben gar nicht mal, dass den channel überhaupt gibt"}, {"id": 361, "start": 3322.12, "end": 3326.44, "text": "Aber ich bin da auch, bin da auch, tatsächlich nicht die Zielgruppe, interessiert mich nicht"}, {"id": 362, "start": 3326.44, "end": 3329.16, "text": "Freak Kicker Swipeout Challenge"}, {"id": 363, "start": 3329.88, "end": 3336.24, "text": "Okay, ich habe keine Ahnung was es ist, deswegen würde ich vielleicht mal aufmachen und reingucken und feststellen, dass ich nicht gucken werde"}, {"id": 364, "start": 3337.24, "end": 3340.08, "text": "Juckt mich nicht, juckt mich auch nicht"}, {"id": 365, "start": 3342.64, "end": 3344.64, "text": "Sind das die Lochis"}, {"id": 366, "start": 3346.8, "end": 3349.48, "text": "Leute sind, sind das die Lochis, nee oder, das sind nicht die Lochis"}, {"id": 367, "start": 3349.48, "end": 3355.08, "text": "Weil, man erkennt die ja teilweise gar nicht, weil die sind ja mittlerweile auch schon älter"}, {"id": 368, "start": 3356.12, "end": 3358.12, "text": "Sind das die Lochis doch, oder"}, {"id": 369, "start": 3361.28, "end": 3364.08, "text": "Immerhin, immerhin war irgendjemand, den ich da noch erkenne, Alter"}, {"id": 370, "start": 3366.64, "end": 3370.76, "text": "Juckt mich nicht, zerstört das, juckt mich auch nicht, Schnee, okay"}, {"id": 371, "start": 3371.48, "end": 3376.16, "text": "World Dart Championship, das ist eher was für Marcel Skorpion, Prostitution"}, {"id": 372, "start": 3376.16, "end": 3382.2, "text": "Das, der hat auch eine Dart-Channel jetzt, Dart interessiert mich auch nicht, guten Rutsch ins neue Jahr"}, {"id": 373, "start": 3383.64, "end": 3387.08, "text": "Interessiert mich nicht, interessiert mich nicht, interessiert mich auch nicht"}, {"id": 374, "start": 3387.68, "end": 3392.88, "text": "Interessiert mich auch nicht, es ist nichts dabei, Alter, nix was in den Trends ist, was mich interessiert"}, {"id": 375, "start": 3394.44, "end": 3396.64, "text": "Recently Trending, ja das ist das was wir schon geguckt haben"}, {"id": 376, "start": 3396.64, "end": 3404.76, "text": "Und das sind jetzt glaube ich eher so Sachen, die ein bisschen angepasst sind, na wobei, die Geissens, gibt es das überhaupt noch"}, {"id": 377, "start": 3409.96, "end": 3411.96, "text": "große Scheiße"}, {"id": 378, "start": 3411.96, "end": 3430.84, "text": "Okay, das habe ich gesehen, zumindest den Anfang, oh Mann, was ein Haufen Crap, Alter"}, {"id": 379, "start": 3430.84, "end": 3451.12, "text": "Also weiter, gucken wir mal, gucken wir mal was 2016 war, Glitterbomb 3.0, nee das habe ich noch nicht gesehen, lohnt sich das zu gucken, das ist der Typ, der seine Paket-Lieferanten zu-Sprayt mit Zeug"}, {"id": 380, "start": 3451.12, "end": 3468.92, "text": "Hey, mein Stellenangebote-Ding war wohl relativ gut präsent im Algorithmus, also man sieht, es hat sich die letzten vier Jahre da nix getan in der Richtung"}, {"id": 381, "start": 3481.92, "end": 3500.92, "text": "Ja, ich muss ehrlich sagen, vielleicht bin ich da auch, vielleicht bin ich da auch irgendwie so ein bisschen, ich bin ja eh nicht ganz normal, das haben wir ja schon oft genug festgestellt, aber so wirklich Vorbilder, wo ich gesagt habe, ich will das so machen wie die, wüsste ich jetzt gar nicht"}, {"id": 382, "start": 3500.92, "end": 3528.72, "text": "Es ist ja auch so, auch, sagen wir mal, viele sagen ja, okay, ich finde die Bands, die hören irgendwie eine Musikrichtung, die haben ein paar Lieblingsbands, und gucken sich dann auch an, was haben die für Mitglieder, was machen die so, und orientieren sich dann da dran, also mich hat ehrlich gesagt noch nie richtig interessiert, was die Leute machen aus den Bands, die ich gerne höre, das war überlegen, hatte ich irgendwelche Vorbilder?"}, {"id": 383, "start": 3530.92, "end": 3534.72, "text": "Das müsste einem ja eigentlich ziemlich schnell einfallen, oder?"}, {"id": 384, "start": 3536.72, "end": 3544.72, "text": "Der Papa, nee, nein, ich weiß nicht, ob du dabei warst, wo ich die paar Stories von meinem Vater schon erzählt habe, nee, nicht wirklich"}, {"id": 385, "start": 3544.72, "end": 3557.52, "text": "Ich habe, es gab sicherlich Sachen, die ich ganz cool fand, was Leute gemacht haben, aber ich weiß nicht, kann ich mir echt nicht dran erinnern"}, {"id": 386, "start": 3557.52, "end": 3574.32, "text": "Da gelangte, für all diese Medien gab es eine Redaktion, ein Rat diverser Experten, die dazu da waren, einzuschätzen, ob die übermittelte Botschaft auch recht zufertigen und moralisch zu vertreten ist"}, {"id": 387, "start": 3574.32, "end": 3579.32, "text": "Irgendwelche Experten machen wahrscheinlich auch aktuell das Programm in ARD und ZDF, und was da rauskommt, sieht man ja"}, {"id": 388, "start": 3579.32, "end": 3584.32, "text": "Da gibt es dann das Traumschiff 5.0 jetzt mit Florian Silbereisen und sowas"}, {"id": 389, "start": 3584.32, "end": 3591.32, "text": "Ja, Broadcast Yourself ist ja auch gar nicht mehr, Broadcast Yourself ist vorbei"}, {"id": 390, "start": 3597.32, "end": 3599.32, "text": "Alter, was sind das denn für Lappen, Alter"}, {"id": 391, "start": 3599.32, "end": 3613.32, "text": "Da sieht ja einer lauchiger aus als der andere, wer ist das, okay, den gibt es noch, der hat heute bestimmt 5 Millionen Abos oder so, von dem habe ich schon mal was gehört"}, {"id": 392, "start": 3618.32, "end": 3619.32, "text": "Was macht der da hinten?"}, {"id": 393, "start": 3619.32, "end": 3631.32, "text": "Alter, wie schafft man das eigentlich, so krass unsympathisch in einem Video auszuschauen, und ich meine, das ist nicht die Optik von den Leuten, einfach nur wie sie rum eiern"}, {"id": 394, "start": 3631.32, "end": 3641.32, "text": "Ja, das stimmt"}, {"id": 395, "start": 3641.32, "end": 3650.32, "text": "Ja, das stimmt"}, {"id": 396, "start": 3657.32, "end": 3663.32, "text": "Ich finde es aber ganz ehrlich, es gab, es gab zu allen Zeiten Trash überall"}, {"id": 397, "start": 3663.32, "end": 3675.32, "text": "Ich meine, auf YouTube ist es halt besonders präsent und es bekommen vor allem alle Altersgruppen mit, das war früher nicht so, aber bei uns gab es auch so viel Billig-Trash-Kacke"}, {"id": 398, "start": 3679.32, "end": 3688.32, "text": "Ich meine, was bei uns damals total angesagt war, wenn man irgendwelche doofen Sprüche aus TV total sich gemerkt hat und dann random auf dem Schulhof gebracht hat"}, {"id": 399, "start": 3688.32, "end": 3701.32, "text": "So, und auch wenn ich TV total geil fand, zu den Zeiten, wohlgemerkt zu den Zeiten, wo es das noch nicht täglich gab, das wurde ja auch mit der Zeit dann echt, naja, nicht, sondern nicht toll"}, {"id": 400, "start": 3701.32, "end": 3714.32, "text": "Da war auch viel Trash dabei"}, {"id": 401, "start": 3731.32, "end": 3741.32, "text": "Ich finde, ich finde, man muss es nicht schlechter reden, also man muss es nicht so sehr übertreiben"}, {"id": 402, "start": 3741.32, "end": 3751.32, "text": "Ja, Crap haben sich alle schon angeguckt und ich glaube, bleibende Schäden trägt da keiner davon, wenn er YouTube guckt"}, {"id": 403, "start": 3751.32, "end": 3761.32, "text": "Das läuft eher darauf raus, dass die Leute nach ein paar Jahren einfach der Sache so übertrüssig sind, dass sie sich den Scheiß nicht mehr geben können"}, {"id": 404, "start": 3761.32, "end": 3765.32, "text": "Es gab schon viele Channels, die hatten den richtigen Boom und sind jetzt weg vom Fenster"}, {"id": 405, "start": 3765.32, "end": 3777.32, "text": "Wie gesagt, deswegen kann man wirklich nur mal echt sagen, so Hut ab von Simon Desue, der es geschafft hat, mit Kindergartenprogramm über 10 Jahre da gut relevant zu bleiben, musste er erst mal schaffen"}, {"id": 406, "start": 3777.32, "end": 3787.32, "text": "So schlimm sind die doch gar nicht"}, {"id": 407, "start": 3787.32, "end": 3792.32, "text": "Ich hab vergessen, wer es ist, war das Apecrime? War das, nee, nee, oder?"}, {"id": 408, "start": 3792.32, "end": 3809.32, "text": "Alter, der ist überhaupt nicht mehr angesagt mittlerweile, okay, das ist 2016"}, {"id": 409, "start": 3809.32, "end": 3814.32, "text": "Und ich muss euch ehrlich sagen, so schlimm ist der Typ doch gar nicht gewesen"}, {"id": 410, "start": 3814.32, "end": 3826.32, "text": "Das war halt der erste, der so extrem den Sellout gemacht hat und dieses, oh Leute, ich liebe alle meine Abos und ihr seid die besten und ich wäre nichts ohne euch"}, {"id": 411, "start": 3826.32, "end": 3838.32, "text": "Das war halt einer der ersten, der damit angefangen hat, aber okay, irgendwie, irgendwie, das ist einer der Leute, irgendwie hab ich dem sogar noch halbwegs abgekauft"}, {"id": 412, "start": 3838.32, "end": 3857.32, "text": "Oh Gott, KS Freak, okay, es gibt ein paar Leute, die kann ich echt nicht ab"}, {"id": 413, "start": 3857.32, "end": 3863.32, "text": "Ja und?"}, {"id": 414, "start": 3863.32, "end": 3874.32, "text": "Ja, da ist schon was dran, aber mal ganz ehrlich, es ist nur einfach so, wenn du nix sagst, machen es viele Leute nicht"}, {"id": 415, "start": 3874.32, "end": 3879.32, "text": "Und es ist halt gerade auf YouTube, YouTube ist eines, das darf man nicht vergessen"}, {"id": 416, "start": 3879.32, "end": 3885.32, "text": "YouTube ist eines der kompetitivsten Plattformen, die es überhaupt nur gibt"}, {"id": 417, "start": 3885.32, "end": 3901.32, "text": "Und nachdem so Sachen wie Likes, Comments und vor allem Watchtime halt ganz entscheidend beeinflussen, wie sich deine Sachen in Zukunft entwickeln, finde ich nicht verwerflich, so diese Optimierung irgendwie zu machen"}, {"id": 418, "start": 3901.32, "end": 3910.32, "text": "Ja, natürlich ist das ein bisschen affig, aber das finde ich irgendwie noch alles legitim"}, {"id": 419, "start": 3910.32, "end": 3925.32, "text": "Die nächste Dimension des Ganzen ist dann Product Placement, das mal und mal nicht gekennzeichnet in ungefähr immer derselben Art und Weise präsentiert wird"}, {"id": 420, "start": 3925.32, "end": 3944.32, "text": "Kapi Klaus fragt, du meintest mal, du verdienst mit YouTube so viel wie mit deinem Shop, stimmt das noch? Nee, nee, nee, nee, überhaupt nicht, also wenn ich das jetzt hochrechnen würde, was ich im Dezember verdient habe aus Twitch, aus YouTube und aus Amazon"}, {"id": 421, "start": 3944.32, "end": 3960.32, "text": "Ich habe ja übelst einen Amazon Sellout gemacht, ja, dann kommt es ungefähr so hin, wie wenn ich sagen wir mal zwölf Monats, nee, nee, nee"}, {"id": 422, "start": 3960.32, "end": 3976.32, "text": "Eher acht Monats Gehälter, nur wenn ich Dezember hochrechnen würde, ja, ich habe einfach zu wenig gemacht dieses Jahr oder generell die letzten sechs Jahre habe ich einfach zu wenig gemacht, nee, nee, das stimmt schon lange nicht mehr"}, {"id": 423, "start": 3976.32, "end": 3992.32, "text": "Ich glaube das niedrigste was ich mal mit YouTube verdient habe war sechzehn Euro im Monat oder zwölf Euro oder so, also reines YouTube AdSense, aber es ist ja auch so, dass die meisten Leute ihr hauptsächliches Geld nicht durch YouTube AdSense machen"}, {"id": 424, "start": 3992.32, "end": 4009.32, "text": "Das meiste ist Reflinks und irgendwelche Sponsorships, Placements und sonstige Sachen, nee, aber selbst wenn ich die Twitch Subs zusammenrechne, Sellout mit Amazon, Reflinks und YouTube, da komme ich wenn es hoch kommt auf acht Monats Gehälter oder so"}, {"id": 425, "start": 4009.32, "end": 4025.32, "text": "Was ich, also wie gesagt wenn ich diesen einen Monat hochrechne und wie gesagt ich habe ja diesen Monat auch nicht viel gemacht, also ja, nein, nein, nein, nein, nein, nein, nein, nein, nein, so war das nicht gemeint, so war das nicht gemeint"}, {"id": 426, "start": 4025.32, "end": 4039.32, "text": "Wenn ich das was ich im Dezember verdient hätte, quasi hochrechne, so über das Jahr, also das was ich im Dezember verdient hätte mal zwölf, dann würde ich ungefähr auf acht Monats Gelder von meinem normalen kommen"}, {"id": 427, "start": 4039.32, "end": 4049.32, "text": "Nein, nein, nein, das hätte, also ohne Scheiß, hätte ich im Dezember, hätte ich im Dezember für acht Monate Geld verdient, dann würde ich nicht mehr arbeiten gehen"}, {"id": 428, "start": 4049.32, "end": 4065.32, "text": "Wenn ich mit diesem Mini Aufwand, wo waren wir denn jetzt überhaupt, Alter, ETF, wenn ich mit diesem Mini Aufwand, bin ich jetzt dumm"}, {"id": 429, "start": 4065.32, "end": 4071.32, "text": "Ah hier, wenn ich mit diesem Mini Aufwand so viel verdient hätte wie in acht Monaten, dann würde ich echt nicht mehr arbeiten gehen"}, {"id": 430, "start": 4071.32, "end": 4075.32, "text": "Heute schon Schnee geschummt, es gibt keinen Schnee, bei uns ist nichts"}, {"id": 431, "start": 4075.32, "end": 4084.32, "text": "Es soll ja angeblich schneien, guck mal, aber macht es nicht, also es hätte schneien sollen, aber hat es nicht"}, {"id": 432, "start": 4084.32, "end": 4090.32, "text": "Guck hier, hier ist Schnee, gucken, gucken ob das heute noch schneit"}, {"id": 433, "start": 4090.32, "end": 4108.32, "text": "Nö, ha, ha, Postchamp? Nö, gibt kein Schnee, Standort liegt, ja schon wieder"}, {"id": 434, "start": 4108.32, "end": 4120.32, "text": "Nö, gibt kein Schnee, wie gesagt, wenn Schnee gibt, ich mach, ohne Scheiß, ich mach ein Schneestellensvideo, ok guck mal weiter, Product Placement"}, {"id": 435, "start": 4120.32, "end": 4134.32, "text": "Alter, Vera, wenn ich die, es gibt Leute, die triggern mich echt, wenn ich sie sehe, also Vera ist eine, eine Person davon"}, {"id": 436, "start": 4134.32, "end": 4149.32, "text": "Ja das, ok, das war 2016 echt ein Problem, mittlerweile sind sie da ein bisschen vorsichtiger geworden, weil das auch so, auch Fokus von, ähm, also rechtlichen, rechtlichen Fokus jetzt gekriegt hat"}, {"id": 437, "start": 4149.32, "end": 4163.32, "text": "Früher, früher war das so, da konnte Dagi Bee so mal sagen, so ha, ich war heute einkaufen, ich hab zufällig diese schöne, günstige Uhr gefunden bei XY, guckt sie euch mal an, das geht heute nicht mehr so ohne weiteres"}, {"id": 438, "start": 4163.32, "end": 4174.32, "text": "Ui, hier ist diese mega coole Sonnencreme, die ich mir gekauft habe, wenn ihr die haben wollt, ich hab sie, weil ich ja so scheiße freundlich bin, mal in die Beschreibung gepackt"}, {"id": 439, "start": 4174.32, "end": 4186.32, "text": "So oder so ähnlich läuft das meistens ab, und das haben auch die Pubertierenden gemerkt, wenn auch nicht bewusst, was macht man denn, wenn man ein großes Vorbild gefunden hat, richtig, man ahmt es nach"}, {"id": 440, "start": 4186.32, "end": 4194.32, "text": "Und das ist auf YouTube, wisst ihr, wisst ihr was das, was das erste ist, was die Leute machen, wenn sie den YouTube-Channel gerne gucken"}, {"id": 441, "start": 4194.32, "end": 4198.32, "text": "Ich wette mit euch, dass das, dass das so ist"}, {"id": 442, "start": 4198.32, "end": 4206.32, "text": "Die gehen in eine Suchmaschine ihrer Wahl und geben den Namen des Channels ein mit der Kombination Porn"}, {"id": 443, "start": 4206.32, "end": 4218.32, "text": "Ich kann es mir so richtig vorstellen, das dürfte heißt, die Leute gucken, jeder 100 pro, guckt, in dem Alter direkt danach, 100 pro"}, {"id": 444, "start": 4223.32, "end": 4230.32, "text": "Ach du Scheiße, ok, ok, ok, ich geb zu, das Timing war jetzt schlecht"}, {"id": 445, "start": 4230.32, "end": 4236.32, "text": "Penobel ist unterwegs"}, {"id": 446, "start": 4244.32, "end": 4248.32, "text": "Kauft euch ein paar Kabelbinder, kann ich da nur dazu sagen"}, {"id": 447, "start": 4250.32, "end": 4252.32, "text": "Dieses Eistee"}, {"id": 448, "start": 4252.32, "end": 4255.32, "text": "Und was ich auch noch sagen wollte"}, {"id": 449, "start": 4259.32, "end": 4263.32, "text": "Bildschirm mit Kamera abfilmen, oh Minecraft, was sonst"}, {"id": 450, "start": 4269.32, "end": 4273.32, "text": "Like a Phoenix, apropos, was ist eigentlich aus Belle Delphie geworden"}, {"id": 451, "start": 4273.32, "end": 4276.32, "text": "Tja, da musst du bei ihr auf Onlyfans gucken"}, {"id": 452, "start": 4276.32, "end": 4280.32, "text": "Ich habe gehört, es gibt neuen Content"}, {"id": 453, "start": 4280.32, "end": 4284.32, "text": "Holt euch Spotify, das ist kostenlos, das gibt es bei Facebook"}, {"id": 454, "start": 4284.32, "end": 4287.32, "text": "Und Minecraft, das ist halt eine gekraftete Version"}, {"id": 455, "start": 4287.32, "end": 4292.32, "text": "Ok, es interessiert mich jetzt einfach mal, gibt es diesen Typ noch aus dem Video?"}, {"id": 456, "start": 4292.32, "end": 4296.32, "text": "Marcel Hille, der ist heute bestimmt krasser Minecraft-YouTuber"}, {"id": 457, "start": 4299.32, "end": 4301.32, "text": "Oh nee"}, {"id": 458, "start": 4303.32, "end": 4305.32, "text": "Ok, ich hab nichts gesagt"}, {"id": 459, "start": 4306.32, "end": 4308.32, "text": "Ach du Scheiße, warum"}, {"id": 460, "start": 4308.32, "end": 4310.32, "text": "Eine gekraftete Version"}, {"id": 461, "start": 4310.32, "end": 4314.32, "text": "Und damals haben sie Lisa Cat oder so noch gebannt, weil sie zu jung war für YouTube"}, {"id": 462, "start": 4314.32, "end": 4316.32, "text": "Die sind ja heute 8 oder so"}, {"id": 463, "start": 4316.32, "end": 4320.32, "text": "Nur wenn ihr mir jetzt auf meiner PayPal Link"}, {"id": 464, "start": 4320.32, "end": 4322.32, "text": "Ach du Scheiße"}, {"id": 465, "start": 4322.32, "end": 4329.32, "text": "Ich pack die rein und dann könnt ihr mir halt, also ich weiß nicht, ihr könnt mir halt Geld senden"}, {"id": 466, "start": 4329.32, "end": 4330.32, "text": "Warum"}, {"id": 467, "start": 4330.32, "end": 4333.32, "text": "Diese Teenager und Kinder sind die nächste Stufe"}, {"id": 468, "start": 4333.32, "end": 4334.32, "text": "What the fuck"}, {"id": 469, "start": 4334.32, "end": 4339.32, "text": "Die Fans von Dagi Bee, KSFleek und Leon Machère, sie sind auch noch Fans von YouTube selbst"}, {"id": 470, "start": 4339.32, "end": 4341.32, "text": "Oder eher von dem YouTube, welches sie glauben"}, {"id": 471, "start": 4341.32, "end": 4343.32, "text": "Danny Burnage gibt es doch auch nicht mehr, doch, doch, den gibt es noch"}, {"id": 472, "start": 4343.32, "end": 4347.32, "text": "Der macht jetzt aber nur funny Let's Plays auf seinen anderen Channels"}, {"id": 473, "start": 4347.32, "end": 4349.32, "text": "Um zu kennen"}, {"id": 474, "start": 4349.32, "end": 4353.32, "text": "Als man Fan von Batman oder Pokemon war, hat man seiner Fan liebefreien Lauf gelassen"}, {"id": 475, "start": 4353.32, "end": 4356.32, "text": "Indem man gewisse Dinge einfach nachgespielt hat"}, {"id": 476, "start": 4356.32, "end": 4361.32, "text": "Mittlerweile ist die technische Entwicklung so absurd, dass man YouTube Star auf YouTube selbst spielen kann"}, {"id": 477, "start": 4361.32, "end": 4364.32, "text": "Was man dann sieht, ist oftmals psychologisch sehr interessant"}, {"id": 478, "start": 4364.32, "end": 4367.32, "text": "Alter, was machen die ganzen Kinder auf YouTube"}, {"id": 479, "start": 4367.32, "end": 4370.32, "text": "Was ist denn da los"}, {"id": 480, "start": 4370.32, "end": 4395.32, "text": "Was"}, {"id": 481, "start": 4395.32, "end": 4422.32, "text": "What the fuck"}, {"id": 482, "start": 4422.32, "end": 4431.32, "text": "Ich kann dazu aber null sagen, weil ich habe noch auf keinem Gerät bisher TikTok verwendet"}, {"id": 483, "start": 4431.32, "end": 4437.32, "text": "Ich kenne nur immer irgendwelche Cringe Ausschnitte, die man ab und zu mal in YouTube Compilations sieht und sowas"}, {"id": 484, "start": 4437.32, "end": 4439.32, "text": "Nein, wir haben keinen Schnee"}, {"id": 485, "start": 4439.32, "end": 4445.32, "text": "Was ist denn da jetzt eigentlich raus geworden"}, {"id": 486, "start": 4445.32, "end": 4449.32, "text": "Sollte TikTok in den USA nicht irgendwie eingestellt werden oder so"}, {"id": 487, "start": 4449.32, "end": 4451.32, "text": "Was ist da jetzt eigentlich rausgekommen"}, {"id": 488, "start": 4451.32, "end": 4458.32, "text": "Oder wollte Microsoft nicht TikTok kaufen oder irgendwas in der Richtung"}, {"id": 489, "start": 4458.32, "end": 4465.32, "text": "Die Richts hat es verboten"}, {"id": 490, "start": 4465.32, "end": 4466.32, "text": "Achso ja okay easy"}, {"id": 491, "start": 4466.32, "end": 4468.32, "text": "Dann hat sich das ja erledigt"}, {"id": 492, "start": 4468.32, "end": 4473.32, "text": "Musik anspeisen"}, {"id": 493, "start": 4473.32, "end": 4489.32, "text": "Musik"}, {"id": 494, "start": 4489.32, "end": 4492.32, "text": "Damit hast du ja quasi schon widersprochen"}, {"id": 495, "start": 4492.32, "end": 4495.32, "text": "Also wenn du sagst, es ist egal welchen Content man produziert"}, {"id": 496, "start": 4495.32, "end": 4497.32, "text": "Solange man Sachen macht, die im Trend sind"}, {"id": 497, "start": 4497.32, "end": 4499.32, "text": "Dann ist es eben nicht egal welchen Content man produziert"}, {"id": 498, "start": 4499.32, "end": 4502.32, "text": "Sondern man muss Content produzieren, die mega im Trend sind"}, {"id": 499, "start": 4502.32, "end": 4508.32, "text": "Zum Beispiel hättest du vor vier Jahren Fidget Spinner Tricks machen müssen"}, {"id": 500, "start": 4508.32, "end": 4509.32, "text": "Oder sowas"}, {"id": 501, "start": 4509.32, "end": 4520.32, "text": "Ich weiß nicht, wenn man das immer nicht lang das her ist"}, {"id": 502, "start": 4520.32, "end": 4522.32, "text": "Du bekommst immer TikTok Links geschickt"}, {"id": 503, "start": 4522.32, "end": 4525.32, "text": "Ja das liegt ja wahrscheinlich auch daran, weil du Freunde hast, die TikTok angucken"}, {"id": 504, "start": 4525.32, "end": 4528.32, "text": "Ich habe erstens keine Freunde und zweitens keine, die TikTok angucken"}, {"id": 505, "start": 4528.32, "end": 4531.32, "text": "Also insofern hat sich das erledigt easy"}, {"id": 506, "start": 4531.32, "end": 4536.32, "text": "Easy"}, {"id": 507, "start": 4536.32, "end": 4539.32, "text": "Heute musst du eine Hydraulikpresse besitzen"}, {"id": 508, "start": 4539.32, "end": 4545.32, "text": "Stimmt, das gucke ich tatsächlich auch manchmal gerne"}, {"id": 509, "start": 4545.32, "end": 4547.32, "text": "Das gucke ich auch manchmal diese Videos"}, {"id": 510, "start": 4547.32, "end": 4551.32, "text": "Die sind eigentlich richtig hängen geblieben"}, {"id": 511, "start": 4551.32, "end": 4555.32, "text": "Der macht einfach Videos, wo er irgendwelche Dinge zerdrückt mit seiner Hydraulikpresse"}, {"id": 512, "start": 4555.32, "end": 4560.32, "text": "Das ist alles"}, {"id": 513, "start": 4560.32, "end": 4565.32, "text": "Das kommt einfach gut an"}, {"id": 514, "start": 4565.32, "end": 4570.32, "text": "So Crap"}, {"id": 515, "start": 4570.32, "end": 4576.32, "text": "Das gibt es doch, ja das ist voll angesagt"}, {"id": 516, "start": 4576.32, "end": 4579.32, "text": "Übrigens einfach mal 65 Tonnen"}, {"id": 517, "start": 4579.32, "end": 4583.32, "text": "Das ist Kilo, ja das sind Kilo, keine Kakao einhalten"}, {"id": 518, "start": 4583.32, "end": 4587.32, "text": "Das ist Satisfying, das ist auch so ein Trend der letzten Jahre"}, {"id": 519, "start": 4587.32, "end": 4591.32, "text": "Satisfying"}, {"id": 520, "start": 4591.32, "end": 4595.32, "text": "Genau, da siehst du dann Leute, die schleifen irgendwas ab"}, {"id": 521, "start": 4595.32, "end": 4598.32, "text": "Die drehmeln irgendwas, die machen irgendwelche Dinge"}, {"id": 522, "start": 4598.32, "end": 4602.32, "text": "Die machen irgendwelche Omelettes oder so"}, {"id": 523, "start": 4602.32, "end": 4605.32, "text": "Diese Videos sind auch voll im Trend"}, {"id": 524, "start": 4605.32, "end": 4608.32, "text": "ASMR geht auch gut ab"}, {"id": 525, "start": 4608.32, "end": 4615.32, "text": "Ja und wisst ihr gerade was man bei ASMR Content gut sieht"}, {"id": 526, "start": 4615.32, "end": 4623.32, "text": "Sobald ein gewisses Video oder Themengebiet, ein gewisses Genre eine Beliebtheit erreicht hat"}, {"id": 527, "start": 4623.32, "end": 4628.32, "text": "Kommen die Boopcam Streamer"}, {"id": 528, "start": 4628.32, "end": 4633.32, "text": "Ihr müsst das mal vergleichen, wie der Content vor 5 Jahren ausgesehen hat, wie der Content jetzt aussieht"}, {"id": 529, "start": 4633.32, "end": 4639.32, "text": "90% der neuen ASMR Channels sind irgendwelche Camgirls"}, {"id": 530, "start": 4639.32, "end": 4642.32, "text": "Die versuchen damit auch noch ein bisschen Geld zu machen"}, {"id": 531, "start": 4642.32, "end": 4645.32, "text": "Das ist echter Wahnsinn"}, {"id": 532, "start": 4645.32, "end": 4653.32, "text": "Und nebenbei noch Onlyfans bewerben"}, {"id": 533, "start": 4653.32, "end": 4655.32, "text": "ASMR ist so cringe"}, {"id": 534, "start": 4655.32, "end": 4659.32, "text": "Ich muss euch ehrlich sagen, ein paar Channels gucke ich mir auch ganz gern an"}, {"id": 535, "start": 4659.32, "end": 4673.32, "text": "Aber das meiste kann man sich echt nicht geben"}, {"id": 536, "start": 4673.32, "end": 4675.32, "text": "So, also"}, {"id": 537, "start": 4675.32, "end": 4679.32, "text": "Das ist in Skandinavien, natürlich benutzt der richtige Einhalten, jawoll"}, {"id": 538, "start": 4679.32, "end": 4681.32, "text": "Zum Glück"}, {"id": 539, "start": 4681.32, "end": 4684.32, "text": "Gehen wir aus den USA, dann werden das jetzt Ounces oder sowas"}, {"id": 540, "start": 4684.32, "end": 4688.32, "text": "Ich weiß nicht, in was haben die Amis ihre Hydraulik pressen"}, {"id": 541, "start": 4688.32, "end": 4691.32, "text": "Wehrfoot per Inch oder was auch immer"}, {"id": 542, "start": 4691.32, "end": 4700.32, "text": "Ich weiß nicht"}, {"id": 543, "start": 4700.32, "end": 4702.32, "text": "Pound per Squarefeet"}, {"id": 544, "start": 4702.32, "end": 4705.32, "text": "Ach du große Scheiße"}, {"id": 545, "start": 4705.32, "end": 4710.32, "text": "Wie rechnet man sowas überhaupt um"}, {"id": 546, "start": 4710.32, "end": 4713.32, "text": "Ja ASMR Eating Videos mag ich auch nicht"}, {"id": 547, "start": 4713.32, "end": 4716.32, "text": "Und was ich auch absolut nicht ab kann"}, {"id": 548, "start": 4716.32, "end": 4719.32, "text": "Wo wir gerade wieder beim Thema sind"}, {"id": 549, "start": 4719.32, "end": 4724.32, "text": "Seitdem die ganzen Camgirls, die zusätzlich noch ASMR Content machen, am Start sind"}, {"id": 550, "start": 4724.32, "end": 4728.32, "text": "Gibt es dann irgendwie Ear-Licking-Videos"}, {"id": 551, "start": 4728.32, "end": 4730.32, "text": "Das ist jetzt kein Witz, ich gebe es jetzt nicht in YouTube ein"}, {"id": 552, "start": 4730.32, "end": 4733.32, "text": "Ich will euch nicht so sehr belasten chat"}, {"id": 553, "start": 4733.32, "end": 4742.32, "text": "Aber wer mal wirklich ganz hart cringen will, gibt das ein in die Suche"}, {"id": 554, "start": 4742.32, "end": 4746.32, "text": "Das ist, ich weiß nicht warum das so beliebt ist"}, {"id": 555, "start": 4746.32, "end": 4749.32, "text": "Ich kann es nicht nachvollziehen"}, {"id": 556, "start": 4749.32, "end": 4754.32, "text": "Die lecken die ihr Mikro ab, ne die lecken bei ihrem Mikro"}, {"id": 557, "start": 4754.32, "end": 4758.32, "text": "Ne ne mach ich nicht"}, {"id": 558, "start": 4758.32, "end": 4761.32, "text": "So was gucken wir uns jetzt als nächstes an, zeig mal her"}, {"id": 559, "start": 4761.32, "end": 4767.32, "text": "14 Leute in Xbox Live Extended haben, exellent"}, {"id": 560, "start": 4767.32, "end": 4770.32, "text": "Ne wir gucken uns jetzt ne Runde Battlefield Top Plays an"}, {"id": 561, "start": 4770.32, "end": 4774.32, "text": "Ich brauch jetzt, ich brauch ne Runde Battlefield Top Plays, easy"}, {"id": 562, "start": 4774.32, "end": 4776.32, "text": "Jawoll, gib mir, gib mir"}, {"id": 563, "start": 4776.32, "end": 4779.32, "text": "10 Minuten Battlefield Top Plays, das muss jetzt sein"}, {"id": 564, "start": 4785.32, "end": 4787.32, "text": "Barbershop war eines der besten ASMR"}, {"id": 565, "start": 4787.32, "end": 4790.32, "text": "Der Barbershop der ist wirklich, der ist ja uralt"}, {"id": 566, "start": 4790.32, "end": 4794.32, "text": "Aber der ist wirklich audio technisch wirklich gut aufgenommen"}, {"id": 567, "start": 4794.32, "end": 4804.32, "text": "Das ist so einer der ersten 3D Sounds, Surround Sounds Dinger"}, {"id": 568, "start": 4804.32, "end": 4807.32, "text": "Oder nicht Surround Sounds, Binaural Videos auf YouTube"}, {"id": 569, "start": 4807.32, "end": 4809.32, "text": "Der ist wirklich gut"}, {"id": 570, "start": 4809.32, "end": 4825.32, "text": "Das ist auch kein ASMR Video, das ist eher so ne Tech Demo von ihrem Audio Setup"}, {"id": 571, "start": 4825.32, "end": 4830.32, "text": "Wo der Typ links und rechts rumläuft, das muss man sich mal in Ruhe an, das ist wirklich gut gemacht"}, {"id": 572, "start": 4830.32, "end": 4839.32, "text": "Sollen wir das Battlefield Video gucken?"}, {"id": 573, "start": 4839.32, "end": 4841.32, "text": "Da"}, {"id": 574, "start": 4841.32, "end": 4845.32, "text": "Exellent"}, {"id": 575, "start": 4845.32, "end": 4851.32, "text": "Den mach ich absichtlich nicht so laut, weil der Typ hat immer commentary, immer exakt das gleiche, ich laber einfach eh drüber"}, {"id": 576, "start": 4851.32, "end": 4855.32, "text": "Was wird denn wohl Battlefield 6?"}, {"id": 577, "start": 4855.32, "end": 4858.32, "text": "Die machen Modern Warfare Setting, bin ich mir ziemlich sicher"}, {"id": 578, "start": 4858.32, "end": 4861.32, "text": "Und ich glaube sie werden es verkacken"}, {"id": 579, "start": 4861.32, "end": 4864.32, "text": "Auch wenn ich mir wünsche, dass ein geiles Battlefield rauskommt"}, {"id": 580, "start": 4864.32, "end": 4875.32, "text": "Aber ich kann mir nicht vorstellen, dass sie es nach den letzten Battlefields und den letzten verkackten Sachen jetzt auf einmal da was Gutes rauskommt"}, {"id": 581, "start": 4875.32, "end": 4878.32, "text": "Ich hab die Hoffnung aufgegeben"}, {"id": 582, "start": 4878.32, "end": 4892.32, "text": "Ich hoffe ich werde eines besseren belehrt"}, {"id": 583, "start": 4892.32, "end": 4897.32, "text": "Ja allein der Knife Countdown fand ich auch übelst doof in Battlefield"}, {"id": 584, "start": 4897.32, "end": 4903.32, "text": "4"}, {"id": 585, "start": 4903.32, "end": 4909.32, "text": "Der Heli Typ, oh, oh, ich glaub gleich machts bumm"}, {"id": 586, "start": 4909.32, "end": 4917.32, "text": "Und was man da auch gesehen hat ist, dass der Chat ist weg, aber die Angels sind noch da"}, {"id": 587, "start": 4917.32, "end": 4924.32, "text": "Jetzt Battlefield Logik"}, {"id": 588, "start": 4924.32, "end": 4934.32, "text": "Cod hat doch massig Konkurrenz, das ist doch kaum, Warzone hat Call of Duty gerettet, das war auf den Weg in die Bedeutungslosigkeit"}, {"id": 589, "start": 4934.32, "end": 4947.32, "text": "Nach den letzten Teilen, Warzone ist das einzige was es gerettet hat"}, {"id": 590, "start": 4947.32, "end": 4959.32, "text": "Das Castle Border, ah ne, ne das ist die Satellitenschüssel Map, die inspiriert war von dem echten Teleskop was jetzt eingestürzt ist"}, {"id": 591, "start": 4959.32, "end": 4968.32, "text": "What the fuck"}, {"id": 592, "start": 4968.32, "end": 4975.32, "text": "Was ist das"}, {"id": 593, "start": 4975.32, "end": 4990.32, "text": "So ein Glück hätt ich auch mal gerne"}, {"id": 594, "start": 4990.32, "end": 4998.32, "text": "Ok ey, diese Glück musst du wirklich erstmal haben, ich schieß nie vorbei und dann fliegt jemand anderes rein"}, {"id": 595, "start": 4998.32, "end": 5002.32, "text": "Das sollte eigentlich nicht erlaubt sein"}, {"id": 596, "start": 5002.32, "end": 5009.32, "text": "Ich will, dass bei jeder Rakete, die ich misse, dass einer reinfliegt"}, {"id": 597, "start": 5009.32, "end": 5015.32, "text": "Jetzt wird, jetzt wird"}, {"id": 598, "start": 5015.32, "end": 5019.32, "text": "Er wurde umgemörsert"}, {"id": 599, "start": 5019.32, "end": 5021.32, "text": "Let's go"}, {"id": 600, "start": 5021.32, "end": 5024.32, "text": "Ah, jonna erzitter"}, {"id": 601, "start": 5024.32, "end": 5027.32, "text": "Battlefield Logik"}, {"id": 602, "start": 5027.32, "end": 5039.32, "text": "Das ist so Dinger, ich find kacke, dass das in den neuen Battlefields nicht mehr geht"}, {"id": 603, "start": 5039.32, "end": 5044.32, "text": "So hängen geblieben, die Battlefield Physics waren, aber irgendwie war das nice"}, {"id": 604, "start": 5044.32, "end": 5060.32, "text": "What"}, {"id": 605, "start": 5060.32, "end": 5076.32, "text": "Hä"}, {"id": 606, "start": 5076.32, "end": 5084.32, "text": "Jetzt wirds gegenseitig geneift"}, {"id": 607, "start": 5084.32, "end": 5095.32, "text": "Ja die Battlefield Physics waren schon nice, das geht ja in den neuen nicht mehr"}, {"id": 608, "start": 5095.32, "end": 5102.32, "text": "Hä"}, {"id": 609, "start": 5102.32, "end": 5106.32, "text": "Ich hab keine Ahnung was da passiert ist, ich hab keinen Plastenschimmer"}, {"id": 610, "start": 5106.32, "end": 5113.32, "text": "Ich würd eher drauf tippen, der Typ der ihn geneift hat, hat grad disconnected oder crash"}, {"id": 611, "start": 5113.32, "end": 5124.32, "text": "Oh, Bad Company 2 Musik, beste"}, {"id": 612, "start": 5124.32, "end": 5131.32, "text": "Hahaha, Teamkills, Moment"}, {"id": 613, "start": 5131.32, "end": 5139.32, "text": "Ah ne, ich dachte es wäre der Captain Peng aus dem Chat gewesen, der Name sieht so ähnlich aus, ne, ist er aber nicht"}, {"id": 614, "start": 5139.32, "end": 5146.32, "text": "Ne, ne"}, {"id": 615, "start": 5146.32, "end": 5154.32, "text": "Aber ich muss sagen es sah auf den ersten Blick schon ähnlich aus"}, {"id": 616, "start": 5154.32, "end": 5163.32, "text": "Ja bitte den Clip noch dunkler machen, dass man noch mehr sieht"}, {"id": 617, "start": 5163.32, "end": 5190.32, "text": "Wenn man jetzt noch was sehen würde, wär halt Poggers"}, {"id": 618, "start": 5190.32, "end": 5195.32, "text": "Ja, Flo690 wahrscheinlich armor oder so"}, {"id": 619, "start": 5195.32, "end": 5202.32, "text": "Oh, what"}, {"id": 620, "start": 5202.32, "end": 5208.32, "text": "Oh, Poggers am Start"}, {"id": 621, "start": 5208.32, "end": 5215.32, "text": "Wisst ihr was ich an den Snipern in Battlefield geil finde, so an diesen, die Animationen sind immer so smooth"}, {"id": 622, "start": 5215.32, "end": 5225.32, "text": "Ah man sieht es nicht mehr, die haben es richtig gut gemacht"}, {"id": 623, "start": 5225.32, "end": 5235.32, "text": "Auch wenn ich kaum Sniper spiel, aber die Animationen sind immer echt nice"}, {"id": 624, "start": 5235.32, "end": 5246.32, "text": "Bam, oh, das war cool, er ist Pilot und dann Gunner rausgebasht"}, {"id": 625, "start": 5246.32, "end": 5251.32, "text": "360 NoScope"}, {"id": 626, "start": 5251.32, "end": 5257.32, "text": "Das war cool"}, {"id": 627, "start": 5257.32, "end": 5268.32, "text": "Das ist, das ist, also ich sag mal, der hat das sicherlich predicted ein bisschen, aber da war schon zu 90% Glück, dass der sich nicht bewegt hat"}, {"id": 628, "start": 5268.32, "end": 5283.32, "text": "Oder Setup ist auch durchaus möglich"}, {"id": 629, "start": 5283.32, "end": 5289.32, "text": "Sieht aus wie Call of Duty 4, die erste Mission"}, {"id": 630, "start": 5289.32, "end": 5294.32, "text": "Wie sind sie schneiben lassen?"}, {"id": 631, "start": 5294.32, "end": 5305.32, "text": "Warum, aber das ist Spawn Immunity gewesen"}, {"id": 632, "start": 5305.32, "end": 5315.32, "text": "Der hat, der hat, der hat seinen Name auch ein bisschen verkackt, warum hat er sich nicht Ariane Kek oder Ariane Kek genannt oder so"}, {"id": 633, "start": 5315.32, "end": 5321.32, "text": "Der hätte es richtig Twitch-konform Namen haben können"}, {"id": 634, "start": 5321.32, "end": 5327.32, "text": "Ariane Kek wäre doch was gewesen, oder Ariane Kek"}, {"id": 635, "start": 5327.32, "end": 5348.32, "text": "Aber nein, er macht Ariane Kek"}, {"id": 636, "start": 5348.32, "end": 5354.32, "text": "Die hören sich auch an, dann schlafen sie gleich ein beim Spiel, oder?"}, {"id": 637, "start": 5354.32, "end": 5359.32, "text": "We use Discord"}, {"id": 638, "start": 5359.32, "end": 5365.32, "text": "No, no, no, no Discord"}, {"id": 639, "start": 5365.32, "end": 5369.32, "text": "Die an aufwachen Stream gucken müssen"}, {"id": 640, "start": 5369.32, "end": 5374.32, "text": "Okay, das ist jetzt Lucky Hit, Lucky Hit gibt das jetzt"}, {"id": 641, "start": 5374.32, "end": 5378.32, "text": "Der schießt einfach random"}, {"id": 642, "start": 5378.32, "end": 5381.32, "text": "Der schießt einfach random in die Richtung"}, {"id": 643, "start": 5381.32, "end": 5390.32, "text": "Alter, jetzt übertreibt das aber Hyper Gatschi"}, {"id": 644, "start": 5390.32, "end": 5394.32, "text": "Ja, das war einfach random in den Himmel geschossen"}, {"id": 645, "start": 5394.32, "end": 5403.32, "text": "Also meiner Meinung nach ist das kein Top Play, das ist Top Luck"}, {"id": 646, "start": 5403.32, "end": 5413.32, "text": "Ich meine, es ist cool zu sehen, aber es ist einfach Top Luck, kein Top Play"}, {"id": 647, "start": 5413.32, "end": 5415.32, "text": "Das war auch mehr Glück als verstanden"}, {"id": 648, "start": 5415.32, "end": 5425.32, "text": "Und jetzt, und jetzt noch in den Chat rein, oh Mist, das wäre cool gewesen, wäre jetzt noch in den Chat zurückgekommen"}, {"id": 649, "start": 5425.32, "end": 5437.32, "text": "Äh, what? Fliegt der jetzt noch rein?"}, {"id": 650, "start": 5437.32, "end": 5440.32, "text": "Ja, okay"}, {"id": 651, "start": 5440.32, "end": 5467.32, "text": "Also ich finde die Killstreaks Clips, die rasant starten besser, wo einfach Leute irgendwie zwanzig Leute wegbashing"}, {"id": 652, "start": 5467.32, "end": 5472.32, "text": "Ich bin mir ziemlich sicher, die haben diese Map nur noch mal Remaked"}, {"id": 653, "start": 5472.32, "end": 5477.32, "text": "Ich meine, das ist ja glaube ich ursprünglich eine Battlefield 2 Map, die gab es in Battlefield 3 und in Battlefield 4"}, {"id": 654, "start": 5477.32, "end": 5483.32, "text": "Und ich bin mir ziemlich sicher, dass sie die nur noch mal Remaked haben, weil sie wollten eine Map mit Sandsturm machen"}, {"id": 655, "start": 5483.32, "end": 5493.32, "text": "Und sie hatten keine Map für Sandsturm und da haben sie gesagt, lass uns einfach Guilford Format nehmen und machen Sandsturm drauf"}, {"id": 656, "start": 5493.32, "end": 5519.32, "text": "Das einzige Grund warum die noch drin ist, weil die zeigen wollen, wie cool ihren Sandsturm ist"}, {"id": 657, "start": 5519.32, "end": 5532.32, "text": "Das Konsole, das hat so viel Motionblur, ja, Playstation"}, {"id": 658, "start": 5532.32, "end": 5537.32, "text": "Watch what happens next, Battlefield Entwickler hassen diesen Trick"}, {"id": 659, "start": 5537.32, "end": 5541.32, "text": "Lifehacks, die dein Leben verändert werden"}, {"id": 660, "start": 5541.32, "end": 5547.32, "text": "Hä? Was? Das habe ich nicht gecheckt"}, {"id": 661, "start": 5547.32, "end": 5554.32, "text": "Wie genau ist der andere jetzt gestorben?"}, {"id": 662, "start": 5554.32, "end": 5557.32, "text": "Was ist Motionblur Bewegungsunschärfe?"}, {"id": 663, "start": 5557.32, "end": 5571.32, "text": "Der hat die Turbinen angemacht, ah"}, {"id": 664, "start": 5571.32, "end": 5581.32, "text": "Na ja, den hätte ich vielleicht auch noch gehitted"}, {"id": 665, "start": 5581.32, "end": 5586.32, "text": "Moment, warum überlebt der das?"}, {"id": 666, "start": 5586.32, "end": 5602.32, "text": "Oh, wann gibt es Venice Unleashed Surfing Maps?"}, {"id": 667, "start": 5602.32, "end": 5606.32, "text": "MarioLE, Twitch Prime, Dankeschön für den Zap"}, {"id": 668, "start": 5606.32, "end": 5612.32, "text": "Battlefield Surfing Maps, das wäre es doch noch"}, {"id": 669, "start": 5612.32, "end": 5616.32, "text": "Und jetzt in den Jet reinspringen"}, {"id": 670, "start": 5616.32, "end": 5619.32, "text": "Nice, so Clips mag ich, die sind cool"}, {"id": 671, "start": 5619.32, "end": 5627.32, "text": "Die sind richtig nice"}, {"id": 672, "start": 5627.32, "end": 5633.32, "text": "Eine Runde TV Missiles"}, {"id": 673, "start": 5633.32, "end": 5639.32, "text": "Man muss ja schon sagen, manche Leute können extrem gut Jet und Heli fliegen in dem Game"}, {"id": 674, "start": 5639.32, "end": 5646.32, "text": "Ich kann es ja gar nicht, ich habe es auch nie großartig probiert, weil ich am liebsten Infanterie spiele"}, {"id": 675, "start": 5646.32, "end": 5648.32, "text": "Aber das war gar keine TV Missile"}, {"id": 676, "start": 5648.32, "end": 5658.32, "text": "Stimmt, es kann keine TV Missile gewesen sein, weil keiner die TV Missile gesteuert hat"}, {"id": 677, "start": 5658.32, "end": 5680.32, "text": "Und jetzt in den Jet, jawoll, nice"}, {"id": 678, "start": 5680.32, "end": 5698.32, "text": "Zack"}, {"id": 679, "start": 5698.32, "end": 5703.32, "text": "Wow, das war aber ganz schön weit weg"}, {"id": 680, "start": 5703.32, "end": 5709.32, "text": "Ich meine, guckt euch mal, das Game ist jetzt auch irgendwie 6 Jahre alt oder so, sieht immer noch extrem geil aus"}, {"id": 681, "start": 5709.32, "end": 5726.32, "text": "Das könnte auch ein Ace Combat sein oder sowas"}, {"id": 682, "start": 5726.32, "end": 5730.32, "text": "Wird Max DPS zum Overwatch 2 wieder belebt?"}, {"id": 683, "start": 5730.32, "end": 5733.32, "text": "Ich weiß nicht, ob ich Overwatch 2 spielen werde, eventuell"}, {"id": 684, "start": 5733.32, "end": 5736.32, "text": "Aber dann werde ich es mir erst mal in Ruhe angucken"}, {"id": 685, "start": 5736.32, "end": 5763.32, "text": "Aber ich glaube ehrlich gesagt nicht, dass Overwatch 2 so krass einschlägt, wie man in Overwatch 1"}, {"id": 686, "start": 5763.32, "end": 5772.32, "text": "Ist das Fake? Ist das Fake, Leute? Ist das Fake? Ist das Setup?"}, {"id": 687, "start": 5772.32, "end": 5783.32, "text": "Ich meine, der Typ, der steht am Arsch der Welt und der Heli steht am Arsch der Welt und hovert einfach da vor sich hin"}, {"id": 688, "start": 5783.32, "end": 5786.32, "text": "Und ansonsten passiert auch grad nichts so richtig"}, {"id": 689, "start": 5786.32, "end": 5796.32, "text": "Das ist Setup, was macht der Heli denn da?"}, {"id": 690, "start": 5796.32, "end": 5799.32, "text": "Und das Server ist ja auch leer"}, {"id": 691, "start": 5799.32, "end": 5806.32, "text": "Ja oder weniger, scripted, ja"}, {"id": 692, "start": 5806.32, "end": 5813.32, "text": "Guck mal, warum fliegt der Jet so? So fliegt doch keiner im Jet"}, {"id": 693, "start": 5813.32, "end": 5822.32, "text": "Warum sollte so jemand fliegen im Jet?"}, {"id": 694, "start": 5822.32, "end": 5840.32, "text": "Professional Battlefield Streamer, guckt euch das mal an, mit High Quality Facecam und allem"}, {"id": 695, "start": 5840.32, "end": 5846.32, "text": "NA-Aimed, so wie ich, das hätte ich 1 zu 1 NA-Aimed von mir sein können"}, {"id": 696, "start": 5870.32, "end": 5882.32, "text": "Ja, catch uns mal in der nächsten Episode, exellent"}, {"id": 697, "start": 5882.32, "end": 5891.32, "text": "Ich weiß nicht, ich bin schon mal noch übelst grün"}, {"id": 698, "start": 5891.32, "end": 5898.32, "text": "Normalerweise wache ich nach, wie lange sind wir jetzt jetzt? 1,5 Stunden wache ich meistens langsam auf, ne?"}, {"id": 699, "start": 5898.32, "end": 5908.32, "text": "Making Lego Car Climb, was? Ach hier, nicht Climb, Climb"}, {"id": 700, "start": 5908.32, "end": 5913.32, "text": "Making Lego Car Climb Obstacles"}, {"id": 701, "start": 5913.32, "end": 5926.32, "text": "Hast du Bitcoin? Ich hätte gerne Bitcoin, gibst du mir welche ab?"}, {"id": 702, "start": 5926.32, "end": 5945.32, "text": "Ah, yes, es sieht zwar absolut nicht mehr aus wie ein Lego Auto, aber es kommt das Buch hoch"}, {"id": 703, "start": 5945.32, "end": 5956.32, "text": "Okay, da brauchst du ziemlich gut gummierte Reifen und hohe Übersetzung, dass du da hochkommst"}, {"id": 704, "start": 5956.32, "end": 5970.32, "text": "Oh no"}, {"id": 705, "start": 5970.32, "end": 5991.32, "text": "Was kommt als nächstes? AI trainiert Lego bauen"}, {"id": 706, "start": 5991.32, "end": 6007.32, "text": "Oh"}, {"id": 707, "start": 6007.32, "end": 6020.32, "text": "Wie soll das funktionieren? Oh jetzt kommt Big Brain Konstruktion"}, {"id": 708, "start": 6020.32, "end": 6036.32, "text": "Ich habe keine Ahnung, was er da macht, aber es sieht gut aus"}, {"id": 709, "start": 6036.32, "end": 6058.32, "text": "Was? Das ist ja mal Big Brain, Alter"}, {"id": 710, "start": 6058.32, "end": 6067.32, "text": "Oh, oh, wie das geht? Oh, MonkaS"}, {"id": 711, "start": 6067.32, "end": 6093.32, "text": "Oh"}, {"id": 712, "start": 6093.32, "end": 6119.32, "text": "Insane, nice, oh jetzt will er es wissen"}, {"id": 713, "start": 6119.32, "end": 6130.32, "text": "Oh"}, {"id": 714, "start": 6130.32, "end": 6137.32, "text": "Das hätte ich nicht gedacht, dass er so einfach über das einzelne hochstehende Buch kommt"}, {"id": 715, "start": 6137.32, "end": 6154.32, "text": "Spagat und jetzt"}, {"id": 716, "start": 6154.32, "end": 6172.32, "text": "Massive Big Brain Lego Konstruktion hier"}, {"id": 717, "start": 6172.32, "end": 6195.32, "text": "Oh"}, {"id": 718, "start": 6195.32, "end": 6211.32, "text": "Oh"}, {"id": 719, "start": 6211.32, "end": 6226.32, "text": "Nice"}, {"id": 720, "start": 6226.32, "end": 6241.32, "text": "Oh"}, {"id": 721, "start": 6241.32, "end": 6256.32, "text": "Oh"}, {"id": 722, "start": 6256.32, "end": 6271.32, "text": "Oh"}, {"id": 723, "start": 6271.32, "end": 6286.32, "text": "Oh"}, {"id": 724, "start": 6286.32, "end": 6301.32, "text": "Oh"}, {"id": 725, "start": 6301.32, "end": 6316.32, "text": "Oh"}, {"id": 726, "start": 6316.32, "end": 6331.32, "text": "Oh"}, {"id": 727, "start": 6331.32, "end": 6346.32, "text": "Oh"}, {"id": 728, "start": 6346.32, "end": 6361.32, "text": "Oh"}, {"id": 729, "start": 6361.32, "end": 6376.32, "text": "Oh"}, {"id": 730, "start": 6376.32, "end": 6391.32, "text": "Oh"}, {"id": 731, "start": 6391.32, "end": 6406.32, "text": "Oh"}, {"id": 732, "start": 6406.32, "end": 6421.32, "text": "Oh"}, {"id": 733, "start": 6421.32, "end": 6436.32, "text": "Oh"}, {"id": 734, "start": 6436.32, "end": 6451.32, "text": "Oh"}, {"id": 735, "start": 6451.32, "end": 6466.32, "text": "Oh"}, {"id": 736, "start": 6466.32, "end": 6481.32, "text": "Oh"}, {"id": 737, "start": 6481.32, "end": 6496.32, "text": "Oh"}, {"id": 738, "start": 6496.32, "end": 6511.32, "text": "Oh"}, {"id": 739, "start": 6511.32, "end": 6526.32, "text": "Oh"}, {"id": 740, "start": 6526.32, "end": 6541.32, "text": "Oh"}, {"id": 741, "start": 6541.32, "end": 6556.32, "text": "Oh"}, {"id": 742, "start": 6556.32, "end": 6571.32, "text": "Oh"}, {"id": 743, "start": 6571.32, "end": 6586.32, "text": "Oh"}, {"id": 744, "start": 6586.32, "end": 6601.32, "text": "Oh"}, {"id": 745, "start": 6601.32, "end": 6616.32, "text": "Oh"}, {"id": 746, "start": 6616.32, "end": 6631.32, "text": "Oh"}, {"id": 747, "start": 6631.32, "end": 6646.32, "text": "Oh"}, {"id": 748, "start": 6646.32, "end": 6661.32, "text": "Oh"}, {"id": 749, "start": 6661.32, "end": 6676.32, "text": "Oh"}, {"id": 750, "start": 6676.32, "end": 6691.32, "text": "Oh"}, {"id": 751, "start": 6691.32, "end": 6706.32, "text": "Oh"}, {"id": 752, "start": 6706.32, "end": 6721.32, "text": "Oh"}, {"id": 753, "start": 6721.32, "end": 6736.32, "text": "Oh"}, {"id": 754, "start": 6736.32, "end": 6751.32, "text": "Oh"}, {"id": 755, "start": 6751.32, "end": 6766.32, "text": "Oh"}, {"id": 756, "start": 6766.32, "end": 6781.32, "text": "Oh"}, {"id": 757, "start": 6781.32, "end": 6796.32, "text": "Oh"}, {"id": 758, "start": 6796.32, "end": 6811.32, "text": "Oh"}, {"id": 759, "start": 6811.32, "end": 6826.32, "text": "Oh"}, {"id": 760, "start": 6826.32, "end": 6841.32, "text": "Oh"}, {"id": 761, "start": 6841.32, "end": 6856.32, "text": "Oh"}, {"id": 762, "start": 6856.32, "end": 6871.32, "text": "Oh"}, {"id": 763, "start": 6871.32, "end": 6886.32, "text": "Oh"}, {"id": 764, "start": 6886.32, "end": 6901.32, "text": "Oh"}, {"id": 765, "start": 6901.32, "end": 6916.32, "text": "Oh"}, {"id": 766, "start": 6916.32, "end": 6931.32, "text": "Oh"}, {"id": 767, "start": 6931.32, "end": 6946.32, "text": "Oh"}, {"id": 768, "start": 6946.32, "end": 6961.32, "text": "Oh"}, {"id": 769, "start": 6961.32, "end": 6976.32, "text": "Oh"}, {"id": 770, "start": 6976.32, "end": 6991.32, "text": "Oh"}, {"id": 771, "start": 6991.32, "end": 7006.32, "text": "Oh"}, {"id": 772, "start": 7006.32, "end": 7021.32, "text": "Oh"}, {"id": 773, "start": 7021.32, "end": 7036.32, "text": "Oh"}, {"id": 774, "start": 7036.32, "end": 7051.32, "text": "Oh"}, {"id": 775, "start": 7051.32, "end": 7066.32, "text": "Oh"}, {"id": 776, "start": 7066.32, "end": 7081.32, "text": "Oh"}, {"id": 777, "start": 7081.32, "end": 7096.32, "text": "Oh"}, {"id": 778, "start": 7096.32, "end": 7111.32, "text": "Oh"}, {"id": 779, "start": 7111.32, "end": 7126.32, "text": "Oh"}, {"id": 780, "start": 7126.32, "end": 7141.32, "text": "Oh"}, {"id": 781, "start": 7141.32, "end": 7156.32, "text": "Oh"}, {"id": 782, "start": 7156.32, "end": 7171.32, "text": "Oh"}, {"id": 783, "start": 7171.32, "end": 7186.32, "text": "Oh"}, {"id": 784, "start": 7186.32, "end": 7201.32, "text": "Oh"}, {"id": 785, "start": 7201.32, "end": 7216.32, "text": "Oh"}, {"id": 786, "start": 7216.32, "end": 7231.32, "text": "Oh"}, {"id": 787, "start": 7231.32, "end": 7246.32, "text": "Oh"}, {"id": 788, "start": 7246.32, "end": 7261.32, "text": "Oh"}, {"id": 789, "start": 7261.32, "end": 7276.32, "text": "Oh"}, {"id": 790, "start": 7276.32, "end": 7291.32, "text": "Oh"}, {"id": 791, "start": 7291.32, "end": 7306.32, "text": "Oh"}, {"id": 792, "start": 7306.32, "end": 7321.32, "text": "Oh"}, {"id": 793, "start": 7321.32, "end": 7336.32, "text": "Oh"}, {"id": 794, "start": 7336.32, "end": 7351.32, "text": "Oh"}, {"id": 795, "start": 7351.32, "end": 7366.32, "text": "Oh"}, {"id": 796, "start": 7366.32, "end": 7381.32, "text": "Oh"}, {"id": 797, "start": 7381.32, "end": 7396.32, "text": "Oh"}, {"id": 798, "start": 7396.32, "end": 7411.32, "text": "Oh"}, {"id": 799, "start": 7411.32, "end": 7426.32, "text": "Oh"}, {"id": 800, "start": 7426.32, "end": 7441.32, "text": "Oh"}, {"id": 801, "start": 7441.32, "end": 7456.32, "text": "Oh"}, {"id": 802, "start": 7456.32, "end": 7471.32, "text": "Oh"}, {"id": 803, "start": 7471.32, "end": 7486.32, "text": "Oh"}, {"id": 804, "start": 7486.32, "end": 7501.32, "text": "Oh"}, {"id": 805, "start": 7501.32, "end": 7516.32, "text": "Oh"}, {"id": 806, "start": 7516.32, "end": 7544.32, "text": "Oh"}, {"id": 807, "start": 7544.32, "end": 7559.32, "text": "Oh"}, {"id": 808, "start": 7559.32, "end": 7574.32, "text": "Oh"}, {"id": 809, "start": 7574.32, "end": 7589.32, "text": "Oh"}, {"id": 810, "start": 7589.32, "end": 7604.32, "text": "Oh"}, {"id": 811, "start": 7604.32, "end": 7619.32, "text": "Oh"}, {"id": 812, "start": 7619.32, "end": 7634.32, "text": "Oh"}, {"id": 813, "start": 7634.32, "end": 7649.32, "text": "Oh"}, {"id": 814, "start": 7649.32, "end": 7664.32, "text": "Oh"}, {"id": 815, "start": 7664.32, "end": 7679.32, "text": "Oh"}, {"id": 816, "start": 7679.32, "end": 7694.32, "text": "Oh"}, {"id": 817, "start": 7694.32, "end": 7709.32, "text": "Oh"}, {"id": 818, "start": 7709.32, "end": 7724.32, "text": "Oh"}, {"id": 819, "start": 7724.32, "end": 7739.32, "text": "Oh"}, {"id": 820, "start": 7739.32, "end": 7754.32, "text": "Oh"}, {"id": 821, "start": 7754.32, "end": 7769.32, "text": "Oh"}, {"id": 822, "start": 7769.32, "end": 7784.32, "text": "Oh"}, {"id": 823, "start": 7784.32, "end": 7799.32, "text": "Oh"}, {"id": 824, "start": 7799.32, "end": 7814.32, "text": "Oh"}, {"id": 825, "start": 7814.32, "end": 7829.32, "text": "Oh"}, {"id": 826, "start": 7829.32, "end": 7844.32, "text": "Oh"}, {"id": 827, "start": 7844.32, "end": 7859.32, "text": "Oh"}, {"id": 828, "start": 7859.32, "end": 7874.32, "text": "Oh"}, {"id": 829, "start": 7874.32, "end": 7889.32, "text": "Oh"}, {"id": 830, "start": 7889.32, "end": 7904.32, "text": "Oh"}, {"id": 831, "start": 7904.32, "end": 7919.32, "text": "Oh"}, {"id": 832, "start": 7919.32, "end": 7934.32, "text": "Oh"}, {"id": 833, "start": 7934.32, "end": 7949.32, "text": "Oh"}, {"id": 834, "start": 7949.32, "end": 7964.32, "text": "Oh"}, {"id": 835, "start": 7964.32, "end": 7979.32, "text": "Oh"}, {"id": 836, "start": 7979.32, "end": 7994.32, "text": "Oh"}, {"id": 837, "start": 7994.32, "end": 8009.32, "text": "Oh"}, {"id": 838, "start": 8009.32, "end": 8024.32, "text": "Oh"}, {"id": 839, "start": 8024.32, "end": 8039.32, "text": "Oh"}, {"id": 840, "start": 8039.32, "end": 8054.32, "text": "Oh"}, {"id": 841, "start": 8054.32, "end": 8069.32, "text": "Oh"}, {"id": 842, "start": 8069.32, "end": 8084.32, "text": "Oh"}, {"id": 843, "start": 8084.32, "end": 8099.32, "text": "Oh"}, {"id": 844, "start": 8099.32, "end": 8114.32, "text": "Oh"}, {"id": 845, "start": 8114.32, "end": 8129.32, "text": "Oh"}, {"id": 846, "start": 8129.32, "end": 8144.32, "text": "Oh"}, {"id": 847, "start": 8144.32, "end": 8159.32, "text": "Oh"}, {"id": 848, "start": 8159.32, "end": 8174.32, "text": "Oh"}, {"id": 849, "start": 8174.32, "end": 8189.32, "text": "Oh"}, {"id": 850, "start": 8189.32, "end": 8217.32, "text": "Oh"}, {"id": 851, "start": 8217.32, "end": 8232.32, "text": "Oh"}, {"id": 852, "start": 8232.32, "end": 8247.32, "text": "Oh"}, {"id": 853, "start": 8247.32, "end": 8262.32, "text": "Oh"}, {"id": 854, "start": 8262.32, "end": 8277.32, "text": "Oh"}, {"id": 855, "start": 8277.32, "end": 8292.32, "text": "Oh"}, {"id": 856, "start": 8292.32, "end": 8307.32, "text": "Oh"}, {"id": 857, "start": 8307.32, "end": 8322.32, "text": "Oh"}, {"id": 858, "start": 8322.32, "end": 8337.32, "text": "Oh"}, {"id": 859, "start": 8337.32, "end": 8352.32, "text": "Oh"}, {"id": 860, "start": 8352.32, "end": 8367.32, "text": "Oh"}, {"id": 861, "start": 8367.32, "end": 8382.32, "text": "Oh"}, {"id": 862, "start": 8382.32, "end": 8397.32, "text": "Oh"}, {"id": 863, "start": 8397.32, "end": 8412.32, "text": "Oh"}, {"id": 864, "start": 8412.32, "end": 8427.32, "text": "Oh"}, {"id": 865, "start": 8427.32, "end": 8442.32, "text": "Oh"}, {"id": 866, "start": 8442.32, "end": 8457.32, "text": "Oh"}, {"id": 867, "start": 8457.32, "end": 8472.32, "text": "Oh"}, {"id": 868, "start": 8472.32, "end": 8487.32, "text": "Oh"}, {"id": 869, "start": 8487.32, "end": 8502.32, "text": "Oh"}, {"id": 870, "start": 8502.32, "end": 8517.32, "text": "Oh"}, {"id": 871, "start": 8517.32, "end": 8532.32, "text": "Oh"}, {"id": 872, "start": 8532.32, "end": 8547.32, "text": "Oh"}, {"id": 873, "start": 8547.32, "end": 8562.32, "text": "Oh"}, {"id": 874, "start": 8562.32, "end": 8577.32, "text": "Oh"}, {"id": 875, "start": 8577.32, "end": 8592.32, "text": "Oh"}, {"id": 876, "start": 8592.32, "end": 8607.32, "text": "Oh"}, {"id": 877, "start": 8607.32, "end": 8622.32, "text": "Oh"}, {"id": 878, "start": 8622.32, "end": 8637.32, "text": "Oh"}, {"id": 879, "start": 8637.32, "end": 8652.32, "text": "Oh"}, {"id": 880, "start": 8652.32, "end": 8667.32, "text": "Oh"}, {"id": 881, "start": 8667.32, "end": 8682.32, "text": "Oh"}, {"id": 882, "start": 8682.32, "end": 8697.32, "text": "Oh"}, {"id": 883, "start": 8697.32, "end": 8712.32, "text": "Oh"}, {"id": 884, "start": 8712.32, "end": 8727.32, "text": "Oh"}, {"id": 885, "start": 8727.32, "end": 8742.32, "text": "Oh"}, {"id": 886, "start": 8742.32, "end": 8757.32, "text": "Oh"}, {"id": 887, "start": 8757.32, "end": 8772.32, "text": "Oh"}, {"id": 888, "start": 8772.32, "end": 8787.32, "text": "Oh"}, {"id": 889, "start": 8787.32, "end": 8802.32, "text": "Oh"}, {"id": 890, "start": 8802.32, "end": 8817.32, "text": "Oh"}, {"id": 891, "start": 8817.32, "end": 8832.32, "text": "Oh"}, {"id": 892, "start": 8832.32, "end": 8847.32, "text": "Oh"}, {"id": 893, "start": 8847.32, "end": 8862.32, "text": "Oh"}, {"id": 894, "start": 8862.32, "end": 8877.32, "text": "Oh"}, {"id": 895, "start": 8877.32, "end": 8892.32, "text": "Oh"}, {"id": 896, "start": 8892.32, "end": 8907.32, "text": "Oh"}, {"id": 897, "start": 8907.32, "end": 8922.32, "text": "Oh"}, {"id": 898, "start": 8922.32, "end": 8937.32, "text": "Oh"}, {"id": 899, "start": 8937.32, "end": 8952.32, "text": "Oh"}, {"id": 900, "start": 8952.32, "end": 8967.32, "text": "Oh"}, {"id": 901, "start": 8967.32, "end": 8982.32, "text": "Oh"}, {"id": 902, "start": 8982.32, "end": 8997.32, "text": "Oh"}, {"id": 903, "start": 8997.32, "end": 9012.32, "text": "Oh"}, {"id": 904, "start": 9012.32, "end": 9027.32, "text": "Oh"}, {"id": 905, "start": 9027.32, "end": 9042.32, "text": "Oh"}, {"id": 906, "start": 9042.32, "end": 9057.32, "text": "Oh"}, {"id": 907, "start": 9057.32, "end": 9072.32, "text": "Oh"}, {"id": 908, "start": 9072.32, "end": 9087.32, "text": "Oh"}, {"id": 909, "start": 9087.32, "end": 9102.32, "text": "Oh"}, {"id": 910, "start": 9102.32, "end": 9117.32, "text": "Oh"}, {"id": 911, "start": 9117.32, "end": 9132.32, "text": "Oh"}, {"id": 912, "start": 9132.32, "end": 9147.32, "text": "Oh"}, {"id": 913, "start": 9147.32, "end": 9175.32, "text": "Oh"}, {"id": 914, "start": 9175.32, "end": 9190.32, "text": "Oh"}, {"id": 915, "start": 9190.32, "end": 9205.32, "text": "Oh"}, {"id": 916, "start": 9205.32, "end": 9220.32, "text": "Oh"}, {"id": 917, "start": 9220.32, "end": 9235.32, "text": "Oh"}, {"id": 918, "start": 9235.32, "end": 9250.32, "text": "Oh"}, {"id": 919, "start": 9250.32, "end": 9265.32, "text": "Oh"}, {"id": 920, "start": 9265.32, "end": 9280.32, "text": "Oh"}, {"id": 921, "start": 9280.32, "end": 9295.32, "text": "Oh"}, {"id": 922, "start": 9295.32, "end": 9310.32, "text": "Oh"}, {"id": 923, "start": 9310.32, "end": 9325.32, "text": "Oh"}, {"id": 924, "start": 9325.32, "end": 9340.32, "text": "Oh"}, {"id": 925, "start": 9340.32, "end": 9355.32, "text": "Oh"}, {"id": 926, "start": 9355.32, "end": 9370.32, "text": "Oh"}, {"id": 927, "start": 9370.32, "end": 9385.32, "text": "Oh"}, {"id": 928, "start": 9385.32, "end": 9400.32, "text": "Oh"}, {"id": 929, "start": 9400.32, "end": 9415.32, "text": "Oh"}, {"id": 930, "start": 9415.32, "end": 9430.32, "text": "Oh"}, {"id": 931, "start": 9430.32, "end": 9445.32, "text": "Oh"}, {"id": 932, "start": 9445.32, "end": 9460.32, "text": "Oh"}, {"id": 933, "start": 9460.32, "end": 9475.32, "text": "Oh"}, {"id": 934, "start": 9475.32, "end": 9490.32, "text": "Oh"}, {"id": 935, "start": 9490.32, "end": 9505.32, "text": "Oh"}, {"id": 936, "start": 9505.32, "end": 9520.32, "text": "Oh"}, {"id": 937, "start": 9520.32, "end": 9535.32, "text": "Oh"}, {"id": 938, "start": 9535.32, "end": 9550.32, "text": "Oh"}, {"id": 939, "start": 9550.32, "end": 9565.32, "text": "Oh"}, {"id": 940, "start": 9565.32, "end": 9580.32, "text": "Oh"}, {"id": 941, "start": 9580.32, "end": 9595.32, "text": "Oh"}, {"id": 942, "start": 9595.32, "end": 9610.32, "text": "Oh"}, {"id": 943, "start": 9610.32, "end": 9625.32, "text": "Oh"}, {"id": 944, "start": 9625.32, "end": 9640.32, "text": "Oh"}, {"id": 945, "start": 9640.32, "end": 9655.32, "text": "Oh"}, {"id": 946, "start": 9655.32, "end": 9670.32, "text": "Oh"}, {"id": 947, "start": 9670.32, "end": 9685.32, "text": "Oh"}, {"id": 948, "start": 9685.32, "end": 9700.32, "text": "Oh"}, {"id": 949, "start": 9700.32, "end": 9715.32, "text": "Oh"}, {"id": 950, "start": 9715.32, "end": 9730.32, "text": "Oh"}, {"id": 951, "start": 9730.32, "end": 9745.32, "text": "Oh"}, {"id": 952, "start": 9745.32, "end": 9760.32, "text": "Oh"}, {"id": 953, "start": 9760.32, "end": 9775.32, "text": "Oh"}, {"id": 954, "start": 9775.32, "end": 9790.32, "text": "Oh"}, {"id": 955, "start": 9790.32, "end": 9805.32, "text": "Oh"}, {"id": 956, "start": 9805.32, "end": 9820.32, "text": "Oh"}, {"id": 957, "start": 9820.32, "end": 9835.32, "text": "Oh"}, {"id": 958, "start": 9835.32, "end": 9850.32, "text": "Oh"}, {"id": 959, "start": 9850.32, "end": 9865.32, "text": "Oh"}, {"id": 960, "start": 9865.32, "end": 9880.32, "text": "Oh"}, {"id": 961, "start": 9880.32, "end": 9895.32, "text": "Oh"}, {"id": 962, "start": 9895.32, "end": 9910.32, "text": "Oh"}, {"id": 963, "start": 9910.32, "end": 9925.32, "text": "Oh"}, {"id": 964, "start": 9925.32, "end": 9940.32, "text": "Oh"}, {"id": 965, "start": 9940.32, "end": 9968.32, "text": "Oh"}, {"id": 966, "start": 9968.32, "end": 9983.32, "text": "Oh"}, {"id": 967, "start": 9983.32, "end": 9996.32, "text": "Oh"}, {"id": 968, "start": 9996.32, "end": 10020.32, "text": "Oh"}, {"id": 969, "start": 10020.32, "end": 10041.32, "text": "Oh"}, {"id": 970, "start": 10041.32, "end": 10056.32, "text": "Oh"}, {"id": 971, "start": 10056.32, "end": 10071.32, "text": "Oh"}, {"id": 972, "start": 10071.32, "end": 10086.32, "text": "Oh"}, {"id": 973, "start": 10086.32, "end": 10101.32, "text": "Oh"}, {"id": 974, "start": 10101.32, "end": 10116.32, "text": "Oh"}, {"id": 975, "start": 10116.32, "end": 10131.32, "text": "Oh"}, {"id": 976, "start": 10131.32, "end": 10146.32, "text": "Oh"}, {"id": 977, "start": 10146.32, "end": 10161.32, "text": "Oh"}, {"id": 978, "start": 10161.32, "end": 10176.32, "text": "Oh"}, {"id": 979, "start": 10176.32, "end": 10191.32, "text": "Oh"}, {"id": 980, "start": 10191.32, "end": 10206.32, "text": "Oh"}, {"id": 981, "start": 10206.32, "end": 10221.32, "text": "Oh"}, {"id": 982, "start": 10221.32, "end": 10236.32, "text": "Oh"}, {"id": 983, "start": 10236.32, "end": 10251.32, "text": "Oh"}, {"id": 984, "start": 10251.32, "end": 10266.32, "text": "Oh"}, {"id": 985, "start": 10266.32, "end": 10281.32, "text": "Oh"}, {"id": 986, "start": 10281.32, "end": 10296.32, "text": "Oh"}, {"id": 987, "start": 10296.32, "end": 10311.32, "text": "Oh"}, {"id": 988, "start": 10311.32, "end": 10326.32, "text": "Oh"}, {"id": 989, "start": 10326.32, "end": 10341.32, "text": "Oh"}, {"id": 990, "start": 10341.32, "end": 10356.32, "text": "Oh"}, {"id": 991, "start": 10356.32, "end": 10371.32, "text": "Oh"}, {"id": 992, "start": 10371.32, "end": 10386.32, "text": "Oh"}, {"id": 993, "start": 10386.32, "end": 10414.32, "text": "Oh"}, {"id": 994, "start": 10414.32, "end": 10429.32, "text": "Oh"}, {"id": 995, "start": 10429.32, "end": 10444.32, "text": "Oh"}, {"id": 996, "start": 10444.32, "end": 10459.32, "text": "Oh"}, {"id": 997, "start": 10459.32, "end": 10474.32, "text": "Oh"}, {"id": 998, "start": 10474.32, "end": 10489.32, "text": "Oh"}, {"id": 999, "start": 10489.32, "end": 10504.32, "text": "Oh"}, {"id": 1000, "start": 10504.32, "end": 10519.32, "text": "Oh"}, {"id": 1001, "start": 10519.32, "end": 10547.32, "text": "Oh"}, {"id": 1002, "start": 10547.32, "end": 10562.32, "text": "Oh"}, {"id": 1003, "start": 10562.32, "end": 10575.32, "text": "Oh"}, {"id": 1004, "start": 10575.32, "end": 10590.32, "text": "Oh"}, {"id": 1005, "start": 10590.32, "end": 10603.32, "text": "Oh"}, {"id": 1006, "start": 10603.32, "end": 10627.32, "text": "Oh"}, {"id": 1007, "start": 10627.32, "end": 10642.32, "text": "Oh"}, {"id": 1008, "start": 10642.32, "end": 10657.32, "text": "Oh"}, {"id": 1009, "start": 10657.32, "end": 10672.32, "text": "Oh"}, {"id": 1010, "start": 10672.32, "end": 10687.32, "text": "Oh"}, {"id": 1011, "start": 10687.32, "end": 10702.32, "text": "Oh"}, {"id": 1012, "start": 10702.32, "end": 10717.32, "text": "Oh"}, {"id": 1013, "start": 10717.32, "end": 10732.32, "text": "Oh"}, {"id": 1014, "start": 10732.32, "end": 10747.32, "text": "Oh"}, {"id": 1015, "start": 10747.32, "end": 10762.32, "text": "Oh"}, {"id": 1016, "start": 10762.32, "end": 10777.32, "text": "Oh"}, {"id": 1017, "start": 10777.32, "end": 10792.32, "text": "Oh"}, {"id": 1018, "start": 10792.32, "end": 10807.32, "text": "Oh"}, {"id": 1019, "start": 10807.32, "end": 10822.32, "text": "Oh"}, {"id": 1020, "start": 10822.32, "end": 10837.32, "text": "Oh"}, {"id": 1021, "start": 10837.32, "end": 10852.32, "text": "Oh"}, {"id": 1022, "start": 10852.32, "end": 10867.32, "text": "Oh"}, {"id": 1023, "start": 10867.32, "end": 10882.32, "text": "Oh"}, {"id": 1024, "start": 10882.32, "end": 10910.32, "text": "Oh"}, {"id": 1025, "start": 10910.32, "end": 10925.32, "text": "Oh"}, {"id": 1026, "start": 10925.32, "end": 10940.32, "text": "Oh"}, {"id": 1027, "start": 10940.32, "end": 10955.32, "text": "Oh"}, {"id": 1028, "start": 10955.32, "end": 10970.32, "text": "Oh"}, {"id": 1029, "start": 10970.32, "end": 10985.32, "text": "Oh"}, {"id": 1030, "start": 10985.32, "end": 11000.32, "text": "Oh"}, {"id": 1031, "start": 11000.32, "end": 11015.32, "text": "Oh"}, {"id": 1032, "start": 11015.32, "end": 11030.32, "text": "Oh"}, {"id": 1033, "start": 11030.32, "end": 11045.32, "text": "Oh"}, {"id": 1034, "start": 11045.32, "end": 11060.32, "text": "Oh"}, {"id": 1035, "start": 11060.32, "end": 11075.32, "text": "Oh"}, {"id": 1036, "start": 11075.32, "end": 11090.32, "text": "Oh"}, {"id": 1037, "start": 11090.32, "end": 11105.32, "text": "Oh"}, {"id": 1038, "start": 11105.32, "end": 11120.32, "text": "Oh"}, {"id": 1039, "start": 11120.32, "end": 11135.32, "text": "Oh"}, {"id": 1040, "start": 11135.32, "end": 11150.32, "text": "Oh"}, {"id": 1041, "start": 11150.32, "end": 11165.32, "text": "Oh"}, {"id": 1042, "start": 11165.32, "end": 11180.32, "text": "Oh"}, {"id": 1043, "start": 11180.32, "end": 11195.32, "text": "Oh"}, {"id": 1044, "start": 11195.32, "end": 11210.32, "text": "Oh"}, {"id": 1045, "start": 11210.32, "end": 11225.32, "text": "Oh"}, {"id": 1046, "start": 11225.32, "end": 11240.32, "text": "Oh"}, {"id": 1047, "start": 11240.32, "end": 11255.32, "text": "Oh"}, {"id": 1048, "start": 11255.32, "end": 11270.32, "text": "Oh"}, {"id": 1049, "start": 11270.32, "end": 11285.32, "text": "Oh"}, {"id": 1050, "start": 11285.32, "end": 11300.32, "text": "Oh"}, {"id": 1051, "start": 11300.32, "end": 11315.32, "text": "Oh"}, {"id": 1052, "start": 11315.32, "end": 11330.32, "text": "Oh"}, {"id": 1053, "start": 11330.32, "end": 11345.32, "text": "Oh"}, {"id": 1054, "start": 11345.32, "end": 11360.32, "text": "Oh"}, {"id": 1055, "start": 11360.32, "end": 11375.32, "text": "Oh"}, {"id": 1056, "start": 11375.32, "end": 11403.32, "text": "Oh"}, {"id": 1057, "start": 11403.32, "end": 11423.32, "text": "Oh"}, {"id": 1058, "start": 11423.32, "end": 11445.32, "text": "Oh"}, {"id": 1059, "start": 11445.32, "end": 11460.32, "text": "Oh"}, {"id": 1060, "start": 11460.32, "end": 11475.32, "text": "Oh"}, {"id": 1061, "start": 11475.32, "end": 11490.32, "text": "Oh"}, {"id": 1062, "start": 11490.32, "end": 11505.32, "text": "Oh"}, {"id": 1063, "start": 11505.32, "end": 11520.32, "text": "Oh"}, {"id": 1064, "start": 11520.32, "end": 11535.32, "text": "Oh"}, {"id": 1065, "start": 11535.32, "end": 11550.32, "text": "Oh"}, {"id": 1066, "start": 11550.32, "end": 11565.32, "text": "Oh"}, {"id": 1067, "start": 11565.32, "end": 11580.32, "text": "Oh"}, {"id": 1068, "start": 11580.32, "end": 11595.32, "text": "Oh"}, {"id": 1069, "start": 11595.32, "end": 11610.32, "text": "Oh"}, {"id": 1070, "start": 11610.32, "end": 11625.32, "text": "Oh"}, {"id": 1071, "start": 11625.32, "end": 11653.32, "text": "Oh"}, {"id": 1072, "start": 11653.32, "end": 11668.32, "text": "Oh"}, {"id": 1073, "start": 11668.32, "end": 11681.32, "text": "Oh"}, {"id": 1074, "start": 11681.32, "end": 11696.32, "text": "Oh"}, {"id": 1075, "start": 11696.32, "end": 11711.32, "text": "Oh"}, {"id": 1076, "start": 11711.32, "end": 11726.32, "text": "Oh"}, {"id": 1077, "start": 11726.32, "end": 11741.32, "text": "Oh"}, {"id": 1078, "start": 11741.32, "end": 11756.32, "text": "Oh"}, {"id": 1079, "start": 11756.32, "end": 11771.32, "text": "Oh"}, {"id": 1080, "start": 11771.32, "end": 11786.32, "text": "Oh"}, {"id": 1081, "start": 11786.32, "end": 11801.32, "text": "Oh"}, {"id": 1082, "start": 11801.32, "end": 11816.32, "text": "Oh"}]}