{"text": "So, ich bin nochmal am Start und wisst ihr wer auch da ist?Der Apisolier-Champ ist auch am Start. Der liegt hier gerade rum, den brauchen wir heute bestimmt nicht, ich bin doch gerade so aufgefallen, dass der ist auch da, ja.Vielleicht brauchen wir den morgen, aber eher nicht. Nachdem ich mir keine Netzwerkkabel selbst mache, brauchen wir das morgen wahrscheinlich auch nicht.Aber gut, dass er mal da ist, ne. So, also, übrigens habt ihr schon gesehen, wer hätte das nur vermuten können. Also, wer, wer hätte denken können, dass das nicht erreicht wird.Also, ganz ehrlich, ich bin echt schockiert. Ich, ich hab, ich hab wirklich gedacht, diesmal schaffen wir's, ja. Also, wer hätte damit rechnen können, kann ich gar nicht verstehen.Es ist, es ist, glaube ich, das 14. Breitbandziel oder so, was wir nicht einhalten. Ja, by the way, Chet ratet mal, ratet mal, wie viele Breitbandziele haben wir schon, haben wir schon geschafft.Also, pünktlich zu dem Termin, wo sie angekündigt waren. Null. Ähm, ich glaube, ich glaube, falls man das so nehmen kann.Wir haben damals ISDN-Einführung angekündigt und geschafft. Aber ich glaube, das war's, ey. Ja, Patrick, ich hab's aber, ich hab's aber erst nachher gesehen.Ich hab, äh, auf, ich hab Message vom Sebaro gesehen, hab ich gerade das re-tweeteste mal. Jetzt weiß ich auch, wo das Sebaro das her hatte. Kann das sein, dass ich mich ein bisschen...Also, es gibt zwei Möglichkeiten. Entweder ich höre besser als sonst oder ich bin lauter als sonst. Diese zwei Varianten gibt's.Wartet mal, ich muss mal kurz so machen. Jetzt einfach so übersteuern, nicht? Okay. Ähm, ja, anscheinend bin ich lauter als sonst.Vielleicht höre ich heute auch einfach nur besser. Das kann natürlich auch sein. Äh, nö, das passt eigentlich alles.Haha, ja, keine Ahnung, ich, komm, ich, hört sich für mich lauter an, ja. Ja, übrigens 2030, Keque, wer glaubt, wer glaubt denn da noch dran?Ist das richtig dumm? Ich hab auf die OrnCustom-Firme erst mal geflasht. Jetzt höre ich, jetzt höre ich besser. Also, ich mein...Also, mein, erstens, erstens, es sind noch vier Jahre hin, ja, bis das vorbei ist.Das heißt, man ist sich jetzt schon sicher, man kann, ich mein, man könnte ja versuchen, in diesen vier Jahren endlich mal, ich bin mir sicher, man kann in vier Jahren unglaublich viel erreichen.Man guckt euch mal die Chinesen an, die in zwei Tagen irgendwie fünf Krankenhäuser bauen, um es jetzt mal übertrieben zu sein. Also, man könnte, wenn man will, bestimmt in vier Jahren, vielleicht nicht 100%,aber man könnte willen, demonstrieren und zeigen, guck mal, wir meinen's ernst. Und das Problem ist ja, das ist das, was ich gestern auch gesagt hab, wenn man ab, ups, wenn man abgehängt ist und man möchte,man möchte aufholen, dann hilft das nicht, wenn man in fünf Jahren das macht, was die anderen vor zehn Jahren gemacht haben, nein, man muss das in zwei Jahren machen, quasi.Also, nicht was die schon gemacht haben, sondern was die anderen in fünf Jahren machen, muss man in zwei Jahren machen, sonst holt man ja nicht mehr auf.Und das kriegen wir halt nicht gebacken und bis 2030, alter, 2030, der lebt wahrscheinlich 2000, ich weiß nicht, wie alt ist der Typ überhaupt?Ich hab keine, wie alt ist denn der?Der Typ lebt vielleicht nicht mehr 2030. Was sind das für Versprechen?Also, ich weiß auch nicht, also, es ist einfach Fail.Wir müssen jetzt ein bisschen um das, auch Kirby-Wintermusik, das, das klingt gut. Siehst du, das ist ja heute, hat's bei euch auch geschneit.Äh, das ist Secret of Mana, oder? Das ist 100% Secret of Mana-Musik. Ja, ja, hör ich sofort raus, hör ich sofort raus.Exquisite.Nee, das ist mir zumindest, ich, ich, ich brauch, ich brauch Big Brain Kirby-Musik.Jawoll.Hört sich fast ein bisschen an wie dicke Barge Volksmusik.Okay, sehr schön.Was übrigens, was übrigens auch der Witz ist, also, wenn das ernsthaft, wenn das ernsthaft Wahlkampfstrategie ist, dann fällt ihnen wirklich nichts mehr ein.Weil, wie kann man ernsthaft was als Wahlkampfstrategie verkaufen, was das, was der eigene Fail der letzten Jahre nochmal besonders hervorhebt, ja?Man sollte ja eigentlich von ausgehen, Wahlkampfstrategie ist was, was einen hilft, dass man besonders gut dasteht.Aber wenn die das jetzt sagen, dann gestehen sie sich ein, ich meine, die waren in der Regierung die letzten, frag mich nicht, 12 Jahre oder so.Irgendwann war auch mehr FDP, ich weiß nicht mal wann das war. Also ich war irgendwie 12 Jahre oder so mit in der Regierung.Also sprich, wenn man das jetzt als Wahlkampfstrategie nimmt, dann bedeutet das ja im Endeffekt, dass sie, dass sie automatisch sagen, wir haben es selbst verschissen.Und ich weiß nicht, ob das so eine gute Wahlkampfstrategie ist, nochmal darauf hinzuweisen, was man eben nicht geschafft hat.Ja, das ist...Das war heute bei uns auch so, aber es ging, musste langsam fahren.Okay, je nachdem, wie viel es ist, kannst du es auch nicht raus, ja klar, verstehe ich, aber so viel ist bei uns ja nie.Ey, die Idee finde ich gar nicht so übel, die Idee finde ich gar nicht so übel, das kehrt ja mittlerweile auch in vielen Unternehmen ein.Dass es nicht nur quasi, wie soll man sagen, Qualitäts- und Fortschrittskontrolle wie auch immer gibt für Leute, die quasi praktisch was arbeiten, sondern auch für Führungskräfte.Das ist jetzt bei uns beispielsweise auch Thema Qualität in der Führung verbessern und sowas.Also sprich, die sind auch schon langsam aber sicher auf den Drichter gekommen, dass nur wenn da irgendwie quasi, wenn man was managt, dass man nicht das automatisch immer perfekt macht.Also ich bin jeder Meinung, also auch quasi Manager und Führungskräfte müssen sich irgendwie an irgendwas messen lassen, ja.Ich höre heute echt besser Leute, ich glaube mein Headset ist...Nee, nee, nee, wisst ihr was, ihr hört mich normal laut, aber meine Replay-Lautstärke ist glaube ich aus irgendwelchen Gründen höher als sonst.Also danke schön für den Twitch Prime-Sub.Warum ist meine Einspiel-Lautstärke heute höher als sonst? Das verstehe ich nicht so genau.So, ich habe jetzt mal ein bisschen volle Pulle, volle Pulle, ein ticken leiser.Ach was, scheiß drauf, passt schon.Gut, also wisst ihr was wir heute machen? Wir machen heute was ganz furchtbar brain dead.Ich installiere mir ein paar Raspberry Pis, weil morgen kommt mein Switch.Ich habe mir den hier bestellt und ich habe mir gedacht wir packen den mal zusammen live, also ich habe zwei Sachen, die wir morgen auspacken.Wir packen das mal live aus, dann ist wieder Hand League angesagt.Ich habe hier, ich meine ich habe mir nur nicht umsonst das Setup aus Tisch, Elgato Ringlight und Kamerahalterung gekauft, dass wir das nicht ab und zu auch mal verwenden, ja.Also das Ding packen wir morgen aus, probieren es aus.Das da und das, ähm, äh wie hieß das Ding?Warum kein Ubiquiti Zeug, weil das in dem Preissegment und mit diesen Features schlicht und ergreifend nicht vorhanden ist.Ich habe einen Ubiquiti Switch mit 12 Ports, das ist aber komplett andere Preisliga.Das Zeug hier kostet alles um 100 oder 100, unter 100 Euro und der Ubiquiti Switch kostet 500, ist leichter Unterschied, ja.So und den da, also die zwei Sachen packen wir morgen aus.Und wir müssen das ganze, Switches kannst du auch mit Ansible bespielen, ne, ja kann ich, aber mach ich nicht.Ich klick da drei Sachen an und dann bleibt es für immer so.Ich muss ja nicht am Tag 50 Switch provisionen.Mikrotik sackt eh ein bisschen, würde mich wundern, ja würde mich auch wundern, wenn das, geht das?Die haben so ein bisschen Eigenheiten.Die haben ja auch so eine komische, so ein komisches Scripting Interface, was echt gewöhnungsbedürftig ist.Mikrotik, die, das ist glaube ich eine Polt, nee, nee, nee, Tschechen, Polen, nee, Lettland oder so, kommen die glaub her, ne?Lat, Latvian, was ist Latvian, Estland, Lettland, Litauen, da blick ich nicht durch, äh, Riga, ja was ist das auf Deutsch?Lettland, Lettland.Genau, so, also, aber anscheinend, RouterOS Plattform, doch, das scheint zu funktionieren.Ah, CLI Connections.genau so also aber anscheinend router os plattform doch das scheint zu funktionierenCLI connections das ist jetzt an sich nicht so schlimmCLI connections heißt im endeffekt über SSH das ist jetzt nicht so wildstimmt das ist router os stimmt du hast rechtdu hast recht ja nö da nichtvorbei aber brauche ich eh nicht juckt mich juckt mich ehrlich gesagt überhaupt nichtalso den hier könnte man provisionen damit den hier nicht das übrigens der unterschiedbei mikrotik css sind reine reine switche mit switch os und also im prinzip sind dasalles reine switche aber das ist der betriebssystem unterschied also sprich hier läuft nur switchos drauf das ist wirklich total basic du kannst auch keinen firewall regel oder sonst irgendwasmachen dafür ist es deutlich einfacher finde ich zu konfigurieren für switch geschichtenund das ist das full blown router os von mikrotik mit allen möglichen scheiß drin allerdingsmuss man auch mal ehrlich sagen die dinger sind von der cpu her nicht darauf ausgelegtgroßartig firewall regel und routing zu machen das können die das können die aber das istvon der cpu her wahrscheinlich in switch zeigt mal was ist es denn für eine naja gutein paar ich sag mal so ein paar netze ein paar routing regeln und ein paar firewallregeln kann er mit der cpu auch ab also das ist jetzt kein totaler rohrkrepierer die hattenteilweise früher switches mit irgendwie 200 megahertz cpu die in software absolut nichtsauf die reihe gekriegt hat mit der cpu kannst du zumindest kannst was weiß ich kannst 15firewall regel rein machen es geht immer noch gut auch bei ordentlich traffic aber vielmehr ist da nicht die bräuchte man ab upstream ne brauchen wir nicht das wird ja nämlichbedeuten dass ich das machen muss so und die wie gesagt den den habe ich schon hier diekönnen wir theoretisch auch heute angucken aber wozu wir können morgen auch alles aufeinem machen und den habe ich hier bestellt der kommt morgen an zumindest sagt ups dasmit dem fortran stream das ist noch nicht sicher keck weight ich glaube also nachdem ich mirnachdem ich mir das letzte mal schon kobold geben musste und das eklig war fortran mussso echt nicht sein ja ich habe ich habe das einfach mal so gesagt das heißt ja nichtdass ich das machen muss was interessiert mich was interessiert mich was ich da vordem monat erzählt habe das schon ordentlich bei uns was nicht so viel ja ja ich weiß mansieht mich in total vielen videos in manchen sogar komplett das check plus keiner nichtnur bei mir muss man kurz durchscrollen max agi aber ich habe es ja falsch ich habe esja falsch geschrieben meiner wäre gewesen ja jetzt anzeige ist raus hier erpressungsversuchja viel glück was schreibst du was schreibst du ich habe alles da drin ja ich habe allesda drin wie wie ich das mache ich copy paste das man kann auch einen browser add-on verwendennee den gab es noch nicht ich bin mir nicht sicher ob ich das machen darf ich wolltemal den twitch support fragen ob das ok ist weil ich darf natürlich mein 3ds flaschenaber ich weiß nicht ob ich das zeigen darf ja ropsee dann glhf ich habe irgendwas übersehengerade im chat hier zeig mal ja warte ich game stop so ich glaube ich habe nichts übersehenes gibt einen browser add-on für keypass ja ja gibt es aber nutze ich aber nichtich habe es zumindest nicht gesehen ok ich kreufe jetzt mal runter jetzt fangen wirmal an gibt es keypass fürs handy ja gibt es auch wobei ich da vorsichtig wäre prinzipiellnicht alles aufs handy sünden nur weil man sünden kann weil ich meine die meisten passwörterbraucht man auf dem handy schlicht ergreifend nicht was brauchst du für passwörter aufdem handy du brauchst die youtube app was kein problem ist die merkt sich das e-internund kann es nix dagegen machen paypal vielleicht ab und zu mal amazon merkt sich den kram auchalles in der app also für was braucht man da passwörter großartig auf dem handy ahhier link in excellent mal mal zu falls irgendwas gespeichert hat man weiß ja nie den desktopden räume ich garantiert nicht auf der beste desktop außerdem sieht der desktop ja auchnur wegen euch so aus na guck mal das sind alles irgendwelche komischen emotes die ichbrauche excellent kamera produkt foto ordner wozu was mit euch los guck mal das ist vielbesser so weil wenn du hier nach versuchst wenn ich am hackermann gif suchen kann icheinfach hackermann gif angeben und hab's gefunden wenn ich in ordner gehe muss ich noch unterordner aufmachen das ist total bescheuert ordner wozu was ist der sinn von ordnerfoltex suche foltex suche ich mein hier habe ich gar kein desktop gibt kein brauche ichnet foltex suchen gut ist nur noobs haben die benutzen folter übersichtlichkeit ne istbrauchst du nicht ja ich spiele poe aber die sie sind aber nicht gespielt um ist einschachbrett eine gute frage ich glaube das war mal ein kameratest das war mal ein kameratestjaja ob der bewegungs ob die bewegungserkennung kommt ob das die bewegungserkennung das dascheckte ordner ordner ist nur was für windows noobs also braucht man nicht komplett uselesseinfach einfach foltex so guck wenn ich irgendwas suche hier oh das war jetzt ohne was einzugebenok ich suche jetzt ich suche jetzt read me am start also wozu wozu braucht man ordneres ist auch so übersichtlich genug ja monarch s read me ja meine ganze heim automatisierungkann ich nicht zeigen weil da liege ich zu viel so wir müssen mal kurz das aktuelleespion runter dann was du bringst nicht mehr espion heißt sondern raspberry pi o s lightschön dass du am start bist da auf x ich hoffe das richtig ausgemacht warum ist die musikauf einmal zu laut paper please raspberry pi immer schon alles für noobs wir machendie old school variante dd ne machen wir gar nicht wir verwenden den elektronen kui washatte ich auch nicht viel besser ist ok ich spule mal vor weil das andere ist garantiertnicht mehr so laut die können sie nicht entscheiden so download wo ist es da perfekt reicht jetztwundere als spit ja ich habe nämlich in raspberry pi 4 und raspberry pi 3 und ich mache dasauf beide drauf und danach testen wir mal ob mein 2,5 g adapter funktioniert das könnenwir heute ausprobieren ausprobieren der bananen lord römische zahlen also was ist das 2023 ich habe kein schimmer römische zahlen in 2021 alter hätte das mal den römern gesagtdie endlich geköpft klar so römer haben keine leute geköpft die haben gerne leute mit demsperr ersperrt dies war ja war ja human schon ja bananen lord dankeschön für den primesab ja vu ist ripp guckt euch das mal an die haben es verschissen und ich weiß auch genauwarum sie verschissen haben also meiner meiner ansicht nach warum sie verschissen haben unddas ist folgendes auflockt ein die haben es verschissen gar nicht mal wegen der mod dermod ist geil das erste problem was sie haben ist kein anti cheat das ist gar nicht so eingroßartiges problem das hauptsächliche problem ist keine gescheiten server der server hierist prinzipiell nicht schlecht aber absolut keine ich kann nicht mal sagen ob es keinefähigen admins sind oder gar keine admins die da sind die da spielen weil in der regelist das einfach nur totale zerstörung aber komplett fünf runden am stück von einerseite bis ich eventuell mal ein paar erbarmen zu switchen aber meistens verlieven die leuteinstantin server warum soll ich ubuntu jetzt auf einmal runterladen was ja nein nein neinnicht das da ja wunderbar und ich habe so ein bisschen die hoffnung vielleicht kriegensie das mit dem reality projekt hin ja aber das hätten sie machen müssen ganz ehrlichdu kannst nicht erwarten dass die leute sich bei einem spiel was zehn jahre oder so altist jetzt nicht ganz acht jahre alt neun jahre zehn jahre alt ist kannst du nicht erwartendass die leute sich da erst noch mal ein paar monate lang weil das ist ein altes game daskennen die mit nicht richtig funktionierenden servers und komischen rules jetzt rumschlagenalso meiner meinung das habe ich übrigens auch gesagt bevor das ganze released wurdewo ich wo ich gesagt habe hier daran könnte das fehlen du musst von anfang an zwei dreioffizielle server stellen offizielle server gut moderiert gut amministriert sinnvolleplugins und das wichtigste konsistentes regelset also du musst im endeffekt drei server stellendie mehr oder weniger ja mehr oder weniger vanilla sind mit eben den verbesserungen woman richtig die vorteile daran sieht also zum beispiel du kannst ruhig ein bisschen suppressionweg machen du kannst sonne weg machen du kannst screen shaking weg machen du kannst auch waffenruhig dem dem medic geben die der assault hat und sowas aber der rest das sollte relativstandard gut gebalance des battlefield 3 sein das kann vielleicht mal ab und zu eine nachtmerplaufen haben oder sowas um zu zeigen was cool ist aber die hätten eher zeigen müssen sonach dem motto mehr tickrate und kein plaufilter und keine shaking und vielleicht ne customperk und sowas aber irgendwas irgendwas konsistent ist und was was läuft 234 vielleicht offizielleserver 23 du machst du machst du kannst nen rush server machen mit 32 48 du könntestnen conquest machen und das reicht erst mal eigentlich eventuell noch für die ganzenhardcore für die ganzen basher leute noch ein tdm eventuell noch ein vierten mixed mitden besten mit dem best of oder so und man dann wollten kann conquest oder rush vielleichtsogar mit mit 70 dann aber das hätte man machen müssen das hat man das war essentiellmeiner meinung nach die haben auch das problem dass das spiel aktuell die ganze zeit crashnach ein paar runden und deswegen das tut mir leid für die die haben sich sicherlichsaumäßig viel mühe gegeben und das ist spielt sich besser als das original ich hab letztesmal wieder was bettel noch gespielt es hat ein paar probleme man merkt dass das spielan vielen stellen gar nicht für 60 tickrate aus ausgelegt ist aber es spielt sich findeich unbestreitbar besser wie das wie das wie das original gerade keine explosionen mehrund weniger suppression und über den plaufilter kann man sich jetzt streiten und auch auchauch dass ich das alles direkt anfühlt meistens wenn die hits registriert werden es ist schoncooler aber ich finde es halt immer schade wenn leute sich so viel mühe geben und dannnichts bei rauskommt weil man an so naheliegenden sachen nicht gedacht hat deswegen ich flameja immer ein bisschen gegen stonks leute aber eins muss man sagen ohne mist wenn ihr jemandseid der technisch richtig gut ist dann ist die chance relativ hoch dass ihr kein guterstonks verkäufer seid das ist einfach so es gibt ganz wenig leute die sagen eine gutewie soll man sagen eine gute führungskraft oder so gut guter manager sind und guter technikerin einem guckt euch mal Elon Musk an zum beispiel der typ hat bestimmt technisch keine ahnungwie man raketen baut oder autos baut oder sonst was aber da trifft die entscheidung und managtdie sachen ganz gut so der braucht big brain leute die die technik können es funktioniertohne beides nicht der wäre ohne technik leute und er hat mit sicherlich einer der bestentechniker paar der besten techniker auf der welt wird das ganze nicht funktionieren oderhat auch ein paar projekte wo ich mir relativ sicher bin dass sie nicht funktionieren werdenaber da hat auch schon gezeigt dass er sachen wirklich gut hinkriegt tesla haben sich dieleute früher kaputt gemacht kaputt funktioniert spacex haben die leute am anfang gesagt nullfunktioniert funktioniert da ob starlink ordentlich funktioniert und ob obdings hier wie heißt das dieser wacke um tunnel dieser dieser wacke um tunnel ob der richtigfunktioniert habe ich auch so meine zweifel er hat er hat für den manager sicherlichviel ahnung von der technik aber der könnte keine rakete bauen darum geht es heißt dubrauchst immer leute die gute gute verkäufer manager entscheider leute sind und leute diegut technik können also beides in einem funktioniert nicht sehr selten sehr selten zum zumindestguckt euch die google gründer an zum beispiel mal die google gründer haben das richtiggemacht die google gründer hat ein geiles produkt haben erst mal gesagt haben erst malgesagt sie wollen sie wollen schnelles sie wollen schnell schnell geld machen und wolltendas an jahu verkaufen jahu war dumm falls du bringst ja nach jahu noch jemand kenntdas war die da jahu wollte das nicht ich glaube für zwei millionen oder so ultra billig jahuhat gesagt hallo euch wollen wir nicht ok paar jahre später hätten sie das ganze nochmal kaufen können dann für ich sag jetzt mal irgendwas ich weiß den preis keiner unddann für traf 50 millionen wollten sie immer noch nicht und jetzt ist die jahu halt amarsch also sie haben erst mal versucht schnellkode zu machen gute idee gehabt techniker am startwollten das relativ günstig verkaufen jahu die wollten nicht so was die google leuterichtig gemacht haben die beste entscheidung die haben realisiert ich habe vergessen wiesie heißen sehr geil irgendwas und ich weiß ich weiß nicht mehr wie die google dudes heißenist aber auch letztendlich egal und die haben eine sache realisiert die haben realisiertsie sind gute technik leute aber keine zumindest noch nicht supergeilen stonks leute und siehaben sich damals erik schmidt hieß der typ glaube ich geholt und haben gesagt ey wirbrauchen einen der managen kann und letztendlich hat der ja auch google dann zu dem gemachtwas es letztendlich ist bis jetzt die google leute wieder selbst zurückgekommen sind aberdie konnten quasi in dieser zeit von von einem der besten lernen und sind jetzt selbst bigbrain stonks management leute ok aber die wenigsten techniker sind das eben und dazukommt es halt ich weiß gar nicht wie ich ursprünglich drauf gekommen bin also sprich wenn ihr gutertechniker seid ist die chance dass ihr kein das ist die chance hoch dass ihr kein guterverkäufer manager seid und dementsprechend wenn man irgendwas machen will ist es immergut man hat jemand dabei der stonks man ist ja wegen vu genau und deswegen das hat meinermein auch vu gefehlt die hätten so eine art community manager gebraucht das hatte derentwickler oder der erfinder mehr oder weniger selbst mitgemacht die hätten so eine artcommunity manager gebraucht der auch wirklich hergeht der jack frax anschreibt und irgendwelcheleute ein bisschen die werbetrommel rührt und das aber und das aber halt mal ein halbesjahr vor release schon das hätte das hätte sein muss sie hätten bestimmt mitgemacht es sei denn es seidenn die haben was bei bei ea unterschrieben dass sie motz nicht zeigen bei jack frax könnte ichmir das so nee nee nicht check wie heißt der andere wer hat letzten sind video gemacht jackfrax hat ein video gemacht level cap nicht umgedreht level cap hatten wie ich weiß es nicht der derkein video gemacht habt das könnte ich mir tatsächlich vorstellen ja die brauchen ja keine finanziellemittel du findest garantiert leute guck mal wenn du wenn du freiwillig leute findet die sich dajahre lang beschäftigen du findest garantiert auch leute die spaß daran haben so ein projektein bisschen wie sie ein bisschen marketing technisch voranzubringen und dafür nix wollendu brauchst dir keine profi marketing agentur so und das haben wir machen müssen und sich imgleichen zuge mal überlegen müssen wie schaffen wir das dass die spieler von anfang an anfang aneine konsistentes spielerlebnis haben was ja so nicht gegeben war weil der spaß nach wir spielenunfertige mods ist halt nach zwei tagen raus und da brauchst du 234 surfer mit konsistentem ruleset was funktioniert und die kannst du auch nicht einfach live patchen oder feststellen die leutedas spiel kackt ab das müsstest du irgendwie verzögert machen mal ein surfer probieren wennder zwei drei tagen läuft macht den anderen surfer wie auch immer deswegen das ist das problem esgibt bestimmt auf dieser welt unglaublich viele produkte die technisch extrem geil sind aber totaluntergehen weil sie keine passenden verkäufer am start haben oder keine passenden marketingstonks leute so gerne ich auf die also gerne ich so ein bisschen über marketing leute sonst wasflame und die meisten sind da bei den meisten marketing leute habe ich halt auch den eindrucksie können noch nicht mal das sie sind zu nichts fähig sie sind noch nicht mal für ihren jobfähig aber es gibt auch ein paar gute leute wenn du da welche findest die dann auch irgendwie zudieser firma und sie zu dem produkt passen dann bringt das auf jeden fall was weil die technikeralleine können es einfach nicht ok wir flaschen mal nebenbei zwei raspberry pies oh leute von dersd karte habe ich ihn hier noch war das mal von der sd karte wir starten jetzt erstmal elektronui zum flaschen was ich voller witz ist warum braucht man program mit einem mit zwei gigabyteram um eine micro sd karte zu flaschen wir können auch die d drauf machen also was habeich ihn hier am start ich habe noch ein paar ss ein paar micro sds also ich habe noch 20gepackt die will ich jetzt aber auspacken 16 g haben 16 g was das hier 8 g übelster billigkrab 8 g und 16 g komm ich nehme die ganz billige 8 g mal gucken ob die noch funztflaschen wir das ganze mal ob die passt überhaupt nicht mehr in den reader reinauch jetzt keg weight es ist gemounted jaflasche file downloads wo ist esflascht mal beim welche micro sd karten also wenn ich will also auf den pies dieich lange im einsatz habe verwende ich die hier weil die dinger halten dass man nochnie einer kaputt gegangen ist ein bisschen teuer aber die sind echt gut für die anderenhabe ich eine mischung aus billigen was das zahn disk und kingston da sind wir aber dasind wir aber auch schon welche kaputt gegangen ich finde next next klaut mist alternativennäher kommt darauf an was du brauchst wenn du den zink willst kannst du sie feil zünkesing gibt es viele alternativen für den zink für kontakte und kalender gibt es auch eigenständigekalderf kater fast auch immer surfer oder noch andere lösungen und klaut es auch kreppaber ansonsten mache ich next dort nicht und auch nicht ich habe zwar im einsatz aber nurweil ich zu faul bin es endlich abzuschalten sie um stick kloom stick weiß nicht trittich bin dankeschön für den massive prime subscription ja next klaut ist gerade dabeiauch klaut ist gerade dabei irgendwas zu rewriten keine ahnung wird aber ich immer noch mistscherwigs da ist das den weg hierher gefunden hast die sd karte ist aber ultra schnell dasist jetzt so eine billige kingston 8 gigabyte karte mal hoffentlich ob die ob funktionierthast du eigentlich eine freundin ja meine ps5 lull cringe antwort cringe panes champ cringeso wo hab ich jetzt den wo hab ich jetzt die kiste am start ja super ich bin super schlauleute gewesen so war so war big brain richtig treikopf bin ich gerade ich hab ich wolltejetzt die raspberry pies flaschen aber ich hab die raspberry pies hier gar nicht hingestelltich weiß gar nicht wo die sindnext klaut arbeitet jetzt mit der telekom zusammen das macht es aber nicht besser aber die habensich gefunden die haben sich gefundenby the way plot twist ich hab noch nicht mal eine ps5 und ich kauf mir auch keine ps5auf flash mal hin ja ich sehe auch den sinn da aktuell nicht es gibt ja nicht mal spielefüres gibt ja noch nicht mal spiele für also es lohnt sich noch nicht mal das einzige wasgibt es dark souls nee demon souls remake wenn man das mag das ist aber auch alles mehrgibt es nichtlaut preischen bis die ps5 nicht verfügbar das ist richtig die gibt es auch nirgendwoso leute ich muss mal kurz gucken wo ich den raspberry pie hin hab oder die zwei ich habnoch einen dreier und vierer gefunden kann ich euch mal kurz zeigen also was ich damitausprobieren will morgen ist folgendes wie gesagt ich hab mir hier zwei switche bestelltund was wir mal ausprobieren werden ist folgendeswir testen mal morgen was das ding für module was das für module verkraftet ich hab offizielleubiquity module ich hab direkt attach module da und nen sfp plus auf aort 45 adapter malgucken was das alles frisst und dann gucken wir mal wie man da so wie lands und sonstigesachen in switcher erst einrichtet hab ich noch nie gemacht da reicht auch da reichtauch der pie 3 und 4 für die kriegen zwar maximal 1 gigabit durch der dreier wenigeraber das reicht dafür uplink testen wir dann mal hier über den windows rechner oder überdie vm mal gucken da hab ich ja auch 10 g dran können wir dann direkt dran stöpselnund ja mal gucken bin mal gespanntach ja und ich hab nen adapter usb 3 2,5 g 45 mal gucken ob den der raspberry pi erkenntund ob der router damit zünkt da bin ich mal gespannt ob die 2,5 können das ist ja immerso ein bisschen 50 50 chance ob das klappt so hat er jetzt fertig geflasht da validateaber leute ich muss mal kurz die raspberry pi suchen geht schnell ich weiß wo die sindalso hoffe ich wenn die nicht da sind hab ich problemexzellent ich hab sie guck mal ich hab einen frisch verpackten ich hab heute die kameranicht an weil ich dachte man braucht die nicht ich mein stellt euch das einfach mal vorich hab jetzt gerade einen frisch verpackten aktuellen pie 4 mit 4g und noch einen in soeinem offiziellen pie gehäuse usb stick drin wo ich nicht genau weiß wofür der da istpie 3 das reicht und sogar ein offizielles raspberry pie netzteil da kann ja nix schiefgehen jetzt also da gibt es heute nix spannendes zu sehen in der richtung ich werde den kramjetzt flaschen mal gucken ob der gig ob der 2,5 g adapter funktioniert in der zwischenzeitkönnen wir ein bisschen chat gucken also wie gesagt next out finde ich ziemlicher craphabe ich ja gerade schon gesagt doch also aktuell habe ich ganz normal hier mein bio dynamicsheadset auf der hat der hat so ein bisschen watte hat so ein bisschen schaumstoff drüberaber da hat es nicht so einen fetten popschutz auf meinem mikrofon was ich verwende um dievideos aufzunehmen da habe ich so ein pushell drüber ja hab ich hab ich hab ich komplettim stream installiert gibt es im archiv wie gesagt die samsung endurance karten sindrichtig nice 15 19 prozent auf was was soll ich beim saturn kaufen ich glaube ich habedie letzten 15 jahre nix beim saturn gekauft hatten wir schon ja pains jam da kommt ehnix gescheites bei raus next cloud ist ehrlich gesagt also ich weiß nicht warum die insbusiness wollen die sind noch nicht mal komplett stable genug und und feature mäßig gut fürein heim gebrauch was wollen die im enterprise umfeld jawas mit der kirby musik los jetzt übertreiben sie es aber ja das das habe ich also das könnteman machen aber die sache ist die ich brauche keine ps5 was nehmen wenn nicht next oderon cloud erst wie gesagt es kommt darauf an was du haben willst habe ich ja gerade schongesagt wenn du nur sync willst gibt es genug wenn du kalender willst gibt es auch was wenndu diese ganzen anderen halbfertigen apps willst ja dann musst du next cloud verwendenda kannst du alle für nehmen die brauchen nicht viel aber payo lohnt sich nicht mehrso wahnsinnig twitch block da gar nicht mehr richtig also gar nicht mehr und mit youtubehatte auch probleme aber youtube soll wohl angeblich mittlerweile wieder halbwegs funktionierenaber twitch kannst vergessen deswegen lohnt sich das meiner weile noch nicht mehr weilamazon langsam im updaten ist also das ist tatsächlich technik sachen sind bei mir tatsächlichultra aufgeräumt also die die kleinen teile da habe ich extra so ein snipe erstes snipeauf fack das war ich doch jetzt mal log in nicht alter guck mal ob es so standard istwie immer 0w alter ist immer das gleiche passwort ja jetzt schon ich habe den ganzen krempelhier drinnen von shellies bis raspberry pies led strips und sonst was da steht dann auchdabei in welchem in welchem fach das drinnen ist guck mal hier rein steht das nicht dabeigenau da stehen da auch so dinge drin wie fach 1 fach 2 wo es drin ist da ist noch nichtalles drin aber ich bin eifrig am eintragen dass mir die sache auch relativ easy findetdas ist sehr praktisch muss man echt sagen weiß man genau wo wo zeug ist sogar mit anzahlund so ja gut das kostet ja auch 300 euro oder so also das hat gefälligst hat gefälligsteine ordentliche qualität zu haben dass jetzt würdest du lieber darauf losprogrammierenoder die db ne weißt du was ich machen würde nachdem man selten abschätzen kann von anfangan was man eigentlich braucht ich würde erst mal drauf losprogrammieren allerdings ichwürde es so anfangen dass ich db migrations per script machen kann da kannst du das nachherumziehen oder aber solange du noch am programmieren bist stell einfach dein framework ein dassbei jedem programm start die datenbank neu angelegt und gesiedelt wird das ist auch auchwirklich ne ne drauf los programmieren es ist es ist meiner mein nach kaum möglich wirklichim vorfeld dass sich 100 pro die korrekte datenbank struktur zu überlegen weil man nicht genauweiß wie es wie es wird also ne das ist kein ne ne das ist das das ist das das ist daspiloten hetzer oder so von denen ich habe das da das ist quasi ein dt 770 mit halbwegsordentlichem mikrofon dran oder guck mal sogar billiger geworden moment das ist ein äußerstschlechtes foto von dem das sieht so billig aus also ich habe noch die erste version ichhabe noch die erste version mit diesen ja die da mit diesen diesen was ist das carbonlook oder so finde ich nice wobei meine ja doch genauso doch genauso sieht das aus dasrichtig huge mesh optik die neuen sehen finde ich nicht mal ganz so cool aus aber sind immernoch gute headsets nexot für backup nein würde ich nicht bei backup würde ich definitivnicht über nexot machen also für backups ist zynk an sich nur bedingt geeignet weilwenn du auf einer seite aus versehen was löscht es ist auf der anderen seite auch weg so fändees an ist dass das problem an zynk also für backup würde ich es gar nicht nehmen ichwürde das nur nehmen für wie so so in etwa backup light also sprich wenn du einfach nurdas allerwichtigste zynks so dann passwort safe und vielleicht notizen und so was daskann man machen aber so richtig großartiges backup würde ich würde ich da auf keinen falldrüber machen backup würde ich also wenn man wenn man ordentliches backup machen will gibtes da eh nur eine wirklich sinnvolle strategie für für einen gebrauch dies nicht total ausufertund die aber trotzdem doch ziemlich sicher ist unabhängig jetzt von der software man einsetztdu hast das ding einmal auf dem rechner wo du es brauchst du hast das ding einmal bei dirauf dem nass oder sagen wir mal auf der extern festplatte liegen und du hast das ding nocheinmal oft seit gesynkt das ist das ein das ist das einzige wo du dir wirklich sichersein kannst also ich würde so machen wenn ich den stink normales windows hätte und möchtemöglichst brainless das backupen da würde ich die free variante davon nehmen ich machdas mit borg backup ja aber für die für die leute den kommando teil nichts ist nimmsthier den agent free free agent agent oder irgendwie so ist das ding genau und dann backupsdu auf dein nass um netzlaufwerk und auf deinem netzlaufwerk lässt du einmal in der nachteinen backup in die cloud laufen und da kannst du dir überlegen ob du wirklich alles backupenwillst oder nur spezielle sachen also ich bin dafür in die cloud wirklich dann nur die wichtigendinge an wichtigen dinge zu backupen also sprich auf dein nass kannst du schon komplett dasbetriebssystem backup machen aber in die cloud weil es eben einfach geld kostet würde ichsagen ok da sollte man sich vielleicht noch mal angucken ob man vielleicht nicht allefotos nimmt sondern plus die wichtigsten familien fotos die man unbedingt behaltenwill oder dass man zum beispiel sein shadow play ordner mit game recordings rausnimmtweil die muss man auch nicht doppelt backupen in die cloud aber für alles was extrem wichtigist muss man das an drei orten haben nämlich auf dem rechner wo man es braucht auf nassund oft seit bergab in der cloud nur dann kannst du dir wirklich sicher sein dass nichtspassiert und ein sing sing ist genauso schlecht wie next cloud wenn es um backup geht weilwurde das jetzt gefragt ich muss gleich mal gucken weil sing ist halt für solche backupgeschichten schlecht wenn du nämlich auf der einen seite was löst ist halt auf der anderenseite auch weg sing sing kannst du für password manager und so was verwenden ja ja das ist okden solltest aber auch noch mal so gebacked haben vielleicht auf dein nass weil wie gesagtdass das sing ist schlecht als als alleiniges backup sing ist ganz gut dafür wenn du wenndie ein rechner verreckt und du brauchst hast noch auf dem anderen dann hat er läuft janicht die gefahr ich lösch aus versehen oder so das geht ja nur um es kackt jetzt ab ichhabe es direkt noch auf einem anderen aber wenn du wirklich backupen willst gibt eseigentlich nur die variante du hast einmal auf dem rechner wo du es brauchst du schiebsteinmal auf der nass und macht einmal oft seit bergab verschlüsselt wohlgemerkt ja am bestenmit wie ist das was rustic nee wie ist das wie ist das dieses cloud sing ding die erclone mein ich nicht rustic er clone mein ich genau das ist gut für oft seit backupauf cloud die unterstützen auch so ziemlich alle möglichen backends da kannst du nämlichlow brain wm verwenden auf deinem windows da musst du nämlich nichts machen das kannjeder einrichten und hast du schon mal gebacked auf dein nass und vor deinem nass kannst duper clone auf jeden x beliebigen oder fast jeden x beliebigen cloud anbieter sündenverschlüsselt wohlgemerkt was das wichtige ist cloud backup nie verschlüsselt weil wennihr wirklich meine passport txt auf dem desktop habt wollt ihr die nicht unverschlüsseltin der cloud haben und dann macht ihr verschlüsselt auf seit bergab erstmal erstmal die alibabacloud ich weiß ehrlich gesagt nicht was ich davon gerade die habe ich mal verwendet fürs3 storage aber die s3 das ist trotzdem nur noch relativ teuer wenn man echt terabyteweise braucht deswegen würde ich sagen oft seit ja die sind gut die sind gut solang mandie solange man die das ging früher zumindest nee das nee ach quatsch nee das ging nichtdas ging nicht das unlimited geht nicht zum mountain und deswegen hat es gesagt genauda musstest du den ihre komische software für verwenden und das fällt bei mir rausweil ich will ich will das sicher verschlüsselt haben von open source software dass ich sichersein kann der cloud anbieter hat echt keine chance da rein zu gucken das kann man natürlichauch machen das kannst du ja das geht auch du kannst ihr könnt auch ihr könnt auchwenn ihr irgendwie einen freund habt also wenn ihr wenn ihr in der echten welt nochLeute kennt ja könnt ihr auch mit dem ausmachen dass der eine raspberry pi mit festplattebei euch hinstellt und ihr eine raspberry pi mit platte bei ihm hinstellt dann müsstihr aber gucken wie macht ihr den upload und sowas alternativ was auch eine möglichkeitist wenn man wenn man oft seit auf die old school variante macht ihr könnt natürlichauch die festplatte verschlüsselt festplatte verschlüsselt das ding einmal in der wochekopieren und das irgendwie in schließfach legen oder zur oma bringen oder zu den elternbringen oder so das könnt ihr auch machen wichtig ist nur dass die festplatte nichtauch im arsch ist wenn das bei euch mal hochwasser ist oder oder oder brennt oder irgendwasdeswegen macht das ist ja grad der witz von offside backup das macht es jetzt nicht sichererwenn man eh davon ausgeht dass nichts passiert daheim ja die musik oder wird zu anstrengendgerade ja bei denen hatte ich mal was aber die sind für reines back ab ein bisschenzu teuer na guck da bezahlst du 6 euro pro terabyte das ist das ist echt ok ja aberwenn jetzt jemand sagt hey ich brauche aber 12 terabyte offside storage offside backupstorage dann kostet sie viel aber ich sag mal die meisten leute kommen mit einem terabytelocker hin wenn man jetzt nicht wirklich jeden scheiß singt oder nicht jeden scheiß scheißoffside backup also einen terabyte daten die wirklich wichtig sind die man nicht verlorenwill wo man sich den nochmal so den das dritte backup gönnt dass das offside backup gönntdie meisten leute kommen nicht über den terabyte ja wenn ihr jetzt natürlich faul seid wieich und sagt hey ihr wollt eins zu eins alles da sinken ohne euch gedanken machen zu müssenwas ihr habt ja gut dann müsste halt mehr geld ausgeben aber ein terabyte reicht dickenormalerweise wirklich dicke das heißt ganzen isos raus ganzen downloads raus ganze ganzegameplay recording videos raus was auch immer das müsst ihr nicht unbedingt offside backupdas reicht so als auf dem nass da ist weil wenn wirklich mal eure wohnung abbrennt dannglaubt mir dann sind die fortnight gameplay backups das kleinste was ihr habt wichtigist aber halt dass die sachen wo ihr echt behalten wollt dass die nochmal offside backupssind down pc gut das ist das ist zu das ist zu big brain für 90 prozent der leute okjetzt war mal weiter also wo habe ich immer ein pay hier also haben wir erstmal den viererwar der vierer kriegt die bisschen bessere mikro sd weil ich weiß gar nicht habe ichhabe ich so ein comic hat er hat er bei standardmäßig eine sd karte drin so eine nupes sd kartedas ist nur wenn man es im bundle kauft also ich krieg's mir dann richtig auf so da ister da ist keine sd karte drin exzellent gut dann wo ist es hier anschließen flop sd karterein und power on wenn ich die sd karte finde hier zack raspberry pi netz teil auspackenund dann machen wir das ding mal an so leute ich muss mal kurz das kabel rein stecken dasswir uns gleich habe ich vergessen habe ich ssh angemacht leute habe ich ssh angemachtich glaube nicht oder ok dann muss ich die sd karte noch mal rein machen kacquade sd kartenoch mal rein machen was haben wir hier sdb mount touch ssh so also ssh ansonsten kannich mich nämlich nicht einloggen huppst an mounten sollte ich vielleicht noch sonst kannich mich nämlich nicht einloggen über ssh auf dem raspberry pi das sackt ziemlich sozack sd karte rein ich guck gleich chat weiter sd karte rein netz teil warum sind eigentlichbei kabeln die verpackt sind immer so komische so komische das sind ja keine richtigen kabelbinderso so dinger drum gewickelt die man immer erst raus fuddeln muss gut strom so ich stöpselmal ein machen netzwerkabel dransosososososososososo ich hab die steckdosenleiste die billy china steckdosenleiste runter geschmissenda hängen natürlich zig kabel dran die werden jetzt auch alle fast vom schreibtisch wiederdie geräte runter gefallen top so so raspberry pi geht an loggen wir uns mal drauf einne mach ich net ich guck im dhcpso mit den diet pi ausprobiert was war das nochmal das war dieses dieses special betriebssystemmit mit mit vorkonfigurierten sachen ne hab ich nicht ausprobiert wüsste ich jetzt auchnicht wozu ich das brauchegartenstelles video habe ich schon aufgenommen vor zwei wochenso mal gucken wie schnell die ist ob das jetzt halbwegs funktioniert das war das nicht dasmit vorkonfigurierten sachen wo ich wo ich die die die daseinsberechtigung nicht so ganzentstanden habe verstanden habe warum soll man also was wusste sinne davon also was brauchemanschule optimisern gut das ist das das ist das normale auch simple interface ja dann braucheich netne seh ich für mich den vorteil jetzt nicht drin ehrlich gesagt was kann das tolles wofürja heute schneestell geiler aber ich habe kein bock das noch soll ich jetzt nicht damüsste ich jetzt das video jedes mal neu aufnehmen wenn ein bisschen mehr schnee fälltdas ist ja auch nicht den zweck der sache welche virtual maschinen wäre zu empfehlenwenn man nicht viel machen vor der workstation ist das beste auf dem desktopansonsten wenn du gar kein geld ausgeben willst nimm halt virtual box andere möglichkeithast du unter windows ja nichtja doch hyper wie aber das auf dem desktop ist tolle kacke weightoh das ist die sd karte ist wahnsinnig poggers geschwindwobei das liegt gerade am download das liegt nicht an der sd kartees gibt forever nicht free es gibt virtual box freees gab mal den alten forever player gab es free alternative du kaufst dir bei irgendeinemkey shop einen key für einen apple und ein eiaber auf dem desktop ohne scheiß finde ich am bestenirgendwas was virtual box nicht kann was man braucht weiß ich aus dem steg greift nichtaber die frage kommt öfters wir haben schon öfters nachgeguckt und ja es gibt einigedinger snapshots kannst du auf jeden fall auchmachen ich weiß es aber aus dem steg greift nichtmehr ne ne ne vor allem bei workstation 16 prokein player es gibt den player der was kostet es gibt denkostenlosen player alter das ist ja wahnsinnig geschwindauf auf gib gas so jetzt jetzt ich bin mal gespannt ichhabe hier nämlich so nen adapter von der weile gekauft usb 2,5 gzwar der da ist er gab es mal gab es mal billig bei amazonden hatte ich mal bestellt er war mal in irgendeinem sale drinne für 35 oder so habe ich mitbestellt ich bin mal gespannt ob der auf dem raspberrypie überhaupt geht ich mein 2,5 g kriegen wir nicht drüberich frage mich ob der überhaupt link erkennt da drankeine keys schicken im chat wird jetzt gelöschtvielleicht hast du es gesehen dann guck rein aber ansonsten nichtals monka toss ihr könnt euch die keys besorgen wo ihr wolltist mir vollkommen wurscht aber dann im chat postenweil weil man weiß ja niealso ich habe mein key hier gekauft das schwankte mal der preis ein bisschensoftware kong ultra vertrauenswürdiger shopelix critical information das ist wahrscheinlich bisschen so was wie pc fritz oder sohast du dein key mal geguggelt nö dann weiß google ja bald keyne kann durchaus sein vielleicht haben die mir auch von github was verkauft kein schimmerdas kann ja sein software kong haben die haben die haben den impressumhaben den impressumivan ivan kresic kresic alles klar software kongok die sind aber legit sonst hätten die kein universal schlichtungs stelle.dealles klar ja die sind schon die sind legit aber klingt halt erst mal nicht so softwarekongdu kannst mmoga also g2a habe ich schlechte erfahrungen gemacht mit windows keys da habeich mal einen geholt vor einer weile also jahre her aber ging dann nichtja aber zum thema backup also die hier kann man echt empfehlen wenn ihr wenn ihr nichtviel speicher braucht und 6 euro für terabyte schon vollkommen in ordnung ihr könnt esauch als s3 mountain was das ganze sachen noch einfacher macht also während er jetztupdate kommt noch mal kurz chat fertig was für ein teil tts ist es text to speech nedas wäre tts tss next gen weke platforms engineer klingt poggers ja was neben habeich doch gesagt also kommt darauf an was du machen willst wenn du nur so machen willstnimm sing sing oder nimm sie feil oder was es da noch gibt muss google einfach mal wases für sing geschichten gibt es jede menge open source dinger die allemal besser sindals next cloud next cloud also ich finde next cloud lohnt sich wirklich nur wenn man entwederdie basic kombination braucht also aus sing und web interface und kontakte kalender undsowas wenn man wirklich dieses gesamtpaket braucht allerdings darüber hinaus gehen dannauch nichts weiter weil die zusatzapps sind halt in der regel unfertig und ziemlich crapich meine man darf nicht vergessen die notizapp vor next cloud hatte glaube ich bis zur letztenversion noch nicht mal eine suche das sagt glaube ich alles wenn der notizapp keine suchehat bis vor einer version ernsthaft ja gut wie gesagt menschenrechte sind in china ehnicht so groß so hoch angesehen kein wunder dass jetzt hier plus plus machen aber wegender sd card ja gut kann man machen aber wie gesagt die samsung endurance sd ssd kartenmikro sd karten sind echt sind echt nice und man die jetzt kauft ja ja gut ublog kannstdu aber nur verwenden wenn du einen browser hast also die meisten leute die phol verwendenoder phol hört sich in beiden aussprachen nicht richtig an die das verwenden die wollenes ja meistens auch unter anderem um ios apps werbung zu blocken und so und das geht nichtmehr dafür war das richtig gut geht aber nicht mehr ok die käumen muss ich mir gerade echtauf den sack ich muss mal kurz was anderes machen was gut was kann ich stehen gebliebensind acht chat es macht hier immer noch nicht fertig ok die sd karte ist echt nicht schnellja dafür ist es echt gut auf normalen seiten funktioniert es auch meine sache mein alsodas problem was ich habe ist mit ich hätte am liebsten dass es auf youtube und twitchdas auch noch gut macht und da ist es halt das sind die mittlerweile hinterher und dendns blocker kann auch nichts dagegen machen wenn der content und die werbung von den gleichenservan kommen ich setze keine cookiesalso sie musste das glaube ich auch nur machen wenn es personalisierte sachen enthält einschließenund 24 sieben vom rechner hocken easy und hoodie aufziehen nicht vergessenich habe alle daten auf dem nas außer games greife einfach auf die netzlaufwerke zu jakann man machen kann man gibt es verschiedene ja also verschiedene taktiken ja also ichfinde beispielsweise nicht so toll die daily sachen auf nass liegen zu haben einfach weildie zugriffszeiten uns schon unterschied ist ob es lokal ist oder lokale ssd oder übersnass gehen muss und gerade für gameplay recordings hatte ich probleme gehabt weil das auf übersnass teilweise zwischendurch fremdrops hatte weiß auch nicht so genau warum vielleichtweil er seine sind das patch mb die sekunde oder so nicht recht los geworden ist so hater jetzt abgreif gemacht ok rebooten wir installieren erst noch mal so die standards sachen dieman immer braucht kann man nicht viel falsch machen so mal kurz durch scrollen stonks leutehier wieder am start seit gamestop seit gamestop sind auch alle gamer big stonks menschen gewordenhabe ich den eindruck ich weiß nicht wovon ihr es habt aber view frontend dotnet backendist big brain ist meine absolute lieblingskombination das kannst du nicht es sei denn du findestirgendwas wie wasabi was du direkt mounten kannst bei dir im fallsystem ja wie gesagtmassive big brain setup also das ist das ich meine das habt ihr im prinzip auch nur gemachtweil es geht nicht weil das irgendwie dafür also nicht weil es irgendwie für oft seitbackup erforderlich wäre ihr wolltet gucken wie es geht und habt gemacht brauchen tutman das ja nicht ich muss euch ehrlich sagen ich habe noch kein bgp über vpn oder irgendwasjemals gemacht ich weiß was es ist ich weiß übrigens gar nicht nach welchem schema soautonome system nummern überhaupt aufgebaut sind hat mich auch bisher nicht großartiginteressiert für für private anwendung ich installiere aktuell linux drauf auf beidendass ich morgen meine neuen switcher testen kann das war es eigentlich dann mal morgenweiter ich kann jetzt nur mal schnell den chat durch ne ne wie gesagt workstation prowelche transfer rate hast du das haben wir mal ausprobiert vor einer weile ich weißes nicht mal wie viel zwar wenn ihr wollt können wir das noch mal ausprobieren ichmeine ich habe eine ich habe ich habe zwei ssd hier liegen und irgendwo habe ich auchmein ssd adapter können wir noch mal ausprobieren wenn ihr wollt es ist es ist nicht wahnsinnighoch halt das was man über usb 3.0 so drüber kriegt also wie viel das war kann man gleichmal ausprobieren schreibe ich mir auf pass of exile ich muss erstmal die league wiederspielen ich hatte überhaupt nicht großartig bock und auch nicht großartig zeit die letztleagues zu spielen ja die liefern sich so ein bisschen ist bettel stimmt warum eigentlichnicht ich glaube habe ich ausgeschaltet wegen wegen was auch immer wegen wegen letztensirgendwas habe ich letztens gemacht wo ich darkmode ausgeschaltet habe gibt es irgendeinetotale oder eine art anlagen für für totnet und vue js also nee aber eigentlich hängendie zwei sachen gar nicht so großartig miteinander zusammen also es ist es ist es ziemlich egalin was sein backend was sein frontend ist also das eine hat mit dem anderen nichts zu tunich meine du könntest das backend austauschen und die gleich das gleiche frontend verwendenalso du musst ja nichts spezielles machen in dort net und dass du view verwenden kannstund umgedreht ich mache wie gesagt du machst das unabhängig voneinander ok progress dieaktuelle league ist nice ich habe ehrlich gesagt gar nicht gar nicht mitgekriegt ichhabe den ankündigung trailer gesehen mit irgendwie dem neuen endboss und das war esich habe absolut kein kein schimmer ist sie vielleicht gut für ein fau server um daraufbackups speichern zu können sie fallen für oft sein irgendwie weiß ich nicht ob das soeine gute idee ist gehen mit ein paar tricks wird es bestimmt aber wenn du backups speichernwillst würde ich das nicht über sie feil zünden sondern ich würde erstmal lokal beidir irgendwie auf nass und von dort nächtlich dann auf den server ist glaube ich die besserevariante wie würdest du eine boomer docker und kupan etis erklären gar nicht wenn dertyp keinen plastenschimmer von der technik ist es unglaublich schwierig das zu erkläreneine erklärung finde ich nicht gut die leute sagen immer container sind wie vms aber dochnicht was er was erst mal alle verwirrt dazu kommt dass container mit vms gar nichts zutun haben container ist ein sandbox prozess das versteht auch jeder mit ein bisschen technikknow-how und erkennt sofort den unterschied zu einer vm leonis container sind prozesssandbox prozesse und kupan etis ist ein orchestrator für eben sandbox prozesse für leonis containerich meine was man was man immer als beispiel bringen kann ist was weiß ich wenn du deinehardware besser auslasten willst oder oder auch wenn es in der cloud macht wenn du vielleichtweniger bezahlen willst und du lauscht irgendwas es greifen 200 leute am tag drauf zu irgendeingroßer youtube channel macht mal ein video drüber und auf einmal greifen 5000 leutein der stunde oder so drauf zu und dann ist natürlich cool wenn du deine anwendung relativeasy skalieren kannst dafür ist was wie kupan etis super aber und das darf man nicht verschweigendas alleine macht die skaliert die anwendung immer noch nicht also sprich die anwendungmuss auch so gebaut sein dass die ordentlich skaliert diagonal natürlich also über horizontalund vertikal skalieren sind wir schon raus wenn wir skalieren allgemein nur noch diagonalne seafile habe ich mir nicht anguckt soll ich das mal machen können ich machen wo habeich es denn hier streamideen so seafile exzellent so das haben wir geupdatet reboot bam wo istwo ist meine usb netzwerkarte meint ihr der raspberry pi hat da überhaupt treiber fürso ein ding das ist doch schon ein bisschen was schnelles ein bisschen was speziellesnicht schnelles schnelles auch wenn es geht spezielles was ist da was ist da für chipdrin sieht man das weil das eigentlich egal ist wenn es über usb geht schauen wir malgucken wir mal ob es funktioniert stimmt das in usb netzwerkern braucht ja gar kein speziellesso schauen wir mal so erst mal erst mal ssh copy id jawoll muss ich den chat hier obenlassen sonst weiß ich nicht wo stehen geblieben bin jetzt können wir uns einloggen ohne passportsehr gut so da ist es und ich muss mal kurz schauen wir mal in dem mess konnte man daeigentlich auch so was wie f machen oder so folgen geht das das geht ja wahrscheinlichnetter aber gibt es nix eingebautes wäre cool wenn es das geht aber das minus weh ich wusstedoch dass das irgendwie ging genau exzellent exzellent siehst du das sieht man mal wiederwarum mein chat der einzig wahre die leute sind mittlerweile so big brain durch die ganzensubs dass ich eigentlich gar nichts mehr wissen muss ich muss einfach was sagen und der chatweiß es 500 IQ chat ja so und schließen wir das mal an und gucken gut das hat jetzt vielleichtden falschen anscheinend erweckt weil das hat jetzt den anscheinend erweckt als habeich jemals irgendwas gewusst ich mache jetzt schon immer stream ohne ahnung zu haben soalso ich stöpsel das mal an mal gucken ob er das jetzt erkennt register oder wird aberganz schön heiß wie switch zu zwischen windows und linux control windows taste links undrechts feil du kannst nämlich unter windows verschiedene desktops machen ich glaube daskennst du wahrscheinlich das gab es also jeder hat schon mal gefragt was macht der knopfda unten ganz verschiedene desktops machen und mit control windows und feiltasten kannstdu dazwischen switchen und hier habe ich einfach eine vm offen auf dem zweiten desktop alsosprich ich switch einfach die desktops und auf dem zweiten desktop ist die vm offen wasfür mich die deutlich bessere variante ist als dual boot und auch die bessere kombinationals umgedreht windows unter linux weil linux unter windows läuft einfach 1000 mal besserals windows unter linux so ähm wo habe ich das netzwerk kabel ich war netzwerk kabelja exzellent exzellent netzwerk kabel mal kurz gucken das ist das da liegt so da liegtnämlich eine ikea tasche drauf auf dem netzwerk kabel mit ähm allen kabels drinnen guckendass ich das jetzt rausgezogen bekomme ja ja komm komm her komm her auf jawohl sehrgut ups fuck ich bin angeblieben warte mal ich mache mal das headset ab ich stöpselmal an gucken ob das zünkt hey oh oh das ist nicht gut leute da stimmt was net das istich habe mal wieder rausgezogen ok das ist definitiv nicht normal das ist definitiv nichtnormal was das zünkt was zum da crash der netzwerk treiber oderirgendetwas der fährt sich die ganze zeit hoch und runter aber guck mal der holt sichdie ich leute ich trau dem frieden nicht ich trau dem frieden nicht das stimmt doch wasnicht so ich ziehe jetzt ich ziehe jetzt mal die eigentliche netzwerk karte raus undich wette dann bricht ab auch hier unten hier sind wir eigentlich über die zweite netzwerkkarte verbunden hier unten aber ich wette es bricht ab auch wenn ich die ja ich binnämlich ich bin nämlich nicht wirklich über die über die zweite netzwerk karte drin dochbin ich moment also das ist doch definitiv nicht richtig was passiert hier eigentlichgerade eiperf ich habe keine gegenstelle zum eiperfen eigentlich alles gut ich habe keinegescheite gegenstelle zum eiper doch habe ich mein nass mein nass nee ich wollte irgendwasich wollte irgendwas mit 10g haben meine vm macht ja maximal 1g wobei wartet mal wartetmal die vm ist 1g aber wir könnten mal nass probieren wir testen es erstmal sodas leckt aber es fack ok netzwerk demask spamwir googeln mal danach spam spam login ist das log Leute wir sind nicht wir sind nichtdie einzigen das problem haben f für 30 millisekunden ja manually compiling instantiich wusste ernst ihr wollt doch nicht dass ich wirklich im netzwerk treiber da jetztkompilier für oder das kann doch nicht euer ernst sein ok das ist ubuntu aber das istbei bei dem jahren bestimmt genauso ok ich kompiliere den treiber aber jetzt wir machenerstmal ein eiper habe ich hier bei mir übrigens lokal auch drauf muss mal gucken ich habeden usb netzwerk adapter 2,5 gigabit usb netzwerk adapter der irgendwie nicht so ganz funktioniertdas spammt ja als fack aller ok wie war das jetzt eiperf esich kann mir das immer nicht merken genau minus s und jetzt war das eiperf minus c washabe ich hier für eine ip liegt leute wie der ip liegt war das so ok ok also der treiberfunktioniert muss jetzt mal aufpassen dass ich nix leakeoh shit ich hab mein key nicht da drauf ach nee das ist ja auch max please ha bäm eiperfalso über 10 g in anfüllung strichen das hat selbst zu wenig pc express performancekein quake warum geht das nicht ihr habt recht leute ihr habt natürlich recht der chat weißwieder bescheid ich sag doch 500 iq chat warum ist das schlechter alter warum ist das aufdem c warum ist das auf der kiste mit 10 g schlechter keck weight was hatte das dingist aber für der ip keck weight aber retry alter oh was da kaputt aber umgedreht nichtoder aber ihr habt ihr habt ihr den namen von der kiste gesehen da freut sich der chatbestimmt ok wir testen noch mal wir testen noch mal den speed zwischenconnect ja gut da ist volle pulle also sofern es halt vor der vm geht stimmt minus er hastrecht habe ich ganz vergessen ja das geht auch von windows aus kann man übrigens nichtgenau ausprobieren weil die iperf implementierung von windows kaputt istpass mal auf iperf implementierung von windows ist kaputt ach so ja lull die hat trotzdemkeine 10 g anbindung hier ja ich habe ich habe nichts anderes auszuprobieren also könntemeine 4 he kiste starten mit den zwei 10 g karten drin aber das muss jetzt nicht mussjetzt nicht sein ich könnte höchstens die 10 g netzwerk karte von meinem desktop malkurz anschließen aber dann bricht wahrscheinlich das stream ab weil er wieder nicht checkt wassache ist ok also das schauen wir uns mal wieder aus also die netzwerk karte glaubeich können wir schon mal sagen die funktioniert prinzipiell aber die hat so ein paar problememit empfangen könnte auch das usb vom raspberry seindas wird ja immer mehr sagt man wird das mehr wenn man was überträgt moment cake waitwird das mehr wenn man was überträgt nicht wirklich oder probiert auch mal die usb kartendirekt an einem rechner zum nass oder ist eine gute idee wir können usb wir könnendie usb netzwerk karte mal durchreichen an die vm das könnten wir tatsächlich mal probierenoder was machen wir jetzt mal gucken mal gucken was dann was das das probieren wir mal ausmal gucken was passiert ich gehe mal kurz hier was war vom pai raus und macht mal einrechner dran ist das ein usb port nee moment ich brauche usb 3 port das ist 2 0 das ist3 0 glaube es passt nicht ein haus sonst kackt das stream wahrscheinlich ab an die vm hoffentlichcheckt er das wenn man das direkt bei durch pest an die an die vm hat irgendwas erkanntrename usb ja da erkannt passt und der spam gar nicht kommt mal ich habe hier den aktuellentreiber hier passt das was für ein switch router wird getestet einen mikrotik 8 port2 10 g also 8 1 g 2 10 g und 4 port 10 g so usb wo ist die usb netzwerk karte das daist das die usb netzwerk karte von der benahmung her wird es die einzig sinnvolle wahrscheinlichne also if konfig minus i boah das habe ich schon lange nicht mehr gemacht haben wir hierzwei punkts keck weight was ist ein freie 87 bestimmt ab ne ach fuck wie ging das nochmal so alles klar if konfig weiß aus dem kopf wenigstens halbwegs ok alles klar so dannprobieren wir das ganze mal zum nass er hat jetzt probleme mit der netzwerk karte oderwas wartet mal wie hieß dieses kack ding noch mal ok da hat echt problem mit der netzwerkkarte jetzt muss ich ihm bloß noch sagen dass er diese netzwerk karte verwenden soll daist wahrscheinlich das beste ich mache einfach temporär die netzwerk karte mal aus das glaubeich deutlich einfacher kann man den man kann ich kann ihn einfach disabel ich kann jetzteinfach disabel im netfuck manager so ist jetzt weg jawoll excellent up ping ah ja sehrgut so jetzt sind wir sind wir drauf 231 alles klar ja das sieht auch schon moment las login 87 alles klar iperf dings minus c ja ok das sieht jetzt schon ein bisschen besseraus ich meine sind nicht wirklich 2,5 muss ne 2,5 sind nicht aber man sieht auf jedenfall es ist mehr als eins das ergibt dann das ergibt schon sinn wie ging das minusminus er zum umdrehen das stimmt irgendwas nett das hat irgendwieein bisschen probleme mit senden kann das sein das kann ich sein das ergibt keinensinn warum sollte so probleme mit senden haben genau den chillfreak egal wir kompilierenuns jetzt den netzwerk treiber für für die respiratory pie ich ziehe das erstmal wiederraus hier wagen die netfucking an ja ist er weg ok alles klar er ist das ha was hat denner wieder spend ok wir wissen ernsthaft den netzwerk treiber sebex hast du das teil alsowenn du das gleiche problem macht dann sagt wahrscheinlich einfach nur hardcore das teilok linux treiber hier realtek die realtek website sieht ja immer so super vertrauenserweckendaus ja ok mac os mac os linux wo ist linux da download der massive firmware problemedann brauchen wir mal den hier download kann man das kann man das direkt was realtek seidhier noch bei sin ja moment was zum skr k x dark patterns alda hierwunderbar wenn ich jetzt schnell bin kann ich vielleicht den download link cram unddirekt hier reinhauen jetzt die frage ist das ist das da dabei48 k was ist denn da gz ok das ist anscheinend echt ok bundeship ist es nicht da xf zvja was weiß ich denn das ist dasta einfach nur in ta ta x tracked 8moment der hat das hat er das jetztder hat das vorher schon extrakt oder wasso da ist er der realtek treiber so jetzt hat sich die preisfrage wie geht das ich mussbestimmt erstmal bild essential installieren sonst wird es wahrscheinlich auf jeden fallnicht funktionieren weil wir brauchen bild essential ist schon installiert ok gibt esda einen guide zu read me wer liest wer liest denn read me in 2020 read read me also wasmuss man if you want support s5 wollwupp z wir haben dafür bringen sie maut ich bin gerade über mein headset gerollt jetztauf der einen seite nicht mal nur wartet malso alles gut exzellent exzellent okay also was was wollen was wollen die vonmir also wir brauchen kein break on lan fedora vor ubuntu na wir haben wir habenja keine ubuntu wir haben den raspberry pie in debian aber okay das ist einexample muss man einfach einen make machen jetzt einfach einen make da drinoder waswas zumwir kompilieren hier make modules haben hier eine ordentliche anleitung für drinnenmake modules okay das funktioniert auf raspberry pie anscheinend nichtich bräuchte kann hätte installieren oder ich muss kein sudo make install machenweil make install kann ich erst mal wenn er was kompiliert hat install ich mussbestimmt können hätte das oder so installieren könnte ich mir vorstellenweil der sagte er findet irgendwie keine er sagt er guckt hier nach lip modulesirgendwas und da ist nixerst mal ein bisschen wasser das könnte man vielleicht mal die read mereinschreiben ein bisschen besser was man machen mussspari pie compile realtech driver okaymk dja linux herr das habe ich doch gesagt genauOkay, okay, wir gucken wir gucken einfach malAller der spammt ganz schön rum neAch so ich habe gar kein t-max darauf auf jetzt installieren wir machen wir hinneOh hier wirds big brain jetzt gleich nochalter raspberry pi come on wo ist das problemZeig mal her wo ist das problemAh ja exellent exellent okay so make ha sieht besser aus leute sehr gut es kompiliertund wir wissen ja alle wenn es kompiliert dann funktioniert es auchsehr schön so und jetzt was muss man jetzt danach machen und der mod minusach nee after installing okay hoffe ich einfach mal okay nice wir machen das einfach mal wie es in der readme stehtja cheat 95 mir bleibt gar nichts anderes übrig weil guck mal meine netzwerkkarte spammt ein bisschenund was muss noch den da machen boot image okay und jetzt reboot ich mal und dannMist ich bin ein kack noob ich hätte habe ich noch drinne war habe ich noch die ausgabebeträchtige mod probe mal gucken ob das reicht aber wahrscheinlich muss ich den alten unloaden okay wirrebooten mal das hat nixso und jetzt mal gucken ob das jetzt weg ist ich muss den alten treiber bestimmt noch bestimmt nochblacklist oder irgendwie sowas was er wie ist das ding warum nichtsoIrgendwas drinFuckWo ist dennIch war doch mal wie heißt das andere die aber wenn ich den jetzt unloade dann habe ich keine netzwerkverbindung. JaWas ziemlich sagt aber dann mache ich einfach das kabel wie den respiree pysaps reinJa gut dann machen wir es malDas ding wird heiß alle leuteWhatthefIch krieg das kabel noch mal rausDas netzwerkkabel geht nicht mehr rausDas ist fest geschmolzen oder so keine ahnungWas dasDas muss ja nicht raus reißenmonka esWas das für ein kramFest gelötWas hatten wir für eine lp die daAh ja sehr gut sehr gutWie ist das dingOhWie soll das jetzt funktionieren erKein schimmer alterIst das so okayEr ist in use ja klar aber ich könnte ich ja doch können genau ich kann es einfach abmachen wir hoffen dass es dannTja anscheinend braucht man das auch für das normale zeug das funktioniert schon mal netDas kann durchaus sein dass die internen usb hängtWas wie ist das ding jetzt noch mal was ich da hab 5 2Der sollte das aber eigentlichGenau das gleiche problem habe ich auch genau das gleiche problem habe ich auch kann man hier mit minus v oder irgendwie sowas machenDer lautet das nichtWas muss ich machen leute sagt mir forum pleaseSchreibt einfach was ich machen mussAls ernsthaft diese scheiß forums antworten immer so weißt ihr so nach dem motto es geht nichtJa aber leute wo ist denn überhaupt der sinn warum möchte man sowas denn machenKönnen wir das mal erklären ist doch komplett used das warum willst du sowas denn machen geile forums antwort immer alter diese spazten im forumWie hat er den kram denn jetzt überhaupt hingekriegt dass er den scheiß lädtWie hat er das dann hingekriegt wie hat er das dann hingekriegt dass er das lädtWie hat er das dann hingekriegt wie hat er das dann hingekriegtGeiler tipp exzellent exzellent genau das das ist das warum ich 2,5g gekauft habeAlso eigentlich müsste das eigentlich müsste das damit schon gehen weil damit müsste das beim booten laden so macht er aber nichtAlso eigentlich müsste das damit schon gehen weil damit sollte das beim booten laden weil damit sollte das beim booten ladenKein plan was sie von mir wollenDas sagt das sagt gar nichts ist lustigerweise ist nicht geladen und bei einer mod probe sagt es danach auch nichtsObwohl es keine fehler gibt witzigerweiseWas ist das problem ich fürchte das wird immer gebackenOk was macht der du make bla bla bla sudo mod probe das funktioniert bei dem auchDas haben wir auch schon gemachtWas minus groß war auch minus groß ich weiß nicht wo der Unterschied ist aberDas ist wie gesagt das mit den placklisten habe ich mir auch schon gedacht wo ging das noch mal etc modules das muss das muss dochIrgendwie anders funktioniert ich will nicht den einen geboten ich will den anderen verwendenJa genau ok forum zeichnet was sinnvollesIch meine letztendlich die adapter funktioniert ja prinzipiell aberJa wie geht das genau wie geht das erzählst erzählts mir das haben wir alles gemacht cloneJa das haben wir alles gemacht haben wir auch gemachtOk das probiere ich jetzt mal aus wo haben wir das denn hier drinJa also da jetzt big brain hier kommt jetzt also das ist typisch das ist typischLinux big brain geschichte also ok alles klar machen wir das daAha aha nano null weh alter nicht spiel nicht nano ich glaube es geht losWas zum was wie jetzt ok mache ich ich macht es ohne scheiß ich weiß gar nicht wo es los gehtWo geht es ja los ok linux kram teilweise ok null bda und dann das hier 8156 ich hoffe mal das stimmtDas meinen die nicht ernst oderIch habe ich habe put image updaten vergessen hast du gegen nano nix jeder kann hier verwenden was erWill aber mein fall ist es nicht ja log ich ein blies raspberry pi ich muss gleich pennenIch wollte sagen dass plus ist blutet jetzt nicht mehr so jetzt wollen wir gleich gucken ob der jetzt irgendwie beim anstecken was was was neues machtImmer noch der gleiche scheiß ja gut ob das jetzt ob das jetzt reichtDas kann ja ernst sein das checkt doch keinerEs bleibt nicht mehr steckt ja auch nichts steckt ja auch nichts drinOk das muss man anscheinend so machenDas habe ich schon ok ok dann stöpseln umOk es macht jetzt gar nichts mehr das interfaceOh fuck es blinkt wieder es blinkt wieder wie verrückt monka es das ist nicht das ist nicht wegScheint hochkomplex zu sein das ganzeNe da lebt das auch gar nicht der habe ich schon habe ich doch gemachtHab ich doch schon gemachtUnd jetzt Rebooten noch mal Quatsch bringt gar nichts und ich doch eben schon malUnload jetzt ernsthaft was weiß ich wie so eine kack ding erstelleDu kannst das nicht löschen wenn das aktiv ist da braucht das andere wahrscheinlich für den für die on boardNetzwerk karte und chat hört mal auf zu backseaten mit dingern die schon vor 20 minuten ausprobiertHab so geil es nicht funktioniert ok das gar nicht irgendwas hier in der in derDings weil das kannst du nicht das kannst nicht löschen ist in use ja klar soJa aber das das witzige ist dass das ja auch nicht funktioniert aber das liegtwahrscheinlich dann weil das andere schon geladen ist ich glaube das liegtnicht am patch das funktioniert glaube ich auch soGithub Github kommt zeige ich her die Frauen Herren Agile genau hier hierBig Brain Manjaro Post die Blacklisten ne ne ich will den nichtBlacklist ich will ihn doch laden kann ich den anderen einfach Blacklist kannich den anderen einfach Blacklist wobei das ist das ist doch jetzt so eine so eineso eine art Geschichte oder ich probiere ich probiere das jetzt einfach ichBlacklist jetzt das eine und wenn es dann ne Moment Blacklist muss ich dasandere machen wie ist das andere cdc sojetzt 25 es gibt ja ist richtigwas ist das da alles wait a minute was ist das da warum ist er warum sind da sodinger drin ist aber irgendwas anderesich rieche jetzt noch mal ob das jetzt was gebracht hatwahrscheinlich nichtwahrscheinlich hat es alles nichts gebrachtin die rule muss doch das aktuelle gerät was ls usb ausgibtmoment da gibt's was das das probieren wir jetzt aus ok geht durch durch wasdas cp was macht das ding 50 das brauche ich alles klar excellentweiß zwar nicht genau was es macht das da cp nach was oder rules ok perfekt etc oderich rieche jetzt trotzdem einfach nochmal so mal gucken das könntetatsächlich sein dass es fast bringt da hätte ich mir nämlich den ganzenanderen crap sparen können im zweifelsfall sogar eher kontraproduktiv ist auf riebute ich will nicht dass es leht weil wenn es leht dann ichhabe vergessen wenn es leht dann stürzt es ab ich weiß nicht mal wie das gingmuss immer so lange warten weil ich glaube ich habe es kaputt gemacht esgeht gar nicht mehr das kriegt es kriegt kein link mehrich habe jetzt so viel plack listed ich glaube ich habe zu viel plack listedich hätte gleich die udorf rule kopieren sollender kriegt jetzt gar kein link mehrmoment ich mach mal on board ich mach mal on board wieder dran obon board wenigstens noch geht nicht dass ich on board jetzt auch plack listed habedas war 230 und noch ich habe ich habe die on board auch noch plack listedane ha ha ha okay das geht noch ich glaube das ding war einfach nichtrichtig gestartet kann das sein das kriegt kein link mehr leutesinkt das ding kriegt kein link mehr ok ich lösch den scheiß mal wieder den ichda in modules gemacht habe das war mal jetzt schnell noch und danngespennt so etc modules ne mod probe was habe ich dafür fürein crap gemacht rm gleich mal wieder so ich hoffe einfach mal die die die udorf rule funktionierttut das nochich dachte eigentlich können wir gut ich meine wir können auch ohne probleme damit morgen mal dieswitcher testen weil ganz ehrlich ob das bemt oder nicht ist doch erstmal egal wobei da aufjeden fall irgendwas nicht stimmt da verliert wahrscheinlich zwischendurch die verbindungso ok jetzt stöpseln um noch mal aus long hat jetzt irgendwas geschrieben hier vorn was wardas r8 noch was guck mal guck mal jetzt erkennt dann oder auch nicht equateok ober nicht findet ich check nicht aber ich stöpseln noch mal um und jetzt pochern pochernpochern da kriegt kein link das ist geil da baut jetzt einfach keine verbindung mehr aufist auch top ich gucke mal in meinen router rein ob der jetzt andere dhcp sich gezogen hatoder so vielleicht das ist knoam terminal dhcp 30jetzt kriegt er mit der udorf rule kriegt er kein link mehr ist ja auch geiltop ok drauf geschissen wisst ihr was leute zack zack ab damit spary pie aus können auchdie switcher morgen ohne ohne das ding testen hat mir nur gedacht das wäre cool zu gucken obdas ding auch 2,5 g kann soll ich gucke jetzt noch mal schnell chat ich habe bestimmt sichsachen übersehen halt irgendwas wichtiges übersehen habe sagt noch mal bescheid wasich muss firmware update machen rc 12 auf fack alles schlimmes ja sorry alles ab die ich übersehenhabe nice dankeschön dass ihr gesagt habt massive subscriptions wieder bin ich mir sicher ich habegerade irgendwie mein fenster verschoben ich gucke gerade noch mal schnell den haben wirdann am start hallo hat subscribt aber falle keck weight ja so sieht es aus big brain subscribtvor 54 und auch bei dir hoffentlich platzter kopf demnächst massive IQ boost danke für dieganzen subs habe ich noch was übersehen kloomstick den hatten wir schon nice tja vielleicht kriegeich das morgen hin mit dem mit dem treiber mal gucken ich habe eine power inter plattformnix besonderes low power internet plattform 80 euro fürs mainboard inklusive cpu software0.2 server 0.2 server drauf und sonst alles mögliche was ich brauche aber nix nix irgendwiekein proxmox kein unrate oder irgendwas 0.2 server drauf docker compose für ein paar sachendie sprach samba server fertig reicht das ding kriegt er eh maximal 5 g hin weil das hatzu wenig pizzi express lanes es hat zwar eine 10 g karte drinne und auch eine ssd die ordentlichwas packt aber die pizzi express lanes reichen nicht für komplettes 10g es ist quasi 5gdas kann sein ja sind einige aus dem chat dabei gewesenden besten türstopper den wir hatten waren 15.000 euro san switch ok der hat bestimmtjetzt auch keine 15.000 euro mehr gekostet als wir ihn als türstopper hatten der warnicht umsonst türstopper ok leute also jetzt mein soundtrack nicht wir sehen uns machtsgut bis dann see you", "segments": [{"id": 1, "start": 90.0, "end": 119.32, "text": "So, ich bin nochmal am Start und wisst ihr wer auch da ist?"}, {"id": 2, "start": 119.32, "end": 127.32, "text": "Der Apisolier-Champ ist auch am Start. Der liegt hier gerade rum, den brauchen wir heute bestimmt nicht, ich bin doch gerade so aufgefallen, dass der ist auch da, ja."}, {"id": 3, "start": 127.32, "end": 136.32, "text": "Vielleicht brauchen wir den morgen, aber eher nicht. Nachdem ich mir keine Netzwerkkabel selbst mache, brauchen wir das morgen wahrscheinlich auch nicht."}, {"id": 4, "start": 136.32, "end": 149.32, "text": "Aber gut, dass er mal da ist, ne. So, also, übrigens habt ihr schon gesehen, wer hätte das nur vermuten können. Also, wer, wer hätte denken können, dass das nicht erreicht wird."}, {"id": 5, "start": 149.32, "end": 164.32, "text": "Also, ganz ehrlich, ich bin echt schockiert. Ich, ich hab, ich hab wirklich gedacht, diesmal schaffen wir's, ja. Also, wer hätte damit rechnen können, kann ich gar nicht verstehen."}, {"id": 6, "start": 164.32, "end": 178.32, "text": "Es ist, es ist, glaube ich, das 14. Breitbandziel oder so, was wir nicht einhalten. Ja, by the way, Chet ratet mal, ratet mal, wie viele Breitbandziele haben wir schon, haben wir schon geschafft."}, {"id": 7, "start": 178.32, "end": 192.32, "text": "Also, pünktlich zu dem Termin, wo sie angekündigt waren. Null. Ähm, ich glaube, ich glaube, falls man das so nehmen kann."}, {"id": 8, "start": 192.32, "end": 204.32, "text": "Wir haben damals ISDN-Einführung angekündigt und geschafft. Aber ich glaube, das war's, ey. Ja, Patrick, ich hab's aber, ich hab's aber erst nachher gesehen."}, {"id": 9, "start": 204.32, "end": 214.32, "text": "Ich hab, äh, auf, ich hab Message vom Sebaro gesehen, hab ich gerade das re-tweeteste mal. Jetzt weiß ich auch, wo das Sebaro das her hatte. Kann das sein, dass ich mich ein bisschen..."}, {"id": 10, "start": 214.32, "end": 225.32, "text": "Also, es gibt zwei Möglichkeiten. Entweder ich höre besser als sonst oder ich bin lauter als sonst. Diese zwei Varianten gibt's."}, {"id": 11, "start": 225.32, "end": 235.32, "text": "Wartet mal, ich muss mal kurz so machen. Jetzt einfach so übersteuern, nicht? Okay. Ähm, ja, anscheinend bin ich lauter als sonst."}, {"id": 12, "start": 235.32, "end": 245.32, "text": "Vielleicht höre ich heute auch einfach nur besser. Das kann natürlich auch sein. Äh, nö, das passt eigentlich alles."}, {"id": 13, "start": 245.32, "end": 258.32, "text": "Haha, ja, keine Ahnung, ich, komm, ich, hört sich für mich lauter an, ja. Ja, übrigens 2030, Keque, wer glaubt, wer glaubt denn da noch dran?"}, {"id": 14, "start": 258.32, "end": 266.32, "text": "Ist das richtig dumm? Ich hab auf die OrnCustom-Firme erst mal geflasht. Jetzt höre ich, jetzt höre ich besser. Also, ich mein..."}, {"id": 15, "start": 266.32, "end": 273.32, "text": "Also, mein, erstens, erstens, es sind noch vier Jahre hin, ja, bis das vorbei ist."}, {"id": 16, "start": 273.32, "end": 283.32, "text": "Das heißt, man ist sich jetzt schon sicher, man kann, ich mein, man könnte ja versuchen, in diesen vier Jahren endlich mal, ich bin mir sicher, man kann in vier Jahren unglaublich viel erreichen."}, {"id": 17, "start": 283.32, "end": 294.32, "text": "Man guckt euch mal die Chinesen an, die in zwei Tagen irgendwie fünf Krankenhäuser bauen, um es jetzt mal übertrieben zu sein. Also, man könnte, wenn man will, bestimmt in vier Jahren, vielleicht nicht 100%,"}, {"id": 18, "start": 294.32, "end": 310.32, "text": "aber man könnte willen, demonstrieren und zeigen, guck mal, wir meinen's ernst. Und das Problem ist ja, das ist das, was ich gestern auch gesagt hab, wenn man ab, ups, wenn man abgehängt ist und man möchte,"}, {"id": 19, "start": 310.32, "end": 319.32, "text": "man möchte aufholen, dann hilft das nicht, wenn man in fünf Jahren das macht, was die anderen vor zehn Jahren gemacht haben, nein, man muss das in zwei Jahren machen, quasi."}, {"id": 20, "start": 319.32, "end": 326.32, "text": "Also, nicht was die schon gemacht haben, sondern was die anderen in fünf Jahren machen, muss man in zwei Jahren machen, sonst holt man ja nicht mehr auf."}, {"id": 21, "start": 326.32, "end": 336.32, "text": "Und das kriegen wir halt nicht gebacken und bis 2030, alter, 2030, der lebt wahrscheinlich 2000, ich weiß nicht, wie alt ist der Typ überhaupt?"}, {"id": 22, "start": 336.32, "end": 343.32, "text": "Ich hab keine, wie alt ist denn der?"}, {"id": 23, "start": 343.32, "end": 353.32, "text": "Der Typ lebt vielleicht nicht mehr 2030. Was sind das für Versprechen?"}, {"id": 24, "start": 353.32, "end": 359.32, "text": "Also, ich weiß auch nicht, also, es ist einfach Fail."}, {"id": 25, "start": 359.32, "end": 369.32, "text": "Wir müssen jetzt ein bisschen um das, auch Kirby-Wintermusik, das, das klingt gut. Siehst du, das ist ja heute, hat's bei euch auch geschneit."}, {"id": 26, "start": 369.32, "end": 379.32, "text": "Äh, das ist Secret of Mana, oder? Das ist 100% Secret of Mana-Musik. Ja, ja, hör ich sofort raus, hör ich sofort raus."}, {"id": 27, "start": 379.32, "end": 390.32, "text": "Exquisite."}, {"id": 28, "start": 390.32, "end": 394.32, "text": "Nee, das ist mir zumindest, ich, ich, ich brauch, ich brauch Big Brain Kirby-Musik."}, {"id": 29, "start": 394.32, "end": 400.32, "text": "Jawoll."}, {"id": 30, "start": 400.32, "end": 409.32, "text": "Hört sich fast ein bisschen an wie dicke Barge Volksmusik."}, {"id": 31, "start": 409.32, "end": 416.32, "text": "Okay, sehr schön."}, {"id": 32, "start": 416.32, "end": 426.32, "text": "Was übrigens, was übrigens auch der Witz ist, also, wenn das ernsthaft, wenn das ernsthaft Wahlkampfstrategie ist, dann fällt ihnen wirklich nichts mehr ein."}, {"id": 33, "start": 426.32, "end": 436.32, "text": "Weil, wie kann man ernsthaft was als Wahlkampfstrategie verkaufen, was das, was der eigene Fail der letzten Jahre nochmal besonders hervorhebt, ja?"}, {"id": 34, "start": 436.32, "end": 443.32, "text": "Man sollte ja eigentlich von ausgehen, Wahlkampfstrategie ist was, was einen hilft, dass man besonders gut dasteht."}, {"id": 35, "start": 443.32, "end": 451.32, "text": "Aber wenn die das jetzt sagen, dann gestehen sie sich ein, ich meine, die waren in der Regierung die letzten, frag mich nicht, 12 Jahre oder so."}, {"id": 36, "start": 451.32, "end": 456.32, "text": "Irgendwann war auch mehr FDP, ich weiß nicht mal wann das war. Also ich war irgendwie 12 Jahre oder so mit in der Regierung."}, {"id": 37, "start": 456.32, "end": 465.32, "text": "Also sprich, wenn man das jetzt als Wahlkampfstrategie nimmt, dann bedeutet das ja im Endeffekt, dass sie, dass sie automatisch sagen, wir haben es selbst verschissen."}, {"id": 38, "start": 465.32, "end": 476.32, "text": "Und ich weiß nicht, ob das so eine gute Wahlkampfstrategie ist, nochmal darauf hinzuweisen, was man eben nicht geschafft hat."}, {"id": 39, "start": 476.32, "end": 485.32, "text": "Ja, das ist..."}, {"id": 40, "start": 485.32, "end": 495.32, "text": "Das war heute bei uns auch so, aber es ging, musste langsam fahren."}, {"id": 41, "start": 495.32, "end": 509.32, "text": "Okay, je nachdem, wie viel es ist, kannst du es auch nicht raus, ja klar, verstehe ich, aber so viel ist bei uns ja nie."}, {"id": 42, "start": 509.32, "end": 518.32, "text": "Ey, die Idee finde ich gar nicht so übel, die Idee finde ich gar nicht so übel, das kehrt ja mittlerweile auch in vielen Unternehmen ein."}, {"id": 43, "start": 518.32, "end": 529.32, "text": "Dass es nicht nur quasi, wie soll man sagen, Qualitäts- und Fortschrittskontrolle wie auch immer gibt für Leute, die quasi praktisch was arbeiten, sondern auch für Führungskräfte."}, {"id": 44, "start": 529.32, "end": 534.32, "text": "Das ist jetzt bei uns beispielsweise auch Thema Qualität in der Führung verbessern und sowas."}, {"id": 45, "start": 534.32, "end": 543.32, "text": "Also sprich, die sind auch schon langsam aber sicher auf den Drichter gekommen, dass nur wenn da irgendwie quasi, wenn man was managt, dass man nicht das automatisch immer perfekt macht."}, {"id": 46, "start": 543.32, "end": 552.32, "text": "Also ich bin jeder Meinung, also auch quasi Manager und Führungskräfte müssen sich irgendwie an irgendwas messen lassen, ja."}, {"id": 47, "start": 552.32, "end": 557.32, "text": "Ich höre heute echt besser Leute, ich glaube mein Headset ist..."}, {"id": 48, "start": 557.32, "end": 571.32, "text": "Nee, nee, nee, wisst ihr was, ihr hört mich normal laut, aber meine Replay-Lautstärke ist glaube ich aus irgendwelchen Gründen höher als sonst."}, {"id": 49, "start": 571.32, "end": 574.32, "text": "Also danke schön für den Twitch Prime-Sub."}, {"id": 50, "start": 577.32, "end": 588.32, "text": "Warum ist meine Einspiel-Lautstärke heute höher als sonst? Das verstehe ich nicht so genau."}, {"id": 51, "start": 588.32, "end": 594.32, "text": "So, ich habe jetzt mal ein bisschen volle Pulle, volle Pulle, ein ticken leiser."}, {"id": 52, "start": 594.32, "end": 597.32, "text": "Ach was, scheiß drauf, passt schon."}, {"id": 53, "start": 597.32, "end": 603.32, "text": "Gut, also wisst ihr was wir heute machen? Wir machen heute was ganz furchtbar brain dead."}, {"id": 54, "start": 603.32, "end": 606.32, "text": "Ich installiere mir ein paar Raspberry Pis, weil morgen kommt mein Switch."}, {"id": 55, "start": 606.32, "end": 613.32, "text": "Ich habe mir den hier bestellt und ich habe mir gedacht wir packen den mal zusammen live, also ich habe zwei Sachen, die wir morgen auspacken."}, {"id": 56, "start": 613.32, "end": 616.32, "text": "Wir packen das mal live aus, dann ist wieder Hand League angesagt."}, {"id": 57, "start": 616.32, "end": 624.32, "text": "Ich habe hier, ich meine ich habe mir nur nicht umsonst das Setup aus Tisch, Elgato Ringlight und Kamerahalterung gekauft, dass wir das nicht ab und zu auch mal verwenden, ja."}, {"id": 58, "start": 624.32, "end": 627.32, "text": "Also das Ding packen wir morgen aus, probieren es aus."}, {"id": 59, "start": 627.32, "end": 635.32, "text": "Das da und das, ähm, äh wie hieß das Ding?"}, {"id": 60, "start": 639.32, "end": 645.32, "text": "Warum kein Ubiquiti Zeug, weil das in dem Preissegment und mit diesen Features schlicht und ergreifend nicht vorhanden ist."}, {"id": 61, "start": 645.32, "end": 651.32, "text": "Ich habe einen Ubiquiti Switch mit 12 Ports, das ist aber komplett andere Preisliga."}, {"id": 62, "start": 651.32, "end": 661.32, "text": "Das Zeug hier kostet alles um 100 oder 100, unter 100 Euro und der Ubiquiti Switch kostet 500, ist leichter Unterschied, ja."}, {"id": 63, "start": 670.32, "end": 673.32, "text": "So und den da, also die zwei Sachen packen wir morgen aus."}, {"id": 64, "start": 673.32, "end": 680.32, "text": "Und wir müssen das ganze, Switches kannst du auch mit Ansible bespielen, ne, ja kann ich, aber mach ich nicht."}, {"id": 65, "start": 680.32, "end": 683.32, "text": "Ich klick da drei Sachen an und dann bleibt es für immer so."}, {"id": 66, "start": 683.32, "end": 688.32, "text": "Ich muss ja nicht am Tag 50 Switch provisionen."}, {"id": 67, "start": 692.32, "end": 697.32, "text": "Mikrotik sackt eh ein bisschen, würde mich wundern, ja würde mich auch wundern, wenn das, geht das?"}, {"id": 68, "start": 697.32, "end": 703.32, "text": "Die haben so ein bisschen Eigenheiten."}, {"id": 69, "start": 703.32, "end": 710.32, "text": "Die haben ja auch so eine komische, so ein komisches Scripting Interface, was echt gewöhnungsbedürftig ist."}, {"id": 70, "start": 710.32, "end": 719.32, "text": "Mikrotik, die, das ist glaube ich eine Polt, nee, nee, nee, Tschechen, Polen, nee, Lettland oder so, kommen die glaub her, ne?"}, {"id": 71, "start": 719.32, "end": 729.32, "text": "Lat, Latvian, was ist Latvian, Estland, Lettland, Litauen, da blick ich nicht durch, äh, Riga, ja was ist das auf Deutsch?"}, {"id": 72, "start": 729.32, "end": 731.32, "text": "Lettland, Lettland."}, {"id": 73, "start": 731.32, "end": 740.32, "text": "Genau, so, also, aber anscheinend, RouterOS Plattform, doch, das scheint zu funktionieren."}, {"id": 74, "start": 742.32, "end": 747.32, "text": "Ah, CLI Connections."}, {"id": 75, "start": 747.32, "end": 757.32, "text": "genau so also aber anscheinend router os plattform doch das scheint zu funktionieren"}, {"id": 76, "start": 757.32, "end": 763.32, "text": "CLI connections das ist jetzt an sich nicht so schlimm"}, {"id": 77, "start": 763.32, "end": 770.76, "text": "CLI connections heißt im endeffekt über SSH das ist jetzt nicht so wild"}, {"id": 78, "start": 770.76, "end": 779.4, "text": "stimmt das ist router os stimmt du hast recht"}, {"id": 79, "start": 779.4, "end": 783.76, "text": "du hast recht ja nö da nicht"}, {"id": 80, "start": 783.76, "end": 789.68, "text": "vorbei aber brauche ich eh nicht juckt mich juckt mich ehrlich gesagt überhaupt nicht"}, {"id": 81, "start": 789.68, "end": 793.88, "text": "also den hier könnte man provisionen damit den hier nicht das übrigens der unterschied"}, {"id": 82, "start": 793.88, "end": 800.08, "text": "bei mikrotik css sind reine reine switche mit switch os und also im prinzip sind das"}, {"id": 83, "start": 800.08, "end": 806.12, "text": "alles reine switche aber das ist der betriebssystem unterschied also sprich hier läuft nur switch"}, {"id": 84, "start": 806.12, "end": 810.56, "text": "os drauf das ist wirklich total basic du kannst auch keinen firewall regel oder sonst irgendwas"}, {"id": 85, "start": 810.56, "end": 815.4, "text": "machen dafür ist es deutlich einfacher finde ich zu konfigurieren für switch geschichten"}, {"id": 86, "start": 815.4, "end": 821.04, "text": "und das ist das full blown router os von mikrotik mit allen möglichen scheiß drin allerdings"}, {"id": 87, "start": 821.04, "end": 824.96, "text": "muss man auch mal ehrlich sagen die dinger sind von der cpu her nicht darauf ausgelegt"}, {"id": 88, "start": 824.96, "end": 829.32, "text": "großartig firewall regel und routing zu machen das können die das können die aber das ist"}, {"id": 89, "start": 829.32, "end": 834.04, "text": "von der cpu her wahrscheinlich in switch zeigt mal was ist es denn für eine naja gut"}, {"id": 90, "start": 834.04, "end": 841.64, "text": "ein paar ich sag mal so ein paar netze ein paar routing regeln und ein paar firewall"}, {"id": 91, "start": 841.64, "end": 845.76, "text": "regeln kann er mit der cpu auch ab also das ist jetzt kein totaler rohrkrepierer die hatten"}, {"id": 92, "start": 845.76, "end": 851.16, "text": "teilweise früher switches mit irgendwie 200 megahertz cpu die in software absolut nichts"}, {"id": 93, "start": 851.16, "end": 855.88, "text": "auf die reihe gekriegt hat mit der cpu kannst du zumindest kannst was weiß ich kannst 15"}, {"id": 94, "start": 855.88, "end": 860.04, "text": "firewall regel rein machen es geht immer noch gut auch bei ordentlich traffic aber viel"}, {"id": 95, "start": 860.04, "end": 869.08, "text": "mehr ist da nicht die bräuchte man ab upstream ne brauchen wir nicht das wird ja nämlich"}, {"id": 96, "start": 869.08, "end": 874.6, "text": "bedeuten dass ich das machen muss so und die wie gesagt den den habe ich schon hier die"}, {"id": 97, "start": 874.6, "end": 878.04, "text": "können wir theoretisch auch heute angucken aber wozu wir können morgen auch alles auf"}, {"id": 98, "start": 878.04, "end": 882.96, "text": "einem machen und den habe ich hier bestellt der kommt morgen an zumindest sagt ups das"}, {"id": 99, "start": 882.96, "end": 891.72, "text": "mit dem fortran stream das ist noch nicht sicher keck weight ich glaube also nachdem ich mir"}, {"id": 100, "start": 891.72, "end": 896.36, "text": "nachdem ich mir das letzte mal schon kobold geben musste und das eklig war fortran muss"}, {"id": 101, "start": 896.36, "end": 901.64, "text": "so echt nicht sein ja ich habe ich habe das einfach mal so gesagt das heißt ja nicht"}, {"id": 102, "start": 901.64, "end": 905.28, "text": "dass ich das machen muss was interessiert mich was interessiert mich was ich da vor"}, {"id": 103, "start": 905.28, "end": 925.48, "text": "dem monat erzählt habe das schon ordentlich bei uns was nicht so viel ja ja ich weiß man"}, {"id": 104, "start": 925.48, "end": 935.0, "text": "sieht mich in total vielen videos in manchen sogar komplett das check plus keiner nicht"}, {"id": 105, "start": 935.0, "end": 952.56, "text": "nur bei mir muss man kurz durchscrollen max agi aber ich habe es ja falsch ich habe es"}, {"id": 106, "start": 952.56, "end": 981.8, "text": "ja falsch geschrieben meiner wäre gewesen ja jetzt anzeige ist raus hier erpressungsversuch"}, {"id": 107, "start": 981.8, "end": 992.08, "text": "ja viel glück was schreibst du was schreibst du ich habe alles da drin ja ich habe alles"}, {"id": 108, "start": 992.08, "end": 1001.32, "text": "da drin wie wie ich das mache ich copy paste das man kann auch einen browser add-on verwenden"}, {"id": 109, "start": 1001.32, "end": 1008.12, "text": "nee den gab es noch nicht ich bin mir nicht sicher ob ich das machen darf ich wollte"}, {"id": 110, "start": 1008.12, "end": 1012.88, "text": "mal den twitch support fragen ob das ok ist weil ich darf natürlich mein 3ds flaschen"}, {"id": 111, "start": 1012.88, "end": 1024.96, "text": "aber ich weiß nicht ob ich das zeigen darf ja ropsee dann glhf ich habe irgendwas übersehen"}, {"id": 112, "start": 1024.96, "end": 1045.68, "text": "gerade im chat hier zeig mal ja warte ich game stop so ich glaube ich habe nichts übersehen"}, {"id": 113, "start": 1045.68, "end": 1062.04, "text": "es gibt einen browser add-on für keypass ja ja gibt es aber nutze ich aber nicht"}, {"id": 114, "start": 1062.04, "end": 1081.28, "text": "ich habe es zumindest nicht gesehen ok ich kreufe jetzt mal runter jetzt fangen wir"}, {"id": 115, "start": 1081.28, "end": 1094.8, "text": "mal an gibt es keypass fürs handy ja gibt es auch wobei ich da vorsichtig wäre prinzipiell"}, {"id": 116, "start": 1094.8, "end": 1101.48, "text": "nicht alles aufs handy sünden nur weil man sünden kann weil ich meine die meisten passwörter"}, {"id": 117, "start": 1101.48, "end": 1106.88, "text": "braucht man auf dem handy schlicht ergreifend nicht was brauchst du für passwörter auf"}, {"id": 118, "start": 1106.88, "end": 1112.16, "text": "dem handy du brauchst die youtube app was kein problem ist die merkt sich das e-intern"}, {"id": 119, "start": 1112.16, "end": 1118.92, "text": "und kann es nix dagegen machen paypal vielleicht ab und zu mal amazon merkt sich den kram auch"}, {"id": 120, "start": 1118.92, "end": 1134.0, "text": "alles in der app also für was braucht man da passwörter großartig auf dem handy ah"}, {"id": 121, "start": 1134.0, "end": 1139.76, "text": "hier link in excellent mal mal zu falls irgendwas gespeichert hat man weiß ja nie den desktop"}, {"id": 122, "start": 1139.76, "end": 1143.36, "text": "den räume ich garantiert nicht auf der beste desktop außerdem sieht der desktop ja auch"}, {"id": 123, "start": 1143.36, "end": 1150.0, "text": "nur wegen euch so aus na guck mal das sind alles irgendwelche komischen emotes die ich"}, {"id": 124, "start": 1150.0, "end": 1161.0, "text": "brauche excellent kamera produkt foto ordner wozu was mit euch los guck mal das ist viel"}, {"id": 125, "start": 1161.0, "end": 1165.6, "text": "besser so weil wenn du hier nach versuchst wenn ich am hackermann gif suchen kann ich"}, {"id": 126, "start": 1165.6, "end": 1169.56, "text": "einfach hackermann gif angeben und hab's gefunden wenn ich in ordner gehe muss ich noch unter"}, {"id": 127, "start": 1169.56, "end": 1178.4, "text": "ordner aufmachen das ist total bescheuert ordner wozu was ist der sinn von ordner"}, {"id": 128, "start": 1178.4, "end": 1185.84, "text": "foltex suche foltex suche ich mein hier habe ich gar kein desktop gibt kein brauche ich"}, {"id": 129, "start": 1185.84, "end": 1192.56, "text": "net foltex suchen gut ist nur noobs haben die benutzen folter übersichtlichkeit ne ist"}, {"id": 130, "start": 1192.56, "end": 1202.32, "text": "brauchst du nicht ja ich spiele poe aber die sie sind aber nicht gespielt um ist ein"}, {"id": 131, "start": 1202.32, "end": 1208.36, "text": "schachbrett eine gute frage ich glaube das war mal ein kameratest das war mal ein kameratest"}, {"id": 132, "start": 1208.36, "end": 1214.2, "text": "jaja ob der bewegungs ob die bewegungserkennung kommt ob das die bewegungserkennung das das"}, {"id": 133, "start": 1214.2, "end": 1226.48, "text": "checkte ordner ordner ist nur was für windows noobs also braucht man nicht komplett useless"}, {"id": 134, "start": 1226.48, "end": 1233.44, "text": "einfach einfach foltex so guck wenn ich irgendwas suche hier oh das war jetzt ohne was einzugeben"}, {"id": 135, "start": 1233.44, "end": 1245.2, "text": "ok ich suche jetzt ich suche jetzt read me am start also wozu wozu braucht man ordner"}, {"id": 136, "start": 1245.2, "end": 1251.84, "text": "es ist auch so übersichtlich genug ja monarch s read me ja meine ganze heim automatisierung"}, {"id": 137, "start": 1251.84, "end": 1261.88, "text": "kann ich nicht zeigen weil da liege ich zu viel so wir müssen mal kurz das aktuelle"}, {"id": 138, "start": 1261.88, "end": 1267.68, "text": "espion runter dann was du bringst nicht mehr espion heißt sondern raspberry pi o s light"}, {"id": 139, "start": 1267.68, "end": 1274.92, "text": "schön dass du am start bist da auf x ich hoffe das richtig ausgemacht warum ist die musik"}, {"id": 140, "start": 1274.92, "end": 1293.36, "text": "auf einmal zu laut paper please raspberry pi immer schon alles für noobs wir machen"}, {"id": 141, "start": 1293.36, "end": 1301.24, "text": "die old school variante dd ne machen wir gar nicht wir verwenden den elektronen kui was"}, {"id": 142, "start": 1301.24, "end": 1308.76, "text": "hatte ich auch nicht viel besser ist ok ich spule mal vor weil das andere ist garantiert"}, {"id": 143, "start": 1308.76, "end": 1321.96, "text": "nicht mehr so laut die können sie nicht entscheiden so download wo ist es da perfekt reicht jetzt"}, {"id": 144, "start": 1321.96, "end": 1328.2, "text": "wundere als spit ja ich habe nämlich in raspberry pi 4 und raspberry pi 3 und ich mache das"}, {"id": 145, "start": 1328.2, "end": 1333.24, "text": "auf beide drauf und danach testen wir mal ob mein 2,5 g adapter funktioniert das können"}, {"id": 146, "start": 1333.24, "end": 1338.52, "text": "wir heute ausprobieren ausprobieren der bananen lord römische zahlen also was ist das 20"}, {"id": 147, "start": 1338.52, "end": 1348.64, "text": "23 ich habe kein schimmer römische zahlen in 2021 alter hätte das mal den römern gesagt"}, {"id": 148, "start": 1348.64, "end": 1359.08, "text": "die endlich geköpft klar so römer haben keine leute geköpft die haben gerne leute mit dem"}, {"id": 149, "start": 1359.08, "end": 1365.48, "text": "sperr ersperrt dies war ja war ja human schon ja bananen lord dankeschön für den primes"}, {"id": 150, "start": 1365.48, "end": 1375.6, "text": "ab ja vu ist ripp guckt euch das mal an die haben es verschissen und ich weiß auch genau"}, {"id": 151, "start": 1375.6, "end": 1381.76, "text": "warum sie verschissen haben also meiner meiner ansicht nach warum sie verschissen haben und"}, {"id": 152, "start": 1381.76, "end": 1391.2, "text": "das ist folgendes auflockt ein die haben es verschissen gar nicht mal wegen der mod der"}, {"id": 153, "start": 1391.2, "end": 1397.28, "text": "mod ist geil das erste problem was sie haben ist kein anti cheat das ist gar nicht so ein"}, {"id": 154, "start": 1397.28, "end": 1403.6, "text": "großartiges problem das hauptsächliche problem ist keine gescheiten server der server hier"}, {"id": 155, "start": 1403.6, "end": 1410.84, "text": "ist prinzipiell nicht schlecht aber absolut keine ich kann nicht mal sagen ob es keine"}, {"id": 156, "start": 1410.84, "end": 1415.36, "text": "fähigen admins sind oder gar keine admins die da sind die da spielen weil in der regel"}, {"id": 157, "start": 1415.36, "end": 1419.28, "text": "ist das einfach nur totale zerstörung aber komplett fünf runden am stück von einer"}, {"id": 158, "start": 1419.28, "end": 1424.04, "text": "seite bis ich eventuell mal ein paar erbarmen zu switchen aber meistens verlieven die leute"}, {"id": 159, "start": 1424.04, "end": 1442.72, "text": "instantin server warum soll ich ubuntu jetzt auf einmal runterladen was ja nein nein nein"}, {"id": 160, "start": 1442.72, "end": 1453.56, "text": "nicht das da ja wunderbar und ich habe so ein bisschen die hoffnung vielleicht kriegen"}, {"id": 161, "start": 1453.56, "end": 1460.08, "text": "sie das mit dem reality projekt hin ja aber das hätten sie machen müssen ganz ehrlich"}, {"id": 162, "start": 1460.08, "end": 1465.88, "text": "du kannst nicht erwarten dass die leute sich bei einem spiel was zehn jahre oder so alt"}, {"id": 163, "start": 1465.88, "end": 1476.88, "text": "ist jetzt nicht ganz acht jahre alt neun jahre zehn jahre alt ist kannst du nicht erwarten"}, {"id": 164, "start": 1476.88, "end": 1480.36, "text": "dass die leute sich da erst noch mal ein paar monate lang weil das ist ein altes game das"}, {"id": 165, "start": 1480.36, "end": 1485.0, "text": "kennen die mit nicht richtig funktionierenden servers und komischen rules jetzt rumschlagen"}, {"id": 166, "start": 1485.0, "end": 1489.28, "text": "also meiner meinung das habe ich übrigens auch gesagt bevor das ganze released wurde"}, {"id": 167, "start": 1489.28, "end": 1494.16, "text": "wo ich wo ich gesagt habe hier daran könnte das fehlen du musst von anfang an zwei drei"}, {"id": 168, "start": 1494.16, "end": 1500.08, "text": "offizielle server stellen offizielle server gut moderiert gut amministriert sinnvolle"}, {"id": 169, "start": 1500.08, "end": 1506.0, "text": "plugins und das wichtigste konsistentes regelset also du musst im endeffekt drei server stellen"}, {"id": 170, "start": 1506.0, "end": 1516.38, "text": "die mehr oder weniger ja mehr oder weniger vanilla sind mit eben den verbesserungen wo"}, {"id": 171, "start": 1516.38, "end": 1520.36, "text": "man richtig die vorteile daran sieht also zum beispiel du kannst ruhig ein bisschen suppression"}, {"id": 172, "start": 1520.36, "end": 1525.88, "text": "weg machen du kannst sonne weg machen du kannst screen shaking weg machen du kannst auch waffen"}, {"id": 173, "start": 1525.88, "end": 1530.92, "text": "ruhig dem dem medic geben die der assault hat und sowas aber der rest das sollte relativ"}, {"id": 174, "start": 1530.92, "end": 1535.44, "text": "standard gut gebalance des battlefield 3 sein das kann vielleicht mal ab und zu eine nachtmerp"}, {"id": 175, "start": 1535.44, "end": 1539.48, "text": "laufen haben oder sowas um zu zeigen was cool ist aber die hätten eher zeigen müssen so"}, {"id": 176, "start": 1539.48, "end": 1547.44, "text": "nach dem motto mehr tickrate und kein plaufilter und keine shaking und vielleicht ne custom"}, {"id": 177, "start": 1547.44, "end": 1553.12, "text": "perk und sowas aber irgendwas irgendwas konsistent ist und was was läuft 234 vielleicht offizielle"}, {"id": 178, "start": 1553.12, "end": 1563.4, "text": "server 23 du machst du machst du kannst nen rush server machen mit 32 48 du könntest"}, {"id": 179, "start": 1563.4, "end": 1569.4, "text": "nen conquest machen und das reicht erst mal eigentlich eventuell noch für die ganzen"}, {"id": 180, "start": 1569.4, "end": 1574.64, "text": "hardcore für die ganzen basher leute noch ein tdm eventuell noch ein vierten mixed mit"}, {"id": 181, "start": 1574.64, "end": 1579.36, "text": "den besten mit dem best of oder so und man dann wollten kann conquest oder rush vielleicht"}, {"id": 182, "start": 1579.36, "end": 1585.16, "text": "sogar mit mit 70 dann aber das hätte man machen müssen das hat man das war essentiell"}, {"id": 183, "start": 1585.16, "end": 1590.28, "text": "meiner meinung nach die haben auch das problem dass das spiel aktuell die ganze zeit crash"}, {"id": 184, "start": 1590.28, "end": 1596.04, "text": "nach ein paar runden und deswegen das tut mir leid für die die haben sich sicherlich"}, {"id": 185, "start": 1596.04, "end": 1601.88, "text": "saumäßig viel mühe gegeben und das ist spielt sich besser als das original ich hab letztes"}, {"id": 186, "start": 1601.88, "end": 1604.96, "text": "mal wieder was bettel noch gespielt es hat ein paar probleme man merkt dass das spiel"}, {"id": 187, "start": 1604.96, "end": 1612.16, "text": "an vielen stellen gar nicht für 60 tickrate aus ausgelegt ist aber es spielt sich finde"}, {"id": 188, "start": 1612.16, "end": 1618.48, "text": "ich unbestreitbar besser wie das wie das wie das original gerade keine explosionen mehr"}, {"id": 189, "start": 1618.48, "end": 1626.92, "text": "und weniger suppression und über den plaufilter kann man sich jetzt streiten und auch auch"}, {"id": 190, "start": 1626.92, "end": 1631.08, "text": "auch dass ich das alles direkt anfühlt meistens wenn die hits registriert werden es ist schon"}, {"id": 191, "start": 1631.08, "end": 1639.16, "text": "cooler aber ich finde es halt immer schade wenn leute sich so viel mühe geben und dann"}, {"id": 192, "start": 1639.16, "end": 1646.12, "text": "nichts bei rauskommt weil man an so naheliegenden sachen nicht gedacht hat deswegen ich flame"}, {"id": 193, "start": 1646.12, "end": 1651.32, "text": "ja immer ein bisschen gegen stonks leute aber eins muss man sagen ohne mist wenn ihr jemand"}, {"id": 194, "start": 1651.32, "end": 1657.4, "text": "seid der technisch richtig gut ist dann ist die chance relativ hoch dass ihr kein guter"}, {"id": 195, "start": 1657.4, "end": 1665.64, "text": "stonks verkäufer seid das ist einfach so es gibt ganz wenig leute die sagen eine gute"}, {"id": 196, "start": 1665.64, "end": 1671.8, "text": "wie soll man sagen eine gute führungskraft oder so gut guter manager sind und guter techniker"}, {"id": 197, "start": 1671.8, "end": 1677.56, "text": "in einem guckt euch mal Elon Musk an zum beispiel der typ hat bestimmt technisch keine ahnung"}, {"id": 198, "start": 1677.56, "end": 1682.28, "text": "wie man raketen baut oder autos baut oder sonst was aber da trifft die entscheidung und managt"}, {"id": 199, "start": 1682.28, "end": 1688.12, "text": "die sachen ganz gut so der braucht big brain leute die die technik können es funktioniert"}, {"id": 200, "start": 1688.12, "end": 1693.08, "text": "ohne beides nicht der wäre ohne technik leute und er hat mit sicherlich einer der besten"}, {"id": 201, "start": 1693.08, "end": 1698.4, "text": "techniker paar der besten techniker auf der welt wird das ganze nicht funktionieren oder"}, {"id": 202, "start": 1698.4, "end": 1703.92, "text": "hat auch ein paar projekte wo ich mir relativ sicher bin dass sie nicht funktionieren werden"}, {"id": 203, "start": 1703.92, "end": 1707.52, "text": "aber da hat auch schon gezeigt dass er sachen wirklich gut hinkriegt tesla haben sich die"}, {"id": 204, "start": 1707.52, "end": 1712.56, "text": "leute früher kaputt gemacht kaputt funktioniert spacex haben die leute am anfang gesagt null"}, {"id": 205, "start": 1712.56, "end": 1722.52, "text": "funktioniert funktioniert da ob starlink ordentlich funktioniert und ob ob"}, {"id": 206, "start": 1722.52, "end": 1729.2, "text": "dings hier wie heißt das dieser wacke um tunnel dieser dieser wacke um tunnel ob der richtig"}, {"id": 207, "start": 1729.2, "end": 1735.2, "text": "funktioniert habe ich auch so meine zweifel er hat er hat für den manager sicherlich"}, {"id": 208, "start": 1735.2, "end": 1739.52, "text": "viel ahnung von der technik aber der könnte keine rakete bauen darum geht es heißt du"}, {"id": 209, "start": 1739.52, "end": 1745.64, "text": "brauchst immer leute die gute gute verkäufer manager entscheider leute sind und leute die"}, {"id": 210, "start": 1745.64, "end": 1752.2, "text": "gut technik können also beides in einem funktioniert nicht sehr selten sehr selten zum zumindest"}, {"id": 211, "start": 1752.2, "end": 1756.12, "text": "guckt euch die google gründer an zum beispiel mal die google gründer haben das richtig"}, {"id": 212, "start": 1756.12, "end": 1760.24, "text": "gemacht die google gründer hat ein geiles produkt haben erst mal gesagt haben erst mal"}, {"id": 213, "start": 1760.24, "end": 1765.24, "text": "gesagt sie wollen sie wollen schnelles sie wollen schnell schnell geld machen und wollten"}, {"id": 214, "start": 1765.24, "end": 1769.08, "text": "das an jahu verkaufen jahu war dumm falls du bringst ja nach jahu noch jemand kennt"}, {"id": 215, "start": 1769.08, "end": 1774.72, "text": "das war die da jahu wollte das nicht ich glaube für zwei millionen oder so ultra billig jahu"}, {"id": 216, "start": 1774.72, "end": 1780.16, "text": "hat gesagt hallo euch wollen wir nicht ok paar jahre später hätten sie das ganze noch"}, {"id": 217, "start": 1780.16, "end": 1783.24, "text": "mal kaufen können dann für ich sag jetzt mal irgendwas ich weiß den preis keiner und"}, {"id": 218, "start": 1783.24, "end": 1788.2, "text": "dann für traf 50 millionen wollten sie immer noch nicht und jetzt ist die jahu halt am"}, {"id": 219, "start": 1788.2, "end": 1794.04, "text": "arsch also sie haben erst mal versucht schnellkode zu machen gute idee gehabt techniker am start"}, {"id": 220, "start": 1794.04, "end": 1799.12, "text": "wollten das relativ günstig verkaufen jahu die wollten nicht so was die google leute"}, {"id": 221, "start": 1799.12, "end": 1804.12, "text": "richtig gemacht haben die beste entscheidung die haben realisiert ich habe vergessen wie"}, {"id": 222, "start": 1804.12, "end": 1810.0, "text": "sie heißen sehr geil irgendwas und ich weiß ich weiß nicht mehr wie die google dudes heißen"}, {"id": 223, "start": 1810.0, "end": 1814.52, "text": "ist aber auch letztendlich egal und die haben eine sache realisiert die haben realisiert"}, {"id": 224, "start": 1814.52, "end": 1822.48, "text": "sie sind gute technik leute aber keine zumindest noch nicht supergeilen stonks leute und sie"}, {"id": 225, "start": 1822.48, "end": 1828.0, "text": "haben sich damals erik schmidt hieß der typ glaube ich geholt und haben gesagt ey wir"}, {"id": 226, "start": 1828.0, "end": 1833.2, "text": "brauchen einen der managen kann und letztendlich hat der ja auch google dann zu dem gemacht"}, {"id": 227, "start": 1833.2, "end": 1837.48, "text": "was es letztendlich ist bis jetzt die google leute wieder selbst zurückgekommen sind aber"}, {"id": 228, "start": 1837.48, "end": 1845.2, "text": "die konnten quasi in dieser zeit von von einem der besten lernen und sind jetzt selbst big"}, {"id": 229, "start": 1845.2, "end": 1852.2, "text": "brain stonks management leute ok aber die wenigsten techniker sind das eben und dazu"}, {"id": 230, "start": 1852.2, "end": 1855.88, "text": "kommt es halt ich weiß gar nicht wie ich ursprünglich drauf gekommen bin also sprich wenn ihr guter"}, {"id": 231, "start": 1855.88, "end": 1859.44, "text": "techniker seid ist die chance dass ihr kein das ist die chance hoch dass ihr kein guter"}, {"id": 232, "start": 1859.44, "end": 1866.12, "text": "verkäufer manager seid und dementsprechend wenn man irgendwas machen will ist es immer"}, {"id": 233, "start": 1866.12, "end": 1875.52, "text": "gut man hat jemand dabei der stonks man ist ja wegen vu genau und deswegen das hat meiner"}, {"id": 234, "start": 1875.52, "end": 1879.76, "text": "mein auch vu gefehlt die hätten so eine art community manager gebraucht das hatte der"}, {"id": 235, "start": 1879.76, "end": 1883.08, "text": "entwickler oder der erfinder mehr oder weniger selbst mitgemacht die hätten so eine art"}, {"id": 236, "start": 1883.08, "end": 1888.04, "text": "community manager gebraucht der auch wirklich hergeht der jack frax anschreibt und irgendwelche"}, {"id": 237, "start": 1888.04, "end": 1891.68, "text": "leute ein bisschen die werbetrommel rührt und das aber und das aber halt mal ein halbes"}, {"id": 238, "start": 1891.68, "end": 1896.4, "text": "jahr vor release schon das hätte das hätte sein muss sie hätten bestimmt mitgemacht es sei denn es sei"}, {"id": 239, "start": 1896.4, "end": 1901.04, "text": "denn die haben was bei bei ea unterschrieben dass sie motz nicht zeigen bei jack frax könnte ich"}, {"id": 240, "start": 1901.04, "end": 1905.64, "text": "mir das so nee nee nicht check wie heißt der andere wer hat letzten sind video gemacht jack"}, {"id": 241, "start": 1905.64, "end": 1910.16, "text": "frax hat ein video gemacht level cap nicht umgedreht level cap hatten wie ich weiß es nicht der der"}, {"id": 242, "start": 1910.16, "end": 1914.56, "text": "kein video gemacht habt das könnte ich mir tatsächlich vorstellen ja die brauchen ja keine finanzielle"}, {"id": 243, "start": 1914.56, "end": 1921.56, "text": "mittel du findest garantiert leute guck mal wenn du wenn du freiwillig leute findet die sich da"}, {"id": 244, "start": 1921.56, "end": 1927.04, "text": "jahre lang beschäftigen du findest garantiert auch leute die spaß daran haben so ein projekt"}, {"id": 245, "start": 1927.04, "end": 1934.72, "text": "ein bisschen wie sie ein bisschen marketing technisch voranzubringen und dafür nix wollen"}, {"id": 246, "start": 1934.72, "end": 1942.4, "text": "du brauchst dir keine profi marketing agentur so und das haben wir machen müssen und sich im"}, {"id": 247, "start": 1942.4, "end": 1950.2, "text": "gleichen zuge mal überlegen müssen wie schaffen wir das dass die spieler von anfang an anfang an"}, {"id": 248, "start": 1950.2, "end": 1958.96, "text": "eine konsistentes spielerlebnis haben was ja so nicht gegeben war weil der spaß nach wir spielen"}, {"id": 249, "start": 1958.96, "end": 1965.04, "text": "unfertige mods ist halt nach zwei tagen raus und da brauchst du 234 surfer mit konsistentem rule"}, {"id": 250, "start": 1965.04, "end": 1971.8, "text": "set was funktioniert und die kannst du auch nicht einfach live patchen oder feststellen die leute"}, {"id": 251, "start": 1971.8, "end": 1977.2, "text": "das spiel kackt ab das müsstest du irgendwie verzögert machen mal ein surfer probieren wenn"}, {"id": 252, "start": 1977.2, "end": 1981.36, "text": "der zwei drei tagen läuft macht den anderen surfer wie auch immer deswegen das ist das problem es"}, {"id": 253, "start": 1981.36, "end": 1987.0, "text": "gibt bestimmt auf dieser welt unglaublich viele produkte die technisch extrem geil sind aber total"}, {"id": 254, "start": 1987.0, "end": 1990.96, "text": "untergehen weil sie keine passenden verkäufer am start haben oder keine passenden marketing"}, {"id": 255, "start": 1990.96, "end": 1996.44, "text": "stonks leute so gerne ich auf die also gerne ich so ein bisschen über marketing leute sonst was"}, {"id": 256, "start": 1996.44, "end": 2002.04, "text": "flame und die meisten sind da bei den meisten marketing leute habe ich halt auch den eindruck"}, {"id": 257, "start": 2002.04, "end": 2006.52, "text": "sie können noch nicht mal das sie sind zu nichts fähig sie sind noch nicht mal für ihren job"}, {"id": 258, "start": 2006.52, "end": 2012.16, "text": "fähig aber es gibt auch ein paar gute leute wenn du da welche findest die dann auch irgendwie zu"}, {"id": 259, "start": 2012.16, "end": 2016.76, "text": "dieser firma und sie zu dem produkt passen dann bringt das auf jeden fall was weil die techniker"}, {"id": 260, "start": 2016.76, "end": 2037.64, "text": "alleine können es einfach nicht ok wir flaschen mal nebenbei zwei raspberry pies oh leute von der"}, {"id": 261, "start": 2037.64, "end": 2045.32, "text": "sd karte habe ich ihn hier noch war das mal von der sd karte wir starten jetzt erstmal elektron"}, {"id": 262, "start": 2045.32, "end": 2050.6, "text": "ui zum flaschen was ich voller witz ist warum braucht man program mit einem mit zwei gigabyte"}, {"id": 263, "start": 2050.6, "end": 2055.96, "text": "ram um eine micro sd karte zu flaschen wir können auch die d drauf machen also was habe"}, {"id": 264, "start": 2055.96, "end": 2061.66, "text": "ich ihn hier am start ich habe noch ein paar ss ein paar micro sds also ich habe noch 20"}, {"id": 265, "start": 2061.66, "end": 2072.88, "text": "gepackt die will ich jetzt aber auspacken 16 g haben 16 g was das hier 8 g übelster billig"}, {"id": 266, "start": 2072.88, "end": 2077.92, "text": "krab 8 g und 16 g komm ich nehme die ganz billige 8 g mal gucken ob die noch funzt"}, {"id": 267, "start": 2077.92, "end": 2089.24, "text": "flaschen wir das ganze mal ob die passt überhaupt nicht mehr in den reader rein"}, {"id": 268, "start": 2089.24, "end": 2102.56, "text": "auch jetzt keg weight es ist gemounted ja"}, {"id": 269, "start": 2102.56, "end": 2113.4, "text": "flasche file downloads wo ist es"}, {"id": 270, "start": 2121.4, "end": 2130.72, "text": "flascht mal beim welche micro sd karten also wenn ich will also auf den pies die"}, {"id": 271, "start": 2130.72, "end": 2140.0, "text": "ich lange im einsatz habe verwende ich die hier weil die dinger halten dass man noch"}, {"id": 272, "start": 2140.0, "end": 2143.96, "text": "nie einer kaputt gegangen ist ein bisschen teuer aber die sind echt gut für die anderen"}, {"id": 273, "start": 2143.96, "end": 2150.32, "text": "habe ich eine mischung aus billigen was das zahn disk und kingston da sind wir aber da"}, {"id": 274, "start": 2150.32, "end": 2164.24, "text": "sind wir aber auch schon welche kaputt gegangen ich finde next next klaut mist alternativen"}, {"id": 275, "start": 2164.24, "end": 2169.8, "text": "näher kommt darauf an was du brauchst wenn du den zink willst kannst du sie feil zünke"}, {"id": 276, "start": 2169.8, "end": 2175.76, "text": "sing gibt es viele alternativen für den zink für kontakte und kalender gibt es auch eigenständige"}, {"id": 277, "start": 2175.76, "end": 2181.08, "text": "kalderf kater fast auch immer surfer oder noch andere lösungen und klaut es auch krepp"}, {"id": 278, "start": 2181.08, "end": 2192.36, "text": "aber ansonsten mache ich next dort nicht und auch nicht ich habe zwar im einsatz aber nur"}, {"id": 279, "start": 2192.36, "end": 2201.24, "text": "weil ich zu faul bin es endlich abzuschalten sie um stick kloom stick weiß nicht tritt"}, {"id": 280, "start": 2201.24, "end": 2213.72, "text": "ich bin dankeschön für den massive prime subscription ja next klaut ist gerade dabei"}, {"id": 281, "start": 2213.72, "end": 2216.92, "text": "auch klaut ist gerade dabei irgendwas zu rewriten keine ahnung wird aber ich immer noch mist"}, {"id": 282, "start": 2216.92, "end": 2226.28, "text": "scherwigs da ist das den weg hierher gefunden hast die sd karte ist aber ultra schnell das"}, {"id": 283, "start": 2226.28, "end": 2232.68, "text": "ist jetzt so eine billige kingston 8 gigabyte karte mal hoffentlich ob die ob funktioniert"}, {"id": 284, "start": 2232.68, "end": 2241.92, "text": "hast du eigentlich eine freundin ja meine ps5 lull cringe antwort cringe panes champ cringe"}, {"id": 285, "start": 2241.92, "end": 2249.8, "text": "so wo hab ich jetzt den wo hab ich jetzt die kiste am start ja super ich bin super schlau"}, {"id": 286, "start": 2249.8, "end": 2256.88, "text": "leute gewesen so war so war big brain richtig treikopf bin ich gerade ich hab ich wollte"}, {"id": 287, "start": 2256.88, "end": 2261.48, "text": "jetzt die raspberry pies flaschen aber ich hab die raspberry pies hier gar nicht hingestellt"}, {"id": 288, "start": 2261.48, "end": 2269.84, "text": "ich weiß gar nicht wo die sind"}, {"id": 289, "start": 2269.84, "end": 2277.92, "text": "next klaut arbeitet jetzt mit der telekom zusammen das macht es aber nicht besser aber die haben"}, {"id": 290, "start": 2277.92, "end": 2282.68, "text": "sich gefunden die haben sich gefunden"}, {"id": 291, "start": 2282.68, "end": 2305.44, "text": "by the way plot twist ich hab noch nicht mal eine ps5 und ich kauf mir auch keine ps5"}, {"id": 292, "start": 2305.44, "end": 2313.24, "text": "auf flash mal hin ja ich sehe auch den sinn da aktuell nicht es gibt ja nicht mal spiele"}, {"id": 293, "start": 2313.24, "end": 2318.64, "text": "für"}, {"id": 294, "start": 2318.64, "end": 2323.44, "text": "es gibt ja noch nicht mal spiele für also es lohnt sich noch nicht mal das einzige was"}, {"id": 295, "start": 2323.44, "end": 2330.24, "text": "gibt es dark souls nee demon souls remake wenn man das mag das ist aber auch alles mehr"}, {"id": 296, "start": 2330.24, "end": 2338.16, "text": "gibt es nicht"}, {"id": 297, "start": 2338.16, "end": 2341.92, "text": "laut preischen bis die ps5 nicht verfügbar das ist richtig die gibt es auch nirgendwo"}, {"id": 298, "start": 2341.92, "end": 2348.0, "text": "so leute ich muss mal kurz gucken wo ich den raspberry pie hin hab oder die zwei ich hab"}, {"id": 299, "start": 2348.0, "end": 2352.84, "text": "noch einen dreier und vierer gefunden kann ich euch mal kurz zeigen also was ich damit"}, {"id": 300, "start": 2352.84, "end": 2357.6, "text": "ausprobieren will morgen ist folgendes wie gesagt ich hab mir hier zwei switche bestellt"}, {"id": 301, "start": 2357.6, "end": 2364.04, "text": "und was wir mal ausprobieren werden ist folgendes"}, {"id": 302, "start": 2364.04, "end": 2372.28, "text": "wir testen mal morgen was das ding für module was das für module verkraftet ich hab offizielle"}, {"id": 303, "start": 2372.28, "end": 2380.72, "text": "ubiquity module ich hab direkt attach module da und nen sfp plus auf aort 45 adapter mal"}, {"id": 304, "start": 2380.72, "end": 2386.04, "text": "gucken was das alles frisst und dann gucken wir mal wie man da so wie lands und sonstige"}, {"id": 305, "start": 2386.04, "end": 2393.72, "text": "sachen in switcher erst einrichtet hab ich noch nie gemacht da reicht auch da reicht"}, {"id": 306, "start": 2393.72, "end": 2400.64, "text": "auch der pie 3 und 4 für die kriegen zwar maximal 1 gigabit durch der dreier weniger"}, {"id": 307, "start": 2400.64, "end": 2406.76, "text": "aber das reicht dafür uplink testen wir dann mal hier über den windows rechner oder über"}, {"id": 308, "start": 2406.76, "end": 2411.08, "text": "die vm mal gucken da hab ich ja auch 10 g dran können wir dann direkt dran stöpseln"}, {"id": 309, "start": 2411.08, "end": 2418.28, "text": "und ja mal gucken bin mal gespannt"}, {"id": 310, "start": 2418.28, "end": 2433.84, "text": "ach ja und ich hab nen adapter usb 3 2,5 g 45 mal gucken ob den der raspberry pi erkennt"}, {"id": 311, "start": 2433.84, "end": 2443.12, "text": "und ob der router damit zünkt da bin ich mal gespannt ob die 2,5 können das ist ja immer"}, {"id": 312, "start": 2443.12, "end": 2451.84, "text": "so ein bisschen 50 50 chance ob das klappt so hat er jetzt fertig geflasht da validate"}, {"id": 313, "start": 2451.84, "end": 2455.68, "text": "aber leute ich muss mal kurz die raspberry pi suchen geht schnell ich weiß wo die sind"}, {"id": 314, "start": 2455.68, "end": 2478.32, "text": "also hoffe ich wenn die nicht da sind hab ich problem"}, {"id": 315, "start": 2478.32, "end": 2482.4, "text": "exzellent ich hab sie guck mal ich hab einen frisch verpackten ich hab heute die kamera"}, {"id": 316, "start": 2482.4, "end": 2486.84, "text": "nicht an weil ich dachte man braucht die nicht ich mein stellt euch das einfach mal vor"}, {"id": 317, "start": 2486.84, "end": 2491.92, "text": "ich hab jetzt gerade einen frisch verpackten aktuellen pie 4 mit 4g und noch einen in so"}, {"id": 318, "start": 2491.92, "end": 2497.36, "text": "einem offiziellen pie gehäuse usb stick drin wo ich nicht genau weiß wofür der da ist"}, {"id": 319, "start": 2497.36, "end": 2503.24, "text": "pie 3 das reicht und sogar ein offizielles raspberry pie netzteil da kann ja nix schief"}, {"id": 320, "start": 2503.24, "end": 2511.52, "text": "gehen jetzt also da gibt es heute nix spannendes zu sehen in der richtung ich werde den kram"}, {"id": 321, "start": 2511.52, "end": 2517.68, "text": "jetzt flaschen mal gucken ob der gig ob der 2,5 g adapter funktioniert in der zwischenzeit"}, {"id": 322, "start": 2517.68, "end": 2525.16, "text": "können wir ein bisschen chat gucken also wie gesagt next out finde ich ziemlicher crap"}, {"id": 323, "start": 2525.16, "end": 2539.2, "text": "habe ich ja gerade schon gesagt doch also aktuell habe ich ganz normal hier mein bio dynamics"}, {"id": 324, "start": 2539.2, "end": 2544.8, "text": "headset auf der hat der hat so ein bisschen watte hat so ein bisschen schaumstoff drüber"}, {"id": 325, "start": 2544.8, "end": 2549.88, "text": "aber da hat es nicht so einen fetten popschutz auf meinem mikrofon was ich verwende um die"}, {"id": 326, "start": 2549.88, "end": 2558.88, "text": "videos aufzunehmen da habe ich so ein pushell drüber ja hab ich hab ich hab ich komplett"}, {"id": 327, "start": 2558.88, "end": 2569.16, "text": "im stream installiert gibt es im archiv wie gesagt die samsung endurance karten sind"}, {"id": 328, "start": 2569.16, "end": 2587.56, "text": "richtig nice 15 19 prozent auf was was soll ich beim saturn kaufen ich glaube ich habe"}, {"id": 329, "start": 2587.56, "end": 2599.08, "text": "die letzten 15 jahre nix beim saturn gekauft hatten wir schon ja pains jam da kommt eh"}, {"id": 330, "start": 2599.08, "end": 2605.2, "text": "nix gescheites bei raus next cloud ist ehrlich gesagt also ich weiß nicht warum die ins"}, {"id": 331, "start": 2605.2, "end": 2612.52, "text": "business wollen die sind noch nicht mal komplett stable genug und und feature mäßig gut für"}, {"id": 332, "start": 2612.52, "end": 2621.64, "text": "ein heim gebrauch was wollen die im enterprise umfeld ja"}, {"id": 333, "start": 2621.64, "end": 2641.36, "text": "was mit der kirby musik los jetzt übertreiben sie es aber ja das das habe ich also das könnte"}, {"id": 334, "start": 2641.36, "end": 2647.76, "text": "man machen aber die sache ist die ich brauche keine ps5 was nehmen wenn nicht next oder"}, {"id": 335, "start": 2647.76, "end": 2651.04, "text": "on cloud erst wie gesagt es kommt darauf an was du haben willst habe ich ja gerade schon"}, {"id": 336, "start": 2651.04, "end": 2655.44, "text": "gesagt wenn du nur sync willst gibt es genug wenn du kalender willst gibt es auch was wenn"}, {"id": 337, "start": 2655.44, "end": 2668.52, "text": "du diese ganzen anderen halbfertigen apps willst ja dann musst du next cloud verwenden"}, {"id": 338, "start": 2668.52, "end": 2672.2, "text": "da kannst du alle für nehmen die brauchen nicht viel aber payo lohnt sich nicht mehr"}, {"id": 339, "start": 2672.2, "end": 2678.44, "text": "so wahnsinnig twitch block da gar nicht mehr richtig also gar nicht mehr und mit youtube"}, {"id": 340, "start": 2678.44, "end": 2685.66, "text": "hatte auch probleme aber youtube soll wohl angeblich mittlerweile wieder halbwegs funktionieren"}, {"id": 341, "start": 2685.66, "end": 2692.2, "text": "aber twitch kannst vergessen deswegen lohnt sich das meiner weile noch nicht mehr weil"}, {"id": 342, "start": 2692.2, "end": 2705.68, "text": "amazon langsam im updaten ist also das ist tatsächlich technik sachen sind bei mir tatsächlich"}, {"id": 343, "start": 2705.68, "end": 2712.12, "text": "ultra aufgeräumt also die die kleinen teile da habe ich extra so ein snipe erstes snipe"}, {"id": 344, "start": 2712.12, "end": 2719.8, "text": "auf fack das war ich doch jetzt mal log in nicht alter guck mal ob es so standard ist"}, {"id": 345, "start": 2719.8, "end": 2734.4, "text": "wie immer 0w alter ist immer das gleiche passwort ja jetzt schon ich habe den ganzen krempel"}, {"id": 346, "start": 2734.4, "end": 2752.0, "text": "hier drinnen von shellies bis raspberry pies led strips und sonst was da steht dann auch"}, {"id": 347, "start": 2752.0, "end": 2769.64, "text": "dabei in welchem in welchem fach das drinnen ist guck mal hier rein steht das nicht dabei"}, {"id": 348, "start": 2769.64, "end": 2774.36, "text": "genau da stehen da auch so dinge drin wie fach 1 fach 2 wo es drin ist da ist noch nicht"}, {"id": 349, "start": 2774.36, "end": 2778.6, "text": "alles drin aber ich bin eifrig am eintragen dass mir die sache auch relativ easy findet"}, {"id": 350, "start": 2778.6, "end": 2792.44, "text": "das ist sehr praktisch muss man echt sagen weiß man genau wo wo zeug ist sogar mit anzahl"}, {"id": 351, "start": 2792.44, "end": 2804.12, "text": "und so ja gut das kostet ja auch 300 euro oder so also das hat gefälligst hat gefälligst"}, {"id": 352, "start": 2804.12, "end": 2809.28, "text": "eine ordentliche qualität zu haben dass jetzt würdest du lieber darauf losprogrammieren"}, {"id": 353, "start": 2809.28, "end": 2821.16, "text": "oder die db ne weißt du was ich machen würde nachdem man selten abschätzen kann von anfang"}, {"id": 354, "start": 2821.16, "end": 2826.48, "text": "an was man eigentlich braucht ich würde erst mal drauf losprogrammieren allerdings ich"}, {"id": 355, "start": 2826.48, "end": 2831.28, "text": "würde es so anfangen dass ich db migrations per script machen kann da kannst du das nachher"}, {"id": 356, "start": 2831.28, "end": 2836.36, "text": "umziehen oder aber solange du noch am programmieren bist stell einfach dein framework ein dass"}, {"id": 357, "start": 2836.36, "end": 2840.88, "text": "bei jedem programm start die datenbank neu angelegt und gesiedelt wird das ist auch auch"}, {"id": 358, "start": 2840.88, "end": 2847.56, "text": "wirklich ne ne drauf los programmieren es ist es ist meiner mein nach kaum möglich wirklich"}, {"id": 359, "start": 2847.56, "end": 2852.04, "text": "im vorfeld dass sich 100 pro die korrekte datenbank struktur zu überlegen weil man nicht genau"}, {"id": 360, "start": 2852.04, "end": 2875.36, "text": "weiß wie es wie es wird also ne das ist kein ne ne das ist das das ist das das ist das"}, {"id": 361, "start": 2875.36, "end": 2882.08, "text": "piloten hetzer oder so von denen ich habe das da das ist quasi ein dt 770 mit halbwegs"}, {"id": 362, "start": 2882.08, "end": 2897.24, "text": "ordentlichem mikrofon dran oder guck mal sogar billiger geworden moment das ist ein äußerst"}, {"id": 363, "start": 2897.24, "end": 2908.0, "text": "schlechtes foto von dem das sieht so billig aus also ich habe noch die erste version ich"}, {"id": 364, "start": 2908.0, "end": 2916.8, "text": "habe noch die erste version mit diesen ja die da mit diesen diesen was ist das carbon"}, {"id": 365, "start": 2916.8, "end": 2926.96, "text": "look oder so finde ich nice wobei meine ja doch genauso doch genauso sieht das aus das"}, {"id": 366, "start": 2926.96, "end": 2936.08, "text": "richtig huge mesh optik die neuen sehen finde ich nicht mal ganz so cool aus aber sind immer"}, {"id": 367, "start": 2936.08, "end": 2943.52, "text": "noch gute headsets nexot für backup nein würde ich nicht bei backup würde ich definitiv"}, {"id": 368, "start": 2943.52, "end": 2948.24, "text": "nicht über nexot machen also für backups ist zynk an sich nur bedingt geeignet weil"}, {"id": 369, "start": 2948.24, "end": 2951.92, "text": "wenn du auf einer seite aus versehen was löscht es ist auf der anderen seite auch weg so fände"}, {"id": 370, "start": 2951.92, "end": 2957.28, "text": "es an ist dass das problem an zynk also für backup würde ich es gar nicht nehmen ich"}, {"id": 371, "start": 2957.28, "end": 2964.64, "text": "würde das nur nehmen für wie so so in etwa backup light also sprich wenn du einfach nur"}, {"id": 372, "start": 2964.64, "end": 2970.88, "text": "das allerwichtigste zynks so dann passwort safe und vielleicht notizen und so was das"}, {"id": 373, "start": 2970.88, "end": 2975.92, "text": "kann man machen aber so richtig großartiges backup würde ich würde ich da auf keinen fall"}, {"id": 374, "start": 2975.92, "end": 2980.6, "text": "drüber machen backup würde ich also wenn man wenn man ordentliches backup machen will gibt"}, {"id": 375, "start": 2980.6, "end": 2987.0, "text": "es da eh nur eine wirklich sinnvolle strategie für für einen gebrauch dies nicht total ausufert"}, {"id": 376, "start": 2987.0, "end": 2994.32, "text": "und die aber trotzdem doch ziemlich sicher ist unabhängig jetzt von der software man einsetzt"}, {"id": 377, "start": 2994.32, "end": 2998.84, "text": "du hast das ding einmal auf dem rechner wo du es brauchst du hast das ding einmal bei dir"}, {"id": 378, "start": 2998.84, "end": 3002.72, "text": "auf dem nass oder sagen wir mal auf der extern festplatte liegen und du hast das ding noch"}, {"id": 379, "start": 3002.72, "end": 3006.72, "text": "einmal oft seit gesynkt das ist das ein das ist das einzige wo du dir wirklich sicher"}, {"id": 380, "start": 3006.72, "end": 3013.0, "text": "sein kannst also ich würde so machen wenn ich den stink normales windows hätte und möchte"}, {"id": 381, "start": 3013.0, "end": 3021.92, "text": "möglichst brainless das backupen da würde ich die free variante davon nehmen ich mach"}, {"id": 382, "start": 3021.92, "end": 3025.32, "text": "das mit borg backup ja aber für die für die leute den kommando teil nichts ist nimmst"}, {"id": 383, "start": 3025.32, "end": 3036.28, "text": "hier den agent free free agent agent oder irgendwie so ist das ding genau und dann backups"}, {"id": 384, "start": 3036.28, "end": 3042.6, "text": "du auf dein nass um netzlaufwerk und auf deinem netzlaufwerk lässt du einmal in der nacht"}, {"id": 385, "start": 3042.6, "end": 3048.6, "text": "einen backup in die cloud laufen und da kannst du dir überlegen ob du wirklich alles backupen"}, {"id": 386, "start": 3048.6, "end": 3055.96, "text": "willst oder nur spezielle sachen also ich bin dafür in die cloud wirklich dann nur die wichtigen"}, {"id": 387, "start": 3055.96, "end": 3060.76, "text": "dinge an wichtigen dinge zu backupen also sprich auf dein nass kannst du schon komplett das"}, {"id": 388, "start": 3060.76, "end": 3065.36, "text": "betriebssystem backup machen aber in die cloud weil es eben einfach geld kostet würde ich"}, {"id": 389, "start": 3065.36, "end": 3070.8, "text": "sagen ok da sollte man sich vielleicht noch mal angucken ob man vielleicht nicht alle"}, {"id": 390, "start": 3070.8, "end": 3074.08, "text": "fotos nimmt sondern plus die wichtigsten familien fotos die man unbedingt behalten"}, {"id": 391, "start": 3074.08, "end": 3080.24, "text": "will oder dass man zum beispiel sein shadow play ordner mit game recordings rausnimmt"}, {"id": 392, "start": 3080.24, "end": 3085.36, "text": "weil die muss man auch nicht doppelt backupen in die cloud aber für alles was extrem wichtig"}, {"id": 393, "start": 3085.36, "end": 3092.12, "text": "ist muss man das an drei orten haben nämlich auf dem rechner wo man es braucht auf nass"}, {"id": 394, "start": 3092.12, "end": 3095.52, "text": "und oft seit bergab in der cloud nur dann kannst du dir wirklich sicher sein dass nichts"}, {"id": 395, "start": 3095.52, "end": 3100.96, "text": "passiert und ein sing sing ist genauso schlecht wie next cloud wenn es um backup geht weil"}, {"id": 396, "start": 3100.96, "end": 3110.76, "text": "wurde das jetzt gefragt ich muss gleich mal gucken weil sing ist halt für solche backup"}, {"id": 397, "start": 3110.76, "end": 3114.12, "text": "geschichten schlecht wenn du nämlich auf der einen seite was löst ist halt auf der anderen"}, {"id": 398, "start": 3114.12, "end": 3119.36, "text": "seite auch weg sing sing kannst du für password manager und so was verwenden ja ja das ist ok"}, {"id": 399, "start": 3119.36, "end": 3124.48, "text": "den solltest aber auch noch mal so gebacked haben vielleicht auf dein nass weil wie gesagt"}, {"id": 400, "start": 3124.48, "end": 3130.28, "text": "dass das sing ist schlecht als als alleiniges backup sing ist ganz gut dafür wenn du wenn"}, {"id": 401, "start": 3130.28, "end": 3134.56, "text": "die ein rechner verreckt und du brauchst hast noch auf dem anderen dann hat er läuft ja"}, {"id": 402, "start": 3134.56, "end": 3139.48, "text": "nicht die gefahr ich lösch aus versehen oder so das geht ja nur um es kackt jetzt ab ich"}, {"id": 403, "start": 3139.48, "end": 3143.16, "text": "habe es direkt noch auf einem anderen aber wenn du wirklich backupen willst gibt es"}, {"id": 404, "start": 3143.16, "end": 3146.56, "text": "eigentlich nur die variante du hast einmal auf dem rechner wo du es brauchst du schiebst"}, {"id": 405, "start": 3146.56, "end": 3152.72, "text": "einmal auf der nass und macht einmal oft seit bergab verschlüsselt wohlgemerkt ja am besten"}, {"id": 406, "start": 3152.72, "end": 3172.52, "text": "mit wie ist das was rustic nee wie ist das wie ist das dieses cloud sing ding die er"}, {"id": 407, "start": 3172.52, "end": 3177.92, "text": "clone mein ich nicht rustic er clone mein ich genau das ist gut für oft seit backup"}, {"id": 408, "start": 3177.92, "end": 3190.68, "text": "auf cloud die unterstützen auch so ziemlich alle möglichen backends da kannst du nämlich"}, {"id": 409, "start": 3190.68, "end": 3194.76, "text": "low brain wm verwenden auf deinem windows da musst du nämlich nichts machen das kann"}, {"id": 410, "start": 3194.76, "end": 3199.32, "text": "jeder einrichten und hast du schon mal gebacked auf dein nass und vor deinem nass kannst du"}, {"id": 411, "start": 3199.32, "end": 3204.64, "text": "per clone auf jeden x beliebigen oder fast jeden x beliebigen cloud anbieter sünden"}, {"id": 412, "start": 3204.64, "end": 3208.72, "text": "verschlüsselt wohlgemerkt was das wichtige ist cloud backup nie verschlüsselt weil wenn"}, {"id": 413, "start": 3208.72, "end": 3211.76, "text": "ihr wirklich meine passport txt auf dem desktop habt wollt ihr die nicht unverschlüsselt"}, {"id": 414, "start": 3211.76, "end": 3218.44, "text": "in der cloud haben und dann macht ihr verschlüsselt auf seit bergab erstmal erstmal die alibaba"}, {"id": 415, "start": 3218.44, "end": 3227.0, "text": "cloud ich weiß ehrlich gesagt nicht was ich davon gerade die habe ich mal verwendet für"}, {"id": 416, "start": 3227.0, "end": 3233.48, "text": "s3 storage aber die s3 das ist trotzdem nur noch relativ teuer wenn man echt terabyte"}, {"id": 417, "start": 3233.48, "end": 3238.92, "text": "weise braucht deswegen würde ich sagen oft seit ja die sind gut die sind gut solang man"}, {"id": 418, "start": 3238.92, "end": 3248.6, "text": "die solange man die das ging früher zumindest nee das nee ach quatsch nee das ging nicht"}, {"id": 419, "start": 3248.6, "end": 3260.68, "text": "das ging nicht das unlimited geht nicht zum mountain und deswegen hat es gesagt genau"}, {"id": 420, "start": 3260.68, "end": 3265.52, "text": "da musstest du den ihre komische software für verwenden und das fällt bei mir raus"}, {"id": 421, "start": 3265.52, "end": 3270.24, "text": "weil ich will ich will das sicher verschlüsselt haben von open source software dass ich sicher"}, {"id": 422, "start": 3270.24, "end": 3278.76, "text": "sein kann der cloud anbieter hat echt keine chance da rein zu gucken das kann man natürlich"}, {"id": 423, "start": 3278.76, "end": 3282.96, "text": "auch machen das kannst du ja das geht auch du kannst ihr könnt auch ihr könnt auch"}, {"id": 424, "start": 3282.96, "end": 3287.4, "text": "wenn ihr irgendwie einen freund habt also wenn ihr wenn ihr in der echten welt noch"}, {"id": 425, "start": 3287.4, "end": 3292.4, "text": "Leute kennt ja könnt ihr auch mit dem ausmachen dass der eine raspberry pi mit festplatte"}, {"id": 426, "start": 3292.4, "end": 3297.68, "text": "bei euch hinstellt und ihr eine raspberry pi mit platte bei ihm hinstellt dann müsst"}, {"id": 427, "start": 3297.68, "end": 3303.64, "text": "ihr aber gucken wie macht ihr den upload und sowas alternativ was auch eine möglichkeit"}, {"id": 428, "start": 3303.64, "end": 3311.04, "text": "ist wenn man wenn man oft seit auf die old school variante macht ihr könnt natürlich"}, {"id": 429, "start": 3311.04, "end": 3317.8, "text": "auch die festplatte verschlüsselt festplatte verschlüsselt das ding einmal in der woche"}, {"id": 430, "start": 3317.8, "end": 3324.56, "text": "kopieren und das irgendwie in schließfach legen oder zur oma bringen oder zu den eltern"}, {"id": 431, "start": 3324.56, "end": 3328.72, "text": "bringen oder so das könnt ihr auch machen wichtig ist nur dass die festplatte nicht"}, {"id": 432, "start": 3328.72, "end": 3335.52, "text": "auch im arsch ist wenn das bei euch mal hochwasser ist oder oder oder brennt oder irgendwas"}, {"id": 433, "start": 3335.52, "end": 3342.6, "text": "deswegen macht das ist ja grad der witz von offside backup das macht es jetzt nicht sicherer"}, {"id": 434, "start": 3342.6, "end": 3359.24, "text": "wenn man eh davon ausgeht dass nichts passiert daheim ja die musik oder wird zu anstrengend"}, {"id": 435, "start": 3359.24, "end": 3367.68, "text": "gerade ja bei denen hatte ich mal was aber die sind für reines back ab ein bisschen"}, {"id": 436, "start": 3367.68, "end": 3380.76, "text": "zu teuer na guck da bezahlst du 6 euro pro terabyte das ist das ist echt ok ja aber"}, {"id": 437, "start": 3380.76, "end": 3386.04, "text": "wenn jetzt jemand sagt hey ich brauche aber 12 terabyte offside storage offside backup"}, {"id": 438, "start": 3386.04, "end": 3392.52, "text": "storage dann kostet sie viel aber ich sag mal die meisten leute kommen mit einem terabyte"}, {"id": 439, "start": 3392.52, "end": 3397.52, "text": "locker hin wenn man jetzt nicht wirklich jeden scheiß singt oder nicht jeden scheiß scheiß"}, {"id": 440, "start": 3397.52, "end": 3403.2, "text": "offside backup also einen terabyte daten die wirklich wichtig sind die man nicht verloren"}, {"id": 441, "start": 3403.2, "end": 3408.36, "text": "will wo man sich den nochmal so den das dritte backup gönnt dass das offside backup gönnt"}, {"id": 442, "start": 3408.36, "end": 3413.12, "text": "die meisten leute kommen nicht über den terabyte ja wenn ihr jetzt natürlich faul seid wie"}, {"id": 443, "start": 3413.12, "end": 3417.84, "text": "ich und sagt hey ihr wollt eins zu eins alles da sinken ohne euch gedanken machen zu müssen"}, {"id": 444, "start": 3417.84, "end": 3422.32, "text": "was ihr habt ja gut dann müsste halt mehr geld ausgeben aber ein terabyte reicht dicke"}, {"id": 445, "start": 3422.32, "end": 3431.16, "text": "normalerweise wirklich dicke das heißt ganzen isos raus ganzen downloads raus ganze ganze"}, {"id": 446, "start": 3431.16, "end": 3435.04, "text": "gameplay recording videos raus was auch immer das müsst ihr nicht unbedingt offside backup"}, {"id": 447, "start": 3435.04, "end": 3439.24, "text": "das reicht so als auf dem nass da ist weil wenn wirklich mal eure wohnung abbrennt dann"}, {"id": 448, "start": 3439.24, "end": 3445.32, "text": "glaubt mir dann sind die fortnight gameplay backups das kleinste was ihr habt wichtig"}, {"id": 449, "start": 3445.32, "end": 3448.72, "text": "ist aber halt dass die sachen wo ihr echt behalten wollt dass die nochmal offside backups"}, {"id": 450, "start": 3448.72, "end": 3464.08, "text": "sind down pc gut das ist das ist zu das ist zu big brain für 90 prozent der leute ok"}, {"id": 451, "start": 3464.08, "end": 3471.68, "text": "jetzt war mal weiter also wo habe ich immer ein pay hier also haben wir erstmal den vierer"}, {"id": 452, "start": 3471.68, "end": 3478.92, "text": "war der vierer kriegt die bisschen bessere mikro sd weil ich weiß gar nicht habe ich"}, {"id": 453, "start": 3478.92, "end": 3483.32, "text": "habe ich so ein comic hat er hat er bei standardmäßig eine sd karte drin so eine nupes sd karte"}, {"id": 454, "start": 3483.32, "end": 3493.96, "text": "das ist nur wenn man es im bundle kauft also ich krieg's mir dann richtig auf so da ist"}, {"id": 455, "start": 3493.96, "end": 3507.88, "text": "er da ist keine sd karte drin exzellent gut dann wo ist es hier anschließen flop sd karte"}, {"id": 456, "start": 3507.88, "end": 3521.36, "text": "rein und power on wenn ich die sd karte finde hier zack raspberry pi netz teil auspacken"}, {"id": 457, "start": 3521.36, "end": 3525.48, "text": "und dann machen wir das ding mal an so leute ich muss mal kurz das kabel rein stecken dass"}, {"id": 458, "start": 3525.48, "end": 3541.08, "text": "wir uns gleich habe ich vergessen habe ich ssh angemacht leute habe ich ssh angemacht"}, {"id": 459, "start": 3541.08, "end": 3554.8, "text": "ich glaube nicht oder ok dann muss ich die sd karte noch mal rein machen kacquade sd karte"}, {"id": 460, "start": 3554.8, "end": 3574.8, "text": "noch mal rein machen was haben wir hier sdb mount touch ssh so also ssh ansonsten kann"}, {"id": 461, "start": 3574.8, "end": 3579.16, "text": "ich mich nämlich nicht einloggen huppst an mounten sollte ich vielleicht noch sonst kann"}, {"id": 462, "start": 3579.16, "end": 3584.68, "text": "ich mich nämlich nicht einloggen über ssh auf dem raspberry pi das sackt ziemlich so"}, {"id": 463, "start": 3584.68, "end": 3592.04, "text": "zack sd karte rein ich guck gleich chat weiter sd karte rein netz teil warum sind eigentlich"}, {"id": 464, "start": 3592.04, "end": 3598.0, "text": "bei kabeln die verpackt sind immer so komische so komische das sind ja keine richtigen kabelbinder"}, {"id": 465, "start": 3598.0, "end": 3609.36, "text": "so so dinger drum gewickelt die man immer erst raus fuddeln muss gut strom so ich stöpsel"}, {"id": 466, "start": 3609.36, "end": 3621.4, "text": "mal ein machen netzwerkabel dran"}, {"id": 467, "start": 3639.36, "end": 3642.4, "text": "so"}, {"id": 468, "start": 3642.4, "end": 3645.4, "text": "so"}, {"id": 469, "start": 3645.4, "end": 3648.4, "text": "so"}, {"id": 470, "start": 3648.4, "end": 3651.4, "text": "so"}, {"id": 471, "start": 3651.4, "end": 3654.4, "text": "so"}, {"id": 472, "start": 3654.4, "end": 3657.4, "text": "so"}, {"id": 473, "start": 3657.4, "end": 3660.4, "text": "so"}, {"id": 474, "start": 3660.4, "end": 3663.4, "text": "so"}, {"id": 475, "start": 3663.4, "end": 3666.4, "text": "so"}, {"id": 476, "start": 3666.4, "end": 3674.92, "text": "so ich hab die steckdosenleiste die billy china steckdosenleiste runter geschmissen"}, {"id": 477, "start": 3674.92, "end": 3678.16, "text": "da hängen natürlich zig kabel dran die werden jetzt auch alle fast vom schreibtisch wieder"}, {"id": 478, "start": 3678.16, "end": 3685.76, "text": "die geräte runter gefallen top so so raspberry pi geht an loggen wir uns mal drauf ein"}, {"id": 479, "start": 3685.76, "end": 3706.32, "text": "ne mach ich net ich guck im dhcp"}, {"id": 480, "start": 3706.32, "end": 3712.64, "text": "so mit den diet pi ausprobiert was war das nochmal das war dieses dieses special betriebssystem"}, {"id": 481, "start": 3712.64, "end": 3718.88, "text": "mit mit mit vorkonfigurierten sachen ne hab ich nicht ausprobiert wüsste ich jetzt auch"}, {"id": 482, "start": 3718.88, "end": 3720.0, "text": "nicht wozu ich das brauche"}, {"id": 483, "start": 3720.0, "end": 3743.68, "text": "gartenstelles video habe ich schon aufgenommen vor zwei wochen"}, {"id": 484, "start": 3743.68, "end": 3759.08, "text": "so mal gucken wie schnell die ist ob das jetzt halbwegs funktioniert das war das nicht das"}, {"id": 485, "start": 3759.08, "end": 3764.16, "text": "mit vorkonfigurierten sachen wo ich wo ich die die die daseinsberechtigung nicht so ganz"}, {"id": 486, "start": 3764.16, "end": 3773.96, "text": "entstanden habe verstanden habe warum soll man also was wusste sinne davon also was brauche"}, {"id": 487, "start": 3773.96, "end": 3774.96, "text": "man"}, {"id": 488, "start": 3774.96, "end": 3781.36, "text": "schule optimisern gut das ist das das ist das normale auch simple interface ja dann brauche"}, {"id": 489, "start": 3781.36, "end": 3782.36, "text": "ich net"}, {"id": 490, "start": 3782.36, "end": 3795.08, "text": "ne seh ich für mich den vorteil jetzt nicht drin ehrlich gesagt was kann das tolles wofür"}, {"id": 491, "start": 3795.08, "end": 3812.4, "text": "ja heute schneestell geiler aber ich habe kein bock das noch soll ich jetzt nicht da"}, {"id": 492, "start": 3812.4, "end": 3816.52, "text": "müsste ich jetzt das video jedes mal neu aufnehmen wenn ein bisschen mehr schnee fällt"}, {"id": 493, "start": 3816.52, "end": 3826.32, "text": "das ist ja auch nicht den zweck der sache welche virtual maschinen wäre zu empfehlen"}, {"id": 494, "start": 3826.32, "end": 3831.12, "text": "wenn man nicht viel machen vor der workstation ist das beste auf dem desktop"}, {"id": 495, "start": 3831.12, "end": 3835.04, "text": "ansonsten wenn du gar kein geld ausgeben willst nimm halt virtual box andere möglichkeit"}, {"id": 496, "start": 3835.04, "end": 3836.04, "text": "hast du unter windows ja nicht"}, {"id": 497, "start": 3836.04, "end": 3847.56, "text": "ja doch hyper wie aber das auf dem desktop ist tolle kacke weight"}, {"id": 498, "start": 3847.56, "end": 3851.88, "text": "oh das ist die sd karte ist wahnsinnig poggers geschwind"}, {"id": 499, "start": 3851.88, "end": 3871.48, "text": "wobei das liegt gerade am download das liegt nicht an der sd karte"}, {"id": 500, "start": 3871.48, "end": 3874.6, "text": "es gibt forever nicht free es gibt virtual box free"}, {"id": 501, "start": 3874.6, "end": 3885.0, "text": "es gab mal den alten forever player gab es free alternative du kaufst dir bei irgendeinem"}, {"id": 502, "start": 3885.0, "end": 3890.32, "text": "key shop einen key für einen apple und ein ei"}, {"id": 503, "start": 3890.32, "end": 3892.08, "text": "aber auf dem desktop ohne scheiß finde ich am besten"}, {"id": 504, "start": 3892.08, "end": 3898.56, "text": "irgendwas was virtual box nicht kann was man braucht weiß ich aus dem steg greift nicht"}, {"id": 505, "start": 3898.56, "end": 3901.92, "text": "aber die frage kommt öfters wir haben schon öfters nachgeguckt und ja es gibt einige"}, {"id": 506, "start": 3901.92, "end": 3905.84, "text": "dinger snapshots kannst du auf jeden fall auch"}, {"id": 507, "start": 3905.84, "end": 3909.28, "text": "machen ich weiß es aber aus dem steg greift nicht"}, {"id": 508, "start": 3909.28, "end": 3912.84, "text": "mehr ne ne ne vor allem bei workstation 16 pro"}, {"id": 509, "start": 3912.84, "end": 3918.04, "text": "kein player es gibt den player der was kostet es gibt den"}, {"id": 510, "start": 3918.04, "end": 3924.92, "text": "kostenlosen player alter das ist ja wahnsinnig geschwind"}, {"id": 511, "start": 3924.92, "end": 3930.84, "text": "auf auf gib gas so jetzt jetzt ich bin mal gespannt ich"}, {"id": 512, "start": 3930.84, "end": 3936.04, "text": "habe hier nämlich so nen adapter von der weile gekauft usb 2,5 g"}, {"id": 513, "start": 3936.04, "end": 3943.08, "text": "zwar der da ist er gab es mal gab es mal billig bei amazon"}, {"id": 514, "start": 3943.08, "end": 3946.72, "text": "den hatte ich mal bestellt er war mal in irgendeinem sale drinne für 35 oder so habe ich mit"}, {"id": 515, "start": 3946.72, "end": 3950.56, "text": "bestellt ich bin mal gespannt ob der auf dem raspberry"}, {"id": 516, "start": 3950.56, "end": 3958.64, "text": "pie überhaupt geht ich mein 2,5 g kriegen wir nicht drüber"}, {"id": 517, "start": 3958.64, "end": 3965.4, "text": "ich frage mich ob der überhaupt link erkennt da dran"}, {"id": 518, "start": 3965.4, "end": 3967.44, "text": "keine keys schicken im chat wird jetzt gelöscht"}, {"id": 519, "start": 3967.44, "end": 3973.96, "text": "vielleicht hast du es gesehen dann guck rein aber ansonsten nicht"}, {"id": 520, "start": 3973.96, "end": 3977.04, "text": "als monka toss ihr könnt euch die keys besorgen wo ihr wollt"}, {"id": 521, "start": 3977.04, "end": 3979.12, "text": "ist mir vollkommen wurscht aber dann im chat posten"}, {"id": 522, "start": 3979.12, "end": 4001.28, "text": "weil weil man weiß ja nie"}, {"id": 523, "start": 4001.28, "end": 4011.72, "text": "also ich habe mein key hier gekauft das schwankte mal der preis ein bisschen"}, {"id": 524, "start": 4011.72, "end": 4021.84, "text": "software kong ultra vertrauenswürdiger shop"}, {"id": 525, "start": 4021.84, "end": 4028.2, "text": "elix critical information das ist wahrscheinlich bisschen so was wie pc fritz oder so"}, {"id": 526, "start": 4028.2, "end": 4031.64, "text": "hast du dein key mal geguggelt nö dann weiß google ja bald key"}, {"id": 527, "start": 4031.64, "end": 4035.56, "text": "ne kann durchaus sein vielleicht haben die mir auch von github was verkauft kein schimmer"}, {"id": 528, "start": 4035.56, "end": 4042.32, "text": "das kann ja sein software kong haben die haben die haben den impressum"}, {"id": 529, "start": 4042.32, "end": 4043.16, "text": "haben den impressum"}, {"id": 530, "start": 4043.16, "end": 4054.92, "text": "ivan ivan kresic kresic alles klar software kong"}, {"id": 531, "start": 4054.92, "end": 4061.48, "text": "ok die sind aber legit sonst hätten die kein universal schlichtungs stelle.de"}, {"id": 532, "start": 4061.48, "end": 4067.36, "text": "alles klar ja die sind schon die sind legit aber klingt halt erst mal nicht so software"}, {"id": 533, "start": 4067.36, "end": 4068.36, "text": "kong"}, {"id": 534, "start": 4068.36, "end": 4086.08, "text": "du kannst mmoga also g2a habe ich schlechte erfahrungen gemacht mit windows keys da habe"}, {"id": 535, "start": 4086.08, "end": 4090.2, "text": "ich mal einen geholt vor einer weile also jahre her aber ging dann nicht"}, {"id": 536, "start": 4090.2, "end": 4120.08, "text": "ja aber zum thema backup also die hier kann man echt empfehlen wenn ihr wenn ihr nicht"}, {"id": 537, "start": 4120.08, "end": 4129.56, "text": "viel speicher braucht und 6 euro für terabyte schon vollkommen in ordnung ihr könnt es"}, {"id": 538, "start": 4129.56, "end": 4135.72, "text": "auch als s3 mountain was das ganze sachen noch einfacher macht also während er jetzt"}, {"id": 539, "start": 4135.72, "end": 4150.48, "text": "update kommt noch mal kurz chat fertig was für ein teil tts ist es text to speech ne"}, {"id": 540, "start": 4150.48, "end": 4160.4, "text": "das wäre tts tss next gen weke platforms engineer klingt poggers ja was neben habe"}, {"id": 541, "start": 4160.4, "end": 4164.04, "text": "ich doch gesagt also kommt darauf an was du machen willst wenn du nur so machen willst"}, {"id": 542, "start": 4164.04, "end": 4169.96, "text": "nimm sing sing oder nimm sie feil oder was es da noch gibt muss google einfach mal was"}, {"id": 543, "start": 4169.96, "end": 4174.6, "text": "es für sing geschichten gibt es jede menge open source dinger die allemal besser sind"}, {"id": 544, "start": 4174.6, "end": 4181.28, "text": "als next cloud next cloud also ich finde next cloud lohnt sich wirklich nur wenn man entweder"}, {"id": 545, "start": 4181.28, "end": 4195.92, "text": "die basic kombination braucht also aus sing und web interface und kontakte kalender und"}, {"id": 546, "start": 4195.92, "end": 4200.6, "text": "sowas wenn man wirklich dieses gesamtpaket braucht allerdings darüber hinaus gehen dann"}, {"id": 547, "start": 4200.6, "end": 4207.24, "text": "auch nichts weiter weil die zusatzapps sind halt in der regel unfertig und ziemlich crap"}, {"id": 548, "start": 4207.24, "end": 4213.48, "text": "ich meine man darf nicht vergessen die notizapp vor next cloud hatte glaube ich bis zur letzten"}, {"id": 549, "start": 4213.48, "end": 4218.32, "text": "version noch nicht mal eine suche das sagt glaube ich alles wenn der notizapp keine suche"}, {"id": 550, "start": 4218.32, "end": 4227.68, "text": "hat bis vor einer version ernsthaft ja gut wie gesagt menschenrechte sind in china eh"}, {"id": 551, "start": 4227.68, "end": 4233.2, "text": "nicht so groß so hoch angesehen kein wunder dass jetzt hier plus plus machen aber wegen"}, {"id": 552, "start": 4233.2, "end": 4240.8, "text": "der sd card ja gut kann man machen aber wie gesagt die samsung endurance sd ssd karten"}, {"id": 553, "start": 4240.8, "end": 4251.04, "text": "mikro sd karten sind echt sind echt nice und man die jetzt kauft ja ja gut ublog kannst"}, {"id": 554, "start": 4251.04, "end": 4256.68, "text": "du aber nur verwenden wenn du einen browser hast also die meisten leute die phol verwenden"}, {"id": 555, "start": 4256.68, "end": 4261.76, "text": "oder phol hört sich in beiden aussprachen nicht richtig an die das verwenden die wollen"}, {"id": 556, "start": 4261.76, "end": 4266.6, "text": "es ja meistens auch unter anderem um ios apps werbung zu blocken und so und das geht nicht"}, {"id": 557, "start": 4266.6, "end": 4274.28, "text": "mehr dafür war das richtig gut geht aber nicht mehr ok die käumen muss ich mir gerade echt"}, {"id": 558, "start": 4274.28, "end": 4288.24, "text": "auf den sack ich muss mal kurz was anderes machen was gut was kann ich stehen geblieben"}, {"id": 559, "start": 4288.24, "end": 4293.28, "text": "sind acht chat es macht hier immer noch nicht fertig ok die sd karte ist echt nicht schnell"}, {"id": 560, "start": 4293.28, "end": 4302.48, "text": "ja dafür ist es echt gut auf normalen seiten funktioniert es auch meine sache mein also"}, {"id": 561, "start": 4302.48, "end": 4306.04, "text": "das problem was ich habe ist mit ich hätte am liebsten dass es auf youtube und twitch"}, {"id": 562, "start": 4306.04, "end": 4312.4, "text": "das auch noch gut macht und da ist es halt das sind die mittlerweile hinterher und den"}, {"id": 563, "start": 4312.4, "end": 4316.04, "text": "dns blocker kann auch nichts dagegen machen wenn der content und die werbung von den gleichen"}, {"id": 564, "start": 4316.04, "end": 4328.44, "text": "servan kommen ich setze keine cookies"}, {"id": 565, "start": 4328.44, "end": 4347.08, "text": "also sie musste das glaube ich auch nur machen wenn es personalisierte sachen enthält einschließen"}, {"id": 566, "start": 4347.08, "end": 4369.72, "text": "und 24 sieben vom rechner hocken easy und hoodie aufziehen nicht vergessen"}, {"id": 567, "start": 4369.72, "end": 4374.48, "text": "ich habe alle daten auf dem nas außer games greife einfach auf die netzlaufwerke zu ja"}, {"id": 568, "start": 4374.48, "end": 4388.04, "text": "kann man machen kann man gibt es verschiedene ja also verschiedene taktiken ja also ich"}, {"id": 569, "start": 4388.04, "end": 4393.76, "text": "finde beispielsweise nicht so toll die daily sachen auf nass liegen zu haben einfach weil"}, {"id": 570, "start": 4393.76, "end": 4398.16, "text": "die zugriffszeiten uns schon unterschied ist ob es lokal ist oder lokale ssd oder übers"}, {"id": 571, "start": 4398.16, "end": 4405.36, "text": "nass gehen muss und gerade für gameplay recordings hatte ich probleme gehabt weil das auf übers"}, {"id": 572, "start": 4405.36, "end": 4409.4, "text": "nass teilweise zwischendurch fremdrops hatte weiß auch nicht so genau warum vielleicht"}, {"id": 573, "start": 4409.4, "end": 4417.04, "text": "weil er seine sind das patch mb die sekunde oder so nicht recht los geworden ist so hat"}, {"id": 574, "start": 4417.04, "end": 4420.92, "text": "er jetzt abgreif gemacht ok rebooten wir installieren erst noch mal so die standards sachen die"}, {"id": 575, "start": 4420.92, "end": 4433.44, "text": "man immer braucht kann man nicht viel falsch machen so mal kurz durch scrollen stonks leute"}, {"id": 576, "start": 4433.44, "end": 4439.48, "text": "hier wieder am start seit gamestop seit gamestop sind auch alle gamer big stonks menschen geworden"}, {"id": 577, "start": 4439.48, "end": 4452.8, "text": "habe ich den eindruck ich weiß nicht wovon ihr es habt aber view frontend dotnet backend"}, {"id": 578, "start": 4452.8, "end": 4463.32, "text": "ist big brain ist meine absolute lieblingskombination das kannst du nicht es sei denn du findest"}, {"id": 579, "start": 4463.32, "end": 4483.0, "text": "irgendwas wie wasabi was du direkt mounten kannst bei dir im fallsystem ja wie gesagt"}, {"id": 580, "start": 4483.0, "end": 4488.08, "text": "massive big brain setup also das ist das ich meine das habt ihr im prinzip auch nur gemacht"}, {"id": 581, "start": 4488.08, "end": 4493.52, "text": "weil es geht nicht weil das irgendwie dafür also nicht weil es irgendwie für oft seit"}, {"id": 582, "start": 4493.52, "end": 4497.44, "text": "backup erforderlich wäre ihr wolltet gucken wie es geht und habt gemacht brauchen tut"}, {"id": 583, "start": 4497.44, "end": 4506.44, "text": "man das ja nicht ich muss euch ehrlich sagen ich habe noch kein bgp über vpn oder irgendwas"}, {"id": 584, "start": 4506.44, "end": 4511.8, "text": "jemals gemacht ich weiß was es ist ich weiß übrigens gar nicht nach welchem schema so"}, {"id": 585, "start": 4511.8, "end": 4516.44, "text": "autonome system nummern überhaupt aufgebaut sind hat mich auch bisher nicht großartig"}, {"id": 586, "start": 4516.44, "end": 4530.08, "text": "interessiert für für private anwendung ich installiere aktuell linux drauf auf beiden"}, {"id": 587, "start": 4530.08, "end": 4536.04, "text": "dass ich morgen meine neuen switcher testen kann das war es eigentlich dann mal morgen"}, {"id": 588, "start": 4536.04, "end": 4557.28, "text": "weiter ich kann jetzt nur mal schnell den chat durch ne ne wie gesagt workstation pro"}, {"id": 589, "start": 4557.28, "end": 4565.32, "text": "welche transfer rate hast du das haben wir mal ausprobiert vor einer weile ich weiß"}, {"id": 590, "start": 4565.32, "end": 4571.28, "text": "es nicht mal wie viel zwar wenn ihr wollt können wir das noch mal ausprobieren ich"}, {"id": 591, "start": 4571.28, "end": 4576.28, "text": "meine ich habe eine ich habe ich habe zwei ssd hier liegen und irgendwo habe ich auch"}, {"id": 592, "start": 4576.28, "end": 4581.4, "text": "mein ssd adapter können wir noch mal ausprobieren wenn ihr wollt es ist es ist nicht wahnsinnig"}, {"id": 593, "start": 4581.4, "end": 4592.24, "text": "hoch halt das was man über usb 3.0 so drüber kriegt also wie viel das war kann man gleich"}, {"id": 594, "start": 4592.24, "end": 4603.8, "text": "mal ausprobieren schreibe ich mir auf pass of exile ich muss erstmal die league wieder"}, {"id": 595, "start": 4603.8, "end": 4610.76, "text": "spielen ich hatte überhaupt nicht großartig bock und auch nicht großartig zeit die letzt"}, {"id": 596, "start": 4610.76, "end": 4625.04, "text": "leagues zu spielen ja die liefern sich so ein bisschen ist bettel stimmt warum eigentlich"}, {"id": 597, "start": 4625.04, "end": 4632.32, "text": "nicht ich glaube habe ich ausgeschaltet wegen wegen was auch immer wegen wegen letztens"}, {"id": 598, "start": 4632.32, "end": 4641.92, "text": "irgendwas habe ich letztens gemacht wo ich darkmode ausgeschaltet habe gibt es irgendeine"}, {"id": 599, "start": 4641.92, "end": 4648.72, "text": "totale oder eine art anlagen für für totnet und vue js also nee aber eigentlich hängen"}, {"id": 600, "start": 4648.72, "end": 4654.48, "text": "die zwei sachen gar nicht so großartig miteinander zusammen also es ist es ist es ziemlich egal"}, {"id": 601, "start": 4654.48, "end": 4658.0, "text": "in was sein backend was sein frontend ist also das eine hat mit dem anderen nichts zu tun"}, {"id": 602, "start": 4658.0, "end": 4661.56, "text": "ich meine du könntest das backend austauschen und die gleich das gleiche frontend verwenden"}, {"id": 603, "start": 4661.56, "end": 4665.52, "text": "also du musst ja nichts spezielles machen in dort net und dass du view verwenden kannst"}, {"id": 604, "start": 4665.52, "end": 4678.68, "text": "und umgedreht ich mache wie gesagt du machst das unabhängig voneinander ok progress die"}, {"id": 605, "start": 4678.68, "end": 4682.08, "text": "aktuelle league ist nice ich habe ehrlich gesagt gar nicht gar nicht mitgekriegt ich"}, {"id": 606, "start": 4682.08, "end": 4687.4, "text": "habe den ankündigung trailer gesehen mit irgendwie dem neuen endboss und das war es"}, {"id": 607, "start": 4687.4, "end": 4698.4, "text": "ich habe absolut kein kein schimmer ist sie vielleicht gut für ein fau server um darauf"}, {"id": 608, "start": 4698.4, "end": 4710.24, "text": "backups speichern zu können sie fallen für oft sein irgendwie weiß ich nicht ob das so"}, {"id": 609, "start": 4710.24, "end": 4716.16, "text": "eine gute idee ist gehen mit ein paar tricks wird es bestimmt aber wenn du backups speichern"}, {"id": 610, "start": 4716.16, "end": 4720.28, "text": "willst würde ich das nicht über sie feil zünden sondern ich würde erstmal lokal bei"}, {"id": 611, "start": 4720.28, "end": 4727.72, "text": "dir irgendwie auf nass und von dort nächtlich dann auf den server ist glaube ich die bessere"}, {"id": 612, "start": 4727.72, "end": 4735.52, "text": "variante wie würdest du eine boomer docker und kupan etis erklären gar nicht wenn der"}, {"id": 613, "start": 4735.52, "end": 4739.92, "text": "typ keinen plastenschimmer von der technik ist es unglaublich schwierig das zu erklären"}, {"id": 614, "start": 4739.92, "end": 4744.16, "text": "eine erklärung finde ich nicht gut die leute sagen immer container sind wie vms aber doch"}, {"id": 615, "start": 4744.16, "end": 4749.08, "text": "nicht was er was erst mal alle verwirrt dazu kommt dass container mit vms gar nichts zu"}, {"id": 616, "start": 4749.08, "end": 4754.04, "text": "tun haben container ist ein sandbox prozess das versteht auch jeder mit ein bisschen technik"}, {"id": 617, "start": 4754.04, "end": 4761.72, "text": "know-how und erkennt sofort den unterschied zu einer vm leonis container sind prozess"}, {"id": 618, "start": 4761.72, "end": 4770.24, "text": "sandbox prozesse und kupan etis ist ein orchestrator für eben sandbox prozesse für leonis container"}, {"id": 619, "start": 4770.24, "end": 4780.36, "text": "ich meine was man was man immer als beispiel bringen kann ist was weiß ich wenn du deine"}, {"id": 620, "start": 4780.36, "end": 4783.96, "text": "hardware besser auslasten willst oder oder auch wenn es in der cloud macht wenn du vielleicht"}, {"id": 621, "start": 4783.96, "end": 4791.96, "text": "weniger bezahlen willst und du lauscht irgendwas es greifen 200 leute am tag drauf zu irgendein"}, {"id": 622, "start": 4791.96, "end": 4797.76, "text": "großer youtube channel macht mal ein video drüber und auf einmal greifen 5000 leute"}, {"id": 623, "start": 4797.76, "end": 4802.28, "text": "in der stunde oder so drauf zu und dann ist natürlich cool wenn du deine anwendung relativ"}, {"id": 624, "start": 4802.28, "end": 4806.72, "text": "easy skalieren kannst dafür ist was wie kupan etis super aber und das darf man nicht verschweigen"}, {"id": 625, "start": 4806.72, "end": 4811.4, "text": "das alleine macht die skaliert die anwendung immer noch nicht also sprich die anwendung"}, {"id": 626, "start": 4811.4, "end": 4819.8, "text": "muss auch so gebaut sein dass die ordentlich skaliert diagonal natürlich also über horizontal"}, {"id": 627, "start": 4819.8, "end": 4823.56, "text": "und vertikal skalieren sind wir schon raus wenn wir skalieren allgemein nur noch diagonal"}, {"id": 628, "start": 4823.56, "end": 4831.68, "text": "ne seafile habe ich mir nicht anguckt soll ich das mal machen können ich machen wo habe"}, {"id": 629, "start": 4831.68, "end": 4845.72, "text": "ich es denn hier streamideen so seafile exzellent so das haben wir geupdatet reboot bam wo ist"}, {"id": 630, "start": 4845.72, "end": 4851.88, "text": "wo ist meine usb netzwerkarte meint ihr der raspberry pi hat da überhaupt treiber für"}, {"id": 631, "start": 4851.88, "end": 4857.88, "text": "so ein ding das ist doch schon ein bisschen was schnelles ein bisschen was spezielles"}, {"id": 632, "start": 4857.88, "end": 4872.84, "text": "nicht schnelles schnelles auch wenn es geht spezielles was ist da was ist da für chip"}, {"id": 633, "start": 4872.84, "end": 4883.36, "text": "drin sieht man das weil das eigentlich egal ist wenn es über usb geht schauen wir mal"}, {"id": 634, "start": 4883.36, "end": 4889.92, "text": "gucken wir mal ob es funktioniert stimmt das in usb netzwerkern braucht ja gar kein spezielles"}, {"id": 635, "start": 4889.92, "end": 4903.44, "text": "so schauen wir mal so erst mal erst mal ssh copy id jawoll muss ich den chat hier oben"}, {"id": 636, "start": 4903.44, "end": 4911.44, "text": "lassen sonst weiß ich nicht wo stehen geblieben bin jetzt können wir uns einloggen ohne passport"}, {"id": 637, "start": 4911.44, "end": 4926.16, "text": "sehr gut so da ist es und ich muss mal kurz schauen wir mal in dem mess konnte man da"}, {"id": 638, "start": 4926.16, "end": 4934.24, "text": "eigentlich auch so was wie f machen oder so folgen geht das das geht ja wahrscheinlich"}, {"id": 639, "start": 4934.24, "end": 4943.48, "text": "netter aber gibt es nix eingebautes wäre cool wenn es das geht aber das minus weh ich wusste"}, {"id": 640, "start": 4943.48, "end": 4951.36, "text": "doch dass das irgendwie ging genau exzellent exzellent siehst du das sieht man mal wieder"}, {"id": 641, "start": 4951.36, "end": 4958.48, "text": "warum mein chat der einzig wahre die leute sind mittlerweile so big brain durch die ganzen"}, {"id": 642, "start": 4958.48, "end": 4964.6, "text": "subs dass ich eigentlich gar nichts mehr wissen muss ich muss einfach was sagen und der chat"}, {"id": 643, "start": 4964.6, "end": 4974.92, "text": "weiß es 500 IQ chat ja so und schließen wir das mal an und gucken gut das hat jetzt vielleicht"}, {"id": 644, "start": 4974.92, "end": 4978.68, "text": "den falschen anscheinend erweckt weil das hat jetzt den anscheinend erweckt als habe"}, {"id": 645, "start": 4978.68, "end": 4986.84, "text": "ich jemals irgendwas gewusst ich mache jetzt schon immer stream ohne ahnung zu haben so"}, {"id": 646, "start": 4986.84, "end": 4992.52, "text": "also ich stöpsel das mal an mal gucken ob er das jetzt erkennt register oder wird aber"}, {"id": 647, "start": 4992.52, "end": 5005.32, "text": "ganz schön heiß wie switch zu zwischen windows und linux control windows taste links und"}, {"id": 648, "start": 5005.32, "end": 5010.52, "text": "rechts feil du kannst nämlich unter windows verschiedene desktops machen ich glaube das"}, {"id": 649, "start": 5010.52, "end": 5014.96, "text": "kennst du wahrscheinlich das gab es also jeder hat schon mal gefragt was macht der knopf"}, {"id": 650, "start": 5014.96, "end": 5021.36, "text": "da unten ganz verschiedene desktops machen und mit control windows und feiltasten kannst"}, {"id": 651, "start": 5021.36, "end": 5027.28, "text": "du dazwischen switchen und hier habe ich einfach eine vm offen auf dem zweiten desktop also"}, {"id": 652, "start": 5027.28, "end": 5031.8, "text": "sprich ich switch einfach die desktops und auf dem zweiten desktop ist die vm offen was"}, {"id": 653, "start": 5031.8, "end": 5037.32, "text": "für mich die deutlich bessere variante ist als dual boot und auch die bessere kombination"}, {"id": 654, "start": 5037.32, "end": 5041.44, "text": "als umgedreht windows unter linux weil linux unter windows läuft einfach 1000 mal besser"}, {"id": 655, "start": 5041.44, "end": 5048.8, "text": "als windows unter linux so ähm wo habe ich das netzwerk kabel ich war netzwerk kabel"}, {"id": 656, "start": 5048.8, "end": 5054.84, "text": "ja exzellent exzellent netzwerk kabel mal kurz gucken das ist das da liegt so da liegt"}, {"id": 657, "start": 5054.84, "end": 5063.8, "text": "nämlich eine ikea tasche drauf auf dem netzwerk kabel mit ähm allen kabels drinnen gucken"}, {"id": 658, "start": 5063.8, "end": 5070.52, "text": "dass ich das jetzt rausgezogen bekomme ja ja komm komm her komm her auf jawohl sehr"}, {"id": 659, "start": 5070.52, "end": 5087.2, "text": "gut ups fuck ich bin angeblieben warte mal ich mache mal das headset ab ich stöpsel"}, {"id": 660, "start": 5087.2, "end": 5111.36, "text": "mal an gucken ob das zünkt hey oh oh das ist nicht gut leute da stimmt was net das ist"}, {"id": 661, "start": 5111.36, "end": 5136.72, "text": "ich habe mal wieder rausgezogen ok das ist definitiv nicht normal das ist definitiv nicht"}, {"id": 662, "start": 5136.72, "end": 5149.28, "text": "normal was das zünkt was zum da crash der netzwerk treiber oder"}, {"id": 663, "start": 5149.28, "end": 5175.24, "text": "irgendetwas der fährt sich die ganze zeit hoch und runter aber guck mal der holt sich"}, {"id": 664, "start": 5175.24, "end": 5195.6, "text": "die ich leute ich trau dem frieden nicht ich trau dem frieden nicht das stimmt doch was"}, {"id": 665, "start": 5195.6, "end": 5202.92, "text": "nicht so ich ziehe jetzt ich ziehe jetzt mal die eigentliche netzwerk karte raus und"}, {"id": 666, "start": 5202.92, "end": 5208.84, "text": "ich wette dann bricht ab auch hier unten hier sind wir eigentlich über die zweite netzwerk"}, {"id": 667, "start": 5208.84, "end": 5216.2, "text": "karte verbunden hier unten aber ich wette es bricht ab auch wenn ich die ja ich bin"}, {"id": 668, "start": 5216.2, "end": 5221.28, "text": "nämlich ich bin nämlich nicht wirklich über die über die zweite netzwerk karte drin doch"}, {"id": 669, "start": 5221.28, "end": 5233.0, "text": "bin ich moment also das ist doch definitiv nicht richtig was passiert hier eigentlich"}, {"id": 670, "start": 5233.0, "end": 5250.48, "text": "gerade eiperf ich habe keine gegenstelle zum eiperfen eigentlich alles gut ich habe keine"}, {"id": 671, "start": 5250.48, "end": 5261.56, "text": "gescheite gegenstelle zum eiper doch habe ich mein nass mein nass nee ich wollte irgendwas"}, {"id": 672, "start": 5261.56, "end": 5272.8, "text": "ich wollte irgendwas mit 10g haben meine vm macht ja maximal 1g wobei wartet mal wartet"}, {"id": 673, "start": 5272.8, "end": 5297.76, "text": "mal die vm ist 1g aber wir könnten mal nass probieren wir testen es erstmal so"}, {"id": 674, "start": 5297.76, "end": 5321.16, "text": "das leckt aber es fack ok netzwerk demask spam"}, {"id": 675, "start": 5321.16, "end": 5339.32, "text": "wir googeln mal danach spam spam login ist das log Leute wir sind nicht wir sind nicht"}, {"id": 676, "start": 5339.32, "end": 5359.56, "text": "die einzigen das problem haben f für 30 millisekunden ja manually compiling instanti"}, {"id": 677, "start": 5359.56, "end": 5364.88, "text": "ich wusste ernst ihr wollt doch nicht dass ich wirklich im netzwerk treiber da jetzt"}, {"id": 678, "start": 5364.88, "end": 5369.16, "text": "kompilier für oder das kann doch nicht euer ernst sein ok das ist ubuntu aber das ist"}, {"id": 679, "start": 5369.16, "end": 5392.48, "text": "bei bei dem jahren bestimmt genauso ok ich kompiliere den treiber aber jetzt wir machen"}, {"id": 680, "start": 5392.48, "end": 5401.16, "text": "erstmal ein eiper habe ich hier bei mir übrigens lokal auch drauf muss mal gucken ich habe"}, {"id": 681, "start": 5401.16, "end": 5407.68, "text": "den usb netzwerk adapter 2,5 gigabit usb netzwerk adapter der irgendwie nicht so ganz funktioniert"}, {"id": 682, "start": 5407.68, "end": 5431.92, "text": "das spammt ja als fack aller ok wie war das jetzt eiperf es"}, {"id": 683, "start": 5431.92, "end": 5441.44, "text": "ich kann mir das immer nicht merken genau minus s und jetzt war das eiperf minus c was"}, {"id": 684, "start": 5441.44, "end": 5452.32, "text": "habe ich hier für eine ip liegt leute wie der ip liegt war das so ok ok also der treiber"}, {"id": 685, "start": 5452.32, "end": 5462.4, "text": "funktioniert muss jetzt mal aufpassen dass ich nix leake"}, {"id": 686, "start": 5462.4, "end": 5485.76, "text": "oh shit ich hab mein key nicht da drauf ach nee das ist ja auch max please ha bäm eiperf"}, {"id": 687, "start": 5485.76, "end": 5501.08, "text": "also über 10 g in anfüllung strichen das hat selbst zu wenig pc express performance"}, {"id": 688, "start": 5501.08, "end": 5529.64, "text": "kein quake warum geht das nicht ihr habt recht leute ihr habt natürlich recht der chat weiß"}, {"id": 689, "start": 5529.64, "end": 5542.24, "text": "wieder bescheid ich sag doch 500 iq chat warum ist das schlechter alter warum ist das auf"}, {"id": 690, "start": 5542.24, "end": 5559.84, "text": "dem c warum ist das auf der kiste mit 10 g schlechter keck weight was hatte das ding"}, {"id": 691, "start": 5559.84, "end": 5588.48, "text": "ist aber für der ip keck weight aber retry alter oh was da kaputt aber umgedreht nicht"}, {"id": 692, "start": 5588.48, "end": 5595.88, "text": "oder aber ihr habt ihr habt ihr den namen von der kiste gesehen da freut sich der chat"}, {"id": 693, "start": 5595.88, "end": 5610.96, "text": "bestimmt ok wir testen noch mal wir testen noch mal den speed zwischen"}, {"id": 694, "start": 5610.96, "end": 5627.88, "text": "connect ja gut da ist volle pulle also sofern es halt vor der vm geht stimmt minus er hast"}, {"id": 695, "start": 5627.88, "end": 5633.2, "text": "recht habe ich ganz vergessen ja das geht auch von windows aus kann man übrigens nicht"}, {"id": 696, "start": 5633.2, "end": 5645.96, "text": "genau ausprobieren weil die iperf implementierung von windows kaputt ist"}, {"id": 697, "start": 5645.96, "end": 5652.92, "text": "pass mal auf iperf implementierung von windows ist kaputt ach so ja lull die hat trotzdem"}, {"id": 698, "start": 5652.92, "end": 5662.2, "text": "keine 10 g anbindung hier ja ich habe ich habe nichts anderes auszuprobieren also könnte"}, {"id": 699, "start": 5662.2, "end": 5667.72, "text": "meine 4 he kiste starten mit den zwei 10 g karten drin aber das muss jetzt nicht muss"}, {"id": 700, "start": 5667.72, "end": 5675.2, "text": "jetzt nicht sein ich könnte höchstens die 10 g netzwerk karte von meinem desktop mal"}, {"id": 701, "start": 5675.2, "end": 5679.2, "text": "kurz anschließen aber dann bricht wahrscheinlich das stream ab weil er wieder nicht checkt was"}, {"id": 702, "start": 5679.2, "end": 5693.44, "text": "sache ist ok also das schauen wir uns mal wieder aus also die netzwerk karte glaube"}, {"id": 703, "start": 5693.44, "end": 5711.84, "text": "ich können wir schon mal sagen die funktioniert prinzipiell aber die hat so ein paar probleme"}, {"id": 704, "start": 5711.84, "end": 5728.68, "text": "mit empfangen könnte auch das usb vom raspberry sein"}, {"id": 705, "start": 5728.68, "end": 5741.8, "text": "das wird ja immer mehr sagt man wird das mehr wenn man was überträgt moment cake wait"}, {"id": 706, "start": 5741.8, "end": 5754.44, "text": "wird das mehr wenn man was überträgt nicht wirklich oder probiert auch mal die usb karten"}, {"id": 707, "start": 5754.44, "end": 5759.92, "text": "direkt an einem rechner zum nass oder ist eine gute idee wir können usb wir können"}, {"id": 708, "start": 5759.92, "end": 5765.64, "text": "die usb netzwerk karte mal durchreichen an die vm das könnten wir tatsächlich mal probieren"}, {"id": 709, "start": 5765.64, "end": 5771.64, "text": "oder was machen wir jetzt mal gucken mal gucken was dann was das das probieren wir mal aus"}, {"id": 710, "start": 5771.64, "end": 5777.28, "text": "mal gucken was passiert ich gehe mal kurz hier was war vom pai raus und macht mal ein"}, {"id": 711, "start": 5777.28, "end": 5786.6, "text": "rechner dran ist das ein usb port nee moment ich brauche usb 3 port das ist 2 0 das ist"}, {"id": 712, "start": 5786.6, "end": 5801.0, "text": "3 0 glaube es passt nicht ein haus sonst kackt das stream wahrscheinlich ab an die vm hoffentlich"}, {"id": 713, "start": 5801.0, "end": 5815.08, "text": "checkt er das wenn man das direkt bei durch pest an die an die vm hat irgendwas erkannt"}, {"id": 714, "start": 5815.08, "end": 5825.8, "text": "rename usb ja da erkannt passt und der spam gar nicht kommt mal ich habe hier den aktuellen"}, {"id": 715, "start": 5825.8, "end": 5832.96, "text": "treiber hier passt das was für ein switch router wird getestet einen mikrotik 8 port"}, {"id": 716, "start": 5832.96, "end": 5842.76, "text": "2 10 g also 8 1 g 2 10 g und 4 port 10 g so usb wo ist die usb netzwerk karte das da"}, {"id": 717, "start": 5842.76, "end": 5847.36, "text": "ist das die usb netzwerk karte von der benahmung her wird es die einzig sinnvolle wahrscheinlich"}, {"id": 718, "start": 5847.36, "end": 5856.24, "text": "ne also if konfig minus i boah das habe ich schon lange nicht mehr gemacht haben wir hier"}, {"id": 719, "start": 5856.24, "end": 5867.2, "text": "zwei punkts keck weight was ist ein freie 87 bestimmt ab ne ach fuck wie ging das noch"}, {"id": 720, "start": 5867.2, "end": 5882.68, "text": "mal so alles klar if konfig weiß aus dem kopf wenigstens halbwegs ok alles klar so dann"}, {"id": 721, "start": 5882.68, "end": 5900.16, "text": "probieren wir das ganze mal zum nass er hat jetzt probleme mit der netzwerk karte oder"}, {"id": 722, "start": 5900.16, "end": 5925.04, "text": "was wartet mal wie hieß dieses kack ding noch mal ok da hat echt problem mit der netzwerk"}, {"id": 723, "start": 5925.04, "end": 5935.44, "text": "karte jetzt muss ich ihm bloß noch sagen dass er diese netzwerk karte verwenden soll da"}, {"id": 724, "start": 5935.44, "end": 5941.56, "text": "ist wahrscheinlich das beste ich mache einfach temporär die netzwerk karte mal aus das glaube"}, {"id": 725, "start": 5941.56, "end": 5950.0, "text": "ich deutlich einfacher kann man den man kann ich kann ihn einfach disabel ich kann jetzt"}, {"id": 726, "start": 5950.0, "end": 5974.36, "text": "einfach disabel im netfuck manager so ist jetzt weg jawoll excellent up ping ah ja sehr"}, {"id": 727, "start": 5974.36, "end": 5990.0, "text": "gut so jetzt sind wir sind wir drauf 231 alles klar ja das sieht auch schon moment las log"}, {"id": 728, "start": 5990.0, "end": 6000.64, "text": "in 87 alles klar iperf dings minus c ja ok das sieht jetzt schon ein bisschen besser"}, {"id": 729, "start": 6000.64, "end": 6009.16, "text": "aus ich meine sind nicht wirklich 2,5 muss ne 2,5 sind nicht aber man sieht auf jeden"}, {"id": 730, "start": 6009.16, "end": 6015.88, "text": "fall es ist mehr als eins das ergibt dann das ergibt schon sinn wie ging das minus"}, {"id": 731, "start": 6015.88, "end": 6036.6, "text": "minus er zum umdrehen das stimmt irgendwas nett das hat irgendwie"}, {"id": 732, "start": 6036.6, "end": 6054.32, "text": "ein bisschen probleme mit senden kann das sein das kann ich sein das ergibt keinen"}, {"id": 733, "start": 6054.32, "end": 6064.96, "text": "sinn warum sollte so probleme mit senden haben genau den chillfreak egal wir kompilieren"}, {"id": 734, "start": 6064.96, "end": 6069.04, "text": "uns jetzt den netzwerk treiber für für die respiratory pie ich ziehe das erstmal wieder"}, {"id": 735, "start": 6069.04, "end": 6097.08, "text": "raus hier wagen die netfucking an ja ist er weg ok alles klar er ist das ha was hat denn"}, {"id": 736, "start": 6097.08, "end": 6110.68, "text": "er wieder spend ok wir wissen ernsthaft den netzwerk treiber sebex hast du das teil also"}, {"id": 737, "start": 6110.68, "end": 6114.4, "text": "wenn du das gleiche problem macht dann sagt wahrscheinlich einfach nur hardcore das teil"}, {"id": 738, "start": 6114.4, "end": 6120.88, "text": "ok linux treiber hier realtek die realtek website sieht ja immer so super vertrauenserweckend"}, {"id": 739, "start": 6120.88, "end": 6141.28, "text": "aus ja ok mac os mac os linux wo ist linux da download der massive firmware probleme"}, {"id": 740, "start": 6141.28, "end": 6156.6, "text": "dann brauchen wir mal den hier download kann man das kann man das direkt was realtek seid"}, {"id": 741, "start": 6156.6, "end": 6183.56, "text": "hier noch bei sin ja moment was zum skr k x dark patterns alda hier"}, {"id": 742, "start": 6183.56, "end": 6194.04, "text": "wunderbar wenn ich jetzt schnell bin kann ich vielleicht den download link cram und"}, {"id": 743, "start": 6194.04, "end": 6201.12, "text": "direkt hier reinhauen jetzt die frage ist das ist das da dabei"}, {"id": 744, "start": 6201.12, "end": 6230.16, "text": "48 k was ist denn da gz ok das ist anscheinend echt ok bundeship ist es nicht da xf zv"}, {"id": 745, "start": 6230.16, "end": 6236.72, "text": "ja was weiß ich denn das ist das"}, {"id": 746, "start": 6236.72, "end": 6262.16, "text": "ta einfach nur in ta ta x tracked 8"}, {"id": 747, "start": 6262.16, "end": 6268.56, "text": "moment der hat das hat er das jetzt"}, {"id": 748, "start": 6268.56, "end": 6272.84, "text": "der hat das vorher schon extrakt oder was"}, {"id": 749, "start": 6272.84, "end": 6289.8, "text": "so da ist er der realtek treiber so jetzt hat sich die preisfrage wie geht das ich muss"}, {"id": 750, "start": 6289.8, "end": 6293.56, "text": "bestimmt erstmal bild essential installieren sonst wird es wahrscheinlich auf jeden fall"}, {"id": 751, "start": 6293.56, "end": 6297.88, "text": "nicht funktionieren weil wir brauchen bild essential ist schon installiert ok gibt es"}, {"id": 752, "start": 6297.88, "end": 6307.64, "text": "da einen guide zu read me wer liest wer liest denn read me in 2020 read read me also was"}, {"id": 753, "start": 6307.64, "end": 6323.56, "text": "muss man if you want support s5 woll"}, {"id": 754, "start": 6323.56, "end": 6327.88, "text": "wupp z wir haben dafür bringen sie maut ich bin gerade über mein headset gerollt jetzt"}, {"id": 755, "start": 6327.88, "end": 6342.88, "text": "auf der einen seite nicht mal nur wartet mal"}, {"id": 756, "start": 6342.88, "end": 6350.28, "text": "so alles gut exzellent exzellent okay also was was wollen was wollen die von"}, {"id": 757, "start": 6350.28, "end": 6357.64, "text": "mir also wir brauchen kein break on lan fedora vor ubuntu na wir haben wir haben"}, {"id": 758, "start": 6357.64, "end": 6365.4, "text": "ja keine ubuntu wir haben den raspberry pie in debian aber okay das ist ein"}, {"id": 759, "start": 6365.4, "end": 6369.0, "text": "example muss man einfach einen make machen jetzt einfach einen make da drin"}, {"id": 760, "start": 6369.0, "end": 6372.48, "text": "oder was"}, {"id": 761, "start": 6372.48, "end": 6389.48, "text": "was zum"}, {"id": 762, "start": 6389.48, "end": 6401.56, "text": "wir kompilieren hier make modules haben hier eine ordentliche anleitung für drinnen"}, {"id": 763, "start": 6401.56, "end": 6408.52, "text": "make modules okay das funktioniert auf raspberry pie anscheinend nicht"}, {"id": 764, "start": 6408.52, "end": 6424.56, "text": "ich bräuchte kann hätte installieren oder ich muss kein sudo make install machen"}, {"id": 765, "start": 6424.56, "end": 6430.96, "text": "weil make install kann ich erst mal wenn er was kompiliert hat install ich muss"}, {"id": 766, "start": 6430.96, "end": 6439.24, "text": "bestimmt können hätte das oder so installieren könnte ich mir vorstellen"}, {"id": 767, "start": 6439.24, "end": 6445.04, "text": "weil der sagte er findet irgendwie keine er sagt er guckt hier nach lip modules"}, {"id": 768, "start": 6445.04, "end": 6448.24, "text": "irgendwas und da ist nix"}, {"id": 769, "start": 6448.24, "end": 6460.36, "text": "erst mal ein bisschen wasser das könnte man vielleicht mal die read me"}, {"id": 770, "start": 6460.36, "end": 6464.32, "text": "reinschreiben ein bisschen besser was man machen muss"}, {"id": 771, "start": 6464.32, "end": 6476.54, "text": "spari pie compile realtech driver okay"}, {"id": 772, "start": 6482.68, "end": 6490.12, "text": "mk d"}, {"id": 773, "start": 6490.12, "end": 6492.32, "text": "ja linux herr das habe ich doch gesagt genau"}, {"id": 774, "start": 6495.32, "end": 6497.72, "text": "Okay, okay, wir gucken wir gucken einfach mal"}, {"id": 775, "start": 6503.08, "end": 6505.08, "text": "Aller der spammt ganz schön rum ne"}, {"id": 776, "start": 6505.08, "end": 6524.6, "text": "Ach so ich habe gar kein t-max darauf auf jetzt installieren wir machen wir hinne"}, {"id": 777, "start": 6535.08, "end": 6541.32, "text": "Oh hier wirds big brain jetzt gleich noch"}, {"id": 778, "start": 6541.32, "end": 6549.16, "text": "alter raspberry pi come on wo ist das problem"}, {"id": 779, "start": 6549.16, "end": 6563.12, "text": "Zeig mal her wo ist das problem"}, {"id": 780, "start": 6563.12, "end": 6576.96, "text": "Ah ja exellent exellent okay so make ha sieht besser aus leute sehr gut es kompiliert"}, {"id": 781, "start": 6576.96, "end": 6583.84, "text": "und wir wissen ja alle wenn es kompiliert dann funktioniert es auch"}, {"id": 782, "start": 6583.84, "end": 6594.44, "text": "sehr schön so und jetzt was muss man jetzt danach machen und der mod minus"}, {"id": 783, "start": 6594.44, "end": 6611.84, "text": "ach nee after installing okay hoffe ich einfach mal okay nice wir machen das einfach mal wie es in der readme steht"}, {"id": 784, "start": 6611.84, "end": 6620.56, "text": "ja cheat 95 mir bleibt gar nichts anderes übrig weil guck mal meine netzwerkkarte spammt ein bisschen"}, {"id": 785, "start": 6620.56, "end": 6629.72, "text": "und was muss noch den da machen boot image okay und jetzt reboot ich mal und dann"}, {"id": 786, "start": 6629.72, "end": 6636.52, "text": "Mist ich bin ein kack noob ich hätte habe ich noch drinne war habe ich noch die ausgabe"}, {"id": 787, "start": 6636.52, "end": 6649.68, "text": "beträchtige mod probe mal gucken ob das reicht aber wahrscheinlich muss ich den alten unloaden okay wir"}, {"id": 788, "start": 6649.68, "end": 6676.6, "text": "rebooten mal das hat nix"}, {"id": 789, "start": 6676.6, "end": 6684.76, "text": "so und jetzt mal gucken ob das jetzt weg ist ich muss den alten treiber bestimmt noch bestimmt noch"}, {"id": 790, "start": 6684.76, "end": 6709.84, "text": "blacklist oder irgendwie sowas was er wie ist das ding warum nicht"}, {"id": 791, "start": 6714.82, "end": 6728.32, "text": "so"}, {"id": 792, "start": 6728.32, "end": 6730.32, "text": "Irgendwas drin"}, {"id": 793, "start": 6737.4, "end": 6739.4, "text": "Fuck"}, {"id": 794, "start": 6747.32, "end": 6749.32, "text": "Wo ist denn"}, {"id": 795, "start": 6749.56, "end": 6754.92, "text": "Ich war doch mal wie heißt das andere die aber wenn ich den jetzt unloade dann habe ich keine netzwerkverbindung. Ja"}, {"id": 796, "start": 6754.92, "end": 6761.24, "text": "Was ziemlich sagt aber dann mache ich einfach das kabel wie den respiree pysaps rein"}, {"id": 797, "start": 6770.64, "end": 6772.64, "text": "Ja gut dann machen wir es mal"}, {"id": 798, "start": 6774.64, "end": 6776.64, "text": "Das ding wird heiß alle leute"}, {"id": 799, "start": 6777.52, "end": 6779.52, "text": "Whatthef"}, {"id": 800, "start": 6779.6, "end": 6781.6, "text": "Ich krieg das kabel noch mal raus"}, {"id": 801, "start": 6781.8, "end": 6783.8, "text": "Das netzwerkkabel geht nicht mehr raus"}, {"id": 802, "start": 6783.8, "end": 6786.56, "text": "Das ist fest geschmolzen oder so keine ahnung"}, {"id": 803, "start": 6787.96, "end": 6789.76, "text": "Was das"}, {"id": 804, "start": 6789.76, "end": 6791.76, "text": "Das muss ja nicht raus reißen"}, {"id": 805, "start": 6792.44, "end": 6794.24, "text": "monka es"}, {"id": 806, "start": 6794.24, "end": 6796.24, "text": "Was das für ein kram"}, {"id": 807, "start": 6799.04, "end": 6801.04, "text": "Fest gelöt"}, {"id": 808, "start": 6802.52, "end": 6804.52, "text": "Was hatten wir für eine lp die da"}, {"id": 809, "start": 6805.92, "end": 6807.92, "text": "Ah ja sehr gut sehr gut"}, {"id": 810, "start": 6807.92, "end": 6812.68, "text": "Wie ist das ding"}, {"id": 811, "start": 6816.68, "end": 6818.68, "text": "Oh"}, {"id": 812, "start": 6823.56, "end": 6825.56, "text": "Wie soll das jetzt funktionieren er"}, {"id": 813, "start": 6825.56, "end": 6840.64, "text": "Kein schimmer alter"}, {"id": 814, "start": 6840.64, "end": 6842.64, "text": "Ist das so okay"}, {"id": 815, "start": 6842.64, "end": 6853.84, "text": "Er ist in use ja klar aber ich könnte ich ja doch können genau ich kann es einfach abmachen wir hoffen dass es dann"}, {"id": 816, "start": 6853.84, "end": 6872.6, "text": "Tja anscheinend braucht man das auch für das normale zeug das funktioniert schon mal net"}, {"id": 817, "start": 6872.6, "end": 6891.56, "text": "Das kann durchaus sein dass die internen usb hängt"}, {"id": 818, "start": 6891.56, "end": 6906.32, "text": "Was wie ist das ding jetzt noch mal was ich da hab 5 2"}, {"id": 819, "start": 6906.32, "end": 6912.32, "text": "Der sollte das aber eigentlich"}, {"id": 820, "start": 6912.32, "end": 6925.48, "text": "Genau das gleiche problem habe ich auch genau das gleiche problem habe ich auch kann man hier mit minus v oder irgendwie sowas machen"}, {"id": 821, "start": 6925.48, "end": 6953.08, "text": "Der lautet das nicht"}, {"id": 822, "start": 6953.08, "end": 6963.48, "text": "Was muss ich machen leute sagt mir forum please"}, {"id": 823, "start": 6963.48, "end": 6971.48, "text": "Schreibt einfach was ich machen muss"}, {"id": 824, "start": 6971.48, "end": 6984.64, "text": "Als ernsthaft diese scheiß forums antworten immer so weißt ihr so nach dem motto es geht nicht"}, {"id": 825, "start": 6984.64, "end": 6988.12, "text": "Ja aber leute wo ist denn überhaupt der sinn warum möchte man sowas denn machen"}, {"id": 826, "start": 6988.12, "end": 6995.04, "text": "Können wir das mal erklären ist doch komplett used das warum willst du sowas denn machen geile forums antwort immer alter diese spazten im forum"}, {"id": 827, "start": 6995.04, "end": 7004.48, "text": "Wie hat er den kram denn jetzt überhaupt hingekriegt dass er den scheiß lädt"}, {"id": 828, "start": 7004.48, "end": 7017.84, "text": "Wie hat er das dann hingekriegt wie hat er das dann hingekriegt dass er das lädt"}, {"id": 829, "start": 7017.84, "end": 7027.4, "text": "Wie hat er das dann hingekriegt wie hat er das dann hingekriegt"}, {"id": 830, "start": 7027.4, "end": 7049.84, "text": "Geiler tipp exzellent exzellent genau das das ist das warum ich 2,5g gekauft habe"}, {"id": 831, "start": 7049.84, "end": 7062.44, "text": "Also eigentlich müsste das eigentlich müsste das damit schon gehen weil damit müsste das beim booten laden so macht er aber nicht"}, {"id": 832, "start": 7062.44, "end": 7088.08, "text": "Also eigentlich müsste das damit schon gehen weil damit sollte das beim booten laden weil damit sollte das beim booten laden"}, {"id": 833, "start": 7088.08, "end": 7096.52, "text": "Kein plan was sie von mir wollen"}, {"id": 834, "start": 7096.52, "end": 7108.6, "text": "Das sagt das sagt gar nichts ist lustigerweise ist nicht geladen und bei einer mod probe sagt es danach auch nichts"}, {"id": 835, "start": 7108.6, "end": 7128.76, "text": "Obwohl es keine fehler gibt witzigerweise"}, {"id": 836, "start": 7128.76, "end": 7141.88, "text": "Was ist das problem ich fürchte das wird immer gebacken"}, {"id": 837, "start": 7141.88, "end": 7163.72, "text": "Ok was macht der du make bla bla bla sudo mod probe das funktioniert bei dem auch"}, {"id": 838, "start": 7163.72, "end": 7182.56, "text": "Das haben wir auch schon gemacht"}, {"id": 839, "start": 7182.56, "end": 7194.08, "text": "Was minus groß war auch minus groß ich weiß nicht wo der Unterschied ist aber"}, {"id": 840, "start": 7194.08, "end": 7213.32, "text": "Das ist wie gesagt das mit den placklisten habe ich mir auch schon gedacht wo ging das noch mal etc modules das muss das muss doch"}, {"id": 841, "start": 7213.32, "end": 7233.0, "text": "Irgendwie anders funktioniert ich will nicht den einen geboten ich will den anderen verwenden"}, {"id": 842, "start": 7233.0, "end": 7247.72, "text": "Ja genau ok forum zeichnet was sinnvolles"}, {"id": 843, "start": 7247.72, "end": 7254.52, "text": "Ich meine letztendlich die adapter funktioniert ja prinzipiell aber"}, {"id": 844, "start": 7254.52, "end": 7263.6, "text": "Ja wie geht das genau wie geht das erzählst erzählts mir das haben wir alles gemacht clone"}, {"id": 845, "start": 7263.6, "end": 7284.52, "text": "Ja das haben wir alles gemacht haben wir auch gemacht"}, {"id": 846, "start": 7284.52, "end": 7299.08, "text": "Ok das probiere ich jetzt mal aus wo haben wir das denn hier drin"}, {"id": 847, "start": 7299.08, "end": 7315.08, "text": "Ja also da jetzt big brain hier kommt jetzt also das ist typisch das ist typisch"}, {"id": 848, "start": 7315.08, "end": 7340.68, "text": "Linux big brain geschichte also ok alles klar machen wir das da"}, {"id": 849, "start": 7340.68, "end": 7356.12, "text": "Aha aha nano null weh alter nicht spiel nicht nano ich glaube es geht los"}, {"id": 850, "start": 7356.12, "end": 7381.56, "text": "Was zum was wie jetzt ok mache ich ich macht es ohne scheiß ich weiß gar nicht wo es los geht"}, {"id": 851, "start": 7381.56, "end": 7397.68, "text": "Wo geht es ja los ok linux kram teilweise ok null bda und dann das hier 8156 ich hoffe mal das stimmt"}, {"id": 852, "start": 7397.68, "end": 7425.4, "text": "Das meinen die nicht ernst oder"}, {"id": 853, "start": 7425.4, "end": 7444.08, "text": "Ich habe ich habe put image updaten vergessen hast du gegen nano nix jeder kann hier verwenden was er"}, {"id": 854, "start": 7444.08, "end": 7454.84, "text": "Will aber mein fall ist es nicht ja log ich ein blies raspberry pi ich muss gleich pennen"}, {"id": 855, "start": 7454.84, "end": 7475.56, "text": "Ich wollte sagen dass plus ist blutet jetzt nicht mehr so jetzt wollen wir gleich gucken ob der jetzt irgendwie beim anstecken was was was neues macht"}, {"id": 856, "start": 7475.56, "end": 7488.04, "text": "Immer noch der gleiche scheiß ja gut ob das jetzt ob das jetzt reicht"}, {"id": 857, "start": 7488.04, "end": 7513.76, "text": "Das kann ja ernst sein das checkt doch keiner"}, {"id": 858, "start": 7513.76, "end": 7523.56, "text": "Es bleibt nicht mehr steckt ja auch nichts steckt ja auch nichts drin"}, {"id": 859, "start": 7523.56, "end": 7534.28, "text": "Ok das muss man anscheinend so machen"}, {"id": 860, "start": 7534.28, "end": 7549.8, "text": "Das habe ich schon ok ok dann stöpseln um"}, {"id": 861, "start": 7549.8, "end": 7553.88, "text": "Ok es macht jetzt gar nichts mehr das interface"}, {"id": 862, "start": 7553.88, "end": 7572.56, "text": "Oh fuck es blinkt wieder es blinkt wieder wie verrückt monka es das ist nicht das ist nicht weg"}, {"id": 863, "start": 7572.56, "end": 7578.24, "text": "Scheint hochkomplex zu sein das ganze"}, {"id": 864, "start": 7578.24, "end": 7584.12, "text": "Ne da lebt das auch gar nicht der habe ich schon habe ich doch gemacht"}, {"id": 865, "start": 7584.12, "end": 7588.88, "text": "Hab ich doch schon gemacht"}, {"id": 866, "start": 7588.88, "end": 7612.6, "text": "Und jetzt Rebooten noch mal Quatsch bringt gar nichts und ich doch eben schon mal"}, {"id": 867, "start": 7612.6, "end": 7631.68, "text": "Unload jetzt ernsthaft was weiß ich wie so eine kack ding erstelle"}, {"id": 868, "start": 7631.68, "end": 7636.88, "text": "Du kannst das nicht löschen wenn das aktiv ist da braucht das andere wahrscheinlich für den für die on board"}, {"id": 869, "start": 7636.88, "end": 7645.76, "text": "Netzwerk karte und chat hört mal auf zu backseaten mit dingern die schon vor 20 minuten ausprobiert"}, {"id": 870, "start": 7645.76, "end": 7654.36, "text": "Hab so geil es nicht funktioniert ok das gar nicht irgendwas hier in der in der"}, {"id": 871, "start": 7654.36, "end": 7677.88, "text": "Dings weil das kannst du nicht das kannst nicht löschen ist in use ja klar so"}, {"id": 872, "start": 7677.88, "end": 7681.88, "text": "Ja aber das das witzige ist dass das ja auch nicht funktioniert aber das liegt"}, {"id": 873, "start": 7681.88, "end": 7687.24, "text": "wahrscheinlich dann weil das andere schon geladen ist ich glaube das liegt"}, {"id": 874, "start": 7687.24, "end": 7696.48, "text": "nicht am patch das funktioniert glaube ich auch so"}, {"id": 875, "start": 7696.48, "end": 7712.48, "text": "Github Github kommt zeige ich her die Frauen Herren Agile genau hier hier"}, {"id": 876, "start": 7712.48, "end": 7722.4, "text": "Big Brain Manjaro Post die Blacklisten ne ne ich will den nicht"}, {"id": 877, "start": 7722.4, "end": 7729.16, "text": "Blacklist ich will ihn doch laden kann ich den anderen einfach Blacklist kann"}, {"id": 878, "start": 7729.16, "end": 7732.72, "text": "ich den anderen einfach Blacklist wobei das ist das ist doch jetzt so eine so eine"}, {"id": 879, "start": 7732.72, "end": 7741.16, "text": "so eine art Geschichte oder ich probiere ich probiere das jetzt einfach ich"}, {"id": 880, "start": 7741.16, "end": 7748.92, "text": "Blacklist jetzt das eine und wenn es dann ne Moment Blacklist muss ich das"}, {"id": 881, "start": 7748.92, "end": 7754.72, "text": "andere machen wie ist das andere cdc so"}, {"id": 882, "start": 7759.72, "end": 7765.96, "text": "jetzt 25 es gibt ja ist richtig"}, {"id": 883, "start": 7765.96, "end": 7780.28, "text": "was ist das da alles wait a minute was ist das da warum ist er warum sind da so"}, {"id": 884, "start": 7780.28, "end": 7803.24, "text": "dinger drin ist aber irgendwas anderes"}, {"id": 885, "start": 7803.24, "end": 7812.64, "text": "ich rieche jetzt noch mal ob das jetzt was gebracht hat"}, {"id": 886, "start": 7812.64, "end": 7815.84, "text": "wahrscheinlich nicht"}, {"id": 887, "start": 7815.84, "end": 7834.52, "text": "wahrscheinlich hat es alles nichts gebracht"}, {"id": 888, "start": 7834.52, "end": 7847.48, "text": "in die rule muss doch das aktuelle gerät was ls usb ausgibt"}, {"id": 889, "start": 7847.48, "end": 7865.56, "text": "moment da gibt's was das das probieren wir jetzt aus ok geht durch durch was"}, {"id": 890, "start": 7865.56, "end": 7879.36, "text": "das cp was macht das ding 50 das brauche ich alles klar excellent"}, {"id": 891, "start": 7879.36, "end": 7904.96, "text": "weiß zwar nicht genau was es macht das da cp nach was oder rules ok perfekt etc oder"}, {"id": 892, "start": 7904.96, "end": 7909.44, "text": "ich rieche jetzt trotzdem einfach nochmal so mal gucken das könnte"}, {"id": 893, "start": 7909.44, "end": 7913.08, "text": "tatsächlich sein dass es fast bringt da hätte ich mir nämlich den ganzen"}, {"id": 894, "start": 7913.08, "end": 7919.32, "text": "anderen crap sparen können im zweifelsfall sogar eher kontra"}, {"id": 895, "start": 7919.32, "end": 7932.32, "text": "produktiv ist auf riebute ich will nicht dass es leht weil wenn es leht dann ich"}, {"id": 896, "start": 7932.32, "end": 7940.84, "text": "habe vergessen wenn es leht dann stürzt es ab ich weiß nicht mal wie das ging"}, {"id": 897, "start": 7940.84, "end": 7946.04, "text": "muss immer so lange warten weil ich glaube ich habe es kaputt gemacht es"}, {"id": 898, "start": 7946.04, "end": 7950.48, "text": "geht gar nicht mehr das kriegt es kriegt kein link mehr"}, {"id": 899, "start": 7950.48, "end": 7958.64, "text": "ich habe jetzt so viel plack listed ich glaube ich habe zu viel plack listed"}, {"id": 900, "start": 7958.64, "end": 7967.4, "text": "ich hätte gleich die udorf rule kopieren sollen"}, {"id": 901, "start": 7967.4, "end": 7973.6, "text": "der kriegt jetzt gar kein link mehr"}, {"id": 902, "start": 7973.6, "end": 7979.52, "text": "moment ich mach mal on board ich mach mal on board wieder dran ob"}, {"id": 903, "start": 7979.52, "end": 7989.2, "text": "on board wenigstens noch geht nicht dass ich on board jetzt auch plack listed habe"}, {"id": 904, "start": 7989.2, "end": 7996.6, "text": "das war 230 und noch ich habe ich habe die on board auch noch plack listed"}, {"id": 905, "start": 7996.6, "end": 8003.16, "text": "ane ha ha ha okay das geht noch ich glaube das ding war einfach nicht"}, {"id": 906, "start": 8003.16, "end": 8016.72, "text": "richtig gestartet kann das sein das kriegt kein link mehr leute"}, {"id": 907, "start": 8021.16, "end": 8025.72, "text": "sinkt das ding kriegt kein link mehr ok ich lösch den scheiß mal wieder den ich"}, {"id": 908, "start": 8025.72, "end": 8031.24, "text": "da in modules gemacht habe das war mal jetzt schnell noch und dann"}, {"id": 909, "start": 8031.24, "end": 8041.96, "text": "gespennt so etc modules ne mod probe was habe ich dafür für"}, {"id": 910, "start": 8041.96, "end": 8061.4, "text": "ein crap gemacht rm gleich mal wieder so ich hoffe einfach mal die die die udorf rule funktioniert"}, {"id": 911, "start": 8061.4, "end": 8070.88, "text": "tut das noch"}, {"id": 912, "start": 8070.88, "end": 8084.36, "text": "ich dachte eigentlich können wir gut ich meine wir können auch ohne probleme damit morgen mal die"}, {"id": 913, "start": 8084.36, "end": 8092.8, "text": "switcher testen weil ganz ehrlich ob das bemt oder nicht ist doch erstmal egal wobei da auf"}, {"id": 914, "start": 8092.8, "end": 8095.48, "text": "jeden fall irgendwas nicht stimmt da verliert wahrscheinlich zwischendurch die verbindung"}, {"id": 915, "start": 8095.48, "end": 8110.56, "text": "so ok jetzt stöpseln um noch mal aus long hat jetzt irgendwas geschrieben hier vorn was war"}, {"id": 916, "start": 8110.56, "end": 8122.72, "text": "das r8 noch was guck mal guck mal jetzt erkennt dann oder auch nicht equate"}, {"id": 917, "start": 8130.24, "end": 8132.16, "text": "ok ob"}, {"id": 918, "start": 8132.16, "end": 8144.2, "text": "er nicht findet ich check nicht aber ich stöpseln noch mal um und jetzt pochern pochern"}, {"id": 919, "start": 8144.2, "end": 8152.44, "text": "pochern da kriegt kein link das ist geil da baut jetzt einfach keine verbindung mehr auf"}, {"id": 920, "start": 8152.44, "end": 8163.24, "text": "ist auch top ich gucke mal in meinen router rein ob der jetzt andere dhcp sich gezogen hat"}, {"id": 921, "start": 8163.24, "end": 8184.12, "text": "oder so vielleicht das ist knoam terminal dhcp 30"}, {"id": 922, "start": 8184.12, "end": 8200.32, "text": "jetzt kriegt er mit der udorf rule kriegt er kein link mehr ist ja auch geil"}, {"id": 923, "start": 8200.32, "end": 8215.56, "text": "top ok drauf geschissen wisst ihr was leute zack zack ab damit spary pie aus können auch"}, {"id": 924, "start": 8215.56, "end": 8220.44, "text": "die switcher morgen ohne ohne das ding testen hat mir nur gedacht das wäre cool zu gucken ob"}, {"id": 925, "start": 8220.44, "end": 8233.2, "text": "das ding auch 2,5 g kann soll ich gucke jetzt noch mal schnell chat ich habe bestimmt sich"}, {"id": 926, "start": 8233.2, "end": 8251.32, "text": "sachen übersehen halt irgendwas wichtiges übersehen habe sagt noch mal bescheid was"}, {"id": 927, "start": 8251.32, "end": 8275.12, "text": "ich muss firmware update machen rc 12 auf fack alles schlimmes ja sorry alles ab die ich übersehen"}, {"id": 928, "start": 8275.12, "end": 8280.12, "text": "habe nice dankeschön dass ihr gesagt habt massive subscriptions wieder bin ich mir sicher ich habe"}, {"id": 929, "start": 8280.12, "end": 8287.12, "text": "gerade irgendwie mein fenster verschoben ich gucke gerade noch mal schnell den haben wir"}, {"id": 930, "start": 8287.12, "end": 8310.28, "text": "dann am start hallo hat subscribt aber falle keck weight ja so sieht es aus big brain subscribt"}, {"id": 931, "start": 8310.28, "end": 8318.84, "text": "vor 54 und auch bei dir hoffentlich platzter kopf demnächst massive IQ boost danke für die"}, {"id": 932, "start": 8318.84, "end": 8326.12, "text": "ganzen subs habe ich noch was übersehen kloomstick den hatten wir schon nice tja vielleicht kriege"}, {"id": 933, "start": 8326.12, "end": 8341.28, "text": "ich das morgen hin mit dem mit dem treiber mal gucken ich habe eine power inter plattform"}, {"id": 934, "start": 8341.28, "end": 8355.64, "text": "nix besonderes low power internet plattform 80 euro fürs mainboard inklusive cpu software"}, {"id": 935, "start": 8355.64, "end": 8371.4, "text": "0.2 server 0.2 server drauf und sonst alles mögliche was ich brauche aber nix nix irgendwie"}, {"id": 936, "start": 8371.4, "end": 8377.36, "text": "kein proxmox kein unrate oder irgendwas 0.2 server drauf docker compose für ein paar sachen"}, {"id": 937, "start": 8377.36, "end": 8389.44, "text": "die sprach samba server fertig reicht das ding kriegt er eh maximal 5 g hin weil das hat"}, {"id": 938, "start": 8389.44, "end": 8395.4, "text": "zu wenig pizzi express lanes es hat zwar eine 10 g karte drinne und auch eine ssd die ordentlich"}, {"id": 939, "start": 8395.4, "end": 8413.4, "text": "was packt aber die pizzi express lanes reichen nicht für komplettes 10g es ist quasi 5g"}, {"id": 940, "start": 8413.4, "end": 8417.12, "text": "das kann sein ja sind einige aus dem chat dabei gewesen"}, {"id": 941, "start": 8417.12, "end": 8430.6, "text": "den besten türstopper den wir hatten waren 15.000 euro san switch ok der hat bestimmt"}, {"id": 942, "start": 8430.6, "end": 8435.24, "text": "jetzt auch keine 15.000 euro mehr gekostet als wir ihn als türstopper hatten der war"}, {"id": 943, "start": 8435.24, "end": 8457.64, "text": "nicht umsonst türstopper ok leute also jetzt mein soundtrack nicht wir sehen uns machts"}, {"id": 944, "start": 8457.64, "end": 8468.92, "text": "gut bis dann see you"}]}