{"text": "So, ich muss mal mein Headset entknoten kurz. So, ich muss mal mein Headset entknoten kurz. So, auf gehts. Hat Twitch schon gescheckt, dass der Stream on ist? Ok, jetzt wird die Musik grad entwenig exquisite. Ja, jetzt hat Twitch gecheckt, dass der Stream on ist. Leute, Hacker Mode aktiviert. Hallo, Chat. Ne, Moment, wie muss ich winken? So muss ich winken, oder? Ja, dass man was sieht. Hallo, Chat. Ja, ich hab gedacht, wenn ich die Kamera und den Tisch und den ganzen Krempel schon mal hier stehen hab, dann können wir das auch heute noch mal für was verwenden. Oh Leute, ich muss doch schnell was zu trinken holen. Ne, ne, das... Eins, eins kann ich euch sagen, es gibt zwei Sachen, die müsst ihr machen. Leona, 97, 18 Monate, dankeschön für den Sub, das ist Hyper Subscription, aber hier mal... Massive Life Hack, übrigens, Teams hat wieder mal Sound verstellt, ne? Ah, yes. Teams sackt einfach nur Hardcore. So, genau, wie gesagt, ich geh jetzt erstmal schnell was zu trinken holen. Es gibt uns Salami-E-Mode, ja, Wuppwurst, also, es gibt zwei Sachen, Huge Life Hack, Toxy, dankeschön für die 13 Monate Subscription, und zwar, es gibt zwei Sachen, die ihr unbedingt machen müsst, wenn ihr den ganzen Tag am Rechner sitzt, so wie ich, auch auf der Arbeit, jetzt danach noch mal. Ihr müsst einmal am Tag mindestens eine Stunde rausgehen, euch bewegen, ohne Scheiß, ich hätte nie gedacht, dass ich das mal sage, aber das ist wirklich nicht ohne, sonst kriegt man Kopfweh, es tut einem den Rücken, der Rücken weh und alles sackt, ja, und ihr müsst viel trinken. Jetzt kriegt ihr nämlich auch Kopfweh und es sackt auch, ordentlich trinken und am Tag eine Stunde draußen rumlaufen, reicht schon, ihr müsst keine krassen Sport-Men-Rumgesprinte machen, also, eine Stunde am Tag raus und sich ein bisschen bewegen und trinken. Krasse Fitness-Tipps bei mir, ich weiß, aber das hilft wirklich, also, wenn ihr Rückenschmerzen habt, wenn ihr Kopfschmerzen habt, wenn ihr irgendwas habt, bevor ihr anfängt, auch wenn ihr hohen Blutdruck habt, was auch immer, bevor ihr anfängt und irgendwelche Pillen nehmt oder sowas, geht eine Stunde am Tag raus, bewegt euch ein bisschen an der Luft und trinkt ordentlich was. So, gut, gut, dass ich das jetzt mal losgeworden bin, Leute, Chat, ich gehe jetzt mal kurz was zu trinken holen, wo wir gerade beim Thema sind, dann bin ich wieder da, by the way, Band-Emote, Anzeige ist raus, gleich wieder da, ich hänge fest, nur mein Headset. Also, ich bin jetzt übelst die Treppe raufgesprindet, also, ich hab so, pass mal auf, guck mal, ich weiß nicht, ob ihr das, mal gucken, ob ihr das auf der Kamera seht, ich geh mal kurz ins Vollbild, ich hab hier so eine Falte im Teppich und da hakt das mit meinem, das übrigens scheppt die Kamera, ne, da hakt das übelst mit meinem Stuhl, wenn ich da drüber fahr, wackelt glaub ich die ganze Kamera, ja, guck mal, nur wenn ich mit dem Stuhl über die Falte im Teppich fahr. So, wir müssen mal gucken, dass ein Busy grad wird, warte mal, ich mach mal den Teppich auf die Kamera, dann mach ich die Kamera grad, auf die Kamera, dann mach ich den Teppich auf die Kamera, also, der Teppich ist wirklich äußerst stabil, was nicht stabil ist, ist der Boden, das ist hier kein super massives Betonzeug, was der Opa da gebastelt hat, also, guck mal, wenn ich jetzt Pepo Fett hier springe, das ist nicht der Tisch, guck mal, das ist nicht der Tisch der wackelt, sondern das ist wirklich der Boden der wackelt und dementsprechend wackelt der Tisch halt auch. So, also, das kann man ein bisschen grad machen, das hier ist Schäpp, ach nee, da ist so diese komischen Dinger, glaub, der abisoliert Schämpf ist auch am Start, ne, ist ja noch Schäpper, ihr wollt jetzt noch Schäpper, ok, eigentlich ist es relativ, was ist denn ihr Schäpp jetzt, was ist das da, so, ist es jetzt, Leute, ist es jetzt weniger Schäpp, ja, der Mauszeiger, da kann ich grad nichts machen, der Mauszeiger springt immer in die Mitte und ich bin grad nicht am Rechner, ich schieb grad den Kram, übrigens heute kein Holzfällerhemd, also, das muss jetzt, ja, ich hab mir den, guck mal hier, das ist wirklich der Boden der wackelt, natürlich trägt er auch ein bisschen dazu bei, dass ich jetzt nicht pepo leichtgewischt bin, aber Elefant auch nicht, ja, ich hab mir den Switch geholt und im letzten Stream haben wir uns den Switch sogar mal angeguckt, im Detail, Detail, im Detail haben wir uns den angeguckt, so, also, ich hab mir folgendes gekauft, ich hab gedacht, das gucken wir uns halt mal im Stream zusammen, ich hab mir einen Raspberry Pi 4 Flirck Case gekauft, beste, und wir probieren das jetzt mal, hm, wisst ihr was noch richtig pro wär, wenn ich es irgendwie hinkriegen würde, dass das Overlay auf beiden Desktops ist, das ist man Jaro Linux mit i3 WM, ja, ich mein, ich kann einfach, ich kann einfach den Stream zweimal aufmachen, so, okay, das ist sproken, Leute, RIP, zweimal starten im gleichen Browser geht nicht, aber wir sind ja nice, der Hacker, man, wir machen jetzt einfach in Chrome auf, und im Chrome kann ich es bestimmt noch mal starten, wie auch nicht, daher, im Chrome kann ich es noch mal starten, null wie, oder, oder, Paints Champ, Post Champ, Post Champ, aber das geht noch, oder, ja, okay, was auch immer, vielleicht kann man nicht mehr als drei Verbindungen oder so machen, kann ja sein, Sticky Window, die dann auf jedem Workspace zu sehen, wirklich, ja, du meinst diese, du meinst diese Scratchpad-Dinger, echt, wirklich, das, oh nice, nice, zeigst mal her, das müssen wir jetzt gerade mal ausprobieren, Sticky, ne, Shift, ne, wie ist das, wie ist das andere Stack, Stack, also bei mir ist Stacking, Stacking brauch ich eh nicht, und jetzt Sticky, wirklich, geht das, hab ich noch nie ausprobiert, also das heißt, wenn ich jetzt dieses Fenster hier nehme und sag, Windows S, Windows S, ach ne, Layout weg, Sticky Toggle, okay, wenn ich jetzt dieses Fenster nehm, sag Picture in Picture, und sag jetzt Windows, Windows S, boah, Alter, Massive Brained hier, ist das das ja geil, richtige Hacker-Man, guckt euch das mal an, boah, ist das Poker so besser als OBS-Layout, der Chat ist wieder too smart für die Welt, aber die Leute haben einfach gesagt, das ist der High IQ, der ist nur möglich gewesen durch, wie viel Subs hab ich denn eigentlich aktuell, zeig mal, jetzt wieder ein bisschen runtergegangen in dem Monat, aber ich glaub's immer noch relativ viel, 321, ja, guck mal, es gab 321 mal IQ um 1 plus 1, komm mit, Dankeschön für den Twitch-Prime-Sub, d.h. wir haben jetzt im Durchschnitt, wenn man davon ausgeht, Durchschnitts-IQ ist 100, haben wir jetzt 421 IQ, da kann man solche Sachen schon mal drauf kommen, der Keks ist ein 3D, das ist das da, das ist das, der da, das ist ein 3D gedruckter Keks, so sieht's aus, Turbo-Dead-End, Sub'n und dann Instant-Prüfung bestehen, so ist es, genau, so sieht's aus, also ich hab mir dieses Case hier gekauft und wir werden jetzt das folgende machen, das was wir schon mal gemacht haben, und zwar wir flashen jetzt den Raspberry Pi mit einer ordentlichen SSD diesmal, ich hab hier schon, guckt mal, Massive-SSD liegen, Big Brain-SSD, Samsung, hallo, kann man das vielleicht mal irgendwie ordentlich dahinter, Samsung Endurance-SSD 64G, Leute, ich glaube ich spiegel mich auf der SD, MonkaS, beste, beste Micro-SD, hast du noch was mit dem Mikro-Text gebastelt, ja, da steht, da, guck, den verwenden wir heute als Switch für den Raspberry Pi, ja, ich sag manchmal Micro-SD und SSD verwechsel ich manchmal ein bisschen, aber ihr wisst was ich mein, ja, hier, Chat, Massive, also die sind wirklich nice, ausruggelt, habt ihr das gesehen, die verwenden wir heute, ich pack die mal, ich pack die mal kurz aus, eigentlich müssen wir da gar nicht ins Vollscreen schalten, oder, wenn ich die Dinger auspack, sieht man doch, wenn es klein ist, genauso, ich mein, und außerdem, ihr müsst mir nicht beim Auspacken zugucken, wer hat eigentlich, jetzt mal ernsthaft, wer hat eigentlich den, kann man das eigentlich vergrößern, boah, guckt, alter, ist das Big Brain, das ist ja Massive, huge, guckt euch das mal an, was aus, jetzt hat es geruckelt, was für ein geiles Zeug, mein Problem ist, ich hab keine Schere, doch, ich hab ne Schere, Meinung zu Linux Minia kann man verwenden, also was ich ja nicht verstehe ist, warum, wenn man, wenn man Micro SD Karten verpackt, Leute, oder, Micro SD Karten verpackt, ähm, warum macht man da nochmal ne Plastik, ne Plastik Layer dazwischen, dass man das nicht einfach aufreißen kann, was haben die sich denn da überlegt, weil guck, man kann den Scheiß nicht, das geht nicht, man kann den nicht aufreißen, weil da ist so ein Plastik Layer dazwischen, also, ich weiß, ich weiß gar nicht, wie man das eigentlich offiziell aufmacht, wenn nicht mit der Schere, weil man kann das irgendwie auseinanderreißen oder so, aber das sagt doch alles, das muss man eigentlich mit ner Schere ausschneiden, so, Diebstahlschutz, äh, das ist kein Diebstahlschutz, weil man kann, man muss das aufschneiden, anders kriegt man das nicht auf, die haben sogar hier extra sowas eingeplant, wo man aufschneiden muss, so, jetzt hol ich mal die olle Schere von der Oma, exellent, das ist auch übelste Verschwendung, finde ich, dass bei jeder Micro SD Karte dieses Ding hier dabei ist, dieser Adapter, der ist auch total useless, wie findest du das neue Lied von Flair, ich muss dir ehrlich sagen, ich hab noch nicht ein Lied von Flair gehört, also die einzigen deutschen Hip-Hop Sachen, die ich kenne, das sind ein paar Sachen von Haftbefehl, äh, es ruckelt ein bisschen, ne, wie gesagt, Goethe-Straße, Louis Vuitton-Store, zahl die Kollektion bar, fick auf Sponsor, einzige deutsche Deutschrap-Quote, was ich kann, Moneyboy kenne ich auch, die ein oder anderen Sachen, aber ich mag absolut keinen Hip-Hop, für mich ist gerade deutschsprachiger Hip-Hop und generell so, das einzige internationale Hip-Hop Zeug, was ich mir tatsächlich gut geben kann, war früher mal Eminem, aber so richtiger Hip-Hop Fan war ich noch nie, und für mich ist, wahrscheinlich sind jetzt wieder übelst viel offended, weil es ist ja modern offended zu sein, ähm, für mich ist Hip-Hop übelste Low-Brain-Musik, also wenn der Sub IQ++ gibt, gibt jedes Hip-Hop-Lied IQ minus minus, empfiehlst du immer noch C-Sharp als beste Programmiersprache? Ne, ich sag nicht, dass C-Sharp prinzipiell die beste Programmiersprache ist, ich sag, dass C-Sharp meine Lieblingsprogrammiersprache ist, und, und, ähm, sie ist halt, sie ist halt super für alle möglichen Anwendungen, ja und übrigens, Hip-Hop ist das 10++ der Musik, ja das, das, das kommt ungefähr hin, das trifft, das trifft's eigentlich ganz gut, Dis-Abo, nicht De-Abo Leute, als richtig krasser Gangster-Rapper-Hörer müsstest du eigentlich wissen, dass es Dis-Abo heißt, Dis-De-Abo, ähm, wann machst du wieder Stream zusammen mit Allotricks? Ja, wir, wir streamen ja auch sonst so oft zusammen, es ist jetzt wirklich mal an der Zeit, dass wir wieder zusammen streamen, ähm, was, was wollte ich jetzt noch sagen, empfiehlst du, warte mal chat, ich wollte das, beste, bringst beste Möglichkeit, beste Möglichkeit eine SSD fest zu halten, also wenn ihr was braucht, so irgendwie zum, zum schieren, bei, bei irgendwie bei irgendeinem Sporteignis oder so, macht euch einfach so ein Ding einen Daumen und winkt mit der, mit der, mit der, mit der Micro SD, so, also was wollte ich jetzt sagen, Moment chat, ja, ganz aus dem Konzept gebracht, also, siehste, das hab ich, das hab ich ganz vergessen, vielleicht wollte ich noch ein bisschen Deutschrap flamen, ich weiß es nicht, ist auch egal, äh, aber zu der Frage von, von Gunny, Gunde, also, wie gesagt, C-Sharp ist meine Lieblingsprogrammiersprache, das heißt nicht, dass das die beste Programmiersprache für alles ist, der große Vorteil ist, wenn du C-Sharp lernst, dass du, warum ruckelt denn das zwischendurch, was ist denn das hier, was, was soll das, Leute habt ihr das grad gesehen, über, über, Übertragungs, der Übertragungs-Champ funktioniert nicht, WLAN-Champ ist am abkacken, also, das schöne an C-Sharp ist, wenn du C-Sharp gelernt hast, du kannst damit mehr oder weniger alles machen, was du machen willst, das ist halt nice, ne, du kannst von Surfer-Anwendungen bis, äh, Web-Anwendungen bis ziemlich Low-Level-Geschichten, Audio-Video-Desktop-Krams, Mobile-Krams, wobei Mobile-Krams wäre nicht unbedingt meine erste Wahl, kannst du mit C-Sharp alles machen, das ist halt schön, und das finde ich gibt es so in dieser Form bei keiner anderen Sprache, gerade die Möglichkeit für Windows-Desktop haben wir, also, für Windows-Desktop ist es einfach das beste, was es gibt, Windows-Desktop ist ziemlich errotz, Windows-Desktop-Anwendungen zu machen, aber wenn dann mit C-Sharp, Dogue-Coin ist die Zukunft, die habe ich auch schon gehört, das ist kein Netzteil, das ist ein Switch da oben, das ist Manjaro mit i3-WM, das beste zum C-Sharp-Lernen, ja, so paar Kurse sind nicht verkehrt, aber was ich, was ich empfehle immer, wenn man einfach mal einen Einstieg sucht ist das hier, das da, das ist zwar, das ist zwar Visual Studio, also Visual C-Sharp 2012, das ist nicht wirklich aktuell, aktuell ist.NET Core 5, aber wenn du Kapitel 1 bis Kapitel, inklusive Kapitel 16 machst, den Westen kannst du vergessen, das brauchst du nicht, dann hast du schon mal eine ganz gute Übersicht über so die absoluten Basics und wir wissen ja alle, ich muss es nicht sagen Leute, mit was man anfängt, das ist nicht verkehrt, ansonsten gibt es so viele Webcasts und Tutorial-Videos und alles mögliche auf YouTube, da kommt man auch an Start mit und Zweifelfall kann man sich auch irgendeinen Kurs kaufen, aber da kann ich dir nichts empfehlen, hast du C-Sharp beim Physik gelernt, nein ich konnte das vorher schon, auf der Arbeit musst du ABAP entwerfen, ernsthaft, es gibt Leute, die ernsthaft ABAP machen müssen? Moment, oder war ABAP das SAP Zeug, war das dieses SAP, war das diese SAP Krämpel da? Ne, mit Java kannst du zum Beispiel keine schönen Windows Desktop Anwendungen machen, du kannst mit Java zwar Desktop Anwendungen oder generell GUI Anwendungen machen, aber die sind so ein bisschen Java Style halt, aber Java kommt in die Richtung ja, wobei Java weiß ich nicht, ob man iOS Apps mitmachen kann, na klar mit Elotrix zusammen, Warzone, auf gehts Leute, ja das ist aus dem 3D Drucker das Logo, F-Sharp kenne ich ja, kenne ich aber nicht gut aus, SAP, ok, wie findest du PowerShell, ziemlich gut, aber nicht als interaktive Shell, für Automatisierung ist PowerShell cool, ne iOS ist nicht only Swift und C-Sharp, das mag zwar die Native Geschichte sein, aber meiner Meinung nach die einfachste Variante für Mobile Apps sind entweder Flutter oder sowas wie Ionic, einfach JavaScript quasi Elektron für Mobile, dann hast du eine App für alles zusammen, mags wie lange muss man programmieren lernen um damit Geld verdienen zu können, das kann man nicht in Zeit messen, so aber, also bevor ich jetzt hier lange rumlaufe, ich kann jetzt ja gleich mit euch weiter labern, ich flash mal die SSD, äh die MicroSD, warum sag ich immer SSD, und warum ist da eigentlich immer dieses komische, dieses komische Adapter dabei, hier, dieser komische Adapter, wozu, wo wenn, ich hab also von diesen Adaptern, ohne Scheiß Leute, hab ich bestimmt 40, damit es nach mehr aussieht vielleicht, ok, jetzt geht immer noch richtig auf, guckt euch das mal an, Aufreißchamp, komm mal, und das ist der eine, das ist alles, alles das hier für so, für so viel Inhalt, ist natürlich, das ist natürlich gerechtfertigt, ne, dafür, also klar, exellent, so dann flashen wir das jetzt erstmal, schenkt das den Leuten, die du nicht magst zum Geburtstag, ich bevorzuge Leute, die ich nicht mag, zu ignorieren bzw. gar nicht in Kontakt mitzudrehten und denen schon gar nichts zum Geburtstag zu schenken, so wir flashen das mal nebenbei, also wie gesagt, wenn es noch was gibt Chat, schießt los, dann kann ich jetzt noch beantworten, wir haben ja noch Zeit, während das flasht, wenn ich die, wenn ich das rein bekomme, hallo, so schauen wir mal, wir hatten den Kram runtergeladen, ich lasse es jetzt mal oben eingeplendet, ich find das eigentlich ganz nice, hallo Chat, du kannst die Adapter auf der Gamescom raushauen, ja dann müsste ich auf die Gamescom gehen, ich hab gehört, ich hab gehört, auf der Gamescom kopiert man sich Fastpasse, fastpasses, nicht zu verwechseln mit DSL, fastpath, hat jemand eine gute, hat jemand eine gute, so ein Organizer für Micro SDs, Samsung Pro Endurance, beste, Grüße an Isle of Cookies, ja, ich hab mit ihm danach telefoniert und ich hab noch ein paar Sachen erfahren dazu, die sag ich jetzt aber nicht im Stream, weil erstens könnten da manche Leute Ärger kriegen und ich vielleicht auch, keine Ahnung, ich will da keinem auf die Füße treten, wir haben danach telefoniert noch mal und was da wieder für Dinger gelaufen sind, ich weiß schon warum ich mit dem ganzen YouTube Deutschland Crap nichts mehr zu tun hab, ja gut aber den da, also mal ernsthaft Leute, also den Kicks da, den findet ihr nicht auf Thingiverse, es sei denn irgendjemand hat meinen Kicks nachgebaut und auf Thingiverse gestellt, der da ist MaxSource Exclusive, so wo haben wir denn jetzt uns das aktuelle Raspberry Pi, ich hab es doch letztens erst runter geladen, Raspberry Pi OS Booster, da ist es, Booster, ich mein, Leute wir machen was anderes, ich zeig euch mal was, wir flashen aktuell das Ubuntu drauf, weil Ubuntu 64 Bit, da kann ich mehr Heat Generaten, VCG GAN, gibt's das unter Ubuntu? Weil das wär wichtig, damit kann man nämlich die Temperatur auslesen vom Raspberry Pi, da hat Windows, ja genau, ok ich glaub wir bleiben doch beim offiziellen Respian, gibt's bei Ubuntu ok, weil hier sieht es nicht so aus als gibt's das, ok wir probieren das jetzt einfach mal aus, ich zeig euch mal was cooles, wenn ihr Arch habt oder Manjaro habt, da gibt's so nen Tool, den Raspberry Pi Imager, ist eigentlich viel praktischer als mit Edger jedes mal den Kram zu machen, du kannst den Notexporter drauf schmeißen, wenn der das ohne diesen Kram auslesen kann, ja dann kann ich das machen, und jetzt starten wir das Ding, Raspberry Pi Imager und das ist viel angenehmer als den Kram jedes mal runterzuladen und zu flashen, Choose OS sagen wir einfach anderes OS, nee anderes OS, Ubuntu und dann nehmen wir 64bit, 20.10, ARM64, Bam, Choose SD Card, ich dachte eigentlich das hat er, Choose SD, wie ernsthaft, das erkennt er nicht noch, oh Gott, MonkaS, 3-Hat-Programm alter, what the fuck, alter doch, oi mate, oi, äh, er kennt ja, er erkennt ja die SD-Karte grad nicht, ok Leute, großer Nintendo Trick, PulseChamp, hallo, warum erkennt der denn jetzt nichts, der erkennt die micro SD-Karte nicht, but why, was ist das, ok jetzt ist die große preisfrage, wisst ihr was wir probieren, wir probieren jetzt diesen kack Adapter aus, aber es damit erkennt, der krümelt 2 Monate, dankeschön, ich hab noch irgendwo einen anderen SD-Karten-Leser, wartet mal, fuck den hab ich schon ewig nicht mehr verwendet, weil ich nicht, weiß nicht wo der ist, ich hab irgendwo noch einen anderen SD-Karten-Leser, liegt der hier oben vielleicht, nee, oi, ich hab den, ich hab ihn letztens irgendwo gesehen, ist er hier, hm, hier ist er nicht, hm, wartet mal, ich guck mal kurz hier neben, ob der hier neben liegt, SD-Karten-Champ, ist der Cam Link, aber kein SD-Karten-Leser, na gut, ich mein der Kram wird schon funktionieren, so, ich machs jetzt mal raus, jetzt nehmen wir mal diesen Müll hier und gucken ob wir das da irgendwie, hier muss man das da rein, erst mal abputzen und schon drauf fingern, so, zack, probieren wir mal ob es so funktioniert, ok Leute, ich reboote mal, ich mein prinzipiell erkennt er den Kram ja, was, USB-Disconnect, war das jetzt nicht durchgereicht, warum erkennt er diese Karte da drin nicht, was ist das schon wieder für ein Crap, ist die SD-Karte wirklich im Arsch, komm lass mal unter Windows gucken, lass mal unter Windows gucken, ist das, wie, CacWaite, unter Windows erkennt das, äh, jetzt bin ich aber ratlos, nee, nee am formatieren kann das nicht liegen, der muss das ja erkennen als SD-Karte, what the hell, was ist denn das für eine kacke, ok Leute, reboot, easy, nee die verschwindet ja unter Windows wenn man die unter Linux mountet, wüsste ich jetzt wo mein anderer Micro SD-Karten-Reader ist, ne, dann könnte ich den auch, könnte ichs mal ausprobieren, aber ich hab echt keinen Plan, wenn ich hier so am Schreibtisch rumguck, sind zwar Geräte da, die sehr ähnlich aussehen, aber der Micro SD-Karten-Leser ist nicht da, mal gucken ob es jetzt geht nach dem Reboot, Leute das ist doch noch, hat doch mit Lateisystem überhaupt nichts zu tun, wenn er das Device nicht mal findet, chat, CacWaite, wenn er noch nicht mal das Gerät an sich erkennt, dann ist es, das ist noch ein Schritt vor Fallsystem, ha, da ist sie, easy, Reboot, einfach Leute, einfach Rebooten, easy, alles gut, alles geregelt, einfach, einfach Rebooten, sehr schön, sehr schön, ok Champ, so, jetzt können wir endlich das machen, was ich eigentlich machen will, also OS auswählen, ist die Musik ein bisschen laut heute, ticken laut vielleicht, bisschen leiser, so, Reboot-Champ, hatte ich irgendeine Kernel-Update gestern noch gemacht, ach was doch immer, man weiß es nicht, aber, sag mal mal so, ne, auch mit Kernel-Update sollte eigentlich ein USB, ist wurscht, so, zack, Ubuntu, 64bit, Server OS, jawoll, Choose SD-Kart, da ist es, 64G, right, yes, so, man sieht die Dinger sind jetzt auch ein bisschen schneller, die sind jetzt auch ein bisschen schneller als die andere SD-Karte, ja, der muss auch nebenbei runterladen, welches Case, nein, dieses Case hier, da steht es ja schon drauf, the most beautifully crafted Raspberry Pi 4 Case, und wenn der Hersteller das sagt, wissen wir ja prinzipiell, dass das immer stimmt, hat uns jemals den Hersteller schon angelogen, glaub nie vor, die Hersteller sagen aus Prinzip immer die Wahrheit, 16 times the detail, so, jetzt kann ich mal ein bisschen Chat gucken, während das flasht, also, muss der das Image bei jedem Start neu runterladen, ne, ich glaub der cached sich das irgendwo, wie sieht denn das Case aus, so, passiv gekühlt, wir packen das gleich aus, aber erstmal muss ich den Raspberry Pi flashen, so, ich scroll jetzt mal kurz den Chat durch, ob ich irgendwas vergessen hab, zu beantworten, während der hier am flashen ist, also Chat, ich muss euch sagen, ich verstehe euren Reflex, wenn was nicht geht, den Self dazu zu geben, dass, den gleichen Reflex hab ich auch immer, wenn irgendwas nicht geht, aber es wäre schön, wenn ihr manchmal ein bisschen langsamer werdet, weil manche Sachen ergeben keinen Sinn, zum Beispiel, wenn man erst das Device nicht sieht, braucht man sich um das File System geile Gedanken machen, aber trotzdem, Big Brain Chat, wie immer, Maxwort plus Champ, ja, Slow Champ, has been written, ok, nice, continue, zack, und jetzt das allerwichtigste, was man sowohl unter Ubuntu als auch unter Raspian machen muss, ja, 30 FPS vm ist eindeutig zu wenig, viel, viel zu wenig, man muss den Kram mounten, ich hab's bestimmt noch in der History, mount, sdb mounten, oder halt da, wo euer SD-Karte ist, touch ssh, weil ansonsten könnt ihr euch nicht einloggen drauf, es suckt, so, gut, dann können wir die SD-Karte rausziehen, zack, zack, und können jetzt das ganze mal in den Raspberry Pi stecken und gucken, ob da alles startet, machen wir das hier mal weg, oh, da ist noch das alte drin, das leg ich mal hier oben in so ein Fach, dass ich's wieder finde, zack, gut, mir fällt grad auf, ich hab kein Netzwerkkabel, oder doch, oder hab ich die draußen alle im Schrank, wartet mal, ich werd hier doch irgendwo, ohne dass ich jetzt rausgehen muss, noch Netzwerkkabel rumfliegen haben, was ich nicht brauche, hm, ich hab aufgeräumt, manchmal hat es echt seine Nachteile, wenn man aufräumt, wenn man aufräumt ist danach nix mehr da, weiß nicht, ob ihr dieses Phänomen kennt, das ist wie, wenn man Unreal Tournament spielen will, da will man ja auch nicht, dass es lädt, nee, ich hab kein Netzwerkkabel mehr hier, ich hab alles aufgeräumt, top, Ordnungs-Champ, bin sofort wieder da, die neben mir, die neben mir, die neben mir, die neben mir. WLAN will ich in dem Fall jetzt erstmal nicht haben, so ich hab das längste Netzwerkkabel aller Zeiten geholt, also ich glaub ein viel kürzeres Netzwerkkabel werdet ihr nicht finden, Miniaturnetzwerkkabel, aber ich mein, für unsere Zwecke, wenn man das jetzt mal auseinander kriegt irgendwie, für unsere Zwecke soll das hier ausreichen, zack, so, was darfs sein, welcher Port, acht oder so, vier, vier, optimal Port, optimaler PogChamp-Port, so, Raspberry Pi Netzteil ist hier, dann schließen wir das jetzt mal an, so ein bisschen, sodass man das irgendwie gescheit sieht, so, und dann gucken wir mal, ob wir uns einloggen können, so, da muss jetzt eh erstmal die Festplatte, äh, nicht die Festplatte, die Micro SD-Karte muss der jetzt hier erstmal hier irgendwie, macht der was, ja, erstmal resizen und alles mögliche, seht ihr eigentlich, seht ihr, wartet mal, seht ihr, dass der Link aktiv ist, erkennt man das, ja, das sieht man, ne, vielleicht müsste ich den Switch noch ein bisschen, wartet mal, vielleicht mach ich den Switch noch ein bisschen hoch, dass man die Ports, die Ports besser erkennt, probieren wir mal aus, weil ich hab mir überlegt, das Setup, so, ist eigentlich ziemlich praktisch, du hast hier den Switch, du hast hier neben die Steckdosenleiste und hier kannst du alles machen drauf, und ich muss es nicht rumlaufen, das steht jetzt direkt am Fenster, ich muss eigentlich gar nichts machen im Endeffekt, das ist ganz, ganz nützlich, so, besser jetzt, erkennt man es jetzt besser, jetzt erkennt man noch besser, dass der Link an ist, oder, er macht keinen großen Unterschied, so, exquisite, so jetzt schauen wir mal, ob wir Verbindungen zum Raspberry Pi bekommen, machen wir das mal ein bisschen klein, das ist, ne, das ist kein SFP Plus Modul, das ist ein Direct Attached Kabel, du meinst das da, ne, hier, den da, das ist ein 7 Meter Direct Attached Kabel, das geht hinter in den Server Raum, so, wait a minute, den Raspberry Pi nicht erkannt, doch hier, kann das Ding aus 7 Millionen Megaflips, Paint's Champ, Paint's Champ Joke, also SSH, Copy ID, Ubuntu, ich glaube Ubuntu ist der Standard Login, yes, Ubuntu, Ubuntu irgendwie so war das Passwort glaube, oder was, Ubuntu Leer, oder was, Ubuntu Passwort, ach man musste sich erstmal ein, das ist, das ist, ne, ne, das ist Lowprane, Ubuntu Tackling, man muss sich erstmalig einloggen und ein neues Passwort vergeben und dann kann ich das Passwort deaktivieren, richtig hängen geblieben, so und jetzt, und jetzt geht das, richtig, richtig, richtig Lowprane, Moment, wo ist mein Ubuntu Emote, find's nicht, Lowprane Jubantu, ja, da sind wir am Start, das ganze ist jetzt deutlich schneller mit dieser SD Karte, mit dieser Mikro SD Karte als mit der anderen, wir hätten auch die, wir hätten auch die SSD nehmen können, so und jetzt gucken wir erstmal wie warm das ganze wird und jetzt gucken wir mal ob das stimmt, ob der Chat Recht hat, der Chat meinte nämlich, VC Gen ist auf Ubuntu vorhanden, das war nur der Sound, wieso ist das feste IP Adressen vergeben an ein Raspberry Pi per SSH, so kennste, ist das gar nicht, Raspberry Pi Config und gut ist, VC Gen ist nicht drauf, Chat, wer hat mich jebaited, achso, na, aber VC Gen CMD ist auch nicht drauf, ah man kann's aber nachinstallieren, ok nur halb jebaited, nur halb jebaited, ich will aber kein Nodexporter da drauf jetzt installieren und danach irgendwie im Grafana einrichten oder sonst was, ich will einfach die Temperatur auslesen, kann Sensors das eigentlich auch, von Kryptowagen hab ich keine großartige Ahnung, ok VC Gen CMD und jetzt, ich hab keine Ahnung wie die, Temperature, Measure Temp, ok, Measure Temp, exellent, also, CPU, CPU ist 48 Grad, Stress Suspension, so und jetzt machen wir mal ein bisschen Temperatur auf dem Ding, hallo Chat, das sieht voll, das sieht voll 3-Head aus, wenn ich winke und nur die halbe Hand drinne ist, das sieht an als, als er auslässt, ich kann irgendwen anfallen oder so, das sieht voll kaputt aus, hast du noch Passivkühler, nee das machen wir mit dem aktuellen Gehäuse, das gerade, also aktuell hab ich gar nichts, ich hab, guckt hier, Massive Brain Chat, hier, gar nichts drauf, absolut nackig, Xeroxin und Dankeschön für den Zap, warum benutzt du T-Max, weil's besser ist, weil du da so Big Brain Sachen machen kannst wie Splitten oder so und dann wieder, und dann wieder raus, reinzoomen und rauszoomen und Zeug und du kannst relativ easy sharen, was bei Screen auch geht, aber nicht so einfach ist, so, Watch, was war das, VC, Gen, CMD, Measure, Measurer Temp, so und wie sagt man bei Watch noch mal die Zeit wie er aktualisieren soll, N, ah yes, so, Hardtop, gucken wir uns mal an wie die Auslastung ist, so, ok, es war mal ein bisschen Temperatur, Stress, Minus Minus CPU 8, nee, CPU 4, jetzt bin ich mir nicht sicher wie es weiter geht, also wir machen Stress Leute, Temperatur geht rauf, 100% CPU Auslastung, hat der Raspberry Pi irgendeine Art von, keine Ahnung, Hyper Threading oder sowas, lohnt sich das mehr als, lohnt sich das mehr als 4 Threads zu starten, welches Case testen wir aktuell, es ist noch gar kein Case dran, aber wir testen dieses hier, das ist meiner Meinung nach beste Case, sowohl von der Verarbeitung her, als auch von der Optik, als auch, vielleicht nicht unbedingt Nummer 1 bei der Kühlleistung aber ausreichend. So, also es wird ordentlich warm, soll ich mal draufgreifen Leute, echt kann man das direkt auslesen, aus Zyster ist das natürlich auch nice, oh, Alter, das ist heiss as fuck, ob das nur 63 ist, ich weiß, au, das ist richtig heiss, die Argon Dinger sind richtig gut, das stimmt, aber die sind größer und die sind, finde ich, fast schon ein bisschen zu teuer. Wisst ihr was wir jetzt noch bräuchten? So eine Wärmebildkamera, die das erkennt, wie warm es ist, oder wir müssten uns einen ESP32 machen mit einem Temperatursensor, mit so einem DS20, bla, wie auch immer, ich kann einen Suspension machen, ja, und den dann da draufkleben, ok, das wird echt warm jetzt, ok, mach ich, ich mach genau das Kommando, was du geschickt hast, wird ja nicht allzu lange dauern, ah, siehste, Grip, geht schonmal nicht, Chat schickt Kommandos die nicht funktionieren, muss man da 4 machen, 3 Headchats, hast du ihn übertakt, ne, das können wir gleich noch machen, das können wir gleich noch machen, Suspension ist installiert, run, ah, yes, exzellent, hier lassen wir mal kurz Suspension, es gibt glaube ich schon eine Wasserkühlung, doch, ich glaube es gibt mittlerweile, es gibt mittlerweile eine Wasserkühlung, wir brauchen mehr Subscriber, ja immer, ich weiß nicht ob ich euch schon erzählt habe, dass wenn ihr einen Amazon Prime Account habt, dass ihr kostenlos einmal im Monat einen Streamer eurer Wahl unterstützen könnt auf Twitch, so, hier hast du deine Ausgabe, deine Suspension Ausgabe, exquisite, so und jetzt machen wir nochmal Stress und danach übertakten wir ihn nochmal, ja, kann man machen, also selbst ausdrucken ist auch eine Variante, allerdings aus dem 3D Drucker kriegst du ja keine wärmeleitenden Gehäuse raus, also keine Metall Gehäuse, wie lange Stress, solange bis sich die Temperatur nicht mehr nennenswert verändert, also das letzte Mal sind wir glaube ich hoch auf, frag mich nicht, 78 Grad oder so gekommen, mit dem letzten Pi 4, bevor wir es ins Gehäuse gebaut haben, in ein anderes Gehäuse, nicht in das Gehäuse, das Gehäuse hatten wir im Stream noch nicht, aber jetzt lassen wir ihn erstmal ordentlich, ordentlich Temperatur, und dann übertakten wir ihn, ich weiß gar nicht mehr wie das ging, ich glaube config.txt, Monster360 abonniert Twitch Prime, Dankeschön, Massive Sub IQ++ Dankeschön für die Subscription, Sellout hat gewirkt, ab und zu muss man ein bisschen Sellout machen, Pi Overclock, ich glaube man muss irgendwas in config.txt schreiben, ich habe, das ist Ubuntu drauf, ich habe kein config, also ich habe kein config oder so was, kann man das nachinstallieren, nee, übertakten jetzt, also hier, config, excellent, das ist super, dass in der config übertakten geht, aber angeblich geht das hier, wie sieht man die Clockspeed, das ist doch einfach nur, ach hier, Frequency, hier Frequency, Salken 21, Twitch Prime, Dankeschön für den Sub, so, Boot, config, nee warte mal, wo liegt das Ding, Moment wo, config, CacWaite, die gibt es bei mir gar nicht, CacWaite, ok da müssen wir mal suchen, Ubuntu Overclock Pi 4, tja Killcard, du musstest so schreiben, dass ich sehe, jetzt habe ich es zufällig mal gesehen, aber wenn die Fragen nicht explizit an mich gehen, dann sehe ich die nicht, ok wie übertaktet man da, man kann die Datei vielleicht einfach anlegen, hast du aktuell schon einen neuen Job, wenn ja wo, wenn man fragen darf, ich habe keinen neuen Job, ich habe immer noch den gleichen Job, Overvoltage, BAM, ok Leute, wir übertakken jetzt, config.txt und einfach jetzt diesen Kram da rein, ok wir übertakken jetzt von 1500 Mhz auf 2000 Mhz, ok schauen wir mal, mal gucken ob das so funktioniert, und wir overvolten auch, Nexonos, Twitch Prime, Dankeschön für den App, das YouTube Kündigungsvideo, ja ich weiß nicht, wie weit du es geguckt hast, aber in dem YouTube Kündigungsvideo erzähle ich nicht von meinem aktuellen Job, sondern dort wo ich meine Ausbildung gemacht habe, und am Ende erzähle ich auch, dass ich nach der Ausbildung dort gelandet bin, wo ich jetzt bin, ok mal schauen, übertaken hat nicht funktioniert, ok wait, ok vielleicht muss man Last verursachen, vielleicht muss man Last verursachen, dass es funktioniert, Stress, Stress, Stress, Jawoll, BAM, nope, ich hab doch rebooted, geht nicht, übertaken not, not possible, falsche Ordner, echt, ne oder, oh, Kirk Wade, Ups, äh, ok use config, hast du im Tätigse user, OMG, Info freqemity, ok, ich reboot nochmal, es aked Kann man das auch irgendwie mit dem VC Gen Tool machen? Die Musik ist übrigens laut auf einmal, ne? Passt eigentlich. So, mal gucken, was der jetzt sagt. Oh, startet er jetzt nicht mehr oder was? Ah, da ist er wieder. MonkaS. Dachte schon, er startet nicht mehr. Das wär jetzt jetzt echt gewesen. Bäm, 2 Gigahertz, jawoll, wow, 6000 Gigahertz, ne, ach ne, 600 Megahertz nur noch, alles klar. Okay, dann gucken wir doch mal, wie warm er jetzt wird. Stress, bäm. Ja, ja, alles ausgelastet. Oh ja, da wird schon ein bisschen wärmer jetzt, he? Wo ist ein Limit? Wo, wo ist ein Limit? Temperatur? Leute, ah, zählt das als Selbstverletzung im Stream, wenn ich mich da jetzt verbrenne? Werdest du dann gebannt? Ah, Leute, das ist übelst heiß, das geht gut ab. Okay, noch taktet er sich nicht runter, ähm, max Temperatur. Ja, und? Was, was, was, ab wann taktet er sich runter? 83 Grad. Also, der takt, also anscheinend noch nicht. Ah, über 85 Grad, okay, über 85 Grad taktet er sich runter. Das Flirrcase, ich hab's auf Amazon bei einem Drittanbieter gekauft, ich kann jetzt aber leider nicht genau sagen, für wie viel. Guck mal, zeigt die Taktrate. Ah, guck mal, jetzt vorbei, Leute, jetzt vorbei, jetzt wird's runtergetaktet. 86 Grad, jetzt vorbei, ich weiß gar nicht, ja, jetzt taktet er, taktet sich wieder hoch. Guck, der taktet sich hoch und dann ab jetzt fängt er an, sich wieder runterzutakken. Magfly, Dankeschön für den Sub, okay, ich würd sagen, das ist für Temperaturtest erst mal genug oder wollen wir ihn noch ein Stückchen übertakken, wollen wir noch mal gucken, ob noch ein bisschen mehr, wobei, wir sind jetzt schon am Limit, wir sind ja jetzt schon am Limit, ja, wir sind jetzt schon komplett Temperature-Limit, okay, ich würd sagen, das ist warm genug, nee, Ram-Over glaubt mir nicht, okay, der kommt ans Temperatur-Limit, dann würd ich sagen, dann nehmen wir jetzt mal das Gehäuse und bauen das Ding ein und gucken wir mal, guck mal, der taktet sich auch direkt runter dann, wenn er an 85 Grad kommt, siehst du gleich, direkt, okay, boah, Alter, das ist heiß, aber da kannst du fast ein Ei drauf machen, äh, so, dann schauen wir uns mal das Gehäuse an, würd ich sagen, ich switch mal kurz rüber oder wisst ihr was, ich mach einfach Fullscreen, viel besser, ei, der Chat hat da schon wieder komische, komische Ideen, also, dann packen wir das doch mal aus und gucken uns das an, ob das wirklich das Most Beautiful Crafted Raspberry Pi Case ist, überhaupt, schauen wir mal, so, wie geht denn das hier raus, so, okay, schon mal ganz nice verpackt, wollen wir mal rein, so, was haben wir denn hier, was haben wir denn hier, haben wir das Case drin und ansonsten nix, okay, das kann ich schon alles mal runterhauen, schmeiß ich mal alles hier auf die Erd, das brauchen wir nicht, hier ist das Case drin, da ist es, sieht recht unspektakulär aus, wir haben paar Schrauben, paar Schrauben, äh, ich denk mal, das ist der Boden, vermute ich mal, und das ist das Teil, das Ding ist wirklich relativ massiv, ja, weiß ich, ob man das, ob man das gut, gut hört, pass mal auf, also da ist schon ein bisschen, bisschen Metall, also, na, das, das ist schon recht massiv, das Ding und das kommt auf die, auf die, äh, CPU, by the way, aus welchem Grund hat denn das ein Loch hier drinnen, sollte das nicht besser planaufliegen und nicht hier ein Loch haben, wisst ihr was richtig pro wär, wisst ihr was richtig pro wär, hätt ich jetzt noch Wärmeleitpaste, hätt ich hier noch irgendwo Wärmeleitpaste, das wär mal massiv exquisite, oder, das ist kein Pet, oder ist da ein Pet dabei, wartet mal, ah hier ist ein Pet dabei, guck mal, aber ich glaub Wärmeleitpaste wär cooler, oder, ich hab aber, glaub, also ich hab definitiv noch, aber ich hab ja, wie gesagt, ich hab ja aufgeräumt, ähm, ich, Leute, ich kriech mal kurz hier runter, da liegt nämlich noch ne Ikea-Tasche mit ganz viel Kabeln drinnen, wo ich so die Überbleibsel, die muss ich noch wegräumen, wo ich noch so die Überbleibsel drin hab, vielleicht hab ich Glück, und da ist noch ein bisschen Wärmeleitpaste drin, weil das sind, das sind ganz viel alte Sachen drin, da könnte durchaus noch ein bisschen irgendwo Wärmeleitpaste, die gute der Bauer, der Bauer Wärmeleitpaste ist das, die ich da hier am Start hatte, irgendwie, Thermal Crissly Conduct, nee, nicht Conduct, Conductornaut ist das Flüssigmetall gewesen, äh, Cryo Cryonaut, oder so hieß das Ding, nope, nix dabei, schauen wir mal hier, ich krieg gerade ein bisschen auf die Erde rum, ne, ah, ah, was denn hier, Noctua, Noctua Lüfter, Pogchamp, Pogchamp, nein, beim Noctua Lüfter wär die Chance gut gewesen, dass es da irgendwo dabei wär, aber, nee, keine Ikea Tasche hat keine Wärmeleitpaste für uns Leute, keine Wärmeleitpaste, zwar, ist das hier, was ist das hier, ah, in your face, die gute Noctua Wärmeleitpaste ist es sogar, ich hab zwar irgendwie noch die Thermal Crissly gehabt, aber die tut's auch, oder, das ist nicht Pogch, da ich noch was auf die Stelle, bisschen Wärmeleitpaste gefunden hab, guckt euch das mal an hier, und zwar ist das Noctua NT H1, ok, wir können, wir können das jetzt ja mal, deswegen sind Noctua Lüfter auch so teuer, hat das einen erkennbaren Unterschied, Leute wir können das erstmal probieren mit dem Pad und dann mit der, was mein Mikrofon knattert, Saft, was knattert da, Jebait, ich hab ihn auf der Erde, ich bin eben auf der Erde rumgekrabbelt, da kann's durchaus sein, dass es knattert, achso, jaja, ich hab, bin eben auf der Erde rumgekrochen, ich würd erstmal Paste machen, sonst brauchst du ein neues Pad, stimmt, ja, ich hab keine Ahnung, ob das einen erkennbaren Unterschied hat, das könnte natürlich sein, Paste geht nicht wegen dem Abstand, oh nee, ernsthaft, geht das, ah, fuck oder, wartet mal, jaja, wir machen mal kurz ab, äh, Leute, ich schalte den Raspberry Pi mal aus, kurz, hat ja keinen Sinn, wir müssen ja nicht am lebenden Patient rumdoktern, achso, ja, warum geht das wohl nicht, wenn ich grad das Netzwerkkabel rausgezogen hab, keck wait, ah nee, okay, geht wieder, alles klar, hat sich erholt, ich mach mal aus, wir können Paste, Pad, Paste machen, oh ja, für noch bessere Bindung, moin, was machst du mit dem Pi, ich teste das, ob das Gehäuse taugt, ich hoffe mal, weil optisch und so von der, von der Quality fühlt sich das ja bisher am besten an von allen Cases, die ich so in der Hand hatte, also für den Pi, okay, ähm, jetzt probieren wir das mal aus, also wenn ich den Kram hier draufsetze, machen wir mal ab, hier machen wir auch ab, oh das Ding, ey, der ganze Raspberry Pi ist ultra heiß hier, nach der Burn-In Session da, so, das muss ja nämlich hier so rein, so, und die Sache, ups, mach ich das überhaupt richtig, so viel verkehrt kann man da ja eigentlich nicht machen, hier, so, oder doch, kann man da was verkehrt machen, keck, keck, wait, keck, keck, keck, wait, warum, wait, wait a minute, warum geht das nicht, äh, einfach mal drücken, ne, okay, oh Leute, Big Brain Finger Fertigkeit sind jetzt gefragt, oh please, Kamera Kurs, stimmt ja, das sollte ich vielleicht machen, äh, Big Brain Finger Fertigkeit ist gefragt, wie kriegt man es richtig rein, ich würde sagen, man muss einfach ein bisschen, einfach ein bisschen drücken, ich mein, ah, guck mal hier, hier raste, hier raste das dann ein, man kann das glaub einfach runterdrücken, ha, zack, easy, wow, ist drin, das Problem ist jetzt, ich hab keine Ahnung, ob das auffliegt oder nicht, man sieht es ja nicht, also, also, komm, Leute, wir nehmen das Pad, wir nehmen das Pad, scheiß auf, scheiß auf, scheiß auf Wärmelite, passt auf, wenn wir die nice Noctur Wärmelite passt haben, wir sehen nicht, ob das auffliegt und solange wir nicht sehen, ob das auffliegt, dann hat es keinen Sinn, mach doch dünn Paste und teste, hmmm, dünn Paste und testen, wo mach ich denn die Paste am besten drauf, äh, wahrscheinlich am besten, am besten hier, äh, wie funzt denn das überhaupt, muss man das drehen, ah ja, so, ha, macht das jetzt was, so, äh, ich bräuchte, ich bräuchte noch irgendeinen Spachtel oder sowas, ich bräuchte noch irgendwie so einen Spachtel oder sowas, um das zu verteilen, vielleicht, vielleicht beim Noctur auch sowas dabei gewesen, Noctur Spachtel, nee, kein Noctur Spachtel, aber sowas hier, ähm, exquisite, so, jetzt gucken wir mal, ob das ganze Kontakt hat, schauen wir mal, ich müsste ja, wenn es Kontakt hat, müsste ich es ja sehen, auf der CPU, was meint ihr, meint ihr das tut, meint ihr das geht, so, jetzt sollte, jetzt sollte ich eigentlich einen Fleck auf der CPU haben, wenn es richtig drauf ist, nope, nope, zu großer Abstand, ok Leute, äh, ich brauch mal ein Stück Klopapier, ich bin gleich wieder da, oder hab ich, hab ich hier irgendwie, ach komm hier, nimm mal das, geht auch, das von der Verpackung, das geht genauso, exquisite Wärmeleitpaste verschmieren, so muss das sein, jawoll, brauch ich mal eigentlich was ordentlich zum reinigen, ok, sauber genug, zack, mach mal das Pad drauf, ja, keine Küchenrolle da, keine Küchenrolle, dass wenn ich irgendwas umschmeiß, hab ich echt ein Problem, gut, dann machen wir dieses komische Pad drauf, ui, Tütenöffner, jetzt rechtssicht wieder, dass ich absolut keine Fingernägel hab, so, ok, also, ich würd sagen, wir pappen das, wir pappen das auf den, auf die CPU drauf, das ist besser, weil dann ist es auf jeden Fall zentriert, weil das Ding hier ist größer, oh, jetzt bräuchte man ein paar Grills mit Fingernägel, so, exzellent, muss noch den Rahmen da oben abmachen, ok, wunderbar, rein damit, kenne ihn, Simona, danke für den Zap, jetzt gehts net, doch jetzt, ey, what the, what the fuck, ich hatte so eben schonmal drin, was ist das für Three-Head-Scheiß, Three-Head of Doom ist das hier, oh, das geht noch mal rein, what the hell, wa, wa, wa, wa, warum, das ging doch eben schonmal, ich hatte so eben schonmal drin, what the fuck, das ging doch eben easy as fuck rein, guck mal eben, eben hatte ich einfach so, ah ok, bisschen Gewalt braucht man an der Stelle einfach, sieht so aus, so und jetzt sollte das ein Strauf pappen, gut, dann machen wir jetzt noch den Schraubchamp rein, passt das hier überhaupt, ja, passt, Moment, den Schraubchamp macht man hier unten durch, was ist das jetzt, so, so für die SSD, würde sagen, ich würde sagen, das muss so drauf und die SSD, und die SSD muss da so durch, die SSD mal raus, so, also ich würde sagen, so, so gehörts, anders gehts ja auch nicht, das schwarze ist Plastik, ja, anders gehts ja auch nicht, hier passt die SSD noch rein, Moment, ist falsch rum, ne, so rum ist glaube ich richtig, na jetzt guck mal, die haben extra schönes Loch hier für die, für die Micro SD drinnen, hier neben ist eine Aussparung, das ist wahrscheinlich für die LEDs, das man sieht, wenn die LEDs angehen, so, also schreiben wir das mal, ja ich sag immer SSD, obwohl es eigentlich eine Micro SD ist, frag mich nicht warum, irgendwie tue ich mir schwer, in meinem Boomer-Hirn, Micro SD und SSD im Eifer des Gefechts auseinander zu halten, Micro, Micro SSD, noch besser oder, Nano SSHD, ja das ist auch nicht schlecht, Schraube, Schraube, Schraube, exellent, so, gut, alles fest, sitzt, passt, fühlt sich auch recht hochwertig stabil an, sitzt auch ziemlich gut was die Slots angeht, sehr ordentlich, hier seht ihr das, hier hat das Gehäuse eine Delle oder so ein Loch, das ist nicht so gut, ich frag mich ja ob die mal einen Raspberry Pi bauen, der defaultmäßig auch über PoE geht, das wäre cool, so, wenn die das richtig gemacht haben, sollte man jetzt eigentlich hier die, hier die, die, die LEDs sehen, guck mal mal, ja guck mal man sieht, man sieht, ich weiß nicht ob ihr es seht, seht ihr das, ja ne, ja, exellent, gut jetzt bin ich mal gespannt wie warm das jetzt wird, schauen wir mal, ja man kann mit so einem Adapter das machen, der dann von PoE auf den Strom geht vom Raspberry und so, das habe ich schon gesehen, aber einfach PoE anstöpseln und geht, geht soweit ich weiß bei keinem Raspberry Pi, LED Champ, gut, also, Clock, Temp, Stress, jetzt, jetzt schauen wir mal, ok Auslastung ist wieder volle Pulle, so, mal gucken wie es jetzt hoch geht, was heißt PoE, PoE ist Strom übers, hier Strom übers Netzwerkkabel, was, YEP ist auch weg, YEP hatten wir nie aktiviert, jebaited, wir hatten Salami aktiviert, aber Salami war ja zu obszön, ok Gehäuse wird ein bisschen warm, Gehäuse wird ein bisschen warm, aber Leute es bleibt ja mal deutlich kühler, guckt mal, bei dem anderen war man mehr oder weniger instant, am Limit, 85 Grad, ne der kann das nur wenn du das passende PoE Head hast, der Raspberry Pi, da brauchst du so ein extra Board für PoE und dann geht das mit dem Raspberry Pi 3B+, aber einfach so out of the box geht das nicht, so also Temperatur ist absolut in Ordnung, Gehäuse wird recht, ist lauwarm überall jetzt, aber passt schon, passt, ist ok, ja ist in Ordnung, Doktor Max kontrolliert Temperatur, gut, ich würd sagen wir müssen jetzt noch mal ein bisschen weiter übertakken oder, weil ich mein einfach nur bei 60 Grad bleiben, das kanns ja jetzt nicht sein, welches Case ist das genau das da, Flirck Case, Flirck Case und aktuell gibt es das sogar hier schon für 21,90, was ich finde ein recht guter Preis ist, ok es ist weder das noch Chat at Price Champ, ich wollt eigentlich gucken was der Versand kostet aber ich glaub der Versand ist mit Prime in dem Fall auch kostenlos, kostenlose Lieferung ja, wie groß ist der Rahmen, der hat 4G, 4G, äh Moment, falsches Fenster, fast, fast, ja 4G, das Armor Case, ja es gibt ein paar gute das kenn ich doch nicht, das Argon Case ist auch ziemlich gut, ja das ist so ein ganz günstiges, das Argon Case ist gut ist mir aber ein bisschen zu teuer, das für 11 Euro, na ich kauf mir jetzt nicht jedes Raspberry Pi Case zum ausprobieren, es gibt ja auch jetzt die Argon Cases mit NVMe und sowas drin, weißt du was passiert ist, was sagt der Umut denn, ähm, die IHK hatte meinen Projektantrag nicht bekommen, obwohl ich den hochgeladen hatte, hab zum Glück den Antrag runtergeladen gehabt und das gemerkt, ja sei froh, ist ja fast ähnlich wie bei mir gewesen, die sind bei der IHK, die sind einfach echt extrem unfähig, ok also Leute ich würd sagen Temperatur ist ok, ok also was ist denn so das, was ist denn so das Maximum was denn das Ding verträgt, Arm Frequence Pi 4, mal gucken was ist da, Results, da gibt es auch bestimmt Leute die Tests gemacht haben, Take it to the Max, exellent, Tom's Hardware ein Google Eintrag weiter, das Tom's Hardware überhaupt noch gibt, ok 200, ja wie, die haben ja nur 2 getestet, was hat der hier Maximum, ach mehr, mehr geht nicht oder was, ach mehr geht nicht, ok also was, Overvoltage 6 und das, ok komm wir machen jetzt volle Pulle, scheiß drauf, easy, Bam, Reboot, ich war mehr als nicht starten, kann er ja nicht und ich glaube im Zweifelsfall, da hackt er sich halt runter oder, mal gucken, woop, woop es lebt, lebt, lebt er noch, Patient scheint noch zu leben, Postchamp, Postchamp, mal warten bis der Login geht, da ist er, da ist er Leute, 2147, Temp, Tres, Bam, Tres, Tres, Tres, Tres, ok, jetzt geht die Temperatur doch ganz gut hoch, die Frage ist halt, die man sich stellen muss, ne, macht man auf diesem Ding ernsthaft irgendwas großartig CPU limitiertes, wo man das braucht, ich mein keiner, keiner transcoded Videos auf dem Raspberry Pi, ich mein es geht, das ist das wichtigste, ja, Minecraft, ok, ohne Scheiß für einen Minecraft Server lasse ich mir das gefallen, ja, ich mein Minecraft ist ja zumindest in der Java Edition schon mal, da bekommt jedes mega Herz und bestimmt mit der C++ Edition auch, wie benutzt du die Search Funktion in der History, Steuerung R und by the way Steuerung R sucht, also ihr könnt ja sagen, das hier Steuerung R, dann gebt ihr den ersten Dings ein und wenn ihr weiter Steuerung R drückt, dann springt er immer zu den nächsten Vorkommnissen und wenn ihr Steuerung Shift R drückt, dann springt er zurück und das ist die wichtigste Funktion, die ihr jemals in eurer Shell braucht, weil wer eine lange Shell History hat, der braucht keine Server zu dokumentieren, einfach Shell nachgucken, meine History auf der Arbeit ist glaube ich mittlerweile über 100.000 Zeilen lang und die wird auch immer, die wird auch immer schön kopiert von einer Installation zur nächsten, das ist Standard Bash hier, das was für ein Raspberry kommt, das hier bei mir ist ZSH, die hier, hier, hier, Leute, wir sind volle Pulle übertaktet, genau, ihr müsst richtig das was Phipps schreibt, die HIST Size müsst ihr anpassen und HIST File Size, sonst gehts nicht. Sollen wir mal gucken wie warm es ist, oh ja, oh ja Leute, das Gehäuse, es ist unangenehm anzugreifen, definitiv, es tut schon leicht weh am Finger, wenn man das zu lang drauf lässt auf dem Gehäuse, kennst du Swiffing Bridge, klar wir haben schon ein paar Videos sogar hier zusammengeguckt, also Maximum übertaktet und passiv gekühlt, schafft das Gehäuse aber auch gerade so, das Ding unterunter takten zu halten und ich könnte mir vorstellen, wenn es ein bisschen wärmer ist im Sommer, so dass die Raumtemperatur ein bisschen wärmer ist und wenn es jetzt noch 2-3 Stunden läuft und da vorlässt, glaube ich kommen wir auch ans Temperaturlimit in dem Gehäuse, ey das ist echt warm das Ding, ne, also wenn ihr kalte Füße habt nachts im Bett, legt das Ding unter die Decke oder erfreut eure Frau Freundin wie auch immer mit, sagt ihr, kommt mal hier, ich hab Fußwärmer am Start, habt ja auch gleich ne Ausrede warum Raspberry Pi ins Bett muss, da fehlt RGB, da fehlt RGB, ich hab noch ein paar Neopixel, ich hab noch ein paar Neopixel, wir könnten RGB aufrüsten, ey das wird echt warm, ich weiß aber grad nicht genau wo ich die Neopixel hab, ich hatte sie beim Aufräumen, ich hab halt 50 mal gesagt, dass ich aufgeräumt habe und jedes Mal wo ich die Dinger aufgeräumt hab, wusste ich vorher wo sie sind, jetzt nachdem ich aufgeräumt hab, weiß ich nicht mehr wo die Dinger sind, wo könnte ich die Neopixel hin haben, Ikea Tasche, ne in der Ikea Tasche ist das alte Zeug, wo ich nicht wusste wohin damit, vielleicht Leute, vielleicht haben wir Glück, wir gucken mal in die Magic Box, in die Magic Microcontroller Box, ob da irgendwo die Neopixels drin sind, wenn die Neopixels drin sind, dann können wir noch RGB Beleuchtung machen, Magic Microcontroller Box, seht ihr irgendwo Neopixels, ok ich geb zu, man erkennt jetzt nicht wirklich was, also Rüttelsensor, wir machen jetzt mal exquisite Box Show, Rüttelsensor, nein, Bodenfeuchtigkeitssensor, nein, ich hab keine Ahnung was es ist, nen Wifi Modul, auch nicht, Relays auch nicht, Bewegungssensor, Relay auch nicht, ESP32, Linksgedöns auch nicht, irgendwelche Stromdinger, mehr Relays, keine Ahnung, wo sind die Neopixels, sind da irgendwo Neopixels drin, sieht nicht so aus, keine Neopixels Leute, sagt mir wenn irgendwo Neopixels, ihr wisst ja gar nicht was ihr gucken müsst, aber guck mal, einfach random noch ne Raspberry Pi Zero drin, Lullwee, Rüttelsensor, alles keine Neopixels Leute, ne, sieht nicht so RGB, RGBig aus gerade, ok wo könnten die Dinger noch sein, Magic Microcontroller Box wieder zumachen, keine Neopixels drin gewesen, Arts Delivery, ja beste, Arts Delivery, Eats, die haben echt ne richtige Chance verschenkt sich Eats Delivery zu nennen, ein Eats Delivery wäre nun mal wirklich mit Abstand der beste Name von nem Lieferdienst überhaupt, wo könnt ich die Neopixels haben, ich geh mal draußen an den Schrank gucken, mal ganz schnell, in der Zwischenzeit guck mal wie warm das ist, oh Leute, es schmilzt gleich. Ok. ne leute, leute ich muss euch enttäuschen, ich find die neopixels jetzt auf die schnelle nicht, das sind so einzelne leds, ich hab sogar so ein paar leds die man direkt per usb anschließen kann und dann plinken lassen kann, ich hab mir gedacht wir machen jetzt den spaß und machen eine runde rgb beleuchtung noch, ich guck noch mal schnell in die anderen kartons ob da irgendwas drin ist, was ich ja zurecht mache, gar nix, raspberry pi 4 ins gehäuse eingebaut und jetzt mal gucken wie warm er wird, aber leute wir sind gleich am temperaturlimit, wir sind auch temperaturlimit erreicht, gleich taktet er sich runter, monka auf a clock Keine Chance Leute, ich hab jetzt mal noch 2 Kisten durchwühlt, keine RGB Beleuchtung am Start, Fields RGB Man, Fields RGB Man, wüsste ich nur wo ich den Kram hingemacht hab, ich hatte nämlich noch so ein paar Plink Dinger, die konntest du einfach in USB stecken und dann, oh das Gehäuse, Alter, ok, also jetzt kann man den Finger nicht mehr drauflassen, das ist zu heiß, ohne Scheiß, du kannst nicht mehr angreifen, da verbrennt du dich auf Dauer wenn du nicht den Finger lang dran, au, ne, keine gute Idee, deaktiviert das nicht automatisch das Downclocking, kein Plassen Schimmer, aber taktet sich nicht runter, oder, oben am Plastik, hm, geht so, Plastik ist, Plastik ist ok, Hot Case, ja, richtig, richtig Verbrenn Case angesagt, also nicht, das ist auf jeden Fall deutlich zu heiß, aber das Gehäuse schafft's, ja, kann sich nicht beschweren, Maximum übertaktet, das Gehäuse schafft's gerade so, aber wirklich kommt ganz am Rande, das zu halten, doch top kann man sich nicht beschweren, Poggers, Alter, oder, doch, Massive Pog, je nachdem wie man's, wie man's sieht, ja, das Ganze verbraucht übrigens gerade, ich weiß nicht ob ihr's seht, kennt man das, das Ganze braucht gerade, 9,2 Watt, also mehr kannst du mit dem Raspberry Pi 3 anscheinend nicht verbrauchen, du kannst auch ein bisschen IO machen, aber so bei 9,62 wie auch immer ist Schluss, das Ding hat 4 Kerne, ja, genau, Hochkant aufstellen, jetzt kommen die Big Brain, Leute, das waren jetzt Hochkant aufstellen, wir stellen jetzt Hochkant auf, mal gucken ob er dann kälter wird, der bleibt nicht stehen, Hochkant, Crap Netzwerk Kabel, Alter, bleibst du stehen, kein Q-Switch, bleibt nicht stehen, vielleicht so, keine Chance, so hier, so, perfekt, Diagonal aufstellen, ja, kommt mal, jetzt hat er kaum Kontakt mit dem Boden, weiß jetzt nicht ob das gut oder schlecht ist, aber das macht keinen Unterschied, Leute, ja gut, wenn du draufpustest, Leute, wenn man draufpustet wird es natürlich kühler, das ist klar, wenn du draufpustest wird es natürlich kühler, das kann ich euch, da hole ich mal was, da kann ich euch was zeigen, das ist ein Kabel, da kann ich euch was zeigen, das ist ein Kabel, da kann ich euch was zeigen, da kann ich euch was zeigen, das ist ein Kabel, da kann ich euch was zeigen, das ist ein Kabel, Kühlchamp ist am Start Der Kühlchamp Wo stellt man das jetzt am besten hin so dass es am maximalsten vorbeigeht Der Kühlchamp so Achtung Kühlchamp activated Ja Leute der Kühlchamp ist kaputt oder Ah ne der hat nen Knopf hinten lull Kühlchamp ist an Boah pass mal auf jetzt geht die Temp runter wie nix. Guck mal hier jetzt geht die Temp runter wie nix. Äh, Keg-Waite Ke- Was ist das? Was ist das? Ich glaube ich ich glaube das das ist nicht das ist nicht richtig gelagert davor Wollte man das Ding nicht irgendwie drehen doch guck mal Jetzt hier jetzt der Pus-Champ ist am oh oh ich hab Wärmel- oh fuck ich hab Wärmel halt passt da unten dran hängen Äh Saurei Abmachen Naja gut so was macht die Temp? 80 Grad 76 hier Der Pus-Champ kühlt ordentlich Wir müssen das ich muss das so machen irgendwie das muss mehr an das Gehäuse dran Jetzt Aber ne so ist schon okay Der Pus-Champ guckt euch das mal an Also man sieht aktiv Kühlung bringt bringt was ja Gleich wie kühler das Gehäuse Guckt mal jetzt könnt ihr den Raspberry Pi nicht nur als Fußwärmer verwenden sondern auch als Heizungsersatz Nee ich hänge das Ding jetzt nicht aus dem Fenster An Minus-Demperatur also ich muss das Fenster auf meinem Raspberry Pi raushängen Guck mal 69 Grad jetzt kann man das jetzt kann man das tatsächlich nicht nur als Fußwärmer sondern echt als als Heizung verwenden Nee nicht wirklich also wenn ihr damit was heizen wollt dauert ein bisschen Aber aber theoretisch funktioniert das Ja Ich meine wer hat sonst schon einen 9 Watt Heizlüfter die haben sonst immer 2000 Da freuen sich die die die Öko Leute auch Am einfach Energie gespart Wir brauchen einen 2 KW Heizlüfter wenn du auch einen 9 Watt Raspberry Pi Heizlüfter haben kannst Kannst du damit ein Raspberry Pi backen? Oh Pains-Champ, der war schlecht Den Ventilator musst du da zurechnen ja ok der dann runter ne Runde mal auf keine Ahnung 11 12 mein in wegen uns hochkommt auf aber mehr nicht Macht im Vergleich zu 2000 immer noch kein Unterschied ich meine er heizt nicht im Vergleich zu 2000 heizt er halt mal gar nicht aber aber er heizt theoretisch darauf kommt es aber nicht Ich meine er heizt nicht im Vergleich zu 2000 heizt er halt mal gar nicht aber aber er heizt theoretisch darauf kommt es an Theoretische theoretische Heizleistung ist huge Nee auch nicht Und man kann einen Minecraft Server drauf laufen lassen ich meine überlegt euch mal was du da was du da der Umwelt alles Gutes tun kannst Du kannst Minecraft hausten und die Wohnung heizen und das alles mit 50 Euro Einsatz Das ist A++++ Energie Klasse Und stellt euch das ganze jetzt noch mal stellt euch hier die Kiste jetzt mit RGB vor stellt euch vor wir hätten hier einen Stick dran der irgendwie richtig schön RGB mäßig mäßig leuchtet Ja sag euch das wäre hier exquisite Mit RGB wird das ganze noch mal um 2 Faktor 2 geboostet werden Ja mit RGB konnten wir auch locker auf 3 Gigahertz übertacken Safe Safe Call Gar kein Problem Das Gehäuse sieht ein bisschen dreckig aus oben jetzt ne als ich das da eingerieben hab Vielleicht soll ich das mal echt sauber machen Ich hab halt nur nix da ich hab nur dieses komische Papier hier da was ehrlich gesagt nicht sauber macht Tja Leute da haben wir es aber das Gehäuse ist wirklich poggers Also jetzt mal ganz ohne Spaß viel dummes Zeug gelabert die letzte Viertelstunde aber das Gehäuse ist wirklich nice Das sieht nicht nur gut aus das hat alle notwendigen Funktionen du hast sogar ne Anzeige was die LEDs macht was die LEDs machen Kommst an alles dran inklusive SD Karte, Mikro USB, Audio es gibt ja übrigens Geräte die noch ne Audio Ausgang haben so ein Klinkenstecker Kommst hier hinten an alles dran und das Gehäuse bleibt schön schön kühl wenn man das nicht Maximum übertaktet und volle Pulle 4 Kerne laufen lässt Stimmt das sind Mikro HDMI wie komm ich auf Mikro USB? An den Kamera Anschluss kommst du tatsächlich nicht dran wobei du da auch deine Probleme hast wie kriegst du das Kamerakabel raus Das würde wahrscheinlich hier neben funktionieren guck mal hier neben hast du ne Öffnung drin im Gehäuse Du müsstest das Kamerakabel durchmachen ja das wird funktionieren das kannst du ja anschließen und dann hier neben raus machen ja das wird gehen So mal machen den Pustchamp mal wieder aus Aus ärgert mich dass ich die RGB Dinger nicht finde Ne echt keine Ahnung wo die RGB USB Dinger sind Na gut was das ist auf Slot 0 das kann ich dir zeigen das da Gibt es für den Pi 4 schon ne zukünftige Aufgabe? Ja der ist rein für den Stream da Ich hab den mir extra neu gekauft weil den letzten Raspberry Pi den ich für den Stream hatte Der wurde zu meinem neuen Unify Access Point äh nicht Access Point Unify Controller Da hab ich den alten Raspberry Pi 3 abgelöst der ist nur für den Stream sonst nix Wenn wir irgendwann die Sachen ausprobieren Also hier ist kein Problem ich kanns mal ausprobieren ich hab hier irgendwo nen Ich hab hier doch in der Ikea Tasche eben nen, wartet mal nen HDMI gesehen Hier guckt mal kann ich euch zeigen Hier guckt mal HDMI HDMI Gar kein Problem Funst passt wunderbar Alles gut Perfekt Exzellent sozusagen exquisite So wir machen jetzt mal die Big Brain Noctua Wärmeladpaste wieder zu Bevor es noch mehr kleckert das Ding Zu und wieder hier rein Braucht man bestimmt nochmal Dieses komische eingesiffte Ding kommt da auch rein Was immer das ist Reflink für das Case Nee hab ich nicht Klick einfach in den Reflink von mir an und kaufs dann Das zählt für alles was man kauft Wenn nicht dann nicht Ja Leute so siehts aus Mehr Content hab ich für heut net geplant Hab ich irgendwas übersehen im Chat Hab ich irgendwas im Chat übersehen zeig mal her Cute Chat Du hast jetzt nen 3D Drucker gekauft Exzellent Hab ich an Weihnachten Achso Tutorial ganz bestimmt Hatten wir schon, hatten wir schon Hatten wir auch schon Dinger heißen offiziell Rüttelsensor Ich glaub großartig Erdbeben erkennen Keine Ahnung ob das so gut damit funktioniert Ja doch wahrscheinlich auch Zeit für VU Wir können mal gucken ob ein Server Ja aber ins Bett wird doch gehen oder Das sieht da mega hässlich aus Das kann man doch heute wahrscheinlich schon ziemlich easy machen oder Wow Achso weil es die GPR ausdurchleitet Ok Das hatten wir eigentlich alles schon Ich hab nix übersehen oder Nix übersehen Nö Ja wie gesagt für 20 Euro kriegst du ja schon das komplette Case was ich da gezeigt hab Also für 20 Euro kriegst du ja schon ungefähr Für 21 Euro kriegst du ja schon das komplette Das komplette Case Also ich weiß nicht wie sinnvoll das ist da Nur nen Lüfter zu kaufen Na gut wenn man Lüfter haben will Und an die GPI auskommen will Ist das tatsächlich nicht schlecht Weil an die GPI aus kommst du hier nicht GPI outchamp ist hier nicht Das Agon Neo Ja das kann man sich auch kaufen das ist hier nicht schlecht Die Agon Cases sind eigentlich auch ganz gut immer GPIO mit Flachbandkabel Das würde funktionieren ja Wie verwaltest du deine ganzen Daten? Nextcloud nass? Ich hab ne nass Ich hab auch Nextcloud für den Sync zwischen ein paar Rechnern Aber ich mag Nextcloud überhaupt gar nicht Ich will das schon seit einer ganzen Weile Ablösen bin aber noch zu faul Für Macht da wahrscheinlich eh ne Kombination aus Syncthing und Irgendeinem normalen CalDAF Server oder so Weil Nextcloud ist pain In the ass Wärst du nach Dresden wenn der Friseur wieder am Start ist? Ich würd gern mal wieder nach Dresden fahren Es war schon nice Ich weiß nicht wie schnell mein 3D Drucker druckt Hab ich doch Ich hab da Default Settings Tja Aber jetzt wenn denn gerade einer sagt VU Ich guck mal schnell in VU rein By the way Ich muss euch mal was fragen Leute Jetzt mal Hat nix mit Battlefield oder Raspberry Pi cases zu tun Ich hab auf Ich hab manchmal Lack Wenn ich den Windows Knopf drück Wenn ich den Windows Knopf drück Da lags 2-3 Sekunden Explorer Auslastung geht auf 10% hoch Ich glaub das ist irgendwie Ein Problem von Windows Weil mein Desktop zu voll ist Jetzt ohne Scheiß Mein Desktop ist ja auf meinem Main Account noch viel voller Kennt das jemand? Lag wenn man Windows Taste drückt Ok Leute Dead Game Dead Game Pains Champ Game Dead Und dann auch Thresh Map Hast du auch? Komisch Mit Lelux wäre das nicht passiert, ja das stimmt Aber wenn wir es noch mehr haben Ist es bestimmt ein Windows Bug und wird hoffentlich Fix mit einem der nächsten Rollups da Ok Chat Und dann hab ich noch mal eine andere Frage an euch So mal an die krassen Webentwicklung Champs Komm bisschen kleiner kurz Aber ich lass es da Meine Frage an die Webentwicklungs Champs Von euch Kann mir irgendjemand Erklären warum das so Angesagt ist Halloween CSS? Ich versteh es nicht so Ganz Das ist voll im Hype aktuell Weil Also habt ihr mal eine Idee warum das so Beliebt ist? Weil ist das nicht Ist das nicht im Endeffekt Wie Inline CSS schreiben? Das ist Wie Inline CSS schreiben Und Inline CSS Ist doch voll verpönt Wobei ich sagen muss Ich persönlich mag Inline CSS eigentlich Da kannst du es genau da Hinschreiben wo Sache ist Ist das Für Leute die gerne Inline CSS verwenden Und das ein bisschen ordentlicher machen wollen? Also Leute Ich weiß schon was es macht Aber ich versteh nicht warum Inline CSS Auf der einen Seite so verpönt ist Und auf der anderen Seite Tailwind voll Angesagt ist Weil Dazu kommt Es ist ja kein UI Framework In dem Sinn dass du da fertige Buttons Fertige Tabellen und fertige Switches Fertige Cards oder sonst Was bekommst Du musst ja trotzdem Alles noch selber stylen Man schreibt sein CSS ins HTML Also so genau Hab ich das noch nicht gecheckt ehrlich gesagt Check ich nicht Du schreibst kein CSS In das HTML Na im Prinzip schon Unter der Haube sind das Natürlich irgendwelche vordefinierten CSS Klassen aber ganz im Ernst also Das ist schon Im Prinzip so eine Art CSS In das HTML Nur dass Sagen wir so die Klassen sind halt Für dich definiert Es ist ein bisschen wie Inline Styles Und ich verstehe halt nicht warum Inline Styles Hier voll geil gefunden wird Ich finde es vom Ansatz ja auch nice Ich mag ja auch Inline Styles ja Aber ich werde es mal Ausprobieren Vielleicht sagt mir das ja zu Warum ich so ein Kram wie Viewtify oder so verwende ist weil ich Im Design von UI Elementen Sacke Da fertige Sachen habe Da mit Tailwind muss ich ja immer noch Also das ist ja wirklich nur Einen Ersatz für CSS schreiben also sprich Ich muss immer noch alles selbst stylen Also wenn man zwei linke Hände hat was Webdesign angeht dann Wobei man könnte auch den Serious Max Fragen der ist ja hier Massive Frontend Big Brain Design Das wäre eh das beste lass einfach andere Leute Frontend machen easy Hör mir auf wieso der Preis Champ Prototyp sah doch echt geil aus Der Agile Ne da gibt es sich mit so easy Sachen nicht ab Wir waren heute auf der Arbeit übrigens Super agil ich weiß gar nicht ob ich das schon gezeigt habe guck mal Also Alternate ist auch Mit das neue Alternate ist Auch mit Tailwind gemacht guck mal Oder auch nicht Oder zumindest Mit was ziemlich ähnlichem Ist das ist das Tailwind Oder ist das was custom Alternatikes Weil sowas ist auch in Tailwind drin Meinst du das ist Bootstrap Nee Nee das ist kein Boot das sieht nicht Bootstrappy aus Oder Custom Zeug ja Wobei Nafbar Item das könnte auch Ach keine Ahnung Das könnte auch wirklich Bootstrap sein Ja doch doch doch doch doch doch Das ist Bootstrap guck mal Ja das ist Bootstrap Na klar Delta warum nicht Guck mal Wie agil wir heute waren Auf der Arbeit Heut Nacht ging was kaputt Ich hab einem Kollegen drüber geschrieben Er hat direkt festgestellt Wo der Fehler lag Wir haben noch ein dummes Bild gepostet Ich hab's gecherry picked und der Fehler war weg Also wenn das nicht mal agil ist Dann weiß ich auch nicht Innerhalb von 5 Minuten vom Fehler Entdeckt zu Fehler gefixt Von Fehler cherry picked und deployed Das ist sowas von Agile Alter Das sollte den Scrum Preis 2021 Gewinnen Gibt's eigentlich sowas? Scrum Preis Scrum Master Preis Nee Preis Verleihung Es gibt kein Scrum Preis Auszeichnung Es gibt kein Es gibt kein Scrum Master of the year oder sowas Marktlücke Ich würd sagen wir müssen sowas ins Competitive Scrum Ja So wie es Competitive Programming gibt Competitive Scrum Wer macht die schnellste Sprintplanung Und das schönste Kamba an Bord Agile Champ Genau Kannst du meinen Java GUI bewerten? Ja Gucken was da für ein Bild jetzt aufgeht Viel GUI ist da nicht vorhanden Es sieht halt Java Style aus Ist das Java FX oder was ist das? Es sieht halt typisch Java Crap aus Das sieht halt nun mal so aus Das Zeug bei Java Viel GUI ist da ja nicht Dass das hier alles klippt Ist Crap Und ich hab den Eindruck Dass du mir das Bild geschickt hast Ist eigentlich ein großer Gebaid Gebaid Passive Gebaid Das Web Scale Das Diagonal Skaliert Kannst du Java Blacklisten? Ne Die Chinesen mögen Java Ich sags jeden Stream GitHub Trends sind Sind zur Hälfte Chinesen Repos Sind zur Hälfte Chinesen Repos aus Mit Java Passt auf, ich sag's euch Was ist Miniview? Alles klar Exquisite Perfekt Dogecoin ist am Start Very Currency Stonksticker Endlich Ein Golang Stonksticker Da hab ich drauf gewartet In China ist die Bahn ausgefallen Weil Flash Nicht mehr ging Wo sind die ganzen China Repos? Was ist denn hier los? Von dem Typ Hab ich mal einen Webcast geguckt Ich weiß nicht ob der das ist Da hab ich mir Echt an den Kopf gegriffen Falls das das ist, vielleicht tue ich dem jetzt hier unrecht Ich mein es ist recht beliebt das Repo Da wird schon sinnvolle Sachen drin sein Aber von dem hab ich mal einen Konferenztalk geguckt Und Der hat In C-Sharp unter Akuta Also Interfaces Gelitten Der hat keine normalen Klassen verwendet Der hat aus allem ein Interface gemacht Und irgendwann Zur Mitte des Talks hat er anstatt Date-Time zu verwenden Ein Interface I-Date-Time gemacht Und dann darunter abstrahiert Date-Time verwendet und dann hab ich ausgemacht Das war mir zu dumm Alter I-Date-Time Alter Da war es vorbei Warum macht man das? Weil Clean-Architecture Die sind so clean Die brauchen erstmal 500 Zeilen bevor sie anfangen können Damit es clean ist Ich mein I-Date-Time Als würde sich das ändern Als müsste ich irgendwie Die Date-Time Implementierung Einfach mal austauschen Gut, dass ich da ein abstrahiertes Interface hab Ja ganz wichtig Wo sind denn die China Repos? Leute ich hab euch gescampt Boah Oh Leute mein Handy ist ausgegangen Und wisst ihr auch warum? Keck wait Wisst ihr warum das ausgegangen ist? Weil ich vergessen hab Den Stromstecker reinzustecken Massive brain Max Huge brain Jetzt muss ich es erstmal aufladen Gut Webcam ist vorbei Okay also Hä? War das nicht das War das nicht das wo Semper Video gewarnt hat davor? Haben die das jetzt geforkt? Haben die das jetzt geforkt? Oder was ist da los? Okay Okay Warum trennt ihr das denn? Aha Okay also hier Erste China Repo Was ist es? Mein Gott Die Ordner Auch noch in China Sachen MonkaS Es ist bestimmt Java Ich hab keine Ahnung was es ist Ich hab keine Asia Schriftarten installiert So JavaScript Was ist das schon wieder? Es vergeht keine Woche ohne neue JavaScript Frameworks Was ist WhiteJS schon wieder? Was ist WhiteJS schon wieder? Was ist WhiteJS schon wieder? Wollt ihr beim Kratos Penta nachdenken? Nee mich hats gewundert das das Repo trennt Obwohl das Malware Zeug hat Obwohl das Malware Zeug hat Obwohl das Malware Zeug hat Wisst ihr was wirklich? Was ist das? Was ist das? Was ist das? Wisst ihr was wirklich? Significantly Significantly die Frontend Experience erhöhen würde wenn es nicht jede Woche eine neue JavaScript Framework gäbe Was macht es überhaupt? Instant Server Start Lightning Fast HMR Was ist denn HMR? Refresh Page refresh oder so Leute Leute die Sache ist die Ich hab das jetzt gelesen Ich hab keine Ahnung was es ist Was ist es überhaupt? Hotmodule Replacement Ja gut das ist im Prinzip Reload Was ist? Leute ich verstehe denn Was ist das? Redox Ist das Ok das funktioniert mit View Ok Ich hab echt keinen Plan Was ist? Ist das so eine Art Webpack? Ist das Webpack in nicht Webpack? Das ist Lightning Fast Geil Introduction Ok Ah das ist ok das ist ein eigener Webpack oder sowas Ok verstehe So Chinesen sind nochmal am Start Java Java Java ich sag doch die China Repos sind alle in Java Da ist schon wieder iDate Time Typ Secure and Fast Micro VMs for Serverless Computing Das hab ich schon mal gesehen Das hab ich tatsächlich schon mal gesehen Ich hab wieder komplett verdrängt was es ist Aber das hab ich schon mal Ist das nicht von Amazon gewesen? War das nicht von Amazon? Ja doch genau Irgendwelche Cloud Native Diagonal Web Scale Agile Lösung Hat Chef selbst entwickelt Genau Open Source Krypto Trading Bot Kann man damit Stonks Money machen? Jetzt weiß ich was ich mit meinem Raspberry Pi mache Stonks Krypto Trading Bot Jawoll 7 Euro Poggers Hyper Opt Jawoll Krypto Bot Laufen lassen Das neue Windows Terminal hat ernsthaft 71.000 Sterne Das neue Windows Terminal ist ungefähr jetzt halbwegs brauchbaren Stand Also das was beispielsweise Gnome Terminal oder die anderen Linux Terminals schon seit 15 Jahren sind Aber die Windows User sind so happy dass sie nicht mehr diesen Shit hier verwenden müssen dass sie dem Ding einfach 71.000 Sterne auf GitHub geben Es ist einfach nur ein normales Terminal was funktioniert Das neue Windows Terminal Nur Ich weiß gar nicht ob ich es installiert habe Genau Crap was trendet Was mich im Windows Terminal nervt in dem neuen auch dass man nicht richtig per mittlerer Maustaste Copypasten kann Also was spricht dagegen jetzt mal für die Leute die öfters WSL verwenden Was spricht denn dagegen einen Xserver auf Windows zu installieren ein ordentliches Terminal zu installieren und darin dann seine Shell laufen zu lassen Wäre das nicht noch besser oder gibt es dann Probleme im Zusammenarbeit mit irgendwelchen Windows Tools Emoji Support ja wichtig Ganz wichtig Die wollten mit WSL2 Jaja man kann da irgendwie Weiß ich ob es Beta war mit Xserver Ich weiß nicht Ich verfolge das nicht so Häufig Häufig Maui glaube ich nicht dass das was richtig gutes wird Maui ist ja quasi Xamarin oder Xamarin Reloaded und die machen irgendwie so ein komisches uralt GTK oder so Ich glaube das taugt nichts Ich glaube eine wirklich sinnvolle Alternative für Cross Platform Desktop GUI Entwicklung wird es erst geben wenn Flutter auf dem Desktop richtig gut funktioniert ansonsten hast du im Prinzip 2 Sachen du hast Qt und da musst du dich mit C++ rumschlagen oder du hast was auch sagt Ja Uno und Avalonia gibt es auch noch aber da weiß ich nicht wie wie gut die funktionieren Also Xamarin hat GTK verwendet unter der Haube unter Linux ja Was anderes andere Möglichkeit gibt es ja nicht was Cross Platform für Xamarin für Xamarin für Xamarin für Xamarin gibt es ja nicht ich glaube so richtig ordentliches Desktop Cross Platform GUI werden wir erst kriegen einen neuen Competitor wenn Flutter auf dem Desktop gut funktioniert Microsoft kriegt es ja nicht einmal geschissen ein ordentliches GUI Framework unter Windows zum laufen zu bringen ich mein WinUI 3 WinUI 3 haben sie ja auch mal wieder so massiv verkackt bei Microsoft wo ich mich frage wie kann man es so krass verkacken sie wollten eigentlich native Apps also normale Windows Apps kein UWP Geschütz unterstützen Unpackaged Und was unterstützen sie jetzt? Nur Packaged Guck mal wann es da die nächste Roadmap gibt WinForms all change my mind ja Emoji Support zum Beispiel Mind changed Wie sieht es denn mit Unmanaged aus Unpackaged geht das jetzt? ja ja ich weiß dass sie angeblich Unpackaged unterstützen wollen aber wollte die auch schon zum letzten stimmt ja überhaupt nicht geht doch überhaupt nicht Unpackaged lügt nicht Microsoft ich hab es ausprobiert also Unpackaged heißt man kann einfach wie gehabt eine Windows Anwendung erstellen und dann GUI drin machen und gut ist das Problem aktuell ist Packaged Apps sind so Sachen die man beispielsweise bei UWP auch gemacht hat wo man ein extra Code Signing Zertifikat braucht und das Problem ist keiner der so wie ich privat die eine oder andere Windows Anwendung macht kauft sich ein Code Signing Zertifikat selbst wenn es nur 150 Euro im Jahr kostet macht niemand überhaupt nicht ein ok Unpackaged ist hier richtig crap geht immer noch nicht totaler Müll keine Ahnung was mit Microsoft ich mein mal im Ernst wie schafft es Microsoft eigentlich noch Windows zu verkaufen oder besser gesagt wie schafft es Microsoft überhaupt noch Entwickler dazu zu bewegen Desktop Anwendungen für Windows zu machen Desktop Anwendungen auf Windows sind echt der übelste Abfuck du hast die Auswahl zwischen was heißt jetzt eigentlich TOS Terms of Service die haben du hast zur Auswahl unter Windows Forms was ich an sich gar nicht schlecht finde aber halt übelst Old School ist und keine neuen Sachen kann dann hast du UWP was ein bisschen neuer ist aber auch schon zu alt um die richtig interessanten neuen Sachen zu können und dann hast du WPF meine ich und dann hast du UWP das ist neu sackt aber weil du kaum was machen oder vieles nicht machen kannst und Unpackaged schon mal gar nicht ohne Zertifikat also es gibt nichts ich weiß nicht wie Microsoft es schafft dass Leute noch Desktop Anwendungen machen und dann muss man sich doch nicht wundern wenn die Hälfte der neuen Desktop Anwendungen ist besteht aus Elektron und Javascript WPF richtig sinnvoll WPF ist auch Kacke eigentlich im aktuellen 2021 ich weiß gar nicht ob du mittlerweile einen neuen Webview hast oder immer noch nicht mit dem alten IE Scheiß rumschlagen musst auch die 3D Integration in WPF ist räudig gehen tut es aber schön ist es nicht Emoji Support und neuste Sachen ist auch nicht drinne also im Prinzip dir bleibt ja nichts anderes übrig als eine Elektron Anwendung zu machen oder du machst eine Qt Anwendung dann kannst du wenigstens Mac, Linux, Windows gleichermaßen beklücken dann hast du da wieder andere Probleme und vor allem ist es C++ genau deswegen sind so viele Apps Javascript gerade unter Windows sagt halt einfach Massive was Microsoft da macht Apple macht es ein bisschen besser Apple hat einen riesen Vorteil die machen nicht die Sache wie Microsoft dass die alle 4 Jahre ihre Designrichtlinien ändern mal Ribbon Bars, mal keine Ribbon Bars mal Aero, mal kein Aero mal Flat Design, mal kein Flat Design mal was auch immer Microsoft denkt sich ja laufend laufen was anderes aus Apple macht das auch, aber Apple macht das insofern on the fly und ist auch hartnäckig dass die Leute sich dran halten also die kriegen das besser hin ja und unter Linux ist es auch nicht wirklich besser weil unter Linux ist halt generell die sind sich da nicht so wirklich einig genug unter Linux, ja du hast 20 verschiedene Desktops du hast die Gnome Leute die laufen was kaputt machen und im Prinzip GTK halt rein für Gnome optimieren deswegen macht keiner nicht wirklich GTK Anwendungen man darf nicht vergessen VLC war früher mal eine GTK Anwendung aber die haben gesagt leckt mich, ich hab keinen Bock drauf haben sie auf Qt umgestellt also GTK ist halt auch Crap das einzige was gut ist unter Linux ist Qt, allerdings KDE suckt also für mich ich mag KDE nicht also die Desktop Umgebung die mit dem einzig guten GUI Framework programmiert ist, suckt aber das ist eher ne Geschmacksfrage ich mag halt KDE nicht, KDE ist PanzeChamp die Pi Foundation installiert ungefragt ein Microsoft Repo ja gut, warum nicht die installieren auch ungefragt Debian Repos was ist denn Schlimmes drin in dem Microsoft Repo wahrscheinlich das ganze.NET Zeug oder das finde ich persönlich gar nicht schlecht wenn das da standardmäßig drin ist Visual Studio Code aber warum nicht Ach mit den Batches stimmt da müssten wir auch noch was machen naja also Desktop Anwendung ist wirklich PanzeChamp, deswegen bin ich in letzter Zeit auch quasi komplett drauf umgeschwungen mich ein bisschen mehr mit Web Sachen zu beschäftigen weil man hat einfach viele Probleme nicht wenn man die Sachen im Web laufen lässt du hast Instant Support für alle Mobile Plattform für alle Desktop Plattform und die wichtigsten Sachen kannst du heute auch im Browser machen also so wirklich richtig Native Apps bräuchte man zum Beispiel für für irgendwelche Screenshot Tools oder so, weiß ich nicht ob man das im Browser gescheit machen kann so was ja also für Screenshot Tools die dann der Taskleister sind, sich Hotkeys registrieren und sowas, für solche Sachen brauchst du Native Apps noch, aber ansonsten so die meisten anderen Sachen die Leute täglich benutzen sind halt mittlerweile im Browser und Leute die es dann auf dem Desktop bringen wollen die machen es halt in Electron, weil es keine gescheiten Desktop Frameworks gibt ja und Firefox hat gesagt sie bringen kein PWA Support auf dem Desktop, was halt auch sagt genau so ein Tool wie ich mal für BDO gebastelt hab, die die Screenshots analysiert das geht, das geht nur Native und das geht auch nicht mit UWP ich verstehe es einfach nicht warum Microsoft nicht ihren Kram ihr WinUI endlich mal rausbringt für stinknormale Win32 Unpackaged Apps dann hättest du ne Chance äh quasi sowas hier zu bauen mit halbwegs modernem Windows Gui mit halbwegs modernem Zeug Unpackaged und kein UWP Crap aber wie gesagt es leuchtet mir nicht an die einzigen die das halbwegs gescheit hinkriegen sind Apple weil auf Linux sieht es nicht wirklich besser aus auf Linux ist aber andere Probleme unter Linux streitet man sich lieber zwei Jahre wer dran schuld ist, dass Hardware Beschleunigung im Browser für Videos nicht funktioniert Hardware Decoding ja was Paint3D ich benutze Paint3D nie ich wollt es jetzt nur mal für das Gui zeigen weil die andere UWP Anwendung die manche Leute öfters verwenden ist der Taschenrechner und das ist natürlich jetzt Guimäßig echt eine sehr gute Anwendung natürlich jetzt Guimäßig echt eines der hässlichsten Programme auf die es überhaupt gibt das sieht aus als die Oberfläche sieht aus als der Design Praktikant in der ersten Viertel Stunde gebastelt guckt euch das mal an was soll was ist das grau in grau und überall ein Button hingeschissen aber cool dass der Hintergrund schimmert ne Video Beschleunigung in Firefox geht erst seit keine Ahnung einen Monat oder so und auch nur unter ganz speziellen Bedingungen und ich glaube bis heute nicht mit allen Video Formaten H265 geht glaube ich immer noch nicht und wie es mit VP9 aussieht oder nicht VP9 wie heißt der andere Kram geht glaube ich glaube es geht nur H264 und auch nur mit den passenden Grafik mit der passenden Grafikkarte mit den passenden Grafikkarten Dreibern mit einer neuesten Firefox Version eventuell noch irgendwelchen Hidden Flex gesetzt im Firefox spezieller Video Codec und noch die passenden Libraries installiert also das ist Crap wirklich also Desktop die müssen sich nicht wundern wenn die Leute keinen Bock mehr auf den Desktop haben das einzige was halt gut auf dem Desktop ist sind Spiele und die sind auch am besten unter Windows und warum das so gut funktioniert ist weil du halt in Spielen nichts Cross Plattform in dem Sinn brauchst ja und wenn schon ist es selbst gemalt und selbst getraw also selbst erschaffen ja dann kannst du das auch machen du brauchst da ein cool Framework was Cross Plattform ist für ich meine es ist schon so weit dass die Leute Game Engines als Cross Plattform GUI Framework für Desktop Anwendungen verwenden muss ich dir mal vorstellen also da da fehlt eindeutig was aber Microsoft kann es nicht gebacken du hast natürlich immer noch die Auswahl Qt und C++ zu verwenden aber mal ganz im Ernst das ist ja noch schlimmer also Qt ich ich mag Qt als Framework aber C++ ich weiß dass es Python Bindings gibt aber da hast du andere Sorgen dann wieder ähm und ich glaube für wirklich Erweiterung brauchst du ähm wie ist das wir haben noch letztens einen Chat der uns sogar seine Android App gezeigt hat die in war das war das Godo spricht man glaube ich aus Godot war das glaube ich ich bin mir immer ganz sicher der hat äh ne Android der Cross Plattform GUI App gemacht in der Game Engine und als letzten sogar den den Android Store Link dazu geschickt im Chat ja ja kann ich auch verstehen warum die das machen weil die ganzen Cross GUI Plattform Framework sind äh ah was leute so 21.35 jetzt off fahrts gut jetzt machen noch Outro Musik wir sehen uns leute bis denn Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik Outro Musik", "segments": [{"id": 1, "start": 0.0, "end": 24.92, "text": "So, ich muss mal mein Headset entknoten kurz."}, {"id": 2, "start": 24.92, "end": 48.84, "text": "So, ich muss mal mein Headset entknoten kurz."}, {"id": 3, "start": 48.84, "end": 69.56, "text": "So, auf gehts."}, {"id": 4, "start": 69.56, "end": 77.2, "text": "Hat Twitch schon gescheckt, dass der Stream on ist?"}, {"id": 5, "start": 77.2, "end": 81.12, "text": "Ok, jetzt wird die Musik grad entwenig exquisite."}, {"id": 6, "start": 81.12, "end": 92.92, "text": "Ja, jetzt hat Twitch gecheckt, dass der Stream on ist."}, {"id": 7, "start": 92.92, "end": 95.4, "text": "Leute, Hacker Mode aktiviert."}, {"id": 8, "start": 95.4, "end": 98.6, "text": "Hallo, Chat."}, {"id": 9, "start": 98.6, "end": 104.8, "text": "Ne, Moment, wie muss ich winken?"}, {"id": 10, "start": 104.8, "end": 105.8, "text": "So muss ich winken, oder?"}, {"id": 11, "start": 105.8, "end": 107.52, "text": "Ja, dass man was sieht."}, {"id": 12, "start": 107.52, "end": 108.52, "text": "Hallo, Chat."}, {"id": 13, "start": 108.52, "end": 124.36, "text": "Ja, ich hab gedacht, wenn ich die Kamera und den Tisch und den ganzen Krempel schon mal"}, {"id": 14, "start": 124.36, "end": 128.48, "text": "hier stehen hab, dann können wir das auch heute noch mal für was verwenden."}, {"id": 15, "start": 128.48, "end": 135.28, "text": "Oh Leute, ich muss doch schnell was zu trinken holen."}, {"id": 16, "start": 135.28, "end": 136.28, "text": "Ne, ne, das..."}, {"id": 17, "start": 136.28, "end": 141.0, "text": "Eins, eins kann ich euch sagen, es gibt zwei Sachen, die müsst ihr machen."}, {"id": 18, "start": 141.0, "end": 145.4, "text": "Leona, 97, 18 Monate, dankeschön für den Sub, das ist Hyper Subscription, aber hier"}, {"id": 19, "start": 145.4, "end": 146.4, "text": "mal..."}, {"id": 20, "start": 146.4, "end": 154.4, "text": "Massive Life Hack, übrigens, Teams hat wieder mal Sound verstellt, ne?"}, {"id": 21, "start": 154.4, "end": 159.4, "text": "Ah, yes."}, {"id": 22, "start": 159.4, "end": 167.4, "text": "Teams sackt einfach nur Hardcore."}, {"id": 23, "start": 167.4, "end": 178.6, "text": "So, genau, wie gesagt, ich geh jetzt erstmal schnell was zu trinken holen."}, {"id": 24, "start": 178.6, "end": 186.12, "text": "Es gibt uns Salami-E-Mode, ja, Wuppwurst, also, es gibt zwei Sachen, Huge Life Hack, Toxy,"}, {"id": 25, "start": 186.12, "end": 193.04, "text": "dankeschön für die 13 Monate Subscription, und zwar, es gibt zwei Sachen, die ihr unbedingt"}, {"id": 26, "start": 193.04, "end": 196.04, "text": "machen müsst, wenn ihr den ganzen Tag am Rechner sitzt, so wie ich, auch auf der Arbeit, jetzt"}, {"id": 27, "start": 196.04, "end": 197.04, "text": "danach noch mal."}, {"id": 28, "start": 197.04, "end": 202.36, "text": "Ihr müsst einmal am Tag mindestens eine Stunde rausgehen, euch bewegen, ohne Scheiß, ich"}, {"id": 29, "start": 202.36, "end": 206.0, "text": "hätte nie gedacht, dass ich das mal sage, aber das ist wirklich nicht ohne, sonst kriegt"}, {"id": 30, "start": 206.0, "end": 210.76, "text": "man Kopfweh, es tut einem den Rücken, der Rücken weh und alles sackt, ja, und ihr müsst"}, {"id": 31, "start": 210.76, "end": 211.76, "text": "viel trinken."}, {"id": 32, "start": 211.76, "end": 218.4, "text": "Jetzt kriegt ihr nämlich auch Kopfweh und es sackt auch, ordentlich trinken und am Tag"}, {"id": 33, "start": 218.4, "end": 223.64, "text": "eine Stunde draußen rumlaufen, reicht schon, ihr müsst keine krassen Sport-Men-Rumgesprinte"}, {"id": 34, "start": 223.64, "end": 228.48, "text": "machen, also, eine Stunde am Tag raus und sich ein bisschen bewegen und trinken."}, {"id": 35, "start": 228.48, "end": 234.64, "text": "Krasse Fitness-Tipps bei mir, ich weiß, aber das hilft wirklich, also, wenn ihr Rückenschmerzen"}, {"id": 36, "start": 234.64, "end": 238.64, "text": "habt, wenn ihr Kopfschmerzen habt, wenn ihr irgendwas habt, bevor ihr anfängt, auch wenn"}, {"id": 37, "start": 238.64, "end": 242.8, "text": "ihr hohen Blutdruck habt, was auch immer, bevor ihr anfängt und irgendwelche Pillen"}, {"id": 38, "start": 242.8, "end": 247.36, "text": "nehmt oder sowas, geht eine Stunde am Tag raus, bewegt euch ein bisschen an der Luft"}, {"id": 39, "start": 247.36, "end": 248.92, "text": "und trinkt ordentlich was."}, {"id": 40, "start": 248.92, "end": 258.96, "text": "So, gut, gut, dass ich das jetzt mal losgeworden bin, Leute, Chat, ich gehe jetzt mal kurz"}, {"id": 41, "start": 258.96, "end": 263.32, "text": "was zu trinken holen, wo wir gerade beim Thema sind, dann bin ich wieder da, by the way,"}, {"id": 42, "start": 263.32, "end": 275.36, "text": "Band-Emote, Anzeige ist raus, gleich wieder da, ich hänge fest, nur mein Headset."}, {"id": 43, "start": 353.32, "end": 380.28, "text": "Also, ich bin jetzt übelst die Treppe raufgesprindet, also, ich hab so, pass mal auf, guck mal,"}, {"id": 44, "start": 380.28, "end": 384.96, "text": "ich weiß nicht, ob ihr das, mal gucken, ob ihr das auf der Kamera seht, ich geh mal kurz"}, {"id": 45, "start": 384.96, "end": 391.44, "text": "ins Vollbild, ich hab hier so eine Falte im Teppich und da hakt das mit meinem, das übrigens"}, {"id": 46, "start": 391.44, "end": 396.44, "text": "scheppt die Kamera, ne, da hakt das übelst mit meinem Stuhl, wenn ich da drüber fahr,"}, {"id": 47, "start": 396.44, "end": 402.0, "text": "wackelt glaub ich die ganze Kamera, ja, guck mal, nur wenn ich mit dem Stuhl über die"}, {"id": 48, "start": 402.0, "end": 403.0, "text": "Falte im Teppich fahr."}, {"id": 49, "start": 403.0, "end": 410.0, "text": "So, wir müssen mal gucken, dass ein Busy grad wird, warte mal, ich mach mal den Teppich"}, {"id": 50, "start": 410.0, "end": 439.0, "text": "auf die Kamera, dann mach ich die Kamera grad, auf die Kamera, dann mach ich den Teppich"}, {"id": 51, "start": 439.0, "end": 445.68, "text": "auf die Kamera, also, der Teppich ist wirklich äußerst stabil, was nicht stabil ist, ist"}, {"id": 52, "start": 445.68, "end": 451.64, "text": "der Boden, das ist hier kein super massives Betonzeug, was der Opa da gebastelt hat, also,"}, {"id": 53, "start": 451.64, "end": 458.54, "text": "guck mal, wenn ich jetzt Pepo Fett hier springe, das ist nicht der Tisch, guck mal, das ist"}, {"id": 54, "start": 458.54, "end": 464.76, "text": "nicht der Tisch der wackelt, sondern das ist wirklich der Boden der wackelt und dementsprechend"}, {"id": 55, "start": 464.76, "end": 465.76, "text": "wackelt der Tisch halt auch."}, {"id": 56, "start": 465.76, "end": 482.2, "text": "So, also, das kann man ein bisschen grad machen, das hier ist Schäpp, ach nee, da ist so diese"}, {"id": 57, "start": 482.2, "end": 491.64, "text": "komischen Dinger, glaub, der abisoliert Schämpf ist auch am Start, ne, ist ja noch Schäpper,"}, {"id": 58, "start": 491.64, "end": 506.68, "text": "ihr wollt jetzt noch Schäpper, ok, eigentlich ist es relativ, was ist denn ihr Schäpp jetzt,"}, {"id": 59, "start": 506.68, "end": 525.52, "text": "was ist das da, so, ist es jetzt, Leute, ist es jetzt weniger Schäpp, ja, der Mauszeiger,"}, {"id": 60, "start": 525.52, "end": 530.2, "text": "da kann ich grad nichts machen, der Mauszeiger springt immer in die Mitte und ich bin grad"}, {"id": 61, "start": 530.2, "end": 534.48, "text": "nicht am Rechner, ich schieb grad den Kram, übrigens heute kein Holzfällerhemd, also,"}, {"id": 62, "start": 534.48, "end": 538.64, "text": "das muss jetzt, ja, ich hab mir den, guck mal hier, das ist wirklich der Boden der wackelt,"}, {"id": 63, "start": 538.64, "end": 543.48, "text": "natürlich trägt er auch ein bisschen dazu bei, dass ich jetzt nicht pepo leichtgewischt"}, {"id": 64, "start": 543.48, "end": 551.72, "text": "bin, aber Elefant auch nicht, ja, ich hab mir den Switch geholt und im letzten Stream"}, {"id": 65, "start": 551.72, "end": 557.92, "text": "haben wir uns den Switch sogar mal angeguckt, im Detail, Detail, im Detail haben wir uns"}, {"id": 66, "start": 557.92, "end": 568.04, "text": "den angeguckt, so, also, ich hab mir folgendes gekauft, ich hab gedacht, das gucken wir uns"}, {"id": 67, "start": 568.04, "end": 583.4, "text": "halt mal im Stream zusammen, ich hab mir einen Raspberry Pi 4 Flirck Case gekauft, beste,"}, {"id": 68, "start": 583.4, "end": 594.68, "text": "und wir probieren das jetzt mal, hm, wisst ihr was noch richtig pro wär, wenn ich es"}, {"id": 69, "start": 594.68, "end": 603.8, "text": "irgendwie hinkriegen würde, dass das Overlay auf beiden Desktops ist, das ist man Jaro"}, {"id": 70, "start": 603.8, "end": 619.24, "text": "Linux mit i3 WM, ja, ich mein, ich kann einfach, ich kann einfach den Stream zweimal aufmachen,"}, {"id": 71, "start": 619.24, "end": 640.72, "text": "so, okay, das ist sproken, Leute, RIP, zweimal starten im gleichen Browser geht nicht, aber"}, {"id": 72, "start": 640.72, "end": 645.8, "text": "wir sind ja nice, der Hacker, man, wir machen jetzt einfach in Chrome auf, und im Chrome"}, {"id": 73, "start": 645.8, "end": 651.16, "text": "kann ich es bestimmt noch mal starten, wie auch nicht, daher, im Chrome kann ich es noch"}, {"id": 74, "start": 651.16, "end": 660.72, "text": "mal starten, null wie, oder, oder, Paints Champ, Post Champ, Post Champ, aber das geht"}, {"id": 75, "start": 660.72, "end": 673.56, "text": "noch, oder, ja, okay, was auch immer, vielleicht kann man nicht mehr als drei Verbindungen"}, {"id": 76, "start": 673.56, "end": 690.08, "text": "oder so machen, kann ja sein, Sticky Window, die dann auf jedem Workspace zu sehen, wirklich,"}, {"id": 77, "start": 690.08, "end": 703.72, "text": "ja, du meinst diese, du meinst diese Scratchpad-Dinger, echt, wirklich, das, oh nice, nice, zeigst"}, {"id": 78, "start": 703.72, "end": 727.68, "text": "mal her, das müssen wir jetzt gerade mal ausprobieren, Sticky, ne, Shift, ne, wie ist das, wie ist"}, {"id": 79, "start": 727.68, "end": 741.32, "text": "das andere Stack, Stack, also bei mir ist Stacking, Stacking brauch ich eh nicht, und jetzt Sticky,"}, {"id": 80, "start": 741.32, "end": 748.04, "text": "wirklich, geht das, hab ich noch nie ausprobiert, also das heißt, wenn ich jetzt dieses Fenster"}, {"id": 81, "start": 748.04, "end": 767.32, "text": "hier nehme und sag, Windows S, Windows S, ach ne, Layout weg, Sticky Toggle, okay, wenn"}, {"id": 82, "start": 767.32, "end": 772.56, "text": "ich jetzt dieses Fenster nehm, sag Picture in Picture, und sag jetzt Windows, Windows"}, {"id": 83, "start": 772.56, "end": 787.4, "text": "S, boah, Alter, Massive Brained hier, ist das das ja geil, richtige Hacker-Man, guckt"}, {"id": 84, "start": 787.4, "end": 801.28, "text": "euch das mal an, boah, ist das Poker so besser als OBS-Layout, der Chat ist wieder too smart"}, {"id": 85, "start": 801.28, "end": 807.2, "text": "für die Welt, aber die Leute haben einfach gesagt, das ist der High IQ, der ist nur möglich"}, {"id": 86, "start": 807.2, "end": 812.28, "text": "gewesen durch, wie viel Subs hab ich denn eigentlich aktuell, zeig mal, jetzt wieder"}, {"id": 87, "start": 812.28, "end": 819.76, "text": "ein bisschen runtergegangen in dem Monat, aber ich glaub's immer noch relativ viel, 321,"}, {"id": 88, "start": 819.76, "end": 827.68, "text": "ja, guck mal, es gab 321 mal IQ um 1 plus 1, komm mit, Dankeschön für den Twitch-Prime-Sub,"}, {"id": 89, "start": 827.68, "end": 831.96, "text": "d.h. wir haben jetzt im Durchschnitt, wenn man davon ausgeht, Durchschnitts-IQ ist 100,"}, {"id": 90, "start": 831.96, "end": 840.64, "text": "haben wir jetzt 421 IQ, da kann man solche Sachen schon mal drauf kommen, der Keks ist"}, {"id": 91, "start": 840.64, "end": 862.56, "text": "ein 3D, das ist das da, das ist das, der da, das ist ein 3D gedruckter Keks, so sieht's"}, {"id": 92, "start": 862.56, "end": 875.0, "text": "aus, Turbo-Dead-End, Sub'n und dann Instant-Prüfung bestehen, so ist es, genau, so sieht's aus,"}, {"id": 93, "start": 875.0, "end": 879.0, "text": "also ich hab mir dieses Case hier gekauft und wir werden jetzt das folgende machen,"}, {"id": 94, "start": 879.0, "end": 887.96, "text": "das was wir schon mal gemacht haben, und zwar wir flashen jetzt den Raspberry Pi mit einer"}, {"id": 95, "start": 887.96, "end": 898.12, "text": "ordentlichen SSD diesmal, ich hab hier schon, guckt mal, Massive-SSD liegen, Big Brain-SSD,"}, {"id": 96, "start": 898.12, "end": 904.6, "text": "Samsung, hallo, kann man das vielleicht mal irgendwie ordentlich dahinter, Samsung Endurance-SSD"}, {"id": 97, "start": 904.6, "end": 913.16, "text": "64G, Leute, ich glaube ich spiegel mich auf der SD, MonkaS, beste, beste Micro-SD, hast"}, {"id": 98, "start": 913.16, "end": 917.92, "text": "du noch was mit dem Mikro-Text gebastelt, ja, da steht, da, guck, den verwenden wir heute"}, {"id": 99, "start": 917.92, "end": 925.64, "text": "als Switch für den Raspberry Pi, ja, ich sag manchmal Micro-SD und SSD verwechsel ich"}, {"id": 100, "start": 925.64, "end": 934.64, "text": "manchmal ein bisschen, aber ihr wisst was ich mein, ja, hier, Chat, Massive, also die"}, {"id": 101, "start": 934.64, "end": 943.6, "text": "sind wirklich nice, ausruggelt, habt ihr das gesehen, die verwenden wir heute, ich pack"}, {"id": 102, "start": 943.6, "end": 951.04, "text": "die mal, ich pack die mal kurz aus, eigentlich müssen wir da gar nicht ins Vollscreen schalten,"}, {"id": 103, "start": 951.04, "end": 955.32, "text": "oder, wenn ich die Dinger auspack, sieht man doch, wenn es klein ist, genauso, ich mein,"}, {"id": 104, "start": 955.32, "end": 960.8, "text": "und außerdem, ihr müsst mir nicht beim Auspacken zugucken, wer hat eigentlich, jetzt mal ernsthaft,"}, {"id": 105, "start": 960.8, "end": 967.76, "text": "wer hat eigentlich den, kann man das eigentlich vergrößern, boah, guckt, alter, ist das Big"}, {"id": 106, "start": 967.76, "end": 978.36, "text": "Brain, das ist ja Massive, huge, guckt euch das mal an, was aus, jetzt hat es geruckelt,"}, {"id": 107, "start": 978.36, "end": 985.16, "text": "was für ein geiles Zeug, mein Problem ist, ich hab keine Schere, doch, ich hab ne Schere,"}, {"id": 108, "start": 985.16, "end": 989.92, "text": "Meinung zu Linux Minia kann man verwenden, also was ich ja nicht verstehe ist, warum,"}, {"id": 109, "start": 989.92, "end": 996.36, "text": "wenn man, wenn man Micro SD Karten verpackt, Leute, oder, Micro SD Karten verpackt, ähm,"}, {"id": 110, "start": 996.36, "end": 1002.64, "text": "warum macht man da nochmal ne Plastik, ne Plastik Layer dazwischen, dass man das nicht"}, {"id": 111, "start": 1002.64, "end": 1006.36, "text": "einfach aufreißen kann, was haben die sich denn da überlegt, weil guck, man kann den"}, {"id": 112, "start": 1006.36, "end": 1010.36, "text": "Scheiß nicht, das geht nicht, man kann den nicht aufreißen, weil da ist so ein Plastik"}, {"id": 113, "start": 1010.36, "end": 1016.32, "text": "Layer dazwischen, also, ich weiß, ich weiß gar nicht, wie man das eigentlich offiziell"}, {"id": 114, "start": 1016.32, "end": 1020.56, "text": "aufmacht, wenn nicht mit der Schere, weil man kann das irgendwie auseinanderreißen"}, {"id": 115, "start": 1020.56, "end": 1023.76, "text": "oder so, aber das sagt doch alles, das muss man eigentlich mit ner Schere ausschneiden,"}, {"id": 116, "start": 1023.76, "end": 1034.88, "text": "so, Diebstahlschutz, äh, das ist kein Diebstahlschutz, weil man kann, man muss das aufschneiden,"}, {"id": 117, "start": 1034.88, "end": 1043.04, "text": "anders kriegt man das nicht auf, die haben sogar hier extra sowas eingeplant, wo man"}, {"id": 118, "start": 1043.04, "end": 1057.92, "text": "aufschneiden muss, so, jetzt hol ich mal die olle Schere von der Oma, exellent, das ist"}, {"id": 119, "start": 1057.92, "end": 1063.02, "text": "auch übelste Verschwendung, finde ich, dass bei jeder Micro SD Karte dieses Ding hier"}, {"id": 120, "start": 1063.02, "end": 1070.68, "text": "dabei ist, dieser Adapter, der ist auch total useless, wie findest du das neue Lied von"}, {"id": 121, "start": 1070.68, "end": 1078.48, "text": "Flair, ich muss dir ehrlich sagen, ich hab noch nicht ein Lied von Flair gehört, also"}, {"id": 122, "start": 1078.48, "end": 1084.0, "text": "die einzigen deutschen Hip-Hop Sachen, die ich kenne, das sind ein paar Sachen von Haftbefehl,"}, {"id": 123, "start": 1084.0, "end": 1090.56, "text": "äh, es ruckelt ein bisschen, ne, wie gesagt, Goethe-Straße, Louis Vuitton-Store, zahl"}, {"id": 124, "start": 1090.56, "end": 1096.76, "text": "die Kollektion bar, fick auf Sponsor, einzige deutsche Deutschrap-Quote, was ich kann,"}, {"id": 125, "start": 1096.76, "end": 1105.92, "text": "Moneyboy kenne ich auch, die ein oder anderen Sachen, aber ich mag absolut keinen Hip-Hop,"}, {"id": 126, "start": 1105.92, "end": 1111.52, "text": "für mich ist gerade deutschsprachiger Hip-Hop und generell so, das einzige internationale"}, {"id": 127, "start": 1111.52, "end": 1117.76, "text": "Hip-Hop Zeug, was ich mir tatsächlich gut geben kann, war früher mal Eminem, aber so"}, {"id": 128, "start": 1117.76, "end": 1122.92, "text": "richtiger Hip-Hop Fan war ich noch nie, und für mich ist, wahrscheinlich sind jetzt wieder"}, {"id": 129, "start": 1122.92, "end": 1130.12, "text": "übelst viel offended, weil es ist ja modern offended zu sein, ähm, für mich ist Hip-Hop"}, {"id": 130, "start": 1130.12, "end": 1138.4, "text": "übelste Low-Brain-Musik, also wenn der Sub IQ++ gibt, gibt jedes Hip-Hop-Lied IQ minus"}, {"id": 131, "start": 1138.4, "end": 1145.8, "text": "minus, empfiehlst du immer noch C-Sharp als beste Programmiersprache? Ne, ich sag nicht,"}, {"id": 132, "start": 1145.8, "end": 1151.04, "text": "dass C-Sharp prinzipiell die beste Programmiersprache ist, ich sag, dass C-Sharp meine Lieblingsprogrammiersprache"}, {"id": 133, "start": 1151.04, "end": 1158.72, "text": "ist, und, und, ähm, sie ist halt, sie ist halt super für alle möglichen Anwendungen,"}, {"id": 134, "start": 1158.72, "end": 1166.48, "text": "ja und übrigens, Hip-Hop ist das 10++ der Musik, ja das, das, das kommt ungefähr hin,"}, {"id": 135, "start": 1166.48, "end": 1170.88, "text": "das trifft, das trifft's eigentlich ganz gut, Dis-Abo, nicht De-Abo Leute, als richtig"}, {"id": 136, "start": 1170.88, "end": 1174.12, "text": "krasser Gangster-Rapper-Hörer müsstest du eigentlich wissen, dass es Dis-Abo heißt,"}, {"id": 137, "start": 1174.12, "end": 1181.08, "text": "Dis-De-Abo, ähm, wann machst du wieder Stream zusammen mit Allotricks? Ja, wir, wir streamen"}, {"id": 138, "start": 1181.08, "end": 1183.8, "text": "ja auch sonst so oft zusammen, es ist jetzt wirklich mal an der Zeit, dass wir wieder"}, {"id": 139, "start": 1183.8, "end": 1193.12, "text": "zusammen streamen, ähm, was, was wollte ich jetzt noch sagen, empfiehlst du, warte mal"}, {"id": 140, "start": 1193.12, "end": 1198.52, "text": "chat, ich wollte das, beste, bringst beste Möglichkeit, beste Möglichkeit eine SSD fest"}, {"id": 141, "start": 1198.52, "end": 1204.28, "text": "zu halten, also wenn ihr was braucht, so irgendwie zum, zum schieren, bei, bei irgendwie bei"}, {"id": 142, "start": 1204.28, "end": 1206.64, "text": "irgendeinem Sporteignis oder so, macht euch einfach so ein Ding einen Daumen und winkt"}, {"id": 143, "start": 1206.64, "end": 1214.76, "text": "mit der, mit der, mit der, mit der Micro SD, so, also was wollte ich jetzt sagen, Moment"}, {"id": 144, "start": 1214.76, "end": 1229.56, "text": "chat, ja, ganz aus dem Konzept gebracht, also, siehste, das hab ich, das hab ich ganz"}, {"id": 145, "start": 1229.56, "end": 1237.76, "text": "vergessen, vielleicht wollte ich noch ein bisschen Deutschrap flamen, ich weiß es nicht,"}, {"id": 146, "start": 1237.76, "end": 1248.28, "text": "ist auch egal, äh, aber zu der Frage von, von Gunny, Gunde, also, wie gesagt, C-Sharp"}, {"id": 147, "start": 1248.28, "end": 1251.88, "text": "ist meine Lieblingsprogrammiersprache, das heißt nicht, dass das die beste Programmiersprache"}, {"id": 148, "start": 1251.88, "end": 1256.72, "text": "für alles ist, der große Vorteil ist, wenn du C-Sharp lernst, dass du, warum ruckelt"}, {"id": 149, "start": 1256.72, "end": 1260.44, "text": "denn das zwischendurch, was ist denn das hier, was, was soll das, Leute habt ihr das grad"}, {"id": 150, "start": 1260.44, "end": 1271.56, "text": "gesehen, über, über, Übertragungs, der Übertragungs-Champ funktioniert nicht, WLAN-Champ ist am abkacken,"}, {"id": 151, "start": 1271.56, "end": 1276.16, "text": "also, das schöne an C-Sharp ist, wenn du C-Sharp gelernt hast, du kannst damit mehr"}, {"id": 152, "start": 1276.16, "end": 1285.16, "text": "oder weniger alles machen, was du machen willst, das ist halt nice, ne, du kannst von Surfer-Anwendungen"}, {"id": 153, "start": 1285.16, "end": 1291.76, "text": "bis, äh, Web-Anwendungen bis ziemlich Low-Level-Geschichten, Audio-Video-Desktop-Krams, Mobile-Krams, wobei"}, {"id": 154, "start": 1291.76, "end": 1295.32, "text": "Mobile-Krams wäre nicht unbedingt meine erste Wahl, kannst du mit C-Sharp alles machen,"}, {"id": 155, "start": 1295.32, "end": 1301.44, "text": "das ist halt schön, und das finde ich gibt es so in dieser Form bei keiner anderen Sprache,"}, {"id": 156, "start": 1301.44, "end": 1305.04, "text": "gerade die Möglichkeit für Windows-Desktop haben wir, also, für Windows-Desktop ist"}, {"id": 157, "start": 1305.04, "end": 1310.04, "text": "es einfach das beste, was es gibt, Windows-Desktop ist ziemlich errotz, Windows-Desktop-Anwendungen"}, {"id": 158, "start": 1310.04, "end": 1323.56, "text": "zu machen, aber wenn dann mit C-Sharp, Dogue-Coin ist die Zukunft, die habe ich auch schon gehört,"}, {"id": 159, "start": 1323.56, "end": 1333.96, "text": "das ist kein Netzteil, das ist ein Switch da oben, das ist Manjaro mit i3-WM, das beste"}, {"id": 160, "start": 1333.96, "end": 1339.52, "text": "zum C-Sharp-Lernen, ja, so paar Kurse sind nicht verkehrt, aber was ich, was ich empfehle"}, {"id": 161, "start": 1339.52, "end": 1350.8, "text": "immer, wenn man einfach mal einen Einstieg sucht ist das hier, das da, das ist zwar,"}, {"id": 162, "start": 1350.8, "end": 1357.4, "text": "das ist zwar Visual Studio, also Visual C-Sharp 2012, das ist nicht wirklich aktuell, aktuell"}, {"id": 163, "start": 1357.4, "end": 1366.16, "text": "ist.NET Core 5, aber wenn du Kapitel 1 bis Kapitel, inklusive Kapitel 16 machst, den"}, {"id": 164, "start": 1366.16, "end": 1369.48, "text": "Westen kannst du vergessen, das brauchst du nicht, dann hast du schon mal eine ganz gute"}, {"id": 165, "start": 1369.48, "end": 1374.32, "text": "Übersicht über so die absoluten Basics und wir wissen ja alle, ich muss es nicht sagen"}, {"id": 166, "start": 1374.32, "end": 1380.04, "text": "Leute, mit was man anfängt, das ist nicht verkehrt, ansonsten gibt es so viele Webcasts"}, {"id": 167, "start": 1380.04, "end": 1388.84, "text": "und Tutorial-Videos und alles mögliche auf YouTube, da kommt man auch an Start mit und"}, {"id": 168, "start": 1388.84, "end": 1392.92, "text": "Zweifelfall kann man sich auch irgendeinen Kurs kaufen, aber da kann ich dir nichts empfehlen,"}, {"id": 169, "start": 1392.92, "end": 1401.76, "text": "hast du C-Sharp beim Physik gelernt, nein ich konnte das vorher schon, auf der Arbeit"}, {"id": 170, "start": 1401.76, "end": 1406.56, "text": "musst du ABAP entwerfen, ernsthaft, es gibt Leute, die ernsthaft ABAP machen müssen?"}, {"id": 171, "start": 1406.56, "end": 1414.0, "text": "Moment, oder war ABAP das SAP Zeug, war das dieses SAP, war das diese SAP Krämpel da?"}, {"id": 172, "start": 1414.0, "end": 1420.4, "text": "Ne, mit Java kannst du zum Beispiel keine schönen Windows Desktop Anwendungen machen,"}, {"id": 173, "start": 1420.4, "end": 1424.32, "text": "du kannst mit Java zwar Desktop Anwendungen oder generell GUI Anwendungen machen, aber"}, {"id": 174, "start": 1424.32, "end": 1433.2, "text": "die sind so ein bisschen Java Style halt, aber Java kommt in die Richtung ja, wobei Java"}, {"id": 175, "start": 1433.2, "end": 1443.36, "text": "weiß ich nicht, ob man iOS Apps mitmachen kann, na klar mit Elotrix zusammen, Warzone,"}, {"id": 176, "start": 1443.36, "end": 1454.0, "text": "auf gehts Leute, ja das ist aus dem 3D Drucker das Logo, F-Sharp kenne ich ja, kenne ich"}, {"id": 177, "start": 1454.0, "end": 1466.32, "text": "aber nicht gut aus, SAP, ok, wie findest du PowerShell, ziemlich gut, aber nicht als"}, {"id": 178, "start": 1466.32, "end": 1473.4, "text": "interaktive Shell, für Automatisierung ist PowerShell cool, ne iOS ist nicht only Swift"}, {"id": 179, "start": 1473.4, "end": 1477.48, "text": "und C-Sharp, das mag zwar die Native Geschichte sein, aber meiner Meinung nach die einfachste"}, {"id": 180, "start": 1477.48, "end": 1484.76, "text": "Variante für Mobile Apps sind entweder Flutter oder sowas wie Ionic, einfach JavaScript quasi"}, {"id": 181, "start": 1484.76, "end": 1490.32, "text": "Elektron für Mobile, dann hast du eine App für alles zusammen, mags wie lange muss man"}, {"id": 182, "start": 1490.32, "end": 1496.72, "text": "programmieren lernen um damit Geld verdienen zu können, das kann man nicht in Zeit messen,"}, {"id": 183, "start": 1496.72, "end": 1506.4, "text": "so aber, also bevor ich jetzt hier lange rumlaufe, ich kann jetzt ja gleich mit euch weiter labern,"}, {"id": 184, "start": 1506.4, "end": 1513.28, "text": "ich flash mal die SSD, äh die MicroSD, warum sag ich immer SSD, und warum ist da eigentlich"}, {"id": 185, "start": 1513.28, "end": 1520.92, "text": "immer dieses komische, dieses komische Adapter dabei, hier, dieser komische Adapter, wozu,"}, {"id": 186, "start": 1520.92, "end": 1528.64, "text": "wo wenn, ich hab also von diesen Adaptern, ohne Scheiß Leute, hab ich bestimmt 40,"}, {"id": 187, "start": 1528.64, "end": 1536.96, "text": "damit es nach mehr aussieht vielleicht, ok, jetzt geht immer noch richtig auf,"}, {"id": 188, "start": 1536.96, "end": 1544.16, "text": "guckt euch das mal an, Aufreißchamp, komm mal, und das ist der eine, das ist alles,"}, {"id": 189, "start": 1544.16, "end": 1549.72, "text": "alles das hier für so, für so viel Inhalt, ist natürlich, das ist natürlich gerechtfertigt,"}, {"id": 190, "start": 1549.72, "end": 1558.64, "text": "ne, dafür, also klar, exellent, so dann flashen wir das jetzt erstmal, schenkt das den Leuten,"}, {"id": 191, "start": 1558.64, "end": 1564.8, "text": "die du nicht magst zum Geburtstag, ich bevorzuge Leute, die ich nicht mag, zu ignorieren bzw."}, {"id": 192, "start": 1564.8, "end": 1567.92, "text": "gar nicht in Kontakt mitzudrehten und denen schon gar nichts zum Geburtstag zu schenken,"}, {"id": 193, "start": 1567.92, "end": 1572.8, "text": "so wir flashen das mal nebenbei, also wie gesagt, wenn es noch was gibt Chat, schießt los,"}, {"id": 194, "start": 1572.8, "end": 1577.88, "text": "dann kann ich jetzt noch beantworten, wir haben ja noch Zeit, während das flasht,"}, {"id": 195, "start": 1577.88, "end": 1593.48, "text": "wenn ich die, wenn ich das rein bekomme, hallo, so schauen wir mal, wir hatten den Kram runtergeladen,"}, {"id": 196, "start": 1593.48, "end": 1596.92, "text": "ich lasse es jetzt mal oben eingeplendet, ich find das eigentlich ganz nice, hallo Chat,"}, {"id": 197, "start": 1596.92, "end": 1605.08, "text": "du kannst die Adapter auf der Gamescom raushauen, ja dann müsste ich auf die Gamescom gehen,"}, {"id": 198, "start": 1605.08, "end": 1609.72, "text": "ich hab gehört, ich hab gehört, auf der Gamescom kopiert man sich Fastpasse,"}, {"id": 199, "start": 1609.72, "end": 1625.08, "text": "fastpasses, nicht zu verwechseln mit DSL, fastpath, hat jemand eine gute, hat jemand eine gute,"}, {"id": 200, "start": 1625.08, "end": 1638.12, "text": "so ein Organizer für Micro SDs, Samsung Pro Endurance, beste, Grüße an Isle of Cookies,"}, {"id": 201, "start": 1638.12, "end": 1644.4, "text": "ja, ich hab mit ihm danach telefoniert und ich hab noch ein paar Sachen erfahren dazu,"}, {"id": 202, "start": 1644.4, "end": 1649.24, "text": "die sag ich jetzt aber nicht im Stream, weil erstens könnten da manche Leute Ärger kriegen"}, {"id": 203, "start": 1649.24, "end": 1652.28, "text": "und ich vielleicht auch, keine Ahnung, ich will da keinem auf die Füße treten,"}, {"id": 204, "start": 1652.28, "end": 1657.12, "text": "wir haben danach telefoniert noch mal und was da wieder für Dinger gelaufen sind,"}, {"id": 205, "start": 1657.12, "end": 1661.76, "text": "ich weiß schon warum ich mit dem ganzen YouTube Deutschland Crap nichts mehr zu tun hab,"}, {"id": 206, "start": 1661.76, "end": 1671.4, "text": "ja gut aber den da, also mal ernsthaft Leute, also den Kicks da, den findet ihr nicht auf"}, {"id": 207, "start": 1671.4, "end": 1675.76, "text": "Thingiverse, es sei denn irgendjemand hat meinen Kicks nachgebaut und auf Thingiverse gestellt,"}, {"id": 208, "start": 1675.76, "end": 1688.48, "text": "der da ist MaxSource Exclusive, so wo haben wir denn jetzt uns das aktuelle Raspberry Pi,"}, {"id": 209, "start": 1688.48, "end": 1694.96, "text": "ich hab es doch letztens erst runter geladen, Raspberry Pi OS Booster, da ist es, Booster,"}, {"id": 210, "start": 1694.96, "end": 1708.4, "text": "ich mein, Leute wir machen was anderes, ich zeig euch mal was, wir flashen aktuell das"}, {"id": 211, "start": 1708.4, "end": 1723.92, "text": "Ubuntu drauf, weil Ubuntu 64 Bit, da kann ich mehr Heat Generaten, VCG GAN, gibt's das unter Ubuntu?"}, {"id": 212, "start": 1723.92, "end": 1734.32, "text": "Weil das wär wichtig, damit kann man nämlich die Temperatur auslesen vom Raspberry Pi,"}, {"id": 213, "start": 1734.32, "end": 1750.48, "text": "da hat Windows, ja genau, ok ich glaub wir bleiben doch beim offiziellen Respian,"}, {"id": 214, "start": 1750.48, "end": 1758.48, "text": "gibt's bei Ubuntu ok, weil hier sieht es nicht so aus als gibt's das,"}, {"id": 215, "start": 1758.48, "end": 1768.52, "text": "ok wir probieren das jetzt einfach mal aus, ich zeig euch mal was cooles, wenn ihr Arch habt"}, {"id": 216, "start": 1768.52, "end": 1775.32, "text": "oder Manjaro habt, da gibt's so nen Tool, den Raspberry Pi Imager, ist eigentlich viel praktischer"}, {"id": 217, "start": 1775.32, "end": 1782.48, "text": "als mit Edger jedes mal den Kram zu machen, du kannst den Notexporter drauf schmeißen,"}, {"id": 218, "start": 1782.48, "end": 1788.8, "text": "wenn der das ohne diesen Kram auslesen kann, ja dann kann ich das machen, und jetzt starten wir"}, {"id": 219, "start": 1788.8, "end": 1796.4, "text": "das Ding, Raspberry Pi Imager und das ist viel angenehmer als den Kram jedes mal runterzuladen"}, {"id": 220, "start": 1796.4, "end": 1804.44, "text": "und zu flashen, Choose OS sagen wir einfach anderes OS, nee anderes OS, Ubuntu und dann"}, {"id": 221, "start": 1804.44, "end": 1824.96, "text": "nehmen wir 64bit, 20.10, ARM64, Bam, Choose SD Card, ich dachte eigentlich das hat er,"}, {"id": 222, "start": 1824.96, "end": 1833.12, "text": "Choose SD, wie ernsthaft, das erkennt er nicht noch, oh Gott, MonkaS, 3-Hat-Programm alter,"}, {"id": 223, "start": 1833.12, "end": 1861.84, "text": "what the fuck, alter doch, oi mate, oi, äh, er kennt ja,"}, {"id": 224, "start": 1861.84, "end": 1879.92, "text": "er erkennt ja die SD-Karte grad nicht, ok Leute, großer Nintendo Trick,"}, {"id": 225, "start": 1879.92, "end": 1900.64, "text": "PulseChamp, hallo,"}, {"id": 226, "start": 1900.64, "end": 1920.84, "text": "warum erkennt der denn jetzt nichts, der erkennt die micro SD-Karte nicht, but why, was ist das,"}, {"id": 227, "start": 1920.84, "end": 1929.2, "text": "ok jetzt ist die große preisfrage, wisst ihr was wir probieren, wir probieren jetzt diesen"}, {"id": 228, "start": 1929.2, "end": 1935.44, "text": "kack Adapter aus, aber es damit erkennt, der krümelt 2 Monate, dankeschön, ich hab noch"}, {"id": 229, "start": 1935.44, "end": 1940.72, "text": "irgendwo einen anderen SD-Karten-Leser, wartet mal, fuck den hab ich schon ewig nicht mehr"}, {"id": 230, "start": 1940.72, "end": 1950.92, "text": "verwendet, weil ich nicht, weiß nicht wo der ist, ich hab irgendwo noch einen anderen"}, {"id": 231, "start": 1950.92, "end": 1964.52, "text": "SD-Karten-Leser, liegt der hier oben vielleicht, nee, oi, ich hab den, ich hab ihn letztens"}, {"id": 232, "start": 1964.52, "end": 1983.52, "text": "irgendwo gesehen, ist er hier, hm, hier ist er nicht, hm, wartet mal, ich guck mal kurz"}, {"id": 233, "start": 1983.52, "end": 2006.24, "text": "hier neben, ob der hier neben liegt, SD-Karten-Champ, ist der Cam Link, aber kein SD-Karten-Leser,"}, {"id": 234, "start": 2006.24, "end": 2020.96, "text": "na gut, ich mein der Kram wird schon funktionieren, so, ich machs jetzt mal raus, jetzt nehmen"}, {"id": 235, "start": 2020.96, "end": 2027.72, "text": "wir mal diesen Müll hier und gucken ob wir das da irgendwie, hier muss man das da rein,"}, {"id": 236, "start": 2027.72, "end": 2047.2, "text": "erst mal abputzen und schon drauf fingern, so, zack, probieren wir mal ob es so funktioniert,"}, {"id": 237, "start": 2047.2, "end": 2071.28, "text": "ok Leute, ich reboote mal, ich mein prinzipiell erkennt er den Kram ja, was, USB-Disconnect,"}, {"id": 238, "start": 2071.28, "end": 2085.28, "text": "war das jetzt nicht durchgereicht, warum erkennt er diese Karte da drin nicht, was ist das"}, {"id": 239, "start": 2085.28, "end": 2090.32, "text": "schon wieder für ein Crap, ist die SD-Karte wirklich im Arsch, komm lass mal unter Windows"}, {"id": 240, "start": 2090.32, "end": 2117.6, "text": "gucken, lass mal unter Windows gucken, ist das, wie, CacWaite, unter Windows erkennt"}, {"id": 241, "start": 2117.6, "end": 2132.0, "text": "das, äh, jetzt bin ich aber ratlos, nee, nee am formatieren kann das nicht liegen,"}, {"id": 242, "start": 2132.0, "end": 2148.48, "text": "der muss das ja erkennen als SD-Karte, what the hell, was ist denn das für eine kacke,"}, {"id": 243, "start": 2148.48, "end": 2156.72, "text": "ok Leute, reboot, easy, nee die verschwindet ja unter Windows wenn man die unter Linux"}, {"id": 244, "start": 2156.72, "end": 2165.28, "text": "mountet, wüsste ich jetzt wo mein anderer Micro SD-Karten-Reader ist, ne, dann könnte"}, {"id": 245, "start": 2165.28, "end": 2171.48, "text": "ich den auch, könnte ichs mal ausprobieren, aber ich hab echt keinen Plan, wenn ich hier"}, {"id": 246, "start": 2171.48, "end": 2175.56, "text": "so am Schreibtisch rumguck, sind zwar Geräte da, die sehr ähnlich aussehen, aber der Micro"}, {"id": 247, "start": 2175.56, "end": 2186.6, "text": "SD-Karten-Leser ist nicht da, mal gucken ob es jetzt geht nach dem Reboot, Leute das"}, {"id": 248, "start": 2186.6, "end": 2190.36, "text": "ist doch noch, hat doch mit Lateisystem überhaupt nichts zu tun, wenn er das Device nicht mal"}, {"id": 249, "start": 2190.36, "end": 2203.92, "text": "findet, chat, CacWaite, wenn er noch nicht mal das Gerät an sich erkennt, dann ist es,"}, {"id": 250, "start": 2203.92, "end": 2218.0, "text": "das ist noch ein Schritt vor Fallsystem, ha, da ist sie, easy, Reboot, einfach Leute, einfach"}, {"id": 251, "start": 2218.0, "end": 2225.52, "text": "Rebooten, easy, alles gut, alles geregelt, einfach, einfach Rebooten, sehr schön, sehr"}, {"id": 252, "start": 2225.52, "end": 2234.32, "text": "schön, ok Champ, so, jetzt können wir endlich das machen, was ich eigentlich machen will,"}, {"id": 253, "start": 2234.32, "end": 2241.24, "text": "also OS auswählen, ist die Musik ein bisschen laut heute, ticken laut vielleicht, bisschen"}, {"id": 254, "start": 2241.24, "end": 2248.52, "text": "leiser, so, Reboot-Champ, hatte ich irgendeine Kernel-Update gestern noch gemacht, ach was"}, {"id": 255, "start": 2248.52, "end": 2257.68, "text": "doch immer, man weiß es nicht, aber, sag mal mal so, ne, auch mit Kernel-Update sollte"}, {"id": 256, "start": 2257.68, "end": 2270.24, "text": "eigentlich ein USB, ist wurscht, so, zack, Ubuntu, 64bit, Server OS, jawoll, Choose SD-Kart,"}, {"id": 257, "start": 2270.24, "end": 2280.32, "text": "da ist es, 64G, right, yes, so, man sieht die Dinger sind jetzt auch ein bisschen schneller,"}, {"id": 258, "start": 2280.32, "end": 2290.76, "text": "die sind jetzt auch ein bisschen schneller als die andere SD-Karte, ja, der muss auch"}, {"id": 259, "start": 2290.76, "end": 2301.28, "text": "nebenbei runterladen, welches Case, nein, dieses Case hier, da steht es ja schon drauf,"}, {"id": 260, "start": 2301.28, "end": 2308.32, "text": "the most beautifully crafted Raspberry Pi 4 Case, und wenn der Hersteller das sagt, wissen"}, {"id": 261, "start": 2308.32, "end": 2314.16, "text": "wir ja prinzipiell, dass das immer stimmt, hat uns jemals den Hersteller schon angelogen,"}, {"id": 262, "start": 2314.16, "end": 2332.04, "text": "glaub nie vor, die Hersteller sagen aus Prinzip immer die Wahrheit, 16 times the detail, so,"}, {"id": 263, "start": 2332.04, "end": 2339.8, "text": "jetzt kann ich mal ein bisschen Chat gucken, während das flasht, also, muss der das Image"}, {"id": 264, "start": 2339.8, "end": 2345.28, "text": "bei jedem Start neu runterladen, ne, ich glaub der cached sich das irgendwo, wie sieht denn"}, {"id": 265, "start": 2345.28, "end": 2351.52, "text": "das Case aus, so, passiv gekühlt, wir packen das gleich aus, aber erstmal muss ich den"}, {"id": 266, "start": 2351.52, "end": 2364.6, "text": "Raspberry Pi flashen, so, ich scroll jetzt mal kurz den Chat durch, ob ich irgendwas"}, {"id": 267, "start": 2364.6, "end": 2373.36, "text": "vergessen hab, zu beantworten, während der hier am flashen ist, also Chat, ich muss euch"}, {"id": 268, "start": 2373.36, "end": 2382.0, "text": "sagen, ich verstehe euren Reflex, wenn was nicht geht, den Self dazu zu geben, dass, den"}, {"id": 269, "start": 2382.0, "end": 2386.6, "text": "gleichen Reflex hab ich auch immer, wenn irgendwas nicht geht, aber es wäre schön,"}, {"id": 270, "start": 2386.6, "end": 2394.16, "text": "wenn ihr manchmal ein bisschen langsamer werdet, weil manche Sachen ergeben keinen Sinn, zum"}, {"id": 271, "start": 2394.16, "end": 2398.84, "text": "Beispiel, wenn man erst das Device nicht sieht, braucht man sich um das File System geile Gedanken"}, {"id": 272, "start": 2398.84, "end": 2418.96, "text": "machen, aber trotzdem, Big Brain Chat, wie immer, Maxwort plus Champ, ja, Slow Champ,"}, {"id": 273, "start": 2418.96, "end": 2436.08, "text": "has been written, ok, nice, continue, zack, und jetzt das allerwichtigste, was man sowohl"}, {"id": 274, "start": 2436.08, "end": 2444.48, "text": "unter Ubuntu als auch unter Raspian machen muss, ja, 30 FPS vm ist eindeutig zu wenig,"}, {"id": 275, "start": 2444.48, "end": 2450.92, "text": "viel, viel zu wenig, man muss den Kram mounten, ich hab's bestimmt noch in der History, mount,"}, {"id": 276, "start": 2450.92, "end": 2458.2, "text": "sdb mounten, oder halt da, wo euer SD-Karte ist, touch ssh, weil ansonsten könnt ihr"}, {"id": 277, "start": 2458.2, "end": 2467.84, "text": "euch nicht einloggen drauf, es suckt, so, gut, dann können wir die SD-Karte rausziehen,"}, {"id": 278, "start": 2467.84, "end": 2480.56, "text": "zack, zack, und können jetzt das ganze mal in den Raspberry Pi stecken und gucken, ob"}, {"id": 279, "start": 2480.56, "end": 2486.4, "text": "da alles startet, machen wir das hier mal weg, oh, da ist noch das alte drin, das leg ich"}, {"id": 280, "start": 2486.4, "end": 2496.52, "text": "mal hier oben in so ein Fach, dass ich's wieder finde, zack, gut, mir fällt grad auf, ich"}, {"id": 281, "start": 2496.52, "end": 2504.32, "text": "hab kein Netzwerkkabel, oder doch, oder hab ich die draußen alle im Schrank, wartet mal,"}, {"id": 282, "start": 2504.32, "end": 2510.32, "text": "ich werd hier doch irgendwo, ohne dass ich jetzt rausgehen muss, noch Netzwerkkabel rumfliegen"}, {"id": 283, "start": 2510.32, "end": 2522.48, "text": "haben, was ich nicht brauche, hm, ich hab aufgeräumt, manchmal hat es echt seine Nachteile,"}, {"id": 284, "start": 2522.48, "end": 2529.76, "text": "wenn man aufräumt, wenn man aufräumt ist danach nix mehr da, weiß nicht, ob ihr dieses"}, {"id": 285, "start": 2529.76, "end": 2540.16, "text": "Phänomen kennt, das ist wie, wenn man Unreal Tournament spielen will, da will man ja auch"}, {"id": 286, "start": 2540.16, "end": 2547.44, "text": "nicht, dass es lädt, nee, ich hab kein Netzwerkkabel mehr hier, ich hab alles aufgeräumt, top,"}, {"id": 287, "start": 2547.44, "end": 2577.2, "text": "Ordnungs-Champ, bin sofort wieder da, die neben mir, die neben mir, die neben mir, die"}, {"id": 288, "start": 2577.2, "end": 2578.2, "text": "neben mir."}, {"id": 289, "start": 2578.2, "end": 2587.32, "text": "WLAN will ich in dem Fall jetzt erstmal nicht haben, so ich hab das längste Netzwerkkabel"}, {"id": 290, "start": 2587.32, "end": 2600.64, "text": "aller Zeiten geholt, also ich glaub ein viel kürzeres Netzwerkkabel werdet ihr nicht finden,"}, {"id": 291, "start": 2600.64, "end": 2608.56, "text": "Miniaturnetzwerkkabel, aber ich mein, für unsere Zwecke, wenn man das jetzt mal auseinander"}, {"id": 292, "start": 2608.56, "end": 2619.88, "text": "kriegt irgendwie, für unsere Zwecke soll das hier ausreichen, zack, so, was darfs sein,"}, {"id": 293, "start": 2619.88, "end": 2634.2, "text": "welcher Port, acht oder so, vier, vier, optimal Port, optimaler PogChamp-Port, so, Raspberry"}, {"id": 294, "start": 2634.2, "end": 2641.36, "text": "Pi Netzteil ist hier, dann schließen wir das jetzt mal an, so ein bisschen, sodass man"}, {"id": 295, "start": 2641.36, "end": 2645.56, "text": "das irgendwie gescheit sieht, so, und dann gucken wir mal, ob wir uns einloggen können,"}, {"id": 296, "start": 2645.56, "end": 2653.4, "text": "so, da muss jetzt eh erstmal die Festplatte, äh, nicht die Festplatte, die Micro SD-Karte"}, {"id": 297, "start": 2653.4, "end": 2660.12, "text": "muss der jetzt hier erstmal hier irgendwie, macht der was, ja, erstmal resizen und alles"}, {"id": 298, "start": 2660.12, "end": 2669.56, "text": "mögliche, seht ihr eigentlich, seht ihr, wartet mal, seht ihr, dass der Link aktiv"}, {"id": 299, "start": 2669.56, "end": 2674.56, "text": "ist, erkennt man das, ja, das sieht man, ne, vielleicht müsste ich den Switch noch ein"}, {"id": 300, "start": 2674.56, "end": 2682.08, "text": "bisschen, wartet mal, vielleicht mach ich den Switch noch ein bisschen hoch, dass man"}, {"id": 301, "start": 2682.08, "end": 2691.24, "text": "die Ports, die Ports besser erkennt, probieren wir mal aus, weil ich hab mir überlegt, das"}, {"id": 302, "start": 2691.24, "end": 2695.52, "text": "Setup, so, ist eigentlich ziemlich praktisch, du hast hier den Switch, du hast hier neben"}, {"id": 303, "start": 2695.52, "end": 2700.0, "text": "die Steckdosenleiste und hier kannst du alles machen drauf, und ich muss es nicht rumlaufen,"}, {"id": 304, "start": 2700.0, "end": 2703.84, "text": "das steht jetzt direkt am Fenster, ich muss eigentlich gar nichts machen im Endeffekt,"}, {"id": 305, "start": 2703.84, "end": 2716.84, "text": "das ist ganz, ganz nützlich, so, besser jetzt, erkennt man es jetzt besser, jetzt erkennt"}, {"id": 306, "start": 2716.84, "end": 2733.08, "text": "man noch besser, dass der Link an ist, oder, er macht keinen großen Unterschied, so, exquisite,"}, {"id": 307, "start": 2733.08, "end": 2738.28, "text": "so jetzt schauen wir mal, ob wir Verbindungen zum Raspberry Pi bekommen, machen wir das"}, {"id": 308, "start": 2738.28, "end": 2745.48, "text": "mal ein bisschen klein, das ist, ne, das ist kein SFP Plus Modul, das ist ein Direct Attached"}, {"id": 309, "start": 2745.48, "end": 2754.64, "text": "Kabel, du meinst das da, ne, hier, den da, das ist ein 7 Meter Direct Attached Kabel,"}, {"id": 310, "start": 2754.64, "end": 2782.04, "text": "das geht hinter in den Server Raum, so, wait a minute, den Raspberry Pi nicht erkannt, doch"}, {"id": 311, "start": 2782.04, "end": 2798.8, "text": "hier, kann das Ding aus 7 Millionen Megaflips, Paint's Champ, Paint's Champ Joke, also SSH,"}, {"id": 312, "start": 2798.8, "end": 2807.28, "text": "Copy ID, Ubuntu, ich glaube Ubuntu ist der Standard Login, yes, Ubuntu, Ubuntu irgendwie"}, {"id": 313, "start": 2807.28, "end": 2830.76, "text": "so war das Passwort glaube, oder was, Ubuntu Leer, oder was, Ubuntu Passwort, ach man musste"}, {"id": 314, "start": 2830.76, "end": 2835.4, "text": "sich erstmal ein, das ist, das ist, ne, ne, das ist Lowprane, Ubuntu Tackling, man muss"}, {"id": 315, "start": 2835.4, "end": 2841.44, "text": "sich erstmalig einloggen und ein neues Passwort vergeben und dann kann ich das Passwort deaktivieren,"}, {"id": 316, "start": 2841.44, "end": 2858.32, "text": "richtig hängen geblieben, so und jetzt, und jetzt geht das, richtig, richtig, richtig"}, {"id": 317, "start": 2858.32, "end": 2876.76, "text": "Lowprane, Moment, wo ist mein Ubuntu Emote, find's nicht, Lowprane Jubantu, ja, da sind"}, {"id": 318, "start": 2876.76, "end": 2883.6, "text": "wir am Start, das ganze ist jetzt deutlich schneller mit dieser SD Karte, mit dieser"}, {"id": 319, "start": 2883.6, "end": 2888.56, "text": "Mikro SD Karte als mit der anderen, wir hätten auch die, wir hätten auch die SSD nehmen"}, {"id": 320, "start": 2888.56, "end": 2896.04, "text": "können, so und jetzt gucken wir erstmal wie warm das ganze wird und jetzt gucken wir mal"}, {"id": 321, "start": 2896.04, "end": 2902.84, "text": "ob das stimmt, ob der Chat Recht hat, der Chat meinte nämlich, VC Gen ist auf Ubuntu"}, {"id": 322, "start": 2902.84, "end": 2917.16, "text": "vorhanden, das war nur der Sound, wieso ist das feste IP Adressen vergeben an ein Raspberry"}, {"id": 323, "start": 2917.16, "end": 2931.2, "text": "Pi per SSH, so kennste, ist das gar nicht, Raspberry Pi Config und gut ist, VC Gen ist"}, {"id": 324, "start": 2931.2, "end": 2954.72, "text": "nicht drauf, Chat, wer hat mich jebaited, achso, na, aber VC Gen CMD ist auch nicht drauf,"}, {"id": 325, "start": 2954.72, "end": 2961.28, "text": "ah man kann's aber nachinstallieren, ok nur halb jebaited, nur halb jebaited, ich will"}, {"id": 326, "start": 2961.28, "end": 2965.08, "text": "aber kein Nodexporter da drauf jetzt installieren und danach irgendwie im Grafana einrichten"}, {"id": 327, "start": 2965.08, "end": 2975.92, "text": "oder sonst was, ich will einfach die Temperatur auslesen, kann Sensors das eigentlich auch,"}, {"id": 328, "start": 2975.92, "end": 2993.92, "text": "von Kryptowagen hab ich keine großartige Ahnung, ok VC Gen CMD und jetzt, ich hab keine Ahnung"}, {"id": 329, "start": 2993.92, "end": 3012.44, "text": "wie die, Temperature, Measure Temp, ok, Measure Temp, exellent, also, CPU, CPU ist 48 Grad,"}, {"id": 330, "start": 3012.44, "end": 3018.6, "text": "Stress Suspension, so und jetzt machen wir mal ein bisschen Temperatur auf dem Ding,"}, {"id": 331, "start": 3018.6, "end": 3040.36, "text": "hallo Chat, das sieht voll, das sieht voll 3-Head aus, wenn ich winke und nur die halbe"}, {"id": 332, "start": 3040.36, "end": 3043.88, "text": "Hand drinne ist, das sieht an als, als er auslässt, ich kann irgendwen anfallen oder"}, {"id": 333, "start": 3043.88, "end": 3051.48, "text": "so, das sieht voll kaputt aus, hast du noch Passivkühler, nee das machen wir mit dem"}, {"id": 334, "start": 3051.48, "end": 3057.96, "text": "aktuellen Gehäuse, das gerade, also aktuell hab ich gar nichts, ich hab, guckt hier, Massive"}, {"id": 335, "start": 3057.96, "end": 3066.36, "text": "Brain Chat, hier, gar nichts drauf, absolut nackig, Xeroxin und Dankeschön für den Zap,"}, {"id": 336, "start": 3066.36, "end": 3073.4, "text": "warum benutzt du T-Max, weil's besser ist, weil du da so Big Brain Sachen machen kannst"}, {"id": 337, "start": 3073.4, "end": 3077.84, "text": "wie Splitten oder so und dann wieder, und dann wieder raus, reinzoomen und rauszoomen"}, {"id": 338, "start": 3077.84, "end": 3083.12, "text": "und Zeug und du kannst relativ easy sharen, was bei Screen auch geht, aber nicht so einfach"}, {"id": 339, "start": 3083.12, "end": 3098.16, "text": "ist, so, Watch, was war das, VC, Gen, CMD, Measure, Measurer Temp, so und wie sagt man"}, {"id": 340, "start": 3098.16, "end": 3106.04, "text": "bei Watch noch mal die Zeit wie er aktualisieren soll, N, ah yes, so, Hardtop, gucken wir uns"}, {"id": 341, "start": 3106.04, "end": 3114.28, "text": "mal an wie die Auslastung ist, so, ok, es war mal ein bisschen Temperatur, Stress, Minus"}, {"id": 342, "start": 3114.28, "end": 3124.6, "text": "Minus CPU 8, nee, CPU 4, jetzt bin ich mir nicht sicher wie es weiter geht, also wir"}, {"id": 343, "start": 3124.6, "end": 3138.68, "text": "machen Stress Leute, Temperatur geht rauf, 100% CPU Auslastung, hat der Raspberry Pi"}, {"id": 344, "start": 3138.68, "end": 3145.88, "text": "irgendeine Art von, keine Ahnung, Hyper Threading oder sowas, lohnt sich das mehr als, lohnt"}, {"id": 345, "start": 3145.88, "end": 3156.04, "text": "sich das mehr als 4 Threads zu starten, welches Case testen wir aktuell, es ist noch gar kein"}, {"id": 346, "start": 3156.04, "end": 3164.16, "text": "Case dran, aber wir testen dieses hier, das ist meiner Meinung nach beste Case, sowohl"}, {"id": 347, "start": 3164.16, "end": 3169.68, "text": "von der Verarbeitung her, als auch von der Optik, als auch, vielleicht nicht unbedingt"}, {"id": 348, "start": 3169.68, "end": 3172.04, "text": "Nummer 1 bei der Kühlleistung aber ausreichend."}, {"id": 349, "start": 3172.04, "end": 3188.8, "text": "So, also es wird ordentlich warm, soll ich mal draufgreifen Leute, echt kann man das"}, {"id": 350, "start": 3188.8, "end": 3200.32, "text": "direkt auslesen, aus Zyster ist das natürlich auch nice, oh, Alter, das ist heiss as fuck,"}, {"id": 351, "start": 3200.32, "end": 3210.68, "text": "ob das nur 63 ist, ich weiß, au, das ist richtig heiss, die Argon Dinger sind richtig gut,"}, {"id": 352, "start": 3210.68, "end": 3214.0, "text": "das stimmt, aber die sind größer und die sind, finde ich, fast schon ein bisschen zu"}, {"id": 353, "start": 3214.0, "end": 3215.0, "text": "teuer."}, {"id": 354, "start": 3215.0, "end": 3226.4, "text": "Wisst ihr was wir jetzt noch bräuchten?"}, {"id": 355, "start": 3226.4, "end": 3234.72, "text": "So eine Wärmebildkamera, die das erkennt, wie warm es ist, oder wir müssten uns einen"}, {"id": 356, "start": 3234.72, "end": 3248.12, "text": "ESP32 machen mit einem Temperatursensor, mit so einem DS20, bla, wie auch immer, ich kann"}, {"id": 357, "start": 3248.12, "end": 3258.12, "text": "einen Suspension machen, ja, und den dann da draufkleben, ok, das wird echt warm jetzt,"}, {"id": 358, "start": 3258.12, "end": 3263.12, "text": "ok, mach ich, ich mach genau das Kommando, was du geschickt hast, wird ja nicht allzu"}, {"id": 359, "start": 3263.12, "end": 3275.04, "text": "lange dauern, ah, siehste, Grip, geht schonmal nicht, Chat schickt Kommandos die nicht"}, {"id": 360, "start": 3275.04, "end": 3291.24, "text": "funktionieren, muss man da 4 machen, 3 Headchats, hast du ihn übertakt, ne, das können wir"}, {"id": 361, "start": 3291.24, "end": 3301.92, "text": "gleich noch machen, das können wir gleich noch machen, Suspension ist installiert, run,"}, {"id": 362, "start": 3301.92, "end": 3314.56, "text": "ah, yes, exzellent, hier lassen wir mal kurz Suspension, es gibt glaube ich schon eine"}, {"id": 363, "start": 3314.56, "end": 3318.92, "text": "Wasserkühlung, doch, ich glaube es gibt mittlerweile, es gibt mittlerweile eine Wasserkühlung, wir"}, {"id": 364, "start": 3318.92, "end": 3325.04, "text": "brauchen mehr Subscriber, ja immer, ich weiß nicht ob ich euch schon erzählt habe, dass"}, {"id": 365, "start": 3325.04, "end": 3329.6, "text": "wenn ihr einen Amazon Prime Account habt, dass ihr kostenlos einmal im Monat einen Streamer"}, {"id": 366, "start": 3329.6, "end": 3337.36, "text": "eurer Wahl unterstützen könnt auf Twitch, so, hier hast du deine Ausgabe, deine Suspension"}, {"id": 367, "start": 3337.36, "end": 3343.04, "text": "Ausgabe, exquisite, so und jetzt machen wir nochmal Stress und danach übertakten wir"}, {"id": 368, "start": 3343.04, "end": 3356.6, "text": "ihn nochmal, ja, kann man machen, also selbst ausdrucken ist auch eine Variante, allerdings"}, {"id": 369, "start": 3356.6, "end": 3363.04, "text": "aus dem 3D Drucker kriegst du ja keine wärmeleitenden Gehäuse raus, also keine Metall Gehäuse, wie"}, {"id": 370, "start": 3363.04, "end": 3367.16, "text": "lange Stress, solange bis sich die Temperatur nicht mehr nennenswert verändert, also das"}, {"id": 371, "start": 3367.16, "end": 3371.8, "text": "letzte Mal sind wir glaube ich hoch auf, frag mich nicht, 78 Grad oder so gekommen, mit"}, {"id": 372, "start": 3371.8, "end": 3375.84, "text": "dem letzten Pi 4, bevor wir es ins Gehäuse gebaut haben, in ein anderes Gehäuse, nicht"}, {"id": 373, "start": 3375.84, "end": 3384.16, "text": "in das Gehäuse, das Gehäuse hatten wir im Stream noch nicht, aber jetzt lassen wir"}, {"id": 374, "start": 3384.16, "end": 3390.16, "text": "ihn erstmal ordentlich, ordentlich Temperatur, und dann übertakten wir ihn, ich weiß gar"}, {"id": 375, "start": 3390.16, "end": 3397.8, "text": "nicht mehr wie das ging, ich glaube config.txt, Monster360 abonniert Twitch Prime, Dankeschön,"}, {"id": 376, "start": 3397.8, "end": 3406.64, "text": "Massive Sub IQ++ Dankeschön für die Subscription, Sellout hat gewirkt, ab und zu muss man ein"}, {"id": 377, "start": 3406.64, "end": 3412.28, "text": "bisschen Sellout machen, Pi Overclock, ich glaube man muss irgendwas in config.txt schreiben,"}, {"id": 378, "start": 3412.28, "end": 3425.16, "text": "ich habe, das ist Ubuntu drauf, ich habe kein config, also ich habe kein config oder so"}, {"id": 379, "start": 3425.16, "end": 3453.32, "text": "was, kann man das nachinstallieren, nee, übertakten jetzt, also hier, config, excellent, das ist"}, {"id": 380, "start": 3453.32, "end": 3461.92, "text": "super, dass in der config übertakten geht, aber angeblich geht das hier, wie sieht man"}, {"id": 381, "start": 3461.92, "end": 3476.28, "text": "die Clockspeed, das ist doch einfach nur, ach hier, Frequency, hier Frequency, Salken"}, {"id": 382, "start": 3476.28, "end": 3486.12, "text": "21, Twitch Prime, Dankeschön für den Sub, so, Boot, config, nee warte mal, wo liegt"}, {"id": 383, "start": 3486.12, "end": 3509.0, "text": "das Ding, Moment wo, config, CacWaite, die gibt es bei mir gar nicht, CacWaite, ok da"}, {"id": 384, "start": 3509.0, "end": 3519.32, "text": "müssen wir mal suchen, Ubuntu Overclock Pi 4, tja Killcard, du musstest so schreiben,"}, {"id": 385, "start": 3519.32, "end": 3526.0, "text": "dass ich sehe, jetzt habe ich es zufällig mal gesehen, aber wenn die Fragen nicht explizit"}, {"id": 386, "start": 3526.0, "end": 3536.44, "text": "an mich gehen, dann sehe ich die nicht, ok wie übertaktet man da, man kann die Datei"}, {"id": 387, "start": 3536.44, "end": 3540.96, "text": "vielleicht einfach anlegen, hast du aktuell schon einen neuen Job, wenn ja wo, wenn man"}, {"id": 388, "start": 3540.96, "end": 3550.36, "text": "fragen darf, ich habe keinen neuen Job, ich habe immer noch den gleichen Job, Overvoltage,"}, {"id": 389, "start": 3550.36, "end": 3579.8, "text": "BAM, ok Leute, wir übertakken jetzt, config.txt und einfach jetzt diesen Kram da rein, ok"}, {"id": 390, "start": 3579.8, "end": 3591.44, "text": "wir übertakken jetzt von 1500 Mhz auf 2000 Mhz, ok schauen wir mal, mal gucken ob das"}, {"id": 391, "start": 3591.44, "end": 3618.6, "text": "so funktioniert, und wir overvolten auch, Nexonos, Twitch Prime, Dankeschön für den"}, {"id": 392, "start": 3618.6, "end": 3629.16, "text": "App, das YouTube Kündigungsvideo, ja ich weiß nicht, wie weit du es geguckt hast, aber"}, {"id": 393, "start": 3629.16, "end": 3634.28, "text": "in dem YouTube Kündigungsvideo erzähle ich nicht von meinem aktuellen Job, sondern dort"}, {"id": 394, "start": 3634.28, "end": 3638.84, "text": "wo ich meine Ausbildung gemacht habe, und am Ende erzähle ich auch, dass ich nach der"}, {"id": 395, "start": 3638.84, "end": 3654.0, "text": "Ausbildung dort gelandet bin, wo ich jetzt bin, ok mal schauen, übertaken hat nicht funktioniert,"}, {"id": 396, "start": 3654.0, "end": 3663.56, "text": "ok wait, ok vielleicht muss man Last verursachen, vielleicht muss man Last verursachen, dass"}, {"id": 397, "start": 3663.56, "end": 3680.44, "text": "es funktioniert, Stress, Stress, Stress, Jawoll, BAM, nope, ich hab doch rebooted, geht nicht,"}, {"id": 398, "start": 3680.44, "end": 3705.96, "text": "übertaken not, not possible, falsche Ordner, echt, ne oder, oh, Kirk Wade, Ups, äh, ok"}, {"id": 399, "start": 3705.96, "end": 3734.72, "text": "use config, hast du im Tätigse user, OMG, Info freqemity, ok, ich reboot nochmal, es"}, {"id": 400, "start": 3734.72, "end": 3763.68, "text": "aked"}, {"id": 401, "start": 3763.68, "end": 3771.84, "text": "Kann man das auch irgendwie mit dem VC Gen Tool machen?"}, {"id": 402, "start": 3771.84, "end": 3776.64, "text": "Die Musik ist übrigens laut auf einmal, ne?"}, {"id": 403, "start": 3776.64, "end": 3777.64, "text": "Passt eigentlich."}, {"id": 404, "start": 3777.64, "end": 3786.64, "text": "So, mal gucken, was der jetzt sagt."}, {"id": 405, "start": 3786.64, "end": 3792.08, "text": "Oh, startet er jetzt nicht mehr oder was?"}, {"id": 406, "start": 3792.08, "end": 3805.6, "text": "Ah, da ist er wieder."}, {"id": 407, "start": 3805.6, "end": 3806.6, "text": "MonkaS."}, {"id": 408, "start": 3806.6, "end": 3815.36, "text": "Dachte schon, er startet nicht mehr."}, {"id": 409, "start": 3815.36, "end": 3820.72, "text": "Das wär jetzt jetzt echt gewesen."}, {"id": 410, "start": 3820.72, "end": 3833.72, "text": "Bäm, 2 Gigahertz, jawoll, wow, 6000 Gigahertz, ne, ach ne, 600 Megahertz nur noch, alles"}, {"id": 411, "start": 3833.72, "end": 3834.72, "text": "klar."}, {"id": 412, "start": 3834.72, "end": 3838.32, "text": "Okay, dann gucken wir doch mal, wie warm er jetzt wird."}, {"id": 413, "start": 3838.32, "end": 3848.12, "text": "Stress, bäm."}, {"id": 414, "start": 3848.12, "end": 3855.84, "text": "Ja, ja, alles ausgelastet."}, {"id": 415, "start": 3855.84, "end": 3863.52, "text": "Oh ja, da wird schon ein bisschen wärmer jetzt, he?"}, {"id": 416, "start": 3863.52, "end": 3864.52, "text": "Wo ist ein Limit?"}, {"id": 417, "start": 3864.52, "end": 3866.52, "text": "Wo, wo ist ein Limit?"}, {"id": 418, "start": 3866.52, "end": 3867.52, "text": "Temperatur?"}, {"id": 419, "start": 3867.52, "end": 3873.24, "text": "Leute, ah, zählt das als Selbstverletzung im Stream, wenn ich mich da jetzt verbrenne?"}, {"id": 420, "start": 3873.24, "end": 3878.56, "text": "Werdest du dann gebannt?"}, {"id": 421, "start": 3878.56, "end": 3890.52, "text": "Ah, Leute, das ist übelst heiß, das geht gut ab."}, {"id": 422, "start": 3890.52, "end": 3900.4, "text": "Okay, noch taktet er sich nicht runter, ähm, max Temperatur."}, {"id": 423, "start": 3900.4, "end": 3906.68, "text": "Ja, und?"}, {"id": 424, "start": 3906.68, "end": 3917.64, "text": "Was, was, was, ab wann taktet er sich runter?"}, {"id": 425, "start": 3917.64, "end": 3921.16, "text": "83 Grad."}, {"id": 426, "start": 3921.16, "end": 3926.12, "text": "Also, der takt, also anscheinend noch nicht."}, {"id": 427, "start": 3926.12, "end": 3941.48, "text": "Ah, über 85 Grad, okay, über 85 Grad taktet er sich runter."}, {"id": 428, "start": 3941.48, "end": 3957.24, "text": "Das Flirrcase, ich hab's auf Amazon bei einem Drittanbieter gekauft, ich kann jetzt aber"}, {"id": 429, "start": 3957.24, "end": 3959.16, "text": "leider nicht genau sagen, für wie viel."}, {"id": 430, "start": 3959.16, "end": 3967.52, "text": "Guck mal, zeigt die Taktrate."}, {"id": 431, "start": 3967.52, "end": 3990.04, "text": "Ah, guck mal, jetzt vorbei, Leute, jetzt vorbei, jetzt wird's runtergetaktet."}, {"id": 432, "start": 3990.04, "end": 4006.68, "text": "86 Grad, jetzt vorbei, ich weiß gar nicht, ja, jetzt taktet er, taktet sich wieder hoch."}, {"id": 433, "start": 4006.68, "end": 4022.56, "text": "Guck, der taktet sich hoch und dann ab jetzt fängt er an, sich wieder runterzutakken."}, {"id": 434, "start": 4022.56, "end": 4027.56, "text": "Magfly, Dankeschön für den Sub, okay, ich würd sagen, das ist für Temperaturtest erst"}, {"id": 435, "start": 4027.56, "end": 4031.68, "text": "mal genug oder wollen wir ihn noch ein Stückchen übertakken, wollen wir noch mal gucken, ob"}, {"id": 436, "start": 4031.68, "end": 4036.04, "text": "noch ein bisschen mehr, wobei, wir sind jetzt schon am Limit, wir sind ja jetzt schon am"}, {"id": 437, "start": 4036.04, "end": 4053.32, "text": "Limit, ja, wir sind jetzt schon komplett Temperature-Limit, okay, ich würd sagen, das ist warm genug,"}, {"id": 438, "start": 4053.32, "end": 4060.68, "text": "nee, Ram-Over glaubt mir nicht, okay, der kommt ans Temperatur-Limit, dann würd ich"}, {"id": 439, "start": 4060.68, "end": 4065.8, "text": "sagen, dann nehmen wir jetzt mal das Gehäuse und bauen das Ding ein und gucken wir mal,"}, {"id": 440, "start": 4065.8, "end": 4074.4, "text": "guck mal, der taktet sich auch direkt runter dann, wenn er an 85 Grad kommt, siehst du"}, {"id": 441, "start": 4074.4, "end": 4086.92, "text": "gleich, direkt, okay, boah, Alter, das ist heiß, aber da kannst du fast ein Ei drauf"}, {"id": 442, "start": 4086.92, "end": 4096.6, "text": "machen, äh, so, dann schauen wir uns mal das Gehäuse an, würd ich sagen, ich switch mal"}, {"id": 443, "start": 4096.6, "end": 4110.92, "text": "kurz rüber oder wisst ihr was, ich mach einfach Fullscreen, viel besser, ei, der Chat hat"}, {"id": 444, "start": 4110.92, "end": 4118.16, "text": "da schon wieder komische, komische Ideen, also, dann packen wir das doch mal aus und"}, {"id": 445, "start": 4118.16, "end": 4127.36, "text": "gucken uns das an, ob das wirklich das Most Beautiful Crafted Raspberry Pi Case ist, überhaupt,"}, {"id": 446, "start": 4127.36, "end": 4141.12, "text": "schauen wir mal, so, wie geht denn das hier raus, so, okay, schon mal ganz nice verpackt,"}, {"id": 447, "start": 4141.12, "end": 4149.6, "text": "wollen wir mal rein, so, was haben wir denn hier, was haben wir denn hier, haben wir das"}, {"id": 448, "start": 4149.6, "end": 4153.72, "text": "Case drin und ansonsten nix, okay, das kann ich schon alles mal runterhauen, schmeiß"}, {"id": 449, "start": 4153.72, "end": 4162.92, "text": "ich mal alles hier auf die Erd, das brauchen wir nicht, hier ist das Case drin, da ist es,"}, {"id": 450, "start": 4162.92, "end": 4171.24, "text": "sieht recht unspektakulär aus, wir haben paar Schrauben, paar Schrauben, äh, ich denk"}, {"id": 451, "start": 4171.24, "end": 4177.56, "text": "mal, das ist der Boden, vermute ich mal, und das ist das Teil, das Ding ist wirklich relativ"}, {"id": 452, "start": 4177.56, "end": 4187.8, "text": "massiv, ja, weiß ich, ob man das, ob man das gut, gut hört, pass mal auf, also da ist"}, {"id": 453, "start": 4187.8, "end": 4197.36, "text": "schon ein bisschen, bisschen Metall, also, na, das, das ist schon recht massiv, das Ding"}, {"id": 454, "start": 4197.36, "end": 4204.84, "text": "und das kommt auf die, auf die, äh, CPU, by the way, aus welchem Grund hat denn das"}, {"id": 455, "start": 4204.84, "end": 4213.6, "text": "ein Loch hier drinnen, sollte das nicht besser planaufliegen und nicht hier ein Loch haben,"}, {"id": 456, "start": 4213.6, "end": 4218.04, "text": "wisst ihr was richtig pro wär, wisst ihr was richtig pro wär, hätt ich jetzt noch"}, {"id": 457, "start": 4218.04, "end": 4228.28, "text": "Wärmeleitpaste, hätt ich hier noch irgendwo Wärmeleitpaste, das wär mal massiv exquisite,"}, {"id": 458, "start": 4228.28, "end": 4237.2, "text": "oder, das ist kein Pet, oder ist da ein Pet dabei, wartet mal, ah hier ist ein Pet dabei,"}, {"id": 459, "start": 4237.2, "end": 4246.2, "text": "guck mal, aber ich glaub Wärmeleitpaste wär cooler, oder, ich hab aber, glaub, also ich"}, {"id": 460, "start": 4246.2, "end": 4257.48, "text": "hab definitiv noch, aber ich hab ja, wie gesagt, ich hab ja aufgeräumt, ähm, ich,"}, {"id": 461, "start": 4257.48, "end": 4262.28, "text": "Leute, ich kriech mal kurz hier runter, da liegt nämlich noch ne Ikea-Tasche mit ganz"}, {"id": 462, "start": 4262.28, "end": 4266.8, "text": "viel Kabeln drinnen, wo ich so die Überbleibsel, die muss ich noch wegräumen, wo ich noch"}, {"id": 463, "start": 4266.8, "end": 4273.2, "text": "so die Überbleibsel drin hab, vielleicht hab ich Glück, und da ist noch ein bisschen"}, {"id": 464, "start": 4273.2, "end": 4281.6, "text": "Wärmeleitpaste drin, weil das sind, das sind ganz viel alte Sachen drin, da könnte durchaus"}, {"id": 465, "start": 4281.6, "end": 4287.64, "text": "noch ein bisschen irgendwo Wärmeleitpaste, die gute der Bauer, der Bauer Wärmeleitpaste"}, {"id": 466, "start": 4287.64, "end": 4295.92, "text": "ist das, die ich da hier am Start hatte, irgendwie, Thermal Crissly Conduct, nee, nicht Conduct,"}, {"id": 467, "start": 4295.92, "end": 4304.16, "text": "Conductornaut ist das Flüssigmetall gewesen, äh, Cryo Cryonaut, oder so hieß das Ding,"}, {"id": 468, "start": 4304.16, "end": 4311.8, "text": "nope, nix dabei, schauen wir mal hier, ich krieg gerade ein bisschen auf die Erde rum,"}, {"id": 469, "start": 4311.8, "end": 4319.52, "text": "ne, ah, ah, was denn hier, Noctua, Noctua Lüfter, Pogchamp, Pogchamp, nein, beim Noctua"}, {"id": 470, "start": 4319.52, "end": 4331.76, "text": "Lüfter wär die Chance gut gewesen, dass es da irgendwo dabei wär, aber, nee, keine"}, {"id": 471, "start": 4331.76, "end": 4342.56, "text": "Ikea Tasche hat keine Wärmeleitpaste für uns Leute, keine Wärmeleitpaste, zwar, ist"}, {"id": 472, "start": 4342.56, "end": 4355.6, "text": "das hier, was ist das hier, ah, in your face, die gute Noctua Wärmeleitpaste ist es sogar,"}, {"id": 473, "start": 4355.6, "end": 4361.8, "text": "ich hab zwar irgendwie noch die Thermal Crissly gehabt, aber die tut's auch, oder, das ist"}, {"id": 474, "start": 4361.8, "end": 4366.32, "text": "nicht Pogch, da ich noch was auf die Stelle, bisschen Wärmeleitpaste gefunden hab, guckt"}, {"id": 475, "start": 4366.32, "end": 4380.32, "text": "euch das mal an hier, und zwar ist das Noctua NT H1, ok, wir können, wir können das jetzt"}, {"id": 476, "start": 4380.32, "end": 4390.88, "text": "ja mal, deswegen sind Noctua Lüfter auch so teuer, hat das einen erkennbaren Unterschied,"}, {"id": 477, "start": 4390.88, "end": 4395.48, "text": "Leute wir können das erstmal probieren mit dem Pad und dann mit der, was mein Mikrofon"}, {"id": 478, "start": 4395.48, "end": 4409.76, "text": "knattert, Saft, was knattert da, Jebait, ich hab ihn auf der Erde, ich bin eben auf"}, {"id": 479, "start": 4409.76, "end": 4415.96, "text": "der Erde rumgekrabbelt, da kann's durchaus sein, dass es knattert, achso, jaja, ich"}, {"id": 480, "start": 4415.96, "end": 4426.16, "text": "hab, bin eben auf der Erde rumgekrochen, ich würd erstmal Paste machen, sonst brauchst"}, {"id": 481, "start": 4426.16, "end": 4444.68, "text": "du ein neues Pad, stimmt, ja, ich hab keine Ahnung, ob das einen erkennbaren Unterschied"}, {"id": 482, "start": 4444.68, "end": 4459.16, "text": "hat, das könnte natürlich sein, Paste geht nicht wegen dem Abstand, oh nee, ernsthaft,"}, {"id": 483, "start": 4459.16, "end": 4472.76, "text": "geht das, ah, fuck oder, wartet mal, jaja, wir machen mal kurz ab, äh, Leute, ich schalte"}, {"id": 484, "start": 4472.76, "end": 4478.24, "text": "den Raspberry Pi mal aus, kurz, hat ja keinen Sinn, wir müssen ja nicht am lebenden Patient"}, {"id": 485, "start": 4478.24, "end": 4488.48, "text": "rumdoktern, achso, ja, warum geht das wohl nicht, wenn ich grad das Netzwerkkabel rausgezogen"}, {"id": 486, "start": 4488.48, "end": 4503.2, "text": "hab, keck wait, ah nee, okay, geht wieder, alles klar, hat sich erholt, ich mach mal aus,"}, {"id": 487, "start": 4503.2, "end": 4525.12, "text": "wir können Paste, Pad, Paste machen, oh ja, für noch bessere Bindung, moin, was machst"}, {"id": 488, "start": 4525.12, "end": 4532.12, "text": "du mit dem Pi, ich teste das, ob das Gehäuse taugt, ich hoffe mal, weil optisch und so"}, {"id": 489, "start": 4532.12, "end": 4538.32, "text": "von der, von der Quality fühlt sich das ja bisher am besten an von allen Cases, die ich"}, {"id": 490, "start": 4538.32, "end": 4551.32, "text": "so in der Hand hatte, also für den Pi, okay, ähm, jetzt probieren wir das mal aus, also"}, {"id": 491, "start": 4551.32, "end": 4555.52, "text": "wenn ich den Kram hier draufsetze, machen wir mal ab, hier machen wir auch ab, oh das"}, {"id": 492, "start": 4555.52, "end": 4562.92, "text": "Ding, ey, der ganze Raspberry Pi ist ultra heiß hier, nach der Burn-In Session da, so,"}, {"id": 493, "start": 4562.92, "end": 4569.72, "text": "das muss ja nämlich hier so rein, so, und die Sache, ups, mach ich das überhaupt richtig,"}, {"id": 494, "start": 4569.72, "end": 4578.72, "text": "so viel verkehrt kann man da ja eigentlich nicht machen, hier, so, oder doch, kann man"}, {"id": 495, "start": 4578.72, "end": 4585.88, "text": "da was verkehrt machen, keck, keck, wait, keck, keck, keck, wait, warum, wait, wait a minute,"}, {"id": 496, "start": 4585.88, "end": 4597.24, "text": "warum geht das nicht, äh, einfach mal drücken, ne, okay, oh Leute, Big Brain Finger Fertigkeit"}, {"id": 497, "start": 4597.24, "end": 4604.56, "text": "sind jetzt gefragt, oh please, Kamera Kurs, stimmt ja, das sollte ich vielleicht machen,"}, {"id": 498, "start": 4604.56, "end": 4613.16, "text": "äh, Big Brain Finger Fertigkeit ist gefragt, wie kriegt man es richtig rein, ich würde"}, {"id": 499, "start": 4613.16, "end": 4631.96, "text": "sagen, man muss einfach ein bisschen, einfach ein bisschen drücken, ich mein, ah, guck"}, {"id": 500, "start": 4631.96, "end": 4635.88, "text": "mal hier, hier raste, hier raste das dann ein, man kann das glaub einfach runterdrücken,"}, {"id": 501, "start": 4635.88, "end": 4646.96, "text": "ha, zack, easy, wow, ist drin, das Problem ist jetzt, ich hab keine Ahnung, ob das auffliegt"}, {"id": 502, "start": 4646.96, "end": 4653.96, "text": "oder nicht, man sieht es ja nicht, also, also, komm, Leute, wir nehmen das Pad, wir nehmen"}, {"id": 503, "start": 4653.96, "end": 4658.84, "text": "das Pad, scheiß auf, scheiß auf, scheiß auf Wärmelite, passt auf, wenn wir die nice"}, {"id": 504, "start": 4658.84, "end": 4663.6, "text": "Noctur Wärmelite passt haben, wir sehen nicht, ob das auffliegt und solange wir nicht sehen,"}, {"id": 505, "start": 4663.6, "end": 4681.76, "text": "ob das auffliegt, dann hat es keinen Sinn, mach doch dünn Paste und teste, hmmm, dünn"}, {"id": 506, "start": 4681.76, "end": 4692.6, "text": "Paste und testen, wo mach ich denn die Paste am besten drauf, äh, wahrscheinlich am besten,"}, {"id": 507, "start": 4692.6, "end": 4712.8, "text": "am besten hier, äh, wie funzt denn das überhaupt, muss man das drehen, ah ja, so, ha, macht"}, {"id": 508, "start": 4712.8, "end": 4733.08, "text": "das jetzt was, so, äh, ich bräuchte, ich bräuchte noch irgendeinen Spachtel oder sowas,"}, {"id": 509, "start": 4733.08, "end": 4738.24, "text": "ich bräuchte noch irgendwie so einen Spachtel oder sowas, um das zu verteilen, vielleicht,"}, {"id": 510, "start": 4738.24, "end": 4751.96, "text": "vielleicht beim Noctur auch sowas dabei gewesen, Noctur Spachtel, nee, kein Noctur Spachtel,"}, {"id": 511, "start": 4751.96, "end": 4762.08, "text": "aber sowas hier, ähm, exquisite, so, jetzt gucken wir mal, ob das ganze Kontakt hat,"}, {"id": 512, "start": 4762.08, "end": 4767.64, "text": "schauen wir mal, ich müsste ja, wenn es Kontakt hat, müsste ich es ja sehen, auf der CPU,"}, {"id": 513, "start": 4767.64, "end": 4779.08, "text": "was meint ihr, meint ihr das tut, meint ihr das geht, so, jetzt sollte, jetzt sollte ich"}, {"id": 514, "start": 4779.08, "end": 4787.92, "text": "eigentlich einen Fleck auf der CPU haben, wenn es richtig drauf ist, nope, nope, zu"}, {"id": 515, "start": 4787.92, "end": 4792.0, "text": "großer Abstand, ok Leute, äh, ich brauch mal ein Stück Klopapier, ich bin gleich wieder"}, {"id": 516, "start": 4792.0, "end": 4798.76, "text": "da, oder hab ich, hab ich hier irgendwie, ach komm hier, nimm mal das, geht auch, das"}, {"id": 517, "start": 4798.76, "end": 4811.64, "text": "von der Verpackung, das geht genauso, exquisite Wärmeleitpaste verschmieren, so muss das sein,"}, {"id": 518, "start": 4811.64, "end": 4822.72, "text": "jawoll, brauch ich mal eigentlich was ordentlich zum reinigen, ok, sauber genug, zack, mach"}, {"id": 519, "start": 4822.72, "end": 4832.36, "text": "mal das Pad drauf, ja, keine Küchenrolle da, keine Küchenrolle, dass wenn ich irgendwas"}, {"id": 520, "start": 4832.36, "end": 4841.2, "text": "umschmeiß, hab ich echt ein Problem, gut, dann machen wir dieses komische Pad drauf,"}, {"id": 521, "start": 4841.2, "end": 4857.2, "text": "ui, Tütenöffner, jetzt rechtssicht wieder, dass ich absolut keine Fingernägel hab, so,"}, {"id": 522, "start": 4857.2, "end": 4864.84, "text": "ok, also, ich würd sagen, wir pappen das, wir pappen das auf den, auf die CPU drauf,"}, {"id": 523, "start": 4864.84, "end": 4871.64, "text": "das ist besser, weil dann ist es auf jeden Fall zentriert, weil das Ding hier ist größer,"}, {"id": 524, "start": 4871.64, "end": 4887.44, "text": "oh, jetzt bräuchte man ein paar Grills mit Fingernägel, so, exzellent, muss noch den"}, {"id": 525, "start": 4887.44, "end": 4905.16, "text": "Rahmen da oben abmachen, ok, wunderbar, rein damit, kenne ihn, Simona, danke für den Zap,"}, {"id": 526, "start": 4905.16, "end": 4918.2, "text": "jetzt gehts net, doch jetzt, ey, what the, what the fuck, ich hatte so eben schonmal drin,"}, {"id": 527, "start": 4918.2, "end": 4943.32, "text": "was ist das für Three-Head-Scheiß, Three-Head of Doom ist das hier, oh, das geht noch mal"}, {"id": 528, "start": 4943.32, "end": 4959.44, "text": "rein, what the hell, wa, wa, wa, wa, warum, das ging doch eben schonmal, ich hatte so eben"}, {"id": 529, "start": 4959.44, "end": 4967.92, "text": "schonmal drin, what the fuck, das ging doch eben easy as fuck rein, guck mal eben, eben"}, {"id": 530, "start": 4967.92, "end": 4973.6, "text": "hatte ich einfach so, ah ok, bisschen Gewalt braucht man an der Stelle einfach, sieht so"}, {"id": 531, "start": 4973.6, "end": 4980.72, "text": "aus, so und jetzt sollte das ein Strauf pappen, gut, dann machen wir jetzt noch den Schraubchamp"}, {"id": 532, "start": 4980.72, "end": 4990.76, "text": "rein, passt das hier überhaupt, ja, passt, Moment, den Schraubchamp macht man hier unten"}, {"id": 533, "start": 4990.76, "end": 5005.68, "text": "durch, was ist das jetzt, so, so für die SSD, würde sagen, ich würde sagen, das muss so"}, {"id": 534, "start": 5005.68, "end": 5023.6, "text": "drauf und die SSD, und die SSD muss da so durch, die SSD mal raus, so, also ich würde"}, {"id": 535, "start": 5023.6, "end": 5034.68, "text": "sagen, so, so gehörts, anders gehts ja auch nicht, das schwarze ist Plastik, ja, anders"}, {"id": 536, "start": 5034.68, "end": 5042.28, "text": "gehts ja auch nicht, hier passt die SSD noch rein, Moment, ist falsch rum, ne, so rum"}, {"id": 537, "start": 5042.28, "end": 5050.44, "text": "ist glaube ich richtig, na jetzt guck mal, die haben extra schönes Loch hier für die,"}, {"id": 538, "start": 5050.44, "end": 5054.64, "text": "für die Micro SD drinnen, hier neben ist eine Aussparung, das ist wahrscheinlich für"}, {"id": 539, "start": 5054.64, "end": 5066.04, "text": "die LEDs, das man sieht, wenn die LEDs angehen, so, also schreiben wir das mal, ja ich sag"}, {"id": 540, "start": 5066.04, "end": 5071.52, "text": "immer SSD, obwohl es eigentlich eine Micro SD ist, frag mich nicht warum, irgendwie tue"}, {"id": 541, "start": 5071.52, "end": 5079.92, "text": "ich mir schwer, in meinem Boomer-Hirn, Micro SD und SSD im Eifer des Gefechts auseinander"}, {"id": 542, "start": 5079.92, "end": 5099.88, "text": "zu halten, Micro, Micro SSD, noch besser oder, Nano SSHD, ja das ist auch nicht schlecht,"}, {"id": 543, "start": 5099.88, "end": 5123.8, "text": "Schraube, Schraube, Schraube, exellent, so, gut, alles fest, sitzt, passt, fühlt sich"}, {"id": 544, "start": 5123.8, "end": 5136.92, "text": "auch recht hochwertig stabil an, sitzt auch ziemlich gut was die Slots angeht, sehr ordentlich,"}, {"id": 545, "start": 5136.92, "end": 5155.32, "text": "hier seht ihr das, hier hat das Gehäuse eine Delle oder so ein Loch, das ist nicht so gut,"}, {"id": 546, "start": 5155.32, "end": 5160.48, "text": "ich frag mich ja ob die mal einen Raspberry Pi bauen, der defaultmäßig auch über PoE"}, {"id": 547, "start": 5160.48, "end": 5167.24, "text": "geht, das wäre cool, so, wenn die das richtig gemacht haben, sollte man jetzt eigentlich"}, {"id": 548, "start": 5167.24, "end": 5178.36, "text": "hier die, hier die, die, die LEDs sehen, guck mal mal, ja guck mal man sieht, man sieht,"}, {"id": 549, "start": 5178.36, "end": 5192.24, "text": "ich weiß nicht ob ihr es seht, seht ihr das, ja ne, ja, exellent, gut jetzt bin ich mal"}, {"id": 550, "start": 5192.24, "end": 5207.24, "text": "gespannt wie warm das jetzt wird, schauen wir mal, ja man kann mit so einem Adapter"}, {"id": 551, "start": 5207.24, "end": 5212.44, "text": "das machen, der dann von PoE auf den Strom geht vom Raspberry und so, das habe ich schon"}, {"id": 552, "start": 5212.44, "end": 5218.08, "text": "gesehen, aber einfach PoE anstöpseln und geht, geht soweit ich weiß bei keinem Raspberry"}, {"id": 553, "start": 5218.08, "end": 5247.6, "text": "Pi, LED Champ, gut, also, Clock, Temp, Stress, jetzt, jetzt schauen wir mal, ok Auslastung"}, {"id": 554, "start": 5247.6, "end": 5254.4, "text": "ist wieder volle Pulle, so, mal gucken wie es jetzt hoch geht, was heißt PoE, PoE ist"}, {"id": 555, "start": 5254.4, "end": 5270.88, "text": "Strom übers, hier Strom übers Netzwerkkabel, was, YEP ist auch weg, YEP hatten wir nie"}, {"id": 556, "start": 5270.88, "end": 5290.92, "text": "aktiviert, jebaited, wir hatten Salami aktiviert, aber Salami war ja zu obszön, ok Gehäuse"}, {"id": 557, "start": 5290.92, "end": 5301.8, "text": "wird ein bisschen warm, Gehäuse wird ein bisschen warm, aber Leute es bleibt ja mal"}, {"id": 558, "start": 5301.8, "end": 5308.2, "text": "deutlich kühler, guckt mal, bei dem anderen war man mehr oder weniger instant, am Limit,"}, {"id": 559, "start": 5308.2, "end": 5334.48, "text": "85 Grad, ne der kann das nur wenn du das passende PoE Head hast, der Raspberry Pi, da brauchst"}, {"id": 560, "start": 5334.48, "end": 5342.84, "text": "du so ein extra Board für PoE und dann geht das mit dem Raspberry Pi 3B+, aber einfach"}, {"id": 561, "start": 5342.84, "end": 5359.72, "text": "so out of the box geht das nicht, so also Temperatur ist absolut in Ordnung, Gehäuse"}, {"id": 562, "start": 5359.72, "end": 5383.36, "text": "wird recht, ist lauwarm überall jetzt, aber passt schon, passt, ist ok, ja ist in Ordnung,"}, {"id": 563, "start": 5383.36, "end": 5389.56, "text": "Doktor Max kontrolliert Temperatur, gut, ich würd sagen wir müssen jetzt noch mal ein"}, {"id": 564, "start": 5389.56, "end": 5397.44, "text": "bisschen weiter übertakken oder, weil ich mein einfach nur bei 60 Grad bleiben, das"}, {"id": 565, "start": 5397.44, "end": 5412.32, "text": "kanns ja jetzt nicht sein, welches Case ist das genau das da, Flirck Case, Flirck Case"}, {"id": 566, "start": 5412.32, "end": 5419.72, "text": "und aktuell gibt es das sogar hier schon für 21,90, was ich finde ein recht guter Preis"}, {"id": 567, "start": 5419.72, "end": 5425.04, "text": "ist, ok es ist weder das noch Chat at Price Champ, ich wollt eigentlich gucken was der"}, {"id": 568, "start": 5425.04, "end": 5434.08, "text": "Versand kostet aber ich glaub der Versand ist mit Prime in dem Fall auch kostenlos, kostenlose"}, {"id": 569, "start": 5434.08, "end": 5446.12, "text": "Lieferung ja, wie groß ist der Rahmen, der hat 4G, 4G, äh Moment, falsches Fenster,"}, {"id": 570, "start": 5446.12, "end": 5457.72, "text": "fast, fast, ja 4G, das Armor Case, ja es gibt ein paar gute das kenn ich doch nicht,"}, {"id": 571, "start": 5457.72, "end": 5465.44, "text": "das Argon Case ist auch ziemlich gut, ja das ist so ein ganz günstiges, das Argon Case"}, {"id": 572, "start": 5465.44, "end": 5477.64, "text": "ist gut ist mir aber ein bisschen zu teuer, das für 11 Euro, na ich kauf mir jetzt nicht"}, {"id": 573, "start": 5477.64, "end": 5491.28, "text": "jedes Raspberry Pi Case zum ausprobieren, es gibt ja auch jetzt die Argon Cases mit NVMe"}, {"id": 574, "start": 5491.28, "end": 5497.64, "text": "und sowas drin, weißt du was passiert ist, was sagt der Umut denn, ähm, die IHK hatte"}, {"id": 575, "start": 5497.64, "end": 5502.12, "text": "meinen Projektantrag nicht bekommen, obwohl ich den hochgeladen hatte, hab zum Glück"}, {"id": 576, "start": 5502.12, "end": 5505.88, "text": "den Antrag runtergeladen gehabt und das gemerkt, ja sei froh, ist ja fast ähnlich wie bei"}, {"id": 577, "start": 5505.88, "end": 5515.96, "text": "mir gewesen, die sind bei der IHK, die sind einfach echt extrem unfähig, ok also Leute"}, {"id": 578, "start": 5515.96, "end": 5526.64, "text": "ich würd sagen Temperatur ist ok, ok also was ist denn so das, was ist denn so das Maximum"}, {"id": 579, "start": 5526.64, "end": 5535.92, "text": "was denn das Ding verträgt, Arm Frequence Pi 4, mal gucken was ist da, Results, da gibt"}, {"id": 580, "start": 5535.92, "end": 5561.44, "text": "es auch bestimmt Leute die Tests gemacht haben, Take it to the Max, exellent, Tom's Hardware"}, {"id": 581, "start": 5561.44, "end": 5585.04, "text": "ein Google Eintrag weiter, das Tom's Hardware überhaupt noch gibt, ok 200, ja wie, die"}, {"id": 582, "start": 5585.04, "end": 5600.04, "text": "haben ja nur 2 getestet, was hat der hier Maximum, ach mehr, mehr geht nicht oder was,"}, {"id": 583, "start": 5600.04, "end": 5627.88, "text": "ach mehr geht nicht, ok also was, Overvoltage 6 und das, ok komm wir machen jetzt volle"}, {"id": 584, "start": 5627.88, "end": 5633.48, "text": "Pulle, scheiß drauf, easy, Bam, Reboot, ich war mehr als nicht starten, kann er ja nicht"}, {"id": 585, "start": 5633.48, "end": 5647.2, "text": "und ich glaube im Zweifelsfall, da hackt er sich halt runter oder, mal gucken, woop, woop"}, {"id": 586, "start": 5647.2, "end": 5674.52, "text": "es lebt, lebt, lebt er noch, Patient scheint noch zu leben, Postchamp, Postchamp, mal warten"}, {"id": 587, "start": 5674.52, "end": 5703.88, "text": "bis der Login geht, da ist er, da ist er Leute, 2147, Temp, Tres, Bam, Tres, Tres, Tres, Tres,"}, {"id": 588, "start": 5703.88, "end": 5715.08, "text": "ok, jetzt geht die Temperatur doch ganz gut hoch, die Frage ist halt, die man sich stellen"}, {"id": 589, "start": 5715.08, "end": 5723.2, "text": "muss, ne, macht man auf diesem Ding ernsthaft irgendwas großartig CPU limitiertes, wo man"}, {"id": 590, "start": 5723.2, "end": 5733.84, "text": "das braucht, ich mein keiner, keiner transcoded Videos auf dem Raspberry Pi, ich mein es geht,"}, {"id": 591, "start": 5733.84, "end": 5739.28, "text": "das ist das wichtigste, ja, Minecraft, ok, ohne Scheiß für einen Minecraft Server lasse"}, {"id": 592, "start": 5739.28, "end": 5745.44, "text": "ich mir das gefallen, ja, ich mein Minecraft ist ja zumindest in der Java Edition schon"}, {"id": 593, "start": 5745.44, "end": 5755.68, "text": "mal, da bekommt jedes mega Herz und bestimmt mit der C++ Edition auch, wie benutzt du die"}, {"id": 594, "start": 5755.68, "end": 5766.28, "text": "Search Funktion in der History, Steuerung R und by the way Steuerung R sucht, also ihr"}, {"id": 595, "start": 5766.28, "end": 5770.6, "text": "könnt ja sagen, das hier Steuerung R, dann gebt ihr den ersten Dings ein und wenn ihr"}, {"id": 596, "start": 5770.6, "end": 5775.36, "text": "weiter Steuerung R drückt, dann springt er immer zu den nächsten Vorkommnissen und wenn"}, {"id": 597, "start": 5775.36, "end": 5787.16, "text": "ihr Steuerung Shift R drückt, dann springt er zurück und das ist die wichtigste Funktion,"}, {"id": 598, "start": 5787.16, "end": 5797.48, "text": "die ihr jemals in eurer Shell braucht, weil wer eine lange Shell History hat, der braucht"}, {"id": 599, "start": 5797.48, "end": 5814.48, "text": "keine Server zu dokumentieren, einfach Shell nachgucken, meine History auf der Arbeit ist"}, {"id": 600, "start": 5814.48, "end": 5824.04, "text": "glaube ich mittlerweile über 100.000 Zeilen lang und die wird auch immer, die wird auch"}, {"id": 601, "start": 5824.04, "end": 5832.16, "text": "immer schön kopiert von einer Installation zur nächsten, das ist Standard Bash hier,"}, {"id": 602, "start": 5832.16, "end": 5845.36, "text": "das was für ein Raspberry kommt, das hier bei mir ist ZSH, die hier, hier, hier, Leute,"}, {"id": 603, "start": 5845.36, "end": 5853.52, "text": "wir sind volle Pulle übertaktet, genau, ihr müsst richtig das was Phipps schreibt, die"}, {"id": 604, "start": 5853.52, "end": 5859.84, "text": "HIST Size müsst ihr anpassen und HIST File Size, sonst gehts nicht. Sollen wir mal gucken"}, {"id": 605, "start": 5859.84, "end": 5871.0, "text": "wie warm es ist, oh ja, oh ja Leute, das Gehäuse, es ist unangenehm anzugreifen, definitiv,"}, {"id": 606, "start": 5871.0, "end": 5877.32, "text": "es tut schon leicht weh am Finger, wenn man das zu lang drauf lässt auf dem Gehäuse,"}, {"id": 607, "start": 5877.32, "end": 5882.84, "text": "kennst du Swiffing Bridge, klar wir haben schon ein paar Videos sogar hier zusammengeguckt,"}, {"id": 608, "start": 5882.84, "end": 5895.76, "text": "also Maximum übertaktet und passiv gekühlt, schafft das Gehäuse aber auch gerade so,"}, {"id": 609, "start": 5895.76, "end": 5904.16, "text": "das Ding unterunter takten zu halten und ich könnte mir vorstellen, wenn es ein bisschen"}, {"id": 610, "start": 5904.16, "end": 5910.48, "text": "wärmer ist im Sommer, so dass die Raumtemperatur ein bisschen wärmer ist und wenn es jetzt"}, {"id": 611, "start": 5910.48, "end": 5915.28, "text": "noch 2-3 Stunden läuft und da vorlässt, glaube ich kommen wir auch ans Temperaturlimit in"}, {"id": 612, "start": 5915.28, "end": 5921.4, "text": "dem Gehäuse, ey das ist echt warm das Ding, ne, also wenn ihr kalte Füße habt nachts"}, {"id": 613, "start": 5921.4, "end": 5933.36, "text": "im Bett, legt das Ding unter die Decke oder erfreut eure Frau Freundin wie auch immer"}, {"id": 614, "start": 5933.36, "end": 5939.8, "text": "mit, sagt ihr, kommt mal hier, ich hab Fußwärmer am Start, habt ja auch gleich ne Ausrede warum"}, {"id": 615, "start": 5939.8, "end": 5964.0, "text": "Raspberry Pi ins Bett muss, da fehlt RGB, da fehlt RGB, ich hab noch ein paar Neopixel,"}, {"id": 616, "start": 5964.0, "end": 5989.0, "text": "ich hab noch ein paar Neopixel, wir könnten RGB aufrüsten, ey das wird echt warm, ich"}, {"id": 617, "start": 5989.0, "end": 5994.96, "text": "weiß aber grad nicht genau wo ich die Neopixel hab, ich hatte sie beim Aufräumen, ich hab"}, {"id": 618, "start": 5994.96, "end": 5998.64, "text": "halt 50 mal gesagt, dass ich aufgeräumt habe und jedes Mal wo ich die Dinger aufgeräumt"}, {"id": 619, "start": 5998.64, "end": 6002.32, "text": "hab, wusste ich vorher wo sie sind, jetzt nachdem ich aufgeräumt hab, weiß ich nicht"}, {"id": 620, "start": 6002.32, "end": 6018.76, "text": "mehr wo die Dinger sind, wo könnte ich die Neopixel hin haben, Ikea Tasche, ne in der"}, {"id": 621, "start": 6018.76, "end": 6023.0, "text": "Ikea Tasche ist das alte Zeug, wo ich nicht wusste wohin damit, vielleicht Leute, vielleicht"}, {"id": 622, "start": 6023.0, "end": 6029.28, "text": "haben wir Glück, wir gucken mal in die Magic Box, in die Magic Microcontroller Box, ob"}, {"id": 623, "start": 6029.28, "end": 6034.32, "text": "da irgendwo die Neopixels drin sind, wenn die Neopixels drin sind, dann können wir noch"}, {"id": 624, "start": 6034.32, "end": 6055.12, "text": "RGB Beleuchtung machen, Magic Microcontroller Box, seht ihr irgendwo Neopixels, ok ich geb"}, {"id": 625, "start": 6055.12, "end": 6062.72, "text": "zu, man erkennt jetzt nicht wirklich was, also Rüttelsensor, wir machen jetzt mal exquisite"}, {"id": 626, "start": 6062.72, "end": 6077.04, "text": "Box Show, Rüttelsensor, nein, Bodenfeuchtigkeitssensor, nein, ich hab keine Ahnung was es ist, nen"}, {"id": 627, "start": 6077.04, "end": 6093.64, "text": "Wifi Modul, auch nicht, Relays auch nicht, Bewegungssensor, Relay auch nicht, ESP32,"}, {"id": 628, "start": 6093.64, "end": 6107.88, "text": "Linksgedöns auch nicht, irgendwelche Stromdinger, mehr Relays, keine Ahnung, wo sind die Neopixels,"}, {"id": 629, "start": 6107.88, "end": 6116.78, "text": "sind da irgendwo Neopixels drin, sieht nicht so aus, keine Neopixels Leute, sagt mir wenn"}, {"id": 630, "start": 6116.78, "end": 6121.48, "text": "irgendwo Neopixels, ihr wisst ja gar nicht was ihr gucken müsst, aber guck mal, einfach"}, {"id": 631, "start": 6121.48, "end": 6140.16, "text": "random noch ne Raspberry Pi Zero drin, Lullwee, Rüttelsensor, alles keine Neopixels Leute,"}, {"id": 632, "start": 6140.16, "end": 6163.16, "text": "ne, sieht nicht so RGB, RGBig aus gerade, ok wo könnten die Dinger noch sein, Magic"}, {"id": 633, "start": 6163.16, "end": 6175.0, "text": "Microcontroller Box wieder zumachen, keine Neopixels drin gewesen, Arts Delivery, ja beste,"}, {"id": 634, "start": 6175.0, "end": 6181.28, "text": "Arts Delivery, Eats, die haben echt ne richtige Chance verschenkt sich Eats Delivery zu nennen,"}, {"id": 635, "start": 6181.28, "end": 6186.6, "text": "ein Eats Delivery wäre nun mal wirklich mit Abstand der beste Name von nem Lieferdienst"}, {"id": 636, "start": 6186.6, "end": 6207.84, "text": "überhaupt, wo könnt ich die Neopixels haben, ich geh mal draußen an den Schrank gucken,"}, {"id": 637, "start": 6207.84, "end": 6215.68, "text": "mal ganz schnell, in der Zwischenzeit guck mal wie warm das ist, oh Leute, es schmilzt"}, {"id": 638, "start": 6215.68, "end": 6238.08, "text": "gleich."}, {"id": 639, "start": 6238.08, "end": 6265.76, "text": "Ok."}, {"id": 640, "start": 6295.76, "end": 6313.44, "text": "ne leute, leute ich muss euch enttäuschen, ich find die neopixels jetzt auf die schnelle"}, {"id": 641, "start": 6313.44, "end": 6319.64, "text": "nicht, das sind so einzelne leds, ich hab sogar so ein paar leds die man direkt per"}, {"id": 642, "start": 6319.64, "end": 6322.52, "text": "usb anschließen kann und dann plinken lassen kann, ich hab mir gedacht wir machen jetzt"}, {"id": 643, "start": 6322.52, "end": 6333.16, "text": "den spaß und machen eine runde rgb beleuchtung noch, ich guck noch mal schnell in die anderen"}, {"id": 644, "start": 6333.16, "end": 6340.04, "text": "kartons ob da irgendwas drin ist, was ich ja zurecht mache, gar nix, raspberry pi 4 ins"}, {"id": 645, "start": 6340.04, "end": 6344.28, "text": "gehäuse eingebaut und jetzt mal gucken wie warm er wird, aber leute wir sind gleich am"}, {"id": 646, "start": 6344.28, "end": 6353.88, "text": "temperaturlimit, wir sind auch temperaturlimit erreicht, gleich taktet er sich runter, monka"}, {"id": 647, "start": 6353.88, "end": 6383.4, "text": "auf a clock"}, {"id": 648, "start": 6473.4, "end": 6493.08, "text": "Keine Chance Leute, ich hab jetzt mal noch 2 Kisten durchwühlt, keine RGB Beleuchtung"}, {"id": 649, "start": 6493.08, "end": 6510.0, "text": "am Start, Fields RGB Man, Fields RGB Man, wüsste ich nur wo ich den Kram hingemacht"}, {"id": 650, "start": 6510.0, "end": 6516.32, "text": "hab, ich hatte nämlich noch so ein paar Plink Dinger, die konntest du einfach in USB stecken"}, {"id": 651, "start": 6516.32, "end": 6524.2, "text": "und dann, oh das Gehäuse, Alter, ok, also jetzt kann man den Finger nicht mehr drauflassen,"}, {"id": 652, "start": 6524.2, "end": 6528.68, "text": "das ist zu heiß, ohne Scheiß, du kannst nicht mehr angreifen, da verbrennt du dich auf Dauer"}, {"id": 653, "start": 6528.68, "end": 6538.08, "text": "wenn du nicht den Finger lang dran, au, ne, keine gute Idee, deaktiviert das nicht automatisch"}, {"id": 654, "start": 6538.08, "end": 6555.24, "text": "das Downclocking, kein Plassen Schimmer, aber taktet sich nicht runter, oder, oben am Plastik,"}, {"id": 655, "start": 6555.24, "end": 6569.56, "text": "hm, geht so, Plastik ist, Plastik ist ok, Hot Case, ja, richtig, richtig Verbrenn Case"}, {"id": 656, "start": 6569.56, "end": 6576.8, "text": "angesagt, also nicht, das ist auf jeden Fall deutlich zu heiß, aber das Gehäuse schafft's,"}, {"id": 657, "start": 6576.8, "end": 6586.12, "text": "ja, kann sich nicht beschweren, Maximum übertaktet, das Gehäuse schafft's gerade so, aber wirklich"}, {"id": 658, "start": 6586.12, "end": 6601.56, "text": "kommt ganz am Rande, das zu halten, doch top kann man sich nicht beschweren, Poggers, Alter,"}, {"id": 659, "start": 6601.56, "end": 6617.32, "text": "oder, doch, Massive Pog, je nachdem wie man's, wie man's sieht, ja, das Ganze verbraucht"}, {"id": 660, "start": 6617.32, "end": 6626.04, "text": "übrigens gerade, ich weiß nicht ob ihr's seht, kennt man das, das Ganze braucht gerade,"}, {"id": 661, "start": 6626.04, "end": 6639.92, "text": "9,2 Watt, also mehr kannst du mit dem Raspberry Pi 3 anscheinend nicht verbrauchen, du kannst"}, {"id": 662, "start": 6639.92, "end": 6667.28, "text": "auch ein bisschen IO machen, aber so bei 9,62 wie auch immer ist Schluss, das Ding hat 4"}, {"id": 663, "start": 6667.28, "end": 6673.48, "text": "Kerne, ja, genau, Hochkant aufstellen, jetzt kommen die Big Brain, Leute, das waren jetzt"}, {"id": 664, "start": 6673.48, "end": 6681.16, "text": "Hochkant aufstellen, wir stellen jetzt Hochkant auf, mal gucken ob er dann kälter wird, der"}, {"id": 665, "start": 6681.16, "end": 6692.64, "text": "bleibt nicht stehen, Hochkant, Crap Netzwerk Kabel, Alter, bleibst du stehen, kein Q-Switch,"}, {"id": 666, "start": 6692.64, "end": 6719.52, "text": "bleibt nicht stehen, vielleicht so, keine Chance, so hier, so, perfekt, Diagonal aufstellen,"}, {"id": 667, "start": 6719.52, "end": 6725.56, "text": "ja, kommt mal, jetzt hat er kaum Kontakt mit dem Boden, weiß jetzt nicht ob das gut oder"}, {"id": 668, "start": 6725.56, "end": 6739.8, "text": "schlecht ist, aber das macht keinen Unterschied, Leute, ja gut, wenn du draufpustest, Leute,"}, {"id": 669, "start": 6739.8, "end": 6754.08, "text": "wenn man draufpustet wird es natürlich kühler, das ist klar, wenn du draufpustest wird es"}, {"id": 670, "start": 6754.08, "end": 6761.68, "text": "natürlich kühler, das kann ich euch, da hole ich mal was, da kann ich euch was zeigen,"}, {"id": 671, "start": 6761.68, "end": 6782.0, "text": "das ist ein Kabel, da kann ich euch was zeigen, das ist ein Kabel, da kann ich euch was zeigen,"}, {"id": 672, "start": 6782.0, "end": 6807.78, "text": "da kann ich euch was zeigen, das ist ein Kabel, da kann ich euch was zeigen, das ist ein Kabel,"}, {"id": 673, "start": 6807.78, "end": 6809.78, "text": "Kühlchamp ist am Start"}, {"id": 674, "start": 6812.54, "end": 6814.54, "text": "Der Kühlchamp"}, {"id": 675, "start": 6815.1, "end": 6820.66, "text": "Wo stellt man das jetzt am besten hin so dass es am maximalsten vorbeigeht"}, {"id": 676, "start": 6822.74, "end": 6824.74, "text": "Der Kühlchamp so"}, {"id": 677, "start": 6828.5, "end": 6830.5, "text": "Achtung Kühlchamp activated"}, {"id": 678, "start": 6830.5, "end": 6832.5, "text": "Ja"}, {"id": 679, "start": 6836.82, "end": 6839.94, "text": "Leute der Kühlchamp ist kaputt oder"}, {"id": 680, "start": 6842.82, "end": 6844.82, "text": "Ah ne der hat nen Knopf hinten lull"}, {"id": 681, "start": 6846.66, "end": 6848.66, "text": "Kühlchamp ist an"}, {"id": 682, "start": 6848.66, "end": 6860.02, "text": "Boah pass mal auf jetzt geht die Temp runter wie nix. Guck mal hier jetzt geht die Temp runter wie nix. Äh, Keg-Waite"}, {"id": 683, "start": 6866.02, "end": 6868.02, "text": "Ke- Was ist das?"}, {"id": 684, "start": 6868.02, "end": 6870.02, "text": "Was ist das?"}, {"id": 685, "start": 6877.78, "end": 6882.38, "text": "Ich glaube ich ich glaube das das ist nicht das ist nicht richtig gelagert davor"}, {"id": 686, "start": 6885.54, "end": 6889.3, "text": "Wollte man das Ding nicht irgendwie drehen doch guck mal"}, {"id": 687, "start": 6889.3, "end": 6899.7, "text": "Jetzt hier jetzt der Pus-Champ ist am oh oh ich hab Wärmel- oh fuck ich hab Wärmel halt passt da unten dran hängen"}, {"id": 688, "start": 6906.58, "end": 6908.58, "text": "Äh Saurei"}, {"id": 689, "start": 6911.46, "end": 6913.46, "text": "Abmachen"}, {"id": 690, "start": 6913.46, "end": 6922.26, "text": "Naja gut so was macht die Temp? 80 Grad 76 hier"}, {"id": 691, "start": 6924.74, "end": 6927.38, "text": "Der Pus-Champ kühlt ordentlich"}, {"id": 692, "start": 6928.9, "end": 6933.34, "text": "Wir müssen das ich muss das so machen irgendwie das muss mehr an das Gehäuse dran"}, {"id": 693, "start": 6933.34, "end": 6940.5, "text": "Jetzt"}, {"id": 694, "start": 6946.5, "end": 6948.5, "text": "Aber ne so ist schon okay"}, {"id": 695, "start": 6948.5, "end": 6960.34, "text": "Der Pus-Champ guckt euch das mal an"}, {"id": 696, "start": 6962.34, "end": 6966.54, "text": "Also man sieht aktiv Kühlung bringt bringt was ja"}, {"id": 697, "start": 6969.3, "end": 6971.3, "text": "Gleich wie kühler das Gehäuse"}, {"id": 698, "start": 6971.3, "end": 6979.14, "text": "Guckt mal jetzt könnt ihr den Raspberry Pi nicht nur als Fußwärmer verwenden sondern auch als Heizungsersatz"}, {"id": 699, "start": 6980.66, "end": 6982.66, "text": "Nee ich hänge das Ding jetzt nicht aus dem Fenster"}, {"id": 700, "start": 6984.02, "end": 6987.94, "text": "An Minus-Demperatur also ich muss das Fenster auf meinem Raspberry Pi raushängen"}, {"id": 701, "start": 6987.94, "end": 6995.94, "text": "Guck mal 69 Grad jetzt kann man das jetzt kann man das tatsächlich nicht nur als Fußwärmer sondern echt als als Heizung verwenden"}, {"id": 702, "start": 6998.02, "end": 7001.7, "text": "Nee nicht wirklich also wenn ihr damit was heizen wollt dauert ein bisschen"}, {"id": 703, "start": 7004.02, "end": 7005.78, "text": "Aber aber theoretisch funktioniert das"}, {"id": 704, "start": 7005.78, "end": 7018.1, "text": "Ja"}, {"id": 705, "start": 7018.1, "end": 7025.38, "text": "Ich meine wer hat sonst schon einen 9 Watt Heizlüfter die haben sonst immer 2000"}, {"id": 706, "start": 7026.9, "end": 7029.38, "text": "Da freuen sich die die die Öko Leute auch"}, {"id": 707, "start": 7029.38, "end": 7034.42, "text": "Am einfach Energie gespart"}, {"id": 708, "start": 7036.42, "end": 7042.1, "text": "Wir brauchen einen 2 KW Heizlüfter wenn du auch einen 9 Watt Raspberry Pi Heizlüfter haben kannst"}, {"id": 709, "start": 7042.9, "end": 7046.98, "text": "Kannst du damit ein Raspberry Pi backen? Oh Pains-Champ, der war schlecht"}, {"id": 710, "start": 7046.98, "end": 7058.18, "text": "Den Ventilator musst du da zurechnen ja ok der dann runter ne Runde mal auf keine Ahnung 11 12 mein in wegen uns hochkommt auf aber mehr nicht"}, {"id": 711, "start": 7058.18, "end": 7079.3, "text": "Macht im Vergleich zu 2000 immer noch kein Unterschied ich meine er heizt nicht im Vergleich zu 2000 heizt er halt mal gar nicht aber aber er heizt theoretisch darauf kommt es aber nicht"}, {"id": 712, "start": 7079.3, "end": 7088.26, "text": "Ich meine er heizt nicht im Vergleich zu 2000 heizt er halt mal gar nicht aber aber er heizt theoretisch darauf kommt es an"}, {"id": 713, "start": 7090.42, "end": 7093.46, "text": "Theoretische theoretische Heizleistung ist huge"}, {"id": 714, "start": 7095.62, "end": 7097.62, "text": "Nee auch nicht"}, {"id": 715, "start": 7100.02, "end": 7106.98, "text": "Und man kann einen Minecraft Server drauf laufen lassen ich meine überlegt euch mal was du da was du da der Umwelt alles Gutes tun kannst"}, {"id": 716, "start": 7106.98, "end": 7119.06, "text": "Du kannst Minecraft hausten und die Wohnung heizen und das alles mit 50 Euro Einsatz"}, {"id": 717, "start": 7126.18, "end": 7129.14, "text": "Das ist A++++ Energie Klasse"}, {"id": 718, "start": 7129.14, "end": 7141.54, "text": "Und stellt euch das ganze jetzt noch mal stellt euch hier die Kiste jetzt mit RGB vor stellt euch vor wir hätten hier einen Stick dran der irgendwie richtig schön RGB mäßig mäßig leuchtet"}, {"id": 719, "start": 7141.54, "end": 7145.06, "text": "Ja sag euch das wäre hier exquisite"}, {"id": 720, "start": 7145.06, "end": 7155.14, "text": "Mit RGB wird das ganze noch mal um 2 Faktor 2 geboostet werden"}, {"id": 721, "start": 7159.62, "end": 7163.22, "text": "Ja mit RGB konnten wir auch locker auf 3 Gigahertz übertacken"}, {"id": 722, "start": 7164.9, "end": 7166.9, "text": "Safe Safe Call"}, {"id": 723, "start": 7168.1, "end": 7170.1, "text": "Gar kein Problem"}, {"id": 724, "start": 7170.1, "end": 7176.1, "text": "Das Gehäuse sieht ein bisschen dreckig aus oben jetzt ne als ich das da eingerieben hab"}, {"id": 725, "start": 7176.1, "end": 7180.1, "text": "Vielleicht soll ich das mal echt sauber machen"}, {"id": 726, "start": 7182.1, "end": 7186.1, "text": "Ich hab halt nur nix da ich hab nur dieses komische"}, {"id": 727, "start": 7186.1, "end": 7196.1, "text": "Papier hier da was ehrlich gesagt nicht sauber macht"}, {"id": 728, "start": 7196.1, "end": 7210.1, "text": "Tja Leute da haben wir es aber das Gehäuse ist wirklich poggers"}, {"id": 729, "start": 7210.1, "end": 7218.1, "text": "Also jetzt mal ganz ohne Spaß viel dummes Zeug gelabert die letzte Viertelstunde aber das Gehäuse ist wirklich nice"}, {"id": 730, "start": 7218.1, "end": 7226.1, "text": "Das sieht nicht nur gut aus das hat alle notwendigen Funktionen du hast sogar ne Anzeige was die LEDs macht was die LEDs machen"}, {"id": 731, "start": 7226.1, "end": 7236.1, "text": "Kommst an alles dran inklusive SD Karte, Mikro USB, Audio es gibt ja übrigens Geräte die noch ne Audio Ausgang haben so ein Klinkenstecker"}, {"id": 732, "start": 7236.1, "end": 7250.1, "text": "Kommst hier hinten an alles dran und das Gehäuse bleibt schön schön kühl wenn man das nicht Maximum übertaktet und volle Pulle 4 Kerne laufen lässt"}, {"id": 733, "start": 7256.1, "end": 7260.1, "text": "Stimmt das sind Mikro HDMI wie komm ich auf Mikro USB?"}, {"id": 734, "start": 7260.1, "end": 7266.1, "text": "An den Kamera Anschluss kommst du tatsächlich nicht dran wobei du da auch deine Probleme hast wie kriegst du das Kamerakabel raus"}, {"id": 735, "start": 7266.1, "end": 7272.1, "text": "Das würde wahrscheinlich hier neben funktionieren guck mal hier neben hast du ne Öffnung drin im Gehäuse"}, {"id": 736, "start": 7272.1, "end": 7280.1, "text": "Du müsstest das Kamerakabel durchmachen ja das wird funktionieren das kannst du ja anschließen und dann hier neben raus machen ja das wird gehen"}, {"id": 737, "start": 7282.1, "end": 7284.1, "text": "So mal machen den Pustchamp mal wieder aus"}, {"id": 738, "start": 7284.1, "end": 7290.1, "text": "Aus ärgert mich dass ich die RGB Dinger nicht finde"}, {"id": 739, "start": 7314.1, "end": 7334.1, "text": "Ne echt keine Ahnung wo die RGB USB Dinger sind"}, {"id": 740, "start": 7334.1, "end": 7348.1, "text": "Na gut was das ist auf Slot 0 das kann ich dir zeigen das da"}, {"id": 741, "start": 7348.1, "end": 7358.1, "text": "Gibt es für den Pi 4 schon ne zukünftige Aufgabe? Ja der ist rein für den Stream da"}, {"id": 742, "start": 7358.1, "end": 7364.1, "text": "Ich hab den mir extra neu gekauft weil den letzten Raspberry Pi den ich für den Stream hatte"}, {"id": 743, "start": 7364.1, "end": 7368.1, "text": "Der wurde zu meinem neuen Unify Access Point äh nicht Access Point Unify Controller"}, {"id": 744, "start": 7368.1, "end": 7374.1, "text": "Da hab ich den alten Raspberry Pi 3 abgelöst der ist nur für den Stream sonst nix"}, {"id": 745, "start": 7374.1, "end": 7378.1, "text": "Wenn wir irgendwann die Sachen ausprobieren"}, {"id": 746, "start": 7384.1, "end": 7390.1, "text": "Also hier ist kein Problem ich kanns mal ausprobieren ich hab hier irgendwo nen"}, {"id": 747, "start": 7390.1, "end": 7400.1, "text": "Ich hab hier doch in der Ikea Tasche eben nen, wartet mal nen HDMI gesehen"}, {"id": 748, "start": 7400.1, "end": 7406.1, "text": "Hier guckt mal kann ich euch zeigen"}, {"id": 749, "start": 7406.1, "end": 7410.1, "text": "Hier guckt mal HDMI"}, {"id": 750, "start": 7410.1, "end": 7414.1, "text": "HDMI"}, {"id": 751, "start": 7416.1, "end": 7420.1, "text": "Gar kein Problem Funst passt wunderbar"}, {"id": 752, "start": 7422.1, "end": 7424.1, "text": "Alles gut"}, {"id": 753, "start": 7428.1, "end": 7430.1, "text": "Perfekt"}, {"id": 754, "start": 7430.1, "end": 7434.1, "text": "Exzellent sozusagen exquisite"}, {"id": 755, "start": 7434.1, "end": 7440.1, "text": "So wir machen jetzt mal die Big Brain Noctua Wärmeladpaste wieder zu"}, {"id": 756, "start": 7440.1, "end": 7444.1, "text": "Bevor es noch mehr kleckert das Ding"}, {"id": 757, "start": 7446.1, "end": 7450.1, "text": "Zu und wieder hier rein"}, {"id": 758, "start": 7450.1, "end": 7452.1, "text": "Braucht man bestimmt nochmal"}, {"id": 759, "start": 7452.1, "end": 7456.1, "text": "Dieses komische eingesiffte Ding kommt da auch rein"}, {"id": 760, "start": 7456.1, "end": 7458.1, "text": "Was immer das ist"}, {"id": 761, "start": 7458.1, "end": 7462.1, "text": "Reflink für das Case"}, {"id": 762, "start": 7462.1, "end": 7464.1, "text": "Nee hab ich nicht"}, {"id": 763, "start": 7464.1, "end": 7466.1, "text": "Klick einfach in den Reflink von mir an und kaufs dann"}, {"id": 764, "start": 7466.1, "end": 7468.1, "text": "Das zählt für alles was man kauft"}, {"id": 765, "start": 7468.1, "end": 7470.1, "text": "Wenn nicht dann nicht"}, {"id": 766, "start": 7478.1, "end": 7480.1, "text": "Ja Leute so siehts aus"}, {"id": 767, "start": 7480.1, "end": 7486.1, "text": "Mehr Content hab ich für heut net geplant"}, {"id": 768, "start": 7486.1, "end": 7490.1, "text": "Hab ich irgendwas übersehen im Chat"}, {"id": 769, "start": 7492.1, "end": 7496.1, "text": "Hab ich irgendwas im Chat übersehen zeig mal her"}, {"id": 770, "start": 7496.1, "end": 7498.1, "text": "Cute Chat"}, {"id": 771, "start": 7504.1, "end": 7506.1, "text": "Du hast jetzt nen 3D Drucker gekauft"}, {"id": 772, "start": 7506.1, "end": 7508.1, "text": "Exzellent"}, {"id": 773, "start": 7508.1, "end": 7510.1, "text": "Hab ich an Weihnachten"}, {"id": 774, "start": 7510.1, "end": 7512.1, "text": "Achso Tutorial ganz bestimmt"}, {"id": 775, "start": 7516.1, "end": 7518.1, "text": "Hatten wir schon, hatten wir schon"}, {"id": 776, "start": 7518.1, "end": 7530.1, "text": "Hatten wir auch schon"}, {"id": 777, "start": 7538.1, "end": 7542.1, "text": "Dinger heißen offiziell Rüttelsensor"}, {"id": 778, "start": 7542.1, "end": 7544.1, "text": "Ich glaub großartig Erdbeben erkennen"}, {"id": 779, "start": 7544.1, "end": 7546.1, "text": "Keine Ahnung ob das so gut damit funktioniert"}, {"id": 780, "start": 7546.1, "end": 7548.1, "text": "Ja doch wahrscheinlich auch"}, {"id": 781, "start": 7552.1, "end": 7554.1, "text": "Zeit für VU"}, {"id": 782, "start": 7554.1, "end": 7556.1, "text": "Wir können mal gucken ob ein Server"}, {"id": 783, "start": 7556.1, "end": 7568.1, "text": "Ja aber ins Bett wird doch gehen oder"}, {"id": 784, "start": 7568.1, "end": 7582.1, "text": "Das sieht da mega hässlich aus"}, {"id": 785, "start": 7582.1, "end": 7590.1, "text": "Das kann man doch heute wahrscheinlich schon ziemlich easy machen oder"}, {"id": 786, "start": 7590.1, "end": 7592.1, "text": "Wow"}, {"id": 787, "start": 7592.1, "end": 7596.1, "text": "Achso weil es die GPR ausdurchleitet"}, {"id": 788, "start": 7596.1, "end": 7598.1, "text": "Ok"}, {"id": 789, "start": 7604.1, "end": 7606.1, "text": "Das hatten wir eigentlich alles schon"}, {"id": 790, "start": 7606.1, "end": 7608.1, "text": "Ich hab nix übersehen oder"}, {"id": 791, "start": 7616.1, "end": 7618.1, "text": "Nix übersehen"}, {"id": 792, "start": 7618.1, "end": 7620.1, "text": "Nö"}, {"id": 793, "start": 7628.1, "end": 7634.1, "text": "Ja wie gesagt für 20 Euro kriegst du ja schon das komplette Case was ich da gezeigt hab"}, {"id": 794, "start": 7634.1, "end": 7636.1, "text": "Also für 20 Euro kriegst du ja schon ungefähr"}, {"id": 795, "start": 7636.1, "end": 7638.1, "text": "Für 21 Euro kriegst du ja schon das komplette"}, {"id": 796, "start": 7638.1, "end": 7640.1, "text": "Das komplette Case"}, {"id": 797, "start": 7640.1, "end": 7642.1, "text": "Also ich weiß nicht wie sinnvoll das ist da"}, {"id": 798, "start": 7642.1, "end": 7644.1, "text": "Nur nen Lüfter zu kaufen"}, {"id": 799, "start": 7644.1, "end": 7646.1, "text": "Na gut wenn man Lüfter haben will"}, {"id": 800, "start": 7646.1, "end": 7648.1, "text": "Und an die GPI auskommen will"}, {"id": 801, "start": 7648.1, "end": 7650.1, "text": "Ist das tatsächlich nicht schlecht"}, {"id": 802, "start": 7650.1, "end": 7652.1, "text": "Weil an die GPI aus kommst du hier nicht"}, {"id": 803, "start": 7652.1, "end": 7654.1, "text": "GPI outchamp ist hier nicht"}, {"id": 804, "start": 7666.1, "end": 7668.1, "text": "Das Agon Neo"}, {"id": 805, "start": 7668.1, "end": 7670.1, "text": "Ja das kann man sich auch kaufen das ist hier nicht schlecht"}, {"id": 806, "start": 7670.1, "end": 7676.1, "text": "Die Agon Cases sind eigentlich auch ganz gut immer"}, {"id": 807, "start": 7682.1, "end": 7684.1, "text": "GPIO mit Flachbandkabel"}, {"id": 808, "start": 7684.1, "end": 7686.1, "text": "Das würde funktionieren ja"}, {"id": 809, "start": 7686.1, "end": 7688.1, "text": "Wie verwaltest du deine ganzen Daten?"}, {"id": 810, "start": 7688.1, "end": 7690.1, "text": "Nextcloud nass?"}, {"id": 811, "start": 7690.1, "end": 7692.1, "text": "Ich hab ne nass"}, {"id": 812, "start": 7692.1, "end": 7694.1, "text": "Ich hab auch Nextcloud für den Sync zwischen ein paar Rechnern"}, {"id": 813, "start": 7694.1, "end": 7696.1, "text": "Aber ich mag Nextcloud überhaupt gar nicht"}, {"id": 814, "start": 7696.1, "end": 7698.1, "text": "Ich will das schon seit einer ganzen Weile"}, {"id": 815, "start": 7698.1, "end": 7700.1, "text": "Ablösen bin aber noch zu faul"}, {"id": 816, "start": 7700.1, "end": 7702.1, "text": "Für"}, {"id": 817, "start": 7702.1, "end": 7704.1, "text": "Macht da wahrscheinlich eh ne Kombination aus"}, {"id": 818, "start": 7704.1, "end": 7706.1, "text": "Syncthing und"}, {"id": 819, "start": 7706.1, "end": 7708.1, "text": "Irgendeinem normalen CalDAF Server oder so"}, {"id": 820, "start": 7708.1, "end": 7710.1, "text": "Weil Nextcloud ist pain"}, {"id": 821, "start": 7710.1, "end": 7726.1, "text": "In the ass"}, {"id": 822, "start": 7726.1, "end": 7730.1, "text": "Wärst du nach Dresden wenn der Friseur wieder am Start ist?"}, {"id": 823, "start": 7730.1, "end": 7734.1, "text": "Ich würd gern mal wieder nach Dresden fahren"}, {"id": 824, "start": 7734.1, "end": 7738.1, "text": "Es war schon nice"}, {"id": 825, "start": 7738.1, "end": 7750.1, "text": "Ich weiß nicht wie schnell mein 3D Drucker druckt"}, {"id": 826, "start": 7750.1, "end": 7752.1, "text": "Hab ich doch"}, {"id": 827, "start": 7752.1, "end": 7754.1, "text": "Ich hab da Default Settings"}, {"id": 828, "start": 7754.1, "end": 7756.1, "text": "Tja"}, {"id": 829, "start": 7756.1, "end": 7758.1, "text": "Aber jetzt wenn denn gerade einer sagt VU"}, {"id": 830, "start": 7758.1, "end": 7762.1, "text": "Ich guck mal schnell in VU rein"}, {"id": 831, "start": 7762.1, "end": 7764.1, "text": "By the way"}, {"id": 832, "start": 7764.1, "end": 7766.1, "text": "Ich muss euch mal was fragen Leute"}, {"id": 833, "start": 7766.1, "end": 7768.1, "text": "Jetzt mal"}, {"id": 834, "start": 7768.1, "end": 7770.1, "text": "Hat nix mit Battlefield oder"}, {"id": 835, "start": 7770.1, "end": 7772.1, "text": "Raspberry Pi cases zu tun"}, {"id": 836, "start": 7772.1, "end": 7774.1, "text": "Ich hab auf"}, {"id": 837, "start": 7774.1, "end": 7776.1, "text": "Ich hab manchmal Lack"}, {"id": 838, "start": 7776.1, "end": 7778.1, "text": "Wenn ich den Windows Knopf drück"}, {"id": 839, "start": 7778.1, "end": 7780.1, "text": "Wenn ich den Windows Knopf drück"}, {"id": 840, "start": 7780.1, "end": 7782.1, "text": "Da lags 2-3 Sekunden"}, {"id": 841, "start": 7782.1, "end": 7784.1, "text": "Explorer Auslastung geht auf 10% hoch"}, {"id": 842, "start": 7784.1, "end": 7786.1, "text": "Ich glaub das ist irgendwie"}, {"id": 843, "start": 7786.1, "end": 7788.1, "text": "Ein Problem von Windows"}, {"id": 844, "start": 7788.1, "end": 7790.1, "text": "Weil mein Desktop zu voll ist"}, {"id": 845, "start": 7790.1, "end": 7792.1, "text": "Jetzt ohne Scheiß"}, {"id": 846, "start": 7792.1, "end": 7794.1, "text": "Mein Desktop ist ja auf meinem Main Account noch viel voller"}, {"id": 847, "start": 7794.1, "end": 7796.1, "text": "Kennt das jemand?"}, {"id": 848, "start": 7796.1, "end": 7798.1, "text": "Lag wenn man Windows Taste drückt"}, {"id": 849, "start": 7798.1, "end": 7800.1, "text": "Ok Leute Dead Game"}, {"id": 850, "start": 7800.1, "end": 7802.1, "text": "Dead Game"}, {"id": 851, "start": 7804.1, "end": 7806.1, "text": "Pains Champ"}, {"id": 852, "start": 7806.1, "end": 7808.1, "text": "Game Dead"}, {"id": 853, "start": 7808.1, "end": 7810.1, "text": "Und dann auch Thresh Map"}, {"id": 854, "start": 7816.1, "end": 7818.1, "text": "Hast du auch?"}, {"id": 855, "start": 7818.1, "end": 7820.1, "text": "Komisch"}, {"id": 856, "start": 7820.1, "end": 7822.1, "text": "Mit Lelux wäre das nicht passiert, ja das stimmt"}, {"id": 857, "start": 7822.1, "end": 7824.1, "text": "Aber wenn wir es noch mehr haben"}, {"id": 858, "start": 7824.1, "end": 7826.1, "text": "Ist es bestimmt ein Windows Bug und wird hoffentlich"}, {"id": 859, "start": 7826.1, "end": 7828.1, "text": "Fix mit einem der nächsten"}, {"id": 860, "start": 7828.1, "end": 7830.1, "text": "Rollups da"}, {"id": 861, "start": 7834.1, "end": 7836.1, "text": "Ok Chat"}, {"id": 862, "start": 7836.1, "end": 7838.1, "text": "Und dann hab ich noch mal eine andere Frage an euch"}, {"id": 863, "start": 7838.1, "end": 7840.1, "text": "So mal an die krassen"}, {"id": 864, "start": 7840.1, "end": 7842.1, "text": "Webentwicklung Champs"}, {"id": 865, "start": 7844.1, "end": 7846.1, "text": "Komm bisschen kleiner kurz"}, {"id": 866, "start": 7846.1, "end": 7848.1, "text": "Aber ich lass es da"}, {"id": 867, "start": 7848.1, "end": 7850.1, "text": "Meine Frage an die Webentwicklungs Champs"}, {"id": 868, "start": 7850.1, "end": 7852.1, "text": "Von euch"}, {"id": 869, "start": 7854.1, "end": 7856.1, "text": "Kann mir irgendjemand"}, {"id": 870, "start": 7856.1, "end": 7858.1, "text": "Erklären warum das so"}, {"id": 871, "start": 7858.1, "end": 7860.1, "text": "Angesagt ist Halloween CSS?"}, {"id": 872, "start": 7860.1, "end": 7862.1, "text": "Ich versteh es nicht so"}, {"id": 873, "start": 7862.1, "end": 7864.1, "text": "Ganz"}, {"id": 874, "start": 7864.1, "end": 7866.1, "text": "Das ist voll im Hype aktuell"}, {"id": 875, "start": 7866.1, "end": 7868.1, "text": "Weil"}, {"id": 876, "start": 7868.1, "end": 7870.1, "text": "Also habt ihr mal eine Idee warum das so"}, {"id": 877, "start": 7870.1, "end": 7872.1, "text": "Beliebt ist? Weil ist das nicht"}, {"id": 878, "start": 7872.1, "end": 7874.1, "text": "Ist das nicht im Endeffekt"}, {"id": 879, "start": 7874.1, "end": 7876.1, "text": "Wie Inline CSS schreiben?"}, {"id": 880, "start": 7876.1, "end": 7878.1, "text": "Das ist"}, {"id": 881, "start": 7878.1, "end": 7880.1, "text": "Wie Inline CSS schreiben"}, {"id": 882, "start": 7880.1, "end": 7882.1, "text": "Und Inline CSS"}, {"id": 883, "start": 7882.1, "end": 7884.1, "text": "Ist doch voll verpönt"}, {"id": 884, "start": 7884.1, "end": 7886.1, "text": "Wobei ich sagen muss"}, {"id": 885, "start": 7886.1, "end": 7888.1, "text": "Ich persönlich mag"}, {"id": 886, "start": 7888.1, "end": 7890.1, "text": "Inline CSS eigentlich"}, {"id": 887, "start": 7890.1, "end": 7892.1, "text": "Da kannst du es genau da"}, {"id": 888, "start": 7892.1, "end": 7894.1, "text": "Hinschreiben wo Sache ist"}, {"id": 889, "start": 7896.1, "end": 7898.1, "text": "Ist das"}, {"id": 890, "start": 7898.1, "end": 7900.1, "text": "Für Leute die gerne Inline CSS verwenden"}, {"id": 891, "start": 7900.1, "end": 7902.1, "text": "Und das ein bisschen ordentlicher machen wollen?"}, {"id": 892, "start": 7902.1, "end": 7904.1, "text": "Also Leute"}, {"id": 893, "start": 7904.1, "end": 7906.1, "text": "Ich weiß schon was es macht"}, {"id": 894, "start": 7906.1, "end": 7908.1, "text": "Aber ich versteh nicht warum Inline CSS"}, {"id": 895, "start": 7908.1, "end": 7910.1, "text": "Auf der einen Seite so verpönt ist"}, {"id": 896, "start": 7910.1, "end": 7912.1, "text": "Und auf der anderen Seite Tailwind voll"}, {"id": 897, "start": 7912.1, "end": 7914.1, "text": "Angesagt ist"}, {"id": 898, "start": 7914.1, "end": 7916.1, "text": "Weil"}, {"id": 899, "start": 7916.1, "end": 7918.1, "text": "Dazu kommt"}, {"id": 900, "start": 7918.1, "end": 7920.1, "text": "Es ist ja kein UI Framework"}, {"id": 901, "start": 7920.1, "end": 7922.1, "text": "In dem Sinn dass du da fertige Buttons"}, {"id": 902, "start": 7922.1, "end": 7924.1, "text": "Fertige Tabellen und fertige"}, {"id": 903, "start": 7924.1, "end": 7926.1, "text": "Switches"}, {"id": 904, "start": 7926.1, "end": 7928.1, "text": "Fertige Cards oder sonst"}, {"id": 905, "start": 7928.1, "end": 7930.1, "text": "Was bekommst Du musst ja trotzdem"}, {"id": 906, "start": 7930.1, "end": 7934.1, "text": "Alles noch selber stylen"}, {"id": 907, "start": 7940.1, "end": 7942.1, "text": "Man schreibt sein CSS ins HTML"}, {"id": 908, "start": 7942.1, "end": 7944.1, "text": "Also so genau"}, {"id": 909, "start": 7944.1, "end": 7960.1, "text": "Hab ich das noch nicht gecheckt ehrlich gesagt"}, {"id": 910, "start": 7968.1, "end": 7970.1, "text": "Check ich nicht"}, {"id": 911, "start": 7970.1, "end": 7972.1, "text": "Du schreibst kein CSS"}, {"id": 912, "start": 7972.1, "end": 7974.1, "text": "In das HTML"}, {"id": 913, "start": 7974.1, "end": 7976.1, "text": "Na im Prinzip schon"}, {"id": 914, "start": 7976.1, "end": 7978.1, "text": "Unter der Haube sind das"}, {"id": 915, "start": 7978.1, "end": 7980.1, "text": "Natürlich irgendwelche vordefinierten"}, {"id": 916, "start": 7980.1, "end": 7982.1, "text": "CSS Klassen aber ganz im Ernst also"}, {"id": 917, "start": 7982.1, "end": 7984.1, "text": "Das ist schon"}, {"id": 918, "start": 7984.1, "end": 7986.1, "text": "Im Prinzip so eine Art CSS"}, {"id": 919, "start": 7986.1, "end": 7988.1, "text": "In das HTML"}, {"id": 920, "start": 7988.1, "end": 7990.1, "text": "Nur dass"}, {"id": 921, "start": 7990.1, "end": 7992.1, "text": "Sagen wir so die Klassen sind halt"}, {"id": 922, "start": 7992.1, "end": 7994.1, "text": "Für dich definiert"}, {"id": 923, "start": 7994.1, "end": 7996.1, "text": "Es ist ein bisschen wie Inline Styles"}, {"id": 924, "start": 7996.1, "end": 7998.1, "text": "Und ich verstehe halt nicht warum Inline Styles"}, {"id": 925, "start": 7998.1, "end": 8000.1, "text": "Hier voll geil gefunden wird"}, {"id": 926, "start": 8000.1, "end": 8002.1, "text": "Ich finde es vom Ansatz ja auch nice"}, {"id": 927, "start": 8002.1, "end": 8004.1, "text": "Ich mag ja auch Inline Styles ja"}, {"id": 928, "start": 8010.1, "end": 8012.1, "text": "Aber ich werde es mal"}, {"id": 929, "start": 8012.1, "end": 8014.1, "text": "Ausprobieren"}, {"id": 930, "start": 8014.1, "end": 8016.1, "text": "Vielleicht sagt mir das ja zu"}, {"id": 931, "start": 8018.1, "end": 8020.1, "text": "Warum ich so ein Kram wie"}, {"id": 932, "start": 8020.1, "end": 8022.1, "text": "Viewtify oder so verwende ist weil ich"}, {"id": 933, "start": 8022.1, "end": 8024.1, "text": "Im Design von UI Elementen"}, {"id": 934, "start": 8024.1, "end": 8026.1, "text": "Sacke"}, {"id": 935, "start": 8026.1, "end": 8028.1, "text": "Da fertige Sachen habe"}, {"id": 936, "start": 8028.1, "end": 8030.1, "text": "Da mit Tailwind muss ich ja immer noch"}, {"id": 937, "start": 8030.1, "end": 8032.1, "text": "Also das ist ja wirklich nur"}, {"id": 938, "start": 8032.1, "end": 8034.1, "text": "Einen Ersatz für CSS schreiben also sprich"}, {"id": 939, "start": 8034.1, "end": 8036.1, "text": "Ich muss immer noch alles selbst stylen"}, {"id": 940, "start": 8038.1, "end": 8040.1, "text": "Also wenn man zwei linke Hände hat was Webdesign"}, {"id": 941, "start": 8040.1, "end": 8042.1, "text": "angeht dann"}, {"id": 942, "start": 8042.1, "end": 8044.1, "text": "Wobei man könnte auch den Serious Max"}, {"id": 943, "start": 8044.1, "end": 8046.1, "text": "Fragen der ist ja hier"}, {"id": 944, "start": 8046.1, "end": 8048.1, "text": "Massive Frontend Big Brain Design"}, {"id": 945, "start": 8052.1, "end": 8054.1, "text": "Das wäre eh das beste lass einfach andere Leute"}, {"id": 946, "start": 8054.1, "end": 8056.1, "text": "Frontend machen easy"}, {"id": 947, "start": 8058.1, "end": 8060.1, "text": "Hör mir auf wieso der"}, {"id": 948, "start": 8060.1, "end": 8062.1, "text": "Preis Champ Prototyp sah doch echt geil"}, {"id": 949, "start": 8062.1, "end": 8064.1, "text": "aus"}, {"id": 950, "start": 8066.1, "end": 8068.1, "text": "Der Agile"}, {"id": 951, "start": 8068.1, "end": 8070.1, "text": "Ne da gibt es sich mit so easy Sachen nicht ab"}, {"id": 952, "start": 8078.1, "end": 8080.1, "text": "Wir waren heute auf der Arbeit übrigens"}, {"id": 953, "start": 8080.1, "end": 8082.1, "text": "Super agil ich weiß gar nicht ob ich das schon"}, {"id": 954, "start": 8082.1, "end": 8084.1, "text": "gezeigt habe guck mal"}, {"id": 955, "start": 8088.1, "end": 8090.1, "text": "Also Alternate ist auch"}, {"id": 956, "start": 8090.1, "end": 8092.1, "text": "Mit das neue Alternate ist"}, {"id": 957, "start": 8092.1, "end": 8094.1, "text": "Auch mit Tailwind gemacht guck mal"}, {"id": 958, "start": 8100.1, "end": 8102.1, "text": "Oder auch nicht"}, {"id": 959, "start": 8106.1, "end": 8108.1, "text": "Oder zumindest"}, {"id": 960, "start": 8108.1, "end": 8112.1, "text": "Mit was ziemlich ähnlichem"}, {"id": 961, "start": 8116.1, "end": 8118.1, "text": "Ist das ist das"}, {"id": 962, "start": 8118.1, "end": 8120.1, "text": "Tailwind"}, {"id": 963, "start": 8120.1, "end": 8122.1, "text": "Oder ist"}, {"id": 964, "start": 8122.1, "end": 8124.1, "text": "das was custom Alternatikes"}, {"id": 965, "start": 8126.1, "end": 8128.1, "text": "Weil sowas ist auch in Tailwind"}, {"id": 966, "start": 8128.1, "end": 8130.1, "text": "drin"}, {"id": 967, "start": 8132.1, "end": 8134.1, "text": "Meinst du das ist"}, {"id": 968, "start": 8134.1, "end": 8136.1, "text": "Bootstrap"}, {"id": 969, "start": 8136.1, "end": 8138.1, "text": "Nee"}, {"id": 970, "start": 8138.1, "end": 8140.1, "text": "Nee das ist kein Boot das sieht nicht"}, {"id": 971, "start": 8140.1, "end": 8142.1, "text": "Bootstrappy aus"}, {"id": 972, "start": 8146.1, "end": 8148.1, "text": "Oder Custom Zeug ja"}, {"id": 973, "start": 8150.1, "end": 8152.1, "text": "Wobei Nafbar Item das könnte auch"}, {"id": 974, "start": 8152.1, "end": 8154.1, "text": "Ach keine Ahnung"}, {"id": 975, "start": 8154.1, "end": 8156.1, "text": "Das könnte auch wirklich Bootstrap sein"}, {"id": 976, "start": 8156.1, "end": 8158.1, "text": "Ja doch doch doch doch doch doch"}, {"id": 977, "start": 8158.1, "end": 8160.1, "text": "Das ist Bootstrap guck mal"}, {"id": 978, "start": 8160.1, "end": 8164.1, "text": "Ja das ist Bootstrap"}, {"id": 979, "start": 8168.1, "end": 8170.1, "text": "Na klar"}, {"id": 980, "start": 8170.1, "end": 8172.1, "text": "Delta warum nicht"}, {"id": 981, "start": 8176.1, "end": 8178.1, "text": "Guck mal"}, {"id": 982, "start": 8178.1, "end": 8180.1, "text": "Wie agil wir heute waren"}, {"id": 983, "start": 8180.1, "end": 8182.1, "text": "Auf der Arbeit"}, {"id": 984, "start": 8182.1, "end": 8184.1, "text": "Heut Nacht ging was kaputt"}, {"id": 985, "start": 8186.1, "end": 8188.1, "text": "Ich hab einem Kollegen drüber geschrieben"}, {"id": 986, "start": 8188.1, "end": 8190.1, "text": "Er hat direkt festgestellt"}, {"id": 987, "start": 8190.1, "end": 8192.1, "text": "Wo der Fehler lag"}, {"id": 988, "start": 8192.1, "end": 8194.1, "text": "Wir haben noch ein dummes Bild gepostet"}, {"id": 989, "start": 8194.1, "end": 8196.1, "text": "Ich hab's gecherry picked und der Fehler war weg"}, {"id": 990, "start": 8196.1, "end": 8198.1, "text": "Also wenn das nicht mal agil ist"}, {"id": 991, "start": 8198.1, "end": 8200.1, "text": "Dann weiß ich auch nicht"}, {"id": 992, "start": 8200.1, "end": 8202.1, "text": "Innerhalb von 5 Minuten vom Fehler"}, {"id": 993, "start": 8202.1, "end": 8204.1, "text": "Entdeckt zu Fehler gefixt"}, {"id": 994, "start": 8204.1, "end": 8206.1, "text": "Von Fehler cherry picked und deployed"}, {"id": 995, "start": 8206.1, "end": 8208.1, "text": "Das ist sowas von Agile"}, {"id": 996, "start": 8208.1, "end": 8210.1, "text": "Alter"}, {"id": 997, "start": 8210.1, "end": 8212.1, "text": "Das sollte den"}, {"id": 998, "start": 8212.1, "end": 8214.1, "text": "Scrum Preis 2021"}, {"id": 999, "start": 8214.1, "end": 8218.1, "text": "Gewinnen"}, {"id": 1000, "start": 8218.1, "end": 8220.1, "text": "Gibt's eigentlich sowas?"}, {"id": 1001, "start": 8220.1, "end": 8222.1, "text": "Scrum"}, {"id": 1002, "start": 8222.1, "end": 8224.1, "text": "Preis"}, {"id": 1003, "start": 8224.1, "end": 8226.1, "text": "Scrum Master Preis"}, {"id": 1004, "start": 8230.1, "end": 8232.1, "text": "Nee"}, {"id": 1005, "start": 8232.1, "end": 8246.1, "text": "Preis Verleihung"}, {"id": 1006, "start": 8246.1, "end": 8248.1, "text": "Es gibt kein"}, {"id": 1007, "start": 8248.1, "end": 8250.1, "text": "Scrum Preis"}, {"id": 1008, "start": 8250.1, "end": 8252.1, "text": "Auszeichnung"}, {"id": 1009, "start": 8252.1, "end": 8254.1, "text": "Es gibt kein"}, {"id": 1010, "start": 8260.1, "end": 8262.1, "text": "Es gibt kein"}, {"id": 1011, "start": 8262.1, "end": 8264.1, "text": "Scrum Master of the year oder sowas"}, {"id": 1012, "start": 8264.1, "end": 8266.1, "text": "Marktlücke"}, {"id": 1013, "start": 8266.1, "end": 8268.1, "text": "Ich würd sagen wir müssen sowas"}, {"id": 1014, "start": 8268.1, "end": 8270.1, "text": "ins"}, {"id": 1015, "start": 8270.1, "end": 8272.1, "text": "Competitive Scrum"}, {"id": 1016, "start": 8272.1, "end": 8274.1, "text": "Ja"}, {"id": 1017, "start": 8274.1, "end": 8276.1, "text": "So wie es Competitive Programming gibt"}, {"id": 1018, "start": 8276.1, "end": 8278.1, "text": "Competitive Scrum"}, {"id": 1019, "start": 8278.1, "end": 8280.1, "text": "Wer macht die schnellste Sprintplanung"}, {"id": 1020, "start": 8280.1, "end": 8282.1, "text": "Und das schönste Kamba an Bord"}, {"id": 1021, "start": 8284.1, "end": 8286.1, "text": "Agile Champ"}, {"id": 1022, "start": 8286.1, "end": 8288.1, "text": "Genau"}, {"id": 1023, "start": 8288.1, "end": 8290.1, "text": "Kannst du meinen Java GUI bewerten?"}, {"id": 1024, "start": 8294.1, "end": 8296.1, "text": "Ja"}, {"id": 1025, "start": 8296.1, "end": 8298.1, "text": "Gucken was da für ein Bild jetzt aufgeht"}, {"id": 1026, "start": 8300.1, "end": 8302.1, "text": "Viel GUI ist da nicht vorhanden"}, {"id": 1027, "start": 8304.1, "end": 8306.1, "text": "Es sieht halt Java Style aus"}, {"id": 1028, "start": 8306.1, "end": 8308.1, "text": "Ist das Java FX oder was ist das?"}, {"id": 1029, "start": 8308.1, "end": 8310.1, "text": "Es sieht halt typisch"}, {"id": 1030, "start": 8310.1, "end": 8312.1, "text": "Java Crap aus"}, {"id": 1031, "start": 8314.1, "end": 8316.1, "text": "Das sieht halt nun mal so aus"}, {"id": 1032, "start": 8316.1, "end": 8318.1, "text": "Das Zeug bei Java"}, {"id": 1033, "start": 8318.1, "end": 8320.1, "text": "Viel GUI ist da ja nicht"}, {"id": 1034, "start": 8320.1, "end": 8322.1, "text": "Dass das hier alles klippt"}, {"id": 1035, "start": 8322.1, "end": 8324.1, "text": "Ist Crap"}, {"id": 1036, "start": 8324.1, "end": 8326.1, "text": "Und ich hab den Eindruck"}, {"id": 1037, "start": 8328.1, "end": 8330.1, "text": "Dass du mir das Bild"}, {"id": 1038, "start": 8330.1, "end": 8332.1, "text": "geschickt hast"}, {"id": 1039, "start": 8332.1, "end": 8334.1, "text": "Ist eigentlich ein großer"}, {"id": 1040, "start": 8334.1, "end": 8338.1, "text": "Gebaid"}, {"id": 1041, "start": 8338.1, "end": 8350.1, "text": "Gebaid"}, {"id": 1042, "start": 8350.1, "end": 8352.1, "text": "Passive Gebaid"}, {"id": 1043, "start": 8362.1, "end": 8364.1, "text": "Das Web Scale"}, {"id": 1044, "start": 8364.1, "end": 8368.1, "text": "Das Diagonal Skaliert"}, {"id": 1045, "start": 8372.1, "end": 8374.1, "text": "Kannst du Java Blacklisten?"}, {"id": 1046, "start": 8374.1, "end": 8376.1, "text": "Ne"}, {"id": 1047, "start": 8376.1, "end": 8378.1, "text": "Die Chinesen mögen Java"}, {"id": 1048, "start": 8378.1, "end": 8380.1, "text": "Ich sags jeden Stream"}, {"id": 1049, "start": 8382.1, "end": 8384.1, "text": "GitHub Trends sind"}, {"id": 1050, "start": 8386.1, "end": 8388.1, "text": "Sind zur Hälfte"}, {"id": 1051, "start": 8388.1, "end": 8390.1, "text": "Chinesen Repos"}, {"id": 1052, "start": 8390.1, "end": 8392.1, "text": "Sind zur Hälfte"}, {"id": 1053, "start": 8392.1, "end": 8394.1, "text": "Chinesen Repos aus"}, {"id": 1054, "start": 8396.1, "end": 8398.1, "text": "Mit Java"}, {"id": 1055, "start": 8398.1, "end": 8400.1, "text": "Passt auf, ich sag's euch"}, {"id": 1056, "start": 8404.1, "end": 8406.1, "text": "Was ist Miniview?"}, {"id": 1057, "start": 8408.1, "end": 8410.1, "text": "Alles klar"}, {"id": 1058, "start": 8414.1, "end": 8416.1, "text": "Exquisite"}, {"id": 1059, "start": 8416.1, "end": 8422.1, "text": "Perfekt"}, {"id": 1060, "start": 8422.1, "end": 8424.1, "text": "Dogecoin ist am Start"}, {"id": 1061, "start": 8424.1, "end": 8426.1, "text": "Very Currency"}, {"id": 1062, "start": 8426.1, "end": 8428.1, "text": "Stonksticker"}, {"id": 1063, "start": 8430.1, "end": 8432.1, "text": "Endlich"}, {"id": 1064, "start": 8432.1, "end": 8434.1, "text": "Ein Golang Stonksticker"}, {"id": 1065, "start": 8434.1, "end": 8436.1, "text": "Da hab ich drauf gewartet"}, {"id": 1066, "start": 8436.1, "end": 8438.1, "text": "In China ist die Bahn ausgefallen"}, {"id": 1067, "start": 8438.1, "end": 8440.1, "text": "Weil Flash"}, {"id": 1068, "start": 8440.1, "end": 8442.1, "text": "Nicht mehr ging"}, {"id": 1069, "start": 8442.1, "end": 8444.1, "text": "Wo sind die ganzen China Repos?"}, {"id": 1070, "start": 8444.1, "end": 8446.1, "text": "Was ist denn hier los?"}, {"id": 1071, "start": 8448.1, "end": 8450.1, "text": "Von dem Typ"}, {"id": 1072, "start": 8450.1, "end": 8452.1, "text": "Hab ich mal einen Webcast geguckt"}, {"id": 1073, "start": 8452.1, "end": 8454.1, "text": "Ich weiß nicht ob der das ist"}, {"id": 1074, "start": 8454.1, "end": 8456.1, "text": "Da hab ich mir"}, {"id": 1075, "start": 8456.1, "end": 8458.1, "text": "Echt an den Kopf gegriffen"}, {"id": 1076, "start": 8458.1, "end": 8460.1, "text": "Falls das das ist, vielleicht tue ich dem jetzt hier unrecht"}, {"id": 1077, "start": 8460.1, "end": 8462.1, "text": "Ich mein es ist recht beliebt das Repo"}, {"id": 1078, "start": 8462.1, "end": 8464.1, "text": "Da wird schon sinnvolle Sachen drin sein"}, {"id": 1079, "start": 8464.1, "end": 8466.1, "text": "Aber von dem hab ich mal einen Konferenztalk geguckt"}, {"id": 1080, "start": 8466.1, "end": 8468.1, "text": "Und"}, {"id": 1081, "start": 8468.1, "end": 8470.1, "text": "Der hat"}, {"id": 1082, "start": 8470.1, "end": 8472.1, "text": "In C-Sharp unter Akuta"}, {"id": 1083, "start": 8472.1, "end": 8474.1, "text": "Also Interfaces"}, {"id": 1084, "start": 8474.1, "end": 8476.1, "text": "Gelitten"}, {"id": 1085, "start": 8476.1, "end": 8478.1, "text": "Der hat keine normalen Klassen verwendet"}, {"id": 1086, "start": 8478.1, "end": 8480.1, "text": "Der hat aus allem ein Interface gemacht"}, {"id": 1087, "start": 8480.1, "end": 8482.1, "text": "Und irgendwann"}, {"id": 1088, "start": 8482.1, "end": 8484.1, "text": "Zur Mitte des Talks hat er anstatt"}, {"id": 1089, "start": 8484.1, "end": 8486.1, "text": "Date-Time zu verwenden"}, {"id": 1090, "start": 8486.1, "end": 8488.1, "text": "Ein Interface I-Date-Time gemacht"}, {"id": 1091, "start": 8488.1, "end": 8490.1, "text": "Und dann darunter abstrahiert"}, {"id": 1092, "start": 8490.1, "end": 8492.1, "text": "Date-Time verwendet und dann hab ich ausgemacht"}, {"id": 1093, "start": 8494.1, "end": 8496.1, "text": "Das war mir zu dumm Alter"}, {"id": 1094, "start": 8496.1, "end": 8500.1, "text": "I-Date-Time Alter"}, {"id": 1095, "start": 8504.1, "end": 8506.1, "text": "Da war es vorbei"}, {"id": 1096, "start": 8506.1, "end": 8508.1, "text": "Warum macht man das? Weil Clean-Architecture"}, {"id": 1097, "start": 8510.1, "end": 8512.1, "text": "Die sind so clean"}, {"id": 1098, "start": 8512.1, "end": 8514.1, "text": "Die brauchen erstmal"}, {"id": 1099, "start": 8514.1, "end": 8516.1, "text": "500 Zeilen bevor sie anfangen können"}, {"id": 1100, "start": 8516.1, "end": 8518.1, "text": "Damit es clean ist"}, {"id": 1101, "start": 8520.1, "end": 8522.1, "text": "Ich mein I-Date-Time"}, {"id": 1102, "start": 8522.1, "end": 8524.1, "text": "Als würde sich das ändern"}, {"id": 1103, "start": 8524.1, "end": 8526.1, "text": "Als müsste ich irgendwie"}, {"id": 1104, "start": 8526.1, "end": 8528.1, "text": "Die Date-Time Implementierung"}, {"id": 1105, "start": 8528.1, "end": 8530.1, "text": "Einfach mal austauschen"}, {"id": 1106, "start": 8530.1, "end": 8532.1, "text": "Gut, dass ich da ein abstrahiertes Interface hab"}, {"id": 1107, "start": 8532.1, "end": 8534.1, "text": "Ja ganz wichtig"}, {"id": 1108, "start": 8534.1, "end": 8536.1, "text": "Wo sind denn die China Repos?"}, {"id": 1109, "start": 8536.1, "end": 8538.1, "text": "Leute ich hab euch gescampt"}, {"id": 1110, "start": 8538.1, "end": 8540.1, "text": "Boah"}, {"id": 1111, "start": 8552.1, "end": 8554.1, "text": "Oh"}, {"id": 1112, "start": 8554.1, "end": 8556.1, "text": "Leute mein Handy ist ausgegangen"}, {"id": 1113, "start": 8556.1, "end": 8558.1, "text": "Und wisst ihr auch warum?"}, {"id": 1114, "start": 8560.1, "end": 8562.1, "text": "Keck wait"}, {"id": 1115, "start": 8564.1, "end": 8566.1, "text": "Wisst ihr warum das ausgegangen ist?"}, {"id": 1116, "start": 8566.1, "end": 8568.1, "text": "Weil ich vergessen hab"}, {"id": 1117, "start": 8568.1, "end": 8570.1, "text": "Den Stromstecker reinzustecken"}, {"id": 1118, "start": 8572.1, "end": 8574.1, "text": "Massive brain Max"}, {"id": 1119, "start": 8574.1, "end": 8576.1, "text": "Huge brain"}, {"id": 1120, "start": 8578.1, "end": 8580.1, "text": "Jetzt muss ich es erstmal aufladen"}, {"id": 1121, "start": 8580.1, "end": 8590.1, "text": "Gut Webcam ist vorbei"}, {"id": 1122, "start": 8598.1, "end": 8600.1, "text": "Okay also"}, {"id": 1123, "start": 8604.1, "end": 8606.1, "text": "Hä? War das nicht das"}, {"id": 1124, "start": 8606.1, "end": 8610.1, "text": "War das nicht das wo Semper Video gewarnt hat davor?"}, {"id": 1125, "start": 8610.1, "end": 8612.1, "text": "Haben die das jetzt geforkt?"}, {"id": 1126, "start": 8620.1, "end": 8622.1, "text": "Haben die das jetzt geforkt?"}, {"id": 1127, "start": 8624.1, "end": 8626.1, "text": "Oder was ist da los?"}, {"id": 1128, "start": 8630.1, "end": 8632.1, "text": "Okay"}, {"id": 1129, "start": 8632.1, "end": 8634.1, "text": "Okay"}, {"id": 1130, "start": 8636.1, "end": 8638.1, "text": "Warum trennt ihr das denn?"}, {"id": 1131, "start": 8652.1, "end": 8654.1, "text": "Aha"}, {"id": 1132, "start": 8654.1, "end": 8656.1, "text": "Okay also hier"}, {"id": 1133, "start": 8656.1, "end": 8658.1, "text": "Erste China Repo"}, {"id": 1134, "start": 8658.1, "end": 8660.1, "text": "Was ist es?"}, {"id": 1135, "start": 8660.1, "end": 8662.1, "text": "Mein Gott"}, {"id": 1136, "start": 8662.1, "end": 8664.1, "text": "Die Ordner"}, {"id": 1137, "start": 8664.1, "end": 8666.1, "text": "Auch noch in China Sachen"}, {"id": 1138, "start": 8666.1, "end": 8668.1, "text": "MonkaS"}, {"id": 1139, "start": 8668.1, "end": 8670.1, "text": "Es ist bestimmt Java"}, {"id": 1140, "start": 8670.1, "end": 8672.1, "text": "Ich hab keine Ahnung was es ist"}, {"id": 1141, "start": 8674.1, "end": 8676.1, "text": "Ich hab keine Asia"}, {"id": 1142, "start": 8676.1, "end": 8678.1, "text": "Schriftarten installiert"}, {"id": 1143, "start": 8684.1, "end": 8686.1, "text": "So JavaScript"}, {"id": 1144, "start": 8686.1, "end": 8688.1, "text": "Was ist das schon wieder?"}, {"id": 1145, "start": 8688.1, "end": 8690.1, "text": "Es vergeht keine Woche ohne neue JavaScript Frameworks"}, {"id": 1146, "start": 8690.1, "end": 8692.1, "text": "Was ist WhiteJS schon wieder?"}, {"id": 1147, "start": 8692.1, "end": 8694.1, "text": "Was ist WhiteJS schon wieder?"}, {"id": 1148, "start": 8694.1, "end": 8696.1, "text": "Was ist WhiteJS schon wieder?"}, {"id": 1149, "start": 8696.1, "end": 8698.1, "text": "Wollt ihr beim Kratos Penta nachdenken?"}, {"id": 1150, "start": 8698.1, "end": 8700.1, "text": "Nee mich hats gewundert das das Repo trennt"}, {"id": 1151, "start": 8700.1, "end": 8702.1, "text": "Obwohl das Malware Zeug hat"}, {"id": 1152, "start": 8702.1, "end": 8704.1, "text": "Obwohl das Malware Zeug hat"}, {"id": 1153, "start": 8704.1, "end": 8706.1, "text": "Obwohl das Malware Zeug hat"}, {"id": 1154, "start": 8706.1, "end": 8708.1, "text": "Wisst ihr was wirklich?"}, {"id": 1155, "start": 8708.1, "end": 8710.1, "text": "Was ist das?"}, {"id": 1156, "start": 8710.1, "end": 8712.1, "text": "Was ist das?"}, {"id": 1157, "start": 8712.1, "end": 8714.1, "text": "Was ist das?"}, {"id": 1158, "start": 8714.1, "end": 8716.1, "text": "Wisst ihr was wirklich?"}, {"id": 1159, "start": 8716.1, "end": 8718.1, "text": "Significantly"}, {"id": 1160, "start": 8718.1, "end": 8720.1, "text": "Significantly die Frontend"}, {"id": 1161, "start": 8720.1, "end": 8722.1, "text": "Experience"}, {"id": 1162, "start": 8722.1, "end": 8724.1, "text": "erhöhen würde"}, {"id": 1163, "start": 8724.1, "end": 8726.1, "text": "wenn es nicht jede Woche eine neue JavaScript Framework"}, {"id": 1164, "start": 8726.1, "end": 8728.1, "text": "gäbe"}, {"id": 1165, "start": 8728.1, "end": 8730.1, "text": "Was macht es"}, {"id": 1166, "start": 8730.1, "end": 8732.1, "text": "überhaupt? Instant Server Start"}, {"id": 1167, "start": 8732.1, "end": 8734.1, "text": "Lightning Fast HMR"}, {"id": 1168, "start": 8734.1, "end": 8736.1, "text": "Was ist denn HMR?"}, {"id": 1169, "start": 8736.1, "end": 8738.1, "text": "Refresh"}, {"id": 1170, "start": 8738.1, "end": 8740.1, "text": "Page refresh oder so"}, {"id": 1171, "start": 8740.1, "end": 8742.1, "text": "Leute"}, {"id": 1172, "start": 8742.1, "end": 8744.1, "text": "Leute die Sache ist die"}, {"id": 1173, "start": 8744.1, "end": 8746.1, "text": "Ich hab das jetzt gelesen"}, {"id": 1174, "start": 8746.1, "end": 8748.1, "text": "Ich hab keine Ahnung was es ist"}, {"id": 1175, "start": 8752.1, "end": 8754.1, "text": "Was ist es überhaupt?"}, {"id": 1176, "start": 8756.1, "end": 8758.1, "text": "Hotmodule Replacement"}, {"id": 1177, "start": 8758.1, "end": 8760.1, "text": "Ja gut das ist im Prinzip Reload"}, {"id": 1178, "start": 8764.1, "end": 8766.1, "text": "Was ist? Leute ich verstehe denn"}, {"id": 1179, "start": 8766.1, "end": 8768.1, "text": "Was ist das?"}, {"id": 1180, "start": 8768.1, "end": 8772.1, "text": "Redox"}, {"id": 1181, "start": 8774.1, "end": 8776.1, "text": "Ist das"}, {"id": 1182, "start": 8778.1, "end": 8780.1, "text": "Ok das funktioniert mit View"}, {"id": 1183, "start": 8784.1, "end": 8786.1, "text": "Ok"}, {"id": 1184, "start": 8786.1, "end": 8788.1, "text": "Ich hab echt keinen Plan"}, {"id": 1185, "start": 8788.1, "end": 8790.1, "text": "Was ist? Ist das so eine Art Webpack?"}, {"id": 1186, "start": 8790.1, "end": 8792.1, "text": "Ist das Webpack"}, {"id": 1187, "start": 8792.1, "end": 8798.1, "text": "in nicht Webpack?"}, {"id": 1188, "start": 8802.1, "end": 8804.1, "text": "Das ist Lightning Fast"}, {"id": 1189, "start": 8806.1, "end": 8808.1, "text": "Geil"}, {"id": 1190, "start": 8808.1, "end": 8810.1, "text": "Introduction"}, {"id": 1191, "start": 8810.1, "end": 8812.1, "text": "Ok"}, {"id": 1192, "start": 8818.1, "end": 8820.1, "text": "Ah das ist ok das ist ein eigener Webpack"}, {"id": 1193, "start": 8820.1, "end": 8822.1, "text": "oder sowas"}, {"id": 1194, "start": 8824.1, "end": 8826.1, "text": "Ok verstehe"}, {"id": 1195, "start": 8830.1, "end": 8832.1, "text": "So Chinesen sind nochmal"}, {"id": 1196, "start": 8832.1, "end": 8834.1, "text": "am Start"}, {"id": 1197, "start": 8834.1, "end": 8836.1, "text": "Java"}, {"id": 1198, "start": 8836.1, "end": 8838.1, "text": "Java"}, {"id": 1199, "start": 8842.1, "end": 8844.1, "text": "Java ich sag doch die China Repos"}, {"id": 1200, "start": 8844.1, "end": 8846.1, "text": "sind alle in Java"}, {"id": 1201, "start": 8846.1, "end": 8850.1, "text": "Da ist schon wieder iDate Time Typ"}, {"id": 1202, "start": 8852.1, "end": 8854.1, "text": "Secure and Fast Micro VMs"}, {"id": 1203, "start": 8854.1, "end": 8856.1, "text": "for Serverless Computing"}, {"id": 1204, "start": 8856.1, "end": 8858.1, "text": "Das hab ich schon mal gesehen"}, {"id": 1205, "start": 8858.1, "end": 8860.1, "text": "Das hab ich tatsächlich schon mal gesehen"}, {"id": 1206, "start": 8860.1, "end": 8862.1, "text": "Ich hab wieder komplett verdrängt was es ist"}, {"id": 1207, "start": 8862.1, "end": 8864.1, "text": "Aber das hab ich schon mal"}, {"id": 1208, "start": 8864.1, "end": 8866.1, "text": "Ist das nicht von Amazon gewesen?"}, {"id": 1209, "start": 8868.1, "end": 8870.1, "text": "War das nicht von Amazon?"}, {"id": 1210, "start": 8870.1, "end": 8874.1, "text": "Ja doch genau"}, {"id": 1211, "start": 8878.1, "end": 8880.1, "text": "Irgendwelche Cloud"}, {"id": 1212, "start": 8880.1, "end": 8882.1, "text": "Native Diagonal Web Scale"}, {"id": 1213, "start": 8882.1, "end": 8884.1, "text": "Agile Lösung"}, {"id": 1214, "start": 8886.1, "end": 8888.1, "text": "Hat Chef selbst entwickelt"}, {"id": 1215, "start": 8888.1, "end": 8890.1, "text": "Genau"}, {"id": 1216, "start": 8890.1, "end": 8892.1, "text": "Open Source Krypto Trading Bot"}, {"id": 1217, "start": 8892.1, "end": 8894.1, "text": "Kann man damit Stonks Money machen?"}, {"id": 1218, "start": 8894.1, "end": 8898.1, "text": "Jetzt weiß ich was ich mit meinem Raspberry Pi mache"}, {"id": 1219, "start": 8898.1, "end": 8900.1, "text": "Stonks Krypto Trading Bot"}, {"id": 1220, "start": 8904.1, "end": 8906.1, "text": "Jawoll"}, {"id": 1221, "start": 8906.1, "end": 8922.1, "text": "7 Euro Poggers"}, {"id": 1222, "start": 8936.1, "end": 8938.1, "text": "Hyper Opt"}, {"id": 1223, "start": 8942.1, "end": 8944.1, "text": "Jawoll"}, {"id": 1224, "start": 8944.1, "end": 8946.1, "text": "Krypto Bot"}, {"id": 1225, "start": 8946.1, "end": 8948.1, "text": "Laufen lassen"}, {"id": 1226, "start": 8956.1, "end": 8958.1, "text": "Das neue Windows Terminal"}, {"id": 1227, "start": 8958.1, "end": 8960.1, "text": "hat ernsthaft 71.000 Sterne"}, {"id": 1228, "start": 8960.1, "end": 8962.1, "text": "Das neue Windows Terminal"}, {"id": 1229, "start": 8962.1, "end": 8964.1, "text": "ist ungefähr jetzt"}, {"id": 1230, "start": 8964.1, "end": 8966.1, "text": "halbwegs brauchbaren Stand"}, {"id": 1231, "start": 8966.1, "end": 8968.1, "text": "Also das was beispielsweise Gnome Terminal"}, {"id": 1232, "start": 8968.1, "end": 8970.1, "text": "oder die anderen Linux Terminals"}, {"id": 1233, "start": 8970.1, "end": 8972.1, "text": "schon seit 15 Jahren sind"}, {"id": 1234, "start": 8972.1, "end": 8974.1, "text": "Aber die Windows User sind so happy"}, {"id": 1235, "start": 8974.1, "end": 8976.1, "text": "dass sie nicht mehr"}, {"id": 1236, "start": 8976.1, "end": 8978.1, "text": "diesen Shit hier verwenden müssen"}, {"id": 1237, "start": 8978.1, "end": 8980.1, "text": "dass sie dem Ding einfach 71.000 Sterne"}, {"id": 1238, "start": 8980.1, "end": 8982.1, "text": "auf GitHub geben"}, {"id": 1239, "start": 8984.1, "end": 8986.1, "text": "Es ist einfach nur ein normales"}, {"id": 1240, "start": 8986.1, "end": 8988.1, "text": "Terminal was funktioniert"}, {"id": 1241, "start": 8988.1, "end": 8990.1, "text": "Das neue Windows Terminal"}, {"id": 1242, "start": 8990.1, "end": 8992.1, "text": "Nur"}, {"id": 1243, "start": 8992.1, "end": 8994.1, "text": "Ich weiß gar nicht"}, {"id": 1244, "start": 8994.1, "end": 8996.1, "text": "ob ich es installiert habe"}, {"id": 1245, "start": 9000.1, "end": 9002.1, "text": "Genau"}, {"id": 1246, "start": 9002.1, "end": 9004.1, "text": "Crap was trendet"}, {"id": 1247, "start": 9008.1, "end": 9010.1, "text": "Was mich im Windows Terminal"}, {"id": 1248, "start": 9010.1, "end": 9012.1, "text": "nervt in dem neuen auch dass man nicht"}, {"id": 1249, "start": 9012.1, "end": 9014.1, "text": "richtig per mittlerer Maustaste"}, {"id": 1250, "start": 9014.1, "end": 9016.1, "text": "Copypasten kann"}, {"id": 1251, "start": 9018.1, "end": 9020.1, "text": "Also was spricht dagegen"}, {"id": 1252, "start": 9020.1, "end": 9022.1, "text": "jetzt mal für die Leute die öfters"}, {"id": 1253, "start": 9022.1, "end": 9024.1, "text": "WSL verwenden"}, {"id": 1254, "start": 9024.1, "end": 9026.1, "text": "Was spricht denn dagegen"}, {"id": 1255, "start": 9026.1, "end": 9028.1, "text": "einen Xserver auf Windows zu installieren"}, {"id": 1256, "start": 9028.1, "end": 9030.1, "text": "ein ordentliches Terminal"}, {"id": 1257, "start": 9030.1, "end": 9032.1, "text": "zu installieren und darin dann"}, {"id": 1258, "start": 9032.1, "end": 9034.1, "text": "seine Shell laufen zu lassen"}, {"id": 1259, "start": 9034.1, "end": 9036.1, "text": "Wäre das nicht noch besser oder gibt es dann Probleme"}, {"id": 1260, "start": 9036.1, "end": 9038.1, "text": "im Zusammenarbeit mit irgendwelchen Windows Tools"}, {"id": 1261, "start": 9040.1, "end": 9042.1, "text": "Emoji Support"}, {"id": 1262, "start": 9042.1, "end": 9044.1, "text": "ja wichtig"}, {"id": 1263, "start": 9044.1, "end": 9046.1, "text": "Ganz wichtig"}, {"id": 1264, "start": 9050.1, "end": 9052.1, "text": "Die wollten mit"}, {"id": 1265, "start": 9052.1, "end": 9054.1, "text": "WSL2"}, {"id": 1266, "start": 9054.1, "end": 9056.1, "text": "Jaja man kann da irgendwie"}, {"id": 1267, "start": 9056.1, "end": 9058.1, "text": "Weiß ich ob es Beta war mit"}, {"id": 1268, "start": 9058.1, "end": 9060.1, "text": "Xserver"}, {"id": 1269, "start": 9060.1, "end": 9062.1, "text": "Ich weiß nicht"}, {"id": 1270, "start": 9062.1, "end": 9064.1, "text": "Ich verfolge das nicht so"}, {"id": 1271, "start": 9064.1, "end": 9066.1, "text": "Häufig"}, {"id": 1272, "start": 9066.1, "end": 9068.1, "text": "Häufig"}, {"id": 1273, "start": 9084.1, "end": 9086.1, "text": "Maui glaube ich nicht"}, {"id": 1274, "start": 9086.1, "end": 9088.1, "text": "dass das was richtig gutes wird"}, {"id": 1275, "start": 9088.1, "end": 9090.1, "text": "Maui ist ja quasi Xamarin"}, {"id": 1276, "start": 9090.1, "end": 9092.1, "text": "oder Xamarin Reloaded"}, {"id": 1277, "start": 9092.1, "end": 9094.1, "text": "und die machen irgendwie"}, {"id": 1278, "start": 9094.1, "end": 9096.1, "text": "so ein komisches"}, {"id": 1279, "start": 9096.1, "end": 9098.1, "text": "uralt GTK oder so"}, {"id": 1280, "start": 9098.1, "end": 9100.1, "text": "Ich glaube das taugt nichts"}, {"id": 1281, "start": 9100.1, "end": 9102.1, "text": "Ich glaube eine wirklich sinnvolle"}, {"id": 1282, "start": 9102.1, "end": 9104.1, "text": "Alternative"}, {"id": 1283, "start": 9104.1, "end": 9106.1, "text": "für Cross Platform Desktop GUI Entwicklung"}, {"id": 1284, "start": 9106.1, "end": 9108.1, "text": "wird es erst geben"}, {"id": 1285, "start": 9108.1, "end": 9110.1, "text": "wenn Flutter auf dem Desktop richtig gut funktioniert"}, {"id": 1286, "start": 9110.1, "end": 9112.1, "text": "ansonsten hast du im Prinzip"}, {"id": 1287, "start": 9112.1, "end": 9114.1, "text": "2 Sachen du hast Qt und da musst du dich"}, {"id": 1288, "start": 9114.1, "end": 9116.1, "text": "mit C++ rumschlagen"}, {"id": 1289, "start": 9118.1, "end": 9120.1, "text": "oder du hast"}, {"id": 1290, "start": 9120.1, "end": 9124.1, "text": "was auch sagt"}, {"id": 1291, "start": 9126.1, "end": 9128.1, "text": "Ja Uno"}, {"id": 1292, "start": 9128.1, "end": 9130.1, "text": "und Avalonia gibt es auch noch"}, {"id": 1293, "start": 9130.1, "end": 9132.1, "text": "aber da weiß ich nicht wie"}, {"id": 1294, "start": 9132.1, "end": 9134.1, "text": "wie gut die funktionieren"}, {"id": 1295, "start": 9134.1, "end": 9136.1, "text": "Also"}, {"id": 1296, "start": 9136.1, "end": 9138.1, "text": "Xamarin hat GTK"}, {"id": 1297, "start": 9138.1, "end": 9140.1, "text": "verwendet unter der Haube"}, {"id": 1298, "start": 9140.1, "end": 9142.1, "text": "unter Linux ja"}, {"id": 1299, "start": 9148.1, "end": 9150.1, "text": "Was anderes andere"}, {"id": 1300, "start": 9150.1, "end": 9152.1, "text": "Möglichkeit gibt es ja nicht"}, {"id": 1301, "start": 9152.1, "end": 9154.1, "text": "was Cross Platform"}, {"id": 1302, "start": 9154.1, "end": 9156.1, "text": "für Xamarin"}, {"id": 1303, "start": 9156.1, "end": 9158.1, "text": "für Xamarin"}, {"id": 1304, "start": 9158.1, "end": 9160.1, "text": "für Xamarin"}, {"id": 1305, "start": 9160.1, "end": 9162.1, "text": "für Xamarin"}, {"id": 1306, "start": 9162.1, "end": 9164.1, "text": "gibt es ja nicht"}, {"id": 1307, "start": 9164.1, "end": 9166.1, "text": "ich glaube so richtig"}, {"id": 1308, "start": 9166.1, "end": 9168.1, "text": "ordentliches Desktop Cross Platform GUI"}, {"id": 1309, "start": 9168.1, "end": 9170.1, "text": "werden wir erst kriegen"}, {"id": 1310, "start": 9170.1, "end": 9172.1, "text": "einen neuen Competitor"}, {"id": 1311, "start": 9172.1, "end": 9174.1, "text": "wenn Flutter auf dem Desktop gut funktioniert"}, {"id": 1312, "start": 9178.1, "end": 9180.1, "text": "Microsoft kriegt es ja nicht einmal"}, {"id": 1313, "start": 9180.1, "end": 9182.1, "text": "geschissen ein ordentliches GUI Framework"}, {"id": 1314, "start": 9182.1, "end": 9184.1, "text": "unter Windows zum laufen zu bringen"}, {"id": 1315, "start": 9184.1, "end": 9192.1, "text": "ich mein WinUI 3"}, {"id": 1316, "start": 9192.1, "end": 9194.1, "text": "WinUI 3"}, {"id": 1317, "start": 9194.1, "end": 9196.1, "text": "haben sie ja auch mal wieder so"}, {"id": 1318, "start": 9196.1, "end": 9198.1, "text": "massiv verkackt"}, {"id": 1319, "start": 9198.1, "end": 9200.1, "text": "bei Microsoft wo ich mich frage"}, {"id": 1320, "start": 9200.1, "end": 9202.1, "text": "wie kann man es so krass verkacken"}, {"id": 1321, "start": 9202.1, "end": 9204.1, "text": "sie wollten eigentlich"}, {"id": 1322, "start": 9204.1, "end": 9206.1, "text": "native Apps also"}, {"id": 1323, "start": 9206.1, "end": 9208.1, "text": "normale Windows Apps"}, {"id": 1324, "start": 9208.1, "end": 9210.1, "text": "kein UWP Geschütz unterstützen"}, {"id": 1325, "start": 9210.1, "end": 9214.1, "text": "Unpackaged"}, {"id": 1326, "start": 9214.1, "end": 9216.1, "text": "Und was unterstützen sie jetzt?"}, {"id": 1327, "start": 9216.1, "end": 9218.1, "text": "Nur Packaged"}, {"id": 1328, "start": 9218.1, "end": 9220.1, "text": "Guck mal"}, {"id": 1329, "start": 9220.1, "end": 9222.1, "text": "wann es da die nächste"}, {"id": 1330, "start": 9222.1, "end": 9224.1, "text": "Roadmap gibt"}, {"id": 1331, "start": 9226.1, "end": 9228.1, "text": "WinForms all change my mind"}, {"id": 1332, "start": 9228.1, "end": 9230.1, "text": "ja Emoji Support zum Beispiel"}, {"id": 1333, "start": 9230.1, "end": 9232.1, "text": "Mind changed"}, {"id": 1334, "start": 9236.1, "end": 9238.1, "text": "Wie sieht es denn mit Unmanaged aus"}, {"id": 1335, "start": 9238.1, "end": 9240.1, "text": "Unpackaged geht das jetzt?"}, {"id": 1336, "start": 9244.1, "end": 9246.1, "text": "ja ja ich weiß dass sie angeblich"}, {"id": 1337, "start": 9246.1, "end": 9248.1, "text": "Unpackaged unterstützen wollen aber"}, {"id": 1338, "start": 9248.1, "end": 9250.1, "text": "wollte die auch schon zum letzten"}, {"id": 1339, "start": 9250.1, "end": 9252.1, "text": "stimmt ja überhaupt nicht"}, {"id": 1340, "start": 9256.1, "end": 9258.1, "text": "geht doch überhaupt nicht Unpackaged"}, {"id": 1341, "start": 9258.1, "end": 9260.1, "text": "lügt nicht Microsoft"}, {"id": 1342, "start": 9260.1, "end": 9262.1, "text": "ich hab es ausprobiert"}, {"id": 1343, "start": 9264.1, "end": 9266.1, "text": "also Unpackaged heißt man kann einfach"}, {"id": 1344, "start": 9266.1, "end": 9268.1, "text": "wie gehabt eine Windows Anwendung erstellen"}, {"id": 1345, "start": 9268.1, "end": 9270.1, "text": "und dann GUI drin machen und gut ist"}, {"id": 1346, "start": 9270.1, "end": 9272.1, "text": "das Problem aktuell ist Packaged Apps"}, {"id": 1347, "start": 9272.1, "end": 9274.1, "text": "sind so Sachen die man beispielsweise"}, {"id": 1348, "start": 9274.1, "end": 9276.1, "text": "bei UWP auch gemacht hat"}, {"id": 1349, "start": 9276.1, "end": 9278.1, "text": "wo man ein extra Code Signing Zertifikat"}, {"id": 1350, "start": 9278.1, "end": 9280.1, "text": "braucht"}, {"id": 1351, "start": 9280.1, "end": 9282.1, "text": "und das Problem ist keiner der"}, {"id": 1352, "start": 9282.1, "end": 9284.1, "text": "so wie ich privat die eine oder andere"}, {"id": 1353, "start": 9284.1, "end": 9286.1, "text": "Windows Anwendung macht kauft sich"}, {"id": 1354, "start": 9286.1, "end": 9288.1, "text": "ein Code Signing Zertifikat"}, {"id": 1355, "start": 9288.1, "end": 9290.1, "text": "selbst wenn es nur 150 Euro"}, {"id": 1356, "start": 9290.1, "end": 9292.1, "text": "im Jahr kostet macht niemand"}, {"id": 1357, "start": 9292.1, "end": 9296.1, "text": "überhaupt nicht ein"}, {"id": 1358, "start": 9296.1, "end": 9298.1, "text": "ok Unpackaged ist hier"}, {"id": 1359, "start": 9298.1, "end": 9300.1, "text": "richtig"}, {"id": 1360, "start": 9300.1, "end": 9302.1, "text": "crap"}, {"id": 1361, "start": 9310.1, "end": 9312.1, "text": "geht immer noch nicht"}, {"id": 1362, "start": 9312.1, "end": 9314.1, "text": "totaler Müll"}, {"id": 1363, "start": 9316.1, "end": 9318.1, "text": "keine Ahnung was"}, {"id": 1364, "start": 9318.1, "end": 9320.1, "text": "mit Microsoft ich mein mal im Ernst"}, {"id": 1365, "start": 9320.1, "end": 9322.1, "text": "wie schafft es Microsoft eigentlich"}, {"id": 1366, "start": 9322.1, "end": 9324.1, "text": "noch Windows zu verkaufen"}, {"id": 1367, "start": 9324.1, "end": 9326.1, "text": "oder besser gesagt wie schafft es Microsoft"}, {"id": 1368, "start": 9326.1, "end": 9328.1, "text": "überhaupt noch Entwickler"}, {"id": 1369, "start": 9328.1, "end": 9330.1, "text": "dazu zu bewegen Desktop Anwendungen"}, {"id": 1370, "start": 9330.1, "end": 9332.1, "text": "für Windows zu machen"}, {"id": 1371, "start": 9332.1, "end": 9334.1, "text": "Desktop Anwendungen"}, {"id": 1372, "start": 9334.1, "end": 9336.1, "text": "auf Windows sind"}, {"id": 1373, "start": 9336.1, "end": 9338.1, "text": "echt der übelste Abfuck"}, {"id": 1374, "start": 9338.1, "end": 9340.1, "text": "du hast die Auswahl zwischen"}, {"id": 1375, "start": 9340.1, "end": 9342.1, "text": "was heißt jetzt eigentlich"}, {"id": 1376, "start": 9342.1, "end": 9344.1, "text": "TOS Terms of Service"}, {"id": 1377, "start": 9344.1, "end": 9346.1, "text": "die haben"}, {"id": 1378, "start": 9346.1, "end": 9348.1, "text": "du hast zur Auswahl unter Windows"}, {"id": 1379, "start": 9348.1, "end": 9350.1, "text": "Forms was ich an sich"}, {"id": 1380, "start": 9350.1, "end": 9352.1, "text": "gar nicht schlecht finde aber halt übelst Old School"}, {"id": 1381, "start": 9352.1, "end": 9354.1, "text": "ist und keine neuen Sachen kann"}, {"id": 1382, "start": 9354.1, "end": 9356.1, "text": "dann hast du"}, {"id": 1383, "start": 9356.1, "end": 9358.1, "text": "UWP was ein bisschen neuer ist aber"}, {"id": 1384, "start": 9358.1, "end": 9360.1, "text": "auch schon zu alt um die richtig interessanten neuen Sachen"}, {"id": 1385, "start": 9360.1, "end": 9362.1, "text": "zu können und dann hast du"}, {"id": 1386, "start": 9362.1, "end": 9364.1, "text": "WPF meine ich und dann hast du"}, {"id": 1387, "start": 9364.1, "end": 9366.1, "text": "UWP das ist neu"}, {"id": 1388, "start": 9366.1, "end": 9368.1, "text": "sackt aber weil du kaum"}, {"id": 1389, "start": 9368.1, "end": 9370.1, "text": "was machen oder vieles nicht machen kannst"}, {"id": 1390, "start": 9370.1, "end": 9372.1, "text": "und Unpackaged schon mal gar nicht ohne"}, {"id": 1391, "start": 9372.1, "end": 9378.1, "text": "Zertifikat"}, {"id": 1392, "start": 9378.1, "end": 9382.1, "text": "also"}, {"id": 1393, "start": 9382.1, "end": 9384.1, "text": "es gibt nichts"}, {"id": 1394, "start": 9384.1, "end": 9386.1, "text": "ich weiß nicht wie Microsoft es schafft"}, {"id": 1395, "start": 9386.1, "end": 9388.1, "text": "dass Leute noch Desktop Anwendungen machen"}, {"id": 1396, "start": 9388.1, "end": 9390.1, "text": "und dann muss man sich doch nicht wundern"}, {"id": 1397, "start": 9390.1, "end": 9392.1, "text": "wenn die Hälfte der neuen Desktop"}, {"id": 1398, "start": 9392.1, "end": 9394.1, "text": "Anwendungen ist"}, {"id": 1399, "start": 9394.1, "end": 9396.1, "text": "besteht aus Elektron"}, {"id": 1400, "start": 9396.1, "end": 9400.1, "text": "und Javascript"}, {"id": 1401, "start": 9400.1, "end": 9402.1, "text": "WPF richtig sinnvoll"}, {"id": 1402, "start": 9402.1, "end": 9404.1, "text": "WPF ist"}, {"id": 1403, "start": 9404.1, "end": 9406.1, "text": "auch Kacke eigentlich im aktuellen"}, {"id": 1404, "start": 9406.1, "end": 9408.1, "text": "2021"}, {"id": 1405, "start": 9408.1, "end": 9410.1, "text": "ich weiß gar nicht ob du mittlerweile einen neuen Webview hast"}, {"id": 1406, "start": 9410.1, "end": 9412.1, "text": "oder immer noch nicht mit dem alten"}, {"id": 1407, "start": 9412.1, "end": 9414.1, "text": "IE Scheiß rumschlagen musst"}, {"id": 1408, "start": 9414.1, "end": 9416.1, "text": "auch die 3D"}, {"id": 1409, "start": 9416.1, "end": 9418.1, "text": "Integration in WPF"}, {"id": 1410, "start": 9418.1, "end": 9420.1, "text": "ist räudig"}, {"id": 1411, "start": 9420.1, "end": 9422.1, "text": "gehen tut es aber schön ist es nicht"}, {"id": 1412, "start": 9424.1, "end": 9426.1, "text": "Emoji Support und neuste Sachen"}, {"id": 1413, "start": 9426.1, "end": 9430.1, "text": "ist auch nicht drinne"}, {"id": 1414, "start": 9430.1, "end": 9432.1, "text": "also im Prinzip"}, {"id": 1415, "start": 9432.1, "end": 9434.1, "text": "dir bleibt ja nichts anderes übrig"}, {"id": 1416, "start": 9434.1, "end": 9436.1, "text": "als eine Elektron Anwendung zu machen"}, {"id": 1417, "start": 9436.1, "end": 9438.1, "text": "oder du machst eine Qt Anwendung"}, {"id": 1418, "start": 9438.1, "end": 9440.1, "text": "dann kannst du wenigstens"}, {"id": 1419, "start": 9440.1, "end": 9442.1, "text": "Mac, Linux, Windows"}, {"id": 1420, "start": 9442.1, "end": 9444.1, "text": "gleichermaßen"}, {"id": 1421, "start": 9444.1, "end": 9446.1, "text": "beklücken"}, {"id": 1422, "start": 9446.1, "end": 9448.1, "text": "dann hast du da wieder andere Probleme und vor allem"}, {"id": 1423, "start": 9448.1, "end": 9450.1, "text": "ist es C++"}, {"id": 1424, "start": 9452.1, "end": 9454.1, "text": "genau deswegen sind so viele"}, {"id": 1425, "start": 9454.1, "end": 9456.1, "text": "Apps Javascript"}, {"id": 1426, "start": 9456.1, "end": 9458.1, "text": "gerade unter Windows"}, {"id": 1427, "start": 9458.1, "end": 9460.1, "text": "sagt halt einfach Massive"}, {"id": 1428, "start": 9460.1, "end": 9462.1, "text": "was Microsoft da macht"}, {"id": 1429, "start": 9464.1, "end": 9466.1, "text": "Apple macht es ein bisschen besser"}, {"id": 1430, "start": 9468.1, "end": 9470.1, "text": "Apple hat einen riesen Vorteil"}, {"id": 1431, "start": 9470.1, "end": 9472.1, "text": "die machen nicht die Sache wie Microsoft"}, {"id": 1432, "start": 9472.1, "end": 9474.1, "text": "dass die alle 4 Jahre"}, {"id": 1433, "start": 9474.1, "end": 9476.1, "text": "ihre Designrichtlinien ändern"}, {"id": 1434, "start": 9476.1, "end": 9478.1, "text": "mal Ribbon Bars, mal keine Ribbon Bars"}, {"id": 1435, "start": 9478.1, "end": 9480.1, "text": "mal Aero, mal kein Aero"}, {"id": 1436, "start": 9480.1, "end": 9482.1, "text": "mal Flat Design, mal kein Flat Design"}, {"id": 1437, "start": 9482.1, "end": 9484.1, "text": "mal was auch immer"}, {"id": 1438, "start": 9484.1, "end": 9486.1, "text": "Microsoft denkt sich ja laufend"}, {"id": 1439, "start": 9486.1, "end": 9488.1, "text": "laufen was anderes aus"}, {"id": 1440, "start": 9488.1, "end": 9490.1, "text": "Apple macht das auch, aber Apple macht das insofern"}, {"id": 1441, "start": 9490.1, "end": 9492.1, "text": "on the fly"}, {"id": 1442, "start": 9492.1, "end": 9494.1, "text": "und ist auch hartnäckig"}, {"id": 1443, "start": 9494.1, "end": 9496.1, "text": "dass die Leute sich dran halten"}, {"id": 1444, "start": 9496.1, "end": 9498.1, "text": "also die kriegen das"}, {"id": 1445, "start": 9498.1, "end": 9500.1, "text": "besser hin"}, {"id": 1446, "start": 9500.1, "end": 9502.1, "text": "ja und unter Linux ist es auch nicht wirklich besser"}, {"id": 1447, "start": 9504.1, "end": 9506.1, "text": "weil"}, {"id": 1448, "start": 9506.1, "end": 9508.1, "text": "unter Linux ist halt generell"}, {"id": 1449, "start": 9508.1, "end": 9510.1, "text": "die sind sich da nicht"}, {"id": 1450, "start": 9510.1, "end": 9512.1, "text": "so wirklich einig genug"}, {"id": 1451, "start": 9512.1, "end": 9514.1, "text": "unter Linux, ja"}, {"id": 1452, "start": 9514.1, "end": 9516.1, "text": "du hast 20 verschiedene Desktops"}, {"id": 1453, "start": 9516.1, "end": 9518.1, "text": "du hast die Gnome Leute"}, {"id": 1454, "start": 9518.1, "end": 9520.1, "text": "die laufen was kaputt machen"}, {"id": 1455, "start": 9520.1, "end": 9522.1, "text": "und im Prinzip"}, {"id": 1456, "start": 9522.1, "end": 9524.1, "text": "GTK halt rein für Gnome optimieren"}, {"id": 1457, "start": 9524.1, "end": 9526.1, "text": "deswegen macht keiner"}, {"id": 1458, "start": 9526.1, "end": 9528.1, "text": "nicht wirklich GTK Anwendungen"}, {"id": 1459, "start": 9528.1, "end": 9530.1, "text": "man darf nicht vergessen VLC"}, {"id": 1460, "start": 9530.1, "end": 9532.1, "text": "war früher mal eine GTK Anwendung"}, {"id": 1461, "start": 9532.1, "end": 9534.1, "text": "aber die haben gesagt"}, {"id": 1462, "start": 9534.1, "end": 9536.1, "text": "leckt mich, ich hab keinen Bock drauf"}, {"id": 1463, "start": 9536.1, "end": 9538.1, "text": "haben sie auf Qt umgestellt"}, {"id": 1464, "start": 9540.1, "end": 9542.1, "text": "also GTK"}, {"id": 1465, "start": 9542.1, "end": 9544.1, "text": "ist halt auch Crap"}, {"id": 1466, "start": 9544.1, "end": 9546.1, "text": "das einzige was gut ist unter Linux"}, {"id": 1467, "start": 9546.1, "end": 9548.1, "text": "ist Qt, allerdings KDE suckt"}, {"id": 1468, "start": 9548.1, "end": 9550.1, "text": "also für mich"}, {"id": 1469, "start": 9550.1, "end": 9552.1, "text": "ich mag KDE nicht"}, {"id": 1470, "start": 9552.1, "end": 9554.1, "text": "also die Desktop Umgebung"}, {"id": 1471, "start": 9554.1, "end": 9556.1, "text": "die mit dem einzig guten GUI Framework"}, {"id": 1472, "start": 9556.1, "end": 9558.1, "text": "programmiert ist, suckt"}, {"id": 1473, "start": 9558.1, "end": 9560.1, "text": "aber das ist eher ne Geschmacksfrage"}, {"id": 1474, "start": 9560.1, "end": 9566.1, "text": "ich mag halt KDE nicht, KDE ist PanzeChamp"}, {"id": 1475, "start": 9572.1, "end": 9574.1, "text": "die Pi Foundation installiert"}, {"id": 1476, "start": 9574.1, "end": 9576.1, "text": "ungefragt ein Microsoft Repo"}, {"id": 1477, "start": 9576.1, "end": 9578.1, "text": "ja gut, warum nicht"}, {"id": 1478, "start": 9582.1, "end": 9584.1, "text": "die installieren auch ungefragt"}, {"id": 1479, "start": 9584.1, "end": 9590.1, "text": "Debian Repos"}, {"id": 1480, "start": 9590.1, "end": 9592.1, "text": "was ist denn Schlimmes drin"}, {"id": 1481, "start": 9592.1, "end": 9594.1, "text": "in dem Microsoft Repo"}, {"id": 1482, "start": 9594.1, "end": 9596.1, "text": "wahrscheinlich das ganze.NET Zeug oder"}, {"id": 1483, "start": 9596.1, "end": 9598.1, "text": "das finde ich persönlich gar nicht schlecht"}, {"id": 1484, "start": 9598.1, "end": 9600.1, "text": "wenn das da standardmäßig drin ist"}, {"id": 1485, "start": 9606.1, "end": 9608.1, "text": "Visual Studio Code"}, {"id": 1486, "start": 9608.1, "end": 9614.1, "text": "aber warum nicht"}, {"id": 1487, "start": 9620.1, "end": 9622.1, "text": "Ach mit den Batches stimmt"}, {"id": 1488, "start": 9622.1, "end": 9624.1, "text": "da müssten wir auch noch was machen"}, {"id": 1489, "start": 9630.1, "end": 9632.1, "text": "naja also"}, {"id": 1490, "start": 9632.1, "end": 9634.1, "text": "Desktop Anwendung ist wirklich"}, {"id": 1491, "start": 9634.1, "end": 9636.1, "text": "PanzeChamp, deswegen bin ich in letzter Zeit"}, {"id": 1492, "start": 9636.1, "end": 9638.1, "text": "auch quasi"}, {"id": 1493, "start": 9638.1, "end": 9640.1, "text": "komplett drauf umgeschwungen"}, {"id": 1494, "start": 9640.1, "end": 9642.1, "text": "mich ein bisschen mehr mit Web Sachen"}, {"id": 1495, "start": 9642.1, "end": 9644.1, "text": "zu beschäftigen"}, {"id": 1496, "start": 9644.1, "end": 9646.1, "text": "weil man hat einfach viele Probleme nicht"}, {"id": 1497, "start": 9646.1, "end": 9648.1, "text": "wenn man die Sachen im Web laufen lässt"}, {"id": 1498, "start": 9648.1, "end": 9650.1, "text": "du hast Instant Support"}, {"id": 1499, "start": 9650.1, "end": 9652.1, "text": "für alle Mobile Plattform"}, {"id": 1500, "start": 9652.1, "end": 9654.1, "text": "für alle Desktop Plattform"}, {"id": 1501, "start": 9654.1, "end": 9656.1, "text": "und die wichtigsten Sachen"}, {"id": 1502, "start": 9656.1, "end": 9658.1, "text": "kannst du heute auch im Browser machen"}, {"id": 1503, "start": 9662.1, "end": 9664.1, "text": "also so wirklich"}, {"id": 1504, "start": 9664.1, "end": 9666.1, "text": "richtig Native Apps"}, {"id": 1505, "start": 9666.1, "end": 9668.1, "text": "bräuchte man zum Beispiel für"}, {"id": 1506, "start": 9672.1, "end": 9674.1, "text": "für irgendwelche Screenshot Tools"}, {"id": 1507, "start": 9674.1, "end": 9676.1, "text": "oder so, weiß ich nicht ob man das im Browser"}, {"id": 1508, "start": 9676.1, "end": 9678.1, "text": "gescheit machen kann so was"}, {"id": 1509, "start": 9678.1, "end": 9680.1, "text": "ja also für Screenshot Tools"}, {"id": 1510, "start": 9680.1, "end": 9682.1, "text": "die dann der Taskleister sind, sich Hotkeys registrieren"}, {"id": 1511, "start": 9682.1, "end": 9684.1, "text": "und sowas, für solche Sachen"}, {"id": 1512, "start": 9684.1, "end": 9686.1, "text": "brauchst du Native Apps noch, aber ansonsten"}, {"id": 1513, "start": 9686.1, "end": 9688.1, "text": "so die meisten anderen Sachen"}, {"id": 1514, "start": 9688.1, "end": 9690.1, "text": "die Leute täglich benutzen"}, {"id": 1515, "start": 9690.1, "end": 9692.1, "text": "sind halt mittlerweile im Browser"}, {"id": 1516, "start": 9692.1, "end": 9694.1, "text": "und Leute die es dann auf dem Desktop bringen wollen"}, {"id": 1517, "start": 9694.1, "end": 9696.1, "text": "die machen es halt in Electron, weil es keine"}, {"id": 1518, "start": 9696.1, "end": 9698.1, "text": "gescheiten Desktop Frameworks gibt"}, {"id": 1519, "start": 9702.1, "end": 9704.1, "text": "ja und Firefox"}, {"id": 1520, "start": 9704.1, "end": 9706.1, "text": "hat gesagt sie bringen kein PWA"}, {"id": 1521, "start": 9706.1, "end": 9708.1, "text": "Support auf dem Desktop, was halt auch sagt"}, {"id": 1522, "start": 9710.1, "end": 9712.1, "text": "genau so ein Tool wie ich mal für BDO"}, {"id": 1523, "start": 9712.1, "end": 9714.1, "text": "gebastelt hab, die die Screenshots analysiert"}, {"id": 1524, "start": 9714.1, "end": 9716.1, "text": "das geht, das geht nur"}, {"id": 1525, "start": 9716.1, "end": 9718.1, "text": "Native und das geht auch nicht mit UWP"}, {"id": 1526, "start": 9718.1, "end": 9720.1, "text": "ich verstehe es einfach nicht"}, {"id": 1527, "start": 9720.1, "end": 9722.1, "text": "warum Microsoft nicht ihren Kram"}, {"id": 1528, "start": 9722.1, "end": 9724.1, "text": "ihr WinUI endlich mal rausbringt"}, {"id": 1529, "start": 9724.1, "end": 9726.1, "text": "für stinknormale Win32"}, {"id": 1530, "start": 9726.1, "end": 9728.1, "text": "Unpackaged Apps"}, {"id": 1531, "start": 9728.1, "end": 9730.1, "text": "dann hättest du ne Chance"}, {"id": 1532, "start": 9730.1, "end": 9732.1, "text": "äh quasi"}, {"id": 1533, "start": 9732.1, "end": 9734.1, "text": "sowas hier"}, {"id": 1534, "start": 9734.1, "end": 9736.1, "text": "zu bauen"}, {"id": 1535, "start": 9736.1, "end": 9738.1, "text": "mit halbwegs"}, {"id": 1536, "start": 9738.1, "end": 9740.1, "text": "modernem Windows Gui"}, {"id": 1537, "start": 9740.1, "end": 9742.1, "text": "mit halbwegs modernem Zeug"}, {"id": 1538, "start": 9742.1, "end": 9744.1, "text": "Unpackaged"}, {"id": 1539, "start": 9744.1, "end": 9750.1, "text": "und kein UWP Crap"}, {"id": 1540, "start": 9750.1, "end": 9752.1, "text": "aber"}, {"id": 1541, "start": 9752.1, "end": 9754.1, "text": "wie gesagt es leuchtet mir nicht an"}, {"id": 1542, "start": 9754.1, "end": 9756.1, "text": "die einzigen die das halbwegs gescheit hinkriegen sind"}, {"id": 1543, "start": 9756.1, "end": 9758.1, "text": "Apple"}, {"id": 1544, "start": 9758.1, "end": 9760.1, "text": "weil auf Linux sieht es nicht wirklich besser aus"}, {"id": 1545, "start": 9764.1, "end": 9766.1, "text": "auf Linux ist aber andere Probleme"}, {"id": 1546, "start": 9766.1, "end": 9768.1, "text": "unter Linux streitet man sich lieber zwei Jahre"}, {"id": 1547, "start": 9768.1, "end": 9770.1, "text": "wer dran schuld ist, dass"}, {"id": 1548, "start": 9770.1, "end": 9772.1, "text": "Hardware Beschleunigung im Browser"}, {"id": 1549, "start": 9772.1, "end": 9774.1, "text": "für Videos nicht funktioniert"}, {"id": 1550, "start": 9774.1, "end": 9776.1, "text": "Hardware Decoding"}, {"id": 1551, "start": 9776.1, "end": 9778.1, "text": "ja was Paint3D"}, {"id": 1552, "start": 9778.1, "end": 9780.1, "text": "ich benutze Paint3D nie"}, {"id": 1553, "start": 9780.1, "end": 9782.1, "text": "ich wollt es jetzt nur mal für das Gui zeigen"}, {"id": 1554, "start": 9782.1, "end": 9784.1, "text": "weil die andere UWP Anwendung"}, {"id": 1555, "start": 9784.1, "end": 9786.1, "text": "die manche Leute öfters verwenden"}, {"id": 1556, "start": 9786.1, "end": 9788.1, "text": "ist der Taschenrechner"}, {"id": 1557, "start": 9788.1, "end": 9790.1, "text": "und das ist natürlich jetzt"}, {"id": 1558, "start": 9790.1, "end": 9792.1, "text": "Guimäßig echt"}, {"id": 1559, "start": 9792.1, "end": 9794.1, "text": "eine sehr gute Anwendung"}, {"id": 1560, "start": 9794.1, "end": 9796.1, "text": "natürlich jetzt Guimäßig echt"}, {"id": 1561, "start": 9796.1, "end": 9798.1, "text": "eines der hässlichsten Programme auf die es überhaupt gibt"}, {"id": 1562, "start": 9798.1, "end": 9800.1, "text": "das sieht aus als"}, {"id": 1563, "start": 9800.1, "end": 9802.1, "text": "die Oberfläche sieht aus als"}, {"id": 1564, "start": 9802.1, "end": 9804.1, "text": "der Design Praktikant"}, {"id": 1565, "start": 9804.1, "end": 9806.1, "text": "in der ersten Viertel Stunde gebastelt"}, {"id": 1566, "start": 9806.1, "end": 9808.1, "text": "guckt euch das mal an"}, {"id": 1567, "start": 9808.1, "end": 9810.1, "text": "was soll"}, {"id": 1568, "start": 9810.1, "end": 9812.1, "text": "was ist das"}, {"id": 1569, "start": 9812.1, "end": 9814.1, "text": "grau in grau"}, {"id": 1570, "start": 9814.1, "end": 9816.1, "text": "und überall ein Button hingeschissen"}, {"id": 1571, "start": 9818.1, "end": 9820.1, "text": "aber cool dass der Hintergrund"}, {"id": 1572, "start": 9820.1, "end": 9824.1, "text": "schimmert ne"}, {"id": 1573, "start": 9824.1, "end": 9826.1, "text": "Video Beschleunigung"}, {"id": 1574, "start": 9826.1, "end": 9828.1, "text": "in Firefox geht erst seit"}, {"id": 1575, "start": 9828.1, "end": 9830.1, "text": "keine Ahnung einen Monat oder so und auch nur"}, {"id": 1576, "start": 9830.1, "end": 9832.1, "text": "unter ganz speziellen"}, {"id": 1577, "start": 9832.1, "end": 9834.1, "text": "Bedingungen"}, {"id": 1578, "start": 9834.1, "end": 9836.1, "text": "und ich glaube bis heute nicht mit allen Video Formaten"}, {"id": 1579, "start": 9836.1, "end": 9838.1, "text": "H265"}, {"id": 1580, "start": 9838.1, "end": 9840.1, "text": "geht glaube ich immer noch nicht und wie es mit"}, {"id": 1581, "start": 9840.1, "end": 9842.1, "text": "VP9 aussieht oder"}, {"id": 1582, "start": 9842.1, "end": 9844.1, "text": "nicht VP9"}, {"id": 1583, "start": 9846.1, "end": 9848.1, "text": "wie heißt der andere Kram"}, {"id": 1584, "start": 9848.1, "end": 9850.1, "text": "geht glaube ich glaube es geht nur H264"}, {"id": 1585, "start": 9850.1, "end": 9852.1, "text": "und auch nur mit den passenden"}, {"id": 1586, "start": 9852.1, "end": 9854.1, "text": "Grafik mit der passenden Grafikkarte mit den passenden"}, {"id": 1587, "start": 9854.1, "end": 9856.1, "text": "Grafikkarten Dreibern mit einer neuesten"}, {"id": 1588, "start": 9856.1, "end": 9858.1, "text": "Firefox Version eventuell noch irgendwelchen"}, {"id": 1589, "start": 9858.1, "end": 9860.1, "text": "Hidden Flex gesetzt im Firefox"}, {"id": 1590, "start": 9860.1, "end": 9862.1, "text": "spezieller Video Codec"}, {"id": 1591, "start": 9862.1, "end": 9864.1, "text": "und noch die passenden Libraries installiert"}, {"id": 1592, "start": 9864.1, "end": 9866.1, "text": "also"}, {"id": 1593, "start": 9868.1, "end": 9870.1, "text": "das ist Crap"}, {"id": 1594, "start": 9870.1, "end": 9872.1, "text": "wirklich also"}, {"id": 1595, "start": 9872.1, "end": 9874.1, "text": "Desktop die müssen sich nicht wundern wenn die"}, {"id": 1596, "start": 9874.1, "end": 9876.1, "text": "Leute keinen Bock mehr auf den Desktop haben"}, {"id": 1597, "start": 9876.1, "end": 9878.1, "text": "das einzige was halt gut auf dem Desktop ist"}, {"id": 1598, "start": 9878.1, "end": 9880.1, "text": "sind Spiele und die sind auch am besten unter Windows"}, {"id": 1599, "start": 9880.1, "end": 9882.1, "text": "und warum das so gut funktioniert ist"}, {"id": 1600, "start": 9882.1, "end": 9884.1, "text": "weil du halt"}, {"id": 1601, "start": 9884.1, "end": 9886.1, "text": "in Spielen nichts"}, {"id": 1602, "start": 9886.1, "end": 9888.1, "text": "Cross Plattform in dem Sinn brauchst ja"}, {"id": 1603, "start": 9888.1, "end": 9890.1, "text": "und wenn schon ist es selbst gemalt"}, {"id": 1604, "start": 9890.1, "end": 9892.1, "text": "und selbst getraw also selbst"}, {"id": 1605, "start": 9892.1, "end": 9894.1, "text": "erschaffen ja"}, {"id": 1606, "start": 9894.1, "end": 9896.1, "text": "dann kannst du das auch machen du brauchst da"}, {"id": 1607, "start": 9896.1, "end": 9922.1, "text": "ein cool Framework was Cross Plattform ist für"}, {"id": 1608, "start": 9922.1, "end": 9924.1, "text": "ich meine es ist schon so weit dass die Leute"}, {"id": 1609, "start": 9924.1, "end": 9926.1, "text": "Game Engines als Cross Plattform"}, {"id": 1610, "start": 9926.1, "end": 9928.1, "text": "GUI Framework für Desktop Anwendungen verwenden"}, {"id": 1611, "start": 9928.1, "end": 9930.1, "text": "muss ich dir mal vorstellen also da"}, {"id": 1612, "start": 9930.1, "end": 9932.1, "text": "da fehlt eindeutig was"}, {"id": 1613, "start": 9932.1, "end": 9934.1, "text": "aber Microsoft"}, {"id": 1614, "start": 9934.1, "end": 9936.1, "text": "kann es nicht gebacken"}, {"id": 1615, "start": 9936.1, "end": 9938.1, "text": "du hast natürlich immer noch die Auswahl Qt"}, {"id": 1616, "start": 9938.1, "end": 9940.1, "text": "und C++ zu verwenden aber mal ganz"}, {"id": 1617, "start": 9940.1, "end": 9942.1, "text": "im Ernst"}, {"id": 1618, "start": 9942.1, "end": 9944.1, "text": "das ist ja noch schlimmer"}, {"id": 1619, "start": 9944.1, "end": 9946.1, "text": "also Qt ich"}, {"id": 1620, "start": 9946.1, "end": 9948.1, "text": "ich mag Qt als Framework"}, {"id": 1621, "start": 9948.1, "end": 9950.1, "text": "aber C++ ich weiß dass es Python"}, {"id": 1622, "start": 9950.1, "end": 9952.1, "text": "Bindings gibt aber da hast du andere Sorgen"}, {"id": 1623, "start": 9952.1, "end": 9954.1, "text": "dann wieder"}, {"id": 1624, "start": 9954.1, "end": 9956.1, "text": "ähm"}, {"id": 1625, "start": 9956.1, "end": 9958.1, "text": "und ich glaube"}, {"id": 1626, "start": 9958.1, "end": 9960.1, "text": "für wirklich Erweiterung brauchst du"}, {"id": 1627, "start": 9964.1, "end": 9966.1, "text": "ähm wie ist das"}, {"id": 1628, "start": 9968.1, "end": 9970.1, "text": "wir haben noch letztens einen Chat der uns"}, {"id": 1629, "start": 9970.1, "end": 9972.1, "text": "sogar seine Android App"}, {"id": 1630, "start": 9972.1, "end": 9974.1, "text": "gezeigt hat die in"}, {"id": 1631, "start": 9974.1, "end": 9976.1, "text": "war das war das"}, {"id": 1632, "start": 9976.1, "end": 9978.1, "text": "Godo spricht man"}, {"id": 1633, "start": 9978.1, "end": 9980.1, "text": "glaube ich aus"}, {"id": 1634, "start": 9980.1, "end": 9982.1, "text": "Godot"}, {"id": 1635, "start": 9982.1, "end": 9984.1, "text": "war das glaube ich ich bin mir immer ganz sicher"}, {"id": 1636, "start": 9984.1, "end": 9986.1, "text": "der hat äh"}, {"id": 1637, "start": 9986.1, "end": 9988.1, "text": "ne Android der Cross Plattform GUI App"}, {"id": 1638, "start": 9988.1, "end": 9990.1, "text": "gemacht in der Game Engine und als letzten"}, {"id": 1639, "start": 9990.1, "end": 9992.1, "text": "sogar den den Android"}, {"id": 1640, "start": 9992.1, "end": 9994.1, "text": "Store Link dazu geschickt im Chat"}, {"id": 1641, "start": 10000.1, "end": 10002.1, "text": "ja"}, {"id": 1642, "start": 10002.1, "end": 10004.1, "text": "ja kann ich auch verstehen warum die das machen"}, {"id": 1643, "start": 10004.1, "end": 10006.1, "text": "weil die ganzen Cross GUI Plattform Framework"}, {"id": 1644, "start": 10006.1, "end": 10010.1, "text": "sind"}, {"id": 1645, "start": 10010.1, "end": 10012.1, "text": "äh"}, {"id": 1646, "start": 10022.1, "end": 10024.1, "text": "ah was leute so"}, {"id": 1647, "start": 10024.1, "end": 10026.1, "text": "21.35"}, {"id": 1648, "start": 10026.1, "end": 10036.1, "text": "jetzt off"}, {"id": 1649, "start": 10036.1, "end": 10038.1, "text": "fahrts gut"}, {"id": 1650, "start": 10040.1, "end": 10042.1, "text": "jetzt"}, {"id": 1651, "start": 10042.1, "end": 10044.1, "text": "machen noch"}, {"id": 1652, "start": 10044.1, "end": 10046.1, "text": "Outro Musik"}, {"id": 1653, "start": 10048.1, "end": 10050.1, "text": "wir sehen uns leute bis denn"}, {"id": 1654, "start": 10050.1, "end": 10056.1, "text": "Outro Musik"}, {"id": 1655, "start": 10080.1, "end": 10086.1, "text": "Outro Musik"}, {"id": 1656, "start": 10086.1, "end": 10092.1, "text": "Outro Musik"}, {"id": 1657, "start": 10092.1, "end": 10098.1, "text": "Outro Musik"}, {"id": 1658, "start": 10098.1, "end": 10104.1, "text": "Outro Musik"}, {"id": 1659, "start": 10104.1, "end": 10112.1, "text": "Outro Musik"}, {"id": 1660, "start": 10112.1, "end": 10120.1, "text": "Outro Musik"}, {"id": 1661, "start": 10120.1, "end": 10128.1, "text": "Outro Musik"}, {"id": 1662, "start": 10128.1, "end": 10136.1, "text": "Outro Musik"}, {"id": 1663, "start": 10136.1, "end": 10144.1, "text": "Outro Musik"}, {"id": 1664, "start": 10144.1, "end": 10152.1, "text": "Outro Musik"}, {"id": 1665, "start": 10152.1, "end": 10160.1, "text": "Outro Musik"}, {"id": 1666, "start": 10160.1, "end": 10168.1, "text": "Outro Musik"}, {"id": 1667, "start": 10168.1, "end": 10182.1, "text": "Outro Musik"}]}