{"text": "Und in discouraged. So auf gehts, oh mal gucken ob ich Teams schon gefixt habe. Long have we waited now which ye baited, genau, äh, wo ist es denn? Hab ich Teams schon gefixt? Ah ja, ich hab Teams heute Morgen zur Aufnahme schon gefixt. Ich hab übrigens noch ein Video aufgenommen heute, wer es noch nicht gesehen hat, ich zeig's nochmal schnell. Und zwar, aber nicht bei mir auf dem Channel, sondern mit jemand anderem zusammen, nämlich, wo ist es? Da! Also, wenn ihr nachher nichts zu tun habt, nein, das bin ich ich, ich hab mich nicht geleakt oder so, man weiß das. Die Leute sind ja immer da relativ, äh, sag ich, am Start mit so Zeug. Genau, mit ihm hab ich zusammen ein Video aufgenommen, er hat bloß um die drei K-Abos, lohnt sich auf jeden Fall mal vorbei zu gucken, der macht ganz gute Videos. Da hat mich angeschrieben per Mail, ob wir nicht was aufnehmen wollen, ich hab mir gedacht, ja, warum nicht, ja, kann man ja mal machen. Und, ähm, ja, da gibt's zwanzig Minuten Video zu diesem Thema, wenn das interessiert. Excellent, excellent. Poggers, Alter. Dreitsatz Subscribed für 17 Monate, Alter. Massive Subscription. Hyper Subscription, wo ist es denn? Casey auch am Start, acht Monate, danke schön für die ganzen Subs, Leute. Und Josef T. auch am Start, Poggers, nice, danke schön für die ganzen Subs. Ich merk das, wenn ich länger nicht gestreamt hab, komm immer auf einen Schlag ganz viele Subs, aber insgesamt ist es doch weniger. Also man sieht schon, das zahlt sich, also gerade auf Twitch, das zahlt sich richtig gut aus, wenn man oft streamt, ne. Also ich hab, ich hab, keine Ahnung, doppelt so viele Abos, wenn ich viel streame, zu jetzt. Aber gut, man sagt, klar, warum sollte man subscriben, wenn's kein Content gibt, würde ich auch nicht machen. So, Tains auch am Start. 20 Monate, meine Güte, ey. Der Scam Train ist auch am Start. Bin ich eigentlich der Einzige, der findet, dass Komodo Hype kein guter PogChamp-Ersatz ist? Ich finde, es hat beide seine Berechtigung gehabt. So, kann man's saft zur Seite stellen, weil sonst schmeiß ich's runter. Der Komodo ist scheiße, ja ich mag den auch nicht, ich hab das Original auch nie verwendet, den gab's ja vorher schon. Den gab's ja vorher auch schon, jetzt ist es einfach doppelt, das ist ja irgendwie auch dumm, oder? Ich glaube, das ist ein bisschen zu kompliziert für ein Video. Wobei, so schwierig ist das gar nicht. Aber gucken, ich kann, ich kann so Videos auf YouTube nicht total übertreiben. Da sind ja auch viele Leute, die so voller Technik nicht so großartig Ahnung haben. Exzellent, exzellent. Sollen wir mal kurz durchscrollen, also, wen haben wir hier am Start? Casey ist da, der Kampf Kevin, der Sampler. Pri, Zerif ist am Start, der Florian, Joseph T., John, 96, ne, 69. Ich dachte jetzt eher als Geburtsjahr, aber nein, das ist der John, 69 ist das. Nick, guck mal, der Patrick ist auch am Start, Ecky, Matrix, Hopp, Meiert. Mr. Ami auch mal wieder da, nice, haben sie dich wieder heimgelassen, ja? Ja, machen wir, machen wir. Vielleicht nicht ganz Amazon, aber fast. Und der Rest auch alles am Start, nice, dass ihr da seid, dass ihr da seid, Poggers. Wer war das? Ach, das war der Pogchamp, tut. Siehst du mal, ich weiß gar nicht mehr, wie das, wie der Typ heißt. Mir sind dem seine, mir sind dem seine Ansichten vollkommen egal. Ich fand das Pogchamp-Emote geil. Warum das Stream buffert? Weil, weil du in Deutschland wohnst wahrscheinlich. Weil wir wissen ja, dass wir eigentlich bis 2080 50 Ambit für alle haben. Also, ich glaube, das ist das. Ich glaube, das ist das. Weil wir wissen ja, dass wir eigentlich bis 2080 50 Ambit für alle haben. Also, wer jetzt noch keine 50 Ambit hat, der ist einfach noch nicht 2018. Was wird gekauft? Alles Mögliche. Ich habe mir ein paar Sachen aufgeschrieben, wo ich mal gucken will. Ja, habe ich gesehen, das wird dem Fax mal lustig. Weil ich an sich sagen muss, finde ich Birma mal nicht übermäßig lustig. Aber das mit dem Fax war lustig. Und er hat ja auch recht. Ich habe irgendwo ein Wahlplakat gesehen von der CDU, wo drauf stand irgendwie Glasfaser für alle. Und da war ein AR-45-Stecker drauf. Ich habe auch gedacht, das sieht meistens kein Glasfaser-Stecker aus. Ja, genau. Man kann sich das einfach einreden. Das ist genauso wie die Leute, die dann erzählen, sie haben Wi-Fi 6 und 50 Billionen Gigabit. Und mit 5G wird es jetzt auch ultra schnell und sonst was. Und praktisch gesehen kommt da kaum was an. Weil Wände dazwischen sind, weil schlechter Empfang, was auch immer. Wobei man halt echt sagen muss, schnelles Internet geht ja auch über Kupfer. So ist das nicht. Es ist nur die Frage, wie weit die Gegenstelle entfernt sein kann. Also man kann ohne Probleme ja auch 10G machen über Kupfer. So um die 100 Meter lang oder so in dem Dreh. Ist übrigens ein guter Punkt, damit können wir anfangen. Aber ich habe hier den Switch, das habt ihr wahrscheinlich fair geguckt. Habt ihr im letzten Video gesehen, der Switch ist immer noch am Start. Guckt hier, Serverraum-Video, der Switch, der ist immer noch da. Die Kabelpolizei ist wieder unterwegs hier. Da oben ist der Switch. Und man sieht vielleicht schon das Problem, was ich bei dem Switch habe. Keg-Waite, genau. Das Problem ist, ich habe 12 Ports SFP plus Glasfaser-Ports. Das Problem ist, ich brauche aber eigentlich noch mal 4 AY-45-Ports zusätzlich. Die meisten Sachen davon 1G. So und ich habe jetzt zur Auswahl richtige Burgas-Hose. Manche andere fanden die Hose echt cringe. Danke schön für das Subgift. Ich kann nicht mehr reden, Leute. Ihr wisst, was ich meine. Sehr nice, Burgas. Kann man nur zu sagen. Deswegen habe ich mir gedacht, anstatt dass ich so einen komischen Switch da oben drauf stelle. Der ist ja eh für mal ein Schreibtisch hier, der da steht. Keg-Waite. Der da. Ich kaufe mir einfach noch 4 normale SFP-Module AY-45. Die sind nicht so teuer und nehme einfach 4 Ports davon, weil 12 SFP plus 10G-Ports brauche ich nie im Leben. Deswegen gehe ich jetzt einfach mal gucken, mit was das Ding kompatibel ist, laut Hersteller. Und dann mache ich normale Module rein, die sind billiger. Schon mal mit Grafana rumgespielt. Ach ja, wo wir gerade beim Thema Grafana sind, habe ich euch schon mal das Dashboard für meine Heizung gezeigt. Das ist auch in Grafana gemacht. Da sieht man die Temperatur von der Heizung. Man sieht den Fehlerstatus, wie warm der Kessel aktuell ist. Ob der Brenner an ist, wie warm die Abgase sind und ob die Pumpe gerade pumpt. Richtig exzellent. Exquisite. Grafana vom Preis-Champ. Die kann ich auch zeigen, ja. Grafana vom Preis-Champ kann ich auch zeigen, da muss ich mal nur was gucken, nicht dass ich die IP leake. Wird ja irgendwelche Leute sinnlos dedossen. Nee, ich kann Grafana vom Preis-Champ nicht zeigen. Ich habe die IP drin, die will ich nicht leaken. 3060, ich habe noch keine Links von deutschen Shops für die 3060. Gebt deine Heizung die ganzen Werte aus oder hast du die Sensor selbst verbaut? Das gibt die Heizung aus. Die Heizung ist über ein offizielles OptoLink, heißt das, Kabel vom Hersteller. Ist das angeschlossen. Das sind im Prinzip zwei Infrarot-LEDs vorne an dem Kabel dran. Und das habe ich dann per USB und Raspberry Pi gemacht. Da gibt es eine Custom Software, die das Ganze auslesen kann. Es ist ein bisschen komplizierter, aber es funktioniert gut. Es funktioniert echt super. Das haben wir auch zusammen im Stream gebaut. Hello, Datasheet. 16XG SFP Module Compatibility. Zeigst du mir, mit was sind die kompatibel? Im Zweifelsfall gehen wahrscheinlich alle. Ja, SFP ist Glasfaser, aber es gibt ja SFP zu AIO45 Modulen. Gerade am Anfang hatte der Switch richtig, also der hatte massive Probleme, als er neu war mit Modulen. Da ist auch das Forum voller Geflame zu. Mittlerweile mit der aktuellen Firma geht es wahrscheinlich besser. Also was frisst denn der, die offiziellen? Die offiziellen? Was kosten so eins, zeig mal her. Guck mal bei Amazon, Alter. Ja, das ist die nächste Option. Ich könnte einen zweiten Switch reinstellen mit 8 oder 24 G-Ports. Allerdings... Wozu? Wenn man es einfach auch so lösen kann. Wenn es nicht zu teuer ist, ja. Natürlich wäre es billiger, einen TP-Link-Switch reinzustellen von 15 Euro. Aber naja, mal gucken. Was kosten die bei Amazon? 18. Das geht bestimmt billiger. Das geht bestimmt billiger. Das sind doch nicht mal die offiziellen. Ist das die offiziellen? 18. Hätte ich jetzt gedacht, dass es billiger geht? FSCOM. FSCOM habe ich das letzte Mal geguckt. Ich hatte von denen noch nie was. Taugt das? Ich habe es noch nie ausprobiert. Da hinten ist nichts. Hier hinten ist nichts. Hier hinten ist nichts. Also, zeig mal her. Was muss ich denn da suchen? Äh. Moment, das ist das Falsche. Das ist falsch, ich höll's nicht vor 10km. Ach was muss ich denn da suchen, dass das passt? 10km, 10km, alter 40km, alles klar, alles perfekt. Ok, guck mal mal, SFP, Transceiver, ne Optische, Optische ist, na doch Optische, stimmt, genau. 17€, ok. Ja, da machste nix. Machtste preislich hier einen Unterschied, ne? So was hier brauch ich. 100m, 100m, was ist hier der Unterschied, ist doch genau das gleiche, oder? Wo, wo ist hier der Unterschied? Das macht 10, 100, 1000, ich würde jetzt auch davon ausmachen, dass das 100 macht. Das ist nur 1G, jaja, reicht mir ja auch. Ähm, die 10G ist ja einfach viel zu teuer, an die Ports kommen eh nur 1G Sachen dran. Ja, da kommt der Raspberry Pi von unten und der Access Point von unten aus dem Erdgeschoss dran. Da kommt drüben, äh, gegenüber der... Beide müsste ich eigentlich gar nicht da anschließen, den könnt ihr aber am Switch hier anschließen, der fürs Fernseh das Ding. Was sind das alles für 30.000 verschiedene, unterschiedliche Dinger? MGPT1, GL... Ich hab legit keinen Plus und Schimmer, was der Unterschied dazwischen ist. Sieht alles gleich aus. Sieht alles gleich aus, äh. Aber ist... Aber ist tatsächlich egal, macht preislich keinen Unterschied. Was es ist, das ist ein Modul für ein Switch. Guck hier, das ist der Switch, den ich hab, der hat ja solche Ports und Kupfer. Und, ähm, ich brauch noch vier weitere, äh, R- und 45-Stecker. Ein G reicht, und dann wollt ich gucken, was so das Billigste ist. Was sagt... Kann man sowas auf Guides halt suchen, sowas haben die doch nie im Leben drin, oder, oder? Äh, nein, nein. Wisst ihr was, mir gehen Seiten. Kennt ihr das, ihr geht auf eine Seite. Und dann klickt ihr auf was, und in dem Moment, wo ihr klickt, springt das weg, weil die Seite grad weitergeladen hat. Das ist nervig. Ach guck mal, hier gibt's das für 13 Euro? Da kommen wir doch schon der Sache näher. Auf Preis aufsteigend. Exzellent, exzellent. Ah ja, genau, 2.9.30, dann nehm ich mal einen 100er-Pack. 2.5.0.7, morgen auch mal wieder am Start. Dazu kann ich bloß sagen. Aber immer schön am Discord spammen. War mein Factory, 13 Euro. Das können wir tatsächlich machen. Das ist das offizielle Modul von denen, eine bessere Kombination gibt's doch eigentlich nicht. Was sagt die Google-Suche dazu? Ja ne, das ist doch top. Jo. 13.29, ach gut, bei mein Factory kostet immer Versand, ne? Bei mein Factory kostet immer Versand. Was? 9 fucking Euro? Was zur... Alter, was sind das für Versandkosten? Ich hab lang nicht so bei mein Factory verstanden, aber dafür kann ich ja dreimal aus China bestellen. Ist echt so? Ich kann für den Preis dreimal aus China bestellen. Ja, Midnight Shopping. Ich will nicht Midnight shoppen, ich will jetzt shoppen. Was ist denn da los? Ja, da bringt's mir auch nichts, dass das so billig ist. Ich mein, dass sich der Versand da irgendwie lohnt, da müsste ich ja 5 Stück ka... Nein. What? Can't wait. Ich wollte... Okay, jetzt ist die Frage. Ist der Shop zu dumm oder ist der Shop zu dumm? Ha, ich hab's geschafft, excellent. Okay, 5 Stück, bam. Lass mich mal gucken. She baited! Okay, mein Factory ist too smart für mich. Ja das lohnt sich nicht, guck mal, das kostet 53 Euro und nochmal 9 Euro Versand, bei Amazon hat der Kram glaube ich 17 Euro gekostet, äh, alter dieser Windows Taschenrechner ist so ein hässliches Stück Software, oh, das lohnt sich auch sogar mit Versand, ja, ich werde es mir aber trotzdem mal bei Amazon in Account legen, weil ich das sonst vergesse nachher, ich kann ja nicht von hier bestellen, ok, es ist da bis Mittwoch, wie schnell ist ein MineFactory mit Versand, aber MineFactory war bloß 3 Stück verfügbar, Fastest bis 2. März, ok, oh kluge, der Name ist so, ich glaube bei dem habe ich sogar mal irgendwann schon was bestellt, aber sieht immer so, so Scam aus, ist es nicht, aber, na komm, also bei denen habe ich schon mal was bestellt, bei denen habe ich auch schon mal was bestellt, waren das nicht, waren das nicht die denen, ok komm Bam, einfach adden, einfach adden, Scheiß drauf, was habe ich da noch drin, oh was habe ich hier noch vom letzten Mal, brauche ich da noch mehr, brauche ich da noch mehr, brauche ich da noch mehr, exzellent und den habe ich schon, den brauche ich da noch mehr, also zack 5 Stück, in your face, Bam, 100 Euro, so ging es gut, weiter gehts, so, kann man das ganze schon mal abhaken, äh, nochmal die Farbe nach dem bestellen, nee die sind nice, ich habe noch nicht alles gegessen, also ich habe ja hier, ich habe mal hier so ein Probierpaket bestellt, bei denen glaube ich, genau, Leute, die schlimmste Webseite, also wer die gebaut hat weiß ich nicht, das ist irgendein italienisches Weingut, was Versandhandel hat und ich habe mir da so ein Probierpaket bestellt, Nudeln und Soßen, echt gut, ja wirklich gut, die Soßen braucht man jetzt bis auf die 2 Pestos nicht unbedingt, muss man ehrlich sagen, Tomatensoße kriege ich auch hin, die brauche ich nicht von denen, aber die Webseite, Alter, die Webseite, versucht mal überhaupt den Online Shop zu finden bei denen, das ist hier oben, so, und jetzt hört schon mal auf, wo waren jetzt die Probierpakete, ähm, achja, achja, exzellent, Probier, Probierpakete für Pasta, genau, das habe ich bestellt, das da, exquisite, ne, das nicht, das da, das habe ich bestellt, richtig, richtig nice, Peppofett, das ist, das ist, das ist, ASP Classic, wer macht denn sowas, ja gut, so sieht die Seite ja auch aus, gut, auf der anderen Seite mal ganz ehrlich, die müssen Essen machen, ob die, ob die jetzt Webseiten machen können ist mir eigentlich egal, allerdings habe ich bei solchen Seiten immer Bedenken, nicht dass da mal einer die Kundendaten abzieht, weil es total unsicher ist vielleicht, oder so, Flo96, ja, aber die sind besser, da ist jede Wix-Webseite besser, ja, das sind übrigens so Sachen, denen würde ich eindeutig empfehlen, sie sollen sich irgendwie einen Shopify, was gibt es noch, Shopware, was auch immer, einfach einen Shop da drüber machen und sich um nichts Gedanken machen, easy, vix.com, ja, können sie auch, kennt jemand, kennt jemand, ähm, ach, wie war das, node.js, Github, Key, Keystone, taugt das, taugt das was, kennt das jemand, ich hab letztens ein Video gesehen, da hat einer eine Webseite mit der Sache als, da hat einen Shop gebaut mit der Sache als Backend, das ist eigentlich ganz nice aus, ja, also wie gesagt, das hatte ich mir bestellt, das ist jetzt angekommen, man kriegt viermal Nudeln, viermal Soßen und das Gute ist, die Nudeln sind eine komplett andere, äh, wie soll ich sagen, viel, viel, ähm, schwerer so als die Lidl-Nudeln, ja, also sprich, hier, ich weiß nicht, wie man das ausspricht, Fusilli, Fusilli, wie auch immer, wenn du davon ein paar isst, dann bist du richtig satt den ganzen Tag, wenn du die Nidl, die, die, die, die, was, Nidl, Nidl, wenn du Nidl-Dinger futterst, die sind nicht Vollkorn, ne, das sind keine Vollkorn, das ist Dinkel, ach, frag mich, das steht doch irgendwo dabei, ach, die Seite, die Seite ist so schlecht, wie, ach, hier kriegt man die Details, genau, hier, äh, hat mal jetzt, hat, ne, das da, ach doch, doch Vollkorn, genau, ähm, normalerweise, normalerweise bin ich kein großer Vollkorn-Fan, aber die schmecken echt gut und auch die normalen, auch die normalen, die sind, ähm, wirklich viel, viel gehaltvoller, also wenn du da einen Teller oder zwei futterst, da bist du echt, da bist du nicht nur pepofett, da bist du auch pepo-satt, ja, und wenn, und, und wenn ihr es voll übertreiben wollt, dann bestellt, dann bestellt das große Fest beginnt, Alter, allerdings würde ich das nicht bestellen, weil ich bin kein großer Weintrinker und da sind halt irgendwie einfach mal sechs Flaschen Wein dabei, ich bin nur auf das andere Zeug scharf, der Wein interessiert mich überhaupt nicht, der kleine Toskana, ja, zu viel, viel zu viel Wein, Alter, okay, das ist ein Weingut, es ist kein Wunder, dass die Wein verkaufen, aber es ist wirklich, also es schmeckt echt gut, kann man auf jeden Fall empfehlen, Biertrinker, nö, auch nicht, weder Wein noch Bier, ich trinke eigentlich so gut wie gar nix, das eigentliche, das einzige, was ich ab und zu mal trinke, also ich bin jetzt auch niemand, der so, so fast schon klaumsmäßig sagt, äh, kein Tropfen Alkohol oder so, aber das einzige, was ich trinke, ist vielleicht mal irgendwas an Silvester oder Weihnachten bisschen, aber das ist auch nicht viel, auch kein Wodka, Wodka schmeckt mir gar nicht, als Kokomodts Anzeige ist raus, aber, nö, einzige, was mir schmeckt, ist Whisky, wenn es ein Gescheiter ist, aber dann auch nicht mit Rauch, der so nach Zahnarzt schmeckt, sondern, äh, so, normalen, oh, excellent, das ist schon gut, ey, das ist, Moment, das ist bei denen im Shop, Moment, ey, ernsthaft, bei denen im Shop ist es am billigsten von allen, okay, nice, äh, was ist mit den Shops heute los? Haben die heute alle keinen Bock zu funktionieren, oder was, what, what, okay, ist vorbei, Leute, der Shop ist, der Shop ist RIP, keine Ahnung, was der macht, 13 mit Steuern, das ist durchaus in Ordnung, das hat es bei den anderen ja mehr gekostet, was kostet denn der Versand, Free Express Shipping for orders over, okay Leute, wisst ihr, was wir machen, okay, wir gucken mal, was das Shipping kostet, ich bestell mir noch ein Access Point dabei, lul, weh, dann komm ich über 120 Euro, ich hasse es, ich hasse es einfach so, wenn man sich einloggen muss, dass man den Versand sieht, das ist so eklig, FAQ, in FAQ steht jetzt okay, aber trotzdem, sucked, alter, massive sucked, Shipping, ähm, in Prag sind sie am Start an, Savote, das kenne ich, das ist eine Map, das ist die Fabrik Map aus Battlefield 4, aber mehr kenne ich davon nicht, das heißt bestimmt sowas wie Industriegebiet oder sowas, okay, was kostet das Shipping denn sonst, UPS, okay UPS, UPS war früher, hat übelst gesucked, weil sie Samstag nicht ausgeliefert haben, mittlerweile geht's, ja, was kostet es jetzt, Shipping is a small fee, small, man kann 3 mal aus China bestellen für den gleichen Preis, small, so small ist das alles, okay, also, dann sind wir einfach mal so, okay, wir machen, okay, das ist, ich muss für 120 Euro ohne Steuern bestellen, soll ich mir da alles bestellen, Wireless Products, okay, haben die, haben die schon den Wi-Fi 6 Access Point hier am Start, das wäre noch mal eine Idee, wie hieß das Ding noch mal, UniFi 6 oder so, Early Access, sehe ich das Early Access Hardware, ich meine, bei Spielen verstehe ich es ja noch, aber man kann es auch übertreiben, kaufst du den Early Access Switch und kannst es erst mal ein Jahr nicht verwenden, das ist auch geile, geile Taktik, ah, hier Access Points, warum genau sind Access Points nicht unter Wireless Products, was, was haben die sich da gedacht, also ich würde jetzt, ich würde jetzt Access Point ehrlich gesagt unter Wireless Products vermuten, ah, die Musik, hat es hier jemand gespielt, by the way, Ahead in Time, ja, ist richtig nice, ich habe es mir gekauft, ich habe es noch nicht gespielt, aber ich finde den Soundtrack schon mal nice, okay, haben die jetzt den, ah, hier, der, der, guck mal da, da, das ist, das ist der mit Wi-Fi 6, komm ich denn da jetzt über 120 Euro, ohne, ohne, ohne Tax, ja, sag mal, was ist denn heute mit den Shops los, ach nee, was, Null, ich musste mich da einloggen dafür, okay, aber, aber 80 und 55 ist über 120, das sind 125, nee, 135, das wird funktionieren, das ist nice, das kaufe ich mir, glaube ich, 90 Euro mehr ausgeben, um 12 Euro zu sparen, ja, eigentlich hast du recht, eigentlich ist bescheuert, eigentlich ist richtig dumm, warum mache ich das denn jetzt eigentlich, kann mir das jemand mal erklären, das ist, das ist richtig bescheuert, das ist die typische Sache von sinnlos Geld ausgeben, weil man denkt, man spart irgendwas, ich brauche kein Wi-Fi 6, ich habe nicht ein Gerät, was Wi-Fi 6 kann, oder kann mein iPhone Wi-Fi 6, Leute, ihr wisst das besser als ich, kann man, kann mein iPhone Wi-Fi 6, ich glaube nicht, ich habe ein iPhone XE, XR, XS oder so, ich habe kein Gerät, was das kann, was, USW Flex Mini, was ist denn das, nee, das brauche ich nicht, Switcher habe ich genug, 5 Port managt, Gigabit ist an der Switchport, kann er selbst PoE machen, stelle die Sachen bei Butcher, was für ein Ding, Butcher, achso, bei denen haben wir geguckt, die waren auch nicht billiger als bei Amazon, hatten wir doch geguckt hier, hier, da kostet sogar 19 Euro, guck mal, in den Chat so können wir nicht weiter, warum genau, warum genau soll ich, wenn 5 Ports damit machst du gar nichts, also, was genau, wozu ist er gut, kann er selbst PoE, nee, das ist nur Input, nee, 23, da kommen ja auch Steuern dabei, das kostet 27, was ist, geh über GH, schick mal den Link, ich habe keine Ahnung was du meinst, ja gut, aber ich will meinen Switch gerade nicht mit dem Unify Controller managen, ich muss euch ehrlich sagen ich bin eh kein großer Fan vom Unify Controller, nee, wir haben jetzt lange genug geguckt, ich bestelle die jetzt bei Amazon, entweder bestelle ich die mir hier und bestelle mir noch ein Access Point dabei oder bestelle die bei Amazon einfach, Transoflex, ja mit denen habe ich mal eine Antenne bestellt vor zig Jahren, kam irgendwann um 21.30 die Typen, achso, bei Guides halt, nee, bei Guides Hals haben wir geguckt und bei Guides Hals waren die, ach guck mal, ja Moment, aber da kommt da wieder Versand dabei, was haben die für Versand, 5 Stück, oh es gibt nur noch 2, und jetzt ist auch, die Dinger können sie wahr, also heute sind die Shopseiten echt alle gegen mich, ok 3,56 Euro Versand, das ist gut, das mal, ich habe keinen Bock ab 0 Uhr zu bestellen, ich will das jetzt bestellen, genau wir gehen auf den Preischamp und gucken, maximal 2, ok es ist unglaublich schwer heute Sachen zu bestellen, wisst ihr was, ich bleibe jetzt einfach bei Amazon, easy, ich bestelle mir 5 Stück und lecke mich, dann ist Ruhe, oder wenn ich das nicht mache, dann bestelle ich gleich hier, nee, aber die Switche brauche ich, also wenn schon, bestelle ich mir noch einen Axis Point dabei, easy, etwas kommen, da waren die auch nicht billiger, da haben sie glaube ich 19 Euro gekostet, Nano HD, hä, ich, Leute, ich checke das Pricing bei den Axis Points nicht so ganz, warum kostet der Nano HD einfach das doppelte von dem, von dem Lite Unify 6, hat er weniger Antennen oder, oder, oder was, oder wie, oder, ok, 2x2, Unify 6, dann hat er 2x2, 2x2 und der hat 4x4 und 2x2, ja gut aber auch, gut das ist wenn man, wenn man 50 Leute bei sich daheim hat, also ich habe aktuell, ich habe aktuell UAP Pro, das war das erste was ich mir gekauft habe von denen, da war ich echt zufrieden mit und da bin ich auch froh, dass ich den habe, nämlich da konnte ich an den zweiten Port noch den Raspberry Pi anschließen mit Unify Controller, was hast du für einen 3D Drucker, einen i3 Mega S habe ich seit 2 Jahren oder so, den habe ich, exellent und der ist by the way mittlerweile circa doppelt so teuer geworden, Moment das ist das falsche, das ist der falsche, Mega S und der ist auch teuer, ich habe den für 230 Euro damals gekauft, ja, hier, lol, warum ist der Kram so teuer, schon eine Waffe gedruckt, ich wüsste noch nicht mal wo ich dann wahrscheinlich das Ding über was, und da brauchst du ja immer noch ein Metalllauf, ne habe ich nicht, habe ich auch nicht vor, aber wenn man laut Boulevard Medien geht, dann sind 3D Drucker super gefährlich, weil die Leute sich damit ja Maschinenpistolen ausdrucken oder so was, so, also mal, wir sehen uns dann wieder, ich habe eine doppelte Steckdose gekauft an Weihnachten, die konnte sogar Stromverbrauch messen und die war echt nice, wenn ich die jetzt noch finde, die sahen so ähnlich aus wie die, Gesund hatte ich genau, Gesund, oder Gosund, da hatte ich die Zweier, wo ist denn das, wenn Gosund kein Corona mehr hat, heißen sie Gesund, Pains Champ, witz, ich weiß, rechts, ne, also ich weiß aber nicht ob man die noch flaschen kann, die gibt's überhaupt nicht mehr, what the fuck, also die hatte ich, ne, die gibt's anscheinend nicht mehr, so wie es aussieht und ist wahrscheinlich auch nicht mehr flashbar, ne, dann kann ich dir nix empfehlen, das ist bisschen das Problem, dass das China Zeug so inkonsistent ist, ja meine musste man auch löten, haben wir sogar im Stream gemacht, das löten, könnt ihr euch noch dran erinnern, das war der Stream, das muss ich euch mal zeigen, das war der Stream, wo ich die Steckdose fast auseinandergebrochen hab, Moment, Moment, das muss ich mir jetzt noch mal kurz schief angucken, warte mal, das war 2020 und es war wahrscheinlich im November, hier, hier, guck da, gleich verbiege ich, gleich verbiege ich, das Ding ist am Ende, wenn ich fertig bin mit der Steckdose ist das Ding 30 Grad gebogen, ach by the way und danach bin ich drauf gekommen, man muss das gar nicht aufbrechen, sondern man kann einfach vorne aufschrauben, da sind die Schrauben drunter Leute, da muss man einfach, ich hab's nachher hab ich es erst gecheckt, hier muss man einfach durchstechen mit dem Schraubenzieher und da kann man das auf, also nicht hier, sondern hier irgendwie so war das, da kann man es einfach aufschrauben, total easy und ich krieg, ich krieg es nicht auf, Alter, ich krieg es nicht auf, das ist nicht wichtig tun mit Schraubendreher und Schraubenzieher, das sind wir immer die Liebsten, ich krieg es einfach, guck mal, da hab ich's, guck mal, ich hab's offen, Poggers, guck's euch an, Moment, wo hab ich's aufgekriegt, hier, Moment, jetzt, jetzt volle Pulle Max, gib's ihm, gib's ihm, habt ihr die Ecke gesehen, guck mal die Ecke an, so und jetzt volle Pulle mit dem Schraub, auf, guck mal, das ist verbogen, und jetzt komm, ich weiß noch, ich hab das mit dem Werra Schraubenzieher gemacht und dann ging's auf, rohe Gewaltschamp, ja, volle, volle, volle, volle, jawoll, gib's ihm, auf, auf, gleiches Gehäuse kaputt, Alter, es mag jetzt jemand sagen, man sollte die Steckdose nach dieser Behandlung nicht mehr verwenden, aber warum nicht, ja, Achtung, Max, du schaffst's, ich weiß, dass es aufgeht, ich hab's, ich kann mich doch, Bäm, jetzt, es ist dann innen drin, da war es abgebrochen, guck, zack, jetzt hab ich's offen, so und dann haben wir es irgendwann, also so wie das ging, dann musste man dranlöten, dann musste man den Flesher, den Flesher dranlöten, ich hab einen Fünferpack oder so gekauft, ja, ich hab genug, dann haben wir den Flesher dran gelötet, irgendwie, na, ich musste gucken, wo man das anschließen muss, da haben wir gemessen, wo man anschließen muss und, ja, stream, please, okay, wir dürfen nicht mehr gucken, alles klar, ah, jetzt, naja, gut, was auch immer, ich wollte es mir bloß nochmal angucken, weil, da bin ich echt fast verzweifelt an der Geschichte, ja, okay, schauen wir mal schnell noch, Chat, also, weil, wie gesagt, kann ich hier gerade nichts sagen, wenn es die nicht mehr gibt und die sich nicht mehr flashen lassen, dann vorbei, wie gesagt, ich wasche die E3 mega S, so hab ich irgendwas übersehen, Mario, danke für den Sub, ah, überhaupt nicht aufgepasst, er, Tier 1 Subscription, massive, es ist, ich hab nicht mal eingeredet, Wi-Fi 6 kann da brauche ich kein Wi-Fi 6 access point Wegmachs Welchen hast du dir geholt den Den css 610 oder welchen switch Wie funktioniert sfp plus ports eigentlich warum sind die besser die sind nicht unbedingt besser Aber die hardware ist im 10 gigabit bereich günstiger Oliver 301 sagst du für den primes ab ich muss mal kurz gucken dass ich nicht wieder zig subs übersehen habe Doch habe ich silvi 2020 sieben vor sieben minuten aus subscrib dankeschön für den sub Exzellenz subscription Den haben wir dann sonst noch den super hacker super hecker Aber nicht hat nur gefollowed jebaited twitch aber folos sind auch nice Mario danke für den sub Kifken hat gesappt 16 monate das ist ja schon richtig hyper subscription Der ice freak 15 monate Nice killfell am start vier monate dankeschön Danto der dankeschön primes ab Massive k-gaming primes ab dankeschön jetzt geht es aber hier alles übersehen Vollkorn mishpro ist auch zwölf monate mit am start Nein, nicht wirklich falsch falsch falscher knopf Danke für den sub Ich glaube jetzt habe ich alles poggers nice ok Gut ich glaube ich habe ich alles als falschen was übersehen habe dann sagt bescheid Die so noch dinger kann man im zweifelsfall immer nehmen ja aber die so noch dinger sind ja Also die ursprünglichen so noch sind ja was wo du ein kabel durchschneiden musstest und reinklemmen die haben aber mittlerweile glaube ich auch steckdosen Aber dann würde ich mir lieber irgendeine fertig steckdose kaufen oder sowas Wie gesagt hätte ich machen sollen aber nachher ist man immer schlauer wie gesagt ich hätte mir auch 2000 um apple-aktien kaufen sollen Kann man ja kann man ja schlecht als maß stattnehmen was macht eigentlich der bitcoin kurs gerade so Geht wieder ein bisschen runter Dann wäre jetzt ja genau das richtige zum bitcoin kaufen Dazu kann ich bloß sagen Würdest du den raspberry pi nur an den access point anschließen oder auch über ein netzwerkswitch Das ist egal vollkommen egal Kannst du machen wie du willst macht keinen unterschied ich habe das am raspberry pi angeschlossen da muss ich unten kein switch mehr hinstellen Oh banger musik hier habe ich keine habe ich keine massive headbang musik oder sowas doch hier So weiter gehts also jetzt haben wir den kram endlich mal abgehakt ich bestelle mir einfach den kram bei amazon und gut ist Next So wo ist meine einkaufsliste weiter gehts Dann brauche ich hast du pokemonkarten ich finde diesen pokemonkarten trennt so unglaublich hängen geblieben Aber wer will solls machen Das ist lange herr das ist ja klar das lief das lief 1995 lief lief das auf auf mtv richtig Also weiter gehts Ich brauche ein set an rack schrauben und muttern und käfighalterungsdinger denn wie man hier sieht da müssen noch welche rein dass ich den server festschrauben kann Ja guck der server ist noch nicht festschraubt der hängt da so rum und ich habe hier noch ein paar schienen die sieht man hier glaube Ganz am Anfang sieht man die schienen da sieht man die schienen und ich will noch die schienen ins rack bauen dass ich den server ordentlich rein rausziehen kann Aber ich habe keine schrauben mehr deswegen gucken wir mal irgendwie da gibt es bestimmt irgendwie fertiges sets oder sowas sowas hier genau easy da Delikon Im Prinzip eh alles der gleiche der gleiche müll man könnte eigentlich wisst ihr was man machen könnte jetzt wo ich das gerade sehe Ich könnte schwarze schrauben nehmen dann würde es besser zum rack passen was meint ihr silberne schrauben oder schwarze schrauben Ich finde das mit dem silber gar nicht so schlecht weil die weil die anschlüsse auch silber sind Warum liegt das alles auf dem boden weil ich gerade das rack umbaue da ist die meiste sachen gar nicht angeschlossen und hier eigentlich die sachen sind auch noch teilweise gar nicht drinne Ja a big tech a big schrack ein kontrast ist ganz nice wisst ihr was wir einfach machen was heißt was wir ja doch was wir machen ist ja eigentlich schon in gewisser weise richtig Weil dadurch dass die leute wieder prime sub haben habe ich jetzt das geld und kann mir einfach beide schraubensets kaufen ich kaufe mir einfach das da und warum sind die warum kosten eigentlich das schwarze set warum kostet das eigentlich das doppelte Warum kostet das das doppelte black schrauben matters ach hier guck mal hier ist auch billiger exzellent exzellent da kaufen wir nämlich das ach so das sind nur 20 ach weil es mehr sind das ist ein 20er set Das hier ist ein 50er set aber hier kostet es 20 auch noch dann nehmen wir das dann nehmen wir einfach das gleiche dann nehmen wir einfach das gleiche einmal in silber und einmal in schwarz da habe ich genug zack perfekt abgehakt nächstes 100er set boah alter ein 100er set Ich hol mir kein 100er set ich geb wieder uns ich geb wieder viel zu viel Geld dann aus für sinnloses täuscht was ich ehren brauch ich brauch kein 100er set Das rack ist voll bis auf ein paar schrauben das reicht da hab ich noch genug bonus So next also abhaken So ich brauch ein teppich Ich brauch ein teppichmesser hab ich festgestellt Und zwar hier ist ja meine exquisite werkzeugswand im hintergrund zu sehen am anfang guckt euch das mal an hier Ist das nicht stylisch musst du dazugeben oder hat schon was oder Hat schon was Werra Werkzeug Flex Was denn das Ah das ist eine netzwerkdose für die wand Teppichmesser um in offenbach zu überleben genau Und mir ist aufgefallen beim öffnen von sachen und sonst wie manchmal kommste da mit der schere nicht geschaut durch Ja sowas habe ich schon ja ja Deswegen brauche ich habe mich letztens von denen ein richtig cooles messer gesehen Also kein kein haftbefehl bahnhof messer sondern was zum teppich schneiden Und das fand ich eigentlich ganz nice ich glaube es war das set hier aus dem normalen teppichmesser und aus dem da Ja das ist nice exquisite Bäm Kannst du mal wieder black ops einspielen ich habe es mir tatsächlich letztens überlegt ob ich nicht mal wieder anschmeißen soll Bestell noch ein paar esp ne esp habe ich mehr als genug da und pies habe ich auch grad nichts was ich irgendwie bräuchte So next progress machen leute Amazon progress Ja dann wollte ich mir doch tatsächlich noch also ihr wisst ja ich hatte die ganze zeit bei mir im wohnzimmer oben zum ausprobieren So ein zigbee nicht ganz sexy so ein zigbee thermostat Und zwar diese teile hier nicht von pearl pearl ist der größte crab laden aber so welche in dieser richtung hatte ich Und so cool die auf dem bild aussehen so china style und mist sind die dinge auch was kosten das was kosten der kram gerade bei banggood Ali express banggood immer noch bester seitenname zigbee nicht thermometer thermostat hallo thermostat Oh gibt es gar nichts Du hast dich bei pearl beworben wurde es abgelehnt aha warum Haben sie gesagt oder was war mit pearl los die wissen einfach nicht was sie verpassen hier So man kann die cute chat nicht einfach ablehnen soll das wie soll das funktionieren Also der kram kostet immer noch viel zu viel und man kann die jetzt auch einzeln bestellen Es gibt die gar nicht mehr zu kaufen guck mal Die gibt es alle nicht mehr Na gut ist ja auch egal aber diese dinge habe ich da aktuell dran so und Die sehen eigentlich auf den ersten blick ganz gut aus weil man denkt sich so normale heizungsthermostate Die dreht man ja auch und das ist bestimmt ganz cool wenn man quasi so dinge auch drehen kann So aber sie sehen cool aus sind aber richtig kacke mehrere punkte warum die nix taugen Ich war am anfang auch ein bisschen von der optik begeistert ich bin froh dass ich mir nicht mehr gekauft habe Das erste ist der batterieverbrauch ist für den arsch Die dinger sind nach drei monaten leer das ist der absolute witz Dann bin ich ja den ganzen tag im haus rumlaufen und jeden tag zeug batterienwechseln wenn das alles in diesem zeitraum leer geht Das nächste ist quatsch mit sauce sagt es ja schon bei ihm sind seine homematic dinger relativ laut Die dinger sind auch richtig laut wenn das wenn das die heizung regelt dann macht es dann Es schreckt sich die katz sogar so laut sind die wenn die da vor der heizung liegt Das ist schon mal müll dazu kommt dass die verarbeitungsqualität nicht gut ist das hat hinten einen verschlussmechanismus Der geht schon mal nicht richtig das display ist wenn man drauf drückt vorne was man muss man muss da drauf drücken Dass das display angeht und dann hat das display je nachdem wie man drückt so so matschflecken vom finger drauf drücken Wie es lcds auch haben ganz ganz also es ist müll es ist es ist echt es ist echt müll im endeffekt ja So cool die style ich auf dem bild außen sind die müll so und was ich jetzt habe ist der chat hat es auch schon Geschrieben ich habe mir jetzt hier von mal zum testen eins gekauft die rote pest aus berlin ist wieder am start Und zwar ein doch das gleiche oder Bloß bisschen andere optik Es sieht genau gleich aus Das kannst du aber nicht so einfach selber machen Deckt strahlung ich wüsste jetzt nicht dass deckt ob deckt strahlung irgendwas schlimmes macht Weil wenn deckt strahlung was schlimmes macht dann macht 5g sicherlich auch was schlimmes Deckt ist 1,9 gigahertz das ist so fast fast 10 gigahertz weniger als 5g Das ist so fast fast fast 10 gigahertz weniger als 5g Fast 10 gigahertz weniger als 5g Es kommt auf zwei sachen an einmal auf welcher frequenz das ganze ist Und danach noch welt was das ding für eine für eine leistung hat ja Also die frequenz ist wichtig ob das Quasi die zellen schädigen kann und die leistung ist wichtig ja wie warm es dann letztendlich wird Also wenn es warm macht Also sprich wenn du vor dem mikrowellen strahler stehst dann wird es warm Wobei das wobei das an anderen sachen liegt die mikrowellen machen das essen durch reibung warm Dann fangen die wassermoleküle an im essen zu schwingen und dadurch wird das essen warm Exzellent muss man jetzt ja mal sagen So also davon habe ich davon habe ich mir ein bestellt und auch wenn die relativ teuer sind Resonanz exquisite der chat ist wieder noch noch nur noch mal schlauer ja aber wir wissen ja jeder prime sub steigern den chat eq Kein wunder dass der chat so schlau ist mittlerweile Also davon habe ich jetzt eins im wohnzimmer da habe ich dieses das andere sick be thermostatic in ausgetauscht muss sagen Die sind echt nice Erstens ist das display das display ist zwar nicht so fancy wie das andere nicht farbig und sonst was aber das ist echt super Das ist echt super In so nem so nen sieht bisschen aus wie so nen ink display vor dem von diesem kinder kenn ich noch den alten kinder mit dem indisplay So ungefähr ist das display sprich das kann man super lesen also auch ohne beleuchtung auf dem display also ich sitze jetzt hier sehgen Auch schon 24 grad drauf perfekt So ungefähr ist das Display, sprich das kann man super lesen, also auch ohne Beleuchtung auf dem Display. Also ich sitze jetzt hier, ich sehe genau schon 24 Grad drauf, perfekt. Also die sind nice, die sind halt nicht ganz billig. Das zweite Problem bei den Dingern ist, die brauchen relativ lang bis sie Kommandos annehmen, was bei einer Heizung jetzt allerdings nicht so wichtig ist. Sprich, wenn ich eine Heizung habe, die geregelt ist, aber mit einem Heimautomatisierungssystem, ob die Heizung jetzt sofort oder mit 10 Minuten Verspätung das anmacht, ist nicht so wild. Zumal man ja auch immer noch direkt auf den Knopf drücken kann und dann wird es gleich warm. Und das müssen die machen zum Strom sparen, weil sonst, sprich wenn das permanent empfangen würde, würde es halt wahrscheinlich zu viel Strom brauchen. Ja und man braucht eine Fritzbox dafür, was aber kein Problem ist, weil wenn man ein Decktelefon daheim hat, hat man wahrscheinlich auch eine Fritzbox als Basisstation. Das ist übrigens der einzige Grund, warum ich eine Fritzbox habe, ich habe mir damals die billigste Fritzbox von allen gekauft, die hat sogar eine 100 MBit Anschlüsse gehabt, nur für VoIP. Also VoIP und 2 Decktelefone und jetzt halt die Thermostate dran und was halt auch ganz cool ist, dass ich mittlerweile das VoIP umgezogen habe, also muss ich euch vielleicht auch mal erzählen, also ich hatte ja immer das Problem beim Anbieterwechseln, wenn du dein Anbieter wechselst und sag mal von Telekom zu Unity Media zu Vodafone zu sonst was, dann musstest du dein Festnetz immer umziehen und das war immer so ein Gezitter, weil die Anbieter immer total unfähig waren, was Festnetznummern, Übergabe angeht und sowas. Irgendwann habe ich dann gesagt, Scheiß drauf und jetzt ist mein Telefon bei Easybell kostet 2,99 oder so im Monat, nein Telefone, ich gucke ja auch falsch, hier kostet 2,99 im Monat, passt. Wieso brauchst du Festnetze, ich brauche kein Festnetz, meine Mutter braucht Festnetze, die findet das ganz furchtbar essenziell, dass man Festnetze hat und deswegen Festnetze. Die will das haben, so und deswegen habe ich das umgezogen auf das hier und jetzt kann ich jederzeit Anbieterwechsel ohne, dass ich mir da Gedanken darum machen muss und was auch cool ist, mit dieser ganzen VoIP Geschichte, man kann jetzt auch unterwegs vom Handy dran gehen und das verwirrt die Leute immer, ja Kalf mache ich, ich wohne im ersten Stock, die wohne im Erdgeschoss, wir haben das Haus vom Opa geerbt und es gab entweder die Möglichkeit, ich verkaufe das, das wäre jetzt in der aktuellen Zeit echt ziemlich bescheuert gewesen, außerdem wollte ich das auch nicht verkaufen, die wollte es auch nicht verkaufen, also ohne Scheiß drauf ziehe ich einfach wieder ein, also bin ich ausgezogen und wohne jetzt im Haus vom Opa, im ehemaligen Haus vom Opa, das ist genau das ist, richtig genau das ist das Haus mit dem Fahrstuhl, richtig, der Fahrstuhl, OKS, ehm Haus, ehm Umzug, keine Ahnung wo man das, ich glaube Weiber unterm Dach hieß das, das Video, Moment, das hatte so einen dummen Titel, da habe ich die Bilder, da habe ich die Bilder vom Opa gezeigt wo, wo hier das da, no God, please no, no, no, NOOO, 3, 2, 1, kann es VLC einsch, mittlerweile easy, hallo Jungs und Ich zeige euch die Bilder nicht, das ist bestimmt Toss, also man sieht da nichts Schlimmes, man sieht die Bilder, die mein Opa gemalt hat, wo halt auch paar naggische Mädels drauf waren. Man erkennt aber eigentlich nichts, aber YouTube ist der Meinung, das ist Toss und das darf man nicht sehen. So und hier ist übrigens der Fahrstuhl, das ist eigentlich was ich euch zeigen wollte. Guck hier, so sah es damals aus, jetzt ist es so, das sieht jetzt ja komplett anders aus, jetzt ist es so, hier ist meine Küche drin, hier neben ist das Wohnzimmer, darum ist das Bad und hier geht es halt zum Dachboden hoch und da hatte der Opa so einen richtig abgedrehten Fahrstuhl gebaut. Man muss sich mal überlegen, das ist ja auch schon alt gewesen, man muss sich mal überlegen, der hat damals selber, ohne dass der Amazon Guides oder sonstiges, also dass er bei Amazon was kaufen konnte, sich Guides im Internet angucken konnte, hat er einen Fahrstuhl gebaut bei sich, ist schon nice. Das Problem bei dem Fahrstuhl ist nur, das war mittlerweile ein wenig abenteuerlich damit zu fahren und die Wärmeisolierung zum Dach war voll für'n Arsch mit dem Fahrstuhl. Es war permanent kalt, das hat keinen gejuckt, der hat das einfach gemacht, aber das war der Hauptgrund warum wir das weggemacht haben, du konntest das Ding nicht isolieren, also es war echt immer kalt in dem Haus, unter anderem deswegen und weil der Opa halt nicht richtig geheizt hat, aber selbst wenn du richtig geheizt hast, du hast es nicht warm gekriegt, das ist super. Pass mal auf, guck dich mal den Fahrstuhl an, da kommt da gleich runtergefahren der Fahrstuhl, das ist noch bevor alles renoviert wurde hier, sieht schon ein bisschen abenteuerlich aus oder, müsst ihr zugeben. Heute haben sie einen Baum hier gefällt, weil gerade einer sagt Arbeitsschutz, haben einen Baum gefällt, mit der Motor sehe ich, haben da auf dem Kran rumgestanden, mit der Motor sehe ich, ohne Schutzhelm, ohne Schutzhandschuhe, ohne Schutzschuhe, ohne alles, also ich hab nur noch gewartet bis ich einen Arm am Schneiden von denen, aber ist nix passiert. So guckt euch das mal an, da hast du diesen Knopf hier gehabt, da kannst du hochfahren, wie viel Kilo hat er, ich hab keine Ahnung, also er hat mich damals ausgehalten, also kann das schon, es ist alles an einem Seil, jaja, es ist alles, guck mal, das ist, das hängt nur da dran, nur da dran hängt der ganze Fahrstuhl, nur da dran. Das ist da übrigens oben eigentlich alles nicht mehr da, genau, da sind die Bilder vom Opa drin gewesen, ja hier sieht man nochmal der Motor, der irgendwie hier hinter der Wand war, und jetzt kann ich nicht weiter zeigen, weil jetzt kommen Bilder von gemalten nackischen Mädels. Da, das ist ja mittlerweile alles Toss, wobei das meiner Meinung nach eindeutig als Kunst durchgeht, aber man weiß ja nie. Was hat ein Opa beruflich gemacht, das ist ne gute Frage, was hat der eigentlich beruflich gemacht? Ich glaub der war, ne der war nicht Elektriker, der war sowas in der Richtung, irgendwie Anlagen, Mechaniker oder sowas, ich weiß es gar nicht genau, der hat, der hat irgendwie so Maschinelektronik Kram gemacht, so Maschinelektronik Krams in irgendeiner Fabrik, ich weiß nicht genau was der gemacht hat, wie das hieß, was der gelernt hat, keine Ahnung, ja nebenbei war er noch künstlerisch tätig und hat gemalt, jede Menge, haben wir noch alles, ja, ich hab keine Ahnung, weiß nicht wie das genau heißt, so weiter, weiter im Text, wie bin ich jetzt eigentlich da drauf gekommen, genau, so und deswegen, davon wollte ich mir jetzt noch ein paar holen, weil ich hab die eingebaut im Wohnzimmer und funktioniert gut, hat wenig, also verliert nicht so viel Batterie wie das andere und klappt gut, ja, ist echt nice, die brauchen ein paar Minuten bis es die Befehle erkennt von der Basisstation und, achja der Grund warum ich die genommen habe ist folgendes, es gibt ja eine Home Assistant Integration für Fritz Smart Home, ohne hätte ich es nicht genommen, ja, also sprich, man meldet das Ding zwar an, an der Fritzbox, aber die Steuerung macht man ganz normal über Home Assistant, das war wichtig, ich will da nichts in der Fritzbox machen müssen und ich will auch, das in meinen normalen Automatisierungen drin haben, ja, also zum Beispiel, dass es unter der Woche morgens acht angeht, am Wochenende um neun Uhr morgens an, dass es abends ausgeht, wenn der Fernseher ausgeht und solche Dinge, ja, Home Assistant ist eine Smart Home Lösung, die erlaubt, dass du ganz viele verschiedene Sachen miteinander integrierst, kostet nichts, ja, Open Source und jeder kann, kann es benutzen und dann rumbasteln, ein bisschen wie Open Hub, ja, nur kein Java, ja gut, das sind die Noobs, die nicht wissen, was sie machen sollen, guck, deswegen verwende ich die Software einfach gar nicht, easy, was die von Tado zeigt mal her, ich gucke mir das jetzt einfach mal an, Tado thermostat, über was geht das, ist das Zigbee, ist das, was ist das, über irgendwas müssen die doch funken, oder, also über was machen die ihre Kommunikation, ist das, sind die WLAN, ist das WLAN, müssen die ins WLAN, oder wie funktioniert das, straight into the cloud, ja, aber irgendwie müssen die in die cloud kommen, über WLAN, oder wie, oder was, WLAN, ich habe keine Ahnung, WIFI, aber die Leute finden das nicht so geil, mit SIM Karte, ja, aber Sönki, irgendwie muss doch das Thermostat kommunizieren können mit Home Assistant, da liegt kein Kabel zwischen dem Thermostat und Home Assistant, also über irgendwas muss der Home Assistant mit den Dingern kommunizieren, entweder ist es eine proprietäre Funkgeschichte, dass man eine Basisstation von denen braucht, oder es geht über WLAN, dann muss man jedes alte Thermostat anmelden, oder es geht über Zigbee, über SeaWave, oder über Deckt, über was auch immer, aber irgendwas braucht's ja, Brieftauben meinetwegen, ja, die Leute sind nicht so ganz zufrieden damit, abonamento obligator, okay, das heißt so viel, man muss ein Abo abschließen, alles klar, würde ich mal sagen, es ist nicht so beliebt, Leute, ist mir jetzt auch wurscht, weil ich werde mir jetzt einfach von den Fritz-Dingern noch zwei Stück kaufen, fertig, da weiß ich, dass die, was haben die sonst noch, was, Steckdosen brauch ich denn, die Dinger funktionieren gut, ich war ja selbst ein bisschen misstrauisch was Deckt angeht, aber letztendlich ist mir persönlich die Funk-Technologie fast egal, Hauptsache es funktioniert, und im Vergleich zu den Zigbee-Dingern, die ich davor hatte, funktionieren diese, die Fritz-Teile wirklich gut. So, next, abhaken, haben wir gekauft, zack, übrigens, hat einer von euch eine Ahnung, vielleicht kennt sich ja der eine oder andere damit aus, ich habe ein kleines Loch im Garagendach, so zwei Euro Durchmesser, gibt es da irgendwie fertigen Kleber oder irgendwie Spachtel-Zeug, was man da drüber schmieren kann und dann ist mir da zu, was Flex-Seal, das hält doch nie im Leben auf dem Dach, aber das hält doch nicht auf dem Dach, das bleibt doch auf dem Dach nicht kleben, das Dach ist dreckig und das Dach ist nicht eben, was, was stellt ihr her, irgendjemand hat gesagt stellt ihr her meint, Evertape, was, was ist das für ein Dach, ja so ein, so ein, so ein gewähltes Wellendach, so was, so was, so was ist das, fast best Dach, also, so wie ich das, das Alter einschätze von dem Ding, ist das wahrscheinlich am best Dach, wenn ich den Opa, ja das hat den Opa damals nicht interessiert, Flex-Paste, was zum, was ist Flex-Paste, mach mit deinem 3D-Drucker ein passförmiges Teil und dann mit Teerpappe von oben und unten, jetzt wird es aber advanced, ok, der Philip Swift erklärt uns das jetzt, die sind immer so happy, die sind in der Werbung immer so super glücklich das verwenden, verwenden zu dürfen, what the fuck, was guck ich mir da an, ok, ok, ok łaaa Das ist ein starker, flexibler Rubber. Er steigert sich und konzentriert sich. Flexpaste ist tolle Sache! Das ist viel Schaden! Die Werbung ist doch absichtlich auf so alte Oldschool-Werbesendungen gemacht, oder? Ey, das wär echt gut fürs Dach! Genau sowas bräuchte ich fürs Dach! In extreme heat, driving rain, or freezing cold, flexpaste keeps its hold. Flexpaste is perfect for projects, crafts and hobbies. Shape it, mold it, or paint it any color. With flexpaste, you can create just about anything you can imagine. And when insects or rodents are getting into your home, use flexpaste to seal up large holes to keep those unwanted pests out. Let the paste advance for you, or it won't dissolve or wash away. And it even works underwater. So you can apply flexpaste underwater, and it even dries underwater. And once flexpaste dries, it turns into a strong, flexible rubber. Storms and floods can destroy your home. You can push flexpaste deep into wet surfaces and hard to reach areas. Now it's easy to seal up windows and doors to help prevent flood damage. To show you the power of flexpaste... I took this chicken wire, bent, shaped and molded it, then covered it with only flexpaste, and created the world's first flexpaste rubber band. Now we can flexpaste seal up every hole in the chicken wire, but it creates a strong, watertight barrier that bends and stays flexible. And the inside is completely dry. You can get flexpaste and the entire flexseal family of products at flexsealproducts.com. Hi, Phil Swift here for Flex Tape, the super strong waterproof tape. That can instantly patch, bond, seal and repair. Flex Tape is no ordinary tape. Its triple thick adhesive virtually welds itself to the surface, instantly stopping the toughest leaks. Leaky pipes can cause major damage, but Flex Tape grips on tight and bonds in silicone. Plus, Flex Tape's powerful adhesive is so strong, it even works underwater. Now you can repair leaks in pools. Flex Tape is perfect for marine, campers and RVs. Flex Tape is super strong. And once it's on, it holds on tight. And for emergency auto repair, Flex Tape keeps its grip, even in toughest conditions. Big storms can cause big damage. Flex Tape comes super wide, so you can easily patch large holes. To show you the power of Flex Tape. Don't breathe this. I saw this boat in half. And repaired it with only Flex Tape. Not only does Flex Tape's powerful adhesive hold the boat together, but it creates a super strong watertight seal. So the inside is completely dry. So if that's not the advertising is so cacowna, it doesn't work anymore. Haftstarker Konstruktionsklebestoff. Evertape ist fast 1 zu 1 Flex Tape. Schlechte Bewertung bei Amazon. Totaler Müll, leider nicht unter Wasser anwendbar. Ja, genau dafür brauche ich das. Ohne Scheiß. Genau für sowas. Nur dass es bei mir nicht durchsichtig ist. Genau sowas brauche ich hier. Wie lange hält das? Ich meine, das ist draußen, da scheint Sonne drauf, da regnet es drauf. Wie lange hält denn das? Also das sollte meiner Meinung nach schon einmal gemacht und dann ist gut. Welches Material? Ich habe keine Ahnung. Das ist so 2 bis 3 Jahre. Nee, das ist zu wenig. Ich will, dass das dicht ist für die nächsten 20 Jahre. Absolut dicht. Na, mal gucken. Ich meine, was? Vielleicht dann doch die Paste. Vielleicht mache ich doch einfach ein Stück Holz drüber oder so. Das ist eine richtig gute Idee, der hält bestimmt. Also weiter geht's. Zeug bestellen. So, jetzt haben wir den Kram gekauft. Was sagt denn Amazon, wenn man sucht nach Dachlochdichtung? Bei Amazon weiß man immer, wenn man Amazon sucht. Sowas, sowas in der Richtung habe ich daheim. Selbst dem Silikon. Aber das ist fürs Dach, das hält da nicht richtig gut drauf. Dicht fix. Nee, ich will kein neues Dach kaufen. Das müsste ich dann einbauen. Ich will einfach irgendwas reinstopfen und dann ist gut. Wisst ihr was? Ich habe von der Katze, ich habe von der Katze habe ich noch 2, 3 große Gummiflummis. Die stopfe ich da einfach rein. Denn dicht fix. Was sind das für Namen, Alter? Was für ein Ding? Der Kommentator, das ist auch so ein komisches Kleb. Das geht doch auch garantiert nach ein paar Jahren kaputt in der Sonne unter Regen und allem Möglichen. Was sind das eigentlich für Namen immer? Sieger Wiegluff. Nimm viel Heißkleber. Ja, mit Heißkleber habe ich mir das auch schon überlegt, aber das geht auch mit der Zeit ab. Ab und kaputt wahrscheinlich. Sonnenlicht, Regen und alles, das glaube ich nicht so. Sieger Wiegluff klingt echt sehr comodate. Ich meine mit Heißkleber wäre gar keine so schlechte Idee. Leute, kann ich nicht einfach da irgendwie, nicht vom 3D Drucker, sondern ich nehme einfach irgendwie was, was ich da reinstecken kann und dann mache ich drum herum dicht mit Heißkleber. Wie gut hält Heißkleber über Jahre im Sonnenlicht und mit Regen und sowas? Wie gesagt, ich habe hier mein Raspberry Pi auf der Fensterbank festgeklebt mit Heißkleber. Richtig gut. Das ist echt kompliziert, ne? Was für ein Ding? Bitumenband. Es scheint mir doch echt äußerst komplex zu sein, ein kleines Loch im Dach zu fixen. Was ist das? Der Popstar. Das hält für immer. Exzellent. Bestimmt krebserregend. Das ist für Dachflaschen. Das ist doch gut. Ich will ja auch ein Loch im Dach fixen. Exzellent. Die zu verklebenden Flächen müssen Frost, Staub und Silikon frei sein. Nein, sind sie nicht. Ich habe Heißluft. So ein Heißluft-Ding bis 600 Grad. Bringt das was? Aber dann fängt das Dach an zu brennen. Okay, ich muss mich da mal informieren. Ich glaube, rein mit Chat kommen wir da nicht weit. Kaufen wir mal weiter ein. Ein Dach kann, klar kann das Dach brennen. Ich gehe nicht zum Dachdecker. Das ist ein Loch so groß wie ein 2-Euro-Stück. Das werde ich doch irgendwie noch dicht kriegen, wenn man nicht ein kleines Loch in seinem Garagendach hat. Max, was hast du für ein ZigBee-Interface in der Nutzung? Ich habe ein Konbi 2. Konbi 2. So ein Teil. Funktioniert super mit Home Assistant zusammen. Als Home Assistant Addon habe ich das hier. Der USB-Stick ist eigentlich vor M durchgereicht. Funktioniert wunderbar. Aber jetzt, nachdem ich ja das Thermostat ausgewechselt habe, habe ich nicht mehr so viel ZigBee-Sacht. Bleiben eigentlich nur ein paar Knöpfe übrig. Du hast dir den hier bestellt für Home Assistant. Ob die so geil sind, weiß ich nicht. Das sind glaube ich so China-Crap. Aber der Konbi ist auf jeden Fall nice. Stick, Stick. Der Home Assistant läuft nicht auf Raspberry Pi. Der Home Assistant läuft auf meiner Low-Power-Quad-Core-Intel-Geschichte in AVM. Mittlerweile in AVM, weil die selbst installierte Sachen nicht mehr gut supporten. Silikon, ok. Ich muss mir das mal in Ruhe angucken. Doch, ich habe es aktuell auf Docker laufen, aber das unterstützen die nicht mehr. Die unterstützen das nicht mehr. Ich habe es aktuell in einem selbst installierten Docker in AVM, aber die unterstützen das nicht mehr. Du kannst keine Home Assistant-Super-Wise-Installation mehr auf Docker machen, wenn du das Betriebssystem selbst verwaltest. Das unterstützen sie nicht mehr, da kriegst du laufend irgendwelche Warnungen. Du kannst natürlich Home Assistant noch in Docker installieren, aber dann kannst du die ganzen Add-ons nicht verwenden. Und das ist eigentlich eins der coolsten Sachen bei Home Assistant, dass es so viele fertige Add-ons gibt. Deswegen, ich habe jetzt eine AVM genommen. Einfach, dass offizielle Image truff und gut ist. Funktioniert auch wunderbar. Man kann das nicht mehr ordentlich im Docker laufen lassen, weil die checken zum Beispiel, was auf deinem Hostbetriebssystem für Pakete drauf sind, ob das supportende Konfiguration ist. Dann unterstützen sie nur Debian in einer ganz speziellen Variante. Und wenn die was erkennen, was Probleme machen könnte, dann warnt das vor dem Update und verweigert auch das Update und sowas ganz, ganz merkwürdiges Zeug. Und ich habe jetzt einfach das offizielle Image in der AVM und jetzt ist alles gut. Bisschen kacke, ja. Ich kann es aber verstehen, weil die haben bestimmt 30 Milliarden Supportanfragen gekriegt und es war gar nichts kaputt. Die Leute haben einfach nur ihr System verkonfiguriert. Und ja, das verstehe ich schon. So, also ich muss noch weiter was kaufen und klar. Und zwar, ich brauche für meinen Serverraum noch Folgendes. Ich habe euch ja hier oben, ich habe es mal irgendwo gesagt. Da, diese Boxen da. Von diesen Boxen will ich 4 Stück an die Wand machen. Was nutzt du, Proxmox oder ESX? Keines von beiden. Von diesen Boxen will ich ja hier an die Wand 4 Stück machen. Achtung, da, an die Wand. Gestern habe ich die erste Box dran geschraubt und ich habe ja so einen Tester, ob da Metall oder Stromleitungen hinter der Wand sind. Das Problem ist, dass hier überall Metall ist. Ich gehe mal davon aus, das liegt daran, weil sie diese Gipswände hier irgendwie festmachen muss und weil der Opa da Dinger gebaut hat. Und ich konnte nichts Freies finden hier, sodass ich 4 Kisten nebeneinander kriege. So, und was ich jetzt gemacht habe, ist, es ist wahrscheinlich komplett unfachmännisch. Ich habe jetzt einfach 3 Löcher gebohrt im Abstand von ein paar Zentimetern, bis ich durchgekommen bin. Oh nein, da habe ich dran gehängt. Sieht zwar nicht schön aus, aber hat funktioniert. Und mir ist mal aufgefallen, wie heiß so ein Bohrer wird, wenn man versucht durch Metall durchzubohren und es nicht geht. Ich habe das dran gehalten, dagegen gedrückt, hat nicht funktioniert. Da habe ich bestimmt eine halbe Minute rumgeeiert. Und als ich das rausgezogen habe, habe ich den Fehler gemacht, mal vorne ein bisschen auf den Bohrer zu greifen. Das war echt ordentlich heiß danach. Naja, so und deswegen brauche ich noch mindestens mal eine weitere Kiste davon. Ich will es gar nicht durchs Metall bohren. Kleinteile-Magazin. Warum heißt es eigentlich Kleinteile-Magazin? Das hört sich gewalttätig an. 36 mal 25, ne 36 mal 21, den habe ich. Und das hier ist 36 mal 15, ne das hat genau die gleichen Abmaße, oder? 15 cm tief ist das, 36 cm breit und 22 cm hoch. Venice, Venice ist Cheater und Venice, ich kann es mal kurz anmachen. Venice ist Cheater, verseucht, na wobei er geht, halbwegs, ist so viel schlimmer auch nicht. Das Problem ist, dass sie einen Memory Leak haben und das Spiel abkackt. Und deswegen spielt es keine, es ist komplett dead. Also es ist wirklich komplett RIP. Venice gerade, guckt euch das mal an. 18 von 110, ja nice poggers. Kannst du mal die Boxen verlinken, such einfach Stanley Kleinteile-Magazin. Nee keinen und ich brauche das für ein paar Euro da. So, oh das sind so Trennplatten, ja die werden auch nicht verkehrt. Ja Battlefield 6 soll ich am Battlefield 3 orientieren, das stimmt. Sagen sie. Also ich bestelle noch mal eins. Eins, dass ich das hier nehm, da eins und da eins. So das reicht dann erstmal, da kann ich ja noch ein paar Sachen oben drauf stellen. Perfekt, also abhaken, hab ich bestellt, poggers. Dann brauch ich noch eine Runde davon was? Nein, das ist der Soundtrack, wo hab ich mein Video hin? Genau, die Dinger, womit ich hier den Kram aufgehängt hab, die sind echt praktisch. Ich hab ja vergessen wie die Dinger heißen. Da wollte ich mir noch ein paar kaufen, weil da waren bloß 8 Stück drinne. Hab ich die irgendwo rumstehen? Treelancer, genau. Hier gibt es bestimmt total viele in der Richtung, aber das da, die sind wirklich praktisch gewesen. Ich hab alles schon verbraucht, davon wollte ich mir noch ein paar kaufen. Genau, nein, Non-Price-Deal, nervt nicht rum jetzt, Amazon, Amazon, Quirino, Twitch Prime, Dankeschön für den Sub, wo hab ich noch ein Prime-Sound? Excellent, IQ++ hier für den Chat. Mods mit WebUI, Memory Leak, ja das Problem ist, es spielt jetzt halt keiner mehr. Wir haben es so verschissen, werbungsmäßig und dass es keinen offiziellen Server gab. Es ist echt, war schön, solange es gehalten hat. Man hätte es sicherlich, ich hätte es gerne noch länger gehabt und man hätte es sicherlich auch einiges machen können, aber Pilz an der Rückendeckung von denen, die das programmieren. Super Mod an sich und auch coole Möglichkeiten, aber wie es halt so ist, Leute, die gut programmieren können, sind nicht so die besten Vermarkter und auch nicht so die Leute, die sich dann gut da in Spielereien versetzen können. Zumindest nicht alle, ja, also ein paar gibt es das, aber ja, es ist nicht so einfach. So, tja und dann, übrigens, es hat irgendjemand gefragt, was das für eine Werkzeugwand war, die ich in meinem Video gezeigt hab. Ich hab keine Ahnung, ob das der Hersteller ist oder ob das das Produkt ist, das war das Ding, was ich mir gekauft hab. Ich hab aber hier nur oben das Regal drauf, unten war mir das zu sehr im Weg und ich hab auch nicht alles von diesen Dingern verwendet, aber es war auf jeden Fall ein nicees System. Gibt es auch billiger hier? Muss man mal gucken, aber wie gesagt, ich hab dieses komplette Set da gekauft, also ohne Werkzeug, ja, das ist wahrscheinlich eh ziemlich ja crap, was man hier sieht. Aber, ist das ein Makita Akkuschrauber? Man erkennt es nicht so genau, von der Farbe her könnte es sein, oder? Na zumindest, das ist eigentlich ganz, ganz nett, ja. Ja, ja, das ist auch größer als man denkt hier auf dem Bild, man hat auf jeden Fall ordentlich Platz. Denkst du, dass es Updatebedarf bei deinem Video zu den besten Programmiersprachen für Einsteiger gibt? Ja, die beste Programmiersprache für Einsteiger finde ich ist eine ganz andere als die, die ich gesagt hab. Die, die ich gesagt hab, sind sicherlich nicht verkehrt zum Einsteigen, aber aktuell gibt es eigentlich meiner Meinung nach nur eine wirklich sinnvolle Sache, wenn man eh nicht schon weiß, was man machen will. Also wenn du jetzt sagst, ich will Linux Sachen machen, ich will Serveranwendungen machen, ich will Windows GUI machen, ok, dann kann ich einem was erfüllen, aber wenn man gar nichts weiß, was man machen will und einfach nur ein bisschen basteln will, HTML, CSS, JavaScript, fertig. Da siehst du nämlich gleich, was passiert. Und so die Basics, was so prinzipiell der Programmablauf abgeht und so, kannst du ja auch wunderbar JavaScript lernen, in JavaScript lernen. So, ja, und jetzt ist die Frage, ich, hier, also ich hab ja diese USB, von CyberPower. Und ich hab hier diese USB, von CyberPower. Ja, und jetzt ist die Frage, ich, hier, also ich hab ja diese USB, von CyberPower. Und bei mir ist die Batterie verreckt. Ich bin immer noch am überlegen, gibt es eine gute Lektüre C-Sharp für Anfänger? Ja, gibt's. Und zwar das da, also wenn du klassischerweise ein Buch lesen willst, dann das hier, aber nicht kaufen, sondern online lesen. Das Buch gibt's komplett online bis Kapitel 16. Inklusive 16. Ist das gut? Das Buch ist auf Deutsch, die meisten lesen immer noch am liebsten die Sachen auf Deutsch, einfach Native Sprache und so. Das da, inklusive Kapitel 16, Rest kannst du vergessen, brauchst du nicht. Von den Basics her ist das immer noch aktuell. Ja, XML kannst du überspringen. So, also. Genau, das ist ja die USB und die ist ja auch hier unten drin, da sieht man ja im Video irgendwo, wo ich es dann zeige. Hier, da ist die USB, guck da. So, und das erste, was mir in diesem Rack verreckt ist, ist tatsächlich die USB. Und so genau habe ich es ehrlich gesagt nicht kapiert, denn meines bescheidenen Physiwissens nach, ja, was ich mal gelernt habe, gibt es zwei grundsätzliche, unterschiedliche Typen von USBs. Du hast einmal eine online USB, da geht die Sachen immer durch die Batterie durch. Das hat den Vorteil, dass du auch keine Millisekunden-Aussetze hast und auch alles, wie heißt, Überspannungszeug immer protected ist und sonst was. Der Nachteil von einer online USB ist, wenn die Batterie kaputt ist, geht halt dahinter auch nichts mehr. So, online USBs sind teuer. Deswegen sind die normalen USBs, die man so kauft, sind eigentlich eben keine online USBs, sondern weiß gar nicht, wie das heißt. Ich nenne das mal offline USBs. Also sprich, dort wird geguckt, wenn der Input, also wenn das von der Steckdose ausfällt, dann wird auf die Batterie umgeschaltet. So, und was ich da nicht verstehe ist, das ist keine online USB, aber die Batterie ist verreckt, die ist kaputt anscheinend und man kann trotzdem nichts verwenden dahinter, auch wenn da Strom da ist. So, deswegen traue ich dieser USB nicht. Ich meine, wie kann das sein? Warum geht die USB nicht, wenn da Strom noch an ist? Das ist doch für ein Arsch. Wenn Akku defekt macht jede USB auf Stör... Ja, aber das ist doch kacke. Ich will doch nicht... Ja, aber wenn ich es bemerke, reicht es doch, wenn das piepst, dann sollte es doch nicht den Strom abschalten dahinter. Dafür habe ich doch eine USB. Das ist mit Absicht, das ist die bescheuerste Absicht aller Zeiten. Ich kann doch nicht das komplette Strom abschalten, nur weil die Batterie weg ist. Das ist doch total beknackt. Dafür habe ich doch eine USB. Ich habe eine USB, wenn es kaputt geht, also wenn da Strom ausfällt, dass es auf der Batterie geht, aber ich will doch nicht im Umkehrschluss, wenn die USB ein Problem hat, dass da Strom ausfällt. Das ist voll für ein Arsch. Das ist mega kacke. Den einzigen wirklichen Ausfall in zwei Jahren hatte ich, als die USB verreckt ist. Ist doch üblich bei Cyberpower. Also finde ich total bescheuert. Wenn es so wichtig ist, braucht man noch eine redundante USB. Man kann es im Heimbereich auch übertreiben, aber es gibt ja einen Unterschied zwischen keiner USB und einer USB, die die Sache kaputt macht. Also das ist bescheuert. Also das riecht beknackt. Wie soll das gehen, wenn der Strom nicht permanent durch die Akkus geht. Das wird einfach umgeschaltet, wenn der Strom ausfällt. Wie gesagt, es gibt zwei Typen von USBs. Du hast online USBs, aber wie auch immer es jetzt heißt, da geht es immer permanent durch den Akku durch und es gibt die Dinge, die einfach gucken, ist da Strom ausgefallen, dann schaltet es um auf die Batterie. Deswegen sind die Dinge ja auch so verhältnismäßig billig. Wir haben auf der Arbeit darum immer zweimal Cyberpower. Das sehe ich nicht ein. Also wenn ich eine USB habe, will ich, dass die USB funktioniert, solange der Inputstrom da ist. Scheiß auf die Batterie oder nichts, kann doch nicht sein. Du lernst zur Zeit Japanisch. Exzellent. Da kannst du mir bestimmt auch sagen, ob man Hira, Hira, Gyra oder Jira ausspricht. Was ist das für Musik da gerade im Hintergrund? Hallo? Sound please. Nope. Viel zu laut. Genau. Ja, das kann, also bei offline USBs kann das durchaus ein paar Millisekunden ausfallen. Das ist Soundtrack hier. Ja, also deshalb verstehe ich nicht, warum das dann ausgeht. Wenn die überhitzt und sich ausschaltet, okay, das kann ich dann irgendwie nachvollziehen. Aber einfach nur, weil der Akku kaputt ist, dann tausche ich einen Single Point of Fail gegen den anderen aus. So nach dem Motto, ich überbrücke, also mit einer USB sorge ich für den Fall vor, dass wenn da Strom ausfällt, okay, aber für den Fall, dass die Batterie ausfällt, ist trotzdem aus. Das ist doch bescheuert. Also die Batterie geht nach zwei Jahren wahrscheinlich ziemlich sicher kaputt. Immer so zwei bis drei Jahren. So, da ist ja selten dann ein Stromausfall als das. Da würde es ja, müsst ihr euch mal vorstellen, es würde öfters ausfallen mit einer USB als ohne eine USB. Das kann doch nicht sein. Ist doch total hängen geblieben. Ah, veterans, danke schön für den Sub. Exzellent Sub. Was kosten Ersatzakkus? Ja, das ist das worauf ich jetzt eigentlich raus bin. Also ich bin mir nicht sicher, ob ich die noch verwenden will. Die Akkus gehen, die Akkus sind nicht so teuer. Hier 40 Euro. Aber ich weiß nicht, ob ich die noch verwenden will, weil ich habe keinen Bock, dass wenn der Akku dann wieder kaputt geht, dass es dann wieder ausgeht. Du solltest die USB auch regelmäßig, das ist aber doch kein Grund, dass sie sich ausschaltet, wenn die Batterie nicht mehr geht, wenn der Akku nicht mehr geht. Das mag ja alles sein, aber das kann ja nicht der Grund, der Sinn dahinter sein, sich abzuschalten. Das Ding ist dafür da, um höhere Verfügbarkeit zu haben, nicht um niedrigere zu haben. Es spricht doch nichts dagegen. Der Akku muss doch nicht abbrennen. Ob die USB den Output abschaltet, hat doch überhaupt nichts mit dem Akku zu tun. Solange Strom reinkommt, geht es eh nicht über den Akku. Das heißt, dem Akku macht das überhaupt nichts. Die USB könnte einfach sagen, ok Akku leer, wir schalten den Akku ab und wenn dann der Strom ausfällt, passiert halt nichts. Also das ergibt überhaupt keinen Sinn. Deswegen bin ich mir gar nicht sicher, ob ich hier noch einen Ersatz Akku kaufen soll oder einfach drauf scheißen soll und mir sagen ey, dann halt ohne USB. Ich hatte davor so eine Steckdose, sowas in der Richtung hatte ich davor und da war das auch kein Problem. Da ist die Batterie schon lange im Arsch bei dem Ding. Das ist 8 Jahre alt oder so. Das Ding ist seit 5 Jahren schon im Arsch der Akku, aber es funktioniert immer noch, wenn der Strom an ist. Ne, habe ich nicht. Ne, ich habe keine Online-USB. Garantiert nicht, für den Preis ist das ein Nerv. Sagt der Hersteller ja auch selbst, dass es keine Online-USB ist. Guck mal, der Hersteller selbst sagt, das ist eine Line-Interactive-USB. Das ist keine Online-USB. Line-Interactive ist quasi das billigste, was es gibt. Das schaltet um, wenn das Strom weg ist auf den Akku. Das rote Replacement ist eine gute Frage. Ich habe es gerade nicht angeschlossen, aber ich gehe mal, ja, ja, würde schon sagen. Ich kann es jetzt nicht 100% sagen, aber ich denke mal. Das mit dem Shutdown hat nicht funktioniert. Das lag aber an mir, dass es mit dem Shutdown nicht funktioniert hat. Ich habe das USB angeschlossen, aber ich habe das irgendwie nicht richtig konfiguriert mit diesem Überwachungstool. Das hätte wahrscheinlich funktioniert, ja. Wann ich damit rechne, wann die Preise runtergehen. Ja, wenn ich das wüsste. Wenn ich das wüsste, dann könnte ich Stonkslike-Grafikkarten leer verkaufen. Ich habe keine Ahnung. Absolut kein Plan. Ja, die Preise sind für'n Arsch. So, also, ähm, weiter, muss ich überstehen geblieben. Also, wie gesagt, ich bin mir unschlusslich, ob ich, ich glaube, ich schmeiß die USB raus. Also, ne, ich schmeiß die USB nicht raus. Ich lass die USB drinnen, weil die USB ist schön schwer. Und ich hab geplant, dass ich hier oben drauf meinen 3D-Drucker stelle und wenn unten schwere USB drauf ist, wackelt das Ganze nicht und der 3D-Drucker steht schön fest. Die ist dann einfach quasi nur 12 Kilo beschwerer unten im Rack, ohne dass ich's verwende. Äh, i3-Megas. Was, ok, Amazon. Was sagt denn Amazon, wenn ich danach suche? Ok, APC kenn ich. Was ist Legrand? Das heißt bestimmt Legrosch oder so. Das bestimmt, äh, Porgers ist das. Kennt jemand Legrand? Gibt's eine Amazon Basics-USV? Gute Frage. Wie, aber das ist 2 HE. 2 HE ist mir eigentlich ein bisschen zu fett. Legrand. Aber schon mal ein USB für Shutdown. Es sieht aber fancy aus, ne? Wisst ihr was an der cool ist? Die hat vorne Stecker. Die könnt ich in die Mitte machen und dann könnt ich meine Steckdosenleiste gleich mit... Wait a minute. Hat die jetzt so Ausgänge oder so Ausgänge? Ja, was denn jetzt? Hat die so Ausgänge oder so? Hä? Können sie nicht entscheiden. Gut, also der Hersteller sagt mir gar nichts. Wofür ist das? Wenn der Strom ausfällt, dass es noch weiterläuft, je nachdem was du dran hast. Ich sag mal für 5-6 Minuten. Und wenn der Strom bis dann nicht wieder da ist, werden die Server ordentlich runtergefahren oder die Sachen, die hinten dranhängen, ordentlich runtergefahren. Der Gamer Alex, dass es zu Elektronik stellt, das kann ich dir nicht erklären. Grad mal einen Zeitpunkt, da hab ich das verstanden, aber ich hab keine Ahnung. Äh, was? Also, hallo Max, wollte mal Danke sagen, ich hab wegen dir Ausbildungen viel sehr nice, ja? März Abschlussprojekt, durch dein Video. Das ist schön. Was machst du für ein Abschlussprojekt? Erzähl mal, was machst du? Irgendwas. Also, sofern es nicht Windows Active Directory ist, das ist Resident Sleeper, das macht gefühlt jeder Zweite, weil vielleicht ist ja was interessantes, ja? PXE Boot mit Windows Images. Aha. Nicht schlecht. Ich mein, man könnte ein Netboot-Docker starten und da macht alles, aber man kann es auch selber machen. Du machst Software-Sender und AD. Ja, das machen total viele. Das weiß ich von der IHK, also das macht gefühlt jeder Zweite AD installieren. Hat aber auch den Vorteil, die wissen ein bisschen Bescheid drüber. Hast du die Twitch-Emails, den Minibot nicht alle? Das zum Beispiel nicht, wobei das echt nice ist. Wie kam es dazu? Der hat mich angeschrieben. Es geht um dieses Video. Ich kann es euch jetzt, wo mehr Leute da sind, noch mal kurz zeigen. Ich habe ein Video aufgenommen über meine Physi-Ausbildung mit ihm. Wenn es interessiert, kann er mal vorbeigucken. Kann er mal Hallo sagen. Wie ist dazu gekommen? Er hat mich angeschrieben per Mail und ich habe mal zur Abwechslung in meine Mails reingeguckt und dachte, das ist ja keine China-Red-Shadow-Legend-Spam-Werbung. Das können wir machen. Warum nicht? Passt ja vom Content auch. Klar, abo-mäßig bringt es mir nichts, aber man muss es ja nicht immer nur machen, um Abos zu geiern. Lucas, du kommst vom Stream, oder? Achso, Software-Center, das sagt mir irgendwas. Das ist eine Microsoft-Geschichte. Da habe ich aber keine Ahnung von. Du warst vorher wahrscheinlich schon wieder weg. Welchen Switch hast du bestellt? Den CSS 610? Den da? Den da? Den da? Die Musik ist echt nice. Also bei dem kann ich dir jetzt schon sagen, du musst eine Sache machen, damit du ihn überhaupt verwenden kannst. Du musst ins Forum gehen und dir die aktuellste Beta-Firmware herunterladen, weil, wie ich in dem Video schon gesagt habe, die Firmware, mit der das Ding ausgeliefert wird, ist nicht zu gebrauchen und das Ding ist Early Access aktuell. Dann gehst du hier ins offizielle Forum und du musst dir die Beta-Firmware raussuchen. Irgendwo da. Ach, was weiß ich, wo sie das versteckt haben. Ach, Moment, haben die jetzt offiziell abgelaudet, ihre Firmware dafür? Ich glaube nicht. Also wie gesagt, du musst unbedingt ins Forum, versuch das Ding nicht mit der ausgelieferten Firmware zu verwenden. Hier ist die GIF. Ja, nice, fügen wir hinzu. Ja, ja, mach das auf jeden Fall, also das ist voll von Arsch zu verwenden. Also richtig, richtig kacke mit der Default-Firmware. Da gehen auch nicht mal alle Ports mit der Default-Firmware. Muss man sich mal vorstellen. Die haben es geschafft, einen Switch auszuliefern, wo nicht mal alle Ports funktionieren. Ja, das Web-Interface, also das RouterOS Web-Interface finde ich ziemlich gut. Einzige Sache, also von den Features her, ist auf jeden Fall extrem nice. Man blinkt auch halbwegs durch. Das Problem ist so ein bisschen, die WLAN-Config ist richtig für'n Arsch. Also WLAN-Config über RouterOS machen ist echt painstrap. Oh, ich werde müde, was ist hier los? Achso, ich bin schon wieder unsinnig lange online und ne, bin ich gar nicht und komme nicht vorwärts. Also USB kaufe ich nix. Crap. Warum ist das APC-Zeug eigentlich so teuer? Die kochen doch auch nur mit Wasser. All die Musik ist ganz schön MonkaS gerade. Können die Mikrotik-APs WLANs? Ich wundere mich nicht. Aber Mikrotik-APs fand ich jetzt nicht so geil. Boomer müde, ist so. Ethon. Hört sich an wie irgendein Pokemon. Ethon, Ethon. Jetzt übertreiben sie es mit der Musik, aber äh. Ja, besser. Ethon. Boah, what the, ich geb doch keine 760 Euro für. Alter. Das übertreibt es halt mal, Leute. Suche nach Ethon, Ellipse, Echo. Okay. Ethon, Ellipse, Echo. Na, das geht ja. Gibt es da irgendeinen schönen Mount, dass man die ins Rack rein kriegt? Von der Höhe können es halbwegs passen. Ansonsten lege ich die einfach auf ne Schublade und gut ist. So, und das wichtigste, Leute. Wenn die Batterie in dem Ding verreckt, was passiert dann? Geht dann alles aus oder verreckt nur der Akku und es läuft alles weiter? Weil ich hab keinen Bock den gleichen Crab zu haben wie mit der Cyberpower. Explodiert. Ja, Chat, das glaube ich euch sofort. Firewall, ich verwende das Standard Paketfilter, der im Router drin ist und gut ist. Das reicht. Ist eine Offline-USV. Tja, das dachte ich bei meiner Cyberpower auch. Und die ist auch eine Offline-USV, aber die hat trotzdem alles ausgeschaltet, als der Akku verreckt ist. Schau, das Video ist eine E-Ton. Echt? Jetzt können wir mal hier früh gucken. Jetzt nicht. Muss jetzt noch kurz ein paar Sachen von der Einkaufsliste abhaken. Okay, dann gucken wir, wenn ihr das wollt, können wir es jetzt gucken. Obwohl, ich muss noch was einkaufen. Warte mal, warte mal. Lass mal schnell gucken, was muss ich noch einkaufen. Also mit der USV einmal geklärt, das haben wir auch. Ach komm, wir gucken jetzt das Video. So viel, so viel brauche ich denn mehr. So spricht das falsch aus, das heißt E-A-Ton? Was? Wie kommt man auch sowas? Das heißt einordnisch E-Ton. E-A-Ton? Was? E-Ton. Okay, es heißt E-Ton. Sowas, also E-Ton wie E-Ton. Verstehe, alles klar. Punkt Default, drei Monate, danke für den Sub. So und jetzt, okay, das gucken wir uns jetzt an, dann gehe ich pennen. Oder vielleicht doch nicht pennen, aber dann erstmal off, zeige ich mal her. Jetzt muss er erstmal Werbung für seine Merchunterhose machen oder sowas. Wow, schrei nicht so. Bei denen bin ich mir immer nicht sicher. Zeigen die in dem Video jetzt ihren echten Serverraum oder den Fake Serverraum, der nur für dieses Video existiert? Das weiß man ja dann nie so genau. Zero Dankeschön für den Sub. Ja, den Sellout kann er gut. Klar, die haben nicht nur Fake Serverräume, die haben Fake Häuser, die haben Fake Storage, die machen halt das Video zu Entertainment-Zwecken und nicht unbedingt, weil es wirklich einen realen Hintergrund hat. Ich meine, wenn du dir überlegst, wie viele Sachen da schon angeblich ganz furchtbar kritisch waren und kaputt gegangen sind und sonst was, das war vielleicht am Anfang so, aber mittlerweile ist das mit Sicherheit gestellt, zum größten Teil. Sieht ja fast aus wie mein Dach. Bestimmt krebserregend. Grip. Promise, die hatten doch schon zig Videos, zum Beispiel das Video, wo er einen Handstand auf dem Xeon Server gemacht hat. Das war bestimmt nicht ein echter Server von ihm, den er verwendet. Das ist einfach zu Show-Zwecken. Das muss einem doch klar sein, wenn man die Videos guckt. Das ist zu 90% zu Show-Zwecken. Ich meine, das kann durchaus ihr echter Serverraum sein, aber mir geht es so prinzipiell um die Videoinhalte. Da ist einfach vieles rein aus Entertainment-Zwecken. Wie willst du es denn anders machen? Okay, wann fängt es an zu brennen? Wobei das tatsächlich, zumindest von dem her, sieht tatsächlich wie ein echter Serverraum aus. Nicht wie die anderen Videos, die eine Küsche im Hintergrund haben und auch im Studio sind. Okay, wann brennt es? Ich will sehen, dass es brennt. Feuer. Alarm. Alarm. Ja, natürlich. Die haben gesagt, das kannst du dann aber sicherlich mal in einem Video erwähnen, oder? Und er hat gesagt, ja. Und dann haben die gesagt, easy, kein Problem. Aber SirCyborg natürlich stellen die Dinger. Das war doch garantiert kein Server von ihm, woran ein Handstand gemacht hat. Aber Mann, Jett, ihr wollt mich heute wieder triggern. Es geht nicht darum, dass die Videos fake sind. Es geht darum, dass die Dinger, die gezeigt werden, halt so konstruiert sind, dass sie eben ein Entertainment-Video hergeben. Ihr glaubt doch nicht ernsthaft, dass der einen Handstand macht auf einem Xeon-Server, den sie bei sich irgendwo im laufenden Betrieb ausgebaut haben vorher. Der hat mal auf einem Video einen Handstand auf einem Server gemacht, um die CPUs anzudrücken und sowas. Das ist einfach Entertainment-Zwecken. Das hat keinen realen Hintergrund irgendwie. Das macht es doch nicht schlechter. The other part of the deal was we had to talk through some of the things we did wrong to make sure that other Eaton-Customers don't make the same mistakes. The UPS trains are coming. Hold on, let me just lift up and over the cable. Das war ein halbes Werbevideo für Intel damals mit dem Xeon-Server. Deswegen, das ist vom Inhalt her gemacht, dass es Entertainment ist. Wenn ich irgendein Video zu einem Thema aufnehme, dann drehe ich mir die Sachen manchmal auch so hin, dass sie einfach die bessere Storyline und das bessere Entertainment ergeben. Manchmal erzähle ich Sachen, die vorher passiert sind nachher, sodass es sich einfach unterhaltsamer anhört. Das machen die da auch. Natürlich machen die das. Wie soll das anders funktionieren? Ja gut, es hat halt ein bisschen geschmort. Promise, ich habe nichts anderes gesagt. Oh, das ist nicht gut. Sieht man noch irgendwann, wenn es qualmt? Ich will sehen, wie es qualmt. Es qualmt noch nicht mal. Ich wollte sehen, wie es qualmt. Okay, das ist langweilig. Ich dachte, es brennt. Gebatet, gebatet, Alter. Nichts gebatet. Ja, es hat geschmort ein bisschen. Ja, super, exzellent. Das ist ja langweilig, wenn es sich brennt. Wir sehen jetzt, wie es brennt. Das kenne ich noch. Das war ein April Scherz Video. Top Idee. Ich meine, ich würde es nicht wundern, wenn irgendein YouTuber das in das Haus abfackelt, weil es gut Klicks bringt. Für gut Klicks macht man auch alles. Das habe ich überhaupt nicht gesagt. Es sind halt manche Sachen konstruiert, dass es ein gutes Video gibt. Zum Beispiel, wo sie sich bei Linus Tech Tipps diesen Fernseher oder was das war, ins Badezimmer eingebaut haben. Das hätte der nie gemacht. Hätte er nicht passenderweise einen Sponsor dazu gehabt. Erstens und zweitens wäre das nicht ein cooles Entertainment Video gewesen. Das kommt halt zusammen in der Stelle. Natürlich hat er es gemacht, aber er hätte es ohne diese Sachen im Hintergrund nicht gemacht, weil es komplett sinnlos Installation war. Ich fand es auch witzig, als der Controller ins Wasser gefallen ist. Genau. Das wird gemacht, um zu zeigen, dass es eine coole Sache ist. Das wird gemacht, um ein gutes Video zu machen. Nicht, weil er wirklich sein Haus umbaut oder so etwas. Ich sage doch gar nicht, dass es ein Geheimnis ist. Ich weiß gar nicht, was ihr jetzt eigentlich wollt. Aber die Sachen sind offensichtlich so gemacht, dass man eben gut Content daraus produzieren kann. Anders kannst du es doch auch gar nicht machen. Das ist jetzt ja keine super Secret Taktik oder so. Das musst du ja quasi sogar so machen, wenn du Channels in dieser Größe, in dieser Frequenz und mit diesen massig Zuschauern hast. Da bleibt ja gar nichts anderes übrig. Du musst gucken, dass du so einen Fahrplan hast, was du an Content produzieren willst. Und selbstverständlich machst du die Sachen, die du machst, dann auch daraufhin optimiert. Also wenn du sagst, ich muss jetzt 15 Dinge erledigen, dann guckt man, wie schaffe ich es aus diesen 15 Dingen, die ich eh erledigen muss, mit ein bisschen Story drum herum 15 unterhaltsame Videos zu machen. Und da kommt mit Sicherheit auch die eine oder andere Idee, die absolut unsinnig ist und vorher keiner machen wollte, einfach nur, weil es ein gutes Video ergibt. Das ist weder was Schlimmes oder sonst was, aber so funktioniert das halt mal. Was war das? Was für ein Ding? Keine Ahnung. Ja klar, die produzieren ja auch für andere Videos und sowas. Was ich da auch witzig finde ist, früher haben sie in der Küche aufgenommen und heute nehmen sie im Studio aus und lassen es aussehen wie in der Küche, was halt auch geil ist. Die anderen versuchen daheim ihre Küche nach Studio aussehen zu lassen und Lilus Tech Tips macht das Studio zur Küche. Wobei sie ja früher wirklich in der Küche aufgenommen haben. Diese kopiert ja ein E, ich kopiere eins und es gerne. Das mache ich auch öfters. Man könnte sagen, das Video war eine Art Clickbait mit dem Gebrannt, aber mal ganz ehrlich, ich bin mittlerweile da nicht mehr so allergisch gegen. Also du musst mittlerweile auf YouTube einfach ein gutes Thumbnail und einen guten Videotitel haben. Natürlich sollte es nicht komplett gelogen sein, das ist ja, wenn man es streng nimmt sogar gegen die Richtlinien, aber das juckt im Endeffekt kein Mensch mehr. Aber es ist schon durchaus, also finde ich, es ist durchaus legitim in den Videotitel zu schreiben. Es hat gebrannt oder unser Serverraum hat Feuer gefangen. Hat er ja auch. Ich meine, man denkt ein bisschen, wenn man das sieht, man sieht im Video, wie das Serverraum brennt. Ist es dann im Endeffekt nicht, aber das ist jetzt nicht so ultra Clickbait wie, keine Ahnung, ihr kennt diese ganzen Geschichten. Twitch Chat hasst diesen Trick. 10 Tipps, ihr glaubt nicht, was Nummer 5 ist und da kommt dann übelster Schwachsinn. Ich habe letztens auch Clickbait gemacht. Oder Eax hat noch ein eigenes Command, heißt der Channel von ihm überhaupt noch so? Nö. Nummer 8 wird sich schockieren, genau. Ich habe letztens, wenn du so willst, ich habe letztens auch übelst geclickbaited, wenn ihr so wollt. Guck mal das hier. Ich wurde gehackt und was ich daraus gelernt habe, hört sich so an, wie als hat irgendein Typ meinen YouTube-Account plattgemacht. So nach dem Motto. Und was erzähle ich im Video über die Erfahrungen, die ich gemacht habe mit solchen Leuten. Oder gehackt oder auch großgeschrieben. Aber das hilft halt was, aber das ist schon Clickbait, kann man nicht anders sagen. Das ist aber finde ich noch im Rahmen, sonst würde ich es auch nicht machen und das kann ich auch anderen nicht vorwerfen dementsprechend. Und es geht ja letztendlich darum. Es ist ja nicht so, dass es contentmäßig 2 Sekunden darum geht. Also was ich teilweise bescheuert finde ist, wenn dann Leute in Titel schreiben, das haben wir sonntags, kriegen wir ab und zu so Videos vorgeschlagen. So nach dem Motto, ich übertreibe es jetzt mal sinngemäß, steht dann irgendwie im Titel so Lidl Gaming PC. Der, was weiß ich, unglaublich, unglaublich was Lidl hier wieder macht. So nach dem Motto. Dann machst du das Video auf, 15 Minuten lang und es geht 30 Sekunden darum, dass, keine Ahnung, sich Lidl beim Grafikkartentitel verschrieben hat oder so. Und dann denke ich, okay, das ist mir dann doch schon ein bisschen zu übertrieben. So chat, also es ist 22 Uhr. Ich glaube, ich gehe jetzt pennen oder zumindest off. Da ist ja wirklich Black Ops 1 auf dem Desktop. Nö, ist es nicht. Da ist Boomer 1 auf dem Desktop vielleicht. Da ist aber nicht Black Ops 1 auf dem Desktop. Das wüsste ich. Da ist Cold War Singleplayer, den ich mal deinstallieren könnte drauf. Der ganz okay war, aber bei weitem nicht an Black Ops 1 reingekommen ist. Das ist der beste Desktop. Das ist denn so sieht ein Desktop aus, wenn man den Desktop nicht als Desktop verwendet, sondern als weiterer Ordner. Und ist eigentlich auch das Beste, was man machen kann. Der Chat ist noch nicht high IQ genug dafür, das zu verstehen. Deswegen braucht es noch ein paar Prime-Sub. Irgendwann kommt ihr auch dahinter, dass das eigentlich die beste Desktop-Anordnung ist. Da steht Black Ops, weil die mittlerweile bei der Benahmung so gefällt haben, dass keiner mehr durchblickt. Was wurde eigentlich aus Crysis VM? Was ist denn Crysis VM, sagt mir gar nichts. Ist das irgendein neues? Weiß ich nicht. Oder meinst du Crysis in der VM? Das hat doch funktioniert. Aber das war ja nur etwas, was wir nebenbei ausprobiert haben. Das war ja nicht das Ziel Crysis in der VM laufen zu lassen. Ah, yes. Das ist eine coole Anleitung. Guck mal hier, wie gut das funktioniert. Ja, alles klar Leute. Diese Ubiquiti-Dinger sind zwar technisch ganz nice, aber ich finde dieses ganze Unify-Konzept für daheim nicht so geil. Du brauchst quasi einen extra Controller für zwei bis drei Access Points. Danach wird es vielleicht Sinn machen, aber zwei bis drei, die stellst du daheim einmal ein und die bleiben dann immer so. Wobei ich diese Ubiquiti-Dinger immer noch mit am besten finde. Aber wirklich, wirklich geil finde ich sie auch. Sie sind schon gut. Aber so wirklich super finde ich die nicht. Ja, ja, die kannst du auch einzeln verwenden, aber da brauchst du halt einen Controller für. Das ist doof hier, nice, easy. Mikrotik-Access-Points, weiß ich nicht, ob die was taugen. Okay Leute, wir sehen uns morgen früh. Morgen früh ist Sonntag schon wieder, ne? Ja. Sonntag, alles klar Leute. Bis dann, macht's gut. See you. So, 10 Uhr.", "segments": [{"id": 1, "start": 60.0, "end": 71.1, "text": "Und in discouraged."}, {"id": 2, "start": 101.1, "end": 121.1, "text": "So auf gehts, oh mal gucken ob ich Teams schon gefixt habe."}, {"id": 3, "start": 121.1, "end": 131.1, "text": "Long have we waited now which ye baited, genau, äh, wo ist es denn? Hab ich Teams schon gefixt?"}, {"id": 4, "start": 131.1, "end": 134.1, "text": "Ah ja, ich hab Teams heute Morgen zur Aufnahme schon gefixt."}, {"id": 5, "start": 134.1, "end": 138.1, "text": "Ich hab übrigens noch ein Video aufgenommen heute, wer es noch nicht gesehen hat, ich zeig's nochmal schnell."}, {"id": 6, "start": 138.1, "end": 148.1, "text": "Und zwar, aber nicht bei mir auf dem Channel, sondern mit jemand anderem zusammen, nämlich, wo ist es? Da!"}, {"id": 7, "start": 148.1, "end": 154.1, "text": "Also, wenn ihr nachher nichts zu tun habt, nein, das bin ich ich, ich hab mich nicht geleakt oder so, man weiß das."}, {"id": 8, "start": 154.1, "end": 159.1, "text": "Die Leute sind ja immer da relativ, äh, sag ich, am Start mit so Zeug."}, {"id": 9, "start": 159.1, "end": 166.1, "text": "Genau, mit ihm hab ich zusammen ein Video aufgenommen, er hat bloß um die drei K-Abos, lohnt sich auf jeden Fall mal vorbei zu gucken, der macht ganz gute Videos."}, {"id": 10, "start": 166.1, "end": 172.1, "text": "Da hat mich angeschrieben per Mail, ob wir nicht was aufnehmen wollen, ich hab mir gedacht, ja, warum nicht, ja, kann man ja mal machen."}, {"id": 11, "start": 172.1, "end": 178.1, "text": "Und, ähm, ja, da gibt's zwanzig Minuten Video zu diesem Thema, wenn das interessiert."}, {"id": 12, "start": 178.1, "end": 180.1, "text": "Excellent, excellent."}, {"id": 13, "start": 181.1, "end": 184.1, "text": "Poggers, Alter."}, {"id": 14, "start": 191.1, "end": 195.1, "text": "Dreitsatz Subscribed für 17 Monate, Alter."}, {"id": 15, "start": 195.1, "end": 197.1, "text": "Massive Subscription."}, {"id": 16, "start": 197.1, "end": 200.1, "text": "Hyper Subscription, wo ist es denn?"}, {"id": 17, "start": 204.1, "end": 208.1, "text": "Casey auch am Start, acht Monate, danke schön für die ganzen Subs, Leute."}, {"id": 18, "start": 209.1, "end": 214.1, "text": "Und Josef T. auch am Start, Poggers, nice, danke schön für die ganzen Subs."}, {"id": 19, "start": 214.1, "end": 221.1, "text": "Ich merk das, wenn ich länger nicht gestreamt hab, komm immer auf einen Schlag ganz viele Subs, aber insgesamt ist es doch weniger."}, {"id": 20, "start": 221.1, "end": 227.1, "text": "Also man sieht schon, das zahlt sich, also gerade auf Twitch, das zahlt sich richtig gut aus, wenn man oft streamt, ne."}, {"id": 21, "start": 228.1, "end": 234.1, "text": "Also ich hab, ich hab, keine Ahnung, doppelt so viele Abos, wenn ich viel streame, zu jetzt."}, {"id": 22, "start": 235.1, "end": 239.1, "text": "Aber gut, man sagt, klar, warum sollte man subscriben, wenn's kein Content gibt, würde ich auch nicht machen."}, {"id": 23, "start": 242.1, "end": 245.1, "text": "So, Tains auch am Start."}, {"id": 24, "start": 245.1, "end": 250.1, "text": "20 Monate, meine Güte, ey."}, {"id": 25, "start": 251.1, "end": 254.1, "text": "Der Scam Train ist auch am Start."}, {"id": 26, "start": 257.1, "end": 261.1, "text": "Bin ich eigentlich der Einzige, der findet, dass Komodo Hype kein guter PogChamp-Ersatz ist?"}, {"id": 27, "start": 261.1, "end": 273.1, "text": "Ich finde, es hat beide seine Berechtigung gehabt."}, {"id": 28, "start": 274.1, "end": 278.1, "text": "So, kann man's saft zur Seite stellen, weil sonst schmeiß ich's runter."}, {"id": 29, "start": 279.1, "end": 286.1, "text": "Der Komodo ist scheiße, ja ich mag den auch nicht, ich hab das Original auch nie verwendet, den gab's ja vorher schon."}, {"id": 30, "start": 286.1, "end": 292.1, "text": "Den gab's ja vorher auch schon, jetzt ist es einfach doppelt, das ist ja irgendwie auch dumm, oder?"}, {"id": 31, "start": 300.1, "end": 303.1, "text": "Ich glaube, das ist ein bisschen zu kompliziert für ein Video."}, {"id": 32, "start": 304.1, "end": 306.1, "text": "Wobei, so schwierig ist das gar nicht."}, {"id": 33, "start": 308.1, "end": 312.1, "text": "Aber gucken, ich kann, ich kann so Videos auf YouTube nicht total übertreiben."}, {"id": 34, "start": 312.1, "end": 316.1, "text": "Da sind ja auch viele Leute, die so voller Technik nicht so großartig Ahnung haben."}, {"id": 35, "start": 317.1, "end": 319.1, "text": "Exzellent, exzellent."}, {"id": 36, "start": 320.1, "end": 322.1, "text": "Sollen wir mal kurz durchscrollen, also, wen haben wir hier am Start?"}, {"id": 37, "start": 323.1, "end": 326.1, "text": "Casey ist da, der Kampf Kevin, der Sampler."}, {"id": 38, "start": 327.1, "end": 332.1, "text": "Pri, Zerif ist am Start, der Florian, Joseph T., John, 96, ne, 69."}, {"id": 39, "start": 334.1, "end": 337.1, "text": "Ich dachte jetzt eher als Geburtsjahr, aber nein, das ist der John, 69 ist das."}, {"id": 40, "start": 337.1, "end": 341.1, "text": "Nick, guck mal, der Patrick ist auch am Start, Ecky, Matrix, Hopp, Meiert."}, {"id": 41, "start": 342.1, "end": 346.1, "text": "Mr. Ami auch mal wieder da, nice, haben sie dich wieder heimgelassen, ja?"}, {"id": 42, "start": 349.1, "end": 351.1, "text": "Ja, machen wir, machen wir."}, {"id": 43, "start": 351.1, "end": 353.1, "text": "Vielleicht nicht ganz Amazon, aber fast."}, {"id": 44, "start": 355.1, "end": 359.1, "text": "Und der Rest auch alles am Start, nice, dass ihr da seid, dass ihr da seid, Poggers."}, {"id": 45, "start": 359.1, "end": 361.1, "text": "Wer war das? Ach, das war der Pogchamp, tut."}, {"id": 46, "start": 361.1, "end": 364.1, "text": "Siehst du mal, ich weiß gar nicht mehr, wie das, wie der Typ heißt."}, {"id": 47, "start": 364.1, "end": 368.1, "text": "Mir sind dem seine, mir sind dem seine Ansichten vollkommen egal."}, {"id": 48, "start": 368.1, "end": 370.1, "text": "Ich fand das Pogchamp-Emote geil."}, {"id": 49, "start": 370.1, "end": 374.1, "text": "Warum das Stream buffert? Weil, weil du in Deutschland wohnst wahrscheinlich."}, {"id": 50, "start": 375.1, "end": 379.1, "text": "Weil wir wissen ja, dass wir eigentlich bis 2080 50 Ambit für alle haben."}, {"id": 51, "start": 380.1, "end": 382.1, "text": "Also, ich glaube, das ist das."}, {"id": 52, "start": 382.1, "end": 384.1, "text": "Ich glaube, das ist das."}, {"id": 53, "start": 384.1, "end": 389.1, "text": "Weil wir wissen ja, dass wir eigentlich bis 2080 50 Ambit für alle haben."}, {"id": 54, "start": 391.1, "end": 397.1, "text": "Also, wer jetzt noch keine 50 Ambit hat, der ist einfach noch nicht 2018."}, {"id": 55, "start": 399.1, "end": 402.1, "text": "Was wird gekauft? Alles Mögliche."}, {"id": 56, "start": 402.1, "end": 405.1, "text": "Ich habe mir ein paar Sachen aufgeschrieben, wo ich mal gucken will."}, {"id": 57, "start": 405.1, "end": 409.1, "text": "Ja, habe ich gesehen, das wird dem Fax mal lustig."}, {"id": 58, "start": 409.1, "end": 414.1, "text": "Weil ich an sich sagen muss, finde ich Birma mal nicht übermäßig lustig."}, {"id": 59, "start": 414.1, "end": 416.1, "text": "Aber das mit dem Fax war lustig."}, {"id": 60, "start": 416.1, "end": 418.1, "text": "Und er hat ja auch recht."}, {"id": 61, "start": 419.1, "end": 427.1, "text": "Ich habe irgendwo ein Wahlplakat gesehen von der CDU, wo drauf stand irgendwie Glasfaser für alle."}, {"id": 62, "start": 427.1, "end": 430.1, "text": "Und da war ein AR-45-Stecker drauf."}, {"id": 63, "start": 430.1, "end": 439.1, "text": "Ich habe auch gedacht, das sieht meistens kein Glasfaser-Stecker aus."}, {"id": 64, "start": 440.1, "end": 444.1, "text": "Ja, genau. Man kann sich das einfach einreden."}, {"id": 65, "start": 447.1, "end": 452.1, "text": "Das ist genauso wie die Leute, die dann erzählen, sie haben Wi-Fi 6 und 50 Billionen Gigabit."}, {"id": 66, "start": 452.1, "end": 456.1, "text": "Und mit 5G wird es jetzt auch ultra schnell und sonst was."}, {"id": 67, "start": 456.1, "end": 458.1, "text": "Und praktisch gesehen kommt da kaum was an."}, {"id": 68, "start": 458.1, "end": 463.1, "text": "Weil Wände dazwischen sind, weil schlechter Empfang, was auch immer."}, {"id": 69, "start": 466.1, "end": 471.1, "text": "Wobei man halt echt sagen muss, schnelles Internet geht ja auch über Kupfer. So ist das nicht."}, {"id": 70, "start": 471.1, "end": 474.1, "text": "Es ist nur die Frage, wie weit die Gegenstelle entfernt sein kann."}, {"id": 71, "start": 475.1, "end": 479.1, "text": "Also man kann ohne Probleme ja auch 10G machen über Kupfer."}, {"id": 72, "start": 479.1, "end": 482.1, "text": "So um die 100 Meter lang oder so in dem Dreh."}, {"id": 73, "start": 484.1, "end": 487.1, "text": "Ist übrigens ein guter Punkt, damit können wir anfangen."}, {"id": 74, "start": 487.1, "end": 491.1, "text": "Aber ich habe hier den Switch, das habt ihr wahrscheinlich fair geguckt."}, {"id": 75, "start": 491.1, "end": 494.1, "text": "Habt ihr im letzten Video gesehen, der Switch ist immer noch am Start."}, {"id": 76, "start": 494.1, "end": 498.1, "text": "Guckt hier, Serverraum-Video, der Switch, der ist immer noch da."}, {"id": 77, "start": 498.1, "end": 500.1, "text": "Die Kabelpolizei ist wieder unterwegs hier."}, {"id": 78, "start": 500.1, "end": 502.1, "text": "Da oben ist der Switch."}, {"id": 79, "start": 502.1, "end": 506.1, "text": "Und man sieht vielleicht schon das Problem, was ich bei dem Switch habe."}, {"id": 80, "start": 506.1, "end": 508.1, "text": "Keg-Waite, genau."}, {"id": 81, "start": 508.1, "end": 515.1, "text": "Das Problem ist, ich habe 12 Ports SFP plus Glasfaser-Ports."}, {"id": 82, "start": 515.1, "end": 527.1, "text": "Das Problem ist, ich brauche aber eigentlich noch mal 4 AY-45-Ports zusätzlich."}, {"id": 83, "start": 527.1, "end": 530.1, "text": "Die meisten Sachen davon 1G."}, {"id": 84, "start": 530.1, "end": 534.1, "text": "So und ich habe jetzt zur Auswahl richtige Burgas-Hose."}, {"id": 85, "start": 534.1, "end": 537.1, "text": "Manche andere fanden die Hose echt cringe."}, {"id": 86, "start": 538.1, "end": 540.1, "text": "Danke schön für das Subgift."}, {"id": 87, "start": 540.1, "end": 545.1, "text": "Ich kann nicht mehr reden, Leute."}, {"id": 88, "start": 545.1, "end": 548.1, "text": "Ihr wisst, was ich meine."}, {"id": 89, "start": 552.1, "end": 554.1, "text": "Sehr nice, Burgas."}, {"id": 90, "start": 554.1, "end": 556.1, "text": "Kann man nur zu sagen."}, {"id": 91, "start": 559.1, "end": 565.1, "text": "Deswegen habe ich mir gedacht, anstatt dass ich so einen komischen Switch da oben drauf stelle."}, {"id": 92, "start": 565.1, "end": 568.1, "text": "Der ist ja eh für mal ein Schreibtisch hier, der da steht."}, {"id": 93, "start": 568.1, "end": 570.1, "text": "Keg-Waite."}, {"id": 94, "start": 571.1, "end": 572.1, "text": "Der da."}, {"id": 95, "start": 572.1, "end": 578.1, "text": "Ich kaufe mir einfach noch 4 normale SFP-Module AY-45."}, {"id": 96, "start": 578.1, "end": 584.1, "text": "Die sind nicht so teuer und nehme einfach 4 Ports davon, weil 12 SFP plus 10G-Ports brauche ich nie im Leben."}, {"id": 97, "start": 584.1, "end": 589.1, "text": "Deswegen gehe ich jetzt einfach mal gucken, mit was das Ding kompatibel ist, laut Hersteller."}, {"id": 98, "start": 589.1, "end": 597.1, "text": "Und dann mache ich normale Module rein, die sind billiger."}, {"id": 99, "start": 599.1, "end": 602.1, "text": "Schon mal mit Grafana rumgespielt."}, {"id": 100, "start": 602.1, "end": 607.1, "text": "Ach ja, wo wir gerade beim Thema Grafana sind, habe ich euch schon mal das Dashboard für meine Heizung gezeigt."}, {"id": 101, "start": 607.1, "end": 609.1, "text": "Das ist auch in Grafana gemacht."}, {"id": 102, "start": 609.1, "end": 612.1, "text": "Da sieht man die Temperatur von der Heizung."}, {"id": 103, "start": 612.1, "end": 616.1, "text": "Man sieht den Fehlerstatus, wie warm der Kessel aktuell ist."}, {"id": 104, "start": 616.1, "end": 622.1, "text": "Ob der Brenner an ist, wie warm die Abgase sind und ob die Pumpe gerade pumpt."}, {"id": 105, "start": 622.1, "end": 625.1, "text": "Richtig exzellent."}, {"id": 106, "start": 625.1, "end": 626.1, "text": "Exquisite."}, {"id": 107, "start": 626.1, "end": 629.1, "text": "Grafana vom Preis-Champ."}, {"id": 108, "start": 633.1, "end": 636.1, "text": "Die kann ich auch zeigen, ja."}, {"id": 109, "start": 638.1, "end": 643.1, "text": "Grafana vom Preis-Champ kann ich auch zeigen, da muss ich mal nur was gucken, nicht dass ich die IP leake."}, {"id": 110, "start": 643.1, "end": 646.1, "text": "Wird ja irgendwelche Leute sinnlos dedossen."}, {"id": 111, "start": 648.1, "end": 652.1, "text": "Nee, ich kann Grafana vom Preis-Champ nicht zeigen."}, {"id": 112, "start": 652.1, "end": 655.1, "text": "Ich habe die IP drin, die will ich nicht leaken."}, {"id": 113, "start": 666.1, "end": 670.1, "text": "3060, ich habe noch keine Links von deutschen Shops für die 3060."}, {"id": 114, "start": 670.1, "end": 675.1, "text": "Gebt deine Heizung die ganzen Werte aus oder hast du die Sensor selbst verbaut?"}, {"id": 115, "start": 675.1, "end": 678.1, "text": "Das gibt die Heizung aus."}, {"id": 116, "start": 678.1, "end": 685.1, "text": "Die Heizung ist über ein offizielles OptoLink, heißt das, Kabel vom Hersteller."}, {"id": 117, "start": 685.1, "end": 687.1, "text": "Ist das angeschlossen."}, {"id": 118, "start": 687.1, "end": 690.1, "text": "Das sind im Prinzip zwei Infrarot-LEDs vorne an dem Kabel dran."}, {"id": 119, "start": 690.1, "end": 694.1, "text": "Und das habe ich dann per USB und Raspberry Pi gemacht."}, {"id": 120, "start": 694.1, "end": 697.1, "text": "Da gibt es eine Custom Software, die das Ganze auslesen kann."}, {"id": 121, "start": 697.1, "end": 700.1, "text": "Es ist ein bisschen komplizierter, aber es funktioniert gut."}, {"id": 122, "start": 702.1, "end": 704.1, "text": "Es funktioniert echt super."}, {"id": 123, "start": 704.1, "end": 706.1, "text": "Das haben wir auch zusammen im Stream gebaut."}, {"id": 124, "start": 708.1, "end": 710.1, "text": "Hello, Datasheet."}, {"id": 125, "start": 711.1, "end": 717.1, "text": "16XG SFP Module Compatibility."}, {"id": 126, "start": 720.1, "end": 722.1, "text": "Zeigst du mir, mit was sind die kompatibel?"}, {"id": 127, "start": 722.1, "end": 724.1, "text": "Im Zweifelsfall gehen wahrscheinlich alle."}, {"id": 128, "start": 724.1, "end": 731.1, "text": "Ja, SFP ist Glasfaser, aber es gibt ja SFP zu AIO45 Modulen."}, {"id": 129, "start": 733.1, "end": 739.1, "text": "Gerade am Anfang hatte der Switch richtig, also der hatte massive Probleme, als er neu war mit Modulen."}, {"id": 130, "start": 739.1, "end": 741.1, "text": "Da ist auch das Forum voller Geflame zu."}, {"id": 131, "start": 741.1, "end": 744.1, "text": "Mittlerweile mit der aktuellen Firma geht es wahrscheinlich besser."}, {"id": 132, "start": 746.1, "end": 748.1, "text": "Also was frisst denn der, die offiziellen?"}, {"id": 133, "start": 748.1, "end": 750.1, "text": "Die offiziellen?"}, {"id": 134, "start": 752.1, "end": 754.1, "text": "Was kosten so eins, zeig mal her."}, {"id": 135, "start": 754.1, "end": 756.1, "text": "Guck mal bei Amazon, Alter."}, {"id": 136, "start": 758.1, "end": 760.1, "text": "Ja, das ist die nächste Option."}, {"id": 137, "start": 760.1, "end": 764.1, "text": "Ich könnte einen zweiten Switch reinstellen mit 8 oder 24 G-Ports."}, {"id": 138, "start": 764.1, "end": 766.1, "text": "Allerdings..."}, {"id": 139, "start": 768.1, "end": 770.1, "text": "Wozu?"}, {"id": 140, "start": 770.1, "end": 772.1, "text": "Wenn man es einfach auch so lösen kann."}, {"id": 141, "start": 772.1, "end": 774.1, "text": "Wenn es nicht zu teuer ist, ja."}, {"id": 142, "start": 774.1, "end": 778.1, "text": "Natürlich wäre es billiger, einen TP-Link-Switch reinzustellen von 15 Euro."}, {"id": 143, "start": 780.1, "end": 782.1, "text": "Aber naja, mal gucken."}, {"id": 144, "start": 782.1, "end": 784.1, "text": "Was kosten die bei Amazon?"}, {"id": 145, "start": 786.1, "end": 788.1, "text": "18."}, {"id": 146, "start": 788.1, "end": 790.1, "text": "Das geht bestimmt billiger."}, {"id": 147, "start": 790.1, "end": 792.1, "text": "Das geht bestimmt billiger."}, {"id": 148, "start": 792.1, "end": 796.1, "text": "Das sind doch nicht mal die offiziellen."}, {"id": 149, "start": 796.1, "end": 804.1, "text": "Ist das die offiziellen?"}, {"id": 150, "start": 804.1, "end": 806.1, "text": "18."}, {"id": 151, "start": 806.1, "end": 810.1, "text": "Hätte ich jetzt gedacht, dass es billiger geht?"}, {"id": 152, "start": 812.1, "end": 814.1, "text": "FSCOM."}, {"id": 153, "start": 814.1, "end": 816.1, "text": "FSCOM habe ich das letzte Mal geguckt."}, {"id": 154, "start": 816.1, "end": 818.1, "text": "Ich hatte von denen noch nie was."}, {"id": 155, "start": 818.1, "end": 820.1, "text": "Taugt das? Ich habe es noch nie ausprobiert."}, {"id": 156, "start": 820.1, "end": 822.1, "text": "Da hinten ist nichts."}, {"id": 157, "start": 822.1, "end": 824.1, "text": "Hier hinten ist nichts."}, {"id": 158, "start": 824.1, "end": 826.1, "text": "Hier hinten ist nichts."}, {"id": 159, "start": 826.1, "end": 828.1, "text": "Also, zeig mal her."}, {"id": 160, "start": 834.1, "end": 836.1, "text": "Was muss ich denn da suchen?"}, {"id": 161, "start": 844.1, "end": 846.1, "text": "Äh."}, {"id": 162, "start": 846.1, "end": 848.1, "text": "Moment, das ist das Falsche."}, {"id": 163, "start": 848.1, "end": 850.1, "text": "Das ist falsch, ich höll's nicht vor 10km."}, {"id": 164, "start": 854.3, "end": 856.3, "text": "Ach was muss ich denn da suchen, dass das passt?"}, {"id": 165, "start": 857.1, "end": 861.2, "text": "10km, 10km, alter 40km, alles klar, alles perfekt."}, {"id": 166, "start": 862.7, "end": 868.1, "text": "Ok, guck mal mal, SFP, Transceiver, ne Optische, Optische ist, na doch Optische, stimmt, genau."}, {"id": 167, "start": 868.9, "end": 869.9, "text": "17€, ok."}, {"id": 168, "start": 871.3, "end": 873.1, "text": "Ja, da machste nix."}, {"id": 169, "start": 873.8, "end": 875.8, "text": "Machtste preislich hier einen Unterschied, ne?"}, {"id": 170, "start": 875.8, "end": 877.8, "text": "So was hier brauch ich."}, {"id": 171, "start": 878.3, "end": 882.3, "text": "100m, 100m, was ist hier der Unterschied, ist doch genau das gleiche, oder?"}, {"id": 172, "start": 883.8, "end": 885.8, "text": "Wo, wo ist hier der Unterschied?"}, {"id": 173, "start": 886.3, "end": 891.3, "text": "Das macht 10, 100, 1000, ich würde jetzt auch davon ausmachen, dass das 100 macht."}, {"id": 174, "start": 896.3, "end": 898.3, "text": "Das ist nur 1G, jaja, reicht mir ja auch."}, {"id": 175, "start": 898.3, "end": 905.3, "text": "Ähm, die 10G ist ja einfach viel zu teuer, an die Ports kommen eh nur 1G Sachen dran."}, {"id": 176, "start": 905.3, "end": 910.3, "text": "Ja, da kommt der Raspberry Pi von unten und der Access Point von unten aus dem Erdgeschoss dran."}, {"id": 177, "start": 910.3, "end": 915.3, "text": "Da kommt drüben, äh, gegenüber der..."}, {"id": 178, "start": 915.3, "end": 928.3, "text": "Beide müsste ich eigentlich gar nicht da anschließen, den könnt ihr aber am Switch hier anschließen, der fürs Fernseh das Ding."}, {"id": 179, "start": 930.3, "end": 934.3, "text": "Was sind das alles für 30.000 verschiedene, unterschiedliche Dinger?"}, {"id": 180, "start": 934.3, "end": 936.3, "text": "MGPT1, GL..."}, {"id": 181, "start": 937.3, "end": 941.3, "text": "Ich hab legit keinen Plus und Schimmer, was der Unterschied dazwischen ist."}, {"id": 182, "start": 941.3, "end": 946.3, "text": "Sieht alles gleich aus."}, {"id": 183, "start": 946.3, "end": 948.3, "text": "Sieht alles gleich aus, äh."}, {"id": 184, "start": 951.3, "end": 953.3, "text": "Aber ist..."}, {"id": 185, "start": 954.3, "end": 957.3, "text": "Aber ist tatsächlich egal, macht preislich keinen Unterschied."}, {"id": 186, "start": 957.3, "end": 960.3, "text": "Was es ist, das ist ein Modul für ein Switch."}, {"id": 187, "start": 960.3, "end": 964.3, "text": "Guck hier, das ist der Switch, den ich hab, der hat ja solche Ports und Kupfer."}, {"id": 188, "start": 964.3, "end": 969.3, "text": "Und, ähm, ich brauch noch vier weitere, äh, R- und 45-Stecker."}, {"id": 189, "start": 969.3, "end": 972.3, "text": "Ein G reicht, und dann wollt ich gucken, was so das Billigste ist."}, {"id": 190, "start": 972.3, "end": 973.3, "text": "Was sagt..."}, {"id": 191, "start": 973.3, "end": 977.3, "text": "Kann man sowas auf Guides halt suchen, sowas haben die doch nie im Leben drin, oder, oder?"}, {"id": 192, "start": 980.3, "end": 982.3, "text": "Äh, nein, nein."}, {"id": 193, "start": 982.3, "end": 984.3, "text": "Wisst ihr was, mir gehen Seiten."}, {"id": 194, "start": 984.3, "end": 986.3, "text": "Kennt ihr das, ihr geht auf eine Seite."}, {"id": 195, "start": 986.3, "end": 993.3, "text": "Und dann klickt ihr auf was, und in dem Moment, wo ihr klickt, springt das weg, weil die Seite grad weitergeladen hat."}, {"id": 196, "start": 993.3, "end": 998.3, "text": "Das ist nervig."}, {"id": 197, "start": 1001.3, "end": 1003.3, "text": "Ach guck mal, hier gibt's das für 13 Euro?"}, {"id": 198, "start": 1003.3, "end": 1005.3, "text": "Da kommen wir doch schon der Sache näher."}, {"id": 199, "start": 1005.3, "end": 1008.3, "text": "Auf Preis aufsteigend."}, {"id": 200, "start": 1008.3, "end": 1010.3, "text": "Exzellent, exzellent."}, {"id": 201, "start": 1010.3, "end": 1014.3, "text": "Ah ja, genau, 2.9.30, dann nehm ich mal einen 100er-Pack."}, {"id": 202, "start": 1015.3, "end": 1018.3, "text": "2.5.0.7, morgen auch mal wieder am Start."}, {"id": 203, "start": 1018.3, "end": 1020.3, "text": "Dazu kann ich bloß sagen."}, {"id": 204, "start": 1020.3, "end": 1024.3, "text": "Aber immer schön am Discord spammen."}, {"id": 205, "start": 1028.3, "end": 1030.3, "text": "War mein Factory, 13 Euro."}, {"id": 206, "start": 1030.3, "end": 1032.3, "text": "Das können wir tatsächlich machen."}, {"id": 207, "start": 1032.3, "end": 1037.3, "text": "Das ist das offizielle Modul von denen, eine bessere Kombination gibt's doch eigentlich nicht."}, {"id": 208, "start": 1041.3, "end": 1043.3, "text": "Was sagt die Google-Suche dazu?"}, {"id": 209, "start": 1046.3, "end": 1048.3, "text": "Ja ne, das ist doch top."}, {"id": 210, "start": 1048.3, "end": 1050.3, "text": "Jo."}, {"id": 211, "start": 1050.3, "end": 1054.3, "text": "13.29, ach gut, bei mein Factory kostet immer Versand, ne?"}, {"id": 212, "start": 1055.3, "end": 1058.3, "text": "Bei mein Factory kostet immer Versand."}, {"id": 213, "start": 1059.3, "end": 1062.3, "text": "Was? 9 fucking Euro?"}, {"id": 214, "start": 1062.3, "end": 1064.3, "text": "Was zur..."}, {"id": 215, "start": 1064.3, "end": 1067.3, "text": "Alter, was sind das für Versandkosten?"}, {"id": 216, "start": 1067.3, "end": 1072.3, "text": "Ich hab lang nicht so bei mein Factory verstanden, aber dafür kann ich ja dreimal aus China bestellen."}, {"id": 217, "start": 1073.3, "end": 1075.3, "text": "Ist echt so?"}, {"id": 218, "start": 1075.3, "end": 1078.3, "text": "Ich kann für den Preis dreimal aus China bestellen."}, {"id": 219, "start": 1079.3, "end": 1081.3, "text": "Ja, Midnight Shopping."}, {"id": 220, "start": 1081.3, "end": 1084.3, "text": "Ich will nicht Midnight shoppen, ich will jetzt shoppen."}, {"id": 221, "start": 1086.3, "end": 1088.3, "text": "Was ist denn da los?"}, {"id": 222, "start": 1088.3, "end": 1090.3, "text": "Ja, da bringt's mir auch nichts, dass das so billig ist."}, {"id": 223, "start": 1090.3, "end": 1093.3, "text": "Ich mein, dass sich der Versand da irgendwie lohnt, da müsste ich ja 5 Stück ka..."}, {"id": 224, "start": 1094.3, "end": 1096.3, "text": "Nein."}, {"id": 225, "start": 1096.3, "end": 1097.3, "text": "What?"}, {"id": 226, "start": 1097.3, "end": 1099.3, "text": "Can't wait."}, {"id": 227, "start": 1099.3, "end": 1101.3, "text": "Ich wollte..."}, {"id": 228, "start": 1102.3, "end": 1104.3, "text": "Okay, jetzt ist die Frage."}, {"id": 229, "start": 1104.3, "end": 1107.3, "text": "Ist der Shop zu dumm oder ist der Shop zu dumm?"}, {"id": 230, "start": 1117.3, "end": 1119.3, "text": "Ha, ich hab's geschafft, excellent."}, {"id": 231, "start": 1119.3, "end": 1121.3, "text": "Okay, 5 Stück, bam."}, {"id": 232, "start": 1121.3, "end": 1125.3, "text": "Lass mich mal gucken."}, {"id": 233, "start": 1129.3, "end": 1132.3, "text": "She baited!"}, {"id": 234, "start": 1139.3, "end": 1143.3, "text": "Okay, mein Factory ist too smart für mich."}, {"id": 235, "start": 1143.3, "end": 1159.9, "text": "Ja das lohnt sich nicht, guck mal, das kostet 53 Euro und nochmal 9 Euro Versand, bei Amazon"}, {"id": 236, "start": 1159.9, "end": 1170.62, "text": "hat der Kram glaube ich 17 Euro gekostet, äh, alter dieser Windows Taschenrechner ist"}, {"id": 237, "start": 1170.62, "end": 1189.04, "text": "so ein hässliches Stück Software, oh, das lohnt sich auch sogar mit Versand, ja, ich"}, {"id": 238, "start": 1189.04, "end": 1197.86, "text": "werde es mir aber trotzdem mal bei Amazon in Account legen, weil ich das sonst vergesse"}, {"id": 239, "start": 1197.86, "end": 1207.94, "text": "nachher, ich kann ja nicht von hier bestellen, ok, es ist da bis Mittwoch, wie schnell ist"}, {"id": 240, "start": 1207.94, "end": 1218.9, "text": "ein MineFactory mit Versand, aber MineFactory war bloß 3 Stück verfügbar, Fastest bis"}, {"id": 241, "start": 1218.9, "end": 1228.7, "text": "2. März, ok, oh kluge, der Name ist so, ich glaube bei dem habe ich sogar mal irgendwann"}, {"id": 242, "start": 1228.7, "end": 1236.7, "text": "schon was bestellt, aber sieht immer so, so Scam aus, ist es nicht, aber, na komm, also"}, {"id": 243, "start": 1236.7, "end": 1239.62, "text": "bei denen habe ich schon mal was bestellt, bei denen habe ich auch schon mal was bestellt,"}, {"id": 244, "start": 1239.62, "end": 1245.9, "text": "waren das nicht, waren das nicht die denen, ok komm Bam, einfach adden, einfach adden,"}, {"id": 245, "start": 1245.9, "end": 1250.1, "text": "Scheiß drauf, was habe ich da noch drin, oh was habe ich hier noch vom letzten Mal, brauche"}, {"id": 246, "start": 1250.1, "end": 1253.98, "text": "ich da noch mehr, brauche ich da noch mehr, brauche ich da noch mehr, exzellent und den"}, {"id": 247, "start": 1253.98, "end": 1259.18, "text": "habe ich schon, den brauche ich da noch mehr, also zack 5 Stück, in your face, Bam, 100"}, {"id": 248, "start": 1259.18, "end": 1268.14, "text": "Euro, so ging es gut, weiter gehts, so, kann man das ganze schon mal abhaken, äh, nochmal"}, {"id": 249, "start": 1268.14, "end": 1272.78, "text": "die Farbe nach dem bestellen, nee die sind nice, ich habe noch nicht alles gegessen,"}, {"id": 250, "start": 1272.78, "end": 1279.18, "text": "also ich habe ja hier, ich habe mal hier so ein Probierpaket bestellt, bei denen glaube"}, {"id": 251, "start": 1279.18, "end": 1286.66, "text": "ich, genau, Leute, die schlimmste Webseite, also wer die gebaut hat weiß ich nicht, das"}, {"id": 252, "start": 1286.66, "end": 1292.02, "text": "ist irgendein italienisches Weingut, was Versandhandel hat und ich habe mir da so ein Probierpaket"}, {"id": 253, "start": 1292.02, "end": 1297.86, "text": "bestellt, Nudeln und Soßen, echt gut, ja wirklich gut, die Soßen braucht man jetzt"}, {"id": 254, "start": 1297.86, "end": 1302.26, "text": "bis auf die 2 Pestos nicht unbedingt, muss man ehrlich sagen, Tomatensoße kriege ich"}, {"id": 255, "start": 1302.26, "end": 1307.94, "text": "auch hin, die brauche ich nicht von denen, aber die Webseite, Alter, die Webseite, versucht"}, {"id": 256, "start": 1307.94, "end": 1314.02, "text": "mal überhaupt den Online Shop zu finden bei denen, das ist hier oben, so, und jetzt hört"}, {"id": 257, "start": 1314.02, "end": 1329.58, "text": "schon mal auf, wo waren jetzt die Probierpakete, ähm, achja, achja, exzellent, Probier, Probierpakete"}, {"id": 258, "start": 1329.58, "end": 1339.74, "text": "für Pasta, genau, das habe ich bestellt, das da, exquisite, ne, das nicht, das da, das"}, {"id": 259, "start": 1339.74, "end": 1362.66, "text": "habe ich bestellt, richtig, richtig nice, Peppofett, das ist, das ist, das ist, ASP Classic,"}, {"id": 260, "start": 1362.66, "end": 1367.86, "text": "wer macht denn sowas, ja gut, so sieht die Seite ja auch aus, gut, auf der anderen Seite"}, {"id": 261, "start": 1367.86, "end": 1375.74, "text": "mal ganz ehrlich, die müssen Essen machen, ob die, ob die jetzt Webseiten machen können"}, {"id": 262, "start": 1375.74, "end": 1381.26, "text": "ist mir eigentlich egal, allerdings habe ich bei solchen Seiten immer Bedenken, nicht"}, {"id": 263, "start": 1381.26, "end": 1385.54, "text": "dass da mal einer die Kundendaten abzieht, weil es total unsicher ist vielleicht, oder"}, {"id": 264, "start": 1385.54, "end": 1397.3, "text": "so, Flo96, ja, aber die sind besser, da ist jede Wix-Webseite besser, ja, das sind übrigens"}, {"id": 265, "start": 1397.3, "end": 1401.58, "text": "so Sachen, denen würde ich eindeutig empfehlen, sie sollen sich irgendwie einen Shopify, was"}, {"id": 266, "start": 1401.58, "end": 1406.22, "text": "gibt es noch, Shopware, was auch immer, einfach einen Shop da drüber machen und sich um nichts"}, {"id": 267, "start": 1406.22, "end": 1418.18, "text": "Gedanken machen, easy, vix.com, ja, können sie auch, kennt jemand, kennt jemand, ähm,"}, {"id": 268, "start": 1418.18, "end": 1429.46, "text": "ach, wie war das, node.js, Github, Key, Keystone, taugt das, taugt das was, kennt das jemand,"}, {"id": 269, "start": 1429.46, "end": 1435.06, "text": "ich hab letztens ein Video gesehen, da hat einer eine Webseite mit der Sache als, da"}, {"id": 270, "start": 1435.06, "end": 1445.9, "text": "hat einen Shop gebaut mit der Sache als Backend, das ist eigentlich ganz nice aus, ja, also"}, {"id": 271, "start": 1445.9, "end": 1449.3, "text": "wie gesagt, das hatte ich mir bestellt, das ist jetzt angekommen, man kriegt viermal"}, {"id": 272, "start": 1449.3, "end": 1455.98, "text": "Nudeln, viermal Soßen und das Gute ist, die Nudeln sind eine komplett andere, äh, wie"}, {"id": 273, "start": 1455.98, "end": 1465.18, "text": "soll ich sagen, viel, viel, ähm, schwerer so als die Lidl-Nudeln, ja, also sprich, hier,"}, {"id": 274, "start": 1465.18, "end": 1472.38, "text": "ich weiß nicht, wie man das ausspricht, Fusilli, Fusilli, wie auch immer, wenn du davon ein"}, {"id": 275, "start": 1472.38, "end": 1477.1, "text": "paar isst, dann bist du richtig satt den ganzen Tag, wenn du die Nidl, die, die, die, die,"}, {"id": 276, "start": 1477.1, "end": 1485.58, "text": "was, Nidl, Nidl, wenn du Nidl-Dinger futterst, die sind nicht Vollkorn, ne, das sind keine"}, {"id": 277, "start": 1485.58, "end": 1492.14, "text": "Vollkorn, das ist Dinkel, ach, frag mich, das steht doch irgendwo dabei, ach, die Seite,"}, {"id": 278, "start": 1492.14, "end": 1498.58, "text": "die Seite ist so schlecht, wie, ach, hier kriegt man die Details, genau, hier, äh,"}, {"id": 279, "start": 1498.58, "end": 1506.42, "text": "hat mal jetzt, hat, ne, das da, ach doch, doch Vollkorn, genau, ähm, normalerweise, normalerweise"}, {"id": 280, "start": 1506.42, "end": 1511.1, "text": "bin ich kein großer Vollkorn-Fan, aber die schmecken echt gut und auch die normalen,"}, {"id": 281, "start": 1511.1, "end": 1516.74, "text": "auch die normalen, die sind, ähm, wirklich viel, viel gehaltvoller, also wenn du da"}, {"id": 282, "start": 1516.74, "end": 1521.58, "text": "einen Teller oder zwei futterst, da bist du echt, da bist du nicht nur pepofett, da"}, {"id": 283, "start": 1521.58, "end": 1529.1, "text": "bist du auch pepo-satt, ja, und wenn, und, und wenn ihr es voll übertreiben wollt, dann"}, {"id": 284, "start": 1529.1, "end": 1536.18, "text": "bestellt, dann bestellt das große Fest beginnt, Alter, allerdings würde ich das nicht bestellen,"}, {"id": 285, "start": 1536.18, "end": 1539.86, "text": "weil ich bin kein großer Weintrinker und da sind halt irgendwie einfach mal sechs Flaschen"}, {"id": 286, "start": 1539.86, "end": 1543.82, "text": "Wein dabei, ich bin nur auf das andere Zeug scharf, der Wein interessiert mich überhaupt"}, {"id": 287, "start": 1543.82, "end": 1554.74, "text": "nicht, der kleine Toskana, ja, zu viel, viel zu viel Wein, Alter, okay, das ist ein Weingut,"}, {"id": 288, "start": 1554.74, "end": 1558.46, "text": "es ist kein Wunder, dass die Wein verkaufen, aber es ist wirklich, also es schmeckt echt"}, {"id": 289, "start": 1558.46, "end": 1563.26, "text": "gut, kann man auf jeden Fall empfehlen, Biertrinker, nö, auch nicht, weder Wein noch Bier, ich"}, {"id": 290, "start": 1563.26, "end": 1566.94, "text": "trinke eigentlich so gut wie gar nix, das eigentliche, das einzige, was ich ab und zu"}, {"id": 291, "start": 1566.94, "end": 1570.54, "text": "mal trinke, also ich bin jetzt auch niemand, der so, so fast schon klaumsmäßig sagt,"}, {"id": 292, "start": 1570.54, "end": 1574.7, "text": "äh, kein Tropfen Alkohol oder so, aber das einzige, was ich trinke, ist vielleicht mal"}, {"id": 293, "start": 1574.7, "end": 1586.66, "text": "irgendwas an Silvester oder Weihnachten bisschen, aber das ist auch nicht viel, auch kein Wodka,"}, {"id": 294, "start": 1586.66, "end": 1594.94, "text": "Wodka schmeckt mir gar nicht, als Kokomodts Anzeige ist raus, aber, nö, einzige, was"}, {"id": 295, "start": 1594.94, "end": 1599.74, "text": "mir schmeckt, ist Whisky, wenn es ein Gescheiter ist, aber dann auch nicht mit Rauch, der so"}, {"id": 296, "start": 1599.74, "end": 1606.7, "text": "nach Zahnarzt schmeckt, sondern, äh, so, normalen, oh, excellent, das ist schon gut,"}, {"id": 297, "start": 1606.7, "end": 1611.94, "text": "ey, das ist, Moment, das ist bei denen im Shop, Moment, ey, ernsthaft, bei denen im Shop ist"}, {"id": 298, "start": 1611.94, "end": 1628.98, "text": "es am billigsten von allen, okay, nice, äh, was ist mit den Shops heute los?"}, {"id": 299, "start": 1628.98, "end": 1643.5, "text": "Haben die heute alle keinen Bock zu funktionieren, oder was, what, what, okay, ist vorbei, Leute,"}, {"id": 300, "start": 1643.5, "end": 1651.74, "text": "der Shop ist, der Shop ist RIP, keine Ahnung, was der macht, 13 mit Steuern, das ist durchaus"}, {"id": 301, "start": 1651.74, "end": 1658.34, "text": "in Ordnung, das hat es bei den anderen ja mehr gekostet, was kostet denn der Versand,"}, {"id": 302, "start": 1658.34, "end": 1665.62, "text": "Free Express Shipping for orders over, okay Leute, wisst ihr, was wir machen, okay, wir"}, {"id": 303, "start": 1665.62, "end": 1670.94, "text": "gucken mal, was das Shipping kostet, ich bestell mir noch ein Access Point dabei, lul, weh,"}, {"id": 304, "start": 1670.94, "end": 1682.14, "text": "dann komm ich über 120 Euro, ich hasse es, ich hasse es einfach so, wenn man sich einloggen"}, {"id": 305, "start": 1682.14, "end": 1694.86, "text": "muss, dass man den Versand sieht, das ist so eklig, FAQ, in FAQ steht jetzt okay, aber"}, {"id": 306, "start": 1694.86, "end": 1714.9, "text": "trotzdem, sucked, alter, massive sucked, Shipping, ähm, in Prag sind sie am Start an, Savote,"}, {"id": 307, "start": 1714.9, "end": 1721.98, "text": "das kenne ich, das ist eine Map, das ist die Fabrik Map aus Battlefield 4, aber mehr kenne"}, {"id": 308, "start": 1721.98, "end": 1731.58, "text": "ich davon nicht, das heißt bestimmt sowas wie Industriegebiet oder sowas, okay, was"}, {"id": 309, "start": 1731.58, "end": 1739.22, "text": "kostet das Shipping denn sonst, UPS, okay UPS, UPS war früher, hat übelst gesucked,"}, {"id": 310, "start": 1739.22, "end": 1747.74, "text": "weil sie Samstag nicht ausgeliefert haben, mittlerweile geht's, ja, was kostet es jetzt,"}, {"id": 311, "start": 1747.74, "end": 1753.86, "text": "Shipping is a small fee, small, man kann 3 mal aus China bestellen für den gleichen"}, {"id": 312, "start": 1753.86, "end": 1765.86, "text": "Preis, small, so small ist das alles, okay, also, dann sind wir einfach mal so, okay,"}, {"id": 313, "start": 1765.86, "end": 1788.78, "text": "wir machen, okay, das ist, ich muss für 120 Euro ohne Steuern bestellen, soll ich mir"}, {"id": 314, "start": 1788.78, "end": 1797.58, "text": "da alles bestellen, Wireless Products, okay, haben die, haben die schon den Wi-Fi 6 Access"}, {"id": 315, "start": 1797.58, "end": 1808.62, "text": "Point hier am Start, das wäre noch mal eine Idee, wie hieß das Ding noch mal, UniFi 6"}, {"id": 316, "start": 1808.62, "end": 1828.26, "text": "oder so, Early Access, sehe ich das Early Access Hardware, ich meine, bei Spielen verstehe"}, {"id": 317, "start": 1828.26, "end": 1833.46, "text": "ich es ja noch, aber man kann es auch übertreiben, kaufst du den Early Access Switch und kannst"}, {"id": 318, "start": 1833.46, "end": 1840.34, "text": "es erst mal ein Jahr nicht verwenden, das ist auch geile, geile Taktik, ah, hier Access"}, {"id": 319, "start": 1840.34, "end": 1846.42, "text": "Points, warum genau sind Access Points nicht unter Wireless Products, was, was haben die"}, {"id": 320, "start": 1846.42, "end": 1853.22, "text": "sich da gedacht, also ich würde jetzt, ich würde jetzt Access Point ehrlich gesagt unter"}, {"id": 321, "start": 1853.22, "end": 1871.78, "text": "Wireless Products vermuten, ah, die Musik, hat es hier jemand gespielt, by the way, Ahead"}, {"id": 322, "start": 1871.78, "end": 1882.62, "text": "in Time, ja, ist richtig nice, ich habe es mir gekauft, ich habe es noch nicht gespielt,"}, {"id": 323, "start": 1882.62, "end": 1888.58, "text": "aber ich finde den Soundtrack schon mal nice, okay, haben die jetzt den, ah, hier, der,"}, {"id": 324, "start": 1888.58, "end": 1895.3, "text": "der, guck mal da, da, das ist, das ist der mit Wi-Fi 6, komm ich denn da jetzt über"}, {"id": 325, "start": 1895.3, "end": 1917.02, "text": "120 Euro, ohne, ohne, ohne Tax, ja, sag mal, was ist denn heute mit den Shops los, ach"}, {"id": 326, "start": 1917.02, "end": 1933.42, "text": "nee, was, Null, ich musste mich da einloggen dafür, okay, aber, aber 80 und 55 ist über"}, {"id": 327, "start": 1933.42, "end": 1956.98, "text": "120, das sind 125, nee, 135, das wird funktionieren, das ist nice, das kaufe ich mir, glaube ich,"}, {"id": 328, "start": 1956.98, "end": 1963.5, "text": "90 Euro mehr ausgeben, um 12 Euro zu sparen, ja, eigentlich hast du recht, eigentlich ist"}, {"id": 329, "start": 1963.5, "end": 1968.1, "text": "bescheuert, eigentlich ist richtig dumm, warum mache ich das denn jetzt eigentlich, kann"}, {"id": 330, "start": 1968.1, "end": 1973.82, "text": "mir das jemand mal erklären, das ist, das ist richtig bescheuert, das ist die typische"}, {"id": 331, "start": 1973.82, "end": 1984.78, "text": "Sache von sinnlos Geld ausgeben, weil man denkt, man spart irgendwas, ich brauche kein"}, {"id": 332, "start": 1984.78, "end": 1993.42, "text": "Wi-Fi 6, ich habe nicht ein Gerät, was Wi-Fi 6 kann, oder kann mein iPhone Wi-Fi 6, Leute,"}, {"id": 333, "start": 1993.42, "end": 2003.06, "text": "ihr wisst das besser als ich, kann man, kann mein iPhone Wi-Fi 6, ich glaube nicht, ich"}, {"id": 334, "start": 2003.06, "end": 2026.38, "text": "habe ein iPhone XE, XR, XS oder so, ich habe kein Gerät, was das kann, was, USW Flex Mini,"}, {"id": 335, "start": 2026.38, "end": 2039.26, "text": "was ist denn das, nee, das brauche ich nicht, Switcher habe ich genug, 5 Port managt, Gigabit"}, {"id": 336, "start": 2039.26, "end": 2056.38, "text": "ist an der Switchport, kann er selbst PoE machen, stelle die Sachen bei Butcher, was"}, {"id": 337, "start": 2056.38, "end": 2064.62, "text": "für ein Ding, Butcher, achso, bei denen haben wir geguckt, die waren auch nicht billiger"}, {"id": 338, "start": 2064.62, "end": 2082.78, "text": "als bei Amazon, hatten wir doch geguckt hier, hier, da kostet sogar 19 Euro, guck mal, in"}, {"id": 339, "start": 2082.78, "end": 2087.98, "text": "den Chat so können wir nicht weiter, warum genau, warum genau soll ich, wenn 5 Ports"}, {"id": 340, "start": 2087.98, "end": 2111.1, "text": "damit machst du gar nichts, also, was genau, wozu ist er gut, kann er selbst PoE, nee,"}, {"id": 341, "start": 2111.1, "end": 2130.1, "text": "das ist nur Input, nee, 23, da kommen ja auch Steuern dabei, das kostet 27, was ist, geh"}, {"id": 342, "start": 2130.1, "end": 2136.86, "text": "über GH, schick mal den Link, ich habe keine Ahnung was du meinst, ja gut, aber ich will"}, {"id": 343, "start": 2136.86, "end": 2143.26, "text": "meinen Switch gerade nicht mit dem Unify Controller managen, ich muss euch ehrlich sagen ich bin"}, {"id": 344, "start": 2143.26, "end": 2148.78, "text": "eh kein großer Fan vom Unify Controller, nee, wir haben jetzt lange genug geguckt, ich bestelle"}, {"id": 345, "start": 2148.78, "end": 2151.78, "text": "die jetzt bei Amazon, entweder bestelle ich die mir hier und bestelle mir noch ein Access"}, {"id": 346, "start": 2151.78, "end": 2157.26, "text": "Point dabei oder bestelle die bei Amazon einfach, Transoflex, ja mit denen habe ich mal eine"}, {"id": 347, "start": 2157.26, "end": 2165.98, "text": "Antenne bestellt vor zig Jahren, kam irgendwann um 21.30 die Typen, achso, bei Guides halt,"}, {"id": 348, "start": 2165.98, "end": 2180.74, "text": "nee, bei Guides Hals haben wir geguckt und bei Guides Hals waren die, ach guck mal, ja"}, {"id": 349, "start": 2180.74, "end": 2189.54, "text": "Moment, aber da kommt da wieder Versand dabei, was haben die für Versand, 5 Stück, oh es"}, {"id": 350, "start": 2189.54, "end": 2199.42, "text": "gibt nur noch 2, und jetzt ist auch, die Dinger können sie wahr, also heute sind die Shopseiten"}, {"id": 351, "start": 2199.42, "end": 2206.14, "text": "echt alle gegen mich, ok 3,56 Euro Versand, das ist gut, das mal, ich habe keinen Bock"}, {"id": 352, "start": 2206.14, "end": 2211.38, "text": "ab 0 Uhr zu bestellen, ich will das jetzt bestellen, genau wir gehen auf den Preischamp"}, {"id": 353, "start": 2211.38, "end": 2224.42, "text": "und gucken, maximal 2, ok es ist unglaublich schwer heute Sachen zu bestellen, wisst ihr"}, {"id": 354, "start": 2224.42, "end": 2228.86, "text": "was, ich bleibe jetzt einfach bei Amazon, easy, ich bestelle mir 5 Stück und lecke mich,"}, {"id": 355, "start": 2228.86, "end": 2236.46, "text": "dann ist Ruhe, oder wenn ich das nicht mache, dann bestelle ich gleich hier, nee, aber die"}, {"id": 356, "start": 2236.46, "end": 2242.26, "text": "Switche brauche ich, also wenn schon, bestelle ich mir noch einen Axis Point dabei, easy,"}, {"id": 357, "start": 2242.26, "end": 2248.3, "text": "etwas kommen, da waren die auch nicht billiger, da haben sie glaube ich 19 Euro gekostet,"}, {"id": 358, "start": 2248.3, "end": 2263.54, "text": "Nano HD, hä, ich, Leute, ich checke das Pricing bei den Axis Points nicht so ganz, warum kostet"}, {"id": 359, "start": 2263.54, "end": 2272.82, "text": "der Nano HD einfach das doppelte von dem, von dem Lite Unify 6, hat er weniger Antennen"}, {"id": 360, "start": 2272.82, "end": 2285.94, "text": "oder, oder, oder was, oder wie, oder, ok, 2x2, Unify 6, dann hat er 2x2, 2x2 und der"}, {"id": 361, "start": 2285.94, "end": 2305.22, "text": "hat 4x4 und 2x2, ja gut aber auch, gut das ist wenn man, wenn man 50 Leute bei sich daheim"}, {"id": 362, "start": 2305.22, "end": 2313.22, "text": "hat, also ich habe aktuell, ich habe aktuell UAP Pro, das war das erste was ich mir gekauft"}, {"id": 363, "start": 2313.22, "end": 2319.9, "text": "habe von denen, da war ich echt zufrieden mit und da bin ich auch froh, dass ich den"}, {"id": 364, "start": 2319.9, "end": 2323.06, "text": "habe, nämlich da konnte ich an den zweiten Port noch den Raspberry Pi anschließen mit"}, {"id": 365, "start": 2323.06, "end": 2329.38, "text": "Unify Controller, was hast du für einen 3D Drucker, einen i3 Mega S habe ich seit 2"}, {"id": 366, "start": 2329.38, "end": 2353.62, "text": "Jahren oder so, den habe ich, exellent und der ist by the way mittlerweile circa doppelt"}, {"id": 367, "start": 2353.62, "end": 2359.46, "text": "so teuer geworden, Moment das ist das falsche, das ist der falsche, Mega S und der ist auch"}, {"id": 368, "start": 2359.46, "end": 2367.86, "text": "teuer, ich habe den für 230 Euro damals gekauft, ja, hier, lol, warum ist der Kram so teuer,"}, {"id": 369, "start": 2367.86, "end": 2373.74, "text": "schon eine Waffe gedruckt, ich wüsste noch nicht mal wo ich dann wahrscheinlich das"}, {"id": 370, "start": 2373.74, "end": 2379.66, "text": "Ding über was, und da brauchst du ja immer noch ein Metalllauf, ne habe ich nicht, habe"}, {"id": 371, "start": 2379.66, "end": 2388.66, "text": "ich auch nicht vor, aber wenn man laut Boulevard Medien geht, dann sind 3D Drucker super gefährlich,"}, {"id": 372, "start": 2388.66, "end": 2413.18, "text": "weil die Leute sich damit ja Maschinenpistolen ausdrucken oder so was, so, also mal, wir"}, {"id": 373, "start": 2413.18, "end": 2420.06, "text": "sehen uns dann wieder, ich habe eine doppelte Steckdose gekauft an Weihnachten, die konnte"}, {"id": 374, "start": 2420.06, "end": 2438.62, "text": "sogar Stromverbrauch messen und die war echt nice, wenn ich die jetzt noch finde, die sahen"}, {"id": 375, "start": 2438.62, "end": 2459.82, "text": "so ähnlich aus wie die, Gesund hatte ich genau, Gesund, oder Gosund, da hatte ich die Zweier,"}, {"id": 376, "start": 2459.82, "end": 2471.86, "text": "wo ist denn das, wenn Gosund kein Corona mehr hat, heißen sie Gesund, Pains Champ, witz,"}, {"id": 377, "start": 2471.86, "end": 2486.9, "text": "ich weiß, rechts, ne, also ich weiß aber nicht ob man die noch flaschen kann, die gibt's"}, {"id": 378, "start": 2486.9, "end": 2501.58, "text": "überhaupt nicht mehr, what the fuck, also die hatte ich, ne, die gibt's anscheinend"}, {"id": 379, "start": 2501.58, "end": 2521.46, "text": "nicht mehr, so wie es aussieht und ist wahrscheinlich auch nicht mehr flashbar, ne, dann kann ich"}, {"id": 380, "start": 2521.46, "end": 2539.62, "text": "dir nix empfehlen, das ist bisschen das Problem, dass das China Zeug so inkonsistent ist, ja"}, {"id": 381, "start": 2539.62, "end": 2544.54, "text": "meine musste man auch löten, haben wir sogar im Stream gemacht, das löten, könnt ihr"}, {"id": 382, "start": 2544.54, "end": 2552.26, "text": "euch noch dran erinnern, das war der Stream, das muss ich euch mal zeigen, das war der Stream,"}, {"id": 383, "start": 2552.26, "end": 2560.18, "text": "wo ich die Steckdose fast auseinandergebrochen hab, Moment, Moment, das muss ich mir jetzt"}, {"id": 384, "start": 2560.18, "end": 2570.98, "text": "noch mal kurz schief angucken, warte mal, das war 2020 und es war wahrscheinlich im November,"}, {"id": 385, "start": 2570.98, "end": 2594.26, "text": "hier, hier, guck da, gleich verbiege ich, gleich verbiege ich, das Ding ist am Ende,"}, {"id": 386, "start": 2594.26, "end": 2606.54, "text": "wenn ich fertig bin mit der Steckdose ist das Ding 30 Grad gebogen, ach by the way und danach"}, {"id": 387, "start": 2606.54, "end": 2610.02, "text": "bin ich drauf gekommen, man muss das gar nicht aufbrechen, sondern man kann einfach"}, {"id": 388, "start": 2610.02, "end": 2620.7, "text": "vorne aufschrauben, da sind die Schrauben drunter Leute, da muss man einfach, ich hab's"}, {"id": 389, "start": 2620.7, "end": 2626.06, "text": "nachher hab ich es erst gecheckt, hier muss man einfach durchstechen mit dem Schraubenzieher"}, {"id": 390, "start": 2626.06, "end": 2630.3, "text": "und da kann man das auf, also nicht hier, sondern hier irgendwie so war das, da kann"}, {"id": 391, "start": 2630.3, "end": 2637.9, "text": "man es einfach aufschrauben, total easy und ich krieg, ich krieg es nicht auf, Alter,"}, {"id": 392, "start": 2637.9, "end": 2643.82, "text": "ich krieg es nicht auf, das ist nicht wichtig tun mit Schraubendreher und Schraubenzieher,"}, {"id": 393, "start": 2643.82, "end": 2652.54, "text": "das sind wir immer die Liebsten, ich krieg es einfach, guck mal, da hab ich's, guck mal,"}, {"id": 394, "start": 2652.54, "end": 2666.7, "text": "ich hab's offen, Poggers, guck's euch an, Moment, wo hab ich's aufgekriegt, hier, Moment,"}, {"id": 395, "start": 2666.7, "end": 2678.46, "text": "jetzt, jetzt volle Pulle Max, gib's ihm, gib's ihm, habt ihr die Ecke gesehen, guck mal die"}, {"id": 396, "start": 2678.46, "end": 2702.1, "text": "Ecke an, so und jetzt volle Pulle mit dem Schraub, auf, guck mal, das ist verbogen,"}, {"id": 397, "start": 2702.1, "end": 2708.66, "text": "und jetzt komm, ich weiß noch, ich hab das mit dem Werra Schraubenzieher gemacht und"}, {"id": 398, "start": 2708.66, "end": 2722.5, "text": "dann ging's auf, rohe Gewaltschamp, ja, volle, volle, volle, volle, jawoll, gib's ihm, auf,"}, {"id": 399, "start": 2722.5, "end": 2729.98, "text": "auf, gleiches Gehäuse kaputt, Alter, es mag jetzt jemand sagen, man sollte die Steckdose"}, {"id": 400, "start": 2729.98, "end": 2743.74, "text": "nach dieser Behandlung nicht mehr verwenden, aber warum nicht, ja, Achtung, Max, du schaffst's,"}, {"id": 401, "start": 2743.74, "end": 2747.98, "text": "ich weiß, dass es aufgeht, ich hab's, ich kann mich doch, Bäm, jetzt, es ist dann innen"}, {"id": 402, "start": 2747.98, "end": 2752.58, "text": "drin, da war es abgebrochen, guck, zack, jetzt hab ich's offen, so und dann haben wir es"}, {"id": 403, "start": 2752.58, "end": 2757.66, "text": "irgendwann, also so wie das ging, dann musste man dranlöten, dann musste man den Flesher,"}, {"id": 404, "start": 2757.66, "end": 2763.46, "text": "den Flesher dranlöten, ich hab einen Fünferpack oder so gekauft, ja, ich hab genug, dann haben"}, {"id": 405, "start": 2763.46, "end": 2769.86, "text": "wir den Flesher dran gelötet, irgendwie, na, ich musste gucken, wo man das anschließen"}, {"id": 406, "start": 2769.86, "end": 2785.82, "text": "muss, da haben wir gemessen, wo man anschließen muss und, ja, stream, please, okay, wir dürfen"}, {"id": 407, "start": 2785.82, "end": 2790.82, "text": "nicht mehr gucken, alles klar, ah, jetzt, naja, gut, was auch immer, ich wollte es mir"}, {"id": 408, "start": 2790.82, "end": 2797.62, "text": "bloß nochmal angucken, weil, da bin ich echt fast verzweifelt an der Geschichte, ja, okay,"}, {"id": 409, "start": 2797.62, "end": 2806.58, "text": "schauen wir mal schnell noch, Chat, also, weil, wie gesagt, kann ich hier gerade nichts sagen,"}, {"id": 410, "start": 2806.58, "end": 2812.14, "text": "wenn es die nicht mehr gibt und die sich nicht mehr flashen lassen, dann vorbei, wie gesagt,"}, {"id": 411, "start": 2812.14, "end": 2828.78, "text": "ich wasche die E3 mega S, so hab ich irgendwas übersehen, Mario, danke für den Sub, ah,"}, {"id": 412, "start": 2828.78, "end": 2839.62, "text": "überhaupt nicht aufgepasst, er, Tier 1 Subscription, massive, es ist, ich hab nicht mal eingeredet,"}, {"id": 413, "start": 2839.62, "end": 2842.1, "text": "Wi-Fi 6 kann da brauche ich kein Wi-Fi 6 access point"}, {"id": 414, "start": 2847.3, "end": 2849.3, "text": "Wegmachs"}, {"id": 415, "start": 2859.86, "end": 2862.42, "text": "Welchen hast du dir geholt den"}, {"id": 416, "start": 2862.42, "end": 2867.86, "text": "Den css 610 oder welchen switch"}, {"id": 417, "start": 2872.02, "end": 2877.14, "text": "Wie funktioniert sfp plus ports eigentlich warum sind die besser die sind nicht unbedingt besser"}, {"id": 418, "start": 2878.34, "end": 2882.9, "text": "Aber die hardware ist im 10 gigabit bereich günstiger"}, {"id": 419, "start": 2882.9, "end": 2892.1, "text": "Oliver 301 sagst du für den primes ab ich muss mal kurz gucken dass ich nicht wieder zig subs übersehen habe"}, {"id": 420, "start": 2895.54, "end": 2901.22, "text": "Doch habe ich silvi 2020 sieben vor sieben minuten aus subscrib dankeschön für den sub"}, {"id": 421, "start": 2902.9, "end": 2904.9, "text": "Exzellenz subscription"}, {"id": 422, "start": 2905.3, "end": 2909.62, "text": "Den haben wir dann sonst noch den super hacker super hecker"}, {"id": 423, "start": 2909.62, "end": 2916.1, "text": "Aber nicht hat nur gefollowed jebaited twitch aber folos sind auch nice"}, {"id": 424, "start": 2919.46, "end": 2921.46, "text": "Mario danke für den sub"}, {"id": 425, "start": 2922.42, "end": 2927.4, "text": "Kifken hat gesappt 16 monate das ist ja schon richtig hyper subscription"}, {"id": 426, "start": 2932.34, "end": 2935.08, "text": "Der ice freak 15 monate"}, {"id": 427, "start": 2935.08, "end": 2939.88, "text": "Nice killfell am start vier monate dankeschön"}, {"id": 428, "start": 2940.76, "end": 2942.76, "text": "Danto der dankeschön primes ab"}, {"id": 429, "start": 2943.08, "end": 2947.8, "text": "Massive k-gaming primes ab dankeschön jetzt geht es aber hier alles übersehen"}, {"id": 430, "start": 2950.84, "end": 2953.88, "text": "Vollkorn mishpro ist auch zwölf monate mit am start"}, {"id": 431, "start": 2953.88, "end": 2963.96, "text": "Nein, nicht wirklich falsch falsch falscher knopf"}, {"id": 432, "start": 2964.92, "end": 2966.92, "text": "Danke für den sub"}, {"id": 433, "start": 2967.72, "end": 2972.84, "text": "Ich glaube jetzt habe ich alles poggers nice ok"}, {"id": 434, "start": 2972.84, "end": 2980.12, "text": "Gut ich glaube ich habe ich alles als falschen was übersehen habe dann sagt bescheid"}, {"id": 435, "start": 2991.24, "end": 2995.64, "text": "Die so noch dinger kann man im zweifelsfall immer nehmen ja aber die so noch dinger sind ja"}, {"id": 436, "start": 2995.64, "end": 3005.64, "text": "Also die ursprünglichen so noch sind ja was wo du ein kabel durchschneiden musstest und reinklemmen die haben aber mittlerweile glaube ich auch steckdosen"}, {"id": 437, "start": 3006.52, "end": 3010.44, "text": "Aber dann würde ich mir lieber irgendeine fertig steckdose kaufen oder sowas"}, {"id": 438, "start": 3010.44, "end": 3016.6, "text": "Wie gesagt hätte ich machen sollen aber nachher ist man immer schlauer wie gesagt ich hätte mir auch 2000 um apple-aktien kaufen sollen"}, {"id": 439, "start": 3016.6, "end": 3022.76, "text": "Kann man ja kann man ja schlecht als maß stattnehmen was macht eigentlich der bitcoin kurs gerade so"}, {"id": 440, "start": 3026.36, "end": 3028.36, "text": "Geht wieder ein bisschen runter"}, {"id": 441, "start": 3028.36, "end": 3038.2, "text": "Dann wäre jetzt ja genau das richtige zum bitcoin kaufen"}, {"id": 442, "start": 3040.52, "end": 3042.52, "text": "Dazu kann ich bloß sagen"}, {"id": 443, "start": 3042.52, "end": 3055.64, "text": "Würdest du den raspberry pi nur an den access point anschließen oder auch über ein netzwerkswitch"}, {"id": 444, "start": 3055.64, "end": 3072.92, "text": "Das ist egal vollkommen egal"}, {"id": 445, "start": 3072.92, "end": 3090.2, "text": "Kannst du machen wie du willst macht keinen unterschied ich habe das am raspberry pi angeschlossen da muss ich unten kein switch mehr hinstellen"}, {"id": 446, "start": 3090.2, "end": 3103.72, "text": "Oh banger musik hier habe ich keine habe ich keine massive headbang musik oder sowas doch hier"}, {"id": 447, "start": 3103.72, "end": 3112.92, "text": "So weiter gehts also jetzt haben wir den kram endlich mal abgehakt ich bestelle mir einfach den kram bei amazon und gut ist"}, {"id": 448, "start": 3112.92, "end": 3114.92, "text": "Next"}, {"id": 449, "start": 3114.92, "end": 3137.08, "text": "So wo ist meine einkaufsliste weiter gehts"}, {"id": 450, "start": 3137.08, "end": 3160.84, "text": "Dann brauche ich hast du pokemonkarten ich finde diesen pokemonkarten trennt so unglaublich hängen geblieben"}, {"id": 451, "start": 3160.84, "end": 3170.12, "text": "Aber wer will solls machen"}, {"id": 452, "start": 3170.12, "end": 3178.12, "text": "Das ist lange herr das ist ja klar das lief das lief 1995 lief lief das auf auf mtv richtig"}, {"id": 453, "start": 3178.12, "end": 3191.24, "text": "Also weiter gehts"}, {"id": 454, "start": 3191.24, "end": 3209.4, "text": "Ich brauche ein set an rack schrauben und muttern und käfighalterungsdinger denn wie man hier sieht da müssen noch welche rein dass ich den server festschrauben kann"}, {"id": 455, "start": 3209.4, "end": 3221.64, "text": "Ja guck der server ist noch nicht festschraubt der hängt da so rum und ich habe hier noch ein paar schienen die sieht man hier glaube"}, {"id": 456, "start": 3221.64, "end": 3233.72, "text": "Ganz am Anfang sieht man die schienen da sieht man die schienen und ich will noch die schienen ins rack bauen dass ich den server ordentlich rein rausziehen kann"}, {"id": 457, "start": 3233.72, "end": 3244.92, "text": "Aber ich habe keine schrauben mehr deswegen gucken wir mal irgendwie da gibt es bestimmt irgendwie fertiges sets oder sowas sowas hier genau easy da"}, {"id": 458, "start": 3244.92, "end": 3249.56, "text": "Delikon"}, {"id": 459, "start": 3249.56, "end": 3260.36, "text": "Im Prinzip eh alles der gleiche der gleiche müll man könnte eigentlich wisst ihr was man machen könnte jetzt wo ich das gerade sehe"}, {"id": 460, "start": 3260.36, "end": 3273.16, "text": "Ich könnte schwarze schrauben nehmen dann würde es besser zum rack passen was meint ihr silberne schrauben oder schwarze schrauben"}, {"id": 461, "start": 3273.16, "end": 3286.28, "text": "Ich finde das mit dem silber gar nicht so schlecht weil die weil die anschlüsse auch silber sind"}, {"id": 462, "start": 3286.28, "end": 3294.44, "text": "Warum liegt das alles auf dem boden weil ich gerade das rack umbaue da ist die meiste sachen gar nicht angeschlossen und hier eigentlich die sachen sind auch noch teilweise gar nicht drinne"}, {"id": 463, "start": 3294.44, "end": 3311.56, "text": "Ja a big tech a big schrack ein kontrast ist ganz nice wisst ihr was wir einfach machen was heißt was wir ja doch was wir machen ist ja eigentlich schon in gewisser weise richtig"}, {"id": 464, "start": 3311.56, "end": 3331.88, "text": "Weil dadurch dass die leute wieder prime sub haben habe ich jetzt das geld und kann mir einfach beide schraubensets kaufen ich kaufe mir einfach das da und warum sind die warum kosten eigentlich das schwarze set warum kostet das eigentlich das doppelte"}, {"id": 465, "start": 3331.88, "end": 3360.68, "text": "Warum kostet das das doppelte black schrauben matters ach hier guck mal hier ist auch billiger exzellent exzellent da kaufen wir nämlich das ach so das sind nur 20 ach weil es mehr sind das ist ein 20er set"}, {"id": 466, "start": 3360.68, "end": 3386.92, "text": "Das hier ist ein 50er set aber hier kostet es 20 auch noch dann nehmen wir das dann nehmen wir einfach das gleiche dann nehmen wir einfach das gleiche einmal in silber und einmal in schwarz da habe ich genug zack perfekt abgehakt nächstes"}, {"id": 467, "start": 3391.56, "end": 3395.88, "text": "100er set boah alter ein 100er set"}, {"id": 468, "start": 3395.88, "end": 3405.72, "text": "Ich hol mir kein 100er set ich geb wieder uns ich geb wieder viel zu viel Geld dann aus für sinnloses täuscht was ich ehren brauch ich brauch kein 100er set"}, {"id": 469, "start": 3405.72, "end": 3410.52, "text": "Das rack ist voll bis auf ein paar schrauben das reicht da hab ich noch genug bonus"}, {"id": 470, "start": 3410.52, "end": 3413.56, "text": "So next also abhaken"}, {"id": 471, "start": 3413.56, "end": 3415.56, "text": "So ich brauch ein teppich"}, {"id": 472, "start": 3415.56, "end": 3418.52, "text": "Ich brauch ein teppichmesser hab ich festgestellt"}, {"id": 473, "start": 3418.52, "end": 3426.6, "text": "Und zwar hier ist ja meine exquisite werkzeugswand im hintergrund zu sehen am anfang guckt euch das mal an hier"}, {"id": 474, "start": 3426.6, "end": 3432.6, "text": "Ist das nicht stylisch musst du dazugeben oder hat schon was oder"}, {"id": 475, "start": 3432.6, "end": 3438.6, "text": "Hat schon was"}, {"id": 476, "start": 3438.6, "end": 3440.6, "text": "Werra Werkzeug Flex"}, {"id": 477, "start": 3440.6, "end": 3450.6, "text": "Was denn das"}, {"id": 478, "start": 3450.6, "end": 3454.6, "text": "Ah das ist eine netzwerkdose für die wand"}, {"id": 479, "start": 3454.6, "end": 3458.6, "text": "Teppichmesser um in offenbach zu überleben genau"}, {"id": 480, "start": 3458.6, "end": 3466.6, "text": "Und mir ist aufgefallen beim öffnen von sachen und sonst wie manchmal kommste da mit der schere nicht geschaut durch"}, {"id": 481, "start": 3466.6, "end": 3470.6, "text": "Ja sowas habe ich schon ja ja"}, {"id": 482, "start": 3470.6, "end": 3474.6, "text": "Deswegen brauche ich habe mich letztens von denen ein richtig cooles messer gesehen"}, {"id": 483, "start": 3474.6, "end": 3480.6, "text": "Also kein kein haftbefehl bahnhof messer sondern was zum teppich schneiden"}, {"id": 484, "start": 3480.6, "end": 3488.6, "text": "Und das fand ich eigentlich ganz nice ich glaube es war das set hier aus dem normalen teppichmesser und aus dem da"}, {"id": 485, "start": 3488.6, "end": 3494.6, "text": "Ja das ist nice exquisite"}, {"id": 486, "start": 3494.6, "end": 3496.6, "text": "Bäm"}, {"id": 487, "start": 3496.6, "end": 3502.6, "text": "Kannst du mal wieder black ops einspielen ich habe es mir tatsächlich letztens überlegt ob ich nicht mal wieder anschmeißen soll"}, {"id": 488, "start": 3502.6, "end": 3512.6, "text": "Bestell noch ein paar esp ne esp habe ich mehr als genug da und pies habe ich auch grad nichts was ich irgendwie bräuchte"}, {"id": 489, "start": 3512.6, "end": 3522.6, "text": "So next progress machen leute"}, {"id": 490, "start": 3522.6, "end": 3526.6, "text": "Amazon progress"}, {"id": 491, "start": 3526.6, "end": 3538.6, "text": "Ja dann wollte ich mir doch tatsächlich noch also ihr wisst ja ich hatte die ganze zeit bei mir im wohnzimmer oben zum ausprobieren"}, {"id": 492, "start": 3538.6, "end": 3542.6, "text": "So ein zigbee nicht ganz sexy so ein zigbee thermostat"}, {"id": 493, "start": 3542.6, "end": 3550.6, "text": "Und zwar diese teile hier nicht von pearl pearl ist der größte crab laden aber so welche in dieser richtung hatte ich"}, {"id": 494, "start": 3550.6, "end": 3560.6, "text": "Und so cool die auf dem bild aussehen so china style und mist sind die dinge auch was kosten das was kosten der kram gerade bei banggood"}, {"id": 495, "start": 3560.6, "end": 3574.6, "text": "Ali express banggood immer noch bester seitenname zigbee nicht thermometer thermostat hallo thermostat"}, {"id": 496, "start": 3574.6, "end": 3584.6, "text": "Oh gibt es gar nichts"}, {"id": 497, "start": 3584.6, "end": 3590.6, "text": "Du hast dich bei pearl beworben wurde es abgelehnt aha warum"}, {"id": 498, "start": 3590.6, "end": 3608.6, "text": "Haben sie gesagt oder was war mit pearl los die wissen einfach nicht was sie verpassen hier"}, {"id": 499, "start": 3608.6, "end": 3616.6, "text": "So man kann die cute chat nicht einfach ablehnen soll das wie soll das funktionieren"}, {"id": 500, "start": 3616.6, "end": 3624.6, "text": "Also der kram kostet immer noch viel zu viel und man kann die jetzt auch einzeln bestellen"}, {"id": 501, "start": 3624.6, "end": 3630.6, "text": "Es gibt die gar nicht mehr zu kaufen guck mal"}, {"id": 502, "start": 3630.6, "end": 3634.6, "text": "Die gibt es alle nicht mehr"}, {"id": 503, "start": 3634.6, "end": 3642.6, "text": "Na gut ist ja auch egal aber diese dinge habe ich da aktuell dran so und"}, {"id": 504, "start": 3642.6, "end": 3652.6, "text": "Die sehen eigentlich auf den ersten blick ganz gut aus weil man denkt sich so normale heizungsthermostate"}, {"id": 505, "start": 3652.6, "end": 3660.6, "text": "Die dreht man ja auch und das ist bestimmt ganz cool wenn man quasi so dinge auch drehen kann"}, {"id": 506, "start": 3660.6, "end": 3670.6, "text": "So aber sie sehen cool aus sind aber richtig kacke mehrere punkte warum die nix taugen"}, {"id": 507, "start": 3670.6, "end": 3674.6, "text": "Ich war am anfang auch ein bisschen von der optik begeistert ich bin froh dass ich mir nicht mehr gekauft habe"}, {"id": 508, "start": 3674.6, "end": 3678.6, "text": "Das erste ist der batterieverbrauch ist für den arsch"}, {"id": 509, "start": 3678.6, "end": 3682.6, "text": "Die dinger sind nach drei monaten leer das ist der absolute witz"}, {"id": 510, "start": 3682.6, "end": 3690.6, "text": "Dann bin ich ja den ganzen tag im haus rumlaufen und jeden tag zeug batterienwechseln wenn das alles in diesem zeitraum leer geht"}, {"id": 511, "start": 3690.6, "end": 3696.6, "text": "Das nächste ist quatsch mit sauce sagt es ja schon bei ihm sind seine homematic dinger relativ laut"}, {"id": 512, "start": 3696.6, "end": 3702.6, "text": "Die dinger sind auch richtig laut wenn das wenn das die heizung regelt dann macht es dann"}, {"id": 513, "start": 3702.6, "end": 3708.6, "text": "Es schreckt sich die katz sogar so laut sind die wenn die da vor der heizung liegt"}, {"id": 514, "start": 3708.6, "end": 3716.6, "text": "Das ist schon mal müll dazu kommt dass die verarbeitungsqualität nicht gut ist das hat hinten einen verschlussmechanismus"}, {"id": 515, "start": 3716.6, "end": 3725.6, "text": "Der geht schon mal nicht richtig das display ist wenn man drauf drückt vorne was man muss man muss da drauf drücken"}, {"id": 516, "start": 3725.6, "end": 3732.6, "text": "Dass das display angeht und dann hat das display je nachdem wie man drückt so so matschflecken vom finger drauf drücken"}, {"id": 517, "start": 3732.6, "end": 3739.6, "text": "Wie es lcds auch haben ganz ganz also es ist müll es ist es ist echt es ist echt müll im endeffekt ja"}, {"id": 518, "start": 3739.6, "end": 3745.6, "text": "So cool die style ich auf dem bild außen sind die müll so und was ich jetzt habe ist der chat hat es auch schon"}, {"id": 519, "start": 3745.6, "end": 3752.6, "text": "Geschrieben ich habe mir jetzt hier von mal zum testen eins gekauft die rote pest aus berlin ist wieder am start"}, {"id": 520, "start": 3752.6, "end": 3757.6, "text": "Und zwar ein doch das gleiche oder"}, {"id": 521, "start": 3760.6, "end": 3762.6, "text": "Bloß bisschen andere optik"}, {"id": 522, "start": 3768.6, "end": 3770.6, "text": "Es sieht genau gleich aus"}, {"id": 523, "start": 3776.6, "end": 3778.6, "text": "Das kannst du aber nicht so einfach selber machen"}, {"id": 524, "start": 3778.6, "end": 3785.6, "text": "Deckt strahlung ich wüsste jetzt nicht dass deckt ob deckt strahlung irgendwas schlimmes macht"}, {"id": 525, "start": 3785.6, "end": 3790.6, "text": "Weil wenn deckt strahlung was schlimmes macht dann macht 5g sicherlich auch was schlimmes"}, {"id": 526, "start": 3790.6, "end": 3797.6, "text": "Deckt ist 1,9 gigahertz das ist so fast fast 10 gigahertz weniger als 5g"}, {"id": 527, "start": 3807.6, "end": 3811.6, "text": "Das ist so fast fast fast 10 gigahertz weniger als 5g"}, {"id": 528, "start": 3811.6, "end": 3813.6, "text": "Fast 10 gigahertz weniger als 5g"}, {"id": 529, "start": 3827.6, "end": 3831.6, "text": "Es kommt auf zwei sachen an einmal auf welcher frequenz das ganze ist"}, {"id": 530, "start": 3832.6, "end": 3836.6, "text": "Und danach noch welt was das ding für eine für eine leistung hat ja"}, {"id": 531, "start": 3836.6, "end": 3841.6, "text": "Also die frequenz ist wichtig ob das"}, {"id": 532, "start": 3842.6, "end": 3850.6, "text": "Quasi die zellen schädigen kann und die leistung ist wichtig ja wie warm es dann letztendlich wird"}, {"id": 533, "start": 3852.6, "end": 3854.6, "text": "Also wenn es warm macht"}, {"id": 534, "start": 3855.6, "end": 3862.6, "text": "Also sprich wenn du vor dem mikrowellen strahler stehst dann wird es warm"}, {"id": 535, "start": 3862.6, "end": 3870.6, "text": "Wobei das wobei das an anderen sachen liegt die mikrowellen machen das essen durch reibung warm"}, {"id": 536, "start": 3872.6, "end": 3879.6, "text": "Dann fangen die wassermoleküle an im essen zu schwingen und dadurch wird das essen warm"}, {"id": 537, "start": 3881.6, "end": 3884.6, "text": "Exzellent muss man jetzt ja mal sagen"}, {"id": 538, "start": 3884.6, "end": 3891.6, "text": "So also davon habe ich davon habe ich mir ein bestellt und auch wenn die relativ teuer sind"}, {"id": 539, "start": 3893.6, "end": 3901.6, "text": "Resonanz exquisite der chat ist wieder noch noch nur noch mal schlauer ja aber wir wissen ja jeder prime sub steigern den chat eq"}, {"id": 540, "start": 3902.6, "end": 3904.6, "text": "Kein wunder dass der chat so schlau ist mittlerweile"}, {"id": 541, "start": 3904.6, "end": 3912.6, "text": "Also davon habe ich jetzt eins im wohnzimmer da habe ich dieses das andere sick be thermostatic in ausgetauscht muss sagen"}, {"id": 542, "start": 3912.6, "end": 3914.6, "text": "Die sind echt nice"}, {"id": 543, "start": 3915.6, "end": 3921.6, "text": "Erstens ist das display das display ist zwar nicht so fancy wie das andere nicht farbig und sonst was aber das ist echt super"}, {"id": 544, "start": 3922.6, "end": 3924.6, "text": "Das ist echt super"}, {"id": 545, "start": 3924.6, "end": 3933.6, "text": "In so nem so nen sieht bisschen aus wie so nen ink display vor dem von diesem kinder kenn ich noch den alten kinder mit dem indisplay"}, {"id": 546, "start": 3934.6, "end": 3941.6, "text": "So ungefähr ist das display sprich das kann man super lesen also auch ohne beleuchtung auf dem display also ich sitze jetzt hier sehgen"}, {"id": 547, "start": 3941.6, "end": 3943.6, "text": "Auch schon 24 grad drauf perfekt"}, {"id": 548, "start": 3943.6, "end": 3949.64, "text": "So ungefähr ist das Display, sprich das kann man super lesen, also auch ohne Beleuchtung"}, {"id": 549, "start": 3949.64, "end": 3950.64, "text": "auf dem Display."}, {"id": 550, "start": 3950.64, "end": 3953.6, "text": "Also ich sitze jetzt hier, ich sehe genau schon 24 Grad drauf, perfekt."}, {"id": 551, "start": 3953.6, "end": 3960.2, "text": "Also die sind nice, die sind halt nicht ganz billig."}, {"id": 552, "start": 3960.2, "end": 3967.92, "text": "Das zweite Problem bei den Dingern ist, die brauchen relativ lang bis sie Kommandos annehmen,"}, {"id": 553, "start": 3967.92, "end": 3971.76, "text": "was bei einer Heizung jetzt allerdings nicht so wichtig ist."}, {"id": 554, "start": 3971.76, "end": 3978.68, "text": "Sprich, wenn ich eine Heizung habe, die geregelt ist, aber mit einem Heimautomatisierungssystem,"}, {"id": 555, "start": 3978.68, "end": 3984.64, "text": "ob die Heizung jetzt sofort oder mit 10 Minuten Verspätung das anmacht, ist nicht so wild."}, {"id": 556, "start": 3984.64, "end": 3989.36, "text": "Zumal man ja auch immer noch direkt auf den Knopf drücken kann und dann wird es gleich"}, {"id": 557, "start": 3989.36, "end": 3990.36, "text": "warm."}, {"id": 558, "start": 3990.36, "end": 3996.76, "text": "Und das müssen die machen zum Strom sparen, weil sonst, sprich wenn das permanent empfangen"}, {"id": 559, "start": 3996.76, "end": 3999.56, "text": "würde, würde es halt wahrscheinlich zu viel Strom brauchen."}, {"id": 560, "start": 3999.56, "end": 4006.24, "text": "Ja und man braucht eine Fritzbox dafür, was aber kein Problem ist, weil wenn man ein"}, {"id": 561, "start": 4006.24, "end": 4009.8, "text": "Decktelefon daheim hat, hat man wahrscheinlich auch eine Fritzbox als Basisstation."}, {"id": 562, "start": 4009.8, "end": 4014.92, "text": "Das ist übrigens der einzige Grund, warum ich eine Fritzbox habe, ich habe mir damals"}, {"id": 563, "start": 4014.92, "end": 4022.28, "text": "die billigste Fritzbox von allen gekauft, die hat sogar eine 100 MBit Anschlüsse gehabt,"}, {"id": 564, "start": 4022.28, "end": 4023.28, "text": "nur für VoIP."}, {"id": 565, "start": 4023.28, "end": 4036.08, "text": "Also VoIP und 2 Decktelefone und jetzt halt die Thermostate dran und was halt auch ganz"}, {"id": 566, "start": 4036.08, "end": 4041.24, "text": "cool ist, dass ich mittlerweile das VoIP umgezogen habe, also muss ich euch vielleicht auch mal"}, {"id": 567, "start": 4041.24, "end": 4045.36, "text": "erzählen, also ich hatte ja immer das Problem beim Anbieterwechseln, wenn du dein Anbieter"}, {"id": 568, "start": 4045.36, "end": 4051.4, "text": "wechselst und sag mal von Telekom zu Unity Media zu Vodafone zu sonst was, dann musstest"}, {"id": 569, "start": 4051.4, "end": 4055.12, "text": "du dein Festnetz immer umziehen und das war immer so ein Gezitter, weil die Anbieter immer"}, {"id": 570, "start": 4055.12, "end": 4058.76, "text": "total unfähig waren, was Festnetznummern, Übergabe angeht und sowas."}, {"id": 571, "start": 4058.76, "end": 4070.32, "text": "Irgendwann habe ich dann gesagt, Scheiß drauf und jetzt ist mein Telefon bei Easybell kostet"}, {"id": 572, "start": 4070.32, "end": 4084.44, "text": "2,99 oder so im Monat, nein Telefone, ich gucke ja auch falsch, hier kostet 2,99 im Monat,"}, {"id": 573, "start": 4084.44, "end": 4085.44, "text": "passt."}, {"id": 574, "start": 4085.44, "end": 4090.24, "text": "Wieso brauchst du Festnetze, ich brauche kein Festnetz, meine Mutter braucht Festnetze,"}, {"id": 575, "start": 4090.24, "end": 4096.76, "text": "die findet das ganz furchtbar essenziell, dass man Festnetze hat und deswegen Festnetze."}, {"id": 576, "start": 4096.76, "end": 4106.6, "text": "Die will das haben, so und deswegen habe ich das umgezogen auf das hier und jetzt kann"}, {"id": 577, "start": 4106.6, "end": 4111.36, "text": "ich jederzeit Anbieterwechsel ohne, dass ich mir da Gedanken darum machen muss und was"}, {"id": 578, "start": 4111.36, "end": 4117.2, "text": "auch cool ist, mit dieser ganzen VoIP Geschichte, man kann jetzt auch unterwegs vom Handy dran"}, {"id": 579, "start": 4117.2, "end": 4127.24, "text": "gehen und das verwirrt die Leute immer, ja Kalf mache ich, ich wohne im ersten Stock,"}, {"id": 580, "start": 4127.24, "end": 4132.56, "text": "die wohne im Erdgeschoss, wir haben das Haus vom Opa geerbt und es gab entweder die Möglichkeit,"}, {"id": 581, "start": 4132.56, "end": 4139.56, "text": "ich verkaufe das, das wäre jetzt in der aktuellen Zeit echt ziemlich bescheuert gewesen, außerdem"}, {"id": 582, "start": 4139.56, "end": 4142.84, "text": "wollte ich das auch nicht verkaufen, die wollte es auch nicht verkaufen, also ohne Scheiß"}, {"id": 583, "start": 4142.84, "end": 4150.8, "text": "drauf ziehe ich einfach wieder ein, also bin ich ausgezogen und wohne jetzt im Haus vom"}, {"id": 584, "start": 4150.8, "end": 4156.64, "text": "Opa, im ehemaligen Haus vom Opa, das ist genau das ist, richtig genau das ist das Haus mit"}, {"id": 585, "start": 4156.64, "end": 4183.88, "text": "dem Fahrstuhl, richtig, der Fahrstuhl, OKS, ehm Haus, ehm Umzug, keine Ahnung wo man das,"}, {"id": 586, "start": 4183.88, "end": 4192.92, "text": "ich glaube Weiber unterm Dach hieß das, das Video, Moment, das hatte so einen dummen Titel,"}, {"id": 587, "start": 4192.92, "end": 4216.12, "text": "da habe ich die Bilder, da habe ich die Bilder vom Opa gezeigt wo, wo hier das da, no God,"}, {"id": 588, "start": 4216.12, "end": 4237.46, "text": "please no, no, no, NOOO, 3, 2, 1, kann es VLC einsch, mittlerweile easy, hallo Jungs und"}, {"id": 589, "start": 4237.46, "end": 4250.64, "text": "Ich zeige euch die Bilder nicht, das ist bestimmt Toss, also man sieht da nichts Schlimmes,"}, {"id": 590, "start": 4250.64, "end": 4255.44, "text": "man sieht die Bilder, die mein Opa gemalt hat, wo halt auch paar naggische Mädels drauf"}, {"id": 591, "start": 4255.44, "end": 4256.44, "text": "waren."}, {"id": 592, "start": 4256.44, "end": 4261.92, "text": "Man erkennt aber eigentlich nichts, aber YouTube ist der Meinung, das ist Toss und das darf"}, {"id": 593, "start": 4261.92, "end": 4262.92, "text": "man nicht sehen."}, {"id": 594, "start": 4262.92, "end": 4270.0, "text": "So und hier ist übrigens der Fahrstuhl, das ist eigentlich was ich euch zeigen wollte."}, {"id": 595, "start": 4270.0, "end": 4276.2, "text": "Guck hier, so sah es damals aus, jetzt ist es so, das sieht jetzt ja komplett anders"}, {"id": 596, "start": 4276.2, "end": 4283.44, "text": "aus, jetzt ist es so, hier ist meine Küche drin, hier neben ist das Wohnzimmer, darum"}, {"id": 597, "start": 4283.44, "end": 4289.3, "text": "ist das Bad und hier geht es halt zum Dachboden hoch und da hatte der Opa so einen richtig"}, {"id": 598, "start": 4289.3, "end": 4291.92, "text": "abgedrehten Fahrstuhl gebaut."}, {"id": 599, "start": 4291.92, "end": 4296.92, "text": "Man muss sich mal überlegen, das ist ja auch schon alt gewesen, man muss sich mal überlegen,"}, {"id": 600, "start": 4296.92, "end": 4302.36, "text": "der hat damals selber, ohne dass der Amazon Guides oder sonstiges, also dass er bei Amazon"}, {"id": 601, "start": 4302.36, "end": 4306.32, "text": "was kaufen konnte, sich Guides im Internet angucken konnte, hat er einen Fahrstuhl gebaut"}, {"id": 602, "start": 4306.32, "end": 4307.64, "text": "bei sich, ist schon nice."}, {"id": 603, "start": 4307.64, "end": 4316.0, "text": "Das Problem bei dem Fahrstuhl ist nur, das war mittlerweile ein wenig abenteuerlich damit"}, {"id": 604, "start": 4316.0, "end": 4321.8, "text": "zu fahren und die Wärmeisolierung zum Dach war voll für'n Arsch mit dem Fahrstuhl."}, {"id": 605, "start": 4321.8, "end": 4330.12, "text": "Es war permanent kalt, das hat keinen gejuckt, der hat das einfach gemacht, aber das war"}, {"id": 606, "start": 4330.12, "end": 4336.36, "text": "der Hauptgrund warum wir das weggemacht haben, du konntest das Ding nicht isolieren, also"}, {"id": 607, "start": 4336.36, "end": 4346.92, "text": "es war echt immer kalt in dem Haus, unter anderem deswegen und weil der Opa halt nicht"}, {"id": 608, "start": 4346.92, "end": 4350.8, "text": "richtig geheizt hat, aber selbst wenn du richtig geheizt hast, du hast es nicht warm gekriegt,"}, {"id": 609, "start": 4350.8, "end": 4351.8, "text": "das ist super."}, {"id": 610, "start": 4351.8, "end": 4361.16, "text": "Pass mal auf, guck dich mal den Fahrstuhl an, da kommt da gleich runtergefahren der Fahrstuhl,"}, {"id": 611, "start": 4361.16, "end": 4372.0, "text": "das ist noch bevor alles renoviert wurde hier, sieht schon ein bisschen abenteuerlich"}, {"id": 612, "start": 4372.0, "end": 4381.2, "text": "aus oder, müsst ihr zugeben."}, {"id": 613, "start": 4381.2, "end": 4385.96, "text": "Heute haben sie einen Baum hier gefällt, weil gerade einer sagt Arbeitsschutz, haben einen"}, {"id": 614, "start": 4385.96, "end": 4392.48, "text": "Baum gefällt, mit der Motor sehe ich, haben da auf dem Kran rumgestanden, mit der Motor"}, {"id": 615, "start": 4392.48, "end": 4398.96, "text": "sehe ich, ohne Schutzhelm, ohne Schutzhandschuhe, ohne Schutzschuhe, ohne alles, also ich hab"}, {"id": 616, "start": 4398.96, "end": 4402.64, "text": "nur noch gewartet bis ich einen Arm am Schneiden von denen, aber ist nix passiert."}, {"id": 617, "start": 4402.64, "end": 4416.88, "text": "So guckt euch das mal an, da hast du diesen Knopf hier gehabt, da kannst du hochfahren,"}, {"id": 618, "start": 4416.88, "end": 4422.84, "text": "wie viel Kilo hat er, ich hab keine Ahnung, also er hat mich damals ausgehalten, also kann"}, {"id": 619, "start": 4422.84, "end": 4430.44, "text": "das schon, es ist alles an einem Seil, jaja, es ist alles, guck mal, das ist, das hängt"}, {"id": 620, "start": 4430.44, "end": 4444.52, "text": "nur da dran, nur da dran hängt der ganze Fahrstuhl, nur da dran."}, {"id": 621, "start": 4444.52, "end": 4463.4, "text": "Das ist da übrigens oben eigentlich alles nicht mehr da, genau, da sind die Bilder vom"}, {"id": 622, "start": 4463.4, "end": 4468.36, "text": "Opa drin gewesen, ja hier sieht man nochmal der Motor, der irgendwie hier hinter der Wand"}, {"id": 623, "start": 4468.36, "end": 4473.72, "text": "war, und jetzt kann ich nicht weiter zeigen, weil jetzt kommen Bilder von gemalten nackischen"}, {"id": 624, "start": 4473.72, "end": 4474.72, "text": "Mädels."}, {"id": 625, "start": 4474.72, "end": 4481.04, "text": "Da, das ist ja mittlerweile alles Toss, wobei das meiner Meinung nach eindeutig als Kunst"}, {"id": 626, "start": 4481.04, "end": 4482.84, "text": "durchgeht, aber man weiß ja nie."}, {"id": 627, "start": 4482.84, "end": 4495.24, "text": "Was hat ein Opa beruflich gemacht, das ist ne gute Frage, was hat der eigentlich beruflich"}, {"id": 628, "start": 4495.24, "end": 4496.24, "text": "gemacht?"}, {"id": 629, "start": 4496.24, "end": 4513.84, "text": "Ich glaub der war, ne der war nicht Elektriker, der war sowas in der Richtung, irgendwie Anlagen,"}, {"id": 630, "start": 4513.84, "end": 4521.8, "text": "Mechaniker oder sowas, ich weiß es gar nicht genau, der hat, der hat irgendwie so Maschinelektronik"}, {"id": 631, "start": 4521.8, "end": 4531.84, "text": "Kram gemacht, so Maschinelektronik Krams in irgendeiner Fabrik, ich weiß nicht genau"}, {"id": 632, "start": 4531.84, "end": 4540.92, "text": "was der gemacht hat, wie das hieß, was der gelernt hat, keine Ahnung, ja nebenbei war"}, {"id": 633, "start": 4540.92, "end": 4551.72, "text": "er noch künstlerisch tätig und hat gemalt, jede Menge, haben wir noch alles, ja, ich"}, {"id": 634, "start": 4551.72, "end": 4557.08, "text": "hab keine Ahnung, weiß nicht wie das genau heißt, so weiter, weiter im Text, wie bin"}, {"id": 635, "start": 4557.08, "end": 4560.8, "text": "ich jetzt eigentlich da drauf gekommen, genau, so und deswegen, davon wollte ich mir jetzt"}, {"id": 636, "start": 4560.8, "end": 4568.36, "text": "noch ein paar holen, weil ich hab die eingebaut im Wohnzimmer und funktioniert gut, hat wenig,"}, {"id": 637, "start": 4568.36, "end": 4576.0, "text": "also verliert nicht so viel Batterie wie das andere und klappt gut, ja, ist echt nice,"}, {"id": 638, "start": 4576.0, "end": 4581.68, "text": "die brauchen ein paar Minuten bis es die Befehle erkennt von der Basisstation und, achja der"}, {"id": 639, "start": 4581.68, "end": 4585.6, "text": "Grund warum ich die genommen habe ist folgendes, es gibt ja eine Home Assistant Integration"}, {"id": 640, "start": 4585.6, "end": 4591.88, "text": "für Fritz Smart Home, ohne hätte ich es nicht genommen, ja, also sprich, man meldet das"}, {"id": 641, "start": 4591.88, "end": 4599.4, "text": "Ding zwar an, an der Fritzbox, aber die Steuerung macht man ganz normal über Home Assistant,"}, {"id": 642, "start": 4599.4, "end": 4602.88, "text": "das war wichtig, ich will da nichts in der Fritzbox machen müssen und ich will auch,"}, {"id": 643, "start": 4602.88, "end": 4606.72, "text": "das in meinen normalen Automatisierungen drin haben, ja, also zum Beispiel, dass es unter"}, {"id": 644, "start": 4606.72, "end": 4612.04, "text": "der Woche morgens acht angeht, am Wochenende um neun Uhr morgens an, dass es abends ausgeht,"}, {"id": 645, "start": 4612.04, "end": 4618.84, "text": "wenn der Fernseher ausgeht und solche Dinge, ja, Home Assistant ist eine Smart Home Lösung,"}, {"id": 646, "start": 4618.84, "end": 4624.4, "text": "die erlaubt, dass du ganz viele verschiedene Sachen miteinander integrierst, kostet nichts,"}, {"id": 647, "start": 4624.4, "end": 4634.68, "text": "ja, Open Source und jeder kann, kann es benutzen und dann rumbasteln, ein bisschen wie Open"}, {"id": 648, "start": 4634.68, "end": 4643.12, "text": "Hub, ja, nur kein Java, ja gut, das sind die Noobs, die nicht wissen, was sie machen sollen,"}, {"id": 649, "start": 4643.12, "end": 4651.6, "text": "guck, deswegen verwende ich die Software einfach gar nicht, easy, was die von Tado zeigt mal"}, {"id": 650, "start": 4651.6, "end": 4664.72, "text": "her, ich gucke mir das jetzt einfach mal an, Tado thermostat, über was geht das, ist das"}, {"id": 651, "start": 4664.72, "end": 4684.48, "text": "Zigbee, ist das, was ist das, über irgendwas müssen die doch funken, oder, also über was"}, {"id": 652, "start": 4684.48, "end": 4694.68, "text": "machen die ihre Kommunikation, ist das, sind die WLAN, ist das WLAN, müssen die ins WLAN,"}, {"id": 653, "start": 4694.68, "end": 4708.0, "text": "oder wie funktioniert das, straight into the cloud, ja, aber irgendwie müssen die in die"}, {"id": 654, "start": 4708.0, "end": 4724.28, "text": "cloud kommen, über WLAN, oder wie, oder was, WLAN, ich habe keine Ahnung, WIFI, aber die"}, {"id": 655, "start": 4724.28, "end": 4741.32, "text": "Leute finden das nicht so geil, mit SIM Karte, ja, aber Sönki, irgendwie muss doch das Thermostat"}, {"id": 656, "start": 4741.32, "end": 4747.32, "text": "kommunizieren können mit Home Assistant, da liegt kein Kabel zwischen dem Thermostat"}, {"id": 657, "start": 4747.32, "end": 4754.48, "text": "und Home Assistant, also über irgendwas muss der Home Assistant mit den Dingern kommunizieren,"}, {"id": 658, "start": 4754.48, "end": 4761.24, "text": "entweder ist es eine proprietäre Funkgeschichte, dass man eine Basisstation von denen braucht,"}, {"id": 659, "start": 4761.24, "end": 4764.8, "text": "oder es geht über WLAN, dann muss man jedes alte Thermostat anmelden, oder es geht über"}, {"id": 660, "start": 4764.8, "end": 4769.0, "text": "Zigbee, über SeaWave, oder über Deckt, über was auch immer, aber irgendwas braucht's"}, {"id": 661, "start": 4769.0, "end": 4784.4, "text": "ja, Brieftauben meinetwegen, ja, die Leute sind nicht so ganz zufrieden damit, abonamento"}, {"id": 662, "start": 4784.4, "end": 4789.84, "text": "obligator, okay, das heißt so viel, man muss ein Abo abschließen, alles klar, würde ich"}, {"id": 663, "start": 4789.84, "end": 4796.32, "text": "mal sagen, es ist nicht so beliebt, Leute, ist mir jetzt auch wurscht, weil ich werde"}, {"id": 664, "start": 4796.32, "end": 4801.12, "text": "mir jetzt einfach von den Fritz-Dingern noch zwei Stück kaufen, fertig, da weiß ich, dass"}, {"id": 665, "start": 4801.12, "end": 4806.04, "text": "die, was haben die sonst noch, was, Steckdosen brauch ich denn, die Dinger funktionieren"}, {"id": 666, "start": 4806.04, "end": 4813.48, "text": "gut, ich war ja selbst ein bisschen misstrauisch was Deckt angeht, aber letztendlich ist mir"}, {"id": 667, "start": 4813.48, "end": 4820.78, "text": "persönlich die Funk-Technologie fast egal, Hauptsache es funktioniert, und im Vergleich"}, {"id": 668, "start": 4820.78, "end": 4826.64, "text": "zu den Zigbee-Dingern, die ich davor hatte, funktionieren diese, die Fritz-Teile wirklich"}, {"id": 669, "start": 4826.64, "end": 4827.64, "text": "gut."}, {"id": 670, "start": 4827.64, "end": 4849.0, "text": "So, next, abhaken, haben wir gekauft, zack, übrigens, hat einer von euch eine Ahnung,"}, {"id": 671, "start": 4849.0, "end": 4854.56, "text": "vielleicht kennt sich ja der eine oder andere damit aus, ich habe ein kleines Loch im Garagendach,"}, {"id": 672, "start": 4854.56, "end": 4863.92, "text": "so zwei Euro Durchmesser, gibt es da irgendwie fertigen Kleber oder irgendwie Spachtel-Zeug,"}, {"id": 673, "start": 4863.92, "end": 4880.88, "text": "was man da drüber schmieren kann und dann ist mir da zu, was Flex-Seal, das hält doch"}, {"id": 674, "start": 4880.88, "end": 4900.52, "text": "nie im Leben auf dem Dach, aber das hält doch nicht auf dem Dach, das bleibt doch auf"}, {"id": 675, "start": 4900.52, "end": 4919.6, "text": "dem Dach nicht kleben, das Dach ist dreckig und das Dach ist nicht eben, was, was stellt"}, {"id": 676, "start": 4919.6, "end": 4930.44, "text": "ihr her, irgendjemand hat gesagt stellt ihr her meint, Evertape, was, was ist das für"}, {"id": 677, "start": 4930.44, "end": 4946.76, "text": "ein Dach, ja so ein, so ein, so ein gewähltes Wellendach, so was, so was, so was ist das,"}, {"id": 678, "start": 4946.76, "end": 4954.92, "text": "fast best Dach, also, so wie ich das, das Alter einschätze von dem Ding, ist das wahrscheinlich"}, {"id": 679, "start": 4954.92, "end": 4964.24, "text": "am best Dach, wenn ich den Opa, ja das hat den Opa damals nicht interessiert, Flex-Paste,"}, {"id": 680, "start": 4964.24, "end": 4976.48, "text": "was zum, was ist Flex-Paste, mach mit deinem 3D-Drucker ein passförmiges Teil und dann"}, {"id": 681, "start": 4976.48, "end": 4983.8, "text": "mit Teerpappe von oben und unten, jetzt wird es aber advanced, ok, der Philip Swift erklärt"}, {"id": 682, "start": 4983.8, "end": 4991.16, "text": "uns das jetzt, die sind immer so happy, die sind in der Werbung immer so super glücklich"}, {"id": 683, "start": 4991.16, "end": 5016.8, "text": "das verwenden, verwenden zu dürfen, what the fuck, was guck ich mir da an, ok, ok,"}, {"id": 684, "start": 5016.8, "end": 5025.8, "text": "ok"}, {"id": 685, "start": 5025.8, "end": 5040.52, "text": "łaaa"}, {"id": 686, "start": 5040.52, "end": 5044.52, "text": "Das ist ein starker, flexibler Rubber. Er steigert sich und konzentriert sich."}, {"id": 687, "start": 5046.52, "end": 5048.52, "text": "Flexpaste ist tolle Sache!"}, {"id": 688, "start": 5062.52, "end": 5064.52, "text": "Das ist viel Schaden!"}, {"id": 689, "start": 5064.52, "end": 5073.52, "text": "Die Werbung ist doch absichtlich auf so alte Oldschool-Werbesendungen gemacht, oder?"}, {"id": 690, "start": 5083.52, "end": 5086.52, "text": "Ey, das wär echt gut fürs Dach!"}, {"id": 691, "start": 5086.52, "end": 5093.52, "text": "Genau sowas bräuchte ich fürs Dach!"}, {"id": 692, "start": 5093.52, "end": 5107.52, "text": "In extreme heat, driving rain, or freezing cold, flexpaste keeps its hold. Flexpaste is perfect for projects, crafts and hobbies. Shape it, mold it, or paint it any color."}, {"id": 693, "start": 5107.52, "end": 5112.52, "text": "With flexpaste, you can create just about anything you can imagine."}, {"id": 694, "start": 5112.52, "end": 5120.52, "text": "And when insects or rodents are getting into your home, use flexpaste to seal up large holes to keep those unwanted pests out."}, {"id": 695, "start": 5120.52, "end": 5127.52, "text": "Let the paste advance for you, or it won't dissolve or wash away."}, {"id": 696, "start": 5127.52, "end": 5137.52, "text": "And it even works underwater. So you can apply flexpaste underwater, and it even dries underwater."}, {"id": 697, "start": 5137.52, "end": 5150.52, "text": "And once flexpaste dries, it turns into a strong, flexible rubber. Storms and floods can destroy your home."}, {"id": 698, "start": 5168.52, "end": 5179.52, "text": "You can push flexpaste deep into wet surfaces and hard to reach areas. Now it's easy to seal up windows and doors to help prevent flood damage."}, {"id": 699, "start": 5182.52, "end": 5185.52, "text": "To show you the power of flexpaste..."}, {"id": 700, "start": 5185.52, "end": 5204.52, "text": "I took this chicken wire, bent, shaped and molded it, then covered it with only flexpaste, and created the world's first flexpaste rubber band."}, {"id": 701, "start": 5204.52, "end": 5221.52, "text": "Now we can flexpaste seal up every hole in the chicken wire, but it creates a strong, watertight barrier that bends and stays flexible. And the inside is completely dry."}, {"id": 702, "start": 5221.52, "end": 5235.52, "text": "You can get flexpaste and the entire flexseal family of products at flexsealproducts.com."}, {"id": 703, "start": 5251.52, "end": 5279.52, "text": "Hi, Phil Swift here for Flex Tape, the super strong waterproof tape."}, {"id": 704, "start": 5281.52, "end": 5288.52, "text": "That can instantly patch, bond, seal and repair."}, {"id": 705, "start": 5288.52, "end": 5296.52, "text": "Flex Tape is no ordinary tape. Its triple thick adhesive virtually welds itself to the surface, instantly stopping the toughest leaks."}, {"id": 706, "start": 5296.52, "end": 5324.52, "text": "Leaky pipes can cause major damage, but Flex Tape grips on tight and bonds in silicone."}, {"id": 707, "start": 5324.52, "end": 5340.52, "text": "Plus, Flex Tape's powerful adhesive is so strong, it even works underwater. Now you can repair leaks in pools."}, {"id": 708, "start": 5340.52, "end": 5361.52, "text": "Flex Tape is perfect for marine, campers and RVs. Flex Tape is super strong. And once it's on, it holds on tight. And for emergency auto repair, Flex Tape keeps its grip, even in toughest conditions."}, {"id": 709, "start": 5361.52, "end": 5371.52, "text": "Big storms can cause big damage."}, {"id": 710, "start": 5371.52, "end": 5376.52, "text": "Flex Tape comes super wide, so you can easily patch large holes."}, {"id": 711, "start": 5376.52, "end": 5392.52, "text": "To show you the power of Flex Tape."}, {"id": 712, "start": 5392.52, "end": 5401.52, "text": "Don't breathe this."}, {"id": 713, "start": 5401.52, "end": 5418.52, "text": "I saw this boat in half. And repaired it with only Flex Tape. Not only does Flex Tape's powerful adhesive hold the boat together, but it creates a super strong watertight seal. So the inside is completely dry."}, {"id": 714, "start": 5418.52, "end": 5432.52, "text": "So if that's not the advertising is so cacowna, it doesn't work anymore."}, {"id": 715, "start": 5432.52, "end": 5452.52, "text": "Haftstarker Konstruktionsklebestoff."}, {"id": 716, "start": 5452.52, "end": 5465.52, "text": "Evertape ist fast 1 zu 1 Flex Tape."}, {"id": 717, "start": 5465.52, "end": 5475.52, "text": "Schlechte Bewertung bei Amazon."}, {"id": 718, "start": 5475.52, "end": 5483.52, "text": "Totaler Müll, leider nicht unter Wasser anwendbar."}, {"id": 719, "start": 5483.52, "end": 5503.52, "text": "Ja, genau dafür brauche ich das. Ohne Scheiß. Genau für sowas. Nur dass es bei mir nicht durchsichtig ist."}, {"id": 720, "start": 5503.52, "end": 5518.52, "text": "Genau sowas brauche ich hier. Wie lange hält das? Ich meine, das ist draußen, da scheint Sonne drauf, da regnet es drauf. Wie lange hält denn das? Also das sollte meiner Meinung nach schon einmal gemacht und dann ist gut."}, {"id": 721, "start": 5518.52, "end": 5534.52, "text": "Welches Material? Ich habe keine Ahnung. Das ist so 2 bis 3 Jahre. Nee, das ist zu wenig. Ich will, dass das dicht ist für die nächsten 20 Jahre."}, {"id": 722, "start": 5534.52, "end": 5553.52, "text": "Absolut dicht."}, {"id": 723, "start": 5553.52, "end": 5580.52, "text": "Na, mal gucken. Ich meine, was? Vielleicht dann doch die Paste. Vielleicht mache ich doch einfach ein Stück Holz drüber oder so."}, {"id": 724, "start": 5580.52, "end": 5595.52, "text": "Das ist eine richtig gute Idee, der hält bestimmt."}, {"id": 725, "start": 5595.52, "end": 5613.52, "text": "Also weiter geht's. Zeug bestellen. So, jetzt haben wir den Kram gekauft. Was sagt denn Amazon, wenn man sucht nach Dachlochdichtung? Bei Amazon weiß man immer, wenn man Amazon sucht."}, {"id": 726, "start": 5613.52, "end": 5626.52, "text": "Sowas, sowas in der Richtung habe ich daheim. Selbst dem Silikon. Aber das ist fürs Dach, das hält da nicht richtig gut drauf. Dicht fix."}, {"id": 727, "start": 5643.52, "end": 5659.52, "text": "Nee, ich will kein neues Dach kaufen. Das müsste ich dann einbauen. Ich will einfach irgendwas reinstopfen und dann ist gut."}, {"id": 728, "start": 5659.52, "end": 5674.52, "text": "Wisst ihr was? Ich habe von der Katze, ich habe von der Katze habe ich noch 2, 3 große Gummiflummis. Die stopfe ich da einfach rein."}, {"id": 729, "start": 5674.52, "end": 5698.52, "text": "Denn dicht fix. Was sind das für Namen, Alter? Was für ein Ding? Der Kommentator, das ist auch so ein komisches Kleb. Das geht doch auch garantiert nach ein paar Jahren kaputt in der Sonne unter Regen und allem Möglichen."}, {"id": 730, "start": 5698.52, "end": 5718.52, "text": "Was sind das eigentlich für Namen immer? Sieger Wiegluff. Nimm viel Heißkleber. Ja, mit Heißkleber habe ich mir das auch schon überlegt, aber das geht auch mit der Zeit ab. Ab und kaputt wahrscheinlich."}, {"id": 731, "start": 5718.52, "end": 5744.52, "text": "Sonnenlicht, Regen und alles, das glaube ich nicht so. Sieger Wiegluff klingt echt sehr comodate. Ich meine mit Heißkleber wäre gar keine so schlechte Idee."}, {"id": 732, "start": 5744.52, "end": 5765.52, "text": "Leute, kann ich nicht einfach da irgendwie, nicht vom 3D Drucker, sondern ich nehme einfach irgendwie was, was ich da reinstecken kann und dann mache ich drum herum dicht mit Heißkleber."}, {"id": 733, "start": 5765.52, "end": 5787.52, "text": "Wie gut hält Heißkleber über Jahre im Sonnenlicht und mit Regen und sowas? Wie gesagt, ich habe hier mein Raspberry Pi auf der Fensterbank festgeklebt mit Heißkleber."}, {"id": 734, "start": 5787.52, "end": 5816.52, "text": "Richtig gut. Das ist echt kompliziert, ne? Was für ein Ding? Bitumenband. Es scheint mir doch echt äußerst komplex zu sein, ein kleines Loch im Dach zu fixen."}, {"id": 735, "start": 5816.52, "end": 5844.52, "text": "Was ist das? Der Popstar. Das hält für immer. Exzellent. Bestimmt krebserregend."}, {"id": 736, "start": 5844.52, "end": 5872.52, "text": "Das ist für Dachflaschen. Das ist doch gut. Ich will ja auch ein Loch im Dach fixen. Exzellent."}, {"id": 737, "start": 5872.52, "end": 5884.52, "text": "Die zu verklebenden Flächen müssen Frost, Staub und Silikon frei sein. Nein, sind sie nicht."}, {"id": 738, "start": 5884.52, "end": 5910.52, "text": "Ich habe Heißluft. So ein Heißluft-Ding bis 600 Grad. Bringt das was? Aber dann fängt das Dach an zu brennen."}, {"id": 739, "start": 5910.52, "end": 5922.52, "text": "Okay, ich muss mich da mal informieren. Ich glaube, rein mit Chat kommen wir da nicht weit. Kaufen wir mal weiter ein."}, {"id": 740, "start": 5922.52, "end": 5946.52, "text": "Ein Dach kann, klar kann das Dach brennen. Ich gehe nicht zum Dachdecker. Das ist ein Loch so groß wie ein 2-Euro-Stück. Das werde ich doch irgendwie noch dicht kriegen, wenn man nicht ein kleines Loch in seinem Garagendach hat."}, {"id": 741, "start": 5946.52, "end": 5966.52, "text": "Max, was hast du für ein ZigBee-Interface in der Nutzung? Ich habe ein Konbi 2. Konbi 2. So ein Teil. Funktioniert super mit Home Assistant zusammen."}, {"id": 742, "start": 5966.52, "end": 5982.52, "text": "Als Home Assistant Addon habe ich das hier. Der USB-Stick ist eigentlich vor M durchgereicht. Funktioniert wunderbar."}, {"id": 743, "start": 5982.52, "end": 5994.52, "text": "Aber jetzt, nachdem ich ja das Thermostat ausgewechselt habe, habe ich nicht mehr so viel ZigBee-Sacht. Bleiben eigentlich nur ein paar Knöpfe übrig."}, {"id": 744, "start": 5994.52, "end": 6006.52, "text": "Du hast dir den hier bestellt für Home Assistant. Ob die so geil sind, weiß ich nicht. Das sind glaube ich so China-Crap. Aber der Konbi ist auf jeden Fall nice."}, {"id": 745, "start": 6006.52, "end": 6026.52, "text": "Stick, Stick. Der Home Assistant läuft nicht auf Raspberry Pi. Der Home Assistant läuft auf meiner Low-Power-Quad-Core-Intel-Geschichte in AVM. Mittlerweile in AVM, weil die selbst installierte Sachen nicht mehr gut supporten."}, {"id": 746, "start": 6026.52, "end": 6040.52, "text": "Silikon, ok. Ich muss mir das mal in Ruhe angucken."}, {"id": 747, "start": 6040.52, "end": 6052.52, "text": "Doch, ich habe es aktuell auf Docker laufen, aber das unterstützen die nicht mehr. Die unterstützen das nicht mehr. Ich habe es aktuell in einem selbst installierten Docker in AVM, aber die unterstützen das nicht mehr."}, {"id": 748, "start": 6052.52, "end": 6062.52, "text": "Du kannst keine Home Assistant-Super-Wise-Installation mehr auf Docker machen, wenn du das Betriebssystem selbst verwaltest. Das unterstützen sie nicht mehr, da kriegst du laufend irgendwelche Warnungen."}, {"id": 749, "start": 6062.52, "end": 6076.52, "text": "Du kannst natürlich Home Assistant noch in Docker installieren, aber dann kannst du die ganzen Add-ons nicht verwenden. Und das ist eigentlich eins der coolsten Sachen bei Home Assistant, dass es so viele fertige Add-ons gibt."}, {"id": 750, "start": 6076.52, "end": 6088.52, "text": "Deswegen, ich habe jetzt eine AVM genommen. Einfach, dass offizielle Image truff und gut ist. Funktioniert auch wunderbar."}, {"id": 751, "start": 6088.52, "end": 6099.52, "text": "Man kann das nicht mehr ordentlich im Docker laufen lassen, weil die checken zum Beispiel, was auf deinem Hostbetriebssystem für Pakete drauf sind, ob das supportende Konfiguration ist."}, {"id": 752, "start": 6099.52, "end": 6112.52, "text": "Dann unterstützen sie nur Debian in einer ganz speziellen Variante. Und wenn die was erkennen, was Probleme machen könnte, dann warnt das vor dem Update und verweigert auch das Update und sowas ganz, ganz merkwürdiges Zeug."}, {"id": 753, "start": 6112.52, "end": 6115.52, "text": "Und ich habe jetzt einfach das offizielle Image in der AVM und jetzt ist alles gut."}, {"id": 754, "start": 6115.52, "end": 6132.52, "text": "Bisschen kacke, ja. Ich kann es aber verstehen, weil die haben bestimmt 30 Milliarden Supportanfragen gekriegt und es war gar nichts kaputt. Die Leute haben einfach nur ihr System verkonfiguriert."}, {"id": 755, "start": 6132.52, "end": 6145.52, "text": "Und ja, das verstehe ich schon. So, also ich muss noch weiter was kaufen und klar. Und zwar, ich brauche für meinen Serverraum noch Folgendes. Ich habe euch ja hier oben, ich habe es mal irgendwo gesagt."}, {"id": 756, "start": 6145.52, "end": 6153.52, "text": "Da, diese Boxen da. Von diesen Boxen will ich 4 Stück an die Wand machen. Was nutzt du, Proxmox oder ESX? Keines von beiden."}, {"id": 757, "start": 6153.52, "end": 6169.52, "text": "Von diesen Boxen will ich ja hier an die Wand 4 Stück machen. Achtung, da, an die Wand. Gestern habe ich die erste Box dran geschraubt und ich habe ja so einen Tester, ob da Metall oder Stromleitungen hinter der Wand sind."}, {"id": 758, "start": 6169.52, "end": 6187.52, "text": "Das Problem ist, dass hier überall Metall ist. Ich gehe mal davon aus, das liegt daran, weil sie diese Gipswände hier irgendwie festmachen muss und weil der Opa da Dinger gebaut hat. Und ich konnte nichts Freies finden hier, sodass ich 4 Kisten nebeneinander kriege."}, {"id": 759, "start": 6187.52, "end": 6201.52, "text": "So, und was ich jetzt gemacht habe, ist, es ist wahrscheinlich komplett unfachmännisch. Ich habe jetzt einfach 3 Löcher gebohrt im Abstand von ein paar Zentimetern, bis ich durchgekommen bin. Oh nein, da habe ich dran gehängt."}, {"id": 760, "start": 6201.52, "end": 6213.52, "text": "Sieht zwar nicht schön aus, aber hat funktioniert. Und mir ist mal aufgefallen, wie heiß so ein Bohrer wird, wenn man versucht durch Metall durchzubohren und es nicht geht."}, {"id": 761, "start": 6213.52, "end": 6233.52, "text": "Ich habe das dran gehalten, dagegen gedrückt, hat nicht funktioniert. Da habe ich bestimmt eine halbe Minute rumgeeiert. Und als ich das rausgezogen habe, habe ich den Fehler gemacht, mal vorne ein bisschen auf den Bohrer zu greifen. Das war echt ordentlich heiß danach."}, {"id": 762, "start": 6233.52, "end": 6246.52, "text": "Naja, so und deswegen brauche ich noch mindestens mal eine weitere Kiste davon. Ich will es gar nicht durchs Metall bohren."}, {"id": 763, "start": 6246.52, "end": 6268.52, "text": "Kleinteile-Magazin. Warum heißt es eigentlich Kleinteile-Magazin? Das hört sich gewalttätig an. 36 mal 25, ne 36 mal 21, den habe ich."}, {"id": 764, "start": 6268.52, "end": 6291.52, "text": "Und das hier ist 36 mal 15, ne das hat genau die gleichen Abmaße, oder? 15 cm tief ist das, 36 cm breit und 22 cm hoch."}, {"id": 765, "start": 6291.52, "end": 6304.52, "text": "Venice, Venice ist Cheater und Venice, ich kann es mal kurz anmachen. Venice ist Cheater, verseucht, na wobei er geht, halbwegs, ist so viel schlimmer auch nicht. Das Problem ist, dass sie einen Memory Leak haben und das Spiel abkackt."}, {"id": 766, "start": 6304.52, "end": 6328.52, "text": "Und deswegen spielt es keine, es ist komplett dead. Also es ist wirklich komplett RIP. Venice gerade, guckt euch das mal an. 18 von 110, ja nice poggers."}, {"id": 767, "start": 6328.52, "end": 6337.52, "text": "Kannst du mal die Boxen verlinken, such einfach Stanley Kleinteile-Magazin. Nee keinen und ich brauche das für ein paar Euro da."}, {"id": 768, "start": 6337.52, "end": 6365.52, "text": "So, oh das sind so Trennplatten, ja die werden auch nicht verkehrt. Ja Battlefield 6 soll ich am Battlefield 3 orientieren, das stimmt. Sagen sie."}, {"id": 769, "start": 6365.52, "end": 6379.52, "text": "Also ich bestelle noch mal eins. Eins, dass ich das hier nehm, da eins und da eins. So das reicht dann erstmal, da kann ich ja noch ein paar Sachen oben drauf stellen."}, {"id": 770, "start": 6379.52, "end": 6398.52, "text": "Perfekt, also abhaken, hab ich bestellt, poggers. Dann brauch ich noch eine Runde davon was? Nein, das ist der Soundtrack, wo hab ich mein Video hin?"}, {"id": 771, "start": 6398.52, "end": 6409.52, "text": "Genau, die Dinger, womit ich hier den Kram aufgehängt hab, die sind echt praktisch. Ich hab ja vergessen wie die Dinger heißen."}, {"id": 772, "start": 6409.52, "end": 6416.52, "text": "Da wollte ich mir noch ein paar kaufen, weil da waren bloß 8 Stück drinne. Hab ich die irgendwo rumstehen? Treelancer, genau."}, {"id": 773, "start": 6416.52, "end": 6430.52, "text": "Hier gibt es bestimmt total viele in der Richtung, aber das da, die sind wirklich praktisch gewesen. Ich hab alles schon verbraucht, davon wollte ich mir noch ein paar kaufen."}, {"id": 774, "start": 6430.52, "end": 6458.52, "text": "Genau, nein, Non-Price-Deal, nervt nicht rum jetzt, Amazon, Amazon, Quirino, Twitch Prime, Dankeschön für den Sub, wo hab ich noch ein Prime-Sound? Excellent, IQ++ hier für den Chat."}, {"id": 775, "start": 6458.52, "end": 6472.52, "text": "Mods mit WebUI, Memory Leak, ja das Problem ist, es spielt jetzt halt keiner mehr. Wir haben es so verschissen, werbungsmäßig und dass es keinen offiziellen Server gab."}, {"id": 776, "start": 6472.52, "end": 6492.52, "text": "Es ist echt, war schön, solange es gehalten hat. Man hätte es sicherlich, ich hätte es gerne noch länger gehabt und man hätte es sicherlich auch einiges machen können, aber Pilz an der Rückendeckung von denen, die das programmieren."}, {"id": 777, "start": 6492.52, "end": 6506.52, "text": "Super Mod an sich und auch coole Möglichkeiten, aber wie es halt so ist, Leute, die gut programmieren können, sind nicht so die besten Vermarkter und auch nicht so die Leute, die sich dann gut da in Spielereien versetzen können."}, {"id": 778, "start": 6506.52, "end": 6513.52, "text": "Zumindest nicht alle, ja, also ein paar gibt es das, aber ja, es ist nicht so einfach."}, {"id": 779, "start": 6513.52, "end": 6529.52, "text": "So, tja und dann, übrigens, es hat irgendjemand gefragt, was das für eine Werkzeugwand war, die ich in meinem Video gezeigt hab. Ich hab keine Ahnung, ob das der Hersteller ist oder ob das das Produkt ist, das war das Ding, was ich mir gekauft hab."}, {"id": 780, "start": 6529.52, "end": 6543.52, "text": "Ich hab aber hier nur oben das Regal drauf, unten war mir das zu sehr im Weg und ich hab auch nicht alles von diesen Dingern verwendet, aber es war auf jeden Fall ein nicees System."}, {"id": 781, "start": 6543.52, "end": 6555.52, "text": "Gibt es auch billiger hier? Muss man mal gucken, aber wie gesagt, ich hab dieses komplette Set da gekauft, also ohne Werkzeug, ja, das ist wahrscheinlich eh ziemlich ja crap, was man hier sieht."}, {"id": 782, "start": 6555.52, "end": 6563.52, "text": "Aber, ist das ein Makita Akkuschrauber? Man erkennt es nicht so genau, von der Farbe her könnte es sein, oder?"}, {"id": 783, "start": 6563.52, "end": 6570.52, "text": "Na zumindest, das ist eigentlich ganz, ganz nett, ja."}, {"id": 784, "start": 6570.52, "end": 6585.52, "text": "Ja, ja, das ist auch größer als man denkt hier auf dem Bild, man hat auf jeden Fall ordentlich Platz."}, {"id": 785, "start": 6585.52, "end": 6607.52, "text": "Denkst du, dass es Updatebedarf bei deinem Video zu den besten Programmiersprachen für Einsteiger gibt? Ja, die beste Programmiersprache für Einsteiger finde ich ist eine ganz andere als die, die ich gesagt hab. Die, die ich gesagt hab, sind sicherlich nicht verkehrt zum Einsteigen, aber aktuell gibt es eigentlich meiner Meinung nach nur eine wirklich sinnvolle Sache, wenn man eh nicht schon weiß, was man machen will."}, {"id": 786, "start": 6607.52, "end": 6622.52, "text": "Also wenn du jetzt sagst, ich will Linux Sachen machen, ich will Serveranwendungen machen, ich will Windows GUI machen, ok, dann kann ich einem was erfüllen, aber wenn man gar nichts weiß, was man machen will und einfach nur ein bisschen basteln will, HTML, CSS, JavaScript, fertig."}, {"id": 787, "start": 6622.52, "end": 6626.52, "text": "Da siehst du nämlich gleich, was passiert."}, {"id": 788, "start": 6626.52, "end": 6641.52, "text": "Und so die Basics, was so prinzipiell der Programmablauf abgeht und so, kannst du ja auch wunderbar JavaScript lernen, in JavaScript lernen."}, {"id": 789, "start": 6641.52, "end": 6656.52, "text": "So, ja, und jetzt ist die Frage, ich, hier, also ich hab ja diese USB, von CyberPower. Und ich hab hier diese USB, von CyberPower."}, {"id": 790, "start": 6656.52, "end": 6678.52, "text": "Ja, und jetzt ist die Frage, ich, hier, also ich hab ja diese USB, von CyberPower. Und bei mir ist die Batterie verreckt. Ich bin immer noch am überlegen, gibt es eine gute Lektüre C-Sharp für Anfänger? Ja, gibt's."}, {"id": 791, "start": 6678.52, "end": 6695.52, "text": "Und zwar das da, also wenn du klassischerweise ein Buch lesen willst, dann das hier, aber nicht kaufen, sondern online lesen. Das Buch gibt's komplett online bis Kapitel 16."}, {"id": 792, "start": 6695.52, "end": 6710.52, "text": "Inklusive 16. Ist das gut? Das Buch ist auf Deutsch, die meisten lesen immer noch am liebsten die Sachen auf Deutsch, einfach Native Sprache und so. Das da, inklusive Kapitel 16, Rest kannst du vergessen, brauchst du nicht."}, {"id": 793, "start": 6710.52, "end": 6728.52, "text": "Von den Basics her ist das immer noch aktuell. Ja, XML kannst du überspringen."}, {"id": 794, "start": 6728.52, "end": 6742.52, "text": "So, also. Genau, das ist ja die USB und die ist ja auch hier unten drin, da sieht man ja im Video irgendwo, wo ich es dann zeige."}, {"id": 795, "start": 6742.52, "end": 6770.52, "text": "Hier, da ist die USB, guck da. So, und das erste, was mir in diesem Rack verreckt ist, ist tatsächlich die USB. Und so genau habe ich es ehrlich gesagt nicht kapiert, denn meines bescheidenen Physiwissens nach, ja, was ich mal gelernt habe, gibt es zwei grundsätzliche, unterschiedliche Typen von USBs."}, {"id": 796, "start": 6770.52, "end": 6785.52, "text": "Du hast einmal eine online USB, da geht die Sachen immer durch die Batterie durch. Das hat den Vorteil, dass du auch keine Millisekunden-Aussetze hast und auch alles, wie heißt, Überspannungszeug immer protected ist und sonst was."}, {"id": 797, "start": 6785.52, "end": 6804.52, "text": "Der Nachteil von einer online USB ist, wenn die Batterie kaputt ist, geht halt dahinter auch nichts mehr. So, online USBs sind teuer. Deswegen sind die normalen USBs, die man so kauft, sind eigentlich eben keine online USBs, sondern weiß gar nicht, wie das heißt."}, {"id": 798, "start": 6804.52, "end": 6817.52, "text": "Ich nenne das mal offline USBs. Also sprich, dort wird geguckt, wenn der Input, also wenn das von der Steckdose ausfällt, dann wird auf die Batterie umgeschaltet."}, {"id": 799, "start": 6817.52, "end": 6834.52, "text": "So, und was ich da nicht verstehe ist, das ist keine online USB, aber die Batterie ist verreckt, die ist kaputt anscheinend und man kann trotzdem nichts verwenden dahinter, auch wenn da Strom da ist."}, {"id": 800, "start": 6834.52, "end": 6852.52, "text": "So, deswegen traue ich dieser USB nicht. Ich meine, wie kann das sein? Warum geht die USB nicht, wenn da Strom noch an ist?"}, {"id": 801, "start": 6852.52, "end": 6876.52, "text": "Das ist doch für ein Arsch. Wenn Akku defekt macht jede USB auf Stör... Ja, aber das ist doch kacke. Ich will doch nicht... Ja, aber wenn ich es bemerke, reicht es doch, wenn das piepst, dann sollte es doch nicht den Strom abschalten dahinter. Dafür habe ich doch eine USB."}, {"id": 802, "start": 6876.52, "end": 6886.52, "text": "Das ist mit Absicht, das ist die bescheuerste Absicht aller Zeiten. Ich kann doch nicht das komplette Strom abschalten, nur weil die Batterie weg ist."}, {"id": 803, "start": 6886.52, "end": 6907.52, "text": "Das ist doch total beknackt. Dafür habe ich doch eine USB. Ich habe eine USB, wenn es kaputt geht, also wenn da Strom ausfällt, dass es auf der Batterie geht, aber ich will doch nicht im Umkehrschluss, wenn die USB ein Problem hat, dass da Strom ausfällt."}, {"id": 804, "start": 6907.52, "end": 6919.52, "text": "Das ist voll für ein Arsch. Das ist mega kacke. Den einzigen wirklichen Ausfall in zwei Jahren hatte ich, als die USB verreckt ist."}, {"id": 805, "start": 6919.52, "end": 6935.52, "text": "Ist doch üblich bei Cyberpower."}, {"id": 806, "start": 6935.52, "end": 6945.52, "text": "Also finde ich total bescheuert."}, {"id": 807, "start": 6945.52, "end": 6957.52, "text": "Wenn es so wichtig ist, braucht man noch eine redundante USB. Man kann es im Heimbereich auch übertreiben, aber es gibt ja einen Unterschied zwischen keiner USB und einer USB, die die Sache kaputt macht."}, {"id": 808, "start": 6957.52, "end": 6972.52, "text": "Also das ist bescheuert. Also das riecht beknackt. Wie soll das gehen, wenn der Strom nicht permanent durch die Akkus geht. Das wird einfach umgeschaltet, wenn der Strom ausfällt."}, {"id": 809, "start": 6972.52, "end": 6987.52, "text": "Wie gesagt, es gibt zwei Typen von USBs. Du hast online USBs, aber wie auch immer es jetzt heißt, da geht es immer permanent durch den Akku durch und es gibt die Dinge, die einfach gucken, ist da Strom ausgefallen, dann schaltet es um auf die Batterie."}, {"id": 810, "start": 6987.52, "end": 6993.52, "text": "Deswegen sind die Dinge ja auch so verhältnismäßig billig."}, {"id": 811, "start": 6993.52, "end": 7006.52, "text": "Wir haben auf der Arbeit darum immer zweimal Cyberpower. Das sehe ich nicht ein. Also wenn ich eine USB habe, will ich, dass die USB funktioniert, solange der Inputstrom da ist. Scheiß auf die Batterie oder nichts, kann doch nicht sein."}, {"id": 812, "start": 7006.52, "end": 7010.52, "text": "Du lernst zur Zeit Japanisch. Exzellent."}, {"id": 813, "start": 7010.52, "end": 7022.52, "text": "Da kannst du mir bestimmt auch sagen, ob man Hira, Hira, Gyra oder Jira ausspricht."}, {"id": 814, "start": 7022.52, "end": 7034.52, "text": "Was ist das für Musik da gerade im Hintergrund?"}, {"id": 815, "start": 7034.52, "end": 7054.52, "text": "Hallo? Sound please. Nope. Viel zu laut."}, {"id": 816, "start": 7054.52, "end": 7064.52, "text": "Genau. Ja, das kann, also bei offline USBs kann das durchaus ein paar Millisekunden ausfallen."}, {"id": 817, "start": 7064.52, "end": 7074.52, "text": "Das ist Soundtrack hier."}, {"id": 818, "start": 7074.52, "end": 7089.52, "text": "Ja, also deshalb verstehe ich nicht, warum das dann ausgeht. Wenn die überhitzt und sich ausschaltet, okay, das kann ich dann irgendwie nachvollziehen. Aber einfach nur, weil der Akku kaputt ist, dann tausche ich einen Single Point of Fail gegen den anderen aus."}, {"id": 819, "start": 7089.52, "end": 7106.52, "text": "So nach dem Motto, ich überbrücke, also mit einer USB sorge ich für den Fall vor, dass wenn da Strom ausfällt, okay, aber für den Fall, dass die Batterie ausfällt, ist trotzdem aus. Das ist doch bescheuert. Also die Batterie geht nach zwei Jahren wahrscheinlich ziemlich sicher kaputt."}, {"id": 820, "start": 7106.52, "end": 7121.52, "text": "Immer so zwei bis drei Jahren. So, da ist ja selten dann ein Stromausfall als das. Da würde es ja, müsst ihr euch mal vorstellen, es würde öfters ausfallen mit einer USB als ohne eine USB. Das kann doch nicht sein. Ist doch total hängen geblieben."}, {"id": 821, "start": 7121.52, "end": 7139.52, "text": "Ah, veterans, danke schön für den Sub. Exzellent Sub. Was kosten Ersatzakkus? Ja, das ist das worauf ich jetzt eigentlich raus bin. Also ich bin mir nicht sicher, ob ich die noch verwenden will. Die Akkus gehen, die Akkus sind nicht so teuer. Hier 40 Euro."}, {"id": 822, "start": 7139.52, "end": 7158.52, "text": "Aber ich weiß nicht, ob ich die noch verwenden will, weil ich habe keinen Bock, dass wenn der Akku dann wieder kaputt geht, dass es dann wieder ausgeht."}, {"id": 823, "start": 7158.52, "end": 7174.52, "text": "Du solltest die USB auch regelmäßig, das ist aber doch kein Grund, dass sie sich ausschaltet, wenn die Batterie nicht mehr geht, wenn der Akku nicht mehr geht. Das mag ja alles sein, aber das kann ja nicht der Grund, der Sinn dahinter sein, sich abzuschalten."}, {"id": 824, "start": 7174.52, "end": 7193.52, "text": "Das Ding ist dafür da, um höhere Verfügbarkeit zu haben, nicht um niedrigere zu haben."}, {"id": 825, "start": 7193.52, "end": 7209.52, "text": "Es spricht doch nichts dagegen. Der Akku muss doch nicht abbrennen. Ob die USB den Output abschaltet, hat doch überhaupt nichts mit dem Akku zu tun. Solange Strom reinkommt, geht es eh nicht über den Akku."}, {"id": 826, "start": 7209.52, "end": 7223.52, "text": "Das heißt, dem Akku macht das überhaupt nichts. Die USB könnte einfach sagen, ok Akku leer, wir schalten den Akku ab und wenn dann der Strom ausfällt, passiert halt nichts. Also das ergibt überhaupt keinen Sinn."}, {"id": 827, "start": 7223.52, "end": 7243.52, "text": "Deswegen bin ich mir gar nicht sicher, ob ich hier noch einen Ersatz Akku kaufen soll oder einfach drauf scheißen soll und mir sagen ey, dann halt ohne USB."}, {"id": 828, "start": 7243.52, "end": 7261.52, "text": "Ich hatte davor so eine Steckdose, sowas in der Richtung hatte ich davor und da war das auch kein Problem. Da ist die Batterie schon lange im Arsch bei dem Ding."}, {"id": 829, "start": 7261.52, "end": 7274.52, "text": "Das ist 8 Jahre alt oder so. Das Ding ist seit 5 Jahren schon im Arsch der Akku, aber es funktioniert immer noch, wenn der Strom an ist."}, {"id": 830, "start": 7291.52, "end": 7311.52, "text": "Ne, habe ich nicht. Ne, ich habe keine Online-USB. Garantiert nicht, für den Preis ist das ein Nerv. Sagt der Hersteller ja auch selbst, dass es keine Online-USB ist."}, {"id": 831, "start": 7311.52, "end": 7336.52, "text": "Guck mal, der Hersteller selbst sagt, das ist eine Line-Interactive-USB. Das ist keine Online-USB. Line-Interactive ist quasi das billigste, was es gibt. Das schaltet um, wenn das Strom weg ist auf den Akku."}, {"id": 832, "start": 7336.52, "end": 7356.52, "text": "Das rote Replacement ist eine gute Frage. Ich habe es gerade nicht angeschlossen, aber ich gehe mal, ja, ja, würde schon sagen. Ich kann es jetzt nicht 100% sagen, aber ich denke mal."}, {"id": 833, "start": 7356.52, "end": 7371.52, "text": "Das mit dem Shutdown hat nicht funktioniert. Das lag aber an mir, dass es mit dem Shutdown nicht funktioniert hat. Ich habe das USB angeschlossen, aber ich habe das irgendwie nicht richtig konfiguriert mit diesem Überwachungstool."}, {"id": 834, "start": 7371.52, "end": 7395.52, "text": "Das hätte wahrscheinlich funktioniert, ja. Wann ich damit rechne, wann die Preise runtergehen. Ja, wenn ich das wüsste. Wenn ich das wüsste, dann könnte ich Stonkslike-Grafikkarten leer verkaufen."}, {"id": 835, "start": 7395.52, "end": 7409.52, "text": "Ich habe keine Ahnung. Absolut kein Plan."}, {"id": 836, "start": 7425.52, "end": 7451.52, "text": "Ja, die Preise sind für'n Arsch. So, also, ähm, weiter, muss ich überstehen geblieben."}, {"id": 837, "start": 7451.52, "end": 7462.52, "text": "Also, wie gesagt, ich bin mir unschlusslich, ob ich, ich glaube, ich schmeiß die USB raus. Also, ne, ich schmeiß die USB nicht raus. Ich lass die USB drinnen, weil die USB ist schön schwer."}, {"id": 838, "start": 7462.52, "end": 7470.52, "text": "Und ich hab geplant, dass ich hier oben drauf meinen 3D-Drucker stelle und wenn unten schwere USB drauf ist, wackelt das Ganze nicht und der 3D-Drucker steht schön fest."}, {"id": 839, "start": 7470.52, "end": 7483.52, "text": "Die ist dann einfach quasi nur 12 Kilo beschwerer unten im Rack, ohne dass ich's verwende."}, {"id": 840, "start": 7483.52, "end": 7510.52, "text": "Äh, i3-Megas. Was, ok, Amazon. Was sagt denn Amazon, wenn ich danach suche? Ok, APC kenn ich. Was ist Legrand? Das heißt bestimmt Legrosch oder so. Das bestimmt, äh, Porgers ist das."}, {"id": 841, "start": 7510.52, "end": 7522.52, "text": "Kennt jemand Legrand? Gibt's eine Amazon Basics-USV? Gute Frage."}, {"id": 842, "start": 7522.52, "end": 7542.52, "text": "Wie, aber das ist 2 HE. 2 HE ist mir eigentlich ein bisschen zu fett. Legrand. Aber schon mal ein USB für Shutdown. Es sieht aber fancy aus, ne?"}, {"id": 843, "start": 7542.52, "end": 7554.52, "text": "Wisst ihr was an der cool ist? Die hat vorne Stecker. Die könnt ich in die Mitte machen und dann könnt ich meine Steckdosenleiste gleich mit..."}, {"id": 844, "start": 7554.52, "end": 7568.52, "text": "Wait a minute. Hat die jetzt so Ausgänge oder so Ausgänge? Ja, was denn jetzt? Hat die so Ausgänge oder so? Hä? Können sie nicht entscheiden."}, {"id": 845, "start": 7568.52, "end": 7578.52, "text": "Gut, also der Hersteller sagt mir gar nichts. Wofür ist das? Wenn der Strom ausfällt, dass es noch weiterläuft, je nachdem was du dran hast."}, {"id": 846, "start": 7578.52, "end": 7591.52, "text": "Ich sag mal für 5-6 Minuten. Und wenn der Strom bis dann nicht wieder da ist, werden die Server ordentlich runtergefahren oder die Sachen, die hinten dranhängen, ordentlich runtergefahren."}, {"id": 847, "start": 7591.52, "end": 7601.52, "text": "Der Gamer Alex, dass es zu Elektronik stellt, das kann ich dir nicht erklären."}, {"id": 848, "start": 7601.52, "end": 7625.52, "text": "Grad mal einen Zeitpunkt, da hab ich das verstanden, aber ich hab keine Ahnung. Äh, was? Also, hallo Max, wollte mal Danke sagen, ich hab wegen dir Ausbildungen viel sehr nice, ja?"}, {"id": 849, "start": 7625.52, "end": 7638.52, "text": "März Abschlussprojekt, durch dein Video. Das ist schön. Was machst du für ein Abschlussprojekt?"}, {"id": 850, "start": 7638.52, "end": 7657.52, "text": "Erzähl mal, was machst du? Irgendwas. Also, sofern es nicht Windows Active Directory ist, das ist Resident Sleeper, das macht gefühlt jeder Zweite, weil vielleicht ist ja was interessantes, ja?"}, {"id": 851, "start": 7657.52, "end": 7677.52, "text": "PXE Boot mit Windows Images. Aha. Nicht schlecht. Ich mein, man könnte ein Netboot-Docker starten und da macht alles, aber man kann es auch selber machen."}, {"id": 852, "start": 7677.52, "end": 7689.52, "text": "Du machst Software-Sender und AD. Ja, das machen total viele. Das weiß ich von der IHK, also das macht gefühlt jeder Zweite AD installieren. Hat aber auch den Vorteil, die wissen ein bisschen Bescheid drüber."}, {"id": 853, "start": 7689.52, "end": 7700.52, "text": "Hast du die Twitch-Emails, den Minibot nicht alle? Das zum Beispiel nicht, wobei das echt nice ist."}, {"id": 854, "start": 7700.52, "end": 7713.52, "text": "Wie kam es dazu? Der hat mich angeschrieben. Es geht um dieses Video. Ich kann es euch jetzt, wo mehr Leute da sind, noch mal kurz zeigen."}, {"id": 855, "start": 7713.52, "end": 7724.52, "text": "Ich habe ein Video aufgenommen über meine Physi-Ausbildung mit ihm. Wenn es interessiert, kann er mal vorbeigucken. Kann er mal Hallo sagen."}, {"id": 856, "start": 7724.52, "end": 7739.52, "text": "Wie ist dazu gekommen? Er hat mich angeschrieben per Mail und ich habe mal zur Abwechslung in meine Mails reingeguckt und dachte, das ist ja keine China-Red-Shadow-Legend-Spam-Werbung."}, {"id": 857, "start": 7739.52, "end": 7754.52, "text": "Das können wir machen. Warum nicht? Passt ja vom Content auch. Klar, abo-mäßig bringt es mir nichts, aber man muss es ja nicht immer nur machen, um Abos zu geiern."}, {"id": 858, "start": 7754.52, "end": 7771.52, "text": "Lucas, du kommst vom Stream, oder? Achso, Software-Center, das sagt mir irgendwas. Das ist eine Microsoft-Geschichte."}, {"id": 859, "start": 7771.52, "end": 7793.52, "text": "Da habe ich aber keine Ahnung von. Du warst vorher wahrscheinlich schon wieder weg. Welchen Switch hast du bestellt? Den CSS 610? Den da? Den da? Den da?"}, {"id": 860, "start": 7793.52, "end": 7806.52, "text": "Die Musik ist echt nice. Also bei dem kann ich dir jetzt schon sagen, du musst eine Sache machen, damit du ihn überhaupt verwenden kannst."}, {"id": 861, "start": 7806.52, "end": 7823.52, "text": "Du musst ins Forum gehen und dir die aktuellste Beta-Firmware herunterladen, weil, wie ich in dem Video schon gesagt habe, die Firmware, mit der das Ding ausgeliefert wird, ist nicht zu gebrauchen und das Ding ist Early Access aktuell."}, {"id": 862, "start": 7823.52, "end": 7850.52, "text": "Dann gehst du hier ins offizielle Forum und du musst dir die Beta-Firmware raussuchen."}, {"id": 863, "start": 7850.52, "end": 7878.52, "text": "Irgendwo da. Ach, was weiß ich, wo sie das versteckt haben. Ach, Moment, haben die jetzt offiziell abgelaudet, ihre Firmware dafür? Ich glaube nicht."}, {"id": 864, "start": 7878.52, "end": 7886.52, "text": "Also wie gesagt, du musst unbedingt ins Forum, versuch das Ding nicht mit der ausgelieferten Firmware zu verwenden."}, {"id": 865, "start": 7886.52, "end": 7900.52, "text": "Hier ist die GIF. Ja, nice, fügen wir hinzu. Ja, ja, mach das auf jeden Fall, also das ist voll von Arsch zu verwenden."}, {"id": 866, "start": 7900.52, "end": 7909.52, "text": "Also richtig, richtig kacke mit der Default-Firmware. Da gehen auch nicht mal alle Ports mit der Default-Firmware. Muss man sich mal vorstellen."}, {"id": 867, "start": 7909.52, "end": 7924.52, "text": "Die haben es geschafft, einen Switch auszuliefern, wo nicht mal alle Ports funktionieren."}, {"id": 868, "start": 7924.52, "end": 7932.52, "text": "Ja, das Web-Interface, also das RouterOS Web-Interface finde ich ziemlich gut."}, {"id": 869, "start": 7932.52, "end": 7944.52, "text": "Einzige Sache, also von den Features her, ist auf jeden Fall extrem nice. Man blinkt auch halbwegs durch. Das Problem ist so ein bisschen, die WLAN-Config ist richtig für'n Arsch."}, {"id": 870, "start": 7944.52, "end": 7959.52, "text": "Also WLAN-Config über RouterOS machen ist echt painstrap. Oh, ich werde müde, was ist hier los? Achso, ich bin schon wieder unsinnig lange online und ne, bin ich gar nicht und komme nicht vorwärts."}, {"id": 871, "start": 7959.52, "end": 7976.52, "text": "Also USB kaufe ich nix. Crap. Warum ist das APC-Zeug eigentlich so teuer? Die kochen doch auch nur mit Wasser. All die Musik ist ganz schön MonkaS gerade."}, {"id": 872, "start": 7976.52, "end": 7998.52, "text": "Können die Mikrotik-APs WLANs? Ich wundere mich nicht. Aber Mikrotik-APs fand ich jetzt nicht so geil. Boomer müde, ist so."}, {"id": 873, "start": 7998.52, "end": 8013.52, "text": "Ethon. Hört sich an wie irgendein Pokemon. Ethon, Ethon."}, {"id": 874, "start": 8013.52, "end": 8038.52, "text": "Jetzt übertreiben sie es mit der Musik, aber äh. Ja, besser. Ethon. Boah, what the, ich geb doch keine 760 Euro für. Alter."}, {"id": 875, "start": 8038.52, "end": 8058.52, "text": "Das übertreibt es halt mal, Leute."}, {"id": 876, "start": 8058.52, "end": 8070.52, "text": "Suche nach Ethon, Ellipse, Echo. Okay. Ethon, Ellipse, Echo."}, {"id": 877, "start": 8070.52, "end": 8088.52, "text": "Na, das geht ja. Gibt es da irgendeinen schönen Mount, dass man die ins Rack rein kriegt? Von der Höhe können es halbwegs passen. Ansonsten lege ich die einfach auf ne Schublade und gut ist."}, {"id": 878, "start": 8088.52, "end": 8104.52, "text": "So, und das wichtigste, Leute. Wenn die Batterie in dem Ding verreckt, was passiert dann? Geht dann alles aus oder verreckt nur der Akku und es läuft alles weiter?"}, {"id": 879, "start": 8104.52, "end": 8120.52, "text": "Weil ich hab keinen Bock den gleichen Crab zu haben wie mit der Cyberpower. Explodiert. Ja, Chat, das glaube ich euch sofort."}, {"id": 880, "start": 8120.52, "end": 8134.52, "text": "Firewall, ich verwende das Standard Paketfilter, der im Router drin ist und gut ist. Das reicht. Ist eine Offline-USV. Tja, das dachte ich bei meiner Cyberpower auch."}, {"id": 881, "start": 8134.52, "end": 8150.52, "text": "Und die ist auch eine Offline-USV, aber die hat trotzdem alles ausgeschaltet, als der Akku verreckt ist."}, {"id": 882, "start": 8150.52, "end": 8172.52, "text": "Schau, das Video ist eine E-Ton. Echt? Jetzt können wir mal hier früh gucken. Jetzt nicht. Muss jetzt noch kurz ein paar Sachen von der Einkaufsliste abhaken."}, {"id": 883, "start": 8172.52, "end": 8181.52, "text": "Okay, dann gucken wir, wenn ihr das wollt, können wir es jetzt gucken."}, {"id": 884, "start": 8181.52, "end": 8188.52, "text": "Obwohl, ich muss noch was einkaufen. Warte mal, warte mal. Lass mal schnell gucken, was muss ich noch einkaufen. Also mit der USV einmal geklärt, das haben wir auch."}, {"id": 885, "start": 8188.52, "end": 8206.52, "text": "Ach komm, wir gucken jetzt das Video. So viel, so viel brauche ich denn mehr."}, {"id": 886, "start": 8206.52, "end": 8232.52, "text": "So spricht das falsch aus, das heißt E-A-Ton? Was? Wie kommt man auch sowas? Das heißt einordnisch E-Ton. E-A-Ton? Was?"}, {"id": 887, "start": 8232.52, "end": 8246.52, "text": "E-Ton. Okay, es heißt E-Ton. Sowas, also E-Ton wie E-Ton."}, {"id": 888, "start": 8246.52, "end": 8262.52, "text": "Verstehe, alles klar. Punkt Default, drei Monate, danke für den Sub. So und jetzt, okay, das gucken wir uns jetzt an, dann gehe ich pennen."}, {"id": 889, "start": 8262.52, "end": 8273.52, "text": "Oder vielleicht doch nicht pennen, aber dann erstmal off, zeige ich mal her."}, {"id": 890, "start": 8273.52, "end": 8298.52, "text": "Jetzt muss er erstmal Werbung für seine Merchunterhose machen oder sowas. Wow, schrei nicht so."}, {"id": 891, "start": 8298.52, "end": 8316.52, "text": "Bei denen bin ich mir immer nicht sicher. Zeigen die in dem Video jetzt ihren echten Serverraum oder den Fake Serverraum, der nur für dieses Video existiert? Das weiß man ja dann nie so genau."}, {"id": 892, "start": 8316.52, "end": 8341.52, "text": "Zero Dankeschön für den Sub. Ja, den Sellout kann er gut."}, {"id": 893, "start": 8341.52, "end": 8360.52, "text": "Klar, die haben nicht nur Fake Serverräume, die haben Fake Häuser, die haben Fake Storage, die machen halt das Video zu Entertainment-Zwecken und nicht unbedingt, weil es wirklich einen realen Hintergrund hat."}, {"id": 894, "start": 8360.52, "end": 8374.52, "text": "Ich meine, wenn du dir überlegst, wie viele Sachen da schon angeblich ganz furchtbar kritisch waren und kaputt gegangen sind und sonst was, das war vielleicht am Anfang so, aber mittlerweile ist das mit Sicherheit gestellt, zum größten Teil."}, {"id": 895, "start": 8374.52, "end": 8394.52, "text": "Sieht ja fast aus wie mein Dach. Bestimmt krebserregend."}, {"id": 896, "start": 8394.52, "end": 8415.52, "text": "Grip."}, {"id": 897, "start": 8415.52, "end": 8430.52, "text": "Promise, die hatten doch schon zig Videos, zum Beispiel das Video, wo er einen Handstand auf dem Xeon Server gemacht hat. Das war bestimmt nicht ein echter Server von ihm, den er verwendet. Das ist einfach zu Show-Zwecken."}, {"id": 898, "start": 8430.52, "end": 8445.52, "text": "Das muss einem doch klar sein, wenn man die Videos guckt. Das ist zu 90% zu Show-Zwecken. Ich meine, das kann durchaus ihr echter Serverraum sein, aber mir geht es so prinzipiell um die Videoinhalte. Da ist einfach vieles rein aus Entertainment-Zwecken. Wie willst du es denn anders machen?"}, {"id": 899, "start": 8445.52, "end": 8464.52, "text": "Okay, wann fängt es an zu brennen?"}, {"id": 900, "start": 8464.52, "end": 8489.52, "text": "Wobei das tatsächlich, zumindest von dem her, sieht tatsächlich wie ein echter Serverraum aus. Nicht wie die anderen Videos, die eine Küsche im Hintergrund haben und auch im Studio sind."}, {"id": 901, "start": 8489.52, "end": 8503.52, "text": "Okay, wann brennt es? Ich will sehen, dass es brennt."}, {"id": 902, "start": 8503.52, "end": 8517.52, "text": "Feuer. Alarm. Alarm."}, {"id": 903, "start": 8517.52, "end": 8532.52, "text": "Ja, natürlich. Die haben gesagt, das kannst du dann aber sicherlich mal in einem Video erwähnen, oder? Und er hat gesagt, ja. Und dann haben die gesagt, easy, kein Problem."}, {"id": 904, "start": 8532.52, "end": 8543.52, "text": "Aber SirCyborg natürlich stellen die Dinger. Das war doch garantiert kein Server von ihm, woran ein Handstand gemacht hat."}, {"id": 905, "start": 8543.52, "end": 8559.52, "text": "Aber Mann, Jett, ihr wollt mich heute wieder triggern. Es geht nicht darum, dass die Videos fake sind. Es geht darum, dass die Dinger, die gezeigt werden, halt so konstruiert sind, dass sie eben ein Entertainment-Video hergeben."}, {"id": 906, "start": 8559.52, "end": 8574.52, "text": "Ihr glaubt doch nicht ernsthaft, dass der einen Handstand macht auf einem Xeon-Server, den sie bei sich irgendwo im laufenden Betrieb ausgebaut haben vorher. Der hat mal auf einem Video einen Handstand auf einem Server gemacht, um die CPUs anzudrücken und sowas."}, {"id": 907, "start": 8574.52, "end": 8587.52, "text": "Das ist einfach Entertainment-Zwecken. Das hat keinen realen Hintergrund irgendwie. Das macht es doch nicht schlechter."}, {"id": 908, "start": 8587.52, "end": 8594.52, "text": "The other part of the deal was we had to talk through some of the things we did wrong to make sure that other Eaton-Customers don't make the same mistakes."}, {"id": 909, "start": 8594.52, "end": 8603.52, "text": "The UPS trains are coming. Hold on, let me just lift up and over the cable."}, {"id": 910, "start": 8603.52, "end": 8617.52, "text": "Das war ein halbes Werbevideo für Intel damals mit dem Xeon-Server. Deswegen, das ist vom Inhalt her gemacht, dass es Entertainment ist."}, {"id": 911, "start": 8617.52, "end": 8634.52, "text": "Wenn ich irgendein Video zu einem Thema aufnehme, dann drehe ich mir die Sachen manchmal auch so hin, dass sie einfach die bessere Storyline und das bessere Entertainment ergeben. Manchmal erzähle ich Sachen, die vorher passiert sind nachher, sodass es sich einfach unterhaltsamer anhört."}, {"id": 912, "start": 8634.52, "end": 8639.52, "text": "Das machen die da auch. Natürlich machen die das. Wie soll das anders funktionieren?"}, {"id": 913, "start": 8639.52, "end": 8651.52, "text": "Ja gut, es hat halt ein bisschen geschmort."}, {"id": 914, "start": 8651.52, "end": 8657.52, "text": "Promise, ich habe nichts anderes gesagt."}, {"id": 915, "start": 8657.52, "end": 8674.52, "text": "Oh, das ist nicht gut."}, {"id": 916, "start": 8674.52, "end": 8682.52, "text": "Sieht man noch irgendwann, wenn es qualmt?"}, {"id": 917, "start": 8682.52, "end": 8690.52, "text": "Ich will sehen, wie es qualmt."}, {"id": 918, "start": 8690.52, "end": 8698.52, "text": "Es qualmt noch nicht mal. Ich wollte sehen, wie es qualmt."}, {"id": 919, "start": 8698.52, "end": 8704.52, "text": "Okay, das ist langweilig. Ich dachte, es brennt."}, {"id": 920, "start": 8704.52, "end": 8727.52, "text": "Gebatet, gebatet, Alter."}, {"id": 921, "start": 8727.52, "end": 8734.52, "text": "Nichts gebatet."}, {"id": 922, "start": 8734.52, "end": 8755.52, "text": "Ja, es hat geschmort ein bisschen. Ja, super, exzellent."}, {"id": 923, "start": 8755.52, "end": 8769.52, "text": "Das ist ja langweilig, wenn es sich brennt. Wir sehen jetzt, wie es brennt."}, {"id": 924, "start": 8769.52, "end": 8775.52, "text": "Das kenne ich noch."}, {"id": 925, "start": 8775.52, "end": 8803.52, "text": "Das war ein April Scherz Video."}, {"id": 926, "start": 8803.52, "end": 8813.52, "text": "Top Idee."}, {"id": 927, "start": 8813.52, "end": 8819.52, "text": "Ich meine, ich würde es nicht wundern, wenn irgendein YouTuber das in das Haus abfackelt, weil es gut Klicks bringt."}, {"id": 928, "start": 8819.52, "end": 8828.52, "text": "Für gut Klicks macht man auch alles."}, {"id": 929, "start": 8828.52, "end": 8835.52, "text": "Das habe ich überhaupt nicht gesagt."}, {"id": 930, "start": 8835.52, "end": 8843.52, "text": "Es sind halt manche Sachen konstruiert, dass es ein gutes Video gibt."}, {"id": 931, "start": 8843.52, "end": 8850.52, "text": "Zum Beispiel, wo sie sich bei Linus Tech Tipps diesen Fernseher oder was das war, ins Badezimmer eingebaut haben."}, {"id": 932, "start": 8850.52, "end": 8855.52, "text": "Das hätte der nie gemacht. Hätte er nicht passenderweise einen Sponsor dazu gehabt."}, {"id": 933, "start": 8855.52, "end": 8864.52, "text": "Erstens und zweitens wäre das nicht ein cooles Entertainment Video gewesen."}, {"id": 934, "start": 8864.52, "end": 8868.52, "text": "Das kommt halt zusammen in der Stelle."}, {"id": 935, "start": 8868.52, "end": 8877.52, "text": "Natürlich hat er es gemacht, aber er hätte es ohne diese Sachen im Hintergrund nicht gemacht, weil es komplett sinnlos Installation war."}, {"id": 936, "start": 8877.52, "end": 8887.52, "text": "Ich fand es auch witzig, als der Controller ins Wasser gefallen ist."}, {"id": 937, "start": 8887.52, "end": 8890.52, "text": "Genau."}, {"id": 938, "start": 8890.52, "end": 8894.52, "text": "Das wird gemacht, um zu zeigen, dass es eine coole Sache ist."}, {"id": 939, "start": 8894.52, "end": 8901.52, "text": "Das wird gemacht, um ein gutes Video zu machen."}, {"id": 940, "start": 8901.52, "end": 8912.52, "text": "Nicht, weil er wirklich sein Haus umbaut oder so etwas."}, {"id": 941, "start": 8912.52, "end": 8921.52, "text": "Ich sage doch gar nicht, dass es ein Geheimnis ist. Ich weiß gar nicht, was ihr jetzt eigentlich wollt."}, {"id": 942, "start": 8921.52, "end": 8926.52, "text": "Aber die Sachen sind offensichtlich so gemacht, dass man eben gut Content daraus produzieren kann."}, {"id": 943, "start": 8926.52, "end": 8931.52, "text": "Anders kannst du es doch auch gar nicht machen."}, {"id": 944, "start": 8931.52, "end": 8936.52, "text": "Das ist jetzt ja keine super Secret Taktik oder so."}, {"id": 945, "start": 8936.52, "end": 8946.52, "text": "Das musst du ja quasi sogar so machen, wenn du Channels in dieser Größe, in dieser Frequenz und mit diesen massig Zuschauern hast."}, {"id": 946, "start": 8946.52, "end": 8955.52, "text": "Da bleibt ja gar nichts anderes übrig. Du musst gucken, dass du so einen Fahrplan hast, was du an Content produzieren willst."}, {"id": 947, "start": 8955.52, "end": 8962.52, "text": "Und selbstverständlich machst du die Sachen, die du machst, dann auch daraufhin optimiert."}, {"id": 948, "start": 8962.52, "end": 8976.52, "text": "Also wenn du sagst, ich muss jetzt 15 Dinge erledigen, dann guckt man, wie schaffe ich es aus diesen 15 Dingen, die ich eh erledigen muss, mit ein bisschen Story drum herum 15 unterhaltsame Videos zu machen."}, {"id": 949, "start": 8976.52, "end": 8985.52, "text": "Und da kommt mit Sicherheit auch die eine oder andere Idee, die absolut unsinnig ist und vorher keiner machen wollte, einfach nur, weil es ein gutes Video ergibt."}, {"id": 950, "start": 8985.52, "end": 8994.52, "text": "Das ist weder was Schlimmes oder sonst was, aber so funktioniert das halt mal."}, {"id": 951, "start": 8994.52, "end": 8999.52, "text": "Was war das? Was für ein Ding?"}, {"id": 952, "start": 8999.52, "end": 9004.52, "text": "Keine Ahnung."}, {"id": 953, "start": 9004.52, "end": 9008.52, "text": "Ja klar, die produzieren ja auch für andere Videos und sowas."}, {"id": 954, "start": 9008.52, "end": 9023.52, "text": "Was ich da auch witzig finde ist, früher haben sie in der Küche aufgenommen und heute nehmen sie im Studio aus und lassen es aussehen wie in der Küche, was halt auch geil ist."}, {"id": 955, "start": 9023.52, "end": 9031.52, "text": "Die anderen versuchen daheim ihre Küche nach Studio aussehen zu lassen und Lilus Tech Tips macht das Studio zur Küche."}, {"id": 956, "start": 9031.52, "end": 9042.52, "text": "Wobei sie ja früher wirklich in der Küche aufgenommen haben."}, {"id": 957, "start": 9042.52, "end": 9046.52, "text": "Diese kopiert ja ein E, ich kopiere eins und es gerne."}, {"id": 958, "start": 9046.52, "end": 9051.52, "text": "Das mache ich auch öfters."}, {"id": 959, "start": 9051.52, "end": 9069.52, "text": "Man könnte sagen, das Video war eine Art Clickbait mit dem Gebrannt, aber mal ganz ehrlich, ich bin mittlerweile da nicht mehr so allergisch gegen."}, {"id": 960, "start": 9069.52, "end": 9077.52, "text": "Also du musst mittlerweile auf YouTube einfach ein gutes Thumbnail und einen guten Videotitel haben."}, {"id": 961, "start": 9077.52, "end": 9084.52, "text": "Natürlich sollte es nicht komplett gelogen sein, das ist ja, wenn man es streng nimmt sogar gegen die Richtlinien, aber das juckt im Endeffekt kein Mensch mehr."}, {"id": 962, "start": 9084.52, "end": 9092.52, "text": "Aber es ist schon durchaus, also finde ich, es ist durchaus legitim in den Videotitel zu schreiben."}, {"id": 963, "start": 9092.52, "end": 9097.52, "text": "Es hat gebrannt oder unser Serverraum hat Feuer gefangen."}, {"id": 964, "start": 9097.52, "end": 9106.52, "text": "Hat er ja auch. Ich meine, man denkt ein bisschen, wenn man das sieht, man sieht im Video, wie das Serverraum brennt."}, {"id": 965, "start": 9106.52, "end": 9115.52, "text": "Ist es dann im Endeffekt nicht, aber das ist jetzt nicht so ultra Clickbait wie, keine Ahnung, ihr kennt diese ganzen Geschichten."}, {"id": 966, "start": 9115.52, "end": 9118.52, "text": "Twitch Chat hasst diesen Trick."}, {"id": 967, "start": 9118.52, "end": 9128.52, "text": "10 Tipps, ihr glaubt nicht, was Nummer 5 ist und da kommt dann übelster Schwachsinn."}, {"id": 968, "start": 9128.52, "end": 9133.52, "text": "Ich habe letztens auch Clickbait gemacht."}, {"id": 969, "start": 9133.52, "end": 9138.52, "text": "Oder Eax hat noch ein eigenes Command, heißt der Channel von ihm überhaupt noch so?"}, {"id": 970, "start": 9138.52, "end": 9141.52, "text": "Nö."}, {"id": 971, "start": 9141.52, "end": 9144.52, "text": "Nummer 8 wird sich schockieren, genau."}, {"id": 972, "start": 9144.52, "end": 9152.52, "text": "Ich habe letztens, wenn du so willst, ich habe letztens auch übelst geclickbaited, wenn ihr so wollt."}, {"id": 973, "start": 9152.52, "end": 9154.52, "text": "Guck mal das hier."}, {"id": 974, "start": 9154.52, "end": 9163.52, "text": "Ich wurde gehackt und was ich daraus gelernt habe, hört sich so an, wie als hat irgendein Typ meinen YouTube-Account plattgemacht."}, {"id": 975, "start": 9163.52, "end": 9164.52, "text": "So nach dem Motto."}, {"id": 976, "start": 9164.52, "end": 9172.52, "text": "Und was erzähle ich im Video über die Erfahrungen, die ich gemacht habe mit solchen Leuten."}, {"id": 977, "start": 9172.52, "end": 9174.52, "text": "Oder gehackt oder auch großgeschrieben."}, {"id": 978, "start": 9174.52, "end": 9180.52, "text": "Aber das hilft halt was, aber das ist schon Clickbait, kann man nicht anders sagen."}, {"id": 979, "start": 9180.52, "end": 9186.52, "text": "Das ist aber finde ich noch im Rahmen, sonst würde ich es auch nicht machen und das kann ich auch anderen nicht vorwerfen dementsprechend."}, {"id": 980, "start": 9186.52, "end": 9190.52, "text": "Und es geht ja letztendlich darum."}, {"id": 981, "start": 9190.52, "end": 9197.52, "text": "Es ist ja nicht so, dass es contentmäßig 2 Sekunden darum geht."}, {"id": 982, "start": 9197.52, "end": 9206.52, "text": "Also was ich teilweise bescheuert finde ist, wenn dann Leute in Titel schreiben, das haben wir sonntags, kriegen wir ab und zu so Videos vorgeschlagen."}, {"id": 983, "start": 9206.52, "end": 9212.52, "text": "So nach dem Motto, ich übertreibe es jetzt mal sinngemäß, steht dann irgendwie im Titel so Lidl Gaming PC."}, {"id": 984, "start": 9212.52, "end": 9220.52, "text": "Der, was weiß ich, unglaublich, unglaublich was Lidl hier wieder macht."}, {"id": 985, "start": 9220.52, "end": 9221.52, "text": "So nach dem Motto."}, {"id": 986, "start": 9221.52, "end": 9233.52, "text": "Dann machst du das Video auf, 15 Minuten lang und es geht 30 Sekunden darum, dass, keine Ahnung, sich Lidl beim Grafikkartentitel verschrieben hat oder so."}, {"id": 987, "start": 9233.52, "end": 9238.52, "text": "Und dann denke ich, okay, das ist mir dann doch schon ein bisschen zu übertrieben."}, {"id": 988, "start": 9263.52, "end": 9272.52, "text": "So chat, also es ist 22 Uhr."}, {"id": 989, "start": 9272.52, "end": 9275.52, "text": "Ich glaube, ich gehe jetzt pennen oder zumindest off."}, {"id": 990, "start": 9275.52, "end": 9278.52, "text": "Da ist ja wirklich Black Ops 1 auf dem Desktop."}, {"id": 991, "start": 9278.52, "end": 9279.52, "text": "Nö, ist es nicht."}, {"id": 992, "start": 9279.52, "end": 9284.52, "text": "Da ist Boomer 1 auf dem Desktop vielleicht."}, {"id": 993, "start": 9284.52, "end": 9289.52, "text": "Da ist aber nicht Black Ops 1 auf dem Desktop."}, {"id": 994, "start": 9289.52, "end": 9290.52, "text": "Das wüsste ich."}, {"id": 995, "start": 9290.52, "end": 9296.52, "text": "Da ist Cold War Singleplayer, den ich mal deinstallieren könnte drauf."}, {"id": 996, "start": 9296.52, "end": 9303.52, "text": "Der ganz okay war, aber bei weitem nicht an Black Ops 1 reingekommen ist."}, {"id": 997, "start": 9303.52, "end": 9312.52, "text": "Das ist der beste Desktop."}, {"id": 998, "start": 9312.52, "end": 9319.52, "text": "Das ist denn so sieht ein Desktop aus, wenn man den Desktop nicht als Desktop verwendet, sondern als weiterer Ordner."}, {"id": 999, "start": 9319.52, "end": 9323.52, "text": "Und ist eigentlich auch das Beste, was man machen kann."}, {"id": 1000, "start": 9323.52, "end": 9327.52, "text": "Der Chat ist noch nicht high IQ genug dafür, das zu verstehen."}, {"id": 1001, "start": 9327.52, "end": 9329.52, "text": "Deswegen braucht es noch ein paar Prime-Sub."}, {"id": 1002, "start": 9329.52, "end": 9343.52, "text": "Irgendwann kommt ihr auch dahinter, dass das eigentlich die beste Desktop-Anordnung ist."}, {"id": 1003, "start": 9343.52, "end": 9352.52, "text": "Da steht Black Ops, weil die mittlerweile bei der Benahmung so gefällt haben, dass keiner mehr durchblickt."}, {"id": 1004, "start": 9352.52, "end": 9355.52, "text": "Was wurde eigentlich aus Crysis VM?"}, {"id": 1005, "start": 9355.52, "end": 9358.52, "text": "Was ist denn Crysis VM, sagt mir gar nichts."}, {"id": 1006, "start": 9358.52, "end": 9360.52, "text": "Ist das irgendein neues?"}, {"id": 1007, "start": 9360.52, "end": 9362.52, "text": "Weiß ich nicht."}, {"id": 1008, "start": 9362.52, "end": 9365.52, "text": "Oder meinst du Crysis in der VM?"}, {"id": 1009, "start": 9365.52, "end": 9385.52, "text": "Das hat doch funktioniert."}, {"id": 1010, "start": 9385.52, "end": 9395.52, "text": "Aber das war ja nur etwas, was wir nebenbei ausprobiert haben."}, {"id": 1011, "start": 9395.52, "end": 9401.52, "text": "Das war ja nicht das Ziel Crysis in der VM laufen zu lassen."}, {"id": 1012, "start": 9401.52, "end": 9404.52, "text": "Ah, yes."}, {"id": 1013, "start": 9404.52, "end": 9407.52, "text": "Das ist eine coole Anleitung."}, {"id": 1014, "start": 9407.52, "end": 9414.52, "text": "Guck mal hier, wie gut das funktioniert."}, {"id": 1015, "start": 9414.52, "end": 9421.52, "text": "Ja, alles klar Leute."}, {"id": 1016, "start": 9421.52, "end": 9433.52, "text": "Diese Ubiquiti-Dinger sind zwar technisch ganz nice, aber ich finde dieses ganze Unify-Konzept für daheim nicht so geil."}, {"id": 1017, "start": 9433.52, "end": 9437.52, "text": "Du brauchst quasi einen extra Controller für zwei bis drei Access Points."}, {"id": 1018, "start": 9437.52, "end": 9443.52, "text": "Danach wird es vielleicht Sinn machen, aber zwei bis drei, die stellst du daheim einmal ein und die bleiben dann immer so."}, {"id": 1019, "start": 9443.52, "end": 9446.52, "text": "Wobei ich diese Ubiquiti-Dinger immer noch mit am besten finde."}, {"id": 1020, "start": 9446.52, "end": 9448.52, "text": "Aber wirklich, wirklich geil finde ich sie auch."}, {"id": 1021, "start": 9448.52, "end": 9451.52, "text": "Sie sind schon gut."}, {"id": 1022, "start": 9451.52, "end": 9454.52, "text": "Aber so wirklich super finde ich die nicht."}, {"id": 1023, "start": 9454.52, "end": 9457.52, "text": "Ja, ja, die kannst du auch einzeln verwenden, aber da brauchst du halt einen Controller für."}, {"id": 1024, "start": 9457.52, "end": 9462.52, "text": "Das ist doof hier, nice, easy."}, {"id": 1025, "start": 9462.52, "end": 9476.52, "text": "Mikrotik-Access-Points, weiß ich nicht, ob die was taugen."}, {"id": 1026, "start": 9476.52, "end": 9478.52, "text": "Okay Leute, wir sehen uns morgen früh."}, {"id": 1027, "start": 9478.52, "end": 9481.52, "text": "Morgen früh ist Sonntag schon wieder, ne?"}, {"id": 1028, "start": 9481.52, "end": 9484.52, "text": "Ja."}, {"id": 1029, "start": 9484.52, "end": 9487.52, "text": "Sonntag, alles klar Leute."}, {"id": 1030, "start": 9487.52, "end": 9492.52, "text": "Bis dann, macht's gut."}, {"id": 1031, "start": 9492.52, "end": 9496.52, "text": "See you."}, {"id": 1032, "start": 9496.52, "end": 9518.52, "text": "So, 10 Uhr."}]}