{"text": "Das war's für heute. Vielen Dank für's Zuhören. Bis zum nächsten Mal. Bis zum nächsten Mal. Ah, yes. Exzellent. Dat Typ 19, Mona. Dankeschön für den Sub. Exquisite. Orangischen Saft. Ja, Leute, ich hatte einen Joopnet Vorholz zu streamen. Aber, äh... Aber, äh... Aber, äh... Aber, äh... Aber, äh... Aber, äh... Aber, äh... Aber, äh... Ja, eigentlich ist für mich mittlerweile streamen schon so was wie Entspannung. Kommt ein bisschen auf den Chat an. Je nachdem wieviel der Chat Backseated. Dann... Weiß winning so genau. Meistens finde ichs entspannend. Caipin. Wikipeng, 4 Monate. Danke für den Sub. Massive Subcription. Ja und zwar warum bin ich on? Mach mal das Ascii-Quarium auf. Äh okay. But why? Wann kommt das endgültige Surferraum Video ja gut, wenn der Surferraum fertig ist. Jaja also ihr müsst auf jeden Fall ein bisschen was fragen, sonst Ruby. Also was Herr N. gesagt hat, dass er irgendwelche Großrechnergeschichten macht und mal gern mit mir Discord labern würde, ja bin ich dabei. Werde ich ihm ne Runde schwätzen die nächsten Tage. Machen wir hier mal kurz zu. Hier Ascii-Quarium ist auf guck. Kannst du stream auch richtig sagen? Nee kann ich nicht. Jaja Herr M. hat sich gemeldet tatsächlich. Ist der Controller von gestern RIP, ja tatsächlich wartet mal ich muss mal kurz Dark Seam anmachen weil ich hab's hier dunkel in dem Raum, weil also der Grund warum ich on gekommen bin sag ich euch mal so. Ich hab immer noch ein bisschen Kopfweh und das geht irgendwie nicht richtig weg. Ich geh morgen auch mal zum Doktor, gut was soll der sagen, außerdem legen sie sich hin, schonen sie sich. Aber ist vielleicht gar keine so schlechte Idee. Und ich hab gemerkt wenn ich streame habe ich danach weniger Kopfweh, ich weiß nicht warum. Wann komm dem Garten durch den Schnee stellst, ich hab hier aufgenommen. Vielleicht lad ich das einfach so random morgen mal hoch, weil jetzt ist ja kein Schnee mehr da. Ja zum Doktor gehen das geht, da ist eh nicht viel los und zu Corona zeiten wahrscheinlich noch mehr. Richtig, endlich durch den IQ des Chats wird dein Hirn entlastet, exakt, exakt so siehts aus. Exzellent, exzellent, wartet mal wo ist das passende, ja also dieser, der im letzten Stream nicht dabei war, ich hab zwei Controller gegrillt von dieser Sorte hier und ich hab versucht welche zu bestellen Leute, ne, pass mal auf wenn du den Kram bestellen willst, du kriegst erstmal 50 Milliarden Seiten und der Kram ist ultra teuer mittlerweile. Ich hab jetzt erstmal nix bestellt, ich hab noch zwei, das reicht. Der Doktor morgen kommt wahrscheinlich überhaupt keine Diagnose, der Typ der macht ja nie was. Das einzige was der machen kann ist zu sagen schonen sie sich und ich schreib sie krank. Ja 20 Dollar oder so das Stück, die sind zum steuern von, also die kannst du proklamieren und machen lassen was du willst. Excellent, aber damit will ich meinen Stromzähler im Keller auslesen, oah, oah, Flashbang, nochmal defused alter, ja hier pass mal auf, hier kostet er nämlich 20 Dollar und ich dachte mir ey das ist ne geile Sache, kauf ich mir, 18 Dollar, 15 Euro Shipping ist auch noch okay und dann kommt Ships vom Australia und dauert irgendwie 5 Wochen oder so. Ne, Crap alter. Was heißt der Langstuhl für den Zap? Oah das Scamtrain ist da, habt ihr euch nice jebaiten lassen. Der Versand aus dem Ausland dauert nicht unbedingt ewig, aber aus Australien dauert anscheinend ewig. Also Aliexpress ist teilweise ziemlich schnell, okay die haben auch EU Warenlager und alles am Start ja und aber ja der Controller ist, wer auch immer das noch mal gefragt hat, ja also Splixer, das Ding ist definitiv im Arsch, gibt es auch keine Punktedrückerstattung oder so, das Ding ist ziemlich sicher broken as fuck, ja. Wenn Overwatch 2 released wird, schaust du dann mal rein, ja wahrscheinlich schon, wahrscheinlich schon, aber ich hab echt keine Ahnung ob ich mir das nochmal geben werde. Was muss ich machen damit mein Chrome, mein Unify nicht mehr als nicht sicher Kennzeichen mit dem gültiges Zertifikat geben, das kannst du zum Beispiel nehmen, Alter Flashbang. Ist das denn jetzt Dark Mode, ja also was du machen kannst für den Unify Controller, Unify Controller das ist so ein Webinterface zum Steuern von Unify Access Points wer das nicht kennt, sieht so aus, ja das ist die alte Version aber so, naja das sind die Settings ne, also ich hab so ne Übersicht mit Access Points und könnt da Zeug von einstellen, so. Ist eigentlich ne ganz, ganz coole Idee für Easy Management, Torpsen, nee Teorpsen, Twitch Prime, danke schön für den Sub, exquisite. Wie heißt der Netzwerkmonitor in der Statusleiste, gibt's den auch für Ubuntu, das ist i3 status Rust, da ist es eingebaut, das ist so ne Bar, die funktioniert halt nur unter i3 ordentlich, aber die gibt's auch unter Ubuntu, ja, das kannst du installieren wo du willst, so um jetzt mal auch da drauf zu kommen, also wie gesagt so schaut das Ding aus, es ist zum Steuern von Unify Equipment und das hat wenn man drauf geht erstmal kein gültiges Zertifikat, was man jetzt machen kann ist folgendes, also was ich bei mir gemacht hab, weil ich mag auch keinen ungültigen Zertifikat, man kann sich mit Let's Encrypt ein Zertifikat ausstellen lassen, so was ich empfehlen würde ist allerdings, wenn man sich für seinen Unify Controller ein Let's Encrypt Zertifikat ausstellt, was ich empfehlen würde ist folgendes, ich würde das nicht wirklich dem Unify Controller geben, das Zertifikat, sondern ich würde ein Reverse Proxy davor machen, der für mich auch Let's Encrypt handelt, also sprich ihr installiert euch beispielsweise nen Kadi, nen Engine X, nen HA Proxy, was auch immer, Kadi ist das einfachste finde ich, weil der hat das ganze Let's Encrypt Zeug schon eingebaut oder was auch immer, letztendlich ist es egal, macht ihr davor und den Last, Traffic, Traffic finde ich, Sideversion 2 finde ich abartig zu konfigurieren, macht ihr davor und den lasst ihr Let's Encrypt machen und dann lasst ihr Let's Encrypt weiter leiten auf den Unify Controller, so hab ich das bei mir auch gemacht, guck, kann ich euch zeigen, ich weiß, oh, ah ne, kann ich euch nicht zeigen, ich hab's nicht laufen, lul, ja, aber so hab ich's bei mir auch gemacht, kannst du in einem Stream oder Video Reverse Proxy erklären, ne, denn Reverse Proxy ist im Prinzip das Gegenteil von einer Weiterleitungsproxy, also zur normalen Webproxy verwendest du um von innen nach außen ins Internet zuzugreifen, das heißt, du fragst beim Proxy an, der Proxy fragt für dich an und dort ist es umgedreht, das Internet greift auf dich zu, greift erst auf den Reverse Proxy zu, der Reverse Proxy fragt auf deinem Service intern an, so musst du deine internen Services halt auch nicht exposen ins Web zum Beispiel, ja, so und Leute denkt grad, du müsst Ed Wupplos davor schauen, wenn ich was zu sagen soll, weil sonst seh ich's wahrscheinlich gleich nicht, so und um das jetzt hier besser, besser machen zu können mit Let's Encrypt und internen Domains, würde ich euch empfehlen, ein Ricksle Twitch Prime, danke schön für den Sub, ich hab bestimmt die Hälfte übersehen, solltet ihr das am besten über DNS Challenge machen, also wenn ihr ne Domain habt, oder meinetwegen auch irgendeine DuckDNS Domain, ist ja auch relativ beliebt, aber gehen wir mal davon aus, ihr habt wirklich ne echte Domain gekauft, der Kram kostet ja auch nicht mehr viel, 7 Dollar im Jahr, das kann sich glaub ich jeder leisten, um einen schönen Domain zu haben, dann seid ihr entweder bei einem Domain Registrar, der ne DNS API hat, oder ihr legt eure Domain zu Cloudflare oder zu irgendeinem anderen, der das kann, und dann könnt ihr mit Let's Encrypt DNS Challenge machen, also sprich, das ganze funktioniert so, ihr startet ein Programm bei euch lokal, was halt das implementiert hat, DNS Challenge für Let's Encrypt, sagen wir mal mit Cloudflare, und dann funktioniert das folgendermaßen, so ganz grob, Cloudflare und das Programm kommunizieren miteinander, das Programm hinterlegt einen geheimen Schlüssel in dem DNS Record, den nur ihr und Cloudflare kennt, Cloudflare guckt nach, ob in dem DNS-Eintrag dieser geheime Schlüssel drin steht, wenn ja, dann beweist das, ihr seid Eigentümer der Domain, und es gibt euch ein Zertifikat, das hat den riesen Vorteil, DNS Challenge, ihr könnt das ohne Probleme auch für interne Sachen machen, für die Standard HTTP Challenge müsste der Server im Internet stehen, und auf Port 80 erreichbar sein, deswegen ist es mit DNS Challenge für interne Domains viel besser und einfacher, und die gängigen Sachen, sei es hier Sirtboard oder sonst wie, oder auch Cuddy, die können das auch mit DNS Challenge, sei es mit einem Plugin, genau wie gesagt, wer keine eigene Domain hat, kann hier sowas zum Beispiel verwenden, das ist eigentlich auch ganz nice, da kriegt man eben einen dynamischen DNS-Eintrag, aber ich würde euch auf jeden Fall empfehlen, holt eine eigene Domain, ist DNS Challenge nicht IP League, naja, wenn Cloudflare auf dich zugreift und die auf Port 80 eine Datei abruft, ist das auch IP League, Cloudflare muss das schon wissen, und ne, ist es nicht unbedingt IP League, ne, sag mal so, du greifst ja mit deiner externen IP auf Cloudflare zu, nicht auf Cloudflare, auf Let's Encrypt zu, ja, ich meine, du kannst das auch über irgendeinen VPN oder Proxy oder so machen, das geht auch, wichtig ist halt nur, dass der DNS-Eintrag da ist, und es ist ein TXT-Record, also keine IP, also sprich, der DNS antwortet mit einem Text-File, nicht mit einer IP in dem Fall, ja, genau, also das ist eigentlich die einfachste Variante, und das ist auch die Sache, wie ich bei mir lokal gültige Zertifikate habe, ich bin sogar mal so weit gegangen und hab meinem Staubsauger-Roboter ein gültiges Zertifikat verpasst, hab ich aber wieder weggemacht, weil das mit dem regelmäßig updaten ein bisschen schwierig war, aber damit kann man wirklich ganz schön viel anstellen mit Let's Encrypt, ja, so siehts aus, so, next, so siehts aus, bestimmt, bestimmt, der sagt, aha, ich diagnostiziere Twitch Chat Big Brain, sagt der morgen, Programme immer über Power-Toys starten, kann ich mal Power-Toys installieren, ich mach eh unter Windows nichts, was irgendwie technisch advanced wäre, ja, ja, ja, ist mir lieber, also ich starte meine Programme unter Linux immer hier mit, ups, nee, das ist mein Clipboard, mein Anker, ich starte, nee, ich glaub, das ist kein Passwort, ich bin mir gar nicht sicher, für was das war, irgendein APK für irgendwas, was wir glaub ich mal ausprobiert haben, nee, das ist nicht das WLAN Passwort, ich bin mir gar nicht sicher, ehrlich gesagt, für was das, das ist die, das ist die Uhrl von irgendeinem Amazon Ding gewesen, oder, genau, das ist die Channel-ID vom WLED YouTube-Channel, den haben wir uns letztens eingeguckt, nee, nee, ich hab hier, ich hab doch extra Streaming-Accounts, da ist kein Passwort liegt, hier, ein letztens jemand, haben wir glaub ich auch wieder im Chat, hallo, der bei WLED mit bastelt und ja, ich hab den offiziellen Channel gezeigt, genau, du warst das, stimmt, ich erinnere mich, ja, wie bricht man das eigentlich aus, jvpeak, jvpeak, oder, wie auch immer, so, und, jetzt hab ich voll verdrängt, was ich sagen wollte, genau, ich start meine Programme immer hier, mit, bei mir ist das Windows-Taste D, weil das ursprünglich mal D-Menü war, sag einfach Jan, oh, das ist ein geiles E-Mode, das ist, das ist ein geiles E-Mode, das Wim-Logo mit Dings, das ist cool, das find ich nice, also ich start das immer hier, Steuerung D, nicht Steuerung D, Windows-Taste D, da hab ich hier mein, mein Rofi- oder D-Menü-Ersatz drauf liegen, zum starten, passt, so, schauen wir mal weiter, Logs-HD, 17 Monate, Hyper-Subscription, ich bin mir jetzt sicher, ob ich vorgelesen habe, aber Dankeschön für den Subs, ja, so, jetzt hab ich jetzt ja ausführlich beantwortet, ich denke mal, das hat's erklärt, oder, wie gesagt, ich würde nicht damit anfangen, das Zertifikat direkt auf den Unify-Controller zu legen, lieber auf den Reverse-Proxy auf dem gleichen Server davor, du klingst krank oder müde, ja, finde ich auch, beides, beides, hä, ich hab, ich hab seit ein paar Tagen hab ich Kopfweh, jetzt nicht so super schlimm, wenn ich, wenn ich liege und so, ist auch alles ok, aber irgendwie tagsüber hab ich so ein bisschen so, so Druck irgendwie auf dem Kopf, keine Ahnung, das ist nicht so schlimm, aber es ist nervig, ich glaube ja, wisst ihr was, ich glaube, ich glaube, ich bin zu alt, ich glaube, ich hab mich irgendwie verrenkt, oder irgendwas verzogen, zu viel IQ vielleicht, beim Serverraum-Umbau, ich hab ja da teilweise schon ganz schön Schäpp hinter meinem Rack gehongen, ja, auf der Erd, Overwatch 2 ist that game, ja, aktuell auf jeden Fall schon, ist ja noch nicht raus, also, ganz ehrlich, Overwatch 1 hatte einen gerechtfertigten, muss ich auch sagen, am Anfang, hatte einen gerechtfertigten, ordentlichen Hype, meiner Meinung nach zumindest, das Problem mit Overwatch war nur, dass, ich hab mich ja da schon oft drüber ausgelassen, aber, das Problem mit Overwatch ist einfach gewesen, dass Blizzard es irgendwie nicht geschafft hat, dass das auch halb technisch am Leben zu halten, ich mein, wir leben in einer Zeit, wo Games wie Fortnite am Start sind, die irgendwie alle zwei Wochen was Neues rauskloppen, ja, das muss man ja mit Overwatch nicht unbedingt machen, aber die Leute, gerade bei Overwatch, und Overwatch hat ja versucht von Anfang an, so die Casual Noobs anzusprechen, die Bossplayer anzusprechen, alle möglichen Family Friendly anzusprechen, plus die E-Sport Geschichte anzusprechen, das kann man ja schon, ich mein, man kann's probieren, das ist aber echt schon ne ganz schöne Herausforderung, aber das hauptsächliche Problem ist eigentlich, wo sie es meiner Meinung nach verkackt haben, dass die kein Content geliefert haben, die haben, und nicht einsehen wollten, dass manche Sachen scheiße sind, immer 2CP Anubis, das war voll geil, das war von Anfang an ein absoluter Rotz, jetzt nehmen sie es ja raus mit Overwatch 2, da haben sie 3 oder 5 Jahre für gebraucht. Leco, jetzt können wir es gleich noch mal angucken, ja, und die schaffen es immer noch nicht richtig, Content zu machen bei Overwatch, die schaffen es mal ein Hell zu releasen, und, äh, keine Ahnung, Map Release, Hell, ein Teaser und ein Comic in einem Jahr, so nach dem Motto, plus die immer wieder gleichen Events, das ist mega Resident Sleeper, die kriegen es eigentlich einfach nicht gebacken, das hatten wir schon, als ich meinen selbstgemachten Platinen bestellt habe, waren die Inland von 2 Tagen aus China und Deutschland, ja, ja tatsächlich, ich habe auch lustigerweise mehr Probleme mit Inlandversand, gut es ist aber auch, ich glaube man darf das nicht unterschätzen, logistisch ist das auch nicht ohne, das quasi bis ins letzte Furzdorf innerhalb von Deutschland liefern zu können, versus von einem Flughafen ins Flugzeug, also ins Flugzeugladen zu einem anderen Flughafen fliegen und ausladen, aber trotzdem, also ich hatte auch schon mehr Probleme mit Inland, DHL, UPS, Amazon, Logistik neuerdings, GLS, DPD, Transoflex, Alter, gibt es auch, ich weiß nicht, ob sich jemand schon mal im Leben was mit Transoflex gekriegt hat, ähm, ich hatte sie alle schon mal irgendwann daheim, ja, übrigens, was auch witzig ist, ich hatte, ich hatte paar Handwerker da, warte mal zu, äh, Bing Image, ich muss neu starten, ich brauche ein neues Bing Image of the Day, Leute, ich bin gleich wieder am Start, also die VM, äh, ich hatte Handwerker am Start, die haben eine Regenrinne sauber gemacht ums ganze Haus rum, das ist halt relativ hoch und äh, war halt zu und hat runter geregnet und war halt halt gesackt und als sie fährt, ich hatte mit denen am Anfang ausgemacht, 150 Euro, und da habe ich gesagt, okay, ähm, wie sieht es aus, Rechnung, ah, nix, Rechnung, okay, nix, aber zumindest Quittung, das ich bezahlt habe und dann sagt der Typ ernsthaft, ist kein Witz, dann sagt der Typ ernsthaft als Antwort, wo ich gesagt habe, ja, Quittung, das ich halt beweisen kann, dass ich bezahlt habe, dann sagt er, auf Ehre, auf Ehre, okay, ich gehe mal davon aus, ich gehe mal davon aus, der wollte keine Steuern bezahlen oder so, keine Ahnung, auf Ehre, ich weiß jetzt gar nicht was ich machen soll, ich weiß überhaupt nicht was ich machen soll, jetzt eigentlich ist es illegal, ich habe gesagt, Alter, schreib mir halt ein Zettel, auf Ehre, Alter, eigentlich darfst du es net, ja, Polybar bin ich nicht so warm geworden mit, ja, E3 Gaps finde ich persönlich auch besser, weil ich habe auch E3 Gaps als Wintermanager, da hat man so ein paar Spalten zwischen den Fenstern, man kann jetzt sagen, es ist komplett sinnlos, gibt Leute, die sagen, wozu braucht man diese Spalten hier, aber ich bin der Meinung, die Spalten sind ganz nützlich, erstens, dass man auf den ersten Blick erkennt, wo der Rand ist und zweitens, dass man zwischen Fenster, die ähnlich und Programme, die ähnliche Farben haben, eindeutig erkennt, wo das eine Programm anfängt und wo das andere auffällt, also ich finde die Gaps tatsächlich sinnvoll und ich finde die Gaps auch ästhetischer, es reicht ja, wenn man die 4-5 Pixel breit macht, als wenn die Fenster aneinander hängen. Wie gesagt, Traffic mag ich die Config nicht, nein, nein, nein, musst du nicht, gar nicht, also für das Zertifikat nicht, für das Unify nur das Webfrontend, also nur 8443, du richtest die Config von deinem Nginx, wie gesagt, ich würde Caddy nehmen, damit ist es einfacher, aber du kannst es auch mit Nginx machen und Certbot und sonst was, aber Caddy ist halt schön easy, da ist das eingebaut, bzw. mit einem Plugin für DNS-Challenge oder nimmst Traffic oder irgendwas, du musst einstellen im Reverseproxy, dass du lauschst auf Port 443, dass du mit dem passenden Domainname, das ist der ganze letzte Crypt-Config und dass du Reverseproxys, also weiterleitest auf dein Unify-Controller, Localhost 8443, also wie gesagt, ich mag Traffic nicht, ich finde Caddy viel praktischer, habe ich ja gerade schon versucht. Was ist an OpenVPN besser als an Fritzbox VPN, keine Ahnung, legit, kein Plan, ist das Fritzbox VPN nicht OpenVPN, oder was ist das, was ist das Fritzbox VPN, IPsec, ich habe keine Ahnung, wo ist das jemand von euch, das ist IPsec, ja gut, IPsec hat einen Vorteil, die iPhones können IPsec out of the box und ich vermute mal Android, weiß ich jetzt nicht, aber vermute mir Android auch, das ist tatsächlich ein Vorteil, aber du kannst ja einfach OpenVPN installieren, wobei ich dir ehrlich gesagt WireGuard empfehlen würde, ich finde WireGuard ist ein guter Kompromiss, gerade auch was die Clients für den Desktop angeht und einfacher einzurichten. Richtig QtChat, Massive, Bigbrainer QtChat, du musst mal ausführlich den kompletten Stacker third邊, und dann kann man das ordentlich auflesen und dann sind die mal auf, das können wir tatsächlich machen, mach das mal doppelt, dass ich mir noch gleich was drunter schreiben kann, also ich sag da noch mal ganz kurz was zu, WireGuard klein auf Linux ist quasi non existent, wir haben doch im Stream sogar schon mal WireGuard VPN gemacht mit Linux, oder hatten wir nur den Server auf WireGuard und Windows Client, genau WireGuard, zum Glück nicht WireGuard, da wäre das jetzt weg, kenn ich dich, hab ich nie ausprobiert, ok, ok, hab ich noch nicht gemacht, zumindest eine Sache, weil ich dazu kurz sagen will, das sind ja Dinge, die haben erstmal eigentlich gar nichts zu tun, was vielleicht ein bisschen was miteinander zu tun hat ist das hier, aber so für sich gesehen sind diese vier Sachen ja komplett unterschiedliche Dinge, das ist, dass du irgendwie externen DNS Namen hast für deine IP, dass du dich daheim einwählen kannst, das ist eventuell überflüssig, wenn man dünn DNS hat, braucht man eigentlich kleinen Cloudflare, ja und Let's Encrypt machst du dann eher dafür, ja kann ich mal machen, überlege ich mir, was man da machen könnte, ob ich da ein Video zu mache, weiß ich nicht, so technische, so zu übertrieben technische Videos gehen bei mir nicht so gut, weil ich hab halt auch viele, den kann ich da jetzt nicht irgendwie Linux-Commando-Zeile für 10 Minuten zeigen, ich kann wunderbar Zusammenfassungen machen, so nach dem Motto, warum ist die aktuelle Sicherheitslücke schlimm und sowas, aber Viertelstunde Shell, das glaube ich ein bisschen zu hart, hast du schon mal eine eigene Platine gebaut, nein, also ich hab mir noch keine bestellt, also du meinst jetzt mit irgendeinem Designer-Tool und dann bei PCB-Way oder irgendwo den Kram bestellt, ne hab ich noch nicht, ich stöpsel den Kram immer selbst zusammen, was ich brauch, das ist ja meistens nur ein Controller plus ein paar Sensoren und fertig, eventuell, eventuell mal ein Widerstand irgendwo dazwischen oder so, oder das, ich glaub das komplizierteste, was ich gemacht hab ist zum Erkennen, ob mal eine Klingel gedrückt wurde, das war eine Mischung aus, da hab ich auch so ein ESP32 genommen und ich bin mir ganz sicher, ob ich da irgendwie ein Foto für hab und ein Magnetsensor, so ein kleines Furzding, das steckt am Telefon, dass man erkennt, wo, welche Gegensprechernagehörer abgenommen wird, so magnet ist das, das Ding ist der Hörer ist magnetisch, wenn man den abnimmt, geht das der Sensor mit und wenn es klingelt, hab ich einen Analog-Digital-Converter, der einfach die Spannung erkennt, weil die ist anders, wenn es klingelt, relativ easy gewesen, das war so das kompliziertste, was ich bisher gebaut hab und auch meine WLED Geschichten sind halt total simpel, ne, ich nehm, ich hab ne, also für die Weihnachtsbaumbeleuchtung hab ich einfach ne, haben wir sogar im Stream gemacht, hab ich so eine IP67-Box genommen, so ne Wasserabweisende oder, ja Wasserdichte kann man im Hausgebrauch schon sagen so, Wasserdichte Box, da ist ein ESP32 drin und an der Seite hab ich das LED Zeug rausgemacht, fertig, also da ist nix, ne, hab ich noch nicht gemacht, aber wie gesagt, kann ich machen, ne, das funktioniert leider nicht, ich wollt hier ein Video zu machen, ich sag euch, Leute, das Video wäre ultra-viral gegangen, ne, aber richtig, Massive-viral, Minecraft auf dem Staubsauger, allein das im Titel, ey, aber es funktioniert leider nicht, das Staubsauger ist, ich kanns euch zeigen, wer sich jetzt wundert, was ich mache, ich hab nen SSH Zugang auf meinen Staubsauger, da ist es ein bisschen langsam, nicht zu schnell, der braucht manchmal ein bisschen, aber irgendwann gehts dann, so und ich glaub ich hab sogar nen T-Max drauf, ne, hab ich nicht, bringt euch eh nix, müsste ja im gleichen W-Land sein, ich sag's nur, weil das gleich wenn die Leute ankommen, Max, Max, schnell wegmachen, leek, leek, leek, halt öhm, so, zumindest, auf dem Staubsauger ist ein Ubuntu 14.04, da blende ich mal das Windows-Logo ein, weil ich hab keinen Cagpipe-Ubuntu, der Chat ist schon in, ja, okay, aber Auf dem Staubsauger ist ein Ubuntu 14.04, da blende ich mal das Windows Logo ein, weil ich habe kein Kek-Chebantu. Der Chat ist schon in. Ja ok. So und das Problem ist, das ist ein Quad-Core Staubsauger-Roboter, gab es nicht auch CPU-Info als Programm? Ne ne. Aber das geht auf jeden Fall auch. So das sind ARMv7, was auch immer und ich habe meine Zweifel, dass ich darauf eine Minecraft-Server zum Laufen kriege. Vielleicht, vielleicht irgendein, der nicht auf Java-Basis ist. Was ist denn ein guter Minecraft-Server, der nicht auf Java-Basis ist? Gibt es einen Minecraft-Server in Go oder irgendwas Self-Contained, das läuft garantiert? 3-M, naja, viel RAM haben wir übrigens auch nicht. Der kann höchstens, der kann, der kann eine 5x5 Welt generieren. Ne Megahertz sieht man ja nicht, wie schnell er taktet. Wie viel RAM brauchen der? RAM, JDK, gibt es einen, gibt es einen Go, Minecraft-Server, Go läuft ganz gut immer. Ne, ne, Minecraft-Server in Go, das könnte vielleicht funktionieren. Den da, hier Chat, Chat, ich glaube euch das jetzt, ich mache es jetzt mal auf, was ist, was ist das? Kuberit, Kuberit und das andere ist was, a tiny Minecraft-Server, ja ok, der ist von 2015, ich glaube nicht, dass man da mit Minecraft drauf spielen kann, sinnvoll oder? Ah ja, das ist tatsächlich nicht verkehrt, das könnte man machen, so einen Minecraft-Server auf dem Staubsauger laufen lassen, das müsste ich dann quasi in irgendeiner Art und Weise cross compiling für Arm 7, weil ich glaube einen Go-Interpreter gibt es da drauf nicht. Gibt es den, gibt es den für Arm zum Download? Download, wo ist der Download, ah hier, Linux, Raspberry Pi, ja gut, der Pi selbst, ich glaube nicht, dass das mit der Architektur kompatibel ist, vielleicht, hat Go überhaupt Arm 7, ich weiß es nicht, ich weiß es nicht, ich schreibe mir das einfach mal auf, das ist noch nicht abgehakt, Minecraft auf Staubsauger, ich brauche hier nur einen Mini-Server, wo man sich connecten kann zum aktuellen Client und dann laufe ich da ein bisschen rum und dann mache ich da ein Video drüber und erzähle, lull alter Staubsauger, neuer Server von GommeHD, ich habe keine Ahnung ob es den Kram noch gibt, der einzige Minecraft-Server der mir gerade so einfällt, gibt es Gomme, gibt es den noch, wahrscheinlich, der hat sich mal übelst gefreut, ich habe ihn mal auf Twitter angeschrieben, sinngemäß, ich habe ein bisschen über Java und Minecraft gelästert und da hat er, ich habe ihm gesagt, hier, cool, dass ihr euch das antut, Minecraft-Plugins zu basteln, weil ich meine, es ist Java irgendwie sowas und damals, das ist ja schon ein paar Jahre her, habe ich mich drauf geantwortet und gesagt, endlich sieht es mal einer und weiß es zu schätzen, ja, muss ich mal gucken, vielleicht kriegt man den Kram zum laufen, muss mich jetzt mit SAPUI5, ok, wie sieht das aus, ich ahne Schlimmes Leute, ok, wisst ihr wie das aussieht, das sieht aus wie Ultra-Cancer-Enterprise-Business-UI, aber auf modern gemacht, genauso sieht das aus, so wir haben unseren gleichen Crap wie immer, aber er sieht modern aus, wahrscheinlich, das ist genau der gleiche Shit wie früher, Pitform oder Pitform, naja, wenn schon würde ich die Self-Hausted-Variante nehmen, Saugchamp, Wieso das Wort gibt's, siehst du das nicht, sogar Google sagt, sogar der Duden sagt, dass es das gibt, siehst du, hier steht's, ist doch vollkommen normal, ja, das sehe ich übrigens genau so, Overwatch 2 hat absolut nichts gezeigt, was mich irgendwie an das Spiel interessieren sollte, ey, die sollten eine Kampagne machen, nicht dieses komische Speedrun-PvM Zeug, die haben sich so viel Mühe gegeben, sich eine Background-Story für Overwatch aus den Fingern zu saugen und ich finde, man merkt Overwatch schon ein bisschen anders, dass die Background-Story äußerst zusammengeschustert war, während der Kram eigentlich schon fast fertig war, aber ist ja letztendlich egal, sie haben sich so viel Mühe gegeben, da eine Background-Story draus zu stricken, warum machen die keine Kampagne, Blizzard kann echt gute Kampagnen machen, es konnte früher das zumindest, von den Leuten, die übrig sind, keine Ahnung, ja, Max, am Sonntag haben wir uns erstes, ja, schick noch mal Link, zeig noch mal her, ich weiß nicht mehr, ist das, hattest du nicht letztens mal im Stream gefragt, ob man nicht irgendwie, irgendwas mit MySQL, PHP, vorne Postgres oder so machen kann, ich hoffe ihr macht das nicht für euer Game so, wie du das davor hattest im Stream, ja, ist echt so, voll verkackt, ich mein die Paketdienste, ich hab damit kein Problem, aber das Finanzamt, ist echt nicht mein Fall, das ist wohl wahr, ja, aber IPsec läuft doch auch über IPv6, oder nicht, doch klar, ist IPv6 nicht sogar, ist IPv6, ist IPsec nicht sogar Bestandteil von IPv6, ich hab gleich den Chat durch, ich SSH mal kurz in meinen Staubsauger, das könnte ich tatsächlich, da könnte ich echt mal ein Video drüber machen, und zwar Videoideen, warum ich alles mit Custom Firmware flashe, geile Rechtschreibung, flashe, warum ich alles mit Custom Firmware, und dann zeige ich mitten im Video meinen geflashten Staubsauger, wo ich mich per SSH einlocke, und dann ist Mindblown bei den Leute auf YouTube, und ich weiß dann schon das erste Kommentar was kommt, Max jetzt mal ehrlich, wozu braucht man dann sowas, und da muss man eben erstmal sagen, das wichtigste ist erstmal, man braucht es, weil es geht, und danach kommt man dann erstmal mit den sinnvollen Argumenten, also das wichtigste erstmal, dass es funktioniert, dass es geht, ja, danach kommt da zum Beispiel sowas wie, ich brauch keine China Cloud, ich brauch nicht die komische Kack App vom Hersteller, wenn der Hersteller der Meinung ist irgendwas zu verkacken, betrifft es mich nicht, ich kann es offline verwenden, auch wenn mein Internet ausgefallen ist, ich kann es über den Browser fern bedienen und und und, also gibt es ein paar Punkte, aber das wichtigste ist erstmal, weil es geht, du würdest gerne deinen Tesla Custom Flaschen, frag mal bei Elon Musk auf Twitter, der antwortet doch auch random manchmal, vielleicht gibt er dir den Firmware Key, heute wieder Staubsauger hätten gar keinen Bock, korrekt, auch nicht, deswegen habe ich den ja auch einmal, einmal geflasht und jetzt ist gut, oder hat sich Deiner resettet, hat sich Deiner resettet, das haben die angeblich gefixt, das resetten, also meiner hat sich da den letzten Flash mit der Firmware von diesem Valle Tudow Fork nicht wieder resettet, ehrlich gesagt keine Ahnung, gibt es gibt es in.NET Core, Minecraft Server, ich meine das ist immer ein Microsoft, Minicase, Minecraft Server based on Orleans, Orleans, oh oui oui, weil das kann nicht, das hat auf jeden Fall einen Arm, einen Arm V7 Target,.NET Core, vielleicht vielleicht kriege ich den gestartet, ich brauche hier nur irgendwas, was läuft, was man sich connecten kann und dann ist gut, ja 2016 ist ein bisschen alt, da wird aktuelle Go Sachen nicht drauf kompilieren, ok das hatten wir alle schon, ich, also ich weiß, du fragst ja nicht ganz ohne eigenes Interesse, aber ich weiß nicht, wie ich das den Leuten gescheit verklickern soll, ich müsste das, auf YouTube müsste ich das in irgendein anderes Video einbetten, Dankeschön für den Sub, Nixor, zwei Monate, ich müsste das in ein alternatives Video einbetten, vielleicht hier rein, Moment wo da vorne, Video Ideen, ja warum ich alles custom firmware flasche, da könnte man das mal zeigen, na also wenn eine Sache sich definitiv nicht lohnt zum Bitcoin mine, dann ist es ein, weiß nicht was der gekostet hat, 400 Euro Staubsauger zum Bitcoin mine, aber für Views ist das gut, das schreibe ich mir auf, der Desktop ist der beste Desktop, nur der hat ein, what the fuck, warum zum Teufel startet der Affinity Designer, wenn ich einfach nur, wenn ich einfach nur Eier eröffnen will, okay gibt es da, die muss man nicht verstehen, Minecraft Staubsauger, kann im Dunkel nicht schreiben richtig, Minecraft Staubsauger und Staubsauger Bitcoin Miner, das kann ich ehrlich gesagt einfach aus just for fun machen, einfach weil es Views generiert, ja, da hast du schon recht, hier wird sich erstmal eine Runde abgeleckt, alles klar, Chat ich hoffe euch geht es gut, ja, so ähm, oh sorry ja stimmt, natürlich Staubsauger innen, man muss ja korrekt sein, ich habe heute, mir wurde ein Video vorgeschlagen, auf YouTube von irgendeiner Diskussionssendung aus dem ZDF, ich habe da, ich habe es aufgemacht, habe mal reinge, reinge, gesappt, keine Ahnung wie man das nennt, das erste was ich in dem Video gehört habe war jemand, ich sage absichtlich jemand, weil ich weiß nicht, wie er oder sie angesprochen werden will, meinte so, ähm, es ging irgendwie um Bewerbung bei irgendeiner Firma und dann meinte die im Video so, äh, oder er oder keine Ahnung, also wenn diese Firma keine Diversity beauftragte oder äh, oder was hat er gesagt, keine Ahnung, dann bewerbe ich mich da sicher nicht, da habe ich mir auch gedacht, ey, wir haben echt schon ganz schön den Luxus, wenn man sich das aussuchen kann, also, da muss man entweder sehr begehrt sein, dass man die Möglichkeit hat sich das auszusuchen, oder äh, sehr überzeugt, ja, ja okay, also ich sage nicht, dass das unwichtig ist, aber es wäre für mich gut, ich meine ich kann das auch nicht so wahnsinnig gut beurteilen, ich bin ja was diese Sache angeht, ich bin ja das was diese Sache angeht, ja so, der, absolut nur nach 15, ja, ich bin, ich bin weiß, männlich, alt, heterosexuell, kein Veganer, nicht schwul, ähm, also ich darf ja bei sowas gar nicht, habe ich noch was vergessen, ich darf ja bei sowas gar nicht mitreden, ja, aber die Aussage fand ich schon ein bisschen hart, so nach dem Motto, wenn die keine Diversity Abteilung haben, dann gehe ich da nicht hin, ich meine, eine Firma muss nicht die Leute wie Kacke behandeln, weil sie keine Diversity Abteilung haben, also eine gute Firma, guckt, dass sie sich um die Mitarbeiter sinnvoll kümmert, und da zählt sowas auch rein, ohne dass man eine eigene Abteilung braucht, aber gut, jeder wie er meint, ja, ach ja, kein Veganer, das stimmt, ja, bin ich, kein, kein Veganer bin ich auch, ja, ich bin, ich bin ein Om, wie heißt das, Omnivore, Allesfresser, Omnivore, genau, ein weißer Omnivore-Zis-Mann, korrekt, du hast es erkannt, ihr habt es erkannt, ähm, wieso ist das eine, tatsächlich, das habe ich mir schon aufgeschrieben, das ist eine gute Idee, hast du schon an der Fritz, nein, das habe ich noch nicht gemacht, weil ich ganz ehrlich sagen muss, der Sache traue ich nicht so gerne, es gibt ja nur dieses Fritz, Fritz, oder wie man das ausspricht, ähm, und das habe ich schon nicht gemacht, ich traue der Sache nicht, weil ich will meine Fritzbox, eigentlich verwende ich meine Fritzbox nur für VoIP, also für Telefon deckt, das war es, und ich sehe den Sinn von der krassten Firma da grad nicht, wirklich, zumal die Standard-Fritz-Software nicht dafür bekannt ist, oder so, irgendwie nach Hause telefonieren zu würden, nach Hause Telefonieren zu würden, nee, Scheißsatz, ist nicht dafür bekannt, nach Hause zu telefonieren, das stimmt, wenn man WireGuard verwenden will, dann ist es tatsächlich sinnvoll, wobei ich das auch nicht, ganz ehrlich, würde ich VPN verwenden wollen, dann würde ich nicht meine Fritzbox flaschen für WireGuard, sondern, ich würde mir den Raspberry Pi dahinter stellen, äh, am besten noch in der eigenen DMZ, und ich rede nicht von dieser Standard-DMZ-Leiter alles auf den Server weiter, wie das in manchen Routern oder Fritzbox drin ist, Fritzbox weiß ich nicht, aber viele Routern, sondern, angenommen, man hätte da noch wirklich was dazwischen stehen, dass man dann quasi nur dort hinkommt von außen, und erst wenn man sich dort autentifiziert hat, weiter, ja, äh, schau mal, das Raspberry Pi-Binary von vorhin da läuft, äh, zeig, schick noch, add Wupplos noch mal mit dem Link, ich weiß nicht mal, welches das war, Chat ist schon ein bisschen her, dann probiere ich das aus, ah, ja, ja, Designer, ah, ok, man kann das gar nicht mehr flaschen, ja, das habe ich mir auch gedacht, ich mein, na, egal, soll jeder machen, was er will, das stimmt, wenn es nach, äh, Banks pro Monat geht, dann, äh, würde ich da auch dazu zählen, ja, da kann ich nicht, da spiele ich nicht in der ersten Liga mit, ja, bei mir liegt es aber, ich merke das ganz extrem, ich bin so ultra faul geworden, was zwischenmenschliche Interaktionen angeht, äh, es ist der Wahnsinn, ich sag, das mit dem Weihnachtsgrill habe ich euch ja schon oft genug erzählt, sobald es um zwischenmenschliche Interaktionen geht, drücke ich mich davor, ja, ich hatte schon so oft mal irgendwelche Dinge, was weiß ich, dass man sich, dass man sich im Zug vielleicht mal kurz unterhalten hat, weil irgendwie was war, dass man sich so ganz gut, ganz nett gefunden hat, dass man sich, also ich mal ein bisschen angeguckt hat und so und eigentlich wäre das dann so die Situation, wo man das Ganze mal ein bisschen abklopfen könnte und mal, irgendwie versuchen könnte mal ein Gespräch zu starten und so, aber wisst ihr, ich bin einfach übelster Kacknup, was sowas angeht und ich bin faul as fuck, also sprich, bei mir läuft es immer so, irgendwas, äh, also es ist egal ob auf dem Weg zur Arbeit, im Zug, sonst wo, irgendwas, wo man sagen könnte, hey, da müsste man jetzt mal zwischenmenschlich irgendwie eine Interaktion starten, lass dich bleiben, ja, ich hatte schon öfters mal, es sitzt jemand im Zug, man lächelt sich mal zwischendurch an gegenseitig, guckt mal wieder weg, guckt hin, andere guckt wieder zurück, ich bin so bescheuert, ich hätte schon so oft einfach mal was sagen können und natürlich hätte es dann zu 90% auch nichts, nichts, ja, wäre dann nichts draus geworden, aber ich mein, man hätte es wenigstens probieren können, aber bei mir läuft es dann eher so, ich lächel dann ein bisschen, guck ein bisschen hin und zurück, ja, Plinzel, Plinzel, alles gut und dann, wenn es darum geht, dass man jetzt was machen müsste, ja, zum Beispiel, was weiß ich, sag mal, weil der Zug am Hauptbahnhof angekommen ist oder so, oder weil irgendwas anderes ist, da guck ich auf mein Handy und geh raus, ich mach da einfach nix, ja, ist ernsthaft, ist echt so und ich hatte manchmal, manchmal, Alter, das ist mir immer, es gibt ja kaum was unangenehmeres für mich, also unangenehm, wie soll man sagen, unangenehm ist das falsche Wort, kaum was, wie nennen wir das jetzt, nervenaufreibenderes, wie schöne Mädels, die einen angucken, längere Zeit, dann fühlt man sich selber unter Zugzwang, man muss jetzt was machen und ich bin was zwischenwöchentlichen Sachen angeht, so ultra faul und dementsprechend fehlt mir auch total die Übung, was sowas angeht, wenn ich was sage, ist es meistens was total bescheuertes, ja, und dann, und dann, geht ja noch schlimmer, und dann, wenn es mal wirklich so ist, dass es nicht an mir hängt, ja, also zum Beispiel, wenn man sich schon kennt oder anderweitig zwei Ecken kennt oder so, also dass man nicht so wirklich so komplett das Eis brechen muss, weil man sich ja eigentlich schon ein paar mal begegnet ist und so, und wenn dann sogar noch vorkommt, dass die andere Seite da quasi versucht noch den ersten Schritt zu machen, was macht der Max dann, der macht dann erstmal kurz mit, aber sobald das ich irgendwie anstrengen müsste dafür, melde das ich einfach nicht mehr, das ist ganz schlimm bei mir, das ist ganz schlimm, sobald ich irgendwas machen müsste, von mir heraus, für irgendwelche zwischenmenschlichen Interaktionen, gerade mit Mädels, ich mach einfach nix, ich kann das schlecht beschreiben, warum, es ist merkwürdig, ja, wie gesagt, mit dem Weihnachtsgrill war es doch genau das gleiche, und nein, ich hab ihn echt nicht gesagt, Grill, natürlich nicht, das hat ja eigentlich ganz gut funktioniert, aber wir haben uns sogar Sachen zu Weihnachten geschenkt, davon nicht vergessen, also ich würd sagen, die war da nicht abgeneigt der ganzen Geschichte, und was hab ich gemacht, danach, ich hab mich einfach 3 Monate nicht gemeldet, nicht weil die hässlich wäre, oder sie mir nicht gefallen hätte, ich keinen Bock auf die habe, einfach nur, weil ich keinen Bock habe, mit anderen Menschen zu interagieren, und weil ich nicht nur das, das Problem ist, ich finde das anstrengend, und das ist eine Art von anstrengend, vor der ich mich gerne drücke, was war das Geschenk, hab ich das nicht sogar schonmal erzählt im Stream, also ich hab ja ein paar Paare, ich hab ja ein paar davon geschenkt, mit Lavendelduft, exzellent, top die da, irgendwas mit Lavendelduft, und die, und jetzt passt mal auf, eigentlich, wenn eine Mädel sowas schenkt, da müsste man eigentlich gerade als Techniker, quasi ausflippen und sagen, jawoll, das ist die Frau fürs Leben, wie der Asitoni gesagt hat, der hat mir ein Vera Torx Set geschenkt, ok ich geb zu, natürlich nicht von sich aus, ich hab das geteased, das da, ne, hä, ja sowas da, das, das was ihr, das was ihr hier auf Twitter seht, äh, nicht Twitter, Twitch, was habe ich denn, Twitter, nicht Twitch, ah, äh, das da, guck mal hier, da oben, Torx Set, tja, so, und, ähm, also eigentlich ist es schonmal, muss ja erstmal hinkriegen, ja, muss ja erstmal jemand finden, der das macht, so, und, was hab ich gemacht danach, ich, es war noch nicht, das, das, das, das lief wieder schlecht, noch war das irgendwie unangenehm, doch sonst was, das war eigentlich nice, ja, und was hab ich gemacht, mich einfach drei Monate nicht mehr gemeldet, weiß ich, war mir schon zu anstrengend, naja, ok, ach, so, wie, wie, wie das an der, an der Wand, chat klickt euch mal ein hier, ich mach ja auch die ein oder andere doofe Sprüche, aber manche Sachen müssen nicht sein, so, ähm, das Set an der Wand, das war, ja, aber, aber ein fertiges Set, äh, ich glaube, das Set war das, also das, da ist natürlich nicht das Werkzeug dabei, zumal das Werkzeug wahrscheinlich sagt, was, was da am Start ist, keine Ahnung, ähm, dieses, dieses Set war das hier, mit den Haken, den Halterungen und, äh, dieser doppelten, doppelten Wand, ich hab aber die untere, das untere Regal nicht dran, kann man das noch reaktivieren, keine Ahnung, eventuell, das Problem, was ich dabei hab, ist, dass ich mir natürlich auch echt doof vorkomme, da ich, ey, ich mein, drei Monate nicht gemeldet, by the way, Leute, Leute, Leute, man könnte das vielleicht durcheinander bringen, ich rede nicht von letztem Weihnachten, sondern von vorletztem Weihnachten, also das sind quasi nicht drei Monate, jetzt rum, sondern, ähm, 15 Monate, also, geht doch noch mehr, wie gestern, ne, ähm, nein, keine Ahnung, dass ich Streamen ja noch, keine Ahnung, dass ich YouTube Zeugs mach oder so, ich erzähl das offline nicht viel, also auf der Arbeit wissen es ein paar Leute, dass ich YouTube Zeug mach, mein ehemaliger Chef weiß es auf jeden Fall, weil da hab ich ja die ganze Teilzeitgeschichte damals eingereicht, ähm, Herr Endpunkt weiß es, ein paar Azubis, ein paar Azubis, ich glaub insgesamt waren es drei Azubis jetzt, mit Herr Endpunkt zusammen, die das erkannt haben, zwei einfach so, der eine ist Anwendungsentwickler, der meinte, der war mal einen Tag bei mir und, ähm, die haben mich dann so vorgestellt, ja, hier, du kommst jetzt mal einen Tag zu Max und da zeigt der mal ein bisschen hier Linux Sachen und so, da sag ich, ja, passt schon, also da saß er dann bei mir am Platz und meinte, ah, du bist der Max? Ja, ich bin der Max, der meinte so, seine Stimme kommt mir bekannt vor, aber mach dir nichts draus, ich sag's keinem, da war schon klar, war schon klar, dass der das erkannt hat, hab ich mir gemacht, ach so, also, ich hab's nicht, also ich hab das nicht zugegeben, weil, wenn ich das direkt konfirme, dann weiß der ja Bescheid, aber der hat auch so Bescheid gewusst, hatten wir den anderen, der hat's nach ein paar Tagen gemerkt, der hat gemeint, ja, jetzt, klar, ähm, der hat früher immer Battlefield-Videos und so geguckt und ja, Herr Endpunkt, Herr Endpunkt weiß das auch, nee, aber ansonsten weiß das ehrlich gesagt auf der Arbeit kaum einer und dabei will ich's ehrlich gesagt auch belassen, ich sag ja eigentlich nie was direkt über die Arbeit, also jetzt nie mit Namenslernung und so was, aber klar, ich lässt da schon mal manchmal ab und ab und zu haben wir ja auch mal den ein oder anderen im Chat, das fällt euch vielleicht nicht so auf, aber ich, wenn ich die Namen sehe, wo ich weiß, dass die mal bei uns gearbeitet haben oder noch bei uns arbeiten und die wissen sofort, wen ich meine, wenn ich über manche Leute ein bisschen lester und ich will nicht, dass das irgendwie bekannt wird, dass dann Leute mitkriegen, die's nicht mitkriegen sollen, ja, Fritzboxen bekommt man nicht kaputt, da hab ich meine Zweifel, richtig, korrekt, deswegen find ich die Fritzbox im Auslieferungszustand auch ganz praktisch, also Asterix ist eines der ekligsten Sachen zu konfigurieren aller Zeiten, wer sich das freiwillig, also generell man muss sagen, VoIP, SIP, diese ganze Geschichte ist ein absolutes Minenfeld, das macht keiner freiwillig, gibt's Leute von euch, die euer Geld mit Telefonanlagen und VoIP und SIP Sachen verdienen, es ist abfuck, hoch 10, ich glaube das hier hattest du, Raspberry Pi, ich probier's mal, ich probier's mal, ich geh mal auf meinen Staubsauger und wir führen das mal aus, probier wir mal aus, ich hatte ja nix, Raspberry Pi Build, save, hallo, save, zack, CD, download, zack, MkDeer, Minecraft, wir probieren das jetzt aus, ob das auf dem Staubsauger läuft, Xfz, ich kann heute echt nicht schreiben, aber gut, hier ist auch dunkel, Cube, CubeRite, boah, the fuck, ist hier überhaupt ein Tarn drauf, tatsächlich, könnt ihr sogar so rüber kopieren, wie groß ist denn das, da hab ich auch keinen Platz für, naja, geht doch eigentlich, 13 MB, wie sieht's mit Platten aus, Plattenplatz auf dem Staubsauger, ich hab noch 135 MB, kann man das einfach jetzt so starten, achso, das ist ja ein Raspberry Pi Build, wie viel RAM braucht das, wie viel RAM braucht das, Memory, ok, ich kopier das jetzt einfach mal rüber, ne, ich probier das jetzt, Leute, wir probieren das jetzt nicht im Stream aus, die Katz sitzt drüben im Wohnzimmer und schläft, wenn das Staubsauger jetzt abkackt und sich rebooted, macht der dann Krach und dann dreht die durch, ne, das kann ich jetzt nicht machen, ja, ich probier das aber offline aus, ach komm, Cube, auf, ups, wie, Moment, wie groß, wie groß waren das jetzt, 13 MB, so, wir sind hier oben auf dem Staubsauger, wohlgemerkt, ok, der Flash ist schon mal schnell, ok, ich brauch ein zweites Login, um das zu killen, das ist Minecraft, so, kann man das jetzt starten, nope, hätte ich mir jetzt kopieren auch sparen können, nicht neu genug, nope, keine Chance, nope, geht nicht, ja, aber du lernst aus deinen Fehlern, hoffe ich, ja, ey, wenn es danach geht, habe ich echt kein Problem damit, wenn ich mir die ganzen Möchtegern-Alpha-Leute angucke, die können gerne unter sich alpha-risieren, ja, das ist die Frage, ganz ehrlich, eigentlich nicht, Bauchgefühl will ich eigentlich nicht, eigentlich will ich meine Ruhe, ich will eigentlich möglichst wenig mit anderen Leuten was zu tun haben, ich weiß, es klingt immer widersprüchlich, wenn ich das sage und mir irgendwie zehntausende Leute auf YouTube zugucken und hier auch ein paar Leute zugucken, aber das ist was anderes, ob ich hier sitze und schwätze und ihr hört euch das an, oder ob ich Leute physisch bei mir am Start habe, ja, nee, ehrlich gesagt, manchmal denke ich mir wäre schon nice, ich komme ja auch langsam in das Alter, wo man sich mal so Gedanken machen sollte, ob man nicht vielleicht doch irgendwann mal Nachwuchs zeugen will, aber will ich nicht, ich mag Kinder absolut gar nicht, ja, also was ich nice finden würde, aber das wird es einfach so nicht geben, wenn man jemanden hätte, mit dem man sich gut versteht, mit dem das auch auf einer Wellenlänge ist, ja, allerdings schön weiterhin beide ihre eigene Wohnung oder ich halte hier in der Hütte, ja, man kann natürlich am Wochenende mal was machen und sich unter der Woche mal sehen und auch mal dort übernachten und so, das ist alles kein Ding, aber ich stelle es mir unglaublich nervig vor, ich weiß ich bin da auch nicht normal, vielleicht liegt es auch einfach daran, dass die Richtige noch nicht am Start war dafür, keine Ahnung, ich stelle es mir unglaublich nervig vor den ganzen Tag jemanden am Start zu haben, ey, das ist der Wahnsinn, ich kriege ja schon bei manchen Leuten, wenn ich die nur online sehen muss, schon Anfälle, ja, ach ja, ne, ich bin da nicht normal, also irgendjemand meinte mal, ich soll einen Autismus-Test machen, was ich, ich habe eher andere Probleme, naja, vor allem das witzige ist, ich weiß nicht warum, ne, ich mag einfach andere Leute nicht, es ist echt schwierig zu erklären, ich habe da aber auch überhaupt keinen Hang dazu, irgendwie mich mit anderen Leuten auszutauschen, zu treffen, das einzige, was, also 90% der Leute, meine Mitmenschen nerven mich aus den unterschiedlichsten Gründen, ja, weil sie zu viel rumlabern, weil sie dummes Zeug erzählen, weil sie dumm sind und scheiße labern, weil sie laufen irgendwas von einem Wollen, weil es gibt zig Gründe, also 90% der Leute gehen mir auf den Sack, der Chat nicht, weil, weil das hier ist ja umgedreht, ich labere hier ja mit euch im Endeffekt und ihr begrenzt mit mir, das ist ok, das ist in Ordnung, also das, ja, das nervt mich, ja, also wie gesagt, 90% der Leute, der Chat ausgenommen, den Chat finde ich so geil, echt angenehm, aber ich habe ja auch eh den besten Chat hier, ja, kaum Leute, die nervig sind da, so und, also wie gesagt 90%, mit 90% der Leute will ich nix zu tun haben und das hat sich eigentlich jetzt über mein gesamtes Leben immer wieder bestätigt, dass mir mindestens 90% der Leute auf den Kicks gehen, es gibt ein paar mit denen verstehe ich mich echt gut, ja, aber das ist selten, ja, ich habe auf der Arbeit zwei drei Leute, mit denen ich mich wirklich gut verstehe, äh, weiß nicht, habe ich noch mit Fabian am Start, mit dem Kaboom habe ich mich auch gut verstanden, wobei, das ist typische Max-Taktik, der hat mich ja schon öfters gefragt, wollen wir wieder was futtern gehen und ich melde mich dann immer nicht und sowas, typische Max-Taktik, der Fabian, der Master subscriber, es gibt schon ein paar Leute, mit denen ich mich ganz gut verstehe, aber es ist halt recht selten, also wie gesagt, von 1000 Leuten, die mir so über den Weg laufen, verstehe ich mich vielleicht mit einem, also es gibt Leute, die, die können ja irgendwie mit jedem, da gehöre ich nicht dazu und ich beneide das auch nicht, es gibt ja Leute, die sagen so nach dem Motto, oh das würde ich auch gerne können, ne ich will das gar nicht können, ich stelle mir das unglaublich lästig vor, sich mit so vielen Leuten permanent auseinander zu setzen, deswegen könnte ich auch nie, ähm, irgendwelche sozialen Sachen machen, ich hab ja meinen Zivildienst, hab ich ja gemacht, in einer Behindertenwerkstatt und das war cool, also das finde ich ist echt eine sinnvolle Sache, was jeder mal gesehen haben sollte, was da so, was da so Sache ist, aber das könnte ich mir im Leben nicht vorstellen, das beruflich zu machen, und witzigerweise, mit denen bin ich klar gekommen, die haben auch nicht genervt, das war, ich weiß nicht, irgendwie, das, das ging, das ging besser, also, naja, aber das, ich hätte im Leben keinen Bock auf irgendeinen, irgendeinen, äh, sozialen Kosmos, was ist denn da ins Naja alles nicht aber aber viel ist ja also mein Gedächtnis hat auch schon nachgelassen jetzt mit 36 das merke ich ich konnte mir früher wirklich nahezu jeden kack merken den ich vor drei wochen mal irgendwie zu irgendeinem gesagt haben mittlerweile ist nicht mehr ganz so wild ja also das geht überhaupt nicht ja also wenn einer mit tabs einrückt versus leerzeichen das wird direkt aus dem telefonbuch gelöscht ja so was muss nicht sein schenkt möglich wäre es aber aktuell haben wir keine zu wie bei uns du hast 10 jahre gemacht und ist eklig oder vielleicht vielleicht ok vielleicht ist es irgendwann nicht mehr so wild aber alles was ich bisher von sieb und woib konfiguration gesehen habe ist komplett abfack ja das ist black magic sieb ja daran wird es wahrscheinlich liegen ich probiere mein dotnet core minecraft server da drauf aus nicht jetzt aber off stream das ist eine gute frage wird oft wird schon öfters gefragt aber ich sag's gerne noch mal wie findest du mr robot die serie ich war richtig gehyped auf mr robot nachdem ich die erste folge gesehen habe ich habe mir gedacht was eine geile serie dem ich die erste folge geguckt habe damals damals das mr robot ist ja schon ein paar jahre alt da war das doch nicht so inflationär heute ist ja so es kommen jeden tag zehn verschiedene serien raus weiß gar nicht genau was gucken soll mr robot war was das angeht tatsächlich war ein besonderes release ja muss man schon sagen so und ich habe mir die erste folge angucken was eine geile serie habe ich weiter geile serie geile serie und irgendwann mitte der ersten staffel wurde die serie instant naja nicht scheiße kann man nicht sagen aber irgendwie doof vor allem haben sie in der ersten staffel auf so einen auf so einen riesen hack riesen riesen hacking ereignis hingearbeitet und am ende hat der hält das verschlafen fand ich auch fail das problem was was ich quasi ab sagen wir so das erste drittel mr robot richtig cool bis zur hälfte auch noch danach haben einfach die drogenabhängigkeit und und gestörten ticks vom hält viel zu viel platz eingenommen und ich muss euch sagen der mr robot twist dass ich meine die serie ist jetzt fünf oder sechs jahre ich spoiler jetzt einfach mal ja der der twist so der zu mitte mitte von der ersten staffel irgendwann gekommen ist dass sein ich glaube sein vater ist das doch sogar dass der nicht wirklich existiert das hast du meilenweit gesehen oder wem ging es noch so ich habe das sofort also ab nachdem der typ am zweiten mal am start war wusste ich den typ gibt es nicht das war das war ja das ist sofort sofort also der große twist blieb aus war mr robot bei mir ja das haben sie über fight club zum beispiel viel besser gemacht bei fight club hast du euch boomer film ich weiß ist auch schon bisschen älter bei fight club habe ich wirklich nicht gecheckt bis zum schluss und die haben das echt gut gemacht und die haben das da echt gut gemacht ich gehe mal davon aus wer auch viele von euch gesehen haben ist ja mittlerweile fast so eine art kultfilm das haben die echt cool gemacht weil du hast wenn du später noch mal geguckt hast hat so sogar stellen wo du gesehen hast wo der andere quasi im hintergrund stand und nichts gemacht hat und sowas war echt cool also wie gesagt mr robot hat mich da ein bisschen enttäuscht soll ich dir dein tinder game auf next level bringen dazu bräuchte ich erstmal einen tinder account und ich glaube eines der letzten dinger die ich mir anlegen würde ist wahrscheinlich ein tinder account jeder hat das recht individuell gehasst zu werden ich hasse die leute ja noch nicht mal ich will mit den mit mit 90 prozent der leute einfach nichts zu tun haben es gibt so unglaublich viele doofe leute es also leute peak absolut muss ich jetzt an der stelle mal erzählen der absolut peak dummheit die ich jemals erlebt habe in geballter form ich wusste nicht dass man es schaffen kann so viel dumme leute auf engen engen raum zu versammeln auf engen raum zu bringen ja war als ich mal und das ist schon ganz lange her das ist noch noch bevor ich die physio ausbildung gemacht habe das ist wirklich lange her musste ich mal einen kurs machen vom arbeitsamt da könnte ich eigentlich auch mal da könnte ich auch mal ein video drüber machen habe ich glaube ich schon mal habe ich glaube ich schon mal video drüber gemacht aber da musste ich einen kurs vom arbeitsamt machen und das war so ein typischer wie bewerbe ich mich richtig kurs kompletter schwachsinn das lag nicht daran also bei mir damals lag es nicht daran dass ich zu dumm war setze zu formulieren für eine bewerbung sondern dass ich keinen bock hatte weil ich ein fauler sack gewesen bin so nach der schule da wollte ich eigentlich nix machen und ich einfach nix gemacht habe ja und mich versucht habe rauszureden und sonst was naja zumindest bin ich muss ich auf diesen arbeitsamt kurs gehen oder arbeitsagentur wie heißen die jetzt eigentlich richtig agentur für arbeit oder heißen die jetzt richtig hanau genau exzellent exzellent kackding da im hauptbahnhof so zumindest war ich in diesem arbeitsamt kurs und ich brauche jetzt ein bisschen passende passende untermahlung hier haben wir ein paar paar schöne paar schöne led leds exzellent exzellent perfekt das war leds blinken im hintergrund während ich erzähle so super also so ich war ich war in diesem kurs am start und sinnloser kurs auch ich habe da drüber schon video gemacht interessant naja also ich bin echt begeistert gewesen wie viel dummheit man so in so einem kurs stecken kann und zwar da waren leute alter das das haltet ihr nicht für möglich da war zum beispiel eine von dem rapper erzähle ich euch von dem möchte gern rapper erzähle ich das habe ich schon mal erzählt mit dem möchte gern rapper aber das andere noch nicht da war eine am start also erste erste mal muss man sagen erst mal muss man sagen irgendwie 90 prozent der medels die da am start waren ich war da 18 oder so 19 die hatten alle schon kinder die waren alle in meinem alter also ok die legen aber ganz schön vor hier so und da war eine am start die hatte noch keine kinder aber die war so unglaublich blöd die hat sich beschwert in diesem arbeitsamt kurs immer so nach dem motto ja ich schreibe ans amt und das amt antwortet nicht und wenn sie antworten dann schreiben sie immer irgendwas was ich überhaupt nicht wissen will und die hat mal die hat mal so einen schreiben mitgebracht was die was sie an das amt schreibt und das problem war die hatten dann auch so einen trainer der hatte das auch versucht zu erklären und ich habe mir das auch mal angucken ich meine es ist nicht klar warum die dir nicht antworten die verstehen das nicht und dann kam raus die schreibt diese sachen gar nicht selbst ans arbeitsamt sondern sie kann gar nicht richtig schreiben aber und das ist wirklich das ist das war die ausrede dafür das war die ausrede dafür die hat dann gesagt sie muss nicht schreiben können weil ihr mann kann schreiben das war die beschissenste ausrede die ich jemals gehört habe hallo ich es geht hier es geht hier nicht um klavier spielen oder um mein pcs zusammen bauen oder sowas es geht um schreiben das hätte man das hätte man 1650 sagen können mein mann kann schreiben ich brauche das nicht also das war das war die ausrede sie konnte ich will nicht sagen dass sie schreiben konnte also sie konnte wörter aus papier bringen nicht richtig geschrieben und nicht in korrekter reinfolge also ich will jetzt keine leute flamen die nicht schreiben können das mag die unterschiedlichsten unterschiedlichsten kurssachen haben aber bei ihr war das keine angeborene geschichte die war einfach nicht in der lage zu die wollte auch nicht weil ihr mann kann das ja und ich habe das versucht zu lesen was sie da geschrieben haben was ihr mann geschrieben hat du konntest das nicht das ging nicht du hast nicht verstanden was die wollen also was was die von dem wollen habe ich es ist kein wunder dass die den ich antworten weil die verstehen es nicht die verstehen es nicht und da habe ich mit mit der zusammen was geschrieben ist jetzt alles noch no fake was ich jetzt erzähle ja da habe ich mit der zusammen was geschrieben also so einfache dinger ja das kann ich was sie was sie genau wollte irgendwie die wollte zwischenzeitlich sogar das amt verklagen und hat sich erkundigt wo man prozesskosten beihilfe und sowas kriegt wollte ich hab ich hab dir dann geholfen das zu schreiben und irgendwie kein kein scheiß ja irgendwie dachte die war wahrscheinlich ist das das einzige ich hatte da ein bisschen ich hatte irgendwie mitleid mit dass das nicht funktioniert hat und ich war da gefühlt auch der einzige der ordentlich schreiben konnte außer die die trainer in diesem ding ich habe gesagt ich schreibe halt mit der was die hat das so interpretiert ich schreibe das für die weil ich scharf auf die bin es ist kein nütz jetzt ich dachte ich helfe dir ein brief zu schreiben ich dachte mir die arme kann kein brief schreiben ich helfe ihnen brief zu schreiben so und die dachte ich bin scharf auf die weil ich ihr war sie hübschen nee nee nee nicht wirklich die war zum kurs dann auch nicht hübschen so und die hat die hat gedacht die hat gedacht irgendwie ich mach das weil ich auf sie scharf bin also und woran ich das gemerkt habe es hat ja ein bisschen gedauert ja woran ich das gemerkt habe ist die hat mir auf einmal angefangen dinger von sich zu erzählen so und so da war unter anderem dabei ich wollte das eigentlich gar nicht wissen ja die hat dann angefangen zu erzählen so nach dem motto ja sie versucht ja gerade schwanger zu werden sie versucht ja gerade schwanger zu werden und mit ihrem mit ihrem mit ihrem mann klappt es ja nicht deswegen hat sie ja noch ein zweiter das hat die wortwörtlich gesagt was ich euch jetzt sage wortwörtlich deswegen hat sie ja noch einen zweiten stecher wortwörtlich denke mir das nicht aus sie hat ja noch einen zweiten stecher oder habe ich schon gehabt da habe ich so langsam dann habe ich so langsam realisiert obwohl obwohl auf was das ganze jetzt hier auf was das ganze hier abzielt ja oh Gott meine Güte zumindest wahrscheinlich wollte er als kindergeld ich habe keine ahnung ich habe das wortwörtlich gesagt aber sobald sobald dann das kind am start ist kinderstand dann hört das natürlich auf und so sie sie wollte mir quasi sie hat mir quasi dann auch relativ unmissverständlich mitgeteilt sie ist auch diesen diesen weiteren stechern nicht nicht abgeneigt und so alter hör mal auf meine güte dieser kurs was man da an dummheit alles reinsetzen konnte geballt war ich da wahnsinn ja und dann die story habe ich ja schon öfters erzählt am besten war der und der konnte ich nichts dafür der war nicht blöd nicht wirklich glaube ich der war einfach nur ziemlich jung da war erst 16 oder so da war einer am start der nennt wir ihn mal mustafar ich will jetzt nicht den ersten echten namen sagen der meinte er wird später mal richtig krasser gangster rapper und nachdem ich ja da irgendwie der einzige war der halbwegs normal lesen und schreiben konnte in diesem kurs habe ich zu ihm gesagt hier sagt doch mal zeig doch mal was was du so schreibst immer und ich muss mich wegschmeißen das war das war ihm dann voll peinlich auch dass ich darüber gelacht habe er hat mir da mal was mitgebracht so an text und da stand wirklich drauf seit es ein krasser hiphop text ging los mit machst du faxen mache ich dich platt mit achsen ergibt keinen sinn wenn man ehrlich ist ja man weiß aber was er sagen wollte achsen achsen achsen keine ahnung ist das mehr ich habe keine ahnung wer mehr ist sagt mir wie mehr mit echten vornamen heißt kann ich dir sagen aber das ist eher nicht nein natürlich bis 2000 geboren das kann eigentlich nicht sein oh man wunderbar genau es war eine schulung wie man richtig bewerbung schreibt wie gesagt ich war der einzige der halbwegs lesen und schreiben konnte konnte also was die da was die da was was die da für leute reingesteckt haben war echt was war ich mach gar nicht ich labere einfach nur und lass ein video laufen es war es war echt der wahnsinn ja und am ende von diesem kurs hast du dann eine bewertung bekommen wie gut du in welchen bereichen bist und meine frau vom arbeitsamt meinte damals das wäre eine der besten bewertungen gewesen die sie je gesehen hätte ich war einfach nur da und konnte lesen und schreiben das war alles was ich gemacht habe was ich dem kurs gemacht habe denn es ist die typische arbeitsamt statistik statistik fälschung warum man in diesem kurs ist wenn du in so einem kurs bis zählt du nicht als arbeitslos ich war da weil ich nach der schule keinen bock hatte was zu machen ich habe am arbeitsamt wollte geld haben und haben die gesagt macht bewerbungskurs so kurz doch jeder von der echte wahnsinn xx lx xx lx dankeschön für vier monat subscription geh in die tele kannst du in die telegram wendler gruppe gehen oder so chat wie alt seid ihr also der chat der chat zusammen ist bestimmt ja locker über 1000 jahre alt über über 5000 jahre alt 1000 jahre ist relativ easy bei 265 zuschauen wir können um frage sollen wir um frage machen wir können um frage machen ja komm komm wir machen um frage so gut die idee ist hier das macht man um frage ja aber dieser arbeitsamt kurs alter wahnsinn um frage champ du bist am tindern lässt halt nichts anbrennen ok das ist die etwas profi mehr profi variant ja da wird wahrscheinlich nicht mit irgendeinem selbst gefrittert gefrickelten asterix konfig rum gebastelt weiß gar nicht was man da für systeme nimmt aber sie war echt nicht meins ja zweite stafel ich habe ich habe mr robot zweite stafel nicht mal angefangen es dauert 17 monate dankeschön für den sub dazu kann ich nur sagen wo ist mein hypersubs es gibt eine dort nicht kurs aber ernsthaft getappt gezup nein nein nein nicht meiner nicht oh nice perfekt heute den installier ich den cross compile ich für den staubsauger und dann geht es ab ist der robot für stafel zu stafel immer weniger technisch also guck mal mal ich stimme auch mal mit ab 30 wie 30 plus gibt so ein abstimmungspunkt für ich dachte wir machen wenigstens bis 40 ok 16 ich war 2016 kann man sich gar nicht mehr vorstellen damals habe ich feuerwerk noch auf dem röhrenfernseh angeguckt also das was immer läuft wenn 20 uhr wenn 24 uhr ist da lief noch feuerwerk auf dem röhrenfernseh und ich hatte ein nokia handy glaube aber richtiges handy nicht so ein smartphone war dann 2000 noch außer dass alle angst davor hatten dass die welt untergeht wegen ja 2000 bug wo nichts also wirklich auch gar nichts passiert ist ok 30 plus da müssen wir keine extra keine extra umfrage noch mal machen so die meisten sind 19 bis 24 ernsthaft hätte ich nicht gedacht ich dachte wir sind ja übelst viel alte säcke aber finde ich schön dass so viele junge am start sind da sehe ich nämlich auch dass ich noch nicht gar zu boomer bin dass junge sich den scheiß noch mal angucken was ich erzähle ja das ist doch schon mal gut 25 bis 30 30 plus 18 also guck mal 60 prozent 60 prozent sind unter 24 oder 24 und unter 24 der scheiß ist ganz schön ja das doch nice excellent excellent das probiere ich mal auf mag sein glaube ich dir aber ich gucke mir ich gucke mir das nicht an bis zur vierten staffel nachdem ich die erste schaffel enttäuscht hat gibt es irgendwelche aktuellen guten serien die man unbedingt gucken muss wie gesagt wusste gar nicht dass ich da schon video zu gemacht haben egal von wann ist das video 2013 da kann ich wieder neues video zu machen ich habe so viele sachen schon mal irgendwann behandelt das ist schon verjährt da kann ich ein neues video zu machen auch nicht schlecht wie gesagt das hat das hat die gesagt nicht ich jetzt wird es jetzt jetzt können wir demnächst die richtig twitch analytics starten also wie gesagt arbeitslose statistik wurde damals übelst gefakt mit kursen ist es wahrscheinlich immer noch so ich bin jetzt durch ja nicht mal lange ich gehe gleich auf das ist eine exzellente frage wie läuft eigentlich sein advanced traveling salesman projekt gar nicht ich bin mir nicht hundertprozentig sicher woran das liegt also ich habe ja mit einem mit einem arbeitskollege zusammen was was programmiert wo handwerker den optimalen die optimale route für einen tag zwischen ihren kunden ausrechnen können wo man dann auch die termine eintragen konnte oder hatte das ausgerechnet wie du am besten lang fährst mit welchem mit welchem installateur auto eigentlich richtig cooler prototyp gewesen aber entweder sind die sind die pleite gegangen oder haben kein geld mehr dafür gehabt das weiter zu verfolgen ich habe da bis jetzt nix nix mehr von gehört großartig wegel routing problem ja genau mit mit mit time slots also single informatikostream ja was sonst auch wir haben sogar vier prozent die verheiratet ganze drei leute die verheiratet exzellent einer der verlobt ist wie gesagt bald können wir twitch analytics machen da fehlt geschieden stimmt oh nee das machen wir hier nicht das sind sie auf twitch empfindlich was dieses thema angeht ich reite heute kein ich mache einfach aus oder guck mal reine ich irgendjemand gleich jemand und den ich gerne reiten würde einer den ich kennen bist du bist du kaffeetrinker nein ich trinke überhaupt kein kaffee ich habe noch zu wenig themen dafür die habe ich gemacht das war das war so ein ideenwettbewerb sie haben sie haben es eigentlich die haben sich gerannt code camp oder irgendwie sowas gewonnen gewonnen bei diesem wettbewerb wo es eigentlich ums app erstellen geht hat ein team was gegen so ziemlich alle regeln verstoßen hat die aufgestellt wurden ja sie haben irgendwie mit keine ahnung acht leuten teilgenommen obwohl maximale teamgröße fünf war sie haben ach ich krieg's gar ich will auch mal ich hab kein kein gedanken mit genau sie haben im prinzip die sache schon vorher erstellen einfach eine super gute präsentation gemacht also dass die mit der präsentation gewonnen haben kann ich verstehen aber es war nicht sowieso sprich angekündigt war und was mich halt geärgert hat ist dass die die gewonnen haben exakt die gleiche app idee hatten wie wir hätten wenn die nicht am start gewesen hätten wir wahrscheinlich gewonnen und wir haben jetzt gar nichts bekommen weil sie nicht die zweite die gleiche idee zwei mal in den top top drei haben wollten bin ich mir relativ sicher echt was war die app idee das kann ich jetzt so im detail nicht erzählen ja klar kenne ich den ist ja gerade am stream macht er denn das video premiere oder streamt er wirklich wird es nicht am stream oft nicht da jebaited ach so in du meinst allgemein jetzt am stream ja das habe ich gesehen was der brutzler gibt schon namen mittlerweile ja das ist der brutzler weiß ich ich horst heute kein ich horst das nächste wieder irgendjemand ne leute jetzt gehts gleich auf also ich glaube ich habe alles alles ausprobiert klar manchmal scheiß kennt ihr das das ist so ein das ist so neuer tick so neues neues sache die ich mache die eigentlich ziemlich dumm ist wenn ich wenn ich anfange was zu sagen ohne dass ich weiß was ich sagen will und mir dazwischen es nicht einfällt genau was ich sagen will anstatt dass ich dann kurz langsam mache sage ich irgendwie ohne nachzudenken das nächste beste was mir einfällt da kommt so komplett sinnlose setze bei raus wie eben das muss man wieder abgewöhnen am besten ist eigentlich erst was zu sagen wenn man halbwegs weiß was man sagen will da kommt nicht so unglaublich unfertige sinnlose setze bei raus gamestop war bei 200 stonks hodl wo haben sie da haben sie die hodl leute haben sich gefreut die noch hatten genau wie gesagt ich habe heute ja eh nichts großartiges vorgehabt immer noch investierst du ein teil deines geldes also das einzige was ich bis jetzt gemacht habe ich habe zwei bisher zwei privat kredite vergeben mit fast schon und das hat nicht ich vorgeschlagen muss ich sagen fast schon unverschämten zinsen das hat mir aber die jeweilige andere partei vorgeschlagen und das sind aber leute die kenne ich und das ist auch fast schon alles abgezahlt kennst du scherner auf github ne das eine war glaube ich über 12.000 euro und das andere war über ich weiß nicht also Ja, wie gesagt, mitverdreher. Übrigens, dass die fast abbezahlt sind, stimmt gar nicht. Wenn ich das jetzt mal recht überlege. Das läuft noch. Das ist doch gar nicht so recht. Das läuft noch eine ganze Weile. Da muss ich eh mal meinen Steuerberater anhauen, Wie man das am besten das muss man garantiert verschleunen wir sind in deutschland Nö brauch kein tesla ich hab mein ollen 2001er opel agila das reicht ja genau das teil hier mein 2001 in grün auch noch die farbe dachte du fährst zug ich fahre auch mehr oder weniger die meisten sachen im zug aber ab und zu zum beispiel wenn ich am wochenende irgendwo hin fahre um eine runde zu wandern oder so dann mache ich das mit dem auto sie ist als kennzeichen aber die eigentlich agil an der arbeit wir sagen dass ja machen tun wir selten wir machen wir machen ein daily scrum würde ich sagen im nächsten stream daily scrum und tribe meetings und im nächsten stream werde ich checken ob ihr alle auch eure itale zertifizierung erfolgreich abgeschlossen habt weil ich will hier nicht mit unqualitäts zertifizierten leuten zusammen streamen mindestens mindestens also mindestens mal itale sollte das sein wenn nicht dien iso 9001 und natürlich sollte dir auch an sich die passende agile hands on das passende agile hands on mindset haben mentalität du hast in zwei wochen eiten klau so auf repala ist ist was für ein ding certified software test das war habe ich noch nie gehört ja gar ist auch agil zwei tagen noch mein beinheit ja und und also dann kann man baut in schierer leg ich uns schon mal an kicker tisch ja das ja das mindeste alle die meinen sie sind super agil haben kicker tisch der dann nicht verwendet wird weil die leute sonst einen anschluss bekommen dass sie nichts arbeiten oder oder zumindest gefühl haben man kann sich einen tischsteller kicker tisch ja und und kostenloses obst wo sich keiner was nehmen darf es auch sehr beliebt der dann einfach nur rumsteht in der küche und immer gezeigt wird wenn man bewerber umführt wer ist eigentlich der was der je der gender beauftragte von diesem stream keine ahnung sebaro ich weiß es nicht sebaro ist halt mod halb wie das das zählt auch schon mal wo ist er eigentlich der cute mod wo steckt er eigentlich in letzter zeit wo ist der cute mod ja da lebt noch da schreibt man schon im discord wo ist er denn leute ihr müsst heute alle mal die im discord sind oder ihr könnt ja auch den clip hier machen oder sonst wie müsst heute alle mal in discord gehen und an den sebaro schreiben dass wir ihn vermissen im stream stream ohne cute mod ist nicht das gleiche ja der hat auch jetzt eine freundin er muss chatten hat habe ich was habe ich was nicht mitbekommen hat er sich das physik physik grill geangelt ja ich habe das nur am rande im chat verfolgt die ganze geschichte ich dachte ich glaube ich glaube da ist grad zu viel mit studiumsdingern beschäftigt er sebaro er schreibt pepe hans ist im discord ist alles klar leute weißt du was ich mache jetzt ich gucke jetzt mal ich gucke jetzt mal ganz ganz zackig noch mal wer streamt in science and technology german nee nee nee nee wir brauchen was wir haben auch battlefield 3 battlefield 3 ist es multiplayer road to road to was road to engineer 100 servicestars metro was sonst aber das spiel apex wahrscheinlich da bounty macht ja ich hause heute kein kenne heute kennen heute auch niemand echt ach so der hat sein technisch auf deutsch ne und german ja in cover hausen der spielt echt gut also falls ihr battlefield 3 guckt was keiner mehr was keiner mehr spielen spielt aber den den kommers hausen alles gut macht's gut wir sehen uns ist denn könnt ihr mal eine runde wupp old bei ihm spamm oder sowas ich bin jetzt aber nicht im chat ich bin dann bin dann weg ich geh jetzt pennen bestand 0", "segments": [{"id": 1, "start": 60.0, "end": 62.0, "text": "Das war's für heute."}, {"id": 2, "start": 62.0, "end": 64.0, "text": "Vielen Dank für's Zuhören."}, {"id": 3, "start": 64.0, "end": 66.0, "text": "Bis zum nächsten Mal."}, {"id": 4, "start": 66.0, "end": 94.0, "text": "Bis zum nächsten Mal."}, {"id": 5, "start": 96.0, "end": 98.0, "text": "Ah, yes."}, {"id": 6, "start": 98.0, "end": 100.0, "text": "Exzellent."}, {"id": 7, "start": 100.0, "end": 102.0, "text": "Dat Typ 19, Mona."}, {"id": 8, "start": 102.0, "end": 104.0, "text": "Dankeschön für den Sub."}, {"id": 9, "start": 104.0, "end": 106.0, "text": "Exquisite."}, {"id": 10, "start": 106.0, "end": 108.0, "text": "Orangischen Saft."}, {"id": 11, "start": 108.0, "end": 110.0, "text": "Ja, Leute, ich hatte einen Joopnet Vorholz zu streamen."}, {"id": 12, "start": 110.0, "end": 112.0, "text": "Aber, äh..."}, {"id": 13, "start": 112.0, "end": 114.0, "text": "Aber, äh..."}, {"id": 14, "start": 114.0, "end": 116.0, "text": "Aber, äh..."}, {"id": 15, "start": 116.0, "end": 118.0, "text": "Aber, äh..."}, {"id": 16, "start": 118.0, "end": 120.0, "text": "Aber, äh..."}, {"id": 17, "start": 120.0, "end": 122.0, "text": "Aber, äh..."}, {"id": 18, "start": 122.0, "end": 124.0, "text": "Aber, äh..."}, {"id": 19, "start": 124.0, "end": 126.0, "text": "Aber, äh..."}, {"id": 20, "start": 126.0, "end": 128.0, "text": "Ja, eigentlich ist für mich"}, {"id": 21, "start": 128.0, "end": 130.0, "text": "mittlerweile streamen schon"}, {"id": 22, "start": 130.0, "end": 132.0, "text": "so was wie Entspannung."}, {"id": 23, "start": 132.0, "end": 134.0, "text": "Kommt ein bisschen auf den Chat an."}, {"id": 24, "start": 134.0, "end": 136.0, "text": "Je nachdem wieviel der Chat"}, {"id": 25, "start": 136.0, "end": 138.0, "text": "Backseated."}, {"id": 26, "start": 138.0, "end": 140.0, "text": "Dann..."}, {"id": 27, "start": 140.0, "end": 142.0, "text": "Weiß winning so genau."}, {"id": 28, "start": 142.0, "end": 144.0, "text": "Meistens finde ichs"}, {"id": 29, "start": 144.0, "end": 146.0, "text": "entspannend."}, {"id": 30, "start": 146.0, "end": 148.0, "text": "Caipin. Wikipeng, 4 Monate. Danke für den Sub."}, {"id": 31, "start": 148.0, "end": 152.0, "text": "Massive Subcription."}, {"id": 32, "start": 152.0, "end": 159.92, "text": "Ja und zwar warum bin ich on?"}, {"id": 33, "start": 159.92, "end": 161.72, "text": "Mach mal das Ascii-Quarium auf."}, {"id": 34, "start": 161.72, "end": 162.72, "text": "Äh okay."}, {"id": 35, "start": 162.72, "end": 163.72, "text": "But why?"}, {"id": 36, "start": 163.72, "end": 171.12, "text": "Wann kommt das endgültige Surferraum Video ja gut, wenn der Surferraum fertig ist."}, {"id": 37, "start": 171.12, "end": 181.88, "text": "Jaja also ihr müsst auf jeden Fall ein bisschen was fragen, sonst Ruby."}, {"id": 38, "start": 181.88, "end": 188.76, "text": "Also was Herr N. gesagt hat, dass er irgendwelche Großrechnergeschichten macht und mal gern"}, {"id": 39, "start": 188.76, "end": 191.76, "text": "mit mir Discord labern würde, ja bin ich dabei."}, {"id": 40, "start": 191.76, "end": 196.96, "text": "Werde ich ihm ne Runde schwätzen die nächsten Tage."}, {"id": 41, "start": 196.96, "end": 200.36, "text": "Machen wir hier mal kurz zu."}, {"id": 42, "start": 200.36, "end": 202.08, "text": "Hier Ascii-Quarium ist auf guck."}, {"id": 43, "start": 202.08, "end": 205.84, "text": "Kannst du stream auch richtig sagen?"}, {"id": 44, "start": 205.84, "end": 206.84, "text": "Nee kann ich nicht."}, {"id": 45, "start": 206.84, "end": 212.2, "text": "Jaja Herr M."}, {"id": 46, "start": 212.2, "end": 213.2, "text": "hat sich gemeldet tatsächlich."}, {"id": 47, "start": 213.2, "end": 219.04, "text": "Ist der Controller von gestern RIP, ja tatsächlich wartet mal ich muss mal kurz Dark Seam anmachen"}, {"id": 48, "start": 219.04, "end": 222.8, "text": "weil ich hab's hier dunkel in dem Raum, weil also der Grund warum ich on gekommen bin"}, {"id": 49, "start": 222.8, "end": 223.8, "text": "sag ich euch mal so."}, {"id": 50, "start": 223.8, "end": 226.2, "text": "Ich hab immer noch ein bisschen Kopfweh und das geht irgendwie nicht richtig weg."}, {"id": 51, "start": 226.2, "end": 229.36, "text": "Ich geh morgen auch mal zum Doktor, gut was soll der sagen, außerdem legen sie sich"}, {"id": 52, "start": 229.36, "end": 230.36, "text": "hin, schonen sie sich."}, {"id": 53, "start": 230.36, "end": 233.8, "text": "Aber ist vielleicht gar keine so schlechte Idee."}, {"id": 54, "start": 233.8, "end": 238.48, "text": "Und ich hab gemerkt wenn ich streame habe ich danach weniger Kopfweh, ich weiß nicht"}, {"id": 55, "start": 238.48, "end": 239.48, "text": "warum."}, {"id": 56, "start": 239.48, "end": 245.8, "text": "Wann komm dem Garten durch den Schnee stellst, ich hab hier aufgenommen."}, {"id": 57, "start": 245.8, "end": 250.0, "text": "Vielleicht lad ich das einfach so random morgen mal hoch, weil jetzt ist ja kein Schnee"}, {"id": 58, "start": 250.0, "end": 251.0, "text": "mehr da."}, {"id": 59, "start": 251.0, "end": 265.6, "text": "Ja zum Doktor gehen das geht, da ist eh nicht viel los und zu Corona zeiten wahrscheinlich"}, {"id": 60, "start": 265.6, "end": 266.6, "text": "noch mehr."}, {"id": 61, "start": 266.6, "end": 274.2, "text": "Richtig, endlich durch den IQ des Chats wird dein Hirn entlastet, exakt, exakt so siehts"}, {"id": 62, "start": 274.2, "end": 275.2, "text": "aus."}, {"id": 63, "start": 275.2, "end": 287.04, "text": "Exzellent, exzellent, wartet mal wo ist das passende, ja also dieser, der im letzten Stream"}, {"id": 64, "start": 287.04, "end": 295.44, "text": "nicht dabei war, ich hab zwei Controller gegrillt von dieser Sorte hier und ich hab versucht"}, {"id": 65, "start": 295.44, "end": 300.32, "text": "welche zu bestellen Leute, ne, pass mal auf wenn du den Kram bestellen willst, du kriegst"}, {"id": 66, "start": 300.32, "end": 306.0, "text": "erstmal 50 Milliarden Seiten und der Kram ist ultra teuer mittlerweile."}, {"id": 67, "start": 306.0, "end": 309.72, "text": "Ich hab jetzt erstmal nix bestellt, ich hab noch zwei, das reicht."}, {"id": 68, "start": 309.72, "end": 319.96, "text": "Der Doktor morgen kommt wahrscheinlich überhaupt keine Diagnose, der Typ der macht ja nie was."}, {"id": 69, "start": 319.96, "end": 330.2, "text": "Das einzige was der machen kann ist zu sagen schonen sie sich und ich schreib sie krank."}, {"id": 70, "start": 330.2, "end": 348.16, "text": "Ja 20 Dollar oder so das Stück, die sind zum steuern von, also die kannst du proklamieren"}, {"id": 71, "start": 348.16, "end": 350.88, "text": "und machen lassen was du willst."}, {"id": 72, "start": 350.88, "end": 362.24, "text": "Excellent, aber damit will ich meinen Stromzähler im Keller auslesen, oah, oah, Flashbang,"}, {"id": 73, "start": 362.24, "end": 371.12, "text": "nochmal defused alter, ja hier pass mal auf, hier kostet er nämlich 20 Dollar und ich"}, {"id": 74, "start": 371.12, "end": 379.36, "text": "dachte mir ey das ist ne geile Sache, kauf ich mir, 18 Dollar, 15 Euro Shipping ist auch"}, {"id": 75, "start": 379.36, "end": 385.72, "text": "noch okay und dann kommt Ships vom Australia und dauert irgendwie 5 Wochen oder so."}, {"id": 76, "start": 385.72, "end": 391.52, "text": "Ne, Crap alter."}, {"id": 77, "start": 391.52, "end": 397.96, "text": "Was heißt der Langstuhl für den Zap?"}, {"id": 78, "start": 397.96, "end": 412.84, "text": "Oah das Scamtrain ist da, habt ihr euch nice jebaiten lassen."}, {"id": 79, "start": 412.84, "end": 416.72, "text": "Der Versand aus dem Ausland dauert nicht unbedingt ewig, aber aus Australien dauert anscheinend"}, {"id": 80, "start": 416.72, "end": 417.72, "text": "ewig."}, {"id": 81, "start": 417.72, "end": 425.12, "text": "Also Aliexpress ist teilweise ziemlich schnell, okay die haben auch EU Warenlager und alles"}, {"id": 82, "start": 425.12, "end": 443.48, "text": "am Start ja und aber ja der Controller ist, wer auch immer das noch mal gefragt hat, ja"}, {"id": 83, "start": 443.48, "end": 452.92, "text": "also Splixer, das Ding ist definitiv im Arsch, gibt es auch keine Punktedrückerstattung"}, {"id": 84, "start": 452.92, "end": 457.2, "text": "oder so, das Ding ist ziemlich sicher broken as fuck, ja."}, {"id": 85, "start": 457.2, "end": 469.24, "text": "Wenn Overwatch 2 released wird, schaust du dann mal rein, ja wahrscheinlich schon, wahrscheinlich"}, {"id": 86, "start": 469.24, "end": 474.04, "text": "schon, aber ich hab echt keine Ahnung ob ich mir das nochmal geben werde."}, {"id": 87, "start": 474.04, "end": 481.08, "text": "Was muss ich machen damit mein Chrome, mein Unify nicht mehr als nicht sicher Kennzeichen"}, {"id": 88, "start": 481.08, "end": 485.44, "text": "mit dem gültiges Zertifikat geben, das kannst du zum Beispiel nehmen, Alter Flashbang."}, {"id": 89, "start": 485.44, "end": 494.36, "text": "Ist das denn jetzt Dark Mode, ja also was du machen kannst für den Unify Controller,"}, {"id": 90, "start": 494.36, "end": 500.24, "text": "Unify Controller das ist so ein Webinterface zum Steuern von Unify Access Points wer das"}, {"id": 91, "start": 500.24, "end": 509.32, "text": "nicht kennt, sieht so aus, ja das ist die alte Version aber so, naja das sind die Settings"}, {"id": 92, "start": 509.32, "end": 513.44, "text": "ne, also ich hab so ne Übersicht mit Access Points und könnt da Zeug von einstellen,"}, {"id": 93, "start": 513.44, "end": 514.44, "text": "so."}, {"id": 94, "start": 514.44, "end": 522.12, "text": "Ist eigentlich ne ganz, ganz coole Idee für Easy Management, Torpsen, nee Teorpsen, Twitch"}, {"id": 95, "start": 522.12, "end": 524.88, "text": "Prime, danke schön für den Sub, exquisite."}, {"id": 96, "start": 524.88, "end": 532.2, "text": "Wie heißt der Netzwerkmonitor in der Statusleiste, gibt's den auch für Ubuntu, das ist i3 status"}, {"id": 97, "start": 532.2, "end": 550.64, "text": "Rust, da ist es eingebaut, das ist so ne Bar, die funktioniert halt nur unter i3 ordentlich,"}, {"id": 98, "start": 550.64, "end": 555.28, "text": "aber die gibt's auch unter Ubuntu, ja, das kannst du installieren wo du willst, so um"}, {"id": 99, "start": 555.28, "end": 558.2, "text": "jetzt mal auch da drauf zu kommen, also wie gesagt so schaut das Ding aus, es ist zum"}, {"id": 100, "start": 558.2, "end": 567.48, "text": "Steuern von Unify Equipment und das hat wenn man drauf geht erstmal kein gültiges Zertifikat,"}, {"id": 101, "start": 567.48, "end": 570.72, "text": "was man jetzt machen kann ist folgendes, also was ich bei mir gemacht hab, weil ich mag"}, {"id": 102, "start": 570.72, "end": 575.56, "text": "auch keinen ungültigen Zertifikat, man kann sich mit Let's Encrypt ein Zertifikat ausstellen"}, {"id": 103, "start": 575.56, "end": 583.24, "text": "lassen, so was ich empfehlen würde ist allerdings, wenn man sich für seinen Unify Controller"}, {"id": 104, "start": 583.24, "end": 588.44, "text": "ein Let's Encrypt Zertifikat ausstellt, was ich empfehlen würde ist folgendes, ich würde"}, {"id": 105, "start": 588.44, "end": 599.0, "text": "das nicht wirklich dem Unify Controller geben, das Zertifikat, sondern ich würde ein Reverse"}, {"id": 106, "start": 599.0, "end": 603.44, "text": "Proxy davor machen, der für mich auch Let's Encrypt handelt, also sprich ihr installiert"}, {"id": 107, "start": 603.44, "end": 609.8, "text": "euch beispielsweise nen Kadi, nen Engine X, nen HA Proxy, was auch immer, Kadi ist das"}, {"id": 108, "start": 609.8, "end": 615.28, "text": "einfachste finde ich, weil der hat das ganze Let's Encrypt Zeug schon eingebaut oder was"}, {"id": 109, "start": 615.28, "end": 624.12, "text": "auch immer, letztendlich ist es egal, macht ihr davor und den Last, Traffic, Traffic finde"}, {"id": 110, "start": 624.12, "end": 630.76, "text": "ich, Sideversion 2 finde ich abartig zu konfigurieren, macht ihr davor und den lasst ihr Let's Encrypt"}, {"id": 111, "start": 630.76, "end": 636.56, "text": "machen und dann lasst ihr Let's Encrypt weiter leiten auf den Unify Controller, so hab ich"}, {"id": 112, "start": 636.56, "end": 648.08, "text": "das bei mir auch gemacht, guck, kann ich euch zeigen, ich weiß, oh, ah ne, kann ich euch"}, {"id": 113, "start": 648.08, "end": 655.12, "text": "nicht zeigen, ich hab's nicht laufen, lul, ja, aber so hab ich's bei mir auch gemacht,"}, {"id": 114, "start": 655.12, "end": 660.36, "text": "kannst du in einem Stream oder Video Reverse Proxy erklären, ne, denn Reverse Proxy ist"}, {"id": 115, "start": 660.36, "end": 666.08, "text": "im Prinzip das Gegenteil von einer Weiterleitungsproxy, also zur normalen Webproxy verwendest du"}, {"id": 116, "start": 666.08, "end": 670.76, "text": "um von innen nach außen ins Internet zuzugreifen, das heißt, du fragst beim Proxy an, der Proxy"}, {"id": 117, "start": 670.76, "end": 675.64, "text": "fragt für dich an und dort ist es umgedreht, das Internet greift auf dich zu, greift erst"}, {"id": 118, "start": 675.64, "end": 680.24, "text": "auf den Reverse Proxy zu, der Reverse Proxy fragt auf deinem Service intern an, so musst"}, {"id": 119, "start": 680.24, "end": 687.36, "text": "du deine internen Services halt auch nicht exposen ins Web zum Beispiel, ja, so und Leute"}, {"id": 120, "start": 687.36, "end": 690.2, "text": "denkt grad, du müsst Ed Wupplos davor schauen, wenn ich was zu sagen soll, weil sonst seh"}, {"id": 121, "start": 690.2, "end": 697.44, "text": "ich's wahrscheinlich gleich nicht, so und um das jetzt hier besser, besser machen zu können"}, {"id": 122, "start": 697.44, "end": 709.8, "text": "mit Let's Encrypt und internen Domains, würde ich euch empfehlen, ein Ricksle Twitch Prime,"}, {"id": 123, "start": 709.8, "end": 714.28, "text": "danke schön für den Sub, ich hab bestimmt die Hälfte übersehen, solltet ihr das am"}, {"id": 124, "start": 714.28, "end": 721.52, "text": "besten über DNS Challenge machen, also wenn ihr ne Domain habt, oder meinetwegen auch"}, {"id": 125, "start": 721.52, "end": 728.48, "text": "irgendeine DuckDNS Domain, ist ja auch relativ beliebt, aber gehen wir mal davon aus, ihr"}, {"id": 126, "start": 728.48, "end": 731.96, "text": "habt wirklich ne echte Domain gekauft, der Kram kostet ja auch nicht mehr viel, 7 Dollar"}, {"id": 127, "start": 731.96, "end": 738.48, "text": "im Jahr, das kann sich glaub ich jeder leisten, um einen schönen Domain zu haben, dann seid"}, {"id": 128, "start": 738.48, "end": 745.64, "text": "ihr entweder bei einem Domain Registrar, der ne DNS API hat, oder ihr legt eure Domain"}, {"id": 129, "start": 745.64, "end": 750.44, "text": "zu Cloudflare oder zu irgendeinem anderen, der das kann, und dann könnt ihr mit Let's"}, {"id": 130, "start": 750.44, "end": 757.36, "text": "Encrypt DNS Challenge machen, also sprich, das ganze funktioniert so, ihr startet ein"}, {"id": 131, "start": 757.36, "end": 764.08, "text": "Programm bei euch lokal, was halt das implementiert hat, DNS Challenge für Let's Encrypt, sagen"}, {"id": 132, "start": 764.08, "end": 772.4, "text": "wir mal mit Cloudflare, und dann funktioniert das folgendermaßen, so ganz grob, Cloudflare"}, {"id": 133, "start": 772.4, "end": 779.46, "text": "und das Programm kommunizieren miteinander, das Programm hinterlegt einen geheimen Schlüssel"}, {"id": 134, "start": 779.46, "end": 790.16, "text": "in dem DNS Record, den nur ihr und Cloudflare kennt, Cloudflare guckt nach, ob in dem DNS-Eintrag"}, {"id": 135, "start": 790.16, "end": 795.0, "text": "dieser geheime Schlüssel drin steht, wenn ja, dann beweist das, ihr seid Eigentümer"}, {"id": 136, "start": 795.0, "end": 801.68, "text": "der Domain, und es gibt euch ein Zertifikat, das hat den riesen Vorteil, DNS Challenge,"}, {"id": 137, "start": 801.68, "end": 811.2, "text": "ihr könnt das ohne Probleme auch für interne Sachen machen, für die Standard HTTP Challenge"}, {"id": 138, "start": 811.2, "end": 816.64, "text": "müsste der Server im Internet stehen, und auf Port 80 erreichbar sein, deswegen ist"}, {"id": 139, "start": 816.64, "end": 822.44, "text": "es mit DNS Challenge für interne Domains viel besser und einfacher, und die gängigen"}, {"id": 140, "start": 822.44, "end": 827.68, "text": "Sachen, sei es hier Sirtboard oder sonst wie, oder auch Cuddy, die können das auch mit"}, {"id": 141, "start": 827.68, "end": 836.64, "text": "DNS Challenge, sei es mit einem Plugin, genau wie gesagt, wer keine eigene Domain hat,"}, {"id": 142, "start": 836.64, "end": 840.84, "text": "kann hier sowas zum Beispiel verwenden, das ist eigentlich auch ganz nice, da kriegt man"}, {"id": 143, "start": 840.84, "end": 849.32, "text": "eben einen dynamischen DNS-Eintrag, aber ich würde euch auf jeden Fall empfehlen, holt"}, {"id": 144, "start": 849.32, "end": 858.24, "text": "eine eigene Domain, ist DNS Challenge nicht IP League, naja, wenn Cloudflare auf dich zugreift"}, {"id": 145, "start": 858.24, "end": 864.6, "text": "und die auf Port 80 eine Datei abruft, ist das auch IP League, Cloudflare muss das schon"}, {"id": 146, "start": 864.6, "end": 871.32, "text": "wissen, und ne, ist es nicht unbedingt IP League, ne, sag mal so, du greifst ja mit deiner"}, {"id": 147, "start": 871.32, "end": 877.36, "text": "externen IP auf Cloudflare zu, nicht auf Cloudflare, auf Let's Encrypt zu, ja, ich meine, du kannst"}, {"id": 148, "start": 877.36, "end": 883.68, "text": "das auch über irgendeinen VPN oder Proxy oder so machen, das geht auch, wichtig ist halt"}, {"id": 149, "start": 883.68, "end": 889.44, "text": "nur, dass der DNS-Eintrag da ist, und es ist ein TXT-Record, also keine IP, also sprich,"}, {"id": 150, "start": 889.44, "end": 895.6, "text": "der DNS antwortet mit einem Text-File, nicht mit einer IP in dem Fall, ja, genau, also"}, {"id": 151, "start": 895.6, "end": 900.92, "text": "das ist eigentlich die einfachste Variante, und das ist auch die Sache, wie ich bei mir"}, {"id": 152, "start": 900.92, "end": 907.88, "text": "lokal gültige Zertifikate habe, ich bin sogar mal so weit gegangen und hab meinem Staubsauger-Roboter"}, {"id": 153, "start": 907.88, "end": 912.68, "text": "ein gültiges Zertifikat verpasst, hab ich aber wieder weggemacht, weil das mit dem"}, {"id": 154, "start": 912.68, "end": 922.32, "text": "regelmäßig updaten ein bisschen schwierig war, aber damit kann man wirklich ganz schön"}, {"id": 155, "start": 922.32, "end": 939.0, "text": "viel anstellen mit Let's Encrypt, ja, so siehts aus, so, next, so siehts aus, bestimmt, bestimmt,"}, {"id": 156, "start": 939.0, "end": 952.44, "text": "der sagt, aha, ich diagnostiziere Twitch Chat Big Brain, sagt der morgen, Programme immer"}, {"id": 157, "start": 952.44, "end": 963.36, "text": "über Power-Toys starten, kann ich mal Power-Toys installieren, ich mach eh unter Windows nichts,"}, {"id": 158, "start": 963.36, "end": 974.12, "text": "was irgendwie technisch advanced wäre, ja, ja, ja, ist mir lieber, also ich starte meine"}, {"id": 159, "start": 974.12, "end": 994.68, "text": "Programme unter Linux immer hier mit, ups, nee, das ist mein Clipboard, mein Anker, ich"}, {"id": 160, "start": 994.68, "end": 998.44, "text": "starte, nee, ich glaub, das ist kein Passwort, ich bin mir gar nicht sicher, für was das"}, {"id": 161, "start": 998.44, "end": 1007.48, "text": "war, irgendein APK für irgendwas, was wir glaub ich mal ausprobiert haben, nee, das"}, {"id": 162, "start": 1007.48, "end": 1015.84, "text": "ist nicht das WLAN Passwort, ich bin mir gar nicht sicher, ehrlich gesagt, für was das,"}, {"id": 163, "start": 1015.84, "end": 1023.36, "text": "das ist die, das ist die Uhrl von irgendeinem Amazon Ding gewesen, oder, genau, das ist"}, {"id": 164, "start": 1023.36, "end": 1028.64, "text": "die Channel-ID vom WLED YouTube-Channel, den haben wir uns letztens eingeguckt, nee, nee,"}, {"id": 165, "start": 1028.64, "end": 1037.2, "text": "ich hab hier, ich hab doch extra Streaming-Accounts, da ist kein Passwort liegt, hier, ein letztens"}, {"id": 166, "start": 1037.2, "end": 1044.24, "text": "jemand, haben wir glaub ich auch wieder im Chat, hallo, der bei WLED mit bastelt und"}, {"id": 167, "start": 1044.24, "end": 1052.12, "text": "ja, ich hab den offiziellen Channel gezeigt, genau, du warst das, stimmt, ich erinnere"}, {"id": 168, "start": 1052.12, "end": 1061.4, "text": "mich, ja, wie bricht man das eigentlich aus, jvpeak, jvpeak, oder, wie auch immer, so,"}, {"id": 169, "start": 1061.4, "end": 1066.4, "text": "und, jetzt hab ich voll verdrängt, was ich sagen wollte, genau, ich start meine Programme"}, {"id": 170, "start": 1066.4, "end": 1078.4, "text": "immer hier, mit, bei mir ist das Windows-Taste D, weil das ursprünglich mal D-Menü war,"}, {"id": 171, "start": 1078.4, "end": 1084.8, "text": "sag einfach Jan, oh, das ist ein geiles E-Mode, das ist, das ist ein geiles E-Mode, das Wim-Logo"}, {"id": 172, "start": 1084.8, "end": 1089.96, "text": "mit Dings, das ist cool, das find ich nice, also ich start das immer hier, Steuerung D,"}, {"id": 173, "start": 1089.96, "end": 1095.92, "text": "nicht Steuerung D, Windows-Taste D, da hab ich hier mein, mein Rofi- oder D-Menü-Ersatz"}, {"id": 174, "start": 1095.92, "end": 1111.92, "text": "drauf liegen, zum starten, passt, so, schauen wir mal weiter, Logs-HD, 17 Monate, Hyper-Subscription,"}, {"id": 175, "start": 1111.92, "end": 1120.08, "text": "ich bin mir jetzt sicher, ob ich vorgelesen habe, aber Dankeschön für den Subs, ja,"}, {"id": 176, "start": 1120.08, "end": 1126.92, "text": "so, jetzt hab ich jetzt ja ausführlich beantwortet, ich denke mal, das hat's erklärt, oder, wie"}, {"id": 177, "start": 1126.92, "end": 1131.36, "text": "gesagt, ich würde nicht damit anfangen, das Zertifikat direkt auf den Unify-Controller"}, {"id": 178, "start": 1131.36, "end": 1139.88, "text": "zu legen, lieber auf den Reverse-Proxy auf dem gleichen Server davor, du klingst krank"}, {"id": 179, "start": 1139.88, "end": 1144.8, "text": "oder müde, ja, finde ich auch, beides, beides, hä, ich hab, ich hab seit ein paar Tagen"}, {"id": 180, "start": 1144.8, "end": 1150.24, "text": "hab ich Kopfweh, jetzt nicht so super schlimm, wenn ich, wenn ich liege und so, ist auch alles"}, {"id": 181, "start": 1150.24, "end": 1155.84, "text": "ok, aber irgendwie tagsüber hab ich so ein bisschen so, so Druck irgendwie auf dem Kopf,"}, {"id": 182, "start": 1155.84, "end": 1162.48, "text": "keine Ahnung, das ist nicht so schlimm, aber es ist nervig, ich glaube ja, wisst ihr was,"}, {"id": 183, "start": 1162.48, "end": 1167.68, "text": "ich glaube, ich glaube, ich bin zu alt, ich glaube, ich hab mich irgendwie verrenkt, oder"}, {"id": 184, "start": 1167.68, "end": 1173.12, "text": "irgendwas verzogen, zu viel IQ vielleicht, beim Serverraum-Umbau, ich hab ja da teilweise"}, {"id": 185, "start": 1173.12, "end": 1180.84, "text": "schon ganz schön Schäpp hinter meinem Rack gehongen, ja, auf der Erd, Overwatch 2 ist"}, {"id": 186, "start": 1180.84, "end": 1187.4, "text": "that game, ja, aktuell auf jeden Fall schon, ist ja noch nicht raus, also, ganz ehrlich,"}, {"id": 187, "start": 1187.4, "end": 1193.88, "text": "Overwatch 1 hatte einen gerechtfertigten, muss ich auch sagen, am Anfang, hatte einen"}, {"id": 188, "start": 1193.88, "end": 1209.84, "text": "gerechtfertigten, ordentlichen Hype, meiner Meinung nach zumindest, das Problem mit Overwatch"}, {"id": 189, "start": 1209.84, "end": 1217.6, "text": "war nur, dass, ich hab mich ja da schon oft drüber ausgelassen, aber, das Problem mit"}, {"id": 190, "start": 1217.6, "end": 1228.2, "text": "Overwatch ist einfach gewesen, dass Blizzard es irgendwie nicht geschafft hat, dass das"}, {"id": 191, "start": 1228.2, "end": 1232.24, "text": "auch halb technisch am Leben zu halten, ich mein, wir leben in einer Zeit, wo Games wie"}, {"id": 192, "start": 1232.24, "end": 1238.0, "text": "Fortnite am Start sind, die irgendwie alle zwei Wochen was Neues rauskloppen, ja, das"}, {"id": 193, "start": 1238.0, "end": 1241.48, "text": "muss man ja mit Overwatch nicht unbedingt machen, aber die Leute, gerade bei Overwatch,"}, {"id": 194, "start": 1241.48, "end": 1246.6, "text": "und Overwatch hat ja versucht von Anfang an, so die Casual Noobs anzusprechen, die"}, {"id": 195, "start": 1246.6, "end": 1252.64, "text": "Bossplayer anzusprechen, alle möglichen Family Friendly anzusprechen, plus die E-Sport"}, {"id": 196, "start": 1252.64, "end": 1257.52, "text": "Geschichte anzusprechen, das kann man ja schon, ich mein, man kann's probieren, das"}, {"id": 197, "start": 1257.52, "end": 1263.44, "text": "ist aber echt schon ne ganz schöne Herausforderung, aber das hauptsächliche Problem ist eigentlich,"}, {"id": 198, "start": 1263.44, "end": 1268.56, "text": "wo sie es meiner Meinung nach verkackt haben, dass die kein Content geliefert haben, die"}, {"id": 199, "start": 1268.56, "end": 1275.52, "text": "haben, und nicht einsehen wollten, dass manche Sachen scheiße sind, immer 2CP Anubis, das"}, {"id": 200, "start": 1275.52, "end": 1280.16, "text": "war voll geil, das war von Anfang an ein absoluter Rotz, jetzt nehmen sie es ja raus"}, {"id": 201, "start": 1280.16, "end": 1283.04, "text": "mit Overwatch 2, da haben sie 3 oder 5 Jahre für gebraucht."}, {"id": 202, "start": 1283.04, "end": 1294.88, "text": "Leco, jetzt können wir es gleich noch mal angucken, ja, und die schaffen es immer noch"}, {"id": 203, "start": 1294.88, "end": 1306.12, "text": "nicht richtig, Content zu machen bei Overwatch, die schaffen es mal ein Hell zu releasen,"}, {"id": 204, "start": 1306.12, "end": 1311.64, "text": "und, äh, keine Ahnung, Map Release, Hell, ein Teaser und ein Comic in einem Jahr, so"}, {"id": 205, "start": 1311.64, "end": 1315.52, "text": "nach dem Motto, plus die immer wieder gleichen Events, das ist mega Resident Sleeper, die"}, {"id": 206, "start": 1315.52, "end": 1322.08, "text": "kriegen es eigentlich einfach nicht gebacken, das hatten wir schon, als ich meinen selbstgemachten"}, {"id": 207, "start": 1322.08, "end": 1328.36, "text": "Platinen bestellt habe, waren die Inland von 2 Tagen aus China und Deutschland, ja, ja"}, {"id": 208, "start": 1328.36, "end": 1335.44, "text": "tatsächlich, ich habe auch lustigerweise mehr Probleme mit Inlandversand, gut es ist aber"}, {"id": 209, "start": 1335.44, "end": 1340.56, "text": "auch, ich glaube man darf das nicht unterschätzen, logistisch ist das auch nicht ohne, das quasi"}, {"id": 210, "start": 1340.56, "end": 1345.64, "text": "bis ins letzte Furzdorf innerhalb von Deutschland liefern zu können, versus von einem Flughafen"}, {"id": 211, "start": 1345.64, "end": 1352.32, "text": "ins Flugzeug, also ins Flugzeugladen zu einem anderen Flughafen fliegen und ausladen, aber"}, {"id": 212, "start": 1352.32, "end": 1360.04, "text": "trotzdem, also ich hatte auch schon mehr Probleme mit Inland, DHL, UPS, Amazon, Logistik neuerdings,"}, {"id": 213, "start": 1360.04, "end": 1366.88, "text": "GLS, DPD, Transoflex, Alter, gibt es auch, ich weiß nicht, ob sich jemand schon mal im"}, {"id": 214, "start": 1366.88, "end": 1372.36, "text": "Leben was mit Transoflex gekriegt hat, ähm, ich hatte sie alle schon mal irgendwann daheim,"}, {"id": 215, "start": 1372.36, "end": 1385.04, "text": "ja, übrigens, was auch witzig ist, ich hatte, ich hatte paar Handwerker da, warte mal zu,"}, {"id": 216, "start": 1385.04, "end": 1389.2, "text": "äh, Bing Image, ich muss neu starten, ich brauche ein neues Bing Image of the Day, Leute,"}, {"id": 217, "start": 1389.2, "end": 1393.68, "text": "ich bin gleich wieder am Start, also die VM, äh, ich hatte Handwerker am Start, die haben"}, {"id": 218, "start": 1393.68, "end": 1400.48, "text": "eine Regenrinne sauber gemacht ums ganze Haus rum, das ist halt relativ hoch und äh, war"}, {"id": 219, "start": 1400.48, "end": 1409.88, "text": "halt zu und hat runter geregnet und war halt halt gesackt und als sie fährt, ich hatte"}, {"id": 220, "start": 1409.88, "end": 1418.08, "text": "mit denen am Anfang ausgemacht, 150 Euro, und da habe ich gesagt, okay, ähm, wie sieht"}, {"id": 221, "start": 1418.08, "end": 1426.8, "text": "es aus, Rechnung, ah, nix, Rechnung, okay, nix, aber zumindest Quittung, das ich bezahlt"}, {"id": 222, "start": 1426.8, "end": 1431.84, "text": "habe und dann sagt der Typ ernsthaft, ist kein Witz, dann sagt der Typ ernsthaft als"}, {"id": 223, "start": 1431.84, "end": 1435.0, "text": "Antwort, wo ich gesagt habe, ja, Quittung, das ich halt beweisen kann, dass ich bezahlt"}, {"id": 224, "start": 1435.0, "end": 1449.56, "text": "habe, dann sagt er, auf Ehre, auf Ehre, okay, ich gehe mal davon aus, ich gehe mal davon"}, {"id": 225, "start": 1449.56, "end": 1456.44, "text": "aus, der wollte keine Steuern bezahlen oder so, keine Ahnung, auf Ehre, ich weiß jetzt"}, {"id": 226, "start": 1456.44, "end": 1461.0, "text": "gar nicht was ich machen soll, ich weiß überhaupt nicht was ich machen soll, jetzt eigentlich"}, {"id": 227, "start": 1461.0, "end": 1476.64, "text": "ist es illegal, ich habe gesagt, Alter, schreib mir halt ein Zettel, auf Ehre, Alter, eigentlich"}, {"id": 228, "start": 1476.64, "end": 1501.64, "text": "darfst du es net, ja, Polybar bin ich nicht so warm geworden mit, ja, E3 Gaps finde ich"}, {"id": 229, "start": 1501.64, "end": 1505.96, "text": "persönlich auch besser, weil ich habe auch E3 Gaps als Wintermanager, da hat man so ein"}, {"id": 230, "start": 1505.96, "end": 1511.64, "text": "paar Spalten zwischen den Fenstern, man kann jetzt sagen, es ist komplett sinnlos, gibt"}, {"id": 231, "start": 1511.64, "end": 1516.12, "text": "Leute, die sagen, wozu braucht man diese Spalten hier, aber ich bin der Meinung, die Spalten"}, {"id": 232, "start": 1516.12, "end": 1520.36, "text": "sind ganz nützlich, erstens, dass man auf den ersten Blick erkennt, wo der Rand ist"}, {"id": 233, "start": 1520.36, "end": 1524.0, "text": "und zweitens, dass man zwischen Fenster, die ähnlich und Programme, die ähnliche Farben"}, {"id": 234, "start": 1524.0, "end": 1528.28, "text": "haben, eindeutig erkennt, wo das eine Programm anfängt und wo das andere auffällt, also"}, {"id": 235, "start": 1528.28, "end": 1532.6, "text": "ich finde die Gaps tatsächlich sinnvoll und ich finde die Gaps auch ästhetischer, es"}, {"id": 236, "start": 1532.6, "end": 1536.24, "text": "reicht ja, wenn man die 4-5 Pixel breit macht, als wenn die Fenster aneinander hängen."}, {"id": 237, "start": 1536.24, "end": 1556.72, "text": "Wie gesagt, Traffic mag ich die Config nicht, nein, nein, nein, musst du nicht, gar nicht,"}, {"id": 238, "start": 1556.72, "end": 1565.2, "text": "also für das Zertifikat nicht, für das Unify nur das Webfrontend, also nur 8443, du richtest"}, {"id": 239, "start": 1565.2, "end": 1568.4, "text": "die Config von deinem Nginx, wie gesagt, ich würde Caddy nehmen, damit ist es einfacher,"}, {"id": 240, "start": 1568.4, "end": 1571.72, "text": "aber du kannst es auch mit Nginx machen und Certbot und sonst was, aber Caddy ist halt"}, {"id": 241, "start": 1571.72, "end": 1579.84, "text": "schön easy, da ist das eingebaut, bzw. mit einem Plugin für DNS-Challenge oder nimmst"}, {"id": 242, "start": 1579.84, "end": 1587.6, "text": "Traffic oder irgendwas, du musst einstellen im Reverseproxy, dass du lauschst auf Port"}, {"id": 243, "start": 1587.6, "end": 1595.8, "text": "443, dass du mit dem passenden Domainname, das ist der ganze letzte Crypt-Config und"}, {"id": 244, "start": 1595.8, "end": 1606.36, "text": "dass du Reverseproxys, also weiterleitest auf dein Unify-Controller, Localhost 8443, also"}, {"id": 245, "start": 1606.36, "end": 1611.6, "text": "wie gesagt, ich mag Traffic nicht, ich finde Caddy viel praktischer, habe ich ja gerade"}, {"id": 246, "start": 1611.6, "end": 1612.6, "text": "schon versucht."}, {"id": 247, "start": 1612.6, "end": 1628.2, "text": "Was ist an OpenVPN besser als an Fritzbox VPN, keine Ahnung, legit, kein Plan, ist das"}, {"id": 248, "start": 1628.2, "end": 1635.8, "text": "Fritzbox VPN nicht OpenVPN, oder was ist das, was ist das Fritzbox VPN, IPsec, ich habe"}, {"id": 249, "start": 1635.8, "end": 1647.72, "text": "keine Ahnung, wo ist das jemand von euch, das ist IPsec, ja gut, IPsec hat einen Vorteil,"}, {"id": 250, "start": 1647.72, "end": 1653.16, "text": "die iPhones können IPsec out of the box und ich vermute mal Android, weiß ich jetzt nicht,"}, {"id": 251, "start": 1653.16, "end": 1659.68, "text": "aber vermute mir Android auch, das ist tatsächlich ein Vorteil, aber du kannst ja einfach OpenVPN"}, {"id": 252, "start": 1659.68, "end": 1663.64, "text": "installieren, wobei ich dir ehrlich gesagt WireGuard empfehlen würde, ich finde WireGuard"}, {"id": 253, "start": 1663.64, "end": 1670.72, "text": "ist ein guter Kompromiss, gerade auch was die Clients für den Desktop angeht und einfacher"}, {"id": 254, "start": 1670.72, "end": 1671.72, "text": "einzurichten."}, {"id": 255, "start": 1671.72, "end": 1688.92, "text": "Richtig QtChat, Massive, Bigbrainer QtChat, du musst mal ausführlich den kompletten Stacker"}, {"id": 256, "start": 1688.92, "end": 1704.7, "text": "third邊, und dann kann man das ordentlich auflesen und dann sind die"}, {"id": 257, "start": 1704.7, "end": 1712.86, "text": "mal auf, das können wir tatsächlich machen, mach das mal doppelt, dass ich mir noch gleich"}, {"id": 258, "start": 1712.86, "end": 1724.14, "text": "was drunter schreiben kann, also ich sag da noch mal ganz kurz was zu, WireGuard klein"}, {"id": 259, "start": 1724.14, "end": 1729.1, "text": "auf Linux ist quasi non existent, wir haben doch im Stream sogar schon mal WireGuard"}, {"id": 260, "start": 1729.1, "end": 1743.34, "text": "VPN gemacht mit Linux, oder hatten wir nur den Server auf WireGuard und Windows Client,"}, {"id": 261, "start": 1743.34, "end": 1761.5, "text": "genau WireGuard, zum Glück nicht WireGuard, da wäre das jetzt weg, kenn ich dich, hab"}, {"id": 262, "start": 1761.5, "end": 1779.02, "text": "ich nie ausprobiert, ok, ok, hab ich noch nicht gemacht, zumindest eine Sache, weil"}, {"id": 263, "start": 1779.02, "end": 1784.42, "text": "ich dazu kurz sagen will, das sind ja Dinge, die haben erstmal eigentlich gar nichts zu"}, {"id": 264, "start": 1784.42, "end": 1791.22, "text": "tun, was vielleicht ein bisschen was miteinander zu tun hat ist das hier, aber so für sich"}, {"id": 265, "start": 1791.22, "end": 1796.18, "text": "gesehen sind diese vier Sachen ja komplett unterschiedliche Dinge, das ist, dass du"}, {"id": 266, "start": 1796.18, "end": 1801.5, "text": "irgendwie externen DNS Namen hast für deine IP, dass du dich daheim einwählen kannst,"}, {"id": 267, "start": 1801.5, "end": 1805.62, "text": "das ist eventuell überflüssig, wenn man dünn DNS hat, braucht man eigentlich kleinen"}, {"id": 268, "start": 1805.62, "end": 1811.42, "text": "Cloudflare, ja und Let's Encrypt machst du dann eher dafür, ja kann ich mal machen,"}, {"id": 269, "start": 1811.42, "end": 1819.98, "text": "überlege ich mir, was man da machen könnte, ob ich da ein Video zu mache, weiß ich nicht,"}, {"id": 270, "start": 1819.98, "end": 1825.78, "text": "so technische, so zu übertrieben technische Videos gehen bei mir nicht so gut, weil ich"}, {"id": 271, "start": 1825.78, "end": 1830.38, "text": "hab halt auch viele, den kann ich da jetzt nicht irgendwie Linux-Commando-Zeile für"}, {"id": 272, "start": 1830.38, "end": 1836.02, "text": "10 Minuten zeigen, ich kann wunderbar Zusammenfassungen machen, so nach dem Motto, warum ist die aktuelle"}, {"id": 273, "start": 1836.02, "end": 1843.3, "text": "Sicherheitslücke schlimm und sowas, aber Viertelstunde Shell, das glaube ich ein bisschen"}, {"id": 274, "start": 1843.3, "end": 1847.7, "text": "zu hart, hast du schon mal eine eigene Platine gebaut, nein, also ich hab mir noch keine"}, {"id": 275, "start": 1847.7, "end": 1853.7, "text": "bestellt, also du meinst jetzt mit irgendeinem Designer-Tool und dann bei PCB-Way oder irgendwo"}, {"id": 276, "start": 1853.7, "end": 1860.9, "text": "den Kram bestellt, ne hab ich noch nicht, ich stöpsel den Kram immer selbst zusammen,"}, {"id": 277, "start": 1860.9, "end": 1865.98, "text": "was ich brauch, das ist ja meistens nur ein Controller plus ein paar Sensoren und fertig,"}, {"id": 278, "start": 1865.98, "end": 1870.7, "text": "eventuell, eventuell mal ein Widerstand irgendwo dazwischen oder so, oder das, ich glaub das"}, {"id": 279, "start": 1870.7, "end": 1874.9, "text": "komplizierteste, was ich gemacht hab ist zum Erkennen, ob mal eine Klingel gedrückt wurde,"}, {"id": 280, "start": 1874.9, "end": 1883.22, "text": "das war eine Mischung aus, da hab ich auch so ein ESP32 genommen und ich bin mir ganz"}, {"id": 281, "start": 1883.22, "end": 1891.34, "text": "sicher, ob ich da irgendwie ein Foto für hab und ein Magnetsensor, so ein kleines Furzding,"}, {"id": 282, "start": 1891.34, "end": 1895.22, "text": "das steckt am Telefon, dass man erkennt, wo, welche Gegensprechernagehörer abgenommen"}, {"id": 283, "start": 1895.22, "end": 1899.94, "text": "wird, so magnet ist das, das Ding ist der Hörer ist magnetisch, wenn man den abnimmt,"}, {"id": 284, "start": 1899.94, "end": 1908.42, "text": "geht das der Sensor mit und wenn es klingelt, hab ich einen Analog-Digital-Converter, der"}, {"id": 285, "start": 1908.42, "end": 1913.1, "text": "einfach die Spannung erkennt, weil die ist anders, wenn es klingelt, relativ easy gewesen,"}, {"id": 286, "start": 1913.1, "end": 1918.7, "text": "das war so das kompliziertste, was ich bisher gebaut hab und auch meine WLED Geschichten"}, {"id": 287, "start": 1918.7, "end": 1922.7, "text": "sind halt total simpel, ne, ich nehm, ich hab ne, also für die Weihnachtsbaumbeleuchtung"}, {"id": 288, "start": 1922.7, "end": 1926.82, "text": "hab ich einfach ne, haben wir sogar im Stream gemacht, hab ich so eine IP67-Box genommen,"}, {"id": 289, "start": 1926.82, "end": 1933.9, "text": "so ne Wasserabweisende oder, ja Wasserdichte kann man im Hausgebrauch schon sagen so, Wasserdichte"}, {"id": 290, "start": 1933.9, "end": 1942.42, "text": "Box, da ist ein ESP32 drin und an der Seite hab ich das LED Zeug rausgemacht, fertig,"}, {"id": 291, "start": 1942.42, "end": 1954.14, "text": "also da ist nix, ne, hab ich noch nicht gemacht, aber wie gesagt, kann ich machen, ne, das"}, {"id": 292, "start": 1954.14, "end": 1957.26, "text": "funktioniert leider nicht, ich wollt hier ein Video zu machen, ich sag euch, Leute,"}, {"id": 293, "start": 1957.26, "end": 1964.34, "text": "das Video wäre ultra-viral gegangen, ne, aber richtig, Massive-viral, Minecraft auf"}, {"id": 294, "start": 1964.34, "end": 1969.06, "text": "dem Staubsauger, allein das im Titel, ey, aber es funktioniert leider nicht, das Staubsauger"}, {"id": 295, "start": 1969.06, "end": 1973.86, "text": "ist, ich kanns euch zeigen, wer sich jetzt wundert, was ich mache, ich hab nen SSH Zugang"}, {"id": 296, "start": 1973.86, "end": 1985.14, "text": "auf meinen Staubsauger, da ist es ein bisschen langsam, nicht zu schnell, der braucht manchmal"}, {"id": 297, "start": 1985.14, "end": 1991.18, "text": "ein bisschen, aber irgendwann gehts dann, so und ich glaub ich hab sogar nen T-Max drauf,"}, {"id": 298, "start": 1991.18, "end": 1996.02, "text": "ne, hab ich nicht, bringt euch eh nix, müsste ja im gleichen W-Land sein, ich sag's nur,"}, {"id": 299, "start": 1996.02, "end": 2001.66, "text": "weil das gleich wenn die Leute ankommen, Max, Max, schnell wegmachen, leek, leek, leek,"}, {"id": 300, "start": 2001.66, "end": 2014.46, "text": "halt öhm, so, zumindest, auf dem Staubsauger ist ein Ubuntu 14.04, da blende ich mal das"}, {"id": 301, "start": 2014.46, "end": 2003.74, "text": "Windows-Logo ein, weil ich hab keinen Cagpipe-Ubuntu, der Chat ist schon in, ja, okay, aber"}, {"id": 302, "start": 2003.74, "end": 2015.02, "text": "Auf dem Staubsauger ist ein Ubuntu 14.04, da blende ich mal das Windows Logo ein, weil"}, {"id": 303, "start": 2015.02, "end": 2026.54, "text": "ich habe kein Kek-Chebantu."}, {"id": 304, "start": 2026.54, "end": 2027.54, "text": "Der Chat ist schon in."}, {"id": 305, "start": 2027.54, "end": 2028.54, "text": "Ja ok."}, {"id": 306, "start": 2028.54, "end": 2046.86, "text": "So und das Problem ist, das ist ein Quad-Core Staubsauger-Roboter, gab es nicht auch CPU-Info"}, {"id": 307, "start": 2046.86, "end": 2047.86, "text": "als Programm?"}, {"id": 308, "start": 2047.86, "end": 2048.86, "text": "Ne ne."}, {"id": 309, "start": 2048.86, "end": 2050.22, "text": "Aber das geht auf jeden Fall auch."}, {"id": 310, "start": 2050.22, "end": 2059.06, "text": "So das sind ARMv7, was auch immer und ich habe meine Zweifel, dass ich darauf eine Minecraft-Server"}, {"id": 311, "start": 2059.06, "end": 2060.06, "text": "zum Laufen kriege."}, {"id": 312, "start": 2060.06, "end": 2068.86, "text": "Vielleicht, vielleicht irgendein, der nicht auf Java-Basis ist."}, {"id": 313, "start": 2068.86, "end": 2072.26, "text": "Was ist denn ein guter Minecraft-Server, der nicht auf Java-Basis ist?"}, {"id": 314, "start": 2072.26, "end": 2077.22, "text": "Gibt es einen Minecraft-Server in Go oder irgendwas Self-Contained, das läuft garantiert?"}, {"id": 315, "start": 2077.22, "end": 2081.42, "text": "3-M, naja, viel RAM haben wir übrigens auch nicht."}, {"id": 316, "start": 2081.42, "end": 2088.62, "text": "Der kann höchstens, der kann, der kann eine 5x5 Welt generieren."}, {"id": 317, "start": 2088.62, "end": 2094.34, "text": "Ne Megahertz sieht man ja nicht, wie schnell er taktet."}, {"id": 318, "start": 2094.34, "end": 2104.34, "text": "Wie viel RAM brauchen der?"}, {"id": 319, "start": 2104.34, "end": 2131.22, "text": "RAM, JDK, gibt es einen, gibt es einen Go, Minecraft-Server, Go läuft ganz gut immer."}, {"id": 320, "start": 2131.22, "end": 2146.02, "text": "Ne, ne, Minecraft-Server in Go, das könnte vielleicht funktionieren."}, {"id": 321, "start": 2146.02, "end": 2159.5, "text": "Den da, hier Chat, Chat, ich glaube euch das jetzt, ich mache es jetzt mal auf, was ist,"}, {"id": 322, "start": 2159.5, "end": 2160.5, "text": "was ist das?"}, {"id": 323, "start": 2160.5, "end": 2166.54, "text": "Kuberit, Kuberit und das andere ist was, a tiny Minecraft-Server, ja ok, der ist von"}, {"id": 324, "start": 2166.54, "end": 2170.18, "text": "2015, ich glaube nicht, dass man da mit Minecraft drauf spielen kann, sinnvoll oder?"}, {"id": 325, "start": 2170.18, "end": 2177.9, "text": "Ah ja, das ist tatsächlich nicht verkehrt, das könnte man machen, so einen Minecraft-Server"}, {"id": 326, "start": 2177.9, "end": 2182.06, "text": "auf dem Staubsauger laufen lassen, das müsste ich dann quasi in irgendeiner Art und Weise"}, {"id": 327, "start": 2182.06, "end": 2197.5, "text": "cross compiling für Arm 7, weil ich glaube einen Go-Interpreter gibt es da drauf nicht."}, {"id": 328, "start": 2197.5, "end": 2212.58, "text": "Gibt es den, gibt es den für Arm zum Download?"}, {"id": 329, "start": 2212.58, "end": 2225.42, "text": "Download, wo ist der Download, ah hier, Linux, Raspberry Pi, ja gut, der Pi selbst, ich glaube"}, {"id": 330, "start": 2225.42, "end": 2235.42, "text": "nicht, dass das mit der Architektur kompatibel ist, vielleicht, hat Go überhaupt Arm 7,"}, {"id": 331, "start": 2235.42, "end": 2239.3, "text": "ich weiß es nicht, ich weiß es nicht, ich schreibe mir das einfach mal auf, das ist"}, {"id": 332, "start": 2239.3, "end": 2251.02, "text": "noch nicht abgehakt, Minecraft auf Staubsauger, ich brauche hier nur einen Mini-Server, wo"}, {"id": 333, "start": 2251.02, "end": 2257.22, "text": "man sich connecten kann zum aktuellen Client und dann laufe ich da ein bisschen rum und"}, {"id": 334, "start": 2257.22, "end": 2266.74, "text": "dann mache ich da ein Video drüber und erzähle, lull alter Staubsauger, neuer Server von GommeHD,"}, {"id": 335, "start": 2266.74, "end": 2269.38, "text": "ich habe keine Ahnung ob es den Kram noch gibt, der einzige Minecraft-Server der mir"}, {"id": 336, "start": 2269.38, "end": 2276.42, "text": "gerade so einfällt, gibt es Gomme, gibt es den noch, wahrscheinlich, der hat sich mal"}, {"id": 337, "start": 2276.42, "end": 2287.94, "text": "übelst gefreut, ich habe ihn mal auf Twitter angeschrieben, sinngemäß, ich habe ein bisschen"}, {"id": 338, "start": 2287.94, "end": 2295.62, "text": "über Java und Minecraft gelästert und da hat er, ich habe ihm gesagt, hier, cool, dass"}, {"id": 339, "start": 2295.62, "end": 2300.02, "text": "ihr euch das antut, Minecraft-Plugins zu basteln, weil ich meine, es ist Java irgendwie sowas"}, {"id": 340, "start": 2300.02, "end": 2306.62, "text": "und damals, das ist ja schon ein paar Jahre her, habe ich mich drauf geantwortet und gesagt,"}, {"id": 341, "start": 2306.62, "end": 2313.98, "text": "endlich sieht es mal einer und weiß es zu schätzen, ja, muss ich mal gucken, vielleicht"}, {"id": 342, "start": 2313.98, "end": 2329.7, "text": "kriegt man den Kram zum laufen, muss mich jetzt mit SAPUI5, ok, wie sieht das aus,"}, {"id": 343, "start": 2329.7, "end": 2346.9, "text": "ich ahne Schlimmes Leute, ok, wisst ihr wie das aussieht, das sieht aus wie Ultra-Cancer-Enterprise-Business-UI,"}, {"id": 344, "start": 2346.9, "end": 2352.66, "text": "aber auf modern gemacht, genauso sieht das aus, so wir haben unseren gleichen Crap wie"}, {"id": 345, "start": 2352.66, "end": 2361.66, "text": "immer, aber er sieht modern aus, wahrscheinlich, das ist genau der gleiche Shit wie früher,"}, {"id": 346, "start": 2361.66, "end": 2375.22, "text": "Pitform oder Pitform, naja, wenn schon würde ich die Self-Hausted-Variante nehmen, Saugchamp,"}, {"id": 347, "start": 2375.22, "end": 2390.62, "text": "Wieso das Wort gibt's, siehst du das nicht, sogar Google sagt, sogar der Duden sagt, dass"}, {"id": 348, "start": 2390.62, "end": 2415.42, "text": "es das gibt, siehst du, hier steht's, ist doch vollkommen normal, ja, das sehe ich übrigens"}, {"id": 349, "start": 2415.42, "end": 2423.5, "text": "genau so, Overwatch 2 hat absolut nichts gezeigt, was mich irgendwie an das Spiel interessieren"}, {"id": 350, "start": 2423.5, "end": 2431.18, "text": "sollte, ey, die sollten eine Kampagne machen, nicht dieses komische Speedrun-PvM Zeug, die"}, {"id": 351, "start": 2431.18, "end": 2435.22, "text": "haben sich so viel Mühe gegeben, sich eine Background-Story für Overwatch aus den Fingern"}, {"id": 352, "start": 2435.22, "end": 2440.98, "text": "zu saugen und ich finde, man merkt Overwatch schon ein bisschen anders, dass die Background-Story"}, {"id": 353, "start": 2440.98, "end": 2444.14, "text": "äußerst zusammengeschustert war, während der Kram eigentlich schon fast fertig war,"}, {"id": 354, "start": 2444.14, "end": 2448.06, "text": "aber ist ja letztendlich egal, sie haben sich so viel Mühe gegeben, da eine Background-Story"}, {"id": 355, "start": 2448.06, "end": 2453.38, "text": "draus zu stricken, warum machen die keine Kampagne, Blizzard kann echt gute Kampagnen"}, {"id": 356, "start": 2453.38, "end": 2460.9, "text": "machen, es konnte früher das zumindest, von den Leuten, die übrig sind, keine Ahnung,"}, {"id": 357, "start": 2460.9, "end": 2468.22, "text": "ja, Max, am Sonntag haben wir uns erstes, ja, schick noch mal Link, zeig noch mal her,"}, {"id": 358, "start": 2468.22, "end": 2472.86, "text": "ich weiß nicht mehr, ist das, hattest du nicht letztens mal im Stream gefragt, ob man nicht"}, {"id": 359, "start": 2472.86, "end": 2482.02, "text": "irgendwie, irgendwas mit MySQL, PHP, vorne Postgres oder so machen kann, ich hoffe ihr"}, {"id": 360, "start": 2482.02, "end": 2494.3, "text": "macht das nicht für euer Game so, wie du das davor hattest im Stream, ja, ist echt so,"}, {"id": 361, "start": 2494.3, "end": 2519.66, "text": "voll verkackt, ich mein die Paketdienste, ich hab damit kein Problem, aber das Finanzamt,"}, {"id": 362, "start": 2519.66, "end": 2543.02, "text": "ist echt nicht mein Fall, das ist wohl wahr, ja, aber IPsec läuft doch auch über IPv6,"}, {"id": 363, "start": 2543.02, "end": 2553.14, "text": "oder nicht, doch klar, ist IPv6 nicht sogar, ist IPv6, ist IPsec nicht sogar Bestandteil"}, {"id": 364, "start": 2553.14, "end": 2578.58, "text": "von IPv6, ich hab gleich den Chat durch, ich SSH mal kurz in meinen Staubsauger, das könnte"}, {"id": 365, "start": 2578.58, "end": 2587.06, "text": "ich tatsächlich, da könnte ich echt mal ein Video drüber machen, und zwar Videoideen,"}, {"id": 366, "start": 2587.06, "end": 2596.46, "text": "warum ich alles mit Custom Firmware flashe, geile Rechtschreibung, flashe, warum ich alles"}, {"id": 367, "start": 2596.46, "end": 2602.54, "text": "mit Custom Firmware, und dann zeige ich mitten im Video meinen geflashten Staubsauger, wo"}, {"id": 368, "start": 2602.54, "end": 2610.02, "text": "ich mich per SSH einlocke, und dann ist Mindblown bei den Leute auf YouTube, und ich weiß dann"}, {"id": 369, "start": 2610.02, "end": 2616.74, "text": "schon das erste Kommentar was kommt, Max jetzt mal ehrlich, wozu braucht man dann sowas,"}, {"id": 370, "start": 2616.74, "end": 2622.26, "text": "und da muss man eben erstmal sagen, das wichtigste ist erstmal, man braucht es, weil es geht,"}, {"id": 371, "start": 2622.26, "end": 2625.18, "text": "und danach kommt man dann erstmal mit den sinnvollen Argumenten, also das wichtigste"}, {"id": 372, "start": 2625.18, "end": 2629.58, "text": "erstmal, dass es funktioniert, dass es geht, ja, danach kommt da zum Beispiel sowas wie,"}, {"id": 373, "start": 2629.58, "end": 2634.26, "text": "ich brauch keine China Cloud, ich brauch nicht die komische Kack App vom Hersteller, wenn"}, {"id": 374, "start": 2634.26, "end": 2637.74, "text": "der Hersteller der Meinung ist irgendwas zu verkacken, betrifft es mich nicht, ich kann"}, {"id": 375, "start": 2637.74, "end": 2641.66, "text": "es offline verwenden, auch wenn mein Internet ausgefallen ist, ich kann es über den Browser"}, {"id": 376, "start": 2641.66, "end": 2645.34, "text": "fern bedienen und und und, also gibt es ein paar Punkte, aber das wichtigste ist erstmal,"}, {"id": 377, "start": 2645.34, "end": 2652.78, "text": "weil es geht, du würdest gerne deinen Tesla Custom Flaschen, frag mal bei Elon Musk auf"}, {"id": 378, "start": 2652.78, "end": 2664.7, "text": "Twitter, der antwortet doch auch random manchmal, vielleicht gibt er dir den Firmware Key, heute"}, {"id": 379, "start": 2664.7, "end": 2672.26, "text": "wieder Staubsauger hätten gar keinen Bock, korrekt, auch nicht, deswegen habe ich den"}, {"id": 380, "start": 2672.26, "end": 2680.3, "text": "ja auch einmal, einmal geflasht und jetzt ist gut, oder hat sich Deiner resettet, hat"}, {"id": 381, "start": 2680.3, "end": 2692.66, "text": "sich Deiner resettet, das haben die angeblich gefixt, das resetten, also meiner hat sich"}, {"id": 382, "start": 2692.66, "end": 2702.74, "text": "da den letzten Flash mit der Firmware von diesem Valle Tudow Fork nicht wieder resettet, ehrlich"}, {"id": 383, "start": 2702.74, "end": 2710.54, "text": "gesagt keine Ahnung, gibt es gibt es in.NET Core, Minecraft Server, ich meine das ist immer"}, {"id": 384, "start": 2710.54, "end": 2739.62, "text": "ein Microsoft, Minicase, Minecraft Server based on Orleans, Orleans, oh oui oui, weil das"}, {"id": 385, "start": 2739.62, "end": 2749.34, "text": "kann nicht, das hat auf jeden Fall einen Arm, einen Arm V7 Target,.NET Core, vielleicht"}, {"id": 386, "start": 2749.34, "end": 2759.42, "text": "vielleicht kriege ich den gestartet, ich brauche hier nur irgendwas, was läuft, was man sich"}, {"id": 387, "start": 2759.42, "end": 2779.46, "text": "connecten kann und dann ist gut, ja 2016 ist ein bisschen alt, da wird aktuelle Go Sachen"}, {"id": 388, "start": 2779.46, "end": 2799.94, "text": "nicht drauf kompilieren, ok das hatten wir alle schon, ich, also ich weiß, du fragst"}, {"id": 389, "start": 2799.94, "end": 2804.34, "text": "ja nicht ganz ohne eigenes Interesse, aber ich weiß nicht, wie ich das den Leuten gescheit"}, {"id": 390, "start": 2804.34, "end": 2807.86, "text": "verklickern soll, ich müsste das, auf YouTube müsste ich das in irgendein anderes Video"}, {"id": 391, "start": 2807.86, "end": 2816.1, "text": "einbetten, Dankeschön für den Sub, Nixor, zwei Monate, ich müsste das in ein alternatives"}, {"id": 392, "start": 2816.1, "end": 2826.02, "text": "Video einbetten, vielleicht hier rein, Moment wo da vorne, Video Ideen, ja warum ich alles"}, {"id": 393, "start": 2826.02, "end": 2838.38, "text": "custom firmware flasche, da könnte man das mal zeigen, na also wenn eine Sache sich definitiv"}, {"id": 394, "start": 2838.38, "end": 2844.1, "text": "nicht lohnt zum Bitcoin mine, dann ist es ein, weiß nicht was der gekostet hat, 400"}, {"id": 395, "start": 2844.1, "end": 2851.06, "text": "Euro Staubsauger zum Bitcoin mine, aber für Views ist das gut, das schreibe ich mir auf,"}, {"id": 396, "start": 2851.06, "end": 2863.34, "text": "der Desktop ist der beste Desktop, nur der hat ein, what the fuck, warum zum Teufel startet"}, {"id": 397, "start": 2863.34, "end": 2869.74, "text": "der Affinity Designer, wenn ich einfach nur, wenn ich einfach nur Eier eröffnen will,"}, {"id": 398, "start": 2869.74, "end": 2886.26, "text": "okay gibt es da, die muss man nicht verstehen, Minecraft Staubsauger, kann im Dunkel nicht"}, {"id": 399, "start": 2886.26, "end": 2893.54, "text": "schreiben richtig, Minecraft Staubsauger und Staubsauger Bitcoin Miner, das kann ich ehrlich"}, {"id": 400, "start": 2893.54, "end": 2901.62, "text": "gesagt einfach aus just for fun machen, einfach weil es Views generiert, ja, da hast du schon"}, {"id": 401, "start": 2901.62, "end": 2911.54, "text": "recht, hier wird sich erstmal eine Runde abgeleckt, alles klar, Chat ich hoffe euch geht es gut,"}, {"id": 402, "start": 2911.54, "end": 2919.42, "text": "ja, so ähm, oh sorry ja stimmt, natürlich Staubsauger innen, man muss ja korrekt sein,"}, {"id": 403, "start": 2919.42, "end": 2930.1, "text": "ich habe heute, mir wurde ein Video vorgeschlagen, auf YouTube von irgendeiner Diskussionssendung"}, {"id": 404, "start": 2930.1, "end": 2938.3, "text": "aus dem ZDF, ich habe da, ich habe es aufgemacht, habe mal reinge, reinge, gesappt, keine Ahnung"}, {"id": 405, "start": 2938.3, "end": 2943.42, "text": "wie man das nennt, das erste was ich in dem Video gehört habe war jemand, ich sage absichtlich"}, {"id": 406, "start": 2943.42, "end": 2951.3, "text": "jemand, weil ich weiß nicht, wie er oder sie angesprochen werden will, meinte so, ähm,"}, {"id": 407, "start": 2951.3, "end": 2956.02, "text": "es ging irgendwie um Bewerbung bei irgendeiner Firma und dann meinte die im Video so, äh,"}, {"id": 408, "start": 2956.02, "end": 2963.14, "text": "oder er oder keine Ahnung, also wenn diese Firma keine Diversity beauftragte oder äh,"}, {"id": 409, "start": 2963.14, "end": 2969.58, "text": "oder was hat er gesagt, keine Ahnung, dann bewerbe ich mich da sicher nicht, da habe"}, {"id": 410, "start": 2969.58, "end": 2975.02, "text": "ich mir auch gedacht, ey, wir haben echt schon ganz schön den Luxus, wenn man sich das aussuchen"}, {"id": 411, "start": 2975.02, "end": 2979.98, "text": "kann, also, da muss man entweder sehr begehrt sein, dass man die Möglichkeit hat sich das"}, {"id": 412, "start": 2979.98, "end": 2988.7, "text": "auszusuchen, oder äh, sehr überzeugt, ja, ja okay, also ich sage nicht, dass das unwichtig"}, {"id": 413, "start": 2988.7, "end": 2992.7, "text": "ist, aber es wäre für mich gut, ich meine ich kann das auch nicht so wahnsinnig gut beurteilen,"}, {"id": 414, "start": 2992.7, "end": 2998.78, "text": "ich bin ja was diese Sache angeht, ich bin ja das was diese Sache angeht, ja so, der,"}, {"id": 415, "start": 2998.78, "end": 3006.18, "text": "absolut nur nach 15, ja, ich bin, ich bin weiß, männlich, alt, heterosexuell, kein"}, {"id": 416, "start": 3006.18, "end": 3011.7, "text": "Veganer, nicht schwul, ähm, also ich darf ja bei sowas gar nicht, habe ich noch was"}, {"id": 417, "start": 3011.7, "end": 3017.34, "text": "vergessen, ich darf ja bei sowas gar nicht mitreden, ja, aber die Aussage fand ich schon"}, {"id": 418, "start": 3017.34, "end": 3020.94, "text": "ein bisschen hart, so nach dem Motto, wenn die keine Diversity Abteilung haben, dann"}, {"id": 419, "start": 3020.94, "end": 3025.5, "text": "gehe ich da nicht hin, ich meine, eine Firma muss nicht die Leute wie Kacke behandeln,"}, {"id": 420, "start": 3025.5, "end": 3029.62, "text": "weil sie keine Diversity Abteilung haben, also eine gute Firma, guckt, dass sie sich"}, {"id": 421, "start": 3029.62, "end": 3035.58, "text": "um die Mitarbeiter sinnvoll kümmert, und da zählt sowas auch rein, ohne dass man eine"}, {"id": 422, "start": 3035.58, "end": 3043.82, "text": "eigene Abteilung braucht, aber gut, jeder wie er meint, ja, ach ja, kein Veganer, das"}, {"id": 423, "start": 3043.82, "end": 3048.5, "text": "stimmt, ja, bin ich, kein, kein Veganer bin ich auch, ja, ich bin, ich bin ein Om, wie"}, {"id": 424, "start": 3048.5, "end": 3058.02, "text": "heißt das, Omnivore, Allesfresser, Omnivore, genau, ein weißer Omnivore-Zis-Mann, korrekt,"}, {"id": 425, "start": 3058.02, "end": 3066.66, "text": "du hast es erkannt, ihr habt es erkannt, ähm, wieso ist das eine, tatsächlich, das habe"}, {"id": 426, "start": 3066.66, "end": 3069.74, "text": "ich mir schon aufgeschrieben, das ist eine gute Idee, hast du schon an der Fritz, nein,"}, {"id": 427, "start": 3069.74, "end": 3072.74, "text": "das habe ich noch nicht gemacht, weil ich ganz ehrlich sagen muss, der Sache traue"}, {"id": 428, "start": 3072.74, "end": 3076.22, "text": "ich nicht so gerne, es gibt ja nur dieses Fritz, Fritz, oder wie man das ausspricht,"}, {"id": 429, "start": 3076.22, "end": 3089.22, "text": "ähm, und das habe ich schon nicht gemacht, ich traue der Sache nicht, weil ich will meine"}, {"id": 430, "start": 3089.22, "end": 3095.46, "text": "Fritzbox, eigentlich verwende ich meine Fritzbox nur für VoIP, also für Telefon deckt, das"}, {"id": 431, "start": 3095.46, "end": 3102.42, "text": "war es, und ich sehe den Sinn von der krassten Firma da grad nicht, wirklich, zumal die Standard-Fritz-Software"}, {"id": 432, "start": 3102.42, "end": 3106.82, "text": "nicht dafür bekannt ist, oder so, irgendwie nach Hause telefonieren zu würden, nach Hause"}, {"id": 433, "start": 3106.82, "end": 3120.9, "text": "Telefonieren zu würden, nee, Scheißsatz, ist nicht dafür bekannt, nach Hause zu telefonieren,"}, {"id": 434, "start": 3120.9, "end": 3123.9, "text": "das stimmt, wenn man WireGuard verwenden will, dann ist es tatsächlich sinnvoll, wobei ich"}, {"id": 435, "start": 3123.9, "end": 3129.74, "text": "das auch nicht, ganz ehrlich, würde ich VPN verwenden wollen, dann würde ich nicht meine"}, {"id": 436, "start": 3129.74, "end": 3134.74, "text": "Fritzbox flaschen für WireGuard, sondern, ich würde mir den Raspberry Pi dahinter stellen,"}, {"id": 437, "start": 3134.74, "end": 3139.66, "text": "äh, am besten noch in der eigenen DMZ, und ich rede nicht von dieser Standard-DMZ-Leiter"}, {"id": 438, "start": 3139.66, "end": 3143.46, "text": "alles auf den Server weiter, wie das in manchen Routern oder Fritzbox drin ist, Fritzbox weiß"}, {"id": 439, "start": 3143.46, "end": 3146.98, "text": "ich nicht, aber viele Routern, sondern, angenommen, man hätte da noch wirklich was dazwischen"}, {"id": 440, "start": 3146.98, "end": 3153.06, "text": "stehen, dass man dann quasi nur dort hinkommt von außen, und erst wenn man sich dort autentifiziert"}, {"id": 441, "start": 3153.06, "end": 3162.18, "text": "hat, weiter, ja, äh, schau mal, das Raspberry Pi-Binary von vorhin da läuft, äh, zeig,"}, {"id": 442, "start": 3162.18, "end": 3166.58, "text": "schick noch, add Wupplos noch mal mit dem Link, ich weiß nicht mal, welches das war,"}, {"id": 443, "start": 3166.58, "end": 3192.5, "text": "Chat ist schon ein bisschen her, dann probiere ich das aus, ah, ja, ja, Designer, ah, ok,"}, {"id": 444, "start": 3192.5, "end": 3198.26, "text": "man kann das gar nicht mehr flaschen, ja, das habe ich mir auch gedacht, ich mein, na,"}, {"id": 445, "start": 3198.26, "end": 3211.42, "text": "egal, soll jeder machen, was er will, das stimmt, wenn es nach, äh, Banks pro Monat"}, {"id": 446, "start": 3211.42, "end": 3221.18, "text": "geht, dann, äh, würde ich da auch dazu zählen, ja, da kann ich nicht, da spiele ich nicht"}, {"id": 447, "start": 3221.18, "end": 3227.46, "text": "in der ersten Liga mit, ja, bei mir liegt es aber, ich merke das ganz extrem, ich bin"}, {"id": 448, "start": 3227.46, "end": 3235.58, "text": "so ultra faul geworden, was zwischenmenschliche Interaktionen angeht, äh, es ist der Wahnsinn,"}, {"id": 449, "start": 3235.58, "end": 3241.1, "text": "ich sag, das mit dem Weihnachtsgrill habe ich euch ja schon oft genug erzählt, sobald"}, {"id": 450, "start": 3241.1, "end": 3248.7, "text": "es um zwischenmenschliche Interaktionen geht, drücke ich mich davor, ja, ich hatte schon"}, {"id": 451, "start": 3248.7, "end": 3253.86, "text": "so oft mal irgendwelche Dinge, was weiß ich, dass man sich, dass man sich im Zug vielleicht"}, {"id": 452, "start": 3253.86, "end": 3257.94, "text": "mal kurz unterhalten hat, weil irgendwie was war, dass man sich so ganz gut, ganz nett"}, {"id": 453, "start": 3257.94, "end": 3263.54, "text": "gefunden hat, dass man sich, also ich mal ein bisschen angeguckt hat und so und eigentlich"}, {"id": 454, "start": 3263.54, "end": 3266.82, "text": "wäre das dann so die Situation, wo man das Ganze mal ein bisschen abklopfen könnte und"}, {"id": 455, "start": 3266.82, "end": 3273.02, "text": "mal, irgendwie versuchen könnte mal ein Gespräch zu starten und so, aber wisst ihr, ich bin"}, {"id": 456, "start": 3273.02, "end": 3278.74, "text": "einfach übelster Kacknup, was sowas angeht und ich bin faul as fuck, also sprich, bei"}, {"id": 457, "start": 3278.74, "end": 3288.34, "text": "mir läuft es immer so, irgendwas, äh, also es ist egal ob auf dem Weg zur Arbeit, im"}, {"id": 458, "start": 3288.34, "end": 3295.14, "text": "Zug, sonst wo, irgendwas, wo man sagen könnte, hey, da müsste man jetzt mal zwischenmenschlich"}, {"id": 459, "start": 3295.14, "end": 3299.78, "text": "irgendwie eine Interaktion starten, lass dich bleiben, ja, ich hatte schon öfters mal,"}, {"id": 460, "start": 3299.78, "end": 3304.58, "text": "es sitzt jemand im Zug, man lächelt sich mal zwischendurch an gegenseitig, guckt mal"}, {"id": 461, "start": 3304.58, "end": 3309.3, "text": "wieder weg, guckt hin, andere guckt wieder zurück, ich bin so bescheuert, ich hätte"}, {"id": 462, "start": 3309.3, "end": 3313.58, "text": "schon so oft einfach mal was sagen können und natürlich hätte es dann zu 90% auch"}, {"id": 463, "start": 3313.58, "end": 3318.46, "text": "nichts, nichts, ja, wäre dann nichts draus geworden, aber ich mein, man hätte es wenigstens"}, {"id": 464, "start": 3318.46, "end": 3326.9, "text": "probieren können, aber bei mir läuft es dann eher so, ich lächel dann ein bisschen, guck"}, {"id": 465, "start": 3326.9, "end": 3331.5, "text": "ein bisschen hin und zurück, ja, Plinzel, Plinzel, alles gut und dann, wenn es darum"}, {"id": 466, "start": 3331.5, "end": 3336.06, "text": "geht, dass man jetzt was machen müsste, ja, zum Beispiel, was weiß ich, sag mal, weil"}, {"id": 467, "start": 3336.06, "end": 3341.06, "text": "der Zug am Hauptbahnhof angekommen ist oder so, oder weil irgendwas anderes ist, da guck"}, {"id": 468, "start": 3341.06, "end": 3350.78, "text": "ich auf mein Handy und geh raus, ich mach da einfach nix, ja, ist ernsthaft, ist echt"}, {"id": 469, "start": 3350.78, "end": 3361.42, "text": "so und ich hatte manchmal, manchmal, Alter, das ist mir immer, es gibt ja kaum was unangenehmeres"}, {"id": 470, "start": 3361.42, "end": 3367.02, "text": "für mich, also unangenehm, wie soll man sagen, unangenehm ist das falsche Wort, kaum"}, {"id": 471, "start": 3367.02, "end": 3379.62, "text": "was, wie nennen wir das jetzt, nervenaufreibenderes, wie schöne Mädels, die einen angucken, längere"}, {"id": 472, "start": 3379.62, "end": 3385.7, "text": "Zeit, dann fühlt man sich selber unter Zugzwang, man muss jetzt was machen und ich bin was"}, {"id": 473, "start": 3385.7, "end": 3392.22, "text": "zwischenwöchentlichen Sachen angeht, so ultra faul und dementsprechend fehlt mir auch total"}, {"id": 474, "start": 3392.22, "end": 3396.26, "text": "die Übung, was sowas angeht, wenn ich was sage, ist es meistens was total bescheuertes,"}, {"id": 475, "start": 3396.26, "end": 3410.94, "text": "ja, und dann, und dann, geht ja noch schlimmer, und dann, wenn es mal wirklich so ist, dass"}, {"id": 476, "start": 3410.94, "end": 3417.74, "text": "es nicht an mir hängt, ja, also zum Beispiel, wenn man sich schon kennt oder anderweitig"}, {"id": 477, "start": 3417.74, "end": 3422.06, "text": "zwei Ecken kennt oder so, also dass man nicht so wirklich so komplett das Eis brechen muss,"}, {"id": 478, "start": 3422.06, "end": 3426.78, "text": "weil man sich ja eigentlich schon ein paar mal begegnet ist und so, und wenn dann sogar"}, {"id": 479, "start": 3426.78, "end": 3434.98, "text": "noch vorkommt, dass die andere Seite da quasi versucht noch den ersten Schritt zu machen,"}, {"id": 480, "start": 3434.98, "end": 3440.5, "text": "was macht der Max dann, der macht dann erstmal kurz mit, aber sobald das ich irgendwie anstrengen"}, {"id": 481, "start": 3440.5, "end": 3452.02, "text": "müsste dafür, melde das ich einfach nicht mehr, das ist ganz schlimm bei mir, das ist"}, {"id": 482, "start": 3452.02, "end": 3457.14, "text": "ganz schlimm, sobald ich irgendwas machen müsste, von mir heraus, für irgendwelche"}, {"id": 483, "start": 3457.14, "end": 3465.62, "text": "zwischenmenschlichen Interaktionen, gerade mit Mädels, ich mach einfach nix, ich kann"}, {"id": 484, "start": 3465.62, "end": 3474.34, "text": "das schlecht beschreiben, warum, es ist merkwürdig, ja, wie gesagt, mit dem Weihnachtsgrill war"}, {"id": 485, "start": 3474.34, "end": 3483.06, "text": "es doch genau das gleiche, und nein, ich hab ihn echt nicht gesagt, Grill, natürlich"}, {"id": 486, "start": 3483.06, "end": 3497.02, "text": "nicht, das hat ja eigentlich ganz gut funktioniert, aber wir haben uns sogar Sachen zu Weihnachten"}, {"id": 487, "start": 3497.02, "end": 3505.82, "text": "geschenkt, davon nicht vergessen, also ich würd sagen, die war da nicht abgeneigt der"}, {"id": 488, "start": 3505.82, "end": 3514.74, "text": "ganzen Geschichte, und was hab ich gemacht, danach, ich hab mich einfach 3 Monate nicht"}, {"id": 489, "start": 3514.74, "end": 3522.94, "text": "gemeldet, nicht weil die hässlich wäre, oder sie mir nicht gefallen hätte, ich keinen"}, {"id": 490, "start": 3522.94, "end": 3529.3, "text": "Bock auf die habe, einfach nur, weil ich keinen Bock habe, mit anderen Menschen zu"}, {"id": 491, "start": 3529.3, "end": 3536.1, "text": "interagieren, und weil ich nicht nur das, das Problem ist, ich finde das anstrengend,"}, {"id": 492, "start": 3536.1, "end": 3546.7, "text": "und das ist eine Art von anstrengend, vor der ich mich gerne drücke, was war das Geschenk,"}, {"id": 493, "start": 3546.7, "end": 3557.14, "text": "hab ich das nicht sogar schonmal erzählt im Stream, also ich hab ja ein paar Paare, ich"}, {"id": 494, "start": 3557.14, "end": 3571.86, "text": "hab ja ein paar davon geschenkt, mit Lavendelduft, exzellent, top die da, irgendwas mit Lavendelduft,"}, {"id": 495, "start": 3571.86, "end": 3577.18, "text": "und die, und jetzt passt mal auf, eigentlich, wenn eine Mädel sowas schenkt, da müsste"}, {"id": 496, "start": 3577.18, "end": 3587.22, "text": "man eigentlich gerade als Techniker, quasi ausflippen und sagen, jawoll, das ist die"}, {"id": 497, "start": 3587.22, "end": 3593.94, "text": "Frau fürs Leben, wie der Asitoni gesagt hat, der hat mir ein Vera Torx Set geschenkt,"}, {"id": 498, "start": 3593.94, "end": 3606.78, "text": "ok ich geb zu, natürlich nicht von sich aus, ich hab das geteased, das da, ne, hä, ja"}, {"id": 499, "start": 3606.78, "end": 3616.94, "text": "sowas da, das, das was ihr, das was ihr hier auf Twitter seht, äh, nicht Twitter, Twitch,"}, {"id": 500, "start": 3616.94, "end": 3626.7, "text": "was habe ich denn, Twitter, nicht Twitch, ah, äh, das da, guck mal hier, da oben, Torx"}, {"id": 501, "start": 3626.7, "end": 3643.46, "text": "Set, tja, so, und, ähm, also eigentlich ist es schonmal, muss ja erstmal hinkriegen,"}, {"id": 502, "start": 3643.46, "end": 3649.58, "text": "ja, muss ja erstmal jemand finden, der das macht, so, und, was hab ich gemacht danach,"}, {"id": 503, "start": 3649.58, "end": 3654.86, "text": "ich, es war noch nicht, das, das, das, das lief wieder schlecht, noch war das irgendwie"}, {"id": 504, "start": 3654.86, "end": 3660.78, "text": "unangenehm, doch sonst was, das war eigentlich nice, ja, und was hab ich gemacht, mich einfach"}, {"id": 505, "start": 3660.78, "end": 3681.82, "text": "drei Monate nicht mehr gemeldet, weiß ich, war mir schon zu anstrengend, naja, ok, ach,"}, {"id": 506, "start": 3681.82, "end": 3687.9, "text": "so, wie, wie, wie das an der, an der Wand, chat klickt euch mal ein hier, ich mach ja"}, {"id": 507, "start": 3687.9, "end": 3694.86, "text": "auch die ein oder andere doofe Sprüche, aber manche Sachen müssen nicht sein, so, ähm,"}, {"id": 508, "start": 3694.86, "end": 3713.5, "text": "das Set an der Wand, das war, ja, aber, aber ein fertiges Set, äh, ich glaube, das Set"}, {"id": 509, "start": 3713.5, "end": 3717.42, "text": "war das, also das, da ist natürlich nicht das Werkzeug dabei, zumal das Werkzeug wahrscheinlich"}, {"id": 510, "start": 3717.42, "end": 3724.9, "text": "sagt, was, was da am Start ist, keine Ahnung, ähm, dieses, dieses Set war das hier, mit"}, {"id": 511, "start": 3724.9, "end": 3729.02, "text": "den Haken, den Halterungen und, äh, dieser doppelten, doppelten Wand, ich hab aber die"}, {"id": 512, "start": 3729.02, "end": 3746.62, "text": "untere, das untere Regal nicht dran, kann man das noch reaktivieren, keine Ahnung, eventuell,"}, {"id": 513, "start": 3746.62, "end": 3751.62, "text": "das Problem, was ich dabei hab, ist, dass ich mir natürlich auch echt doof vorkomme,"}, {"id": 514, "start": 3751.62, "end": 3758.14, "text": "da ich, ey, ich mein, drei Monate nicht gemeldet, by the way, Leute, Leute, Leute, man könnte"}, {"id": 515, "start": 3758.14, "end": 3765.14, "text": "das vielleicht durcheinander bringen, ich rede nicht von letztem Weihnachten, sondern"}, {"id": 516, "start": 3765.14, "end": 3774.26, "text": "von vorletztem Weihnachten, also das sind quasi nicht drei Monate, jetzt rum, sondern,"}, {"id": 517, "start": 3774.26, "end": 3795.9, "text": "ähm, 15 Monate, also, geht doch noch mehr, wie gestern, ne, ähm, nein, keine Ahnung,"}, {"id": 518, "start": 3795.9, "end": 3800.14, "text": "dass ich Streamen ja noch, keine Ahnung, dass ich YouTube Zeugs mach oder so, ich erzähl"}, {"id": 519, "start": 3800.14, "end": 3807.66, "text": "das offline nicht viel, also auf der Arbeit wissen es ein paar Leute, dass ich YouTube"}, {"id": 520, "start": 3807.66, "end": 3811.06, "text": "Zeug mach, mein ehemaliger Chef weiß es auf jeden Fall, weil da hab ich ja die ganze"}, {"id": 521, "start": 3811.06, "end": 3819.78, "text": "Teilzeitgeschichte damals eingereicht, ähm, Herr Endpunkt weiß es, ein paar Azubis, ein"}, {"id": 522, "start": 3819.78, "end": 3824.14, "text": "paar Azubis, ich glaub insgesamt waren es drei Azubis jetzt, mit Herr Endpunkt zusammen,"}, {"id": 523, "start": 3824.14, "end": 3831.66, "text": "die das erkannt haben, zwei einfach so, der eine ist Anwendungsentwickler, der meinte,"}, {"id": 524, "start": 3831.66, "end": 3838.54, "text": "der war mal einen Tag bei mir und, ähm, die haben mich dann so vorgestellt, ja, hier,"}, {"id": 525, "start": 3838.54, "end": 3843.22, "text": "du kommst jetzt mal einen Tag zu Max und da zeigt der mal ein bisschen hier Linux Sachen"}, {"id": 526, "start": 3843.22, "end": 3850.14, "text": "und so, da sag ich, ja, passt schon, also da saß er dann bei mir am Platz und meinte,"}, {"id": 527, "start": 3850.14, "end": 3851.14, "text": "ah, du bist der Max?"}, {"id": 528, "start": 3851.14, "end": 3854.86, "text": "Ja, ich bin der Max, der meinte so, seine Stimme kommt mir bekannt vor, aber mach dir"}, {"id": 529, "start": 3854.86, "end": 3859.06, "text": "nichts draus, ich sag's keinem, da war schon klar, war schon klar, dass der das erkannt"}, {"id": 530, "start": 3859.06, "end": 3866.54, "text": "hat, hab ich mir gemacht, ach so, also, ich hab's nicht, also ich hab das nicht zugegeben,"}, {"id": 531, "start": 3866.54, "end": 3870.38, "text": "weil, wenn ich das direkt konfirme, dann weiß der ja Bescheid, aber der hat auch so Bescheid"}, {"id": 532, "start": 3870.38, "end": 3877.06, "text": "gewusst, hatten wir den anderen, der hat's nach ein paar Tagen gemerkt, der hat gemeint,"}, {"id": 533, "start": 3877.06, "end": 3884.74, "text": "ja, jetzt, klar, ähm, der hat früher immer Battlefield-Videos und so geguckt und ja,"}, {"id": 534, "start": 3884.74, "end": 3887.82, "text": "Herr Endpunkt, Herr Endpunkt weiß das auch, nee, aber ansonsten weiß das ehrlich gesagt"}, {"id": 535, "start": 3887.82, "end": 3893.46, "text": "auf der Arbeit kaum einer und dabei will ich's ehrlich gesagt auch belassen, ich sag"}, {"id": 536, "start": 3893.46, "end": 3898.94, "text": "ja eigentlich nie was direkt über die Arbeit, also jetzt nie mit Namenslernung und so was,"}, {"id": 537, "start": 3898.94, "end": 3903.74, "text": "aber klar, ich lässt da schon mal manchmal ab und ab und zu haben wir ja auch mal den"}, {"id": 538, "start": 3903.74, "end": 3907.42, "text": "ein oder anderen im Chat, das fällt euch vielleicht nicht so auf, aber ich, wenn ich die Namen"}, {"id": 539, "start": 3907.42, "end": 3914.5, "text": "sehe, wo ich weiß, dass die mal bei uns gearbeitet haben oder noch bei uns arbeiten und die wissen"}, {"id": 540, "start": 3914.5, "end": 3921.78, "text": "sofort, wen ich meine, wenn ich über manche Leute ein bisschen lester und ich will nicht,"}, {"id": 541, "start": 3921.78, "end": 3926.2, "text": "dass das irgendwie bekannt wird, dass dann Leute mitkriegen, die's nicht mitkriegen"}, {"id": 542, "start": 3926.2, "end": 3949.18, "text": "sollen, ja, Fritzboxen bekommt man nicht kaputt, da hab ich meine Zweifel, richtig, korrekt,"}, {"id": 543, "start": 3949.18, "end": 3954.02, "text": "deswegen find ich die Fritzbox im Auslieferungszustand auch ganz praktisch, also Asterix ist eines"}, {"id": 544, "start": 3954.02, "end": 3959.66, "text": "der ekligsten Sachen zu konfigurieren aller Zeiten, wer sich das freiwillig, also generell"}, {"id": 545, "start": 3959.66, "end": 3966.46, "text": "man muss sagen, VoIP, SIP, diese ganze Geschichte ist ein absolutes Minenfeld, das macht keiner"}, {"id": 546, "start": 3966.46, "end": 3972.3, "text": "freiwillig, gibt's Leute von euch, die euer Geld mit Telefonanlagen und VoIP und SIP Sachen"}, {"id": 547, "start": 3972.3, "end": 3985.66, "text": "verdienen, es ist abfuck, hoch 10, ich glaube das hier hattest du, Raspberry Pi, ich probier's"}, {"id": 548, "start": 3985.66, "end": 3990.98, "text": "mal, ich probier's mal, ich geh mal auf meinen Staubsauger und wir führen das mal aus, probier"}, {"id": 549, "start": 3990.98, "end": 4005.22, "text": "wir mal aus, ich hatte ja nix, Raspberry Pi Build, save, hallo, save, zack, CD, download,"}, {"id": 550, "start": 4005.22, "end": 4011.74, "text": "zack, MkDeer, Minecraft, wir probieren das jetzt aus, ob das auf dem Staubsauger läuft,"}, {"id": 551, "start": 4011.74, "end": 4021.38, "text": "Xfz, ich kann heute echt nicht schreiben, aber gut, hier ist auch dunkel, Cube, CubeRite,"}, {"id": 552, "start": 4021.38, "end": 4025.34, "text": "boah, the fuck, ist hier überhaupt ein Tarn drauf, tatsächlich, könnt ihr sogar so rüber"}, {"id": 553, "start": 4025.34, "end": 4034.5, "text": "kopieren, wie groß ist denn das, da hab ich auch keinen Platz für, naja, geht doch eigentlich,"}, {"id": 554, "start": 4034.5, "end": 4047.86, "text": "13 MB, wie sieht's mit Platten aus, Plattenplatz auf dem Staubsauger, ich hab noch 135 MB, kann"}, {"id": 555, "start": 4047.86, "end": 4058.82, "text": "man das einfach jetzt so starten, achso, das ist ja ein Raspberry Pi Build, wie viel RAM"}, {"id": 556, "start": 4058.82, "end": 4079.46, "text": "braucht das, wie viel RAM braucht das, Memory, ok, ich kopier das jetzt einfach mal rüber,"}, {"id": 557, "start": 4079.46, "end": 4089.42, "text": "ne, ich probier das jetzt, Leute, wir probieren das jetzt nicht im Stream aus, die Katz sitzt"}, {"id": 558, "start": 4089.42, "end": 4093.62, "text": "drüben im Wohnzimmer und schläft, wenn das Staubsauger jetzt abkackt und sich rebooted,"}, {"id": 559, "start": 4093.62, "end": 4108.34, "text": "macht der dann Krach und dann dreht die durch, ne, das kann ich jetzt nicht machen, ja, ich"}, {"id": 560, "start": 4108.34, "end": 4128.58, "text": "probier das aber offline aus, ach komm, Cube, auf, ups, wie, Moment, wie groß, wie groß"}, {"id": 561, "start": 4128.58, "end": 4152.3, "text": "waren das jetzt, 13 MB, so, wir sind hier oben auf dem Staubsauger, wohlgemerkt, ok,"}, {"id": 562, "start": 4152.3, "end": 4161.62, "text": "der Flash ist schon mal schnell, ok, ich brauch ein zweites Login, um das zu killen, das ist"}, {"id": 563, "start": 4161.62, "end": 4170.14, "text": "Minecraft, so, kann man das jetzt starten, nope, hätte ich mir jetzt kopieren auch sparen"}, {"id": 564, "start": 4170.14, "end": 4197.78, "text": "können, nicht neu genug, nope, keine Chance, nope, geht nicht, ja, aber du lernst aus deinen"}, {"id": 565, "start": 4197.78, "end": 4208.98, "text": "Fehlern, hoffe ich, ja, ey, wenn es danach geht, habe ich echt kein Problem damit, wenn"}, {"id": 566, "start": 4208.98, "end": 4214.74, "text": "ich mir die ganzen Möchtegern-Alpha-Leute angucke, die können gerne unter sich alpha-risieren,"}, {"id": 567, "start": 4214.74, "end": 4232.78, "text": "ja, das ist die Frage, ganz ehrlich, eigentlich nicht, Bauchgefühl will ich eigentlich nicht,"}, {"id": 568, "start": 4232.78, "end": 4238.26, "text": "eigentlich will ich meine Ruhe, ich will eigentlich möglichst wenig mit anderen Leuten was zu"}, {"id": 569, "start": 4238.26, "end": 4245.7, "text": "tun haben, ich weiß, es klingt immer widersprüchlich, wenn ich das sage und mir irgendwie zehntausende"}, {"id": 570, "start": 4245.7, "end": 4250.5, "text": "Leute auf YouTube zugucken und hier auch ein paar Leute zugucken, aber das ist was anderes,"}, {"id": 571, "start": 4250.5, "end": 4258.46, "text": "ob ich hier sitze und schwätze und ihr hört euch das an, oder ob ich Leute physisch bei"}, {"id": 572, "start": 4258.46, "end": 4268.7, "text": "mir am Start habe, ja, nee, ehrlich gesagt, manchmal denke ich mir wäre schon nice, ich"}, {"id": 573, "start": 4268.7, "end": 4273.26, "text": "komme ja auch langsam in das Alter, wo man sich mal so Gedanken machen sollte, ob man"}, {"id": 574, "start": 4273.26, "end": 4278.74, "text": "nicht vielleicht doch irgendwann mal Nachwuchs zeugen will, aber will ich nicht, ich mag"}, {"id": 575, "start": 4278.74, "end": 4299.7, "text": "Kinder absolut gar nicht, ja, also was ich nice finden würde, aber das wird es einfach"}, {"id": 576, "start": 4299.7, "end": 4305.82, "text": "so nicht geben, wenn man jemanden hätte, mit dem man sich gut versteht, mit dem das"}, {"id": 577, "start": 4305.82, "end": 4315.5, "text": "auch auf einer Wellenlänge ist, ja, allerdings schön weiterhin beide ihre eigene Wohnung"}, {"id": 578, "start": 4315.5, "end": 4322.14, "text": "oder ich halte hier in der Hütte, ja, man kann natürlich am Wochenende mal was machen"}, {"id": 579, "start": 4322.14, "end": 4328.58, "text": "und sich unter der Woche mal sehen und auch mal dort übernachten und so, das ist alles"}, {"id": 580, "start": 4328.58, "end": 4336.18, "text": "kein Ding, aber ich stelle es mir unglaublich nervig vor, ich weiß ich bin da auch nicht"}, {"id": 581, "start": 4336.18, "end": 4341.06, "text": "normal, vielleicht liegt es auch einfach daran, dass die Richtige noch nicht am Start war"}, {"id": 582, "start": 4341.06, "end": 4347.18, "text": "dafür, keine Ahnung, ich stelle es mir unglaublich nervig vor den ganzen Tag jemanden am Start"}, {"id": 583, "start": 4347.18, "end": 4353.78, "text": "zu haben, ey, das ist der Wahnsinn, ich kriege ja schon bei manchen Leuten, wenn ich die"}, {"id": 584, "start": 4353.78, "end": 4368.9, "text": "nur online sehen muss, schon Anfälle, ja, ach ja, ne, ich bin da nicht normal, also"}, {"id": 585, "start": 4368.9, "end": 4374.42, "text": "irgendjemand meinte mal, ich soll einen Autismus-Test machen, was ich, ich habe eher andere Probleme,"}, {"id": 586, "start": 4374.42, "end": 4385.14, "text": "naja, vor allem das witzige ist, ich weiß nicht warum, ne, ich mag einfach andere Leute"}, {"id": 587, "start": 4385.14, "end": 4393.26, "text": "nicht, es ist echt schwierig zu erklären, ich habe da aber auch überhaupt keinen Hang"}, {"id": 588, "start": 4393.26, "end": 4404.14, "text": "dazu, irgendwie mich mit anderen Leuten auszutauschen, zu treffen, das einzige, was, also 90% der"}, {"id": 589, "start": 4404.14, "end": 4409.9, "text": "Leute, meine Mitmenschen nerven mich aus den unterschiedlichsten Gründen, ja, weil sie"}, {"id": 590, "start": 4409.9, "end": 4417.46, "text": "zu viel rumlabern, weil sie dummes Zeug erzählen, weil sie dumm sind und scheiße labern, weil"}, {"id": 591, "start": 4417.46, "end": 4422.62, "text": "sie laufen irgendwas von einem Wollen, weil es gibt zig Gründe, also 90% der Leute gehen"}, {"id": 592, "start": 4422.62, "end": 4431.1, "text": "mir auf den Sack, der Chat nicht, weil, weil das hier ist ja umgedreht, ich labere hier"}, {"id": 593, "start": 4431.1, "end": 4436.14, "text": "ja mit euch im Endeffekt und ihr begrenzt mit mir, das ist ok, das ist in Ordnung, also"}, {"id": 594, "start": 4436.14, "end": 4443.98, "text": "das, ja, das nervt mich, ja, also wie gesagt, 90% der Leute, der Chat ausgenommen, den Chat"}, {"id": 595, "start": 4443.98, "end": 4448.86, "text": "finde ich so geil, echt angenehm, aber ich habe ja auch eh den besten Chat hier, ja,"}, {"id": 596, "start": 4448.86, "end": 4462.22, "text": "kaum Leute, die nervig sind da, so und, also wie gesagt 90%, mit 90% der Leute will ich"}, {"id": 597, "start": 4462.22, "end": 4470.1, "text": "nix zu tun haben und das hat sich eigentlich jetzt über mein gesamtes Leben immer wieder"}, {"id": 598, "start": 4470.1, "end": 4474.02, "text": "bestätigt, dass mir mindestens 90% der Leute auf den Kicks gehen, es gibt ein paar mit"}, {"id": 599, "start": 4474.02, "end": 4481.9, "text": "denen verstehe ich mich echt gut, ja, aber das ist selten, ja, ich habe auf der Arbeit"}, {"id": 600, "start": 4481.9, "end": 4486.9, "text": "zwei drei Leute, mit denen ich mich wirklich gut verstehe, äh, weiß nicht, habe ich noch"}, {"id": 601, "start": 4486.9, "end": 4492.34, "text": "mit Fabian am Start, mit dem Kaboom habe ich mich auch gut verstanden, wobei, das ist typische"}, {"id": 602, "start": 4492.34, "end": 4495.62, "text": "Max-Taktik, der hat mich ja schon öfters gefragt, wollen wir wieder was futtern gehen"}, {"id": 603, "start": 4495.62, "end": 4500.82, "text": "und ich melde mich dann immer nicht und sowas, typische Max-Taktik, der Fabian, der Master"}, {"id": 604, "start": 4500.82, "end": 4504.1, "text": "subscriber, es gibt schon ein paar Leute, mit denen ich mich ganz gut verstehe, aber"}, {"id": 605, "start": 4504.1, "end": 4509.42, "text": "es ist halt recht selten, also wie gesagt, von 1000 Leuten, die mir so über den Weg"}, {"id": 606, "start": 4509.42, "end": 4516.7, "text": "laufen, verstehe ich mich vielleicht mit einem, also es gibt Leute, die, die können ja irgendwie"}, {"id": 607, "start": 4516.7, "end": 4525.58, "text": "mit jedem, da gehöre ich nicht dazu und ich beneide das auch nicht, es gibt ja Leute,"}, {"id": 608, "start": 4525.58, "end": 4528.46, "text": "die sagen so nach dem Motto, oh das würde ich auch gerne können, ne ich will das gar"}, {"id": 609, "start": 4528.46, "end": 4536.78, "text": "nicht können, ich stelle mir das unglaublich lästig vor, sich mit so vielen Leuten permanent"}, {"id": 610, "start": 4536.78, "end": 4541.86, "text": "auseinander zu setzen, deswegen könnte ich auch nie, ähm, irgendwelche sozialen Sachen"}, {"id": 611, "start": 4541.86, "end": 4550.3, "text": "machen, ich hab ja meinen Zivildienst, hab ich ja gemacht, in einer Behindertenwerkstatt"}, {"id": 612, "start": 4550.3, "end": 4555.94, "text": "und das war cool, also das finde ich ist echt eine sinnvolle Sache, was jeder mal gesehen"}, {"id": 613, "start": 4555.94, "end": 4560.54, "text": "haben sollte, was da so, was da so Sache ist, aber das könnte ich mir im Leben nicht vorstellen,"}, {"id": 614, "start": 4560.54, "end": 4568.22, "text": "das beruflich zu machen, und witzigerweise, mit denen bin ich klar gekommen, die haben"}, {"id": 615, "start": 4568.22, "end": 4573.9, "text": "auch nicht genervt, das war, ich weiß nicht, irgendwie, das, das ging, das ging besser,"}, {"id": 616, "start": 4573.9, "end": 4586.3, "text": "also, naja, aber das, ich hätte im Leben keinen Bock auf irgendeinen, irgendeinen, äh, sozialen"}, {"id": 617, "start": 4586.3, "end": 4603.18, "text": "Kosmos, was ist denn da ins"}, {"id": 618, "start": 4603.18, "end": 4612.92, "text": "Naja alles nicht aber aber viel ist ja also mein Gedächtnis hat auch schon nachgelassen jetzt mit"}, {"id": 619, "start": 4612.92, "end": 4619.06, "text": "36 das merke ich ich konnte mir früher wirklich nahezu jeden kack merken den ich vor drei wochen"}, {"id": 620, "start": 4619.06, "end": 4621.98, "text": "mal irgendwie zu irgendeinem gesagt haben mittlerweile ist nicht mehr ganz so wild"}, {"id": 621, "start": 4621.98, "end": 4635.5, "text": "ja also das geht überhaupt nicht ja also wenn einer mit tabs einrückt versus leerzeichen"}, {"id": 622, "start": 4635.5, "end": 4662.14, "text": "das wird direkt aus dem telefonbuch gelöscht ja so was muss nicht sein schenkt möglich"}, {"id": 623, "start": 4662.14, "end": 4671.02, "text": "wäre es aber aktuell haben wir keine zu wie bei uns du hast 10 jahre gemacht und ist eklig"}, {"id": 624, "start": 4671.02, "end": 4676.1, "text": "oder vielleicht vielleicht ok vielleicht ist es irgendwann nicht mehr so wild aber alles was"}, {"id": 625, "start": 4676.1, "end": 4680.42, "text": "ich bisher von sieb und woib konfiguration gesehen habe ist komplett abfack"}, {"id": 626, "start": 4680.42, "end": 4693.06, "text": "ja das ist black magic sieb"}, {"id": 627, "start": 4693.06, "end": 4715.42, "text": "ja daran wird es wahrscheinlich liegen ich probiere mein dotnet core minecraft server"}, {"id": 628, "start": 4715.42, "end": 4720.98, "text": "da drauf aus nicht jetzt aber off stream das ist eine gute frage wird oft wird schon öfters"}, {"id": 629, "start": 4720.98, "end": 4726.58, "text": "gefragt aber ich sag's gerne noch mal wie findest du mr robot die serie ich war richtig"}, {"id": 630, "start": 4726.58, "end": 4731.9, "text": "gehyped auf mr robot nachdem ich die erste folge gesehen habe ich habe mir gedacht was"}, {"id": 631, "start": 4731.9, "end": 4738.02, "text": "eine geile serie dem ich die erste folge geguckt habe damals damals das mr robot ist ja schon"}, {"id": 632, "start": 4738.02, "end": 4742.5, "text": "ein paar jahre alt da war das doch nicht so inflationär heute ist ja so es kommen jeden"}, {"id": 633, "start": 4742.5, "end": 4750.18, "text": "tag zehn verschiedene serien raus weiß gar nicht genau was gucken soll mr robot war was"}, {"id": 634, "start": 4750.18, "end": 4756.54, "text": "das angeht tatsächlich war ein besonderes release ja muss man schon sagen so und ich"}, {"id": 635, "start": 4756.54, "end": 4760.46, "text": "habe mir die erste folge angucken was eine geile serie habe ich weiter geile serie geile"}, {"id": 636, "start": 4760.46, "end": 4769.98, "text": "serie und irgendwann mitte der ersten staffel wurde die serie instant naja nicht scheiße"}, {"id": 637, "start": 4769.98, "end": 4777.3, "text": "kann man nicht sagen aber irgendwie doof vor allem haben sie in der ersten staffel auf"}, {"id": 638, "start": 4777.3, "end": 4783.62, "text": "so einen auf so einen riesen hack riesen riesen hacking ereignis hingearbeitet und am ende"}, {"id": 639, "start": 4783.62, "end": 4790.02, "text": "hat der hält das verschlafen fand ich auch fail das problem was was ich quasi ab sagen"}, {"id": 640, "start": 4790.02, "end": 4795.58, "text": "wir so das erste drittel mr robot richtig cool bis zur hälfte auch noch danach haben"}, {"id": 641, "start": 4795.58, "end": 4804.1, "text": "einfach die drogenabhängigkeit und und gestörten ticks vom hält viel zu viel platz eingenommen"}, {"id": 642, "start": 4804.1, "end": 4808.42, "text": "und ich muss euch sagen der mr robot twist dass ich meine die serie ist jetzt fünf oder"}, {"id": 643, "start": 4808.42, "end": 4812.94, "text": "sechs jahre ich spoiler jetzt einfach mal ja der der twist so der zu mitte mitte von"}, {"id": 644, "start": 4812.94, "end": 4818.58, "text": "der ersten staffel irgendwann gekommen ist dass sein ich glaube sein vater ist das doch"}, {"id": 645, "start": 4818.58, "end": 4827.42, "text": "sogar dass der nicht wirklich existiert das hast du meilenweit gesehen oder wem ging es"}, {"id": 646, "start": 4827.42, "end": 4834.02, "text": "noch so ich habe das sofort also ab nachdem der typ am zweiten mal am start war wusste"}, {"id": 647, "start": 4834.02, "end": 4843.14, "text": "ich den typ gibt es nicht das war das war ja das ist sofort sofort also der große twist"}, {"id": 648, "start": 4843.14, "end": 4849.86, "text": "blieb aus war mr robot bei mir ja das haben sie über fight club zum beispiel viel besser"}, {"id": 649, "start": 4849.86, "end": 4857.26, "text": "gemacht bei fight club hast du euch boomer film ich weiß ist auch schon bisschen älter"}, {"id": 650, "start": 4857.26, "end": 4861.86, "text": "bei fight club habe ich wirklich nicht gecheckt bis zum schluss und die haben das echt gut"}, {"id": 651, "start": 4861.86, "end": 4867.5, "text": "gemacht und die haben das da echt gut gemacht ich gehe mal davon aus wer auch viele von"}, {"id": 652, "start": 4867.5, "end": 4873.66, "text": "euch gesehen haben ist ja mittlerweile fast so eine art kultfilm das haben die echt cool"}, {"id": 653, "start": 4873.66, "end": 4878.78, "text": "gemacht weil du hast wenn du später noch mal geguckt hast hat so sogar stellen wo du"}, {"id": 654, "start": 4878.78, "end": 4882.94, "text": "gesehen hast wo der andere quasi im hintergrund stand und nichts gemacht hat und sowas war"}, {"id": 655, "start": 4882.94, "end": 4897.98, "text": "echt cool also wie gesagt mr robot hat mich da ein bisschen enttäuscht"}, {"id": 656, "start": 4897.98, "end": 4903.66, "text": "soll ich dir dein tinder game auf next level bringen dazu bräuchte ich erstmal einen tinder"}, {"id": 657, "start": 4903.66, "end": 4907.78, "text": "account und ich glaube eines der letzten dinger die ich mir anlegen würde ist wahrscheinlich"}, {"id": 658, "start": 4907.78, "end": 4921.42, "text": "ein tinder account"}, {"id": 659, "start": 4921.42, "end": 4924.9, "text": "jeder hat das recht individuell gehasst zu werden ich hasse die leute ja noch nicht"}, {"id": 660, "start": 4924.9, "end": 4933.94, "text": "mal ich will mit den mit mit 90 prozent der leute einfach nichts zu tun haben es gibt"}, {"id": 661, "start": 4933.94, "end": 4940.42, "text": "so unglaublich viele doofe leute es also leute peak absolut muss ich jetzt an der stelle"}, {"id": 662, "start": 4940.42, "end": 4947.26, "text": "mal erzählen der absolut peak dummheit die ich jemals erlebt habe in geballter form"}, {"id": 663, "start": 4947.26, "end": 4952.94, "text": "ich wusste nicht dass man es schaffen kann so viel dumme leute auf engen engen raum zu"}, {"id": 664, "start": 4952.94, "end": 4960.78, "text": "versammeln auf engen raum zu bringen ja war als ich mal und das ist schon ganz lange"}, {"id": 665, "start": 4960.78, "end": 4965.34, "text": "her das ist noch noch bevor ich die physio ausbildung gemacht habe das ist wirklich lange"}, {"id": 666, "start": 4965.34, "end": 4972.66, "text": "her musste ich mal einen kurs machen vom arbeitsamt da könnte ich eigentlich auch mal da könnte"}, {"id": 667, "start": 4972.66, "end": 4975.42, "text": "ich auch mal ein video drüber machen habe ich glaube ich schon mal habe ich glaube ich"}, {"id": 668, "start": 4975.42, "end": 4983.02, "text": "schon mal video drüber gemacht aber da musste ich einen kurs vom arbeitsamt machen und"}, {"id": 669, "start": 4983.02, "end": 4987.34, "text": "das war so ein typischer wie bewerbe ich mich richtig kurs kompletter schwachsinn das lag"}, {"id": 670, "start": 4987.34, "end": 4992.42, "text": "nicht daran also bei mir damals lag es nicht daran dass ich zu dumm war setze zu formulieren"}, {"id": 671, "start": 4992.42, "end": 4996.1, "text": "für eine bewerbung sondern dass ich keinen bock hatte weil ich ein fauler sack gewesen"}, {"id": 672, "start": 4996.1, "end": 5005.02, "text": "bin so nach der schule da wollte ich eigentlich nix machen und ich einfach nix gemacht habe"}, {"id": 673, "start": 5005.02, "end": 5010.7, "text": "ja und mich versucht habe rauszureden und sonst was naja zumindest bin ich muss ich"}, {"id": 674, "start": 5010.7, "end": 5017.3, "text": "auf diesen arbeitsamt kurs gehen oder arbeitsagentur wie heißen die jetzt eigentlich richtig agentur"}, {"id": 675, "start": 5017.3, "end": 5022.42, "text": "für arbeit oder heißen die jetzt richtig hanau genau exzellent exzellent kackding da"}, {"id": 676, "start": 5022.42, "end": 5034.46, "text": "im hauptbahnhof so zumindest war ich in diesem arbeitsamt kurs und ich brauche jetzt ein"}, {"id": 677, "start": 5034.46, "end": 5040.18, "text": "bisschen passende passende untermahlung hier haben wir ein paar paar schöne paar schöne"}, {"id": 678, "start": 5040.18, "end": 5046.5, "text": "led leds exzellent exzellent perfekt das war leds blinken im hintergrund während ich erzähle"}, {"id": 679, "start": 5046.5, "end": 5056.86, "text": "so super also so ich war ich war in diesem kurs am start und sinnloser kurs auch ich"}, {"id": 680, "start": 5056.86, "end": 5061.98, "text": "habe da drüber schon video gemacht interessant naja also ich bin echt begeistert gewesen"}, {"id": 681, "start": 5061.98, "end": 5069.58, "text": "wie viel dummheit man so in so einem kurs stecken kann und zwar da waren leute alter"}, {"id": 682, "start": 5069.58, "end": 5077.22, "text": "das das haltet ihr nicht für möglich da war zum beispiel eine von dem rapper erzähle"}, {"id": 683, "start": 5077.22, "end": 5080.1, "text": "ich euch von dem möchte gern rapper erzähle ich das habe ich schon mal erzählt mit dem"}, {"id": 684, "start": 5080.1, "end": 5087.1, "text": "möchte gern rapper aber das andere noch nicht da war eine am start also erste erste mal"}, {"id": 685, "start": 5087.1, "end": 5092.26, "text": "muss man sagen erst mal muss man sagen irgendwie 90 prozent der medels die da am start waren"}, {"id": 686, "start": 5092.26, "end": 5100.22, "text": "ich war da 18 oder so 19 die hatten alle schon kinder die waren alle in meinem alter also"}, {"id": 687, "start": 5100.22, "end": 5105.94, "text": "ok die legen aber ganz schön vor hier so und da war eine am start die hatte noch keine"}, {"id": 688, "start": 5105.94, "end": 5113.94, "text": "kinder aber die war so unglaublich blöd die hat sich beschwert in diesem arbeitsamt kurs"}, {"id": 689, "start": 5113.94, "end": 5119.66, "text": "immer so nach dem motto ja ich schreibe ans amt und das amt antwortet nicht und wenn sie"}, {"id": 690, "start": 5119.66, "end": 5124.3, "text": "antworten dann schreiben sie immer irgendwas was ich überhaupt nicht wissen will und die"}, {"id": 691, "start": 5124.3, "end": 5131.7, "text": "hat mal die hat mal so einen schreiben mitgebracht was die was sie an das amt schreibt und das"}, {"id": 692, "start": 5131.7, "end": 5136.34, "text": "problem war die hatten dann auch so einen trainer der hatte das auch versucht zu erklären"}, {"id": 693, "start": 5136.34, "end": 5139.02, "text": "und ich habe mir das auch mal angucken ich meine es ist nicht klar warum die dir nicht"}, {"id": 694, "start": 5139.02, "end": 5146.22, "text": "antworten die verstehen das nicht und dann kam raus die schreibt diese sachen gar nicht"}, {"id": 695, "start": 5146.22, "end": 5153.7, "text": "selbst ans arbeitsamt sondern sie kann gar nicht richtig schreiben aber und das ist wirklich"}, {"id": 696, "start": 5153.7, "end": 5159.26, "text": "das ist das war die ausrede dafür das war die ausrede dafür die hat dann gesagt sie"}, {"id": 697, "start": 5159.26, "end": 5166.42, "text": "muss nicht schreiben können weil ihr mann kann schreiben das war die beschissenste ausrede"}, {"id": 698, "start": 5166.42, "end": 5178.38, "text": "die ich jemals gehört habe hallo ich es geht hier es geht hier nicht um klavier spielen"}, {"id": 699, "start": 5178.38, "end": 5189.66, "text": "oder um mein pcs zusammen bauen oder sowas es geht um schreiben das hätte man das hätte"}, {"id": 700, "start": 5189.66, "end": 5198.86, "text": "man 1650 sagen können mein mann kann schreiben ich brauche das nicht also das war das war"}, {"id": 701, "start": 5198.86, "end": 5203.26, "text": "die ausrede sie konnte ich will nicht sagen dass sie schreiben konnte also sie konnte"}, {"id": 702, "start": 5203.26, "end": 5210.78, "text": "wörter aus papier bringen nicht richtig geschrieben und nicht in korrekter reinfolge also ich"}, {"id": 703, "start": 5210.78, "end": 5214.62, "text": "will jetzt keine leute flamen die nicht schreiben können das mag die unterschiedlichsten unterschiedlichsten"}, {"id": 704, "start": 5214.62, "end": 5221.14, "text": "kurssachen haben aber bei ihr war das keine angeborene geschichte die war einfach nicht"}, {"id": 705, "start": 5221.14, "end": 5225.9, "text": "in der lage zu die wollte auch nicht weil ihr mann kann das ja und ich habe das versucht"}, {"id": 706, "start": 5225.9, "end": 5232.18, "text": "zu lesen was sie da geschrieben haben was ihr mann geschrieben hat du konntest das nicht"}, {"id": 707, "start": 5232.18, "end": 5238.14, "text": "das ging nicht du hast nicht verstanden was die wollen also was was die von dem wollen"}, {"id": 708, "start": 5238.14, "end": 5245.02, "text": "habe ich es ist kein wunder dass die den ich antworten weil die verstehen es nicht die"}, {"id": 709, "start": 5245.02, "end": 5251.14, "text": "verstehen es nicht und da habe ich mit mit der zusammen was geschrieben ist jetzt alles"}, {"id": 710, "start": 5251.14, "end": 5255.74, "text": "noch no fake was ich jetzt erzähle ja da habe ich mit der zusammen was geschrieben"}, {"id": 711, "start": 5255.74, "end": 5265.34, "text": "also so einfache dinger ja das kann ich was sie was sie genau wollte irgendwie die wollte"}, {"id": 712, "start": 5265.34, "end": 5269.22, "text": "zwischenzeitlich sogar das amt verklagen und hat sich erkundigt wo man prozesskosten"}, {"id": 713, "start": 5269.22, "end": 5274.42, "text": "beihilfe und sowas kriegt wollte ich hab ich hab dir dann geholfen das zu schreiben und"}, {"id": 714, "start": 5274.42, "end": 5281.3, "text": "irgendwie kein kein scheiß ja irgendwie dachte die war wahrscheinlich ist das das einzige"}, {"id": 715, "start": 5281.3, "end": 5284.94, "text": "ich hatte da ein bisschen ich hatte irgendwie mitleid mit dass das nicht funktioniert hat"}, {"id": 716, "start": 5284.94, "end": 5288.74, "text": "und ich war da gefühlt auch der einzige der ordentlich schreiben konnte außer die die"}, {"id": 717, "start": 5288.74, "end": 5295.74, "text": "trainer in diesem ding ich habe gesagt ich schreibe halt mit der was die hat das so interpretiert"}, {"id": 718, "start": 5295.74, "end": 5304.38, "text": "ich schreibe das für die weil ich scharf auf die bin es ist kein nütz jetzt ich dachte"}, {"id": 719, "start": 5304.38, "end": 5309.74, "text": "ich helfe dir ein brief zu schreiben ich dachte mir die arme kann kein brief schreiben ich"}, {"id": 720, "start": 5309.74, "end": 5317.42, "text": "helfe ihnen brief zu schreiben so und die dachte ich bin scharf auf die weil ich ihr"}, {"id": 721, "start": 5317.42, "end": 5325.62, "text": "war sie hübschen nee nee nee nicht wirklich die war zum kurs dann auch nicht hübschen"}, {"id": 722, "start": 5325.62, "end": 5329.5, "text": "so und die hat die hat gedacht die hat gedacht irgendwie ich mach das weil ich auf sie scharf"}, {"id": 723, "start": 5329.5, "end": 5334.02, "text": "bin also und woran ich das gemerkt habe es hat ja ein bisschen gedauert ja woran ich"}, {"id": 724, "start": 5334.02, "end": 5343.78, "text": "das gemerkt habe ist die hat mir auf einmal angefangen dinger von sich zu erzählen so"}, {"id": 725, "start": 5343.78, "end": 5351.66, "text": "und so da war unter anderem dabei ich wollte das eigentlich gar nicht wissen ja die hat"}, {"id": 726, "start": 5351.66, "end": 5356.34, "text": "dann angefangen zu erzählen so nach dem motto ja sie versucht ja gerade schwanger zu"}, {"id": 727, "start": 5356.34, "end": 5364.54, "text": "werden sie versucht ja gerade schwanger zu werden und mit ihrem mit ihrem mit ihrem"}, {"id": 728, "start": 5364.54, "end": 5369.22, "text": "mann klappt es ja nicht deswegen hat sie ja noch ein zweiter das hat die wortwörtlich"}, {"id": 729, "start": 5369.22, "end": 5375.22, "text": "gesagt was ich euch jetzt sage wortwörtlich deswegen hat sie ja noch einen zweiten stecher"}, {"id": 730, "start": 5375.22, "end": 5382.1, "text": "wortwörtlich denke mir das nicht aus sie hat ja noch einen zweiten stecher oder habe"}, {"id": 731, "start": 5382.1, "end": 5386.7, "text": "ich schon gehabt da habe ich so langsam dann habe ich so langsam realisiert obwohl obwohl"}, {"id": 732, "start": 5386.7, "end": 5400.38, "text": "auf was das ganze jetzt hier auf was das ganze hier abzielt ja oh Gott meine Güte zumindest"}, {"id": 733, "start": 5400.38, "end": 5404.14, "text": "wahrscheinlich wollte er als kindergeld ich habe keine ahnung ich habe das wortwörtlich"}, {"id": 734, "start": 5404.14, "end": 5409.5, "text": "gesagt aber sobald sobald dann das kind am start ist kinderstand dann hört das natürlich"}, {"id": 735, "start": 5409.5, "end": 5414.22, "text": "auf und so sie sie wollte mir quasi sie hat mir quasi dann auch relativ unmissverständlich"}, {"id": 736, "start": 5414.22, "end": 5420.06, "text": "mitgeteilt sie ist auch diesen diesen weiteren stechern nicht nicht abgeneigt und so alter"}, {"id": 737, "start": 5420.06, "end": 5429.46, "text": "hör mal auf meine güte dieser kurs was man da an dummheit alles reinsetzen konnte geballt"}, {"id": 738, "start": 5429.46, "end": 5436.14, "text": "war ich da wahnsinn ja und dann die story habe ich ja schon öfters erzählt am besten"}, {"id": 739, "start": 5436.14, "end": 5441.3, "text": "war der und der konnte ich nichts dafür der war nicht blöd nicht wirklich glaube ich"}, {"id": 740, "start": 5441.3, "end": 5448.5, "text": "der war einfach nur ziemlich jung da war erst 16 oder so da war einer am start der nennt"}, {"id": 741, "start": 5448.5, "end": 5453.18, "text": "wir ihn mal mustafar ich will jetzt nicht den ersten echten namen sagen der meinte er wird"}, {"id": 742, "start": 5453.18, "end": 5458.02, "text": "später mal richtig krasser gangster rapper und nachdem ich ja da irgendwie der einzige"}, {"id": 743, "start": 5458.02, "end": 5462.9, "text": "war der halbwegs normal lesen und schreiben konnte in diesem kurs habe ich zu ihm gesagt"}, {"id": 744, "start": 5462.9, "end": 5472.1, "text": "hier sagt doch mal zeig doch mal was was du so schreibst immer und ich muss mich wegschmeißen"}, {"id": 745, "start": 5472.1, "end": 5475.74, "text": "das war das war ihm dann voll peinlich auch dass ich darüber gelacht habe er hat mir"}, {"id": 746, "start": 5475.74, "end": 5482.82, "text": "da mal was mitgebracht so an text und da stand wirklich drauf seit es ein krasser hiphop"}, {"id": 747, "start": 5482.82, "end": 5490.82, "text": "text ging los mit machst du faxen mache ich dich platt mit achsen ergibt keinen sinn"}, {"id": 748, "start": 5490.82, "end": 5499.42, "text": "wenn man ehrlich ist ja man weiß aber was er sagen wollte achsen achsen achsen keine"}, {"id": 749, "start": 5499.42, "end": 5525.02, "text": "ahnung ist das mehr ich habe keine ahnung wer mehr ist sagt mir wie mehr mit echten"}, {"id": 750, "start": 5525.02, "end": 5531.42, "text": "vornamen heißt kann ich dir sagen aber das ist eher nicht nein natürlich bis 2000 geboren"}, {"id": 751, "start": 5531.42, "end": 5552.22, "text": "das kann eigentlich nicht sein oh man wunderbar genau es war eine schulung wie man richtig"}, {"id": 752, "start": 5552.22, "end": 5560.62, "text": "bewerbung schreibt wie gesagt ich war der einzige der halbwegs lesen und schreiben konnte"}, {"id": 753, "start": 5560.62, "end": 5566.46, "text": "konnte also was die da was die da was was die da für leute reingesteckt haben war echt"}, {"id": 754, "start": 5566.46, "end": 5572.86, "text": "was war ich mach gar nicht ich labere einfach nur und lass ein video laufen es war es war"}, {"id": 755, "start": 5572.86, "end": 5579.42, "text": "echt der wahnsinn ja und am ende von diesem kurs hast du dann eine bewertung bekommen"}, {"id": 756, "start": 5579.42, "end": 5584.22, "text": "wie gut du in welchen bereichen bist und meine frau vom arbeitsamt meinte damals das wäre"}, {"id": 757, "start": 5584.22, "end": 5591.18, "text": "eine der besten bewertungen gewesen die sie je gesehen hätte ich war einfach nur da und"}, {"id": 758, "start": 5591.18, "end": 5600.26, "text": "konnte lesen und schreiben das war alles was ich gemacht habe was ich dem kurs gemacht"}, {"id": 759, "start": 5600.26, "end": 5605.06, "text": "habe denn es ist die typische arbeitsamt statistik statistik fälschung warum man in diesem"}, {"id": 760, "start": 5605.06, "end": 5614.42, "text": "kurs ist wenn du in so einem kurs bis zählt du nicht als arbeitslos ich war da weil ich"}, {"id": 761, "start": 5614.42, "end": 5622.38, "text": "nach der schule keinen bock hatte was zu machen ich habe am arbeitsamt wollte geld haben und"}, {"id": 762, "start": 5622.38, "end": 5638.38, "text": "haben die gesagt macht bewerbungskurs so kurz doch jeder von der echte wahnsinn xx lx xx"}, {"id": 763, "start": 5638.38, "end": 5649.46, "text": "lx dankeschön für vier monat subscription geh in die tele kannst du in die telegram wendler"}, {"id": 764, "start": 5649.46, "end": 5656.66, "text": "gruppe gehen oder so chat wie alt seid ihr also der chat der chat zusammen ist bestimmt"}, {"id": 765, "start": 5656.66, "end": 5668.62, "text": "ja locker über 1000 jahre alt über über 5000 jahre alt 1000 jahre ist relativ easy"}, {"id": 766, "start": 5668.62, "end": 5681.22, "text": "bei 265 zuschauen wir können um frage sollen wir um frage machen wir können um frage machen"}, {"id": 767, "start": 5681.22, "end": 5689.78, "text": "ja komm komm wir machen um frage so gut die idee ist hier das macht man um frage ja aber"}, {"id": 768, "start": 5689.78, "end": 5704.5, "text": "dieser arbeitsamt kurs alter wahnsinn um frage champ du bist am tindern lässt halt nichts"}, {"id": 769, "start": 5704.5, "end": 5716.1, "text": "anbrennen ok das ist die etwas profi mehr profi variant ja da wird wahrscheinlich nicht"}, {"id": 770, "start": 5716.1, "end": 5723.06, "text": "mit irgendeinem selbst gefrittert gefrickelten asterix konfig rum gebastelt weiß gar nicht"}, {"id": 771, "start": 5723.06, "end": 5731.34, "text": "was man da für systeme nimmt aber sie war echt nicht meins ja zweite stafel ich habe"}, {"id": 772, "start": 5731.34, "end": 5740.42, "text": "ich habe mr robot zweite stafel nicht mal angefangen"}, {"id": 773, "start": 5740.42, "end": 5747.62, "text": "es dauert 17 monate dankeschön für den sub dazu kann ich nur sagen wo ist mein hypersubs"}, {"id": 774, "start": 5747.62, "end": 5771.26, "text": "es gibt eine dort nicht kurs aber ernsthaft getappt gezup nein nein nein nicht meiner nicht"}, {"id": 775, "start": 5771.26, "end": 5787.18, "text": "oh nice perfekt heute den installier ich den cross compile ich für den staubsauger und"}, {"id": 776, "start": 5787.18, "end": 5798.78, "text": "dann geht es ab ist der robot für stafel zu stafel immer weniger technisch also guck"}, {"id": 777, "start": 5798.78, "end": 5806.46, "text": "mal mal ich stimme auch mal mit ab 30 wie 30 plus gibt so ein abstimmungspunkt für"}, {"id": 778, "start": 5806.46, "end": 5824.3, "text": "ich dachte wir machen wenigstens bis 40 ok 16 ich war 2016 kann man sich gar nicht mehr"}, {"id": 779, "start": 5824.3, "end": 5830.38, "text": "vorstellen damals habe ich feuerwerk noch auf dem röhrenfernseh angeguckt also das"}, {"id": 780, "start": 5830.38, "end": 5838.3, "text": "was immer läuft wenn 20 uhr wenn 24 uhr ist da lief noch feuerwerk auf dem röhrenfernseh"}, {"id": 781, "start": 5838.3, "end": 5854.3, "text": "und ich hatte ein nokia handy glaube aber richtiges handy nicht so ein smartphone war"}, {"id": 782, "start": 5854.3, "end": 5859.94, "text": "dann 2000 noch außer dass alle angst davor hatten dass die welt untergeht wegen ja 2000"}, {"id": 783, "start": 5859.94, "end": 5869.14, "text": "bug wo nichts also wirklich auch gar nichts passiert ist ok 30 plus da müssen wir keine"}, {"id": 784, "start": 5869.14, "end": 5877.22, "text": "extra keine extra umfrage noch mal machen so die meisten sind 19 bis 24 ernsthaft hätte"}, {"id": 785, "start": 5877.22, "end": 5882.9, "text": "ich nicht gedacht ich dachte wir sind ja übelst viel alte säcke aber finde ich schön dass"}, {"id": 786, "start": 5882.9, "end": 5888.82, "text": "so viele junge am start sind da sehe ich nämlich auch dass ich noch nicht gar zu boomer bin"}, {"id": 787, "start": 5888.82, "end": 5893.06, "text": "dass junge sich den scheiß noch mal angucken was ich erzähle ja das ist doch schon mal"}, {"id": 788, "start": 5893.06, "end": 5910.42, "text": "gut 25 bis 30 30 plus 18 also guck mal 60 prozent 60 prozent sind unter 24 oder 24"}, {"id": 789, "start": 5910.42, "end": 5926.62, "text": "und unter 24 der scheiß ist ganz schön ja das doch nice excellent excellent das probiere"}, {"id": 790, "start": 5926.62, "end": 5934.82, "text": "ich mal auf mag sein glaube ich dir aber ich gucke mir ich gucke mir das nicht an bis zur"}, {"id": 791, "start": 5934.82, "end": 5943.34, "text": "vierten staffel nachdem ich die erste schaffel enttäuscht hat gibt es irgendwelche aktuellen"}, {"id": 792, "start": 5943.34, "end": 5950.1, "text": "guten serien die man unbedingt gucken muss wie gesagt wusste gar nicht dass ich da"}, {"id": 793, "start": 5950.1, "end": 5958.18, "text": "schon video zu gemacht haben egal von wann ist das video 2013 da kann ich wieder neues"}, {"id": 794, "start": 5958.18, "end": 5969.14, "text": "video zu machen ich habe so viele sachen schon mal irgendwann behandelt das ist schon verjährt"}, {"id": 795, "start": 5969.14, "end": 5985.98, "text": "da kann ich ein neues video zu machen auch nicht schlecht"}, {"id": 796, "start": 5999.14, "end": 6010.18, "text": "wie gesagt das hat das hat die gesagt nicht ich jetzt wird es jetzt jetzt können wir"}, {"id": 797, "start": 6010.18, "end": 6035.1, "text": "demnächst die richtig twitch analytics starten also wie gesagt arbeitslose statistik wurde"}, {"id": 798, "start": 6035.1, "end": 6056.46, "text": "damals übelst gefakt mit kursen ist es wahrscheinlich immer noch so"}, {"id": 799, "start": 6056.46, "end": 6069.7, "text": "ich"}, {"id": 800, "start": 6069.7, "end": 6084.7, "text": "bin jetzt durch ja nicht mal lange ich gehe gleich auf das ist eine exzellente frage wie"}, {"id": 801, "start": 6084.7, "end": 6091.94, "text": "läuft eigentlich sein advanced traveling salesman projekt gar nicht ich bin mir nicht"}, {"id": 802, "start": 6091.94, "end": 6096.98, "text": "hundertprozentig sicher woran das liegt also ich habe ja mit einem mit einem arbeitskollege"}, {"id": 803, "start": 6096.98, "end": 6106.94, "text": "zusammen was was programmiert wo handwerker den optimalen die optimale route für einen"}, {"id": 804, "start": 6106.94, "end": 6112.1, "text": "tag zwischen ihren kunden ausrechnen können wo man dann auch die termine eintragen konnte"}, {"id": 805, "start": 6112.1, "end": 6118.66, "text": "oder hatte das ausgerechnet wie du am besten lang fährst mit welchem mit welchem installateur"}, {"id": 806, "start": 6118.66, "end": 6126.3, "text": "auto eigentlich richtig cooler prototyp gewesen aber entweder sind die sind die pleite gegangen"}, {"id": 807, "start": 6126.3, "end": 6132.3, "text": "oder haben kein geld mehr dafür gehabt das weiter zu verfolgen ich habe da bis jetzt"}, {"id": 808, "start": 6132.3, "end": 6145.26, "text": "nix nix mehr von gehört großartig wegel routing problem ja genau mit mit mit time slots also"}, {"id": 809, "start": 6145.26, "end": 6153.46, "text": "single informatikostream ja was sonst auch wir haben sogar vier prozent die verheiratet"}, {"id": 810, "start": 6153.46, "end": 6163.42, "text": "ganze drei leute die verheiratet exzellent einer der verlobt ist wie gesagt bald können"}, {"id": 811, "start": 6163.42, "end": 6174.06, "text": "wir twitch analytics machen da fehlt geschieden stimmt oh nee das machen wir hier nicht das"}, {"id": 812, "start": 6174.06, "end": 6184.26, "text": "sind sie auf twitch empfindlich was dieses thema angeht ich reite heute kein ich mache"}, {"id": 813, "start": 6184.26, "end": 6190.7, "text": "einfach aus oder guck mal reine ich irgendjemand gleich jemand und den ich gerne reiten würde"}, {"id": 814, "start": 6190.7, "end": 6213.86, "text": "einer den ich kennen bist du bist du kaffeetrinker nein ich trinke überhaupt kein kaffee ich"}, {"id": 815, "start": 6213.86, "end": 6228.5, "text": "habe noch zu wenig themen dafür die habe ich gemacht das war das war so ein ideenwettbewerb"}, {"id": 816, "start": 6228.5, "end": 6235.9, "text": "sie haben sie haben es eigentlich die haben sich gerannt code camp oder irgendwie sowas"}, {"id": 817, "start": 6235.9, "end": 6243.78, "text": "gewonnen gewonnen bei diesem wettbewerb wo es eigentlich ums app erstellen geht hat"}, {"id": 818, "start": 6243.78, "end": 6249.58, "text": "ein team was gegen so ziemlich alle regeln verstoßen hat die aufgestellt wurden ja sie"}, {"id": 819, "start": 6249.58, "end": 6253.94, "text": "haben irgendwie mit keine ahnung acht leuten teilgenommen obwohl maximale teamgröße fünf"}, {"id": 820, "start": 6253.94, "end": 6261.58, "text": "war sie haben ach ich krieg's gar ich will auch mal ich hab kein kein gedanken mit genau"}, {"id": 821, "start": 6261.58, "end": 6266.1, "text": "sie haben im prinzip die sache schon vorher erstellen einfach eine super gute präsentation"}, {"id": 822, "start": 6266.1, "end": 6270.78, "text": "gemacht also dass die mit der präsentation gewonnen haben kann ich verstehen aber es"}, {"id": 823, "start": 6270.78, "end": 6279.54, "text": "war nicht sowieso sprich angekündigt war und was mich halt geärgert hat ist dass die"}, {"id": 824, "start": 6279.54, "end": 6283.66, "text": "die gewonnen haben exakt die gleiche app idee hatten wie wir hätten wenn die nicht am start"}, {"id": 825, "start": 6283.66, "end": 6287.26, "text": "gewesen hätten wir wahrscheinlich gewonnen und wir haben jetzt gar nichts bekommen weil"}, {"id": 826, "start": 6287.26, "end": 6292.94, "text": "sie nicht die zweite die gleiche idee zwei mal in den top top drei haben wollten bin"}, {"id": 827, "start": 6292.94, "end": 6302.26, "text": "ich mir relativ sicher echt was war die app idee das kann ich jetzt so im detail nicht"}, {"id": 828, "start": 6302.26, "end": 6313.86, "text": "erzählen ja klar kenne ich den ist ja gerade am stream macht er denn das video premiere"}, {"id": 829, "start": 6313.86, "end": 6323.5, "text": "oder streamt er wirklich wird es nicht am stream oft nicht da jebaited ach so in du meinst"}, {"id": 830, "start": 6323.5, "end": 6336.26, "text": "allgemein jetzt am stream ja das habe ich gesehen was der brutzler gibt schon namen"}, {"id": 831, "start": 6336.26, "end": 6346.5, "text": "mittlerweile ja das ist der brutzler weiß ich ich horst heute kein ich horst das nächste"}, {"id": 832, "start": 6346.5, "end": 6360.14, "text": "wieder irgendjemand ne leute jetzt gehts gleich auf also ich glaube ich habe alles alles"}, {"id": 833, "start": 6360.14, "end": 6365.22, "text": "ausprobiert klar manchmal scheiß kennt ihr das das ist so ein das ist so neuer tick so"}, {"id": 834, "start": 6365.22, "end": 6371.58, "text": "neues neues sache die ich mache die eigentlich ziemlich dumm ist wenn ich wenn ich anfange"}, {"id": 835, "start": 6371.58, "end": 6378.46, "text": "was zu sagen ohne dass ich weiß was ich sagen will und mir dazwischen es nicht einfällt"}, {"id": 836, "start": 6378.46, "end": 6383.14, "text": "genau was ich sagen will anstatt dass ich dann kurz langsam mache sage ich irgendwie"}, {"id": 837, "start": 6383.14, "end": 6388.82, "text": "ohne nachzudenken das nächste beste was mir einfällt da kommt so komplett sinnlose setze"}, {"id": 838, "start": 6388.82, "end": 6394.06, "text": "bei raus wie eben das muss man wieder abgewöhnen am besten ist eigentlich erst was zu sagen"}, {"id": 839, "start": 6394.06, "end": 6399.26, "text": "wenn man halbwegs weiß was man sagen will da kommt nicht so unglaublich unfertige sinnlose"}, {"id": 840, "start": 6399.26, "end": 6414.62, "text": "setze bei raus gamestop war bei 200 stonks hodl wo haben sie da haben sie die hodl leute"}, {"id": 841, "start": 6414.62, "end": 6437.86, "text": "haben sich gefreut die noch hatten genau wie gesagt ich habe heute ja eh nichts großartiges"}, {"id": 842, "start": 6437.86, "end": 6452.06, "text": "vorgehabt immer noch investierst du ein teil deines geldes also das einzige was ich bis"}, {"id": 843, "start": 6452.06, "end": 6462.26, "text": "jetzt gemacht habe ich habe zwei bisher zwei privat kredite vergeben mit fast schon und"}, {"id": 844, "start": 6462.26, "end": 6467.78, "text": "das hat nicht ich vorgeschlagen muss ich sagen fast schon unverschämten zinsen das hat mir"}, {"id": 845, "start": 6467.78, "end": 6478.42, "text": "aber die jeweilige andere partei vorgeschlagen und das sind aber leute die kenne ich und"}, {"id": 846, "start": 6478.42, "end": 6488.26, "text": "das ist auch fast schon alles abgezahlt kennst du scherner auf github ne das eine war glaube"}, {"id": 847, "start": 6488.26, "end": 6500.74, "text": "ich über 12.000 euro und das andere war über ich weiß nicht"}, {"id": 848, "start": 6500.74, "end": 6519.74, "text": "also"}, {"id": 849, "start": 6519.74, "end": 6537.04, "text": "Ja, wie gesagt, mitverdreher. Übrigens, dass die fast abbezahlt sind, stimmt gar nicht."}, {"id": 850, "start": 6537.04, "end": 6542.54, "text": "Wenn ich das jetzt mal recht überlege. Das läuft noch. Das ist doch gar nicht so recht."}, {"id": 851, "start": 6542.54, "end": 6547.24, "text": "Das läuft noch eine ganze Weile. Da muss ich eh mal meinen Steuerberater anhauen,"}, {"id": 852, "start": 6548.18, "end": 6552.98, "text": "Wie man das am besten das muss man garantiert verschleunen wir sind in deutschland"}, {"id": 853, "start": 6552.98, "end": 6582.66, "text": "Nö brauch kein tesla ich hab mein ollen 2001er opel agila das reicht"}, {"id": 854, "start": 6582.66, "end": 6593.94, "text": "ja genau das teil hier mein 2001 in grün"}, {"id": 855, "start": 6593.94, "end": 6608.46, "text": "auch noch die farbe dachte du fährst zug ich fahre auch mehr oder weniger die"}, {"id": 856, "start": 6608.46, "end": 6613.54, "text": "meisten sachen im zug aber ab und zu zum beispiel wenn ich am wochenende"}, {"id": 857, "start": 6613.54, "end": 6616.34, "text": "irgendwo hin fahre um eine runde zu wandern oder so dann mache ich das mit"}, {"id": 858, "start": 6616.34, "end": 6618.62, "text": "dem auto"}, {"id": 859, "start": 6618.62, "end": 6644.18, "text": "sie ist als kennzeichen aber die eigentlich agil an der arbeit wir sagen"}, {"id": 860, "start": 6644.18, "end": 6649.46, "text": "dass ja machen tun wir selten"}, {"id": 861, "start": 6649.46, "end": 6677.02, "text": "wir machen wir machen ein daily scrum würde ich sagen im nächsten stream"}, {"id": 862, "start": 6677.02, "end": 6685.1, "text": "daily scrum und tribe meetings und im nächsten stream werde ich checken ob"}, {"id": 863, "start": 6685.1, "end": 6688.42, "text": "ihr alle auch eure itale zertifizierung erfolgreich abgeschlossen habt"}, {"id": 864, "start": 6688.42, "end": 6699.14, "text": "weil ich will hier nicht mit unqualitäts zertifizierten leuten"}, {"id": 865, "start": 6699.14, "end": 6708.82, "text": "zusammen streamen mindestens mindestens also mindestens mal itale sollte das"}, {"id": 866, "start": 6708.82, "end": 6713.74, "text": "sein wenn nicht dien iso 9001"}, {"id": 867, "start": 6717.26, "end": 6724.18, "text": "und natürlich sollte dir auch an sich die passende agile hands on das passende"}, {"id": 868, "start": 6724.18, "end": 6730.58, "text": "agile hands on mindset haben mentalität"}, {"id": 869, "start": 6731.42, "end": 6743.58, "text": "du hast in zwei wochen eiten klau so auf repala ist ist was für ein ding"}, {"id": 870, "start": 6743.58, "end": 6748.86, "text": "certified software test das war habe ich noch nie gehört ja gar ist auch agil"}, {"id": 871, "start": 6748.86, "end": 6756.38, "text": "zwei tagen noch mein beinheit ja und und also dann kann man baut in"}, {"id": 872, "start": 6756.38, "end": 6759.74, "text": "schierer leg ich uns schon mal an"}, {"id": 873, "start": 6762.58, "end": 6766.7, "text": "kicker tisch ja das ja das mindeste alle die meinen sie sind super agil haben"}, {"id": 874, "start": 6766.7, "end": 6769.66, "text": "kicker tisch der dann nicht verwendet wird weil die leute sonst einen anschluss"}, {"id": 875, "start": 6769.66, "end": 6773.86, "text": "bekommen dass sie nichts arbeiten oder oder zumindest gefühl haben man kann"}, {"id": 876, "start": 6773.86, "end": 6780.54, "text": "sich einen tischsteller kicker tisch ja und und kostenloses obst wo sich keiner"}, {"id": 877, "start": 6780.54, "end": 6784.02, "text": "was nehmen darf es auch sehr beliebt"}, {"id": 878, "start": 6785.78, "end": 6789.02, "text": "der dann einfach nur rumsteht in der küche und immer gezeigt wird wenn man"}, {"id": 879, "start": 6789.02, "end": 6792.02, "text": "bewerber umführt"}, {"id": 880, "start": 6792.02, "end": 6808.78, "text": "wer ist eigentlich der was der je der gender beauftragte von diesem stream keine"}, {"id": 881, "start": 6808.78, "end": 6814.42, "text": "ahnung sebaro ich weiß es nicht sebaro ist halt"}, {"id": 882, "start": 6814.42, "end": 6823.58, "text": "mod halb wie das das zählt auch schon mal wo ist er eigentlich der cute mod"}, {"id": 883, "start": 6823.58, "end": 6828.06, "text": "wo steckt er eigentlich in letzter zeit"}, {"id": 884, "start": 6831.38, "end": 6835.38, "text": "wo ist der cute mod"}, {"id": 885, "start": 6835.38, "end": 6845.38, "text": "ja da lebt noch da schreibt man schon im discord wo ist er denn leute ihr müsst"}, {"id": 886, "start": 6845.38, "end": 6850.94, "text": "heute alle mal die im discord sind oder ihr könnt ja auch den clip hier machen"}, {"id": 887, "start": 6850.94, "end": 6855.18, "text": "oder sonst wie müsst heute alle mal in discord gehen und an den sebaro schreiben"}, {"id": 888, "start": 6855.18, "end": 6863.5, "text": "dass wir ihn vermissen im stream stream ohne cute mod ist nicht das gleiche ja"}, {"id": 889, "start": 6863.5, "end": 6866.38, "text": "der hat auch jetzt eine freundin er muss chatten"}, {"id": 890, "start": 6866.38, "end": 6874.5, "text": "hat habe ich was habe ich was nicht mitbekommen hat er sich das physik physik"}, {"id": 891, "start": 6874.5, "end": 6879.54, "text": "grill geangelt ja ich habe das nur am rande im chat verfolgt die ganze"}, {"id": 892, "start": 6879.54, "end": 6883.34, "text": "geschichte ich dachte ich glaube ich glaube da ist grad zu viel mit"}, {"id": 893, "start": 6883.34, "end": 6900.18, "text": "studiumsdingern beschäftigt er sebaro"}, {"id": 894, "start": 6900.18, "end": 6909.14, "text": "er schreibt pepe hans ist im discord ist alles klar leute"}, {"id": 895, "start": 6909.14, "end": 6914.06, "text": "weißt du was ich mache jetzt ich gucke jetzt mal ich gucke jetzt mal ganz ganz"}, {"id": 896, "start": 6914.06, "end": 6921.86, "text": "zackig noch mal wer streamt in science and technology"}, {"id": 897, "start": 6922.58, "end": 6925.58, "text": "german"}, {"id": 898, "start": 6925.58, "end": 6935.78, "text": "nee nee nee nee wir brauchen was wir haben auch battlefield 3"}, {"id": 899, "start": 6935.78, "end": 6938.78, "text": "battlefield 3"}, {"id": 900, "start": 6944.34, "end": 6947.34, "text": "ist es multiplayer"}, {"id": 901, "start": 6947.34, "end": 6958.62, "text": "road to road to was road to engineer 100 servicestars metro was sonst"}, {"id": 902, "start": 6965.94, "end": 6976.14, "text": "aber das spiel apex wahrscheinlich da bounty macht ja ich hause heute kein"}, {"id": 903, "start": 6976.14, "end": 6980.5, "text": "kenne heute kennen heute auch niemand"}, {"id": 904, "start": 6984.58, "end": 6988.9, "text": "echt ach so der hat sein technisch auf deutsch"}, {"id": 905, "start": 6988.9, "end": 6993.7, "text": "ne und german"}, {"id": 906, "start": 6993.7, "end": 6998.74, "text": "ja in cover hausen der spielt echt gut also falls ihr battlefield 3 guckt was"}, {"id": 907, "start": 6998.74, "end": 7010.02, "text": "keiner mehr was keiner mehr spielen spielt aber den den kommers hausen"}, {"id": 908, "start": 7010.02, "end": 7013.02, "text": "alles gut macht's gut"}, {"id": 909, "start": 7019.34, "end": 7022.34, "text": "wir sehen uns"}, {"id": 910, "start": 7022.34, "end": 7029.62, "text": "ist denn könnt ihr mal eine runde wupp old bei ihm spamm oder sowas ich bin"}, {"id": 911, "start": 7029.62, "end": 7032.14, "text": "jetzt aber nicht im chat ich bin dann bin dann weg ich geh jetzt pennen"}, {"id": 912, "start": 7032.14, "end": 7053.14, "text": "bestand 0"}]}