{"text": "So, auf gehts.So, wunderbar, auf gehts.Leute, Massive, Big Brain Chat, ich muss euch mal was fragen, und zwar, habt ihr dasmitbekommen mit diesem einen Ruby Jam, was irgendwie 50.000 Billiarden Repos kaputtgemacht hat. Das ist das gleiche, was letztens NPM hatte, vor ein paar Jahren. Und zwar,eigentlich wieder recht lustig gewesen. Okay, das ist wieder Musik, die nicht weiß, ob sielaut oder leise sein soll. Genau, und das ist wieder so ein typischer Fall von selbstverkackt,ne. Also, bei NPM war es ja kompletter Witz. Bei NPM hatten sie das vor ein paar Jahren,da hat man ein Paket unpublished und es hat irgendwie 50.000.000 Projekte kaputt gemacht,ne. Und ich mein, man darf nicht vergessen, es gibt bei NPM Packages für is odd, is oddor even Packages. Ich mein, hallo, warum brauch ich eine Library für ist eine Zahl geradeoder ungeradet? Wenn's ja da nur schon in der Sprache eingebaute Konstrukte gäbe, umdas rauszubekommen. Naja, das waren die Probleme bei NPM und Ruby hatte jetzt ähnliche Probleme,da hat auch einer ein Paket zurückgezogen und es hat irgendwie 50.000 Projekte kaputtgemacht. Das ist echt wieder übels Fell. Der russische Typ, das ist hier Cacomodates.Der da. Cacomodates, any Cacomodates. Ist klar, jetzt mal kurz spannen, CacWade. Ja,ja. Weg. Die Lippa hat 30, 300 Lines. Ja, Moment, die Ruby Library oder das da? Dasda hat nicht so viele Lines, das hat 20 oder so, das hab ich letztens irgendwo gesehen.Ja, Ruby, die macht ja auch eine halbwegs sinnvolle Geschichte, die Ruby Library, dasist nicht so ein Schwachsinn wie das von NPM. By the way, ich muss euch mal was zu C++fragen, Leute. Habt ihr eine Ahnung, warum? Habt ihr eine Ahnung, warum, ich muss ehnicht vor allem anmachen, warum folgende Sachen in C++ keinen Warning, warum es keinenError gibt, kann ich verstehen, aber warum es keinen Compiler Warning gibt? Also, machmal hier auf, das dauert ja so ewig lang. Also, warum gibt das hier in C++ keinen Warning?Vielleicht weiß das jemand. Guck mal. Warum gibt das keinen, nicht zumindest einen CompilerWarning? Muss man das verstehen oder ist das einfach C++-Dinger? Also, mal nur zur Erklärung,warum es einen Warning geben sollte oder geben könnte, ist, man sagt ja hier explizit, negativeZahlen sind nicht erlaubt. Das heißt, minus 1 ist in Wirklichkeit nicht minus 1, sondernplus, plus der Maximalwert von der Geschichte. Warum gibt man hier nicht zumindest mal einenWarning aus und sagt, wahrscheinlich willst du da nicht minus 1 reinschreiben? Weiß nicht,warum es da keinen Warning gibt. Verstehe ich nicht. By the way, wir müssen, ach guckmal, meine VM ist da, null. Jetzt brauche ich sie auch nicht mehr. Wir müssen uns eineWindows VM installieren. Mal schauen, habe ich hier noch irgendwas? Ach nee, es gibt,habe ich wieder diesen scheiß Bug mit is in use. Oh nee, ich habe wieder diesen Bug, VMis in use, Alter. Was ist das für ein Schwachsinn? Das hatte ich doch gestern schon. Na gut,aber eine neue VM können wir wahrscheinlich anlegen, da kann man ja wohl nichts dagegensagen. Wir brauchen eine neue Windows VM, weil ich will mir den Kram nicht unbedingt, ichweiß gar nicht, ob ich WSL hier drauf habe. Ja, das ist noch das Einser. Also ich installieremir auf jeden Fall neue Windows VM zum Ausprobieren. Und die Sache ist die, warum ich das mal ausprobierenwill mit WSL ist folgendes. Was war jetzt an der Message so schlimm? Ach, er wollteden Timeout. Jetzt verstehe ich es auch. Stimmt, man kann sich ja Timeouten lassen mit 2500Channelpunkte. Exzellent, exzellent. Ist doch viel leichter hinzuschreiben als nach einemMax, ja, was auch möglich wäre. Warum gibt es denn nicht sowas? Warum gibt es denn nichtsowas? Vielleicht so. Oder, oder. Irgendwas, keine Ahnung, es ist C++, muss man nichtverstehen, aber warum ist das wieder überhaupt Ding? Da ist er ja wieder. Was moin Max, duglaubst gar nicht, wie gerne ich deine Videos auf YouTube schaue und mir. Ja, ist doch nice.Ich meine, vielleicht guckst du die Videos ja auch nicht nur, weil du sie früher gernegeguckt hast, sondern guckst sie immer noch gerne. Das wäre mir natürlich, natürlichnoch lieber, ja. So, ich installiere mir mal nebenbei eine Windows VM, die brauchen wirjetzt, bevor wir anfangen können. Also, wer das nicht kennt, WSL ist ja diese Geschichte,wo man Linux unter Windows installieren kann. Und nicht wie ich das hier mache, in der VM,sondern quasi, man könnte sagen, WSL war früher so das Reverse Wine, also quasi manhat Linux unter Windows laufen lassen und nicht Windows unter Linux. Und jetzt ist esmittlerweile so, im Prinzip ist WSL 2 auch nur noch eine VM, aber noch eine VM mit irgendwiespezieller Config. Keine Ahnung, weiß ich nicht. Die Sache ist plus die. Microsoft istda relativ committed, was das angeht und bastelt da ziemlich viel dran rum. Und warum ich dasjetzt ausprobieren wollte mit WSL, also WSL 2, nicht das normale WSL, warum ich das malwieder ausprobieren will, ist folgendes und zwar, bei uns auf der Arbeit haben sie sichüberlegt, wir bekommen demnächst alle Windows VMs verpasst, die wir benutzen sollen. Also,das hindert mich nicht daran, irgendetwas anderes zu benutzen noch, aber sie haben sichüberlegt, es ist eine gute Idee, es kriegen alle Windows VMs und mit diesen Windows VMskann man dann Dinge machen oder auch nicht. Und ich hab mir jetzt mal gedacht, ich guckmir jetzt mal auf Spaß an eine Freundin, ich guck mir das ja immerhin regelmäßig im Abstandan und das ist auch schon benutzbar, ein paar Dinge sind halt nervig. Zum Beispiel, dassman grafische GUI Sachen nur schlecht verwenden kann. Ich weiß nicht, ob das mittlerweilebesser ist, aber ich brauch halt GUI Applikationen unter Linux, zum Beispiel eine IDE, um irgendwaszu entwickeln oder zumindest mal einen ordentlichen Editor oder so. Ja, mal gucken. Was sollt ihrdenn mit Windows VMs machen? Ja, das ist witzig, die haben sich bei uns nämlich überlegt,das ist natürlich eine berechtigte Frage, ich hab das auch nicht verstanden und diehaben sich jetzt gedacht, alle Leute, die für Linux-Systeme zuständig sind, wenn die remotearbeiten wollen, dann sollen die erst mal gar keine großartigen Rechte bekommen, sondernalle Leute, die für Linux-Systeme zuständig sind, bekommen eine Windows-VM gestellt, vonder sie dann Zugriff auf ihre Linux-Systeme bekommen. Ich hab keine Ahnung, wie man aufdie Klonreiche Ideen... Ist das VDI? Ja, das ist... Wie spricht man Citrix geil aus? Cytrix?Cytrix? Ich hab keine Ahnung. Gibt es eine coole Aussprache von Citrix? Cytrix? Cytrix?Ich muss noch gucken, wie man das offiziell... Cytrux, was? Citrix, ja, das wissen wir schon,das wissen wir schon, aber... Es wäre schon cooler, wenn man das Cytrix aussprechenkönnte oder so, ne? RDPX installieren, ja, probier ich alles aus, probier ich alles aus,mal gucken. Die Sache ist die, ich brauch's ja aktuell gar nicht so wirklich, ne? Also,VM? VM? Postchamp? Wie wär's mit sich beenden, VM, please? Chat, wer von euchwar's? Wer hat's meine VM kaputt gemacht? Seid ihr schon drin? Ah, nee, die VM hat sichja beendet. Sehr gut. Okay, neue VM... Achso, ich zeig euch... Ich hab, by the way, dasist immer noch die alte VM-Version, bevor mich wieder einer drauf hinweist und nachdemer gesagt hat, mach's, upgrade doch mal. Ja, jetzt, wenn ich mir schon Key gekauft hab...Ich hab mir aber keinen Key für... Also, schon ein bisschen länger her. Aber, wie gesagt,ich erwähne ja immer, dass ich mir bei so einem super vertrauenswürdigen Software-Shopvor allem Key gekauft hab für 22 Euro oder 25 Euro. Und ich find's geil, die funktionierenauch wirklich. Oh nein, es muss jetzt keiner in Chat posten, man findet auch anderweitigKey. Das ist mir klar, aber das will ich jetzt hier nicht großartig zeigen, ne? Mein OBSist auch übrigens voll up to date mit 24. So, und ich zeig euch jetzt mal den Trick,den alle immer geil finden, den zeig ich in jedem Stream. Windows 10 ISO downloaden funktioniertnicht, weil man nur updaten kann. So, es gibt verschiedene Möglichkeiten. Entweder mangeht von der Linux-Kiste drauf, dann kann man das downloaden. Oder man kann einfach faken,dass man von einem Mobilgerät drauf zugreift auf die Seite. Jetzt geht man nämlich hierin die Ansicht vom iPad, refresh die Seite und schon kann man die ISO downloaden vomaktuellen Windows 10. Den Trick hab ich schon 30 Millionen mal gezeigt, aber der Chat magden Trick jedes Mal. OBS ist doch schon mal 26, ja OBS ist schon. Ja ne, richtige Hackermein Trick. Der Chat ist immer begeistert von dem Trick. Microsoft Entwickler hassendiesen Trick. Du wirst nicht glauben, was dieser YouTuber macht. Microsoft Entwicklerhassen diesen Trick. HTML Hack, genau. Oh ja, Windows auf Arabisch, das wollte ich ja immermal installieren. Englisch International. Oder das Media Creation Tool geht natürlichauch. Jetzt kann man übrigens auch hier wieder raus machen, dann kann man runterladen. Ihh,das ist Platoon Musik, oder? Ich glaube ich bin der Einzige auf der Welt, das PlatoonMusik nicht mag. Oh, huge download speed. Massive Geschwindigkeit. Massive Geschwindigkeit.Ok jetzt gehts los. Microsoft hat sich gedacht, ok wir warten 55 Sekunden und jetzt kriegstevollen Speed. Diesen Trick kennt nicht mal Bill Gates. Das ist ein guter Titel. DiesenWindows Trick kennt nicht mal Bill Gates. Ich vermute mal Bill Gates kennt mittlerweiledie wenigsten Windows Tricks. Ich frag mich ja ob Bill Gates überhaupt selbst noch Windowsverwendet. 32-Bit, na das ist ganz klar. Ich hab nur einen 64-Bit Prozessor, deswegen nehmeich, ne das ergibt keinen Sinn was ich sagen wollte. Brain lag. Aber heißt das denn dannman könnte, man könnte mit einem 64-Bit Prozessor, könnte man dann 2x 32-Bit Windows laufenlassen? Oh, also quasi 2x Windows auf einem Core, weil 32-Bit und 32-Bit. Das ist ungefährgenauso viel wie FPS das männliche Auge sehen kann. Da wissen wir, dass es 12 plus 12 istfür jedes Auge 1, also für jedes Auge 12. Deswegen ist 24 das Maximum an FPS was mansieht aber auch nur mit beiden Augen auf. So ungefähr verhält sich das glaube ich mit2x 32-Bit Windows unter 64-Bit CPUs. Bill Gates macht hinten Features and Tricks in WindowsVideos. Das ist natürlich auch eine Frage, kann man mit 2x 32-Bit Cores einen 64-Bit BetriebssystemSingle Core laufen lassen dann? Fragen über Fragen. So ist der Kram jetzt nicht runtergeladen.Aber legen wir schon mal Windows Geschichte an. Vm. Next. Next. Next. Windows 10. Next.Nein, und nicht hier, sondern unter. Postchamp. Unter. E. Vms. Delete me. Oh, dass ich dasnicht vergesse nachher wieder wegzuschmeißen. Next. UEFI, ja meinetwegen. Wenn das die Fallfür Windows ist meinetwegen. 3 Cores sollten, ach komm scheiß drauf, 4 Cores Windows brauchtdas. Ich hab genug CPUkerne. Und 8G. Ach nee, das kann man hier gar nicht machen. Was istdas? Oh, ich kann mir das immer nicht merken. 8100, 96, 92. Ich kann das, ich kann allesvon 1 bis 4096. Des 8000er kann ich mir immer nicht merken. Wobei das eigentlich, da siehtman mal wie Boomer ich bin. Mittlerweile ist es eigentlich fast schon wichtiger. Manweiß alles oberhalb von 256. Weil drunter brauchen wir eh net. Nee, 8G anklicken gehtnicht gescheit. Also, oh doch. Ich dachte mal, man kann das anklicken. What the fuck.Ich hab immer gedacht man kann da nur sliden. Wusstet ihr das, dass man das anklicken kann?Ich hab da immer nur geslider antet. Ich bin nur Sliderman gemacht. Und man kann davorne draufklicken, das ist genau 8192. Cake wait. Wusste ich nicht. So, bam. Ja, not,next. Was? NVM, ja pff meinetwegen. Create new disk, 60G, single file, bam, bababam.So und der Drucker raus. Weiß ja nicht warum da immer standardmäßig ein Drucker drinist. Leute kennt noch einer das Problem, wo wir gerade beim Thema Drucker sind. Währendhier das erstmal in. Was? Nein. Genau, also was wollte ich jetzt sagen zu Drucker. Alsoich brauch meinen Drucker genau einmal im Jahr, wenn ich nämlich für den Steuerberaterein paar Sachen ausdrucken muss. Hi, hab einen Dankeschön für den Zapp. Nämlich wennich für den Steuerberater ein paar Sachen ausdrucken muss, weil der bewahrt die Sachenja bei sich auf. Und machen wir gerade VM in der VM? Nee, nee, nee, machen wir nicht.Und jedes Jahr ist meine Tinte eingekrustet. Und ich hab mir schon überlegt, sollte ichmir vielleicht mal einen Drucker kaufen, wo Tintenkrusten halt nicht eingeht. Also haltkein Tintenschralldrucker. Auf der anderen Seite bin ich halt der Meinung, ich druckeso wenig, es lohnt sich eigentlich überhaupt nicht einen neuen Drucker zu kaufen. Hat irgendwieeiner so richtig nice einen Trick, wie Tinte nicht mal einkrustet oder so. WSL läuft dochim Hyper-V oder nicht? Ja, hast recht, wir machen VM in der VM, ja. Aber das funktioniert.Das haben wir vor einem Jahr schon mal probiert, das funktioniert. Das einzige was man machenmuss, stimmt, gut dass ihr es sagt, das einzige was man machen muss, das hier muss man einschalten.Sekunde, das muss ich einschalten, sonst funktioniert es nämlich nicht. Gut, dass wir drüber gesprochenhaben Chat. Hi IQ Chat wieder. Ich muss ihm sagen, wir wollen das da machen. Porn. Dannmounten wir mal das Windows ISO. Achso, das ist das CD Laufwerk, jetzt checke ich daserst. ISO Image. Windows 10 ist der Kram. Ist der Download fertig jetzt? Ja. Connect.Jetzt die Stade. Windows install, auf gehts. Bäm. Das geht ja mittlerweile relativ schnell,vor allem aus dem laufenden System raus. Alter Business Laser Drucker, wie funktioniertdas? Die Idee ist eigentlich gar nicht so schlecht. Warum schickst du deine Unterlagen nicht perMail zum Steuerberater? Das ist eigentlich eine gute Frage. Ich glaube, das liegt zumgrößten Teil daran, weil ich so eine Mischung aus Real Life Beiträgen, Real Life Zettelhabe, wo ich keinen Bock habe, die umgedreht dann einzuscannen und elektronischen Sachen.Das darf German. Next. Install now. Jawoll. Was kosten sowas? Was kosten sowas hier?Laser Drucker, so ein alten Brother oder so. Was? 34 Euro? Achso, ohne Toner, ohne Toner.Moment, Moment. Keg Weight. Das kann nicht funktionieren. Ich will irgendwas für 20Euro, so ein billiges Ding. Das kann ich dann in die Abstellkamera stellen und einmal imJahr drucke ich da. Den stelle ich hier gar nicht ins Büro rein. Boah, das ist ja einuralt fettes Ding. Das ist ja, das wiegt ja schon 100 Kilo alleine. Im Surferraum habeich leider keinen Platz mehr. Normalerweise würde ich ja sagen, ich stelle das hier inmeine Abstellkamera, also Schrägstrich-Surferraum, aber wie ihr seht, da ist ja kein Platz mehr.Wo soll ich den Drucker hinstellen? Down of the Earth, da komme ich dann mal rein. Daist kein Platz mehr. Schraub den Drucker an die Decke, die Deckeist ziemlich hoch in dem Raum. Was, Laserjet? Rocky ist Schoki, drei Monate, Dankeschönfür den Sub. Von der Decke, nee das funktioniert. Ich weiß, dass G-Bade ist, aber ich denkeja manchmal auch an so abgedrehten Sachen, aber das klappt nicht richtig. Image of theday drucken, einmal im Monat, ja das ist eine gute Idee, da rostest du dich ein. Kannstdu deine E3-Config im Discord hochladen? Nee, du kannst aber auf mein GitHub gucken, daist die E3-Config. Boah, das ist ja noch ein altes, fettes, fetteres Teil. Aber wisstihr, was wir machen könnten, was fällt mir gerade an? Wie schwer sind denn so Dinger?Nehmen wir mal den hier, was hat das Teil für ein Gewicht? Während Windows hier am,boah, gehste fort. Nein, ich hab kein Produktkey. Was übrigens lustig ist, dass wir mittlerweile,früher musste man da immer, äh, by the way, hab ich euch mal erzählt, ich kannte den Windows98 Produktkey auswendig, weil ich es in der damaligen Zeit so oft neu installiert hab.Heute kannst du einfach klicken, ich hab kein Key und es geht trotzdem weiter. Okay, next.Äh ja, next. Wie alt bist du? 36. So, ähm, wie viel wiegt denn sowas hier? Gewicht? Kilogramm?Wo ist das, das steht doch da meist. Sag mal, hat eBay nicht normalerweise eine längereArtikel, eine ordentliche Artikelbeschreibung immer gehabt? Ah. Vollständige Information.Vollständige, hä? Was kosten sowas? Gewicht, die Dinger, so die alten Business-Dinger sindimmer massive, fett. Okay, sagen wir mal aufgerundet mit Papier und allem drin, mein Papier wiegen,ja, aber ich sag mal aufgerundet mit allem 20 Kilo. Ähm, ne, das funktioniert nicht.Da müsste ich ja hier quasi ein Regal machen, und hier hängt schon was an der Wand, da müssteich hier nebentran ein Regal machen, was groß genug ist und 20 Kilo aushält, dauerhaft.Ne. Ne, ich glaub, das ist keine so gute Idee. Dann stell ich den lieber in die andereAbstellkammer, kommt ein Raspberry Pi als Drucker so einfach dran und einmal im Jahrwird gedruckt. Weil, ganz ehrlich, wozu Drucker mit W-Lan-Funktionen kaufen, wenn man einfachüber den Raspberry Pi irgendwie drucken kann. Einfach den Drucker 3D drucken, ah yes. Derhat Netzwerk, ja aber ich hab kein Netzwerk in meiner Abstellkammer. Also ich muss dasin irgendeiner Art und Weise eh bridgen. Sag mal, weiß jemand, ob das funktioniert, wennman nen Drucker hat? Johnny, was? Leak? Ne, ich wollt grad sagen, ne, ich kann das nichtaussprechen, langsam. Wie sprich man das aus? Johnny Yekoto, zwei Monate lang, ich schüffelden Sub. Massive Subscriptions, hrq für den Chat wieder hier. Bessere Abstellkammer,sehr agiler Name, äußerst Agile. Mario XCB, Massive Sub, zwei Monate. Ah ja, gut, wennwir uns das noch am installieren, sehr schön. Und der Switch im Rack in der Abstellkammer,das ist nicht die Abstellkammer, das ist meine Säuferraum-Abstellkammer. Ich hab noch nenormale Abstellkammer, da würd ich den Drucker reinstellen. Hier ist ja kein Platz fürden Drucker. Hier wäre das auch kein Problem. Hat jemand eine Ahnung, ob das, ob man gescheitvon einem iPad oder generell von Tablets oder sagen wir mal von IOS-Geräten drucken kann?Ähm, zu einem Raspberry Pi Druckerserver, gibt's da irgendwie was? Wie nennen sichda Kram noch mal AirPrint oder AirPrint? AirPrint. Raspberry Pi Print-Server, Kubs und AirPrinteinrichten. Alter, die Musik! Ach, Dings. Ok, das funktioniert schon mal gut. Ich habnoch einen. Geht das Ding denn unter Linux überhaupt? Bevor ich mir sowas alles kaufe,öhm, Open Printing, der funktioniert mit Linux. Die Frage ist jetzt nur, trau ich demChat, wenn er sowas sagt. Was ist denn die offizielle Homepage von denen? Das da. Ähm,Support. Ok, ich muss mal kurz den Darkreader ausmachen, die Seite sieht. Uah, Flashbang!Sonnenbrille auf, äh. Sag mal. Sag mal, bin nur ich das oder sieht die Seite wirklichecht scheiße aus? So mit kaputter Schrift und sowas? Die sieht so kacke aus, ok. Diefür Baneschap, das ist richtige Baneschap-Seite. Jetzt geht der Darkreader wieder an auf Flashbang.Ok, Global Download Sender. So und jetzt lasst mich, Global Download Sender auf. Lasst michmal suchen nach dem Modell. Gibt schlimmere Seiten. Das hier sieht jetzt auch wieder okaus, aber das andere ist wirklich, äh, Europe. Wobei, ist doch eigentlich egal, oder? FürDriver Download ist doch vollkommen egal. Search Product hier. Da isser. Ähm, LinuxDriver. Linux Packages, als was gibt's das? Naja. What? Als Target Set. Was ist ok, Moment.Was ist denn dann da drinnen? Also erst mal Trial MB Driver oder sowas. Warum ist dasso groß? Na gut, dass das ganze Postscript gibt, aber trotzdem. Alter, what the fuck.Vielleicht geht's auch einfach, wenn man's anschließt, weil der Driver dabei ist. Weildas hätte echt nen Charme. So ein All is Office Ding. Druckt der denn überhaupt noch?Ist da alles dabei? Alle mit Toner. Der Download ist lahm, das lassen wir bleiben. Aber dasist ne gute Idee. Ich find, das ist ne gute Idee. Was kostenbar sowas versandt? Kostenlos.Ach, nice. Cool. Weil, ich glaub mir, ich hol mir so ein alles Ding. Mein Tintenstrahltruckergeht mir extrem auf den Sack. Ich mein, mein Tintenstrahltrucker hat zwar den Vorteil,der hat direkt Airprint und WLAN Geschiss drinne, aber, ähm, ja, yes, yes, yes, istkorrekt. Aber, des Eingrusten geht mir voll auf den Sack. Ich druck damit so wenig unddie Farbe brauche ich druck damit ja keine Fotos oder sowas. Kann sich noch jemand andie Zeiten erinnern, wo man voll im Trend war und so ein super High-Res-Farb-Tintenstrahltruckerhatte und sich dann extra Fotopapier gekauft hat, dann ne halbe Stunde gedruckt hat undneben dem Drucker gesessen hat und die Millimeter geguckt hat, wie das Papier rauskommt. Unddann hat man sich gefreut, dass man eben so ein nice, äh, nice Quality auf Fotopapierhatte, was im Prinzip voll von Arsch war. Wenn ich wirklich gute Quali will, dann lassich mir das professionell machen und ich drucke im Prinzip nie Farbe, jetzt auch nicht. Ichhab noch nichtmal Farbe drin in meinem Drucker. Ich hab nur Schwarz-Weiß-Patronen gekauftvom Trittanbieter. Aber das Einrosten und jedes Mal Kalibrieren und so geht mir vollauf den Sack. Ich will einfach einmal im Jahr, wenn ich Steuererklärungs-Sachen mache, fürden Steuerberater ein paar Sachen ausdrucken. Das ist dann auch nicht viel. Lass es mal20-30 Seiten sein. Einfach irgendwelche Belege noch mal raushauen und das dann, ich willeinfach drucken können, ohne mir Gedanken machen zu müssen. Okay, das ist so ein typischesWindows-Ding, was ich wieder nicht kapier. Guck mal. Der hat mich 5 Mal gefragt und ichhab gesagt, ich bin in Germany. Ich hab German Currency. Warum schlägt ihr mir standardmäßigjetzt Keyboard-Layout United Kingdom vor? Warum nicht einfach Germany? Und warum kannich hier drinnen nicht G drücken für Germany? Was denkt sich Microsoft bei solchen Dingern?Paints-Champ. Zum Glück ist es nicht auf Französisch standardmäßig.Du hast alle Level 1 Emotes gesammelt. Wow, nice. Steht grad bei mir in Twitch.Das heißt, du musst Multicast-Forboding machen, wenn Wi-Fi und Drucker an unterschiedlichenSubnetzen sind. Nee, das passt ja. Deswegen würde ich auch ein Raspberry Pi ins WLANhängen. Direkt an den Drucker dran. Das würde ich ja irgendwie bridgeen oder so. Mal gucken.Bin schon nicht ganz sicher. So, what do you like to set up for personal use? Next. Jetztsagt er gleich Microsoft-Account. Das ist auch wieder so typisch. Das ist auch wiederso eine richtig krasse Microsoft-Debate-Geschichte. Let's add an account. Und du denkst dir jaschon mal nichts Böses und sagst dann, lul, weh, bla, bla, bla. Und dann sagst du next.Und dann sagt er, hä? Valid email-Attress. Ah, der erstellt ein Microsoft-Account. Dannmuss man erst hier unten auf offline-Account drücken. Dann sagt er, oh nein, wollen Siesicher einen offline-Account? Ja, ich will eine limited experience haben. By the way,was ist eigentlich limited an dieser experience? Außer, dass ich weniger Sachen an Microsoftschick? Gute Frage. Kannst du was zu sagen? Einfachster Weg, um einen Windows-Server externerreichbar zu machen. Also das erste, was ich machen würde, ist gar nicht. Ich würdeeinen Windows-Server niemals ins Internet stellen. Es sei denn, du hast wirklich sehrgute Gründe für das zu machen. Wir gehen jetzt einfach mal davon aus, die hast duund willst das wirklich machen. Also die einfachste, die beste Variante, einen Windows-Serverins Internet zu bringen, ist, einen Linux-Server davor zu stellen. So. Aber wenn du das wirklichmachen willst, dann ist die Frage, hast du eine statische IP, dann ist die Frage easy,da musst du gar nichts machen, außer Port weiterleiten. In der Regel kannst du eigentlichnur Dynamik-DNS machen. Der Anbieter ist egal. Du kannst hier einen Duck-DNS machen, du kannstüber Cloudflare-DNS-Dinger machen oder so. Du musst aber halt auf jeden Fall Ports weiterleiten.Und ich würde es nicht machen, ehrlich gesagt. Ich würde es nicht machen. Aber wenn du esunbedingt machen willst, dann ist DNS und im Heimbereich die einfachste Variante. Ichmeine, auch wenn Kabelanschlüsse so gut wie statisch sind mittlerweile, aber die wechselndoch mal. Werdet du es elf Monate, du bist eins vor Hyper-Subscriber. Dankeschön fürden Sub. Und wie läuft es bei euch? Wird gebashed? Hoffe ich mal, dass es gebashed wird. Ichhab gesehen, ihr sucht zwei neue Leute. Vielleicht doch nicht so gebashed. Keine Ahnung. Aberich hoffe, es läuft alles gut bei euch. Static-IP ist ja meistens sinnlos daheim. Dir bleibtnichts anderes übers wie das über DNS zu machen. Aber ehrlich, ich würde keinen Windows-Serverans Internet stellen. Hey Maxi Schreiber, Montag eine Online- und IT-Rechtsklausur. Hast duirgendwelche Tipps? Ich hab von Online- und IT-Rechtsklausur keine Ahnung. Nee, hab ichnicht. Ok, Local-Account-Test. Dienstag ist VCT. Was ist denn VCT? Valorant? Tournament?Valorant? Was ist denn das C? Contenders Tournament? Nee, keine Ahnung. Champions Tour. Ah. Ok.Chat, ihr werdet nie mein Passwort erraten, was ich vergeben hab. Da kommt ihr nicht drauf.Wie habt ihr das erraten? Wie konntet ihr das Passwort erraten, Chat? Ist doch gar nichtmöglich. Hallo123? Die Story mit, ne doch die Hallo123-Story hab ich ja schon erzählt,ne? Wo ich mal bei GMX nen Account fast verloren hab, weil ich Hallo123 hatte. Ist aber schonJahre her. Or even better use an Online-Account. Nein. 1. Mein erstes Haus, die hieß 1. Ichbin in der Stadt 2 geboren und mein Nickname früher war nicht etwa Max oder so oder Maxioder sonst wie. Nein, sondern 3. Letztens war ich im Freien. Es kommt immer noch vor,also mal an frischer Luft, ja. Und da hat ne Mutter ihr Kind gerufen und das Kind hießMaximilian Tiberius. Dachte ich mir, ok. So vor 2000 Jahren im alten Rom wäre der glaubeich voll im Trend gewesen. Also das ist so ein typischer Römername. Wobei es wahrscheinlicheher Maximus wäre bei den Römern. Maximus Tiberius. Maximus, ne warte mal, wie hießder Gladiator? Maximus Dezimus Meridius, glaube ne. Maximus Dezimus Meridius, wie hieß derGladiator? Maximus, verstands doch. Maximus Dezimus Meridius war der Gladiator, genau.So n Scheiß merke ich mir, ne? Weil ich gestern gegessen hab, weiß ich schon immer. LollongosSchwanzos. Bigges Dickes. Ich muss ja ehrlich sagen, die Sachen sind ganz witzig, aberso diesen, den riesen Kultfilmhype um die Sachen versteh ich nicht. Die sind ganz witzigteilweise, aber jetzt so der Brüller einer, ich weiß es nicht. Also vielleicht ist einfachnicht so 100% Schweinhumor. Nein, wir wollen keine Speech Recognition haben. Wir wollenauch nicht die Location sharen. Wir wollen auch nicht mein Device finden. Wir wollenauch, übrigens das ist auch immer was tolles im Windows Setup. Man kann nicht, man kannnicht einfach sagen, ich will nichts zu Microsoft schicken. Diese Sachen, also diese Optiongibt es nicht. Also es gibt bloß die Option, ich will wichtige Sachen schicken und zusätzlicheSachen oder ich will nur die wichtigen Sachen schicken. Ne Option, ich will gar nichts anMicrosoft schicken ist nicht im Scope, wie man so schön sagt. Das gibt's net. Nein,ich will das nicht improven, ich will auch nix da. Alter, das ist so ätzend, diesesrumgeklick am Anfang immer. Es gibt A-Entschließungsinstall Speedruns gibt's. Echt? Zeig mal, da mussmir ein Link schicken, das müssen wir uns angucken. Nein, Cortana. Hallo. Früher hatCortana jetzt immer angefangen zu labern. Zum Glück ist das vorbei. Hi, I'm Cortana.Zum Glück shuttet die ab mittlerweile bei der Installation. So, ich werde das da einrichten,ich wollte gerade noch mal Chat lesen. Also, ne, kann ich dir nichts zu sagen, ich hab keineAhnung von online und IT Recht. Die labert nur in der Pro nicht mehr. Ernsthaft, istCortana in der Home Version noch am Start? Was würden eure Consultants auf die Fragebeantworten? Ich weiß gar nicht mal, um was es geht, deswegen kann ich jetzt nicht beantworten.Das ist das Problem, also sobald mit dem Chat hinten dran ist. Ja, wer hat das noch malgefragt mit dem Windows Server? TroM. Kann da jetzt noch eine Begründung, warum er seinenWindows Server ins Internet stellen will? Richtige Hexer setzen gar keinen Passwort,ich glaub das geht nicht. Bis denn, machs gut. Ja, jetzt wo du es sagst, ich überlegs mirnoch mal. Das, ja, ich versteh auch, ich, ganz ehrlich, das wäre mir viel zu anstrengend,wenn ich mein Kind immer Maximilian Tiberius rufen würde. Das würd ich nur machen, wenner was angestellt hat. Ich würd, ich würd den wahrscheinlich, ich, ich, also, ich würdmein Kind schon mal auch aus Prinzip nicht, nicht Max nennen. Das fänd ich irgendwieblöd. Max Junior oder so dann. Höchstens als Zweitname oder so, eventuell. Ich, ichwürd den dann immer so nennen, wenn er was angestellt hat. Aber ansonsten, und ich würdmein Kind wahrscheinlich auch nicht Tiberius nennen. Arch Linux Installation Speedrun,das gibt es ernsthaft? Okay, das muss man zwar, das geht nur zwei Minuten, das müssenwir uns jetzt mal schnell angucken, während Windows installiert. Da, da, ich seh da abernoch einiges an Optimierungspotenzial. Und ob das die optimale Route ist, weiß ich, magich auch zu bezweifeln. Und das ist das der Weltrekord? Playback Speed is increased. Dasist gecheatet. Und außerdem der hat keine Splits? Der hat keine Splits? Oh, ohne Splitskeine Speedruns. Was, was? Echo, was? Ah, W. Ah, der, der, der macht äh, Partitionierung.Das ist, das ist die, das ist die Big Brain Variante, ne Festplatte zu Partitionieren,was der Typ da grad treibt. Ah, das ist langweilig, aber das kann man sicherlich noch optimieren.Ich glaub, ich glaube, ich glaube, da werd ich auch mal nen Speedrun Attempt machen.Aber mit richtig echtem Splits. Arch Linux Speedrun World Record Pace. Hier ist, derhier ist 1.10 Realtime. Hier. Ok, jetzt gehts los. Arch Speedrun World, World Record. OkMoment, kurz, ich muss, ich muss, ich muss die Tippgeräusche hören. Moment, das istin der VM, wo er das macht, aber ok, würd ich auch machen. Der hat aber Splits, immerhinhat er Splits, oder nicht wirklich Splits, aber nen Counter. Äh, Corsair RGB Tastaturmuss schon mal sein. Wow. Ok, der hat schon mal nen bisschen anderen Pace drauf als derRest. Der, der macht es richtig. Das, man kann nämlich schon den Befehl eintippen, dener danach ausführen soll, während der Installation, also während das andere Kommando läuft, kannman schon weiter tippen, das geht. Guckt der da oben ab? Ich glaub, da oben schreibter, da schreibt er ab. Aber was ja auch legitim ist. Genauso musst du es machen, schon denrestlichen Scheiß eingeben, bevor die Installer, genau, und dann ausführen, direkt wenn dieInstaller fertig ist. Siehste, das hat er alle schon eingetippt vorher. Und jetzt BÄM. Dasist ja schon hier Arch Linux Speedrun Install in einer Minute 10. Der hier ist auch krass.Leute, ihr vergesst, ich hab nen Addon, was mir anzeigen lassen kann, welche Links wases gibt. Da hab ich sofort erkannt, dass das ein Recroll ist. Nen Wupploh aus. So, istWindows da, jawoll. Ihh, Edge. Das ist so ne Windows Logi, frisch installiert, ne, undschon am meckern über irgendwas, was... Windows, was willst du von mir überhaupt? Edge istPangeChamp. Ja, wir müssen erstmal schnell auf Vmware Tools installieren, dass ich dasDing im Vollscreen hab. Auf, auf, Vmware Tools, gib alles. Ja, install. Setup64exe hört sichimmer sehr vertrauenserweckend an, wenn man den ISO mountet und es dich fragt, ob du Setup64exewieder ausführen willst. Next, next, next, jawoll, ach so Musik anmachen. Wir hattenletztens, wo wir gerade bei Internet Explorer sind, wir haben so ne richtige PangeChampZeiterfassung auf der Arbeit. Die ist richtig PangeChamp, die sieht doch aus wie 1995,ne? Wahrscheinlich ist die von 1995. Und die haben sie geupgraded. Kennen die noch im Silverlight?Klar, klar. Ähm, was wollte ich jetzt erzählen? Genau, also, die haben sie geupgraded, diesah jetzt immer noch aus wie 1995, die Zeiterfassung Software, aber sie haben ein bisschen wasam Layout geändert und das hat Kompatibilität mit dem Internet Explorer kaputt gemacht unddie mussten ernsthaft das Update zurückrollen, weil sich Leute beschwert haben, die Seitewürde nicht mal so aussehen wie sie das kennen. Das muss man sich echt mal vorstellen. Alsowir haben Leute, die benutzen täglich bei uns auf der Arbeit noch den Internet Explorer.Das ist schon PangeChamp, oder? Ich weiß gar nicht, was die da wollen. Und dann, dassind die gleichen Leute, die sich da drüber beschweren. Ho, Windows fühlt sich aber wiederso langsam an. Nein, das ist nicht Windows, was sich langsam anfühlt. Das ist der InternetExplorer, der nicht zurecht kommt mit modernen Webseiten. Ja, Bubble bringt ja bei CSS abernix. So, da sind wir. Bäm, installiert. FPS Anzahl, klar. Komm, man muss schon wissen,guck mal, wir aktualisieren gerade unseren Windows Desktop mit. Gucken, ob ich das schnellerhinkriege. Pass mal auf, wir machen jetzt Microsoft Desktop Aktualisierung Speedrun. Oh nee. Moment,wir müssen vorher noch eine Sache machen. Exclusive Mode, sonst packts rum. Auf wievielHerz? 60 Herz. Bäm, vielleicht krieg ich schneller hin. Das kommt mehr als 60. WievielHerz gehen wir maximal? 64, 64. Gib alles, gib alles. 63. Arme tut weh. So, wunderbar,63. Gib es vielleicht so besser hin. Wusstest du gar nicht, dass die Vmware Grafik hattemehr als 60? Kann? Ich auch nicht, wahrscheinlich ist das einfach nur eine Anzeige-Bug gewesen.Wieviel kann? Steht das hier irgendwie? Wieviel die maximal kann? Das ist mal, Leute, ichbin mittlerweile unfähig. Ach hier, kannst du die... Ich weiß nicht mal, wo ich überhauptRefresh Rate einstellen würde. Hier, 60, mehr geht nicht. Da steht aber einstellen.So, also, jetzt erst mal dieses Windows Ding weg und als erste Amtshandlung, die wir machenmüssen, ist... Nein, erste Amtshandlung, die wir machen müssen, ist Chrome runterladen,oder Firefox, oder was auch immer. So, wir nehmen Chrome, aber please den englischenChrome, nicht den deutschen. Falsch, wir richten ein MS-Konto ein. Okay, wenn der Chatunbedingt Firefox will, machen wir Firefox. Warum kommt als erstes Opera, wenn man nachFirefox sucht? Ah ja, von Chip natürlich. Ich will aber den Firefox nicht als DE runterladen,sondern schon als US, genau. Okay, Firefox Installer. Moin, Kengin. Nee, N-Nightzackt.Was heißt Zackt? Mag ich nicht. Ich benutze eigentlich zum größten Teil nur Scoop fürSachen zum installieren und ansonsten klassische Windows rumgeklicken.So, jetzt kann ich den Edge gleich wegmachen. So, Firefox installiert, zack. Bam. So, wiestellt man nochmal die Fault-Apps um? So ging das, glaub. Die Fault-Mail-App für Browser.Wisst ihr, was ich geil finde? Das ist alles Taktik von Microsoft, Leute. Ich sag's euch.Ich weiß, man kann hier als Use-Default machen. Die haben den Browser als allerletztes untenund das haben die garantiert, dass die meisten Leute es nicht sehen, in der Hoffnung, sieverwenden weiter Edge. Nein. Geh mal nicht auf den Zack-Switch. Dazu kann ich nur sagen,Microsoft. Und jetzt erstmal unpin löschen. Okay, jetzt können wir, jetzt können wir,jetzt kann wir nichts mehr machen. Also, ehrlich gesagt, ich vergesse jedes Mal, wie man jetzt,wie man WSL 2 installiert. Ich muss das jedes Mal nachgucken, weil das ist ja nicht so einfachwie WSL irgendwie installieren. Früher musste man da, ich bin mir nicht sicher, ob man dasimmer noch musste, man musste in Turn Windows Features on off und dann musste man in, damuss man hier in den Häkchen hin machen. Keine Ahnung, ob das immer noch so ist. Wir guckenuns mal das offizielle How-To an. Muss immer noch als Feature aktivieren. By the way, wennihr mal kecken wollt, ein Telnet Client ist unter Windows ein additional Feature, wasman erst über das alte Systemsteuerungsmenü aktivieren muss. Ja, ist ja auch ganz schönund das war es zu einem Telnet Client. Kann man nicht erwarten, dass er dabei ist. Ister eigentlich Candy Crush und das gedürnt es noch drauf? Oder installiert er es in derPro-Version nicht mehr? Das ist so viel Mist, ehrlich gesagt, da schon wieder dabei, wasich nicht verwende. Paint 3D. Gibt es überhaupt irgendjemand, der wirklich Paint 3D verwendet?Also ich verwende Lull 3D, aber nicht Paint 3D. Firefox oder Chrome, was ist besser? Ichbin langjähriger Firefox Fan und ich verwende unter Linux eigentlich auch immer noch standardmäßigFirefox, aber ich muss sagen, für den täglichen Gebrauch hat Chrome bei mir auf dem DesktopFirefox abgelöst. Firefox hat immer noch den Vorteil, dass ich die Adressleiste standardmäßigbesser finde, weil die Historie Favoriten und alles Mögliche durchsucht und man da teilweiseSeiten findet, wo man vor 10 Jahren mal drauf gewesen ist. Das ist wirklich nice. Aber allesin allem muss ich sagen, gefällt mir das Handling vom Chrome besser. Geschwindigkeitsmäßigwürde ich sagen, ist der Chrome auch ein bisschen besser, wobei sich das Ganze nichtallzu viel nimmt. Schwer zu sagen. Hat beides seine Daseinsberechtigung. Ich mag halt Firefox,also Firefox hat mich, wisst ihr, ab wann ich gesagt habe, ich verwende auf dem Desktopkein Firefox mehr, beziehungsweise stimmt ja, ich verwende ja auf dem Desktop noch Firefox,wann ich gesagt habe, ich verwende auf meiner Standardinstallation kein Firefox mehr. Daswar zu Firefox, ich glaube 48 oder so oder 58, wo sie die, wo sie die Pluginschnittstellenabgeschaltet haben. Firefox 59, was 59? Able old addons, mit was kam das denn? Ist dasnoch zufällig jemand? Ich glaube, ich glaube, das war, ich glaube, das war 58. Nee, 58,das ist zu kurz, das muss, muss schon ein bisschen länger gewesen sein. 48. Zumindesthaben sie es da geschafft, NoScript kaputt zu machen und NoScript war für mich damals,äh, ah hier, Firefox 48 war es, genau. So und die haben quasi NoScript komplett kaputtgemacht. Das war Firefox 48, ja, genau, genau. Da haben sie nämlich auch was zugeschrieben.Genau, das war 48 und das Problem war, ich, ich habe das damals für absolut notwendiggehalten, dass man NoScript verwendet. Ich finde das immer noch notwendig, aber es gibtdamit mittlerweile ein paar einfache Dinge zu handhaben. NoScript musstest du jede einzelneSeite erlauben, sonst wie. Mittlerweile gibt es NoScript, doch es gibt wieder NoScript,wobei ich nicht weiß, ob es jemals wieder so nice funktioniert hat, wie die alten NoScriptVarianten unter Firefox 48. Das weiß ich nicht mehr, weil es ging eine ganze Weile NoScriptnicht richtig und deswegen habe ich gesagt, scheiß drauf, wenn die so einen Kack machen,kann ich auch Gleichchrom verwenden. Ist U-Matrix nicht tot? Ich weiß nicht, ob das tot ist.Das ist anscheinend tot, doch. Warum? Ja, aber das wird nicht mehr geupdatet, warum nicht?Ach so Moment, New Tracker. Ist der Support eingestellt? Ich weiß, dass es, ich habe dasgesehen, aber die meisten schreiben ja wenigstens noch was hin, warum das eingestellt ist.Grip U-Matrix, okay. U-Matrix. Hat er sich da geäußert irgendwie?I don't have time to work on U-Matrix. Okay, ja, Grip. Zu viele negative Kommentare vonder Community. Ey, das wäre ein Punkt, also wenn das der Fall wäre, das könnte ich tatsächlichverstehen, weil die Community, die Leute sind teilweise echt undankbar, gerade in OpenSource Projekten und was immer witzig ist, der, na gut, wer auch immer übelst angepisstist, ist der VLC-Maintainer, der kriegt auch immer richtig dumme Kommentare und es gibtjedes Jahr eine Diskussion um den Weihnachtshut. Das ist richtig Pain's Champ, Leute. Wennihr mal richtige, nervige Pain's Champ-Menschen auf einem Haufen sehen wollt, lest euch dieFormthread im VLC zu dem Weihnachtsmann-Hut durch. Das ist extrem Pain's Champ, das gehtüber mehrere, das ist übrigens das Falsche, es gibt noch mehr Diskussionen, die teilweisebis ins letzte Jahr gehen und sowas. Das ist Massive Pain's Champ. Mir ist nicht richtigverständlich, wie man sich an einem Weihnachtsmann-Hut stören kann. Ja, ich habe auch manchmaldas Gefühl, ich kann nicht verstehen, wie man solche Probleme haben kann. Hat VLC immernoch dieses altbackende UI? Ja. Aber das funktioniert ganz gut. Es ist halt wirklichvoll der Witz. Zumal man sogar in den Settings ausschalten kann. Aber ich verstehe gar nicht,warum man über sowas diskutieren muss. Das ist einzig und allein die Entscheidung vondem, der den Kram entwickelt. Und wenn der sagt, er will da einen Weihnachtsmann-Hutdrinne haben, dann hat er halt einen Weihnachtsmann-Hut drinne. Ich reg mich auch nicht auf darüber,auch wenn ich der ungläubigste Typ auf der Welt bin wahrscheinlich. Ich reg mich auchnicht über den Santa-Hat auf, ich würde mich auch nicht darüber aufregen, wenn der Typsich da irgendwie, keine Ahnung, das Spaghetti Monster oder sowas. Das wäre mir vollkommenegal. Ich würde die Software verwenden und im Zweifelsfall würde ich es abschalten,wenn es mich zu sehr nervt. Naja. Hast du mal das geplante neue UI von VLC gesehen?Nein, habe ich nicht. Warum gibt es auf omg-ubuntu eine Anleitung, how to install vsl 2? Weiles obuntu ist wahrscheinlich, ne? Standardmäßig. Sorry, nicht obuntu, ich werde es korrektaussprechen, ich habe recht. Jubantu natürlich. Das ist der aktuelle Zeitgeist gerade. Lilo,das ist der aktuelle Zeitgeist gerade. Man ist überall empört. Das ist leider aktuell so.Egal was es ist, Leute sind überall über jeden Scheiß und jeden Furz empört. Und natürlichgeht man lieber ins Forum und hatet rum, anstatt das Icon einfach abzustellen. So, also wiegeht es jetzt? Install vsl 2 on Windows 10, sage ich her. Omg, jubantu. Ich will wissen,ob das immer noch so funktioniert, wie ich mir das, wie ich das, über das Feature MenüEnable vsl, ah PowerShell. PowerShell ist jetzt der neueste Shit, ok? Ok, das ist im Prinzipdas gleiche, was ich über Skui gemacht hätte. Wir machen das jetzt über PowerShell. CooleLeute machen das. Leute, wisst ihr was wir vorher machen? Ballade die 3 Monate Dankeschönfür den Sub. Exzellent Subscription. Um nichts zu sagen. Massive. Das Ubuntu tutorial istfür Anfang 2000. vsl 2, Microsoft können wir auch gucken. Was ich machen will, wirinstallieren jetzt das neue Windows Terminal erstmal. Ne ne ne ne, das neue, wir machenheute Microsoft Only. Windows Terminal, wir installieren das neue Windows Terminal. Dasneue, worüber man sich ja eigentlich schon, da sieht man mal, wenn so ein Projekt 72.000Sterne kriegt, für ein Terminal, was im Prinzip immer noch schlechter ist, also nur nach 15,nur nach 15 Linux Terminal, sieht man mal wie painstampig das alte Terminal eigentlich war.Ich meine, das hier ist ja nur wirklich eine Beleidigung für jeden, der im Terminal wastippen will. Ja, es gibt ein neues. This repo-cont, install and running. Man kann über GitHubinstallieren, aber den Microsoft Store, ok, wir gehen in den Microsoft Store, herunterladen,jawoll. Ich hoffe, ich brauch dafür keinen Microsoft Account. Get, hallo, get. No, einfachrunterladen. You own this app, sehr schön, dass ich die owne. Ein, aha, einfach abbrechen,null. Launch. Jetzt pinnen. So, da haben wir das neue Microsoft Terminal. Standardmäßigauch schon eine PowerShell am Start, sehr gut. So muss das sein. Chat gucken, ich glaube,ich hab nicht irgendwas übersehen. Shithub, genau. Ja, wie gesagt, es gibt ein neues,das ist benutzbar im Vergleich zu dem alten wenigstens. Ich glaube schon, dass bei WSLdie Ubuntu Leute mit dabei sind. Ja, bin ich für mal ein, dass ich das auch irgendwogelesen hab. Chrome oder Chromium? Das hier ist ein Chromium. Aber ganz ehrlich, dem Standard-Userwürde ich tatsächlich ein Chrome empfehlen, weil gerade für Windows, da gibt es SecurityUpdates einen Ticken schneller aus wirklich richtig offiziellen Google-Quellen und so Sachenwie GPU-Beschleunigung und sowas funktionieren, was bei mir hier Probleme macht. WinGet kannimmer noch nicht den selenialen Microsoft, ey. Also Windows ist wirklich in manchen Belangenzehn Jahre plus hinter Linux. Umgedreht ist Linux auch in vielen Belangen zehn Jahreplus hinter Windows. Leider gibt es noch nicht das perfekte Betriebssystem für alles. Deswegenist es ganz einfach, einfach den Linux installieren in der VM, so wie hier, und rüberswitchen.Easy. Beste Variante. Windows Host und Mac OS, nee, auch nicht wirklich. Du hast unterTemple OS kommt der Sache am nächsten, ja. Du hast unter Mac OS zwar den Vorteil, dassdu viele Unix-like-Programme verwenden kannst, standardmäßig einen ziemlich alten Varianten,aber gibt's ja auch zum Updaten. Dafür hast du halt schlicht und ergreifend viele Windows-Softwarenicht. Also sprich, du hast beispielsweise keinerlei Spiele. Wie hast du deine Taskbarso geändert? Gar nicht, das ist die komplette Default-Taskbar. Ich hab das Ding gerade frischinstalliert. So, also wie geht das Ganze jetzt? Installieren das WS des Windows-Subsystems?Wir machen das nach der Ubuntu-Anleitung, die wissen, wie das geht. So. Also, Enable.Dism. Alles klar. M. Wir müssen als erstes in diesem Terminal nochmal ordentlich waseinstellen. Settings. Was? Ich muss eine extra App für Settings installieren? Ach,das ist Jason-Settings-Files, oder? Ach so. EGit Notepad. Ich wollte eigentlich nur denFont ändern. Wie kann ich den Font ändern? Scheint schon wieder hochkomplex zu sein.By the way, warum hat Windows eigentlich nicht einen standardmäßig gescheiten Editor dabei?Ich mein, die haben doch jetzt VS Code am Start. Installieren wir auch nochmal, wo wirgerade dabei sind. Wo wir gerade dabei sind. Komm. By the way, hat irgendjemand eine plausibleErklärung dafür, warum es Wishlist Studio Code nicht im Microsoft-Store gibt? Wenn ichauf VS Code suche, bekomme ich hier Heartbeat Romance Club. Warum gibt's den Kram nichtim, warum gibt's den, warum gibt's das nicht im Store? Sagt Microsoft dadurch nicht quasiindirekt, fuck den Windows-Store? Microsoft Romance Club. Ja, das glaube ich auch, diewissen selbst, dass der Store scheiße ist. Wishlist Studio selbst und sowas geht ja auchnicht über den Store, wobei es gerade dafür sinnvoll wäre, den Kram zu updaten. So, kannich jetzt, kann ich jetzt Settings von meinem Terminal ändern? Wishlist Studio Code exquisite.Okay, wie, jetzt gibt's die große Preisfrage. Windows Terminal Font. Wie kann man, wie kannman die, wie kann man hier die Schriftart und Größe und so ändern? Hat das ein Autocompleteoder sowas? Ah ja, anscheinend Autocomplete, okay. Also, Format, nee. Font, hm. Tja. Font,geht schon mal nicht. Font, äh, gibt's anscheinend nicht. Okay. New Windows Terminal, ChangeFont. Einstellungen aufmachen, das sind die Einstellungen, die haben kein Einstellungsmenümehr. Was unter Profiles? Was? Profiles? Ah, hier. Ah, put settings here that you wantto apply for all, okay. Font. Ah, Font Face. Cascadia Mono, ist das Standard, ne? Okay,hat das, hat das hier Autocomplete? Nee, natürlich nicht. Aber Hack, ich hab Hack nicht installiert.Hack Font. Oh, what? Okay, probier mal Font, Font Size aus, 20. Wow. Thick. Wenigstensupdatet es gleich. Oh, 16. Bam. So, so mag ich das. 14. So, okay, wir lassen jetzt denDefault von, ich wollt bloß mal gucken, wie man da was umstellt. Also, WSL installieren,bam. Oh. Ach nee, ich muss, Moment, ich muss als Admin starten. Ich muss als Admin, kannman hier raus direkt was als Admin starten? Nee, ne? Siehste mal, das wär zum Beispielne sinnvolle Funktion, die es anscheinend so standardmäßig net gibt. Das heißt, ichmuss jetzt den Kram komplett als Admin starten, oder wie? Pass Control und Shift. Okay, ichmuss mal gucken. Okay. Features werden enabled, sehr schön. So, enable virtual machine platformrequires, alles klar. Wir haben ein neues Window, das passt. M, X. Hack Font, Hack Fontist der beste, seh ich auch so. Okay. Was gesudo? Das ist was, was man nachinstallierenmuss, oder? Wahrscheinlich. Wir installieren jetzt mal Package Manager und Ordentlichenfür Windows, install methods, jawoll. Und dann installieren wir was, gesudo. Boah, dasist schon wieder so ein richtiges Rumgefrickel hier. Was? Ah ja. Es jit, jit muss ich installieren.Okay. Was gesudo? Ey, das gibt's da wirklich. Gesudo und dann, und dann wie? Und dann was?Und dann Explorer, oder was? Ah. Okay, das ist in der Tat ganz praktisch. Kann ich daauch Kommando-Zeilen-Programme damit ausführen? Also sagen wir mir ls, gesudo ls. Hey, dasist tatsächlich ganz nützlich. Ein ordentliches Sudo für Windows, das ist ja mal richtigpoggers. Nice. Okay, können wir weitermachen mit WSL? Also, das haben wir gemacht. Enablevirtual machine, set WSL als Default. Gesudo, machen wir das jetzt einfach mal hier so.Aber dass er jedes Mal fragt, ist auch schon echt ätzend. Oh. Was ist kaputt? Muss ichdoch als Admin ausführen noch mal? Muss man rebooten? Stand das da, dass man rebootenmuss? Restart your system. Na gut. Warum haben die dann bei dem letzten Kommando no restartangegeben, wenn man doch danach eh restarten muss? Winnerslogik. Egal, wir rebooten maleine Runde. So muss das sein. Exquisite Reboot. Was ist besser? Das Emote, wo er sich nichtbewegt oder wo er sich bewegt? Weil eins von beiden will ich rausschmeißen. Beide brauchennur nicht. Wo er sich bewegt, ist besser, oder? Ich hätte ja gerne die Fast Food Variantemit Animation. Die würde ich sofort reinnehmen. Die würde ich sofort reinnehmen, wenn essie mit Animation gäbe. So. Und jetzt? Wie geht's weiter? WSL. Was stehen wir? WSLDefault Version. Und jetzt? Please Wizard. Okay. Wie macht man links hier auf? Wie machstdu denn dieses Swipen in der VM? Was meinste? Du meinst das Wechseln zwischen Host und VM?Ctrl, Alt, Pfeil rechts, Pfeil links. Ich hab auf dem Desktop meine VM und hier denanderen Kram und ich kann einfach mit Tasten Kombination wechseln. Okay, wie installierich jetzt? Warum ist das hier nicht Science and Technology, weil ich nicht umgestellthab? Ja, Splixer kann ich, das kann ich alles machen. Das ist bloß die Frage, wo das steht.Also mal angenommen, ich hätte jetzt keinen Chat, der mir helfen kann. Ah, Please WizardKernel. Okay, das haben wir gemacht. By the way, warum kann er nicht einfach den altenKernel starten und dann sich upgraden und selbst downloaden? Okay, es ist Windows, dasdarf man nicht zu viel erwarten in der Richtung. Paints Jap. Ja. Ja, hab ich gemacht. Okayund jetzt? Darf ich jetzt? Ah, yes. Sehr schön. Muss ich eigentlich überhaupt mitSudo machen müssen? Nee, anscheinend nicht. Okay, passt, es ist ja gerade installiert.Set WSL2 as your default version, install your Linux distribution of choice. Okay, dasheißt, jetzt geht man in den Store und sucht... Was ist denn da oben los? Was will der dennvon mir? Wenigstens kein Candy Crush am Start. So und jetzt Ubuntu. By the way, warum lädter den Kram? Okay, den Sinn muss mir jetzt mal einer erklären. Man lädt das über denMicrosoft Store runter, aber die Sache updaten kann man nicht über den Microsoft Store.Das muss man nicht verstehen. Ubuntu 20.04, jawoll, komm her. 20.04 LTS. Moment, wasist, was ist das hier? 9 Euro Virtualisierungskram. Ich bin ja immer begeistert, wie viel Schrottes im Windows Store gibt. Powerful Simply Virtual Machine. Ist das, ist das ein Frontendfür Virtual Box? Er scheint mir recht Paynes-champig zu sein. Was, run Mac on Windows? Äh. RunMac on Windows, okay. Das ist, das ist gar maß. Wir haben es ja schon mal ausprobiert.Vielleicht auch ein Hyper-V-Freund, wir haben es ja schon mal ausprobiert. Mac läuft virtualisiert.Naja, man kann Sachen drin ausprobieren, aber schön ist es nicht. Was ist Reft? Istdas auch hier ein Distro, oder? What the fuck? Es ist schon mal geil, ne? Bevor steht, wases ist, bevor da steht, was es ist, ist erstmal Payment. Ein Distribution Manager. Warum sollich ein Abo kaufen für einen Windows WSL Distribution Manager? Warum denn Abo? Was ist denn da wiederlos, ey? Eine Güte. Okay, also jetzt sollen wir den Kram hier installieren. Okay, machenwir. Gucken, ob wir auf der richtigen Seite rausgekommen sind. Also ein hässlicheresLogo hätten sie ja nicht nehmen können, oder? Also ein hässlicheres Logo, wirklich. Istdas mal ernsthaft. Das sieht aus, als hätte es irgendjemand mit Paint 3D gebaut. Wahrscheinlichwar mit ihm verboten, das mit Paint zu bauen. Das ist, das ist das normale Ubuntu Logokopiert auf einen absolut unpassenden blauen Hintergrund. Nein. Sieht aus, sieht aus wieein Scam Download, ja? Echt so. Okay, Ubuntu wird installiert. Get. Install Windows Termin,das haben wir schon gemacht, haben wir schon gemacht. Geh weg. Genau, mal gucken, ob derdas automatisch erkennt jetzt. Ups, ah. Okay, ich schließe, ich schließe das nochmal.Ich schließe das nochmal. Gucken, ob der jetzt automatisches WSL erkennt. Nein. Daswäre ja auch deutlich zu einfach, wenn er das automatisch mitkriegen würde. Oder vielleichtmuss ich WSL auch einmalig starten. Was ist denn der Unterschied zwischen dem WSL Kommando?WSL und Ubuntu. Wo bekomme ich raus, wo das liegt? Gar nicht. Ah, okay. Ubuntu, Installing.Alles klar, auf geht's. Während es installiert. Genau, also ich muss sagen, es ist mittlerweilenicht mehr ganz so schlimm, aber eine ordentliche Linux Installation ist mir immer noch lieber.Es ist cool, dafür ist es tatsächlich gut, wenn man Windows Sachen und Linux Sachen besserverknüpfen will, also wenn man beispielsweise einen Explorer starten will aus einer LinuxShell oder so. Ja, dafür ist es cool. Aber ansonsten, ich bevorzuge immer nochmal Linuxfür M. Geh sudo credentials cache. Probieren wir gleich noch aus. Unix name. Test. 123456.123456. Jawoll. Installierst du dann als nächstes PowerShell unter WSL 2? Könnenwir das nicht machen? Kann man Wein installieren? Nee, oder? Das heißt, wir könnten Wein installierenund dann in Y Notepad ausführen. Okay, erst mal sudo update. Achso, ich wollte ja gucken,ob das, wir machen erst nochmal ein Upgrade. Ich wollte ja mal gucken, ob das jetzt indem neuen Windows Terminal drin ist. Wir installieren da nun mal ein Wein und führen da drüberwas aus. Das wird grausam. Wir führen da ein Notepad über Wein in Windows aus. Scheintzu funktionen, jetzt probieren wir gleich mal aus. So, erst mal updaten. Was passierthier? Wir gucken uns WSL 2 an, ob das immer noch sagt. Beziehungsweise, ob man damit beispielsweiseals grafische Programmegescheit verwenden kann. Ich gucke mir das einmal im Jahr oderso an. Okay, wir haben geupdatet. Wie sieht es aus? Ist es jetzt hier drin? Da ist es.Da ist es, Leute. Seht ihr es? Eben war die Frage, wie ich das mit dem TTS mache, mitdem Text-to-Speech. Ich habe hier so eine eigene Sache gebastelt. Das ist quasi meinStream Deck, selbst gebaute Stream Deck-Lite-Geschichte. Da sind ein paar Bildchen drin. Die GIF-Animationist in dem Fall übrigens viel zu schnell, wobei sie hier funktioniert. Und das steuereich vom anderen Bildschirm aus. Ich habe ein paar Shortcuts mit Steuerung L, kann ich zumBeispiel LUL machen und sowas. 3 ist LUL, 3D, M ist MonkaS. Mehr habe ich, glaube ich,gar nicht belegt. Aber ich mache das zum größten Teil eh nur darüber, über das Dashboard.Max, weißt du, warum man für Grafana Prometheus braucht? Braucht man nicht? Brauchst du nicht?Achso, naja. Deine Frage, ich weiß, was du meinst, aber die passt, also in dem Kontextergibt es keinen Sinn, weil Grafana selbst braucht verschiedene Quellen, die es versteht,aus dem es Grafen generieren kann. Prometheus ist eines von diesen Quellen. Prometheus undGrafana haben miteinander nichts zu tun. Die Metriken, die du abrufst, sind Prometheus-Metriken,die Grafana versteht. Also beziehungsweise die Grafana kann über die Prometheus-AP danndrauf zugreifen. Also es ist jetzt nicht so, als wäre Grafana und Prometheus von dengleichen Leuten. Du kannst beispielsweise 30 verschiedene, Grafana unterstützt 30verschiedene Quellen, also du kannst Influx DB nehmen oder aber, wenn du beispielsweiseInflux DB nimmst, dann kannst du auch Grafana weglassen und denen ihre eigene Geschichteverwenden. Die haben so ein Grafana-Lite eingebaut mittlerweile schon, oder was heißt eingebaut,mit dabei. Also wenn du Influx DB verwendest, die haben so ein eigenes Grafana-Ding dabei,wobei ich dir ehrlich sagen muss, hier so ein Teil, wobei ich dir ehrlich sagen muss,mir ist Grafana lieber als der Krempel. Und dementsprechend, wie gesagt, Grafana greiftnur auf verschiedene Datenbanken zu und visualisiert das, dann einen HTTP-Server abfragen, würdeja bedeuten, dass Grafana ein eigenes Metrik-Format bräuchte, was man da abrufen kann. Aber Grafananimmt ja nur das, was schon da ist. Kann man auch machen. Weil das ja nicht dann Kibanaist, sondern das ist ja dann der Elk-Stack, weil man mittlerweile alles einen coolen Namenbraucht. Kibana ist out, der Elk-Stack ist jetzt ja. Nein, kein Splatoon-Musik, please.Also du kannst beispielsweise, ich weiß nicht, ob ich das jetzt zeigen will, bin ich ganzsicher, ob ich da nicht irgendwas liege, aber Grafana kann, also wie gesagt, Grafana undPrometos haben nix miteinander zu tun. Guck mal, die können standardmäßig AVS, Azure,Elasticsearch, das ist übrigens Teil von Elk, Kibana, Logstash, Elasticsearch. Dasist quasi die Konkurrenz dazu. Google Cloud, Influx DB, Graphite, Loki, Microsoft. Sekunde,Sekunde, Sekunde. Ich finde das passende E-Mode gerade nicht. Aber wusste gar nicht,dass er das kann. Wo ist das passende E-Mode? Ich habe so viele E-Modes, die ich nicht oftverwende. Hier, passend, genau. Also du kannst auch MySQL abfragen, alle möglichen, Timeseries,Database, Postgres, Prometos. Jager, ich habe ehrlich gesagt keine Ahnung, was Jager istoder Zipkin oder Tempo. Tempo habe ich glaube ich schonmal gehört. Aber was ist Jager?Okay, ich weiß nicht, was Jager ist. Und was ist Zipkin? Zipkin klingt ein bisschenwie Datenbank aus Co-Commonet-Land. Ich meinte nicht MySQL, ich meinte Microsoft SQL. Daist nichts Schlimmes dran, außer dass es Microsoft SQL Server ist. Ich habe keine Ahnung, wases ist. Kann es auch XML? Nein, das Schöne ist, du kannst die Data Sources erweiternmit Plugins und dann kannst du wahrscheinlich auch XML. So, da sind wir. Da haben wir unserWSL am Start. Exzellent. So, erstmal root werden, immer das Allerwichtigste. Search,können wir Wine installieren? Erstmal nachkucken. Jawoll, wir können Wine installieren. Gut,das probieren wir nachher aus. So, jetzt mal schauen, das wichtigste. Lass mal überlegen,was brauche ich denn immer so? Also, mal nochmal hier. Abinstall. Wir brauchen auf jeden Fallschonmal T-Mags, ein Git. Wir können VS Code mal installieren. Und weil VS Code unterUbuntu ist ein Snap, oder? Moment, da bin ich mal gespannt, ob das überhaupt installiert.Gibt es da nicht, oder? Das Gequarium gibt es da übrigens auch nicht. Aber gibt es daC-Matrix? Ah, ok, das ist wichtig. Das brauchen wir erstmal. Also, eines der ersten Sachen,die ihr installieren solltet unter Linux ist C-Matrix, dass ihr das hier machen könnt.Euren inneren Hacker-Man erstmal starten. SL, nee. Hollywood auch, da weiß ich abernicht, ob die das dabei haben. Ah, haben sie. Auch, auch. Echt, man kann Code Plus machenin WSL. Achso, ja klar, der kann ja mittlerweile Windows-Dinger starten, ne? Postchamp? Postchamp?Pausechamp auf? Was macht der so lang? Crashed? Bestimmt, bestimmt gecrasht. Ach, mlocate,das ist, der indiziert jetzt erstmal meine ganze Platte wahrscheinlich. Hätte ich dasmal lieber in einer T-Mark Session gemacht? Ich kann einfach Neues starten, das geht jawahrscheinlich. Der indiziert wirklich erstmal alles. Ich hoffe echt nicht, dass da überMount-Points drüber gehen, das wäre schon fair. Der indiziert jetzt gerade mal eineganze Festplatte anscheinend, ne? CPU? Ja gut, das ist Single-Threaded wahrscheinlich.Ich könnte das einfach killen. Ok, also Code? Ok, also die Integration muss man ihnen echtlassen, die Integration ist wirklich ganz gut gemacht. Ich mein, mir persönlich istes natürlich noch lieber, ich brauch die Windows-Seite davon einfach gar nicht. Dann brauchich auch die Integration nicht, aber wenn man Windows ein bisschen besser benutzbarmachen will, ist das hier schon mal ganz cool. Oh ne. Die haben den Sound, der Sound mussweg. Haben wir den sein? Auch ein PowerShell? Ne. Also unter Linux die Hardcore-Variante,um Speaker ruhig zu stellen, ist die hier, aber ich glaube, die geht unter VSL nicht.Oder doch? Haha, Gebaided geht nicht. Ist immer noch da. Das ist normalerweise die brutaleVariante, einfach alles weg. VSL-Terminal-Beep, wie kriegt man den aus? Disable-Beep. Ah,ok, das ist tatsächlich einfacher. Mixer. Easy. Haha, so kann man es auch machen. Binsthier immer Toilet, das ist wichtig. Oh ne, geht ja nicht. Oh, er ist fertig. So, undjetzt sagen wir Toilet-Echo-Gebaided. Bäm. Massive Kunst im Terminal. Die Musik ist richtigklos jetzt, ne? So, also jetzt haben wir den Kram jetzt hin, sehr schön. Teamwork starten,alles klar. So, ah, Moment, Moment, wir brauchen ordentlichen Vim. Nicht den Light Vim. Denrichtig echten. Am besten noch Vim, ne. Ge Vim. Vim GTK, volle Pulle. Komm, gib ihm alles.Jawoll, Bäm. LOL-Cat, ja, das brauchen wir auch noch, klar. Ich meine, ich kann keinGUI-Zeug starten, aber das ist das nächste, was wir uns mal angucken, ob man da irgendwieGUI-Zeug drauf gestartet kriegt. Ja, klar, erkennt er, dass es nicht geht. So, wunderbar,Vim. Ich bin froh, dass sie das hinbekommen haben mittlerweile, weil in der ersten Versionhatten die extreme Probleme mit den Vim-Escape-Sequenzen. Da bist du teilweise im Vim hängen geblieben,konnte es nicht mehr raus. Also ja, wir installieren jetzt erstmal die wichtigen Dinger. Erstmaldie wichtigen Dinger. GWSL. Zeig mal her. Ups. Es gibt doch RDP, ne, ne, ne, ne, ne,nicht RDPX. Oder wie hieß das Ding? RDPX, nee. XXRDP, nee. Nee, RDP logischerweise nicht.Wie hieß denn das? Es gab doch, genau, VCXSRV, das Ding meinte ich, korrekt, korrekt. Aberdas sagt wahrscheinlich, wir probieren das hier aus. Microsoft Store. Get free, okay,das probieren wir dann gleich mal aus. Aber jetzt erstmal das allerwichtigste Programmüberhaupt. Oder musste man da, musste man da, ah nee, da musste man irgendwas reinpipen,ne. What is happening im Hintergrund, Alter? Das SL drauf. Okay, jetzt die wichtigste Kombinationüberhaupt, SL, SLpipen nach LOLCAT. Haha, Windows Terminal ist broken an der Stelle,sehr schön, sehr schön. Das funktioniert. Das Windows Terminal kommt mit den, kommtmit den Escape Sequenzen nicht zurecht, wie es aussieht. Also ich kann es euch mal zeigen,wie das eigentlich aussehen sollte, wenn man das ausführt. Haben wir schon das erste gefunden,was broken ist. Machen wir mal in groß, vielleicht will es das im Fullscreen haben. Geht'sim CMD? Nein, nein, nein, im CMD geht's garantiert nicht. CMD mit ASCII Escape Sequenzen, habich überhaupt kram installiert, jawoll. SL hab ich auch installiert. Jetzt kann ich euchzeigen, wie es normalerweise aussehen sollte. Zwar, Aufzug, fahr durch. Man kann es übrigensnicht abbressen. Bam. The Rainbow Train ist unterwegs. Sprichst du eine andere Fremdspracheals Englisch? Nee. Ich hatte in der Schule mal Französisch ein bisschen, aber ich kannkein einziges Wort Französisch. Frischarde. Doch, doch die Franzosen sagen anstatt Frischardedie Frischarde. Das weiß ich nicht. Keine Ahnung, kann ich nicht. Ich hatte es auch nichtlang. Ich kann Brötchen bestellen auf Portugiesisch. Das war's aber auch. Also im Prinzip, ichkann nichts außer Deutsch und ganz brauchbar Englisch und Essisch. Das könnte tatsächlicham TMUX liegen mit den Escape Sequenzen, das ist richtig. Nee, liegt nicht am TMUX. Abermittlerweile sollte die TMUX Geschichte eigentlich standardmäßig 32bit Farben können. In Wirklichkeitkann ich natürlich Russisch, genau wie alle echten Hackermans. Nee, keine Ahnung. Alsoich kann, wie gesagt, ich kann nur Deutsch, bisschen Englisch, das war's. Gut, das funktioniertschon mal. Standardmäßig, standardmäßig der Kram ist auch da. Hardtop und so, außerdass die Farben ein bisschen off aussehen, ist auch okay. Die Farben sehen wirklich einbisschen verkehrt aus. Normalerweise sind die Farben so, ne? Hardtop, Lolcat. Funktioniertsogar. Ich wusste gar nicht, dass das geht. Das funktioniert sogar. Man kann das sogarnoch verwenden. Guck mal, das läuft sogar noch. Das hätte ich nicht gedacht. Mal gucken,was Microsoft, was Windows da draus macht. Okay, das startet nicht mal. Das ist einfachbroken unter Windows. Probier es mal. Nee, Grip, vorbei. Keine Chance. Aber die Farbensehen ein bisschen verkehrt aus in dem Windows-Terminal, muss ich sagen. Die sehen nicht wirklichpassend aus. Das stimmt irgendwas nicht. Ist halt die Fall-Seam. Nee, nee, nee, das stimmttrotzdem nicht. Irgendwie als interpretiert er die Escape-Sequenzen nicht richtig. Deset,Lolcat, kann er das? Ah, das kapiert er. Okay, das kann er. Ja, so sieht das gut aus.Guck mal, massive Farbverlauf. Okay, und jetzt gucken wir mal, ob wir was Grafischeszum Laufen kriegen. Was ich auf jeden Fall schon mal sehr nice finde, ist, dass ich beispielsweisein Visual Studio Code meine Bash-RC editieren kann. Und das ist mein Visual Studio Codeaus Windows. Ja, installier mal. Nee, haben wir schon. Das ist mein Visual Studio Codeaus Windows, der jetzt im WSL-Attached ist. Das ist eine coole Geschichte. Okay, guckenwir mal, wie wir grafische Sachen installiert bekommen. Beste grafische Test-App nach wievor X-Clock und X-Eyes. Ich finde übrigens, dass Copy-Paste im neuen Windows-Terminalimmer noch Paints-Champ. Warum geht keine mittlere Maustaste und warum geht nur dieserkomische Misch aus Rechts-Rechts-Klick, Doppel-Rechts-Klick. Ich meine Doppel-Rechts-Klick. Das kann sichnur Microsoft ausdenken, sowas. Okay, wie richten wir da jetzt einen X-Server ein? Okay,was ist da? GWSL-Install. Nehm nicht den komischen aus dem Store, warum nicht? Das ist der hier.Oder kann man ja auch aus GitHub runterladen. Das ist recommended. Ey, wir machen das ausdem Store, passt schon. Okay, let's do our Grafika. Wollen wir mal probieren, ob man daseinfach installieren kann und dann geht's. Ich hab ja meine Zweifel. Ich mach mal alleswieder zu und installiere den Kram mal. Ich hab ja meine Zweifel, dass es einfach so geht.Jetzt. Ich hätte am liebsten nicht Copy und Select, sondern mittlere Maustaste drückenfür Kopieren und dann einfügen gleichzeitig. Install. Nein, ich will keinen Microsoft-Account.Sollte es so einfach installieren. Ich find's immer noch geil, wie das jedes Mal aufploppt.Jedes Mal will mich Microsoft dazu gibaten, mich doch einzuloggen. So, schauen wir mal.Einmal Rechtsklick ist Copy und das zweite Mal Rechtsklick ist Paste. Launch. Was passiertder Mensch, der jetzt Launche? Aha. Yes. Okay, jetzt bin ich mal gespannt, was passiert damit dem Uganda. Wie von Zulun. Aber da ist der Wim. Der Wim-Gründer engagiert sich daschon seit über 10 Jahren für irgendwelche Projekte in Uganda. Hab ich schon öfters gehört,da hat er auch schon Vorträge drüber gehalten. Also es ist kein Uganda-Meme oder so was,er meint das ernst, ja. So, aber das ist cool. Was kann man sonst noch machen? Linux-Shell?Ihh, das will ich nicht. Ist das denn gesetzt, wenn ich das hier aufmache? Das ist hier X-Ice.Aha, das ist natürlich nicht gesetzt. Okay, wie kann ich das jetzt außer Shell starten?Ich kann die hier natürlich aufmachen. X-Ice. Can't open display? Wait a minute. Wie bringeich jetzt Windows überhaupt bei? Moment, Taskbar. Wie bringe ich Windows bei, dassder Kram da unten gefälligt... Moment, wie stellt man den Kram hier noch mal ein? Ah,Windows, please. Was, du musst das ziehen? Echt jetzt? Ist das neu? Boah! Seit wanngeht denn das? Das ist ja big brain, Alter. Schon immer? Ich bin immer in das Config-Menügegangen und hab das eingestellt. Unglaublich. Okay. Distro-Tools. Auto-Export-Display. Ah,X-Ice. Das ist tatsächlich äußerst nice. Auto-Export-Display. X-Ice. Jawoll! Leute,wir haben das allerwichtigste Programm am Laufen. Seht ihr hier oben dieses komischeWindows-Logo, wo das nicht so ganz damit klar kommt, dass das... Das nicht so ganz damitklar kommt, dass das irgendwie im Fenster ist. Damit kommt es überhaupt nicht klar.Und es ruckelt. Guck mal, es ruckelt erst. Fuck. Und noch mal eine super High-Res-Uhr.Okay. Das funktioniert tatsächlich. So, das heißt, jetzt kann ich hier grafische Sachenstarten. Das müssen wir gleich mal ausprobieren, wie gut das funktioniert. Wir installierenjetzt mal Rider. Moment, Moment, Moment. Abinstall... Wir installieren jetzt einen Browser. Chrome.By the way, geht, geht... Wenn ich jetzt Chrome... Das muss ich beides installieren. Wenn ichjetzt Chrome installiere, ist es dann immer noch ein Snap? Ist es dann auch... Ist esdann auch... GLX-Gears, ja. Bei GLX-Gears war das nicht Mesatools, genau. Edge... Moment,gibt es... Aber es gibt doch Edge nicht im Paketmanager, oder? Nee, oder? Einer gibt'snicht. Aber das muss ich downloaden. Soll ich einen Edge installieren? Okay, okay. MeineGüte. Edge. Als erstes installieren wir uns jetzt mal Chrome. Ich will wissen, ob dasein Snap ist. Weil Snap ist Paynes-Champ und es ist wahrscheinlich ein Snap immer noch.Oder nicht? Ich kann nicht schreiben, Alter. Es ist kein Snap? Gbaited! Gbaited! Gbaited!Ich installiere einen Chrome. Aber ob Snap da drauf läuft? Das müssen wir jetzt malausprobieren. Nee, ne? Okay, Snap funktioniert nicht da drauf. Abinstallieren Firefox. AberFirefox wird funktionieren. Okay, dann installieren wir jetzt einen Edge-Browser. Das ist aberwirklich komplett wie ein Edge im WSL. Aber ich meine, ernsthaft, wenn Firefox geht, wirdEdge auch funktionieren. Lord Folkermord, Paynes-Champ-Name. Das ist eigentlich schonfür den Prime-Sub. Starte mal GLX-Gears. GLX-Gears ist broken. Und mach meinen Rechnerglaube ich kaputt. GLX-Gears ist kaputt, Leute. Keine 3D-Beschleunigung. Super-Tux-Kart,ne? Glaube ich nicht. Das wird auch nicht laufen. Über diesen X-Server. Nee, nee.Wenn schon GLX-Gears nicht läuft. Wie hieß das Ding? GWSL. Aber wenn schon GLX-Gearsnicht geht. Smooth Frame Rate bei mir läuft das schon mal gar nicht. Stimmt, es ist ja,ich hab ja auch noch VM in der VM, das kommt ja auch noch dabei. Das ist ja Doppels-Paynes-Champ-Bich.Wir probieren das mal schnell aus. Das liegt an der VM. Das können wir tatsächlich malprobieren. Ich schalte an die VM nochmal ausschalten. Und mal versuchen den 3D-Support einzuschalten.Wo ging das nochmal? War das nochmal versteckt mit Display hier, ne? Nee, ist schon, istschon an. Aber das kann durchaus an der VM liegen. Das kann durchaus daran liegen. Ja,man hat das heute nochmal installiert. Wie lange braucht der da dafür? Wird der immerlangsamer? Ich will das Super-Tux-Kart installieren. Massive-Paynes-Champ. Leute, wo wir geradedabei sind, der Preis, äh nicht der Preis-Champ, der Watt-Champ funktioniert wunderbar. Werden Watt-Champ nicht kennt. Wer den Watt-Champ nicht kennt. Ich hab mir was gebaut, um meinenStromzähler auszulesen. Das ist der Watt-Champ. Weil ich neuerdings meine Projekte alle irgendwiemit Champ hintendran nenne. Wir haben oft, ich hab für die Arbeit eine Proxy-Auswertungstoolprogrammiert. Das nennt sich natürlich der Lock-Champ, was sonst. Und der funktioniertjetzt wunderbar. Der hängt jetzt im Keller an den Stromzählern mit den Sensoren dran.Das ist, äh, das ist ein Luftfeuchtigkeit-Temperatursensor. Das hier sieht man jetzt nicht. Das istein Sensor, der blinkende LEDs erkennt für den Stromzähler oben. Und das ist ein Infrarotsensor,der so eine Zählerscheibe erkennt. Funktioniert wunderbar. Und ich kann jetzt quasi sehen,wie viel ich verbrauche im ganzen Haus. Und kann auch sogar Verbrauch voraussagen fürden Monat und sowas. Oder zumindest historisch kann ich dann sagen, hey, ergibt das irgendwieSinn, was ich gemessen hab und was die abrechnen und sowas. Das ist tatsächlich ganz nice.Der Watt-Champ champt vor sich hin. Das IntelliJ Zeug und WSL haben eigentlich recht gutenWSL Support. Ja, ich probier das mal aus gleich. Ich probier das gleich aus. Den Heiz-Champ,den Heiz-Champ hab ich heute umsortiert. Dass der OK-Knopf oben ist. Ja, was heißtich? Eigentlich ist es ja so eine Mischung aus mir und Microsoft, die Paynes-ChampigeSachen machen. Da muss ich auch immer Monka essen. Wenn ich den Snap-Store... Ich find'sja von den Ubuntu-Leuten schon ziemlich fail, dass sie das einem aufzwingen mit dem Snap-Store.Oder was heißt aufzwingen? Dass sie das so versteckt machen. Installiert Chrome undes ist ein Snap, obwohl du denkst, es ist ein echter Chrome. Der ist... Ja, ich weiß,der ist Müll. Aber nein, das ist ganz so krass. Das stimmt nicht. Das stimmt nicht. Der misstbei mir gerade 17 oder gestern 17 Grad gemessen und es waren, glaub ich, frag mich nicht 16irgendwas. Aber der ist nicht genau und der Sensor ist langsam, aber 10 Grad plus minusist es nicht. Davon hab ich auch noch ne Menge. Davon müsste ich mal wieder, müsste ich malübrigens wieder welche bestellen, fände ich halt gerade. Warum ist Snap schlecht? Washeißt schlecht? Ich find's doof, dass man durch den Package-Manager-Install, dass mandurch den Package-Manager-Install ein Snap-Paket installiert, wenn man ein normales Paket rechnet.So ein bisschen teuer. Was kostet der Kram bei Ali? Was macht eigentlich der Suez-Kanal?Ist er wieder frei? War das nicht von Bosch das Ding? Deswegen gibt's die nicht bei Ali.Ist das Chip still stuck? Yes. Es ist schon geil, dass es dafür überhaupt Seiten gibt.Ist das Chip still stuck? Yes. Zu geil. Alter, ist das ein fettes Ding, ey. Boah ey, dasist ja ein megafettes Ding. Warum ist das eigentlich stuck? Das sieht doch gar nichtso aus, als ist das großartig fest. Chipchamp, ja. Oh man. Das sind fünf Stück, ne. Gibt'sdas nicht ein bisschen billiger, die Sensoren? Warum ist denn der preisliche Unterschiedhier so hart? Ah, weil das hier mehr Pins braucht oder was oder wie? Baker-Store. Hopp,da hab ich noch nie was gekauft. Gibt's nicht. Gibt's nicht. Naja, Shipping 525 ist nichtdas Problem, wenn ich davon 10 Stück kaufe. Die gibt's bei Ali, deine Suche war kaputt.Okay, was auch immer. Ich such mal unter Linux. Vielleicht mag da AliExpress besser.Aber nach was habt ihr denn gesucht? 880. Der Chat hat wieder Mist geschrieben hier.Was ist hier wieder los? Einmal verlässt du dich auf den Chat. Aber so viel billigerist es auch nicht. Eats Delivery. Ach, das ist ein BMP, das ist ein anderer. Temperaturund Drucksensor. Was ist der Unterschied? BME, was ist BMP? Das braucht mehrere Pins,das andere, der braucht Glock-Dings, Cloud VIN und der braucht was für Pins? Was istdenn das? SCB und SCDings? Was sind das für komische Pins? Ich weiß gar nicht, wo ichdas anschließen soll. Ach, kein Luftfeuchtigkeit. Na gut, aber davon bräuchte ich tatsächlichauch mal wieder welche. Widmen wir uns mal weiter, WSL. So, SuperTuxCard. Geht das denn?Oh, oh. Nein, SuperTuxCard läuft nicht. Das liegt da wahrscheinlich echt an meiner VM.SuperTuxCard ist broken. Wahrscheinlich liegt es echt an meiner VM. Ich meine, ich habzwar schon den Gram aktiviert, aber es ist mit Sicherheit ein Unterschied, ob du VM-Waredas über VM-Ware machst oder nicht. Ich meine, das ist ja im Prinzip jetzt doppeltnested virtualisiert. So, dann probieren wir jetzt mal das. Also, ihr wollt ja, dass ichEdge installiere. Erstmal gucken, ob Firefox funktioniert. Firefox geht, okay. Hey, ey,ohne Scheiß. Okay, das ist jetzt fail, aber das fühlt sich tatsächlich sogar relativschnell an. Also, verhältnismäßig schnell. Muss man echt mal sagen? Hätte ich gar nichtgedacht. Oh, nee, nee, nee. Oh, nee, es laggt. Ich hab nix gesagt. Es ist doch laggy. Ah,ist doch ein bisschen laggy. Reine Software-Rendering jetzt. Aber ich mein, trotzdem cool, dasses überhaupt geht. Ich mein, nicht schlecht, oder? Es ist ein Software-gerendertes. Okay,komplett Fullscreen geht nicht. Okay, da ist schon ganz schön, ganz schön beschäftigt.Aber ich mein, es ist ein 1440p60fps-Video. Der Ton? Wahrscheinlich nicht. Nee. Es kannsein, dass man da Ton benutzen kann, aber da muss ich auf jeden Fall. Das ist jetztFirefox im WSL gehostet. Also, das ist Firefox, der im WSL läuft über einen X-Server unterWindows. Ja, ja, genau. So sieht's aus. Paints-Champ. Okay, was soll ich runterladen? Was habt ihrgesagt nochmal soll ich runterladen? Edge für Linux downloaden. Wirklich? Sollen wiruns das wirklich antun, ja? In einer Windows-VM, genau. Kommt ja auch noch dabei, guckt mal.30 Milliardenfach nestet virtualisiert hier. Wo gibt's den Download? Download Edge LinuxUbuntu. OMG Ubuntu, alles klar. Go to Edge Download Page. Und wir downloaden den Edge,wie sich das gehört. Oder was heißt, wie sich das gehört? Normalerweise gehört sichdas umgedreht. Man lädt Firefox mit Edge runter und wir laden jetzt Edge mit Firefox runter.Was mich ja viel mehr interessiert ist, dass das ganze JetBrains-Gedöns funktioniert. Übrigens,das will nicht, dass wir runterladen. JetBrains Toolbox brauchen wir. Die gibt's wahrscheinlichstandardmäßig nicht unter Ubuntu, oder? Hätte ich's mal im T-Max aufgemacht, dannmüsste ich jetzt nicht. Keine neue Session starten. Die default-Session muss ich übrigensauch mal umlegen, dass das immer gleich ins Ubuntu geht. Die Toolbox ist da nicht dabei.Hätte mich jetzt auch gewundert. Warum willst du das JetBrains-Zeugs in der VSL haben? Weilich, also wenn ich das mal an der Geschichte, wie wir es dann auf der Arbeit verwenden,ich werde das so nicht verwenden, weil es einfach pains-champig ist. Aber wir bekommenhier dann eine Windows-VM mit VSL drauf, wo wir aber unter Windows keine Admin-Rechtehaben, um was zu installieren. Aber wir haben komplette Admin-Rechte unter der VSL. Fragmich nicht, wer sich das ausgedacht hat. Und ich kann dementsprechend auch keine.NET-Runtimeunter Windows installieren. Was kein Problem ist, die gibt es als ZIP und sowas. Die sindgerade dabei, den Leuten wirklich das Arbeiten unmöglich zu machen. Deswegen bin ich froh,dass ich das alles ein bisschen umgehen kann. Wenn ich im Homeoffice sitze, dann mache ichdas alles einfach hier auf meiner lokalen Linux-VM und lade es dann hoch, was ich brauche.Richtiger pains-champ. Jetzt müsste wieder jemand im Chat schreiben, bei diesem Songhaben sich meine Eltern kennengelernt. Ne, bei diesem Song habe ich meine Eltern kennengelernt.Das schreibt er immer bei diesem Song, wenn das läuft. Und ich sage dann jedes Mal, wieoft willst du den Spruch noch bringen? Aber ich glaube, derjenige ist heute nicht da.Als DAP runterladen. Accept. Jawoll. Save. Dann installieren wir das doch mal. Download.Dann haben wir hier Debian. Äh, gibt sowas wie local install. Was ist das da? Ja, dpkig minus ig, das weiß ich. Einfach nur install. Ach so, Moment, Punkt, Slash. Ah, wow. Erstmaldas halbe Internet nachinstallieren. Das wusste ich noch gar nicht, dass das, ich glaube,früher bei abget, musstest du es, glaube ich, local installen machen. Ich fasse es nicht.Wir installieren ernsthaft, wir haben uns ernsthaft einen X-Server unter Windows in einer eh schondoppelt nestet virtualisierten VM. Äh, ich kriege, ich, Moment, ich kriege gar nichtmehr zusammen, um wie viele Ecken wir virtualisiert und gedingst haben. Einen Firefox dann miteinem X-Server unter Windows haben wir uns jetzt Edge runtergeladen, installieren unsEdge in einem WSL, was in einem Hyper-V läuft auf einer VM in meinem Windows. Mind blown,Alter. Ihr dürft auf dem Windows kurken Software runterladen ausführen. Nein, dürfen wir nicht,aber wir dürfen WSL verwenden und WSL Package Manager und sowas. Frag mich nicht, ist totalschwer. Ich werde es auch, ich werde damit gar nicht ordentlich arbeiten können. Ich könnte damitbeispielsweise letztens diese Proxy-Auswertung, die ich gebastelt habe, würde ich gar nichtmachen können. Sobald es wirklich akut wird, werde ich dann einfach bei jedem Auftrag, der kommt,den ich nicht ausführen kann, das ins Ticket schreiben, würde ich sagen, ja, ich würde es jagerne machen, aber ich kann nicht, weil ich keine Rechte habe mit meiner VM. Worauf läuft die Windowsvor allem bald, aber das ist zu Tricks. SiteRikes ist das. SiteRikes. Aber es ist alles kein Problem,ich hoffe, wir kriegen demnächst wieder ein stinknormales VPN, dann kann ich das einfachvon meiner lokalen Linux-Kiste daheim verwenden und wieder ganz normal arbeiten. Okay, wie starten wirdas jetzt? Edge. Microsoft Edge. Edge, da ist es. Bam. Wow. Da ist er, Leute. Oh fuck, jetzt habeich ihn zugemacht. Ein Microsoft Edge unter WSL, nested Edge. Es ist nicht sonderlich schnell,aber es funktioniert. Ich sage es euch, die werden es auf der Arbeit so ätzend machen,zu arbeiten, dass alle nicht mehr richtig arbeiten können, aus Security-Gründen und es wird danndazu führen, dass die ersten Leute anfangen sich heimlich zu tunneln, dass sie wieder arbeitenkönnen, was dann genau das Gegenteil bewirkt, was man mit Security eigentlich haben will.Natürlich darfst du das nicht und ich werde das auch nicht machen, ich werde einfach jedes Mal imTicket nerven und sagen, kann ich halt nicht machen. Ich bin mal echt gespannt, wie das wird. Zumal,wisst ihr was witzig ist, auf der einen Seite erzählen sie so nach dem Motto, die IT ist nichtschnell genug, wir müssen agiler werden und dann baut man so Dinge auf, aber ihr kennt daswahrscheinlich, es ist wahrscheinlich in jedem bisschen größeren Laden so und dann baut manHürden auf, die die Sachen standardmäßig schon und bei allem unnötig langsamer machen.Das läuft nicht so gut wie im Firefox Leute, das ruckelt mehr als im Firefox. Zumal der Witz ist,dass der Trend, der Trend geht ja eigentlich hin Richtung Bring your own device, ne. Okay,das ist nice. So und jetzt kommt das und jetzt, okay, jetzt testen wir erst nochmal was sinnvolles.Ich will nämlich mal die Jetbrains Sachen installieren und danach testen wir,ob Wine ordentlich funktioniert. Wine unter Windows und dann führen wir Notepad aus oder so.Die Jetbrains, die Jungs von Jetbrains. Oh, es funktioniert. Nein, nein, nein, not allowed.Da ist der SSO, installieren wir mal eine Runde Rider. Hab es noch besser gemacht als so einDocker. Stimmt, stimmt, läuft ein Docker in WSL wahrscheinlich, oder? Übrigens Ubuntu istgebate. Docker ist falsch, ne. Wenn ihr Docker installiert, installiert ihr nicht Docker. Ihr müsst Docker IOU installieren oder ihr installiert direkt Docker Compose.Gucken wir mal, was passiert, wenn ich das installiere. So, Rider. Hat er schon fertig installiert? Ah nee,Installing. Ich wollte gerade sagen, das ging ja sonst brutal schnell, äh. Installing. Er downloadetwahrscheinlich noch. Den schon fertig? Boah, ging ja mega schnell.In der Microsoft Schulung wollten die mal, dass wir Docker für den, für Windows Desktop verwenden.Das war richtiger Painschamp. Ich wollte, ich hab schon gedacht, ey, Linux Shell auf,Docker, auf geht's. Und dann haben die ohne Scheiß zwei Stunden da rumgemacht,bis die ein Windows Beklickgeschiss da installiert haben, in dem wir schon ordentliche Sachen machenhätte können. Äh. Geht das jetzt? Wenn ich spreche, breche das mal kurz ab. Du musstDocker den von Hand starten, oder was? Ach so, ja, ist okay. Hey, das funktioniert. Läuft. Ich kannmich noch zur Docker Gruppe hinzufügen, dann wird es auch so. Aber geht. Äh, dann starten wir malein Hello World Container. Da gab's doch Docker, dieses Docker Hello World. Wo gibt's das denn?Äh, ich hab keine Ahnung, wie das unter, unter Windows funktioniert. Ja, Docker run it. Jetztnoch mal eine Ubuntu Bash, Alter, unter. Äh, Sudo. Jetzt ein Ubuntu Image im Docker noch,ja. Und dann da drüber ein Wine, Alter. Funktioniert anscheinend, ja? Funktioniert?Kann Docker unter VSL, das ist schon mal nice. So, und jetzt das Rider Zeug starten. Gucken,wie gut das funktioniert. Ah, nee, wir brauchen erst noch eine.NET Runtime. Die hab ich ja nochgar nicht installiert. Don't send. Nope. Äh, Dark Theme. Das läuft brauchbar schnell. DieSchrift sieht kacke aus. Die Schrift sieht mega kaputt aus. Wahrscheinlich weil keinerleiSchriftdaten installiert sind oder sowas. Not installed, not installed, ja, ich weiß.Muss erst noch mal eine.NET Core installieren. Ah, hier sieht die Schrift jetzt okay aus,okay. Äh, probieren wir mal. Haben die, haben die eine.NET Core standardmäßig dabei bei Ubuntu?Die sind so dick, so dicke mit Microsoft, die haben doch da bestimmt was. Nee, oder? Habensie nicht? Hätte ich jetzt gar nicht gedacht. Dachte, das sind Microsofts, Microsofts neuebest, best buddies. Aber die haben noch so ein installscript. Äh,.NET Core Linux install.Na, als Snap installier ich das nicht, als Snap geht er nicht. Installieren von.NET unterUbuntu. Mithilfe des Scripts, jawoll. Wo ist das Script? Da. We get CRMOD plus X..NET install..NET install und er installiert standardmäßig 3.1. Man muss was machen? Minus C 5.0 minus Ccurrent, genau. Was ist.NET? Äh, ne Runtime für C sharp, bushelbasic.net, F sharp. Was gibt'snoch so für Cobol.net? Wenn du Sachen in C sharp programmierst und es laufen lassenwillst, brauchst du eine.NET Runtime. Die kannst du zwar mit reinpacken, aber zu entwickelnbrauchst du die. Ok. Gucken, ob Ryder das jetzt erkennt. Hat er das jetzt in pass drinnen?Iron Python, ja das gibt's auch. Das war die.NET, die.NET Python Variante von, vonein paar Jahren. Es gab auch Iron, Iron Ruby und sowas. Ähm, weiß nicht, ob das überhauptjemand verwendet. Wüsste jetzt ehrlich gesagt nicht so wirklich warum. Ok, ein bisschenlaggy, ein bisschen laggy ist das schon, ne. Jetzt über, über das. Das könnte aber auchan der VM liegen. So, äh, Toolsets und Builds. Wo konnte ich denn Kram jetzt nochmal auswählenhier? Ja, komm mal, da hat's erkannt. Home.net. Alles klar, sehr gut. Save. Was? Can't wait.Ich hab's kaputt gemacht. Es hat sich aus irgendwelchen Gründen gerade gecrasht, dashab ich noch nie gesehen. Ich wusste, ich wusste gar nicht, dass da gerade, also ohneScheiß mir ist Ryder noch nie gecrasht. Und das obwohl's Java Kram ist. Was übrigenseigentlich auch richtiger Pains Champ ist, wenn man sich's mal genau überlegt, ne. Ähm,wir entwickeln quasi.net Programme mit ner Java IDE. Wird die dann dynamisch skaliert,das ist ne gute Frage. Ich hab ehrlich gesagt kein blassen Schimmer. Native Keychain. Ja,ich brauch keine Passwörter drin. Das ist schon fucking laggy gerade hier drum, das,das, das zu benutzen. Ich warte mal, bis der alles indiziert hat und so. Ich warte mal,bis der fertig indiziert hat, wie sich's dann bedienen lässt. Ryder ist besser alsVisual Studio. Ich muss sagen, ich hab mich da mittlerweile so dran gewöhnt, dass ichstandardmäßig Dornett-Projekte auch komplett nur noch unter Linux mache mit Ryder. Ichkönnte auch Ryder unter Windows installieren, aber warum. Okay, er ist fertig. Das, oh fuckAlter. Okay, das ist nicht benutzbar. Ich hoffe, das liegt an meiner VM. Oh shit. Dasist, okay, das ist nicht benutzbar. Das ist laggy wie Sau. Guck mal hier, ich drückden Knopf. Seht ihr das, wie lang das dauert? Jetzt hat das Enter sogar gefressen komplett.Boah, nee, das ist laggy wie Sau, das kann man nicht verwenden. Wir brauchen Stadia mitnegativ Latency dafür, ja. Mal gucken, ob ich das Programm wenigstens ausführen kann.Wie viel RAM hat die voll? Ich glaub 8G. 8G. Okay, aber es funktioniert wenigstens. Nee,aber so kann man nicht arbeiten, ohne Scheiß. Also so kann ich nichts entwickeln. Boah,das ist pains, pains, champic. Meine Fresse, nee, das geht nicht. Exit. Kann man Rydernicht per SSH Attachement wie Visual Studio Code? Ja, ist schon möglich. Bringt mir nichts,ich hab ja kein anderes Ryder. Also dann, wie gesagt, die Möglichkeit hab ich da schon,aber wenn ich nur die von der Firma zur Verfügung gestellten Mittel verwenden würde, dann nicht.Also das ist eklig. So, Cottencory Gaming, nee, einfach nur Cottencory, The Prime Gaming,WTF, Big Low Brain von mir hier. Danke für den Sub, 6 Monate. Woop, POG, richtig, richtigMassive POG. Geht in WSL, ZSH mit Plugins, klar, das funktioniert, das muss schnell ausprobieren,das funktioniert auf jeden Fall. So, jetzt kommt das Interessanteste. Abinstall Wine.Es gibt Wine und Wine Stable. Ohne es gibt Wine64, bin es hier nicht das normale Wine.So, und jetzt starten wir Notepad im Wine. Das muss ich unbedingt mal ausprobieren. UndDogger können wir mit abschießen hier an der Stelle. Darauf hat die Welt gewartet, Notepadlaufen zu lassen im Wine über WSL mit einem Xsofer auf Windows in a VM mit nested Virtualisierung.Das musste sein. Dazu kann ich tatsächlich plus sagen, Moment, ich warte, ich warte,bis es startet. Warum nicht Notepad++? Können wir auch ausprobieren. Wartet mal, Notepad++,das lade ich einfach runter und starte das gleich mit Wine, das geht bestimmt. 32 Bit,Copy Link. Ah, das ist ein Installer, ich brauch das Standalone, Portable. Gibt es nichtals Standalone, gibt es nicht als Standalone Xso oder so? Portable, Zip. LCD, Downloads,WGet und Zip. Oh, ich hasse diese Zips. Leute, fuckt euch das auch ab, wenn ihr Zips habt,die sich nicht in eigenen Ordner entpacken, sondern in dem Ordner, wo ihr drin seid. Okay.Upt, install, was? Upt, get, install, Wine32, okay. Das mache ich gleich noch. Wine32 istmissing. Sag mal, ist das eine Endlosschleife oder ne? Ich installe noch Wine32, ja. Installierstdu gerade Wine? Ja, mache ich. Mache ich. So, einfach nur just for fun ausfunktioniert.Wine64 haben wir jetzt. Ne, Moment, was? Es gibt Wine und Wine64, Wine32 gibt es garnicht. Jetzt haben wir aus irgendwelchen Gründen noch WineStable. Okay, ne, ich glaube, Notepad++kriegen wir nicht zum Laufen. Was, Moment, was sollen wir machen? Ich glaube, das funktioniertin WSL nicht, oder? Okay, Windows ist wieder PaintsChamp beim Copypasten. Oh, Moment,das muss ich natürlich als Studio machen, sonst wäre das nichts. Ey, das wird nichtfunktionieren, Leute. Das glaube ich nicht, dass das funktioniert. Ja, oder auch nicht.Sag bloß, das funktioniert. Sag bloß, das funktioniert. Ich muss mal danach gucken,wie groß danach meine WSL install ist. Wahrscheinlich ist die Platte gleich voll. Okay, zeige ichmal her. Auf, gib Gas, 14 Sekunden. User ist nicht Champ, ne, habe ich nicht dran gedacht.Du hast recht, normalerweise nenne ich ja alles irgendwie Champ. Ich hätte eigentlich denUser auch Champ nennen müssen. LoginChamp. Boah, das ist ja fast so viel wie npm installen,was er hier macht. Das ist auch das halbe Internet, was er installiert. WSLChamp, genau.Okay. Okay Leute, meint ihr es geht? Chat, wer hat noch Punkte für eine Abstimmung?Haben wir Mods da? Mod check? Haben wir Mods da, die eine Abstimmung machen können? Wirdes laufen? Ja, nein. Ihr braucht keine Punkte ausgeben, ich mach die Abstimmung auch so.Ihr müsst nicht keine Punkte ausgeben, das passt schon. Nicht am PC. SeriousMax, weißtdu wie das geht? Ich hab das einmal gemacht und steig da noch nicht so richtig durch.Genau, da hier. Die Vorhersage hat begonnen. Prediction. Also, wie wird es laufen? Manmuss eingeloggt sein oder wie oder was? Also es prediktet gerade, ja 93%, nein 7%. Ihrseid aber äußerst zuversichtlich, dass das funktioniert. Ich kann übrigens selbst nichtabstimmen. Okay, 88% ja, 12% sagen nein. Okay. Postchamp? Ha!Ha! Unknown exception occurred, file not found. Bam! Bam! Wow! Punktiert nicht. Ach du Scheiße!Das sieht nicht gut aus. Nope. Nein, keine Chance. Das läuft nicht. Kann man Notepadlaunchen? Aber Notepad läuft immerhin, aber Notepad++ läuft nicht. Also Leute, wir habenes geschafft, wir haben ein Notepad laufen. Kein Notepad++, die Umfrage gegen Notepad++,ne? Wir haben Notepad im Wine, im WSL, nestet virtualisiert in der VM. Das ist überhauptso lackfrei läuft, ist schon der Witz. Das läuft ziemlich gut. Paint? Ne, ich glaubePaint ist da nicht dabei. Oder doch? Was kann man noch mal schnell ausprobieren? Kannich mein Internetexperiment herunterladen? Now with Bing. Achso, jetzt habe ich den Downloadsgar nicht drinne. Kann man da Sachen reinkopieren ins WSL? Quasi sowas hier. Ach, das ist einInstaller. Okay, das wird nicht funktionieren. Das wird nicht, nein. Ach, reinkopieren kannman nix, Dragon Droppen, oder wie? Na, das funktioniert natürlich nicht. Da muss ichjetzt nach Mount, C, User, Test, Downloads, probieren das jetzt? Wie heißt da Kram? Stimmt,ich hätte einen Explorer aufmachen können, ja. Aber das wird nicht funktionieren. Daswird nicht funktionieren, auch mit Wine nicht. Kann ich mir nicht vorstellen, dass man EEanzeigen kann? Nein, Anzeige ist raus. Wine CFG, Windows Version umstellen. Windows 7,das müsste eigentlich funktionieren. Und jetzt? Postchamp? Nein. Nope, keine Chance,das kriegen wir nicht installiert. Na gut, aber das war jetzt noch mehr Spielerei, dassKram funktioniert mit Wine oder nicht. Aber ist eine coole Sache. Also ich muss sagen,man kann es benutzen und wenn man Windows verwenden muss und wenn man irgendwie eine gute Integration,also wirklich zwischen echtem Windows Programm und Linux Programm braucht, ist es auch wahrscheinlichdas einzig Notwendige. Ich persönlich, muss ich ehrlich sagen, ich bevorzuge immer nochmeine klassische Linux VM und gut ist. Echt, ZFS wirft R aus, kann man gar nicht vorstellen.Aber trotzdem, cooler Versuch auf jeden Fall. Leider, leider, was ich persönlich ein bisschendoof finde, ist, dass Rider quasi gar nicht funktioniert. Also was heißt gar nicht, doches funktioniert, aber es funktioniert nicht gut. Moment, ich hab doch gar kein Chrome installiert.Das debatet mich. Und SuperTuxKart geht auch nicht. Okay Leute, ich hab Hunger, ich gehjetzt essen. Massive. Massive Pippo Fett. Und ist da Frazier da oder so, den ich hostenkann? Nope. Kein Frazier am Start. Was, doch, da ist er. Da ist er. Warum wird der bei mirnicht als Online angezeigt? Der Frazier. Raid. Wir raiden den Frazier. Auf gehts Leute. Wirsehen uns dann im nächsten Stream, ich hab übelst Hunger, ich muss jetzt was futtern.Machts gut, wir sehen uns, bis dann, see you.", "segments": [{"id": 1, "start": 90.0, "end": 107.24, "text": "So, auf gehts."}, {"id": 2, "start": 107.24, "end": 130.76, "text": "So, wunderbar, auf gehts."}, {"id": 3, "start": 130.76, "end": 148.4, "text": "Leute, Massive, Big Brain Chat, ich muss euch mal was fragen, und zwar, habt ihr das"}, {"id": 4, "start": 148.4, "end": 154.56, "text": "mitbekommen mit diesem einen Ruby Jam, was irgendwie 50.000 Billiarden Repos kaputt"}, {"id": 5, "start": 154.56, "end": 171.84, "text": "gemacht hat. Das ist das gleiche, was letztens NPM hatte, vor ein paar Jahren. Und zwar,"}, {"id": 6, "start": 171.84, "end": 178.68, "text": "eigentlich wieder recht lustig gewesen. Okay, das ist wieder Musik, die nicht weiß, ob sie"}, {"id": 7, "start": 178.68, "end": 193.24, "text": "laut oder leise sein soll. Genau, und das ist wieder so ein typischer Fall von selbstverkackt,"}, {"id": 8, "start": 193.24, "end": 202.56, "text": "ne. Also, bei NPM war es ja kompletter Witz. Bei NPM hatten sie das vor ein paar Jahren,"}, {"id": 9, "start": 202.56, "end": 208.2, "text": "da hat man ein Paket unpublished und es hat irgendwie 50.000.000 Projekte kaputt gemacht,"}, {"id": 10, "start": 208.2, "end": 219.08, "text": "ne. Und ich mein, man darf nicht vergessen, es gibt bei NPM Packages für is odd, is odd"}, {"id": 11, "start": 219.08, "end": 225.2, "text": "or even Packages. Ich mein, hallo, warum brauch ich eine Library für ist eine Zahl gerade"}, {"id": 12, "start": 225.2, "end": 230.84, "text": "oder ungeradet? Wenn's ja da nur schon in der Sprache eingebaute Konstrukte gäbe, um"}, {"id": 13, "start": 230.84, "end": 240.04, "text": "das rauszubekommen. Naja, das waren die Probleme bei NPM und Ruby hatte jetzt ähnliche Probleme,"}, {"id": 14, "start": 240.04, "end": 243.96, "text": "da hat auch einer ein Paket zurückgezogen und es hat irgendwie 50.000 Projekte kaputt"}, {"id": 15, "start": 243.96, "end": 248.76, "text": "gemacht. Das ist echt wieder übels Fell. Der russische Typ, das ist hier Cacomodates."}, {"id": 16, "start": 248.76, "end": 272.64, "text": "Der da. Cacomodates, any Cacomodates. Ist klar, jetzt mal kurz spannen, CacWade. Ja,"}, {"id": 17, "start": 272.64, "end": 296.52, "text": "ja. Weg. Die Lippa hat 30, 300 Lines. Ja, Moment, die Ruby Library oder das da? Das"}, {"id": 18, "start": 296.52, "end": 300.52, "text": "da hat nicht so viele Lines, das hat 20 oder so, das hab ich letztens irgendwo gesehen."}, {"id": 19, "start": 300.52, "end": 305.56, "text": "Ja, Ruby, die macht ja auch eine halbwegs sinnvolle Geschichte, die Ruby Library, das"}, {"id": 20, "start": 305.56, "end": 313.2, "text": "ist nicht so ein Schwachsinn wie das von NPM. By the way, ich muss euch mal was zu C++"}, {"id": 21, "start": 313.2, "end": 319.96, "text": "fragen, Leute. Habt ihr eine Ahnung, warum? Habt ihr eine Ahnung, warum, ich muss eh"}, {"id": 22, "start": 319.96, "end": 326.0, "text": "nicht vor allem anmachen, warum folgende Sachen in C++ keinen Warning, warum es keinen"}, {"id": 23, "start": 326.0, "end": 331.92, "text": "Error gibt, kann ich verstehen, aber warum es keinen Compiler Warning gibt? Also, mach"}, {"id": 24, "start": 331.92, "end": 337.96, "text": "mal hier auf, das dauert ja so ewig lang. Also, warum gibt das hier in C++ keinen Warning?"}, {"id": 25, "start": 337.96, "end": 353.56, "text": "Vielleicht weiß das jemand. Guck mal. Warum gibt das keinen, nicht zumindest einen Compiler"}, {"id": 26, "start": 353.56, "end": 364.16, "text": "Warning? Muss man das verstehen oder ist das einfach C++-Dinger? Also, mal nur zur Erklärung,"}, {"id": 27, "start": 364.16, "end": 370.92, "text": "warum es einen Warning geben sollte oder geben könnte, ist, man sagt ja hier explizit, negative"}, {"id": 28, "start": 370.92, "end": 376.56, "text": "Zahlen sind nicht erlaubt. Das heißt, minus 1 ist in Wirklichkeit nicht minus 1, sondern"}, {"id": 29, "start": 376.56, "end": 384.36, "text": "plus, plus der Maximalwert von der Geschichte. Warum gibt man hier nicht zumindest mal einen"}, {"id": 30, "start": 384.36, "end": 396.16, "text": "Warning aus und sagt, wahrscheinlich willst du da nicht minus 1 reinschreiben? Weiß nicht,"}, {"id": 31, "start": 396.16, "end": 403.56, "text": "warum es da keinen Warning gibt. Verstehe ich nicht. By the way, wir müssen, ach guck"}, {"id": 32, "start": 403.56, "end": 407.16, "text": "mal, meine VM ist da, null. Jetzt brauche ich sie auch nicht mehr. Wir müssen uns eine"}, {"id": 33, "start": 407.16, "end": 415.44, "text": "Windows VM installieren. Mal schauen, habe ich hier noch irgendwas? Ach nee, es gibt,"}, {"id": 34, "start": 415.44, "end": 421.64, "text": "habe ich wieder diesen scheiß Bug mit is in use. Oh nee, ich habe wieder diesen Bug, VM"}, {"id": 35, "start": 421.64, "end": 435.08, "text": "is in use, Alter. Was ist das für ein Schwachsinn? Das hatte ich doch gestern schon. Na gut,"}, {"id": 36, "start": 435.08, "end": 438.04, "text": "aber eine neue VM können wir wahrscheinlich anlegen, da kann man ja wohl nichts dagegen"}, {"id": 37, "start": 438.04, "end": 445.04, "text": "sagen. Wir brauchen eine neue Windows VM, weil ich will mir den Kram nicht unbedingt, ich"}, {"id": 38, "start": 445.04, "end": 451.6, "text": "weiß gar nicht, ob ich WSL hier drauf habe. Ja, das ist noch das Einser. Also ich installiere"}, {"id": 39, "start": 451.6, "end": 461.24, "text": "mir auf jeden Fall neue Windows VM zum Ausprobieren. Und die Sache ist die, warum ich das mal ausprobieren"}, {"id": 40, "start": 461.24, "end": 488.64, "text": "will mit WSL ist folgendes. Was war jetzt an der Message so schlimm? Ach, er wollte"}, {"id": 41, "start": 488.64, "end": 497.2, "text": "den Timeout. Jetzt verstehe ich es auch. Stimmt, man kann sich ja Timeouten lassen mit 2500"}, {"id": 42, "start": 497.2, "end": 510.64, "text": "Channelpunkte. Exzellent, exzellent. Ist doch viel leichter hinzuschreiben als nach einem"}, {"id": 43, "start": 510.64, "end": 518.64, "text": "Max, ja, was auch möglich wäre. Warum gibt es denn nicht sowas? Warum gibt es denn nicht"}, {"id": 44, "start": 518.64, "end": 527.4, "text": "sowas? Vielleicht so. Oder, oder. Irgendwas, keine Ahnung, es ist C++, muss man nicht"}, {"id": 45, "start": 527.4, "end": 537.88, "text": "verstehen, aber warum ist das wieder überhaupt Ding? Da ist er ja wieder. Was moin Max, du"}, {"id": 46, "start": 537.88, "end": 542.36, "text": "glaubst gar nicht, wie gerne ich deine Videos auf YouTube schaue und mir. Ja, ist doch nice."}, {"id": 47, "start": 542.36, "end": 546.92, "text": "Ich meine, vielleicht guckst du die Videos ja auch nicht nur, weil du sie früher gerne"}, {"id": 48, "start": 546.92, "end": 549.92, "text": "geguckt hast, sondern guckst sie immer noch gerne. Das wäre mir natürlich, natürlich"}, {"id": 49, "start": 549.92, "end": 556.72, "text": "noch lieber, ja. So, ich installiere mir mal nebenbei eine Windows VM, die brauchen wir"}, {"id": 50, "start": 556.72, "end": 563.56, "text": "jetzt, bevor wir anfangen können. Also, wer das nicht kennt, WSL ist ja diese Geschichte,"}, {"id": 51, "start": 563.56, "end": 568.88, "text": "wo man Linux unter Windows installieren kann. Und nicht wie ich das hier mache, in der VM,"}, {"id": 52, "start": 568.88, "end": 575.72, "text": "sondern quasi, man könnte sagen, WSL war früher so das Reverse Wine, also quasi man"}, {"id": 53, "start": 575.72, "end": 582.16, "text": "hat Linux unter Windows laufen lassen und nicht Windows unter Linux. Und jetzt ist es"}, {"id": 54, "start": 582.16, "end": 589.28, "text": "mittlerweile so, im Prinzip ist WSL 2 auch nur noch eine VM, aber noch eine VM mit irgendwie"}, {"id": 55, "start": 589.28, "end": 595.64, "text": "spezieller Config. Keine Ahnung, weiß ich nicht. Die Sache ist plus die. Microsoft ist"}, {"id": 56, "start": 595.64, "end": 600.08, "text": "da relativ committed, was das angeht und bastelt da ziemlich viel dran rum. Und warum ich das"}, {"id": 57, "start": 600.08, "end": 605.64, "text": "jetzt ausprobieren wollte mit WSL, also WSL 2, nicht das normale WSL, warum ich das mal"}, {"id": 58, "start": 605.64, "end": 610.08, "text": "wieder ausprobieren will, ist folgendes und zwar, bei uns auf der Arbeit haben sie sich"}, {"id": 59, "start": 610.08, "end": 623.8, "text": "überlegt, wir bekommen demnächst alle Windows VMs verpasst, die wir benutzen sollen. Also,"}, {"id": 60, "start": 623.8, "end": 627.4, "text": "das hindert mich nicht daran, irgendetwas anderes zu benutzen noch, aber sie haben sich"}, {"id": 61, "start": 627.4, "end": 636.44, "text": "überlegt, es ist eine gute Idee, es kriegen alle Windows VMs und mit diesen Windows VMs"}, {"id": 62, "start": 636.44, "end": 640.32, "text": "kann man dann Dinge machen oder auch nicht. Und ich hab mir jetzt mal gedacht, ich guck"}, {"id": 63, "start": 640.32, "end": 646.04, "text": "mir jetzt mal auf Spaß an eine Freundin, ich guck mir das ja immerhin regelmäßig im Abstand"}, {"id": 64, "start": 646.04, "end": 651.52, "text": "an und das ist auch schon benutzbar, ein paar Dinge sind halt nervig. Zum Beispiel, dass"}, {"id": 65, "start": 651.52, "end": 657.72, "text": "man grafische GUI Sachen nur schlecht verwenden kann. Ich weiß nicht, ob das mittlerweile"}, {"id": 66, "start": 657.72, "end": 663.72, "text": "besser ist, aber ich brauch halt GUI Applikationen unter Linux, zum Beispiel eine IDE, um irgendwas"}, {"id": 67, "start": 663.72, "end": 672.0, "text": "zu entwickeln oder zumindest mal einen ordentlichen Editor oder so. Ja, mal gucken. Was sollt ihr"}, {"id": 68, "start": 672.0, "end": 675.84, "text": "denn mit Windows VMs machen? Ja, das ist witzig, die haben sich bei uns nämlich überlegt,"}, {"id": 69, "start": 675.84, "end": 680.28, "text": "das ist natürlich eine berechtigte Frage, ich hab das auch nicht verstanden und die"}, {"id": 70, "start": 680.28, "end": 689.2, "text": "haben sich jetzt gedacht, alle Leute, die für Linux-Systeme zuständig sind, wenn die remote"}, {"id": 71, "start": 689.2, "end": 693.84, "text": "arbeiten wollen, dann sollen die erst mal gar keine großartigen Rechte bekommen, sondern"}, {"id": 72, "start": 693.84, "end": 700.84, "text": "alle Leute, die für Linux-Systeme zuständig sind, bekommen eine Windows-VM gestellt, von"}, {"id": 73, "start": 700.84, "end": 707.92, "text": "der sie dann Zugriff auf ihre Linux-Systeme bekommen. Ich hab keine Ahnung, wie man auf"}, {"id": 74, "start": 707.92, "end": 719.56, "text": "die Klonreiche Ideen... Ist das VDI? Ja, das ist... Wie spricht man Citrix geil aus? Cytrix?"}, {"id": 75, "start": 719.56, "end": 728.16, "text": "Cytrix? Ich hab keine Ahnung. Gibt es eine coole Aussprache von Citrix? Cytrix? Cytrix?"}, {"id": 76, "start": 728.16, "end": 743.84, "text": "Ich muss noch gucken, wie man das offiziell... Cytrux, was? Citrix, ja, das wissen wir schon,"}, {"id": 77, "start": 743.84, "end": 751.88, "text": "das wissen wir schon, aber... Es wäre schon cooler, wenn man das Cytrix aussprechen"}, {"id": 78, "start": 751.88, "end": 761.6, "text": "könnte oder so, ne? RDPX installieren, ja, probier ich alles aus, probier ich alles aus,"}, {"id": 79, "start": 761.6, "end": 767.8, "text": "mal gucken. Die Sache ist die, ich brauch's ja aktuell gar nicht so wirklich, ne? Also,"}, {"id": 80, "start": 767.8, "end": 797.76, "text": "VM? VM? Postchamp? Wie wär's mit sich beenden, VM, please? Chat, wer von euch"}, {"id": 81, "start": 797.76, "end": 807.88, "text": "war's? Wer hat's meine VM kaputt gemacht? Seid ihr schon drin? Ah, nee, die VM hat sich"}, {"id": 82, "start": 807.88, "end": 815.16, "text": "ja beendet. Sehr gut. Okay, neue VM... Achso, ich zeig euch... Ich hab, by the way, das"}, {"id": 83, "start": 815.16, "end": 818.28, "text": "ist immer noch die alte VM-Version, bevor mich wieder einer drauf hinweist und nachdem"}, {"id": 84, "start": 818.28, "end": 822.12, "text": "er gesagt hat, mach's, upgrade doch mal. Ja, jetzt, wenn ich mir schon Key gekauft hab..."}, {"id": 85, "start": 822.12, "end": 826.8, "text": "Ich hab mir aber keinen Key für... Also, schon ein bisschen länger her. Aber, wie gesagt,"}, {"id": 86, "start": 826.8, "end": 832.04, "text": "ich erwähne ja immer, dass ich mir bei so einem super vertrauenswürdigen Software-Shop"}, {"id": 87, "start": 832.04, "end": 837.24, "text": "vor allem Key gekauft hab für 22 Euro oder 25 Euro. Und ich find's geil, die funktionieren"}, {"id": 88, "start": 837.24, "end": 841.64, "text": "auch wirklich. Oh nein, es muss jetzt keiner in Chat posten, man findet auch anderweitig"}, {"id": 89, "start": 841.64, "end": 849.36, "text": "Key. Das ist mir klar, aber das will ich jetzt hier nicht großartig zeigen, ne? Mein OBS"}, {"id": 90, "start": 849.36, "end": 855.8, "text": "ist auch übrigens voll up to date mit 24. So, und ich zeig euch jetzt mal den Trick,"}, {"id": 91, "start": 855.8, "end": 865.24, "text": "den alle immer geil finden, den zeig ich in jedem Stream. Windows 10 ISO downloaden funktioniert"}, {"id": 92, "start": 865.24, "end": 870.4, "text": "nicht, weil man nur updaten kann. So, es gibt verschiedene Möglichkeiten. Entweder man"}, {"id": 93, "start": 870.4, "end": 875.44, "text": "geht von der Linux-Kiste drauf, dann kann man das downloaden. Oder man kann einfach faken,"}, {"id": 94, "start": 875.44, "end": 880.96, "text": "dass man von einem Mobilgerät drauf zugreift auf die Seite. Jetzt geht man nämlich hier"}, {"id": 95, "start": 880.96, "end": 888.04, "text": "in die Ansicht vom iPad, refresh die Seite und schon kann man die ISO downloaden vom"}, {"id": 96, "start": 888.04, "end": 894.12, "text": "aktuellen Windows 10. Den Trick hab ich schon 30 Millionen mal gezeigt, aber der Chat mag"}, {"id": 97, "start": 894.12, "end": 903.76, "text": "den Trick jedes Mal. OBS ist doch schon mal 26, ja OBS ist schon. Ja ne, richtige Hacker"}, {"id": 98, "start": 903.76, "end": 908.88, "text": "mein Trick. Der Chat ist immer begeistert von dem Trick. Microsoft Entwickler hassen"}, {"id": 99, "start": 908.88, "end": 915.28, "text": "diesen Trick. Du wirst nicht glauben, was dieser YouTuber macht. Microsoft Entwickler"}, {"id": 100, "start": 915.28, "end": 924.24, "text": "hassen diesen Trick. HTML Hack, genau. Oh ja, Windows auf Arabisch, das wollte ich ja immer"}, {"id": 101, "start": 924.24, "end": 935.4, "text": "mal installieren. Englisch International. Oder das Media Creation Tool geht natürlich"}, {"id": 102, "start": 935.4, "end": 941.72, "text": "auch. Jetzt kann man übrigens auch hier wieder raus machen, dann kann man runterladen. Ihh,"}, {"id": 103, "start": 941.72, "end": 948.52, "text": "das ist Platoon Musik, oder? Ich glaube ich bin der Einzige auf der Welt, das Platoon"}, {"id": 104, "start": 948.52, "end": 963.4, "text": "Musik nicht mag. Oh, huge download speed. Massive Geschwindigkeit. Massive Geschwindigkeit."}, {"id": 105, "start": 963.4, "end": 969.26, "text": "Ok jetzt gehts los. Microsoft hat sich gedacht, ok wir warten 55 Sekunden und jetzt kriegste"}, {"id": 106, "start": 969.26, "end": 978.4, "text": "vollen Speed. Diesen Trick kennt nicht mal Bill Gates. Das ist ein guter Titel. Diesen"}, {"id": 107, "start": 978.4, "end": 982.96, "text": "Windows Trick kennt nicht mal Bill Gates. Ich vermute mal Bill Gates kennt mittlerweile"}, {"id": 108, "start": 982.96, "end": 988.12, "text": "die wenigsten Windows Tricks. Ich frag mich ja ob Bill Gates überhaupt selbst noch Windows"}, {"id": 109, "start": 988.12, "end": 999.12, "text": "verwendet. 32-Bit, na das ist ganz klar. Ich hab nur einen 64-Bit Prozessor, deswegen nehme"}, {"id": 110, "start": 999.12, "end": 1008.24, "text": "ich, ne das ergibt keinen Sinn was ich sagen wollte. Brain lag. Aber heißt das denn dann"}, {"id": 111, "start": 1008.24, "end": 1017.4, "text": "man könnte, man könnte mit einem 64-Bit Prozessor, könnte man dann 2x 32-Bit Windows laufen"}, {"id": 112, "start": 1017.4, "end": 1035.4, "text": "lassen? Oh, also quasi 2x Windows auf einem Core, weil 32-Bit und 32-Bit. Das ist ungefähr"}, {"id": 113, "start": 1035.4, "end": 1042.56, "text": "genauso viel wie FPS das männliche Auge sehen kann. Da wissen wir, dass es 12 plus 12 ist"}, {"id": 114, "start": 1042.56, "end": 1053.64, "text": "für jedes Auge 1, also für jedes Auge 12. Deswegen ist 24 das Maximum an FPS was man"}, {"id": 115, "start": 1053.64, "end": 1058.28, "text": "sieht aber auch nur mit beiden Augen auf. So ungefähr verhält sich das glaube ich mit"}, {"id": 116, "start": 1058.28, "end": 1066.24, "text": "2x 32-Bit Windows unter 64-Bit CPUs. Bill Gates macht hinten Features and Tricks in Windows"}, {"id": 117, "start": 1066.24, "end": 1081.68, "text": "Videos. Das ist natürlich auch eine Frage, kann man mit 2x 32-Bit Cores einen 64-Bit Betriebssystem"}, {"id": 118, "start": 1081.68, "end": 1096.68, "text": "Single Core laufen lassen dann? Fragen über Fragen. So ist der Kram jetzt nicht runtergeladen."}, {"id": 119, "start": 1096.68, "end": 1112.08, "text": "Aber legen wir schon mal Windows Geschichte an. Vm. Next. Next. Next. Windows 10. Next."}, {"id": 120, "start": 1112.08, "end": 1121.68, "text": "Nein, und nicht hier, sondern unter. Postchamp. Unter. E. Vms. Delete me. Oh, dass ich das"}, {"id": 121, "start": 1121.68, "end": 1130.76, "text": "nicht vergesse nachher wieder wegzuschmeißen. Next. UEFI, ja meinetwegen. Wenn das die Fall"}, {"id": 122, "start": 1130.76, "end": 1136.64, "text": "für Windows ist meinetwegen. 3 Cores sollten, ach komm scheiß drauf, 4 Cores Windows braucht"}, {"id": 123, "start": 1136.64, "end": 1143.4, "text": "das. Ich hab genug CPUkerne. Und 8G. Ach nee, das kann man hier gar nicht machen. Was ist"}, {"id": 124, "start": 1143.4, "end": 1158.24, "text": "das? Oh, ich kann mir das immer nicht merken. 8100, 96, 92. Ich kann das, ich kann alles"}, {"id": 125, "start": 1158.24, "end": 1167.52, "text": "von 1 bis 4096. Des 8000er kann ich mir immer nicht merken. Wobei das eigentlich, da sieht"}, {"id": 126, "start": 1167.52, "end": 1171.68, "text": "man mal wie Boomer ich bin. Mittlerweile ist es eigentlich fast schon wichtiger. Man"}, {"id": 127, "start": 1171.68, "end": 1180.04, "text": "weiß alles oberhalb von 256. Weil drunter brauchen wir eh net. Nee, 8G anklicken geht"}, {"id": 128, "start": 1180.04, "end": 1185.52, "text": "nicht gescheit. Also, oh doch. Ich dachte mal, man kann das anklicken. What the fuck."}, {"id": 129, "start": 1185.52, "end": 1190.52, "text": "Ich hab immer gedacht man kann da nur sliden. Wusstet ihr das, dass man das anklicken kann?"}, {"id": 130, "start": 1190.52, "end": 1199.52, "text": "Ich hab da immer nur geslider antet. Ich bin nur Sliderman gemacht. Und man kann da"}, {"id": 131, "start": 1199.52, "end": 1216.24, "text": "vorne draufklicken, das ist genau 8192. Cake wait. Wusste ich nicht. So, bam. Ja, not,"}, {"id": 132, "start": 1216.24, "end": 1223.72, "text": "next. Was? NVM, ja pff meinetwegen. Create new disk, 60G, single file, bam, bababam."}, {"id": 133, "start": 1223.72, "end": 1229.6, "text": "So und der Drucker raus. Weiß ja nicht warum da immer standardmäßig ein Drucker drin"}, {"id": 134, "start": 1229.6, "end": 1234.48, "text": "ist. Leute kennt noch einer das Problem, wo wir gerade beim Thema Drucker sind. Während"}, {"id": 135, "start": 1234.48, "end": 1244.32, "text": "hier das erstmal in. Was? Nein. Genau, also was wollte ich jetzt sagen zu Drucker. Also"}, {"id": 136, "start": 1244.32, "end": 1247.96, "text": "ich brauch meinen Drucker genau einmal im Jahr, wenn ich nämlich für den Steuerberater"}, {"id": 137, "start": 1247.96, "end": 1251.32, "text": "ein paar Sachen ausdrucken muss. Hi, hab einen Dankeschön für den Zapp. Nämlich wenn"}, {"id": 138, "start": 1251.32, "end": 1254.0, "text": "ich für den Steuerberater ein paar Sachen ausdrucken muss, weil der bewahrt die Sachen"}, {"id": 139, "start": 1254.0, "end": 1261.16, "text": "ja bei sich auf. Und machen wir gerade VM in der VM? Nee, nee, nee, machen wir nicht."}, {"id": 140, "start": 1261.16, "end": 1267.4, "text": "Und jedes Jahr ist meine Tinte eingekrustet. Und ich hab mir schon überlegt, sollte ich"}, {"id": 141, "start": 1267.4, "end": 1270.72, "text": "mir vielleicht mal einen Drucker kaufen, wo Tintenkrusten halt nicht eingeht. Also halt"}, {"id": 142, "start": 1270.72, "end": 1275.64, "text": "kein Tintenschralldrucker. Auf der anderen Seite bin ich halt der Meinung, ich drucke"}, {"id": 143, "start": 1275.64, "end": 1281.28, "text": "so wenig, es lohnt sich eigentlich überhaupt nicht einen neuen Drucker zu kaufen. Hat irgendwie"}, {"id": 144, "start": 1281.28, "end": 1290.36, "text": "einer so richtig nice einen Trick, wie Tinte nicht mal einkrustet oder so. WSL läuft doch"}, {"id": 145, "start": 1290.36, "end": 1297.08, "text": "im Hyper-V oder nicht? Ja, hast recht, wir machen VM in der VM, ja. Aber das funktioniert."}, {"id": 146, "start": 1297.08, "end": 1303.92, "text": "Das haben wir vor einem Jahr schon mal probiert, das funktioniert. Das einzige was man machen"}, {"id": 147, "start": 1303.92, "end": 1307.0, "text": "muss, stimmt, gut dass ihr es sagt, das einzige was man machen muss, das hier muss man einschalten."}, {"id": 148, "start": 1307.0, "end": 1314.56, "text": "Sekunde, das muss ich einschalten, sonst funktioniert es nämlich nicht. Gut, dass wir drüber gesprochen"}, {"id": 149, "start": 1314.56, "end": 1327.64, "text": "haben Chat. Hi IQ Chat wieder. Ich muss ihm sagen, wir wollen das da machen. Porn. Dann"}, {"id": 150, "start": 1327.64, "end": 1339.04, "text": "mounten wir mal das Windows ISO. Achso, das ist das CD Laufwerk, jetzt checke ich das"}, {"id": 151, "start": 1339.04, "end": 1351.12, "text": "erst. ISO Image. Windows 10 ist der Kram. Ist der Download fertig jetzt? Ja. Connect."}, {"id": 152, "start": 1351.12, "end": 1359.16, "text": "Jetzt die Stade. Windows install, auf gehts. Bäm. Das geht ja mittlerweile relativ schnell,"}, {"id": 153, "start": 1359.16, "end": 1363.96, "text": "vor allem aus dem laufenden System raus. Alter Business Laser Drucker, wie funktioniert"}, {"id": 154, "start": 1363.96, "end": 1367.64, "text": "das? Die Idee ist eigentlich gar nicht so schlecht. Warum schickst du deine Unterlagen nicht per"}, {"id": 155, "start": 1367.64, "end": 1373.32, "text": "Mail zum Steuerberater? Das ist eigentlich eine gute Frage. Ich glaube, das liegt zum"}, {"id": 156, "start": 1373.32, "end": 1379.72, "text": "größten Teil daran, weil ich so eine Mischung aus Real Life Beiträgen, Real Life Zettel"}, {"id": 157, "start": 1379.72, "end": 1385.96, "text": "habe, wo ich keinen Bock habe, die umgedreht dann einzuscannen und elektronischen Sachen."}, {"id": 158, "start": 1385.96, "end": 1410.16, "text": "Das darf German. Next. Install now. Jawoll. Was kosten sowas? Was kosten sowas hier?"}, {"id": 159, "start": 1410.16, "end": 1429.8, "text": "Laser Drucker, so ein alten Brother oder so. Was? 34 Euro? Achso, ohne Toner, ohne Toner."}, {"id": 160, "start": 1429.8, "end": 1446.2, "text": "Moment, Moment. Keg Weight. Das kann nicht funktionieren. Ich will irgendwas für 20"}, {"id": 161, "start": 1446.2, "end": 1451.0, "text": "Euro, so ein billiges Ding. Das kann ich dann in die Abstellkamera stellen und einmal im"}, {"id": 162, "start": 1451.0, "end": 1461.44, "text": "Jahr drucke ich da. Den stelle ich hier gar nicht ins Büro rein. Boah, das ist ja ein"}, {"id": 163, "start": 1461.44, "end": 1471.44, "text": "uralt fettes Ding. Das ist ja, das wiegt ja schon 100 Kilo alleine. Im Surferraum habe"}, {"id": 164, "start": 1471.44, "end": 1475.8, "text": "ich leider keinen Platz mehr. Normalerweise würde ich ja sagen, ich stelle das hier in"}, {"id": 165, "start": 1475.8, "end": 1482.48, "text": "meine Abstellkamera, also Schrägstrich-Surferraum, aber wie ihr seht, da ist ja kein Platz mehr."}, {"id": 166, "start": 1482.48, "end": 1490.6, "text": "Wo soll ich den Drucker hinstellen? Down of the Earth, da komme ich dann mal rein. Da"}, {"id": 167, "start": 1490.6, "end": 1504.72, "text": "ist kein Platz mehr. Schraub den Drucker an die Decke, die Decke"}, {"id": 168, "start": 1504.72, "end": 1513.44, "text": "ist ziemlich hoch in dem Raum. Was, Laserjet? Rocky ist Schoki, drei Monate, Dankeschön"}, {"id": 169, "start": 1513.44, "end": 1519.12, "text": "für den Sub. Von der Decke, nee das funktioniert. Ich weiß, dass G-Bade ist, aber ich denke"}, {"id": 170, "start": 1519.12, "end": 1531.08, "text": "ja manchmal auch an so abgedrehten Sachen, aber das klappt nicht richtig. Image of the"}, {"id": 171, "start": 1531.08, "end": 1535.64, "text": "day drucken, einmal im Monat, ja das ist eine gute Idee, da rostest du dich ein. Kannst"}, {"id": 172, "start": 1535.64, "end": 1539.44, "text": "du deine E3-Config im Discord hochladen? Nee, du kannst aber auf mein GitHub gucken, da"}, {"id": 173, "start": 1539.44, "end": 1547.6, "text": "ist die E3-Config. Boah, das ist ja noch ein altes, fettes, fetteres Teil. Aber wisst"}, {"id": 174, "start": 1547.6, "end": 1552.12, "text": "ihr, was wir machen könnten, was fällt mir gerade an? Wie schwer sind denn so Dinger?"}, {"id": 175, "start": 1552.12, "end": 1556.04, "text": "Nehmen wir mal den hier, was hat das Teil für ein Gewicht? Während Windows hier am,"}, {"id": 176, "start": 1556.04, "end": 1561.24, "text": "boah, gehste fort. Nein, ich hab kein Produktkey. Was übrigens lustig ist, dass wir mittlerweile,"}, {"id": 177, "start": 1561.24, "end": 1566.44, "text": "früher musste man da immer, äh, by the way, hab ich euch mal erzählt, ich kannte den Windows"}, {"id": 178, "start": 1566.44, "end": 1571.6, "text": "98 Produktkey auswendig, weil ich es in der damaligen Zeit so oft neu installiert hab."}, {"id": 179, "start": 1571.6, "end": 1584.88, "text": "Heute kannst du einfach klicken, ich hab kein Key und es geht trotzdem weiter. Okay, next."}, {"id": 180, "start": 1584.88, "end": 1598.52, "text": "Äh ja, next. Wie alt bist du? 36. So, ähm, wie viel wiegt denn sowas hier? Gewicht? Kilogramm?"}, {"id": 181, "start": 1598.52, "end": 1603.84, "text": "Wo ist das, das steht doch da meist. Sag mal, hat eBay nicht normalerweise eine längere"}, {"id": 182, "start": 1603.84, "end": 1614.84, "text": "Artikel, eine ordentliche Artikelbeschreibung immer gehabt? Ah. Vollständige Information."}, {"id": 183, "start": 1614.84, "end": 1623.44, "text": "Vollständige, hä? Was kosten sowas? Gewicht, die Dinger, so die alten Business-Dinger sind"}, {"id": 184, "start": 1623.44, "end": 1633.0, "text": "immer massive, fett. Okay, sagen wir mal aufgerundet mit Papier und allem drin, mein Papier wiegen,"}, {"id": 185, "start": 1633.0, "end": 1639.96, "text": "ja, aber ich sag mal aufgerundet mit allem 20 Kilo. Ähm, ne, das funktioniert nicht."}, {"id": 186, "start": 1639.96, "end": 1647.72, "text": "Da müsste ich ja hier quasi ein Regal machen, und hier hängt schon was an der Wand, da müsste"}, {"id": 187, "start": 1647.72, "end": 1654.52, "text": "ich hier nebentran ein Regal machen, was groß genug ist und 20 Kilo aushält, dauerhaft."}, {"id": 188, "start": 1654.52, "end": 1663.52, "text": "Ne. Ne, ich glaub, das ist keine so gute Idee. Dann stell ich den lieber in die andere"}, {"id": 189, "start": 1663.52, "end": 1666.64, "text": "Abstellkammer, kommt ein Raspberry Pi als Drucker so einfach dran und einmal im Jahr"}, {"id": 190, "start": 1666.64, "end": 1673.28, "text": "wird gedruckt. Weil, ganz ehrlich, wozu Drucker mit W-Lan-Funktionen kaufen, wenn man einfach"}, {"id": 191, "start": 1673.28, "end": 1679.88, "text": "über den Raspberry Pi irgendwie drucken kann. Einfach den Drucker 3D drucken, ah yes. Der"}, {"id": 192, "start": 1679.88, "end": 1691.72, "text": "hat Netzwerk, ja aber ich hab kein Netzwerk in meiner Abstellkammer. Also ich muss das"}, {"id": 193, "start": 1691.72, "end": 1699.04, "text": "in irgendeiner Art und Weise eh bridgen. Sag mal, weiß jemand, ob das funktioniert, wenn"}, {"id": 194, "start": 1699.04, "end": 1706.56, "text": "man nen Drucker hat? Johnny, was? Leak? Ne, ich wollt grad sagen, ne, ich kann das nicht"}, {"id": 195, "start": 1706.56, "end": 1712.08, "text": "aussprechen, langsam. Wie sprich man das aus? Johnny Yekoto, zwei Monate lang, ich schüffel"}, {"id": 196, "start": 1712.08, "end": 1719.84, "text": "den Sub. Massive Subscriptions, hrq für den Chat wieder hier. Bessere Abstellkammer,"}, {"id": 197, "start": 1719.84, "end": 1731.88, "text": "sehr agiler Name, äußerst Agile. Mario XCB, Massive Sub, zwei Monate. Ah ja, gut, wenn"}, {"id": 198, "start": 1731.88, "end": 1739.16, "text": "wir uns das noch am installieren, sehr schön. Und der Switch im Rack in der Abstellkammer,"}, {"id": 199, "start": 1739.16, "end": 1744.84, "text": "das ist nicht die Abstellkammer, das ist meine Säuferraum-Abstellkammer. Ich hab noch ne"}, {"id": 200, "start": 1744.84, "end": 1748.64, "text": "normale Abstellkammer, da würd ich den Drucker reinstellen. Hier ist ja kein Platz für"}, {"id": 201, "start": 1748.64, "end": 1753.84, "text": "den Drucker. Hier wäre das auch kein Problem. Hat jemand eine Ahnung, ob das, ob man gescheit"}, {"id": 202, "start": 1753.84, "end": 1759.48, "text": "von einem iPad oder generell von Tablets oder sagen wir mal von IOS-Geräten drucken kann?"}, {"id": 203, "start": 1759.48, "end": 1765.08, "text": "Ähm, zu einem Raspberry Pi Druckerserver, gibt's da irgendwie was? Wie nennen sich"}, {"id": 204, "start": 1765.08, "end": 1783.44, "text": "da Kram noch mal AirPrint oder AirPrint? AirPrint. Raspberry Pi Print-Server, Kubs und AirPrint"}, {"id": 205, "start": 1783.44, "end": 1807.4, "text": "einrichten. Alter, die Musik! Ach, Dings. Ok, das funktioniert schon mal gut. Ich hab"}, {"id": 206, "start": 1807.4, "end": 1827.28, "text": "noch einen. Geht das Ding denn unter Linux überhaupt? Bevor ich mir sowas alles kaufe,"}, {"id": 207, "start": 1827.28, "end": 1839.6, "text": "öhm, Open Printing, der funktioniert mit Linux. Die Frage ist jetzt nur, trau ich dem"}, {"id": 208, "start": 1839.6, "end": 1861.36, "text": "Chat, wenn er sowas sagt. Was ist denn die offizielle Homepage von denen? Das da. Ähm,"}, {"id": 209, "start": 1861.36, "end": 1869.64, "text": "Support. Ok, ich muss mal kurz den Darkreader ausmachen, die Seite sieht. Uah, Flashbang!"}, {"id": 210, "start": 1869.64, "end": 1880.32, "text": "Sonnenbrille auf, äh. Sag mal. Sag mal, bin nur ich das oder sieht die Seite wirklich"}, {"id": 211, "start": 1880.32, "end": 1895.08, "text": "echt scheiße aus? So mit kaputter Schrift und sowas? Die sieht so kacke aus, ok. Die"}, {"id": 212, "start": 1895.08, "end": 1902.28, "text": "für Baneschap, das ist richtige Baneschap-Seite. Jetzt geht der Darkreader wieder an auf Flashbang."}, {"id": 213, "start": 1902.28, "end": 1909.88, "text": "Ok, Global Download Sender. So und jetzt lasst mich, Global Download Sender auf. Lasst mich"}, {"id": 214, "start": 1909.88, "end": 1914.44, "text": "mal suchen nach dem Modell. Gibt schlimmere Seiten. Das hier sieht jetzt auch wieder ok"}, {"id": 215, "start": 1914.44, "end": 1919.56, "text": "aus, aber das andere ist wirklich, äh, Europe. Wobei, ist doch eigentlich egal, oder? Für"}, {"id": 216, "start": 1919.56, "end": 1934.52, "text": "Driver Download ist doch vollkommen egal. Search Product hier. Da isser. Ähm, Linux"}, {"id": 217, "start": 1934.52, "end": 1947.68, "text": "Driver. Linux Packages, als was gibt's das? Naja. What? Als Target Set. Was ist ok, Moment."}, {"id": 218, "start": 1947.68, "end": 1955.88, "text": "Was ist denn dann da drinnen? Also erst mal Trial MB Driver oder sowas. Warum ist das"}, {"id": 219, "start": 1955.88, "end": 1967.44, "text": "so groß? Na gut, dass das ganze Postscript gibt, aber trotzdem. Alter, what the fuck."}, {"id": 220, "start": 1967.44, "end": 1973.96, "text": "Vielleicht geht's auch einfach, wenn man's anschließt, weil der Driver dabei ist. Weil"}, {"id": 221, "start": 1973.96, "end": 1980.6, "text": "das hätte echt nen Charme. So ein All is Office Ding. Druckt der denn überhaupt noch?"}, {"id": 222, "start": 1980.6, "end": 1998.88, "text": "Ist da alles dabei? Alle mit Toner. Der Download ist lahm, das lassen wir bleiben. Aber das"}, {"id": 223, "start": 1998.88, "end": 2018.08, "text": "ist ne gute Idee. Ich find, das ist ne gute Idee. Was kostenbar sowas versandt? Kostenlos."}, {"id": 224, "start": 2018.08, "end": 2029.12, "text": "Ach, nice. Cool. Weil, ich glaub mir, ich hol mir so ein alles Ding. Mein Tintenstrahltrucker"}, {"id": 225, "start": 2029.12, "end": 2032.84, "text": "geht mir extrem auf den Sack. Ich mein, mein Tintenstrahltrucker hat zwar den Vorteil,"}, {"id": 226, "start": 2032.84, "end": 2040.76, "text": "der hat direkt Airprint und WLAN Geschiss drinne, aber, ähm, ja, yes, yes, yes, ist"}, {"id": 227, "start": 2040.76, "end": 2047.24, "text": "korrekt. Aber, des Eingrusten geht mir voll auf den Sack. Ich druck damit so wenig und"}, {"id": 228, "start": 2047.24, "end": 2050.96, "text": "die Farbe brauche ich druck damit ja keine Fotos oder sowas. Kann sich noch jemand an"}, {"id": 229, "start": 2050.96, "end": 2059.2, "text": "die Zeiten erinnern, wo man voll im Trend war und so ein super High-Res-Farb-Tintenstrahltrucker"}, {"id": 230, "start": 2059.2, "end": 2065.52, "text": "hatte und sich dann extra Fotopapier gekauft hat, dann ne halbe Stunde gedruckt hat und"}, {"id": 231, "start": 2065.52, "end": 2072.04, "text": "neben dem Drucker gesessen hat und die Millimeter geguckt hat, wie das Papier rauskommt. Und"}, {"id": 232, "start": 2072.04, "end": 2077.84, "text": "dann hat man sich gefreut, dass man eben so ein nice, äh, nice Quality auf Fotopapier"}, {"id": 233, "start": 2077.84, "end": 2082.38, "text": "hatte, was im Prinzip voll von Arsch war. Wenn ich wirklich gute Quali will, dann lass"}, {"id": 234, "start": 2082.38, "end": 2088.16, "text": "ich mir das professionell machen und ich drucke im Prinzip nie Farbe, jetzt auch nicht. Ich"}, {"id": 235, "start": 2088.16, "end": 2093.12, "text": "hab noch nichtmal Farbe drin in meinem Drucker. Ich hab nur Schwarz-Weiß-Patronen gekauft"}, {"id": 236, "start": 2093.12, "end": 2099.1, "text": "vom Trittanbieter. Aber das Einrosten und jedes Mal Kalibrieren und so geht mir voll"}, {"id": 237, "start": 2099.1, "end": 2103.04, "text": "auf den Sack. Ich will einfach einmal im Jahr, wenn ich Steuererklärungs-Sachen mache, für"}, {"id": 238, "start": 2103.04, "end": 2106.4, "text": "den Steuerberater ein paar Sachen ausdrucken. Das ist dann auch nicht viel. Lass es mal"}, {"id": 239, "start": 2106.4, "end": 2114.36, "text": "20-30 Seiten sein. Einfach irgendwelche Belege noch mal raushauen und das dann, ich will"}, {"id": 240, "start": 2114.36, "end": 2120.36, "text": "einfach drucken können, ohne mir Gedanken machen zu müssen. Okay, das ist so ein typisches"}, {"id": 241, "start": 2120.36, "end": 2124.48, "text": "Windows-Ding, was ich wieder nicht kapier. Guck mal. Der hat mich 5 Mal gefragt und ich"}, {"id": 242, "start": 2124.48, "end": 2130.6, "text": "hab gesagt, ich bin in Germany. Ich hab German Currency. Warum schlägt ihr mir standardmäßig"}, {"id": 243, "start": 2130.6, "end": 2140.96, "text": "jetzt Keyboard-Layout United Kingdom vor? Warum nicht einfach Germany? Und warum kann"}, {"id": 244, "start": 2140.96, "end": 2147.8, "text": "ich hier drinnen nicht G drücken für Germany? Was denkt sich Microsoft bei solchen Dingern?"}, {"id": 245, "start": 2147.8, "end": 2162.8, "text": "Paints-Champ. Zum Glück ist es nicht auf Französisch standardmäßig."}, {"id": 246, "start": 2162.8, "end": 2182.28, "text": "Du hast alle Level 1 Emotes gesammelt. Wow, nice. Steht grad bei mir in Twitch."}, {"id": 247, "start": 2182.28, "end": 2199.36, "text": "Das heißt, du musst Multicast-Forboding machen, wenn Wi-Fi und Drucker an unterschiedlichen"}, {"id": 248, "start": 2199.36, "end": 2202.92, "text": "Subnetzen sind. Nee, das passt ja. Deswegen würde ich auch ein Raspberry Pi ins WLAN"}, {"id": 249, "start": 2202.92, "end": 2206.88, "text": "hängen. Direkt an den Drucker dran. Das würde ich ja irgendwie bridgeen oder so. Mal gucken."}, {"id": 250, "start": 2206.88, "end": 2215.6, "text": "Bin schon nicht ganz sicher. So, what do you like to set up for personal use? Next. Jetzt"}, {"id": 251, "start": 2215.6, "end": 2218.96, "text": "sagt er gleich Microsoft-Account. Das ist auch wieder so typisch. Das ist auch wieder"}, {"id": 252, "start": 2218.96, "end": 2223.6, "text": "so eine richtig krasse Microsoft-Debate-Geschichte. Let's add an account. Und du denkst dir ja"}, {"id": 253, "start": 2223.6, "end": 2228.48, "text": "schon mal nichts Böses und sagst dann, lul, weh, bla, bla, bla. Und dann sagst du next."}, {"id": 254, "start": 2228.48, "end": 2234.92, "text": "Und dann sagt er, hä? Valid email-Attress. Ah, der erstellt ein Microsoft-Account. Dann"}, {"id": 255, "start": 2234.92, "end": 2238.08, "text": "muss man erst hier unten auf offline-Account drücken. Dann sagt er, oh nein, wollen Sie"}, {"id": 256, "start": 2238.08, "end": 2242.68, "text": "sicher einen offline-Account? Ja, ich will eine limited experience haben. By the way,"}, {"id": 257, "start": 2242.68, "end": 2247.28, "text": "was ist eigentlich limited an dieser experience? Außer, dass ich weniger Sachen an Microsoft"}, {"id": 258, "start": 2247.28, "end": 2256.68, "text": "schick? Gute Frage. Kannst du was zu sagen? Einfachster Weg, um einen Windows-Server extern"}, {"id": 259, "start": 2256.68, "end": 2261.56, "text": "erreichbar zu machen. Also das erste, was ich machen würde, ist gar nicht. Ich würde"}, {"id": 260, "start": 2261.56, "end": 2268.08, "text": "einen Windows-Server niemals ins Internet stellen. Es sei denn, du hast wirklich sehr"}, {"id": 261, "start": 2268.08, "end": 2273.16, "text": "gute Gründe für das zu machen. Wir gehen jetzt einfach mal davon aus, die hast du"}, {"id": 262, "start": 2273.16, "end": 2278.84, "text": "und willst das wirklich machen. Also die einfachste, die beste Variante, einen Windows-Server"}, {"id": 263, "start": 2278.84, "end": 2285.96, "text": "ins Internet zu bringen, ist, einen Linux-Server davor zu stellen. So. Aber wenn du das wirklich"}, {"id": 264, "start": 2285.96, "end": 2294.04, "text": "machen willst, dann ist die Frage, hast du eine statische IP, dann ist die Frage easy,"}, {"id": 265, "start": 2294.04, "end": 2298.24, "text": "da musst du gar nichts machen, außer Port weiterleiten. In der Regel kannst du eigentlich"}, {"id": 266, "start": 2298.24, "end": 2303.6, "text": "nur Dynamik-DNS machen. Der Anbieter ist egal. Du kannst hier einen Duck-DNS machen, du kannst"}, {"id": 267, "start": 2303.6, "end": 2309.84, "text": "über Cloudflare-DNS-Dinger machen oder so. Du musst aber halt auf jeden Fall Ports weiterleiten."}, {"id": 268, "start": 2309.84, "end": 2319.04, "text": "Und ich würde es nicht machen, ehrlich gesagt. Ich würde es nicht machen. Aber wenn du es"}, {"id": 269, "start": 2319.04, "end": 2325.8, "text": "unbedingt machen willst, dann ist DNS und im Heimbereich die einfachste Variante. Ich"}, {"id": 270, "start": 2325.8, "end": 2330.64, "text": "meine, auch wenn Kabelanschlüsse so gut wie statisch sind mittlerweile, aber die wechseln"}, {"id": 271, "start": 2330.64, "end": 2335.24, "text": "doch mal. Werdet du es elf Monate, du bist eins vor Hyper-Subscriber. Dankeschön für"}, {"id": 272, "start": 2335.24, "end": 2342.68, "text": "den Sub. Und wie läuft es bei euch? Wird gebashed? Hoffe ich mal, dass es gebashed wird. Ich"}, {"id": 273, "start": 2342.68, "end": 2346.12, "text": "hab gesehen, ihr sucht zwei neue Leute. Vielleicht doch nicht so gebashed. Keine Ahnung. Aber"}, {"id": 274, "start": 2346.12, "end": 2351.64, "text": "ich hoffe, es läuft alles gut bei euch. Static-IP ist ja meistens sinnlos daheim. Dir bleibt"}, {"id": 275, "start": 2351.64, "end": 2355.56, "text": "nichts anderes übers wie das über DNS zu machen. Aber ehrlich, ich würde keinen Windows-Server"}, {"id": 276, "start": 2355.56, "end": 2370.16, "text": "ans Internet stellen. Hey Maxi Schreiber, Montag eine Online- und IT-Rechtsklausur. Hast du"}, {"id": 277, "start": 2370.16, "end": 2373.64, "text": "irgendwelche Tipps? Ich hab von Online- und IT-Rechtsklausur keine Ahnung. Nee, hab ich"}, {"id": 278, "start": 2373.64, "end": 2385.92, "text": "nicht. Ok, Local-Account-Test. Dienstag ist VCT. Was ist denn VCT? Valorant? Tournament?"}, {"id": 279, "start": 2385.92, "end": 2397.12, "text": "Valorant? Was ist denn das C? Contenders Tournament? Nee, keine Ahnung. Champions Tour. Ah. Ok."}, {"id": 280, "start": 2397.12, "end": 2403.88, "text": "Chat, ihr werdet nie mein Passwort erraten, was ich vergeben hab. Da kommt ihr nicht drauf."}, {"id": 281, "start": 2403.88, "end": 2421.28, "text": "Wie habt ihr das erraten? Wie konntet ihr das Passwort erraten, Chat? Ist doch gar nicht"}, {"id": 282, "start": 2421.28, "end": 2430.8, "text": "möglich. Hallo123? Die Story mit, ne doch die Hallo123-Story hab ich ja schon erzählt,"}, {"id": 283, "start": 2430.8, "end": 2440.52, "text": "ne? Wo ich mal bei GMX nen Account fast verloren hab, weil ich Hallo123 hatte. Ist aber schon"}, {"id": 284, "start": 2440.52, "end": 2451.44, "text": "Jahre her. Or even better use an Online-Account. Nein. 1. Mein erstes Haus, die hieß 1. Ich"}, {"id": 285, "start": 2451.44, "end": 2458.36, "text": "bin in der Stadt 2 geboren und mein Nickname früher war nicht etwa Max oder so oder Maxi"}, {"id": 286, "start": 2458.36, "end": 2472.2, "text": "oder sonst wie. Nein, sondern 3. Letztens war ich im Freien. Es kommt immer noch vor,"}, {"id": 287, "start": 2472.2, "end": 2481.28, "text": "also mal an frischer Luft, ja. Und da hat ne Mutter ihr Kind gerufen und das Kind hieß"}, {"id": 288, "start": 2481.28, "end": 2493.24, "text": "Maximilian Tiberius. Dachte ich mir, ok. So vor 2000 Jahren im alten Rom wäre der glaube"}, {"id": 289, "start": 2493.24, "end": 2500.16, "text": "ich voll im Trend gewesen. Also das ist so ein typischer Römername. Wobei es wahrscheinlich"}, {"id": 290, "start": 2500.16, "end": 2506.44, "text": "eher Maximus wäre bei den Römern. Maximus Tiberius. Maximus, ne warte mal, wie hieß"}, {"id": 291, "start": 2506.44, "end": 2512.16, "text": "der Gladiator? Maximus Dezimus Meridius, glaube ne. Maximus Dezimus Meridius, wie hieß der"}, {"id": 292, "start": 2512.16, "end": 2520.92, "text": "Gladiator? Maximus, verstands doch. Maximus Dezimus Meridius war der Gladiator, genau."}, {"id": 293, "start": 2520.92, "end": 2526.84, "text": "So n Scheiß merke ich mir, ne? Weil ich gestern gegessen hab, weiß ich schon immer. Lollongos"}, {"id": 294, "start": 2526.84, "end": 2535.16, "text": "Schwanzos. Bigges Dickes. Ich muss ja ehrlich sagen, die Sachen sind ganz witzig, aber"}, {"id": 295, "start": 2535.16, "end": 2541.24, "text": "so diesen, den riesen Kultfilmhype um die Sachen versteh ich nicht. Die sind ganz witzig"}, {"id": 296, "start": 2541.24, "end": 2546.12, "text": "teilweise, aber jetzt so der Brüller einer, ich weiß es nicht. Also vielleicht ist einfach"}, {"id": 297, "start": 2546.12, "end": 2554.36, "text": "nicht so 100% Schweinhumor. Nein, wir wollen keine Speech Recognition haben. Wir wollen"}, {"id": 298, "start": 2554.36, "end": 2558.64, "text": "auch nicht die Location sharen. Wir wollen auch nicht mein Device finden. Wir wollen"}, {"id": 299, "start": 2558.64, "end": 2564.96, "text": "auch, übrigens das ist auch immer was tolles im Windows Setup. Man kann nicht, man kann"}, {"id": 300, "start": 2564.96, "end": 2570.44, "text": "nicht einfach sagen, ich will nichts zu Microsoft schicken. Diese Sachen, also diese Option"}, {"id": 301, "start": 2570.44, "end": 2577.28, "text": "gibt es nicht. Also es gibt bloß die Option, ich will wichtige Sachen schicken und zusätzliche"}, {"id": 302, "start": 2577.28, "end": 2581.08, "text": "Sachen oder ich will nur die wichtigen Sachen schicken. Ne Option, ich will gar nichts an"}, {"id": 303, "start": 2581.08, "end": 2585.68, "text": "Microsoft schicken ist nicht im Scope, wie man so schön sagt. Das gibt's net. Nein,"}, {"id": 304, "start": 2585.68, "end": 2590.68, "text": "ich will das nicht improven, ich will auch nix da. Alter, das ist so ätzend, dieses"}, {"id": 305, "start": 2590.68, "end": 2603.6, "text": "rumgeklick am Anfang immer. Es gibt A-Entschließungsinstall Speedruns gibt's. Echt? Zeig mal, da muss"}, {"id": 306, "start": 2603.6, "end": 2612.0, "text": "mir ein Link schicken, das müssen wir uns angucken. Nein, Cortana. Hallo. Früher hat"}, {"id": 307, "start": 2612.0, "end": 2618.36, "text": "Cortana jetzt immer angefangen zu labern. Zum Glück ist das vorbei. Hi, I'm Cortana."}, {"id": 308, "start": 2618.36, "end": 2625.52, "text": "Zum Glück shuttet die ab mittlerweile bei der Installation. So, ich werde das da einrichten,"}, {"id": 309, "start": 2625.52, "end": 2629.56, "text": "ich wollte gerade noch mal Chat lesen. Also, ne, kann ich dir nichts zu sagen, ich hab keine"}, {"id": 310, "start": 2629.56, "end": 2636.84, "text": "Ahnung von online und IT Recht. Die labert nur in der Pro nicht mehr. Ernsthaft, ist"}, {"id": 311, "start": 2636.84, "end": 2645.12, "text": "Cortana in der Home Version noch am Start? Was würden eure Consultants auf die Frage"}, {"id": 312, "start": 2645.12, "end": 2649.68, "text": "beantworten? Ich weiß gar nicht mal, um was es geht, deswegen kann ich jetzt nicht beantworten."}, {"id": 313, "start": 2649.68, "end": 2654.32, "text": "Das ist das Problem, also sobald mit dem Chat hinten dran ist. Ja, wer hat das noch mal"}, {"id": 314, "start": 2654.32, "end": 2658.84, "text": "gefragt mit dem Windows Server? TroM. Kann da jetzt noch eine Begründung, warum er seinen"}, {"id": 315, "start": 2658.84, "end": 2666.6, "text": "Windows Server ins Internet stellen will? Richtige Hexer setzen gar keinen Passwort,"}, {"id": 316, "start": 2666.6, "end": 2676.44, "text": "ich glaub das geht nicht. Bis denn, machs gut. Ja, jetzt wo du es sagst, ich überlegs mir"}, {"id": 317, "start": 2676.44, "end": 2694.76, "text": "noch mal. Das, ja, ich versteh auch, ich, ganz ehrlich, das wäre mir viel zu anstrengend,"}, {"id": 318, "start": 2694.76, "end": 2699.2, "text": "wenn ich mein Kind immer Maximilian Tiberius rufen würde. Das würd ich nur machen, wenn"}, {"id": 319, "start": 2699.2, "end": 2703.6, "text": "er was angestellt hat. Ich würd, ich würd den wahrscheinlich, ich, ich, also, ich würd"}, {"id": 320, "start": 2703.6, "end": 2707.16, "text": "mein Kind schon mal auch aus Prinzip nicht, nicht Max nennen. Das fänd ich irgendwie"}, {"id": 321, "start": 2707.16, "end": 2718.88, "text": "blöd. Max Junior oder so dann. Höchstens als Zweitname oder so, eventuell. Ich, ich"}, {"id": 322, "start": 2718.88, "end": 2724.28, "text": "würd den dann immer so nennen, wenn er was angestellt hat. Aber ansonsten, und ich würd"}, {"id": 323, "start": 2724.28, "end": 2743.92, "text": "mein Kind wahrscheinlich auch nicht Tiberius nennen. Arch Linux Installation Speedrun,"}, {"id": 324, "start": 2743.92, "end": 2748.24, "text": "das gibt es ernsthaft? Okay, das muss man zwar, das geht nur zwei Minuten, das müssen"}, {"id": 325, "start": 2748.24, "end": 2764.2, "text": "wir uns jetzt mal schnell angucken, während Windows installiert. Da, da, ich seh da aber"}, {"id": 326, "start": 2764.2, "end": 2769.36, "text": "noch einiges an Optimierungspotenzial. Und ob das die optimale Route ist, weiß ich, mag"}, {"id": 327, "start": 2769.36, "end": 2791.2, "text": "ich auch zu bezweifeln. Und das ist das der Weltrekord? Playback Speed is increased. Das"}, {"id": 328, "start": 2791.2, "end": 2803.44, "text": "ist gecheatet. Und außerdem der hat keine Splits? Der hat keine Splits? Oh, ohne Splits"}, {"id": 329, "start": 2803.44, "end": 2829.04, "text": "keine Speedruns. Was, was? Echo, was? Ah, W. Ah, der, der, der macht äh, Partitionierung."}, {"id": 330, "start": 2829.04, "end": 2833.44, "text": "Das ist, das ist die, das ist die Big Brain Variante, ne Festplatte zu Partitionieren,"}, {"id": 331, "start": 2833.44, "end": 2843.16, "text": "was der Typ da grad treibt. Ah, das ist langweilig, aber das kann man sicherlich noch optimieren."}, {"id": 332, "start": 2843.16, "end": 2847.0, "text": "Ich glaub, ich glaube, ich glaube, da werd ich auch mal nen Speedrun Attempt machen."}, {"id": 333, "start": 2847.0, "end": 2861.8, "text": "Aber mit richtig echtem Splits. Arch Linux Speedrun World Record Pace. Hier ist, der"}, {"id": 334, "start": 2861.8, "end": 2871.88, "text": "hier ist 1.10 Realtime. Hier. Ok, jetzt gehts los. Arch Speedrun World, World Record. Ok"}, {"id": 335, "start": 2871.88, "end": 2882.6, "text": "Moment, kurz, ich muss, ich muss, ich muss die Tippgeräusche hören. Moment, das ist"}, {"id": 336, "start": 2882.6, "end": 2889.48, "text": "in der VM, wo er das macht, aber ok, würd ich auch machen. Der hat aber Splits, immerhin"}, {"id": 337, "start": 2889.48, "end": 2897.92, "text": "hat er Splits, oder nicht wirklich Splits, aber nen Counter. Äh, Corsair RGB Tastatur"}, {"id": 338, "start": 2897.92, "end": 2915.68, "text": "muss schon mal sein. Wow. Ok, der hat schon mal nen bisschen anderen Pace drauf als der"}, {"id": 339, "start": 2915.68, "end": 2923.12, "text": "Rest. Der, der macht es richtig. Das, man kann nämlich schon den Befehl eintippen, den"}, {"id": 340, "start": 2923.12, "end": 2928.68, "text": "er danach ausführen soll, während der Installation, also während das andere Kommando läuft, kann"}, {"id": 341, "start": 2928.68, "end": 2944.36, "text": "man schon weiter tippen, das geht. Guckt der da oben ab? Ich glaub, da oben schreibt"}, {"id": 342, "start": 2944.36, "end": 2961.6, "text": "er, da schreibt er ab. Aber was ja auch legitim ist. Genauso musst du es machen, schon den"}, {"id": 343, "start": 2961.6, "end": 2966.88, "text": "restlichen Scheiß eingeben, bevor die Installer, genau, und dann ausführen, direkt wenn die"}, {"id": 344, "start": 2966.88, "end": 2975.84, "text": "Installer fertig ist. Siehste, das hat er alle schon eingetippt vorher. Und jetzt BÄM. Das"}, {"id": 345, "start": 2975.84, "end": 2986.12, "text": "ist ja schon hier Arch Linux Speedrun Install in einer Minute 10. Der hier ist auch krass."}, {"id": 346, "start": 2986.12, "end": 2990.84, "text": "Leute, ihr vergesst, ich hab nen Addon, was mir anzeigen lassen kann, welche Links was"}, {"id": 347, "start": 2990.84, "end": 3008.36, "text": "es gibt. Da hab ich sofort erkannt, dass das ein Recroll ist. Nen Wupploh aus. So, ist"}, {"id": 348, "start": 3008.36, "end": 3022.16, "text": "Windows da, jawoll. Ihh, Edge. Das ist so ne Windows Logi, frisch installiert, ne, und"}, {"id": 349, "start": 3022.16, "end": 3035.72, "text": "schon am meckern über irgendwas, was... Windows, was willst du von mir überhaupt? Edge ist"}, {"id": 350, "start": 3035.72, "end": 3038.84, "text": "PangeChamp. Ja, wir müssen erstmal schnell auf Vmware Tools installieren, dass ich das"}, {"id": 351, "start": 3038.84, "end": 3051.08, "text": "Ding im Vollscreen hab. Auf, auf, Vmware Tools, gib alles. Ja, install. Setup64exe hört sich"}, {"id": 352, "start": 3051.08, "end": 3055.92, "text": "immer sehr vertrauenserweckend an, wenn man den ISO mountet und es dich fragt, ob du Setup64exe"}, {"id": 353, "start": 3055.92, "end": 3072.8, "text": "wieder ausführen willst. Next, next, next, jawoll, ach so Musik anmachen. Wir hatten"}, {"id": 354, "start": 3072.8, "end": 3078.16, "text": "letztens, wo wir gerade bei Internet Explorer sind, wir haben so ne richtige PangeChamp"}, {"id": 355, "start": 3078.16, "end": 3082.36, "text": "Zeiterfassung auf der Arbeit. Die ist richtig PangeChamp, die sieht doch aus wie 1995,"}, {"id": 356, "start": 3082.36, "end": 3089.68, "text": "ne? Wahrscheinlich ist die von 1995. Und die haben sie geupgraded. Kennen die noch im Silverlight?"}, {"id": 357, "start": 3089.68, "end": 3098.12, "text": "Klar, klar. Ähm, was wollte ich jetzt erzählen? Genau, also, die haben sie geupgraded, die"}, {"id": 358, "start": 3098.12, "end": 3103.32, "text": "sah jetzt immer noch aus wie 1995, die Zeiterfassung Software, aber sie haben ein bisschen was"}, {"id": 359, "start": 3103.32, "end": 3108.12, "text": "am Layout geändert und das hat Kompatibilität mit dem Internet Explorer kaputt gemacht und"}, {"id": 360, "start": 3108.12, "end": 3115.44, "text": "die mussten ernsthaft das Update zurückrollen, weil sich Leute beschwert haben, die Seite"}, {"id": 361, "start": 3115.44, "end": 3124.6, "text": "würde nicht mal so aussehen wie sie das kennen. Das muss man sich echt mal vorstellen. Also"}, {"id": 362, "start": 3124.6, "end": 3128.8, "text": "wir haben Leute, die benutzen täglich bei uns auf der Arbeit noch den Internet Explorer."}, {"id": 363, "start": 3128.8, "end": 3141.08, "text": "Das ist schon PangeChamp, oder? Ich weiß gar nicht, was die da wollen. Und dann, das"}, {"id": 364, "start": 3141.08, "end": 3146.24, "text": "sind die gleichen Leute, die sich da drüber beschweren. Ho, Windows fühlt sich aber wieder"}, {"id": 365, "start": 3146.24, "end": 3150.68, "text": "so langsam an. Nein, das ist nicht Windows, was sich langsam anfühlt. Das ist der Internet"}, {"id": 366, "start": 3150.68, "end": 3171.6, "text": "Explorer, der nicht zurecht kommt mit modernen Webseiten. Ja, Bubble bringt ja bei CSS aber"}, {"id": 367, "start": 3171.6, "end": 3184.56, "text": "nix. So, da sind wir. Bäm, installiert. FPS Anzahl, klar. Komm, man muss schon wissen,"}, {"id": 368, "start": 3184.56, "end": 3188.84, "text": "guck mal, wir aktualisieren gerade unseren Windows Desktop mit. Gucken, ob ich das schneller"}, {"id": 369, "start": 3188.84, "end": 3196.0, "text": "hinkriege. Pass mal auf, wir machen jetzt Microsoft Desktop Aktualisierung Speedrun. Oh nee. Moment,"}, {"id": 370, "start": 3196.0, "end": 3201.92, "text": "wir müssen vorher noch eine Sache machen. Exclusive Mode, sonst packts rum. Auf wieviel"}, {"id": 371, "start": 3201.92, "end": 3207.48, "text": "Herz? 60 Herz. Bäm, vielleicht krieg ich schneller hin. Das kommt mehr als 60. Wieviel"}, {"id": 372, "start": 3207.48, "end": 3224.24, "text": "Herz gehen wir maximal? 64, 64. Gib alles, gib alles. 63. Arme tut weh. So, wunderbar,"}, {"id": 373, "start": 3224.24, "end": 3237.24, "text": "63. Gib es vielleicht so besser hin. Wusstest du gar nicht, dass die Vmware Grafik hatte"}, {"id": 374, "start": 3237.24, "end": 3241.44, "text": "mehr als 60? Kann? Ich auch nicht, wahrscheinlich ist das einfach nur eine Anzeige-Bug gewesen."}, {"id": 375, "start": 3241.44, "end": 3250.76, "text": "Wieviel kann? Steht das hier irgendwie? Wieviel die maximal kann? Das ist mal, Leute, ich"}, {"id": 376, "start": 3250.76, "end": 3259.36, "text": "bin mittlerweile unfähig. Ach hier, kannst du die... Ich weiß nicht mal, wo ich überhaupt"}, {"id": 377, "start": 3259.36, "end": 3268.16, "text": "Refresh Rate einstellen würde. Hier, 60, mehr geht nicht. Da steht aber einstellen."}, {"id": 378, "start": 3268.16, "end": 3274.0, "text": "So, also, jetzt erst mal dieses Windows Ding weg und als erste Amtshandlung, die wir machen"}, {"id": 379, "start": 3274.0, "end": 3280.68, "text": "müssen, ist... Nein, erste Amtshandlung, die wir machen müssen, ist Chrome runterladen,"}, {"id": 380, "start": 3280.68, "end": 3292.2, "text": "oder Firefox, oder was auch immer. So, wir nehmen Chrome, aber please den englischen"}, {"id": 381, "start": 3292.2, "end": 3305.88, "text": "Chrome, nicht den deutschen. Falsch, wir richten ein MS-Konto ein. Okay, wenn der Chat"}, {"id": 382, "start": 3305.88, "end": 3313.2, "text": "unbedingt Firefox will, machen wir Firefox. Warum kommt als erstes Opera, wenn man nach"}, {"id": 383, "start": 3313.2, "end": 3328.08, "text": "Firefox sucht? Ah ja, von Chip natürlich. Ich will aber den Firefox nicht als DE runterladen,"}, {"id": 384, "start": 3328.08, "end": 3343.52, "text": "sondern schon als US, genau. Okay, Firefox Installer. Moin, Kengin. Nee, N-Nightzackt."}, {"id": 385, "start": 3343.52, "end": 3349.12, "text": "Was heißt Zackt? Mag ich nicht. Ich benutze eigentlich zum größten Teil nur Scoop für"}, {"id": 386, "start": 3349.12, "end": 3352.88, "text": "Sachen zum installieren und ansonsten klassische Windows rumgeklicken."}, {"id": 387, "start": 3352.88, "end": 3372.16, "text": "So, jetzt kann ich den Edge gleich wegmachen. So, Firefox installiert, zack. Bam. So, wie"}, {"id": 388, "start": 3372.16, "end": 3378.08, "text": "stellt man nochmal die Fault-Apps um? So ging das, glaub. Die Fault-Mail-App für Browser."}, {"id": 389, "start": 3378.08, "end": 3383.52, "text": "Wisst ihr, was ich geil finde? Das ist alles Taktik von Microsoft, Leute. Ich sag's euch."}, {"id": 390, "start": 3383.52, "end": 3390.32, "text": "Ich weiß, man kann hier als Use-Default machen. Die haben den Browser als allerletztes unten"}, {"id": 391, "start": 3390.32, "end": 3394.32, "text": "und das haben die garantiert, dass die meisten Leute es nicht sehen, in der Hoffnung, sie"}, {"id": 392, "start": 3394.32, "end": 3408.32, "text": "verwenden weiter Edge. Nein. Geh mal nicht auf den Zack-Switch. Dazu kann ich nur sagen,"}, {"id": 393, "start": 3408.32, "end": 3420.96, "text": "Microsoft. Und jetzt erstmal unpin löschen. Okay, jetzt können wir, jetzt können wir,"}, {"id": 394, "start": 3420.96, "end": 3427.04, "text": "jetzt kann wir nichts mehr machen. Also, ehrlich gesagt, ich vergesse jedes Mal, wie man jetzt,"}, {"id": 395, "start": 3427.04, "end": 3432.48, "text": "wie man WSL 2 installiert. Ich muss das jedes Mal nachgucken, weil das ist ja nicht so einfach"}, {"id": 396, "start": 3432.48, "end": 3437.64, "text": "wie WSL irgendwie installieren. Früher musste man da, ich bin mir nicht sicher, ob man das"}, {"id": 397, "start": 3437.64, "end": 3446.64, "text": "immer noch musste, man musste in Turn Windows Features on off und dann musste man in, da"}, {"id": 398, "start": 3446.64, "end": 3451.28, "text": "muss man hier in den Häkchen hin machen. Keine Ahnung, ob das immer noch so ist. Wir gucken"}, {"id": 399, "start": 3451.28, "end": 3459.12, "text": "uns mal das offizielle How-To an. Muss immer noch als Feature aktivieren. By the way, wenn"}, {"id": 400, "start": 3459.12, "end": 3466.76, "text": "ihr mal kecken wollt, ein Telnet Client ist unter Windows ein additional Feature, was"}, {"id": 401, "start": 3466.76, "end": 3472.76, "text": "man erst über das alte Systemsteuerungsmenü aktivieren muss. Ja, ist ja auch ganz schön"}, {"id": 402, "start": 3472.76, "end": 3478.76, "text": "und das war es zu einem Telnet Client. Kann man nicht erwarten, dass er dabei ist. Ist"}, {"id": 403, "start": 3478.76, "end": 3482.56, "text": "er eigentlich Candy Crush und das gedürnt es noch drauf? Oder installiert er es in der"}, {"id": 404, "start": 3482.56, "end": 3488.56, "text": "Pro-Version nicht mehr? Das ist so viel Mist, ehrlich gesagt, da schon wieder dabei, was"}, {"id": 405, "start": 3488.56, "end": 3497.24, "text": "ich nicht verwende. Paint 3D. Gibt es überhaupt irgendjemand, der wirklich Paint 3D verwendet?"}, {"id": 406, "start": 3497.24, "end": 3509.04, "text": "Also ich verwende Lull 3D, aber nicht Paint 3D. Firefox oder Chrome, was ist besser? Ich"}, {"id": 407, "start": 3509.04, "end": 3514.8, "text": "bin langjähriger Firefox Fan und ich verwende unter Linux eigentlich auch immer noch standardmäßig"}, {"id": 408, "start": 3514.8, "end": 3520.76, "text": "Firefox, aber ich muss sagen, für den täglichen Gebrauch hat Chrome bei mir auf dem Desktop"}, {"id": 409, "start": 3520.76, "end": 3526.36, "text": "Firefox abgelöst. Firefox hat immer noch den Vorteil, dass ich die Adressleiste standardmäßig"}, {"id": 410, "start": 3526.36, "end": 3530.8, "text": "besser finde, weil die Historie Favoriten und alles Mögliche durchsucht und man da teilweise"}, {"id": 411, "start": 3530.8, "end": 3537.0, "text": "Seiten findet, wo man vor 10 Jahren mal drauf gewesen ist. Das ist wirklich nice. Aber alles"}, {"id": 412, "start": 3537.0, "end": 3546.04, "text": "in allem muss ich sagen, gefällt mir das Handling vom Chrome besser. Geschwindigkeitsmäßig"}, {"id": 413, "start": 3546.04, "end": 3549.28, "text": "würde ich sagen, ist der Chrome auch ein bisschen besser, wobei sich das Ganze nicht"}, {"id": 414, "start": 3549.28, "end": 3564.16, "text": "allzu viel nimmt. Schwer zu sagen. Hat beides seine Daseinsberechtigung. Ich mag halt Firefox,"}, {"id": 415, "start": 3564.16, "end": 3568.92, "text": "also Firefox hat mich, wisst ihr, ab wann ich gesagt habe, ich verwende auf dem Desktop"}, {"id": 416, "start": 3568.92, "end": 3573.88, "text": "kein Firefox mehr, beziehungsweise stimmt ja, ich verwende ja auf dem Desktop noch Firefox,"}, {"id": 417, "start": 3573.88, "end": 3579.6, "text": "wann ich gesagt habe, ich verwende auf meiner Standardinstallation kein Firefox mehr. Das"}, {"id": 418, "start": 3579.6, "end": 3594.16, "text": "war zu Firefox, ich glaube 48 oder so oder 58, wo sie die, wo sie die Pluginschnittstellen"}, {"id": 419, "start": 3594.16, "end": 3616.32, "text": "abgeschaltet haben. Firefox 59, was 59? Able old addons, mit was kam das denn? Ist das"}, {"id": 420, "start": 3616.32, "end": 3626.64, "text": "noch zufällig jemand? Ich glaube, ich glaube, das war, ich glaube, das war 58. Nee, 58,"}, {"id": 421, "start": 3626.64, "end": 3635.24, "text": "das ist zu kurz, das muss, muss schon ein bisschen länger gewesen sein. 48. Zumindest"}, {"id": 422, "start": 3635.24, "end": 3640.76, "text": "haben sie es da geschafft, NoScript kaputt zu machen und NoScript war für mich damals,"}, {"id": 423, "start": 3640.76, "end": 3660.0, "text": "äh, ah hier, Firefox 48 war es, genau. So und die haben quasi NoScript komplett kaputt"}, {"id": 424, "start": 3660.0, "end": 3670.4, "text": "gemacht. Das war Firefox 48, ja, genau, genau. Da haben sie nämlich auch was zugeschrieben."}, {"id": 425, "start": 3670.4, "end": 3681.0, "text": "Genau, das war 48 und das Problem war, ich, ich habe das damals für absolut notwendig"}, {"id": 426, "start": 3681.0, "end": 3686.04, "text": "gehalten, dass man NoScript verwendet. Ich finde das immer noch notwendig, aber es gibt"}, {"id": 427, "start": 3686.04, "end": 3690.2, "text": "damit mittlerweile ein paar einfache Dinge zu handhaben. NoScript musstest du jede einzelne"}, {"id": 428, "start": 3690.2, "end": 3695.44, "text": "Seite erlauben, sonst wie. Mittlerweile gibt es NoScript, doch es gibt wieder NoScript,"}, {"id": 429, "start": 3695.44, "end": 3700.44, "text": "wobei ich nicht weiß, ob es jemals wieder so nice funktioniert hat, wie die alten NoScript"}, {"id": 430, "start": 3700.44, "end": 3705.72, "text": "Varianten unter Firefox 48. Das weiß ich nicht mehr, weil es ging eine ganze Weile NoScript"}, {"id": 431, "start": 3705.72, "end": 3713.84, "text": "nicht richtig und deswegen habe ich gesagt, scheiß drauf, wenn die so einen Kack machen,"}, {"id": 432, "start": 3713.84, "end": 3722.84, "text": "kann ich auch Gleichchrom verwenden. Ist U-Matrix nicht tot? Ich weiß nicht, ob das tot ist."}, {"id": 433, "start": 3722.84, "end": 3738.6, "text": "Das ist anscheinend tot, doch. Warum? Ja, aber das wird nicht mehr geupdatet, warum nicht?"}, {"id": 434, "start": 3738.6, "end": 3757.2, "text": "Ach so Moment, New Tracker. Ist der Support eingestellt? Ich weiß, dass es, ich habe das"}, {"id": 435, "start": 3757.2, "end": 3762.52, "text": "gesehen, aber die meisten schreiben ja wenigstens noch was hin, warum das eingestellt ist."}, {"id": 436, "start": 3762.52, "end": 3785.48, "text": "Grip U-Matrix, okay. U-Matrix. Hat er sich da geäußert irgendwie?"}, {"id": 437, "start": 3785.48, "end": 3810.2, "text": "I don't have time to work on U-Matrix. Okay, ja, Grip. Zu viele negative Kommentare von"}, {"id": 438, "start": 3810.2, "end": 3815.68, "text": "der Community. Ey, das wäre ein Punkt, also wenn das der Fall wäre, das könnte ich tatsächlich"}, {"id": 439, "start": 3815.68, "end": 3825.36, "text": "verstehen, weil die Community, die Leute sind teilweise echt undankbar, gerade in Open"}, {"id": 440, "start": 3825.36, "end": 3850.4, "text": "Source Projekten und was immer witzig ist, der, na gut, wer auch immer übelst angepisst"}, {"id": 441, "start": 3850.4, "end": 3859.16, "text": "ist, ist der VLC-Maintainer, der kriegt auch immer richtig dumme Kommentare und es gibt"}, {"id": 442, "start": 3859.16, "end": 3872.48, "text": "jedes Jahr eine Diskussion um den Weihnachtshut. Das ist richtig Pain's Champ, Leute. Wenn"}, {"id": 443, "start": 3872.48, "end": 3880.48, "text": "ihr mal richtige, nervige Pain's Champ-Menschen auf einem Haufen sehen wollt, lest euch die"}, {"id": 444, "start": 3880.48, "end": 3889.92, "text": "Formthread im VLC zu dem Weihnachtsmann-Hut durch. Das ist extrem Pain's Champ, das geht"}, {"id": 445, "start": 3889.92, "end": 3894.56, "text": "über mehrere, das ist übrigens das Falsche, es gibt noch mehr Diskussionen, die teilweise"}, {"id": 446, "start": 3894.56, "end": 3909.88, "text": "bis ins letzte Jahr gehen und sowas. Das ist Massive Pain's Champ. Mir ist nicht richtig"}, {"id": 447, "start": 3909.88, "end": 3919.0, "text": "verständlich, wie man sich an einem Weihnachtsmann-Hut stören kann. Ja, ich habe auch manchmal"}, {"id": 448, "start": 3919.0, "end": 3925.92, "text": "das Gefühl, ich kann nicht verstehen, wie man solche Probleme haben kann. Hat VLC immer"}, {"id": 449, "start": 3925.92, "end": 3935.92, "text": "noch dieses altbackende UI? Ja. Aber das funktioniert ganz gut. Es ist halt wirklich"}, {"id": 450, "start": 3935.92, "end": 3945.0, "text": "voll der Witz. Zumal man sogar in den Settings ausschalten kann. Aber ich verstehe gar nicht,"}, {"id": 451, "start": 3945.0, "end": 3954.48, "text": "warum man über sowas diskutieren muss. Das ist einzig und allein die Entscheidung von"}, {"id": 452, "start": 3954.48, "end": 3958.16, "text": "dem, der den Kram entwickelt. Und wenn der sagt, er will da einen Weihnachtsmann-Hut"}, {"id": 453, "start": 3958.16, "end": 3962.52, "text": "drinne haben, dann hat er halt einen Weihnachtsmann-Hut drinne. Ich reg mich auch nicht auf darüber,"}, {"id": 454, "start": 3962.52, "end": 3966.0, "text": "auch wenn ich der ungläubigste Typ auf der Welt bin wahrscheinlich. Ich reg mich auch"}, {"id": 455, "start": 3966.0, "end": 3968.96, "text": "nicht über den Santa-Hat auf, ich würde mich auch nicht darüber aufregen, wenn der Typ"}, {"id": 456, "start": 3968.96, "end": 3972.84, "text": "sich da irgendwie, keine Ahnung, das Spaghetti Monster oder sowas. Das wäre mir vollkommen"}, {"id": 457, "start": 3972.84, "end": 3975.44, "text": "egal. Ich würde die Software verwenden und im Zweifelsfall würde ich es abschalten,"}, {"id": 458, "start": 3975.44, "end": 3983.92, "text": "wenn es mich zu sehr nervt. Naja. Hast du mal das geplante neue UI von VLC gesehen?"}, {"id": 459, "start": 3983.92, "end": 3995.72, "text": "Nein, habe ich nicht. Warum gibt es auf omg-ubuntu eine Anleitung, how to install vsl 2? Weil"}, {"id": 460, "start": 3995.72, "end": 4004.92, "text": "es obuntu ist wahrscheinlich, ne? Standardmäßig. Sorry, nicht obuntu, ich werde es korrekt"}, {"id": 461, "start": 4004.92, "end": 4025.76, "text": "aussprechen, ich habe recht. Jubantu natürlich. Das ist der aktuelle Zeitgeist gerade. Lilo,"}, {"id": 462, "start": 4025.76, "end": 4035.2, "text": "das ist der aktuelle Zeitgeist gerade. Man ist überall empört. Das ist leider aktuell so."}, {"id": 463, "start": 4035.2, "end": 4042.72, "text": "Egal was es ist, Leute sind überall über jeden Scheiß und jeden Furz empört. Und natürlich"}, {"id": 464, "start": 4042.72, "end": 4052.48, "text": "geht man lieber ins Forum und hatet rum, anstatt das Icon einfach abzustellen. So, also wie"}, {"id": 465, "start": 4052.48, "end": 4062.64, "text": "geht es jetzt? Install vsl 2 on Windows 10, sage ich her. Omg, jubantu. Ich will wissen,"}, {"id": 466, "start": 4062.64, "end": 4068.16, "text": "ob das immer noch so funktioniert, wie ich mir das, wie ich das, über das Feature Menü"}, {"id": 467, "start": 4068.16, "end": 4086.72, "text": "Enable vsl, ah PowerShell. PowerShell ist jetzt der neueste Shit, ok? Ok, das ist im Prinzip"}, {"id": 468, "start": 4086.72, "end": 4091.0, "text": "das gleiche, was ich über Skui gemacht hätte. Wir machen das jetzt über PowerShell. Coole"}, {"id": 469, "start": 4091.0, "end": 4095.48, "text": "Leute machen das. Leute, wisst ihr was wir vorher machen? Ballade die 3 Monate Dankeschön"}, {"id": 470, "start": 4095.48, "end": 4108.48, "text": "für den Sub. Exzellent Subscription. Um nichts zu sagen. Massive. Das Ubuntu tutorial ist"}, {"id": 471, "start": 4108.48, "end": 4117.08, "text": "für Anfang 2000. vsl 2, Microsoft können wir auch gucken. Was ich machen will, wir"}, {"id": 472, "start": 4117.08, "end": 4122.04, "text": "installieren jetzt das neue Windows Terminal erstmal. Ne ne ne ne, das neue, wir machen"}, {"id": 473, "start": 4122.04, "end": 4131.36, "text": "heute Microsoft Only. Windows Terminal, wir installieren das neue Windows Terminal. Das"}, {"id": 474, "start": 4131.36, "end": 4135.92, "text": "neue, worüber man sich ja eigentlich schon, da sieht man mal, wenn so ein Projekt 72.000"}, {"id": 475, "start": 4135.92, "end": 4142.36, "text": "Sterne kriegt, für ein Terminal, was im Prinzip immer noch schlechter ist, also nur nach 15,"}, {"id": 476, "start": 4142.36, "end": 4148.8, "text": "nur nach 15 Linux Terminal, sieht man mal wie painstampig das alte Terminal eigentlich war."}, {"id": 477, "start": 4148.8, "end": 4152.48, "text": "Ich meine, das hier ist ja nur wirklich eine Beleidigung für jeden, der im Terminal was"}, {"id": 478, "start": 4152.48, "end": 4163.64, "text": "tippen will. Ja, es gibt ein neues. This repo-cont, install and running. Man kann über GitHub"}, {"id": 479, "start": 4163.64, "end": 4169.28, "text": "installieren, aber den Microsoft Store, ok, wir gehen in den Microsoft Store, herunterladen,"}, {"id": 480, "start": 4169.28, "end": 4188.52, "text": "jawoll. Ich hoffe, ich brauch dafür keinen Microsoft Account. Get, hallo, get. No, einfach"}, {"id": 481, "start": 4188.52, "end": 4200.04, "text": "runterladen. You own this app, sehr schön, dass ich die owne. Ein, aha, einfach abbrechen,"}, {"id": 482, "start": 4200.04, "end": 4205.4, "text": "null. Launch. Jetzt pinnen. So, da haben wir das neue Microsoft Terminal. Standardmäßig"}, {"id": 483, "start": 4205.4, "end": 4210.08, "text": "auch schon eine PowerShell am Start, sehr gut. So muss das sein. Chat gucken, ich glaube,"}, {"id": 484, "start": 4210.08, "end": 4216.2, "text": "ich hab nicht irgendwas übersehen. Shithub, genau. Ja, wie gesagt, es gibt ein neues,"}, {"id": 485, "start": 4216.2, "end": 4223.12, "text": "das ist benutzbar im Vergleich zu dem alten wenigstens. Ich glaube schon, dass bei WSL"}, {"id": 486, "start": 4223.12, "end": 4229.6, "text": "die Ubuntu Leute mit dabei sind. Ja, bin ich für mal ein, dass ich das auch irgendwo"}, {"id": 487, "start": 4229.6, "end": 4256.52, "text": "gelesen hab. Chrome oder Chromium? Das hier ist ein Chromium. Aber ganz ehrlich, dem Standard-User"}, {"id": 488, "start": 4256.52, "end": 4261.72, "text": "würde ich tatsächlich ein Chrome empfehlen, weil gerade für Windows, da gibt es Security"}, {"id": 489, "start": 4261.72, "end": 4266.28, "text": "Updates einen Ticken schneller aus wirklich richtig offiziellen Google-Quellen und so Sachen"}, {"id": 490, "start": 4266.28, "end": 4277.52, "text": "wie GPU-Beschleunigung und sowas funktionieren, was bei mir hier Probleme macht. WinGet kann"}, {"id": 491, "start": 4277.52, "end": 4287.48, "text": "immer noch nicht den selenialen Microsoft, ey. Also Windows ist wirklich in manchen Belangen"}, {"id": 492, "start": 4287.48, "end": 4291.96, "text": "zehn Jahre plus hinter Linux. Umgedreht ist Linux auch in vielen Belangen zehn Jahre"}, {"id": 493, "start": 4291.96, "end": 4301.04, "text": "plus hinter Windows. Leider gibt es noch nicht das perfekte Betriebssystem für alles. Deswegen"}, {"id": 494, "start": 4301.04, "end": 4307.72, "text": "ist es ganz einfach, einfach den Linux installieren in der VM, so wie hier, und rüberswitchen."}, {"id": 495, "start": 4307.72, "end": 4313.52, "text": "Easy. Beste Variante. Windows Host und Mac OS, nee, auch nicht wirklich. Du hast unter"}, {"id": 496, "start": 4313.52, "end": 4319.96, "text": "Temple OS kommt der Sache am nächsten, ja. Du hast unter Mac OS zwar den Vorteil, dass"}, {"id": 497, "start": 4319.96, "end": 4325.4, "text": "du viele Unix-like-Programme verwenden kannst, standardmäßig einen ziemlich alten Varianten,"}, {"id": 498, "start": 4325.4, "end": 4330.0, "text": "aber gibt's ja auch zum Updaten. Dafür hast du halt schlicht und ergreifend viele Windows-Software"}, {"id": 499, "start": 4330.0, "end": 4338.04, "text": "nicht. Also sprich, du hast beispielsweise keinerlei Spiele. Wie hast du deine Taskbar"}, {"id": 500, "start": 4338.04, "end": 4343.12, "text": "so geändert? Gar nicht, das ist die komplette Default-Taskbar. Ich hab das Ding gerade frisch"}, {"id": 501, "start": 4343.12, "end": 4357.48, "text": "installiert. So, also wie geht das Ganze jetzt? Installieren das WS des Windows-Subsystems?"}, {"id": 502, "start": 4357.48, "end": 4365.68, "text": "Wir machen das nach der Ubuntu-Anleitung, die wissen, wie das geht. So. Also, Enable."}, {"id": 503, "start": 4365.68, "end": 4375.72, "text": "Dism. Alles klar. M. Wir müssen als erstes in diesem Terminal nochmal ordentlich was"}, {"id": 504, "start": 4375.72, "end": 4385.44, "text": "einstellen. Settings. Was? Ich muss eine extra App für Settings installieren? Ach,"}, {"id": 505, "start": 4385.44, "end": 4403.16, "text": "das ist Jason-Settings-Files, oder? Ach so. EGit Notepad. Ich wollte eigentlich nur den"}, {"id": 506, "start": 4403.16, "end": 4409.08, "text": "Font ändern. Wie kann ich den Font ändern? Scheint schon wieder hochkomplex zu sein."}, {"id": 507, "start": 4409.08, "end": 4421.24, "text": "By the way, warum hat Windows eigentlich nicht einen standardmäßig gescheiten Editor dabei?"}, {"id": 508, "start": 4421.24, "end": 4427.52, "text": "Ich mein, die haben doch jetzt VS Code am Start. Installieren wir auch nochmal, wo wir"}, {"id": 509, "start": 4427.52, "end": 4435.56, "text": "gerade dabei sind. Wo wir gerade dabei sind. Komm. By the way, hat irgendjemand eine plausible"}, {"id": 510, "start": 4435.56, "end": 4442.28, "text": "Erklärung dafür, warum es Wishlist Studio Code nicht im Microsoft-Store gibt? Wenn ich"}, {"id": 511, "start": 4442.28, "end": 4452.2, "text": "auf VS Code suche, bekomme ich hier Heartbeat Romance Club. Warum gibt's den Kram nicht"}, {"id": 512, "start": 4452.2, "end": 4459.08, "text": "im, warum gibt's den, warum gibt's das nicht im Store? Sagt Microsoft dadurch nicht quasi"}, {"id": 513, "start": 4459.08, "end": 4479.96, "text": "indirekt, fuck den Windows-Store? Microsoft Romance Club. Ja, das glaube ich auch, die"}, {"id": 514, "start": 4479.96, "end": 4484.48, "text": "wissen selbst, dass der Store scheiße ist. Wishlist Studio selbst und sowas geht ja auch"}, {"id": 515, "start": 4484.48, "end": 4492.92, "text": "nicht über den Store, wobei es gerade dafür sinnvoll wäre, den Kram zu updaten. So, kann"}, {"id": 516, "start": 4492.92, "end": 4500.76, "text": "ich jetzt, kann ich jetzt Settings von meinem Terminal ändern? Wishlist Studio Code exquisite."}, {"id": 517, "start": 4500.76, "end": 4528.28, "text": "Okay, wie, jetzt gibt's die große Preisfrage. Windows Terminal Font. Wie kann man, wie kann"}, {"id": 518, "start": 4528.28, "end": 4537.08, "text": "man die, wie kann man hier die Schriftart und Größe und so ändern? Hat das ein Autocomplete"}, {"id": 519, "start": 4537.08, "end": 4563.04, "text": "oder sowas? Ah ja, anscheinend Autocomplete, okay. Also, Format, nee. Font, hm. Tja. Font,"}, {"id": 520, "start": 4563.04, "end": 4571.84, "text": "geht schon mal nicht. Font, äh, gibt's anscheinend nicht. Okay. New Windows Terminal, Change"}, {"id": 521, "start": 4571.84, "end": 4576.76, "text": "Font. Einstellungen aufmachen, das sind die Einstellungen, die haben kein Einstellungsmenü"}, {"id": 522, "start": 4576.76, "end": 4601.84, "text": "mehr. Was unter Profiles? Was? Profiles? Ah, hier. Ah, put settings here that you want"}, {"id": 523, "start": 4601.84, "end": 4610.36, "text": "to apply for all, okay. Font. Ah, Font Face. Cascadia Mono, ist das Standard, ne? Okay,"}, {"id": 524, "start": 4610.36, "end": 4616.48, "text": "hat das, hat das hier Autocomplete? Nee, natürlich nicht. Aber Hack, ich hab Hack nicht installiert."}, {"id": 525, "start": 4616.48, "end": 4635.36, "text": "Hack Font. Oh, what? Okay, probier mal Font, Font Size aus, 20. Wow. Thick. Wenigstens"}, {"id": 526, "start": 4635.36, "end": 4648.28, "text": "updatet es gleich. Oh, 16. Bam. So, so mag ich das. 14. So, okay, wir lassen jetzt den"}, {"id": 527, "start": 4648.28, "end": 4652.24, "text": "Default von, ich wollt bloß mal gucken, wie man da was umstellt. Also, WSL installieren,"}, {"id": 528, "start": 4652.24, "end": 4656.92, "text": "bam. Oh. Ach nee, ich muss, Moment, ich muss als Admin starten. Ich muss als Admin, kann"}, {"id": 529, "start": 4656.92, "end": 4663.6, "text": "man hier raus direkt was als Admin starten? Nee, ne? Siehste mal, das wär zum Beispiel"}, {"id": 530, "start": 4663.6, "end": 4670.44, "text": "ne sinnvolle Funktion, die es anscheinend so standardmäßig net gibt. Das heißt, ich"}, {"id": 531, "start": 4670.44, "end": 4692.96, "text": "muss jetzt den Kram komplett als Admin starten, oder wie? Pass Control und Shift. Okay, ich"}, {"id": 532, "start": 4692.96, "end": 4703.0, "text": "muss mal gucken. Okay. Features werden enabled, sehr schön. So, enable virtual machine platform"}, {"id": 533, "start": 4703.0, "end": 4717.28, "text": "requires, alles klar. Wir haben ein neues Window, das passt. M, X. Hack Font, Hack Font"}, {"id": 534, "start": 4717.28, "end": 4732.48, "text": "ist der beste, seh ich auch so. Okay. Was gesudo? Das ist was, was man nachinstallieren"}, {"id": 535, "start": 4732.48, "end": 4752.92, "text": "muss, oder? Wahrscheinlich. Wir installieren jetzt mal Package Manager und Ordentlichen"}, {"id": 536, "start": 4752.92, "end": 4764.32, "text": "für Windows, install methods, jawoll. Und dann installieren wir was, gesudo. Boah, das"}, {"id": 537, "start": 4764.32, "end": 4781.8, "text": "ist schon wieder so ein richtiges Rumgefrickel hier. Was? Ah ja. Es jit, jit muss ich installieren."}, {"id": 538, "start": 4781.8, "end": 4796.76, "text": "Okay. Was gesudo? Ey, das gibt's da wirklich. Gesudo und dann, und dann wie? Und dann was?"}, {"id": 539, "start": 4796.76, "end": 4803.4, "text": "Und dann Explorer, oder was? Ah. Okay, das ist in der Tat ganz praktisch. Kann ich da"}, {"id": 540, "start": 4803.4, "end": 4811.92, "text": "auch Kommando-Zeilen-Programme damit ausführen? Also sagen wir mir ls, gesudo ls. Hey, das"}, {"id": 541, "start": 4811.92, "end": 4815.12, "text": "ist tatsächlich ganz nützlich. Ein ordentliches Sudo für Windows, das ist ja mal richtig"}, {"id": 542, "start": 4815.12, "end": 4823.12, "text": "poggers. Nice. Okay, können wir weitermachen mit WSL? Also, das haben wir gemacht. Enable"}, {"id": 543, "start": 4823.12, "end": 4829.72, "text": "virtual machine, set WSL als Default. Gesudo, machen wir das jetzt einfach mal hier so."}, {"id": 544, "start": 4829.72, "end": 4847.96, "text": "Aber dass er jedes Mal fragt, ist auch schon echt ätzend. Oh. Was ist kaputt? Muss ich"}, {"id": 545, "start": 4847.96, "end": 4853.96, "text": "doch als Admin ausführen noch mal? Muss man rebooten? Stand das da, dass man rebooten"}, {"id": 546, "start": 4853.96, "end": 4868.28, "text": "muss? Restart your system. Na gut. Warum haben die dann bei dem letzten Kommando no restart"}, {"id": 547, "start": 4868.28, "end": 4875.68, "text": "angegeben, wenn man doch danach eh restarten muss? Winnerslogik. Egal, wir rebooten mal"}, {"id": 548, "start": 4875.68, "end": 4891.6, "text": "eine Runde. So muss das sein. Exquisite Reboot. Was ist besser? Das Emote, wo er sich nicht"}, {"id": 549, "start": 4891.6, "end": 4896.08, "text": "bewegt oder wo er sich bewegt? Weil eins von beiden will ich rausschmeißen. Beide brauchen"}, {"id": 550, "start": 4896.08, "end": 4907.2, "text": "nur nicht. Wo er sich bewegt, ist besser, oder? Ich hätte ja gerne die Fast Food Variante"}, {"id": 551, "start": 4907.2, "end": 4915.32, "text": "mit Animation. Die würde ich sofort reinnehmen. Die würde ich sofort reinnehmen, wenn es"}, {"id": 552, "start": 4915.32, "end": 4932.44, "text": "sie mit Animation gäbe. So. Und jetzt? Wie geht's weiter? WSL. Was stehen wir? WSL"}, {"id": 553, "start": 4932.44, "end": 4957.52, "text": "Default Version. Und jetzt? Please Wizard. Okay. Wie macht man links hier auf? Wie machst"}, {"id": 554, "start": 4957.52, "end": 4962.36, "text": "du denn dieses Swipen in der VM? Was meinste? Du meinst das Wechseln zwischen Host und VM?"}, {"id": 555, "start": 4962.36, "end": 4970.84, "text": "Ctrl, Alt, Pfeil rechts, Pfeil links. Ich hab auf dem Desktop meine VM und hier den"}, {"id": 556, "start": 4970.84, "end": 4987.4, "text": "anderen Kram und ich kann einfach mit Tasten Kombination wechseln. Okay, wie installier"}, {"id": 557, "start": 4987.4, "end": 4992.44, "text": "ich jetzt? Warum ist das hier nicht Science and Technology, weil ich nicht umgestellt"}, {"id": 558, "start": 4992.44, "end": 5000.92, "text": "hab? Ja, Splixer kann ich, das kann ich alles machen. Das ist bloß die Frage, wo das steht."}, {"id": 559, "start": 5000.92, "end": 5018.2, "text": "Also mal angenommen, ich hätte jetzt keinen Chat, der mir helfen kann. Ah, Please Wizard"}, {"id": 560, "start": 5018.2, "end": 5033.96, "text": "Kernel. Okay, das haben wir gemacht. By the way, warum kann er nicht einfach den alten"}, {"id": 561, "start": 5033.96, "end": 5043.68, "text": "Kernel starten und dann sich upgraden und selbst downloaden? Okay, es ist Windows, das"}, {"id": 562, "start": 5043.68, "end": 5059.84, "text": "darf man nicht zu viel erwarten in der Richtung. Paints Jap. Ja. Ja, hab ich gemacht. Okay"}, {"id": 563, "start": 5059.84, "end": 5068.12, "text": "und jetzt? Darf ich jetzt? Ah, yes. Sehr schön. Muss ich eigentlich überhaupt mit"}, {"id": 564, "start": 5068.12, "end": 5074.8, "text": "Sudo machen müssen? Nee, anscheinend nicht. Okay, passt, es ist ja gerade installiert."}, {"id": 565, "start": 5074.8, "end": 5081.36, "text": "Set WSL2 as your default version, install your Linux distribution of choice. Okay, das"}, {"id": 566, "start": 5081.36, "end": 5093.56, "text": "heißt, jetzt geht man in den Store und sucht... Was ist denn da oben los? Was will der denn"}, {"id": 567, "start": 5093.56, "end": 5108.6, "text": "von mir? Wenigstens kein Candy Crush am Start. So und jetzt Ubuntu. By the way, warum lädt"}, {"id": 568, "start": 5108.6, "end": 5114.52, "text": "er den Kram? Okay, den Sinn muss mir jetzt mal einer erklären. Man lädt das über den"}, {"id": 569, "start": 5114.52, "end": 5124.52, "text": "Microsoft Store runter, aber die Sache updaten kann man nicht über den Microsoft Store."}, {"id": 570, "start": 5124.52, "end": 5142.28, "text": "Das muss man nicht verstehen. Ubuntu 20.04, jawoll, komm her. 20.04 LTS. Moment, was"}, {"id": 571, "start": 5142.28, "end": 5150.68, "text": "ist, was ist das hier? 9 Euro Virtualisierungskram. Ich bin ja immer begeistert, wie viel Schrott"}, {"id": 572, "start": 5150.68, "end": 5158.44, "text": "es im Windows Store gibt. Powerful Simply Virtual Machine. Ist das, ist das ein Frontend"}, {"id": 573, "start": 5158.44, "end": 5185.84, "text": "für Virtual Box? Er scheint mir recht Paynes-champig zu sein. Was, run Mac on Windows? Äh. Run"}, {"id": 574, "start": 5185.84, "end": 5193.04, "text": "Mac on Windows, okay. Das ist, das ist gar maß. Wir haben es ja schon mal ausprobiert."}, {"id": 575, "start": 5193.04, "end": 5198.04, "text": "Vielleicht auch ein Hyper-V-Freund, wir haben es ja schon mal ausprobiert. Mac läuft virtualisiert."}, {"id": 576, "start": 5198.04, "end": 5207.48, "text": "Naja, man kann Sachen drin ausprobieren, aber schön ist es nicht. Was ist Reft? Ist"}, {"id": 577, "start": 5207.48, "end": 5217.88, "text": "das auch hier ein Distro, oder? What the fuck? Es ist schon mal geil, ne? Bevor steht, was"}, {"id": 578, "start": 5217.88, "end": 5229.24, "text": "es ist, bevor da steht, was es ist, ist erstmal Payment. Ein Distribution Manager. Warum soll"}, {"id": 579, "start": 5229.24, "end": 5238.32, "text": "ich ein Abo kaufen für einen Windows WSL Distribution Manager? Warum denn Abo? Was ist denn da wieder"}, {"id": 580, "start": 5238.32, "end": 5251.6, "text": "los, ey? Eine Güte. Okay, also jetzt sollen wir den Kram hier installieren. Okay, machen"}, {"id": 581, "start": 5251.6, "end": 5258.24, "text": "wir. Gucken, ob wir auf der richtigen Seite rausgekommen sind. Also ein hässlicheres"}, {"id": 582, "start": 5258.24, "end": 5262.2, "text": "Logo hätten sie ja nicht nehmen können, oder? Also ein hässlicheres Logo, wirklich. Ist"}, {"id": 583, "start": 5262.2, "end": 5267.28, "text": "das mal ernsthaft. Das sieht aus, als hätte es irgendjemand mit Paint 3D gebaut. Wahrscheinlich"}, {"id": 584, "start": 5267.28, "end": 5272.96, "text": "war mit ihm verboten, das mit Paint zu bauen. Das ist, das ist das normale Ubuntu Logo"}, {"id": 585, "start": 5272.96, "end": 5283.16, "text": "kopiert auf einen absolut unpassenden blauen Hintergrund. Nein. Sieht aus, sieht aus wie"}, {"id": 586, "start": 5283.16, "end": 5301.6, "text": "ein Scam Download, ja? Echt so. Okay, Ubuntu wird installiert. Get. Install Windows Termin,"}, {"id": 587, "start": 5301.6, "end": 5309.6, "text": "das haben wir schon gemacht, haben wir schon gemacht. Geh weg. Genau, mal gucken, ob der"}, {"id": 588, "start": 5309.6, "end": 5315.76, "text": "das automatisch erkennt jetzt. Ups, ah. Okay, ich schließe, ich schließe das nochmal."}, {"id": 589, "start": 5315.76, "end": 5323.96, "text": "Ich schließe das nochmal. Gucken, ob der jetzt automatisches WSL erkennt. Nein. Das"}, {"id": 590, "start": 5323.96, "end": 5327.96, "text": "wäre ja auch deutlich zu einfach, wenn er das automatisch mitkriegen würde. Oder vielleicht"}, {"id": 591, "start": 5327.96, "end": 5340.72, "text": "muss ich WSL auch einmalig starten. Was ist denn der Unterschied zwischen dem WSL Kommando?"}, {"id": 592, "start": 5340.72, "end": 5364.92, "text": "WSL und Ubuntu. Wo bekomme ich raus, wo das liegt? Gar nicht. Ah, okay. Ubuntu, Installing."}, {"id": 593, "start": 5364.92, "end": 5381.88, "text": "Alles klar, auf geht's. Während es installiert. Genau, also ich muss sagen, es ist mittlerweile"}, {"id": 594, "start": 5381.88, "end": 5388.36, "text": "nicht mehr ganz so schlimm, aber eine ordentliche Linux Installation ist mir immer noch lieber."}, {"id": 595, "start": 5388.36, "end": 5395.16, "text": "Es ist cool, dafür ist es tatsächlich gut, wenn man Windows Sachen und Linux Sachen besser"}, {"id": 596, "start": 5395.16, "end": 5399.24, "text": "verknüpfen will, also wenn man beispielsweise einen Explorer starten will aus einer Linux"}, {"id": 597, "start": 5399.24, "end": 5404.56, "text": "Shell oder so. Ja, dafür ist es cool. Aber ansonsten, ich bevorzuge immer nochmal Linux"}, {"id": 598, "start": 5404.56, "end": 5423.32, "text": "für M. Geh sudo credentials cache. Probieren wir gleich noch aus. Unix name. Test. 123456."}, {"id": 599, "start": 5423.32, "end": 5430.48, "text": "123456. Jawoll. Installierst du dann als nächstes PowerShell unter WSL 2? Können"}, {"id": 600, "start": 5430.48, "end": 5450.28, "text": "wir das nicht machen? Kann man Wein installieren? Nee, oder? Das heißt, wir könnten Wein installieren"}, {"id": 601, "start": 5450.28, "end": 5472.04, "text": "und dann in Y Notepad ausführen. Okay, erst mal sudo update. Achso, ich wollte ja gucken,"}, {"id": 602, "start": 5472.04, "end": 5478.4, "text": "ob das, wir machen erst nochmal ein Upgrade. Ich wollte ja mal gucken, ob das jetzt in"}, {"id": 603, "start": 5478.4, "end": 5484.84, "text": "dem neuen Windows Terminal drin ist. Wir installieren da nun mal ein Wein und führen da drüber"}, {"id": 604, "start": 5484.84, "end": 5497.56, "text": "was aus. Das wird grausam. Wir führen da ein Notepad über Wein in Windows aus. Scheint"}, {"id": 605, "start": 5497.56, "end": 5503.08, "text": "zu funktionen, jetzt probieren wir gleich mal aus. So, erst mal updaten. Was passiert"}, {"id": 606, "start": 5503.08, "end": 5509.92, "text": "hier? Wir gucken uns WSL 2 an, ob das immer noch sagt. Beziehungsweise, ob man damit beispielsweise"}, {"id": 607, "start": 5509.92, "end": 5514.76, "text": "als grafische Programmegescheit verwenden kann. Ich gucke mir das einmal im Jahr oder"}, {"id": 608, "start": 5514.76, "end": 5522.56, "text": "so an. Okay, wir haben geupdatet. Wie sieht es aus? Ist es jetzt hier drin? Da ist es."}, {"id": 609, "start": 5522.56, "end": 5531.08, "text": "Da ist es, Leute. Seht ihr es? Eben war die Frage, wie ich das mit dem TTS mache, mit"}, {"id": 610, "start": 5531.08, "end": 5537.24, "text": "dem Text-to-Speech. Ich habe hier so eine eigene Sache gebastelt. Das ist quasi mein"}, {"id": 611, "start": 5537.24, "end": 5548.72, "text": "Stream Deck, selbst gebaute Stream Deck-Lite-Geschichte. Da sind ein paar Bildchen drin. Die GIF-Animation"}, {"id": 612, "start": 5548.72, "end": 5555.24, "text": "ist in dem Fall übrigens viel zu schnell, wobei sie hier funktioniert. Und das steuere"}, {"id": 613, "start": 5555.24, "end": 5558.8, "text": "ich vom anderen Bildschirm aus. Ich habe ein paar Shortcuts mit Steuerung L, kann ich zum"}, {"id": 614, "start": 5558.8, "end": 5567.16, "text": "Beispiel LUL machen und sowas. 3 ist LUL, 3D, M ist MonkaS. Mehr habe ich, glaube ich,"}, {"id": 615, "start": 5567.16, "end": 5572.68, "text": "gar nicht belegt. Aber ich mache das zum größten Teil eh nur darüber, über das Dashboard."}, {"id": 616, "start": 5572.68, "end": 5589.12, "text": "Max, weißt du, warum man für Grafana Prometheus braucht? Braucht man nicht? Brauchst du nicht?"}, {"id": 617, "start": 5589.12, "end": 5595.36, "text": "Achso, naja. Deine Frage, ich weiß, was du meinst, aber die passt, also in dem Kontext"}, {"id": 618, "start": 5595.36, "end": 5605.16, "text": "ergibt es keinen Sinn, weil Grafana selbst braucht verschiedene Quellen, die es versteht,"}, {"id": 619, "start": 5605.16, "end": 5612.24, "text": "aus dem es Grafen generieren kann. Prometheus ist eines von diesen Quellen. Prometheus und"}, {"id": 620, "start": 5612.24, "end": 5618.12, "text": "Grafana haben miteinander nichts zu tun. Die Metriken, die du abrufst, sind Prometheus-Metriken,"}, {"id": 621, "start": 5618.12, "end": 5624.68, "text": "die Grafana versteht. Also beziehungsweise die Grafana kann über die Prometheus-AP dann"}, {"id": 622, "start": 5624.68, "end": 5630.36, "text": "drauf zugreifen. Also es ist jetzt nicht so, als wäre Grafana und Prometheus von den"}, {"id": 623, "start": 5630.36, "end": 5636.16, "text": "gleichen Leuten. Du kannst beispielsweise 30 verschiedene, Grafana unterstützt 30"}, {"id": 624, "start": 5636.16, "end": 5642.96, "text": "verschiedene Quellen, also du kannst Influx DB nehmen oder aber, wenn du beispielsweise"}, {"id": 625, "start": 5642.96, "end": 5652.3, "text": "Influx DB nimmst, dann kannst du auch Grafana weglassen und denen ihre eigene Geschichte"}, {"id": 626, "start": 5652.3, "end": 5662.04, "text": "verwenden. Die haben so ein Grafana-Lite eingebaut mittlerweile schon, oder was heißt eingebaut,"}, {"id": 627, "start": 5662.04, "end": 5667.6, "text": "mit dabei. Also wenn du Influx DB verwendest, die haben so ein eigenes Grafana-Ding dabei,"}, {"id": 628, "start": 5667.6, "end": 5671.64, "text": "wobei ich dir ehrlich sagen muss, hier so ein Teil, wobei ich dir ehrlich sagen muss,"}, {"id": 629, "start": 5671.64, "end": 5679.8, "text": "mir ist Grafana lieber als der Krempel. Und dementsprechend, wie gesagt, Grafana greift"}, {"id": 630, "start": 5679.8, "end": 5687.08, "text": "nur auf verschiedene Datenbanken zu und visualisiert das, dann einen HTTP-Server abfragen, würde"}, {"id": 631, "start": 5687.08, "end": 5694.72, "text": "ja bedeuten, dass Grafana ein eigenes Metrik-Format bräuchte, was man da abrufen kann. Aber Grafana"}, {"id": 632, "start": 5694.72, "end": 5700.6, "text": "nimmt ja nur das, was schon da ist. Kann man auch machen. Weil das ja nicht dann Kibana"}, {"id": 633, "start": 5700.6, "end": 5706.2, "text": "ist, sondern das ist ja dann der Elk-Stack, weil man mittlerweile alles einen coolen Namen"}, {"id": 634, "start": 5706.2, "end": 5719.72, "text": "braucht. Kibana ist out, der Elk-Stack ist jetzt ja. Nein, kein Splatoon-Musik, please."}, {"id": 635, "start": 5719.72, "end": 5723.72, "text": "Also du kannst beispielsweise, ich weiß nicht, ob ich das jetzt zeigen will, bin ich ganz"}, {"id": 636, "start": 5723.72, "end": 5728.4, "text": "sicher, ob ich da nicht irgendwas liege, aber Grafana kann, also wie gesagt, Grafana und"}, {"id": 637, "start": 5728.4, "end": 5734.36, "text": "Prometos haben nix miteinander zu tun. Guck mal, die können standardmäßig AVS, Azure,"}, {"id": 638, "start": 5734.36, "end": 5743.24, "text": "Elasticsearch, das ist übrigens Teil von Elk, Kibana, Logstash, Elasticsearch. Das"}, {"id": 639, "start": 5743.24, "end": 5753.76, "text": "ist quasi die Konkurrenz dazu. Google Cloud, Influx DB, Graphite, Loki, Microsoft. Sekunde,"}, {"id": 640, "start": 5753.76, "end": 5760.84, "text": "Sekunde, Sekunde. Ich finde das passende E-Mode gerade nicht. Aber wusste gar nicht,"}, {"id": 641, "start": 5760.84, "end": 5769.84, "text": "dass er das kann. Wo ist das passende E-Mode? Ich habe so viele E-Modes, die ich nicht oft"}, {"id": 642, "start": 5769.84, "end": 5778.16, "text": "verwende. Hier, passend, genau. Also du kannst auch MySQL abfragen, alle möglichen, Timeseries,"}, {"id": 643, "start": 5778.16, "end": 5783.92, "text": "Database, Postgres, Prometos. Jager, ich habe ehrlich gesagt keine Ahnung, was Jager ist"}, {"id": 644, "start": 5783.92, "end": 5789.96, "text": "oder Zipkin oder Tempo. Tempo habe ich glaube ich schonmal gehört. Aber was ist Jager?"}, {"id": 645, "start": 5789.96, "end": 5802.52, "text": "Okay, ich weiß nicht, was Jager ist. Und was ist Zipkin? Zipkin klingt ein bisschen"}, {"id": 646, "start": 5802.52, "end": 5819.76, "text": "wie Datenbank aus Co-Commonet-Land. Ich meinte nicht MySQL, ich meinte Microsoft SQL. Da"}, {"id": 647, "start": 5819.76, "end": 5829.28, "text": "ist nichts Schlimmes dran, außer dass es Microsoft SQL Server ist. Ich habe keine Ahnung, was"}, {"id": 648, "start": 5829.28, "end": 5838.88, "text": "es ist. Kann es auch XML? Nein, das Schöne ist, du kannst die Data Sources erweitern"}, {"id": 649, "start": 5838.88, "end": 5843.96, "text": "mit Plugins und dann kannst du wahrscheinlich auch XML. So, da sind wir. Da haben wir unser"}, {"id": 650, "start": 5843.96, "end": 5848.84, "text": "WSL am Start. Exzellent. So, erstmal root werden, immer das Allerwichtigste. Search,"}, {"id": 651, "start": 5848.84, "end": 5853.28, "text": "können wir Wine installieren? Erstmal nachkucken. Jawoll, wir können Wine installieren. Gut,"}, {"id": 652, "start": 5853.28, "end": 5859.4, "text": "das probieren wir nachher aus. So, jetzt mal schauen, das wichtigste. Lass mal überlegen,"}, {"id": 653, "start": 5859.4, "end": 5863.92, "text": "was brauche ich denn immer so? Also, mal nochmal hier. Abinstall. Wir brauchen auf jeden Fall"}, {"id": 654, "start": 5863.92, "end": 5872.92, "text": "schonmal T-Mags, ein Git. Wir können VS Code mal installieren. Und weil VS Code unter"}, {"id": 655, "start": 5872.92, "end": 5877.76, "text": "Ubuntu ist ein Snap, oder? Moment, da bin ich mal gespannt, ob das überhaupt installiert."}, {"id": 656, "start": 5877.76, "end": 5892.6, "text": "Gibt es da nicht, oder? Das Gequarium gibt es da übrigens auch nicht. Aber gibt es da"}, {"id": 657, "start": 5892.6, "end": 5900.6, "text": "C-Matrix? Ah, ok, das ist wichtig. Das brauchen wir erstmal. Also, eines der ersten Sachen,"}, {"id": 658, "start": 5900.6, "end": 5904.16, "text": "die ihr installieren solltet unter Linux ist C-Matrix, dass ihr das hier machen könnt."}, {"id": 659, "start": 5904.16, "end": 5915.64, "text": "Euren inneren Hacker-Man erstmal starten. SL, nee. Hollywood auch, da weiß ich aber"}, {"id": 660, "start": 5915.64, "end": 5931.84, "text": "nicht, ob die das dabei haben. Ah, haben sie. Auch, auch. Echt, man kann Code Plus machen"}, {"id": 661, "start": 5931.84, "end": 5946.68, "text": "in WSL. Achso, ja klar, der kann ja mittlerweile Windows-Dinger starten, ne? Postchamp? Postchamp?"}, {"id": 662, "start": 5946.68, "end": 5967.28, "text": "Pausechamp auf? Was macht der so lang? Crashed? Bestimmt, bestimmt gecrasht. Ach, mlocate,"}, {"id": 663, "start": 5967.28, "end": 5989.36, "text": "das ist, der indiziert jetzt erstmal meine ganze Platte wahrscheinlich. Hätte ich das"}, {"id": 664, "start": 5989.36, "end": 5994.96, "text": "mal lieber in einer T-Mark Session gemacht? Ich kann einfach Neues starten, das geht ja"}, {"id": 665, "start": 5994.96, "end": 6008.28, "text": "wahrscheinlich. Der indiziert wirklich erstmal alles. Ich hoffe echt nicht, dass da über"}, {"id": 666, "start": 6008.28, "end": 6015.72, "text": "Mount-Points drüber gehen, das wäre schon fair. Der indiziert jetzt gerade mal eine"}, {"id": 667, "start": 6015.72, "end": 6025.76, "text": "ganze Festplatte anscheinend, ne? CPU? Ja gut, das ist Single-Threaded wahrscheinlich."}, {"id": 668, "start": 6025.76, "end": 6037.16, "text": "Ich könnte das einfach killen. Ok, also Code? Ok, also die Integration muss man ihnen echt"}, {"id": 669, "start": 6037.16, "end": 6040.44, "text": "lassen, die Integration ist wirklich ganz gut gemacht. Ich mein, mir persönlich ist"}, {"id": 670, "start": 6040.44, "end": 6045.0, "text": "es natürlich noch lieber, ich brauch die Windows-Seite davon einfach gar nicht. Dann brauch"}, {"id": 671, "start": 6045.0, "end": 6048.84, "text": "ich auch die Integration nicht, aber wenn man Windows ein bisschen besser benutzbar"}, {"id": 672, "start": 6048.84, "end": 6058.48, "text": "machen will, ist das hier schon mal ganz cool. Oh ne. Die haben den Sound, der Sound muss"}, {"id": 673, "start": 6058.48, "end": 6068.4, "text": "weg. Haben wir den sein? Auch ein PowerShell? Ne. Also unter Linux die Hardcore-Variante,"}, {"id": 674, "start": 6068.4, "end": 6075.84, "text": "um Speaker ruhig zu stellen, ist die hier, aber ich glaube, die geht unter VSL nicht."}, {"id": 675, "start": 6075.84, "end": 6088.4, "text": "Oder doch? Haha, Gebaided geht nicht. Ist immer noch da. Das ist normalerweise die brutale"}, {"id": 676, "start": 6088.4, "end": 6109.16, "text": "Variante, einfach alles weg. VSL-Terminal-Beep, wie kriegt man den aus? Disable-Beep. Ah,"}, {"id": 677, "start": 6109.16, "end": 6136.0, "text": "ok, das ist tatsächlich einfacher. Mixer. Easy. Haha, so kann man es auch machen. Binst"}, {"id": 678, "start": 6136.0, "end": 6149.36, "text": "hier immer Toilet, das ist wichtig. Oh ne, geht ja nicht. Oh, er ist fertig. So, und"}, {"id": 679, "start": 6149.36, "end": 6171.2, "text": "jetzt sagen wir Toilet-Echo-Gebaided. Bäm. Massive Kunst im Terminal. Die Musik ist richtig"}, {"id": 680, "start": 6171.2, "end": 6176.12, "text": "klos jetzt, ne? So, also jetzt haben wir den Kram jetzt hin, sehr schön. Teamwork starten,"}, {"id": 681, "start": 6176.12, "end": 6183.44, "text": "alles klar. So, ah, Moment, Moment, wir brauchen ordentlichen Vim. Nicht den Light Vim. Den"}, {"id": 682, "start": 6183.44, "end": 6195.08, "text": "richtig echten. Am besten noch Vim, ne. Ge Vim. Vim GTK, volle Pulle. Komm, gib ihm alles."}, {"id": 683, "start": 6195.08, "end": 6204.24, "text": "Jawoll, Bäm. LOL-Cat, ja, das brauchen wir auch noch, klar. Ich meine, ich kann kein"}, {"id": 684, "start": 6204.24, "end": 6209.44, "text": "GUI-Zeug starten, aber das ist das nächste, was wir uns mal angucken, ob man da irgendwie"}, {"id": 685, "start": 6209.44, "end": 6227.8, "text": "GUI-Zeug drauf gestartet kriegt. Ja, klar, erkennt er, dass es nicht geht. So, wunderbar,"}, {"id": 686, "start": 6227.8, "end": 6234.04, "text": "Vim. Ich bin froh, dass sie das hinbekommen haben mittlerweile, weil in der ersten Version"}, {"id": 687, "start": 6234.04, "end": 6240.32, "text": "hatten die extreme Probleme mit den Vim-Escape-Sequenzen. Da bist du teilweise im Vim hängen geblieben,"}, {"id": 688, "start": 6240.32, "end": 6246.96, "text": "konnte es nicht mehr raus. Also ja, wir installieren jetzt erstmal die wichtigen Dinger. Erstmal"}, {"id": 689, "start": 6246.96, "end": 6264.92, "text": "die wichtigen Dinger. GWSL. Zeig mal her. Ups. Es gibt doch RDP, ne, ne, ne, ne, ne,"}, {"id": 690, "start": 6264.92, "end": 6277.08, "text": "nicht RDPX. Oder wie hieß das Ding? RDPX, nee. XXRDP, nee. Nee, RDP logischerweise nicht."}, {"id": 691, "start": 6277.08, "end": 6284.44, "text": "Wie hieß denn das? Es gab doch, genau, VCXSRV, das Ding meinte ich, korrekt, korrekt. Aber"}, {"id": 692, "start": 6284.44, "end": 6290.36, "text": "das sagt wahrscheinlich, wir probieren das hier aus. Microsoft Store. Get free, okay,"}, {"id": 693, "start": 6290.36, "end": 6295.0, "text": "das probieren wir dann gleich mal aus. Aber jetzt erstmal das allerwichtigste Programm"}, {"id": 694, "start": 6295.0, "end": 6300.0, "text": "überhaupt. Oder musste man da, musste man da, ah nee, da musste man irgendwas reinpipen,"}, {"id": 695, "start": 6300.0, "end": 6322.76, "text": "ne. What is happening im Hintergrund, Alter? Das SL drauf. Okay, jetzt die wichtigste Kombination"}, {"id": 696, "start": 6322.76, "end": 6332.16, "text": "überhaupt, SL, SLpipen nach LOLCAT. Haha, Windows Terminal ist broken an der Stelle,"}, {"id": 697, "start": 6332.16, "end": 6340.72, "text": "sehr schön, sehr schön. Das funktioniert. Das Windows Terminal kommt mit den, kommt"}, {"id": 698, "start": 6340.72, "end": 6346.56, "text": "mit den Escape Sequenzen nicht zurecht, wie es aussieht. Also ich kann es euch mal zeigen,"}, {"id": 699, "start": 6346.56, "end": 6353.0, "text": "wie das eigentlich aussehen sollte, wenn man das ausführt. Haben wir schon das erste gefunden,"}, {"id": 700, "start": 6353.0, "end": 6360.68, "text": "was broken ist. Machen wir mal in groß, vielleicht will es das im Fullscreen haben. Geht's"}, {"id": 701, "start": 6360.68, "end": 6366.96, "text": "im CMD? Nein, nein, nein, im CMD geht's garantiert nicht. CMD mit ASCII Escape Sequenzen, hab"}, {"id": 702, "start": 6366.96, "end": 6371.84, "text": "ich überhaupt kram installiert, jawoll. SL hab ich auch installiert. Jetzt kann ich euch"}, {"id": 703, "start": 6371.84, "end": 6378.24, "text": "zeigen, wie es normalerweise aussehen sollte. Zwar, Aufzug, fahr durch. Man kann es übrigens"}, {"id": 704, "start": 6378.24, "end": 6393.16, "text": "nicht abbressen. Bam. The Rainbow Train ist unterwegs. Sprichst du eine andere Fremdsprache"}, {"id": 705, "start": 6393.16, "end": 6397.56, "text": "als Englisch? Nee. Ich hatte in der Schule mal Französisch ein bisschen, aber ich kann"}, {"id": 706, "start": 6397.56, "end": 6405.32, "text": "kein einziges Wort Französisch. Frischarde. Doch, doch die Franzosen sagen anstatt Frischarde"}, {"id": 707, "start": 6405.32, "end": 6410.12, "text": "die Frischarde. Das weiß ich nicht. Keine Ahnung, kann ich nicht. Ich hatte es auch nicht"}, {"id": 708, "start": 6410.12, "end": 6418.96, "text": "lang. Ich kann Brötchen bestellen auf Portugiesisch. Das war's aber auch. Also im Prinzip, ich"}, {"id": 709, "start": 6418.96, "end": 6434.08, "text": "kann nichts außer Deutsch und ganz brauchbar Englisch und Essisch. Das könnte tatsächlich"}, {"id": 710, "start": 6434.08, "end": 6441.12, "text": "am TMUX liegen mit den Escape Sequenzen, das ist richtig. Nee, liegt nicht am TMUX. Aber"}, {"id": 711, "start": 6441.12, "end": 6450.04, "text": "mittlerweile sollte die TMUX Geschichte eigentlich standardmäßig 32bit Farben können. In Wirklichkeit"}, {"id": 712, "start": 6450.04, "end": 6456.76, "text": "kann ich natürlich Russisch, genau wie alle echten Hackermans. Nee, keine Ahnung. Also"}, {"id": 713, "start": 6456.76, "end": 6461.32, "text": "ich kann, wie gesagt, ich kann nur Deutsch, bisschen Englisch, das war's. Gut, das funktioniert"}, {"id": 714, "start": 6461.32, "end": 6467.16, "text": "schon mal. Standardmäßig, standardmäßig der Kram ist auch da. Hardtop und so, außer"}, {"id": 715, "start": 6467.16, "end": 6471.36, "text": "dass die Farben ein bisschen off aussehen, ist auch okay. Die Farben sehen wirklich ein"}, {"id": 716, "start": 6471.36, "end": 6489.68, "text": "bisschen verkehrt aus. Normalerweise sind die Farben so, ne? Hardtop, Lolcat. Funktioniert"}, {"id": 717, "start": 6489.68, "end": 6494.6, "text": "sogar. Ich wusste gar nicht, dass das geht. Das funktioniert sogar. Man kann das sogar"}, {"id": 718, "start": 6494.6, "end": 6502.16, "text": "noch verwenden. Guck mal, das läuft sogar noch. Das hätte ich nicht gedacht. Mal gucken,"}, {"id": 719, "start": 6502.16, "end": 6515.08, "text": "was Microsoft, was Windows da draus macht. Okay, das startet nicht mal. Das ist einfach"}, {"id": 720, "start": 6515.08, "end": 6534.36, "text": "broken unter Windows. Probier es mal. Nee, Grip, vorbei. Keine Chance. Aber die Farben"}, {"id": 721, "start": 6534.36, "end": 6539.64, "text": "sehen ein bisschen verkehrt aus in dem Windows-Terminal, muss ich sagen. Die sehen nicht wirklich"}, {"id": 722, "start": 6539.64, "end": 6558.16, "text": "passend aus. Das stimmt irgendwas nicht. Ist halt die Fall-Seam. Nee, nee, nee, das stimmt"}, {"id": 723, "start": 6558.16, "end": 6568.76, "text": "trotzdem nicht. Irgendwie als interpretiert er die Escape-Sequenzen nicht richtig. Deset,"}, {"id": 724, "start": 6568.76, "end": 6576.56, "text": "Lolcat, kann er das? Ah, das kapiert er. Okay, das kann er. Ja, so sieht das gut aus."}, {"id": 725, "start": 6576.56, "end": 6591.6, "text": "Guck mal, massive Farbverlauf. Okay, und jetzt gucken wir mal, ob wir was Grafisches"}, {"id": 726, "start": 6591.6, "end": 6598.24, "text": "zum Laufen kriegen. Was ich auf jeden Fall schon mal sehr nice finde, ist, dass ich beispielsweise"}, {"id": 727, "start": 6598.24, "end": 6604.04, "text": "in Visual Studio Code meine Bash-RC editieren kann. Und das ist mein Visual Studio Code"}, {"id": 728, "start": 6604.04, "end": 6617.28, "text": "aus Windows. Ja, installier mal. Nee, haben wir schon. Das ist mein Visual Studio Code"}, {"id": 729, "start": 6617.28, "end": 6627.68, "text": "aus Windows, der jetzt im WSL-Attached ist. Das ist eine coole Geschichte. Okay, gucken"}, {"id": 730, "start": 6627.68, "end": 6634.0, "text": "wir mal, wie wir grafische Sachen installiert bekommen. Beste grafische Test-App nach wie"}, {"id": 731, "start": 6634.0, "end": 6639.76, "text": "vor X-Clock und X-Eyes. Ich finde übrigens, dass Copy-Paste im neuen Windows-Terminal"}, {"id": 732, "start": 6639.76, "end": 6643.64, "text": "immer noch Paints-Champ. Warum geht keine mittlere Maustaste und warum geht nur dieser"}, {"id": 733, "start": 6643.64, "end": 6648.84, "text": "komische Misch aus Rechts-Rechts-Klick, Doppel-Rechts-Klick. Ich meine Doppel-Rechts-Klick. Das kann sich"}, {"id": 734, "start": 6648.84, "end": 6661.84, "text": "nur Microsoft ausdenken, sowas. Okay, wie richten wir da jetzt einen X-Server ein? Okay,"}, {"id": 735, "start": 6661.84, "end": 6679.68, "text": "was ist da? GWSL-Install. Nehm nicht den komischen aus dem Store, warum nicht? Das ist der hier."}, {"id": 736, "start": 6679.68, "end": 6695.12, "text": "Oder kann man ja auch aus GitHub runterladen. Das ist recommended. Ey, wir machen das aus"}, {"id": 737, "start": 6695.12, "end": 6705.4, "text": "dem Store, passt schon. Okay, let's do our Grafika. Wollen wir mal probieren, ob man das"}, {"id": 738, "start": 6705.4, "end": 6709.48, "text": "einfach installieren kann und dann geht's. Ich hab ja meine Zweifel. Ich mach mal alles"}, {"id": 739, "start": 6709.48, "end": 6717.12, "text": "wieder zu und installiere den Kram mal. Ich hab ja meine Zweifel, dass es einfach so geht."}, {"id": 740, "start": 6717.12, "end": 6732.0, "text": "Jetzt. Ich hätte am liebsten nicht Copy und Select, sondern mittlere Maustaste drücken"}, {"id": 741, "start": 6732.0, "end": 6737.76, "text": "für Kopieren und dann einfügen gleichzeitig. Install. Nein, ich will keinen Microsoft-Account."}, {"id": 742, "start": 6737.76, "end": 6743.96, "text": "Sollte es so einfach installieren. Ich find's immer noch geil, wie das jedes Mal aufploppt."}, {"id": 743, "start": 6743.96, "end": 6756.76, "text": "Jedes Mal will mich Microsoft dazu gibaten, mich doch einzuloggen. So, schauen wir mal."}, {"id": 744, "start": 6756.76, "end": 6766.8, "text": "Einmal Rechtsklick ist Copy und das zweite Mal Rechtsklick ist Paste. Launch. Was passiert"}, {"id": 745, "start": 6766.8, "end": 6787.76, "text": "der Mensch, der jetzt Launche? Aha. Yes. Okay, jetzt bin ich mal gespannt, was passiert da"}, {"id": 746, "start": 6787.76, "end": 6802.6, "text": "mit dem Uganda. Wie von Zulun. Aber da ist der Wim. Der Wim-Gründer engagiert sich da"}, {"id": 747, "start": 6802.6, "end": 6807.64, "text": "schon seit über 10 Jahren für irgendwelche Projekte in Uganda. Hab ich schon öfters gehört,"}, {"id": 748, "start": 6807.64, "end": 6813.44, "text": "da hat er auch schon Vorträge drüber gehalten. Also es ist kein Uganda-Meme oder so was,"}, {"id": 749, "start": 6813.44, "end": 6820.2, "text": "er meint das ernst, ja. So, aber das ist cool. Was kann man sonst noch machen? Linux-Shell?"}, {"id": 750, "start": 6820.2, "end": 6829.64, "text": "Ihh, das will ich nicht. Ist das denn gesetzt, wenn ich das hier aufmache? Das ist hier X-Ice."}, {"id": 751, "start": 6829.64, "end": 6834.8, "text": "Aha, das ist natürlich nicht gesetzt. Okay, wie kann ich das jetzt außer Shell starten?"}, {"id": 752, "start": 6834.8, "end": 6856.6, "text": "Ich kann die hier natürlich aufmachen. X-Ice. Can't open display? Wait a minute. Wie bringe"}, {"id": 753, "start": 6856.6, "end": 6861.84, "text": "ich jetzt Windows überhaupt bei? Moment, Taskbar. Wie bringe ich Windows bei, dass"}, {"id": 754, "start": 6861.84, "end": 6869.96, "text": "der Kram da unten gefälligt... Moment, wie stellt man den Kram hier noch mal ein? Ah,"}, {"id": 755, "start": 6869.96, "end": 6886.56, "text": "Windows, please. Was, du musst das ziehen? Echt jetzt? Ist das neu? Boah! Seit wann"}, {"id": 756, "start": 6886.56, "end": 6900.44, "text": "geht denn das? Das ist ja big brain, Alter. Schon immer? Ich bin immer in das Config-Menü"}, {"id": 757, "start": 6900.44, "end": 6921.64, "text": "gegangen und hab das eingestellt. Unglaublich. Okay. Distro-Tools. Auto-Export-Display. Ah,"}, {"id": 758, "start": 6921.64, "end": 6939.64, "text": "X-Ice. Das ist tatsächlich äußerst nice. Auto-Export-Display. X-Ice. Jawoll! Leute,"}, {"id": 759, "start": 6939.64, "end": 6944.28, "text": "wir haben das allerwichtigste Programm am Laufen. Seht ihr hier oben dieses komische"}, {"id": 760, "start": 6944.28, "end": 6953.84, "text": "Windows-Logo, wo das nicht so ganz damit klar kommt, dass das... Das nicht so ganz damit"}, {"id": 761, "start": 6953.84, "end": 6962.28, "text": "klar kommt, dass das irgendwie im Fenster ist. Damit kommt es überhaupt nicht klar."}, {"id": 762, "start": 6962.28, "end": 6990.84, "text": "Und es ruckelt. Guck mal, es ruckelt erst. Fuck. Und noch mal eine super High-Res-Uhr."}, {"id": 763, "start": 6990.84, "end": 6997.76, "text": "Okay. Das funktioniert tatsächlich. So, das heißt, jetzt kann ich hier grafische Sachen"}, {"id": 764, "start": 6997.76, "end": 7004.0, "text": "starten. Das müssen wir gleich mal ausprobieren, wie gut das funktioniert. Wir installieren"}, {"id": 765, "start": 7004.0, "end": 7013.4, "text": "jetzt mal Rider. Moment, Moment, Moment. Abinstall... Wir installieren jetzt einen Browser. Chrome."}, {"id": 766, "start": 7013.4, "end": 7018.72, "text": "By the way, geht, geht... Wenn ich jetzt Chrome... Das muss ich beides installieren. Wenn ich"}, {"id": 767, "start": 7018.72, "end": 7027.72, "text": "jetzt Chrome installiere, ist es dann immer noch ein Snap? Ist es dann auch... Ist es"}, {"id": 768, "start": 7027.72, "end": 7038.56, "text": "dann auch... GLX-Gears, ja. Bei GLX-Gears war das nicht Mesatools, genau. Edge... Moment,"}, {"id": 769, "start": 7038.56, "end": 7052.2, "text": "gibt es... Aber es gibt doch Edge nicht im Paketmanager, oder? Nee, oder? Einer gibt's"}, {"id": 770, "start": 7052.2, "end": 7060.72, "text": "nicht. Aber das muss ich downloaden. Soll ich einen Edge installieren? Okay, okay. Meine"}, {"id": 771, "start": 7060.72, "end": 7069.12, "text": "Güte. Edge. Als erstes installieren wir uns jetzt mal Chrome. Ich will wissen, ob das"}, {"id": 772, "start": 7069.12, "end": 7075.56, "text": "ein Snap ist. Weil Snap ist Paynes-Champ und es ist wahrscheinlich ein Snap immer noch."}, {"id": 773, "start": 7075.56, "end": 7099.4, "text": "Oder nicht? Ich kann nicht schreiben, Alter. Es ist kein Snap? Gbaited! Gbaited! Gbaited!"}, {"id": 774, "start": 7099.4, "end": 7110.36, "text": "Ich installiere einen Chrome. Aber ob Snap da drauf läuft? Das müssen wir jetzt mal"}, {"id": 775, "start": 7110.36, "end": 7121.64, "text": "ausprobieren. Nee, ne? Okay, Snap funktioniert nicht da drauf. Abinstallieren Firefox. Aber"}, {"id": 776, "start": 7121.64, "end": 7129.44, "text": "Firefox wird funktionieren. Okay, dann installieren wir jetzt einen Edge-Browser. Das ist aber"}, {"id": 777, "start": 7129.44, "end": 7137.12, "text": "wirklich komplett wie ein Edge im WSL. Aber ich meine, ernsthaft, wenn Firefox geht, wird"}, {"id": 778, "start": 7137.12, "end": 7152.16, "text": "Edge auch funktionieren. Lord Folkermord, Paynes-Champ-Name. Das ist eigentlich schon"}, {"id": 779, "start": 7152.16, "end": 7165.32, "text": "für den Prime-Sub. Starte mal GLX-Gears. GLX-Gears ist broken. Und mach meinen Rechner"}, {"id": 780, "start": 7165.32, "end": 7191.0, "text": "glaube ich kaputt. GLX-Gears ist kaputt, Leute. Keine 3D-Beschleunigung. Super-Tux-Kart,"}, {"id": 781, "start": 7191.0, "end": 7204.08, "text": "ne? Glaube ich nicht. Das wird auch nicht laufen. Über diesen X-Server. Nee, nee."}, {"id": 782, "start": 7204.08, "end": 7213.72, "text": "Wenn schon GLX-Gears nicht läuft. Wie hieß das Ding? GWSL. Aber wenn schon GLX-Gears"}, {"id": 783, "start": 7213.72, "end": 7237.8, "text": "nicht geht. Smooth Frame Rate bei mir läuft das schon mal gar nicht. Stimmt, es ist ja,"}, {"id": 784, "start": 7237.8, "end": 7244.12, "text": "ich hab ja auch noch VM in der VM, das kommt ja auch noch dabei. Das ist ja Doppels-Paynes-Champ-Bich."}, {"id": 785, "start": 7244.12, "end": 7251.88, "text": "Wir probieren das mal schnell aus. Das liegt an der VM. Das können wir tatsächlich mal"}, {"id": 786, "start": 7251.88, "end": 7258.52, "text": "probieren. Ich schalte an die VM nochmal ausschalten. Und mal versuchen den 3D-Support einzuschalten."}, {"id": 787, "start": 7258.52, "end": 7270.4, "text": "Wo ging das nochmal? War das nochmal versteckt mit Display hier, ne? Nee, ist schon, ist"}, {"id": 788, "start": 7270.4, "end": 7283.16, "text": "schon an. Aber das kann durchaus an der VM liegen. Das kann durchaus daran liegen. Ja,"}, {"id": 789, "start": 7283.16, "end": 7288.64, "text": "man hat das heute nochmal installiert. Wie lange braucht der da dafür? Wird der immer"}, {"id": 790, "start": 7288.64, "end": 7301.32, "text": "langsamer? Ich will das Super-Tux-Kart installieren. Massive-Paynes-Champ. Leute, wo wir gerade"}, {"id": 791, "start": 7301.32, "end": 7306.84, "text": "dabei sind, der Preis, äh nicht der Preis-Champ, der Watt-Champ funktioniert wunderbar. Wer"}, {"id": 792, "start": 7306.84, "end": 7315.72, "text": "den Watt-Champ nicht kennt. Wer den Watt-Champ nicht kennt. Ich hab mir was gebaut, um meinen"}, {"id": 793, "start": 7315.72, "end": 7323.6, "text": "Stromzähler auszulesen. Das ist der Watt-Champ. Weil ich neuerdings meine Projekte alle irgendwie"}, {"id": 794, "start": 7323.6, "end": 7329.08, "text": "mit Champ hintendran nenne. Wir haben oft, ich hab für die Arbeit eine Proxy-Auswertungstool"}, {"id": 795, "start": 7329.08, "end": 7334.4, "text": "programmiert. Das nennt sich natürlich der Lock-Champ, was sonst. Und der funktioniert"}, {"id": 796, "start": 7334.4, "end": 7340.36, "text": "jetzt wunderbar. Der hängt jetzt im Keller an den Stromzählern mit den Sensoren dran."}, {"id": 797, "start": 7340.36, "end": 7347.96, "text": "Das ist, äh, das ist ein Luftfeuchtigkeit-Temperatursensor. Das hier sieht man jetzt nicht. Das ist"}, {"id": 798, "start": 7347.96, "end": 7352.28, "text": "ein Sensor, der blinkende LEDs erkennt für den Stromzähler oben. Und das ist ein Infrarotsensor,"}, {"id": 799, "start": 7352.28, "end": 7357.56, "text": "der so eine Zählerscheibe erkennt. Funktioniert wunderbar. Und ich kann jetzt quasi sehen,"}, {"id": 800, "start": 7357.56, "end": 7361.88, "text": "wie viel ich verbrauche im ganzen Haus. Und kann auch sogar Verbrauch voraussagen für"}, {"id": 801, "start": 7361.88, "end": 7366.4, "text": "den Monat und sowas. Oder zumindest historisch kann ich dann sagen, hey, ergibt das irgendwie"}, {"id": 802, "start": 7366.4, "end": 7372.2, "text": "Sinn, was ich gemessen hab und was die abrechnen und sowas. Das ist tatsächlich ganz nice."}, {"id": 803, "start": 7372.2, "end": 7379.08, "text": "Der Watt-Champ champt vor sich hin. Das IntelliJ Zeug und WSL haben eigentlich recht guten"}, {"id": 804, "start": 7379.08, "end": 7390.76, "text": "WSL Support. Ja, ich probier das mal aus gleich. Ich probier das gleich aus. Den Heiz-Champ,"}, {"id": 805, "start": 7390.76, "end": 7398.2, "text": "den Heiz-Champ hab ich heute umsortiert. Dass der OK-Knopf oben ist. Ja, was heißt"}, {"id": 806, "start": 7398.2, "end": 7403.36, "text": "ich? Eigentlich ist es ja so eine Mischung aus mir und Microsoft, die Paynes-Champige"}, {"id": 807, "start": 7403.36, "end": 7411.96, "text": "Sachen machen. Da muss ich auch immer Monka essen. Wenn ich den Snap-Store... Ich find's"}, {"id": 808, "start": 7411.96, "end": 7422.44, "text": "ja von den Ubuntu-Leuten schon ziemlich fail, dass sie das einem aufzwingen mit dem Snap-Store."}, {"id": 809, "start": 7422.44, "end": 7426.36, "text": "Oder was heißt aufzwingen? Dass sie das so versteckt machen. Installiert Chrome und"}, {"id": 810, "start": 7426.36, "end": 7434.24, "text": "es ist ein Snap, obwohl du denkst, es ist ein echter Chrome. Der ist... Ja, ich weiß,"}, {"id": 811, "start": 7434.24, "end": 7440.72, "text": "der ist Müll. Aber nein, das ist ganz so krass. Das stimmt nicht. Das stimmt nicht. Der misst"}, {"id": 812, "start": 7440.72, "end": 7446.2, "text": "bei mir gerade 17 oder gestern 17 Grad gemessen und es waren, glaub ich, frag mich nicht 16"}, {"id": 813, "start": 7446.2, "end": 7453.6, "text": "irgendwas. Aber der ist nicht genau und der Sensor ist langsam, aber 10 Grad plus minus"}, {"id": 814, "start": 7453.6, "end": 7458.36, "text": "ist es nicht. Davon hab ich auch noch ne Menge. Davon müsste ich mal wieder, müsste ich mal"}, {"id": 815, "start": 7458.36, "end": 7463.28, "text": "übrigens wieder welche bestellen, fände ich halt gerade. Warum ist Snap schlecht? Was"}, {"id": 816, "start": 7463.28, "end": 7472.12, "text": "heißt schlecht? Ich find's doof, dass man durch den Package-Manager-Install, dass man"}, {"id": 817, "start": 7472.12, "end": 7476.32, "text": "durch den Package-Manager-Install ein Snap-Paket installiert, wenn man ein normales Paket rechnet."}, {"id": 818, "start": 7476.32, "end": 7483.4, "text": "So ein bisschen teuer. Was kostet der Kram bei Ali? Was macht eigentlich der Suez-Kanal?"}, {"id": 819, "start": 7483.4, "end": 7504.44, "text": "Ist er wieder frei? War das nicht von Bosch das Ding? Deswegen gibt's die nicht bei Ali."}, {"id": 820, "start": 7504.44, "end": 7514.36, "text": "Ist das Chip still stuck? Yes. Es ist schon geil, dass es dafür überhaupt Seiten gibt."}, {"id": 821, "start": 7514.36, "end": 7536.6, "text": "Ist das Chip still stuck? Yes. Zu geil. Alter, ist das ein fettes Ding, ey. Boah ey, das"}, {"id": 822, "start": 7536.6, "end": 7541.24, "text": "ist ja ein megafettes Ding. Warum ist das eigentlich stuck? Das sieht doch gar nicht"}, {"id": 823, "start": 7541.24, "end": 7565.92, "text": "so aus, als ist das großartig fest. Chipchamp, ja. Oh man. Das sind fünf Stück, ne. Gibt's"}, {"id": 824, "start": 7565.92, "end": 7580.44, "text": "das nicht ein bisschen billiger, die Sensoren? Warum ist denn der preisliche Unterschied"}, {"id": 825, "start": 7580.44, "end": 7600.76, "text": "hier so hart? Ah, weil das hier mehr Pins braucht oder was oder wie? Baker-Store. Hopp,"}, {"id": 826, "start": 7600.76, "end": 7616.52, "text": "da hab ich noch nie was gekauft. Gibt's nicht. Gibt's nicht. Naja, Shipping 525 ist nicht"}, {"id": 827, "start": 7616.52, "end": 7622.96, "text": "das Problem, wenn ich davon 10 Stück kaufe. Die gibt's bei Ali, deine Suche war kaputt."}, {"id": 828, "start": 7622.96, "end": 7637.76, "text": "Okay, was auch immer. Ich such mal unter Linux. Vielleicht mag da AliExpress besser."}, {"id": 829, "start": 7637.76, "end": 7652.76, "text": "Aber nach was habt ihr denn gesucht? 880. Der Chat hat wieder Mist geschrieben hier."}, {"id": 830, "start": 7652.76, "end": 7669.24, "text": "Was ist hier wieder los? Einmal verlässt du dich auf den Chat. Aber so viel billiger"}, {"id": 831, "start": 7669.24, "end": 7684.68, "text": "ist es auch nicht. Eats Delivery. Ach, das ist ein BMP, das ist ein anderer. Temperatur"}, {"id": 832, "start": 7684.68, "end": 7696.92, "text": "und Drucksensor. Was ist der Unterschied? BME, was ist BMP? Das braucht mehrere Pins,"}, {"id": 833, "start": 7696.92, "end": 7707.24, "text": "das andere, der braucht Glock-Dings, Cloud VIN und der braucht was für Pins? Was ist"}, {"id": 834, "start": 7707.24, "end": 7713.6, "text": "denn das? SCB und SCDings? Was sind das für komische Pins? Ich weiß gar nicht, wo ich"}, {"id": 835, "start": 7713.6, "end": 7723.12, "text": "das anschließen soll. Ach, kein Luftfeuchtigkeit. Na gut, aber davon bräuchte ich tatsächlich"}, {"id": 836, "start": 7723.12, "end": 7731.12, "text": "auch mal wieder welche. Widmen wir uns mal weiter, WSL. So, SuperTuxCard. Geht das denn?"}, {"id": 837, "start": 7731.12, "end": 7740.36, "text": "Oh, oh. Nein, SuperTuxCard läuft nicht. Das liegt da wahrscheinlich echt an meiner VM."}, {"id": 838, "start": 7740.36, "end": 7750.4, "text": "SuperTuxCard ist broken. Wahrscheinlich liegt es echt an meiner VM. Ich meine, ich hab"}, {"id": 839, "start": 7750.4, "end": 7758.0, "text": "zwar schon den Gram aktiviert, aber es ist mit Sicherheit ein Unterschied, ob du VM-Ware"}, {"id": 840, "start": 7758.0, "end": 7761.76, "text": "das über VM-Ware machst oder nicht. Ich meine, das ist ja im Prinzip jetzt doppelt"}, {"id": 841, "start": 7761.76, "end": 7775.8, "text": "nested virtualisiert. So, dann probieren wir jetzt mal das. Also, ihr wollt ja, dass ich"}, {"id": 842, "start": 7775.8, "end": 7782.84, "text": "Edge installiere. Erstmal gucken, ob Firefox funktioniert. Firefox geht, okay. Hey, ey,"}, {"id": 843, "start": 7782.84, "end": 7791.88, "text": "ohne Scheiß. Okay, das ist jetzt fail, aber das fühlt sich tatsächlich sogar relativ"}, {"id": 844, "start": 7791.88, "end": 7800.16, "text": "schnell an. Also, verhältnismäßig schnell. Muss man echt mal sagen? Hätte ich gar nicht"}, {"id": 845, "start": 7800.16, "end": 7816.96, "text": "gedacht. Oh, nee, nee, nee. Oh, nee, es laggt. Ich hab nix gesagt. Es ist doch laggy. Ah,"}, {"id": 846, "start": 7816.96, "end": 7825.08, "text": "ist doch ein bisschen laggy. Reine Software-Rendering jetzt. Aber ich mein, trotzdem cool, dass"}, {"id": 847, "start": 7825.08, "end": 7844.48, "text": "es überhaupt geht. Ich mein, nicht schlecht, oder? Es ist ein Software-gerendertes. Okay,"}, {"id": 848, "start": 7844.48, "end": 7855.12, "text": "komplett Fullscreen geht nicht. Okay, da ist schon ganz schön, ganz schön beschäftigt."}, {"id": 849, "start": 7855.12, "end": 7877.36, "text": "Aber ich mein, es ist ein 1440p60fps-Video. Der Ton? Wahrscheinlich nicht. Nee. Es kann"}, {"id": 850, "start": 7877.36, "end": 7882.32, "text": "sein, dass man da Ton benutzen kann, aber da muss ich auf jeden Fall. Das ist jetzt"}, {"id": 851, "start": 7882.32, "end": 7888.92, "text": "Firefox im WSL gehostet. Also, das ist Firefox, der im WSL läuft über einen X-Server unter"}, {"id": 852, "start": 7888.92, "end": 7901.64, "text": "Windows. Ja, ja, genau. So sieht's aus. Paints-Champ. Okay, was soll ich runterladen? Was habt ihr"}, {"id": 853, "start": 7901.64, "end": 7907.28, "text": "gesagt nochmal soll ich runterladen? Edge für Linux downloaden. Wirklich? Sollen wir"}, {"id": 854, "start": 7907.28, "end": 7913.96, "text": "uns das wirklich antun, ja? In einer Windows-VM, genau. Kommt ja auch noch dabei, guckt mal."}, {"id": 855, "start": 7913.96, "end": 7924.28, "text": "30 Milliardenfach nestet virtualisiert hier. Wo gibt's den Download? Download Edge Linux"}, {"id": 856, "start": 7924.28, "end": 7940.0, "text": "Ubuntu. OMG Ubuntu, alles klar. Go to Edge Download Page. Und wir downloaden den Edge,"}, {"id": 857, "start": 7940.0, "end": 7943.16, "text": "wie sich das gehört. Oder was heißt, wie sich das gehört? Normalerweise gehört sich"}, {"id": 858, "start": 7943.16, "end": 7948.92, "text": "das umgedreht. Man lädt Firefox mit Edge runter und wir laden jetzt Edge mit Firefox runter."}, {"id": 859, "start": 7948.92, "end": 7954.56, "text": "Was mich ja viel mehr interessiert ist, dass das ganze JetBrains-Gedöns funktioniert. Übrigens,"}, {"id": 860, "start": 7954.56, "end": 7965.72, "text": "das will nicht, dass wir runterladen. JetBrains Toolbox brauchen wir. Die gibt's wahrscheinlich"}, {"id": 861, "start": 7965.72, "end": 7969.96, "text": "standardmäßig nicht unter Ubuntu, oder? Hätte ich's mal im T-Max aufgemacht, dann"}, {"id": 862, "start": 7969.96, "end": 7975.4, "text": "müsste ich jetzt nicht. Keine neue Session starten. Die default-Session muss ich übrigens"}, {"id": 863, "start": 7975.4, "end": 7991.48, "text": "auch mal umlegen, dass das immer gleich ins Ubuntu geht. Die Toolbox ist da nicht dabei."}, {"id": 864, "start": 7991.48, "end": 7997.76, "text": "Hätte mich jetzt auch gewundert. Warum willst du das JetBrains-Zeugs in der VSL haben? Weil"}, {"id": 865, "start": 7997.76, "end": 8002.08, "text": "ich, also wenn ich das mal an der Geschichte, wie wir es dann auf der Arbeit verwenden,"}, {"id": 866, "start": 8002.08, "end": 8006.24, "text": "ich werde das so nicht verwenden, weil es einfach pains-champig ist. Aber wir bekommen"}, {"id": 867, "start": 8006.24, "end": 8011.2, "text": "hier dann eine Windows-VM mit VSL drauf, wo wir aber unter Windows keine Admin-Rechte"}, {"id": 868, "start": 8011.2, "end": 8016.4, "text": "haben, um was zu installieren. Aber wir haben komplette Admin-Rechte unter der VSL. Frag"}, {"id": 869, "start": 8016.4, "end": 8023.68, "text": "mich nicht, wer sich das ausgedacht hat. Und ich kann dementsprechend auch keine.NET-Runtime"}, {"id": 870, "start": 8023.68, "end": 8030.08, "text": "unter Windows installieren. Was kein Problem ist, die gibt es als ZIP und sowas. Die sind"}, {"id": 871, "start": 8030.08, "end": 8035.16, "text": "gerade dabei, den Leuten wirklich das Arbeiten unmöglich zu machen. Deswegen bin ich froh,"}, {"id": 872, "start": 8035.16, "end": 8039.28, "text": "dass ich das alles ein bisschen umgehen kann. Wenn ich im Homeoffice sitze, dann mache ich"}, {"id": 873, "start": 8039.28, "end": 8043.08, "text": "das alles einfach hier auf meiner lokalen Linux-VM und lade es dann hoch, was ich brauche."}, {"id": 874, "start": 8043.08, "end": 8053.92, "text": "Richtiger pains-champ. Jetzt müsste wieder jemand im Chat schreiben, bei diesem Song"}, {"id": 875, "start": 8053.92, "end": 8059.0, "text": "haben sich meine Eltern kennengelernt. Ne, bei diesem Song habe ich meine Eltern kennengelernt."}, {"id": 876, "start": 8059.0, "end": 8064.2, "text": "Das schreibt er immer bei diesem Song, wenn das läuft. Und ich sage dann jedes Mal, wie"}, {"id": 877, "start": 8064.2, "end": 8067.24, "text": "oft willst du den Spruch noch bringen? Aber ich glaube, derjenige ist heute nicht da."}, {"id": 878, "start": 8067.24, "end": 8084.2, "text": "Als DAP runterladen. Accept. Jawoll. Save. Dann installieren wir das doch mal. Download."}, {"id": 879, "start": 8084.2, "end": 8102.4, "text": "Dann haben wir hier Debian. Äh, gibt sowas wie local install. Was ist das da? Ja, dpk"}, {"id": 880, "start": 8102.4, "end": 8121.92, "text": "ig minus ig, das weiß ich. Einfach nur install. Ach so, Moment, Punkt, Slash. Ah, wow. Erstmal"}, {"id": 881, "start": 8121.92, "end": 8128.44, "text": "das halbe Internet nachinstallieren. Das wusste ich noch gar nicht, dass das, ich glaube,"}, {"id": 882, "start": 8128.44, "end": 8135.68, "text": "früher bei abget, musstest du es, glaube ich, local installen machen. Ich fasse es nicht."}, {"id": 883, "start": 8135.68, "end": 8140.44, "text": "Wir installieren ernsthaft, wir haben uns ernsthaft einen X-Server unter Windows in einer eh schon"}, {"id": 884, "start": 8140.44, "end": 8145.2, "text": "doppelt nestet virtualisierten VM. Äh, ich kriege, ich, Moment, ich kriege gar nicht"}, {"id": 885, "start": 8145.2, "end": 8150.44, "text": "mehr zusammen, um wie viele Ecken wir virtualisiert und gedingst haben. Einen Firefox dann mit"}, {"id": 886, "start": 8150.44, "end": 8153.64, "text": "einem X-Server unter Windows haben wir uns jetzt Edge runtergeladen, installieren uns"}, {"id": 887, "start": 8153.64, "end": 8164.28, "text": "Edge in einem WSL, was in einem Hyper-V läuft auf einer VM in meinem Windows. Mind blown,"}, {"id": 888, "start": 8164.28, "end": 8173.32, "text": "Alter. Ihr dürft auf dem Windows kurken Software runterladen ausführen. Nein, dürfen wir nicht,"}, {"id": 889, "start": 8173.32, "end": 8178.16, "text": "aber wir dürfen WSL verwenden und WSL Package Manager und sowas. Frag mich nicht, ist total"}, {"id": 890, "start": 8178.16, "end": 8183.64, "text": "schwer. Ich werde es auch, ich werde damit gar nicht ordentlich arbeiten können. Ich könnte damit"}, {"id": 891, "start": 8183.64, "end": 8187.16, "text": "beispielsweise letztens diese Proxy-Auswertung, die ich gebastelt habe, würde ich gar nicht"}, {"id": 892, "start": 8187.16, "end": 8192.76, "text": "machen können. Sobald es wirklich akut wird, werde ich dann einfach bei jedem Auftrag, der kommt,"}, {"id": 893, "start": 8192.76, "end": 8196.96, "text": "den ich nicht ausführen kann, das ins Ticket schreiben, würde ich sagen, ja, ich würde es ja"}, {"id": 894, "start": 8196.96, "end": 8202.96, "text": "gerne machen, aber ich kann nicht, weil ich keine Rechte habe mit meiner VM. Worauf läuft die Windows"}, {"id": 895, "start": 8202.96, "end": 8211.04, "text": "vor allem bald, aber das ist zu Tricks. SiteRikes ist das. SiteRikes. Aber es ist alles kein Problem,"}, {"id": 896, "start": 8211.04, "end": 8214.32, "text": "ich hoffe, wir kriegen demnächst wieder ein stinknormales VPN, dann kann ich das einfach"}, {"id": 897, "start": 8214.32, "end": 8221.28, "text": "von meiner lokalen Linux-Kiste daheim verwenden und wieder ganz normal arbeiten. Okay, wie starten wir"}, {"id": 898, "start": 8221.28, "end": 8238.84, "text": "das jetzt? Edge. Microsoft Edge. Edge, da ist es. Bam. Wow. Da ist er, Leute. Oh fuck, jetzt habe"}, {"id": 899, "start": 8238.84, "end": 8253.52, "text": "ich ihn zugemacht. Ein Microsoft Edge unter WSL, nested Edge. Es ist nicht sonderlich schnell,"}, {"id": 900, "start": 8253.52, "end": 8268.64, "text": "aber es funktioniert. Ich sage es euch, die werden es auf der Arbeit so ätzend machen,"}, {"id": 901, "start": 8268.64, "end": 8274.0, "text": "zu arbeiten, dass alle nicht mehr richtig arbeiten können, aus Security-Gründen und es wird dann"}, {"id": 902, "start": 8274.0, "end": 8278.04, "text": "dazu führen, dass die ersten Leute anfangen sich heimlich zu tunneln, dass sie wieder arbeiten"}, {"id": 903, "start": 8278.04, "end": 8282.4, "text": "können, was dann genau das Gegenteil bewirkt, was man mit Security eigentlich haben will."}, {"id": 904, "start": 8282.4, "end": 8286.04, "text": "Natürlich darfst du das nicht und ich werde das auch nicht machen, ich werde einfach jedes Mal im"}, {"id": 905, "start": 8286.04, "end": 8297.72, "text": "Ticket nerven und sagen, kann ich halt nicht machen. Ich bin mal echt gespannt, wie das wird. Zumal,"}, {"id": 906, "start": 8297.72, "end": 8302.72, "text": "wisst ihr was witzig ist, auf der einen Seite erzählen sie so nach dem Motto, die IT ist nicht"}, {"id": 907, "start": 8302.72, "end": 8306.68, "text": "schnell genug, wir müssen agiler werden und dann baut man so Dinge auf, aber ihr kennt das"}, {"id": 908, "start": 8306.68, "end": 8310.48, "text": "wahrscheinlich, es ist wahrscheinlich in jedem bisschen größeren Laden so und dann baut man"}, {"id": 909, "start": 8310.48, "end": 8315.92, "text": "Hürden auf, die die Sachen standardmäßig schon und bei allem unnötig langsamer machen."}, {"id": 910, "start": 8315.92, "end": 8344.16, "text": "Das läuft nicht so gut wie im Firefox Leute, das ruckelt mehr als im Firefox. Zumal der Witz ist,"}, {"id": 911, "start": 8344.16, "end": 8355.44, "text": "dass der Trend, der Trend geht ja eigentlich hin Richtung Bring your own device, ne. Okay,"}, {"id": 912, "start": 8355.44, "end": 8360.76, "text": "das ist nice. So und jetzt kommt das und jetzt, okay, jetzt testen wir erst nochmal was sinnvolles."}, {"id": 913, "start": 8360.76, "end": 8364.88, "text": "Ich will nämlich mal die Jetbrains Sachen installieren und danach testen wir,"}, {"id": 914, "start": 8364.88, "end": 8370.96, "text": "ob Wine ordentlich funktioniert. Wine unter Windows und dann führen wir Notepad aus oder so."}, {"id": 915, "start": 8370.96, "end": 8396.92, "text": "Die Jetbrains, die Jungs von Jetbrains. Oh, es funktioniert. Nein, nein, nein, not allowed."}, {"id": 916, "start": 8396.92, "end": 8409.68, "text": "Da ist der SSO, installieren wir mal eine Runde Rider. Hab es noch besser gemacht als so ein"}, {"id": 917, "start": 8409.68, "end": 8419.28, "text": "Docker. Stimmt, stimmt, läuft ein Docker in WSL wahrscheinlich, oder? Übrigens Ubuntu ist"}, {"id": 918, "start": 8419.28, "end": 8428.24, "text": "gebate. Docker ist falsch, ne. Wenn ihr Docker installiert, installiert ihr nicht Docker. Ihr müsst Docker IOU installieren oder ihr installiert direkt Docker Compose."}, {"id": 919, "start": 8428.24, "end": 8443.64, "text": "Gucken wir mal, was passiert, wenn ich das installiere. So, Rider. Hat er schon fertig installiert? Ah nee,"}, {"id": 920, "start": 8443.64, "end": 8455.52, "text": "Installing. Ich wollte gerade sagen, das ging ja sonst brutal schnell, äh. Installing. Er downloadet"}, {"id": 921, "start": 8455.52, "end": 8460.32, "text": "wahrscheinlich noch. Den schon fertig? Boah, ging ja mega schnell."}, {"id": 922, "start": 8460.32, "end": 8476.0, "text": "In der Microsoft Schulung wollten die mal, dass wir Docker für den, für Windows Desktop verwenden."}, {"id": 923, "start": 8476.0, "end": 8480.8, "text": "Das war richtiger Painschamp. Ich wollte, ich hab schon gedacht, ey, Linux Shell auf,"}, {"id": 924, "start": 8480.8, "end": 8484.96, "text": "Docker, auf geht's. Und dann haben die ohne Scheiß zwei Stunden da rumgemacht,"}, {"id": 925, "start": 8484.96, "end": 8489.32, "text": "bis die ein Windows Beklickgeschiss da installiert haben, in dem wir schon ordentliche Sachen machen"}, {"id": 926, "start": 8489.32, "end": 8511.96, "text": "hätte können. Äh. Geht das jetzt? Wenn ich spreche, breche das mal kurz ab. Du musst"}, {"id": 927, "start": 8511.96, "end": 8530.92, "text": "Docker den von Hand starten, oder was? Ach so, ja, ist okay. Hey, das funktioniert. Läuft. Ich kann"}, {"id": 928, "start": 8530.92, "end": 8535.48, "text": "mich noch zur Docker Gruppe hinzufügen, dann wird es auch so. Aber geht. Äh, dann starten wir mal"}, {"id": 929, "start": 8535.48, "end": 8541.92, "text": "ein Hello World Container. Da gab's doch Docker, dieses Docker Hello World. Wo gibt's das denn?"}, {"id": 930, "start": 8541.92, "end": 8554.44, "text": "Äh, ich hab keine Ahnung, wie das unter, unter Windows funktioniert. Ja, Docker run it. Jetzt"}, {"id": 931, "start": 8554.44, "end": 8566.92, "text": "noch mal eine Ubuntu Bash, Alter, unter. Äh, Sudo. Jetzt ein Ubuntu Image im Docker noch,"}, {"id": 932, "start": 8566.92, "end": 8572.52, "text": "ja. Und dann da drüber ein Wine, Alter. Funktioniert anscheinend, ja? Funktioniert?"}, {"id": 933, "start": 8572.52, "end": 8579.96, "text": "Kann Docker unter VSL, das ist schon mal nice. So, und jetzt das Rider Zeug starten. Gucken,"}, {"id": 934, "start": 8579.96, "end": 8583.4, "text": "wie gut das funktioniert. Ah, nee, wir brauchen erst noch eine.NET Runtime. Die hab ich ja noch"}, {"id": 935, "start": 8583.4, "end": 8596.48, "text": "gar nicht installiert. Don't send. Nope. Äh, Dark Theme. Das läuft brauchbar schnell. Die"}, {"id": 936, "start": 8596.48, "end": 8603.0, "text": "Schrift sieht kacke aus. Die Schrift sieht mega kaputt aus. Wahrscheinlich weil keinerlei"}, {"id": 937, "start": 8603.0, "end": 8610.6, "text": "Schriftdaten installiert sind oder sowas. Not installed, not installed, ja, ich weiß."}, {"id": 938, "start": 8610.6, "end": 8629.88, "text": "Muss erst noch mal eine.NET Core installieren. Ah, hier sieht die Schrift jetzt okay aus,"}, {"id": 939, "start": 8629.88, "end": 8635.92, "text": "okay. Äh, probieren wir mal. Haben die, haben die eine.NET Core standardmäßig dabei bei Ubuntu?"}, {"id": 940, "start": 8635.92, "end": 8647.96, "text": "Die sind so dick, so dicke mit Microsoft, die haben doch da bestimmt was. Nee, oder? Haben"}, {"id": 941, "start": 8647.96, "end": 8652.72, "text": "sie nicht? Hätte ich jetzt gar nicht gedacht. Dachte, das sind Microsofts, Microsofts neue"}, {"id": 942, "start": 8652.72, "end": 8662.68, "text": "best, best buddies. Aber die haben noch so ein installscript. Äh,.NET Core Linux install."}, {"id": 943, "start": 8662.68, "end": 8667.06, "text": "Na, als Snap installier ich das nicht, als Snap geht er nicht. Installieren von.NET unter"}, {"id": 944, "start": 8667.06, "end": 8686.44, "text": "Ubuntu. Mithilfe des Scripts, jawoll. Wo ist das Script? Da. We get CRMOD plus X..NET install."}, {"id": 945, "start": 8686.44, "end": 8693.88, "text": ".NET install und er installiert standardmäßig 3.1. Man muss was machen? Minus C 5.0 minus C"}, {"id": 946, "start": 8693.88, "end": 8709.52, "text": "current, genau. Was ist.NET? Äh, ne Runtime für C sharp, bushelbasic.net, F sharp. Was gibt's"}, {"id": 947, "start": 8709.52, "end": 8716.88, "text": "noch so für Cobol.net? Wenn du Sachen in C sharp programmierst und es laufen lassen"}, {"id": 948, "start": 8716.88, "end": 8722.56, "text": "willst, brauchst du eine.NET Runtime. Die kannst du zwar mit reinpacken, aber zu entwickeln"}, {"id": 949, "start": 8722.56, "end": 8743.6, "text": "brauchst du die. Ok. Gucken, ob Ryder das jetzt erkennt. Hat er das jetzt in pass drinnen?"}, {"id": 950, "start": 8743.6, "end": 8763.44, "text": "Iron Python, ja das gibt's auch. Das war die.NET, die.NET Python Variante von, von"}, {"id": 951, "start": 8763.44, "end": 8769.24, "text": "ein paar Jahren. Es gab auch Iron, Iron Ruby und sowas. Ähm, weiß nicht, ob das überhaupt"}, {"id": 952, "start": 8769.24, "end": 8777.72, "text": "jemand verwendet. Wüsste jetzt ehrlich gesagt nicht so wirklich warum. Ok, ein bisschen"}, {"id": 953, "start": 8777.72, "end": 8782.0, "text": "laggy, ein bisschen laggy ist das schon, ne. Jetzt über, über das. Das könnte aber auch"}, {"id": 954, "start": 8782.0, "end": 8788.52, "text": "an der VM liegen. So, äh, Toolsets und Builds. Wo konnte ich denn Kram jetzt nochmal auswählen"}, {"id": 955, "start": 8788.52, "end": 8804.52, "text": "hier? Ja, komm mal, da hat's erkannt. Home.net. Alles klar, sehr gut. Save. Was? Can't wait."}, {"id": 956, "start": 8804.52, "end": 8812.72, "text": "Ich hab's kaputt gemacht. Es hat sich aus irgendwelchen Gründen gerade gecrasht, das"}, {"id": 957, "start": 8812.72, "end": 8815.84, "text": "hab ich noch nie gesehen. Ich wusste, ich wusste gar nicht, dass da gerade, also ohne"}, {"id": 958, "start": 8815.84, "end": 8822.16, "text": "Scheiß mir ist Ryder noch nie gecrasht. Und das obwohl's Java Kram ist. Was übrigens"}, {"id": 959, "start": 8822.16, "end": 8827.88, "text": "eigentlich auch richtiger Pains Champ ist, wenn man sich's mal genau überlegt, ne. Ähm,"}, {"id": 960, "start": 8827.88, "end": 8847.56, "text": "wir entwickeln quasi.net Programme mit ner Java IDE. Wird die dann dynamisch skaliert,"}, {"id": 961, "start": 8847.56, "end": 8867.32, "text": "das ist ne gute Frage. Ich hab ehrlich gesagt kein blassen Schimmer. Native Keychain. Ja,"}, {"id": 962, "start": 8867.32, "end": 8872.6, "text": "ich brauch keine Passwörter drin. Das ist schon fucking laggy gerade hier drum, das,"}, {"id": 963, "start": 8872.6, "end": 8883.4, "text": "das, das zu benutzen. Ich warte mal, bis der alles indiziert hat und so. Ich warte mal,"}, {"id": 964, "start": 8883.4, "end": 8889.32, "text": "bis der fertig indiziert hat, wie sich's dann bedienen lässt. Ryder ist besser als"}, {"id": 965, "start": 8889.32, "end": 8892.2, "text": "Visual Studio. Ich muss sagen, ich hab mich da mittlerweile so dran gewöhnt, dass ich"}, {"id": 966, "start": 8892.2, "end": 8896.64, "text": "standardmäßig Dornett-Projekte auch komplett nur noch unter Linux mache mit Ryder. Ich"}, {"id": 967, "start": 8896.64, "end": 8904.6, "text": "könnte auch Ryder unter Windows installieren, aber warum. Okay, er ist fertig. Das, oh fuck"}, {"id": 968, "start": 8904.6, "end": 8916.48, "text": "Alter. Okay, das ist nicht benutzbar. Ich hoffe, das liegt an meiner VM. Oh shit. Das"}, {"id": 969, "start": 8916.48, "end": 8928.4, "text": "ist, okay, das ist nicht benutzbar. Das ist laggy wie Sau. Guck mal hier, ich drück"}, {"id": 970, "start": 8928.4, "end": 8934.8, "text": "den Knopf. Seht ihr das, wie lang das dauert? Jetzt hat das Enter sogar gefressen komplett."}, {"id": 971, "start": 8934.8, "end": 8940.92, "text": "Boah, nee, das ist laggy wie Sau, das kann man nicht verwenden. Wir brauchen Stadia mit"}, {"id": 972, "start": 8940.92, "end": 8946.44, "text": "negativ Latency dafür, ja. Mal gucken, ob ich das Programm wenigstens ausführen kann."}, {"id": 973, "start": 8946.44, "end": 8958.96, "text": "Wie viel RAM hat die voll? Ich glaub 8G. 8G. Okay, aber es funktioniert wenigstens. Nee,"}, {"id": 974, "start": 8958.96, "end": 8964.0, "text": "aber so kann man nicht arbeiten, ohne Scheiß. Also so kann ich nichts entwickeln. Boah,"}, {"id": 975, "start": 8964.0, "end": 8973.68, "text": "das ist pains, pains, champic. Meine Fresse, nee, das geht nicht. Exit. Kann man Ryder"}, {"id": 976, "start": 8973.68, "end": 8977.72, "text": "nicht per SSH Attachement wie Visual Studio Code? Ja, ist schon möglich. Bringt mir nichts,"}, {"id": 977, "start": 8977.72, "end": 8984.2, "text": "ich hab ja kein anderes Ryder. Also dann, wie gesagt, die Möglichkeit hab ich da schon,"}, {"id": 978, "start": 8984.2, "end": 8990.0, "text": "aber wenn ich nur die von der Firma zur Verfügung gestellten Mittel verwenden würde, dann nicht."}, {"id": 979, "start": 8990.0, "end": 8997.76, "text": "Also das ist eklig. So, Cottencory Gaming, nee, einfach nur Cottencory, The Prime Gaming,"}, {"id": 980, "start": 8997.76, "end": 9004.04, "text": "WTF, Big Low Brain von mir hier. Danke für den Sub, 6 Monate. Woop, POG, richtig, richtig"}, {"id": 981, "start": 9004.04, "end": 9010.64, "text": "Massive POG. Geht in WSL, ZSH mit Plugins, klar, das funktioniert, das muss schnell ausprobieren,"}, {"id": 982, "start": 9010.64, "end": 9020.92, "text": "das funktioniert auf jeden Fall. So, jetzt kommt das Interessanteste. Abinstall Wine."}, {"id": 983, "start": 9020.92, "end": 9027.96, "text": "Es gibt Wine und Wine Stable. Ohne es gibt Wine64, bin es hier nicht das normale Wine."}, {"id": 984, "start": 9027.96, "end": 9036.92, "text": "So, und jetzt starten wir Notepad im Wine. Das muss ich unbedingt mal ausprobieren. Und"}, {"id": 985, "start": 9036.92, "end": 9045.48, "text": "Dogger können wir mit abschießen hier an der Stelle. Darauf hat die Welt gewartet, Notepad"}, {"id": 986, "start": 9045.48, "end": 9056.28, "text": "laufen zu lassen im Wine über WSL mit einem Xsofer auf Windows in a VM mit nested Virtualisierung."}, {"id": 987, "start": 9056.28, "end": 9064.8, "text": "Das musste sein. Dazu kann ich tatsächlich plus sagen, Moment, ich warte, ich warte,"}, {"id": 988, "start": 9064.8, "end": 9076.28, "text": "bis es startet. Warum nicht Notepad++? Können wir auch ausprobieren. Wartet mal, Notepad++,"}, {"id": 989, "start": 9076.28, "end": 9086.44, "text": "das lade ich einfach runter und starte das gleich mit Wine, das geht bestimmt. 32 Bit,"}, {"id": 990, "start": 9086.44, "end": 9097.48, "text": "Copy Link. Ah, das ist ein Installer, ich brauch das Standalone, Portable. Gibt es nicht"}, {"id": 991, "start": 9097.48, "end": 9111.32, "text": "als Standalone, gibt es nicht als Standalone Xso oder so? Portable, Zip. LCD, Downloads,"}, {"id": 992, "start": 9111.32, "end": 9123.88, "text": "WGet und Zip. Oh, ich hasse diese Zips. Leute, fuckt euch das auch ab, wenn ihr Zips habt,"}, {"id": 993, "start": 9123.88, "end": 9131.64, "text": "die sich nicht in eigenen Ordner entpacken, sondern in dem Ordner, wo ihr drin seid. Okay."}, {"id": 994, "start": 9131.64, "end": 9155.48, "text": "Upt, install, was? Upt, get, install, Wine32, okay. Das mache ich gleich noch. Wine32 ist"}, {"id": 995, "start": 9155.48, "end": 9180.48, "text": "missing. Sag mal, ist das eine Endlosschleife oder ne? Ich installe noch Wine32, ja. Installierst"}, {"id": 996, "start": 9180.48, "end": 9190.36, "text": "du gerade Wine? Ja, mache ich. Mache ich. So, einfach nur just for fun ausfunktioniert."}, {"id": 997, "start": 9190.36, "end": 9201.72, "text": "Wine64 haben wir jetzt. Ne, Moment, was? Es gibt Wine und Wine64, Wine32 gibt es gar"}, {"id": 998, "start": 9201.72, "end": 9222.24, "text": "nicht. Jetzt haben wir aus irgendwelchen Gründen noch WineStable. Okay, ne, ich glaube, Notepad++"}, {"id": 999, "start": 9222.24, "end": 9236.56, "text": "kriegen wir nicht zum Laufen. Was, Moment, was sollen wir machen? Ich glaube, das funktioniert"}, {"id": 1000, "start": 9236.56, "end": 9252.52, "text": "in WSL nicht, oder? Okay, Windows ist wieder PaintsChamp beim Copypasten. Oh, Moment,"}, {"id": 1001, "start": 9252.52, "end": 9257.96, "text": "das muss ich natürlich als Studio machen, sonst wäre das nichts. Ey, das wird nicht"}, {"id": 1002, "start": 9257.96, "end": 9273.68, "text": "funktionieren, Leute. Das glaube ich nicht, dass das funktioniert. Ja, oder auch nicht."}, {"id": 1003, "start": 9273.68, "end": 9288.64, "text": "Sag bloß, das funktioniert. Sag bloß, das funktioniert. Ich muss mal danach gucken,"}, {"id": 1004, "start": 9288.64, "end": 9307.0, "text": "wie groß danach meine WSL install ist. Wahrscheinlich ist die Platte gleich voll. Okay, zeige ich"}, {"id": 1005, "start": 9307.0, "end": 9318.32, "text": "mal her. Auf, gib Gas, 14 Sekunden. User ist nicht Champ, ne, habe ich nicht dran gedacht."}, {"id": 1006, "start": 9318.32, "end": 9321.32, "text": "Du hast recht, normalerweise nenne ich ja alles irgendwie Champ. Ich hätte eigentlich den"}, {"id": 1007, "start": 9321.32, "end": 9339.96, "text": "User auch Champ nennen müssen. LoginChamp. Boah, das ist ja fast so viel wie npm installen,"}, {"id": 1008, "start": 9339.96, "end": 9349.24, "text": "was er hier macht. Das ist auch das halbe Internet, was er installiert. WSLChamp, genau."}, {"id": 1009, "start": 9349.24, "end": 9379.08, "text": "Okay. Okay Leute, meint ihr es geht? Chat, wer hat noch Punkte für eine Abstimmung?"}, {"id": 1010, "start": 9379.08, "end": 9387.24, "text": "Haben wir Mods da? Mod check? Haben wir Mods da, die eine Abstimmung machen können? Wird"}, {"id": 1011, "start": 9387.24, "end": 9393.68, "text": "es laufen? Ja, nein. Ihr braucht keine Punkte ausgeben, ich mach die Abstimmung auch so."}, {"id": 1012, "start": 9393.68, "end": 9409.6, "text": "Ihr müsst nicht keine Punkte ausgeben, das passt schon. Nicht am PC. SeriousMax, weißt"}, {"id": 1013, "start": 9409.6, "end": 9413.48, "text": "du wie das geht? Ich hab das einmal gemacht und steig da noch nicht so richtig durch."}, {"id": 1014, "start": 9413.48, "end": 9443.36, "text": "Genau, da hier. Die Vorhersage hat begonnen. Prediction. Also, wie wird es laufen? Man"}, {"id": 1015, "start": 9443.36, "end": 9453.56, "text": "muss eingeloggt sein oder wie oder was? Also es prediktet gerade, ja 93%, nein 7%. Ihr"}, {"id": 1016, "start": 9453.56, "end": 9463.52, "text": "seid aber äußerst zuversichtlich, dass das funktioniert. Ich kann übrigens selbst nicht"}, {"id": 1017, "start": 9463.52, "end": 9491.44, "text": "abstimmen. Okay, 88% ja, 12% sagen nein. Okay. Postchamp? Ha!"}, {"id": 1018, "start": 9491.44, "end": 9517.44, "text": "Ha! Unknown exception occurred, file not found. Bam! Bam! Wow! Punktiert nicht. Ach du Scheiße!"}, {"id": 1019, "start": 9517.44, "end": 9536.92, "text": "Das sieht nicht gut aus. Nope. Nein, keine Chance. Das läuft nicht. Kann man Notepad"}, {"id": 1020, "start": 9536.92, "end": 9549.08, "text": "launchen? Aber Notepad läuft immerhin, aber Notepad++ läuft nicht. Also Leute, wir haben"}, {"id": 1021, "start": 9549.08, "end": 9556.96, "text": "es geschafft, wir haben ein Notepad laufen. Kein Notepad++, die Umfrage gegen Notepad++,"}, {"id": 1022, "start": 9556.96, "end": 9566.08, "text": "ne? Wir haben Notepad im Wine, im WSL, nestet virtualisiert in der VM. Das ist überhaupt"}, {"id": 1023, "start": 9566.08, "end": 9577.24, "text": "so lackfrei läuft, ist schon der Witz. Das läuft ziemlich gut. Paint? Ne, ich glaube"}, {"id": 1024, "start": 9577.24, "end": 9602.96, "text": "Paint ist da nicht dabei. Oder doch? Was kann man noch mal schnell ausprobieren? Kann"}, {"id": 1025, "start": 9602.96, "end": 9627.92, "text": "ich mein Internetexperiment herunterladen? Now with Bing. Achso, jetzt habe ich den Downloads"}, {"id": 1026, "start": 9627.92, "end": 9637.08, "text": "gar nicht drinne. Kann man da Sachen reinkopieren ins WSL? Quasi sowas hier. Ach, das ist ein"}, {"id": 1027, "start": 9637.08, "end": 9644.48, "text": "Installer. Okay, das wird nicht funktionieren. Das wird nicht, nein. Ach, reinkopieren kann"}, {"id": 1028, "start": 9644.48, "end": 9649.96, "text": "man nix, Dragon Droppen, oder wie? Na, das funktioniert natürlich nicht. Da muss ich"}, {"id": 1029, "start": 9649.96, "end": 9671.84, "text": "jetzt nach Mount, C, User, Test, Downloads, probieren das jetzt? Wie heißt da Kram? Stimmt,"}, {"id": 1030, "start": 9671.84, "end": 9684.88, "text": "ich hätte einen Explorer aufmachen können, ja. Aber das wird nicht funktionieren. Das"}, {"id": 1031, "start": 9684.88, "end": 9689.96, "text": "wird nicht funktionieren, auch mit Wine nicht. Kann ich mir nicht vorstellen, dass man EE"}, {"id": 1032, "start": 9689.96, "end": 9712.52, "text": "anzeigen kann? Nein, Anzeige ist raus. Wine CFG, Windows Version umstellen. Windows 7,"}, {"id": 1033, "start": 9712.52, "end": 9734.24, "text": "das müsste eigentlich funktionieren. Und jetzt? Postchamp? Nein. Nope, keine Chance,"}, {"id": 1034, "start": 9734.24, "end": 9738.56, "text": "das kriegen wir nicht installiert. Na gut, aber das war jetzt noch mehr Spielerei, dass"}, {"id": 1035, "start": 9738.56, "end": 9747.36, "text": "Kram funktioniert mit Wine oder nicht. Aber ist eine coole Sache. Also ich muss sagen,"}, {"id": 1036, "start": 9747.36, "end": 9754.64, "text": "man kann es benutzen und wenn man Windows verwenden muss und wenn man irgendwie eine gute Integration,"}, {"id": 1037, "start": 9754.64, "end": 9759.2, "text": "also wirklich zwischen echtem Windows Programm und Linux Programm braucht, ist es auch wahrscheinlich"}, {"id": 1038, "start": 9759.2, "end": 9766.04, "text": "das einzig Notwendige. Ich persönlich, muss ich ehrlich sagen, ich bevorzuge immer noch"}, {"id": 1039, "start": 9766.04, "end": 9781.6, "text": "meine klassische Linux VM und gut ist. Echt, ZFS wirft R aus, kann man gar nicht vorstellen."}, {"id": 1040, "start": 9781.6, "end": 9785.36, "text": "Aber trotzdem, cooler Versuch auf jeden Fall. Leider, leider, was ich persönlich ein bisschen"}, {"id": 1041, "start": 9785.36, "end": 9793.6, "text": "doof finde, ist, dass Rider quasi gar nicht funktioniert. Also was heißt gar nicht, doch"}, {"id": 1042, "start": 9793.6, "end": 9799.64, "text": "es funktioniert, aber es funktioniert nicht gut. Moment, ich hab doch gar kein Chrome installiert."}, {"id": 1043, "start": 9799.64, "end": 9823.08, "text": "Das debatet mich. Und SuperTuxKart geht auch nicht. Okay Leute, ich hab Hunger, ich geh"}, {"id": 1044, "start": 9823.08, "end": 9832.36, "text": "jetzt essen. Massive. Massive Pippo Fett. Und ist da Frazier da oder so, den ich hosten"}, {"id": 1045, "start": 9832.36, "end": 9853.76, "text": "kann? Nope. Kein Frazier am Start. Was, doch, da ist er. Da ist er. Warum wird der bei mir"}, {"id": 1046, "start": 9853.76, "end": 9868.32, "text": "nicht als Online angezeigt? Der Frazier. Raid. Wir raiden den Frazier. Auf gehts Leute. Wir"}, {"id": 1047, "start": 9868.32, "end": 9872.24, "text": "sehen uns dann im nächsten Stream, ich hab übelst Hunger, ich muss jetzt was futtern."}, {"id": 1048, "start": 9872.24, "end": 9888.92, "text": "Machts gut, wir sehen uns, bis dann, see you."}]}