{"text": "Ich glaube aber, dass ich gewonnen habe.Und man hat das schon immer schon gemerkt.Mein Name ist Toolzion.Ich bin ein Tierarmt.Und was gibt es an der rechten Seite?viljanуч嗎suspumhadusrussuctimerpuspuspusIch we granting wood for the treeJa Stripes, kanns bei dem bleiben was drin steht. Wir müssen heute echt mal den Kram ein bisschen weitermachen, sodass er funktioniert.Vielleicht machen wir heute auch das mit der Waage.Gibt's Gewicht Reveal.Ja, check mal ICQ. Das gehört jetzt irgendwelchen Cacomodates, ne? ICQ.So, mal kurz die VM anschmeißen. Oder wie die coolen Leute sagen, die VM. Die sagen ja nicht VM, die sagen VM.Hast du schon mal Online-Werbung geschaltet?Ich glaub nicht. Mir fällt jetzt zumindest nichts ein, wo ich schon mal Online-Werbung geschaltet hätte.Max, du hattest mich gestern mit dem gefakten Ping-Icon.Was?Ich weiß überhaupt nicht, was du meinst.Is even api tells you? So was gibt's ja.Das ist aber ein April-Scherz, oder?Das ist doch ein April-Scherz. Es ist aber ein lustiger April-Scherz. Sollte das kein April-Scherz sein, dann ist das ziemlich dumm.Aber die Seite ist genauso gemacht, wie diese ganzen Start-Up-Seiten eben alle aussehen.Aber die Idee ist lustig. Wobei ich sagen muss, gestern die meisten Witze waren total langweilig.Ja, langweilig. Alle haben sie irgendwie geschrieben, weil es Linus Tech-Tips vollgemacht hat.Alle haben sie gesagt, ha ha, ich habe jetzt einen Only-Fan-Account.Ha, lul, lul, lul. Das war mega Paynes-Champ-ig.Herwing, neun Monate. Dankeschön ins Zapp.Hast du das mit der VM auch im Gyra? Klar, habe ich das im Gyra vermerkt.Ich mache privat natürlich alles auch nur noch im Gyra. So früh? Naja, heute ist Feiertag. Ich hätte schon viel früher online sein können.Aber ich habe... Leute, Chat, Chat, ich muss euch was fragen.Ja, von ihr habe ich das auch mitbekommen. Und da habe ich gedacht, ey, das ist jetzt schon die zweite, wo ich das gesehen habe.Dann habe ich auf Twitter mal geschaut und der Witz ist total, total alt. Also von den beiden habe ich es auch mitbekommen.So, ich muss euch mal was fragen, Chat. Habt ihr eine Ahnung? Also, bei mir im Garten wurde ein Baum gefällt.Und ich gebe jetzt nicht einen Baum ein. Ich glaube, ihr wisst alle, wie ein Baum aussieht.Aber ein ziemlich großer Baum. So was da in der Richtung. Guck, so in... Ziemlich große Tanne war das.Oder ich glaube zumindest eine Tanne. So, und die haben wir gefällt oder haben wir fällen lassen.Hast du einen Antrag zum Baumfällen gemacht? Ja, ja, habe ich. Das ist in Deutschland so krass bürokratisch, der ganze Scheiß.Aber ja, ich hatte einen Antrag zum Baumfällen und der liegt auch schon ein paar Wochen rum jetzt. Das ist nicht ganz neu.Ich habe das Problem. Ich finde, ich weiß nicht nach, was ich suchen muss.Ne, für den musste ich keinen Ausgleichsbaum pflanzen, weil der war so groß. Den mussten wir aus Sicherheitsgründen abmachen, dass es nicht beim Nachbar aufs Haus fällt.Da musste ich keinen Ausgleich pflanzen. Zumindest, was ich für ein Problem habe, ist, wie heißen Handwerker oder Unternehmen, die sowas entsorgen oder abtransportieren oder was auch immer.Was muss man da suchen? Ich finde keinen, der diesen Scheißbaum abholt.Sägewerk? Nein, Quatsch, ein Sägewerk macht das doch nicht.Grünabfälle-Entsorgung. Ok, zeige ich mal her. Grünabfälle-Entsorgung.Kompostieranlage, hallo. Das reicht wahrscheinlich nicht für den Baum.Also ich suche jemanden, der das für mich macht. Macht das nicht die Firma, die den Feld nicht zwangsläufig, ne?Baum, was? Baumdienst? Gibt es?Baumdienst?Nee, das ist irgendwas anderes, oder?Ich will Entsorgung. Baumchamp programmieren, ja?Rund um den Baum in Röder, das ist gar nicht so weit weg. Rund um den Baum, zeigt mal her.Laufach ist auch nicht weit weg. Groß-Gerau ist ein Stückchen weg.Ok, was machen die? Guck mal, die haben schon mal einen Plan.Die wissen, was sie machen. Jetzt plus die Frage, ob die auch Entsorgung machen.Entsorgung, guck mal hier, Poggers.Ich habe diese Fehlermeldung legit noch nie gesehen. Ich weiß gar nicht, wo das herkommt.Da habe ich mir jetzt ein Virus eingefangen. Gleich mal hier Prozess-Explorer checken.Virus von der Baumschule.So, was haben wir hier? Was läuft hier? Sieht da irgendwas verdächtig aus?Ja, sieht alles normal aus. Unsinnigste Tool überhaupt, aber gut.Die Webseite ist braun. Der Typ soll ja auch mal einen Baum entsorgen und keine schöne Webseite haben.Warum ist die Webseite eigentlich braun, zeigt mal her.An was stört er sich denn? JQuery. Ah, JQuery kann er nicht downloaden.Weil, Moment, weil, JQuery in 2021, weil musecdnbusinesscatalyst.com nicht auflösbar ist.Das scheint mir eine absolut high-end pleading edge Webseite zu sein von dem Kerl.Aber ist mir egal, solange er den Baum ordentlich machen kann.Guck mal, der hat sogar einen YouTube-Channel. Die sind mal hier modern.Oh, das ist natürlich toll. Sechs Jahre, er hat drei Subscriber.Ey, an den ihrer Stelle würde ich nicht so viel Werbung machen für sich, weil die Webseite ist auch nicht die beste.Okay, machen die jetzt immer noch Bäume weg? Moment, Leistung, Entsorgung, genau. Ah, diese Kackseile.Okay, also was machen sie? Grünschnitt, Stammholz, ja wunderbar, die brauche ich. Die müssen meinen Baum wegbashing, Alter.Gut, das ist doch schon mal nice. Die können wir schon mal nehmen. Was haben wir da sonst noch so? Der Baumdienstgerber. Was machen die? Machen die Entsorgung, Leistung, Baumfällung, Pflege? Machen die auch inklusive Entsorgung?Siehste, die machen, die entsorgen nichts. Entsorgung? Okay, die machen das auch.Okay, also Baumdienst muss ich so einen Baumdienst zum Baumentsorgen? Alles klar. Wow, die Webseiten werden ja immer... Ach du Scheiße. Was sind das für Webseiten? Hilfe.Okay, die sollen meinen Baum schrotten, nicht? Leistung. Okay, Baumfällung? Die haben nichts von Entsorgung stehen. Egal, egal. Der Typ macht einen guten Eindruck hier im Pressum.Oh Gott, was für eine Seite. Wo ist denn der hier? Rödamark? Das ist nicht so weit weg. Okay, die Webseite wurde designt von denen. Die muss ich mir jetzt mal angucken.Naja, coming soon. Ich hab so meine Zweifel, dass das soon, aber... Okay, die muss ich mir mal merken. Die muss ich fragen. Habt ihr Erfahrungen damit? Hat da mal jemand erfolgreich irgendwelche Handwerker drüber gefunden?Ich hab mir überlegt, ob ich nicht mal da was reinstellen soll. Achtung, Flashbang. Auf keinen Fall? Warum nicht?Scam? Warum nicht? Okay, gut. Chat hat mir schon mal weitergeholfen. Jetzt weiß ich zumindest halbwegs, nach was ich suchen muss.Ich sollte mal vielleicht das Mikrofon ins Gesicht hängen und nicht hier irgendwie sonst wo rumhängen haben. Kann man mal Baumentsorgung so viel falsch machen?Ähm, ja. Das Problem ist, du musst jemand finden. Das ist nicht so einfach. Das mit den Baumfällen war nicht so schwierig. Das haben wir ganz gut gemacht, weil der Nachbar hat auch was machen lassen gerade und die hatten da Leute da. Aber...Beim Entsorgen? Ich finde keinen, der meinen Baum entsorgt. Also der Baum ist schon gefällt, ne? Ich brauch niemand, der meinen Baum fällt. Der Baum ist schon gefällt. Ich brauch jemand, der das Holz wegmacht und die Äste und das ganze Zeug, was im Garten liegt. Das ist ein relativ großer Baum. Mir ist das egal. Der kann das auch zu Feuerholz machen und bei sich im Kamin verheizen. Hauptsache, er nimmt's mit.Warum haben die den nicht mitgenommen? Weil die da keinen Bock drauf hatten und das nicht mit ihm ausgemacht war.Und was? 35 Jahre später ist dann der Baum weg, oder wie? Ist der Baum, ist das der Baum, aus dem YouTube stellts? Kann sein, dass man den da auch gesehen hat, ja. Achso, ja. Genau, also wenn ihr den Baum mal sehen wollt, ich kann euch den Baum zeigen.Ähm...Zack? Der da. Der da. Aber man sieht's halt jetzt nicht, so weil ich nach unten filme.Der hier. Also der dahinter. Ah, guck mal, guck mal. Okay, man erkennt nicht so wirklich viel, ne? Aber man sieht schon, der war ganz schön hoch. Das sind jetzt noch andere, die stehen alle.Ja... Guck, hier sieht man's. Das ist der Baum, das ist der Baum. Der Baum ist gefällt, der liegt jetzt hier so da. Also in Stücken, ne? Nicht komplett. Und...Das ist, also dieses komplette Ding hier, also dieses komplette Feld hier bis hier ist voll mit Baum. Anzünden, wenn einer kommt, sagst du Osterfeuer. Ja, auch exzellente Idee. Ja, genau. Ich seh schon, der Chat, ich hätte den Chat früher fragen sollen. Der Chat weiß Bescheid, ja. Hier isser.Also ihr seht, das ist schon ein ordentlicher Baum gewesen. Soll das Ganze noch mal im Winter? Massive Winter, stell's. Nee, das ist der andere. Naja.Ein eBay-Kleinanzeigen, das ist alles so... so merkwürdige Leute. Moin Twinker. Nee, das kann ich nicht, das funktioniert nicht. Also ich weiß nicht, wenn ihr sagt schlechte Erfahrung, okay.Aber ich muss... also der Typ macht echt einen ganz guten Eindruck hier. Und wen haben wir da noch? Äh, der hier. Die haben einen ganz guten Eindruck gemacht, oder? Nee, fuck. Wer war das jetzt?Rund um den Baum, die haben einen ganz guten Eindruck gemacht. Rund um den Baum. Guck mal, da kann sich sogar Google Ads leisten.Glaub mir, eBay-Kleinanzeigen und zu verschenken und die Leute rennen dir die Bude ein. Ja, das sind aber so komische Leute, mit denen will ich eigentlich gar nicht groß interagieren.Die eBay-Kleinanzeigen, Leute. So, machen die auch Entsorgung? Entsorgung, Entsorgung. Exzellent.Kein Problem, wir machen das. Er ist fast wie Bob der Baumeister, Alter. Okay, wo sind die? Wie? Wo ist das Impressum? Oh, das ist am Arsch der Welt. Die kommen bestimmt nicht 500km hergefahren, um meine Baumreste zu entsorgen.Na gut, aber Chat, ich weiß schon mal Bescheid. Wunderbar. Machen wir mal kurz hier die VM an.Mal kurz Chat lesen, bevor wir überhaupt, probieren wir mal wirklich ein bisschen was auf die Reihe zu kriegen. Gestern habe ich schon mehr geschwätzt, als dass ich was gebaut habe und dabei ist es gar nicht so schwierig, was ich programmieren will.Ich zeige euch auch gleich noch mal, um was es genau geht.Nein, das funktioniert nicht. Ich will irgendjemanden, der dafür dann auch wirklich verantwortlich ist, wo ich dann sage, ey, hol ab und der ist halt dann gefälligst dafür zu sorgen, dass nix kaputt geht, dass das Ding alles weg ist, dass das ordentlich gemacht wird und gut ist. Da bezahle ich auch was dafür.Das ist mir egal, Hauptsache der Baum ist weg. Dafür, dass sie sich den Arsch ablachen, gab es bisher wenig Leute, die Bock drauf haben.So, gut. Das war's für heute. Bis zum nächsten Mal. Bis zum nächsten Mal. Tschüss.Ja, gut, das wird mich nicht großartig stören. Das kann mein Fing auch noch einen Monat rumliegen. Das ist wirklich wild.Ja, mal gucken, mal gucken. Also, ich frage, der Baumprofi, ich habe schon wieder vergessen, rund um den Baum hieß, hörte sich doch ganz gut an. Also auch den Stamm mit ausfrühen, nee, der bleibt da. Das muss nicht sein. Nee, nee, das muss nicht sein.Ich baue einfach einen, der den Baum mitnimmt, der schon da, also den kleinen gehackten Baum da schon da liegt. Baumchamp, genau.Also, nochmal als kurze Zusammenfassung, was wir machen.Ich zeige das nochmal ganz schnell. Also, ich habe ein paar von diesen Sensoren hier am Start. Das ist ein Sensor, der hat Bodenfeuchtigkeit, der ist eigentlich zum Überwachen von Plumenschöpfen, Pots und Beete und sowas.So, der überwacht Bodenfeuchtigkeit, Mineralen im Boden, hat aber auch einen Temperaturen-Licht-Sensor und ich habe mir gedacht, nachdem mein Kühlschrank oben, der hat manchmal ein paar Probleme, macht komische Geräusche.Das habe ich euch schon mal erzählt, das ist der Kühlschrank, den man ab und zu mal neu starten muss. Wo ich immer sage, es ist unglaublich, es ist unglaublich, was man mit Reboot alles lösen kann.So, und was auch immer dieser Kühlschrank macht, ich habe Schiss, dass der mal einen Geist aufkippt und ich es nicht richtig mitbekomme. Deswegen habe ich mir jetzt überlegt, ich mache jetzt Big Brain, Taktik.Ich lege dieses Ding in Kühlschrank, das ist Bluetooth Low Energy, Kühlschrank rebooten, ja, sonst macht er komische Geräusche teilweise.Ich lege das Ding hier in Kühlschrank und das misst Temperatur und Licht. Wenn Licht an ist, habe ich die Tür vergessen, wenn Temperatur allerdings zu sehr steigt, weiß ich, es stimmt irgendwas nicht.Das ist eigentlich der optimale Sensor für Kühlschrank.Ja, nee, der ist noch nicht geroutet, der Kühlschrank.So, und das haben wir am Start. Was wir den letzten Stream schon programmiert haben ist, dass der das ausliest.Also sprich, der kann aktuell über Bluetooth, also ich habe hier so ein kleines Board am Start, der kann aktuell über Bluetooth auslesen, Temperatur und Licht. Ich kann euch auch zeigen, dass das funktioniert.Ähm, wir flashen jetzt erstmal, Flashchamp.So, Moment, Battery, was macht der da?Ach, das war mal eine Debug-Ausgabe, Moment, dass ich Schwachsinn, das muss ich doch mal wegmachen. Ich habe da irgendeinen Müll ausgegeben, komplett, komplett bescheuert.Das war gestern einfach nur zum Ausprobieren. So, aber wie gesagt, ich kann euch sagen, dass das funktioniert, also zeigen, dass das funktioniert und zwar, das kommt auch weg.Tangle, danke schön für den Prime-Sub. So, und zwar, was der aktuell macht, ist folgendes, der scannt Bluetooth Low Energy Modus, scannt der, ob Geräte irgendwas rausschicken.Also, das Problem ist nämlich, es gibt zwei, guck hier, hier kriegt man gerade die Werte, das ist ziemlich hell, wo der Sensor liegt, das ist 1119, ich vermute mal, das sind Lux als Einheit, bin mir nicht so ganz so sicher.Also der Sensor meldet gerade von dem Ding, es ist relativ hell und ab und zu sagt er dann auch mal seine Temperatur, wenn man lang genug wartet.So, es gibt zwei Möglichkeiten, diesen Sensor abzufragen und es gibt auch schon ein paar Projekte, die das gleiche machen, wie ich hier programmieren will, nur die machen das nicht so, wie es mir gefällt.Ansonsten würde ich in dem Fall tatsächlich auch mal was Fertiges nehmen. So, ach guck, hier seht ihr, die Temperatur, 23 Grad ist ja gerade optimal.So, und es gibt zwei Sachen, wie man den Sensor abfragen kann. Es gibt einmal die rein passive Geschichte, der Sensor schickt alle 30 Sekunden, seht ihr ja auch hier, das schickt alle 30 Sekunden mal so einen Burst von Infos zu einem Sensorwert.Das macht der Sensor von sich aus, dazu muss man ihn nicht abfragen, also spricht der Sensor, schickt alle 30 Sekunden Infos über Bodenfeuchtigkeit, über Temperatur und über Licht.So ungefähr alle 30 Sekunden, seht ihr ja hier unten auch, guck jetzt wieder Temperatur dran, 30 Sekunden bis Minute später.So, und was ich jetzt mache ist, ich scanne einfach nur, ob irgendwas Daten schickt. Das hat den Vorteil, dass ich nicht die Batterie von diesem Sensor irgendwie belaste.Ist ja logisch, wenn ich einfach nur das mitschneide, was der Sensor schon schickt, dann verbrauche ich keine extra Batterie.So, die zweite Variante ist das, was übrigens auch einige fertige Projekte schon machen, die fragen den Sensor aktiv ab.So, und das verbraucht Batterie wie Sau. Man muss nämlich überlegen, da ist bloß so eine kleine, was auch immer das ist, 230 mAh Batterie drinne.Das heißt, der Kram hält nicht lange, wenn man den permanent abfragt.So, deswegen habe ich mir das überlegt, wir machen das folgendermaßen, wir scannen rein passiv die Werte, die reinkommen.Das haben wir schon gemacht, das funktioniert auch.Das ist vielleicht nicht schön, aber es funktioniert, das ist das Wichtige. Ob das für Schönheitspreis, muss ich ja gar nicht gewinnen.Dafür ist C++ an sich schon zu hässlich, das kann man gar nicht schön machen.Allerdings eine Sache, die mir nicht gefällt und ich will so das Beste aus beiden Welten verbinden.Nämlich, ich will...Kann man denn den automatischen Broadcast am Gerät ausschalten? Nein.Du hast keine Möglichkeit, irgendwie Settings daran zu ändern. Das wäre auch eine Variante, das könnte man auch machen.Aber es geht halt nicht. Aber wie gesagt, ich will das Beste aus beiden Welten verbinden.Ich möchte nämlich den Broadcast mitschneiden per Bluetooth, also das, was ich hier mache.Aber in dieser Ausgabe ist kein Batteriestatus drin. Also ich weiß nicht, wie viel in der Batterie noch drin ist.Und deswegen...Big Brain, habe ich mir gedacht, wir machen das so.Wir scannen passiv, was reinkommt. So.Und dann merken wir uns, welchen Sensor wir gefunden haben.Und diesen Sensor fragen wir einmal alle 5 Stunden aktiv die Batterie ab.Und dann habe ich das Beste aus beiden Welten.Oder einmal am Tag oder so, mal gucken, weiß ich auch nicht genau.Dann habe ich nämlich das Beste aus beiden Welten.Ich habe Batterie in einem größeren Abstand, was allerdings...Also ich habe den Stand der Batterie in einem größeren Abstand, was aber selbst die Batterie nicht beeinflusst.Das heißt, als nächstes muss ich gucken, wie kriege ich Batterie abgefragt.Natürlich habe ich schon mal im Vorfeld ein bisschen...Ich mache den ganzen Kreml hier mal zu.Ups, ein bisschen viel.Oh, da ist wieder der Baumofant.Ich habe auf GitHub schon mal ein bisschen geguckt.Und wenn man hier nach ESP32 Flora sucht, findet man ein Beispielprogramm.Hallo?Shithub, genau.Richtig genau, ByteStrike, so sieht es aus.Dark Reader, was ist denn los?Leute, wir brauchen keinen Dark Modus.Sorry, für Flashbang Modus, der Dark Reader nervt gerade rum.Piss dich, Dark Reader.Genau, und hier habe ich ein Beispiel gefunden, wie man den Batteriestand abfragt.Also das hier war schon äußerst eklig rauszubekommen.Nur mal so, was man da machen muss, um überhaupt die Werte rauszubekommen.Also man muss einen Bluetooth-Scan machen.Wir verwenden übrigens nicht die Bluetooth-Library, die dabei ist, sondern...Oder doch, das stimmt nicht.Wir verwenden die Bluetooth-Library, die dabei ist, allerdings eine etwas neuere Variante davon, die deutlich weniger Flash-Speicher braucht.Weil ansonsten ist die 1,9 MB für so eine Firmware ratzfatz voll.Also der Bluetooth-Stack ist huge fat.Also der Bluetooth-Stack ist huge fat.Also der ist sowas, der ist...Kennt ihr diese Pepo-Version mit dem Fast-Foot in der Hand?So fat ist ungefähr das Ding auf dem Flash.So, so, in der Richtung, ja.So, so machen wir das.Genau, und man macht einen Bluetooth-Scan.Das ist hier alles ziemlich default.Der scannt, der hört einfach endlos jetzt, was die Geräte schicken.Und um die Werte rauszubekommen, ist richtig big brain, was man machen muss.Das musste ich mir auch auf GitHub abgucken von einem, der dieses...Der dieses Protokoll reverse-engineert hat von diesem Sensor.So, und es funktioniert folgendermaßen.Nur mal so einen ganz kurzen Überblick, was man machen muss.Man muss sich die ID von dem Gerät holen.Dann muss man gucken, ob die ID mit diesem Byte anfängt.Oder besser gesagt, die ID mit diesem Byte entspricht.Dann muss man die ID von dem Gerät holen.Dann muss man gucken, ob die ID mit diesem Byte anfängt.Oder ob die ID mit diesem Byte entspricht.Das ist die Xiaomi, Xiaomi, Xiaomi, wie auch immer.Ihr wisst, was ich meine. Ich meine die hier.Bluetooth-ID von diesem Gerät.Und nur wenn das da kommt als ID, will ich überhaupt weiter gucken.Dann muss ich irgendwelche komischen C++-Dinger machen, weil es C++ ist.Dann muss ich gucken, ob im dritten Feld von diesem Array......das auf 98 Hex steht.Das vierte Feld, ob da eine Null drin steht.Wenn nicht, dann ist es schon mal nichts, was ich auslesen will.Frag mich nicht warum, ergibt keinen Sinn.Habe ich mir abgeguckt auf GitHub von irgendeinem Typ, der raus bekommen hat, wie dieses Gerät kommuniziert.Warum auch immer das so ist. Ich habe keine Ahnung, man muss das aber so machen.Dann muss man irgendwelche... Ja, wirklich, too smart.Du hast noch nichts verpasst. Mir haben keines eingefallen.So, dann musst du hier ein paar Sachen checken.Und im Zweifelsfall, wenn du das nicht auslesen kannst, wieder rausgehen.So, dann hier nächste Magic.Wenn das auch... Wenn es Capabilities hat, was auch immer das bedeutet, in dem Fall, keine Ahnung.Dann müssen wir bei Index 12 anfangen, ansonsten bei Index 11.Weil, also wie gesagt, ich weiß auch nicht warum, aber es ist so.So, und dann muss man sich irgendwie rausholen, wie lang der Wert ist, den man auslesen will und wo er startet.Und dann kann man das Ganze auslesen.So, so kriegt man die Temperatur raus.Und so, also mit so einer äußerst trivialen Zeile, die natürlich jeder auf den ersten Blick versteht,kriegt man raus, wie der Helligkeitssensor gerade, was der Helligkeitssensor gerade meldet.Also, ich muss euch sagen, ich verstehe zwar, was das prinzipiell von der Syntax her, was diese Zeile macht.Aber so genau vorstellen kann ich es mir nicht.Also, das hier ist ein Zugriff auf den Index Value Start plus 3, das ist dann in dem Fall, glaube ich, 12. 12 plus 3, 15.15, 16, 17. Index 17.So, und das ist, glaube ich, ein Bitwise Left Shift.Also, mit 16, ich glaube, mit 16 Nullen auf... Nee.Der Twinkler weiß das bestimmt, der kennt mit so was aus.Ähm, ist das nach links schieben und rechts 16 Nullen auffüllen?Irgendwie sowas, das ist irgendwie Bitwise Shift, muss ich jetzt genau gucken, was das für eine Operation ist.Okay, 16 nach links, nach links shift bedeutet rechts 16 Nullen auffüllen, ne?Also, 16 Nullen rechts auffüllen, weil es ja eine 32-Spit-Zahl ist anscheinend.So, das Ganze dann noch mal machen und hier 8 Stellen, 8 mal Null, also auf den anderen Index auffüllen.Das Ganze Binary Or machen und dann noch mal ein Binary Or mit dem, was im Start steht.Ultra Black, schwarze Magie, aber es funktioniert.Ihr seht Lichtwert und Temperaturwert, das stimmt auch ungefähr.Hier ist grad 24 Grad oder so drinne, vielleicht am Fenster ein bisschen weniger, wo das liegt, das passt.Also es kommt ungefähr hin, so plus, minus 1, 2 Grad vielleicht.Wie Ort man zwei Zahlen? Ganz einfach, indem du die Zahlen als Binary nimmst.Ah, also, so was.Dann nimmst du die erste Zahl, sagst... Okay, das ist jetzt dumm, weil das ist geort 111.Wir müssen das mal ein bisschen anders machen, so als Beispiel.Okay, wenn du diese Zahlen orst, 111, 1 oder 1 oder 1 oder 1, passt, ist 1.Null oder Null ist Null, 1 zu 1, so, 1 oder Null ist 1, 1.Okay, die zwei Zahlen geort werden das hier. Oder, Moment, ja doch, korrekt, korrekt.So, und mit einem und würde das dann so aussehen.So, ah, yes, ich weiß.Das wäre mit einem und, also man könnte auch einen und hier machen an der Stelle, wenn man denn das von der Logik her bräuchte.Syntaktisch wäre das okay.So odert man zwei Zahlen, wie auch immer man das genau mathematisch korrekt bezeichnet.Und jetzt, um komplett mein Mind zu plonen, wisst ihr wofür die Subnet Mask da ist.Warum Netzwerk eine Subnet Mask hat?Das ist genau dafür, dass du rausfinden kannst, was Netzwerk und was Host ist.Die machen genau das. Ich bin mir nicht ganz sicher, wie es genau funktioniert, ob du es oderst oder endest.Ich weiß nicht, aber zumindest sowas ähnliches macht man mit der Subnet Mask auch, um rauszukriegen, was Netzwerk und was Hostanteil ist.Also es hat ja auch einen gewissen Unterschied zwischen Netzwerk und Host.So, und jetzt muss ich gucken, wie lese ich die Batterie aus.Was ich mir überlegt habe ist, also ich hab mal hier so eine Klasse für den Sensor angelegt zum Datensammeln.Und ich habe mir überlegt, was wir machen, ist folgendes. Also wir lesen hier aus, also wir gucken hier, ob neue Geräte reinkommen.Wenn neue Geräte reinkommen, dann schreibe ich die in diesen...Ich weiß, es ist keine Liste, aber ich sag mal Liste, ja. Dann schreibe ich das in diese Liste rein und merke mir das.Und dann mache ich hier unten in meiner Hauptschleife, mache ich dann einmal alle 5 Stunden Batterienupdate.So weit die Theorie.By the way, warum zählt der da jetzt eigentlich die ganze Zeit hoch?Was mach ich denn da?Ah, das ist die Uptime. Oh guck mal, ich war ja sogar so clever und ich hab ne Uptime dabei gemacht, dass ich sehe in der Ausgabe, ob das noch funktioniert.Ja genau, das ist der Miflora hier. Exzellent, exzellent.So, jetzt muss ich mal gucken, wie mein Batterienstatus abfragt.Das wird richtig Monka-essig, sag ich euch.Okay, also, wir machen mal, wir machen da mal...Also, wir machen da mal sowas, was eigentlich, sowas wie Update Sensor Battery Level oder sowas.Da muss ich mal gucken, wie das funktioniert. Hier habe ich nämlich ein Beispiel, wie das geht.Wir schauen uns das jetzt erstmal an.Also, es gibt irgendwelche ID's für den Batteriestatus, gut.Irgendes Service ID, okay.War Tado nicht das Ding, was letztens AWS Probleme hat oder bringe ich das durcheinander, wo die Leute ihre Thermostate nicht verstellen konnten?Letztens hat irgendwie, hat AWS Probleme gehabt und die Leute konnten ihre Heizung nicht mehr steuern.Da denke ich mir auch mal, bin ich froh, dass ich den Gramm offline habe.Stellt euch mal vor, euer Internetzugang geht nicht mehr oder AWS hat Probleme und es ist Winter und ihr könnt die Heizung nicht anmachen.Mein Real Crazy, das ist schon ziemlich fail, oder?Oh, hier gibt es jetzt, hier gibt es jetzt Big Brain Erklärung.192168178.0 slash 24 sagt, dass das Netz 256 Adressen...Ja gut, das ist klar.Aber wie macht es das?Mit einem, wahrscheinlich mit einem und, oder?Ey, invert, invert und und invert oder wie macht es das?Ich weiß es nicht mehr aus dem Kopf, wie das funktioniert.Man muss es inverten irgendwie, glaube ich, habe ich im Hinterkopf, ne?End, man macht End, End und invert oder sowas macht man, glaube ich, ne?Ach, keine Ahnung, das wusste ich mal, das habe ich, das brauchst du ja nicht tagtäglich.Was, gestern Abend hatte MS Probleme mit ihrem DNS und dann ging alles von Teams über OneDrive bis hin zu Xbox Live nicht?Gip.Könnt ihr euch noch an den Playstation-Ausfall erinnern von der PS3?Wo das, wo das, das Lizard Squad war, das doch damals, glaube ich, die wie verrückt Sony gedenost haben?Ich weiß nicht, wie ich gerade drauf komme, irgendwie.Tado hat eine eigene Bridge, ja, das ist schon mal gut.Da geht wenigstens der Kram weiter, wenn der Internet ausfällt.Okay, ich bin schon.Wir gucken jetzt, wie das funktioniert.Subnetting in, oh fuck, muss das jetzt wirklich sein?Jetzt wird es Pains Champ, Leute.Hallo?Hier, die Seite geht nicht.Aber, aber wir können einfach IP-Kalk verwenden, dann steht das da alles drinne.Wie, nicht installiert?Ein Moment, IP-Kalk habe ich nicht.Hau mal, IP-Kalk, beste Versuche.Da steht es doch drinne. So, IP-Kalk, 192.168.50.0.24.So, hier erklärt es einem jetzt, glaube ich, wie es funktioniert.Also, genau.Address.Genau, das ist die, das ist, das ist, das ist die, das Netz im Binary.Moment, nee, das ist nicht das Netz im Binary, das ist die Adresse, also kannst du irgendwie sowas machen.Genau, das ist die Adresse im Binary.Das ist die Netmask im Binary.Wildcard is Cisco, geduldens brauchen normale Menschen net.Das ist Netzwerk.So, und jetzt kannst du, wenn du das hier, wenn du das hier,wenn du das hier ein End machst, ich weiß immer noch nicht, ich weiß immer noch nicht mehr, wie es funktioniert.Wildcard, das ist die umgedrehte, das ist die umgedrehte Netmask, das ist so ein Cisco Ding, die stehen da irgendwie drauf.Cisco Leute geben gerne nicht Netmask ein, sondern irgendwie Wildcards, weil Cisco Leute sind, keine Ahnung.Einfach einen Und machen.Aber einfach einen Und machen kann ja nicht funktionieren.Dann kommt wieder, bei einem einfachen Uns würde ich hier überall eine Null rauskommen.Deswegen, ich bin mir relativ sicher, es war irgendwie invertieren und unten.Man musste einen Und machen und dann invertieren oder irgendwie sowas.Ach, ich weiß es nicht mehr.Scheiß drauf.Xorn, ich kann, ich weiß es echt nicht mehr genau, wie das funktioniert.Ja, das ist die schöne, das ist die IP-Kalge-Ausgabe.Na klar, ich würde auch was fertiges nehmen.Na klar, ich würde auch was fertiges nehmen.Ja.Gut.Gut, dass wir das jetzt geklärt haben, dass ich nicht mehr weiß, wie es funktioniert.Hallo Max, ich wollte dir nur mal sagen, dass du ein großer Teil meiner Jugend warst. Es ist schön, dass du deinen Weg hierher gefunden hast. Lil Pippo, oh das kann ich nicht ausbrechen. Lil Pippo Puss.Was auch immer, aber ähm.Ähm, damals hast du mich und Commander Krieger täglich nach der Schule geschaut.Nice.Freu mich immer über neue Videos, war mega sad, als du damals plötzlich einfach weg warst von YouTube.Ich war ja nie wirklich weg von YouTube, das stimmt ja gar nicht.Na gut, im Vergleich zu früher war ich ziemlich wenig aktiv die letzten Jahre.Ah exquisite, ich sehe hier schon, äh, richtig quickscope Name am Start.Aber wenn du hier guckst, ich meine ich hab die letzten Jahre nicht viel gemacht, ich war nie weg. Guckt euch das mal an.Ich hab hier einfach diese Jahre kaum was gemacht, ne.Früher, früher, hier pro Jahr, müsst ihr mal gucken.Ja, pro Jahr, das hört gar nicht mehr auf sechs Jahre, sechs Jahre, sechs Jahre, sechs Jahre, sechs Jahre, sechs Jahre, sieben, sieben, sieben, sieben, sieben, sieben, sieben. Ja, ja, ja, total viel.Und dann irgendwie fünf Videos pro Jahr zwischenzeitlich.Ups, take weight.Der Sebaro ist da.Huge.huge cute mod himselfUnd sebaro was macht das lehramts grill jetzt du hast das jetzt erzählt jetzt jetzt jetztInteressiert es mich auchAber wenn wenn es da was gebe hättest du es wahrscheinlich schon gesagtSo also wir fangen jetzt mal an wir machen wir kurz gucken uns mal den beispiel beispiel kodra anSie kann sich hausarbeiten aus dem arsch ziehen wie keine zweit ist jetzt was gutes oder was schlechtesIch ich würde behaupten dass er baro klingt beeindrucktJa sebaro das wird schonDu musst sie einfach von deinen cute mod qualitäten überzeugen dannDu kannst auch sagen du kannst auch sagen du bist discord admin und mod bei wubblersdas zieht bestimmt wahnsinnigIch muss mal gucken ob hetzner noch geantwortet hat auf den letzten drückerWeil ich bin schon ganz scharf drauf hetzner sell-out zu machen aber ich glaube das war zu kurz vor osten jetztDie habe ich jetzt schon gewartet mitVor allem das sind immer so so bescheuerte messages die die schickenUnd was haben wir noch einen hier haben noch einen anderenAlexandra vom der marketing show manager alexandra ist am startSie wollen mit irgendeinem videoeditor oder so verkaufen oderwas auchDa so wen haben wir dann sonst noch ein ladung zur kooperationOk ein ladung zur kooperation vonwikiBoang alles klar was gibt es denn da das muss jetzt mal kurz hier was wollen sie was wollen sie kooperierenGuffWas istOk das gucken wir uns jetzt mal an ob wir mit denen kooperieren wollen was ist gut nicht kruf gut hieß dasAch nee guvee guvee oder soWo wir oder gov govGovWarum kann google so komische wörter aussprechen ok ich habe kein sound lull wasled strips ahaled strips inklusive grills auf dem sofa ja da kann ich nicht nein sagen was was home improvement tempOk das sieht tatsächlich nach irgendwas aus mit denen man was machen könnte indoor lightninglighting lightningled bulbshome improvementchina koreachina cloudDu hast recht das sieht aus wie diese 015 tuya light bulbsAber das ist auf jeden fall was mit denen könnte man durchaus was machen was bieten sie denn anDie produkte erfreuen sich größter beliebtheit schreibt sie naja gutDas das würde ich auch sagenDas das würde ich auch sagenSo gleichzeitig liegen unsere produkteAuch auf sozialen medien wie youtube tiktok und instagram voll im trendNice ich werde ich ich kriege gov lampen und da werde ich zum huge tiktokerDarfst du schleich werden für ein led projekt machen ja auf gehts gucken wir uns dann gleich auf github an oder die projektseite schick einfachSo es werden neue produkte vorgestellt sind auf meinem kanal aufmerksam und das research team ist aufmerksam geworden auf mein kanalOk um einen besseren eindruck hinsichtlich unsererProduktpalette gewinnen zu können schauen sie doch folgenden link unter amazon anOk machen wirHalloPass auf jetzt kommt irgendwieWeiß nicht ob ich das haben will ehrlich gesagt das sieht so so china klaudisch aus ja12 volt led strips das heißt die gehen auch relativ weitOhne dass sie an farbe ich halt quasi verlieren aberAnsonsten erkenne ich da jetzt nicht soWir arbeiten moment was wir arbeiten mit führenden calls in verschiedenen bereichen zusammen hat ihr mal eine ahnung was das für eine abkürzung istDas ist die視Jetzt muss ich nicht nur it block kan cettejackoSehe ich das richtig?Key Opinion LeaderAlso es ist quasi ein InfluencerUnd man ist schon zu coolDas mehr Influencer zu nennenAlles klarSchau mal auf BanggoodDie haben die auchJa bestimmtBanggood hat allesDie bangen haltRichtigWas sind das für Doktorspielchen hier?AhAlso gibt's da aber anscheinend nichtDas ist wahrscheinlichDas ist genau das gleicheWas die hier verkaufenUnter irgendeinem eigenen LabelSo was schreibe ich jetztSo was schreibe ich jetztSo was schreibe ich jetztSonst nochOh jetzt haben sie ein Video gepostetWo einer für sie Werbung gemachtHat okayOkay da gucken wir mal reinNee das gucken wir nichtWir machen nicht noch mehr Werbung kostenlosWir okayWir sind überzeugtDass unsere ProdukteWir sind überzeugt dass unser produkt ihnen und ihren fans gefällt chat meint ihr das könnt euch gefallenWir freuen uns darauf mit ihnen tolle inhalte zu erstellen falls sie an einer kooperation interessiert sind schreiben sie mir bitte undUm weitere pläne für eine zusammenarbeit zu besprechenJa ich mein fragen kostet ja nix kann ich ja da malNopas ich mache ganz ehrlich ich mach einfach sehr laut ich mach 30 mach 30 ich mach das wieder ich mach das wieder bauer jetzt wieder auaIch mache einfach diese 15 20 sekundenWollen sie wahrscheinlich sein jaIch mach dann einfach 15 20 sekunden werbung rein dieses video ist gesponsert beiBei guvi irgendwie bla bla bla led strips bla bla bla ganz tolle super neue technik bla bla bla fertig alles gut it's moneySo irgendjemand von werbung für sein led projekt machenJonas dankeschön für den zap habe ich nicht über das habe ich habe ich habe ich nicht gesehen aber massive IQs boost wieder für den chatSo wo gibt's wo gibt's werbung für das led projekt hier?exquisiteself-made ambi light für den raspberry pi ok coolNGDas ist quasi das gab es schon mal oder wieUnd jetzt ist jetzt im next next genDas heißt das heißt es läuft jetzt auch auf der ps5Okay, leute ich muss aufhören so super lustige witte zu machen ich weiß aber huge guck mal hier ein kar sterne das ist ja schon ziemlich erfolgreichZeigst mal herSchönes web interfaceSchönes web interface auf was was braucht man dafür also respire ganz vergessenNG ich hoffe nicht dass das ng für angela steht oderWeil bei angela heißt ja alles ngIch habe bis heute nicht verstanden warumOkay cool das heißt wir funktionieren das weißt du was tp modding weißt du wasDas probieren wir mal aus irgendwann im streamWas braucht man da alles dafürMuss man da irgendwie per hdmi sachen abgreifen oder per kamera oder oder wie funktioniert das von der idee herWeil irgendwie muss es ja an die bild infos kommenPer usb krabber ok du schließt quasi in usb capture device an und du dann wärtestOh das war bestimmt nicht einfach ich stelle mir das kompliziert vor aus dem hdmi stream irgendwas auszulesenAber das funktioniert nicht mit hdcp dannWeil ich gucke beispielsweise auf dem fernseh drüben relativ viel amazon und es wird wahrscheinlich mit hdcp nicht funktionierenDenke ich malOder hast du kodi auf dem pay nee gar nichtIch habe einen nvidia schild und einen otroid hc2 so ein dingMit einer festplatte für tv geschichten zum für fernsehaufnahmen so ein teil hierAch man kann sich ernsthaft man kann sich hdcp lizenzen kaufen ich dachte für hdcp muss man quasiJahrzehntelange lobby arbeit leisten dass das das bekommtJa, ju ist aber auf jeden Fall nicht so schlecht wie hdcpAber ich glaube das ist ein bisschen ein bisschen ein bisschen ein bisschen ein bisschen ein bisschen ein bisschenJahrzehntelange lobby arbeit leisten dass das das bekommt ja ju ist aber auch philips dahinterDie haben damit kein problem die sind nicht in den ich nenne es mal in die entwickler auf githubAlternativ kann man auch irgendwelche hdcp entferner dazwischen schalten die man ja eigentlich gar nicht haben darfAlso ich habe also ich ich kann per hdmi gucken per hdcp und das funktioniert ich habe ja so ein ding hier als es das noch gabDreamlite tv nicht dreamscreen habe ich drüben bei mir am am fernseh und das funktioniert mit hdmi leider nur bis bis 1080pDanach mag es nicht da stimmen die farben nichtAmbilite mit kodi ist easy ja aber wie gesagt du kriegst den kodi nicht so einfach einfach die videos aus beispielsweise der amazon app reinDas funktioniert nicht das muss auf tiefere ebene passieren die farben sind wegen hdr nicht wegen 4kDas kann tatsächlich sein ja aber ich habe kein 4k dreamscreen also der hat probleme mit mit höheren auflösungenIch glaube ich habe sogar hdr ausgeschaltet zum ausprobierenAber zumindest das ding ist nice das kann das halt auch mit hdr hdcp leider gibt es das nicht mehr die sind pleite gegangen aber es gibt noch ein paar andere sachenAber letztendlich wurscht das ist aber eine gute idee das kann man mal ausprobierenDas kann man mal ausprobierenDas funktioniert auf dem shield tv nicht richtig du brauchst du musst die offizielle amazon app aufmachen dass es gescheit funktioniertAnsonsten klar du kannst es noch über den browser machen aber das ist dann auch mehr also ich bin mittlerweile weggekommen davon dass ich überall irgendwie custom lösungen bastelnSo leute also wir haben jetzt gelernt ich bin ein influencer ist out ich bin jetzt auch zum col aufgestiegenIch bin jetzt quasi influencer und key opinion leader und deswegen mache ich demnächst led sellout easy perfekt mache ich einfach malSo und jetzt kommen wir mal zur eigentlichen sache die wir die ganze zeit schon machen wollenGenau nämlich gucken wie ich von meinem sensor batterien status auslesen kannJa twingo geht mir ähnlich ich will einfach sachen die gut funktionierenIch mache es mittlerweile so wenn es was fertiges gibt was so zum größten teil passt dann nehme ich das aber halt auch nur wenn da sonst nichts dagegen sprichtAlso ich nehme zum beispiel nichts mit china cloud dann flashe ich das aber am liebsten mit custom firmen aber halt mit irgendwas fertiges was ich nicht mehr selbst programmieren mussFür so sachen wie das hier erstens habe ich da immer noch spaß dran und außerdem gibt es da nichts fertiges was das so macht wie ich das haben willWarum juckt es netflix welches gerät ich zum stream verwendeJa warum gibt es mittlerweile eine allianz zwischen providers und content anbietern um sachen zu blocken wegen stonks und geldAlso ich wollte mir nämlich mal angucken wie der typ hier das macht also es gibt irgendwelche ids so die id für die batterie brauchen wirDer wifi connect um mqtt juckt mich net disconnect mqtt juckt mich auch net flora klein okay hier können es langsam interessant werdenOkay okay boah ach du scheiße das ist ja mit ach moment ne hier liest ihr die sachen aus die schon ausgelesen habe das ist egalBattery characteristics ist vielleicht noch interessant okay process flora service process flora device okay okay es istOkay process flora device address device mecha dress read battery das heißt hier geht es losAlso wir brauchen eine adresse und wir brauchen eine mech die adresse habe ich die adresse habe ich das ist nämlich das daWobei moment ich kann einfach den kompletten sensor übergeben flora sensor sensor weil den sensor haben wir ja da den haben wir hier oben angelegtSo das rufen wir jetzt einfach für jeden sensor auf alle jede sekunde so update battery level und zwar für den sensor muss man das jetzt auch mitUnd übergeben weil es ist ja immer noch 10 plus plus das ist nicht zwangsläufig logisch ja wenn die telekom das auf twitter antwortet ist das natürlich die verlässlichsteQuelle von jemanden dabei ist das ist wie wenn du mich fragst max wer macht die besten videos auf youtube da bin ich sicherlich auch äußerst objektiv ichIch meine ich bin am wenigsten so fair und würde sagen möchte ich selbst nennen weil ich das mir zu doof vorkomme aberOkay also hier kriegen wir jetzt den sensor wie müssen wir jetzt anfangen wir brauchen erst mal wie geht es denn jetzt aus processing die weiß all die das ist debug geblubber das braucht man nicht get flora kleint okay mit get flora kleint geht es los le device create kleintOkay das ist das einzige was er hier drin macht das kriege ich auch hin wobei wir können einfach auto nehmen nennen wir das mal kleint gibt er nicht viele möglichkeitenSo create kleint exzellent so wie geht es weiter wenn kleint not connect es muss kleint connect machen okay kleint connect und wohinMax dps der channel den hat deshalb ja das mit max dps war ziemlich doof von mir auf youtube ich wollte ja ich wollte ja overwatch videos machen und ich habe einen neuen channel erstellt für overwatch videos genau dann wo ich aufgehört habe mit overwatch was richtig hängen geblieben istRichtig sixhead jaJa wahrscheinlich die meisten wobei meine frage macht ich macht es ja öfters mal wer ist von youtube an dem müssen wir umgedreht fragen wer kommt nicht von youtube wer kommt nicht von youtube wir haben ich weiß dass wir mittlerweile schon einige haben die es auch nur über twitch gefunden haben einsDie eine oder andere gibt es das weiß ich finde ich niceNe brauche ich keine umfrage für twitch und wie auf twitch wahrscheinlich über irgendwelche irgendwelche empfehlung unten links ne du kommst von pornhub ja bestimmt von von tanzverbots channel wobei der ist ja gelöscht tanzverbot gibt es ja nicht mehr auf pornhubEr ist ja oder zumindest die videos gibt es ja nicht mehr wer übrigens nicht wusste dass er den pornhub channel hat leute vergesst einfach was ich gesagt habe ihr müsst jetzt nicht nachgucken das ist eigentlich nicht unbedingt das was man so sehen willAber ansonsten zur allgemeinen bildung trägt es ja auch beine man muss ja muss ja bescheid wissenAuf dem er regelmäßig oder regelmäßig halbwegs regelmäßig porno reviews gemacht hat auf pornhub war ein bisschen merkwürdiges format da saß er quasi halb naggisch mit dem handtuch um und hat siniert über irgendwelche aktuellen pornsachenIch weiß auch gar nicht woher warum ich das überhaupt weiß und warum ich das überhaupt geguckt habe ich egal egalIch weiß auch nicht wieso guckt man sowas ich weiß es auch nicht ich weiß es auch nicht ich habe das zumindest stückchenweise angeschaut tanzverbotSo aber zur eigentlichen wichtigen sache zurück was muss man jetzt mal muss gucken ob das ganze heute ich muss ich muss den da krieg ich krieg ich werde halb blind wenn ich wenn ich hier umschalte zwischen editor und browser das blendet übelstOk get flora klein brauchen was haben wir gemacht und jetzt muss man checken ob das ganze connected ist das ist ziemlich komplizierter check ums auszuprobieren glaube ichDie groovy elektrik zwitschbein dankeschön für sechs monate subscription massive sub huge subscribers hier wieder warum sind wir noch im just chatting warum nicht passt doch just chatting ist kategorie allesUnd ich habe das gefühl just chatting finden prinzipiell mehr leute als science und technologySo aber jetzt machen wir ein bisschen science und technology wo sind wir stehen geblieben muss das endlich mal was machen also wir gucken jetzt ob das ding connected ist also kann man da jetzt sowas machen wenn das gleich null ist dann was ist eigentlich der unterschied mal die 10 plus plus pros was ist der unterschied zwischen gleich gleich null und gleich gleich null pointerUnd wenn es das gleiche ist warum gibt es da zwei verschiedene dinger keiner okay warum gibt es dann zwei dingerDas eine ist ein def das andere ist ein keyword aha okay ach moment das ist ein bool if not connected dann machen wir mal eine ausgabe print con failedFunktion ist jetzt dann return zackIf null gleich gleich null das funktioniert was das geht wahrscheinlichOkay dann aber uns connected okay was macht er als nächstesGanz schön umständlich get flora service macht er dann im prinzip genau der gleiche krempel wie er vorher auch schon gemacht hat also quasiclient get service ach service uid brauchen wir jetzt also sowas hier quasi jetzt können wir mal 10 plus plus sachen verwenden dass er das nur einmal macht so und wahrscheinlich brauchen wir die battery dann später auch noch das triggert mich schon wieder dass das anders geschrieben istDer beste z plus plus ist nicht logisch zu hinterfragen ja das ist richtigWas nicht if not connected if connecting failed wieso ist doch richtig wenn wenn connect nicht geklappt hat dann connect failed oder ist es oder ist es eher ein ein ein grammatik hinweisAlso ich meine if not connected ist eigentlich trifft ziemlich gut was das hier macht so get service das gibt einen pointer zurück okay auto serviceSo und dann checken wir jetzt wenn das service null ist null dann schreiben wir service failed mein irgendwas muss ich hinschreiben service failed returnUnd jetzt ist die frage gibt so was wie disconnect disabo da machen wir das nämlich auch noch davor wisst ihr was jetzt cool wäreIrgendwas wo man sicherstellen könnte so einen try catch finally oder defer oder sowas aus go wo man sicherstellen könnte oder vielleicht gibt es ja sowas mit z plus plus und ich kenne es nichtWo ich sicherstellen könnte dass er immer das hier macht bevor er aus der Methode rausgeht quasi so einen so einen finally block gibt sowasNee oder? Wahrscheinlich gibt sowas nicht das ist zu zu advanced dafürOkay get service da sind wir stehen geblieben blabla something wrong ja blabla wunderbar vielleicht vielleicht schreiben wir noch hin vielleicht schreiben wir noch dass ich das besser debatten kannKeine connection okay und hier schreiben wir hin service okay wenn du wiss ob der kram dann auch getan hat so was macht er denn jetzt als nächstesprocess flora service force flora service data mode aber nicht oder ich weiß nicht was es macht aber wir machen jetzt wir machen jetzt massive go toDas war jetzt ich wollte schon immer ich habe noch nie go to in z plus plus verwendet allein schon weil das das pains champion ist was man angeblich machen kann das war jetztWir bauen das jetzt mit go to einfach nur stop doch wir waren jetzt go toAber das sieht man schon mal wieder das sieht man schon mal wieder das go to scheiße ist weil ich kann jetzt nicht sowas machen dann gebe ich am ende nehme ich immer connection failed aus und das will ich gar nichtDa kann ich wieder da kann ich wieder keine ordentliche fehlermeldung ausgeben weil wenn schon hätte ich sowas machen wollenJa ne komm scheiß drauf wir lassen es bleiben Fehler gibt es nicht das ist genauso wie das du weißt ja auch guter code dokumentiert sich selbstOkay also das im service hat funktioniert was muss man jetzt als nächstes machen process flora service read battery characteristics müssen wir jetzt machenRead battery characteristics wie funktioniert es jetzt flora service get characteristics und dann die id form von der batterie also hier ist das service okay das service heißt einfach nur serviceUnd jetzt ist batterie juju id nachdem ich nicht weiß was ich da mache nenne ich es einfach mal so ich habe keine ahnung was das eigentlich genau macht aberSo und jetzt muss ich wahrscheinlich wieder gucken ob das null ist ne genau im prinzip der gleiche schmodder wie hier oben nur nicht dafür sondern dafürUnd jetzt machen wir irgendwie char failed was auch immerHauptsache char wurde so schön doppeldeutig dass keiner versteht was gemeint istSo und jetztOh jetzt jetzt kommt jetzt kommt magic value i read value read value okay okay read value value string string value alles klarAlsoMacht er da irgendwas read valueDer redet einfach und dann holt er sich die bytes davon okayNennen wir es mal irgendwie battery value hoffe mal dass das funktioniert ich hab ich hab da meine zweifel dass das jetzt gleich beim uploaden irgendwas irgendwas macht so so battery value und jetzt und jetzt aus irgendwelchen gründen was okay das brauche ich net das brauche ich nicht das brauche ich auchOkay moment was was was was was was was battery value ist im prinzip bei mir das da ach und jetzt kommt der intBattery level wir gehen hier wir gehen die ordentlichen variable namen aus ist null und und für was ist der crap da unten einfach zum printen ja gut das brauche ich nichtVielleicht sollte ich noch checken ob das ob da die länge wir machen das doch anders machen das mal soOb da die länge größer null ist oder gleich null also wenn hier die längeGleich null ist dannRead failed danach habe ich das battery level und jetzt kann ich sagen sensor battery level oder battery gleich battery levelSo chat wir brauchen eine abstimmung geht es jetzt nachdem ich hoch lade oder nichtFalls ein mod da ist eine abstimmung machen wir machen mal eine abstimmung ob das funktioniert oder wir können wetter machen ja wir können channel point predictionWir können channel point wir machen channel point predictionChannel point predictionMods sind glaube alle wieder afk mod check mod checkOh ne es geht es geht tatsächlichAm ende machen wir noch einen disconnect das ist dann auchAchso und ich brauche noch sensor last battery checkSp get timeSo also predictionWer predictet ja wasFunktioniert Fragezeichen TjaMal gucken was da rauskommt jetzt bin ich gespanntDie ist wegIch sehe nicht was da rausgekommen istWas ist denn rausgekommenIst noch da also ich sehe es bei mir nicht 7 und 5 prozent neinKurze Idee von dem Projekt also mal ganz kurz ich habe davon ein sensor und davon habe ich ein paarUnd die sind eigentlich dafür da um Blumentöpfe abzufragen Bodenfeuchtigkeit Temperatur Licht und ich habe mir gedacht wir machen das so ich leg das Ding in KühlschrankUnd ich erkenne anhand des Lichtsensors ob ich die Tür aufgelassen habe und an der Temperatur ob ich ob ich vielleicht Stromausfall habe oder irgendwas mit dem Kühlschrank nicht stimmtWeil mein Kühlschrank macht teilweise merkwürdige Geräusche und muss manchmal neu gestartet werden und ich hätte gerne Notification wenn das Ding am abtauen istUnd nachdem das ganze Ding Bluetooth wireless istSo ok also ja 43 prozent nein 5 prozentDa fehlt was 25 50 wahrscheinlichMein Kühlschrank brauchen eine Reboot ja ok ich mache jetzt nicht weiter wir uploaden jetzt SerialWir uploaden jetzt und gucken ob das funktioniert Moment erst ruf ich das überhaupt aufJa okAlso ob das hier funktioniertFalls ich irgendwie vergessen habe die Funktion aufzurufen oder so dann zählt das weder alles hat funktioniert hat nicht funktioniert dann fix ich das und dann gucken ob es funktioniert hatSo alsoInvalid Pair AddressWarumOk es funktioniert nichtEs funktioniert nichtWarum ok ok warum funktioniert es nichtInvalid Pair Address 0WasWarum ist die Adresse 0AddressWarum ist die Adresse 0HäHier euch depp hier hätte ich die Adresse übergeben müssen guck mal alles gebastelt und der Fehler sind die ersten ZeileOk SensorAddress ok nochmal ausprobierenBy the way warum kann ich überhaupt einen Client erzeugen ohne eine Adresse anzugeben warum ist das denn überhaupt erlaubtEinmal beliebt der GripUnd jetztConnection ok Service okConnection failedService okAlready existsConnection already exists wieso ich klausel das doch immerOk ich glaube ich weiß woran das liegt dass es nicht funktioniertOkCrashIch glaube ich weiß woran das liegtIch darf nicht ich vermute mal ich vermute mal ich darf nichtScannen und michGleichzeitig connectenIch glaube das geht schlicht und ergreifend in die HoseOk machen wir das in it hierUnd den scan hier unten drunterScan gut dann scanen wir auchWir scanen für 5 SekundenWir scanen alleWas weiß ich wir scanen alle 200 MillisekundenAlso wir scanen im Intervall für alle 200 Millisekunden 100 Millisekunden lang ok passt UploadUnd das machen wir dann nach einer Sekunde wieder okGibt es nicht immer einen Parameterlosen Constructor in C++Nee nicht zwangsläufigIch kann meinen Constructor private machen da gibt es keinenOkHat der Upload gerade nicht funktioniertWarum geht das jetzt nichtOh MenschWahrscheinlich ist es wieder was ganz SimplesUnd warum crashed er immer erstmal nachdem ich mich neu connected habeEr weiß es wirklich nichtMachst du noch wasResetWo ist das jetztAh jetzt okConnection ok service ok und jetzt hängt erWhat the fuckOkPrint also scan startIch muss sehen was da vor sich geht scan endIch muss ja ich muss ja wissen was was was los istKeine facecam null facecam ja ich weiß ich bin bekannt für meine streams mit facecam aber heute habe ich ausgelassenscan start scan end scan startHier ok ok der sagt immer ok und dann was passiert hierOk vielleicht funktioniert ja sogar alles ich müsste noch read ok oder sowas sagenRead ok und jetzt muss ich noch das Batterie das Batterie Level ausgebenUploadOk stimmt ich gebe ja gar nichts aus kein Wunder dass ich nichts seheIst ja eigentlich logisch wenn man nichts ausgibt kann man auch nichts sehenHuge SchweißheitOk Temperatur Temperatur scan scan scan scan endHier Batterie 99 ok es ist gedroppt letztes malAch nee das ich hab mich selbst gebadet die Meldung die wir heute Morgen reingeschrieben habenBatterie 100% die war ja hardcoded 100% die Batterie war ja die richtigen Batteriewert habe ich ja nie auslesenAber was ich jetzt gerade so richtig realisiere ist das auslesen funktioniert Leute99% mir ist es sogar lieber wenn da 99% steht dann weiß ich nämlich dass das prinzipiell funktioniertWas hältst du von Low Code was ist denn Low CodeIch kenne nur Big Brain CodeOk es funktioniert wir kriegen den BatteriewertAllerdings ich muss aufpassen wenn ich das jetzt noch eine Weile mache ist die BatterieWas hat der hier überhaupt für Schmerzen wenn ich das jetzt noch eine Weile mache ist die Batterie leerMeine Stimme hat sich nur geändert das liegt wahrscheinlich daranDass ich schon so alt war als ich mit YouTube angefangen habeDass ich mit meiner Stimme nichts mehr großartig ändertZumal ich ja mehr oder weniger die gleiche Hardware habe immer nochSo scan gab es da noch so wie reset oder sowasDe-init gab es da ne gab es auch nicht was gibt es denn daErase Erase klingt gut macht das macht EraseDelete Per Device ne ne aber Clear irgendwas mit Clear habe ich gesehen Clear Results passtEin bisschen Speicher ein bisschen Speicher freigebenWir geben hier oben mal am Anfang der Schleife ausWie viel Speicher wir frei haben ich will wissen wie viel das belegtWeil ich weiß dass dieser ganzeIch weiß dass dieser ganze Kram doch ziemlich viel Speicher frisstFree hier schauen wir malGute Frage Wer sind da immer noch die Top 3 Host in Deutschland von Preis LeistungsverhältnissenWas hosten für was fertige Services VMS HardwareCo location wer host also was willst du gehostet habenVMS wahrscheinlichMinecraft Server VMS ja also eine VMSDann auf jeden Fall schon mal nicht Amazon nicht Google und nichtAzure Azure also und auch nicht AzureGanz ehrlichIch würde sagen am einfachsten ist es tatsächlich immer nochPricing von der Hetzner Cloud was aber auch echt billig istAlso neben der Geschichte istWenn du was ganz kleines brauchst ist das von eins und einsWeil es ist eine richtig echte also eine richtig echte kompletteVoll virtualisierte VMS keine komischenKeine komischen ContainerUnd die haben und die haben ein Dollar ServerWenn ich das jetzt finde allerdings für 12 Monate ein Dollar im Monat kann man aberMal machenPricingHaben die das nicht mehrAch nee war das ein Euro war das ein EuroAlso ich habe hier nämlich selbst einen Euro Server und das passtAlso ich habe zu 99 Prozent meine Sachen bei HetznerUnd eine Kiste habe ich bei eins und eins stehenDas schöne bei Hetzner ist es ist was auf der letzten Seite standWoGebetet ihr mich ich sehe nur zwei DollarDer Chat gebetet michHuge, huge gebetIch sehs nichtGebetetGanz obenHör aufIch glaube ich glaube ich nix mehr ChatEin Euro im Monat genau den meine ich da habe ich einen davonDas schöne aber an der Hetzner an der Hetzner Preis an der Hetzner Cloud Geschichte istDas ist minütlich also sprich hier hier musste wirklich 12 Monate bezahlenHier kannst duQuasi eine fette Kiste mietenWir hatten uns mal hier Dedicated CPU wir hatten uns für Open Street Maps zeugs mal hier sowasGemietet glaube eins von denen ich glaube die fette Kiste haben wir die fetteste Kiste haben wir unsGemietetJa Google weiß Bescheid jaUnd die fetteste Kiste haben wir uns mal gemietet allerdings nur für glaube ich zwei StundenUnd dementsprechend haben wir davon nur ein paar Euro also so gut wie nichts bezahlt eigentlichHier haben wir ein Euro bezahlt am Ende nach zwei StundenDigital auch schon ist auch nice aber digital auch schon ist doppelt so teuerOkAlso klappt der Kram jetzt hier genau Batterie BatterieWir scannen fünf SekundenUnd jetzt Batterie Status auf Batterie StatusSag mal hängt das scanLeuteHängt das DingAber aber der soll der soll aufhören zu scannen nach fünf Sekunden der soll das gar nicht immerWeiter machen mit scanDer soll aufhören zu scannenWarum scannt der weiterDurationDer soll fünf Sekunden scannen und dann gefälligst aufhörenDas ist in Sekunden und das ist in Millisekunden frag mich nicht warum man so bescheuerte Idee gekommen istDas in Millisekunden zu machen das sind Sekunden aber das ist soGuck mal der hört nicht mehr auf zu scannUnd resettenScan start ja passtEnd ja wunderbarOk Batterie scan start und jetzt scan end scan endAlso prinzipiell funktioniert das schon vielleicht sollte ich vielleicht sollte ich komm wir machen einfach malWir machen einfach mal ein DelayNein ihr wisst ihr was wir machen wir machen ein Delay vor jedem Abfragen falls ich mehr als ein Sensor habe spackt das sonst garantiert rumSo ok sehr niceJetzt funktioniert das gut also jetzt krieg ich die Werte rein inklusive Batterie das ist doch äußerst pockIch krieg Licht ich krieg Temperatur und ich krieg die Batterie und das ganze quasi dauerhaftSo was ich jetzt noch einbauen muss ist ich will ja nicht jedes mal abfragen wenn ich hier reingehe ich will den SensorIch will die Batterie alle fünf Stunden abfragen das heißtIch muss jetzt erstmal überprüfen ob ich den Sensor nicht schon gecheckt habe alsoNennen wir es mal irgendwie Millisekunden SensorLastBatterie checkAber das sind das sind das sind Microseconds jetzt guckt hier das sind Microseconds wie viel ist dann eine Stunde in MicrosecondsAh ja alles klarOk 5Ah ja alles klar alles klar ok äußerst äußerst selbst erklären also sprich wennMacht das doch lieber als Wert in dem Sensor Objekt was habe ich doch Sensor Last CheckAlso sprich wenn die aktuelle Zeit minus die letzte Checkzeit größer als das da sind 5 StundenNe kleiner kleiner dann hören wir aufUnd wir müssen initial einmalEinmal initial müssten wir sagen wenn das daUngleich Null ist und das hierGibt das halbwegs SinnSo und jetzt sollt ihr nämlich den Batteriecheck nur einmalig machenDu hast mich auf jeden Fall zum Programmieren animiert hast du damals Programmieren der Berufsschule in E-TechnikHaben wir jetzt ein Arduino Anfänger Kit bestellt ja das ist nice wobei ich ja immer noch die ESP empfehlen würdeEinfach weil du damit mehr machen kannst und das finde ich die beste Radwehr ist die Arduino sind aber halt robusterAlso gegenüber Umwelt Einflüssen den kannst du fast vom Balkon schmeißen da geht immer nochBei der IF Anweisung fehlt die KlammerWenn es nur eine Zeile ist darf man die Klammer weglassen aber ich gebe zu es sieht nicht gut lesbar ausBei einer Zeile darf man die Klammer weglassenDu siehst es zum Beispiel daran wenn ich die Einrückung automatisch machen lasseVom Formatier Tool im Editor und drücke jetzt speichern dann rückt das automatisch hier unter das IF ein dass man sieht dass das dazugehörtSo also es scheint zu funktionierenAber ein bisschen guck mal Leute das buggt seht ihr das?Der startet den Scan und er hört dann einfach nicht auf zu scannenEr sollte doch eigentlich nach 5 Sekunden aufhören zu scannen warum macht er das denn nicht?Muss ich da vielleicht ein bisschen scheppere Werte rein machen keine Ahnung213 und 217 und irgendwie 43 oder soIch meine das würde ich jetzt eigentlich erwarten dass der automatisch stoppt wenn das fertig istUnd hier kann es auch kein Multithreading Problem sein weil das geht streng nacheinander allesDas wäre ziemlich doofer Bug wenn der im Endlos Scan hängen bleibt sollte er hoffentlich nichtWäre ziemlich SackAchso BillyStart scanWas genau macht der Scan Part das sind die Sekunden wie lang der scannen sollStart scanning and blocking until the scan has been finishedSo genau check ich die Werte aber auch nichtEine Finish Methode nach dem Start bringt ja nichts die wird ja gar nicht ausgeführt der blockt ja hier bis es vorbei istKifrin 17 Monate exquisite high IQ Subscription hier 17 Monate ist eindeutig schonExzellent Dankeschön für den SubSo jetzt okay wir gehen einfach mal davon aus dass es jetzt funktioniertOkay also der hat auch die Batterie abgefragt wunderbarIrgendwo hierBatterie 99 okay also das funktioniert der erkennt das Gerät und fragt einmalig den Batteriestatus ab und danach 5 Stunden wieder wunderbar exzellent so lassen wir dasJetzt kommt ja der scanend ja das er kam vorher auch nur dass er irgendwie zwischendrin dann hängen geblieben ist und nicht den scan nicht beendet hatWas auch immer da los istOkay das funktioniert jetzt schon mal gut das heißt wir haben jetzt alle Werte die wir brauchenMan muss halt eine Weile scannen dass das funktioniertSoJetztOkay das heißt wir kriegen jetzt die Werte geschickt das passt eigentlich alles jetzt müsste ich den Kram irgendwie zumÜbers WLAN schickenWo habe ich meinen wo habe ich meinen access point hier access point kleinen test access pointDa müssen wir so mal gucken wie man die die credentials da rein bekommen LeuteIch muss ich muss euch dann irgendwie erst mal wieder erst mal wieder umschaltenObwohl ich kann mal kurz guckenDocuments platformer all projects was haben wir hierCP der cool jam unter Watt jam der Watt jam war das letzte was wir gemacht haben source secrets Punkt HWir kopieren das jetzt einfachWir kopieren das jetzt einfach in den cool ChampCool ChampSource secretsUnd da muss ich euch nicht nicht nicht nicht umschalten und ich habe die Sachen hier drin stehenExzellentOkay also dann machen wir mal WLAN anAlso includeWi-Fi Punkt HBy the way ich mache das jetzt alles alles mal von HandIch habe mittlerweile schon eine über 1000 Zeilen lange Helper Library die ich mir selbst zusammengestrickt habe für so ZeugWeil C++ so pains Champ istUnter anderem für er guckt nach ob die WLAN Verbindung noch steht und verbindet sich im Hintergrund neu und sowasAber wir machen das jetzt mal von HandGut das heißt den Kram kann ich schon immer alles minimierenBrauchen wir nicht mehrBrauchen wir nicht mehr funktioniertWir können eigentlich könnten wir das noch mal auslagern wollte scanEin Bit MassiveEin BitAber das mal hier rein dass es ein bisschen übersichtlicher istScanWarum denn C++ Man kann das nicht mit was anderem gescheit programmieren also du hast noch zwei weitere MöglichkeitenNe bei C++ Du kannst Micro-Python verwendenDa hast du aber auch andere ProblemeDa gibt es nicht so schöne viele Libraries für alles was man brauchtAußerdem braucht es mehr Speicher undIst auch letztendlich nicht der Weisheit letzter SchlussGerade dadurch dass dir viele Libraries für Geräte fehlenAußerdem braucht es deutlich mehr RAMZum Beispiel wenn du einen Web-Server machst kriegst du vielleicht 2-3 Requests hinGegen du glaube auf dem ESP32 mit C++ um dieBis zu 12-13 Request oder so hinbekommst sogar theoretischIch glaube sogar theoretisch sogar 5 gleichzeitig Request mit HTTPSJa das Nano Framework ist leider nicht so schönDas habe ich ganz vergessenDa fehlt aber auch ganz schön viel im Nano Framework und du hast die gleiche Treiber ProblematikSo die nächste Variante ist RustRust gibt es Experimental und da hast du auch die Treiber ProblemeLeider gibt es wirklich sinnvoll nur die Möglichkeit das in C++ zu programmierenWas mir halt auch auf den Sack gehtOh ist der Preis-Champ wieder kaputt?Ne geht noch alles gutAlter die PreiseSoll ich an?Echt richtig painstampigOkay scan also wir müssen uns jetzt connectenÜber WLANDas heißt wir machen jetzt SetupUnd im Setup müssen wir jetzt WIFI beginnenUnd irgendwo habe ich hier dieWIFISSIDOh Mist Leute ich habe vergessen wie der Kram heißtIch muss euch doch mal, ich muss euch doch mal ausschaltenWobei das, das können wir, ne Leute das können wir im Wattchamp nachguckenDas können wir im Wattchamp nachgucken wie der ganze Kram heißtWattchampNicht Secrets aufmachen, MainWIFIWIFI reconnectWIFI SSIDOkay primaUnd ich muss das noch einbinden jetzt, jetzt weiß ich aber ob es jetzt funktioniertIch muss noch includeWIFISecretOkaySo und jetzt können wir uns verbindenWIFI SSIDUnd WIFI PasswortNee PWOh ich hab Glück dass er das nicht anzeigtHugeSo also von der Idee her sollte er sich jetzt mit dem WLAN verbindenWir checken das ganze noch mal weilWir gucken einfach ob er mit dem WLAN verbunden ist, solange er nicht connected istGeben wir einfach Punkte ausSerial PrintPrint, BrindelnConnectedToUnd da schreiben wir jetztDie IP dahinter einfachSchreibt einfach so IPSo und dann können wir noch die IP vom WLANIPOkay wunderbarSo und das sollte jetzt eigentlich funktionierenDer sollte jetzt sich verbinden mit dem WLANUnd mir die IP ausspucken, dass ich ausprobieren kannOb ich die Daten zu meiner Home Assistant Geschichte geschickt kriegeIP League, oh neinOMFGDu hast echt über den Preis Champ eine PS5 gefunden, ernsthaft?Ich hab da glaube ich noch nie eine PS5 wirklich mal live gesehenAch so eine hier wahrscheinlichGabs nichtAch Warehouse Deal, okayBusy, busy, busy, Delay, Delay brauchen wir noch100SerialPrintConnecting, Wi-FiSoSo und jetzt soll er sich eigentlich zum WLAN verbindenAch Alter ich bin ja auch blödEr soll sich nicht zum WLAN verbinden, wie soll er sich zum WLAN verbindenIch hab den Access Point noch gar nicht dranKann ich gehenExcellentOkay schauen wir mal zu ob er sich live verbindet zumGucken, dass ich nix runter schmeiß, warte mal ich leg das mal kurz neben dranSo Access Point verbindenExcellentTabelTauschen USB-CardAccess PointAccess Point bootedAccess Point booted und es sollte sich jetzt eigentlich gleichOffisch mal collectenAlso Access Point booted immer nochJetzt blinkt erUnd blinkt und hat NetzwerkverbindungenBäm hat funktioniertOkayAlso ist verbundenExquisiteOkay äußerst nice um nicht zu sagenOkay wir sind verbunden über WLANUnd wir fragen Bluetooth-Gedöns abEs gibt übrigens Probleme wenn man WLAN und Bluetooth gleichzeitig verwendetUnd das liegt darin, dass Bluetooth und WLAN die gleiche Antenne verwenden in dem GerätAlso sprich man kann nicht WLAN und Bluetooth wirklich exakt gleichzeitig übertragenDas heißt man muss immer ein paar Delays einbauenDass die sich nicht zu sehr in die Quere kommenSonst packts rumKein 5 Gigahertz? NeeWie kommst du drauf?Oder war das eine allgemeine Frage mit dem 5 Gigahertz?Nee das Ding hat keinen 5 GigahertzDas hat keinen 5 Gigahertz und das neue auch nichtEs gibt jetzt nämlich einen ESP32S3Die Benamung von denen ist ein bisschen failÄhmNee es sind nicht zwei Antennen, es ist eine AntenneDas sagen die auch oft, das sagen die auchDass sie sich die gleiche Antenne teilenEs wird Zeit, dass die Chinesen mal 5 Gigahertz machenAchso, ja gut das kann seinAber ich hab letztens von denen gelesen, die sagenEs gibt einen ESP32S3, aber der kann auch nur 2,4 GigahertzSo, okAlso jetzt müssen wir gucken, dass wir den Kram per WLANIch hab extra hier meinen Test Home Assistant gestartetÄhWie kriegt man die IP raus von dem Ding?IPAddÄhLessOk, MoreIst euch eigentlich mal unter Linux aufgefallen, dass less das bessere More ist?OkSo, äh, 2139, ok2.13Wait a minuteWie?Ach Moment, über HTTPS, ne das ist ja auch nicht über HTTPS erreichbarÄh, 8123Ah, yesGesamtverbrauch, ok das war unser Test vom letzten MalDas war unser Test vom letzten MalÄh ja, nerf nicht rumManchmal ist weniger mehr, das ist richtigDas war der Test vom letzten Mal, das brauchen wir nichtÄh, wir gucken jetzt, dass wir die Sensorwerte von dem Flora-Sensor eingeliefert bekommenDa muss ich aber nebenbei ein bisschen aus dem anderen Projekt abguckenDas ist die, die, die, die MQTT, Jason Syntax für Home Assistant ist etwaspainst-champig, werdet ihr gleich sehenAber es ist cool gemachtAlso Configuration, IntegrationsMQTT-Broker und so ist alles am StartAlso das ist das, was ich auch sonst verwende für meine Heim-AutomatisierungNur, dass ich hier eine Test-Instanz hab für rum BastelleienAlso, das funktioniert doch alles schon mal wunderbarWir scannen, wir bekommen die Werte hier zurückgeliefert, alles gutDas heißt, wenn ich mir das, diese Sachen jetzt per MQTT schicken lassen willBrauche ich einen MQTT-Kleinwert, das gedachtFällt mir gerade so ein, den müssen wir ja nochSo, alsoHome Assistant GUI schaut aus wie GoogleJa, die stehen voll auf Material DesignGoogle ist ja so, außer Google interne Apps lustigerweiseGoogle selbst steht ja total auf so Material Design GeschichtenAußer die YouTube App und Google Apps selbst, die nehmen es dann nicht so engOkay, Leute, wir haben jetzt zwei VariantenWobei, ich hab's eigentlich vorhin schon beantwortetIch hab gesagt, wir machen das diesmal selbstIch kopiere mir keine Helper-Geschichten undWir machen's von HandAlso, ESP32-MQTT-Publish-ExampleAlso, es gibt zwei Varianten, was man jetzt machen kannMan könnte entweder eine fertige MQTT-Library verwenden von GitHubGibt's beispielsweise AduiXPubsubKönnte man nehmen, aberMan könnte auch das eingebaute nehmenWie viel Flash ist voll mit Plutus, WLAN und MQTT?Tja, aktuell sind wir bei66%Das ist vollkommen in OrdnungDa ist sogar noch Platz für einen Web-InterfaceUm Firmen zu verwenden66%Wohlgemerkt, 66%Ich hab schon dieDie File-System-Partition fürRandom-Dateien schon verkleinertAlso, wir haben 1,9 MBFür den KramSoEspressifDie haben dochWie schreibt man die?EspressifJa, irgendwie soIch brauch BeispieleIch brauch Beispiele, wie der Kram funktioniertMQTTOver TCPJawollDu, du, du, du, duDu, du, du, du, duDu, du, du, duLeuteDas ist doch einfachIch hab keinen Bock das nochmal neu zu programmierenIch nehm einfach wasWas ich schon mal gebaut habWo ist es denn?Ach hierSoTackSoMüsste eins passen jetztSo includeMQTTClientWunderbarPasstAlso es ist wirklich nicht vielDas ist nur so ne Mini-Wrapper, den ich mir gebaut habUm die Native MQTT FunktionalitätVon dem Kram hierWas wird gemacht?Wir lesen den Sensor ausNämlich so einUnd den Sensor den benutze ich nichtFür nen Plumptopf, wie das gedacht istSondern für nen KühlschrankLichtsensor für Tür aufTemperatursensor fürTemperatur, neSoÄhmLeuteWartet mal kurzIch hab was vergessen, es kann sein einer schweckt mussKeck waitLeute ich muss weg", "segments": [{"id": 1, "start": 30.0, "end": 32.42, "text": "Ich glaube aber, dass ich gewonnen habe."}, {"id": 2, "start": 32.42, "end": 34.74, "text": "Und man hat das schon immer schon gemerkt."}, {"id": 3, "start": 34.74, "end": 36.78, "text": "Mein Name ist Toolzion."}, {"id": 4, "start": 36.78, "end": 38.74, "text": "Ich bin ein Tierarmt."}, {"id": 5, "start": 42.32, "end": 44.28, "text": "Und was gibt es an der rechten Seite?"}, {"id": 6, "start": 46.64, "end": 47.64, "text": "viljanуч"}, {"id": 7, "start": 48.98, "end": 49.5, "text": "嗎"}, {"id": 8, "start": 49.86, "end": 50.36, "text": "sus"}, {"id": 9, "start": 50.58, "end": 51.58, "text": "pum"}, {"id": 10, "start": 51.76, "end": 52.3, "text": "ha"}, {"id": 11, "start": 52.64, "end": 53.12, "text": "dus"}, {"id": 12, "start": 53.34, "end": 54.12, "text": "rus"}, {"id": 13, "start": 54.44, "end": 54.94, "text": "suc"}, {"id": 14, "start": 55.16, "end": 55.66, "text": "timer"}, {"id": 15, "start": 56.72, "end": 57.44, "text": "pus"}, {"id": 16, "start": 57.86, "end": 58.84, "text": "pus"}, {"id": 17, "start": 59.0, "end": 59.5, "text": "pus"}, {"id": 18, "start": 59.5, "end": 76.38, "text": "Ich we granting wood for the tree"}, {"id": 19, "start": 106.38, "end": 111.44, "text": "Ja Stripes, kanns bei dem bleiben was drin steht. Wir müssen heute echt mal den Kram ein bisschen weitermachen, sodass er funktioniert."}, {"id": 20, "start": 111.86, "end": 113.86, "text": "Vielleicht machen wir heute auch das mit der Waage."}, {"id": 21, "start": 114.42, "end": 116.42, "text": "Gibt's Gewicht Reveal."}, {"id": 22, "start": 123.54, "end": 129.1, "text": "Ja, check mal ICQ. Das gehört jetzt irgendwelchen Cacomodates, ne? ICQ."}, {"id": 23, "start": 129.1, "end": 139.14, "text": "So, mal kurz die VM anschmeißen. Oder wie die coolen Leute sagen, die VM. Die sagen ja nicht VM, die sagen VM."}, {"id": 24, "start": 141.14, "end": 143.14, "text": "Hast du schon mal Online-Werbung geschaltet?"}, {"id": 25, "start": 149.14, "end": 156.14, "text": "Ich glaub nicht. Mir fällt jetzt zumindest nichts ein, wo ich schon mal Online-Werbung geschaltet hätte."}, {"id": 26, "start": 156.14, "end": 161.14, "text": "Max, du hattest mich gestern mit dem gefakten Ping-Icon."}, {"id": 27, "start": 163.14, "end": 164.14, "text": "Was?"}, {"id": 28, "start": 166.14, "end": 168.14, "text": "Ich weiß überhaupt nicht, was du meinst."}, {"id": 29, "start": 176.14, "end": 179.14, "text": "Is even api tells you? So was gibt's ja."}, {"id": 30, "start": 179.14, "end": 182.14, "text": "Das ist aber ein April-Scherz, oder?"}, {"id": 31, "start": 182.14, "end": 203.14, "text": "Das ist doch ein April-Scherz. Es ist aber ein lustiger April-Scherz. Sollte das kein April-Scherz sein, dann ist das ziemlich dumm."}, {"id": 32, "start": 203.14, "end": 216.14, "text": "Aber die Seite ist genauso gemacht, wie diese ganzen Start-Up-Seiten eben alle aussehen."}, {"id": 33, "start": 224.14, "end": 229.14, "text": "Aber die Idee ist lustig. Wobei ich sagen muss, gestern die meisten Witze waren total langweilig."}, {"id": 34, "start": 229.14, "end": 234.14, "text": "Ja, langweilig. Alle haben sie irgendwie geschrieben, weil es Linus Tech-Tips vollgemacht hat."}, {"id": 35, "start": 235.14, "end": 238.14, "text": "Alle haben sie gesagt, ha ha, ich habe jetzt einen Only-Fan-Account."}, {"id": 36, "start": 239.14, "end": 242.14, "text": "Ha, lul, lul, lul. Das war mega Paynes-Champ-ig."}, {"id": 37, "start": 243.14, "end": 245.14, "text": "Herwing, neun Monate. Dankeschön ins Zapp."}, {"id": 38, "start": 245.14, "end": 255.14, "text": "Hast du das mit der VM auch im Gyra? Klar, habe ich das im Gyra vermerkt."}, {"id": 39, "start": 258.14, "end": 266.14, "text": "Ich mache privat natürlich alles auch nur noch im Gyra. So früh? Naja, heute ist Feiertag. Ich hätte schon viel früher online sein können."}, {"id": 40, "start": 267.14, "end": 269.14, "text": "Aber ich habe... Leute, Chat, Chat, ich muss euch was fragen."}, {"id": 41, "start": 269.14, "end": 277.14, "text": "Ja, von ihr habe ich das auch mitbekommen. Und da habe ich gedacht, ey, das ist jetzt schon die zweite, wo ich das gesehen habe."}, {"id": 42, "start": 277.14, "end": 298.14, "text": "Dann habe ich auf Twitter mal geschaut und der Witz ist total, total alt. Also von den beiden habe ich es auch mitbekommen."}, {"id": 43, "start": 299.14, "end": 305.14, "text": "So, ich muss euch mal was fragen, Chat. Habt ihr eine Ahnung? Also, bei mir im Garten wurde ein Baum gefällt."}, {"id": 44, "start": 305.14, "end": 310.14, "text": "Und ich gebe jetzt nicht einen Baum ein. Ich glaube, ihr wisst alle, wie ein Baum aussieht."}, {"id": 45, "start": 311.14, "end": 318.14, "text": "Aber ein ziemlich großer Baum. So was da in der Richtung. Guck, so in... Ziemlich große Tanne war das."}, {"id": 46, "start": 319.14, "end": 328.14, "text": "Oder ich glaube zumindest eine Tanne. So, und die haben wir gefällt oder haben wir fällen lassen."}, {"id": 47, "start": 328.14, "end": 335.14, "text": "Hast du einen Antrag zum Baumfällen gemacht? Ja, ja, habe ich. Das ist in Deutschland so krass bürokratisch, der ganze Scheiß."}, {"id": 48, "start": 336.14, "end": 343.14, "text": "Aber ja, ich hatte einen Antrag zum Baumfällen und der liegt auch schon ein paar Wochen rum jetzt. Das ist nicht ganz neu."}, {"id": 49, "start": 344.14, "end": 350.14, "text": "Ich habe das Problem. Ich finde, ich weiß nicht nach, was ich suchen muss."}, {"id": 50, "start": 350.14, "end": 359.14, "text": "Ne, für den musste ich keinen Ausgleichsbaum pflanzen, weil der war so groß. Den mussten wir aus Sicherheitsgründen abmachen, dass es nicht beim Nachbar aufs Haus fällt."}, {"id": 51, "start": 360.14, "end": 373.14, "text": "Da musste ich keinen Ausgleich pflanzen. Zumindest, was ich für ein Problem habe, ist, wie heißen Handwerker oder Unternehmen, die sowas entsorgen oder abtransportieren oder was auch immer."}, {"id": 52, "start": 373.14, "end": 379.14, "text": "Was muss man da suchen? Ich finde keinen, der diesen Scheißbaum abholt."}, {"id": 53, "start": 380.14, "end": 383.14, "text": "Sägewerk? Nein, Quatsch, ein Sägewerk macht das doch nicht."}, {"id": 54, "start": 384.14, "end": 391.14, "text": "Grünabfälle-Entsorgung. Ok, zeige ich mal her. Grünabfälle-Entsorgung."}, {"id": 55, "start": 391.14, "end": 400.14, "text": "Kompostieranlage, hallo. Das reicht wahrscheinlich nicht für den Baum."}, {"id": 56, "start": 401.14, "end": 409.14, "text": "Also ich suche jemanden, der das für mich macht. Macht das nicht die Firma, die den Feld nicht zwangsläufig, ne?"}, {"id": 57, "start": 410.14, "end": 416.14, "text": "Baum, was? Baumdienst? Gibt es?"}, {"id": 58, "start": 416.14, "end": 421.14, "text": "Baumdienst?"}, {"id": 59, "start": 422.14, "end": 427.14, "text": "Nee, das ist irgendwas anderes, oder?"}, {"id": 60, "start": 428.14, "end": 438.14, "text": "Ich will Entsorgung. Baumchamp programmieren, ja?"}, {"id": 61, "start": 439.14, "end": 443.14, "text": "Rund um den Baum in Röder, das ist gar nicht so weit weg. Rund um den Baum, zeigt mal her."}, {"id": 62, "start": 443.14, "end": 447.14, "text": "Laufach ist auch nicht weit weg. Groß-Gerau ist ein Stückchen weg."}, {"id": 63, "start": 448.14, "end": 452.14, "text": "Ok, was machen die? Guck mal, die haben schon mal einen Plan."}, {"id": 64, "start": 453.14, "end": 457.14, "text": "Die wissen, was sie machen. Jetzt plus die Frage, ob die auch Entsorgung machen."}, {"id": 65, "start": 457.14, "end": 474.14, "text": "Entsorgung, guck mal hier, Poggers."}, {"id": 66, "start": 475.14, "end": 479.14, "text": "Ich habe diese Fehlermeldung legit noch nie gesehen. Ich weiß gar nicht, wo das herkommt."}, {"id": 67, "start": 480.14, "end": 483.14, "text": "Da habe ich mir jetzt ein Virus eingefangen. Gleich mal hier Prozess-Explorer checken."}, {"id": 68, "start": 483.14, "end": 490.14, "text": "Virus von der Baumschule."}, {"id": 69, "start": 491.14, "end": 500.14, "text": "So, was haben wir hier? Was läuft hier? Sieht da irgendwas verdächtig aus?"}, {"id": 70, "start": 501.14, "end": 509.14, "text": "Ja, sieht alles normal aus. Unsinnigste Tool überhaupt, aber gut."}, {"id": 71, "start": 509.14, "end": 514.14, "text": "Die Webseite ist braun. Der Typ soll ja auch mal einen Baum entsorgen und keine schöne Webseite haben."}, {"id": 72, "start": 515.14, "end": 519.14, "text": "Warum ist die Webseite eigentlich braun, zeigt mal her."}, {"id": 73, "start": 520.14, "end": 529.14, "text": "An was stört er sich denn? JQuery. Ah, JQuery kann er nicht downloaden."}, {"id": 74, "start": 529.14, "end": 541.14, "text": "Weil, Moment, weil, JQuery in 2021, weil musecdnbusinesscatalyst.com nicht auflösbar ist."}, {"id": 75, "start": 542.14, "end": 546.14, "text": "Das scheint mir eine absolut high-end pleading edge Webseite zu sein von dem Kerl."}, {"id": 76, "start": 547.14, "end": 549.14, "text": "Aber ist mir egal, solange er den Baum ordentlich machen kann."}, {"id": 77, "start": 550.14, "end": 554.14, "text": "Guck mal, der hat sogar einen YouTube-Channel. Die sind mal hier modern."}, {"id": 78, "start": 554.14, "end": 568.14, "text": "Oh, das ist natürlich toll. Sechs Jahre, er hat drei Subscriber."}, {"id": 79, "start": 569.14, "end": 576.14, "text": "Ey, an den ihrer Stelle würde ich nicht so viel Werbung machen für sich, weil die Webseite ist auch nicht die beste."}, {"id": 80, "start": 576.14, "end": 590.14, "text": "Okay, machen die jetzt immer noch Bäume weg? Moment, Leistung, Entsorgung, genau. Ah, diese Kackseile."}, {"id": 81, "start": 590.14, "end": 605.14, "text": "Okay, also was machen sie? Grünschnitt, Stammholz, ja wunderbar, die brauche ich. Die müssen meinen Baum wegbashing, Alter."}, {"id": 82, "start": 605.14, "end": 624.14, "text": "Gut, das ist doch schon mal nice. Die können wir schon mal nehmen. Was haben wir da sonst noch so? Der Baumdienstgerber. Was machen die? Machen die Entsorgung, Leistung, Baumfällung, Pflege? Machen die auch inklusive Entsorgung?"}, {"id": 83, "start": 624.14, "end": 648.14, "text": "Siehste, die machen, die entsorgen nichts. Entsorgung? Okay, die machen das auch."}, {"id": 84, "start": 648.14, "end": 665.14, "text": "Okay, also Baumdienst muss ich so einen Baumdienst zum Baumentsorgen? Alles klar. Wow, die Webseiten werden ja immer... Ach du Scheiße. Was sind das für Webseiten? Hilfe."}, {"id": 85, "start": 665.14, "end": 687.14, "text": "Okay, die sollen meinen Baum schrotten, nicht? Leistung. Okay, Baumfällung? Die haben nichts von Entsorgung stehen. Egal, egal. Der Typ macht einen guten Eindruck hier im Pressum."}, {"id": 86, "start": 687.14, "end": 698.14, "text": "Oh Gott, was für eine Seite. Wo ist denn der hier? Rödamark? Das ist nicht so weit weg. Okay, die Webseite wurde designt von denen. Die muss ich mir jetzt mal angucken."}, {"id": 87, "start": 698.14, "end": 720.14, "text": "Naja, coming soon. Ich hab so meine Zweifel, dass das soon, aber... Okay, die muss ich mir mal merken. Die muss ich fragen. Habt ihr Erfahrungen damit? Hat da mal jemand erfolgreich irgendwelche Handwerker drüber gefunden?"}, {"id": 88, "start": 720.14, "end": 735.14, "text": "Ich hab mir überlegt, ob ich nicht mal da was reinstellen soll. Achtung, Flashbang. Auf keinen Fall? Warum nicht?"}, {"id": 89, "start": 735.14, "end": 762.14, "text": "Scam? Warum nicht? Okay, gut. Chat hat mir schon mal weitergeholfen. Jetzt weiß ich zumindest halbwegs, nach was ich suchen muss."}, {"id": 90, "start": 762.14, "end": 771.14, "text": "Ich sollte mal vielleicht das Mikrofon ins Gesicht hängen und nicht hier irgendwie sonst wo rumhängen haben. Kann man mal Baumentsorgung so viel falsch machen?"}, {"id": 91, "start": 771.14, "end": 792.14, "text": "Ähm, ja. Das Problem ist, du musst jemand finden. Das ist nicht so einfach. Das mit den Baumfällen war nicht so schwierig. Das haben wir ganz gut gemacht, weil der Nachbar hat auch was machen lassen gerade und die hatten da Leute da. Aber..."}, {"id": 92, "start": 792.14, "end": 820.14, "text": "Beim Entsorgen? Ich finde keinen, der meinen Baum entsorgt. Also der Baum ist schon gefällt, ne? Ich brauch niemand, der meinen Baum fällt. Der Baum ist schon gefällt. Ich brauch jemand, der das Holz wegmacht und die Äste und das ganze Zeug, was im Garten liegt. Das ist ein relativ großer Baum. Mir ist das egal. Der kann das auch zu Feuerholz machen und bei sich im Kamin verheizen. Hauptsache, er nimmt's mit."}, {"id": 93, "start": 820.14, "end": 828.14, "text": "Warum haben die den nicht mitgenommen? Weil die da keinen Bock drauf hatten und das nicht mit ihm ausgemacht war."}, {"id": 94, "start": 828.14, "end": 856.14, "text": "Und was? 35 Jahre später ist dann der Baum weg, oder wie? Ist der Baum, ist das der Baum, aus dem YouTube stellts? Kann sein, dass man den da auch gesehen hat, ja. Achso, ja. Genau, also wenn ihr den Baum mal sehen wollt, ich kann euch den Baum zeigen."}, {"id": 95, "start": 856.14, "end": 860.14, "text": "Ähm..."}, {"id": 96, "start": 867.14, "end": 878.14, "text": "Zack? Der da. Der da. Aber man sieht's halt jetzt nicht, so weil ich nach unten filme."}, {"id": 97, "start": 878.14, "end": 894.14, "text": "Der hier. Also der dahinter. Ah, guck mal, guck mal. Okay, man erkennt nicht so wirklich viel, ne? Aber man sieht schon, der war ganz schön hoch. Das sind jetzt noch andere, die stehen alle."}, {"id": 98, "start": 908.14, "end": 923.14, "text": "Ja... Guck, hier sieht man's. Das ist der Baum, das ist der Baum. Der Baum ist gefällt, der liegt jetzt hier so da. Also in Stücken, ne? Nicht komplett. Und..."}, {"id": 99, "start": 923.14, "end": 947.14, "text": "Das ist, also dieses komplette Ding hier, also dieses komplette Feld hier bis hier ist voll mit Baum. Anzünden, wenn einer kommt, sagst du Osterfeuer. Ja, auch exzellente Idee. Ja, genau. Ich seh schon, der Chat, ich hätte den Chat früher fragen sollen. Der Chat weiß Bescheid, ja. Hier isser."}, {"id": 100, "start": 947.14, "end": 957.14, "text": "Also ihr seht, das ist schon ein ordentlicher Baum gewesen. Soll das Ganze noch mal im Winter? Massive Winter, stell's. Nee, das ist der andere. Naja."}, {"id": 101, "start": 958.14, "end": 973.14, "text": "Ein eBay-Kleinanzeigen, das ist alles so... so merkwürdige Leute. Moin Twinker. Nee, das kann ich nicht, das funktioniert nicht. Also ich weiß nicht, wenn ihr sagt schlechte Erfahrung, okay."}, {"id": 102, "start": 973.14, "end": 984.14, "text": "Aber ich muss... also der Typ macht echt einen ganz guten Eindruck hier. Und wen haben wir da noch? Äh, der hier. Die haben einen ganz guten Eindruck gemacht, oder? Nee, fuck. Wer war das jetzt?"}, {"id": 103, "start": 985.14, "end": 991.14, "text": "Rund um den Baum, die haben einen ganz guten Eindruck gemacht. Rund um den Baum. Guck mal, da kann sich sogar Google Ads leisten."}, {"id": 104, "start": 991.14, "end": 1004.14, "text": "Glaub mir, eBay-Kleinanzeigen und zu verschenken und die Leute rennen dir die Bude ein. Ja, das sind aber so komische Leute, mit denen will ich eigentlich gar nicht groß interagieren."}, {"id": 105, "start": 1007.14, "end": 1014.14, "text": "Die eBay-Kleinanzeigen, Leute. So, machen die auch Entsorgung? Entsorgung, Entsorgung. Exzellent."}, {"id": 106, "start": 1014.14, "end": 1030.14, "text": "Kein Problem, wir machen das. Er ist fast wie Bob der Baumeister, Alter. Okay, wo sind die? Wie? Wo ist das Impressum? Oh, das ist am Arsch der Welt. Die kommen bestimmt nicht 500km hergefahren, um meine Baumreste zu entsorgen."}, {"id": 107, "start": 1031.14, "end": 1036.14, "text": "Na gut, aber Chat, ich weiß schon mal Bescheid. Wunderbar. Machen wir mal kurz hier die VM an."}, {"id": 108, "start": 1036.14, "end": 1045.14, "text": "Mal kurz Chat lesen, bevor wir überhaupt, probieren wir mal wirklich ein bisschen was auf die Reihe zu kriegen. Gestern habe ich schon mehr geschwätzt, als dass ich was gebaut habe und dabei ist es gar nicht so schwierig, was ich programmieren will."}, {"id": 109, "start": 1046.14, "end": 1048.14, "text": "Ich zeige euch auch gleich noch mal, um was es genau geht."}, {"id": 110, "start": 1048.14, "end": 1064.14, "text": "Nein, das funktioniert nicht. Ich will irgendjemanden, der dafür dann auch wirklich verantwortlich ist, wo ich dann sage, ey, hol ab und der ist halt dann gefälligst dafür zu sorgen, dass nix kaputt geht, dass das Ding alles weg ist, dass das ordentlich gemacht wird und gut ist. Da bezahle ich auch was dafür."}, {"id": 111, "start": 1064.14, "end": 1074.14, "text": "Das ist mir egal, Hauptsache der Baum ist weg. Dafür, dass sie sich den Arsch ablachen, gab es bisher wenig Leute, die Bock drauf haben."}, {"id": 112, "start": 1074.14, "end": 1084.14, "text": "So, gut. Das war's für heute. Bis zum nächsten Mal. Bis zum nächsten Mal. Tschüss."}, {"id": 113, "start": 1104.14, "end": 1116.14, "text": "Ja, gut, das wird mich nicht großartig stören. Das kann mein Fing auch noch einen Monat rumliegen. Das ist wirklich wild."}, {"id": 114, "start": 1116.14, "end": 1138.14, "text": "Ja, mal gucken, mal gucken. Also, ich frage, der Baumprofi, ich habe schon wieder vergessen, rund um den Baum hieß, hörte sich doch ganz gut an. Also auch den Stamm mit ausfrühen, nee, der bleibt da. Das muss nicht sein. Nee, nee, das muss nicht sein."}, {"id": 115, "start": 1138.14, "end": 1146.14, "text": "Ich baue einfach einen, der den Baum mitnimmt, der schon da, also den kleinen gehackten Baum da schon da liegt. Baumchamp, genau."}, {"id": 116, "start": 1147.14, "end": 1150.14, "text": "Also, nochmal als kurze Zusammenfassung, was wir machen."}, {"id": 117, "start": 1150.14, "end": 1172.14, "text": "Ich zeige das nochmal ganz schnell. Also, ich habe ein paar von diesen Sensoren hier am Start. Das ist ein Sensor, der hat Bodenfeuchtigkeit, der ist eigentlich zum Überwachen von Plumenschöpfen, Pots und Beete und sowas."}, {"id": 118, "start": 1172.14, "end": 1186.14, "text": "So, der überwacht Bodenfeuchtigkeit, Mineralen im Boden, hat aber auch einen Temperaturen-Licht-Sensor und ich habe mir gedacht, nachdem mein Kühlschrank oben, der hat manchmal ein paar Probleme, macht komische Geräusche."}, {"id": 119, "start": 1187.14, "end": 1193.14, "text": "Das habe ich euch schon mal erzählt, das ist der Kühlschrank, den man ab und zu mal neu starten muss. Wo ich immer sage, es ist unglaublich, es ist unglaublich, was man mit Reboot alles lösen kann."}, {"id": 120, "start": 1193.14, "end": 1203.14, "text": "So, und was auch immer dieser Kühlschrank macht, ich habe Schiss, dass der mal einen Geist aufkippt und ich es nicht richtig mitbekomme. Deswegen habe ich mir jetzt überlegt, ich mache jetzt Big Brain, Taktik."}, {"id": 121, "start": 1204.14, "end": 1211.14, "text": "Ich lege dieses Ding in Kühlschrank, das ist Bluetooth Low Energy, Kühlschrank rebooten, ja, sonst macht er komische Geräusche teilweise."}, {"id": 122, "start": 1212.14, "end": 1221.14, "text": "Ich lege das Ding hier in Kühlschrank und das misst Temperatur und Licht. Wenn Licht an ist, habe ich die Tür vergessen, wenn Temperatur allerdings zu sehr steigt, weiß ich, es stimmt irgendwas nicht."}, {"id": 123, "start": 1221.14, "end": 1225.14, "text": "Das ist eigentlich der optimale Sensor für Kühlschrank."}, {"id": 124, "start": 1232.14, "end": 1235.14, "text": "Ja, nee, der ist noch nicht geroutet, der Kühlschrank."}, {"id": 125, "start": 1235.14, "end": 1252.14, "text": "So, und das haben wir am Start. Was wir den letzten Stream schon programmiert haben ist, dass der das ausliest."}, {"id": 126, "start": 1252.14, "end": 1266.14, "text": "Also sprich, der kann aktuell über Bluetooth, also ich habe hier so ein kleines Board am Start, der kann aktuell über Bluetooth auslesen, Temperatur und Licht. Ich kann euch auch zeigen, dass das funktioniert."}, {"id": 127, "start": 1266.14, "end": 1279.14, "text": "Ähm, wir flashen jetzt erstmal, Flashchamp."}, {"id": 128, "start": 1279.14, "end": 1299.14, "text": "So, Moment, Battery, was macht der da?"}, {"id": 129, "start": 1299.14, "end": 1308.14, "text": "Ach, das war mal eine Debug-Ausgabe, Moment, dass ich Schwachsinn, das muss ich doch mal wegmachen. Ich habe da irgendeinen Müll ausgegeben, komplett, komplett bescheuert."}, {"id": 130, "start": 1309.14, "end": 1320.14, "text": "Das war gestern einfach nur zum Ausprobieren. So, aber wie gesagt, ich kann euch sagen, dass das funktioniert, also zeigen, dass das funktioniert und zwar, das kommt auch weg."}, {"id": 131, "start": 1320.14, "end": 1340.14, "text": "Tangle, danke schön für den Prime-Sub. So, und zwar, was der aktuell macht, ist folgendes, der scannt Bluetooth Low Energy Modus, scannt der, ob Geräte irgendwas rausschicken."}, {"id": 132, "start": 1340.14, "end": 1352.14, "text": "Also, das Problem ist nämlich, es gibt zwei, guck hier, hier kriegt man gerade die Werte, das ist ziemlich hell, wo der Sensor liegt, das ist 1119, ich vermute mal, das sind Lux als Einheit, bin mir nicht so ganz so sicher."}, {"id": 133, "start": 1353.14, "end": 1359.14, "text": "Also der Sensor meldet gerade von dem Ding, es ist relativ hell und ab und zu sagt er dann auch mal seine Temperatur, wenn man lang genug wartet."}, {"id": 134, "start": 1359.14, "end": 1369.14, "text": "So, es gibt zwei Möglichkeiten, diesen Sensor abzufragen und es gibt auch schon ein paar Projekte, die das gleiche machen, wie ich hier programmieren will, nur die machen das nicht so, wie es mir gefällt."}, {"id": 135, "start": 1370.14, "end": 1376.14, "text": "Ansonsten würde ich in dem Fall tatsächlich auch mal was Fertiges nehmen. So, ach guck, hier seht ihr, die Temperatur, 23 Grad ist ja gerade optimal."}, {"id": 136, "start": 1376.14, "end": 1393.14, "text": "So, und es gibt zwei Sachen, wie man den Sensor abfragen kann. Es gibt einmal die rein passive Geschichte, der Sensor schickt alle 30 Sekunden, seht ihr ja auch hier, das schickt alle 30 Sekunden mal so einen Burst von Infos zu einem Sensorwert."}, {"id": 137, "start": 1393.14, "end": 1406.14, "text": "Das macht der Sensor von sich aus, dazu muss man ihn nicht abfragen, also spricht der Sensor, schickt alle 30 Sekunden Infos über Bodenfeuchtigkeit, über Temperatur und über Licht."}, {"id": 138, "start": 1407.14, "end": 1414.14, "text": "So ungefähr alle 30 Sekunden, seht ihr ja hier unten auch, guck jetzt wieder Temperatur dran, 30 Sekunden bis Minute später."}, {"id": 139, "start": 1414.14, "end": 1426.14, "text": "So, und was ich jetzt mache ist, ich scanne einfach nur, ob irgendwas Daten schickt. Das hat den Vorteil, dass ich nicht die Batterie von diesem Sensor irgendwie belaste."}, {"id": 140, "start": 1427.14, "end": 1434.14, "text": "Ist ja logisch, wenn ich einfach nur das mitschneide, was der Sensor schon schickt, dann verbrauche ich keine extra Batterie."}, {"id": 141, "start": 1434.14, "end": 1445.14, "text": "So, die zweite Variante ist das, was übrigens auch einige fertige Projekte schon machen, die fragen den Sensor aktiv ab."}, {"id": 142, "start": 1446.14, "end": 1457.14, "text": "So, und das verbraucht Batterie wie Sau. Man muss nämlich überlegen, da ist bloß so eine kleine, was auch immer das ist, 230 mAh Batterie drinne."}, {"id": 143, "start": 1458.14, "end": 1462.14, "text": "Das heißt, der Kram hält nicht lange, wenn man den permanent abfragt."}, {"id": 144, "start": 1462.14, "end": 1468.14, "text": "So, deswegen habe ich mir das überlegt, wir machen das folgendermaßen, wir scannen rein passiv die Werte, die reinkommen."}, {"id": 145, "start": 1469.14, "end": 1471.14, "text": "Das haben wir schon gemacht, das funktioniert auch."}, {"id": 146, "start": 1472.14, "end": 1477.14, "text": "Das ist vielleicht nicht schön, aber es funktioniert, das ist das Wichtige. Ob das für Schönheitspreis, muss ich ja gar nicht gewinnen."}, {"id": 147, "start": 1478.14, "end": 1482.14, "text": "Dafür ist C++ an sich schon zu hässlich, das kann man gar nicht schön machen."}, {"id": 148, "start": 1483.14, "end": 1489.14, "text": "Allerdings eine Sache, die mir nicht gefällt und ich will so das Beste aus beiden Welten verbinden."}, {"id": 149, "start": 1489.14, "end": 1491.14, "text": "Nämlich, ich will..."}, {"id": 150, "start": 1496.14, "end": 1499.14, "text": "Kann man denn den automatischen Broadcast am Gerät ausschalten? Nein."}, {"id": 151, "start": 1500.14, "end": 1504.14, "text": "Du hast keine Möglichkeit, irgendwie Settings daran zu ändern. Das wäre auch eine Variante, das könnte man auch machen."}, {"id": 152, "start": 1505.14, "end": 1509.14, "text": "Aber es geht halt nicht. Aber wie gesagt, ich will das Beste aus beiden Welten verbinden."}, {"id": 153, "start": 1510.14, "end": 1514.14, "text": "Ich möchte nämlich den Broadcast mitschneiden per Bluetooth, also das, was ich hier mache."}, {"id": 154, "start": 1514.14, "end": 1520.14, "text": "Aber in dieser Ausgabe ist kein Batteriestatus drin. Also ich weiß nicht, wie viel in der Batterie noch drin ist."}, {"id": 155, "start": 1523.14, "end": 1525.14, "text": "Und deswegen..."}, {"id": 156, "start": 1527.14, "end": 1530.14, "text": "Big Brain, habe ich mir gedacht, wir machen das so."}, {"id": 157, "start": 1532.14, "end": 1536.14, "text": "Wir scannen passiv, was reinkommt. So."}, {"id": 158, "start": 1537.14, "end": 1540.14, "text": "Und dann merken wir uns, welchen Sensor wir gefunden haben."}, {"id": 159, "start": 1540.14, "end": 1545.14, "text": "Und diesen Sensor fragen wir einmal alle 5 Stunden aktiv die Batterie ab."}, {"id": 160, "start": 1547.14, "end": 1549.14, "text": "Und dann habe ich das Beste aus beiden Welten."}, {"id": 161, "start": 1550.14, "end": 1553.14, "text": "Oder einmal am Tag oder so, mal gucken, weiß ich auch nicht genau."}, {"id": 162, "start": 1554.14, "end": 1556.14, "text": "Dann habe ich nämlich das Beste aus beiden Welten."}, {"id": 163, "start": 1557.14, "end": 1560.14, "text": "Ich habe Batterie in einem größeren Abstand, was allerdings..."}, {"id": 164, "start": 1561.14, "end": 1565.14, "text": "Also ich habe den Stand der Batterie in einem größeren Abstand, was aber selbst die Batterie nicht beeinflusst."}, {"id": 165, "start": 1565.14, "end": 1569.14, "text": "Das heißt, als nächstes muss ich gucken, wie kriege ich Batterie abgefragt."}, {"id": 166, "start": 1570.14, "end": 1572.14, "text": "Natürlich habe ich schon mal im Vorfeld ein bisschen..."}, {"id": 167, "start": 1573.14, "end": 1574.14, "text": "Ich mache den ganzen Kreml hier mal zu."}, {"id": 168, "start": 1575.14, "end": 1576.14, "text": "Ups, ein bisschen viel."}, {"id": 169, "start": 1577.14, "end": 1579.14, "text": "Oh, da ist wieder der Baumofant."}, {"id": 170, "start": 1580.14, "end": 1582.14, "text": "Ich habe auf GitHub schon mal ein bisschen geguckt."}, {"id": 171, "start": 1583.14, "end": 1588.14, "text": "Und wenn man hier nach ESP32 Flora sucht, findet man ein Beispielprogramm."}, {"id": 172, "start": 1589.14, "end": 1590.14, "text": "Hallo?"}, {"id": 173, "start": 1591.14, "end": 1592.14, "text": "Shithub, genau."}, {"id": 174, "start": 1592.14, "end": 1594.14, "text": "Richtig genau, ByteStrike, so sieht es aus."}, {"id": 175, "start": 1595.14, "end": 1596.14, "text": "Dark Reader, was ist denn los?"}, {"id": 176, "start": 1597.14, "end": 1598.14, "text": "Leute, wir brauchen keinen Dark Modus."}, {"id": 177, "start": 1599.14, "end": 1601.14, "text": "Sorry, für Flashbang Modus, der Dark Reader nervt gerade rum."}, {"id": 178, "start": 1604.14, "end": 1605.14, "text": "Piss dich, Dark Reader."}, {"id": 179, "start": 1607.14, "end": 1611.14, "text": "Genau, und hier habe ich ein Beispiel gefunden, wie man den Batteriestand abfragt."}, {"id": 180, "start": 1612.14, "end": 1614.14, "text": "Also das hier war schon äußerst eklig rauszubekommen."}, {"id": 181, "start": 1615.14, "end": 1620.14, "text": "Nur mal so, was man da machen muss, um überhaupt die Werte rauszubekommen."}, {"id": 182, "start": 1620.14, "end": 1622.14, "text": "Also man muss einen Bluetooth-Scan machen."}, {"id": 183, "start": 1624.14, "end": 1628.14, "text": "Wir verwenden übrigens nicht die Bluetooth-Library, die dabei ist, sondern..."}, {"id": 184, "start": 1629.14, "end": 1630.14, "text": "Oder doch, das stimmt nicht."}, {"id": 185, "start": 1631.14, "end": 1637.14, "text": "Wir verwenden die Bluetooth-Library, die dabei ist, allerdings eine etwas neuere Variante davon, die deutlich weniger Flash-Speicher braucht."}, {"id": 186, "start": 1638.14, "end": 1643.14, "text": "Weil ansonsten ist die 1,9 MB für so eine Firmware ratzfatz voll."}, {"id": 187, "start": 1644.14, "end": 1646.14, "text": "Also der Bluetooth-Stack ist huge fat."}, {"id": 188, "start": 1646.14, "end": 1649.14, "text": "Also der Bluetooth-Stack ist huge fat."}, {"id": 189, "start": 1650.14, "end": 1651.14, "text": "Also der ist sowas, der ist..."}, {"id": 190, "start": 1652.14, "end": 1654.14, "text": "Kennt ihr diese Pepo-Version mit dem Fast-Foot in der Hand?"}, {"id": 191, "start": 1655.14, "end": 1657.14, "text": "So fat ist ungefähr das Ding auf dem Flash."}, {"id": 192, "start": 1665.14, "end": 1667.14, "text": "So, so, in der Richtung, ja."}, {"id": 193, "start": 1671.14, "end": 1672.14, "text": "So, so machen wir das."}, {"id": 194, "start": 1672.14, "end": 1676.14, "text": "Genau, und man macht einen Bluetooth-Scan."}, {"id": 195, "start": 1677.14, "end": 1678.14, "text": "Das ist hier alles ziemlich default."}, {"id": 196, "start": 1679.14, "end": 1681.14, "text": "Der scannt, der hört einfach endlos jetzt, was die Geräte schicken."}, {"id": 197, "start": 1682.14, "end": 1685.14, "text": "Und um die Werte rauszubekommen, ist richtig big brain, was man machen muss."}, {"id": 198, "start": 1686.14, "end": 1689.14, "text": "Das musste ich mir auch auf GitHub abgucken von einem, der dieses..."}, {"id": 199, "start": 1689.14, "end": 1694.14, "text": "Der dieses Protokoll reverse-engineert hat von diesem Sensor."}, {"id": 200, "start": 1695.14, "end": 1696.14, "text": "So, und es funktioniert folgendermaßen."}, {"id": 201, "start": 1697.14, "end": 1699.14, "text": "Nur mal so einen ganz kurzen Überblick, was man machen muss."}, {"id": 202, "start": 1701.14, "end": 1703.14, "text": "Man muss sich die ID von dem Gerät holen."}, {"id": 203, "start": 1704.14, "end": 1707.14, "text": "Dann muss man gucken, ob die ID mit diesem Byte anfängt."}, {"id": 204, "start": 1708.14, "end": 1711.14, "text": "Oder besser gesagt, die ID mit diesem Byte entspricht."}, {"id": 205, "start": 1712.14, "end": 1713.14, "text": "Dann muss man die ID von dem Gerät holen."}, {"id": 206, "start": 1714.14, "end": 1717.14, "text": "Dann muss man gucken, ob die ID mit diesem Byte anfängt."}, {"id": 207, "start": 1717.14, "end": 1718.14, "text": "Oder ob die ID mit diesem Byte entspricht."}, {"id": 208, "start": 1719.14, "end": 1723.14, "text": "Das ist die Xiaomi, Xiaomi, Xiaomi, wie auch immer."}, {"id": 209, "start": 1724.14, "end": 1725.14, "text": "Ihr wisst, was ich meine. Ich meine die hier."}, {"id": 210, "start": 1728.14, "end": 1731.14, "text": "Bluetooth-ID von diesem Gerät."}, {"id": 211, "start": 1732.14, "end": 1735.14, "text": "Und nur wenn das da kommt als ID, will ich überhaupt weiter gucken."}, {"id": 212, "start": 1736.14, "end": 1739.14, "text": "Dann muss ich irgendwelche komischen C++-Dinger machen, weil es C++ ist."}, {"id": 213, "start": 1740.14, "end": 1745.14, "text": "Dann muss ich gucken, ob im dritten Feld von diesem Array..."}, {"id": 214, "start": 1745.14, "end": 1749.14, "text": "...das auf 98 Hex steht."}, {"id": 215, "start": 1750.14, "end": 1753.14, "text": "Das vierte Feld, ob da eine Null drin steht."}, {"id": 216, "start": 1754.14, "end": 1756.14, "text": "Wenn nicht, dann ist es schon mal nichts, was ich auslesen will."}, {"id": 217, "start": 1757.14, "end": 1758.14, "text": "Frag mich nicht warum, ergibt keinen Sinn."}, {"id": 218, "start": 1759.14, "end": 1764.14, "text": "Habe ich mir abgeguckt auf GitHub von irgendeinem Typ, der raus bekommen hat, wie dieses Gerät kommuniziert."}, {"id": 219, "start": 1765.14, "end": 1767.14, "text": "Warum auch immer das so ist. Ich habe keine Ahnung, man muss das aber so machen."}, {"id": 220, "start": 1768.14, "end": 1770.14, "text": "Dann muss man irgendwelche... Ja, wirklich, too smart."}, {"id": 221, "start": 1771.14, "end": 1773.14, "text": "Du hast noch nichts verpasst. Mir haben keines eingefallen."}, {"id": 222, "start": 1773.14, "end": 1775.14, "text": "So, dann musst du hier ein paar Sachen checken."}, {"id": 223, "start": 1776.14, "end": 1779.14, "text": "Und im Zweifelsfall, wenn du das nicht auslesen kannst, wieder rausgehen."}, {"id": 224, "start": 1780.14, "end": 1781.14, "text": "So, dann hier nächste Magic."}, {"id": 225, "start": 1782.14, "end": 1787.14, "text": "Wenn das auch... Wenn es Capabilities hat, was auch immer das bedeutet, in dem Fall, keine Ahnung."}, {"id": 226, "start": 1788.14, "end": 1791.14, "text": "Dann müssen wir bei Index 12 anfangen, ansonsten bei Index 11."}, {"id": 227, "start": 1792.14, "end": 1795.14, "text": "Weil, also wie gesagt, ich weiß auch nicht warum, aber es ist so."}, {"id": 228, "start": 1795.14, "end": 1803.14, "text": "So, und dann muss man sich irgendwie rausholen, wie lang der Wert ist, den man auslesen will und wo er startet."}, {"id": 229, "start": 1804.14, "end": 1808.14, "text": "Und dann kann man das Ganze auslesen."}, {"id": 230, "start": 1809.14, "end": 1811.14, "text": "So, so kriegt man die Temperatur raus."}, {"id": 231, "start": 1812.14, "end": 1819.14, "text": "Und so, also mit so einer äußerst trivialen Zeile, die natürlich jeder auf den ersten Blick versteht,"}, {"id": 232, "start": 1819.14, "end": 1825.14, "text": "kriegt man raus, wie der Helligkeitssensor gerade, was der Helligkeitssensor gerade meldet."}, {"id": 233, "start": 1830.14, "end": 1836.14, "text": "Also, ich muss euch sagen, ich verstehe zwar, was das prinzipiell von der Syntax her, was diese Zeile macht."}, {"id": 234, "start": 1837.14, "end": 1839.14, "text": "Aber so genau vorstellen kann ich es mir nicht."}, {"id": 235, "start": 1839.14, "end": 1849.14, "text": "Also, das hier ist ein Zugriff auf den Index Value Start plus 3, das ist dann in dem Fall, glaube ich, 12. 12 plus 3, 15."}, {"id": 236, "start": 1850.14, "end": 1853.14, "text": "15, 16, 17. Index 17."}, {"id": 237, "start": 1854.14, "end": 1856.14, "text": "So, und das ist, glaube ich, ein Bitwise Left Shift."}, {"id": 238, "start": 1857.14, "end": 1860.14, "text": "Also, mit 16, ich glaube, mit 16 Nullen auf... Nee."}, {"id": 239, "start": 1862.14, "end": 1864.14, "text": "Der Twinkler weiß das bestimmt, der kennt mit so was aus."}, {"id": 240, "start": 1864.14, "end": 1868.14, "text": "Ähm, ist das nach links schieben und rechts 16 Nullen auffüllen?"}, {"id": 241, "start": 1869.14, "end": 1873.14, "text": "Irgendwie sowas, das ist irgendwie Bitwise Shift, muss ich jetzt genau gucken, was das für eine Operation ist."}, {"id": 242, "start": 1874.14, "end": 1880.14, "text": "Okay, 16 nach links, nach links shift bedeutet rechts 16 Nullen auffüllen, ne?"}, {"id": 243, "start": 1882.14, "end": 1887.14, "text": "Also, 16 Nullen rechts auffüllen, weil es ja eine 32-Spit-Zahl ist anscheinend."}, {"id": 244, "start": 1887.14, "end": 1894.14, "text": "So, das Ganze dann noch mal machen und hier 8 Stellen, 8 mal Null, also auf den anderen Index auffüllen."}, {"id": 245, "start": 1895.14, "end": 1900.14, "text": "Das Ganze Binary Or machen und dann noch mal ein Binary Or mit dem, was im Start steht."}, {"id": 246, "start": 1901.14, "end": 1907.14, "text": "Ultra Black, schwarze Magie, aber es funktioniert."}, {"id": 247, "start": 1908.14, "end": 1912.14, "text": "Ihr seht Lichtwert und Temperaturwert, das stimmt auch ungefähr."}, {"id": 248, "start": 1912.14, "end": 1916.14, "text": "Hier ist grad 24 Grad oder so drinne, vielleicht am Fenster ein bisschen weniger, wo das liegt, das passt."}, {"id": 249, "start": 1917.14, "end": 1920.14, "text": "Also es kommt ungefähr hin, so plus, minus 1, 2 Grad vielleicht."}, {"id": 250, "start": 1921.14, "end": 1926.14, "text": "Wie Ort man zwei Zahlen? Ganz einfach, indem du die Zahlen als Binary nimmst."}, {"id": 251, "start": 1927.14, "end": 1930.14, "text": "Ah, also, so was."}, {"id": 252, "start": 1932.14, "end": 1937.14, "text": "Dann nimmst du die erste Zahl, sagst... Okay, das ist jetzt dumm, weil das ist geort 111."}, {"id": 253, "start": 1937.14, "end": 1943.14, "text": "Wir müssen das mal ein bisschen anders machen, so als Beispiel."}, {"id": 254, "start": 1944.14, "end": 1951.14, "text": "Okay, wenn du diese Zahlen orst, 111, 1 oder 1 oder 1 oder 1, passt, ist 1."}, {"id": 255, "start": 1952.14, "end": 1958.14, "text": "Null oder Null ist Null, 1 zu 1, so, 1 oder Null ist 1, 1."}, {"id": 256, "start": 1959.14, "end": 1963.14, "text": "Okay, die zwei Zahlen geort werden das hier. Oder, Moment, ja doch, korrekt, korrekt."}, {"id": 257, "start": 1963.14, "end": 1966.14, "text": "So, und mit einem und würde das dann so aussehen."}, {"id": 258, "start": 1968.14, "end": 1971.14, "text": "So, ah, yes, ich weiß."}, {"id": 259, "start": 1972.14, "end": 1977.14, "text": "Das wäre mit einem und, also man könnte auch einen und hier machen an der Stelle, wenn man denn das von der Logik her bräuchte."}, {"id": 260, "start": 1978.14, "end": 1979.14, "text": "Syntaktisch wäre das okay."}, {"id": 261, "start": 1980.14, "end": 1988.14, "text": "So odert man zwei Zahlen, wie auch immer man das genau mathematisch korrekt bezeichnet."}, {"id": 262, "start": 1988.14, "end": 1996.14, "text": "Und jetzt, um komplett mein Mind zu plonen, wisst ihr wofür die Subnet Mask da ist."}, {"id": 263, "start": 2000.14, "end": 2002.14, "text": "Warum Netzwerk eine Subnet Mask hat?"}, {"id": 264, "start": 2003.14, "end": 2008.14, "text": "Das ist genau dafür, dass du rausfinden kannst, was Netzwerk und was Host ist."}, {"id": 265, "start": 2008.14, "end": 2016.14, "text": "Die machen genau das. Ich bin mir nicht ganz sicher, wie es genau funktioniert, ob du es oderst oder endest."}, {"id": 266, "start": 2017.14, "end": 2022.14, "text": "Ich weiß nicht, aber zumindest sowas ähnliches macht man mit der Subnet Mask auch, um rauszukriegen, was Netzwerk und was Hostanteil ist."}, {"id": 267, "start": 2024.14, "end": 2028.14, "text": "Also es hat ja auch einen gewissen Unterschied zwischen Netzwerk und Host."}, {"id": 268, "start": 2028.14, "end": 2037.14, "text": "So, und jetzt muss ich gucken, wie lese ich die Batterie aus."}, {"id": 269, "start": 2038.14, "end": 2045.14, "text": "Was ich mir überlegt habe ist, also ich hab mal hier so eine Klasse für den Sensor angelegt zum Datensammeln."}, {"id": 270, "start": 2045.14, "end": 2057.14, "text": "Und ich habe mir überlegt, was wir machen, ist folgendes. Also wir lesen hier aus, also wir gucken hier, ob neue Geräte reinkommen."}, {"id": 271, "start": 2058.14, "end": 2064.14, "text": "Wenn neue Geräte reinkommen, dann schreibe ich die in diesen..."}, {"id": 272, "start": 2064.14, "end": 2074.14, "text": "Ich weiß, es ist keine Liste, aber ich sag mal Liste, ja. Dann schreibe ich das in diese Liste rein und merke mir das."}, {"id": 273, "start": 2075.14, "end": 2083.14, "text": "Und dann mache ich hier unten in meiner Hauptschleife, mache ich dann einmal alle 5 Stunden Batterienupdate."}, {"id": 274, "start": 2083.14, "end": 2093.14, "text": "So weit die Theorie."}, {"id": 275, "start": 2094.14, "end": 2097.14, "text": "By the way, warum zählt der da jetzt eigentlich die ganze Zeit hoch?"}, {"id": 276, "start": 2098.14, "end": 2100.14, "text": "Was mach ich denn da?"}, {"id": 277, "start": 2101.14, "end": 2108.14, "text": "Ah, das ist die Uptime. Oh guck mal, ich war ja sogar so clever und ich hab ne Uptime dabei gemacht, dass ich sehe in der Ausgabe, ob das noch funktioniert."}, {"id": 278, "start": 2108.14, "end": 2113.14, "text": "Ja genau, das ist der Miflora hier. Exzellent, exzellent."}, {"id": 279, "start": 2114.14, "end": 2118.14, "text": "So, jetzt muss ich mal gucken, wie mein Batterienstatus abfragt."}, {"id": 280, "start": 2119.14, "end": 2123.14, "text": "Das wird richtig Monka-essig, sag ich euch."}, {"id": 281, "start": 2123.14, "end": 2137.14, "text": "Okay, also, wir machen mal, wir machen da mal..."}, {"id": 282, "start": 2138.14, "end": 2146.14, "text": "Also, wir machen da mal sowas, was eigentlich, sowas wie Update Sensor Battery Level oder sowas."}, {"id": 283, "start": 2146.14, "end": 2152.14, "text": "Da muss ich mal gucken, wie das funktioniert. Hier habe ich nämlich ein Beispiel, wie das geht."}, {"id": 284, "start": 2153.14, "end": 2155.14, "text": "Wir schauen uns das jetzt erstmal an."}, {"id": 285, "start": 2156.14, "end": 2160.14, "text": "Also, es gibt irgendwelche ID's für den Batteriestatus, gut."}, {"id": 286, "start": 2161.14, "end": 2164.14, "text": "Irgendes Service ID, okay."}, {"id": 287, "start": 2164.14, "end": 2177.14, "text": "War Tado nicht das Ding, was letztens AWS Probleme hat oder bringe ich das durcheinander, wo die Leute ihre Thermostate nicht verstellen konnten?"}, {"id": 288, "start": 2178.14, "end": 2185.14, "text": "Letztens hat irgendwie, hat AWS Probleme gehabt und die Leute konnten ihre Heizung nicht mehr steuern."}, {"id": 289, "start": 2186.14, "end": 2190.14, "text": "Da denke ich mir auch mal, bin ich froh, dass ich den Gramm offline habe."}, {"id": 290, "start": 2190.14, "end": 2197.14, "text": "Stellt euch mal vor, euer Internetzugang geht nicht mehr oder AWS hat Probleme und es ist Winter und ihr könnt die Heizung nicht anmachen."}, {"id": 291, "start": 2198.14, "end": 2202.14, "text": "Mein Real Crazy, das ist schon ziemlich fail, oder?"}, {"id": 292, "start": 2206.14, "end": 2209.14, "text": "Oh, hier gibt es jetzt, hier gibt es jetzt Big Brain Erklärung."}, {"id": 293, "start": 2210.14, "end": 2217.14, "text": "192168178.0 slash 24 sagt, dass das Netz 256 Adressen..."}, {"id": 294, "start": 2217.14, "end": 2220.14, "text": "Ja gut, das ist klar."}, {"id": 295, "start": 2221.14, "end": 2223.14, "text": "Aber wie macht es das?"}, {"id": 296, "start": 2224.14, "end": 2226.14, "text": "Mit einem, wahrscheinlich mit einem und, oder?"}, {"id": 297, "start": 2227.14, "end": 2234.14, "text": "Ey, invert, invert und und invert oder wie macht es das?"}, {"id": 298, "start": 2235.14, "end": 2237.14, "text": "Ich weiß es nicht mehr aus dem Kopf, wie das funktioniert."}, {"id": 299, "start": 2237.14, "end": 2244.14, "text": "Man muss es inverten irgendwie, glaube ich, habe ich im Hinterkopf, ne?"}, {"id": 300, "start": 2247.14, "end": 2253.14, "text": "End, man macht End, End und invert oder sowas macht man, glaube ich, ne?"}, {"id": 301, "start": 2258.14, "end": 2263.14, "text": "Ach, keine Ahnung, das wusste ich mal, das habe ich, das brauchst du ja nicht tagtäglich."}, {"id": 302, "start": 2263.14, "end": 2270.14, "text": "Was, gestern Abend hatte MS Probleme mit ihrem DNS und dann ging alles von Teams über OneDrive bis hin zu Xbox Live nicht?"}, {"id": 303, "start": 2271.14, "end": 2272.14, "text": "Gip."}, {"id": 304, "start": 2273.14, "end": 2277.14, "text": "Könnt ihr euch noch an den Playstation-Ausfall erinnern von der PS3?"}, {"id": 305, "start": 2278.14, "end": 2284.14, "text": "Wo das, wo das, das Lizard Squad war, das doch damals, glaube ich, die wie verrückt Sony gedenost haben?"}, {"id": 306, "start": 2285.14, "end": 2287.14, "text": "Ich weiß nicht, wie ich gerade drauf komme, irgendwie."}, {"id": 307, "start": 2287.14, "end": 2290.14, "text": "Tado hat eine eigene Bridge, ja, das ist schon mal gut."}, {"id": 308, "start": 2292.14, "end": 2295.14, "text": "Da geht wenigstens der Kram weiter, wenn der Internet ausfällt."}, {"id": 309, "start": 2301.14, "end": 2302.14, "text": "Okay, ich bin schon."}, {"id": 310, "start": 2306.14, "end": 2307.14, "text": "Wir gucken jetzt, wie das funktioniert."}, {"id": 311, "start": 2308.14, "end": 2311.14, "text": "Subnetting in, oh fuck, muss das jetzt wirklich sein?"}, {"id": 312, "start": 2311.14, "end": 2314.14, "text": "Jetzt wird es Pains Champ, Leute."}, {"id": 313, "start": 2315.14, "end": 2316.14, "text": "Hallo?"}, {"id": 314, "start": 2317.14, "end": 2318.14, "text": "Hier, die Seite geht nicht."}, {"id": 315, "start": 2322.14, "end": 2325.14, "text": "Aber, aber wir können einfach IP-Kalk verwenden, dann steht das da alles drinne."}, {"id": 316, "start": 2325.14, "end": 2326.14, "text": "Wie, nicht installiert?"}, {"id": 317, "start": 2326.14, "end": 2329.14, "text": "Ein Moment, IP-Kalk habe ich nicht."}, {"id": 318, "start": 2331.14, "end": 2333.14, "text": "Hau mal, IP-Kalk, beste Versuche."}, {"id": 319, "start": 2333.14, "end": 2341.14, "text": "Da steht es doch drinne. So, IP-Kalk, 192.168.50.0.24."}, {"id": 320, "start": 2342.14, "end": 2344.14, "text": "So, hier erklärt es einem jetzt, glaube ich, wie es funktioniert."}, {"id": 321, "start": 2345.14, "end": 2346.14, "text": "Also, genau."}, {"id": 322, "start": 2347.14, "end": 2348.14, "text": "Address."}, {"id": 323, "start": 2350.14, "end": 2354.14, "text": "Genau, das ist die, das ist, das ist, das ist die, das Netz im Binary."}, {"id": 324, "start": 2354.14, "end": 2362.14, "text": "Moment, nee, das ist nicht das Netz im Binary, das ist die Adresse, also kannst du irgendwie sowas machen."}, {"id": 325, "start": 2363.14, "end": 2365.14, "text": "Genau, das ist die Adresse im Binary."}, {"id": 326, "start": 2366.14, "end": 2367.14, "text": "Das ist die Netmask im Binary."}, {"id": 327, "start": 2368.14, "end": 2370.14, "text": "Wildcard is Cisco, geduldens brauchen normale Menschen net."}, {"id": 328, "start": 2371.14, "end": 2372.14, "text": "Das ist Netzwerk."}, {"id": 329, "start": 2373.14, "end": 2379.14, "text": "So, und jetzt kannst du, wenn du das hier, wenn du das hier,"}, {"id": 330, "start": 2379.14, "end": 2388.14, "text": "wenn du das hier ein End machst, ich weiß immer noch nicht, ich weiß immer noch nicht mehr, wie es funktioniert."}, {"id": 331, "start": 2395.14, "end": 2401.14, "text": "Wildcard, das ist die umgedrehte, das ist die umgedrehte Netmask, das ist so ein Cisco Ding, die stehen da irgendwie drauf."}, {"id": 332, "start": 2401.14, "end": 2408.14, "text": "Cisco Leute geben gerne nicht Netmask ein, sondern irgendwie Wildcards, weil Cisco Leute sind, keine Ahnung."}, {"id": 333, "start": 2411.14, "end": 2412.14, "text": "Einfach einen Und machen."}, {"id": 334, "start": 2413.14, "end": 2416.14, "text": "Aber einfach einen Und machen kann ja nicht funktionieren."}, {"id": 335, "start": 2417.14, "end": 2422.14, "text": "Dann kommt wieder, bei einem einfachen Uns würde ich hier überall eine Null rauskommen."}, {"id": 336, "start": 2423.14, "end": 2427.14, "text": "Deswegen, ich bin mir relativ sicher, es war irgendwie invertieren und unten."}, {"id": 337, "start": 2427.14, "end": 2430.14, "text": "Man musste einen Und machen und dann invertieren oder irgendwie sowas."}, {"id": 338, "start": 2432.14, "end": 2433.14, "text": "Ach, ich weiß es nicht mehr."}, {"id": 339, "start": 2434.14, "end": 2435.14, "text": "Scheiß drauf."}, {"id": 340, "start": 2436.14, "end": 2440.14, "text": "Xorn, ich kann, ich weiß es echt nicht mehr genau, wie das funktioniert."}, {"id": 341, "start": 2443.14, "end": 2445.14, "text": "Ja, das ist die schöne, das ist die IP-Kalge-Ausgabe."}, {"id": 342, "start": 2449.14, "end": 2451.14, "text": "Na klar, ich würde auch was fertiges nehmen."}, {"id": 343, "start": 2451.14, "end": 2453.14, "text": "Na klar, ich würde auch was fertiges nehmen."}, {"id": 344, "start": 2459.14, "end": 2460.14, "text": "Ja."}, {"id": 345, "start": 2461.14, "end": 2462.14, "text": "Gut."}, {"id": 346, "start": 2463.14, "end": 2466.14, "text": "Gut, dass wir das jetzt geklärt haben, dass ich nicht mehr weiß, wie es funktioniert."}, {"id": 347, "start": 2466.14, "end": 2483.14, "text": "Hallo Max, ich wollte dir nur mal sagen, dass du ein großer Teil meiner Jugend warst. Es ist schön, dass du deinen Weg hierher gefunden hast. Lil Pippo, oh das kann ich nicht ausbrechen. Lil Pippo Puss."}, {"id": 348, "start": 2487.14, "end": 2489.14, "text": "Was auch immer, aber ähm."}, {"id": 349, "start": 2489.14, "end": 2494.14, "text": "Ähm, damals hast du mich und Commander Krieger täglich nach der Schule geschaut."}, {"id": 350, "start": 2495.14, "end": 2496.14, "text": "Nice."}, {"id": 351, "start": 2497.14, "end": 2501.14, "text": "Freu mich immer über neue Videos, war mega sad, als du damals plötzlich einfach weg warst von YouTube."}, {"id": 352, "start": 2502.14, "end": 2505.14, "text": "Ich war ja nie wirklich weg von YouTube, das stimmt ja gar nicht."}, {"id": 353, "start": 2506.14, "end": 2510.14, "text": "Na gut, im Vergleich zu früher war ich ziemlich wenig aktiv die letzten Jahre."}, {"id": 354, "start": 2510.14, "end": 2515.14, "text": "Ah exquisite, ich sehe hier schon, äh, richtig quickscope Name am Start."}, {"id": 355, "start": 2516.14, "end": 2520.14, "text": "Aber wenn du hier guckst, ich meine ich hab die letzten Jahre nicht viel gemacht, ich war nie weg. Guckt euch das mal an."}, {"id": 356, "start": 2521.14, "end": 2523.14, "text": "Ich hab hier einfach diese Jahre kaum was gemacht, ne."}, {"id": 357, "start": 2524.14, "end": 2527.14, "text": "Früher, früher, hier pro Jahr, müsst ihr mal gucken."}, {"id": 358, "start": 2527.14, "end": 2540.14, "text": "Ja, pro Jahr, das hört gar nicht mehr auf sechs Jahre, sechs Jahre, sechs Jahre, sechs Jahre, sechs Jahre, sechs Jahre, sieben, sieben, sieben, sieben, sieben, sieben, sieben. Ja, ja, ja, total viel."}, {"id": 359, "start": 2541.14, "end": 2543.14, "text": "Und dann irgendwie fünf Videos pro Jahr zwischenzeitlich."}, {"id": 360, "start": 2544.14, "end": 2545.14, "text": "Ups, take weight."}, {"id": 361, "start": 2546.14, "end": 2548.14, "text": "Der Sebaro ist da."}, {"id": 362, "start": 2548.14, "end": 2549.14, "text": "Huge."}, {"id": 363, "start": 2549.14, "end": 2551.9, "text": "huge cute mod himself"}, {"id": 364, "start": 2559.02, "end": 2564.62, "text": "Und sebaro was macht das lehramts grill jetzt du hast das jetzt erzählt jetzt jetzt jetzt"}, {"id": 365, "start": 2565.74, "end": 2567.74, "text": "Interessiert es mich auch"}, {"id": 366, "start": 2571.3, "end": 2574.02, "text": "Aber wenn wenn es da was gebe hättest du es wahrscheinlich schon gesagt"}, {"id": 367, "start": 2574.02, "end": 2582.74, "text": "So also wir fangen jetzt mal an wir machen wir kurz gucken uns mal den beispiel beispiel kodra an"}, {"id": 368, "start": 2594.9, "end": 2599.58, "text": "Sie kann sich hausarbeiten aus dem arsch ziehen wie keine zweit ist jetzt was gutes oder was schlechtes"}, {"id": 369, "start": 2599.58, "end": 2606.66, "text": "Ich ich würde behaupten dass er baro klingt beeindruckt"}, {"id": 370, "start": 2620.46, "end": 2622.46, "text": "Ja sebaro das wird schon"}, {"id": 371, "start": 2622.46, "end": 2627.94, "text": "Du musst sie einfach von deinen cute mod qualitäten überzeugen dann"}, {"id": 372, "start": 2628.54, "end": 2634.26, "text": "Du kannst auch sagen du kannst auch sagen du bist discord admin und mod bei wubblers"}, {"id": 373, "start": 2635.3, "end": 2637.3, "text": "das zieht bestimmt wahnsinnig"}, {"id": 374, "start": 2639.7, "end": 2642.78, "text": "Ich muss mal gucken ob hetzner noch geantwortet hat auf den letzten drücker"}, {"id": 375, "start": 2642.78, "end": 2655.02, "text": "Weil ich bin schon ganz scharf drauf hetzner sell-out zu machen aber ich glaube das war zu kurz vor osten jetzt"}, {"id": 376, "start": 2664.74, "end": 2666.74, "text": "Die habe ich jetzt schon gewartet mit"}, {"id": 377, "start": 2666.74, "end": 2673.34, "text": "Vor allem das sind immer so so bescheuerte messages die die schicken"}, {"id": 378, "start": 2674.34, "end": 2676.78, "text": "Und was haben wir noch einen hier haben noch einen anderen"}, {"id": 379, "start": 2679.22, "end": 2684.34, "text": "Alexandra vom der marketing show manager alexandra ist am start"}, {"id": 380, "start": 2686.34, "end": 2688.34, "text": "Sie wollen mit irgendeinem video"}, {"id": 381, "start": 2688.9, "end": 2690.9, "text": "editor oder so verkaufen oder"}, {"id": 382, "start": 2691.42, "end": 2692.9, "text": "was auch"}, {"id": 383, "start": 2692.9, "end": 2696.9, "text": "Da so wen haben wir dann sonst noch ein ladung zur kooperation"}, {"id": 384, "start": 2700.78, "end": 2703.18, "text": "Ok ein ladung zur kooperation von"}, {"id": 385, "start": 2704.06, "end": 2705.82, "text": "wiki"}, {"id": 386, "start": 2705.82, "end": 2711.98, "text": "Boang alles klar was gibt es denn da das muss jetzt mal kurz hier was wollen sie was wollen sie kooperieren"}, {"id": 387, "start": 2713.94, "end": 2715.94, "text": "Guff"}, {"id": 388, "start": 2717.7, "end": 2719.7, "text": "Was ist"}, {"id": 389, "start": 2719.7, "end": 2726.78, "text": "Ok das gucken wir uns jetzt mal an ob wir mit denen kooperieren wollen was ist gut nicht kruf gut hieß das"}, {"id": 390, "start": 2728.82, "end": 2731.42, "text": "Ach nee guvee guvee oder so"}, {"id": 391, "start": 2735.58, "end": 2737.58, "text": "Wo wir oder gov gov"}, {"id": 392, "start": 2737.58, "end": 2740.58, "text": "Gov"}, {"id": 393, "start": 2746.86, "end": 2753.7, "text": "Warum kann google so komische wörter aussprechen ok ich habe kein sound lull was"}, {"id": 394, "start": 2755.74, "end": 2757.74, "text": "led strips aha"}, {"id": 395, "start": 2757.74, "end": 2763.58, "text": "led strips inklusive grills auf dem sofa ja da kann ich nicht nein sagen was was home improvement temp"}, {"id": 396, "start": 2764.14, "end": 2768.38, "text": "Ok das sieht tatsächlich nach irgendwas aus mit denen man was machen könnte indoor lightning"}, {"id": 397, "start": 2769.78, "end": 2771.78, "text": "lighting lightning"}, {"id": 398, "start": 2773.58, "end": 2775.58, "text": "led bulbs"}, {"id": 399, "start": 2777.58, "end": 2779.58, "text": "home improvement"}, {"id": 400, "start": 2782.3, "end": 2784.3, "text": "china korea"}, {"id": 401, "start": 2784.3, "end": 2786.78, "text": "china cloud"}, {"id": 402, "start": 2787.94, "end": 2792.26, "text": "Du hast recht das sieht aus wie diese 015 tuya light bulbs"}, {"id": 403, "start": 2795.22, "end": 2799.02, "text": "Aber das ist auf jeden fall was mit denen könnte man durchaus was machen was bieten sie denn an"}, {"id": 404, "start": 2803.46, "end": 2807.3, "text": "Die produkte erfreuen sich größter beliebtheit schreibt sie naja gut"}, {"id": 405, "start": 2808.38, "end": 2810.38, "text": "Das das würde ich auch sagen"}, {"id": 406, "start": 2810.38, "end": 2812.86, "text": "Das das würde ich auch sagen"}, {"id": 407, "start": 2821.78, "end": 2824.26, "text": "So gleichzeitig liegen unsere produkte"}, {"id": 408, "start": 2825.14, "end": 2830.42, "text": "Auch auf sozialen medien wie youtube tiktok und instagram voll im trend"}, {"id": 409, "start": 2831.1, "end": 2836.18, "text": "Nice ich werde ich ich kriege gov lampen und da werde ich zum huge tiktoker"}, {"id": 410, "start": 2836.18, "end": 2843.54, "text": "Darfst du schleich werden für ein led projekt machen ja auf gehts gucken wir uns dann gleich auf github an oder die projektseite schick einfach"}, {"id": 411, "start": 2845.5, "end": 2852.74, "text": "So es werden neue produkte vorgestellt sind auf meinem kanal aufmerksam und das research team ist aufmerksam geworden auf mein kanal"}, {"id": 412, "start": 2854.78, "end": 2857.82, "text": "Ok um einen besseren eindruck hinsichtlich unserer"}, {"id": 413, "start": 2858.34, "end": 2863.06, "text": "Produktpalette gewinnen zu können schauen sie doch folgenden link unter amazon an"}, {"id": 414, "start": 2863.06, "end": 2865.06, "text": "Ok machen wir"}, {"id": 415, "start": 2867.74, "end": 2869.74, "text": "Hallo"}, {"id": 416, "start": 2870.9, "end": 2872.9, "text": "Pass auf jetzt kommt irgendwie"}, {"id": 417, "start": 2874.82, "end": 2880.06, "text": "Weiß nicht ob ich das haben will ehrlich gesagt das sieht so so china klaudisch aus ja"}, {"id": 418, "start": 2882.46, "end": 2886.62, "text": "12 volt led strips das heißt die gehen auch relativ weit"}, {"id": 419, "start": 2886.62, "end": 2892.3, "text": "Ohne dass sie an farbe ich halt quasi verlieren aber"}, {"id": 420, "start": 2893.7, "end": 2895.7, "text": "Ansonsten erkenne ich da jetzt nicht so"}, {"id": 421, "start": 2900.94, "end": 2908.98, "text": "Wir arbeiten moment was wir arbeiten mit führenden calls in verschiedenen bereichen zusammen hat ihr mal eine ahnung was das für eine abkürzung ist"}, {"id": 422, "start": 2908.98, "end": 2927.82, "text": "Das ist die視"}, {"id": 423, "start": 2930.46, "end": 2935.06, "text": "Jetzt muss ich nicht nur it block kan cettejacko"}, {"id": 424, "start": 2935.06, "end": 2937.06, "text": "Sehe ich das richtig?"}, {"id": 425, "start": 2940.06, "end": 2942.06, "text": "Key Opinion Leader"}, {"id": 426, "start": 2942.06, "end": 2944.06, "text": "Also es ist quasi ein Influencer"}, {"id": 427, "start": 2944.06, "end": 2946.06, "text": "Und man ist schon zu cool"}, {"id": 428, "start": 2946.06, "end": 2948.06, "text": "Das mehr Influencer zu nennen"}, {"id": 429, "start": 2948.06, "end": 2949.06, "text": "Alles klar"}, {"id": 430, "start": 2949.06, "end": 2950.06, "text": "Schau mal auf Banggood"}, {"id": 431, "start": 2950.06, "end": 2951.06, "text": "Die haben die auch"}, {"id": 432, "start": 2951.06, "end": 2952.06, "text": "Ja bestimmt"}, {"id": 433, "start": 2952.06, "end": 2954.06, "text": "Banggood hat alles"}, {"id": 434, "start": 2954.06, "end": 2956.06, "text": "Die bangen halt"}, {"id": 435, "start": 2956.06, "end": 2958.06, "text": "Richtig"}, {"id": 436, "start": 2958.06, "end": 2960.06, "text": "Was sind das für Doktorspielchen hier?"}, {"id": 437, "start": 2962.06, "end": 2964.06, "text": "Ah"}, {"id": 438, "start": 2964.06, "end": 2966.06, "text": "Also gibt's da aber anscheinend nicht"}, {"id": 439, "start": 2974.06, "end": 2976.06, "text": "Das ist wahrscheinlich"}, {"id": 440, "start": 2976.06, "end": 2978.06, "text": "Das ist genau das gleiche"}, {"id": 441, "start": 2978.06, "end": 2980.06, "text": "Was die hier verkaufen"}, {"id": 442, "start": 2980.06, "end": 2982.06, "text": "Unter irgendeinem eigenen Label"}, {"id": 443, "start": 2982.06, "end": 2984.06, "text": "So was schreibe ich jetzt"}, {"id": 444, "start": 2984.06, "end": 2986.06, "text": "So was schreibe ich jetzt"}, {"id": 445, "start": 2986.06, "end": 2988.06, "text": "So was schreibe ich jetzt"}, {"id": 446, "start": 2988.06, "end": 2990.06, "text": "Sonst noch"}, {"id": 447, "start": 2992.06, "end": 2994.06, "text": "Oh jetzt haben sie ein Video gepostet"}, {"id": 448, "start": 2994.06, "end": 2996.06, "text": "Wo einer für sie Werbung gemacht"}, {"id": 449, "start": 2996.06, "end": 2998.06, "text": "Hat okay"}, {"id": 450, "start": 2998.06, "end": 3000.06, "text": "Okay da gucken wir mal rein"}, {"id": 451, "start": 3004.06, "end": 3006.06, "text": "Nee das gucken wir nicht"}, {"id": 452, "start": 3006.06, "end": 3008.06, "text": "Wir machen nicht noch mehr Werbung kostenlos"}, {"id": 453, "start": 3008.06, "end": 3010.06, "text": "Wir okay"}, {"id": 454, "start": 3010.06, "end": 3012.06, "text": "Wir sind überzeugt"}, {"id": 455, "start": 3012.06, "end": 3014.06, "text": "Dass unsere Produkte"}, {"id": 456, "start": 3014.06, "end": 3019.34, "text": "Wir sind überzeugt dass unser produkt ihnen und ihren fans gefällt chat meint ihr das könnt euch gefallen"}, {"id": 457, "start": 3019.86, "end": 3025.3, "text": "Wir freuen uns darauf mit ihnen tolle inhalte zu erstellen falls sie an einer kooperation interessiert sind schreiben sie mir bitte und"}, {"id": 458, "start": 3025.42, "end": 3027.94, "text": "Um weitere pläne für eine zusammenarbeit zu besprechen"}, {"id": 459, "start": 3031.22, "end": 3035.42, "text": "Ja ich mein fragen kostet ja nix kann ich ja da mal"}, {"id": 460, "start": 3035.42, "end": 3048.14, "text": "Nopas ich mache ganz ehrlich ich mach einfach sehr laut ich mach 30 mach 30 ich mach das wieder ich mach das wieder bauer jetzt wieder aua"}, {"id": 461, "start": 3048.86, "end": 3052.06, "text": "Ich mache einfach diese 15 20 sekunden"}, {"id": 462, "start": 3053.5, "end": 3055.5, "text": "Wollen sie wahrscheinlich sein ja"}, {"id": 463, "start": 3056.26, "end": 3060.9, "text": "Ich mach dann einfach 15 20 sekunden werbung rein dieses video ist gesponsert bei"}, {"id": 464, "start": 3060.9, "end": 3067.5, "text": "Bei guvi irgendwie bla bla bla led strips bla bla bla ganz tolle super neue technik bla bla bla fertig alles gut it's money"}, {"id": 465, "start": 3069.5, "end": 3072.18, "text": "So irgendjemand von werbung für sein led projekt machen"}, {"id": 466, "start": 3072.66, "end": 3078.5, "text": "Jonas dankeschön für den zap habe ich nicht über das habe ich habe ich habe ich nicht gesehen aber massive IQs boost wieder für den chat"}, {"id": 467, "start": 3078.94, "end": 3081.54, "text": "So wo gibt's wo gibt's werbung für das led projekt hier?"}, {"id": 468, "start": 3083.02, "end": 3084.66, "text": "exquisite"}, {"id": 469, "start": 3084.66, "end": 3086.94, "text": "self-made ambi light für den raspberry pi ok cool"}, {"id": 470, "start": 3086.94, "end": 3088.94, "text": "NG"}, {"id": 471, "start": 3090.3, "end": 3092.3, "text": "Das ist quasi das gab es schon mal oder wie"}, {"id": 472, "start": 3092.86, "end": 3094.86, "text": "Und jetzt ist jetzt im next next gen"}, {"id": 473, "start": 3095.9, "end": 3098.7, "text": "Das heißt das heißt es läuft jetzt auch auf der ps5"}, {"id": 474, "start": 3099.66, "end": 3108.22, "text": "Okay, leute ich muss aufhören so super lustige witte zu machen ich weiß aber huge guck mal hier ein kar sterne das ist ja schon ziemlich erfolgreich"}, {"id": 475, "start": 3110.38, "end": 3112.38, "text": "Zeigst mal her"}, {"id": 476, "start": 3113.42, "end": 3115.42, "text": "Schönes web interface"}, {"id": 477, "start": 3115.42, "end": 3121.42, "text": "Schönes web interface auf was was braucht man dafür also respire ganz vergessen"}, {"id": 478, "start": 3123.82, "end": 3127.34, "text": "NG ich hoffe nicht dass das ng für angela steht oder"}, {"id": 479, "start": 3131.14, "end": 3133.14, "text": "Weil bei angela heißt ja alles ng"}, {"id": 480, "start": 3134.9, "end": 3136.9, "text": "Ich habe bis heute nicht verstanden warum"}, {"id": 481, "start": 3136.9, "end": 3145.06, "text": "Okay cool das heißt wir funktionieren das weißt du was tp modding weißt du was"}, {"id": 482, "start": 3146.1, "end": 3148.58, "text": "Das probieren wir mal aus irgendwann im stream"}, {"id": 483, "start": 3150.42, "end": 3152.42, "text": "Was braucht man da alles dafür"}, {"id": 484, "start": 3156.58, "end": 3162.22, "text": "Muss man da irgendwie per hdmi sachen abgreifen oder per kamera oder oder wie funktioniert das von der idee her"}, {"id": 485, "start": 3162.22, "end": 3164.74, "text": "Weil irgendwie muss es ja an die bild infos kommen"}, {"id": 486, "start": 3166.78, "end": 3172.38, "text": "Per usb krabber ok du schließt quasi in usb capture device an und du dann wärtest"}, {"id": 487, "start": 3172.38, "end": 3177.58, "text": "Oh das war bestimmt nicht einfach ich stelle mir das kompliziert vor aus dem hdmi stream irgendwas auszulesen"}, {"id": 488, "start": 3181.58, "end": 3184.7, "text": "Aber das funktioniert nicht mit hdcp dann"}, {"id": 489, "start": 3184.7, "end": 3192.22, "text": "Weil ich gucke beispielsweise auf dem fernseh drüben relativ viel amazon und es wird wahrscheinlich mit hdcp nicht funktionieren"}, {"id": 490, "start": 3197.26, "end": 3199.26, "text": "Denke ich mal"}, {"id": 491, "start": 3204.62, "end": 3207.26, "text": "Oder hast du kodi auf dem pay nee gar nicht"}, {"id": 492, "start": 3207.26, "end": 3213.58, "text": "Ich habe einen nvidia schild und einen otroid hc2 so ein ding"}, {"id": 493, "start": 3214.94, "end": 3221.66, "text": "Mit einer festplatte für tv geschichten zum für fernsehaufnahmen so ein teil hier"}, {"id": 494, "start": 3221.66, "end": 3227.98, "text": "Ach man kann sich ernsthaft man kann sich hdcp lizenzen kaufen ich dachte für hdcp muss man quasi"}, {"id": 495, "start": 3229.5, "end": 3232.94, "text": "Jahrzehntelange lobby arbeit leisten dass das das bekommt"}, {"id": 496, "start": 3233.98, "end": 3238.3, "text": "Ja, ju ist aber auf jeden Fall nicht so schlecht wie hdcp"}, {"id": 497, "start": 3239.58, "end": 3245.34, "text": "Aber ich glaube das ist ein bisschen ein bisschen ein bisschen ein bisschen ein bisschen ein bisschen ein bisschen"}, {"id": 498, "start": 3245.34, "end": 3252.3, "text": "Jahrzehntelange lobby arbeit leisten dass das das bekommt ja ju ist aber auch philips dahinter"}, {"id": 499, "start": 3252.3, "end": 3256.7, "text": "Die haben damit kein problem die sind nicht in den ich nenne es mal in die entwickler auf github"}, {"id": 500, "start": 3256.7, "end": 3274.54, "text": "Alternativ kann man auch irgendwelche hdcp entferner dazwischen schalten die man ja eigentlich gar nicht haben darf"}, {"id": 501, "start": 3274.54, "end": 3288.14, "text": "Also ich habe also ich ich kann per hdmi gucken per hdcp und das funktioniert ich habe ja so ein ding hier als es das noch gab"}, {"id": 502, "start": 3288.14, "end": 3305.34, "text": "Dreamlite tv nicht dreamscreen habe ich drüben bei mir am am fernseh und das funktioniert mit hdmi leider nur bis bis 1080p"}, {"id": 503, "start": 3305.34, "end": 3308.54, "text": "Danach mag es nicht da stimmen die farben nicht"}, {"id": 504, "start": 3308.54, "end": 3320.94, "text": "Ambilite mit kodi ist easy ja aber wie gesagt du kriegst den kodi nicht so einfach einfach die videos aus beispielsweise der amazon app rein"}, {"id": 505, "start": 3320.94, "end": 3328.94, "text": "Das funktioniert nicht das muss auf tiefere ebene passieren die farben sind wegen hdr nicht wegen 4k"}, {"id": 506, "start": 3328.94, "end": 3339.74, "text": "Das kann tatsächlich sein ja aber ich habe kein 4k dreamscreen also der hat probleme mit mit höheren auflösungen"}, {"id": 507, "start": 3339.74, "end": 3344.14, "text": "Ich glaube ich habe sogar hdr ausgeschaltet zum ausprobieren"}, {"id": 508, "start": 3344.14, "end": 3356.14, "text": "Aber zumindest das ding ist nice das kann das halt auch mit hdr hdcp leider gibt es das nicht mehr die sind pleite gegangen aber es gibt noch ein paar andere sachen"}, {"id": 509, "start": 3356.14, "end": 3362.94, "text": "Aber letztendlich wurscht das ist aber eine gute idee das kann man mal ausprobieren"}, {"id": 510, "start": 3362.94, "end": 3364.94, "text": "Das kann man mal ausprobieren"}, {"id": 511, "start": 3370.94, "end": 3378.94, "text": "Das funktioniert auf dem shield tv nicht richtig du brauchst du musst die offizielle amazon app aufmachen dass es gescheit funktioniert"}, {"id": 512, "start": 3378.94, "end": 3391.74, "text": "Ansonsten klar du kannst es noch über den browser machen aber das ist dann auch mehr also ich bin mittlerweile weggekommen davon dass ich überall irgendwie custom lösungen basteln"}, {"id": 513, "start": 3391.74, "end": 3397.74, "text": "So leute also wir haben jetzt gelernt ich bin ein influencer ist out ich bin jetzt auch zum col aufgestiegen"}, {"id": 514, "start": 3397.74, "end": 3406.54, "text": "Ich bin jetzt quasi influencer und key opinion leader und deswegen mache ich demnächst led sellout easy perfekt mache ich einfach mal"}, {"id": 515, "start": 3406.54, "end": 3410.14, "text": "So und jetzt kommen wir mal zur eigentlichen sache die wir die ganze zeit schon machen wollen"}, {"id": 516, "start": 3410.14, "end": 3416.94, "text": "Genau nämlich gucken wie ich von meinem sensor batterien status auslesen kann"}, {"id": 517, "start": 3416.94, "end": 3425.74, "text": "Ja twingo geht mir ähnlich ich will einfach sachen die gut funktionieren"}, {"id": 518, "start": 3425.74, "end": 3437.74, "text": "Ich mache es mittlerweile so wenn es was fertiges gibt was so zum größten teil passt dann nehme ich das aber halt auch nur wenn da sonst nichts dagegen spricht"}, {"id": 519, "start": 3437.74, "end": 3444.54, "text": "Also ich nehme zum beispiel nichts mit china cloud dann flashe ich das aber am liebsten mit custom firmen aber halt mit irgendwas fertiges was ich nicht mehr selbst programmieren muss"}, {"id": 520, "start": 3444.54, "end": 3450.94, "text": "Für so sachen wie das hier erstens habe ich da immer noch spaß dran und außerdem gibt es da nichts fertiges was das so macht wie ich das haben will"}, {"id": 521, "start": 3450.94, "end": 3455.74, "text": "Warum juckt es netflix welches gerät ich zum stream verwende"}, {"id": 522, "start": 3455.74, "end": 3467.34, "text": "Ja warum gibt es mittlerweile eine allianz zwischen providers und content anbietern um sachen zu blocken wegen stonks und geld"}, {"id": 523, "start": 3467.34, "end": 3476.54, "text": "Also ich wollte mir nämlich mal angucken wie der typ hier das macht also es gibt irgendwelche ids so die id für die batterie brauchen wir"}, {"id": 524, "start": 3476.54, "end": 3487.74, "text": "Der wifi connect um mqtt juckt mich net disconnect mqtt juckt mich auch net flora klein okay hier können es langsam interessant werden"}, {"id": 525, "start": 3487.74, "end": 3496.54, "text": "Okay okay boah ach du scheiße das ist ja mit ach moment ne hier liest ihr die sachen aus die schon ausgelesen habe das ist egal"}, {"id": 526, "start": 3496.54, "end": 3514.14, "text": "Battery characteristics ist vielleicht noch interessant okay process flora service process flora device okay okay es ist"}, {"id": 527, "start": 3514.14, "end": 3523.14, "text": "Okay process flora device address device mecha dress read battery das heißt hier geht es los"}, {"id": 528, "start": 3523.14, "end": 3532.74, "text": "Also wir brauchen eine adresse und wir brauchen eine mech die adresse habe ich die adresse habe ich das ist nämlich das da"}, {"id": 529, "start": 3532.74, "end": 3549.94, "text": "Wobei moment ich kann einfach den kompletten sensor übergeben flora sensor sensor weil den sensor haben wir ja da den haben wir hier oben angelegt"}, {"id": 530, "start": 3549.94, "end": 3565.94, "text": "So das rufen wir jetzt einfach für jeden sensor auf alle jede sekunde so update battery level und zwar für den sensor muss man das jetzt auch mit"}, {"id": 531, "start": 3565.94, "end": 3581.94, "text": "Und übergeben weil es ist ja immer noch 10 plus plus das ist nicht zwangsläufig logisch ja wenn die telekom das auf twitter antwortet ist das natürlich die verlässlichste"}, {"id": 532, "start": 3581.94, "end": 3593.94, "text": "Quelle von jemanden dabei ist das ist wie wenn du mich fragst max wer macht die besten videos auf youtube da bin ich sicherlich auch äußerst objektiv ich"}, {"id": 533, "start": 3593.94, "end": 3605.94, "text": "Ich meine ich bin am wenigsten so fair und würde sagen möchte ich selbst nennen weil ich das mir zu doof vorkomme aber"}, {"id": 534, "start": 3605.94, "end": 3625.94, "text": "Okay also hier kriegen wir jetzt den sensor wie müssen wir jetzt anfangen wir brauchen erst mal wie geht es denn jetzt aus processing die weiß all die das ist debug geblubber das braucht man nicht get flora kleint okay mit get flora kleint geht es los le device create kleint"}, {"id": 535, "start": 3625.94, "end": 3645.94, "text": "Okay das ist das einzige was er hier drin macht das kriege ich auch hin wobei wir können einfach auto nehmen nennen wir das mal kleint gibt er nicht viele möglichkeiten"}, {"id": 536, "start": 3645.94, "end": 3662.94, "text": "So create kleint exzellent so wie geht es weiter wenn kleint not connect es muss kleint connect machen okay kleint connect und wohin"}, {"id": 537, "start": 3662.94, "end": 3682.94, "text": "Max dps der channel den hat deshalb ja das mit max dps war ziemlich doof von mir auf youtube ich wollte ja ich wollte ja overwatch videos machen und ich habe einen neuen channel erstellt für overwatch videos genau dann wo ich aufgehört habe mit overwatch was richtig hängen geblieben ist"}, {"id": 538, "start": 3682.94, "end": 3706.94, "text": "Richtig sixhead ja"}, {"id": 539, "start": 3706.94, "end": 3728.94, "text": "Ja wahrscheinlich die meisten wobei meine frage macht ich macht es ja öfters mal wer ist von youtube an dem müssen wir umgedreht fragen wer kommt nicht von youtube wer kommt nicht von youtube wir haben ich weiß dass wir mittlerweile schon einige haben die es auch nur über twitch gefunden haben eins"}, {"id": 540, "start": 3728.94, "end": 3738.94, "text": "Die eine oder andere gibt es das weiß ich finde ich nice"}, {"id": 541, "start": 3738.94, "end": 3760.94, "text": "Ne brauche ich keine umfrage für twitch und wie auf twitch wahrscheinlich über irgendwelche irgendwelche empfehlung unten links ne du kommst von pornhub ja bestimmt von von tanzverbots channel wobei der ist ja gelöscht tanzverbot gibt es ja nicht mehr auf pornhub"}, {"id": 542, "start": 3760.94, "end": 3778.94, "text": "Er ist ja oder zumindest die videos gibt es ja nicht mehr wer übrigens nicht wusste dass er den pornhub channel hat leute vergesst einfach was ich gesagt habe ihr müsst jetzt nicht nachgucken das ist eigentlich nicht unbedingt das was man so sehen will"}, {"id": 543, "start": 3778.94, "end": 3794.94, "text": "Aber ansonsten zur allgemeinen bildung trägt es ja auch beine man muss ja muss ja bescheid wissen"}, {"id": 544, "start": 3794.94, "end": 3816.94, "text": "Auf dem er regelmäßig oder regelmäßig halbwegs regelmäßig porno reviews gemacht hat auf pornhub war ein bisschen merkwürdiges format da saß er quasi halb naggisch mit dem handtuch um und hat siniert über irgendwelche aktuellen pornsachen"}, {"id": 545, "start": 3816.94, "end": 3826.94, "text": "Ich weiß auch gar nicht woher warum ich das überhaupt weiß und warum ich das überhaupt geguckt habe ich egal egal"}, {"id": 546, "start": 3826.94, "end": 3849.94, "text": "Ich weiß auch nicht wieso guckt man sowas ich weiß es auch nicht ich weiß es auch nicht ich habe das zumindest stückchenweise angeschaut tanzverbot"}, {"id": 547, "start": 3849.94, "end": 3865.94, "text": "So aber zur eigentlichen wichtigen sache zurück was muss man jetzt mal muss gucken ob das ganze heute ich muss ich muss den da krieg ich krieg ich werde halb blind wenn ich wenn ich hier umschalte zwischen editor und browser das blendet übelst"}, {"id": 548, "start": 3865.94, "end": 3879.94, "text": "Ok get flora klein brauchen was haben wir gemacht und jetzt muss man checken ob das ganze connected ist das ist ziemlich komplizierter check ums auszuprobieren glaube ich"}, {"id": 549, "start": 3879.94, "end": 3901.94, "text": "Die groovy elektrik zwitschbein dankeschön für sechs monate subscription massive sub huge subscribers hier wieder warum sind wir noch im just chatting warum nicht passt doch just chatting ist kategorie alles"}, {"id": 550, "start": 3901.94, "end": 3909.94, "text": "Und ich habe das gefühl just chatting finden prinzipiell mehr leute als science und technology"}, {"id": 551, "start": 3909.94, "end": 3930.94, "text": "So aber jetzt machen wir ein bisschen science und technology wo sind wir stehen geblieben muss das endlich mal was machen also wir gucken jetzt ob das ding connected ist also kann man da jetzt sowas machen wenn das gleich null ist dann was ist eigentlich der unterschied mal die 10 plus plus pros was ist der unterschied zwischen gleich gleich null und gleich gleich null pointer"}, {"id": 552, "start": 3930.94, "end": 3945.94, "text": "Und wenn es das gleiche ist warum gibt es da zwei verschiedene dinger keiner okay warum gibt es dann zwei dinger"}, {"id": 553, "start": 3945.94, "end": 3971.94, "text": "Das eine ist ein def das andere ist ein keyword aha okay ach moment das ist ein bool if not connected dann machen wir mal eine ausgabe print con failed"}, {"id": 554, "start": 3971.94, "end": 3981.94, "text": "Funktion ist jetzt dann return zack"}, {"id": 555, "start": 3981.94, "end": 3985.94, "text": "If null gleich gleich null das funktioniert was das geht wahrscheinlich"}, {"id": 556, "start": 3985.94, "end": 3996.94, "text": "Okay dann aber uns connected okay was macht er als nächstes"}, {"id": 557, "start": 3996.94, "end": 4008.94, "text": "Ganz schön umständlich get flora service macht er dann im prinzip genau der gleiche krempel wie er vorher auch schon gemacht hat also quasi"}, {"id": 558, "start": 4008.94, "end": 4029.94, "text": "client get service ach service uid brauchen wir jetzt also sowas hier quasi jetzt können wir mal 10 plus plus sachen verwenden dass er das nur einmal macht so und wahrscheinlich brauchen wir die battery dann später auch noch das triggert mich schon wieder dass das anders geschrieben ist"}, {"id": 559, "start": 4029.94, "end": 4044.94, "text": "Der beste z plus plus ist nicht logisch zu hinterfragen ja das ist richtig"}, {"id": 560, "start": 4044.94, "end": 4067.94, "text": "Was nicht if not connected if connecting failed wieso ist doch richtig wenn wenn connect nicht geklappt hat dann connect failed oder ist es oder ist es eher ein ein ein grammatik hinweis"}, {"id": 561, "start": 4067.94, "end": 4087.94, "text": "Also ich meine if not connected ist eigentlich trifft ziemlich gut was das hier macht so get service das gibt einen pointer zurück okay auto service"}, {"id": 562, "start": 4087.94, "end": 4102.94, "text": "So und dann checken wir jetzt wenn das service null ist null dann schreiben wir service failed mein irgendwas muss ich hinschreiben service failed return"}, {"id": 563, "start": 4102.94, "end": 4113.94, "text": "Und jetzt ist die frage gibt so was wie disconnect disabo da machen wir das nämlich auch noch davor wisst ihr was jetzt cool wäre"}, {"id": 564, "start": 4113.94, "end": 4124.94, "text": "Irgendwas wo man sicherstellen könnte so einen try catch finally oder defer oder sowas aus go wo man sicherstellen könnte oder vielleicht gibt es ja sowas mit z plus plus und ich kenne es nicht"}, {"id": 565, "start": 4124.94, "end": 4134.94, "text": "Wo ich sicherstellen könnte dass er immer das hier macht bevor er aus der Methode rausgeht quasi so einen so einen finally block gibt sowas"}, {"id": 566, "start": 4134.94, "end": 4145.94, "text": "Nee oder? Wahrscheinlich gibt sowas nicht das ist zu zu advanced dafür"}, {"id": 567, "start": 4145.94, "end": 4156.94, "text": "Okay get service da sind wir stehen geblieben blabla something wrong ja blabla wunderbar vielleicht vielleicht schreiben wir noch hin vielleicht schreiben wir noch dass ich das besser debatten kann"}, {"id": 568, "start": 4156.94, "end": 4171.94, "text": "Keine connection okay und hier schreiben wir hin service okay wenn du wiss ob der kram dann auch getan hat so was macht er denn jetzt als nächstes"}, {"id": 569, "start": 4171.94, "end": 4192.94, "text": "process flora service force flora service data mode aber nicht oder ich weiß nicht was es macht aber wir machen jetzt wir machen jetzt massive go to"}, {"id": 570, "start": 4192.94, "end": 4204.94, "text": "Das war jetzt ich wollte schon immer ich habe noch nie go to in z plus plus verwendet allein schon weil das das pains champion ist was man angeblich machen kann das war jetzt"}, {"id": 571, "start": 4204.94, "end": 4226.94, "text": "Wir bauen das jetzt mit go to einfach nur stop doch wir waren jetzt go to"}, {"id": 572, "start": 4226.94, "end": 4250.94, "text": "Aber das sieht man schon mal wieder das sieht man schon mal wieder das go to scheiße ist weil ich kann jetzt nicht sowas machen dann gebe ich am ende nehme ich immer connection failed aus und das will ich gar nicht"}, {"id": 573, "start": 4250.94, "end": 4262.94, "text": "Da kann ich wieder da kann ich wieder keine ordentliche fehlermeldung ausgeben weil wenn schon hätte ich sowas machen wollen"}, {"id": 574, "start": 4262.94, "end": 4283.94, "text": "Ja ne komm scheiß drauf wir lassen es bleiben Fehler gibt es nicht das ist genauso wie das du weißt ja auch guter code dokumentiert sich selbst"}, {"id": 575, "start": 4283.94, "end": 4294.94, "text": "Okay also das im service hat funktioniert was muss man jetzt als nächstes machen process flora service read battery characteristics müssen wir jetzt machen"}, {"id": 576, "start": 4294.94, "end": 4314.94, "text": "Read battery characteristics wie funktioniert es jetzt flora service get characteristics und dann die id form von der batterie also hier ist das service okay das service heißt einfach nur service"}, {"id": 577, "start": 4314.94, "end": 4330.94, "text": "Und jetzt ist batterie juju id nachdem ich nicht weiß was ich da mache nenne ich es einfach mal so ich habe keine ahnung was das eigentlich genau macht aber"}, {"id": 578, "start": 4330.94, "end": 4340.94, "text": "So und jetzt muss ich wahrscheinlich wieder gucken ob das null ist ne genau im prinzip der gleiche schmodder wie hier oben nur nicht dafür sondern dafür"}, {"id": 579, "start": 4340.94, "end": 4347.94, "text": "Und jetzt machen wir irgendwie char failed was auch immer"}, {"id": 580, "start": 4347.94, "end": 4353.94, "text": "Hauptsache char wurde so schön doppeldeutig dass keiner versteht was gemeint ist"}, {"id": 581, "start": 4353.94, "end": 4360.94, "text": "So und jetzt"}, {"id": 582, "start": 4360.94, "end": 4375.94, "text": "Oh jetzt jetzt kommt jetzt kommt magic value i read value read value okay okay read value value string string value alles klar"}, {"id": 583, "start": 4375.94, "end": 4391.94, "text": "Also"}, {"id": 584, "start": 4391.94, "end": 4397.94, "text": "Macht er da irgendwas read value"}, {"id": 585, "start": 4397.94, "end": 4405.94, "text": "Der redet einfach und dann holt er sich die bytes davon okay"}, {"id": 586, "start": 4405.94, "end": 4431.94, "text": "Nennen wir es mal irgendwie battery value hoffe mal dass das funktioniert ich hab ich hab da meine zweifel dass das jetzt gleich beim uploaden irgendwas irgendwas macht so so battery value und jetzt und jetzt aus irgendwelchen gründen was okay das brauche ich net das brauche ich nicht das brauche ich auch"}, {"id": 587, "start": 4431.94, "end": 4443.94, "text": "Okay moment was was was was was was was battery value ist im prinzip bei mir das da ach und jetzt kommt der int"}, {"id": 588, "start": 4443.94, "end": 4464.94, "text": "Battery level wir gehen hier wir gehen die ordentlichen variable namen aus ist null und und für was ist der crap da unten einfach zum printen ja gut das brauche ich nicht"}, {"id": 589, "start": 4464.94, "end": 4475.94, "text": "Vielleicht sollte ich noch checken ob das ob da die länge wir machen das doch anders machen das mal so"}, {"id": 590, "start": 4475.94, "end": 4484.94, "text": "Ob da die länge größer null ist oder gleich null also wenn hier die länge"}, {"id": 591, "start": 4484.94, "end": 4489.94, "text": "Gleich null ist dann"}, {"id": 592, "start": 4489.94, "end": 4502.94, "text": "Read failed danach habe ich das battery level und jetzt kann ich sagen sensor battery level oder battery gleich battery level"}, {"id": 593, "start": 4502.94, "end": 4511.94, "text": "So chat wir brauchen eine abstimmung geht es jetzt nachdem ich hoch lade oder nicht"}, {"id": 594, "start": 4511.94, "end": 4519.94, "text": "Falls ein mod da ist eine abstimmung machen wir machen mal eine abstimmung ob das funktioniert oder wir können wetter machen ja wir können channel point prediction"}, {"id": 595, "start": 4519.94, "end": 4526.94, "text": "Wir können channel point wir machen channel point prediction"}, {"id": 596, "start": 4526.94, "end": 4530.94, "text": "Channel point prediction"}, {"id": 597, "start": 4530.94, "end": 4536.94, "text": "Mods sind glaube alle wieder afk mod check mod check"}, {"id": 598, "start": 4536.94, "end": 4542.94, "text": "Oh ne es geht es geht tatsächlich"}, {"id": 599, "start": 4542.94, "end": 4547.94, "text": "Am ende machen wir noch einen disconnect das ist dann auch"}, {"id": 600, "start": 4547.94, "end": 4557.94, "text": "Achso und ich brauche noch sensor last battery check"}, {"id": 601, "start": 4557.94, "end": 4567.94, "text": "Sp get time"}, {"id": 602, "start": 4567.94, "end": 4573.94, "text": "So also prediction"}, {"id": 603, "start": 4573.94, "end": 4581.94, "text": "Wer predictet ja was"}, {"id": 604, "start": 4581.94, "end": 4589.94, "text": "Funktioniert Fragezeichen Tja"}, {"id": 605, "start": 4589.94, "end": 4599.94, "text": "Mal gucken was da rauskommt jetzt bin ich gespannt"}, {"id": 606, "start": 4599.94, "end": 4602.94, "text": "Die ist weg"}, {"id": 607, "start": 4602.94, "end": 4610.94, "text": "Ich sehe nicht was da rausgekommen ist"}, {"id": 608, "start": 4610.94, "end": 4616.94, "text": "Was ist denn rausgekommen"}, {"id": 609, "start": 4616.94, "end": 4624.94, "text": "Ist noch da also ich sehe es bei mir nicht 7 und 5 prozent nein"}, {"id": 610, "start": 4624.94, "end": 4633.94, "text": "Kurze Idee von dem Projekt also mal ganz kurz ich habe davon ein sensor und davon habe ich ein paar"}, {"id": 611, "start": 4633.94, "end": 4643.94, "text": "Und die sind eigentlich dafür da um Blumentöpfe abzufragen Bodenfeuchtigkeit Temperatur Licht und ich habe mir gedacht wir machen das so ich leg das Ding in Kühlschrank"}, {"id": 612, "start": 4643.94, "end": 4651.94, "text": "Und ich erkenne anhand des Lichtsensors ob ich die Tür aufgelassen habe und an der Temperatur ob ich ob ich vielleicht Stromausfall habe oder irgendwas mit dem Kühlschrank nicht stimmt"}, {"id": 613, "start": 4651.94, "end": 4658.94, "text": "Weil mein Kühlschrank macht teilweise merkwürdige Geräusche und muss manchmal neu gestartet werden und ich hätte gerne Notification wenn das Ding am abtauen ist"}, {"id": 614, "start": 4658.94, "end": 4663.94, "text": "Und nachdem das ganze Ding Bluetooth wireless ist"}, {"id": 615, "start": 4663.94, "end": 4669.94, "text": "So ok also ja 43 prozent nein 5 prozent"}, {"id": 616, "start": 4669.94, "end": 4673.94, "text": "Da fehlt was 25 50 wahrscheinlich"}, {"id": 617, "start": 4673.94, "end": 4678.94, "text": "Mein Kühlschrank brauchen eine Reboot ja ok ich mache jetzt nicht weiter wir uploaden jetzt Serial"}, {"id": 618, "start": 4678.94, "end": 4685.94, "text": "Wir uploaden jetzt und gucken ob das funktioniert Moment erst ruf ich das überhaupt auf"}, {"id": 619, "start": 4685.94, "end": 4693.94, "text": "Ja ok"}, {"id": 620, "start": 4693.94, "end": 4697.94, "text": "Also ob das hier funktioniert"}, {"id": 621, "start": 4697.94, "end": 4706.94, "text": "Falls ich irgendwie vergessen habe die Funktion aufzurufen oder so dann zählt das weder alles hat funktioniert hat nicht funktioniert dann fix ich das und dann gucken ob es funktioniert hat"}, {"id": 622, "start": 4706.94, "end": 4713.94, "text": "So also"}, {"id": 623, "start": 4713.94, "end": 4716.94, "text": "Invalid Pair Address"}, {"id": 624, "start": 4716.94, "end": 4720.94, "text": "Warum"}, {"id": 625, "start": 4720.94, "end": 4733.94, "text": "Ok es funktioniert nicht"}, {"id": 626, "start": 4733.94, "end": 4748.94, "text": "Es funktioniert nicht"}, {"id": 627, "start": 4748.94, "end": 4753.94, "text": "Warum ok ok warum funktioniert es nicht"}, {"id": 628, "start": 4753.94, "end": 4756.94, "text": "Invalid Pair Address 0"}, {"id": 629, "start": 4756.94, "end": 4762.94, "text": "Was"}, {"id": 630, "start": 4762.94, "end": 4767.94, "text": "Warum ist die Adresse 0"}, {"id": 631, "start": 4767.94, "end": 4774.94, "text": "Address"}, {"id": 632, "start": 4774.94, "end": 4778.94, "text": "Warum ist die Adresse 0"}, {"id": 633, "start": 4778.94, "end": 4784.94, "text": "Hä"}, {"id": 634, "start": 4784.94, "end": 4799.94, "text": "Hier euch depp hier hätte ich die Adresse übergeben müssen guck mal alles gebastelt und der Fehler sind die ersten Zeile"}, {"id": 635, "start": 4799.94, "end": 4802.94, "text": "Ok Sensor"}, {"id": 636, "start": 4802.94, "end": 4809.94, "text": "Address ok nochmal ausprobieren"}, {"id": 637, "start": 4809.94, "end": 4815.94, "text": "By the way warum kann ich überhaupt einen Client erzeugen ohne eine Adresse anzugeben warum ist das denn überhaupt erlaubt"}, {"id": 638, "start": 4815.94, "end": 4825.94, "text": "Einmal beliebt der Grip"}, {"id": 639, "start": 4825.94, "end": 4828.94, "text": "Und jetzt"}, {"id": 640, "start": 4828.94, "end": 4832.94, "text": "Connection ok Service ok"}, {"id": 641, "start": 4832.94, "end": 4834.94, "text": "Connection failed"}, {"id": 642, "start": 4834.94, "end": 4836.94, "text": "Service ok"}, {"id": 643, "start": 4836.94, "end": 4838.94, "text": "Already exists"}, {"id": 644, "start": 4838.94, "end": 4848.94, "text": "Connection already exists wieso ich klausel das doch immer"}, {"id": 645, "start": 4848.94, "end": 4854.94, "text": "Ok ich glaube ich weiß woran das liegt dass es nicht funktioniert"}, {"id": 646, "start": 4854.94, "end": 4857.94, "text": "Ok"}, {"id": 647, "start": 4857.94, "end": 4865.94, "text": "Crash"}, {"id": 648, "start": 4865.94, "end": 4868.94, "text": "Ich glaube ich weiß woran das liegt"}, {"id": 649, "start": 4868.94, "end": 4872.94, "text": "Ich darf nicht ich vermute mal ich vermute mal ich darf nicht"}, {"id": 650, "start": 4872.94, "end": 4875.94, "text": "Scannen und mich"}, {"id": 651, "start": 4875.94, "end": 4877.94, "text": "Gleichzeitig connecten"}, {"id": 652, "start": 4877.94, "end": 4883.94, "text": "Ich glaube das geht schlicht und ergreifend in die Hose"}, {"id": 653, "start": 4883.94, "end": 4886.94, "text": "Ok machen wir das in it hier"}, {"id": 654, "start": 4886.94, "end": 4889.94, "text": "Und den scan hier unten drunter"}, {"id": 655, "start": 4889.94, "end": 4895.94, "text": "Scan gut dann scanen wir auch"}, {"id": 656, "start": 4895.94, "end": 4897.94, "text": "Wir scanen für 5 Sekunden"}, {"id": 657, "start": 4897.94, "end": 4900.94, "text": "Wir scanen alle"}, {"id": 658, "start": 4900.94, "end": 4906.94, "text": "Was weiß ich wir scanen alle 200 Millisekunden"}, {"id": 659, "start": 4906.94, "end": 4915.94, "text": "Also wir scanen im Intervall für alle 200 Millisekunden 100 Millisekunden lang ok passt Upload"}, {"id": 660, "start": 4915.94, "end": 4920.94, "text": "Und das machen wir dann nach einer Sekunde wieder ok"}, {"id": 661, "start": 4920.94, "end": 4924.94, "text": "Gibt es nicht immer einen Parameterlosen Constructor in C++"}, {"id": 662, "start": 4924.94, "end": 4926.94, "text": "Nee nicht zwangsläufig"}, {"id": 663, "start": 4926.94, "end": 4935.94, "text": "Ich kann meinen Constructor private machen da gibt es keinen"}, {"id": 664, "start": 4935.94, "end": 4946.94, "text": "Ok"}, {"id": 665, "start": 4946.94, "end": 4953.94, "text": "Hat der Upload gerade nicht funktioniert"}, {"id": 666, "start": 4953.94, "end": 4961.94, "text": "Warum geht das jetzt nicht"}, {"id": 667, "start": 4961.94, "end": 4965.94, "text": "Oh Mensch"}, {"id": 668, "start": 4965.94, "end": 4972.94, "text": "Wahrscheinlich ist es wieder was ganz Simples"}, {"id": 669, "start": 4972.94, "end": 4983.94, "text": "Und warum crashed er immer erstmal nachdem ich mich neu connected habe"}, {"id": 670, "start": 4983.94, "end": 4991.94, "text": "Er weiß es wirklich nicht"}, {"id": 671, "start": 4991.94, "end": 4993.94, "text": "Machst du noch was"}, {"id": 672, "start": 4993.94, "end": 5003.94, "text": "Reset"}, {"id": 673, "start": 5003.94, "end": 5004.94, "text": "Wo ist das jetzt"}, {"id": 674, "start": 5004.94, "end": 5006.94, "text": "Ah jetzt ok"}, {"id": 675, "start": 5006.94, "end": 5011.94, "text": "Connection ok service ok und jetzt hängt er"}, {"id": 676, "start": 5011.94, "end": 5017.94, "text": "What the fuck"}, {"id": 677, "start": 5017.94, "end": 5021.94, "text": "Ok"}, {"id": 678, "start": 5021.94, "end": 5026.94, "text": "Print also scan start"}, {"id": 679, "start": 5026.94, "end": 5030.94, "text": "Ich muss sehen was da vor sich geht scan end"}, {"id": 680, "start": 5030.94, "end": 5036.94, "text": "Ich muss ja ich muss ja wissen was was was los ist"}, {"id": 681, "start": 5036.94, "end": 5058.94, "text": "Keine facecam null facecam ja ich weiß ich bin bekannt für meine streams mit facecam aber heute habe ich ausgelassen"}, {"id": 682, "start": 5058.94, "end": 5074.94, "text": "scan start scan end scan start"}, {"id": 683, "start": 5074.94, "end": 5081.94, "text": "Hier ok ok der sagt immer ok und dann was passiert hier"}, {"id": 684, "start": 5081.94, "end": 5092.94, "text": "Ok vielleicht funktioniert ja sogar alles ich müsste noch read ok oder sowas sagen"}, {"id": 685, "start": 5092.94, "end": 5114.94, "text": "Read ok und jetzt muss ich noch das Batterie das Batterie Level ausgeben"}, {"id": 686, "start": 5114.94, "end": 5124.94, "text": "Upload"}, {"id": 687, "start": 5124.94, "end": 5128.94, "text": "Ok stimmt ich gebe ja gar nichts aus kein Wunder dass ich nichts sehe"}, {"id": 688, "start": 5128.94, "end": 5131.94, "text": "Ist ja eigentlich logisch wenn man nichts ausgibt kann man auch nichts sehen"}, {"id": 689, "start": 5131.94, "end": 5136.94, "text": "Huge Schweißheit"}, {"id": 690, "start": 5136.94, "end": 5140.94, "text": "Ok Temperatur Temperatur scan scan scan scan end"}, {"id": 691, "start": 5140.94, "end": 5145.94, "text": "Hier Batterie 99 ok es ist gedroppt letztes mal"}, {"id": 692, "start": 5145.94, "end": 5151.94, "text": "Ach nee das ich hab mich selbst gebadet die Meldung die wir heute Morgen reingeschrieben haben"}, {"id": 693, "start": 5151.94, "end": 5158.94, "text": "Batterie 100% die war ja hardcoded 100% die Batterie war ja die richtigen Batteriewert habe ich ja nie auslesen"}, {"id": 694, "start": 5158.94, "end": 5165.94, "text": "Aber was ich jetzt gerade so richtig realisiere ist das auslesen funktioniert Leute"}, {"id": 695, "start": 5165.94, "end": 5176.94, "text": "99% mir ist es sogar lieber wenn da 99% steht dann weiß ich nämlich dass das prinzipiell funktioniert"}, {"id": 696, "start": 5176.94, "end": 5180.94, "text": "Was hältst du von Low Code was ist denn Low Code"}, {"id": 697, "start": 5180.94, "end": 5184.94, "text": "Ich kenne nur Big Brain Code"}, {"id": 698, "start": 5184.94, "end": 5187.94, "text": "Ok es funktioniert wir kriegen den Batteriewert"}, {"id": 699, "start": 5187.94, "end": 5191.94, "text": "Allerdings ich muss aufpassen wenn ich das jetzt noch eine Weile mache ist die Batterie"}, {"id": 700, "start": 5191.94, "end": 5198.94, "text": "Was hat der hier überhaupt für Schmerzen wenn ich das jetzt noch eine Weile mache ist die Batterie leer"}, {"id": 701, "start": 5198.94, "end": 5201.94, "text": "Meine Stimme hat sich nur geändert das liegt wahrscheinlich daran"}, {"id": 702, "start": 5201.94, "end": 5206.94, "text": "Dass ich schon so alt war als ich mit YouTube angefangen habe"}, {"id": 703, "start": 5206.94, "end": 5208.94, "text": "Dass ich mit meiner Stimme nichts mehr großartig ändert"}, {"id": 704, "start": 5208.94, "end": 5214.94, "text": "Zumal ich ja mehr oder weniger die gleiche Hardware habe immer noch"}, {"id": 705, "start": 5214.94, "end": 5222.94, "text": "So scan gab es da noch so wie reset oder sowas"}, {"id": 706, "start": 5222.94, "end": 5225.94, "text": "De-init gab es da ne gab es auch nicht was gibt es denn da"}, {"id": 707, "start": 5225.94, "end": 5230.94, "text": "Erase Erase klingt gut macht das macht Erase"}, {"id": 708, "start": 5230.94, "end": 5236.94, "text": "Delete Per Device ne ne aber Clear irgendwas mit Clear habe ich gesehen Clear Results passt"}, {"id": 709, "start": 5236.94, "end": 5239.94, "text": "Ein bisschen Speicher ein bisschen Speicher freigeben"}, {"id": 710, "start": 5239.94, "end": 5242.94, "text": "Wir geben hier oben mal am Anfang der Schleife aus"}, {"id": 711, "start": 5242.94, "end": 5247.94, "text": "Wie viel Speicher wir frei haben ich will wissen wie viel das belegt"}, {"id": 712, "start": 5247.94, "end": 5252.94, "text": "Weil ich weiß dass dieser ganze"}, {"id": 713, "start": 5252.94, "end": 5258.94, "text": "Ich weiß dass dieser ganze Kram doch ziemlich viel Speicher frisst"}, {"id": 714, "start": 5258.94, "end": 5273.94, "text": "Free hier schauen wir mal"}, {"id": 715, "start": 5273.94, "end": 5278.94, "text": "Gute Frage Wer sind da immer noch die Top 3 Host in Deutschland von Preis Leistungsverhältnissen"}, {"id": 716, "start": 5278.94, "end": 5285.94, "text": "Was hosten für was fertige Services VMS Hardware"}, {"id": 717, "start": 5285.94, "end": 5289.94, "text": "Co location wer host also was willst du gehostet haben"}, {"id": 718, "start": 5289.94, "end": 5297.94, "text": "VMS wahrscheinlich"}, {"id": 719, "start": 5297.94, "end": 5301.94, "text": "Minecraft Server VMS ja also eine VMS"}, {"id": 720, "start": 5301.94, "end": 5307.94, "text": "Dann auf jeden Fall schon mal nicht Amazon nicht Google und nicht"}, {"id": 721, "start": 5307.94, "end": 5313.94, "text": "Azure Azure also und auch nicht Azure"}, {"id": 722, "start": 5313.94, "end": 5317.94, "text": "Ganz ehrlich"}, {"id": 723, "start": 5317.94, "end": 5320.94, "text": "Ich würde sagen am einfachsten ist es tatsächlich immer noch"}, {"id": 724, "start": 5320.94, "end": 5325.94, "text": "Pricing von der Hetzner Cloud was aber auch echt billig ist"}, {"id": 725, "start": 5325.94, "end": 5330.94, "text": "Also neben der Geschichte ist"}, {"id": 726, "start": 5330.94, "end": 5335.94, "text": "Wenn du was ganz kleines brauchst ist das von eins und eins"}, {"id": 727, "start": 5335.94, "end": 5339.94, "text": "Weil es ist eine richtig echte also eine richtig echte komplette"}, {"id": 728, "start": 5339.94, "end": 5343.94, "text": "Voll virtualisierte VMS keine komischen"}, {"id": 729, "start": 5343.94, "end": 5348.94, "text": "Keine komischen Container"}, {"id": 730, "start": 5348.94, "end": 5358.94, "text": "Und die haben und die haben ein Dollar Server"}, {"id": 731, "start": 5358.94, "end": 5362.94, "text": "Wenn ich das jetzt finde allerdings für 12 Monate ein Dollar im Monat kann man aber"}, {"id": 732, "start": 5362.94, "end": 5370.94, "text": "Mal machen"}, {"id": 733, "start": 5370.94, "end": 5378.94, "text": "Pricing"}, {"id": 734, "start": 5378.94, "end": 5379.94, "text": "Haben die das nicht mehr"}, {"id": 735, "start": 5379.94, "end": 5384.94, "text": "Ach nee war das ein Euro war das ein Euro"}, {"id": 736, "start": 5384.94, "end": 5387.94, "text": "Also ich habe hier nämlich selbst einen Euro Server und das passt"}, {"id": 737, "start": 5387.94, "end": 5390.94, "text": "Also ich habe zu 99 Prozent meine Sachen bei Hetzner"}, {"id": 738, "start": 5390.94, "end": 5393.94, "text": "Und eine Kiste habe ich bei eins und eins stehen"}, {"id": 739, "start": 5393.94, "end": 5398.94, "text": "Das schöne bei Hetzner ist es ist was auf der letzten Seite stand"}, {"id": 740, "start": 5398.94, "end": 5406.94, "text": "Wo"}, {"id": 741, "start": 5406.94, "end": 5432.94, "text": "Gebetet ihr mich ich sehe nur zwei Dollar"}, {"id": 742, "start": 5432.94, "end": 5437.94, "text": "Der Chat gebetet mich"}, {"id": 743, "start": 5437.94, "end": 5449.94, "text": "Huge, huge gebet"}, {"id": 744, "start": 5449.94, "end": 5450.94, "text": "Ich sehs nicht"}, {"id": 745, "start": 5450.94, "end": 5455.94, "text": "Gebetet"}, {"id": 746, "start": 5455.94, "end": 5456.94, "text": "Ganz oben"}, {"id": 747, "start": 5456.94, "end": 5457.94, "text": "Hör auf"}, {"id": 748, "start": 5457.94, "end": 5472.94, "text": "Ich glaube ich glaube ich nix mehr Chat"}, {"id": 749, "start": 5472.94, "end": 5477.94, "text": "Ein Euro im Monat genau den meine ich da habe ich einen davon"}, {"id": 750, "start": 5477.94, "end": 5484.94, "text": "Das schöne aber an der Hetzner an der Hetzner Preis an der Hetzner Cloud Geschichte ist"}, {"id": 751, "start": 5484.94, "end": 5492.94, "text": "Das ist minütlich also sprich hier hier musste wirklich 12 Monate bezahlen"}, {"id": 752, "start": 5492.94, "end": 5496.94, "text": "Hier kannst du"}, {"id": 753, "start": 5496.94, "end": 5499.94, "text": "Quasi eine fette Kiste mieten"}, {"id": 754, "start": 5499.94, "end": 5504.94, "text": "Wir hatten uns mal hier Dedicated CPU wir hatten uns für Open Street Maps zeugs mal hier sowas"}, {"id": 755, "start": 5504.94, "end": 5509.94, "text": "Gemietet glaube eins von denen ich glaube die fette Kiste haben wir die fetteste Kiste haben wir uns"}, {"id": 756, "start": 5509.94, "end": 5516.94, "text": "Gemietet"}, {"id": 757, "start": 5516.94, "end": 5519.94, "text": "Ja Google weiß Bescheid ja"}, {"id": 758, "start": 5519.94, "end": 5523.94, "text": "Und die fetteste Kiste haben wir uns mal gemietet allerdings nur für glaube ich zwei Stunden"}, {"id": 759, "start": 5523.94, "end": 5527.94, "text": "Und dementsprechend haben wir davon nur ein paar Euro also so gut wie nichts bezahlt eigentlich"}, {"id": 760, "start": 5527.94, "end": 5531.94, "text": "Hier haben wir ein Euro bezahlt am Ende nach zwei Stunden"}, {"id": 761, "start": 5531.94, "end": 5542.94, "text": "Digital auch schon ist auch nice aber digital auch schon ist doppelt so teuer"}, {"id": 762, "start": 5542.94, "end": 5543.94, "text": "Ok"}, {"id": 763, "start": 5543.94, "end": 5549.94, "text": "Also klappt der Kram jetzt hier genau Batterie Batterie"}, {"id": 764, "start": 5549.94, "end": 5552.94, "text": "Wir scannen fünf Sekunden"}, {"id": 765, "start": 5552.94, "end": 5562.94, "text": "Und jetzt Batterie Status auf Batterie Status"}, {"id": 766, "start": 5562.94, "end": 5564.94, "text": "Sag mal hängt das scan"}, {"id": 767, "start": 5564.94, "end": 5568.94, "text": "Leute"}, {"id": 768, "start": 5568.94, "end": 5573.94, "text": "Hängt das Ding"}, {"id": 769, "start": 5573.94, "end": 5578.94, "text": "Aber aber der soll der soll aufhören zu scannen nach fünf Sekunden der soll das gar nicht immer"}, {"id": 770, "start": 5578.94, "end": 5583.94, "text": "Weiter machen mit scan"}, {"id": 771, "start": 5583.94, "end": 5587.94, "text": "Der soll aufhören zu scannen"}, {"id": 772, "start": 5587.94, "end": 5589.94, "text": "Warum scannt der weiter"}, {"id": 773, "start": 5589.94, "end": 5591.94, "text": "Duration"}, {"id": 774, "start": 5591.94, "end": 5597.94, "text": "Der soll fünf Sekunden scannen und dann gefälligst aufhören"}, {"id": 775, "start": 5597.94, "end": 5602.94, "text": "Das ist in Sekunden und das ist in Millisekunden frag mich nicht warum man so bescheuerte Idee gekommen ist"}, {"id": 776, "start": 5602.94, "end": 5608.94, "text": "Das in Millisekunden zu machen das sind Sekunden aber das ist so"}, {"id": 777, "start": 5608.94, "end": 5613.94, "text": "Guck mal der hört nicht mehr auf zu scann"}, {"id": 778, "start": 5613.94, "end": 5616.94, "text": "Und resetten"}, {"id": 779, "start": 5616.94, "end": 5620.94, "text": "Scan start ja passt"}, {"id": 780, "start": 5620.94, "end": 5624.94, "text": "End ja wunderbar"}, {"id": 781, "start": 5624.94, "end": 5628.94, "text": "Ok Batterie scan start und jetzt scan end scan end"}, {"id": 782, "start": 5628.94, "end": 5634.94, "text": "Also prinzipiell funktioniert das schon vielleicht sollte ich vielleicht sollte ich komm wir machen einfach mal"}, {"id": 783, "start": 5634.94, "end": 5636.94, "text": "Wir machen einfach mal ein Delay"}, {"id": 784, "start": 5636.94, "end": 5652.94, "text": "Nein ihr wisst ihr was wir machen wir machen ein Delay vor jedem Abfragen falls ich mehr als ein Sensor habe spackt das sonst garantiert rum"}, {"id": 785, "start": 5652.94, "end": 5655.94, "text": "So ok sehr nice"}, {"id": 786, "start": 5655.94, "end": 5665.94, "text": "Jetzt funktioniert das gut also jetzt krieg ich die Werte rein inklusive Batterie das ist doch äußerst pock"}, {"id": 787, "start": 5665.94, "end": 5674.94, "text": "Ich krieg Licht ich krieg Temperatur und ich krieg die Batterie und das ganze quasi dauerhaft"}, {"id": 788, "start": 5674.94, "end": 5680.94, "text": "So was ich jetzt noch einbauen muss ist ich will ja nicht jedes mal abfragen wenn ich hier reingehe ich will den Sensor"}, {"id": 789, "start": 5680.94, "end": 5684.94, "text": "Ich will die Batterie alle fünf Stunden abfragen das heißt"}, {"id": 790, "start": 5684.94, "end": 5692.94, "text": "Ich muss jetzt erstmal überprüfen ob ich den Sensor nicht schon gecheckt habe also"}, {"id": 791, "start": 5692.94, "end": 5698.94, "text": "Nennen wir es mal irgendwie Millisekunden Sensor"}, {"id": 792, "start": 5698.94, "end": 5700.94, "text": "Last"}, {"id": 793, "start": 5700.94, "end": 5703.94, "text": "Batterie check"}, {"id": 794, "start": 5703.94, "end": 5716.94, "text": "Aber das sind das sind das sind Microseconds jetzt guckt hier das sind Microseconds wie viel ist dann eine Stunde in Microseconds"}, {"id": 795, "start": 5716.94, "end": 5724.94, "text": "Ah ja alles klar"}, {"id": 796, "start": 5724.94, "end": 5726.94, "text": "Ok 5"}, {"id": 797, "start": 5726.94, "end": 5737.94, "text": "Ah ja alles klar alles klar ok äußerst äußerst selbst erklären also sprich wenn"}, {"id": 798, "start": 5737.94, "end": 5746.94, "text": "Macht das doch lieber als Wert in dem Sensor Objekt was habe ich doch Sensor Last Check"}, {"id": 799, "start": 5746.94, "end": 5763.94, "text": "Also sprich wenn die aktuelle Zeit minus die letzte Checkzeit größer als das da sind 5 Stunden"}, {"id": 800, "start": 5763.94, "end": 5774.94, "text": "Ne kleiner kleiner dann hören wir auf"}, {"id": 801, "start": 5774.94, "end": 5777.94, "text": "Und wir müssen initial einmal"}, {"id": 802, "start": 5777.94, "end": 5783.94, "text": "Einmal initial müssten wir sagen wenn das da"}, {"id": 803, "start": 5783.94, "end": 5790.94, "text": "Ungleich Null ist und das hier"}, {"id": 804, "start": 5790.94, "end": 5792.94, "text": "Gibt das halbwegs Sinn"}, {"id": 805, "start": 5792.94, "end": 5795.94, "text": "So und jetzt sollt ihr nämlich den Batteriecheck nur einmalig machen"}, {"id": 806, "start": 5795.94, "end": 5800.94, "text": "Du hast mich auf jeden Fall zum Programmieren animiert hast du damals Programmieren der Berufsschule in E-Technik"}, {"id": 807, "start": 5800.94, "end": 5809.94, "text": "Haben wir jetzt ein Arduino Anfänger Kit bestellt ja das ist nice wobei ich ja immer noch die ESP empfehlen würde"}, {"id": 808, "start": 5809.94, "end": 5815.94, "text": "Einfach weil du damit mehr machen kannst und das finde ich die beste Radwehr ist die Arduino sind aber halt robuster"}, {"id": 809, "start": 5815.94, "end": 5823.94, "text": "Also gegenüber Umwelt Einflüssen den kannst du fast vom Balkon schmeißen da geht immer noch"}, {"id": 810, "start": 5823.94, "end": 5826.94, "text": "Bei der IF Anweisung fehlt die Klammer"}, {"id": 811, "start": 5826.94, "end": 5832.94, "text": "Wenn es nur eine Zeile ist darf man die Klammer weglassen aber ich gebe zu es sieht nicht gut lesbar aus"}, {"id": 812, "start": 5832.94, "end": 5843.94, "text": "Bei einer Zeile darf man die Klammer weglassen"}, {"id": 813, "start": 5843.94, "end": 5849.94, "text": "Du siehst es zum Beispiel daran wenn ich die Einrückung automatisch machen lasse"}, {"id": 814, "start": 5849.94, "end": 5860.94, "text": "Vom Formatier Tool im Editor und drücke jetzt speichern dann rückt das automatisch hier unter das IF ein dass man sieht dass das dazugehört"}, {"id": 815, "start": 5860.94, "end": 5863.94, "text": "So also es scheint zu funktionieren"}, {"id": 816, "start": 5863.94, "end": 5867.94, "text": "Aber ein bisschen guck mal Leute das buggt seht ihr das?"}, {"id": 817, "start": 5867.94, "end": 5875.94, "text": "Der startet den Scan und er hört dann einfach nicht auf zu scannen"}, {"id": 818, "start": 5875.94, "end": 5882.94, "text": "Er sollte doch eigentlich nach 5 Sekunden aufhören zu scannen warum macht er das denn nicht?"}, {"id": 819, "start": 5882.94, "end": 5887.94, "text": "Muss ich da vielleicht ein bisschen scheppere Werte rein machen keine Ahnung"}, {"id": 820, "start": 5887.94, "end": 5901.94, "text": "213 und 217 und irgendwie 43 oder so"}, {"id": 821, "start": 5901.94, "end": 5910.94, "text": "Ich meine das würde ich jetzt eigentlich erwarten dass der automatisch stoppt wenn das fertig ist"}, {"id": 822, "start": 5910.94, "end": 5916.94, "text": "Und hier kann es auch kein Multithreading Problem sein weil das geht streng nacheinander alles"}, {"id": 823, "start": 5916.94, "end": 5929.94, "text": "Das wäre ziemlich doofer Bug wenn der im Endlos Scan hängen bleibt sollte er hoffentlich nicht"}, {"id": 824, "start": 5929.94, "end": 5936.94, "text": "Wäre ziemlich Sack"}, {"id": 825, "start": 5936.94, "end": 5942.94, "text": "Achso Billy"}, {"id": 826, "start": 5942.94, "end": 5945.94, "text": "Start scan"}, {"id": 827, "start": 5945.94, "end": 5952.94, "text": "Was genau macht der Scan Part das sind die Sekunden wie lang der scannen soll"}, {"id": 828, "start": 5952.94, "end": 5978.94, "text": "Start scanning and blocking until the scan has been finished"}, {"id": 829, "start": 5978.94, "end": 5981.94, "text": "So genau check ich die Werte aber auch nicht"}, {"id": 830, "start": 5981.94, "end": 5989.94, "text": "Eine Finish Methode nach dem Start bringt ja nichts die wird ja gar nicht ausgeführt der blockt ja hier bis es vorbei ist"}, {"id": 831, "start": 5989.94, "end": 6000.94, "text": "Kifrin 17 Monate exquisite high IQ Subscription hier 17 Monate ist eindeutig schon"}, {"id": 832, "start": 6000.94, "end": 6003.94, "text": "Exzellent Dankeschön für den Sub"}, {"id": 833, "start": 6003.94, "end": 6008.94, "text": "So jetzt okay wir gehen einfach mal davon aus dass es jetzt funktioniert"}, {"id": 834, "start": 6008.94, "end": 6012.94, "text": "Okay also der hat auch die Batterie abgefragt wunderbar"}, {"id": 835, "start": 6012.94, "end": 6015.94, "text": "Irgendwo hier"}, {"id": 836, "start": 6015.94, "end": 6029.94, "text": "Batterie 99 okay also das funktioniert der erkennt das Gerät und fragt einmalig den Batteriestatus ab und danach 5 Stunden wieder wunderbar exzellent so lassen wir das"}, {"id": 837, "start": 6029.94, "end": 6040.94, "text": "Jetzt kommt ja der scanend ja das er kam vorher auch nur dass er irgendwie zwischendrin dann hängen geblieben ist und nicht den scan nicht beendet hat"}, {"id": 838, "start": 6040.94, "end": 6043.94, "text": "Was auch immer da los ist"}, {"id": 839, "start": 6043.94, "end": 6049.94, "text": "Okay das funktioniert jetzt schon mal gut das heißt wir haben jetzt alle Werte die wir brauchen"}, {"id": 840, "start": 6049.94, "end": 6061.94, "text": "Man muss halt eine Weile scannen dass das funktioniert"}, {"id": 841, "start": 6061.94, "end": 6064.94, "text": "So"}, {"id": 842, "start": 6064.94, "end": 6072.94, "text": "Jetzt"}, {"id": 843, "start": 6072.94, "end": 6081.94, "text": "Okay das heißt wir kriegen jetzt die Werte geschickt das passt eigentlich alles jetzt müsste ich den Kram irgendwie zum"}, {"id": 844, "start": 6081.94, "end": 6084.94, "text": "Übers WLAN schicken"}, {"id": 845, "start": 6084.94, "end": 6097.94, "text": "Wo habe ich meinen wo habe ich meinen access point hier access point kleinen test access point"}, {"id": 846, "start": 6097.94, "end": 6102.94, "text": "Da müssen wir so mal gucken wie man die die credentials da rein bekommen Leute"}, {"id": 847, "start": 6102.94, "end": 6108.94, "text": "Ich muss ich muss euch dann irgendwie erst mal wieder erst mal wieder umschalten"}, {"id": 848, "start": 6108.94, "end": 6113.94, "text": "Obwohl ich kann mal kurz gucken"}, {"id": 849, "start": 6113.94, "end": 6119.94, "text": "Documents platformer all projects was haben wir hier"}, {"id": 850, "start": 6119.94, "end": 6127.94, "text": "CP der cool jam unter Watt jam der Watt jam war das letzte was wir gemacht haben source secrets Punkt H"}, {"id": 851, "start": 6127.94, "end": 6131.94, "text": "Wir kopieren das jetzt einfach"}, {"id": 852, "start": 6131.94, "end": 6135.94, "text": "Wir kopieren das jetzt einfach in den cool Champ"}, {"id": 853, "start": 6135.94, "end": 6136.94, "text": "Cool Champ"}, {"id": 854, "start": 6136.94, "end": 6138.94, "text": "Source secrets"}, {"id": 855, "start": 6138.94, "end": 6144.94, "text": "Und da muss ich euch nicht nicht nicht nicht umschalten und ich habe die Sachen hier drin stehen"}, {"id": 856, "start": 6144.94, "end": 6146.94, "text": "Exzellent"}, {"id": 857, "start": 6146.94, "end": 6150.94, "text": "Okay also dann machen wir mal WLAN an"}, {"id": 858, "start": 6150.94, "end": 6153.94, "text": "Also include"}, {"id": 859, "start": 6153.94, "end": 6158.94, "text": "Wi-Fi Punkt H"}, {"id": 860, "start": 6158.94, "end": 6161.94, "text": "By the way ich mache das jetzt alles alles mal von Hand"}, {"id": 861, "start": 6161.94, "end": 6168.94, "text": "Ich habe mittlerweile schon eine über 1000 Zeilen lange Helper Library die ich mir selbst zusammengestrickt habe für so Zeug"}, {"id": 862, "start": 6168.94, "end": 6171.94, "text": "Weil C++ so pains Champ ist"}, {"id": 863, "start": 6171.94, "end": 6177.94, "text": "Unter anderem für er guckt nach ob die WLAN Verbindung noch steht und verbindet sich im Hintergrund neu und sowas"}, {"id": 864, "start": 6177.94, "end": 6180.94, "text": "Aber wir machen das jetzt mal von Hand"}, {"id": 865, "start": 6180.94, "end": 6183.94, "text": "Gut das heißt den Kram kann ich schon immer alles minimieren"}, {"id": 866, "start": 6183.94, "end": 6184.94, "text": "Brauchen wir nicht mehr"}, {"id": 867, "start": 6184.94, "end": 6189.94, "text": "Brauchen wir nicht mehr funktioniert"}, {"id": 868, "start": 6189.94, "end": 6196.94, "text": "Wir können eigentlich könnten wir das noch mal auslagern wollte scan"}, {"id": 869, "start": 6196.94, "end": 6202.94, "text": "Ein Bit Massive"}, {"id": 870, "start": 6202.94, "end": 6204.94, "text": "Ein Bit"}, {"id": 871, "start": 6204.94, "end": 6207.94, "text": "Aber das mal hier rein dass es ein bisschen übersichtlicher ist"}, {"id": 872, "start": 6207.94, "end": 6211.94, "text": "Scan"}, {"id": 873, "start": 6211.94, "end": 6216.94, "text": "Warum denn C++ Man kann das nicht mit was anderem gescheit programmieren also du hast noch zwei weitere Möglichkeiten"}, {"id": 874, "start": 6216.94, "end": 6220.94, "text": "Ne bei C++ Du kannst Micro-Python verwenden"}, {"id": 875, "start": 6220.94, "end": 6222.94, "text": "Da hast du aber auch andere Probleme"}, {"id": 876, "start": 6222.94, "end": 6225.94, "text": "Da gibt es nicht so schöne viele Libraries für alles was man braucht"}, {"id": 877, "start": 6225.94, "end": 6231.94, "text": "Außerdem braucht es mehr Speicher und"}, {"id": 878, "start": 6231.94, "end": 6234.94, "text": "Ist auch letztendlich nicht der Weisheit letzter Schluss"}, {"id": 879, "start": 6234.94, "end": 6239.94, "text": "Gerade dadurch dass dir viele Libraries für Geräte fehlen"}, {"id": 880, "start": 6239.94, "end": 6243.94, "text": "Außerdem braucht es deutlich mehr RAM"}, {"id": 881, "start": 6243.94, "end": 6247.94, "text": "Zum Beispiel wenn du einen Web-Server machst kriegst du vielleicht 2-3 Requests hin"}, {"id": 882, "start": 6247.94, "end": 6255.94, "text": "Gegen du glaube auf dem ESP32 mit C++ um die"}, {"id": 883, "start": 6255.94, "end": 6259.94, "text": "Bis zu 12-13 Request oder so hinbekommst sogar theoretisch"}, {"id": 884, "start": 6259.94, "end": 6265.94, "text": "Ich glaube sogar theoretisch sogar 5 gleichzeitig Request mit HTTPS"}, {"id": 885, "start": 6265.94, "end": 6268.94, "text": "Ja das Nano Framework ist leider nicht so schön"}, {"id": 886, "start": 6268.94, "end": 6271.94, "text": "Das habe ich ganz vergessen"}, {"id": 887, "start": 6271.94, "end": 6275.94, "text": "Da fehlt aber auch ganz schön viel im Nano Framework und du hast die gleiche Treiber Problematik"}, {"id": 888, "start": 6275.94, "end": 6277.94, "text": "So die nächste Variante ist Rust"}, {"id": 889, "start": 6277.94, "end": 6280.94, "text": "Rust gibt es Experimental und da hast du auch die Treiber Probleme"}, {"id": 890, "start": 6280.94, "end": 6284.94, "text": "Leider gibt es wirklich sinnvoll nur die Möglichkeit das in C++ zu programmieren"}, {"id": 891, "start": 6284.94, "end": 6286.94, "text": "Was mir halt auch auf den Sack geht"}, {"id": 892, "start": 6286.94, "end": 6288.94, "text": "Oh ist der Preis-Champ wieder kaputt?"}, {"id": 893, "start": 6288.94, "end": 6290.94, "text": "Ne geht noch alles gut"}, {"id": 894, "start": 6290.94, "end": 6294.94, "text": "Alter die Preise"}, {"id": 895, "start": 6294.94, "end": 6297.94, "text": "Soll ich an?"}, {"id": 896, "start": 6297.94, "end": 6302.94, "text": "Echt richtig painstampig"}, {"id": 897, "start": 6302.94, "end": 6306.94, "text": "Okay scan also wir müssen uns jetzt connecten"}, {"id": 898, "start": 6306.94, "end": 6308.94, "text": "Über WLAN"}, {"id": 899, "start": 6308.94, "end": 6311.94, "text": "Das heißt wir machen jetzt Setup"}, {"id": 900, "start": 6311.94, "end": 6317.94, "text": "Und im Setup müssen wir jetzt WIFI beginnen"}, {"id": 901, "start": 6317.94, "end": 6321.94, "text": "Und irgendwo habe ich hier die"}, {"id": 902, "start": 6321.94, "end": 6324.94, "text": "WIFI"}, {"id": 903, "start": 6324.94, "end": 6327.94, "text": "SSID"}, {"id": 904, "start": 6327.94, "end": 6329.94, "text": "Oh Mist Leute ich habe vergessen wie der Kram heißt"}, {"id": 905, "start": 6329.94, "end": 6333.94, "text": "Ich muss euch doch mal, ich muss euch doch mal ausschalten"}, {"id": 906, "start": 6333.94, "end": 6337.94, "text": "Wobei das, das können wir, ne Leute das können wir im Wattchamp nachgucken"}, {"id": 907, "start": 6337.94, "end": 6341.94, "text": "Das können wir im Wattchamp nachgucken wie der ganze Kram heißt"}, {"id": 908, "start": 6341.94, "end": 6344.94, "text": "Wattchamp"}, {"id": 909, "start": 6344.94, "end": 6348.94, "text": "Nicht Secrets aufmachen, Main"}, {"id": 910, "start": 6348.94, "end": 6360.94, "text": "WIFI"}, {"id": 911, "start": 6360.94, "end": 6363.94, "text": "WIFI reconnect"}, {"id": 912, "start": 6363.94, "end": 6365.94, "text": "WIFI SSID"}, {"id": 913, "start": 6365.94, "end": 6367.94, "text": "Okay prima"}, {"id": 914, "start": 6367.94, "end": 6370.94, "text": "Und ich muss das noch einbinden jetzt, jetzt weiß ich aber ob es jetzt funktioniert"}, {"id": 915, "start": 6370.94, "end": 6374.94, "text": "Ich muss noch include"}, {"id": 916, "start": 6374.94, "end": 6376.94, "text": "WIFI"}, {"id": 917, "start": 6376.94, "end": 6379.94, "text": "Secret"}, {"id": 918, "start": 6379.94, "end": 6380.94, "text": "Okay"}, {"id": 919, "start": 6380.94, "end": 6383.94, "text": "So und jetzt können wir uns verbinden"}, {"id": 920, "start": 6383.94, "end": 6386.94, "text": "WIFI SSID"}, {"id": 921, "start": 6386.94, "end": 6389.94, "text": "Und WIFI Passwort"}, {"id": 922, "start": 6389.94, "end": 6393.94, "text": "Nee PW"}, {"id": 923, "start": 6393.94, "end": 6396.94, "text": "Oh ich hab Glück dass er das nicht anzeigt"}, {"id": 924, "start": 6396.94, "end": 6397.94, "text": "Huge"}, {"id": 925, "start": 6397.94, "end": 6401.94, "text": "So also von der Idee her sollte er sich jetzt mit dem WLAN verbinden"}, {"id": 926, "start": 6401.94, "end": 6403.94, "text": "Wir checken das ganze noch mal weil"}, {"id": 927, "start": 6403.94, "end": 6408.94, "text": "Wir gucken einfach ob er mit dem WLAN verbunden ist, solange er nicht connected ist"}, {"id": 928, "start": 6408.94, "end": 6414.94, "text": "Geben wir einfach Punkte aus"}, {"id": 929, "start": 6414.94, "end": 6424.94, "text": "Serial Print"}, {"id": 930, "start": 6424.94, "end": 6429.94, "text": "Print, Brindeln"}, {"id": 931, "start": 6429.94, "end": 6431.94, "text": "Connected"}, {"id": 932, "start": 6431.94, "end": 6433.94, "text": "To"}, {"id": 933, "start": 6433.94, "end": 6437.94, "text": "Und da schreiben wir jetzt"}, {"id": 934, "start": 6437.94, "end": 6441.94, "text": "Die IP dahinter einfach"}, {"id": 935, "start": 6441.94, "end": 6446.94, "text": "Schreibt einfach so IP"}, {"id": 936, "start": 6446.94, "end": 6450.94, "text": "So und dann können wir noch die IP vom WLAN"}, {"id": 937, "start": 6450.94, "end": 6455.94, "text": "IP"}, {"id": 938, "start": 6455.94, "end": 6457.94, "text": "Okay wunderbar"}, {"id": 939, "start": 6457.94, "end": 6459.94, "text": "So und das sollte jetzt eigentlich funktionieren"}, {"id": 940, "start": 6459.94, "end": 6462.94, "text": "Der sollte jetzt sich verbinden mit dem WLAN"}, {"id": 941, "start": 6462.94, "end": 6466.94, "text": "Und mir die IP ausspucken, dass ich ausprobieren kann"}, {"id": 942, "start": 6466.94, "end": 6470.94, "text": "Ob ich die Daten zu meiner Home Assistant Geschichte geschickt kriege"}, {"id": 943, "start": 6470.94, "end": 6472.94, "text": "IP League, oh nein"}, {"id": 944, "start": 6472.94, "end": 6479.94, "text": "OMFG"}, {"id": 945, "start": 6479.94, "end": 6484.94, "text": "Du hast echt über den Preis Champ eine PS5 gefunden, ernsthaft?"}, {"id": 946, "start": 6484.94, "end": 6491.94, "text": "Ich hab da glaube ich noch nie eine PS5 wirklich mal live gesehen"}, {"id": 947, "start": 6491.94, "end": 6500.94, "text": "Ach so eine hier wahrscheinlich"}, {"id": 948, "start": 6500.94, "end": 6503.94, "text": "Gabs nicht"}, {"id": 949, "start": 6503.94, "end": 6506.94, "text": "Ach Warehouse Deal, okay"}, {"id": 950, "start": 6506.94, "end": 6514.94, "text": "Busy, busy, busy, Delay, Delay brauchen wir noch"}, {"id": 951, "start": 6514.94, "end": 6515.94, "text": "100"}, {"id": 952, "start": 6515.94, "end": 6517.94, "text": "Serial"}, {"id": 953, "start": 6517.94, "end": 6520.94, "text": "Print"}, {"id": 954, "start": 6520.94, "end": 6525.94, "text": "Connecting, Wi-Fi"}, {"id": 955, "start": 6525.94, "end": 6528.94, "text": "So"}, {"id": 956, "start": 6528.94, "end": 6530.94, "text": "So und jetzt soll er sich eigentlich zum WLAN verbinden"}, {"id": 957, "start": 6530.94, "end": 6532.94, "text": "Ach Alter ich bin ja auch blöd"}, {"id": 958, "start": 6532.94, "end": 6536.94, "text": "Er soll sich nicht zum WLAN verbinden, wie soll er sich zum WLAN verbinden"}, {"id": 959, "start": 6536.94, "end": 6543.94, "text": "Ich hab den Access Point noch gar nicht dran"}, {"id": 960, "start": 6543.94, "end": 6546.94, "text": "Kann ich gehen"}, {"id": 961, "start": 6546.94, "end": 6552.94, "text": "Excellent"}, {"id": 962, "start": 6552.94, "end": 6557.94, "text": "Okay schauen wir mal zu ob er sich live verbindet zum"}, {"id": 963, "start": 6557.94, "end": 6562.94, "text": "Gucken, dass ich nix runter schmeiß, warte mal ich leg das mal kurz neben dran"}, {"id": 964, "start": 6562.94, "end": 6565.94, "text": "So Access Point verbinden"}, {"id": 965, "start": 6565.94, "end": 6569.94, "text": "Excellent"}, {"id": 966, "start": 6569.94, "end": 6573.94, "text": "Tabel"}, {"id": 967, "start": 6573.94, "end": 6582.94, "text": "Tauschen USB-Card"}, {"id": 968, "start": 6582.94, "end": 6588.94, "text": "Access Point"}, {"id": 969, "start": 6588.94, "end": 6592.94, "text": "Access Point booted"}, {"id": 970, "start": 6592.94, "end": 6596.94, "text": "Access Point booted und es sollte sich jetzt eigentlich gleich"}, {"id": 971, "start": 6596.94, "end": 6610.94, "text": "Offisch mal collecten"}, {"id": 972, "start": 6610.94, "end": 6612.94, "text": "Also Access Point booted immer noch"}, {"id": 973, "start": 6612.94, "end": 6615.94, "text": "Jetzt blinkt er"}, {"id": 974, "start": 6615.94, "end": 6618.94, "text": "Und blinkt und hat Netzwerkverbindungen"}, {"id": 975, "start": 6618.94, "end": 6623.94, "text": "Bäm hat funktioniert"}, {"id": 976, "start": 6623.94, "end": 6625.94, "text": "Okay"}, {"id": 977, "start": 6625.94, "end": 6630.94, "text": "Also ist verbunden"}, {"id": 978, "start": 6630.94, "end": 6636.94, "text": "Exquisite"}, {"id": 979, "start": 6636.94, "end": 6645.94, "text": "Okay äußerst nice um nicht zu sagen"}, {"id": 980, "start": 6645.94, "end": 6648.94, "text": "Okay wir sind verbunden über WLAN"}, {"id": 981, "start": 6648.94, "end": 6652.94, "text": "Und wir fragen Bluetooth-Gedöns ab"}, {"id": 982, "start": 6652.94, "end": 6656.94, "text": "Es gibt übrigens Probleme wenn man WLAN und Bluetooth gleichzeitig verwendet"}, {"id": 983, "start": 6656.94, "end": 6661.94, "text": "Und das liegt darin, dass Bluetooth und WLAN die gleiche Antenne verwenden in dem Gerät"}, {"id": 984, "start": 6661.94, "end": 6665.94, "text": "Also sprich man kann nicht WLAN und Bluetooth wirklich exakt gleichzeitig übertragen"}, {"id": 985, "start": 6665.94, "end": 6668.94, "text": "Das heißt man muss immer ein paar Delays einbauen"}, {"id": 986, "start": 6668.94, "end": 6673.94, "text": "Dass die sich nicht zu sehr in die Quere kommen"}, {"id": 987, "start": 6673.94, "end": 6681.94, "text": "Sonst packts rum"}, {"id": 988, "start": 6681.94, "end": 6685.94, "text": "Kein 5 Gigahertz? Nee"}, {"id": 989, "start": 6685.94, "end": 6689.94, "text": "Wie kommst du drauf?"}, {"id": 990, "start": 6689.94, "end": 6693.94, "text": "Oder war das eine allgemeine Frage mit dem 5 Gigahertz?"}, {"id": 991, "start": 6693.94, "end": 6699.94, "text": "Nee das Ding hat keinen 5 Gigahertz"}, {"id": 992, "start": 6699.94, "end": 6702.94, "text": "Das hat keinen 5 Gigahertz und das neue auch nicht"}, {"id": 993, "start": 6702.94, "end": 6705.94, "text": "Es gibt jetzt nämlich einen ESP32S3"}, {"id": 994, "start": 6705.94, "end": 6709.94, "text": "Die Benamung von denen ist ein bisschen fail"}, {"id": 995, "start": 6709.94, "end": 6713.94, "text": "Ähm"}, {"id": 996, "start": 6713.94, "end": 6715.94, "text": "Nee es sind nicht zwei Antennen, es ist eine Antenne"}, {"id": 997, "start": 6715.94, "end": 6717.94, "text": "Das sagen die auch oft, das sagen die auch"}, {"id": 998, "start": 6717.94, "end": 6722.94, "text": "Dass sie sich die gleiche Antenne teilen"}, {"id": 999, "start": 6722.94, "end": 6727.94, "text": "Es wird Zeit, dass die Chinesen mal 5 Gigahertz machen"}, {"id": 1000, "start": 6727.94, "end": 6729.94, "text": "Achso, ja gut das kann sein"}, {"id": 1001, "start": 6729.94, "end": 6731.94, "text": "Aber ich hab letztens von denen gelesen, die sagen"}, {"id": 1002, "start": 6731.94, "end": 6743.94, "text": "Es gibt einen ESP32S3, aber der kann auch nur 2,4 Gigahertz"}, {"id": 1003, "start": 6743.94, "end": 6745.94, "text": "So, ok"}, {"id": 1004, "start": 6745.94, "end": 6748.94, "text": "Also jetzt müssen wir gucken, dass wir den Kram per WLAN"}, {"id": 1005, "start": 6748.94, "end": 6753.94, "text": "Ich hab extra hier meinen Test Home Assistant gestartet"}, {"id": 1006, "start": 6753.94, "end": 6757.94, "text": "Äh"}, {"id": 1007, "start": 6757.94, "end": 6760.94, "text": "Wie kriegt man die IP raus von dem Ding?"}, {"id": 1008, "start": 6760.94, "end": 6762.94, "text": "IP"}, {"id": 1009, "start": 6762.94, "end": 6764.94, "text": "Add"}, {"id": 1010, "start": 6764.94, "end": 6766.94, "text": "Äh"}, {"id": 1011, "start": 6766.94, "end": 6768.94, "text": "Less"}, {"id": 1012, "start": 6768.94, "end": 6770.94, "text": "Ok, More"}, {"id": 1013, "start": 6770.94, "end": 6775.94, "text": "Ist euch eigentlich mal unter Linux aufgefallen, dass less das bessere More ist?"}, {"id": 1014, "start": 6775.94, "end": 6782.94, "text": "Ok"}, {"id": 1015, "start": 6782.94, "end": 6791.94, "text": "So, äh, 2139, ok"}, {"id": 1016, "start": 6791.94, "end": 6793.94, "text": "2.13"}, {"id": 1017, "start": 6793.94, "end": 6796.94, "text": "Wait a minute"}, {"id": 1018, "start": 6796.94, "end": 6799.94, "text": "Wie?"}, {"id": 1019, "start": 6799.94, "end": 6802.94, "text": "Ach Moment, über HTTPS, ne das ist ja auch nicht über HTTPS erreichbar"}, {"id": 1020, "start": 6802.94, "end": 6805.94, "text": "Äh, 8123"}, {"id": 1021, "start": 6805.94, "end": 6807.94, "text": "Ah, yes"}, {"id": 1022, "start": 6807.94, "end": 6810.94, "text": "Gesamtverbrauch, ok das war unser Test vom letzten Mal"}, {"id": 1023, "start": 6810.94, "end": 6812.94, "text": "Das war unser Test vom letzten Mal"}, {"id": 1024, "start": 6812.94, "end": 6820.94, "text": "Äh ja, nerf nicht rum"}, {"id": 1025, "start": 6820.94, "end": 6824.94, "text": "Manchmal ist weniger mehr, das ist richtig"}, {"id": 1026, "start": 6824.94, "end": 6826.94, "text": "Das war der Test vom letzten Mal, das brauchen wir nicht"}, {"id": 1027, "start": 6826.94, "end": 6832.94, "text": "Äh, wir gucken jetzt, dass wir die Sensorwerte von dem Flora-Sensor eingeliefert bekommen"}, {"id": 1028, "start": 6832.94, "end": 6834.94, "text": "Da muss ich aber nebenbei ein bisschen aus dem anderen Projekt abgucken"}, {"id": 1029, "start": 6834.94, "end": 6841.94, "text": "Das ist die, die, die, die MQTT, Jason Syntax für Home Assistant ist etwas"}, {"id": 1030, "start": 6841.94, "end": 6845.94, "text": "painst-champig, werdet ihr gleich sehen"}, {"id": 1031, "start": 6845.94, "end": 6847.94, "text": "Aber es ist cool gemacht"}, {"id": 1032, "start": 6847.94, "end": 6851.94, "text": "Also Configuration, Integrations"}, {"id": 1033, "start": 6851.94, "end": 6855.94, "text": "MQTT-Broker und so ist alles am Start"}, {"id": 1034, "start": 6855.94, "end": 6860.94, "text": "Also das ist das, was ich auch sonst verwende für meine Heim-Automatisierung"}, {"id": 1035, "start": 6860.94, "end": 6863.94, "text": "Nur, dass ich hier eine Test-Instanz hab für rum Bastelleien"}, {"id": 1036, "start": 6863.94, "end": 6868.94, "text": "Also, das funktioniert doch alles schon mal wunderbar"}, {"id": 1037, "start": 6868.94, "end": 6872.94, "text": "Wir scannen, wir bekommen die Werte hier zurückgeliefert, alles gut"}, {"id": 1038, "start": 6872.94, "end": 6877.94, "text": "Das heißt, wenn ich mir das, diese Sachen jetzt per MQTT schicken lassen will"}, {"id": 1039, "start": 6877.94, "end": 6883.94, "text": "Brauche ich einen MQTT-Kleinwert, das gedacht"}, {"id": 1040, "start": 6883.94, "end": 6886.94, "text": "Fällt mir gerade so ein, den müssen wir ja noch"}, {"id": 1041, "start": 6886.94, "end": 6888.94, "text": "So, also"}, {"id": 1042, "start": 6888.94, "end": 6890.94, "text": "Home Assistant GUI schaut aus wie Google"}, {"id": 1043, "start": 6890.94, "end": 6893.94, "text": "Ja, die stehen voll auf Material Design"}, {"id": 1044, "start": 6893.94, "end": 6897.94, "text": "Google ist ja so, außer Google interne Apps lustigerweise"}, {"id": 1045, "start": 6897.94, "end": 6901.94, "text": "Google selbst steht ja total auf so Material Design Geschichten"}, {"id": 1046, "start": 6901.94, "end": 6906.94, "text": "Außer die YouTube App und Google Apps selbst, die nehmen es dann nicht so eng"}, {"id": 1047, "start": 6906.94, "end": 6909.94, "text": "Okay, Leute, wir haben jetzt zwei Varianten"}, {"id": 1048, "start": 6909.94, "end": 6911.94, "text": "Wobei, ich hab's eigentlich vorhin schon beantwortet"}, {"id": 1049, "start": 6911.94, "end": 6913.94, "text": "Ich hab gesagt, wir machen das diesmal selbst"}, {"id": 1050, "start": 6913.94, "end": 6916.94, "text": "Ich kopiere mir keine Helper-Geschichten und"}, {"id": 1051, "start": 6916.94, "end": 6918.94, "text": "Wir machen's von Hand"}, {"id": 1052, "start": 6918.94, "end": 6924.94, "text": "Also, ESP32-MQTT-Publish-Example"}, {"id": 1053, "start": 6924.94, "end": 6926.94, "text": "Also, es gibt zwei Varianten, was man jetzt machen kann"}, {"id": 1054, "start": 6926.94, "end": 6929.94, "text": "Man könnte entweder eine fertige MQTT-Library verwenden von GitHub"}, {"id": 1055, "start": 6929.94, "end": 6931.94, "text": "Gibt's beispielsweise AduiX"}, {"id": 1056, "start": 6931.94, "end": 6936.94, "text": "Pubsub"}, {"id": 1057, "start": 6936.94, "end": 6938.94, "text": "Könnte man nehmen, aber"}, {"id": 1058, "start": 6938.94, "end": 6942.94, "text": "Man könnte auch das eingebaute nehmen"}, {"id": 1059, "start": 6942.94, "end": 6945.94, "text": "Wie viel Flash ist voll mit Plutus, WLAN und MQTT?"}, {"id": 1060, "start": 6945.94, "end": 6949.94, "text": "Tja, aktuell sind wir bei"}, {"id": 1061, "start": 6949.94, "end": 6951.94, "text": "66%"}, {"id": 1062, "start": 6951.94, "end": 6953.94, "text": "Das ist vollkommen in Ordnung"}, {"id": 1063, "start": 6953.94, "end": 6955.94, "text": "Da ist sogar noch Platz für einen Web-Interface"}, {"id": 1064, "start": 6955.94, "end": 6957.94, "text": "Um Firmen zu verwenden"}, {"id": 1065, "start": 6957.94, "end": 6961.94, "text": "66%"}, {"id": 1066, "start": 6961.94, "end": 6963.94, "text": "Wohlgemerkt, 66%"}, {"id": 1067, "start": 6963.94, "end": 6965.94, "text": "Ich hab schon die"}, {"id": 1068, "start": 6965.94, "end": 6967.94, "text": "Die File-System-Partition für"}, {"id": 1069, "start": 6967.94, "end": 6969.94, "text": "Random-Dateien schon verkleinert"}, {"id": 1070, "start": 6969.94, "end": 6971.94, "text": "Also, wir haben 1,9 MB"}, {"id": 1071, "start": 6971.94, "end": 6989.94, "text": "Für den Kram"}, {"id": 1072, "start": 6989.94, "end": 6993.94, "text": "So"}, {"id": 1073, "start": 6993.94, "end": 6995.94, "text": "Espressif"}, {"id": 1074, "start": 6995.94, "end": 6997.94, "text": "Die haben doch"}, {"id": 1075, "start": 6997.94, "end": 6999.94, "text": "Wie schreibt man die?"}, {"id": 1076, "start": 6999.94, "end": 7001.94, "text": "Espressif"}, {"id": 1077, "start": 7001.94, "end": 7003.94, "text": "Ja, irgendwie so"}, {"id": 1078, "start": 7003.94, "end": 7005.94, "text": "Ich brauch Beispiele"}, {"id": 1079, "start": 7005.94, "end": 7011.94, "text": "Ich brauch Beispiele, wie der Kram funktioniert"}, {"id": 1080, "start": 7011.94, "end": 7013.94, "text": "MQTT"}, {"id": 1081, "start": 7013.94, "end": 7015.94, "text": "Over TCP"}, {"id": 1082, "start": 7015.94, "end": 7019.94, "text": "Jawoll"}, {"id": 1083, "start": 7019.94, "end": 7021.94, "text": "Du, du, du, du, du"}, {"id": 1084, "start": 7021.94, "end": 7023.94, "text": "Du, du, du, du, du"}, {"id": 1085, "start": 7023.94, "end": 7025.94, "text": "Du, du, du, du"}, {"id": 1086, "start": 7025.94, "end": 7027.94, "text": "Leute"}, {"id": 1087, "start": 7027.94, "end": 7029.94, "text": "Das ist doch einfach"}, {"id": 1088, "start": 7029.94, "end": 7031.94, "text": "Ich hab keinen Bock das nochmal neu zu programmieren"}, {"id": 1089, "start": 7031.94, "end": 7033.94, "text": "Ich nehm einfach was"}, {"id": 1090, "start": 7033.94, "end": 7035.94, "text": "Was ich schon mal gebaut hab"}, {"id": 1091, "start": 7041.94, "end": 7043.94, "text": "Wo ist es denn?"}, {"id": 1092, "start": 7043.94, "end": 7045.94, "text": "Ach hier"}, {"id": 1093, "start": 7045.94, "end": 7059.94, "text": "So"}, {"id": 1094, "start": 7059.94, "end": 7073.94, "text": "Tack"}, {"id": 1095, "start": 7073.94, "end": 7075.94, "text": "So"}, {"id": 1096, "start": 7075.94, "end": 7077.94, "text": "Müsste eins passen jetzt"}, {"id": 1097, "start": 7077.94, "end": 7079.94, "text": "So include"}, {"id": 1098, "start": 7079.94, "end": 7081.94, "text": "MQTT"}, {"id": 1099, "start": 7081.94, "end": 7083.94, "text": "Client"}, {"id": 1100, "start": 7083.94, "end": 7085.94, "text": "Wunderbar"}, {"id": 1101, "start": 7085.94, "end": 7087.94, "text": "Passt"}, {"id": 1102, "start": 7087.94, "end": 7089.94, "text": "Also es ist wirklich nicht viel"}, {"id": 1103, "start": 7089.94, "end": 7091.94, "text": "Das ist nur so ne Mini-Wrapper, den ich mir gebaut hab"}, {"id": 1104, "start": 7091.94, "end": 7093.94, "text": "Um die Native MQTT Funktionalität"}, {"id": 1105, "start": 7093.94, "end": 7095.94, "text": "Von dem Kram hier"}, {"id": 1106, "start": 7095.94, "end": 7097.94, "text": "Was wird gemacht?"}, {"id": 1107, "start": 7097.94, "end": 7099.94, "text": "Wir lesen den Sensor aus"}, {"id": 1108, "start": 7099.94, "end": 7101.94, "text": "Nämlich so ein"}, {"id": 1109, "start": 7101.94, "end": 7103.94, "text": "Und den Sensor den benutze ich nicht"}, {"id": 1110, "start": 7103.94, "end": 7105.94, "text": "Für nen Plumptopf, wie das gedacht ist"}, {"id": 1111, "start": 7105.94, "end": 7107.94, "text": "Sondern für nen Kühlschrank"}, {"id": 1112, "start": 7107.94, "end": 7109.94, "text": "Lichtsensor für Tür auf"}, {"id": 1113, "start": 7109.94, "end": 7111.94, "text": "Temperatursensor für"}, {"id": 1114, "start": 7111.94, "end": 7113.94, "text": "Temperatur, ne"}, {"id": 1115, "start": 7121.94, "end": 7123.94, "text": "So"}, {"id": 1116, "start": 7127.94, "end": 7129.94, "text": "Ähm"}, {"id": 1117, "start": 7129.94, "end": 7131.94, "text": "Leute"}, {"id": 1118, "start": 7131.94, "end": 7133.94, "text": "Wartet mal kurz"}, {"id": 1119, "start": 7133.94, "end": 7135.94, "text": "Ich hab was vergessen, es kann sein einer schweckt muss"}, {"id": 1120, "start": 7135.94, "end": 7161.94, "text": "Keck wait"}, {"id": 1121, "start": 7165.94, "end": 7167.94, "text": "Leute ich muss weg"}]}