{"text": "So Leute, weiter geht's, ich muss mir gerade noch was zu trinken holen. Ihr werdet es nicht glauben, ich hab off stream weiter gemacht, sodass es jetzt eigentlich funktioniert. Weil ich bin immer so lahm, wenn wir im stream was machen, da brauche ich drei Stunden für zwei Zeilen. Ups, warum ist da der Rahmen drum? Deswegen, ich mach mal kurz die ganzen Vms an, dann erzähle ich euch, ich zeige euch einfach, was ich gebaut habe. Kann sein, dass wir es noch ein bisschen umbauen müssen, dass ich es jetzt im stream verwenden kann, aber mal gucken. Erstmal starten, my home assistant starten und dann gucken wir mal. Heute bauen wir ein home assistant addon und pushen es, wir pushen es vielleicht schon auf shithub, falls irgendjemand nen fiat hat oder nen jeep oder irgendwas mit uconnect. Könnt ihr es dann theoretisch sogar schon ausprobieren, vorausgesetzt, ich kriege das gebacken, ein home assistant addon zu bauen, das habe ich noch nie gemacht, legit, wirklich. Nicht so dieses noch nie und ich hab doch irgendwie mal davor geguckt, hab ich wirklich noch nie gemacht. Aber ich hab vorhin mal geschaut, so das Starttutorial sieht easy aus, ja genau, ich hab reingeguckt, das sah relativ easy aus, irgendwie drei Dateien hinlegen und gut ist, mal gucken, wie es wirklich in der Praxis dann aussieht, mal schauen, so, home assistant gestartet, progas vm gestartet, diesen ganzen Krempel muss ich nochmal kurz zumachen, äh, kurz eine Runde Updates und dann nix, wie, gibt nix, keck wait, keine Updates, ah, aber dafür hier jede Menge Updates, geb ihm, Updaten, so, hier haben wir, der Mockchamp, hier haben wir auch noch äh, älteres Zeug auf Exit, gut, dann lassen wir den erstmal updaten und dann machen wir weiter, also ich hab, wie gesagt, ähm, das nochmal ein bisschen umgebaut und ähm, home assistant integration ordentlich reingebaut, also sprich, ich zeig's euch, ich zeig's euch, ich werd's einfach gleich laufen lassen, wir müssen bloß, doch, wir müssen zwei Sachen ändern, dass er sich nicht versucht, wirklich buffiert einzuloggen, weil, wie gesagt, ähm, ich hab nicht vor, mein Account zu leaken hier im Stream, deswegen muss ich das noch umbauen, dass er die Fake-Daten nimmt, anstatt sich direkt einzuloggen, aber dann ist, dann ist okay, ich, deswegen hab ich's auch noch nicht auf GitHub gepusht, ist der einzige Grund, warum ich's noch nicht auf GitHub gepusht hab, weil ich mir nicht sicher war, ob ich nicht im Source-Code irgendwo noch E-Mail oder Passwort oder so stehen hab, da hab ich mir gedacht, so na, guck, guck lieber nochmal bevor das, ups, was jetzt, lul, guck lieber nochmal bevor das pusht, aber da dürfte eigentlich nix mehr drin sein, ich hatte das nur an einer Stelle stehen und das hab ich rausgeschmissen, so, Update ist durch, genau, das sind übrig gebliebenen Sachen vom letztem Mal, äh, wenn wir grad dabei sind, ist was für Reap, was ich jetzt eigentlich nicht mehr, ich reboot immer, macht nix. Gibt's da eigentlich keine automatischen Checks beim Puschen? Also, du hast so eine, du hast diese Anzeige, aus was deine Repo besteht, also wenn du ausversehen irgendwelche SSL-Keys oder so pusht, dann siehst du's in der Code Übersicht, aber ich glaube, irgendwelche Analysetools standardmäßig gibt's nicht, du kannst natürlich selbst was machen, ja, du kannst bei nem Push irgendeinen Job laufen lassen, der guckt, aber da musst du halt erstmal puschen, das ist ja auch eine Sache, die find ich persönlich an GitHub ein bisschen doof, im Vergleich zu nem selbst gehausten Repo, du kannst auf GitHub keine ordentlichen Git-Hooks verwenden, das klappt nicht, das einzige was du machen kannst ist, irgendwelche, irgendwelche Web-Hooks kannst du verwenden, du kannst aber keine klassischen Git-Hooks verwenden, dass du quasi pushen, ablehnen kannst oder sowas, du kannst zwar die offiziellen Pre-Receive-Hooks nehmen, also quasi Branch-Protection oder sowas, aber wenn du sagst, hey, ich möchte eine spezielle, ich möchte einmal scannen nach Passwörtern bevor ich pushe, dann geht das nicht, zumindest nicht in nem Git-Hook, weil du kannst auf GitHub keine Pushs ablehnen, du kannst nur nach einem Push was auslösen, also du könntest checken, ob das okay ist und dann, nachdem du gepusht hast, könntest du dann irgendeine Meldung dir schicken, so Achtung, da ist ein Passwort drin, ja, du kannst natürlich auch einen lokalen Commit-Hook machen, aber ich fand das bei, mit nem lokalen Git-Repo, beziehungsweise lokal, irgendein Repo, was auf nem Server liegt, ganz praktisch, da konntest du Pre-Receive-Hooks machen, dass du manche Sachen ablehnen konntest beim Git-Push. So, Reboot ist immer gut, genau. Oh, was haben wir denn da heute im Hintergrund? Wie gesagt, Bing Image of the Day. Sowas? Weiß ich nicht. Das kommt drauf an, wie die das machen. Das musst du dir auch irgendwo laufen lassen und irgendwo muss es getriggert werden. Das kenn ich nicht, keine Ahnung. Sagt mir nix, ist aber sehr beliebt anscheinend. Äh, ich, also... Warum sollte ich ein extra Package hinzufügen, um ein Commit-Hook laufen lassen zu können? In jedem Git, das versteh ich wieder mal nicht, das ist so ein JavaScript-Git für uns wieder. Du kannst in jedem Git-Repo Punkt Git Hooks, Pre-Receive und Commit, da kannst du einfach was reinschreiben, das ist schon da. Also warum man das braucht, erschließt sich mir jetzt ehrlich gesagt gerade nicht. Noch nix, ich hab grad meine VM Rebooted. So, da sind wir. Mal hier Konsole starten. Das schöne an Git Hooks ist, das kommt gar nicht auf meine Code Pays an. Die sind einfach da. Guck mal hier. Achtung, Achtung. Machst du ein Hacks Addon? Ja, mach ich, wenn ich checke wie es funktioniert. Gut, Git Hooks. Und guck mal da. Leute. Ganz ohne NPM Install sind da einfach schon irgendwelche Git Hooks da. Wie ist das überhaupt möglich ohne NPM Install, dass da überhaupt irgendwas läuft ohne NPM Install? Ich dachte ohne NPM Install ist eigentlich prinzipiell überhaupt nichts möglich. Ich mein ohne NPM Install kann man noch nicht mal feststellen, ob eine Zahl gerade oder ungerade ist, hab ich gehört. Weiß nicht, wie es euch geht, Chat. Chat, könnt ihr das feststellen ohne NPM? Also bei mir hört's da auf. Ich brauch der NPM dazu. Oder Alternative PIP, oder GEM, oder Nugget, oder... Was gibt's denn da noch so alle? Ja, siehste, ohne zwei Gigabyte Module geht da natürlich nix, da habt ihr recht. Das ist das JavaScript Mindset, so mag ich euch, Chat. Exzellent. Halt die HiIQ wieder angesagt. Ohne zwei Gigabyte Abhängigkeiten ist das nicht möglich, das ist... So ist es. So sieht's aus. Und jeder der was anderes behauptet hat, einfach keine Ahnung. Alles Kacknubs. Äh, das ist der Package Manager für.NET. Allerdings nur mit nur einem G. Ich mein, eigentlich heißt es Nugget, aber ich sag immer Nugget. User32DLL. Das ist sehr Windows-Style, der Name. Aber danke schön für den Sub. Massive Subscription hier, drei Monate, huge. So, also ich check mal kurz mein lokales Repo aus. Ah ne, das gibt's schon. Ähm, da muss ich mal kurz den Fiat-Champ ummoven. Leute, morgen wird's auf der Arbeit lustig, ich krieg morgen ein neues Notebook. Ein Surface Book. Und wisst ihr was das erste ist, was ich mache auf dem Surface Book? Der Chat gibt, ihr wisst das, ihr wisst das, geht mal in euch. Was ist das erste was ich mache? Na, Linux ist klar. Welches Linux? Welches Linux? Archlinux, korrekt. Das erste was ich mache, ich hab extra schon USB-Stick eingepackt, das erste was ich machen werde ist ein Archlinux draufknallen. Da bin ich mal gespannt wie gut das auf dem Surface Hub läuft. So Leute, ich muss mal kurz mein lokales Repo klonen. HTTPS, SSH, hier. Achtung, mkdir, Fiat-Champ, wobei ich glaub es geht auch so. Geht klonen, da sind wir. Oh ne, Moment, ich hab das Fiat-Client genannt. Alter, was ist denn mit mir los? Weird-Champing. Das Repo heißt komplett falsch. Wie kann man das nur so kaputt nennen? Ne, so gehts ja, so gehts ja nicht. Gut, so ich werde das mal öffnen und dann zeige ich euch was ich gemacht hab. Und zeige euch auch die Home Assistant-Integration, wie gut das jetzt alles schon funktioniert, ohne dass wir uns hier schleppend im Stream dadurch durchkämpfen müssen. Also. Ja ja, ich truste meinem eigenen Repo. So, ich muss mal ganz kurz ins Main gucken ob das die richtige Version ohne Passwörter ist. Ja, ist es. Okay, also, auf gehts. Ach, da heißt es Fiat-Champ. Ich konnte mich auch nicht entscheiden, oder? Das Repo heißt Fiat-Client und das hier heißt Fiat-Champ. Na gut, also im Prinzip ist es mehr oder weniger das gleiche was wir gebaut haben zusammen im Stream. Nur, Alter, hab ich hier immer so eine große Schrift, oder? Ich hab doch nicht immer so eine fette Schrift hier im Stream, oder? Bin ich, bin ich, bin ich, bin ich? Ist das wirklich so, ist das immer so fett? Ich dachte eher ich hab sowas hier. Und das ist ja mega fett. Echt? Da erkennst du ja gar nichts. Aber es ist für euch besser, ne? Da erkennt ihr mehr. Naja, dann ist man, dann ist man auch gar nicht geneigt mehr als 120 Zeichen zu machen, weil mehr als 120 Zeichen passen dann gar nicht, ne, mehr als 108 Zeichen, weil mehr passen dann ja auch gar nicht auf den Bildschirm. Also, was wir heute machen ist folgendes. Also, ich fang nochmal anders an. Für alle, die nicht dabei waren, ich hab mir ein Fiat Elektroauto gekauft und hab festgestellt, ich bekomme die ganzen Daten nicht in meine Heimautomatisierung. Da so Sachen wie zum Beispiel Ladestatus, wie viel Prozent hat die Batterie, wieviel kann ich damit noch fahren, Reifendruck, aktueller Kilometerzähler, wieviel bin ich heute gefahren und solche Geschichten bekomme ich nicht in Home Assistant. Deswegen, das kannst du als Clip machen, ja, dann kannst du gleich Clip machen. Also, deswegen haben wir da was gebastelt, was die fiat api, sag mal so die inoffizielle fiat api anzapft. Muss ich nochmal abdecken hier? Alter, Home Assistant, ja, dann installier halt schnell. Also, was die fiat api anzapft und die Sachen in Home Assistant pumpt, das funktioniert schon ganz gut. Wo wir das letzte Mal stehen geblieben sind ist und was ich jetzt Offstream fertig gemacht hab ist, man kann nicht nur Sensoren in Home Assistant reinpumpen, sondern man kann auch Commands. Max, ja, ich hab noch gar nicht angefangen, das ist das, was ich das letzte Mal gemacht hab. So, und jetzt bin ich, jetzt bin ich, jetzt weiß ich nicht, was ich sagen wollte. Ähm, erstmal Home Assistant updaten, dann gehts weiter. Ja, also genau, jetzt weiß ich wieder. Wir sind stehen geblieben, dass wir nur Sachen in Home Assistant reinpumpen konnten, wir konnten keine Kommandos ausführen. Das hab ich jetzt auch gebaut, wir können jetzt Kommandos ausführen. Ich, wie gesagt, ich werd euch, ich werd's euch gleich zeigen. Wir können jetzt nämlich sowohl die, ah, das muss ich wahrscheinlich dann auch ändern, wir können die, den Standort des Autos abfragen und wir können diese Fiat Befehle, die, die ich aus diesem iOpRocker Addon mir abgeguckt hab, können wir auch direkt an Home Assistant sticken. Also wir können jetzt zum Beispiel dann, über Home Assistant hat man dann nen Schalter, da kann man dann den Kofferraum anlocken oder locken oder die Lichter blinken lassen oder, äh, die Klimaanlage an- und ausschalten und sowas. Das ist tatsächlich ganz praktisch, weil sonst geht ja die Hälfte der Funktion, die die App hat nicht und ich will ja, dass ich mehr oder weniger alles kann wie die App und eigentlich nur besser. So, da sind wir. So, also da haben wir das letzte Mal aufgehört. Ich glaube, ich muss euch jetzt nicht das alles im Detail zeigen, aber nur mal so ganz grob. Ich beleg grad, wie wir das machen. Wie kann ich das jetzt ausführen? Was ist der TÜV da? Nix. Was soll das? Ist doch dem TÜV egal. Das ist immer so ein, das, das hör ich bei total vielen Sachen. Was wohl, was soll denn der TÜV davon halten? Das ist, das geht dem TÜV am Arsch vorbei, ob ich über ein Webinterface irgendwelche Datenauslese, die eh schon da sind. Was soll das? Das juckt den TÜV doch immer absolut gar nicht. Das ist höchstens für mich gut, dass ich weiß, wann ich wieder zur nächsten Wartung fahren muss. Ja, weil zum Beispiel, ich sehe hier Kilometer bis zur Wartung. Ja gut, das ist Fake, Fake-Response, aber ja. Nee, das ist dem TÜV vollkommen egal. So, wir tragen da jetzt mal ein paar Fake-Werte ein. Ach so, Remote blinken lassen. Nö, das ist dem TÜV auch egal. Das kannst du über die App ja auch machen. Nur weil du das über die Home Assistant machst, dann statt der App ist das dem TÜV, wenn man davon abkommt, der TÜV kriegt das gar nicht mit. Und selbst wenn er es mitkriegt, wäre es ihm egal. Genau, ja. So, also Leute, wir müssen mal, was ist denn, was hat denn Deutschland für Länge und Breitengrad so? Hier, Salzgitter, da, da muss schon immer mal mein Auto stehen. Salzgitter, Leute. Das ist mein Auto jetzt. Salzgitter. Auto hupen lassen, während es beim TÜV steht. Man kann nicht hupen lassen, das wäre natürlich mega, wenn das geht. Man kann das Auto nur die Lichthupe machen. Man kann Lichthupe machen und das ist dafür da, dass man sein Auto wieder findet, wenn man beispielsweise irgendwie im Dunklen über den Parkplatz läuft. Das ist eigentlich eine ganz gute Idee. Aber hupen lassen geht nicht. Ja, beim Tesla geht technisch an sich eh schon einiges mehr. Die zeichnen ja auch beispielsweise exakte Verläufe der Fahrten auf und so was. Das macht der Fiat auch nicht. Der Fiat zeichnet die Kilometer auf und der übermittelt ab und zu mal so alle Viertelstunde, alle 10 Minuten Viertelstunde die GPS Position. Also sprich, das ist, naja, also wirklich Bewegungsprofil, ein gutes. Kannst du da dran nicht erstellen. Aber ist egal. Ich zeige euch jetzt erstmal im Home Assistant, wie das Ganze dann ausschaut. Damit das funktioniert, ich mir gerade überlegen. Ich habe das nämlich schon angepasst, dass man das über Environment Variablen reinkriegt. Dann testen wir doch gerade mal, ob es mit Environment Variablen alles funktioniert. Probieren das doch gerade mal aus. Epo, Fiat, Client. Testen wir noch mal gerade. Also, weil wir können ja, wenn wir das im Container laufen lassen, müssen wir die Daten von Home Assistant über Environment Variablen da reinpacken. Deswegen simuliere ich das jetzt einfach gerade mal. Also Fiat Login. Gut, Fiat Login werden wir nicht brauchen, weil wir Fake-Responses verwenden, weil ich mein Passwort nicht liegen will. CAC, Fiat, PW, CAC, MQTT Server, das brauchen wir. Das ist nicht CAC, sondern das da. MQTT User. Weiß ich schon gar nicht mehr. Sub. Ach, MQTT 123456. Ne, da hätte ich ja auch selbst drauf kommen können. MQTT User, MQTT PW ist 123456. Was brauchen wir sonst noch? Port. Port brauchen wir nicht. Ok, also ich lasse es jetzt mal laufen und dann werden wir gleich sehen, es crasht. Es ist logisch, dass es crasht, weil naja, CAC und CAC ist kein gültiges Fiat Login. Mal gucken, was passiert. Na ja, ganz... Ja, guck hier, verbinden. Invalid Login ID. Hunst nicht. Kaputt. Invalid Login ID. Invalid Login ID or Passwort. Ja, das hätte man sich aber eigentlich denken können. Ja, das hätte man sich denken können, weil CAC und CAC ist kein gültiges Fiat Login. Deswegen kommentiere ich jetzt, dass wir das ordentliche testen können offline. Deswegen kommentiere ich jetzt einfach mal das Login aus, dass er sich versucht einzuloggen und beim Fahrzeug Fetchen rufen wir einfach Fake Daten ab und gut ist, die Fake Daten kopieren wir uns mal kurz aus diesem anderen, was ich hier hatte vom letzten Mal. Hier. Fake. Fake. Könnte bei Gelegenheit... Habe ich das in dem anderen nicht schon gemacht vom letzten Mal? Ja. Ja. Oh, Vim. No. Set. Nee. Set. Set number aus. Alter Vim Logik, du kannst... Manchmal ist es Set No, No Set, Set irgendetwas gleich Null, das hat alles keinerlei System wie man das macht. Entweder man merkt sich oder man hat verloren ok zack zack so wir returnen mal für eine fake fake response dass ich mein home assistant befüllt krieg und dass ich euch den rechts den rest zeigen kann sehr schön ist wim zu schwer bist du zu schwach leute wim ist einfach total inkonsistent an vielen stellen dafür ist wim was das editieren angeht mega poc weil wenn man sich einmal gemerkt hat was da so geht mit mit editieren und change change inner quotes und solche sachen dann ist das wirklich mega nice leider dauert es ein bisschen ok auf geht's wir exportieren das ganze mal schauen ob das funktioniert jetzt wir sollten jetzt im home assistant ein eintrag bekommen der sich kartu nennt integrations mqtt oder pock pock k hatten wir das letzte mal pock k genau das sollten wir jetzt wieder bekommen mit allen möglichen infos aber jetzt mit switches und allem ich hoffe es funktioniert jetzt aber da ist es pock k ha ha da haben wir alles mein fiat login war gerade zu sehen wo ach hier ne das ist fake das da ne das ist fake das macht nichts das ist das ist fake das gibt's nicht meinst das hier ne ne ne ne ne das ist nix nix bildes das ist fake adresse mit fake password das habe ich extra für ein stream angelegt weil eigentlich ist login ist da nicht mehr drinne zu also mein mein richtiges mein richtig ja ist gut dass du sagst ja chat six hat heim wieder gut dass du sagst denn das hatte ich fake mäßig für ein stream angelegt mein richtiges login ist nicht drinne so also hier ist das auto wieder nur mit dem unterschied guckt mal ich habe es umbenannt ist natürlich auch sehr sehr clever gewesen von mir das dass das umzubringen wisst ihr was ich benenne es jetzt testweise wieder zurück weil ich keinen bock habe im web interface das zurück zu wir löschen es noch mal und fühlen es noch mal aus root habe ich das letzte mal genannt ja siehst du so einfach kann man zum neuen fiat kommen so da sind wir jetzt passt auch wieder so guck jetzt ist das dashboard auch wieder befüllt also ladung 8 90 prozent 45 kilometer gefahren bla bla bla blub es gibt jetzt ein paar neue sachen was ich gemacht habe während ihr nicht da wart nämlich zum beispiel bekommt man jetzt die location von dem auto die ist nämlich da guckt also die location das ist fake location jetzt die ich für ein stream eingetragen habe jetzt hat man nämlich auch die location das heißt man kann jetzt zum beispiel auch sowas hier machen dass man eine map einbindet und sagt dann car location und dann sieht man in städt steht angeblich mein auto ok standort aus to show 48 default zoom das ist natürlich cool angeblich cup das ist natürlich sehr praktisch jetzt kann man auch gleich sehen wo das auto ist ich überlege gerade habe ich habe ich sonst noch irgendwas bei mir lokal geändert ach so ja natürlich jetzt kann man nämlich auch die buttons hier hinzuführen guckt mal jetzt kann ich nämlich sagen hier zum beispiel wir machen ein grit mit einem oder nehmen wir machen kein grit cancel und so eine entity liste und sagen dann hier zum beispiel k nicht location sensor klimaanlage auto klimaanlage an und aus kann man machen oder was habe ich sonst noch hier drin blink zum beispiel kofferraum kofferraum kann man auch kofferraum kann man auch machen kofferraum schreibt man das so mit 2f und 2r täglich deutsch truck genau dass die datenbank muss dahin für kofferraum ja jetzt kann man den kofferraum auf und zu machen klimaanlage an und ausschalten oder auch zum beispiel blinken lassen aber das mal blink haben wir hier ein light icon lights oder so zumindest kann man jetzt auch kommandos an sein auto schicken das ist das worauf ich raus will also kann man zum beispiel sagen kofferraum klimaanlage an aus und kofferraum auf und zu und solche geschichten allerdings muss man halt sagen das ist asynchron das geht über die fiat api das dauert ein bisschen also sprich selbst wenn ich jetzt die klimaanlage einschalte dann dauert das bestimmt 20 sekunden bis es angeht das ist das ist langsam und kofferraum öffnen dauert bestimmt auch 20 sekunden aber gut da kann es nichts machen deswegen stelle ich den status auch sofort auf ok nicht dass die leute hier anfangen so dumm rumzuklicken genau ja also so sieht die aktuelle home assistant integration aus ich denke mal das ist richtig nice kofferraum geht auf nachdem man losgefahren ist das weiß ich nicht das habe ich nicht ausprobiert ob man beispielsweise wenn jemand drinne ist und das auto angeschaltet hat wirklich sagen kann kofferraum entriegeln und ob das dann auch geht keine ahnung wobei naja gut wenn du fährst geht ja keiner hinten und macht auf aber das weiß ich nicht ob die dann einen schutz drin haben oder nicht wenn es klickt bis selbst dran schuld das schreibe ich auch in die app rein ich übernehme keine garantie für irgendwas so und jetzt müssen wir daraus den home assistant addon bauen die sache ist nämlich die schön und gut wenn ich das hier bei mir laufen lassen kann und über mqtt in home assistant sachen exportieren man will ja dass das ganze automatisch funktioniert und ich kann ja auch keinem zumuten irgendwie den source code runterzuladen da was drinne einzutragen dann selbst zu kompilieren oder sowas das ist ja natürlich bescheuert deswegen versuche ich da draus jetzt mal ein home assistant addon zu bauen das habe ich legit noch nie gemacht home assistant addon tutorial aber ich habe vorhin mal in das tutorial reingeguckt das sah tatsächlich gar nicht so kompliziert aus man braucht irgendwie den docker feil konfig jammel runsh also ich würde sagen wir probieren das einfach mal aus ja also fiat client da sind wir also was brauchen wir das lasst uns das mal angucken inside that directory brauchen wir docker feil konfig jammel runsh ja gut aus das lässt sich das lässt sich einrichten ein docker feil brauma ein konfig jammel brauma ich glaube die meinen dass man das hier im root macht du musst nach integration suchen ich will keine integration machen ich will ein addon machen eine integration muss ja in python programmiert sein und muss dann als integration da rein ach so ja du hast recht deswegen mache ich auch nicht über hacks weil über hacks kannst du das ja nicht machen ich will kein das wird ein addon so runsh brauchen wir noch ein runsh alles unter ordner ist hyperplot so also was muss denn jetzt da rein vor allem wie kriege ich das dann auf mein home assistant drauf habe ich habe ich ssh addons oder sowas installiert ja habe ich zum glück kann ich bei ssh drauf kopieren aber ich glaube dass das wird man ja sieht man ja denn hier drin also was muss man machen die dateien anlegen docker feil soll so aussehen ok das kriegen wir hin ark bild from bild sollte da nicht irgendwas rein oder ersetzt das oder ersetzt das home assistant automatisch copy runsh ok dann führt der runsh aus ok das ist easy das könnte nicht viel einfacher sein config feil jammel so was kann man da konfigurieren hello world my first addon den heißt vier champ keck version 1 0 slack hetschapp in it was macht denn in it also das gibt es auf jeden fall nur für amd 64 das da und für arm v7 und v8 ist das v8 was anderes was anderes unterstützen wenn ich das reicht aber auch ganz ehrlich das ist auch ok so passt so und jetzt wie geht das weiter runsh ja gut das kriege ich ok wisst ihr was wir machen mal das tutorial durch dass ich ungefähr verstehe um was es geht moment warum habe ich das muss ich docker feil kopieren nicht dahin was muss dahin hello world ok alles klar installing and testing your add-on open config home assistant add-on backup super adon store check for update button you should now see ne moment das sehe ich bestimmt nicht das liegt bei mir lokal auf der platte wie kriege ich das hin ach hier vor ssh ok ich das heißt ich muss es auf mein respawn nicht auf was habe ich denn ich habe ich muss es auf mein home assistant rüber kopieren gut probieren wir das mal aus also der da auf welchem port läuft das ist auch standardmäßig auch 22 nice ssh key gen minus er ist und was ist das default password configuration cute chat 123 alles klar ich glaube ich glaube wir machen mal wir kopieren mal kurz das password rüber aus irgendwelchen gründen ist es mir nicht ist es ok sfdp brauche ich glaube ich muss das in authorized keys rein packen sonst geht das nicht anders ok cut ssh achtung leute jetzt kein ssh key liegen max et poggers muss man das kann man das so reinschreiben save restart hoffentlich frisst er das lock ja gehen wir nicht auf den sack ob man mal funktioniert oder verwendet er den key gar nicht dass der key ist fünf jahre alt oder so wo ist mein key hin warum ach mehrere save buttons alter six hat konfiguration das ist der IQ technisch schon wieder versagt so geht's jetzt das sieht natürlich schon das sieht wie der hive meint im chat ja das ist halt so der chat ist mittlerweile durch die ganzen subs und bits und alles und über die letzten jahre über der ist so extrem high IQ da kann ich kann ich nicht mal gegen anstehen der ist der chat ist wirklich schon mittlerweile so der kopf ist so quasi komplett in die breite schon seit 16 zu neun eher 16 zu fünf so da sind wir eingelogged wie wo hin muss ich den kram überhaupt kopieren für ok das mag ich an home assistant die dinger sind immer relativ selbsterklärend ok also heißt von der idee bild publish publish also minus konfiguration nicht release die back ist ok minus wobei kommt scheiß drauf wir lassen erst mal das hello world laufen und gut ist also wohin wird der ganze krempel der netz scp scp 134 also wir scp das da jetzt einfach mal nach dem slash add ons ist es 1 2 1 3 2 überhaupt gewesen ach nee 1 3 1 3 1 3 2 ist es gewesen ok action close ach so ich muss ja minus er machen scp connection close ich habe irgendwas von sftp er laut oder so gesehen zeigt mal her ich muss ich das auf true setzen dass ich ssh machen kann wenn alles nicht hilft dann erst und ja erst und ist ja eigentlich das was man eher nehmen sollte nexon refused alter was jetzt you have enabled sftp using ssh enable this requires ssh username to be root was ok ist mir lieber wenn ich ruht bin ruht tut gut jetzt sagt fahr jetzt zu megas dann da sind wir dann fahr du mal zu megas glhf bei megas jetzt geben halt alle geben halt per ruht drauf mein sind wir halt ruht slash add ons via champ da sind wir ok also und jetzt wie lebt man jetzt die add ons basic kakona ja hau dir den richtig fetten kakona burger rein hat attack burger wobei ich glaube so was gibt es bei mcdonalds nicht aber in amis gibt so was die haben doch in den usa gibt es auch diese komische fast food ich weiß nicht welche das ist da gibt es auch diese fast food kette wo du hat attack burger kaufen kannst wo auch die die kellerin in bikinis und so rumlaufen wie heißt das normal da sitzen die ganzen halbe kakone aus rum und fressen den ganzen tag guters das kann sein ich ja doch kann sein so wo muss ich denn jetzt hin hau muss es den frontend da sind wir configuration add ons und add ons store ok im prinzip weiß ich eigentlich wo ich hin muss wir sind ja hier schon richtig auch nicht settings add ons add ons store und jetzt was muss ich bin verwirrt habe ich das jetzt gerade geschlossen oder was jetzt gerade habe ich das jetzt gerade zugemacht weil ich total bescheuert bin so also click add ons store in the bottom right habe ich top right overflow in new click check for update button da und jetzt hier schutz siehnau new section called local add ons nur löse ich nicht habe ich irgendwas vergessen also man muss das so heißen muss das so heißen kann das sein dass der kram nicht richtig heißt dass es dass es so heißen muss weil ich hier in der config jammel das ding auch so genannt kann das sein check for updates nö und jetzt das tutorial klappt nicht hier oben sollte ich jetzt local add ons sehen nö sehe ich nicht ich sehe keine local add ons gibt es nicht finden tut auch nicht habe ich irgendwas übersehen was ich machen muss add ons folder samba nö nö slash addon muss man sonst muss man dann nichts machen ok dann machen wir das mal anders wenn das nicht funktioniert wir machen jetzt wirklich eins zu eins das tutorial machen eins zu eins das tutorial also ich soll ein verzeichnis erstellen hello world alles klar add ons mk dir hello world dann da drin ein docker file erstellen mit diesem inhalt alles klar habe ich gemacht danach eine config jammel erstellen mit diesem inhalt auch auch alles klar dann ein runsh file erstellen es stimmt recht stand da was von chmod mein ich bin root wenn ich dateien anlege dann das kann natürlich sein dass es nicht gut gehören darf du hast recht das ist das das wird es wahrscheinlich sein ja ja ja guck dir mal ups alter ich kann das gehört root aber wir machen einfach mal 777 auf move dockerfile config jammel run nach hello world .sh so jetzt haben wir exakt das gemacht was im tutorial steht installing and testing check updates nö will nicht hä leute ich hätte wahrscheinlich einfach refreshen müssen wobei ok install start start logs hello world ok das hat funktioniert uninstall uninstall was auch immer ja dann scp ich das ding jetzt noch mal scp fiat fiat champ allerdings nach geht das habe ich noch nie ausprobiert ob man das so umbenennen kann mit scp ja geht sehr schön jetzt müsste es jetzt müsste es eigentlich checken da ist er doch der fiat champ man muss einfach ohne cash refreshen und gut ist alter lull das muss jetzt erstmal einer verstehen na gut ok also wir wollen jetzt natürlich nicht hello world ausführen sondern erst einmal erst einmal wollen wir das ding bilden publish publish so config nee release lassen wir weg ich will mit debug ausgabe sehen dot net publish linux self contain publish ja das ist erstmal ok so wie groß ist das binary jetzt 120 mb 68 das geht ja sogar noch so und das wollen wir starten ja ok das funst das heißt in das run file muss jetzt was rein nee moment erst einmal docker file wir müssen den krempel jetzt noch kopieren genau wir wollen nämlich wir wollen nämlich bild slash fiat champ da auch hinkopieren wollen wir das nicht vorwarnen vielleicht unterordner machen irgendwie so kann man so und dann kommt der kram noch hier drauf zum ausführen ja und dann starten wir runsh und in runsh sagen wir da nicht hello world sondern slash fiat champ so und jetzt sollte den krempel zumindest schon mal starten jetzt habe ich im tutorial gesehen jetzt muss man die versionsnummer hoch zählen sonst checkt das nämlich net net zcpn wirs rüber jetzt muss ich ersunken Leute sonst dauert es zu lang wenn ich das nicht ersünke dauert das drei stunden ich habe das jetzt ineinander kopiert ne das ist ok wir ersunken das jetzt mal ersünk minus v minus a ging das so nee ersünk es ist three hat so ey sieht schon mal besser aus jawoll nice und jetzt kann ich nämlich den ganzen krempel auch ein bisschen schneller sinken alles da schauen wir mal was wir jetzt neues neue addon version haben eins punkt eins ok install dark zone schreibt was was macht minus k ist minus k nicht zertifikate ignorieren moin zusammen ich versuche im moment ross desk von github bei mir auf eine ubuntu vm zu installieren im firmnetz und wenn ich weg hat mache sagt er mir dass die echtheit vom zertifikat nicht überprüft werden kann hab schon sehr also kannst du das einfach ignorieren sowohl mit karl als auch mit weget und ja ich glaube es wirklich minus k aber dann sagt er das denn weil ich mein github hat definitiv ein gültiges zertifikat es würde mich doch sehr wundern hätte github kein gültiges zertifikat achso starten muss ich vielleicht noch log vier champ no such file or directory warum warum nicht wo ist es denn wo ist es hin muss ich das so nennen das müsste ich habe es auch ich habe es doch dahin kopiert das müsste auch da sein oder bin ich jetzt bin ich jetzt pp gar im kopf was docker docker feil angeht ne ne es ist kein punkt sh es ist einfach nur guck einfach ohne ohne was aber das müsste auch eigentlich da sein wenn ich es dann noch mal hin habe ich den sündungsfehler immer im docker feil oder sowas aber also mich wird es wirklich wundern wenn weget mein das github das zertifikat abgelaufen ist das ist verwirrt die anzeige ist etwas durcheinander hier glaube ich jetzt install dann bin ich nicht so verstehe ich nicht so ganz was er für schmerzen hat warum er es nicht findet ist nicht das github zrm er will es doch von github installieren wo ist das problem warte mal ich muss mal kurz chat lesen so wenn du ein weget auf github machst sagt er das ist nicht echt ja die zeit stimmt vielleicht in der ubuntu vm nicht das könnte eventuell noch sein aber ansonsten geht es über irgendein proxien die dich irgendwie machen die irgendwelche magic mit transparenter proxy oder machen die irgendwelche komischen dinger bei euch auf der arbeit was hat denn sein company company hu ca und der trust store mit einem get mit einem weget auf github zu tun ich würde jetzt lieber gerne wissen warum der der meinung ist dass der vier champ nicht findet wo ist das wo ist jetzt das problem das mache ich doch richtig oder copy run asa nach slash run asa und jetzt copy bild für dahin und dann ist es doch da mehr die run asa brauche ich nicht wirklich aber vielleicht wird doch die brauche ich ich will ja noch ein bisschen mehr machen gleich aber wo ist das problem also jetzt fliege ich nicht mehr durch slash gibt's nicht wisst ihr der fiat pfiat champs store page jetzt das geht immer in das internet so copy so schwierig ist das ja eigentlich nett genau das ist theoretisch relativ simpel findet er das nicht beim ko hat hat man vielleicht ein lock vom bild oder so dass man hier irgendwie nachgucken kann lock hat kein lock vom bild vielleicht in den system locks locks locks supervisor aha build verstehe ich das leuchtet jetzt nicht nein ich weil wenn ich da in krab angebe dann sollte das bilden schon mal überhaupt nicht funktionieren da hätte ich jetzt nicht gedacht dass es an der stelle kompliziert wird schon es fackt mich immer ab wenn so einfache dinger dann nicht funktionieren so ne wo war das hier addon store check for updates nein wir brauchen kein backup aha ja siehste wenn es nicht wenn du was kopierst was nicht da ist dann geht es nicht das ist ja ok so bild fiat champ ok so was ich jetzt mal mach lsla slash lass mir anzeigen check for updates update man jetzt macht ein backup eget in beim ch mod ich kopier es dahin und dann mache ich ein ch mod das ist ok ok warum braucht jetzt drei stunden dafür alter was machst du denn da ach jetzt hat er geupdatet ok lock start da ist es doch da ist es doch ganz offensichtlich und hat auch execute rechte will er mich verarschen da ist es doch das ist doch ganz offensichtlich da ich habs nicht für arm gebaut ich habs für x86 gebaut oder ja kann das sein ok ich hab ne idee ich hab ne idee kann das sein dass diese meldung einfach nur richtig bescheuert ist probieren wir mal was aus blub.sh bin.sh echo123 so ok copy blub.sh ich mach das alles mal in ein eigenes verzeichnis gleich so und jetzt gucken wir mal ob das geht weil es könnte sein dass der ein anderes problem hat ich glaube der hat ein anderes problem rsync rüber rsync dieser store ist wirklich ganz pepega zu bedienen ja so check for updates alles klar update wisst ihr was ich glaube das no such filo directory ist dotnet beim starten was das sagt ich gehe davon aus da fehlt irgendwas weil dotnet hat eine oder zwei abhängigkeiten selbst bei self contained access wenn man das nicht abschaltet man kann das abschalten die brauchen irgendeine translation library oder sowas wenn es nicht ausschaltet guck hier das funktioniert das funst was ist denn das für ein system wir installieren da was nach kann man sich da irgendwie connecten oder so docker protection mode ach was protection mode nix protection hier wird nix protected ich hab doch grad schon geupdatet der ist der ist verwirrt der ist verwirrt protection mode protection protection mode ich will ich will per command line auf das system drauf so was läuft da wo ist denn meiner wo ist denn hier der nee wo ist es denn wie kann ich mich jetzt auf meinen läuft das addon überhaupt protection mode ist das ps-a aber es sollte doch laufen ach nee es läuft nicht es hat sein es hat sein links gestartet und gut es aber wie ging das jetzt docker execk kriege ich aus dem kopf nicht gebacken docker execk bin bash oder so nee er ist noch running run it run it war das run it run it was latest was moment nein image execk ist richtig aber wie ging das jetzt was so tatsächlich nee nee nee nee nee nee das ist run bin bash docker hier ja das das ist neu starten warum findet er das image eigentlich nicht muss die muss das da muss das image hinten dran ja ich mach das schon nicht das ist schon richtig nee nee docker images wo ist es denn da hier das da brauchen wir ach nee image id das da brauchen wir so also was ist denn das ist das ein debian nee das ist das ist ein dings das ist ein alpine oder ok slash fiat fiat champ no such file directly ok da fehlt irgendwas wartet mal was braucht dotnet noch mal dass es läuft ohne wenn man es nicht abschaltet das braucht dings wie heißt das irgend so eine globalization translation library war das eco an die ad ist es lip eq oder sowas wie heißt der kram einfach so eq lips fiat champ fuck ähm warte mal ach moment das ist ein alpine das muss man anders warte mal dotnet das muss das musste man doch anders machen oder für alpine linux muss man das doch anders nennen genau da musste ich so kompilieren dass es funktioniert stimmt ich erinnere mich da muss man das muss man so machen publish weil alpine benutzt irgend so eine furchtbar exotische c library mit der es sonst nicht funktioniert so willst du das neue kort ausprobieren ja wahrscheinlich schon ok jetzt jetzt sollte es aber funktionieren bild da ist es mal gucken wann es zuletzt kompiliert wurde 2127 das sieht ziemlich gut aus so jetzt müssen muss es aber funktionieren so zack dass da weg da mal die versionsnummer rauf und ersunken das rüber rüber ersünkt addons ne da muss man nicht hin wir müssen hier irgendwo ins webinterface ja addons zack für updates hallo oh ich hab vergessen zu speichern ersünkt check for updates update so und jetzt sollte es laufen kannst du nicht einfach ein ubuntu docker image nehmen doch wahrscheinlich aber das default image von denen ist wahrscheinlich ist anscheinend ein alpine image wahrscheinlich kann ich nehmen was ich will ja da gehe ich auch mal von aus so wie sieht es denn jetzt aus start achtung ok das stimmt irgendwelche versionen nicht entweder ist da irgendwas zu machen wie ich sowas nicht ab kann so ok wir nehmen anderes image build from home assistant addons base images was haben wir da alles zu bieten base images ja was haben wir da hast du das mit der dotnet beta gemacht ja aber sollte eigentlich mal wir können ja mal gucken dotnet sieben prerequisites die sollten eigentlich mehrere jahre zurück ja so ported os alpine linux 13 ok release notes für ach so das ist noch das ist noch core sieben ja man kann bestimmt l.o.t. compile aber support os alpine 115 so und das ist das ist von sonst wann wie gesagt wir haben das von einem ubuntu von vor 15 jahren laufen lassen kann er jetzt nicht sein die side base images was haben wir denn für base images dockerfile alpine 316 siehste wir das probieren wir doch mal aus docker images das da wollen wir haben run so slash fiat ja also daran wird es jetzt wird es ja nicht liegen das würde normalerweise eine ordentliche fehler easy tatsächlich die die übersetzungs library die internationalisierungs dingsbums library das kann man ausschalten da muss ich in invariant bilden dann geht das aber wir können es auch einfach wir können es auch einfach adden was auch immer ich davon brauche wunderbar so versionsnummer fünf ok so jetzt aber please einfach einfach funktionieren check for updates jawoll fünf ist da kein backup update jetzt aber auf an ich muss noch starten das sieht doch gut aus es funktioniert ja das ist gut es funktioniert jetzt können wir gucken wie wir die ganzen daten da rein kriegen also ich habe in diesem tutorial folgendes gefunden man kann man kann auslesen was der genau options home assistant addons mqtt man kann auslesen was für den mqtt server gesetzt ist das heißt das muss man gar nicht in der config angeben genau so hoffe das hoffe das war so mqtt oder mysql ging das ja so das heißt schreiben wir das mal in die runsh und geben wir mal testweise keine ahnung testweise irgendwie usernamen aus und schauen wir mal vielleicht vielleicht geht es ja auch ohne update vielleicht reicht es ja auch wenn ich einfach nach rebuild vielleicht macht das ja dann neu und ich brauche den ganzen krempel ich weil da kriege ich die ganzen infos raus und die muss ich dann als environment variablen exportieren dass der krempel funktioniert ok start ok nee geht halt nicht funktioniert man muss man muss wirklich die config file soll halt wir machen das jetzt mal anders wir machen wir machen das mal anders ich habe mich keinen bock immer das von hand da einzutragen mit mit config config version und und gedöns ja wobei ich wollte jetzt automatisch wollte irgendwie den seet rüber machen aber dann habe ich überlegt wie zähle ich dann hoch kannst du nicht einfach auto update machen tja und scheinheit ich muss immer da oben klicken ich wobei was wir machen können ist kann das da aufmachen den store dann klicke ich hier auf update und hier bleibe ich dann da drinnen für update ja kannst du nicht auch einfach auto update machen ja wie gut das könne ich wahrscheinlich wirklich machen aber trotzdem muss jemand die datei anpassen das ist halt das doofe start ja nee sollte er nicht eigentlich den echo machen mit usernamen aber wahrscheinlich ich fand das nicht echo haben wir hier irgendwie sowas rein usernamen host vielleicht funktioniert das ja so gar nicht und jetzt muss ich da wieder richtig das richtig dumm er so refresh ja check for update so hoffentlich hoffentlich zeigt das mir jetzt irgendwas an weil ich meine ich brauche mein mqtt server und ich brauche den api login nee das ist was anderes mit dem kein zugriff auf den service oder achso und wie kriege ich access zu meinem mqtt service das ist nicht im scope genau wie kriege ich access zu meinem und da muss man bestimmt hier irgendwas das ist eine mario playlist das muss ich bestimmt hier reinschreiben dass ich das dass ich das machen darf da muss ich über home assist home assistant discovery wo habe ich denn das gefunden das war irgendeine hilfeseite da ging es um mysql und um mqtt da stand drinne wie das funktioniert hier addon communication genau das brauche ich ja we have an internal service api to make service public addon needs ok addon needs to mark the usage of the server over his configuration also da muss man irgendwas da muss man irgendwas eintragen dass man das dass man das darf a list of services discovery was in meinem beispiel werfeleinheit verkehrt discovery ok ich sehe schon dass es ist nicht so einfach optional configuration options optional options das ist auch gut discovery ok das heißt ich muss hier unten in die config jammeln reinschreiben discovery und dann eine liste mqtt hoffe ich mal dass es dann so funktioniert was mqtt ist das ist ein sehr leichtgewichtiger message broker bus das ist in der iot welt so das ding wo alle devices ihre infos hinschicken und broadcasten und subscriben und so alter wo ist das problem man no access to mqtt warum ich habe doch explizit gesagt ich will das haben in der config so wir suchen jetzt einfach mal nach der fehlermeldung ja genau hier zeige ich wie es funktioniert service not enabled mostly ja und weiter no access to mqtt ja gut mein addon braucht irgendwelche spezialrechte dafür dass man das machen darf und und und wie fragt man das an eine güte das ist tatsächlich komplizierter als ich mir das vorgestellt habe die sündags im jammeln richtig würde mal sagen ja ja würde ich schon mal sagen dass die richtig ist ich meine das ist jason style das müsste aber in jammeln auch erlaubt sein man könne es ja so machen aber trotzdem was macht denn in it eigentlich in it that is to fall so deshalb die docker die fall system in it ok man muss auch voll stehen lassen also es ist nicht so einfach das ist wirklich 6 hat da muss man muss man genau gucken wie das wie das funktioniert hier wir suchen mal ok ich weiß was wir machen jetzt hab wir gucken mal rein wie die anderen leute das definiert haben so da kann ich den ganzen jammeln weg das ist was anderes oder wenn das steht einfach nur mq ne das ist was anderes wo ja wo ist denn wo ist denn hier jetzt die die konfig jammeln die gibt es hier gar nicht ok was was für einen addon hat auf jeden fall options also das sind options die er mir anzeigt im web interface das ist nicht die options was mein addon darf und was es nicht darf das ist was anderes wo ist was mit service ach so alter btf jetzt ernsthaft wie soll man da drauf kommen also da wäre ich im leben nicht drauf gekommen das so zu schreiben wirklich ganz sicherlich nicht so jetzt müssen wir das mal in verjamme lisieren so und hoffen dass jammel jetzt jammelt erzink dies jetzt einfach einfach funktionieren wenn es geht einfach funken so aber das müsste damit doch jetzt eigentlich gehen was addons addons username ist addons ach das ist ein eigener username oder wie ok jetzt bin ich mal gespannt was ist password ok was ist port und was ist was ist password dann also addons haben anscheinend den eigenen user der alles darf scheint so zu sein man muss gar nicht den standard user nehmen da bin ich mal gespannt noch mal kurz abdehnen ok das ist aber schon mal gut zu wissen da brauchen wir jetzt noch options was wir im im web interface eintragen können unter configuration war gespannt was das jetzt anzeigt start tatsächlich eier obviously ist das das password da werde mehr also da hätte ich selbst drauf kommen können dass das das password ist ok ja dann ok dann weiß ich was wir als nächstes machen muss da gehen wir jetzt in die run jamme wir sagen host ist vier champ mqtt server password ist mqtt pw username forst password mqtt server mqtt user und report so dann haben wir das nämlich als environment variable gesetzt oder export davor machen machen wir mal sondern haben wir das nämlich gesetzt und dann sollte der das finden gleich nach dem starten ok das heißt als nicht warum ist das sündungs highlighting hier so kaputt so das heißt als nächstes brauchen wir options für das frontend also hier sowas brauchen wir das da brauchen wir options also wir brauchen ein fiat user ne moment wie heißt das ding fiat user ein fiat password und später noch ein fiat pin damit man sachen freischalten kann standardmäßig sind die dinger leer falls falls man das so machen muss und ich hoffe das ergibt sinn was ich meine ich copy paste ist einfach nur aus denen ihrer aus denen ihre anleitung mal gucken so und wenn das jetzt klappt dann sollte ich im web interface options angezeigt bekommen das sollte oder configuration zumindest gleich was stehen auf upgrade jetzt mal weiß ich was er da immer drei stunden macht config oder da sind wir doch nice da kann man jetzt zeugs eintragen sehr produktive sprints ja wir iterieren im minutentakt und und pushen direkt live so also und wie kriege ich den kram jetzt abgefragt per environment variable wir sind unser eigenes ci cd so und jetzt natürlich die frage mich das per environment variable abgefragt bekomme aha so kriegt man das raus config default lease config also das heißt im endeffekt ich muss jetzt so was machen wie alles sind alles strings fiat fiat user fiat pw und hin so ich denke mal so kann man da auch irgendwie noch eine hilfe zu angeben weil so weiß ja keiner so wirklich was er da reinschreiben soll neue dat neue version er so ein grüber da ist irgendwie fast aber das geht eigentlich nur wenn wir written in rust werden weiß nicht weiß nicht ob wir so basically fast sein können ist das ist das möglich leute kann man plays in den plays in die fast sein auch wenn man nicht in rust written ist oder in go in go vielleicht noch vielleicht noch in go mit wim stimmt stimmt wenn man das ohne wim das geht natürlich gar nicht rust und wim only ap user not found das hat schon mal nicht geklappt das hat schon mal nicht geklappt das so zu exportieren dann dann dann check ich nicht so genau was ich verkehrt mache create main config meint oder ist ok wir müssen uns mal die die hilfe angucken von dem wo ist die config jammel options ist eigentlich ist eigentlich genau richtig ist eigentlich genau richtig man trägt die options ein genauso wie ich das gemacht habe hier kommt mal options ach moment jammel alter ne moment ne das ist kein array das ist key key value also ja prinzipiell schon richtig komm scheiße wir machen back up vorher aber wenn das also wenn jetzt die default werte gleich drin stehen ich sollte das vielleicht mal ausgeben um zu gucken ob es funktioniert ich meine vielleicht habe ich mich hier auch sofort also ich echo ja deswegen heiße ich hier auch nicht so wie auf youtube damit die leute nicht so sehr verwirrt das funktioniert einfach nicht muss das vielleicht kleingeschrieben sein oder muss das problem also ich brauche ich brauche auf jeden fall ein eigenes repo wo das automatisch pull ich drehe jetzt schon durch beim ganzen auf update klicken hier jedes javascript framework ist doch blazing fast javascript framework sind nicht nur blazing fast die tun auch immer so als haben sie irgendwie super krasses neues zeug erfunden wie vorhin dieses framework irgendwie npm install damit ihr git hooks machen kann machen könnt jedes git repo hat standardmäßig fünf bash scripts drinne für für git hooks warum brauche warum muss ich den ersten npm installieren für wie gesagt ohne npm install ist odd ist even geht eh nix funktioniert bei euch da ist 16 download noch nicht ausprobiert dort ist doch funktioniert doch leute api user not found warum nicht guckt mal da der sucht nach es heißt fiat login nicht fiat user mensch wer nennt es auch so doof ersynch ne version hochzählen so jetzt ersynch leute ich drehe durch mit dem versions hochzählen wir müssen das irgendwie anders machen seht jemand jemand eine high iq idee muss die version wirklich hochgezählt werden acht ok das moment fai fai fai fai fai fai fai fai fai fai fai file grab version kann man am punkt fällt drei jaja sieht schonmal sieht schonmal gut Und jetzt hoch zählen, Moment erst noch mal irgen, so und jetzt bash magic, ohje echo, plus eins, fack, Moment wie ging das nochmal, rechnen in bash, so schonmal nett, fack doch ein unix timestamp als version, das ist ja, aber wie war man, wie war bash, in bash rechnen nochmal, also obviously so natürlich, wie sollte es auch anders sein, oh, also Moment, also so, ach du kacke, Moment, so, hey, es funst, so bash magic, so jetzt haben wir 16 und jetzt, Achtung neun, jetzt seht, wie war das sehtechnisch nochmal, so ne, so, in config jamme, ne, ah mein hirn, Moment, ne ne so einfach ist es nicht, jetzt sind 16 und was will ich ersetzen, ich will die gesamte zeile ersetzen, jetzt funktioniert, fast, fast, Punkt, ne, ok, ich gehe davon aus, ich muss es quoteen, dass das funktioniert richtig, Moment, wenn ich das quotee, gehts nicht, bash magic, oh meine güde, no matches found, ah fuck, ok, easy, oh ne, ich hab nix gekillt, Moment, da ist noch ein quote, da, ne, ach du scheiße, bash hör auf, ok, jetzt aber, jawoll, es hat funktioniert, es hat funktioniert, version, doppelpunkt, ein, oh fuck, jetzt aber, version, kann man das hier wenigstens einzeln quoteen, jawoll, version, Punkt, so, ja, ja, ist schonmal gut, 1.0, ja, ja, das sieht auch schonmal gut aus, sehr gut, sehr gut, jetzt hinten noch einmal quotes dran, ah, yes, wunderbar, so, minus i, und guckt mal, und jetzt zählt er automatisch hoch, jedes mal wenn ich minus i mache, excellent bash, logik, guckt hier, guckt da, boom, zählt automatisch hoch, ich mein lesen, kanns keines sau, aber es funktioniert, so und jetzt jedes mal bevor ich in rsync mache, zähle ich die Datei eins hoch, so, easy, bump.sh, alles inline, rest ist alles bloated, so jetzt updaten wir schnell, noch, das sollte eigentlich, ob ich check for updates, ah ja, update, guter code muss auch lesbar sein, das gilt für alles außer bash, und c++, ja gut, das ist ja, ja, es funktioniert, Leute, es funktioniert, es läuft, jetzt muss ich noch die fake Dateien rüber kopieren im build, build action, copy, always, publish, publish, die Weihnachtsnups sind zurück, so und jetzt unser wahnsinnstolles, eigentlich bräuchten wir jetzt ein deploy.sh, wo das reinkommt, check for updates, update, pünktlich bei Version 20, bald überholen wir chrome, Leute, ich würde sagen, nächster Stream wird chrome überholt in den Versionstab an, ach, warte mal, es lief die ganze Zeit, noch, start, put non-fine file, warum nicht, ah, weil ich das nicht mitkopiere, ok, docker recursive, copy recursive, docker, macht es das standardmäßig, das ist, verzeih, ach, anscheinend kopiert er das einfach so, ok, ja, weil dann ist easy, dann kopieren wir dann nämlich einfach build, build nach build und sagen dann plubsh, braucht keiner mehr und sagen dann einfach chmod, minus, ist es klein oder großr, minus großr, siehste, slash build, genau, und im run machen wir dann einfach slash build slash viachamp und dann müsste es glaube ich besser funktionieren, run, zack, kommt homosys dann eigentlich mit pre-release und build, markers in der sem wäre klar, das ist eine gute frage, keine ahnung, ich kann es ausprobieren wenn du willst, sag mir mal was ich markern soll, sowas wie minus test oder irgendwas hinten dranhängen oder minus hash von git commit dranhängen oder was, restart, kann man ausprobieren, be not found, wie, warum not found, ah ich weiß warum not found, weil ich absolut 3 hat bin, ich muss nach build wechseln und dann den viachamp starten, anders funktioniert es natürlich nicht, ok dann hänge ich mal hinten was an die versionsnummer dran, zum ausprobieren, keckel, plus 4, das geht mal wieder weg, äh ne moment, versunken, ui, schauen wir mal ob es das checkt, ja wir updaten jetzt zu 1021 keckel plus 4, oh was, ich hab jetzt noch ein paar probleme damit, oder muss ich erst mal stopp sagen, vielleicht kommt da doch nicht klar damit, weil connection resetted ergibt ja wenig sinn, connection resetted, ne jetzt funktionierts, das kommt damit nicht klar, start, jetzt es läuft, es läuft, leute es funktioniert, es läuft, und sind unsere daten am start, schauen wir mal, settings, integrations, da ist es, und es gab messages um 9.51, jawoll hat funktioniert, so wir können es nochmal, ich kann nochmal gucken ob es wirklich funktioniert, alles, ich lösche das mal, das auto was ich vorher angelegt hab, so und jetzt, gucken wir mal hier mein dashboard mit dem auto, ist auch nix da, irgendwelche gründen ist mein standort noch da, ok, amsterdam, alles klar, alles klar, addon, restart, und dann sollte jetzt gleich, so jetzt sollte gleich hier, guckt, jawoll, addon funktioniert, ja, das funktioniert, jetzt kann man das addon tatsächlich sogar halbwegs schon verwenden, ich meine, man kann eine configuration angeben, man kann passwort und keine pin angeben, gibt es irgendwie die möglichkeit da hilfe dazu einzutragen, wie sieht denn das bei anderen, moment wie sieht denn das bei anderen addons aus, wie sieht es z.b. bei diesem ssh addon aus, so, configuration, ja da steht, guck mal da steht, hilfetext oben drüber, stimmt und wie macht man das mit den passwörtern, na gut, im klartext, wie kann man, wie kann man passwörter, das ist tatsächlich eine gute frage, wie kann man passwörter verstecken, welches addon, welches addon benutzt denn passwörter wo man sich das abgucken kann, ducktns fürs api token vielleicht, aha, alles klar, da können wir abgucken, da können wir abgucken, config.yml, also options, token, und woher weiß der jetzt, dass das, hä? also daran erkenne ich mal gar nichts, vielleicht weil es token heißt, meint ihr, das ist so magic, das ist so magic, das ist anhand des namens, das kann ich, das wäre bescheuert, aber was anderes ist es, was anderes, was anderes ist da nicht, oh Null, das war, ach guck mal hier, da kann man direkt Passwort angeben, ja, maybe it's reserved, I don't know, I don't think it's reserved keyword, it's, we try password, ich glaub nicht, dass das reserved ist, kann ich mir nicht vorstellen, guck mal, wir probieren einfach mal aus, Passwort da reinzuschreiben, so, und pin, der pin ist auf jeden fall auch ein Passwort, so, Achtung, seht magic, seht magic, Version hat hochgezählt, den krempel, den uninstall ich jetzt mal schnell wieder, check for updates, so, hat das jetzt geupdatet, aha, guck mal da, jetzt ist es, so ist das gut, save, restart, so ist das gut, so mag ich das, so, und es funktioniert, das Auto ist da, das Auto steht in Salzgitter, was ist das, nicht, oder nee, Moment, es steht nicht, es steht in, wo steht das Auto, im See, im Stadtparkteich, alles klar, das geht auch wenn man mehr als ein Auto hat, ja, das ist alles dynamisch anhand der Fahrzeug-ID und dem Index von deinem Auto, wobei nee, der Index, dynamisch anhand deiner Fahrzeug-ID, also wenn das zweite Auto erscheint würde dann einfach hier, Moment, Integrations, ja, ja, das Echo kommt noch aus, Integrations, dann würde einfach hier das zweite Auto stehen und wenn du dein Auto bei Fiat ein Nickname gegeben hast, dann steht sogar der richtige Name da, ok, machen wir das hier mal weg, das Debug von diesem ganzen Kramus raus, im Programm, da wo ich Route eingetragen habe, wollte ich eigentlich K eintragen, weil das viel besser passt, so, jetzt müsste das eigentlich, ich pusht das jetzt einfach mal auf GitHub, falls irgendjemand Bock hat daraus zu probieren, wie gesagt, das geht noch nicht alles, also die Commands, die gehen noch ins Leere, wobei ich pusht, ich pusht für den nächsten Stream, ich bin mir nicht ganz sicher, ob ich denn noch irgendwas machen muss, ich müsste ja auch noch ein Addon Repo machen und ne, lass mal ausprobieren, so, was, was, müssen wir noch irgendwas machen für heute, ne, wir haben den Kram, kann ich das Auto auch downloaden, genauso wie Ram, der Karlsson, danke schön für den Sub, ich mein, das kann man, das ist bestimmt nicht der Weisheitsletzter Schluss hier das so zu machen, Max, danke schön für den Sub, aber das ist schon okay so, das ist tatsächlich mal was schönes, schönes Anwendungsbeispiel für Containerkrempel hier, wir müssen übrigens dann das nächste Mal noch gucken, wir brauchen ja Builds für x86, Raspberry Pi, das muss dann quasi anders heißen, also ich muss das dann, ich muss das dann unterschiedlich irgendwie kopieren, mal gucken, wie wir das machen, wie man das unterscheidet, weil wir brauchen ja dann andere Dateien, die kopiert werden, je nach Plattform, okay, Git, Status, das brauchen wir nicht mehr, ja, Commit, A-M, Postchamp, beste, so muss das heißen, das passt alles, ja, dann würde ich sagen, das pushen wir dann das nächste Mal, aber das funktioniert ja schon mal, wir haben hier ein Auto angelegt, wo alles drinne ist, inklusive Buttons, Kilometerstand und sonst was, also da fehlt nicht mal viel, dann kann ich das auf Github pushen und die Leute können sich freuen, dass es dann auch ein Fiat Addon gibt für Home Assistant und das Schöne ist, man muss eigentlich außer seiner ID und dem Pin, also man muss eigentlich nur das hier eintragen, alles andere macht der Autodiscovery, Autodiscovery, hat jemand schon mal Docker Files gebaut, die irgendwie unabhängig von der, abhängig von der Architektur sind, also kann man das im Docker, fragt man das, das habe ich noch nie gemacht, fragt man das im Docker File irgendwie ab, ne ich suche auf jeden Fall nach irgendwas, was in Home Assistant am Ende auch funktioniert, weil Home Assistant bildet das Ding ja anscheinend, ja, das muss ich mir mal überlegen, das machen wir erstmal aus, weil jetzt ist, die Musik passt wunderbar, es ist Bad-Git-Time, nächsten, einen Stream brauchen wir noch dafür würde ich sagen, dann kommt es auf Github und gut ist, hat jemand von euch einen Fiat oder einen Jeep oder irgendwas mit Uconnect, der das mal ausprobieren will, nächstes mal, ich habe hier einen Gitwerk-Workflow von mir, zeigt mal her, aha, ein Yimmelschreiber, Docker Image, aha, aber wie unterscheidest du das im Docker File? Kannst du das im Docker File irgendwie unterscheiden, weil ich muss ja im Docker File je nach Version anderes Zeug kopieren, oder aber, oder aber noch besser, wir machen das.NET Build auch direkt im Docker Container, bei, das ist eigentlich auch blöd, das Binary da drin zu bilden, nee, ich gehe jetzt auf, Dollar Bild Plattform, ja genau, so was brauche ich, ja genau, das brauche ich, Dollar Bild Plattform, das muss ich mir jetzt noch da reinschreiben, weil sonst weiß ich das bis zum nächsten Stream nicht mehr, Dollar Bild Plattform, ja also quasi, ja jetzt muss ich hier gucken, das ist alles okay, so und jetzt muss ich dann quasi hier gucken, nee Dollar Bild Plattform, kann man Bash Style, Bash Style If machen irgendwie, geht so was, geht so was, keine Ahnung, das probiere ich jetzt nicht, das probiere ich jetzt nicht aus, das geht nicht, ah, dann gucken wir uns das das nächste Mal an, hier so weiter machen, ja weil dann kann ich das kopieren, unabhängig, also abhängig davon, weil von der Idee her ich würde dann halt sowas machen, ich würde dann halt sowas machen hier, Bild und dann hier halt das, keine Ahnung, irgendwie das da, Linux, so irgendwie so und dann dahin kopieren, so und dann das andere machen und dann irgendwie sowas wie, ich weiß halt nicht ob das funktioniert, ja irgendwie sowas in der Richtung, da muss ich mal schlau machen wie das funktioniert, keine Ahnung, alles klar, so Leute jetzt aber wirklich Schluss, warum nicht im Container bauen, muss ich da dort nicht im Container installieren, das macht so eine unnötig groß und dann selbst, selbst brauche ich, dann brauche ich ja auch das richtige Argument für das Bild im Container, ich muss ne angeben was ich kompilieren will bei.NET für welche Zielplattform, kannst du das fertige Bild nicht, nee kann ich nicht, weil soweit ich verstanden hab, macht den Bild der Home Assistant oder, oder ist das jetzt nur in meinem Fall so, weil es ein lokales Addon ist und normalerweise zieht das sich das aus irgendeiner Registrie, egal probier es nächstes Mal aus, bis dann machts gut tschüss, tschüss.", "segments": [{"id": 1, "start": 90.0, "end": 107.12, "text": "So Leute, weiter geht's, ich muss mir gerade noch was zu trinken holen."}, {"id": 2, "start": 107.12, "end": 118.84, "text": "Ihr werdet es nicht glauben, ich hab off stream weiter gemacht, sodass es jetzt eigentlich"}, {"id": 3, "start": 118.84, "end": 119.84, "text": "funktioniert."}, {"id": 4, "start": 119.84, "end": 125.06, "text": "Weil ich bin immer so lahm, wenn wir im stream was machen, da brauche ich drei Stunden für"}, {"id": 5, "start": 125.06, "end": 126.06, "text": "zwei Zeilen."}, {"id": 6, "start": 126.06, "end": 129.0, "text": "Ups, warum ist da der Rahmen drum?"}, {"id": 7, "start": 129.0, "end": 135.36, "text": "Deswegen, ich mach mal kurz die ganzen Vms an, dann erzähle ich euch, ich zeige euch"}, {"id": 8, "start": 135.36, "end": 136.36, "text": "einfach, was ich gebaut habe."}, {"id": 9, "start": 136.36, "end": 140.64, "text": "Kann sein, dass wir es noch ein bisschen umbauen müssen, dass ich es jetzt im stream verwenden"}, {"id": 10, "start": 140.64, "end": 142.84, "text": "kann, aber mal gucken."}, {"id": 11, "start": 142.84, "end": 148.4, "text": "Erstmal starten, my home assistant starten und dann gucken wir mal."}, {"id": 12, "start": 148.4, "end": 152.36, "text": "Heute bauen wir ein home assistant addon und pushen es, wir pushen es vielleicht schon"}, {"id": 13, "start": 152.36, "end": 158.64, "text": "auf shithub, falls irgendjemand nen fiat hat oder nen jeep oder irgendwas mit uconnect."}, {"id": 14, "start": 158.64, "end": 162.96, "text": "Könnt ihr es dann theoretisch sogar schon ausprobieren, vorausgesetzt, ich kriege das"}, {"id": 15, "start": 162.96, "end": 167.08, "text": "gebacken, ein home assistant addon zu bauen, das habe ich noch nie gemacht, legit, wirklich."}, {"id": 16, "start": 167.08, "end": 170.68, "text": "Nicht so dieses noch nie und ich hab doch irgendwie mal davor geguckt, hab ich wirklich noch"}, {"id": 17, "start": 170.68, "end": 171.68, "text": "nie gemacht."}, {"id": 18, "start": 171.68, "end": 181.0, "text": "Aber ich hab vorhin mal geschaut, so das Starttutorial sieht easy aus, ja genau, ich hab reingeguckt,"}, {"id": 19, "start": 181.0, "end": 186.8, "text": "das sah relativ easy aus, irgendwie drei Dateien hinlegen und gut ist, mal gucken, wie es wirklich"}, {"id": 20, "start": 186.8, "end": 195.4, "text": "in der Praxis dann aussieht, mal schauen, so, home assistant gestartet, progas vm gestartet,"}, {"id": 21, "start": 195.4, "end": 203.4, "text": "diesen ganzen Krempel muss ich nochmal kurz zumachen, äh, kurz eine Runde Updates und"}, {"id": 22, "start": 203.4, "end": 216.24, "text": "dann nix, wie, gibt nix, keck wait, keine Updates, ah, aber dafür hier jede Menge Updates,"}, {"id": 23, "start": 216.24, "end": 227.32, "text": "geb ihm, Updaten, so, hier haben wir, der Mockchamp, hier haben wir auch noch äh, älteres Zeug"}, {"id": 24, "start": 227.32, "end": 233.04, "text": "auf Exit, gut, dann lassen wir den erstmal updaten und dann machen wir weiter, also"}, {"id": 25, "start": 233.04, "end": 240.44, "text": "ich hab, wie gesagt, ähm, das nochmal ein bisschen umgebaut und ähm, home assistant"}, {"id": 26, "start": 240.44, "end": 244.96, "text": "integration ordentlich reingebaut, also sprich, ich zeig's euch, ich zeig's euch, ich werd's"}, {"id": 27, "start": 244.96, "end": 249.12, "text": "einfach gleich laufen lassen, wir müssen bloß, doch, wir müssen zwei Sachen ändern,"}, {"id": 28, "start": 249.12, "end": 254.4, "text": "dass er sich nicht versucht, wirklich buffiert einzuloggen, weil, wie gesagt, ähm, ich hab"}, {"id": 29, "start": 254.4, "end": 261.2, "text": "nicht vor, mein Account zu leaken hier im Stream, deswegen muss ich das noch umbauen,"}, {"id": 30, "start": 261.2, "end": 264.56, "text": "dass er die Fake-Daten nimmt, anstatt sich direkt einzuloggen, aber dann ist, dann ist"}, {"id": 31, "start": 264.56, "end": 278.32, "text": "okay, ich, deswegen hab ich's auch noch nicht auf GitHub gepusht, ist der einzige Grund,"}, {"id": 32, "start": 278.32, "end": 281.36, "text": "warum ich's noch nicht auf GitHub gepusht hab, weil ich mir nicht sicher war, ob ich"}, {"id": 33, "start": 281.36, "end": 288.4, "text": "nicht im Source-Code irgendwo noch E-Mail oder Passwort oder so stehen hab, da hab ich"}, {"id": 34, "start": 288.4, "end": 294.64, "text": "mir gedacht, so na, guck, guck lieber nochmal bevor das, ups, was jetzt, lul, guck lieber"}, {"id": 35, "start": 294.64, "end": 300.56, "text": "nochmal bevor das pusht, aber da dürfte eigentlich nix mehr drin sein, ich hatte das nur an einer"}, {"id": 36, "start": 300.56, "end": 309.88, "text": "Stelle stehen und das hab ich rausgeschmissen, so, Update ist durch, genau, das sind übrig"}, {"id": 37, "start": 309.88, "end": 314.2, "text": "gebliebenen Sachen vom letztem Mal, äh, wenn wir grad dabei sind, ist was für Reap, was"}, {"id": 38, "start": 314.2, "end": 323.08, "text": "ich jetzt eigentlich nicht mehr, ich reboot immer, macht nix."}, {"id": 39, "start": 323.08, "end": 326.76, "text": "Gibt's da eigentlich keine automatischen Checks beim Puschen?"}, {"id": 40, "start": 326.76, "end": 333.0, "text": "Also, du hast so eine, du hast diese Anzeige, aus was deine Repo besteht, also wenn du ausversehen"}, {"id": 41, "start": 333.0, "end": 339.0, "text": "irgendwelche SSL-Keys oder so pusht, dann siehst du's in der Code Übersicht, aber"}, {"id": 42, "start": 339.0, "end": 346.76, "text": "ich glaube, irgendwelche Analysetools standardmäßig gibt's nicht, du kannst natürlich selbst"}, {"id": 43, "start": 346.76, "end": 351.34, "text": "was machen, ja, du kannst bei nem Push irgendeinen Job laufen lassen, der guckt, aber da musst"}, {"id": 44, "start": 351.34, "end": 355.2, "text": "du halt erstmal puschen, das ist ja auch eine Sache, die find ich persönlich an GitHub"}, {"id": 45, "start": 355.2, "end": 360.0, "text": "ein bisschen doof, im Vergleich zu nem selbst gehausten Repo, du kannst auf GitHub keine"}, {"id": 46, "start": 360.0, "end": 365.92, "text": "ordentlichen Git-Hooks verwenden, das klappt nicht, das einzige was du machen kannst ist,"}, {"id": 47, "start": 365.92, "end": 375.0, "text": "irgendwelche, irgendwelche Web-Hooks kannst du verwenden, du kannst aber keine klassischen"}, {"id": 48, "start": 375.0, "end": 379.4, "text": "Git-Hooks verwenden, dass du quasi pushen, ablehnen kannst oder sowas, du kannst zwar"}, {"id": 49, "start": 379.4, "end": 383.52, "text": "die offiziellen Pre-Receive-Hooks nehmen, also quasi Branch-Protection oder sowas, aber"}, {"id": 50, "start": 383.52, "end": 388.04, "text": "wenn du sagst, hey, ich möchte eine spezielle, ich möchte einmal scannen nach Passwörtern"}, {"id": 51, "start": 388.04, "end": 394.2, "text": "bevor ich pushe, dann geht das nicht, zumindest nicht in nem Git-Hook, weil du kannst auf"}, {"id": 52, "start": 394.2, "end": 398.76, "text": "GitHub keine Pushs ablehnen, du kannst nur nach einem Push was auslösen, also du könntest"}, {"id": 53, "start": 398.76, "end": 404.64, "text": "checken, ob das okay ist und dann, nachdem du gepusht hast, könntest du dann irgendeine"}, {"id": 54, "start": 404.64, "end": 408.84, "text": "Meldung dir schicken, so Achtung, da ist ein Passwort drin, ja, du kannst natürlich auch"}, {"id": 55, "start": 408.84, "end": 416.48, "text": "einen lokalen Commit-Hook machen, aber ich fand das bei, mit nem lokalen Git-Repo, beziehungsweise"}, {"id": 56, "start": 416.48, "end": 421.52, "text": "lokal, irgendein Repo, was auf nem Server liegt, ganz praktisch, da konntest du Pre-Receive-Hooks"}, {"id": 57, "start": 421.52, "end": 427.96, "text": "machen, dass du manche Sachen ablehnen konntest beim Git-Push. So, Reboot ist immer gut,"}, {"id": 58, "start": 427.96, "end": 434.96, "text": "genau. Oh, was haben wir denn da heute im Hintergrund? Wie gesagt, Bing Image of the Day. Sowas?"}, {"id": 59, "start": 434.96, "end": 448.16, "text": "Weiß ich nicht. Das kommt drauf an, wie die das machen. Das musst du dir auch irgendwo"}, {"id": 60, "start": 448.16, "end": 453.6, "text": "laufen lassen und irgendwo muss es getriggert werden. Das kenn ich nicht, keine Ahnung."}, {"id": 61, "start": 453.6, "end": 476.92, "text": "Sagt mir nix, ist aber sehr beliebt anscheinend. Äh, ich, also... Warum sollte ich ein extra"}, {"id": 62, "start": 476.92, "end": 484.76, "text": "Package hinzufügen, um ein Commit-Hook laufen lassen zu können? In jedem Git, das versteh"}, {"id": 63, "start": 484.76, "end": 489.76, "text": "ich wieder mal nicht, das ist so ein JavaScript-Git für uns wieder. Du kannst in jedem Git-Repo"}, {"id": 64, "start": 489.76, "end": 494.96, "text": "Punkt Git Hooks, Pre-Receive und Commit, da kannst du einfach was reinschreiben, das"}, {"id": 65, "start": 494.96, "end": 499.26, "text": "ist schon da. Also warum man das braucht, erschließt sich mir jetzt ehrlich gesagt"}, {"id": 66, "start": 499.26, "end": 509.28, "text": "gerade nicht. Noch nix, ich hab grad meine VM Rebooted. So, da sind wir. Mal hier Konsole"}, {"id": 67, "start": 509.28, "end": 520.68, "text": "starten. Das schöne an Git Hooks ist, das kommt gar nicht auf meine Code Pays an. Die"}, {"id": 68, "start": 520.68, "end": 530.04, "text": "sind einfach da. Guck mal hier. Achtung, Achtung. Machst du ein Hacks Addon? Ja, mach ich, wenn"}, {"id": 69, "start": 530.04, "end": 543.2, "text": "ich checke wie es funktioniert. Gut, Git Hooks. Und guck mal da. Leute. Ganz ohne NPM Install"}, {"id": 70, "start": 543.2, "end": 549.44, "text": "sind da einfach schon irgendwelche Git Hooks da. Wie ist das überhaupt möglich ohne NPM"}, {"id": 71, "start": 549.44, "end": 554.28, "text": "Install, dass da überhaupt irgendwas läuft ohne NPM Install? Ich dachte ohne NPM Install"}, {"id": 72, "start": 554.28, "end": 559.84, "text": "ist eigentlich prinzipiell überhaupt nichts möglich. Ich mein ohne NPM Install kann man"}, {"id": 73, "start": 559.84, "end": 566.48, "text": "noch nicht mal feststellen, ob eine Zahl gerade oder ungerade ist, hab ich gehört. Weiß nicht,"}, {"id": 74, "start": 566.48, "end": 571.44, "text": "wie es euch geht, Chat. Chat, könnt ihr das feststellen ohne NPM? Also bei mir hört's"}, {"id": 75, "start": 571.44, "end": 586.56, "text": "da auf. Ich brauch der NPM dazu. Oder Alternative PIP, oder GEM, oder Nugget, oder... Was gibt's"}, {"id": 76, "start": 586.56, "end": 595.04, "text": "denn da noch so alle? Ja, siehste, ohne zwei Gigabyte Module geht da natürlich nix, da"}, {"id": 77, "start": 595.04, "end": 601.4, "text": "habt ihr recht. Das ist das JavaScript Mindset, so mag ich euch, Chat. Exzellent. Halt die"}, {"id": 78, "start": 601.4, "end": 609.28, "text": "HiIQ wieder angesagt. Ohne zwei Gigabyte Abhängigkeiten ist das nicht möglich, das ist... So ist"}, {"id": 79, "start": 609.28, "end": 613.68, "text": "es. So sieht's aus. Und jeder der was anderes behauptet hat, einfach keine Ahnung. Alles"}, {"id": 80, "start": 613.68, "end": 627.48, "text": "Kacknubs. Äh, das ist der Package Manager für.NET. Allerdings nur mit nur einem G."}, {"id": 81, "start": 627.48, "end": 643.16, "text": "Ich mein, eigentlich heißt es Nugget, aber ich sag immer Nugget. User32DLL. Das ist"}, {"id": 82, "start": 643.16, "end": 649.16, "text": "sehr Windows-Style, der Name. Aber danke schön für den Sub. Massive Subscription hier, drei"}, {"id": 83, "start": 649.16, "end": 660.48, "text": "Monate, huge. So, also ich check mal kurz mein lokales Repo aus. Ah ne, das gibt's schon."}, {"id": 84, "start": 660.48, "end": 668.92, "text": "Ähm, da muss ich mal kurz den Fiat-Champ ummoven. Leute, morgen wird's auf der Arbeit"}, {"id": 85, "start": 668.92, "end": 673.76, "text": "lustig, ich krieg morgen ein neues Notebook. Ein Surface Book. Und wisst ihr was das erste"}, {"id": 86, "start": 673.76, "end": 679.4, "text": "ist, was ich mache auf dem Surface Book? Der Chat gibt, ihr wisst das, ihr wisst das, geht"}, {"id": 87, "start": 679.4, "end": 684.44, "text": "mal in euch. Was ist das erste was ich mache? Na, Linux ist klar. Welches Linux? Welches"}, {"id": 88, "start": 684.44, "end": 699.6, "text": "Linux? Archlinux, korrekt. Das erste was ich mache, ich hab extra schon USB-Stick eingepackt,"}, {"id": 89, "start": 699.6, "end": 703.92, "text": "das erste was ich machen werde ist ein Archlinux draufknallen. Da bin ich mal gespannt wie"}, {"id": 90, "start": 703.92, "end": 716.28, "text": "gut das auf dem Surface Hub läuft. So Leute, ich muss mal kurz mein lokales Repo klonen."}, {"id": 91, "start": 716.28, "end": 730.12, "text": "HTTPS, SSH, hier. Achtung, mkdir, Fiat-Champ, wobei ich glaub es geht auch so. Geht klonen,"}, {"id": 92, "start": 730.12, "end": 736.56, "text": "da sind wir. Oh ne, Moment, ich hab das Fiat-Client genannt. Alter, was ist denn mit mir los?"}, {"id": 93, "start": 736.56, "end": 748.72, "text": "Weird-Champing. Das Repo heißt komplett falsch. Wie kann man das nur so kaputt nennen? Ne,"}, {"id": 94, "start": 748.72, "end": 756.4, "text": "so gehts ja, so gehts ja nicht. Gut, so ich werde das mal öffnen und dann zeige ich euch"}, {"id": 95, "start": 756.4, "end": 761.92, "text": "was ich gemacht hab. Und zeige euch auch die Home Assistant-Integration, wie gut das jetzt"}, {"id": 96, "start": 761.92, "end": 766.76, "text": "alles schon funktioniert, ohne dass wir uns hier schleppend im Stream dadurch durchkämpfen"}, {"id": 97, "start": 766.76, "end": 785.48, "text": "müssen. Also. Ja ja, ich truste meinem eigenen Repo. So, ich muss mal ganz kurz ins Main gucken"}, {"id": 98, "start": 785.48, "end": 796.08, "text": "ob das die richtige Version ohne Passwörter ist. Ja, ist es. Okay, also, auf gehts. Ach,"}, {"id": 99, "start": 796.08, "end": 800.72, "text": "da heißt es Fiat-Champ. Ich konnte mich auch nicht entscheiden, oder? Das Repo heißt Fiat-Client"}, {"id": 100, "start": 800.72, "end": 805.32, "text": "und das hier heißt Fiat-Champ. Na gut, also im Prinzip ist es mehr oder weniger das gleiche"}, {"id": 101, "start": 805.32, "end": 811.52, "text": "was wir gebaut haben zusammen im Stream. Nur, Alter, hab ich hier immer so eine große Schrift,"}, {"id": 102, "start": 811.52, "end": 816.24, "text": "oder? Ich hab doch nicht immer so eine fette Schrift hier im Stream, oder? Bin ich, bin"}, {"id": 103, "start": 816.24, "end": 822.56, "text": "ich, bin ich, bin ich? Ist das wirklich so, ist das immer so fett? Ich dachte eher ich"}, {"id": 104, "start": 822.56, "end": 830.72, "text": "hab sowas hier. Und das ist ja mega fett. Echt? Da erkennst du ja gar nichts. Aber es"}, {"id": 105, "start": 830.72, "end": 840.36, "text": "ist für euch besser, ne? Da erkennt ihr mehr. Naja, dann ist man, dann ist man auch gar"}, {"id": 106, "start": 840.36, "end": 844.44, "text": "nicht geneigt mehr als 120 Zeichen zu machen, weil mehr als 120 Zeichen passen dann gar"}, {"id": 107, "start": 844.44, "end": 849.28, "text": "nicht, ne, mehr als 108 Zeichen, weil mehr passen dann ja auch gar nicht auf den Bildschirm."}, {"id": 108, "start": 849.28, "end": 855.12, "text": "Also, was wir heute machen ist folgendes. Also, ich fang nochmal anders an. Für alle,"}, {"id": 109, "start": 855.12, "end": 861.0, "text": "die nicht dabei waren, ich hab mir ein Fiat Elektroauto gekauft und hab festgestellt,"}, {"id": 110, "start": 861.0, "end": 866.68, "text": "ich bekomme die ganzen Daten nicht in meine Heimautomatisierung. Da so Sachen wie zum"}, {"id": 111, "start": 866.68, "end": 871.28, "text": "Beispiel Ladestatus, wie viel Prozent hat die Batterie, wieviel kann ich damit noch"}, {"id": 112, "start": 871.28, "end": 879.76, "text": "fahren, Reifendruck, aktueller Kilometerzähler, wieviel bin ich heute gefahren und solche"}, {"id": 113, "start": 879.76, "end": 886.32, "text": "Geschichten bekomme ich nicht in Home Assistant. Deswegen, das kannst du als Clip machen,"}, {"id": 114, "start": 886.32, "end": 891.04, "text": "ja, dann kannst du gleich Clip machen. Also, deswegen haben wir da was gebastelt, was"}, {"id": 115, "start": 891.04, "end": 898.24, "text": "die fiat api, sag mal so die inoffizielle fiat api anzapft. Muss ich nochmal abdecken"}, {"id": 116, "start": 898.24, "end": 907.92, "text": "hier? Alter, Home Assistant, ja, dann installier halt schnell. Also, was die fiat api anzapft"}, {"id": 117, "start": 907.92, "end": 911.76, "text": "und die Sachen in Home Assistant pumpt, das funktioniert schon ganz gut. Wo wir das letzte"}, {"id": 118, "start": 911.76, "end": 916.44, "text": "Mal stehen geblieben sind ist und was ich jetzt Offstream fertig gemacht hab ist, man kann"}, {"id": 119, "start": 916.44, "end": 925.4, "text": "nicht nur Sensoren in Home Assistant reinpumpen, sondern man kann auch Commands. Max, ja, ich"}, {"id": 120, "start": 925.4, "end": 928.92, "text": "hab noch gar nicht angefangen, das ist das, was ich das letzte Mal gemacht hab. So, und"}, {"id": 121, "start": 928.92, "end": 942.16, "text": "jetzt bin ich, jetzt bin ich, jetzt weiß ich nicht, was ich sagen wollte. Ähm, erstmal"}, {"id": 122, "start": 942.16, "end": 947.48, "text": "Home Assistant updaten, dann gehts weiter. Ja, also genau, jetzt weiß ich wieder. Wir"}, {"id": 123, "start": 947.48, "end": 951.44, "text": "sind stehen geblieben, dass wir nur Sachen in Home Assistant reinpumpen konnten, wir"}, {"id": 124, "start": 951.44, "end": 955.2, "text": "konnten keine Kommandos ausführen. Das hab ich jetzt auch gebaut, wir können jetzt"}, {"id": 125, "start": 955.2, "end": 959.28, "text": "Kommandos ausführen. Ich, wie gesagt, ich werd euch, ich werd's euch gleich zeigen."}, {"id": 126, "start": 959.28, "end": 967.2, "text": "Wir können jetzt nämlich sowohl die, ah, das muss ich wahrscheinlich dann auch ändern,"}, {"id": 127, "start": 967.2, "end": 979.24, "text": "wir können die, den Standort des Autos abfragen und wir können diese Fiat Befehle, die, die"}, {"id": 128, "start": 979.24, "end": 984.12, "text": "ich aus diesem iOpRocker Addon mir abgeguckt hab, können wir auch direkt an Home Assistant"}, {"id": 129, "start": 984.12, "end": 987.68, "text": "sticken. Also wir können jetzt zum Beispiel dann, über Home Assistant hat man dann nen"}, {"id": 130, "start": 987.68, "end": 993.48, "text": "Schalter, da kann man dann den Kofferraum anlocken oder locken oder die Lichter blinken"}, {"id": 131, "start": 993.48, "end": 999.04, "text": "lassen oder, äh, die Klimaanlage an- und ausschalten und sowas. Das ist tatsächlich"}, {"id": 132, "start": 999.04, "end": 1004.76, "text": "ganz praktisch, weil sonst geht ja die Hälfte der Funktion, die die App hat nicht und ich"}, {"id": 133, "start": 1004.76, "end": 1008.0, "text": "will ja, dass ich mehr oder weniger alles kann wie die App und eigentlich nur besser."}, {"id": 134, "start": 1008.0, "end": 1017.36, "text": "So, da sind wir. So, also da haben wir das letzte Mal aufgehört. Ich glaube, ich muss"}, {"id": 135, "start": 1017.36, "end": 1023.96, "text": "euch jetzt nicht das alles im Detail zeigen, aber nur mal so ganz grob. Ich beleg grad,"}, {"id": 136, "start": 1023.96, "end": 1029.4, "text": "wie wir das machen. Wie kann ich das jetzt ausführen? Was ist der TÜV da? Nix. Was"}, {"id": 137, "start": 1029.4, "end": 1034.4, "text": "soll das? Ist doch dem TÜV egal. Das ist immer so ein, das, das hör ich bei total"}, {"id": 138, "start": 1034.4, "end": 1038.12, "text": "vielen Sachen. Was wohl, was soll denn der TÜV davon halten? Das ist, das geht dem"}, {"id": 139, "start": 1038.12, "end": 1043.52, "text": "TÜV am Arsch vorbei, ob ich über ein Webinterface irgendwelche Datenauslese, die eh schon da"}, {"id": 140, "start": 1043.52, "end": 1049.48, "text": "sind. Was soll das? Das juckt den TÜV doch immer absolut gar nicht. Das ist höchstens"}, {"id": 141, "start": 1049.48, "end": 1056.36, "text": "für mich gut, dass ich weiß, wann ich wieder zur nächsten Wartung fahren muss. Ja, weil"}, {"id": 142, "start": 1056.36, "end": 1062.32, "text": "zum Beispiel, ich sehe hier Kilometer bis zur Wartung. Ja gut, das ist Fake, Fake-Response,"}, {"id": 143, "start": 1062.32, "end": 1067.92, "text": "aber ja. Nee, das ist dem TÜV vollkommen egal. So, wir tragen da jetzt mal ein paar Fake-Werte"}, {"id": 144, "start": 1067.92, "end": 1072.0, "text": "ein. Ach so, Remote blinken lassen. Nö, das ist dem TÜV auch egal. Das kannst du"}, {"id": 145, "start": 1072.0, "end": 1076.24, "text": "über die App ja auch machen. Nur weil du das über die Home Assistant machst, dann"}, {"id": 146, "start": 1076.24, "end": 1080.48, "text": "statt der App ist das dem TÜV, wenn man davon abkommt, der TÜV kriegt das gar nicht"}, {"id": 147, "start": 1080.48, "end": 1093.88, "text": "mit. Und selbst wenn er es mitkriegt, wäre es ihm egal. Genau, ja. So, also Leute, wir"}, {"id": 148, "start": 1093.88, "end": 1101.68, "text": "müssen mal, was ist denn, was hat denn Deutschland für Länge und Breitengrad so? Hier, Salzgitter,"}, {"id": 149, "start": 1101.68, "end": 1111.52, "text": "da, da muss schon immer mal mein Auto stehen. Salzgitter, Leute. Das ist mein Auto jetzt."}, {"id": 150, "start": 1111.52, "end": 1118.32, "text": "Salzgitter. Auto hupen lassen, während es beim TÜV steht. Man kann nicht hupen lassen,"}, {"id": 151, "start": 1118.32, "end": 1124.36, "text": "das wäre natürlich mega, wenn das geht. Man kann das Auto nur die Lichthupe machen."}, {"id": 152, "start": 1124.36, "end": 1129.36, "text": "Man kann Lichthupe machen und das ist dafür da, dass man sein Auto wieder findet, wenn"}, {"id": 153, "start": 1129.36, "end": 1132.36, "text": "man beispielsweise irgendwie im Dunklen über den Parkplatz läuft. Das ist eigentlich eine"}, {"id": 154, "start": 1132.36, "end": 1140.28, "text": "ganz gute Idee. Aber hupen lassen geht nicht. Ja, beim Tesla geht technisch an sich eh schon"}, {"id": 155, "start": 1140.28, "end": 1146.44, "text": "einiges mehr. Die zeichnen ja auch beispielsweise exakte Verläufe der Fahrten auf und so was."}, {"id": 156, "start": 1146.44, "end": 1150.92, "text": "Das macht der Fiat auch nicht. Der Fiat zeichnet die Kilometer auf und der übermittelt ab"}, {"id": 157, "start": 1150.92, "end": 1158.36, "text": "und zu mal so alle Viertelstunde, alle 10 Minuten Viertelstunde die GPS Position. Also"}, {"id": 158, "start": 1158.36, "end": 1167.72, "text": "sprich, das ist, naja, also wirklich Bewegungsprofil, ein gutes. Kannst du da dran nicht erstellen."}, {"id": 159, "start": 1167.72, "end": 1172.88, "text": "Aber ist egal. Ich zeige euch jetzt erstmal im Home Assistant, wie das Ganze dann ausschaut."}, {"id": 160, "start": 1172.88, "end": 1182.52, "text": "Damit das funktioniert, ich mir gerade überlegen. Ich habe das nämlich schon angepasst, dass"}, {"id": 161, "start": 1182.52, "end": 1186.52, "text": "man das über Environment Variablen reinkriegt. Dann testen wir doch gerade mal, ob es mit"}, {"id": 162, "start": 1186.52, "end": 1194.88, "text": "Environment Variablen alles funktioniert. Probieren das doch gerade mal aus. Epo, Fiat,"}, {"id": 163, "start": 1194.88, "end": 1200.2, "text": "Client. Testen wir noch mal gerade. Also, weil wir können ja, wenn wir das im Container"}, {"id": 164, "start": 1200.2, "end": 1205.12, "text": "laufen lassen, müssen wir die Daten von Home Assistant über Environment Variablen da reinpacken."}, {"id": 165, "start": 1205.12, "end": 1212.32, "text": "Deswegen simuliere ich das jetzt einfach gerade mal. Also Fiat Login. Gut, Fiat Login werden"}, {"id": 166, "start": 1212.32, "end": 1216.84, "text": "wir nicht brauchen, weil wir Fake-Responses verwenden, weil ich mein Passwort nicht liegen"}, {"id": 167, "start": 1216.84, "end": 1229.12, "text": "will. CAC, Fiat, PW, CAC, MQTT Server, das brauchen wir. Das ist nicht CAC, sondern das"}, {"id": 168, "start": 1229.12, "end": 1243.52, "text": "da. MQTT User. Weiß ich schon gar nicht mehr. Sub. Ach, MQTT 123456. Ne, da hätte ich ja"}, {"id": 169, "start": 1243.52, "end": 1251.64, "text": "auch selbst drauf kommen können. MQTT User, MQTT PW ist 123456. Was brauchen wir sonst"}, {"id": 170, "start": 1251.64, "end": 1257.12, "text": "noch? Port. Port brauchen wir nicht. Ok, also ich lasse es jetzt mal laufen und dann werden"}, {"id": 171, "start": 1257.12, "end": 1266.08, "text": "wir gleich sehen, es crasht. Es ist logisch, dass es crasht, weil naja, CAC und CAC ist"}, {"id": 172, "start": 1266.08, "end": 1274.6, "text": "kein gültiges Fiat Login. Mal gucken, was passiert. Na ja, ganz... Ja, guck hier, verbinden."}, {"id": 173, "start": 1274.6, "end": 1286.6, "text": "Invalid Login ID. Hunst nicht. Kaputt. Invalid Login ID. Invalid Login ID or Passwort. Ja,"}, {"id": 174, "start": 1286.6, "end": 1306.08, "text": "das hätte man sich aber eigentlich denken können. Ja, das hätte man sich denken können,"}, {"id": 175, "start": 1306.08, "end": 1310.72, "text": "weil CAC und CAC ist kein gültiges Fiat Login. Deswegen kommentiere ich jetzt, dass wir das"}, {"id": 176, "start": 1310.72, "end": 1314.56, "text": "ordentliche testen können offline. Deswegen kommentiere ich jetzt einfach mal das Login"}, {"id": 177, "start": 1314.56, "end": 1321.92, "text": "aus, dass er sich versucht einzuloggen und beim Fahrzeug Fetchen rufen wir einfach Fake"}, {"id": 178, "start": 1321.92, "end": 1326.6, "text": "Daten ab und gut ist, die Fake Daten kopieren wir uns mal kurz aus diesem anderen, was ich"}, {"id": 179, "start": 1326.6, "end": 1341.64, "text": "hier hatte vom letzten Mal. Hier. Fake. Fake. Könnte bei Gelegenheit... Habe ich das in"}, {"id": 180, "start": 1341.64, "end": 1362.08, "text": "dem anderen nicht schon gemacht vom letzten Mal? Ja. Ja. Oh, Vim. No. Set. Nee. Set."}, {"id": 181, "start": 1362.08, "end": 1373.26, "text": "Set number aus. Alter Vim Logik, du kannst... Manchmal ist es Set No, No Set, Set irgendetwas"}, {"id": 182, "start": 1373.26, "end": 1381.16, "text": "gleich Null, das hat alles keinerlei System wie man das macht. Entweder man merkt sich"}, {"id": 183, "start": 1381.16, "end": 1396.72, "text": "oder man hat verloren ok zack zack so wir returnen mal für eine fake fake response dass ich mein"}, {"id": 184, "start": 1396.72, "end": 1404.88, "text": "home assistant befüllt krieg und dass ich euch den rechts den rest zeigen kann sehr schön ist"}, {"id": 185, "start": 1404.88, "end": 1409.32, "text": "wim zu schwer bist du zu schwach leute wim ist einfach total inkonsistent an vielen stellen"}, {"id": 186, "start": 1409.32, "end": 1418.24, "text": "dafür ist wim was das editieren angeht mega poc weil wenn man sich einmal gemerkt hat was"}, {"id": 187, "start": 1418.24, "end": 1424.88, "text": "da so geht mit mit editieren und change change inner quotes und solche sachen dann ist das wirklich"}, {"id": 188, "start": 1424.88, "end": 1435.36, "text": "mega nice leider dauert es ein bisschen ok auf geht's wir exportieren das ganze mal schauen"}, {"id": 189, "start": 1435.36, "end": 1443.12, "text": "ob das funktioniert jetzt wir sollten jetzt im home assistant ein eintrag bekommen der sich"}, {"id": 190, "start": 1443.12, "end": 1464.32, "text": "kartu nennt integrations mqtt oder pock pock k hatten wir das letzte mal pock k genau das"}, {"id": 191, "start": 1464.32, "end": 1473.52, "text": "sollten wir jetzt wieder bekommen mit allen möglichen infos aber jetzt mit switches und allem ich"}, {"id": 192, "start": 1473.52, "end": 1484.6, "text": "hoffe es funktioniert jetzt aber da ist es pock k ha ha da haben wir alles"}, {"id": 193, "start": 1484.6, "end": 1499.84, "text": "mein fiat login war gerade zu sehen wo ach hier ne das ist fake"}, {"id": 194, "start": 1499.84, "end": 1511.16, "text": "das da ne das ist fake das macht nichts das ist das ist fake das gibt's nicht meinst das"}, {"id": 195, "start": 1511.16, "end": 1517.8, "text": "hier ne ne ne ne ne das ist nix nix bildes das ist fake adresse mit fake password das"}, {"id": 196, "start": 1517.8, "end": 1523.08, "text": "habe ich extra für ein stream angelegt weil eigentlich ist login ist da nicht mehr drinne"}, {"id": 197, "start": 1523.08, "end": 1528.56, "text": "zu also mein mein richtiges mein richtig ja ist gut dass du sagst ja chat six hat heim"}, {"id": 198, "start": 1528.56, "end": 1532.04, "text": "wieder gut dass du sagst denn das hatte ich fake mäßig für ein stream angelegt mein"}, {"id": 199, "start": 1532.04, "end": 1539.28, "text": "richtiges login ist nicht drinne so also hier ist das auto wieder nur mit dem unterschied"}, {"id": 200, "start": 1539.28, "end": 1549.12, "text": "guckt mal ich habe es umbenannt ist natürlich auch sehr sehr clever gewesen von mir das"}, {"id": 201, "start": 1549.12, "end": 1553.2, "text": "dass das umzubringen wisst ihr was ich benenne es jetzt testweise wieder zurück weil ich"}, {"id": 202, "start": 1553.2, "end": 1559.88, "text": "keinen bock habe im web interface das zurück zu wir löschen es noch mal und fühlen es"}, {"id": 203, "start": 1559.88, "end": 1575.2, "text": "noch mal aus root habe ich das letzte mal genannt ja siehst du so einfach kann man"}, {"id": 204, "start": 1575.2, "end": 1583.24, "text": "zum neuen fiat kommen so da sind wir jetzt passt auch wieder so guck jetzt ist das dashboard"}, {"id": 205, "start": 1583.24, "end": 1589.92, "text": "auch wieder befüllt also ladung 8 90 prozent 45 kilometer gefahren bla bla bla blub es gibt"}, {"id": 206, "start": 1589.92, "end": 1593.92, "text": "jetzt ein paar neue sachen was ich gemacht habe während ihr nicht da wart nämlich zum"}, {"id": 207, "start": 1593.92, "end": 1601.56, "text": "beispiel bekommt man jetzt die location von dem auto die ist nämlich da guckt also die"}, {"id": 208, "start": 1601.56, "end": 1605.92, "text": "location das ist fake location jetzt die ich für ein stream eingetragen habe jetzt hat"}, {"id": 209, "start": 1605.92, "end": 1610.04, "text": "man nämlich auch die location das heißt man kann jetzt zum beispiel auch sowas hier machen"}, {"id": 210, "start": 1610.04, "end": 1622.96, "text": "dass man eine map einbindet und sagt dann car location und dann sieht man in städt steht"}, {"id": 211, "start": 1622.96, "end": 1649.0, "text": "angeblich mein auto ok standort aus to show 48 default zoom das ist natürlich cool angeblich"}, {"id": 212, "start": 1649.0, "end": 1654.04, "text": "cup das ist natürlich sehr praktisch jetzt kann man auch gleich sehen wo das auto ist"}, {"id": 213, "start": 1654.04, "end": 1666.36, "text": "ich überlege gerade habe ich habe ich sonst noch irgendwas bei mir lokal geändert ach"}, {"id": 214, "start": 1666.36, "end": 1669.92, "text": "so ja natürlich jetzt kann man nämlich auch die buttons hier hinzuführen guckt mal jetzt"}, {"id": 215, "start": 1669.92, "end": 1676.68, "text": "kann ich nämlich sagen hier zum beispiel wir machen ein grit mit einem oder nehmen wir"}, {"id": 216, "start": 1676.68, "end": 1687.8, "text": "machen kein grit cancel und so eine entity liste und sagen dann hier zum beispiel k nicht"}, {"id": 217, "start": 1687.8, "end": 1710.96, "text": "location sensor klimaanlage auto klimaanlage an und aus kann man machen oder was habe ich"}, {"id": 218, "start": 1710.96, "end": 1721.48, "text": "sonst noch hier drin blink zum beispiel kofferraum kofferraum kann man auch kofferraum kann man"}, {"id": 219, "start": 1721.48, "end": 1736.24, "text": "auch machen kofferraum schreibt man das so mit 2f und 2r täglich deutsch truck genau"}, {"id": 220, "start": 1736.24, "end": 1747.24, "text": "dass die datenbank muss dahin für kofferraum ja jetzt kann man den kofferraum auf und zu"}, {"id": 221, "start": 1747.24, "end": 1756.88, "text": "machen klimaanlage an und ausschalten oder auch zum beispiel blinken lassen aber das"}, {"id": 222, "start": 1756.88, "end": 1781.36, "text": "mal blink haben wir hier ein light icon lights oder so"}, {"id": 223, "start": 1781.36, "end": 1784.32, "text": "zumindest kann man jetzt auch kommandos an sein auto schicken das ist das worauf ich"}, {"id": 224, "start": 1784.32, "end": 1790.12, "text": "raus will also kann man zum beispiel sagen kofferraum klimaanlage an aus und kofferraum"}, {"id": 225, "start": 1790.12, "end": 1794.4, "text": "auf und zu und solche geschichten allerdings muss man halt sagen das ist asynchron das"}, {"id": 226, "start": 1794.4, "end": 1802.72, "text": "geht über die fiat api das dauert ein bisschen also sprich selbst wenn ich jetzt die klimaanlage"}, {"id": 227, "start": 1802.72, "end": 1815.64, "text": "einschalte dann dauert das bestimmt 20 sekunden bis es angeht"}, {"id": 228, "start": 1815.64, "end": 1819.68, "text": "das ist das ist langsam und kofferraum öffnen dauert bestimmt auch 20 sekunden aber gut"}, {"id": 229, "start": 1819.68, "end": 1823.72, "text": "da kann es nichts machen deswegen stelle ich den status auch sofort auf ok nicht dass die"}, {"id": 230, "start": 1823.72, "end": 1831.68, "text": "leute hier anfangen so dumm rumzuklicken genau ja also so sieht die aktuelle home assistant"}, {"id": 231, "start": 1831.68, "end": 1838.28, "text": "integration aus ich denke mal das ist richtig nice kofferraum geht auf nachdem man losgefahren"}, {"id": 232, "start": 1838.28, "end": 1844.88, "text": "ist das weiß ich nicht das habe ich nicht ausprobiert ob man beispielsweise wenn jemand"}, {"id": 233, "start": 1844.88, "end": 1851.4, "text": "drinne ist und das auto angeschaltet hat wirklich sagen kann kofferraum entriegeln und ob das"}, {"id": 234, "start": 1851.4, "end": 1857.76, "text": "dann auch geht keine ahnung wobei naja gut wenn du fährst geht ja keiner hinten und"}, {"id": 235, "start": 1857.76, "end": 1861.68, "text": "macht auf aber das weiß ich nicht ob die dann einen schutz drin haben oder nicht wenn"}, {"id": 236, "start": 1861.68, "end": 1866.92, "text": "es klickt bis selbst dran schuld das schreibe ich auch in die app rein ich übernehme keine"}, {"id": 237, "start": 1866.92, "end": 1871.64, "text": "garantie für irgendwas so und jetzt müssen wir daraus den home assistant addon bauen"}, {"id": 238, "start": 1871.64, "end": 1875.88, "text": "die sache ist nämlich die schön und gut wenn ich das hier bei mir laufen lassen kann und"}, {"id": 239, "start": 1875.88, "end": 1881.32, "text": "über mqtt in home assistant sachen exportieren man will ja dass das ganze automatisch funktioniert"}, {"id": 240, "start": 1881.32, "end": 1885.48, "text": "und ich kann ja auch keinem zumuten irgendwie den source code runterzuladen da was drinne"}, {"id": 241, "start": 1885.48, "end": 1890.12, "text": "einzutragen dann selbst zu kompilieren oder sowas das ist ja natürlich bescheuert deswegen"}, {"id": 242, "start": 1890.12, "end": 1896.52, "text": "versuche ich da draus jetzt mal ein home assistant addon zu bauen das habe ich legit noch nie"}, {"id": 243, "start": 1896.52, "end": 1903.16, "text": "gemacht home assistant addon tutorial aber ich habe vorhin mal in das tutorial reingeguckt das"}, {"id": 244, "start": 1903.16, "end": 1908.04, "text": "sah tatsächlich gar nicht so kompliziert aus man braucht irgendwie den docker feil konfig"}, {"id": 245, "start": 1908.04, "end": 1916.44, "text": "jammel runsh also ich würde sagen wir probieren das einfach mal aus ja also fiat client da sind"}, {"id": 246, "start": 1916.44, "end": 1924.88, "text": "wir also was brauchen wir das lasst uns das mal angucken inside that directory brauchen wir"}, {"id": 247, "start": 1924.88, "end": 1938.08, "text": "docker feil konfig jammel runsh ja gut aus das lässt sich das lässt sich einrichten ein docker"}, {"id": 248, "start": 1938.08, "end": 1949.5, "text": "feil brauma ein konfig jammel brauma ich glaube die meinen dass man das hier im root macht du"}, {"id": 249, "start": 1949.5, "end": 1954.04, "text": "musst nach integration suchen ich will keine integration machen ich will ein addon machen"}, {"id": 250, "start": 1954.04, "end": 1962.56, "text": "eine integration muss ja in python programmiert sein und muss dann als integration da rein ach"}, {"id": 251, "start": 1962.56, "end": 1967.2, "text": "so ja du hast recht deswegen mache ich auch nicht über hacks weil über hacks kannst du das ja"}, {"id": 252, "start": 1967.2, "end": 1990.82, "text": "nicht machen ich will kein das wird ein addon so runsh brauchen wir noch ein runsh alles unter"}, {"id": 253, "start": 1990.82, "end": 2000.2, "text": "ordner ist hyperplot so also was muss denn jetzt da rein vor allem wie kriege ich das dann auf"}, {"id": 254, "start": 2000.2, "end": 2009.32, "text": "mein home assistant drauf habe ich habe ich ssh addons oder sowas installiert ja habe ich"}, {"id": 255, "start": 2009.32, "end": 2014.96, "text": "zum glück kann ich bei ssh drauf kopieren aber ich glaube dass das wird man ja sieht man ja"}, {"id": 256, "start": 2014.96, "end": 2020.84, "text": "denn hier drin also was muss man machen die dateien anlegen docker feil soll so aussehen ok das kriegen"}, {"id": 257, "start": 2020.84, "end": 2029.92, "text": "wir hin ark bild from bild sollte da nicht irgendwas rein oder ersetzt das oder ersetzt"}, {"id": 258, "start": 2029.92, "end": 2041.0, "text": "das home assistant automatisch copy runsh ok dann führt der runsh aus ok das ist easy das"}, {"id": 259, "start": 2041.0, "end": 2047.56, "text": "könnte nicht viel einfacher sein config feil jammel so was kann man da konfigurieren hello world"}, {"id": 260, "start": 2047.56, "end": 2066.12, "text": "my first addon den heißt vier champ keck version 1 0 slack hetschapp in it was macht denn in it"}, {"id": 261, "start": 2066.12, "end": 2076.72, "text": "also das gibt es auf jeden fall nur für amd 64 das da und für arm v7 und v8 ist das v8"}, {"id": 262, "start": 2076.72, "end": 2087.84, "text": "was anderes was anderes unterstützen wenn ich das reicht aber auch ganz ehrlich das ist auch ok so"}, {"id": 263, "start": 2087.84, "end": 2102.08, "text": "passt so und jetzt wie geht das weiter runsh ja gut das kriege ich ok wisst ihr was wir machen"}, {"id": 264, "start": 2102.08, "end": 2109.48, "text": "mal das tutorial durch dass ich ungefähr verstehe um was es geht moment warum habe ich das muss ich"}, {"id": 265, "start": 2109.48, "end": 2117.72, "text": "docker feil kopieren nicht dahin was muss dahin hello world ok alles klar installing and testing"}, {"id": 266, "start": 2117.72, "end": 2125.68, "text": "your add-on open config home assistant add-on backup super adon store check for update button"}, {"id": 267, "start": 2125.68, "end": 2131.2, "text": "you should now see ne moment das sehe ich bestimmt nicht das liegt bei mir lokal auf der platte wie"}, {"id": 268, "start": 2131.2, "end": 2140.28, "text": "kriege ich das hin ach hier vor ssh ok ich das heißt ich muss es auf mein respawn nicht auf"}, {"id": 269, "start": 2140.28, "end": 2145.32, "text": "was habe ich denn ich habe ich muss es auf mein home assistant rüber kopieren gut probieren wir"}, {"id": 270, "start": 2145.32, "end": 2159.0, "text": "das mal aus also der da auf welchem port läuft das ist auch standardmäßig auch 22 nice ssh key"}, {"id": 271, "start": 2159.0, "end": 2186.04, "text": "gen minus er ist und was ist das default password configuration cute chat 123 alles klar ich glaube"}, {"id": 272, "start": 2186.04, "end": 2199.36, "text": "ich glaube wir machen mal wir kopieren mal kurz das password rüber aus irgendwelchen gründen ist"}, {"id": 273, "start": 2199.36, "end": 2210.48, "text": "es mir nicht ist es ok sfdp brauche ich glaube ich muss das in authorized keys rein packen sonst"}, {"id": 274, "start": 2210.48, "end": 2227.48, "text": "geht das nicht anders ok cut ssh achtung leute jetzt kein ssh key liegen max et poggers muss man"}, {"id": 275, "start": 2227.48, "end": 2242.6, "text": "das kann man das so reinschreiben save restart hoffentlich frisst er das lock ja gehen wir nicht"}, {"id": 276, "start": 2242.6, "end": 2258.8, "text": "auf den sack ob man mal funktioniert oder verwendet er den key gar nicht dass der key ist fünf jahre"}, {"id": 277, "start": 2258.8, "end": 2286.12, "text": "alt oder so wo ist mein key hin"}, {"id": 278, "start": 2286.12, "end": 2287.92, "text": "warum"}, {"id": 279, "start": 2294.68, "end": 2299.68, "text": "ach mehrere save buttons alter six hat konfiguration"}, {"id": 280, "start": 2303.68, "end": 2308.6, "text": "das ist der IQ technisch schon wieder versagt so geht's jetzt"}, {"id": 281, "start": 2308.6, "end": 2318.32, "text": "das sieht natürlich schon das sieht wie der hive meint im chat ja das ist halt so der chat"}, {"id": 282, "start": 2318.32, "end": 2324.6, "text": "ist mittlerweile durch die ganzen subs und bits und alles und über die letzten jahre über der"}, {"id": 283, "start": 2324.6, "end": 2332.6, "text": "ist so extrem high IQ da kann ich kann ich nicht mal gegen anstehen der ist der chat ist"}, {"id": 284, "start": 2332.6, "end": 2338.48, "text": "wirklich schon mittlerweile so der kopf ist so quasi komplett in die breite schon seit 16 zu"}, {"id": 285, "start": 2338.48, "end": 2363.36, "text": "neun eher 16 zu fünf so da sind wir eingelogged wie wo hin muss ich den kram überhaupt kopieren für"}, {"id": 286, "start": 2363.36, "end": 2380.2, "text": "ok das mag ich an home assistant die dinger sind immer relativ selbsterklärend ok also heißt von"}, {"id": 287, "start": 2380.2, "end": 2394.32, "text": "der idee bild publish publish also minus konfiguration nicht release die back ist ok"}, {"id": 288, "start": 2394.32, "end": 2400.68, "text": "minus wobei kommt scheiß drauf wir lassen erst mal das hello world laufen und gut ist"}, {"id": 289, "start": 2400.68, "end": 2415.6, "text": "also wohin wird der ganze krempel der netz scp scp 134 also wir scp das da jetzt einfach mal"}, {"id": 290, "start": 2415.6, "end": 2431.0, "text": "nach dem slash add ons ist es 1 2 1 3 2 überhaupt gewesen ach nee 1 3 1 3 1 3 2 ist es gewesen ok"}, {"id": 291, "start": 2431.0, "end": 2445.04, "text": "action close ach so ich muss ja minus er machen scp connection close ich habe irgendwas von sftp"}, {"id": 292, "start": 2445.04, "end": 2450.0, "text": "er laut oder so gesehen zeigt mal her ich muss ich das auf true setzen dass ich ssh machen kann"}, {"id": 293, "start": 2450.0, "end": 2461.44, "text": "wenn alles nicht hilft dann erst und ja erst und ist ja eigentlich das was man eher nehmen sollte"}, {"id": 294, "start": 2461.44, "end": 2483.96, "text": "nexon refused alter was jetzt you have enabled sftp using ssh enable this requires ssh username to be root was"}, {"id": 295, "start": 2483.96, "end": 2491.24, "text": "ok ist mir lieber wenn ich ruht bin ruht tut gut"}, {"id": 296, "start": 2491.24, "end": 2507.56, "text": "jetzt sagt fahr jetzt zu megas dann da sind wir dann fahr du mal zu megas glhf bei megas"}, {"id": 297, "start": 2507.56, "end": 2516.24, "text": "jetzt geben halt alle geben halt per ruht drauf mein sind wir halt ruht slash add ons via champ da"}, {"id": 298, "start": 2516.24, "end": 2533.0, "text": "sind wir ok also und jetzt wie lebt man jetzt die add ons basic kakona ja hau dir den richtig"}, {"id": 299, "start": 2533.0, "end": 2539.36, "text": "fetten kakona burger rein hat attack burger wobei ich glaube so was gibt es bei mcdonalds nicht"}, {"id": 300, "start": 2539.36, "end": 2544.88, "text": "aber in amis gibt so was die haben doch in den usa gibt es auch diese komische fast food ich"}, {"id": 301, "start": 2544.88, "end": 2550.92, "text": "weiß nicht welche das ist da gibt es auch diese fast food kette wo du hat attack burger kaufen"}, {"id": 302, "start": 2550.92, "end": 2561.24, "text": "kannst wo auch die die kellerin in bikinis und so rumlaufen wie heißt das normal da sitzen die"}, {"id": 303, "start": 2561.24, "end": 2568.2, "text": "ganzen halbe kakone aus rum und fressen den ganzen tag guters das kann sein ich ja doch kann sein"}, {"id": 304, "start": 2568.2, "end": 2577.64, "text": "so wo muss ich denn jetzt hin hau muss es den frontend da sind wir configuration add ons und"}, {"id": 305, "start": 2577.64, "end": 2584.92, "text": "add ons store ok im prinzip weiß ich eigentlich wo ich hin muss wir sind ja hier schon richtig"}, {"id": 306, "start": 2584.92, "end": 2602.12, "text": "auch nicht settings add ons add ons store und jetzt was muss ich bin verwirrt habe ich das"}, {"id": 307, "start": 2602.12, "end": 2617.44, "text": "jetzt gerade geschlossen oder was jetzt gerade habe ich das jetzt gerade zugemacht weil ich"}, {"id": 308, "start": 2617.44, "end": 2626.36, "text": "total bescheuert bin so also click add ons store in the bottom right habe ich top right overflow"}, {"id": 309, "start": 2626.36, "end": 2635.0, "text": "in new click check for update button da und jetzt hier schutz siehnau new section called local add"}, {"id": 310, "start": 2635.0, "end": 2664.6, "text": "ons nur löse ich nicht habe ich irgendwas vergessen also man muss das so heißen muss"}, {"id": 311, "start": 2664.6, "end": 2692.0, "text": "das so heißen kann das sein dass der kram nicht richtig heißt dass es dass es so heißen muss weil"}, {"id": 312, "start": 2692.0, "end": 2709.28, "text": "ich hier in der config jammel das ding auch so genannt kann das sein check for updates"}, {"id": 313, "start": 2709.28, "end": 2735.72, "text": "nö und jetzt das tutorial klappt nicht"}, {"id": 314, "start": 2735.72, "end": 2741.16, "text": "hier oben sollte ich jetzt local add ons sehen nö sehe ich nicht ich sehe keine local add ons"}, {"id": 315, "start": 2741.16, "end": 2753.8, "text": "gibt es nicht finden tut auch nicht habe ich irgendwas übersehen was ich machen muss add"}, {"id": 316, "start": 2753.8, "end": 2772.52, "text": "ons folder samba nö nö slash addon muss man sonst muss man dann nichts machen ok dann machen"}, {"id": 317, "start": 2772.52, "end": 2780.32, "text": "wir das mal anders wenn das nicht funktioniert wir machen jetzt wirklich eins zu eins das tutorial"}, {"id": 318, "start": 2780.32, "end": 2790.04, "text": "machen eins zu eins das tutorial also ich soll ein verzeichnis erstellen hello world alles klar"}, {"id": 319, "start": 2790.04, "end": 2806.92, "text": "add ons mk dir hello world dann da drin ein docker file erstellen mit diesem inhalt alles"}, {"id": 320, "start": 2806.92, "end": 2823.24, "text": "klar habe ich gemacht danach eine config jammel erstellen mit diesem inhalt auch auch alles klar"}, {"id": 321, "start": 2823.24, "end": 2832.44, "text": "dann ein runsh file erstellen es stimmt recht stand da was von chmod mein ich bin root wenn"}, {"id": 322, "start": 2832.44, "end": 2844.96, "text": "ich dateien anlege dann das kann natürlich sein dass es nicht gut gehören darf du hast recht"}, {"id": 323, "start": 2844.96, "end": 2863.84, "text": "das ist das das wird es wahrscheinlich sein ja ja ja guck dir mal ups alter ich kann das gehört"}, {"id": 324, "start": 2863.84, "end": 2876.8, "text": "root aber wir machen einfach mal 777 auf move dockerfile config jammel run nach hello world"}, {"id": 325, "start": 2876.8, "end": 2897.68, "text": ".sh so jetzt haben wir exakt das gemacht was im tutorial steht installing and testing check"}, {"id": 326, "start": 2897.68, "end": 2902.68, "text": "updates nö will nicht hä leute ich hätte wahrscheinlich einfach refreshen müssen wobei"}, {"id": 327, "start": 2902.68, "end": 2927.32, "text": "ok install start start logs hello world ok das hat funktioniert uninstall uninstall"}, {"id": 328, "start": 2927.32, "end": 2944.52, "text": "was auch immer ja dann scp ich das ding jetzt noch mal scp fiat fiat champ allerdings nach"}, {"id": 329, "start": 2944.52, "end": 2953.16, "text": "geht das habe ich noch nie ausprobiert ob man das so umbenennen kann mit scp ja geht"}, {"id": 330, "start": 2953.16, "end": 2969.0, "text": "sehr schön jetzt müsste es jetzt müsste es eigentlich checken da ist er doch der fiat"}, {"id": 331, "start": 2969.0, "end": 2976.16, "text": "champ man muss einfach ohne cash refreshen und gut ist alter lull das muss jetzt erstmal"}, {"id": 332, "start": 2976.16, "end": 2981.56, "text": "einer verstehen na gut ok also wir wollen jetzt natürlich nicht hello world ausführen"}, {"id": 333, "start": 2981.56, "end": 2995.44, "text": "sondern erst einmal erst einmal wollen wir das ding bilden publish publish so config"}, {"id": 334, "start": 2995.44, "end": 3003.24, "text": "nee release lassen wir weg ich will mit debug ausgabe sehen dot net publish linux self contain"}, {"id": 335, "start": 3003.24, "end": 3018.28, "text": "publish ja das ist erstmal ok so wie groß ist das binary jetzt 120 mb 68 das geht ja"}, {"id": 336, "start": 3018.28, "end": 3042.36, "text": "sogar noch so und das wollen wir starten ja ok das funst das heißt in das run file muss"}, {"id": 337, "start": 3042.36, "end": 3047.12, "text": "jetzt was rein nee moment erst einmal docker file wir müssen den krempel jetzt noch kopieren"}, {"id": 338, "start": 3047.12, "end": 3061.96, "text": "genau wir wollen nämlich wir wollen nämlich bild slash fiat champ da auch hinkopieren"}, {"id": 339, "start": 3061.96, "end": 3078.8, "text": "wollen wir das nicht vorwarnen vielleicht unterordner machen irgendwie so kann man so"}, {"id": 340, "start": 3078.8, "end": 3091.88, "text": "und dann kommt der kram noch hier drauf zum ausführen ja und dann starten wir runsh und"}, {"id": 341, "start": 3091.88, "end": 3100.48, "text": "in runsh sagen wir da nicht hello world sondern slash fiat champ so und jetzt sollte den krempel"}, {"id": 342, "start": 3100.48, "end": 3104.6, "text": "zumindest schon mal starten jetzt habe ich im tutorial gesehen jetzt muss man die versionsnummer"}, {"id": 343, "start": 3104.6, "end": 3126.24, "text": "hoch zählen sonst checkt das nämlich net net zcpn wirs rüber jetzt muss ich ersunken"}, {"id": 344, "start": 3126.24, "end": 3141.48, "text": "Leute sonst dauert es zu lang wenn ich das nicht ersünke dauert das drei stunden ich"}, {"id": 345, "start": 3141.48, "end": 3152.88, "text": "habe das jetzt ineinander kopiert ne das ist ok wir ersunken das jetzt mal ersünk"}, {"id": 346, "start": 3152.88, "end": 3172.56, "text": "minus v minus a ging das so nee ersünk es ist three hat so ey sieht schon mal besser"}, {"id": 347, "start": 3172.56, "end": 3179.04, "text": "aus jawoll nice und jetzt kann ich nämlich den ganzen krempel auch ein bisschen schneller"}, {"id": 348, "start": 3179.04, "end": 3187.64, "text": "sinken alles da schauen wir mal was wir jetzt neues neue addon version haben eins punkt"}, {"id": 349, "start": 3187.64, "end": 3196.18, "text": "eins ok install dark zone schreibt was was macht minus k ist minus k nicht zertifikate"}, {"id": 350, "start": 3196.18, "end": 3203.76, "text": "ignorieren moin zusammen ich versuche im moment ross desk von github bei mir auf eine ubuntu"}, {"id": 351, "start": 3203.76, "end": 3209.56, "text": "vm zu installieren im firmnetz und wenn ich weg hat mache sagt er mir dass die echtheit"}, {"id": 352, "start": 3209.56, "end": 3216.04, "text": "vom zertifikat nicht überprüft werden kann hab schon sehr also kannst du das einfach"}, {"id": 353, "start": 3216.04, "end": 3225.2, "text": "ignorieren sowohl mit karl als auch mit weget und ja ich glaube es wirklich minus k aber"}, {"id": 354, "start": 3225.2, "end": 3236.24, "text": "dann sagt er das denn weil ich mein github hat definitiv ein gültiges zertifikat es"}, {"id": 355, "start": 3236.24, "end": 3247.48, "text": "würde mich doch sehr wundern hätte github kein gültiges zertifikat achso starten muss"}, {"id": 356, "start": 3247.48, "end": 3256.84, "text": "ich vielleicht noch log vier champ no such file or directory warum"}, {"id": 357, "start": 3264.84, "end": 3266.92, "text": "warum nicht wo ist es denn"}, {"id": 358, "start": 3266.92, "end": 3280.08, "text": "wo ist es hin muss ich das so nennen"}, {"id": 359, "start": 3290.08, "end": 3296.2, "text": "das müsste ich habe es auch ich habe es doch dahin kopiert das müsste auch da sein oder bin"}, {"id": 360, "start": 3296.2, "end": 3300.08, "text": "ich jetzt bin ich jetzt pp gar im kopf was docker docker feil angeht"}, {"id": 361, "start": 3300.08, "end": 3318.2, "text": "ne ne es ist kein punkt sh es ist einfach nur guck einfach ohne ohne was aber das"}, {"id": 362, "start": 3318.2, "end": 3327.4, "text": "müsste auch eigentlich da sein wenn ich es dann noch mal hin"}, {"id": 363, "start": 3327.4, "end": 3352.56, "text": "habe ich den sündungsfehler immer im docker feil oder sowas aber also mich wird es wirklich"}, {"id": 364, "start": 3352.56, "end": 3371.72, "text": "wundern wenn weget mein das github das zertifikat abgelaufen ist das ist verwirrt die anzeige ist"}, {"id": 365, "start": 3371.72, "end": 3382.64, "text": "etwas durcheinander hier glaube ich jetzt install dann bin ich nicht so verstehe ich nicht so ganz"}, {"id": 366, "start": 3382.64, "end": 3391.32, "text": "was er für schmerzen hat warum er es nicht findet ist nicht das github zrm er will es"}, {"id": 367, "start": 3391.32, "end": 3405.44, "text": "doch von github installieren wo ist das problem warte mal ich muss mal kurz chat lesen so"}, {"id": 368, "start": 3405.44, "end": 3414.88, "text": "wenn du ein weget auf github machst sagt er das ist nicht echt ja die zeit stimmt vielleicht"}, {"id": 369, "start": 3414.88, "end": 3423.28, "text": "in der ubuntu vm nicht das könnte eventuell noch sein aber ansonsten geht es über irgendein"}, {"id": 370, "start": 3423.28, "end": 3431.4, "text": "proxien die dich irgendwie machen die irgendwelche magic mit transparenter proxy oder machen"}, {"id": 371, "start": 3431.4, "end": 3442.08, "text": "die irgendwelche komischen dinger bei euch auf der arbeit"}, {"id": 372, "start": 3442.08, "end": 3447.88, "text": "was hat denn sein company company hu ca und der trust store mit einem get mit einem weget"}, {"id": 373, "start": 3447.88, "end": 3455.48, "text": "auf github zu tun ich würde jetzt lieber gerne wissen warum der der meinung ist dass"}, {"id": 374, "start": 3455.48, "end": 3465.8, "text": "der vier champ nicht findet wo ist das wo ist jetzt das problem das mache ich doch richtig"}, {"id": 375, "start": 3465.8, "end": 3475.64, "text": "oder copy run asa nach slash run asa und jetzt copy bild für dahin und dann ist es doch da"}, {"id": 376, "start": 3475.64, "end": 3481.48, "text": "mehr die run asa brauche ich nicht wirklich aber vielleicht wird doch die brauche ich"}, {"id": 377, "start": 3481.48, "end": 3493.96, "text": "ich will ja noch ein bisschen mehr machen gleich aber wo ist das problem also jetzt"}, {"id": 378, "start": 3493.96, "end": 3505.88, "text": "fliege ich nicht mehr durch slash gibt's nicht wisst ihr der fiat pfiat champs store page"}, {"id": 379, "start": 3505.88, "end": 3526.2, "text": "jetzt das geht immer in das internet so copy so schwierig ist das ja eigentlich nett genau"}, {"id": 380, "start": 3526.2, "end": 3537.24, "text": "das ist theoretisch relativ simpel findet er das nicht beim ko hat hat man vielleicht"}, {"id": 381, "start": 3537.24, "end": 3545.76, "text": "ein lock vom bild oder so dass man hier irgendwie nachgucken kann lock hat kein lock vom bild"}, {"id": 382, "start": 3545.76, "end": 3575.6, "text": "vielleicht in den system locks locks locks supervisor aha build verstehe ich das leuchtet"}, {"id": 383, "start": 3575.6, "end": 3582.12, "text": "jetzt nicht nein ich weil wenn ich da in krab angebe dann sollte das bilden schon mal überhaupt"}, {"id": 384, "start": 3582.12, "end": 3597.16, "text": "nicht funktionieren da hätte ich jetzt nicht gedacht dass es an der stelle kompliziert"}, {"id": 385, "start": 3597.16, "end": 3600.96, "text": "wird schon es fackt mich immer ab wenn so einfache dinger dann nicht funktionieren"}, {"id": 386, "start": 3600.96, "end": 3615.52, "text": "so ne wo war das hier addon store check for updates nein wir brauchen kein backup aha"}, {"id": 387, "start": 3615.52, "end": 3623.28, "text": "ja siehste wenn es nicht wenn du was kopierst was nicht da ist dann geht es nicht das ist"}, {"id": 388, "start": 3623.28, "end": 3645.48, "text": "ja ok so bild fiat champ ok so was ich jetzt mal mach lsla slash lass mir anzeigen check"}, {"id": 389, "start": 3645.48, "end": 3658.64, "text": "for updates update man jetzt macht ein backup eget in beim ch mod ich kopier es dahin und"}, {"id": 390, "start": 3658.64, "end": 3672.16, "text": "dann mache ich ein ch mod das ist ok ok warum braucht jetzt drei stunden dafür alter was"}, {"id": 391, "start": 3672.16, "end": 3699.36, "text": "machst du denn da ach jetzt hat er geupdatet ok lock start da ist es doch da ist es doch"}, {"id": 392, "start": 3699.36, "end": 3717.24, "text": "ganz offensichtlich und hat auch execute rechte will er mich verarschen da ist es doch das"}, {"id": 393, "start": 3717.24, "end": 3734.76, "text": "ist doch ganz offensichtlich da ich habs nicht für arm gebaut ich habs für x86 gebaut"}, {"id": 394, "start": 3734.76, "end": 3749.36, "text": "oder ja kann das sein ok ich hab ne idee ich hab ne idee kann das sein dass diese meldung"}, {"id": 395, "start": 3749.36, "end": 3765.28, "text": "einfach nur richtig bescheuert ist probieren wir mal was aus blub.sh bin.sh echo123 so ok"}, {"id": 396, "start": 3765.28, "end": 3779.56, "text": "copy blub.sh ich mach das alles mal in ein eigenes verzeichnis gleich so und jetzt gucken"}, {"id": 397, "start": 3779.56, "end": 3788.16, "text": "wir mal ob das geht weil es könnte sein dass der ein anderes problem hat ich glaube der"}, {"id": 398, "start": 3788.16, "end": 3802.0, "text": "hat ein anderes problem rsync rüber rsync dieser store ist wirklich ganz pepega zu bedienen"}, {"id": 399, "start": 3802.0, "end": 3815.04, "text": "ja so check for updates alles klar update wisst ihr was ich glaube das no such filo directory"}, {"id": 400, "start": 3815.04, "end": 3823.0, "text": "ist dotnet beim starten was das sagt ich gehe davon aus da fehlt irgendwas weil dotnet"}, {"id": 401, "start": 3823.0, "end": 3830.48, "text": "hat eine oder zwei abhängigkeiten selbst bei self contained access wenn man das nicht"}, {"id": 402, "start": 3830.48, "end": 3843.2, "text": "abschaltet man kann das abschalten die brauchen irgendeine translation library oder sowas wenn"}, {"id": 403, "start": 3843.2, "end": 3856.36, "text": "es nicht ausschaltet guck hier das funktioniert das funst was ist denn das für ein system"}, {"id": 404, "start": 3856.36, "end": 3863.32, "text": "wir installieren da was nach kann man sich da irgendwie connecten oder so docker protection"}, {"id": 405, "start": 3863.32, "end": 3877.48, "text": "mode ach was protection mode nix protection hier wird nix protected ich hab doch grad"}, {"id": 406, "start": 3877.48, "end": 3900.36, "text": "schon geupdatet der ist der ist verwirrt der ist verwirrt protection mode protection protection"}, {"id": 407, "start": 3900.36, "end": 3917.6, "text": "mode ich will ich will per command line auf das system drauf so was läuft da wo ist denn"}, {"id": 408, "start": 3917.6, "end": 3934.28, "text": "meiner wo ist denn hier der nee wo ist es denn wie kann ich mich jetzt auf meinen läuft"}, {"id": 409, "start": 3934.28, "end": 3944.44, "text": "das addon überhaupt protection mode ist das ps-a aber es sollte doch laufen ach nee es"}, {"id": 410, "start": 3944.44, "end": 3953.68, "text": "läuft nicht es hat sein es hat sein links gestartet und gut es aber wie ging das jetzt"}, {"id": 411, "start": 3953.68, "end": 3965.32, "text": "docker execk kriege ich aus dem kopf nicht gebacken docker execk bin bash oder so nee"}, {"id": 412, "start": 3965.32, "end": 3987.36, "text": "er ist noch running run it run it war das run it run it was latest was moment nein image"}, {"id": 413, "start": 3987.36, "end": 4009.24, "text": "execk ist richtig aber wie ging das jetzt was so tatsächlich nee nee nee nee nee nee"}, {"id": 414, "start": 4009.24, "end": 4022.08, "text": "das ist run bin bash docker hier ja das das ist neu starten warum findet er das image"}, {"id": 415, "start": 4022.08, "end": 4044.64, "text": "eigentlich nicht muss die muss das da muss das image hinten dran"}, {"id": 416, "start": 4044.64, "end": 4070.2, "text": "ja ich mach das schon nicht das ist schon richtig nee nee"}, {"id": 417, "start": 4070.2, "end": 4082.88, "text": "docker images wo ist es denn da hier das da brauchen wir ach nee image id das da brauchen"}, {"id": 418, "start": 4082.88, "end": 4091.68, "text": "wir so also was ist denn das ist das ein debian nee das ist das ist ein dings das ist ein"}, {"id": 419, "start": 4091.68, "end": 4103.0, "text": "alpine oder ok slash fiat fiat champ no such file directly ok da fehlt irgendwas wartet"}, {"id": 420, "start": 4103.0, "end": 4113.32, "text": "mal was braucht dotnet noch mal dass es läuft ohne wenn man es nicht abschaltet das braucht"}, {"id": 421, "start": 4113.32, "end": 4135.36, "text": "dings wie heißt das irgend so eine globalization translation library war das eco an die ad"}, {"id": 422, "start": 4135.36, "end": 4158.2, "text": "ist es lip eq oder sowas wie heißt der kram einfach so eq lips fiat champ fuck ähm warte"}, {"id": 423, "start": 4158.2, "end": 4166.56, "text": "mal ach moment das ist ein alpine das muss man anders warte mal dotnet das muss das musste"}, {"id": 424, "start": 4166.56, "end": 4176.24, "text": "man doch anders machen oder für alpine linux muss man das doch anders nennen genau da musste"}, {"id": 425, "start": 4176.24, "end": 4183.88, "text": "ich so kompilieren dass es funktioniert stimmt ich erinnere mich da muss man das muss man"}, {"id": 426, "start": 4183.88, "end": 4193.52, "text": "so machen publish weil alpine benutzt irgend so eine furchtbar exotische c library mit"}, {"id": 427, "start": 4193.52, "end": 4203.68, "text": "der es sonst nicht funktioniert so willst du das neue kort ausprobieren ja wahrscheinlich"}, {"id": 428, "start": 4203.68, "end": 4218.48, "text": "schon ok jetzt jetzt sollte es aber funktionieren bild da ist es mal gucken wann es zuletzt"}, {"id": 429, "start": 4218.48, "end": 4224.96, "text": "kompiliert wurde 2127 das sieht ziemlich gut aus so jetzt müssen muss es aber funktionieren"}, {"id": 430, "start": 4224.96, "end": 4236.8, "text": "so zack dass da weg da mal die versionsnummer rauf und ersunken das rüber rüber ersünkt"}, {"id": 431, "start": 4236.8, "end": 4244.96, "text": "addons ne da muss man nicht hin wir müssen hier irgendwo ins webinterface ja addons zack"}, {"id": 432, "start": 4244.96, "end": 4265.04, "text": "für updates hallo oh ich hab vergessen zu speichern ersünkt check for updates update"}, {"id": 433, "start": 4265.04, "end": 4270.36, "text": "so und jetzt sollte es laufen kannst du nicht einfach ein ubuntu docker image nehmen doch"}, {"id": 434, "start": 4270.36, "end": 4275.24, "text": "wahrscheinlich aber das default image von denen ist wahrscheinlich ist anscheinend ein"}, {"id": 435, "start": 4275.24, "end": 4279.08, "text": "alpine image wahrscheinlich kann ich nehmen was ich will ja da gehe ich auch mal von"}, {"id": 436, "start": 4279.08, "end": 4307.36, "text": "aus so wie sieht es denn jetzt aus start achtung"}, {"id": 437, "start": 4307.36, "end": 4330.52, "text": "ok das stimmt irgendwelche versionen nicht entweder ist da irgendwas zu machen wie ich"}, {"id": 438, "start": 4330.52, "end": 4341.96, "text": "sowas nicht ab kann so ok wir nehmen anderes image build from home assistant addons base"}, {"id": 439, "start": 4341.96, "end": 4354.64, "text": "images was haben wir da alles zu bieten base images ja was haben wir da hast du das mit"}, {"id": 440, "start": 4354.64, "end": 4362.16, "text": "der dotnet beta gemacht ja aber sollte eigentlich mal wir können ja mal gucken dotnet sieben"}, {"id": 441, "start": 4362.16, "end": 4372.68, "text": "prerequisites die sollten eigentlich mehrere jahre zurück"}, {"id": 442, "start": 4372.68, "end": 4393.92, "text": "ja so ported os alpine linux 13 ok release notes für"}, {"id": 443, "start": 4393.92, "end": 4408.72, "text": "ach so das ist noch das ist noch core sieben ja man kann bestimmt l.o.t. compile aber support"}, {"id": 444, "start": 4408.72, "end": 4421.48, "text": "os alpine 115 so und das ist das ist von sonst wann wie gesagt wir haben das von einem ubuntu"}, {"id": 445, "start": 4421.48, "end": 4430.24, "text": "von vor 15 jahren laufen lassen kann er jetzt nicht sein"}, {"id": 446, "start": 4430.24, "end": 4455.88, "text": "die side base images was haben wir denn für base images dockerfile alpine 316 siehste wir"}, {"id": 447, "start": 4455.88, "end": 4469.16, "text": "das probieren wir doch mal aus docker images das da wollen wir haben run so slash fiat"}, {"id": 448, "start": 4469.16, "end": 4485.88, "text": "ja also daran wird es jetzt wird es ja nicht liegen das würde normalerweise eine ordentliche"}, {"id": 449, "start": 4485.88, "end": 4497.52, "text": "fehler easy tatsächlich die die übersetzungs library die internationalisierungs dingsbums"}, {"id": 450, "start": 4497.52, "end": 4505.88, "text": "library das kann man ausschalten da muss ich in invariant bilden dann geht das aber"}, {"id": 451, "start": 4505.88, "end": 4507.8, "text": "wir können es auch einfach wir können es auch einfach adden"}, {"id": 452, "start": 4507.8, "end": 4528.68, "text": "was auch immer ich davon brauche wunderbar so versionsnummer fünf"}, {"id": 453, "start": 4528.68, "end": 4545.56, "text": "ok so jetzt aber please einfach einfach funktionieren check for updates jawoll fünf ist da kein"}, {"id": 454, "start": 4545.56, "end": 4564.36, "text": "backup update jetzt aber auf an ich muss noch starten das sieht doch gut aus es funktioniert"}, {"id": 455, "start": 4564.36, "end": 4577.8, "text": "ja das ist gut es funktioniert jetzt können wir gucken wie wir die ganzen daten da rein"}, {"id": 456, "start": 4577.8, "end": 4582.28, "text": "kriegen also ich habe in diesem tutorial folgendes"}, {"id": 457, "start": 4582.28, "end": 4610.36, "text": "gefunden man kann man kann auslesen was der genau options home assistant addons mqtt man"}, {"id": 458, "start": 4610.36, "end": 4616.32, "text": "kann auslesen was für den mqtt server gesetzt ist das heißt das muss man gar nicht in der"}, {"id": 459, "start": 4616.32, "end": 4620.68, "text": "config angeben genau so hoffe das hoffe das war so"}, {"id": 460, "start": 4620.68, "end": 4644.52, "text": "mqtt oder mysql ging das ja so das heißt schreiben wir das mal in die runsh und geben"}, {"id": 461, "start": 4644.52, "end": 4650.84, "text": "wir mal testweise keine ahnung testweise irgendwie usernamen aus"}, {"id": 462, "start": 4650.84, "end": 4655.96, "text": "und schauen wir mal vielleicht vielleicht geht es ja auch ohne update vielleicht reicht"}, {"id": 463, "start": 4655.96, "end": 4657.4, "text": "es ja auch wenn ich einfach nach rebuild"}, {"id": 464, "start": 4657.4, "end": 4666.92, "text": "vielleicht macht das ja dann neu und ich brauche den ganzen krempel ich weil da kriege"}, {"id": 465, "start": 4666.92, "end": 4670.76, "text": "ich die ganzen infos raus und die muss ich dann als environment variablen exportieren"}, {"id": 466, "start": 4670.76, "end": 4676.56, "text": "dass der krempel funktioniert ok start"}, {"id": 467, "start": 4676.56, "end": 4690.2, "text": "ok nee geht halt nicht funktioniert man muss man muss wirklich die config file soll halt"}, {"id": 468, "start": 4690.2, "end": 4693.36, "text": "wir machen das jetzt mal anders wir machen wir machen das mal anders ich habe mich keinen"}, {"id": 469, "start": 4693.36, "end": 4698.6, "text": "bock immer das von hand da einzutragen mit mit config config version und und gedöns"}, {"id": 470, "start": 4698.6, "end": 4705.56, "text": "ja wobei ich wollte jetzt automatisch wollte irgendwie den seet rüber machen aber dann"}, {"id": 471, "start": 4705.56, "end": 4710.24, "text": "habe ich überlegt wie zähle ich dann hoch kannst du nicht einfach auto update machen"}, {"id": 472, "start": 4710.24, "end": 4713.0, "text": "tja und scheinheit ich muss immer da oben klicken"}, {"id": 473, "start": 4713.0, "end": 4731.56, "text": "ich wobei was wir machen können ist kann das da aufmachen den store dann klicke ich hier"}, {"id": 474, "start": 4731.56, "end": 4740.2, "text": "auf update und hier bleibe ich dann da drinnen für update ja kannst du nicht auch einfach"}, {"id": 475, "start": 4740.2, "end": 4745.44, "text": "auto update machen ja wie gut das könne ich wahrscheinlich wirklich machen aber trotzdem"}, {"id": 476, "start": 4745.44, "end": 4749.08, "text": "muss jemand die datei anpassen das ist halt das doofe start"}, {"id": 477, "start": 4749.08, "end": 4770.64, "text": "ja nee sollte er nicht eigentlich den echo machen mit usernamen aber wahrscheinlich"}, {"id": 478, "start": 4770.64, "end": 4784.32, "text": "ich fand das nicht echo haben wir hier irgendwie sowas rein usernamen host vielleicht funktioniert"}, {"id": 479, "start": 4784.32, "end": 4785.32, "text": "das ja so gar nicht"}, {"id": 480, "start": 4785.32, "end": 4808.64, "text": "und jetzt muss ich da wieder richtig das richtig dumm er so refresh ja check for update so"}, {"id": 481, "start": 4808.64, "end": 4813.48, "text": "hoffentlich hoffentlich zeigt das mir jetzt irgendwas an weil ich meine ich brauche mein"}, {"id": 482, "start": 4813.48, "end": 4817.32, "text": "mqtt server und ich brauche den api login"}, {"id": 483, "start": 4817.32, "end": 4822.76, "text": "nee das ist was anderes mit dem kein zugriff auf den service"}, {"id": 484, "start": 4822.76, "end": 4829.0, "text": "oder achso"}, {"id": 485, "start": 4829.0, "end": 4845.36, "text": "und wie kriege ich access zu meinem mqtt service"}, {"id": 486, "start": 4845.36, "end": 4863.92, "text": "das ist nicht im scope genau wie kriege ich access zu meinem"}, {"id": 487, "start": 4863.92, "end": 4885.72, "text": "und da muss man bestimmt hier irgendwas das ist eine mario playlist"}, {"id": 488, "start": 4885.72, "end": 4890.8, "text": "das muss ich bestimmt hier reinschreiben dass ich das dass ich das machen darf da muss"}, {"id": 489, "start": 4890.8, "end": 4913.44, "text": "ich über home assist home assistant discovery"}, {"id": 490, "start": 4913.44, "end": 4917.24, "text": "wo habe ich denn das gefunden"}, {"id": 491, "start": 4917.24, "end": 4926.72, "text": "das war irgendeine hilfeseite da ging es um mysql und um mqtt da stand drinne wie das funktioniert"}, {"id": 492, "start": 4926.72, "end": 4947.88, "text": "hier addon communication genau das brauche ich ja we have an internal service api to make"}, {"id": 493, "start": 4947.88, "end": 4962.08, "text": "service public addon needs ok addon needs to mark the usage of the server over his configuration"}, {"id": 494, "start": 4962.08, "end": 4969.44, "text": "also da muss man irgendwas da muss man irgendwas eintragen dass man das dass man das darf"}, {"id": 495, "start": 4969.44, "end": 4980.88, "text": "a list of services discovery was in meinem beispiel werfeleinheit verkehrt"}, {"id": 496, "start": 4980.88, "end": 4992.24, "text": "discovery ok ich sehe schon dass es ist nicht so einfach"}, {"id": 497, "start": 4992.24, "end": 5000.52, "text": "optional configuration options optional options das ist auch gut"}, {"id": 498, "start": 5000.52, "end": 5011.16, "text": "discovery ok das heißt ich muss hier unten in die config jammeln reinschreiben discovery"}, {"id": 499, "start": 5011.16, "end": 5029.84, "text": "und dann eine liste mqtt hoffe ich mal dass es dann so funktioniert"}, {"id": 500, "start": 5029.84, "end": 5038.36, "text": "was mqtt ist das ist ein sehr leichtgewichtiger message broker bus"}, {"id": 501, "start": 5038.36, "end": 5043.32, "text": "das ist in der iot welt so das ding wo alle devices ihre infos hinschicken und broadcasten"}, {"id": 502, "start": 5043.32, "end": 5044.32, "text": "und subscriben und so"}, {"id": 503, "start": 5044.32, "end": 5064.6, "text": "alter wo ist das problem man no access to mqtt warum ich habe doch explizit gesagt ich will"}, {"id": 504, "start": 5064.6, "end": 5068.8, "text": "das haben in der config so wir suchen jetzt einfach mal nach der"}, {"id": 505, "start": 5068.8, "end": 5095.76, "text": "fehlermeldung ja genau hier zeige ich wie es funktioniert service not enabled"}, {"id": 506, "start": 5095.76, "end": 5114.68, "text": "mostly ja und"}, {"id": 507, "start": 5114.68, "end": 5139.52, "text": "weiter"}, {"id": 508, "start": 5139.52, "end": 5144.72, "text": "no access to mqtt ja gut mein addon braucht irgendwelche spezialrechte dafür dass man"}, {"id": 509, "start": 5144.72, "end": 5148.84, "text": "das machen darf und und und wie fragt man das an"}, {"id": 510, "start": 5148.84, "end": 5169.28, "text": "eine güte das ist tatsächlich komplizierter als ich mir das vorgestellt habe die sündags"}, {"id": 511, "start": 5169.28, "end": 5183.52, "text": "im jammeln richtig würde mal sagen ja"}, {"id": 512, "start": 5183.52, "end": 5192.8, "text": "ja würde ich schon mal sagen dass die richtig ist"}, {"id": 513, "start": 5192.8, "end": 5198.2, "text": "ich meine das ist jason style das müsste aber in jammeln auch erlaubt sein man könne"}, {"id": 514, "start": 5198.2, "end": 5203.64, "text": "es ja so machen aber trotzdem"}, {"id": 515, "start": 5203.64, "end": 5210.32, "text": "was macht denn in it eigentlich in it that is to fall so deshalb die docker die fall system"}, {"id": 516, "start": 5210.32, "end": 5211.32, "text": "in it"}, {"id": 517, "start": 5211.32, "end": 5233.4, "text": "ok man muss auch voll stehen lassen also"}, {"id": 518, "start": 5233.4, "end": 5242.44, "text": "es ist nicht so einfach"}, {"id": 519, "start": 5242.44, "end": 5245.68, "text": "das ist wirklich 6 hat da muss man muss man genau gucken wie das wie das funktioniert"}, {"id": 520, "start": 5245.68, "end": 5250.08, "text": "hier wir suchen mal ok ich weiß was wir machen jetzt hab"}, {"id": 521, "start": 5250.08, "end": 5263.48, "text": "wir gucken mal rein wie die anderen leute das definiert haben so"}, {"id": 522, "start": 5263.48, "end": 5283.36, "text": "da kann ich den ganzen jammeln weg das ist was anderes oder"}, {"id": 523, "start": 5283.36, "end": 5298.12, "text": "wenn das steht einfach nur mq ne das ist was anderes"}, {"id": 524, "start": 5298.12, "end": 5314.24, "text": "wo ja wo ist denn wo ist denn hier jetzt die die konfig jammeln die gibt es hier gar nicht"}, {"id": 525, "start": 5314.24, "end": 5335.36, "text": "ok was was für einen addon hat auf jeden fall"}, {"id": 526, "start": 5335.36, "end": 5343.76, "text": "options also das sind options die er mir anzeigt im web interface das ist nicht die"}, {"id": 527, "start": 5343.76, "end": 5353.0, "text": "options was mein addon darf und was es nicht darf das ist was anderes"}, {"id": 528, "start": 5353.0, "end": 5371.88, "text": "wo ist was mit service ach so alter btf jetzt ernsthaft"}, {"id": 529, "start": 5371.88, "end": 5376.84, "text": "wie soll man da drauf kommen also da wäre ich im leben nicht drauf"}, {"id": 530, "start": 5376.84, "end": 5380.76, "text": "gekommen das so zu schreiben wirklich ganz sicherlich nicht"}, {"id": 531, "start": 5380.76, "end": 5410.52, "text": "so jetzt müssen wir das mal in verjamme lisieren so und hoffen dass jammel jetzt jammelt erzink"}, {"id": 532, "start": 5410.52, "end": 5416.04, "text": "dies jetzt einfach einfach funktionieren wenn es geht einfach funken"}, {"id": 533, "start": 5416.04, "end": 5424.6, "text": "so aber das müsste damit doch jetzt eigentlich gehen"}, {"id": 534, "start": 5424.6, "end": 5446.44, "text": "was addons addons username ist addons ach das ist ein eigener username oder wie ok jetzt"}, {"id": 535, "start": 5446.44, "end": 5453.92, "text": "bin ich mal gespannt was ist password ok was ist port und was ist was ist password dann"}, {"id": 536, "start": 5453.92, "end": 5462.96, "text": "also addons haben anscheinend den eigenen user der alles darf scheint so zu sein man"}, {"id": 537, "start": 5462.96, "end": 5467.56, "text": "muss gar nicht den standard user nehmen da bin ich mal gespannt noch mal kurz abdehnen"}, {"id": 538, "start": 5467.56, "end": 5483.72, "text": "ok das ist aber schon mal gut zu wissen da brauchen wir jetzt noch options was wir im"}, {"id": 539, "start": 5483.72, "end": 5486.28, "text": "im web interface eintragen können unter configuration"}, {"id": 540, "start": 5486.28, "end": 5502.56, "text": "war gespannt was das jetzt anzeigt start tatsächlich eier obviously ist das das password"}, {"id": 541, "start": 5502.56, "end": 5510.28, "text": "da werde mehr also da hätte ich selbst drauf kommen können dass das das password ist"}, {"id": 542, "start": 5510.28, "end": 5525.6, "text": "ok ja dann ok dann weiß ich was wir als nächstes machen muss da gehen wir jetzt in die run jamme"}, {"id": 543, "start": 5525.6, "end": 5544.24, "text": "wir sagen host ist vier champ mqtt server password ist mqtt pw username forst password"}, {"id": 544, "start": 5544.24, "end": 5553.32, "text": "mqtt server mqtt user und report so dann haben wir das nämlich als environment variable"}, {"id": 545, "start": 5553.32, "end": 5567.48, "text": "gesetzt oder export davor machen machen wir mal sondern haben wir das nämlich gesetzt"}, {"id": 546, "start": 5567.48, "end": 5577.64, "text": "und dann sollte der das finden gleich nach dem starten ok das heißt als nicht warum ist"}, {"id": 547, "start": 5577.64, "end": 5584.4, "text": "das sündungs highlighting hier so kaputt so das heißt als nächstes brauchen wir options"}, {"id": 548, "start": 5584.4, "end": 5608.32, "text": "für das frontend also hier sowas brauchen wir das da brauchen wir options also wir brauchen"}, {"id": 549, "start": 5608.32, "end": 5618.32, "text": "ein fiat user ne moment wie heißt das ding fiat user ein fiat password und später noch"}, {"id": 550, "start": 5618.32, "end": 5623.84, "text": "ein fiat pin damit man sachen freischalten kann standardmäßig sind die dinger leer"}, {"id": 551, "start": 5623.84, "end": 5635.32, "text": "falls falls man das so machen muss und ich hoffe das ergibt sinn was ich meine ich copy"}, {"id": 552, "start": 5635.32, "end": 5640.8, "text": "paste ist einfach nur aus denen ihrer aus denen ihre anleitung mal gucken so und wenn"}, {"id": 553, "start": 5640.8, "end": 5644.88, "text": "das jetzt klappt dann sollte ich im web interface options angezeigt bekommen"}, {"id": 554, "start": 5644.88, "end": 5667.44, "text": "das sollte oder configuration zumindest gleich was stehen auf upgrade jetzt mal weiß ich"}, {"id": 555, "start": 5667.44, "end": 5684.56, "text": "was er da immer drei stunden macht config oder da sind wir doch nice da kann man jetzt"}, {"id": 556, "start": 5684.56, "end": 5696.84, "text": "zeugs eintragen sehr produktive sprints ja wir iterieren im minutentakt und und pushen"}, {"id": 557, "start": 5696.84, "end": 5708.6, "text": "direkt live so also und wie kriege ich den kram jetzt abgefragt per environment variable"}, {"id": 558, "start": 5708.6, "end": 5718.88, "text": "wir sind unser eigenes ci cd so und jetzt natürlich die frage mich das per environment"}, {"id": 559, "start": 5718.88, "end": 5746.36, "text": "variable abgefragt bekomme aha so kriegt man das raus config default lease config also"}, {"id": 560, "start": 5746.36, "end": 5761.04, "text": "das heißt im endeffekt ich muss jetzt so was machen wie alles sind alles strings fiat fiat"}, {"id": 561, "start": 5761.04, "end": 5784.92, "text": "user fiat pw und hin so ich denke mal so kann man da auch irgendwie noch eine hilfe zu angeben"}, {"id": 562, "start": 5784.92, "end": 5793.68, "text": "weil so weiß ja keiner so wirklich was er da reinschreiben soll neue dat neue version"}, {"id": 563, "start": 5793.68, "end": 5801.08, "text": "er so ein grüber da ist irgendwie fast aber das geht eigentlich nur wenn wir written in"}, {"id": 564, "start": 5801.08, "end": 5808.48, "text": "rust werden weiß nicht weiß nicht ob wir so basically fast sein können ist das ist das"}, {"id": 565, "start": 5808.48, "end": 5812.96, "text": "möglich leute kann man plays in den plays in die fast sein auch wenn man nicht in rust"}, {"id": 566, "start": 5812.96, "end": 5822.2, "text": "written ist oder in go in go vielleicht noch vielleicht noch in go mit wim stimmt stimmt"}, {"id": 567, "start": 5822.2, "end": 5835.96, "text": "wenn man das ohne wim das geht natürlich gar nicht rust und wim only ap user not found"}, {"id": 568, "start": 5835.96, "end": 5850.56, "text": "das hat schon mal nicht geklappt das hat schon mal nicht geklappt das so zu exportieren"}, {"id": 569, "start": 5850.56, "end": 5872.52, "text": "dann dann dann check ich nicht so genau was ich verkehrt mache create main config meint"}, {"id": 570, "start": 5872.52, "end": 5888.52, "text": "oder ist ok wir müssen uns mal die die hilfe angucken von dem wo ist die config jammel options"}, {"id": 571, "start": 5888.52, "end": 5906.04, "text": "ist eigentlich ist eigentlich genau richtig ist eigentlich genau richtig man trägt die"}, {"id": 572, "start": 5906.04, "end": 5919.68, "text": "options ein genauso wie ich das gemacht habe hier kommt mal options ach moment jammel alter"}, {"id": 573, "start": 5919.68, "end": 5945.4, "text": "ne moment ne das ist kein array das ist key key value also ja prinzipiell schon richtig"}, {"id": 574, "start": 5945.4, "end": 5971.4, "text": "komm scheiße wir machen back up vorher aber wenn das also wenn jetzt die default werte"}, {"id": 575, "start": 5971.4, "end": 5979.36, "text": "gleich drin stehen ich sollte das vielleicht mal ausgeben um zu gucken ob es funktioniert"}, {"id": 576, "start": 5979.36, "end": 5996.76, "text": "ich meine vielleicht habe ich mich hier auch sofort also ich echo"}, {"id": 577, "start": 5996.76, "end": 6004.92, "text": "ja deswegen heiße ich hier auch nicht so wie auf youtube damit die leute nicht so sehr"}, {"id": 578, "start": 6004.92, "end": 6017.96, "text": "verwirrt das funktioniert einfach nicht muss das vielleicht kleingeschrieben sein oder"}, {"id": 579, "start": 6017.96, "end": 6023.12, "text": "muss das problem also ich brauche ich brauche auf jeden fall ein eigenes repo wo das automatisch"}, {"id": 580, "start": 6023.12, "end": 6033.04, "text": "pull ich drehe jetzt schon durch beim ganzen auf update klicken hier jedes javascript framework"}, {"id": 581, "start": 6033.04, "end": 6038.36, "text": "ist doch blazing fast javascript framework sind nicht nur blazing fast die tun auch immer"}, {"id": 582, "start": 6038.36, "end": 6042.52, "text": "so als haben sie irgendwie super krasses neues zeug erfunden wie vorhin dieses framework"}, {"id": 583, "start": 6042.52, "end": 6047.6, "text": "irgendwie npm install damit ihr git hooks machen kann machen könnt jedes git repo hat"}, {"id": 584, "start": 6047.6, "end": 6053.24, "text": "standardmäßig fünf bash scripts drinne für für git hooks warum brauche warum muss ich"}, {"id": 585, "start": 6053.24, "end": 6059.56, "text": "den ersten npm installieren für wie gesagt ohne npm install ist odd ist even geht eh"}, {"id": 586, "start": 6059.56, "end": 6064.52, "text": "nix funktioniert bei euch da ist 16 download noch nicht ausprobiert"}, {"id": 587, "start": 6064.52, "end": 6087.48, "text": "dort ist doch funktioniert doch leute api user not found warum nicht"}, {"id": 588, "start": 6087.48, "end": 6110.44, "text": "guckt mal da der sucht nach es heißt fiat login nicht fiat user"}, {"id": 589, "start": 6110.44, "end": 6120.6, "text": "mensch wer nennt es auch so doof"}, {"id": 590, "start": 6120.6, "end": 6132.4, "text": "ersynch ne version hochzählen so jetzt ersynch leute ich drehe durch mit dem versions hochzählen"}, {"id": 591, "start": 6132.4, "end": 6142.28, "text": "wir müssen das irgendwie anders machen seht jemand jemand eine high iq idee muss die version"}, {"id": 592, "start": 6142.28, "end": 6152.08, "text": "wirklich hochgezählt werden acht ok das moment fai fai fai fai fai fai fai fai fai fai fai"}, {"id": 593, "start": 6152.08, "end": 6167.52, "text": "file grab version kann man am punkt fällt drei jaja sieht schonmal sieht schonmal gut"}, {"id": 594, "start": 6167.52, "end": 6191.36, "text": "Und jetzt hoch zählen, Moment erst noch mal irgen, so und jetzt bash magic, ohje echo,"}, {"id": 595, "start": 6191.36, "end": 6208.56, "text": "plus eins, fack, Moment wie ging das nochmal, rechnen in bash, so schonmal nett, fack doch"}, {"id": 596, "start": 6208.56, "end": 6217.48, "text": "ein unix timestamp als version, das ist ja, aber wie war man, wie war bash, in bash rechnen"}, {"id": 597, "start": 6217.48, "end": 6233.16, "text": "nochmal, also obviously so natürlich, wie sollte es auch anders sein, oh, also Moment,"}, {"id": 598, "start": 6233.16, "end": 6252.76, "text": "also so, ach du kacke, Moment, so, hey, es funst, so bash magic, so jetzt haben wir 16"}, {"id": 599, "start": 6252.76, "end": 6268.12, "text": "und jetzt, Achtung neun, jetzt seht, wie war das sehtechnisch nochmal, so ne, so, in config"}, {"id": 600, "start": 6268.12, "end": 6284.84, "text": "jamme, ne, ah mein hirn, Moment, ne ne so einfach ist es nicht, jetzt sind 16 und was"}, {"id": 601, "start": 6284.84, "end": 6300.88, "text": "will ich ersetzen, ich will die gesamte zeile ersetzen, jetzt funktioniert, fast, fast,"}, {"id": 602, "start": 6300.88, "end": 6315.68, "text": "Punkt, ne, ok, ich gehe davon aus, ich muss es quoteen, dass das funktioniert richtig,"}, {"id": 603, "start": 6315.68, "end": 6342.24, "text": "Moment, wenn ich das quotee, gehts nicht, bash magic, oh meine güde, no matches found,"}, {"id": 604, "start": 6342.24, "end": 6367.68, "text": "ah fuck, ok, easy, oh ne, ich hab nix gekillt, Moment, da ist noch ein quote, da, ne, ach"}, {"id": 605, "start": 6367.68, "end": 6382.84, "text": "du scheiße, bash hör auf, ok, jetzt aber, jawoll, es hat funktioniert, es hat funktioniert,"}, {"id": 606, "start": 6382.84, "end": 6400.12, "text": "version, doppelpunkt, ein, oh fuck, jetzt aber, version, kann man das hier wenigstens"}, {"id": 607, "start": 6400.12, "end": 6425.2, "text": "einzeln quoteen, jawoll, version, Punkt, so, ja, ja, ist schonmal gut, 1.0, ja, ja, das"}, {"id": 608, "start": 6425.2, "end": 6430.92, "text": "sieht auch schonmal gut aus, sehr gut, sehr gut, jetzt hinten noch einmal quotes dran,"}, {"id": 609, "start": 6430.92, "end": 6443.28, "text": "ah, yes, wunderbar, so, minus i, und guckt mal, und jetzt zählt er automatisch hoch,"}, {"id": 610, "start": 6443.28, "end": 6452.4, "text": "jedes mal wenn ich minus i mache, excellent bash, logik, guckt hier, guckt da, boom, zählt"}, {"id": 611, "start": 6452.4, "end": 6462.52, "text": "automatisch hoch, ich mein lesen, kanns keines sau, aber es funktioniert, so und jetzt jedes"}, {"id": 612, "start": 6462.52, "end": 6473.16, "text": "mal bevor ich in rsync mache, zähle ich die Datei eins hoch, so, easy, bump.sh, alles"}, {"id": 613, "start": 6473.16, "end": 6481.88, "text": "inline, rest ist alles bloated, so jetzt updaten wir schnell, noch, das sollte eigentlich,"}, {"id": 614, "start": 6481.88, "end": 6493.48, "text": "ob ich check for updates, ah ja, update, guter code muss auch lesbar sein, das gilt für"}, {"id": 615, "start": 6493.48, "end": 6515.36, "text": "alles außer bash, und c++, ja gut, das ist ja, ja, es funktioniert, Leute, es funktioniert,"}, {"id": 616, "start": 6515.36, "end": 6525.4, "text": "es läuft, jetzt muss ich noch die fake Dateien rüber kopieren im build, build action, copy,"}, {"id": 617, "start": 6525.4, "end": 6535.12, "text": "always, publish, publish, die Weihnachtsnups sind zurück, so und jetzt unser wahnsinnstolles,"}, {"id": 618, "start": 6535.12, "end": 6552.8, "text": "eigentlich bräuchten wir jetzt ein deploy.sh, wo das reinkommt, check for updates, update,"}, {"id": 619, "start": 6552.8, "end": 6557.52, "text": "pünktlich bei Version 20, bald überholen wir chrome, Leute, ich würde sagen, nächster"}, {"id": 620, "start": 6557.52, "end": 6569.64, "text": "Stream wird chrome überholt in den Versionstab an, ach, warte mal, es lief die ganze Zeit,"}, {"id": 621, "start": 6569.64, "end": 6587.48, "text": "noch, start, put non-fine file, warum nicht, ah, weil ich das nicht mitkopiere, ok, docker"}, {"id": 622, "start": 6587.48, "end": 6607.52, "text": "recursive, copy recursive, docker, macht es das standardmäßig, das ist, verzeih, ach,"}, {"id": 623, "start": 6607.52, "end": 6612.68, "text": "anscheinend kopiert er das einfach so, ok, ja, weil dann ist easy, dann kopieren wir"}, {"id": 624, "start": 6612.68, "end": 6627.24, "text": "dann nämlich einfach build, build nach build und sagen dann plubsh, braucht keiner mehr"}, {"id": 625, "start": 6627.24, "end": 6643.48, "text": "und sagen dann einfach chmod, minus, ist es klein oder großr, minus großr, siehste, slash"}, {"id": 626, "start": 6643.48, "end": 6649.24, "text": "build, genau, und im run machen wir dann einfach slash build slash viachamp und dann müsste"}, {"id": 627, "start": 6649.24, "end": 6670.0, "text": "es glaube ich besser funktionieren, run, zack, kommt homosys dann eigentlich mit pre-release"}, {"id": 628, "start": 6670.0, "end": 6683.64, "text": "und build, markers in der sem wäre klar, das ist eine gute frage, keine ahnung, ich kann"}, {"id": 629, "start": 6683.64, "end": 6690.72, "text": "es ausprobieren wenn du willst, sag mir mal was ich markern soll, sowas wie minus test"}, {"id": 630, "start": 6690.72, "end": 6703.6, "text": "oder irgendwas hinten dranhängen oder minus hash von git commit dranhängen oder was, restart,"}, {"id": 631, "start": 6703.6, "end": 6721.28, "text": "kann man ausprobieren, be not found, wie, warum not found, ah ich weiß warum not found,"}, {"id": 632, "start": 6721.28, "end": 6728.64, "text": "weil ich absolut 3 hat bin, ich muss nach build wechseln und dann den viachamp starten,"}, {"id": 633, "start": 6728.64, "end": 6732.56, "text": "anders funktioniert es natürlich nicht, ok dann hänge ich mal hinten was an die versionsnummer"}, {"id": 634, "start": 6732.56, "end": 6757.56, "text": "dran, zum ausprobieren, keckel, plus 4, das geht mal wieder weg, äh ne moment, versunken,"}, {"id": 635, "start": 6757.56, "end": 6781.88, "text": "ui, schauen wir mal ob es das checkt, ja wir updaten jetzt zu 1021 keckel plus 4, oh was,"}, {"id": 636, "start": 6781.88, "end": 6788.0, "text": "ich hab jetzt noch ein paar probleme damit, oder muss ich erst mal stopp sagen, vielleicht"}, {"id": 637, "start": 6788.0, "end": 6796.92, "text": "kommt da doch nicht klar damit, weil connection resetted ergibt ja wenig sinn, connection"}, {"id": 638, "start": 6796.92, "end": 6826.88, "text": "resetted, ne jetzt funktionierts, das kommt damit nicht klar,"}, {"id": 639, "start": 6826.88, "end": 6842.8, "text": "start, jetzt es läuft, es läuft, leute es funktioniert, es läuft, und sind unsere daten"}, {"id": 640, "start": 6842.8, "end": 6868.0, "text": "am start, schauen wir mal, settings, integrations, da ist es, und es gab messages um 9.51, jawoll"}, {"id": 641, "start": 6868.0, "end": 6873.08, "text": "hat funktioniert, so wir können es nochmal, ich kann nochmal gucken ob es wirklich funktioniert,"}, {"id": 642, "start": 6873.08, "end": 6879.84, "text": "alles, ich lösche das mal, das auto was ich vorher angelegt hab, so und jetzt, gucken"}, {"id": 643, "start": 6879.84, "end": 6886.28, "text": "wir mal hier mein dashboard mit dem auto, ist auch nix da, irgendwelche gründen ist"}, {"id": 644, "start": 6886.28, "end": 6900.8, "text": "mein standort noch da, ok, amsterdam, alles klar, alles klar, addon, restart, und dann"}, {"id": 645, "start": 6900.8, "end": 6915.28, "text": "sollte jetzt gleich, so jetzt sollte gleich hier, guckt, jawoll, addon funktioniert,"}, {"id": 646, "start": 6915.28, "end": 6945.04, "text": "ja, das funktioniert, jetzt kann man das addon tatsächlich sogar halbwegs schon verwenden,"}, {"id": 647, "start": 6945.04, "end": 6951.36, "text": "ich meine, man kann eine configuration angeben, man kann passwort und keine pin angeben, gibt"}, {"id": 648, "start": 6951.36, "end": 6957.72, "text": "es irgendwie die möglichkeit da hilfe dazu einzutragen, wie sieht denn das bei anderen,"}, {"id": 649, "start": 6957.72, "end": 6962.84, "text": "moment wie sieht denn das bei anderen addons aus, wie sieht es z.b. bei diesem ssh addon"}, {"id": 650, "start": 6962.84, "end": 6985.24, "text": "aus, so, configuration, ja da steht, guck mal da steht, hilfetext oben drüber, stimmt"}, {"id": 651, "start": 6985.24, "end": 6998.6, "text": "und wie macht man das mit den passwörtern, na gut, im klartext, wie kann man, wie kann"}, {"id": 652, "start": 6998.6, "end": 7007.04, "text": "man passwörter, das ist tatsächlich eine gute frage, wie kann man passwörter verstecken,"}, {"id": 653, "start": 7007.04, "end": 7013.28, "text": "welches addon, welches addon benutzt denn passwörter wo man sich das abgucken kann,"}, {"id": 654, "start": 7013.28, "end": 7031.36, "text": "ducktns fürs api token vielleicht, aha, alles klar, da können wir abgucken, da können wir"}, {"id": 655, "start": 7031.36, "end": 7052.28, "text": "abgucken, config.yml, also options, token, und woher weiß der jetzt, dass das, hä?"}, {"id": 656, "start": 6054.3, "end": 7076.4, "text": "also daran erkenne ich mal gar nichts, vielleicht weil es token heißt, meint ihr,"}, {"id": 657, "start": 7076.4, "end": 7089.4, "text": "das ist so magic, das ist so magic, das ist anhand des namens, das kann ich, das wäre"}, {"id": 658, "start": 7089.4, "end": 7106.08, "text": "bescheuert, aber was anderes ist es, was anderes, was anderes ist da nicht, oh Null, das war,"}, {"id": 659, "start": 6112.34, "end": 7145.2, "text": "ach guck mal hier, da kann man direkt Passwort angeben, ja, maybe it's reserved,"}, {"id": 660, "start": 7145.2, "end": 7159.04, "text": "I don't know, I don't think it's reserved keyword, it's, we try password, ich glaub"}, {"id": 661, "start": 7159.04, "end": 7163.76, "text": "nicht, dass das reserved ist, kann ich mir nicht vorstellen, guck mal, wir probieren"}, {"id": 662, "start": 7163.76, "end": 7177.28, "text": "einfach mal aus, Passwort da reinzuschreiben, so, und pin, der pin ist auf jeden fall auch"}, {"id": 663, "start": 7177.28, "end": 7189.72, "text": "ein Passwort, so, Achtung, seht magic, seht magic, Version hat hochgezählt, den krempel,"}, {"id": 664, "start": 7189.72, "end": 7219.24, "text": "den uninstall ich jetzt mal schnell wieder, check for updates, so, hat das jetzt geupdatet,"}, {"id": 665, "start": 7219.24, "end": 7235.96, "text": "aha, guck mal da, jetzt ist es, so ist das gut, save, restart, so ist das gut, so mag"}, {"id": 666, "start": 7235.96, "end": 7247.52, "text": "ich das, so, und es funktioniert, das Auto ist da, das Auto steht in Salzgitter, was"}, {"id": 667, "start": 7247.52, "end": 7260.64, "text": "ist das, nicht, oder nee, Moment, es steht nicht, es steht in, wo steht das Auto, im See,"}, {"id": 668, "start": 7260.64, "end": 7271.72, "text": "im Stadtparkteich, alles klar, das geht auch wenn man mehr als ein Auto hat, ja, das ist"}, {"id": 669, "start": 7271.72, "end": 7277.96, "text": "alles dynamisch anhand der Fahrzeug-ID und dem Index von deinem Auto, wobei nee, der"}, {"id": 670, "start": 7277.96, "end": 7283.36, "text": "Index, dynamisch anhand deiner Fahrzeug-ID, also wenn das zweite Auto erscheint würde"}, {"id": 671, "start": 7283.36, "end": 7298.04, "text": "dann einfach hier, Moment, Integrations, ja, ja, das Echo kommt noch aus, Integrations,"}, {"id": 672, "start": 7298.04, "end": 7306.48, "text": "dann würde einfach hier das zweite Auto stehen und wenn du dein Auto bei Fiat ein Nickname"}, {"id": 673, "start": 7306.48, "end": 7316.84, "text": "gegeben hast, dann steht sogar der richtige Name da, ok, machen wir das hier mal weg,"}, {"id": 674, "start": 7316.84, "end": 7329.04, "text": "das Debug von diesem ganzen Kramus raus, im Programm, da wo ich Route eingetragen habe,"}, {"id": 675, "start": 7329.04, "end": 7339.2, "text": "wollte ich eigentlich K eintragen, weil das viel besser passt, so, jetzt müsste das eigentlich,"}, {"id": 676, "start": 7339.2, "end": 7344.92, "text": "ich pusht das jetzt einfach mal auf GitHub, falls irgendjemand Bock hat daraus zu probieren,"}, {"id": 677, "start": 7344.92, "end": 7350.88, "text": "wie gesagt, das geht noch nicht alles, also die Commands, die gehen noch ins Leere, wobei"}, {"id": 678, "start": 7350.88, "end": 7354.44, "text": "ich pusht, ich pusht für den nächsten Stream, ich bin mir nicht ganz sicher, ob ich denn"}, {"id": 679, "start": 7354.44, "end": 7368.84, "text": "noch irgendwas machen muss, ich müsste ja auch noch ein Addon Repo machen und ne, lass"}, {"id": 680, "start": 7368.84, "end": 7375.12, "text": "mal ausprobieren, so, was, was, müssen wir noch irgendwas machen für heute, ne, wir haben"}, {"id": 681, "start": 7375.12, "end": 7380.52, "text": "den Kram, kann ich das Auto auch downloaden, genauso wie Ram, der Karlsson, danke schön"}, {"id": 682, "start": 7380.52, "end": 7396.92, "text": "für den Sub, ich mein, das kann man, das ist bestimmt nicht der Weisheitsletzter Schluss"}, {"id": 683, "start": 7396.92, "end": 7410.2, "text": "hier das so zu machen, Max, danke schön für den Sub, aber das ist schon okay so, das ist"}, {"id": 684, "start": 7410.2, "end": 7416.52, "text": "tatsächlich mal was schönes, schönes Anwendungsbeispiel für Containerkrempel hier, wir müssen übrigens"}, {"id": 685, "start": 7416.52, "end": 7432.32, "text": "dann das nächste Mal noch gucken, wir brauchen ja Builds für x86, Raspberry Pi, das muss"}, {"id": 686, "start": 7432.32, "end": 7438.76, "text": "dann quasi anders heißen, also ich muss das dann, ich muss das dann unterschiedlich irgendwie"}, {"id": 687, "start": 7438.76, "end": 7452.36, "text": "kopieren, mal gucken, wie wir das machen, wie man das unterscheidet, weil wir brauchen"}, {"id": 688, "start": 7452.36, "end": 7466.32, "text": "ja dann andere Dateien, die kopiert werden, je nach Plattform, okay, Git, Status, das"}, {"id": 689, "start": 7466.32, "end": 7487.76, "text": "brauchen wir nicht mehr, ja, Commit, A-M, Postchamp, beste, so muss das heißen, das"}, {"id": 690, "start": 7487.76, "end": 7497.36, "text": "passt alles, ja, dann würde ich sagen, das pushen wir dann das nächste Mal, aber das"}, {"id": 691, "start": 7497.36, "end": 7501.96, "text": "funktioniert ja schon mal, wir haben hier ein Auto angelegt, wo alles drinne ist, inklusive"}, {"id": 692, "start": 7501.96, "end": 7512.48, "text": "Buttons, Kilometerstand und sonst was, also da fehlt nicht mal viel, dann kann ich das"}, {"id": 693, "start": 7512.48, "end": 7518.0, "text": "auf Github pushen und die Leute können sich freuen, dass es dann auch ein Fiat Addon gibt"}, {"id": 694, "start": 7518.0, "end": 7525.28, "text": "für Home Assistant und das Schöne ist, man muss eigentlich außer seiner ID und dem Pin,"}, {"id": 695, "start": 7525.28, "end": 7534.24, "text": "also man muss eigentlich nur das hier eintragen, alles andere macht der Autodiscovery, Autodiscovery,"}, {"id": 696, "start": 7534.24, "end": 7538.36, "text": "hat jemand schon mal Docker Files gebaut, die irgendwie unabhängig von der, abhängig"}, {"id": 697, "start": 7538.36, "end": 7556.28, "text": "von der Architektur sind, also kann man das im Docker, fragt man das, das habe ich noch"}, {"id": 698, "start": 7556.28, "end": 7567.12, "text": "nie gemacht, fragt man das im Docker File irgendwie ab, ne ich suche auf jeden Fall"}, {"id": 699, "start": 7567.12, "end": 7577.56, "text": "nach irgendwas, was in Home Assistant am Ende auch funktioniert, weil Home Assistant bildet"}, {"id": 700, "start": 7577.56, "end": 7594.24, "text": "das Ding ja anscheinend, ja, das muss ich mir mal überlegen, das machen wir erstmal"}, {"id": 701, "start": 7594.24, "end": 7601.52, "text": "aus, weil jetzt ist, die Musik passt wunderbar, es ist Bad-Git-Time, nächsten, einen Stream"}, {"id": 702, "start": 7601.52, "end": 7606.88, "text": "brauchen wir noch dafür würde ich sagen, dann kommt es auf Github und gut ist, hat"}, {"id": 703, "start": 7606.88, "end": 7611.68, "text": "jemand von euch einen Fiat oder einen Jeep oder irgendwas mit Uconnect, der das mal ausprobieren"}, {"id": 704, "start": 7611.68, "end": 7624.84, "text": "will, nächstes mal, ich habe hier einen Gitwerk-Workflow von mir, zeigt mal her, aha, ein Yimmelschreiber,"}, {"id": 705, "start": 7624.84, "end": 7654.28, "text": "Docker Image, aha, aber wie unterscheidest du das im Docker File?"}, {"id": 706, "start": 7654.28, "end": 7666.24, "text": "Kannst du das im Docker File irgendwie unterscheiden, weil ich muss ja im Docker File je nach Version"}, {"id": 707, "start": 7666.24, "end": 7679.52, "text": "anderes Zeug kopieren, oder aber, oder aber noch besser, wir machen das.NET Build auch"}, {"id": 708, "start": 7679.52, "end": 7697.68, "text": "direkt im Docker Container, bei, das ist eigentlich auch blöd, das Binary da drin zu bilden, nee,"}, {"id": 709, "start": 7697.68, "end": 7723.4, "text": "ich gehe jetzt auf, Dollar Bild Plattform, ja genau, so was brauche ich, ja genau, das"}, {"id": 710, "start": 7723.4, "end": 7729.2, "text": "brauche ich, Dollar Bild Plattform, das muss ich mir jetzt noch da reinschreiben, weil"}, {"id": 711, "start": 7729.2, "end": 7754.28, "text": "sonst weiß ich das bis zum nächsten Stream nicht mehr, Dollar Bild Plattform, ja also"}, {"id": 712, "start": 7754.28, "end": 7763.96, "text": "quasi, ja jetzt muss ich hier gucken, das ist alles okay, so und jetzt muss ich dann"}, {"id": 713, "start": 7763.96, "end": 7785.08, "text": "quasi hier gucken, nee Dollar Bild Plattform, kann man Bash Style, Bash Style If machen irgendwie,"}, {"id": 714, "start": 7785.08, "end": 7803.24, "text": "geht so was, geht so was, keine Ahnung, das probiere ich jetzt nicht, das probiere ich"}, {"id": 715, "start": 7803.24, "end": 7823.8, "text": "jetzt nicht aus, das geht nicht, ah, dann gucken wir uns das das nächste Mal an, hier"}, {"id": 716, "start": 7823.8, "end": 7838.16, "text": "so weiter machen, ja weil dann kann ich das kopieren, unabhängig, also abhängig davon,"}, {"id": 717, "start": 7838.16, "end": 7843.8, "text": "weil von der Idee her ich würde dann halt sowas machen, ich würde dann halt sowas machen"}, {"id": 718, "start": 7843.8, "end": 7855.76, "text": "hier, Bild und dann hier halt das, keine Ahnung, irgendwie das da, Linux, so irgendwie so und"}, {"id": 719, "start": 7855.76, "end": 7868.68, "text": "dann dahin kopieren, so und dann das andere machen und dann irgendwie sowas wie, ich weiß"}, {"id": 720, "start": 7868.68, "end": 7879.32, "text": "halt nicht ob das funktioniert, ja irgendwie sowas in der Richtung, da muss ich mal schlau"}, {"id": 721, "start": 7879.32, "end": 7884.24, "text": "machen wie das funktioniert, keine Ahnung, alles klar, so Leute jetzt aber wirklich Schluss,"}, {"id": 722, "start": 7884.24, "end": 7892.04, "text": "warum nicht im Container bauen, muss ich da dort nicht im Container installieren, das"}, {"id": 723, "start": 7892.04, "end": 7906.48, "text": "macht so eine unnötig groß und dann selbst, selbst brauche ich, dann brauche ich ja auch"}, {"id": 724, "start": 7906.48, "end": 7916.2, "text": "das richtige Argument für das Bild im Container, ich muss ne angeben was ich kompilieren will"}, {"id": 725, "start": 7916.2, "end": 7932.24, "text": "bei.NET für welche Zielplattform, kannst du das fertige Bild nicht, nee kann ich nicht,"}, {"id": 726, "start": 7932.24, "end": 7937.56, "text": "weil soweit ich verstanden hab, macht den Bild der Home Assistant oder, oder ist das"}, {"id": 727, "start": 7937.56, "end": 7941.08, "text": "jetzt nur in meinem Fall so, weil es ein lokales Addon ist und normalerweise zieht das sich"}, {"id": 728, "start": 7941.08, "end": 7945.56, "text": "das aus irgendeiner Registrie, egal probier es nächstes Mal aus, bis dann machts gut"}, {"id": 729, "start": 7945.56, "end": 7946.06, "text": "tschüss, tschüss."}]}