{"text": "Gucken wir mal, ob es wieder funktioniert. Ey ey ey, funktioniert wieder. Mal gucken, wie lange es funktioniert, irgendeiner sitzt jetzt bei sich daheim vorm Rechner und fühlt sich wie der krasseste Ärger und grubbelt sich ein, keine Ahnung, wird wahrscheinlich gleich wieder weg sein, denke ich mal. Ich werde mal Vodafone anrufen, ich mache es nächstes Mal halt über einen VPN, ich mache es nächstes Mal über einen VPN und schreibe Vodafone, ich habe ja schon eine direkte, ich kann ja schon Vodafone direkt anschreiben mittlerweile für sowas, dass ich eine neue IP brauche, dass ich irgendjemanden nicht lassen kann. Joa, ich meine, dann mache ich es nächstes Mal über einen VPN. Wer macht sowas? Keine Ahnung, jemand der geiler Hacker-Man sein will, ich weiß es nicht. Das willst du machen, es gibt genug Leute. Russen-Dedosa, nee, es ist irgendeiner aus dem Chat, irgendeiner aus dem Chat ist es Leute. Ich mache es nächstes Mal über einen VPN, ich habe jetzt eigentlich gedacht, das ist kein Ding, Leute wollen ja zugucken und haben keinen Bock dran, irgendwas kaputt zu machen, wie kriegt man die IP so schnell raus, naja, ich habe es ja oft genug gezeigt. Ich habe jetzt nicht gedacht, dass irgendjemand drauf anlegt, aber gut, ich meine schwierig ist es nett. Ich schreibe Vodafone mal an, dass sie das gleich verwechseln sollen. Kann sein, ich weiß es nicht, ich schreibe Vodafone an, ich habe ja mittlerweile schon Vodafone direkt in Vodafone-Kontakt für sowas, also direkt, was heißt direkt in Kontakt, wo halt drauf reagiert wird, das ist halt das geile, dass du es brauchst, aber gut, das war nämlich eindeutig keine Vodafone, nee, das war kein Vodafone-Problem, da können die nichts für, das war eindeutig Tests, ob es die richtige IP ist, das war der erste kleine Lack, und als derjenige gemerkt hat, erster kleiner Lack, okay, ist ruckelt, dann wusste er, jetzt lohnt es sich Geld auszugeben für ein paar Bots, weil du willst ja erstmal testen, ob es geht, bevor du Geld ausgibst, deswegen testest du erstmal kurz, und wenn du siehst, dass es das richtige ist, auf welche Art und Weise, dann gibst du ein bisschen Geld aus, es ist ja nicht mal so richtig teuer. Das kommt drauf an, das kommt drauf an, ob du DSL hast oder nicht, WireGuard-Tutorial, ja, könnte man machen, also ich, wie gesagt, also ich mach mir halt fürs nächste Mal solcher Tutorial an VPN, wenigstens mal eine der sinnvollen Anwendungsgebiete von einem VPN, und nein, ich nehme nicht Nord- oder Express-VPN oder sowas dafür, ich mach mir selbst irgendwo eine Kiste, installiere wahrscheinlich wirklich WireGuard drauf und gut ist, weil dann liege ich im schlimmsten Fall einfach nur noch die IP vom VPN und die kann ich dann schnell wechseln. Wenn du sowas machst, du kommst nicht umhin, irgendwie mal deine IP zu leaken, sei es irgendwelche Login-Proms oder irgendwas, du willst das immer mal irgendwie liegen, wie gesagt, ich hätte nicht gedacht, dass manche Leute aus dem Chat so geil drauf sind, damit jetzt was zu machen, aber, das, ja, es gibt halt immer welche, die können es da nicht lassen, das tönt mich jetzt auch nicht so großartig, wenn man dafür eine Geld ausgibt, meinetwegen, jawoll, und dann in Briefumschlag oder was, ey, ich werde mir schon was überlegen, ich werde mir schon was überlegen. Fällt mir bestimmt was zu ein, der Aktuell ist nix weg, tatsächlich brühe ich ja gut was sonst, war das nicht so, dass man kein Bargeld verschieben, dass man kein Bargeld verschicken kann oder ist das nur nicht versichert, irgendwie sowas, ja, das ist jetzt übrigens neu, das ist neu, du kannst jetzt bei, wenn du einen Server anlegst bei Hetzner, kannst du jetzt Applications machen, da kriegst du Sachen vorinstalliert, wie sinnvoll das ist, sei mal dahingestellt, hab da, weiß nicht, also ich würde den Kram ehrlich gesagt lieber von Hand installieren, und gerade sowas wie Nextcloud direkt im Internet haben, weiß ich nicht, wie viel sinnvoll ich das halte, oder gerade ein Wordpress oder sowas, ne, also da würde ich den Kram lieber selbst installieren und genau nur das, was ich haben will, aber klar, kann man natürlich machen, kann man natürlich machen, was cool wäre, wenn man selbst hier irgendwelche Setups, Sachen hinterlegen kann, wo ich dann auch, wo ich quasi selbst irgendwie einen Skript hinterlegen könnte, was nach Aufbau läuft oder so, wobei ich da im Prinzip im Webinterface nichts brauche, das kann ich selbst mit irgendeinem Ansible Playbook machen und dann füge ich das aus auf die neue RP und es ist gut, ähm, nicht unbedingt, also, ne, ich glaube du kannst keine eigenen Isos verwenden, aber wir können mal gucken, es gibt Möglichkeiten, und zwar, also spätestens Netboot, mit Netboot kannst du alles machen, also, was geht ist, Iso-Images, genau, also du kannst, du kannst kein eigenes Iso hochladen, das geht glaube ich nicht, aber du kannst Netboot verwenden, weiß gar nicht, ob die schon drinnen haben, du kannst Netboot verwenden, das haben wir sogar schon mal in einem Stream gemacht, das war ein bisschen trickreich, du musstest Netboot, äh, erst mal, musstest, musstest dein Bootloader mit Netboot überschreiben, dass du beim nächsten Boot, äh, Netboot verwenden kannst und dann erzählen kannst, was du willst, ich glaube, man kann kein, kann, ja, kein eigenes Disk Image hochladen, aber wie gesagt, man kann, man kann über Umwege Netboot verwenden, und wenn man Netboot verwenden kann, kann man alles installieren, was man will, das haben wir mal in einem Stream gemacht, ich weiß es aber gar nicht mehr, wie es jetzt ging, oh guck mal, du kannst russischen Kokona, äh, nicht Kokona, Kokona Server, russischen Winner Server kannst du installieren, Poggers, es ist aber fast alles drauf, Hales ist es sowas, das auch, ne, Rally Deluxe, das ist alles mögliche fast da, aber ich glaube, eigene Isos hochladen kannst du nicht, und ich glaube, es geht auch nicht im, in der Konsole, gehts glaub ich auch nicht, ne, aber man kann es über Netboot Umwege machen, aber das meiste haben die drinnen, erst mal, stimmt genau, das ist das, was wir gemacht haben, erst mal Full Disk Engel, das haben wir gemacht, genau, das war tatsächlich schwieriger, als man denkt, ja, kannst du, so haben wir es auch gemacht, wir haben Netboot, ich glaube, wir haben den Bootloader mit Netboot überschrieben, gebootet und dann, äh, darüber, irgendwas anderes installiert, ähm, ja, ich weiß gar nicht, ob es sich lohnt, jetzt weiter zu machen, ich, ich, ich werde mal einen VPN installieren, dass ich so Streams machen kann, ich mache in Zukunft ab und zu mal so eine Sponsoring-Geschichte und da werde ich mich sicherlich mal auf so einem Server einloggen müssen, übrigens, ich habe mir das überlegt, ich wollte jetzt eigentlich mal so zum Start, so ein bisschen, ein bisschen, äh, gucken, was geht, es ist sehr laut technisch, ich habe nicht vor, wenn wir, wenn wir Streams in der Richtung machen, äh, das quasi immer so eng zu verzahnen hier und dann auch rumzuklicken, sondern ich nehme einfach was, was thematisch passt, zum Beispiel, können wir an der Web-Anwendung weiter programmieren, lassen wir das irgendwo hosten, also ich werde jetzt nicht in jedem Stream, das hätte es in der Web-Interface oder so zeigen, aber ich habe mir gedacht, für den ersten Stream können wir noch mal was Cooles machen, leider, habe ich nicht mit gerechnet, dass es manche Leute halt, äh, dann drauf anlegen, dass es nicht funktioniert. Hat dein Internet-Auge gemacht? Ne, das Internet, der war das kleinste Problem, ich weiß es gar nicht mehr, was das war, warum kann man eigentlich nicht Manjaro als Server-OS verwenden, doch, doch das kann man, das kann man schon machen, das ist, äh, das geht, das geht, das geht, aber Manjaro ist vielleicht da nicht so wahnsinnig gut geeignet für, sag mal, du kannst das machen, aber sag mal, der Vorteil von Manjaro ist ja, dass du top aktuelle Software hast, so richtig top aktuelle Software, die willst du eigentlich auf dem Server gar nicht haben, du willst irgendwas haben, was stabil ist, was läuft, was auch mit Patches versorgt wird, was, also von einem Anbieter mit Patches versorgt wird, also von irgendeiner Distribution mit Patches versorgt wird, äh, bei Manjaro musst du ja vieles aus dem User-Repo installieren und das User-Repo, da musst du dich selbst drum kümmern und die Quellen sind auch nicht unbedingt die vertrauenswürdigsten unbedingt, äh, dazu kommt, dass es in Rolling-Release ist, also du musst quasi permanent updaten, du hast nicht so eine LTS-Geschichte wie 5 Jahre lang kannst du dich darauf verlassen, dass es funktioniert, du kannst ohne Probleme einen Manjaro-Linux als Server-OS verwenden, das ist kein Ding, das ist, also technisch ist das kein Ding, das funktioniert, es gibt nur ein paar Sachen, die es nicht so, nicht so angenehm machen. Ja, du hast beispielsweise bei Ubuntu auch relativ viel vorkonfiguriert, du hast beispielsweise, äh, sinnvolle SSH-Config, du kannst einen Docker installieren, hast es sinnvoll vorkonfiguriert und so, das ist für den Anwendungszweck einfach angenehmer, du kannst alles für alles verwenden normalerweise. Ja, genau, ja, es ist nicht so schlimm, man, was willst du machen, gibt's Leute, die können's nicht lassen. Das mach ich je nachdem, ob ich hessisch rede oder nicht, das, das schwankt, das schwankt im Stream, aber wenn ich, aber, aber das ist, es ist blöd, dass es dich auslöst, ja, auslösen ist immer nicht gut, aber es gibt auch genug Sachen, die im Chat geschrieben werden, die mich auslösen, mach dir keine Gedanken, also, das kommt auch oft genug vor. Es vergeht kein Stream, wo mich nicht irgendwas auslöst, ich bin übrigens dieses, ich find das eigentlich übelst geil, das auf Deutsch zu schreiben. Auslösen triggert mich, ja, also, das muss, das muss man echt sagen, die Preise sind echt nicht übel, wenn man's vergleicht mit Azure oder Amazon oder, oder auch Google, Google Cloud, äh, Gedöns, denn, wenn ihr hier in Server, ich sag übrigens nicht Nen, ich sag Nen-Server, Nen finde ich auch doof, ich sag Nen-Server, oder Ein-Server, Nen-Server, ähm, wenn ihr hier in Server mietest, ist das halt, also, es geht ja schon mal ab Reisen los, dafür steht Microsoft, Amazon oder Google erst gar nicht auf. Dazu kommt, wenn du Storage brauchst, ist das fucking teuer, gerade in Azure, in Azure bezahlst du, guck mal hier, 10TB bezahlst du hier SSD, äh, 500€ im Monat, wenn du mal den Azure-Rechner nimmst, dann ist das richtig teuer, ja, Hetzner Domains hab ich noch nie gekauft. So, virtueller Computer, alter Azure, komm, gib alles, nein, ich will nicht mit eurem Vertriebsteam chatten. Manage Disk, SSD, noch mal SSD Standard, so, ja, gibts, gibts, gibts nicht, gibts nicht so wirklich, äh, dreimal, einmal, ne, das sind 1200, äh, also, es, es nimmt sich für eine einzelne SSD, tatsächlich wirds gar nicht mal so viel, hä, das ist halt billiger, sag mal so, hier hast du 10T, hier hast du jetzt 16T für die Hälfte, sag mal mal so, es ist ein bisschen billiger, aber man muss halt sagen, was bei Azure beliebt ist, die Leute nehmen meistens Premium-SSDs, und da wirds richtig teuer. Äh, das ist schon mal 1500, also Preis-Leistungs-mäßig ist das bei Hetzner halt wirklich nice, Storage ist nice und die Server-Preise sind auch nice, ohne fad, kann sein, das ist Ami, Ami-Calculator, das ist so nur zum überschlagen, aber Preis-Leistungstechnisch ist das wirklich nice, und denkt dran, das ist das, was ich hier am Anfang zeigen wollte, am besten ist, ihr legt den Server wirklich an, mit der kleinsten, mit der kleinsten Stufe, dann bekommt ihr 20GB SSDs quasi dabei, und wenn ihr mehr Speicher wollt, machts hier drüber, das wird dann zusätzlich dran, das, das, das erscheint dann als, als Zusatz-Zusatz-Mountpunkt, so, dann nimmst du 100GB für 4,76 im Monat, dann hast du nicht das Problem, dass du nicht ordentlich die Server hoch und runter skalieren kannst, von einem Kern auf 16 Kerne hin und zurück, sondern es funktioniert dann einfach, was hat der überhaupt für Schmerz, ich lösche den Kram mal, CacWade 2 muss weg, und CacWade 1 muss auch weg, ja, und Leute, wer das Ganze mal ausprobieren will, Ausrufezeichen Hetzner, bei mir in Chat, und einfach mal sich hier den Link angucken, da kommt ihr nämlich direkt raus, da das, was ich auch zeige, nur, dass es ein Ref-Link ist von mir, und wenn ihr euch registriert, anmeldet mit meinem Code MAX21, also mit 4, M4X21, ja, dann kriegt ihr 20€ Startguthaben für Neukundin, wohlgemerkt nur für Neukunden, wenn ihr da schon einen Account habt, dann nicht, ich hab mir sagen lassen, man kann sich einen zweiten Account anlegen und trotzdem die 20€ abgreifen, aber, da sind sie glaube ich nicht so scharf drauf, aber ich hab gehört, das geht, ja also wer das mal ausprobieren will, kann ich nur empfehlen, es hat sich letztens einer beschwert bei mir in den Kommentaren auf YouTube, so nach dem Motto, wie kann man so einen KacWad oder so, Scheißanbieter und sonst was, und dann kam raus, er hat nicht bezahlt und die hätten jetzt seine Server ausgeschaltet, und da hab ich mir auch gedacht, ja ok, wenn man nicht bezahlt, dann, da kann ich auch nichts für, wenn er nicht bezahlt, also ich kann es nachvollziehen, dass wenn man sonst kein Geld ausgibt, sondern nur den Gutschein verwendet und dann, weil keine Ahnung, 14 Tage drüber ist, dass dann halt mal die Server ausgeschaltet werden, das würde ich an der Stelle wahrscheinlich auch so machen, er hat sich voll aufgeregt in den Kommentaren, ich sag es euch, aber es ist halt so, wenn man es nicht bezahlt, kann ich dir noch nicht übel nehmen, was ich übrigens auch witzig fand im letzten Video, das muss ich jetzt gerade nochmal zeigen, ich vermute mal, großartige Technik Sachen muss ich heute nicht mehr anfangen, sonst gibt es gleich wieder irgendwelche DOS Leute, wie gesagt, nächsten Stream mach ich einfach über VPN, dann haben wir das Problem nicht, was ich lustig fand im letzten Video auf YouTube, ihr fandet so den Battlefield Trailer richtig nice, Portal ist auch richtig nice, leider, ich hätte mir von Portal, also das neue Battlefield Portal hätte ich mir ein bisschen mehr erwartet, ich hab gehofft, es ist ein Level Editor, ist es nicht, es ist bloß ein Spielmodus Editor, so warte mal, das müsst ihr euch mal auf der Zunge zergehen lassen, die Leute hier in den Kommentaren im letzten Video, also, es gibt einmal den Typ, der sich darüber beschwert, dass ich zu, Moment, ich zeige euch den, das sind mir übrigens auch die liebsten Kommentare, die liebsten Kommentierer, du bist nicht richtig informiert genug, 60% was du sagst ist falsch, ja gut, aber was denn konkret, also was ist denn genau falsch, das, ja, das löst mich auch immer aus, so Kommentare, das löst mich immer richtig aus, so nach dem Motto, ha, ne, Max leider nicht richtig, alles falsch, aber nicht mal ein Beispiel, was jetzt nicht richtig ist und manchmal, ich antworte da manchmal drauf, so nach dem Motto, ihr sagt doch mal, was ist denn nicht richtig, und da kommt dann als Antwort, ja, bei Minute 4.31 sagst du, die Farbe vom Schild ist blau, in Wirklichkeit ist sie lila, so solche Antworten kommen da manchmal, wo ich mir denk, ja okay, du hast dir jetzt aus 11 Minuten Video eine Sache rausgeguckt, die vielleicht nicht die Interpretationsfrage ist, also, so Kommentare, die lösen mich immer aus, ja, aber der andere ist, warte, wo sind denn die Kommentare, die ich total widersprüchlich fand, wartet mal, wartet mal, wo ist es denn, die waren total widersprüchlich, genau, genau, erst kommt er, erst kommt er hier, sorry, bla, bla, bla, du hast, also er beschwert sich jetzt hier im Endeffekt, dass ich nicht genug, dass ich nicht genug positive sage, er sagt, du hast auch die positiven Seiten des Spiels erwähnt, aber wirklich nur so nebenbei, also ihm war das Video nicht positiv genug, so, halten wir das mal fest, das Video ist nicht positiv genug, so, jetzt kommt der nächste, der sagt, es ist nicht, es ist nicht negativ genug, was denn jetzt, ist das jetzt, ist das jetzt jetzt zu positiv das Video oder ist es zu negativ, was ist es denn jetzt, da, da, da clique ich nicht mal durch, ja, und da sieht man mal, dass es total subjektiv ist im Endeffekt, was die Leute da empfinden, wenn man was sagt, aber die denken immer, das ist so die ultimative Sichtweise, man kann das gar nicht anders sehen, aber du siehst ja halt, der eine sagt, das ist nicht positiv genug, der andere sagt, das ist nicht negativ genug, was ist das denn jetzt? Pogativ ist es. Leute, ich werde für heute Schluss machen, es hat keinen Sinn, das weiterzumachen, sonst gibt es wieder irgendwelche DDoS Action, ich mache das nächste Stream über VPN, wie gesagt ich streame nicht über VPN, ich werde dann meine, hier, admin Geschichten und Vorstellgeschichten über VPN machen, da kann ich im schlimmsten Fall die VPN IP leaken und die können bei DDoS ein bisschen lustig sein, da hole ich mir eine neue. Ja, richtig weird champ at DDoSer, Alter. Weird, weird champ. Kannst ja die IP ausblenden, so einfach ist das nicht, guck mal, zum Beispiel, wenn du dich einloggst in Ubuntu, dann hast du standardmäßig den Login-Skript, wo drinne steht, letzter Login von, wie soll ich das ausblenden, gescheit? Da kannst du nichts großartiges dagegen machen. Zockst du noch ein bisschen? Kennt jemand, oder hat jemand gespielt? Lohnt sich das? Ich finde den zweiten Teil fand ich mega nice und ich habe jetzt gesehen, nachdem das war ein Jahr Stadia-Exklusiv, das kam jetzt vor zwei Tagen auf Steam raus, hat das jemand schon ausprobiert, ob der dritte Teil was taugt? Guck mal grad mal Steam, also der zweite Teil war richtig cool, das lässt sich deaktivieren, ja, aber Chat, das bringt doch alles nichts, ich muss mich doch initial mal einloggen, um das zu deaktivieren, es gibt sicherlich viele Stellen, wo man das deaktivieren kann, aber ich kann auch nicht im Voraus, wenn ich sowas mache, alle Stellen wissen, wo das eventuell mal auftauchen könnte. Ja, das ist, ich mach das über ein VPN das nächste Mal, easy, kein Problem und dann kann nichts mehr passieren. Da machts kurz Bills weg, ja, Leute, ich glaube ihr denkt, dass ich da zu viel fähig bin, ja, ich bin zwar durch die ganzen Prime-Subs mittlerweile auch hier IQ+++, genauso wie der Chat, aber ich kann nicht zwei Stunden im Voraus planen, an welcher Stelle eventuell mal meine IP auftauchen könnte oder nicht, wie soll ich das machen, ne, dann weiche ich einmal von dem ab, was ich mir vorgestellt habe, weil einer im Chat was fragt und dann zeige ich wieder, was, ne, ne, das funktioniert nicht, ich mach das einfach über ein VPN das nächste Mal. Fertig, AI-IP-Erkennung ausplanten, das wäre nochmal was, das wäre nochmal was, dann muss ich 48 FPS die Sekunde, Full HD, Bilderkennung machen, da brauch ich noch einen zweiten Rechner, der nur Bilderkennung macht. Einfach 10 Sekunden Stream Delay, ja gut und dann mit Stream ausmachen, da mach ich ja permanent den Stream an und aus, welchen VPN nutzt du, ich würde mir irgendwo einen Server hinstellen und einen WireGuard selbst drauf installieren, dann ist easy die IP zu wechseln, dann ist easy die IP zu wechseln, das ist übrigens auch ein cooles Feature bei Hetzer, das kann ich euch nochmal schnell zeigen, wenn ihr einen Server anlegt, ihr könnt sowas wie Floating, Floating-IPs nehmen, dann nimmst du irgendeine x-beliebige IP, kriegste, so keine Ahnung, extern nennen wir die jetzt mal, da kriegste eine IP und die kannst du an jeden Server dranhängen, wo du willst, also stellt euch mal vor, ihr habt jetzt, ihr wollt einen Server umziehen mit einer Webseite drauf, von einem aufs andere System und ihr stellt es einfach so ein, dass die Domain auf diese IP auflöst und ihr könnt dann die IP von Server zu Server umziehen, also die ist nicht gebunden an ein System und dementsprechend kann man auch einfach schnell neue ausstellen und da drüber, wenn ich da einen WireGuard VPN nehme, dann ist das easy, dann kann ich innerhalb von 2 Sekunden die IP wechseln. Warum du hier andauernd reinguckst, weiß ich auch nicht, zumal ich ja heute nichts mal großartig machen kann, weil den ausstellst. Nochmal zuerst, mir hat Unchained sehr viel Spaß, was ist denn Unchained, Unchained Tower Defense, zeigt mal her, was Tower Defense, what the fuck ist das, das kenne ich gar nicht, aber, aber, warum, warum, warum ist das der dritte Teil und jetzt ist der dritte Teil rausgekommen. Was haben die denn für, was haben die denn für Bewertung, zeigt mal schnell, mostly positive, warum ist das nur mostly positive, bisschen new world, nee ich hab jetzt keinen Bock drauf, weil this game is fun, ok, sieht auch ganz gut aus, ok, was auch immer, ist Battlefield 1 der erste Battlefield Teil, natürlich, sonst wird er doch nicht 1 heißen, so offensichtlich, obvius Leute, eigentlich ne gute Idee, ich geh einfach überall P46, ey das ist wahrscheinlich echt die beste Idee, ich geh einfach überall P46, das ist wirklich ne gute Idee, das ist wirklich ne gute Idee, na gut Leute, wenn wir gerade dabei sind, einmal noch hier eine Runde Sellout, wir haben das gefallen, hatten vielleicht auch mal sich ein bisschen ausprobieren will, wie gesagt, denkt dran, Server, die nicht im Internet sind, haben erstmal kein Problem, das heißt, wenn ihr nicht den Server ins Internet stellen müsst, dann stellt kein Server ins Internet, aber wenn ihr einen Anwendungszweck dafür habt, wie zum Beispiel Minecraft Server für euch und eure Freunde, dann könnt ihr ja mal bei meinem Hetzer Link vorbeigucken, mit 20€ Startgut haben, könnt ihr schon die ersten 3 Monate nen halbwegs gescheiten Server betreiben, ohne dass ihr was dafür bezahlen müsst, geht ja relativ, geht ja bei relativ kleinem Geld los hier, kauft ihr euch so ne Dual Core Kiste oder vielleicht nen Triple Core, habt ja fast für 3 Monate das Geld und könnt 3 Monate spielen und für kleinen Minecraft Server reicht das auf alle Fälle, genau und denkt dran beim Registrieren mein Code verwenden, sonst gibt es keine 20€ von spät, ja ich mach jetzt Schluss, ich hab keinen Bock jetzt weiter zu machen mit Technik Sachen, weil sonst kommt wieder DDoS Getöntes, ich mach das nächsten Stream, also vielleicht nicht jetzt den nächsten herauffolgenden Stream, sondern einen der nächsten Streams, mach ich dann weiter mit Linux Einsteiger Geschichten, weil wir haben ja noch gar nicht so richtig angefangen, ich hab vielleicht 20% von dem gemacht, was ich mir aufgeschrieben hab, individuell RAM hochdrehen, ich glaube RAM hochdrehen kannst, das hab ich noch nie ausprobiert, probieren wir mal, ich glaube aber nicht, dass das geht, wann streamst du wieder, morgen, morgen früh, Aufwachstream, ich glaube individuell RAM hochdrehen geht tatsächlich nicht, es geht nur Storage zusätzlich dranhängen, Video, diesen Stream laden, ne die lad ich nicht auf YouTube hoch, ich glaube RAM kann man zusätzlich nicht reinhängen, das funktioniert nicht, ne du kannst bloß, du kannst bloß Speicher dranhängen, man kann das übrigens bis 10TB machen, aber das geht nur mit einem Count, wo man sich den Speicher halt anlocken lassen, weil kann ich verstehen, die gehen davon aus, dass das standardmäßig erstmal keiner braucht, und wenn, dann hat er einen guten Grund für SSD Swap, ja das kannst du machen, aber extra RAM, extra RAM geht nicht, wobei man sagen muss, die fetten Kisten haben auch tatsächlich ordentlich, ordentlich RAM, so ist es ja nicht, also die fetten Kisten haben ja hier bis 32G und die hier hat glaube ich sogar bis 128G, und da kommt der Vorteil von stundengenauer Abrechnung wieder ins Spiel, wenn du mal wirklich was hast, was einfach fette Performance braucht, 32K, 128GB RAM, da kannst du die Kiste dir anlegen, 4-5 Stunden berechnen lassen und du bezahlst 2,50€ und danach löschst du sie wieder und das war's, also du musst die kein, auch wenn hier monatlich dabei steht, du musst die nicht einen Monat behalten, hier nicht öffnen Leute, nicht öffnen. Kann man das per api skalieren, kannst du machen, du kannst per api skalieren und du kannst das komplette Zeug anlegen, hier per, ich zeig's dir mal, zack, kannst du anlegen per Kommandozeile, und also du kannst es per Kommandozeilen tool machen, die verwenden int terraform, hat ein Hetzner Cloud Plugin, ja geht auch, geht alles, also für einfache Sachen ist es für mich die perfekte Alternative zu Azure und Google und Amazon und sonstige Geschichten, also wenn man wirklich VMs braucht, über Ansible geht's auch, genau, also wenn man wirklich VMs braucht ist das für mich so der beste Anbieter, den wir haben in Deutschland, das ist auch der Grund warum ich diese Sponsoring-Geschichte hier gemacht hab, ich verwende den Kram ja selber schon, keine Ahnung, 5 Jahre oder so, ja, was jetzt, also ganz ehrlich, die einzige Sache die mir noch ein bisschen fehlt wäre eine Managed Datenbank, das fände ich cool, hätten die noch eine Managed Datenbank, aber vielleicht, ich mein man sieht ja, dass sie das ausbauen, die haben jetzt diese Firewall-Geschichte hier eingebaut, dass du dich nicht mehr selbst drum kümmern musst und sie fangen jetzt ja hier auch an, dass du verschiedene Base-Images, wo du das hier verschiedene Base-Images verwenden kannst oder wie auch immer sie es machen mit vorinstallierten Anwendungen, vielleicht, vielleicht gibt es ja nochmal eine Managed Postgres oder sowas in nächster Zeit, das gucken wir uns dann auf jeden Fall im Stream an, wenn das soweit sein sollte, ja achso und nochmal was zur Nextcloud, weil das jemand eben gefragt hat, ich hab ja gesagt es ist vielleicht keine so gute Idee Nextcloud direkt ins Internet zu stellen und da kam die Frage im Chat, ja was denn sonst, wenn ich Nextcloud oder was soll man denn sonst mit Nextcloud machen, wenn nicht ins Internet, hier, genau, was sprich denn gegen eine Nextcloud im Internet, ist das nicht Sinn der Sache, Sinn der Sache mit Nextcloud ist ja, ja erstmal für was du es verwendest, verwendest du es für File Sync, dann ist File Sync der Sinn, Kalender Sync, sonst was, aber es ist nicht unbedingt der Sinn, es ins Internet zu packen, wichtig ist, dass deine Geräte drankommen zu dem Zeitpunkt, wo du es brauchst, also wenn es dir reicht, wenn du heim kommst im WLAN bist, dein Kalender einmal am Tag zu Syncen, dann musst du das nicht im Internet machen, wenn du Files Sync willst zwischen verschiedenen Geräten und die auch bei dir daheim im WLAN sind und es dir reicht einmal täglich den Abgleich zu machen, nein, dann musst du es nicht ins Internet packen und ich würde mich sogar dagegen aussprechen, standardmäßig den Nextcloud ins Internet packen, weil alles was nicht im Internet erreichbar ist, hat keine Probleme und auf Nextcloud lagern ja oftmals viele wichtige Sachen, von persönlichen Notizen bis Passwortsaves, bis irgendwelche privaten Fotos und die will man eigentlich nicht im Internet haben und das Einfachste, sich vor geklauten Daten und sonst was zu schützen ist, die Sachen einfach nicht aus dem Internet erreichbar zu machen oder auch nicht bei Dropbox oder sonst wie hochzuladen oder bei irgendeinem China-Chinesen-Anbieter, der dir verspricht, ja bei uns ist das super sicher und zwei Monate später gibt es im Darknet eine Passwort-Datenbank von denen, also das Einfachste, was du machen kannst, wenn du wirklich nicht willst, dass einer an deine Daten dran kommt, so ohne weiteres, ist sie einfach nicht hochzuladen oder nicht aus dem Internet zugreifbar zu machen und wo wir nochmal beim Thema Passwortsaves sind, so ein Zettel und ein Stift ist als Passwortsave zwar oldschool, aber gar nicht mal so schlecht, der Vorteil von einem Zettel und einem Stift ist, wenn irgendjemand bei euch einen Keylogger, gut Keylogger ist eh vorbei, wenn irgendjemand bei euch einen Hoodkit oder frag mir irgendwas installiert hat, der kann sich ohne Probleme das abziehen, was ihr auf der Festplatte habt, auch wenn die Festplatte voll verschlüsselt ist, weil wenn der Computer an ist, dann ist er ja entschlüsselt, weil der muss ja damit arbeiten. Habt ihr aber einen Zettel und einen Stift? Wenn irgendjemand euren Rechner verseucht hat, kommt da keiner an Zettel und Stift dran. Ja, kriegst weh, gut, wenn du Angst vor einer Hausdurchsuchung hast, dann halt kein Zettel und Stift, dann gibt es aber immer noch die Möglichkeit, dass man einen USB Stick nimmt oder, oder sonst was, ja, also es muss nicht unbedingt direkt auf dem Rechner sein. Was ist mit Open Source Cloud Password Manager mit Bitworn? Den kann man ja auch rein lokal verwenden, ansonsten ich vertraue keinem Password Manager mit Cloud Anbindung. Die können so viel machen, wenn der Tag lang ist. Mein Passwort liegt offline auf einem Keypass, fertig. Nicht Cloud. Also meine Passwörter. Also wer Passwort Safe in der Cloud verwendet, möchte eigentlich, dass seine Passwörter geklaut werden. So hart muss man das sagen. Und es ist ja nicht der erste Anbieter jetzt irgendwie, wer waren das letztens, der Probleme hatte. Das kommt ja öfters mal vor. Ich weiß gar nicht mehr, war das Last Pass? Irgendein Anbieter hat auch letztens Probleme gehabt. Passwort Safe, technisch. Die sagen da natürlich alle immer so nach dem Motto, ja, eigentlich wurde ja gar nichts Schlimmes entwendet. Leute, das einfachste ist einfach Passwörter, ich meine, überlegt euch mal, Passwörter ist das Wichtigste eigentlich, was ihr habt. Damit kriegst du Zugang zu eurem Leben, um es mal übertrieben zu sagen. Sei es euer E-Mail-Account, eure Fotos, eure YouTube-Videos, was auch immer. In Passwort Manager steht hier Zugang zu eurem Leben drin und den wollt ihr nicht in der Cloud irgendwelchen random Anbietern geben, die keine Ahnung haben, was sie damit treiben oder wo ihr keine Ahnung habt, was sie damit treiben. Die können euch doch viel erzählen, wenn der Tag lang ist. Natürlich, jeder Passwort-Anbieter wird euch erzählen, die Daten werden so verschlüsseln, dass wir sie auch nicht lesen können, wir loggen nichts großartig mit, wir machen hier und jenes und super secure. Das hat genau so lang Bestand, bis mal wirklich was ist und dann sagen sie, oh, ups, ja, da haben wir nicht dran gedacht. Diese Aussagen bringen euch überhaupt nichts. Genauso wie bei VPN-Anbietern. VPN-Anbieter sagen ja auch alle so nach dem Motto, macht euch keine Gedanken, wir loggen nichts, wir machen nichts, wir machen hier und da. Ich wette mit euch, wenn mal die Polizei beim VPN-Anbieter vor der Tür steht, da werden die sich ganz schnell überlegen, ob die nicht doch kooperieren. Also das ist alles Gelaber, man kann sich nicht darauf verlassen, was Anbieter einem da erzählen. Ja, weiß ich nicht, ob die die sünden, keine Ahnung. Wahrscheinlich sünden die schon und da zählt das auch als Cloud-Passwort-Manager, ja, klar. Das zählt auch, würde ich auch nicht machen. Keypass auf Handy, das beste ist gar nicht. Weil, wenn du einen Keypass hast mit 100 Passwort da drinnen, wie viel brauchst du denn davon auf dem Handy? 5 vielleicht, ja. Brauchst auf dem Handy wahrscheinlich keine Ahnung. Twitter, Twitter, Twitch, YouTube, Mail und noch irgendwas. Ja gut, wenn du nur einen Keypass hast, wo nur die Sachen drinnen stehen fürs Handy, dann kann man das machen. Aber ganz ehrlich, ich finde die Idee, wenn man das machen will und ein iPhone hat, die Passworte, die man eh übers Handy macht, die kann man ja meinetwegen auch in die iCloud stecken, wenn man Apple vertraut, das ist ja immer die Frage. Aber es ist halt wichtig, dass man nicht den ganzen Passwort-Save dann irgendwie rumsüngt mit 100 Passwörtern für sonst was, die man da überhaupt nicht braucht. Aber was spricht denn dagegen, wenn man die Passwörter einmal eingibt und dann nicht mehr? Weil die meisten Apps, sei es jetzt Twitch oder sonst wie, da musst du dich einmal anmelden, dann holen die sich irgendeinen Token und gut ist und sie funktionieren weiter. Auch YouTube, also du musst dich ja nur einmalig anmelden. Das kann man doch machen. Dann braucht man auch keinen Passwort-Manager auf dem Handy. Ich habe auch keinen Passwort-Manager auf dem Handy. Zwei Faktor hat nochmal ganz eigene Probleme. Zwei Faktor-Authentifizierung ist sicherer, wobei man halt sagen muss, wenn Passwort und Zwei Faktor-Authentifizierung auf dem Handy sind, dann ist es ja kein Zwei Faktor mehr. Das ist so, wie wenn ich Zwei Faktor-Authentifizierung über meinen Passwort-Manager mache. Das ist dann auch kein zweiter Faktor. Wisst ihr, wie ich meine, zweiter Faktor ist es ja nur, wenn das eine mit dem anderen nichts zu tun hat. Aber wenn ich mein Passwort auf dem Handy habe und Zwei Faktor-Authentifizierung mit dem gleichen Handy mache, dann ist es kein zweiter Faktor mehr. Aber das eigentliche Problem an Zwei Faktor-Authentifizierung ist, was passiert, wenn du die Zwei Faktor-Authentifizierung verlierst. Und das geht schneller, als man denkt. Du upgradest dein iPhone, versuchst es zu sünden und der Microsoft Authenticator hat die Hälfte vergessen. Was er standardmäßig hat, solange du nicht den Microsoft-Account verknüpft hast. Und dann hast du ein Problem. Je nach Anbieter, recoveren die das nicht so einfach. Das ist wichtig, genau, manche geben dir Codes mit, die du speichern kannst, um Zwei Faktor-Authentifizierung auszuschalten oder dich einmalig einzuloggen. Und dann ist auch wieder die Frage, was macht man damit? Schreibt man die mit in den Passwort-Manager? Damit hat man ja eigentlich den zweiten Faktor schon wieder ausgehebelt. Weil dann hat jemand ein Einwegpasswort, das heißt, das beste, was man in dem Fall machen kann, ist tatsächlich, sich das auszudrucken oder auf ein USB-Stick zu legen. Wobei da wiederum das Problem ist, ihr seht, so einfach ist das gar nicht. Da wiederum da das Problem ist, irgendwann ist auch mal der Punkt erreicht, wo die meisten Leute sagen, es wird unbequem. Und es wird immer an der Stelle unsicher, wo es unbequem wird. Sobald es unbequem wird, machen die Leute blöde Sachen. Also man muss es nicht übertreiben. Also ihr werdet nicht die perfekte Lösung finden, aber ihr müsst einfach dran denken, so jede Lösung ist besser als Plain Text Passwort TXT. Wenn ihr jetzt eine Plain Text Passwort TXT habt, dann ist das beste und einfachste, was ihr machen könnt, ihr geht in Firefox, also mal angenommen, wir reden jetzt mal nur für den Desktop, ja, ihr geht in Firefox, wenn ihr Firefox verwendet, geht Privacy and Security und setzt ein Master Passwort für eure Logins und speichert das darin. Ja, Master Passwort, wo geht denn das überhaupt? Use Primary Passwort. Das ist quasi ein Passwort Manager eingebaut in Firefox. Also wenn ihr aktuell ein Passwort TXT verwendet, wir reden hier von der Text Datei Unverschluss bei euch auf dem Rechner, also unsicherer kann es ja nicht werden, dann macht es Master Passwort im Firefox, wenn sonst gar nichts geht. Oder nehmt Key Pass oder was auch immer. Also alles ist besser als eine Passwort TXT auf dem Desktop. Ihr könnt euch den Kram auch ausdrucken, sogar das ist besser. Chandler, du bist nicht, genau, ich hab davor schon zwei Stunden gestreamt. Okay Leute, wir machen im nächsten Stream weiter, heute hab ich zu viel Bedenken, dass es irgendwelche Dino-Geschichten gibt, es lohnt sich jetzt nicht weiterzumachen. Du meinst dein Cousin? Cousin war das letzte Preis. Ja, Excel Passwort Datei ist das gleiche, kommt das gleiche raus. Aber ich kenne viele Leute, die verhalten Passwort TXT auf dem Desktop. Wenn mir das weitergeleitet hat, das ist doch von dir das Emote. Ich hab mir das einfach von Bella Twitch TV runtergeladen. Und ich hab mir gedacht, das passt schön zu Whoop Pet. Oder hast du was dagegen, dass ich das Emote nehme? Ich mein, das ist meine Katz, dein Emote. Können wir uns jetzt teilen? Albe, Albe. Das kann man auch machen, ja. Leute, danke für die ganzen Subs, ich guck noch mal schnell rein, bevor ich jetzt aufgehe. Wen haben wir denn hier am Start? lolmann.de ist am Start, nice. Warface, Daniel Lull hat wieder Subscribed für 25 Monate. Stellt euch das mal vor, Massive, Alter. Makishi ist am Start. Alex Vegan, den hab ich schon gesehen, aber trotzdem danke für die ganzen Subs, Leute. Massive. Big Brain Subscription hier wieder. Subsraten, wie rum, du hast doch letzten Mal schon einen gekriegt. 8Kill, dankeschön, 2 Monate Subscription. Arci, 1004 Leute, wenn euch der Stream gefällt und ihr noch ein Prime-Sub am Start habt. Any Primers. Und wenn ihr nicht mir gebt, dann gebt mir irgendjemand anderes. Ansonsten schenkt ihr Amazon einfach nur Geld. SSL bei Hetzner, was genau ist die Frage? SSL bei Hetzner. Donboy, 3 Monate, nice für den Sub. Battlefield 1 ist, stimmt, Battlefield 1 ist free, ja, aber ich werd Battlefield 1 trotzdem nicht spielen. Wie gesagt, ich würde die gar nicht sunken zwischen PC und Handy, weil du viel zu viele Passwörter auf deinem Handy mitsüngst, die du da nie brauchen wirst. Ich würde die 5 Passwörter einfach von Hand eingeben auf dem Handy, meistens muss man das ja nur einmal machen und dann ist gut. Bieten die letztes ein Crypt? Äh, ich hab noch nie eine Domain verwendet, also ich hab noch nie eine Domain gekauft bei Hetzner, muss ich ehrlich sagen. Äh, über die Hetzner Cloud ist es natürlich einfach, so wie bei jedem anderen Cloud-Anbieter auch. Du lockst dich ein, startest Let's Encrypt oder nimmst einen Web-Server mit Let's Encrypt und es funktioniert. Ähm, Domains weiß ich nicht, hab ich noch nie verwendet bei Hetzner. Wahrscheinlich gehts da auch relativ einfach, keine Ahnung, weiß ich nicht, hab ich neulich ausprobiert. Subs raten? Ok Leute, weil ihr es seid, wir raten jetzt Subs. Also, Moment, muss mal selbst nachgucken, wie viel Subs hab ich denn jetzt? Ok, alles klar, also wer am nächsten dran ist, gewinnt. Ab jetzt, wie viele Subs hab ich gerade? Ok, 5, 4, 3, 2, 1, Stopp. Also, ich wollt jetzt ja nicht spoilern, ich hab relativ wenig gestreamt in letzter Zeit, dementsprechend sind die Zahlen wieder hardcore getropft, also schauen wir mal, ob da jemand in der Nähe war. Aktuell ist 221 Subs. Jaja, das jetzt ist zu spät, jetzt ist zu spät. Das ist getropft von 350 oder so, aber ja, macht nix, selbst schuld, wenn ich nicht spiele, äh, nicht streame. 210 ist schon mal gut, also 221, jaja. Wer ist denn am nächsten dran? Ok, 220, der Serious Max, hast du wirklich 220 tatsächlich? 220, hat jemand 222? Nee. Der Serious Max, dann darfst du dir einen aussuchen, der nen Sub bekommt. Du hast ja schon einen. 219, 219 hat keiner. Dann sucht der einen aus. Der Sarix, ok, der kriegt einen. Ich überweis Chef jetzt mal kurz, 250. Sollte eigentlich, ja, nice, Fock. Fock, alles klar Leute, reicht für heute, ich hau jetzt ab. Bis morgen früh, geht ganz normal los, wieder so kurz vor 10 oder sowas, 9.30 oder um 10. Gucken wir mal. Bis dann, machts gut, see you, keck bye.", "segments": [{"id": 1, "start": 0.0, "end": 4.5600000000000005, "text": "Gucken wir mal, ob es wieder funktioniert."}, {"id": 2, "start": 4.5600000000000005, "end": 7.2, "text": "Ey ey ey, funktioniert wieder."}, {"id": 3, "start": 7.2, "end": 11.16, "text": "Mal gucken, wie lange es funktioniert, irgendeiner sitzt jetzt bei sich daheim vorm Rechner und"}, {"id": 4, "start": 11.16, "end": 15.92, "text": "fühlt sich wie der krasseste Ärger und grubbelt sich ein, keine Ahnung, wird wahrscheinlich"}, {"id": 5, "start": 15.92, "end": 17.68, "text": "gleich wieder weg sein, denke ich mal."}, {"id": 6, "start": 17.68, "end": 22.0, "text": "Ich werde mal Vodafone anrufen, ich mache es nächstes Mal halt über einen VPN, ich"}, {"id": 7, "start": 22.0, "end": 27.28, "text": "mache es nächstes Mal über einen VPN und schreibe Vodafone, ich habe ja schon eine direkte,"}, {"id": 8, "start": 27.28, "end": 31.6, "text": "ich kann ja schon Vodafone direkt anschreiben mittlerweile für sowas, dass ich eine neue"}, {"id": 9, "start": 31.6, "end": 34.24, "text": "IP brauche, dass ich irgendjemanden nicht lassen kann."}, {"id": 10, "start": 34.24, "end": 42.08, "text": "Joa, ich meine, dann mache ich es nächstes Mal über einen VPN."}, {"id": 11, "start": 42.08, "end": 43.08, "text": "Wer macht sowas?"}, {"id": 12, "start": 43.08, "end": 47.88, "text": "Keine Ahnung, jemand der geiler Hacker-Man sein will, ich weiß es nicht."}, {"id": 13, "start": 47.88, "end": 50.28, "text": "Das willst du machen, es gibt genug Leute."}, {"id": 14, "start": 50.28, "end": 59.36, "text": "Russen-Dedosa, nee, es ist irgendeiner aus dem Chat, irgendeiner aus dem Chat ist es"}, {"id": 15, "start": 59.36, "end": 60.36, "text": "Leute."}, {"id": 16, "start": 60.36, "end": 67.2, "text": "Ich mache es nächstes Mal über einen VPN, ich habe jetzt eigentlich gedacht, das ist"}, {"id": 17, "start": 67.2, "end": 73.52, "text": "kein Ding, Leute wollen ja zugucken und haben keinen Bock dran, irgendwas kaputt zu machen,"}, {"id": 18, "start": 73.52, "end": 76.56, "text": "wie kriegt man die IP so schnell raus, naja, ich habe es ja oft genug gezeigt."}, {"id": 19, "start": 76.56, "end": 88.68, "text": "Ich habe jetzt nicht gedacht, dass irgendjemand drauf anlegt, aber gut, ich meine schwierig"}, {"id": 20, "start": 88.68, "end": 89.68, "text": "ist es nett."}, {"id": 21, "start": 89.68, "end": 104.08, "text": "Ich schreibe Vodafone mal an, dass sie das gleich verwechseln sollen."}, {"id": 22, "start": 104.08, "end": 131.76, "text": "Kann sein, ich weiß es nicht, ich schreibe Vodafone an, ich habe ja mittlerweile schon"}, {"id": 23, "start": 131.76, "end": 140.2, "text": "Vodafone direkt in Vodafone-Kontakt für sowas, also direkt, was heißt direkt in Kontakt,"}, {"id": 24, "start": 140.2, "end": 147.84, "text": "wo halt drauf reagiert wird, das ist halt das geile, dass du es brauchst, aber gut,"}, {"id": 25, "start": 147.84, "end": 152.12, "text": "das war nämlich eindeutig keine Vodafone, nee, das war kein Vodafone-Problem, da können"}, {"id": 26, "start": 152.12, "end": 160.44, "text": "die nichts für, das war eindeutig Tests, ob es die richtige IP ist, das war der erste"}, {"id": 27, "start": 160.44, "end": 168.52, "text": "kleine Lack, und als derjenige gemerkt hat, erster kleiner Lack, okay, ist ruckelt, dann"}, {"id": 28, "start": 168.52, "end": 173.12, "text": "wusste er, jetzt lohnt es sich Geld auszugeben für ein paar Bots, weil du willst ja erstmal"}, {"id": 29, "start": 173.12, "end": 182.4, "text": "testen, ob es geht, bevor du Geld ausgibst, deswegen testest du erstmal kurz, und wenn"}, {"id": 30, "start": 182.4, "end": 186.04, "text": "du siehst, dass es das richtige ist, auf welche Art und Weise, dann gibst du ein bisschen"}, {"id": 31, "start": 186.04, "end": 187.48, "text": "Geld aus, es ist ja nicht mal so richtig teuer."}, {"id": 32, "start": 187.48, "end": 201.12, "text": "Das kommt drauf an, das kommt drauf an, ob du DSL hast oder nicht, WireGuard-Tutorial,"}, {"id": 33, "start": 201.12, "end": 212.36, "text": "ja, könnte man machen, also ich, wie gesagt, also ich mach mir halt fürs nächste Mal solcher"}, {"id": 34, "start": 212.36, "end": 219.72, "text": "Tutorial an VPN, wenigstens mal eine der sinnvollen Anwendungsgebiete von einem VPN, und nein,"}, {"id": 35, "start": 219.72, "end": 229.72, "text": "ich nehme nicht Nord- oder Express-VPN oder sowas dafür, ich mach mir selbst irgendwo"}, {"id": 36, "start": 229.72, "end": 236.24, "text": "eine Kiste, installiere wahrscheinlich wirklich WireGuard drauf und gut ist, weil dann liege"}, {"id": 37, "start": 236.24, "end": 243.04, "text": "ich im schlimmsten Fall einfach nur noch die IP vom VPN und die kann ich dann schnell"}, {"id": 38, "start": 243.04, "end": 244.04, "text": "wechseln."}, {"id": 39, "start": 244.04, "end": 251.32, "text": "Wenn du sowas machst, du kommst nicht umhin, irgendwie mal deine IP zu leaken, sei es irgendwelche"}, {"id": 40, "start": 251.32, "end": 257.24, "text": "Login-Proms oder irgendwas, du willst das immer mal irgendwie liegen, wie gesagt, ich"}, {"id": 41, "start": 257.24, "end": 260.64, "text": "hätte nicht gedacht, dass manche Leute aus dem Chat so geil drauf sind, damit jetzt was"}, {"id": 42, "start": 260.64, "end": 269.96, "text": "zu machen, aber, das, ja, es gibt halt immer welche, die können es da nicht lassen, das"}, {"id": 43, "start": 269.96, "end": 273.68, "text": "tönt mich jetzt auch nicht so großartig, wenn man dafür eine Geld ausgibt, meinetwegen,"}, {"id": 44, "start": 273.68, "end": 286.48, "text": "jawoll, und dann in Briefumschlag oder was, ey, ich werde mir schon was überlegen, ich"}, {"id": 45, "start": 286.48, "end": 287.48, "text": "werde mir schon was überlegen."}, {"id": 46, "start": 287.48, "end": 311.8, "text": "Fällt mir bestimmt was zu ein, der Aktuell ist nix weg, tatsächlich brühe ich ja gut"}, {"id": 47, "start": 311.8, "end": 318.0, "text": "was sonst, war das nicht so, dass man kein Bargeld verschieben, dass man kein Bargeld"}, {"id": 48, "start": 318.0, "end": 322.0, "text": "verschicken kann oder ist das nur nicht versichert, irgendwie sowas, ja, das ist jetzt übrigens"}, {"id": 49, "start": 322.0, "end": 329.96, "text": "neu, das ist neu, du kannst jetzt bei, wenn du einen Server anlegst bei Hetzner, kannst"}, {"id": 50, "start": 329.96, "end": 334.6, "text": "du jetzt Applications machen, da kriegst du Sachen vorinstalliert, wie sinnvoll das"}, {"id": 51, "start": 334.6, "end": 341.56, "text": "ist, sei mal dahingestellt, hab da, weiß nicht, also ich würde den Kram ehrlich gesagt lieber"}, {"id": 52, "start": 341.56, "end": 347.56, "text": "von Hand installieren, und gerade sowas wie Nextcloud direkt im Internet haben, weiß"}, {"id": 53, "start": 347.56, "end": 353.12, "text": "ich nicht, wie viel sinnvoll ich das halte, oder gerade ein Wordpress oder sowas, ne, also"}, {"id": 54, "start": 353.12, "end": 356.92, "text": "da würde ich den Kram lieber selbst installieren und genau nur das, was ich haben will, aber"}, {"id": 55, "start": 356.92, "end": 362.24, "text": "klar, kann man natürlich machen, kann man natürlich machen, was cool wäre, wenn man"}, {"id": 56, "start": 362.24, "end": 370.08, "text": "selbst hier irgendwelche Setups, Sachen hinterlegen kann, wo ich dann auch, wo ich quasi selbst"}, {"id": 57, "start": 370.08, "end": 374.92, "text": "irgendwie einen Skript hinterlegen könnte, was nach Aufbau läuft oder so, wobei ich da"}, {"id": 58, "start": 374.92, "end": 378.76, "text": "im Prinzip im Webinterface nichts brauche, das kann ich selbst mit irgendeinem Ansible"}, {"id": 59, "start": 378.76, "end": 390.72, "text": "Playbook machen und dann füge ich das aus auf die neue RP und es ist gut, ähm, nicht"}, {"id": 60, "start": 390.72, "end": 398.24, "text": "unbedingt, also, ne, ich glaube du kannst keine eigenen Isos verwenden, aber wir können"}, {"id": 61, "start": 398.24, "end": 404.6, "text": "mal gucken, es gibt Möglichkeiten, und zwar, also spätestens Netboot, mit Netboot kannst"}, {"id": 62, "start": 404.6, "end": 420.96, "text": "du alles machen, also, was geht ist, Iso-Images, genau, also du kannst, du kannst kein eigenes"}, {"id": 63, "start": 420.96, "end": 427.08, "text": "Iso hochladen, das geht glaube ich nicht, aber du kannst Netboot verwenden, weiß gar"}, {"id": 64, "start": 427.08, "end": 431.0, "text": "nicht, ob die schon drinnen haben, du kannst Netboot verwenden, das haben wir sogar schon"}, {"id": 65, "start": 431.0, "end": 436.16, "text": "mal in einem Stream gemacht, das war ein bisschen trickreich, du musstest Netboot, äh, erst"}, {"id": 66, "start": 436.16, "end": 440.96, "text": "mal, musstest, musstest dein Bootloader mit Netboot überschreiben, dass du beim nächsten"}, {"id": 67, "start": 440.96, "end": 447.96, "text": "Boot, äh, Netboot verwenden kannst und dann erzählen kannst, was du willst, ich glaube,"}, {"id": 68, "start": 447.96, "end": 453.08, "text": "man kann kein, kann, ja, kein eigenes Disk Image hochladen, aber wie gesagt, man kann,"}, {"id": 69, "start": 453.08, "end": 457.28, "text": "man kann über Umwege Netboot verwenden, und wenn man Netboot verwenden kann, kann man"}, {"id": 70, "start": 457.28, "end": 463.64, "text": "alles installieren, was man will, das haben wir mal in einem Stream gemacht, ich weiß"}, {"id": 71, "start": 463.64, "end": 469.92, "text": "es aber gar nicht mehr, wie es jetzt ging, oh guck mal, du kannst russischen Kokona,"}, {"id": 72, "start": 469.92, "end": 475.92, "text": "äh, nicht Kokona, Kokona Server, russischen Winner Server kannst du installieren, Poggers,"}, {"id": 73, "start": 475.92, "end": 486.96, "text": "es ist aber fast alles drauf, Hales ist es sowas, das auch, ne, Rally Deluxe, das ist"}, {"id": 74, "start": 486.96, "end": 492.56, "text": "alles mögliche fast da, aber ich glaube, eigene Isos hochladen kannst du nicht, und"}, {"id": 75, "start": 492.56, "end": 501.36, "text": "ich glaube, es geht auch nicht im, in der Konsole, gehts glaub ich auch nicht, ne, aber"}, {"id": 76, "start": 501.36, "end": 514.0, "text": "man kann es über Netboot Umwege machen, aber das meiste haben die drinnen, erst mal, stimmt"}, {"id": 77, "start": 514.0, "end": 518.08, "text": "genau, das ist das, was wir gemacht haben, erst mal Full Disk Engel, das haben wir gemacht,"}, {"id": 78, "start": 518.08, "end": 525.08, "text": "genau, das war tatsächlich schwieriger, als man denkt, ja, kannst du, so haben wir"}, {"id": 79, "start": 525.08, "end": 529.4, "text": "es auch gemacht, wir haben Netboot, ich glaube, wir haben den Bootloader mit Netboot überschrieben,"}, {"id": 80, "start": 529.4, "end": 542.48, "text": "gebootet und dann, äh, darüber, irgendwas anderes installiert, ähm, ja, ich weiß gar"}, {"id": 81, "start": 542.48, "end": 547.68, "text": "nicht, ob es sich lohnt, jetzt weiter zu machen, ich, ich, ich werde mal einen VPN installieren,"}, {"id": 82, "start": 547.68, "end": 553.16, "text": "dass ich so Streams machen kann, ich mache in Zukunft ab und zu mal so eine Sponsoring-Geschichte"}, {"id": 83, "start": 553.16, "end": 560.76, "text": "und da werde ich mich sicherlich mal auf so einem Server einloggen müssen, übrigens,"}, {"id": 84, "start": 560.76, "end": 565.8, "text": "ich habe mir das überlegt, ich wollte jetzt eigentlich mal so zum Start, so ein bisschen,"}, {"id": 85, "start": 565.8, "end": 571.0, "text": "ein bisschen, äh, gucken, was geht, es ist sehr laut technisch, ich habe nicht vor, wenn"}, {"id": 86, "start": 571.0, "end": 575.32, "text": "wir, wenn wir Streams in der Richtung machen, äh, das quasi immer so eng zu verzahnen hier"}, {"id": 87, "start": 575.32, "end": 579.84, "text": "und dann auch rumzuklicken, sondern ich nehme einfach was, was thematisch passt, zum Beispiel,"}, {"id": 88, "start": 579.84, "end": 583.56, "text": "können wir an der Web-Anwendung weiter programmieren, lassen wir das irgendwo hosten, also ich werde"}, {"id": 89, "start": 583.56, "end": 587.36, "text": "jetzt nicht in jedem Stream, das hätte es in der Web-Interface oder so zeigen, aber ich"}, {"id": 90, "start": 587.36, "end": 592.28, "text": "habe mir gedacht, für den ersten Stream können wir noch mal was Cooles machen, leider, habe"}, {"id": 91, "start": 592.28, "end": 596.16, "text": "ich nicht mit gerechnet, dass es manche Leute halt, äh, dann drauf anlegen, dass es nicht"}, {"id": 92, "start": 596.16, "end": 597.16, "text": "funktioniert."}, {"id": 93, "start": 597.16, "end": 600.24, "text": "Hat dein Internet-Auge gemacht?"}, {"id": 94, "start": 600.24, "end": 616.4, "text": "Ne, das Internet, der war das kleinste Problem, ich weiß es gar nicht mehr, was das war,"}, {"id": 95, "start": 616.4, "end": 620.28, "text": "warum kann man eigentlich nicht Manjaro als Server-OS verwenden, doch, doch das kann man,"}, {"id": 96, "start": 620.28, "end": 634.28, "text": "das kann man schon machen, das ist, äh, das geht, das geht, das geht, aber Manjaro ist"}, {"id": 97, "start": 634.28, "end": 642.76, "text": "vielleicht da nicht so wahnsinnig gut geeignet für, sag mal, du kannst das machen, aber"}, {"id": 98, "start": 642.76, "end": 646.84, "text": "sag mal, der Vorteil von Manjaro ist ja, dass du top aktuelle Software hast, so richtig"}, {"id": 99, "start": 646.84, "end": 651.32, "text": "top aktuelle Software, die willst du eigentlich auf dem Server gar nicht haben, du willst"}, {"id": 100, "start": 651.32, "end": 656.0, "text": "irgendwas haben, was stabil ist, was läuft, was auch mit Patches versorgt wird, was, also"}, {"id": 101, "start": 656.0, "end": 659.92, "text": "von einem Anbieter mit Patches versorgt wird, also von irgendeiner Distribution mit Patches"}, {"id": 102, "start": 659.92, "end": 664.12, "text": "versorgt wird, äh, bei Manjaro musst du ja vieles aus dem User-Repo installieren und"}, {"id": 103, "start": 664.12, "end": 668.28, "text": "das User-Repo, da musst du dich selbst drum kümmern und die Quellen sind auch nicht unbedingt"}, {"id": 104, "start": 668.28, "end": 673.32, "text": "die vertrauenswürdigsten unbedingt, äh, dazu kommt, dass es in Rolling-Release ist, also"}, {"id": 105, "start": 673.32, "end": 677.76, "text": "du musst quasi permanent updaten, du hast nicht so eine LTS-Geschichte wie 5 Jahre lang"}, {"id": 106, "start": 677.76, "end": 681.72, "text": "kannst du dich darauf verlassen, dass es funktioniert, du kannst ohne Probleme einen Manjaro-Linux"}, {"id": 107, "start": 681.72, "end": 685.52, "text": "als Server-OS verwenden, das ist kein Ding, das ist, also technisch ist das kein Ding,"}, {"id": 108, "start": 685.52, "end": 689.08, "text": "das funktioniert, es gibt nur ein paar Sachen, die es nicht so, nicht so angenehm machen."}, {"id": 109, "start": 689.08, "end": 698.24, "text": "Ja, du hast beispielsweise bei Ubuntu auch relativ viel vorkonfiguriert, du hast beispielsweise,"}, {"id": 110, "start": 698.24, "end": 704.36, "text": "äh, sinnvolle SSH-Config, du kannst einen Docker installieren, hast es sinnvoll vorkonfiguriert"}, {"id": 111, "start": 704.36, "end": 711.0, "text": "und so, das ist für den Anwendungszweck einfach angenehmer, du kannst alles für alles verwenden"}, {"id": 112, "start": 711.0, "end": 712.0, "text": "normalerweise."}, {"id": 113, "start": 712.0, "end": 720.56, "text": "Ja, genau, ja, es ist nicht so schlimm, man, was willst du machen, gibt's Leute, die können's"}, {"id": 114, "start": 720.56, "end": 721.56, "text": "nicht lassen."}, {"id": 115, "start": 721.56, "end": 735.92, "text": "Das mach ich je nachdem, ob ich hessisch rede oder nicht, das, das schwankt, das schwankt"}, {"id": 116, "start": 735.92, "end": 747.88, "text": "im Stream, aber wenn ich, aber, aber das ist, es ist blöd, dass es dich auslöst, ja,"}, {"id": 117, "start": 747.88, "end": 753.0, "text": "auslösen ist immer nicht gut, aber es gibt auch genug Sachen, die im Chat geschrieben"}, {"id": 118, "start": 753.0, "end": 757.52, "text": "werden, die mich auslösen, mach dir keine Gedanken, also, das kommt auch oft genug vor."}, {"id": 119, "start": 757.52, "end": 763.56, "text": "Es vergeht kein Stream, wo mich nicht irgendwas auslöst, ich bin übrigens dieses, ich find"}, {"id": 120, "start": 763.56, "end": 765.6, "text": "das eigentlich übelst geil, das auf Deutsch zu schreiben."}, {"id": 121, "start": 765.6, "end": 780.76, "text": "Auslösen triggert mich, ja, also, das muss, das muss man echt sagen, die Preise sind"}, {"id": 122, "start": 780.76, "end": 786.2, "text": "echt nicht übel, wenn man's vergleicht mit Azure oder Amazon oder, oder auch Google,"}, {"id": 123, "start": 786.2, "end": 794.12, "text": "Google Cloud, äh, Gedöns, denn, wenn ihr hier in Server, ich sag übrigens nicht Nen,"}, {"id": 124, "start": 794.12, "end": 800.72, "text": "ich sag Nen-Server, Nen finde ich auch doof, ich sag Nen-Server, oder Ein-Server, Nen-Server,"}, {"id": 125, "start": 800.72, "end": 807.32, "text": "ähm, wenn ihr hier in Server mietest, ist das halt, also, es geht ja schon mal ab Reisen"}, {"id": 126, "start": 807.32, "end": 811.04, "text": "los, dafür steht Microsoft, Amazon oder Google erst gar nicht auf."}, {"id": 127, "start": 811.04, "end": 819.4, "text": "Dazu kommt, wenn du Storage brauchst, ist das fucking teuer, gerade in Azure, in Azure"}, {"id": 128, "start": 819.4, "end": 824.76, "text": "bezahlst du, guck mal hier, 10TB bezahlst du hier SSD, äh, 500€ im Monat, wenn du"}, {"id": 129, "start": 824.76, "end": 837.4, "text": "mal den Azure-Rechner nimmst, dann ist das richtig teuer, ja, Hetzner Domains hab ich"}, {"id": 130, "start": 837.4, "end": 838.4, "text": "noch nie gekauft."}, {"id": 131, "start": 838.4, "end": 850.72, "text": "So, virtueller Computer, alter Azure, komm, gib alles, nein, ich will nicht mit eurem"}, {"id": 132, "start": 850.72, "end": 851.72, "text": "Vertriebsteam chatten."}, {"id": 133, "start": 851.72, "end": 880.08, "text": "Manage Disk, SSD, noch mal SSD Standard, so, ja, gibts, gibts, gibts nicht, gibts nicht"}, {"id": 134, "start": 880.08, "end": 889.64, "text": "so wirklich, äh, dreimal, einmal, ne, das sind 1200, äh, also, es, es nimmt sich für"}, {"id": 135, "start": 889.64, "end": 895.16, "text": "eine einzelne SSD, tatsächlich wirds gar nicht mal so viel, hä, das ist halt billiger,"}, {"id": 136, "start": 895.16, "end": 901.04, "text": "sag mal so, hier hast du 10T, hier hast du jetzt 16T für die Hälfte, sag mal mal so,"}, {"id": 137, "start": 901.04, "end": 904.96, "text": "es ist ein bisschen billiger, aber man muss halt sagen, was bei Azure beliebt ist, die"}, {"id": 138, "start": 904.96, "end": 908.32, "text": "Leute nehmen meistens Premium-SSDs, und da wirds richtig teuer."}, {"id": 139, "start": 908.32, "end": 918.88, "text": "Äh, das ist schon mal 1500, also Preis-Leistungs-mäßig ist das bei Hetzner halt wirklich nice, Storage"}, {"id": 140, "start": 918.88, "end": 927.04, "text": "ist nice und die Server-Preise sind auch nice, ohne fad, kann sein, das ist Ami, Ami-Calculator,"}, {"id": 141, "start": 927.04, "end": 932.0, "text": "das ist so nur zum überschlagen, aber Preis-Leistungstechnisch ist das wirklich nice, und denkt dran,"}, {"id": 142, "start": 932.0, "end": 936.76, "text": "das ist das, was ich hier am Anfang zeigen wollte, am besten ist, ihr legt den Server"}, {"id": 143, "start": 936.76, "end": 943.0, "text": "wirklich an, mit der kleinsten, mit der kleinsten Stufe, dann bekommt ihr 20GB SSDs quasi"}, {"id": 144, "start": 943.0, "end": 950.92, "text": "dabei, und wenn ihr mehr Speicher wollt, machts hier drüber, das wird dann zusätzlich"}, {"id": 145, "start": 950.92, "end": 956.44, "text": "dran, das, das, das erscheint dann als, als Zusatz-Zusatz-Mountpunkt, so, dann nimmst"}, {"id": 146, "start": 956.44, "end": 961.4, "text": "du 100GB für 4,76 im Monat, dann hast du nicht das Problem, dass du nicht ordentlich"}, {"id": 147, "start": 961.4, "end": 967.92, "text": "die Server hoch und runter skalieren kannst, von einem Kern auf 16 Kerne hin und zurück,"}, {"id": 148, "start": 967.92, "end": 970.48, "text": "sondern es funktioniert dann einfach, was hat der überhaupt für Schmerz, ich lösche"}, {"id": 149, "start": 970.48, "end": 980.48, "text": "den Kram mal, CacWade 2 muss weg, und CacWade 1 muss auch weg, ja, und Leute, wer das Ganze"}, {"id": 150, "start": 980.48, "end": 986.36, "text": "mal ausprobieren will, Ausrufezeichen Hetzner, bei mir in Chat, und einfach mal sich hier"}, {"id": 151, "start": 986.36, "end": 990.36, "text": "den Link angucken, da kommt ihr nämlich direkt raus, da das, was ich auch zeige, nur, dass"}, {"id": 152, "start": 990.36, "end": 995.56, "text": "es ein Ref-Link ist von mir, und wenn ihr euch registriert, anmeldet mit meinem Code"}, {"id": 153, "start": 995.56, "end": 1005.96, "text": "MAX21, also mit 4, M4X21, ja, dann kriegt ihr 20€ Startguthaben für Neukundin, wohlgemerkt"}, {"id": 154, "start": 1005.96, "end": 1009.96, "text": "nur für Neukunden, wenn ihr da schon einen Account habt, dann nicht, ich hab mir sagen"}, {"id": 155, "start": 1009.96, "end": 1016.32, "text": "lassen, man kann sich einen zweiten Account anlegen und trotzdem die 20€ abgreifen,"}, {"id": 156, "start": 1016.32, "end": 1031.88, "text": "aber, da sind sie glaube ich nicht so scharf drauf, aber ich hab gehört, das geht, ja also"}, {"id": 157, "start": 1031.88, "end": 1037.96, "text": "wer das mal ausprobieren will, kann ich nur empfehlen, es hat sich letztens einer beschwert"}, {"id": 158, "start": 1037.96, "end": 1043.16, "text": "bei mir in den Kommentaren auf YouTube, so nach dem Motto, wie kann man so einen KacWad"}, {"id": 159, "start": 1043.16, "end": 1048.92, "text": "oder so, Scheißanbieter und sonst was, und dann kam raus, er hat nicht bezahlt und die"}, {"id": 160, "start": 1048.92, "end": 1053.08, "text": "hätten jetzt seine Server ausgeschaltet, und da hab ich mir auch gedacht, ja ok, wenn"}, {"id": 161, "start": 1053.08, "end": 1064.2, "text": "man nicht bezahlt, dann, da kann ich auch nichts für, wenn er nicht bezahlt, also ich"}, {"id": 162, "start": 1064.2, "end": 1067.52, "text": "kann es nachvollziehen, dass wenn man sonst kein Geld ausgibt, sondern nur den Gutschein"}, {"id": 163, "start": 1067.52, "end": 1071.6, "text": "verwendet und dann, weil keine Ahnung, 14 Tage drüber ist, dass dann halt mal die Server"}, {"id": 164, "start": 1071.6, "end": 1078.12, "text": "ausgeschaltet werden, das würde ich an der Stelle wahrscheinlich auch so machen, er hat"}, {"id": 165, "start": 1078.12, "end": 1083.04, "text": "sich voll aufgeregt in den Kommentaren, ich sag es euch, aber es ist halt so, wenn man"}, {"id": 166, "start": 1083.04, "end": 1090.52, "text": "es nicht bezahlt, kann ich dir noch nicht übel nehmen, was ich übrigens auch witzig"}, {"id": 167, "start": 1090.52, "end": 1094.96, "text": "fand im letzten Video, das muss ich jetzt gerade nochmal zeigen, ich vermute mal, großartige"}, {"id": 168, "start": 1094.96, "end": 1097.72, "text": "Technik Sachen muss ich heute nicht mehr anfangen, sonst gibt es gleich wieder irgendwelche"}, {"id": 169, "start": 1097.72, "end": 1101.76, "text": "DOS Leute, wie gesagt, nächsten Stream mach ich einfach über VPN, dann haben wir das"}, {"id": 170, "start": 1101.76, "end": 1108.76, "text": "Problem nicht, was ich lustig fand im letzten Video auf YouTube, ihr fandet so den Battlefield"}, {"id": 171, "start": 1108.76, "end": 1114.08, "text": "Trailer richtig nice, Portal ist auch richtig nice, leider, ich hätte mir von Portal, also"}, {"id": 172, "start": 1114.08, "end": 1117.4, "text": "das neue Battlefield Portal hätte ich mir ein bisschen mehr erwartet, ich hab gehofft,"}, {"id": 173, "start": 1117.4, "end": 1122.6, "text": "es ist ein Level Editor, ist es nicht, es ist bloß ein Spielmodus Editor, so warte mal,"}, {"id": 174, "start": 1122.6, "end": 1125.44, "text": "das müsst ihr euch mal auf der Zunge zergehen lassen, die Leute hier in den Kommentaren"}, {"id": 175, "start": 1125.44, "end": 1132.24, "text": "im letzten Video, also, es gibt einmal den Typ, der sich darüber beschwert, dass ich"}, {"id": 176, "start": 1132.24, "end": 1143.08, "text": "zu, Moment, ich zeige euch den, das sind mir übrigens auch die liebsten Kommentare, die"}, {"id": 177, "start": 1143.08, "end": 1148.52, "text": "liebsten Kommentierer, du bist nicht richtig informiert genug, 60% was du sagst ist falsch,"}, {"id": 178, "start": 1148.52, "end": 1157.2, "text": "ja gut, aber was denn konkret, also was ist denn genau falsch, das, ja, das löst mich"}, {"id": 179, "start": 1157.2, "end": 1168.16, "text": "auch immer aus, so Kommentare, das löst mich immer richtig aus, so nach dem Motto, ha,"}, {"id": 180, "start": 1168.16, "end": 1172.72, "text": "ne, Max leider nicht richtig, alles falsch, aber nicht mal ein Beispiel, was jetzt nicht"}, {"id": 181, "start": 1172.72, "end": 1178.6, "text": "richtig ist und manchmal, ich antworte da manchmal drauf, so nach dem Motto, ihr sagt doch mal,"}, {"id": 182, "start": 1178.6, "end": 1188.64, "text": "was ist denn nicht richtig, und da kommt dann als Antwort, ja, bei Minute 4.31 sagst du,"}, {"id": 183, "start": 1188.64, "end": 1195.16, "text": "die Farbe vom Schild ist blau, in Wirklichkeit ist sie lila, so solche Antworten kommen da"}, {"id": 184, "start": 1195.16, "end": 1199.52, "text": "manchmal, wo ich mir denk, ja okay, du hast dir jetzt aus 11 Minuten Video eine Sache"}, {"id": 185, "start": 1199.52, "end": 1208.36, "text": "rausgeguckt, die vielleicht nicht die Interpretationsfrage ist, also, so Kommentare, die lösen mich"}, {"id": 186, "start": 1208.36, "end": 1218.4, "text": "immer aus, ja, aber der andere ist, warte, wo sind denn die Kommentare, die ich total"}, {"id": 187, "start": 1218.4, "end": 1238.24, "text": "widersprüchlich fand, wartet mal, wartet mal, wo ist es denn, die waren total widersprüchlich,"}, {"id": 188, "start": 1238.24, "end": 1245.44, "text": "genau, genau, erst kommt er, erst kommt er hier, sorry, bla, bla, bla, du hast, also"}, {"id": 189, "start": 1245.44, "end": 1250.96, "text": "er beschwert sich jetzt hier im Endeffekt, dass ich nicht genug, dass ich nicht genug"}, {"id": 190, "start": 1250.96, "end": 1255.88, "text": "positive sage, er sagt, du hast auch die positiven Seiten des Spiels erwähnt, aber wirklich"}, {"id": 191, "start": 1255.88, "end": 1261.78, "text": "nur so nebenbei, also ihm war das Video nicht positiv genug, so, halten wir das mal fest,"}, {"id": 192, "start": 1261.78, "end": 1272.6, "text": "das Video ist nicht positiv genug, so, jetzt kommt der nächste, der sagt, es ist nicht,"}, {"id": 193, "start": 1272.6, "end": 1281.68, "text": "es ist nicht negativ genug, was denn jetzt, ist das jetzt, ist das jetzt jetzt zu positiv"}, {"id": 194, "start": 1281.68, "end": 1290.4, "text": "das Video oder ist es zu negativ, was ist es denn jetzt, da, da, da clique ich nicht"}, {"id": 195, "start": 1290.4, "end": 1297.74, "text": "mal durch, ja, und da sieht man mal, dass es total subjektiv ist im Endeffekt, was"}, {"id": 196, "start": 1297.74, "end": 1304.06, "text": "die Leute da empfinden, wenn man was sagt, aber die denken immer, das ist so die ultimative"}, {"id": 197, "start": 1304.06, "end": 1311.7, "text": "Sichtweise, man kann das gar nicht anders sehen, aber du siehst ja halt, der eine sagt,"}, {"id": 198, "start": 1311.7, "end": 1314.7, "text": "das ist nicht positiv genug, der andere sagt, das ist nicht negativ genug, was ist das denn"}, {"id": 199, "start": 1314.7, "end": 1316.94, "text": "jetzt? Pogativ ist es."}, {"id": 200, "start": 1316.94, "end": 1337.14, "text": "Leute, ich werde für heute Schluss machen, es hat keinen Sinn, das weiterzumachen, sonst"}, {"id": 201, "start": 1337.14, "end": 1343.14, "text": "gibt es wieder irgendwelche DDoS Action, ich mache das nächste Stream über VPN, wie gesagt"}, {"id": 202, "start": 1343.14, "end": 1351.78, "text": "ich streame nicht über VPN, ich werde dann meine, hier, admin Geschichten und Vorstellgeschichten"}, {"id": 203, "start": 1351.78, "end": 1356.1, "text": "über VPN machen, da kann ich im schlimmsten Fall die VPN IP leaken und die können bei"}, {"id": 204, "start": 1356.1, "end": 1359.1, "text": "DDoS ein bisschen lustig sein, da hole ich mir eine neue."}, {"id": 205, "start": 1359.1, "end": 1364.58, "text": "Ja, richtig weird champ at DDoSer, Alter."}, {"id": 206, "start": 1364.58, "end": 1377.22, "text": "Weird, weird champ."}, {"id": 207, "start": 1377.22, "end": 1381.38, "text": "Kannst ja die IP ausblenden, so einfach ist das nicht, guck mal, zum Beispiel, wenn du"}, {"id": 208, "start": 1381.38, "end": 1388.54, "text": "dich einloggst in Ubuntu, dann hast du standardmäßig den Login-Skript, wo drinne steht, letzter"}, {"id": 209, "start": 1388.54, "end": 1395.14, "text": "Login von, wie soll ich das ausblenden, gescheit?"}, {"id": 210, "start": 1395.14, "end": 1401.5, "text": "Da kannst du nichts großartiges dagegen machen."}, {"id": 211, "start": 1401.5, "end": 1405.5, "text": "Zockst du noch ein bisschen?"}, {"id": 212, "start": 1405.5, "end": 1409.18, "text": "Kennt jemand, oder hat jemand gespielt?"}, {"id": 213, "start": 1409.18, "end": 1411.9, "text": "Lohnt sich das?"}, {"id": 214, "start": 1411.9, "end": 1416.34, "text": "Ich finde den zweiten Teil fand ich mega nice und ich habe jetzt gesehen, nachdem das"}, {"id": 215, "start": 1416.34, "end": 1425.62, "text": "war ein Jahr Stadia-Exklusiv, das kam jetzt vor zwei Tagen auf Steam raus, hat das jemand"}, {"id": 216, "start": 1425.62, "end": 1427.5, "text": "schon ausprobiert, ob der dritte Teil was taugt?"}, {"id": 217, "start": 1427.5, "end": 1436.38, "text": "Guck mal grad mal Steam, also der zweite Teil war richtig cool, das lässt sich deaktivieren,"}, {"id": 218, "start": 1436.38, "end": 1440.06, "text": "ja, aber Chat, das bringt doch alles nichts, ich muss mich doch initial mal einloggen,"}, {"id": 219, "start": 1440.06, "end": 1446.1, "text": "um das zu deaktivieren, es gibt sicherlich viele Stellen, wo man das deaktivieren kann,"}, {"id": 220, "start": 1446.1, "end": 1450.22, "text": "aber ich kann auch nicht im Voraus, wenn ich sowas mache, alle Stellen wissen, wo das eventuell"}, {"id": 221, "start": 1450.22, "end": 1451.46, "text": "mal auftauchen könnte."}, {"id": 222, "start": 1451.46, "end": 1463.62, "text": "Ja, das ist, ich mach das über ein VPN das nächste Mal, easy, kein Problem und dann kann"}, {"id": 223, "start": 1463.62, "end": 1465.1, "text": "nichts mehr passieren."}, {"id": 224, "start": 1465.1, "end": 1475.26, "text": "Da machts kurz Bills weg, ja, Leute, ich glaube ihr denkt, dass ich da zu viel fähig"}, {"id": 225, "start": 1475.26, "end": 1481.42, "text": "bin, ja, ich bin zwar durch die ganzen Prime-Subs mittlerweile auch hier IQ+++, genauso wie"}, {"id": 226, "start": 1481.42, "end": 1486.54, "text": "der Chat, aber ich kann nicht zwei Stunden im Voraus planen, an welcher Stelle eventuell"}, {"id": 227, "start": 1486.54, "end": 1492.58, "text": "mal meine IP auftauchen könnte oder nicht, wie soll ich das machen, ne, dann weiche ich"}, {"id": 228, "start": 1492.58, "end": 1496.74, "text": "einmal von dem ab, was ich mir vorgestellt habe, weil einer im Chat was fragt und dann"}, {"id": 229, "start": 1496.74, "end": 1499.54, "text": "zeige ich wieder, was, ne, ne, das funktioniert nicht, ich mach das einfach über ein VPN"}, {"id": 230, "start": 1499.54, "end": 1502.54, "text": "das nächste Mal."}, {"id": 231, "start": 1502.54, "end": 1514.66, "text": "Fertig, AI-IP-Erkennung ausplanten, das wäre nochmal was, das wäre nochmal was, dann"}, {"id": 232, "start": 1514.66, "end": 1520.06, "text": "muss ich 48 FPS die Sekunde, Full HD, Bilderkennung machen, da brauch ich noch einen zweiten Rechner,"}, {"id": 233, "start": 1520.06, "end": 1521.06, "text": "der nur Bilderkennung macht."}, {"id": 234, "start": 1521.06, "end": 1529.74, "text": "Einfach 10 Sekunden Stream Delay, ja gut und dann mit Stream ausmachen, da mach ich ja"}, {"id": 235, "start": 1529.74, "end": 1535.5, "text": "permanent den Stream an und aus, welchen VPN nutzt du, ich würde mir irgendwo einen"}, {"id": 236, "start": 1535.5, "end": 1551.3, "text": "Server hinstellen und einen WireGuard selbst drauf installieren, dann ist easy die IP zu"}, {"id": 237, "start": 1551.3, "end": 1557.82, "text": "wechseln, dann ist easy die IP zu wechseln, das ist übrigens auch ein cooles Feature"}, {"id": 238, "start": 1557.82, "end": 1563.14, "text": "bei Hetzer, das kann ich euch nochmal schnell zeigen, wenn ihr einen Server anlegt, ihr"}, {"id": 239, "start": 1563.14, "end": 1569.9, "text": "könnt sowas wie Floating, Floating-IPs nehmen, dann nimmst du irgendeine x-beliebige IP,"}, {"id": 240, "start": 1569.9, "end": 1574.94, "text": "kriegste, so keine Ahnung, extern nennen wir die jetzt mal, da kriegste eine IP und"}, {"id": 241, "start": 1574.94, "end": 1579.26, "text": "die kannst du an jeden Server dranhängen, wo du willst, also stellt euch mal vor, ihr"}, {"id": 242, "start": 1579.26, "end": 1583.46, "text": "habt jetzt, ihr wollt einen Server umziehen mit einer Webseite drauf, von einem aufs"}, {"id": 243, "start": 1583.46, "end": 1590.02, "text": "andere System und ihr stellt es einfach so ein, dass die Domain auf diese IP auflöst"}, {"id": 244, "start": 1590.02, "end": 1596.26, "text": "und ihr könnt dann die IP von Server zu Server umziehen, also die ist nicht gebunden an ein"}, {"id": 245, "start": 1596.26, "end": 1600.06, "text": "System und dementsprechend kann man auch einfach schnell neue ausstellen und da drüber, wenn"}, {"id": 246, "start": 1600.06, "end": 1605.86, "text": "ich da einen WireGuard VPN nehme, dann ist das easy, dann kann ich innerhalb von 2 Sekunden"}, {"id": 247, "start": 1605.86, "end": 1606.86, "text": "die IP wechseln."}, {"id": 248, "start": 1606.86, "end": 1614.02, "text": "Warum du hier andauernd reinguckst, weiß ich auch nicht, zumal ich ja heute nichts mal großartig"}, {"id": 249, "start": 1614.02, "end": 1615.7, "text": "machen kann, weil den ausstellst."}, {"id": 250, "start": 1615.7, "end": 1631.42, "text": "Nochmal zuerst, mir hat Unchained sehr viel Spaß, was ist denn Unchained, Unchained Tower"}, {"id": 251, "start": 1631.42, "end": 1651.9, "text": "Defense, zeigt mal her, was Tower Defense, what the fuck ist das, das kenne ich gar nicht,"}, {"id": 252, "start": 1651.9, "end": 1657.58, "text": "aber, aber, warum, warum, warum ist das der dritte Teil und jetzt ist der dritte Teil"}, {"id": 253, "start": 1657.58, "end": 1663.06, "text": "rausgekommen."}, {"id": 254, "start": 1663.06, "end": 1669.3, "text": "Was haben die denn für, was haben die denn für Bewertung, zeigt mal schnell, mostly positive,"}, {"id": 255, "start": 1669.3, "end": 1675.5, "text": "warum ist das nur mostly positive, bisschen new world, nee ich hab jetzt keinen Bock drauf,"}, {"id": 256, "start": 1675.5, "end": 1699.58, "text": "weil this game is fun, ok, sieht auch ganz gut aus, ok, was auch immer, ist Battlefield"}, {"id": 257, "start": 1699.58, "end": 1705.42, "text": "1 der erste Battlefield Teil, natürlich, sonst wird er doch nicht 1 heißen, so offensichtlich,"}, {"id": 258, "start": 1705.42, "end": 1719.74, "text": "obvius Leute, eigentlich ne gute Idee, ich geh einfach überall P46, ey das ist wahrscheinlich"}, {"id": 259, "start": 1719.74, "end": 1734.7, "text": "echt die beste Idee, ich geh einfach überall P46, das ist wirklich ne gute Idee, das ist"}, {"id": 260, "start": 1734.7, "end": 1749.26, "text": "wirklich ne gute Idee, na gut Leute, wenn wir gerade dabei sind, einmal noch hier eine"}, {"id": 261, "start": 1749.26, "end": 1753.1, "text": "Runde Sellout, wir haben das gefallen, hatten vielleicht auch mal sich ein bisschen ausprobieren"}, {"id": 262, "start": 1753.1, "end": 1756.94, "text": "will, wie gesagt, denkt dran, Server, die nicht im Internet sind, haben erstmal kein"}, {"id": 263, "start": 1756.94, "end": 1760.74, "text": "Problem, das heißt, wenn ihr nicht den Server ins Internet stellen müsst, dann stellt kein"}, {"id": 264, "start": 1760.74, "end": 1764.62, "text": "Server ins Internet, aber wenn ihr einen Anwendungszweck dafür habt, wie zum Beispiel Minecraft Server"}, {"id": 265, "start": 1764.62, "end": 1768.86, "text": "für euch und eure Freunde, dann könnt ihr ja mal bei meinem Hetzer Link vorbeigucken,"}, {"id": 266, "start": 1768.86, "end": 1773.78, "text": "mit 20€ Startgut haben, könnt ihr schon die ersten 3 Monate nen halbwegs gescheiten Server"}, {"id": 267, "start": 1773.78, "end": 1777.98, "text": "betreiben, ohne dass ihr was dafür bezahlen müsst, geht ja relativ, geht ja bei relativ"}, {"id": 268, "start": 1777.98, "end": 1782.54, "text": "kleinem Geld los hier, kauft ihr euch so ne Dual Core Kiste oder vielleicht nen Triple"}, {"id": 269, "start": 1782.54, "end": 1788.14, "text": "Core, habt ja fast für 3 Monate das Geld und könnt 3 Monate spielen und für kleinen"}, {"id": 270, "start": 1788.14, "end": 1795.34, "text": "Minecraft Server reicht das auf alle Fälle, genau und denkt dran beim Registrieren mein"}, {"id": 271, "start": 1795.34, "end": 1808.06, "text": "Code verwenden, sonst gibt es keine 20€ von spät, ja ich mach jetzt Schluss, ich hab"}, {"id": 272, "start": 1808.06, "end": 1812.58, "text": "keinen Bock jetzt weiter zu machen mit Technik Sachen, weil sonst kommt wieder DDoS Getöntes,"}, {"id": 273, "start": 1812.58, "end": 1815.94, "text": "ich mach das nächsten Stream, also vielleicht nicht jetzt den nächsten herauffolgenden"}, {"id": 274, "start": 1815.94, "end": 1821.9, "text": "Stream, sondern einen der nächsten Streams, mach ich dann weiter mit Linux Einsteiger Geschichten,"}, {"id": 275, "start": 1821.9, "end": 1824.94, "text": "weil wir haben ja noch gar nicht so richtig angefangen, ich hab vielleicht 20% von dem"}, {"id": 276, "start": 1824.94, "end": 1832.9, "text": "gemacht, was ich mir aufgeschrieben hab, individuell RAM hochdrehen, ich glaube RAM hochdrehen"}, {"id": 277, "start": 1832.9, "end": 1836.9, "text": "kannst, das hab ich noch nie ausprobiert, probieren wir mal, ich glaube aber nicht,"}, {"id": 278, "start": 1836.9, "end": 1845.78, "text": "dass das geht, wann streamst du wieder, morgen, morgen früh, Aufwachstream, ich glaube individuell"}, {"id": 279, "start": 1845.78, "end": 1858.14, "text": "RAM hochdrehen geht tatsächlich nicht, es geht nur Storage zusätzlich dranhängen, Video,"}, {"id": 280, "start": 1858.14, "end": 1861.46, "text": "diesen Stream laden, ne die lad ich nicht auf YouTube hoch, ich glaube RAM kann man"}, {"id": 281, "start": 1861.46, "end": 1866.7, "text": "zusätzlich nicht reinhängen, das funktioniert nicht, ne du kannst bloß, du kannst bloß"}, {"id": 282, "start": 1866.7, "end": 1874.86, "text": "Speicher dranhängen, man kann das übrigens bis 10TB machen, aber das geht nur mit einem"}, {"id": 283, "start": 1874.86, "end": 1878.38, "text": "Count, wo man sich den Speicher halt anlocken lassen, weil kann ich verstehen, die gehen"}, {"id": 284, "start": 1878.38, "end": 1882.14, "text": "davon aus, dass das standardmäßig erstmal keiner braucht, und wenn, dann hat er einen"}, {"id": 285, "start": 1882.14, "end": 1891.38, "text": "guten Grund für SSD Swap, ja das kannst du machen, aber extra RAM, extra RAM geht nicht,"}, {"id": 286, "start": 1891.38, "end": 1897.34, "text": "wobei man sagen muss, die fetten Kisten haben auch tatsächlich ordentlich, ordentlich RAM,"}, {"id": 287, "start": 1897.34, "end": 1903.18, "text": "so ist es ja nicht, also die fetten Kisten haben ja hier bis 32G und die hier hat glaube"}, {"id": 288, "start": 1903.18, "end": 1910.1, "text": "ich sogar bis 128G, und da kommt der Vorteil von stundengenauer Abrechnung wieder ins Spiel,"}, {"id": 289, "start": 1910.1, "end": 1916.7, "text": "wenn du mal wirklich was hast, was einfach fette Performance braucht, 32K, 128GB RAM,"}, {"id": 290, "start": 1916.7, "end": 1923.94, "text": "da kannst du die Kiste dir anlegen, 4-5 Stunden berechnen lassen und du bezahlst 2,50€ und"}, {"id": 291, "start": 1923.94, "end": 1928.9, "text": "danach löschst du sie wieder und das war's, also du musst die kein, auch wenn hier monatlich"}, {"id": 292, "start": 1928.9, "end": 1933.1, "text": "dabei steht, du musst die nicht einen Monat behalten, hier nicht öffnen Leute, nicht"}, {"id": 293, "start": 1933.1, "end": 1934.1, "text": "öffnen."}, {"id": 294, "start": 1934.1, "end": 1942.06, "text": "Kann man das per api skalieren, kannst du machen, du kannst per api skalieren und du kannst"}, {"id": 295, "start": 1942.06, "end": 1951.42, "text": "das komplette Zeug anlegen, hier per, ich zeig's dir mal, zack, kannst du anlegen per Kommandozeile,"}, {"id": 296, "start": 1951.42, "end": 1955.22, "text": "und also du kannst es per Kommandozeilen tool machen, die verwenden int terraform, hat"}, {"id": 297, "start": 1955.22, "end": 1964.62, "text": "ein Hetzner Cloud Plugin, ja geht auch, geht alles, also für einfache Sachen ist es für"}, {"id": 298, "start": 1964.62, "end": 1971.3, "text": "mich die perfekte Alternative zu Azure und Google und Amazon und sonstige Geschichten,"}, {"id": 299, "start": 1971.3, "end": 1977.38, "text": "also wenn man wirklich VMs braucht, über Ansible geht's auch, genau, also wenn man"}, {"id": 300, "start": 1977.38, "end": 1981.26, "text": "wirklich VMs braucht ist das für mich so der beste Anbieter, den wir haben in Deutschland,"}, {"id": 301, "start": 1981.26, "end": 1984.46, "text": "das ist auch der Grund warum ich diese Sponsoring-Geschichte hier gemacht hab, ich verwende den Kram ja"}, {"id": 302, "start": 1984.46, "end": 1994.78, "text": "selber schon, keine Ahnung, 5 Jahre oder so, ja, was jetzt, also ganz ehrlich, die einzige"}, {"id": 303, "start": 1994.78, "end": 2000.34, "text": "Sache die mir noch ein bisschen fehlt wäre eine Managed Datenbank, das fände ich cool,"}, {"id": 304, "start": 2000.34, "end": 2003.86, "text": "hätten die noch eine Managed Datenbank, aber vielleicht, ich mein man sieht ja, dass sie"}, {"id": 305, "start": 2003.86, "end": 2008.26, "text": "das ausbauen, die haben jetzt diese Firewall-Geschichte hier eingebaut, dass du dich nicht mehr selbst"}, {"id": 306, "start": 2008.26, "end": 2014.02, "text": "drum kümmern musst und sie fangen jetzt ja hier auch an, dass du verschiedene Base-Images,"}, {"id": 307, "start": 2014.02, "end": 2017.78, "text": "wo du das hier verschiedene Base-Images verwenden kannst oder wie auch immer sie es machen mit"}, {"id": 308, "start": 2017.78, "end": 2023.62, "text": "vorinstallierten Anwendungen, vielleicht, vielleicht gibt es ja nochmal eine Managed Postgres oder"}, {"id": 309, "start": 2023.62, "end": 2029.42, "text": "sowas in nächster Zeit, das gucken wir uns dann auf jeden Fall im Stream an, wenn das"}, {"id": 310, "start": 2029.42, "end": 2034.78, "text": "soweit sein sollte, ja achso und nochmal was zur Nextcloud, weil das jemand eben gefragt"}, {"id": 311, "start": 2034.78, "end": 2039.74, "text": "hat, ich hab ja gesagt es ist vielleicht keine so gute Idee Nextcloud direkt ins Internet"}, {"id": 312, "start": 2039.74, "end": 2044.58, "text": "zu stellen und da kam die Frage im Chat, ja was denn sonst, wenn ich Nextcloud oder was"}, {"id": 313, "start": 2044.58, "end": 2053.06, "text": "soll man denn sonst mit Nextcloud machen, wenn nicht ins Internet, hier, genau, was sprich"}, {"id": 314, "start": 2053.06, "end": 2056.78, "text": "denn gegen eine Nextcloud im Internet, ist das nicht Sinn der Sache, Sinn der Sache mit"}, {"id": 315, "start": 2056.78, "end": 2060.78, "text": "Nextcloud ist ja, ja erstmal für was du es verwendest, verwendest du es für File Sync,"}, {"id": 316, "start": 2060.78, "end": 2065.18, "text": "dann ist File Sync der Sinn, Kalender Sync, sonst was, aber es ist nicht unbedingt der"}, {"id": 317, "start": 2065.18, "end": 2069.7, "text": "Sinn, es ins Internet zu packen, wichtig ist, dass deine Geräte drankommen zu dem Zeitpunkt,"}, {"id": 318, "start": 2069.7, "end": 2077.14, "text": "wo du es brauchst, also wenn es dir reicht, wenn du heim kommst im WLAN bist, dein Kalender"}, {"id": 319, "start": 2077.14, "end": 2081.5, "text": "einmal am Tag zu Syncen, dann musst du das nicht im Internet machen, wenn du Files Sync"}, {"id": 320, "start": 2081.5, "end": 2086.46, "text": "willst zwischen verschiedenen Geräten und die auch bei dir daheim im WLAN sind und es"}, {"id": 321, "start": 2086.46, "end": 2090.58, "text": "dir reicht einmal täglich den Abgleich zu machen, nein, dann musst du es nicht ins Internet"}, {"id": 322, "start": 2090.58, "end": 2094.98, "text": "packen und ich würde mich sogar dagegen aussprechen, standardmäßig den Nextcloud ins Internet"}, {"id": 323, "start": 2094.98, "end": 2101.26, "text": "packen, weil alles was nicht im Internet erreichbar ist, hat keine Probleme und auf Nextcloud lagern"}, {"id": 324, "start": 2101.26, "end": 2107.3, "text": "ja oftmals viele wichtige Sachen, von persönlichen Notizen bis Passwortsaves, bis irgendwelche"}, {"id": 325, "start": 2107.3, "end": 2112.38, "text": "privaten Fotos und die will man eigentlich nicht im Internet haben und das Einfachste,"}, {"id": 326, "start": 2112.38, "end": 2116.94, "text": "sich vor geklauten Daten und sonst was zu schützen ist, die Sachen einfach nicht aus"}, {"id": 327, "start": 2116.94, "end": 2121.02, "text": "dem Internet erreichbar zu machen oder auch nicht bei Dropbox oder sonst wie hochzuladen"}, {"id": 328, "start": 2121.02, "end": 2125.74, "text": "oder bei irgendeinem China-Chinesen-Anbieter, der dir verspricht, ja bei uns ist das super"}, {"id": 329, "start": 2125.74, "end": 2131.26, "text": "sicher und zwei Monate später gibt es im Darknet eine Passwort-Datenbank von denen,"}, {"id": 330, "start": 2131.26, "end": 2134.54, "text": "also das Einfachste, was du machen kannst, wenn du wirklich nicht willst, dass einer"}, {"id": 331, "start": 2134.54, "end": 2138.86, "text": "an deine Daten dran kommt, so ohne weiteres, ist sie einfach nicht hochzuladen oder nicht"}, {"id": 332, "start": 2138.86, "end": 2145.46, "text": "aus dem Internet zugreifbar zu machen und wo wir nochmal beim Thema Passwortsaves sind,"}, {"id": 333, "start": 2145.46, "end": 2150.98, "text": "so ein Zettel und ein Stift ist als Passwortsave zwar oldschool, aber gar nicht mal so schlecht,"}, {"id": 334, "start": 2150.98, "end": 2155.06, "text": "der Vorteil von einem Zettel und einem Stift ist, wenn irgendjemand bei euch einen Keylogger,"}, {"id": 335, "start": 2155.06, "end": 2161.54, "text": "gut Keylogger ist eh vorbei, wenn irgendjemand bei euch einen Hoodkit oder frag mir irgendwas"}, {"id": 336, "start": 2161.54, "end": 2169.58, "text": "installiert hat, der kann sich ohne Probleme das abziehen, was ihr auf der Festplatte habt,"}, {"id": 337, "start": 2169.58, "end": 2173.38, "text": "auch wenn die Festplatte voll verschlüsselt ist, weil wenn der Computer an ist, dann ist"}, {"id": 338, "start": 2173.38, "end": 2177.62, "text": "er ja entschlüsselt, weil der muss ja damit arbeiten. Habt ihr aber einen Zettel und einen"}, {"id": 339, "start": 2177.62, "end": 2183.22, "text": "Stift? Wenn irgendjemand euren Rechner verseucht hat, kommt da keiner an Zettel und Stift dran."}, {"id": 340, "start": 2183.22, "end": 2188.78, "text": "Ja, kriegst weh, gut, wenn du Angst vor einer Hausdurchsuchung hast, dann halt kein Zettel"}, {"id": 341, "start": 2188.78, "end": 2192.78, "text": "und Stift, dann gibt es aber immer noch die Möglichkeit, dass man einen USB Stick nimmt"}, {"id": 342, "start": 2192.78, "end": 2206.22, "text": "oder, oder sonst was, ja, also es muss nicht unbedingt direkt auf dem Rechner sein. Was"}, {"id": 343, "start": 2206.22, "end": 2211.06, "text": "ist mit Open Source Cloud Password Manager mit Bitworn? Den kann man ja auch rein lokal"}, {"id": 344, "start": 2211.06, "end": 2216.42, "text": "verwenden, ansonsten ich vertraue keinem Password Manager mit Cloud Anbindung. Die können so"}, {"id": 345, "start": 2216.42, "end": 2226.86, "text": "viel machen, wenn der Tag lang ist. Mein Passwort liegt offline auf einem Keypass, fertig. Nicht"}, {"id": 346, "start": 2226.86, "end": 2242.1, "text": "Cloud. Also meine Passwörter. Also wer Passwort Safe in der Cloud verwendet, möchte eigentlich,"}, {"id": 347, "start": 2242.1, "end": 2247.5, "text": "dass seine Passwörter geklaut werden. So hart muss man das sagen. Und es ist ja nicht der"}, {"id": 348, "start": 2247.5, "end": 2254.06, "text": "erste Anbieter jetzt irgendwie, wer waren das letztens, der Probleme hatte. Das kommt"}, {"id": 349, "start": 2254.06, "end": 2260.18, "text": "ja öfters mal vor. Ich weiß gar nicht mehr, war das Last Pass? Irgendein Anbieter hat"}, {"id": 350, "start": 2260.18, "end": 2266.26, "text": "auch letztens Probleme gehabt. Passwort Safe, technisch. Die sagen da natürlich alle immer"}, {"id": 351, "start": 2266.26, "end": 2273.02, "text": "so nach dem Motto, ja, eigentlich wurde ja gar nichts Schlimmes entwendet. Leute, das"}, {"id": 352, "start": 2273.02, "end": 2278.34, "text": "einfachste ist einfach Passwörter, ich meine, überlegt euch mal, Passwörter ist das Wichtigste"}, {"id": 353, "start": 2278.34, "end": 2282.9, "text": "eigentlich, was ihr habt. Damit kriegst du Zugang zu eurem Leben, um es mal übertrieben"}, {"id": 354, "start": 2282.9, "end": 2290.02, "text": "zu sagen. Sei es euer E-Mail-Account, eure Fotos, eure YouTube-Videos, was auch immer."}, {"id": 355, "start": 2290.02, "end": 2293.94, "text": "In Passwort Manager steht hier Zugang zu eurem Leben drin und den wollt ihr nicht in der"}, {"id": 356, "start": 2293.94, "end": 2302.26, "text": "Cloud irgendwelchen random Anbietern geben, die keine Ahnung haben, was sie damit treiben"}, {"id": 357, "start": 2302.26, "end": 2306.38, "text": "oder wo ihr keine Ahnung habt, was sie damit treiben. Die können euch doch viel erzählen,"}, {"id": 358, "start": 2306.38, "end": 2312.7, "text": "wenn der Tag lang ist. Natürlich, jeder Passwort-Anbieter wird euch erzählen, die Daten werden so verschlüsseln,"}, {"id": 359, "start": 2312.7, "end": 2317.2, "text": "dass wir sie auch nicht lesen können, wir loggen nichts großartig mit, wir machen hier"}, {"id": 360, "start": 2317.2, "end": 2321.94, "text": "und jenes und super secure. Das hat genau so lang Bestand, bis mal wirklich was ist und"}, {"id": 361, "start": 2321.94, "end": 2327.86, "text": "dann sagen sie, oh, ups, ja, da haben wir nicht dran gedacht. Diese Aussagen bringen"}, {"id": 362, "start": 2327.86, "end": 2335.42, "text": "euch überhaupt nichts. Genauso wie bei VPN-Anbietern. VPN-Anbieter sagen ja auch alle so nach dem"}, {"id": 363, "start": 2335.42, "end": 2338.74, "text": "Motto, macht euch keine Gedanken, wir loggen nichts, wir machen nichts, wir machen hier"}, {"id": 364, "start": 2338.74, "end": 2344.18, "text": "und da. Ich wette mit euch, wenn mal die Polizei beim VPN-Anbieter vor der Tür steht, da werden"}, {"id": 365, "start": 2344.18, "end": 2352.74, "text": "die sich ganz schnell überlegen, ob die nicht doch kooperieren. Also das ist alles Gelaber,"}, {"id": 366, "start": 2352.74, "end": 2366.46, "text": "man kann sich nicht darauf verlassen, was Anbieter einem da erzählen. Ja, weiß ich"}, {"id": 367, "start": 2366.46, "end": 2372.22, "text": "nicht, ob die die sünden, keine Ahnung. Wahrscheinlich sünden die schon und da zählt"}, {"id": 368, "start": 2372.22, "end": 2379.9, "text": "das auch als Cloud-Passwort-Manager, ja, klar. Das zählt auch, würde ich auch nicht machen."}, {"id": 369, "start": 2379.9, "end": 2390.5, "text": "Keypass auf Handy, das beste ist gar nicht. Weil, wenn du einen Keypass hast mit 100 Passwort"}, {"id": 370, "start": 2390.5, "end": 2395.58, "text": "da drinnen, wie viel brauchst du denn davon auf dem Handy? 5 vielleicht, ja. Brauchst"}, {"id": 371, "start": 2395.58, "end": 2403.42, "text": "auf dem Handy wahrscheinlich keine Ahnung. Twitter, Twitter, Twitch, YouTube, Mail und"}, {"id": 372, "start": 2403.42, "end": 2411.46, "text": "noch irgendwas. Ja gut, wenn du nur einen Keypass hast, wo nur die Sachen drinnen stehen"}, {"id": 373, "start": 2411.46, "end": 2416.94, "text": "fürs Handy, dann kann man das machen. Aber ganz ehrlich, ich finde die Idee, wenn man"}, {"id": 374, "start": 2416.94, "end": 2422.06, "text": "das machen will und ein iPhone hat, die Passworte, die man eh übers Handy macht, die kann man"}, {"id": 375, "start": 2422.06, "end": 2426.06, "text": "ja meinetwegen auch in die iCloud stecken, wenn man Apple vertraut, das ist ja immer"}, {"id": 376, "start": 2426.06, "end": 2429.78, "text": "die Frage. Aber es ist halt wichtig, dass man nicht den ganzen Passwort-Save dann irgendwie"}, {"id": 377, "start": 2429.78, "end": 2435.3, "text": "rumsüngt mit 100 Passwörtern für sonst was, die man da überhaupt nicht braucht. Aber"}, {"id": 378, "start": 2435.3, "end": 2441.14, "text": "was spricht denn dagegen, wenn man die Passwörter einmal eingibt und dann nicht mehr? Weil"}, {"id": 379, "start": 2441.14, "end": 2447.18, "text": "die meisten Apps, sei es jetzt Twitch oder sonst wie, da musst du dich einmal anmelden,"}, {"id": 380, "start": 2447.18, "end": 2450.78, "text": "dann holen die sich irgendeinen Token und gut ist und sie funktionieren weiter. Auch"}, {"id": 381, "start": 2450.78, "end": 2455.9, "text": "YouTube, also du musst dich ja nur einmalig anmelden. Das kann man doch machen. Dann braucht"}, {"id": 382, "start": 2455.9, "end": 2458.42, "text": "man auch keinen Passwort-Manager auf dem Handy. Ich habe auch keinen Passwort-Manager auf"}, {"id": 383, "start": 2458.42, "end": 2469.66, "text": "dem Handy. Zwei Faktor hat nochmal ganz eigene Probleme. Zwei Faktor-Authentifizierung ist"}, {"id": 384, "start": 2469.66, "end": 2473.74, "text": "sicherer, wobei man halt sagen muss, wenn Passwort und Zwei Faktor-Authentifizierung"}, {"id": 385, "start": 2473.74, "end": 2478.82, "text": "auf dem Handy sind, dann ist es ja kein Zwei Faktor mehr. Das ist so, wie wenn ich Zwei"}, {"id": 386, "start": 2478.82, "end": 2483.18, "text": "Faktor-Authentifizierung über meinen Passwort-Manager mache. Das ist dann auch kein zweiter Faktor."}, {"id": 387, "start": 2483.18, "end": 2488.54, "text": "Wisst ihr, wie ich meine, zweiter Faktor ist es ja nur, wenn das eine mit dem anderen"}, {"id": 388, "start": 2488.54, "end": 2492.94, "text": "nichts zu tun hat. Aber wenn ich mein Passwort auf dem Handy habe und Zwei Faktor-Authentifizierung"}, {"id": 389, "start": 2492.94, "end": 2497.98, "text": "mit dem gleichen Handy mache, dann ist es kein zweiter Faktor mehr. Aber das eigentliche"}, {"id": 390, "start": 2497.98, "end": 2501.98, "text": "Problem an Zwei Faktor-Authentifizierung ist, was passiert, wenn du die Zwei Faktor-Authentifizierung"}, {"id": 391, "start": 2501.98, "end": 2508.58, "text": "verlierst. Und das geht schneller, als man denkt. Du upgradest dein iPhone, versuchst"}, {"id": 392, "start": 2508.58, "end": 2513.24, "text": "es zu sünden und der Microsoft Authenticator hat die Hälfte vergessen. Was er standardmäßig"}, {"id": 393, "start": 2513.24, "end": 2520.5, "text": "hat, solange du nicht den Microsoft-Account verknüpft hast. Und dann hast du ein Problem."}, {"id": 394, "start": 2520.5, "end": 2530.58, "text": "Je nach Anbieter, recoveren die das nicht so einfach. Das ist wichtig, genau, manche geben"}, {"id": 395, "start": 2530.58, "end": 2537.02, "text": "dir Codes mit, die du speichern kannst, um Zwei Faktor-Authentifizierung auszuschalten"}, {"id": 396, "start": 2537.02, "end": 2541.3, "text": "oder dich einmalig einzuloggen. Und dann ist auch wieder die Frage, was macht man damit?"}, {"id": 397, "start": 2541.3, "end": 2545.5, "text": "Schreibt man die mit in den Passwort-Manager? Damit hat man ja eigentlich den zweiten Faktor"}, {"id": 398, "start": 2545.5, "end": 2552.98, "text": "schon wieder ausgehebelt. Weil dann hat jemand ein Einwegpasswort, das heißt, das beste,"}, {"id": 399, "start": 2552.98, "end": 2557.58, "text": "was man in dem Fall machen kann, ist tatsächlich, sich das auszudrucken oder auf ein USB-Stick"}, {"id": 400, "start": 2557.58, "end": 2562.22, "text": "zu legen. Wobei da wiederum das Problem ist, ihr seht, so einfach ist das gar nicht. Da"}, {"id": 401, "start": 2562.22, "end": 2567.7, "text": "wiederum da das Problem ist, irgendwann ist auch mal der Punkt erreicht, wo die meisten"}, {"id": 402, "start": 2567.7, "end": 2572.46, "text": "Leute sagen, es wird unbequem. Und es wird immer an der Stelle unsicher, wo es unbequem"}, {"id": 403, "start": 2572.46, "end": 2582.14, "text": "wird. Sobald es unbequem wird, machen die Leute blöde Sachen. Also man muss es nicht"}, {"id": 404, "start": 2582.14, "end": 2587.52, "text": "übertreiben. Also ihr werdet nicht die perfekte Lösung finden, aber ihr müsst einfach dran"}, {"id": 405, "start": 2587.52, "end": 2594.66, "text": "denken, so jede Lösung ist besser als Plain Text Passwort TXT. Wenn ihr jetzt eine Plain"}, {"id": 406, "start": 2594.66, "end": 2599.1, "text": "Text Passwort TXT habt, dann ist das beste und einfachste, was ihr machen könnt, ihr"}, {"id": 407, "start": 2599.1, "end": 2602.94, "text": "geht in Firefox, also mal angenommen, wir reden jetzt mal nur für den Desktop, ja,"}, {"id": 408, "start": 2602.94, "end": 2610.82, "text": "ihr geht in Firefox, wenn ihr Firefox verwendet, geht Privacy and Security und setzt ein Master"}, {"id": 409, "start": 2610.82, "end": 2617.34, "text": "Passwort für eure Logins und speichert das darin. Ja, Master Passwort, wo geht denn das"}, {"id": 410, "start": 2617.34, "end": 2622.94, "text": "überhaupt? Use Primary Passwort. Das ist quasi ein Passwort Manager eingebaut in Firefox."}, {"id": 411, "start": 2622.94, "end": 2627.82, "text": "Also wenn ihr aktuell ein Passwort TXT verwendet, wir reden hier von der Text Datei Unverschluss"}, {"id": 412, "start": 2627.82, "end": 2635.66, "text": "bei euch auf dem Rechner, also unsicherer kann es ja nicht werden, dann macht es Master"}, {"id": 413, "start": 2635.66, "end": 2641.34, "text": "Passwort im Firefox, wenn sonst gar nichts geht. Oder nehmt Key Pass oder was auch immer."}, {"id": 414, "start": 2641.34, "end": 2647.7, "text": "Also alles ist besser als eine Passwort TXT auf dem Desktop. Ihr könnt euch den Kram"}, {"id": 415, "start": 2647.7, "end": 2661.26, "text": "auch ausdrucken, sogar das ist besser. Chandler, du bist nicht, genau, ich hab davor schon"}, {"id": 416, "start": 2661.26, "end": 2665.88, "text": "zwei Stunden gestreamt. Okay Leute, wir machen im nächsten Stream weiter, heute hab ich zu"}, {"id": 417, "start": 2665.88, "end": 2671.02, "text": "viel Bedenken, dass es irgendwelche Dino-Geschichten gibt, es lohnt sich jetzt nicht weiterzumachen."}, {"id": 418, "start": 2671.02, "end": 2685.5, "text": "Du meinst dein Cousin? Cousin war das letzte Preis. Ja, Excel Passwort Datei ist das gleiche,"}, {"id": 419, "start": 2685.5, "end": 2690.34, "text": "kommt das gleiche raus. Aber ich kenne viele Leute, die verhalten Passwort TXT auf dem"}, {"id": 420, "start": 2690.34, "end": 2702.94, "text": "Desktop. Wenn mir das weitergeleitet hat, das ist doch von dir das Emote. Ich hab mir"}, {"id": 421, "start": 2702.94, "end": 2707.98, "text": "das einfach von Bella Twitch TV runtergeladen. Und ich hab mir gedacht, das passt schön"}, {"id": 422, "start": 2707.98, "end": 2726.38, "text": "zu Whoop Pet. Oder hast du was dagegen, dass ich das Emote nehme? Ich mein, das ist meine"}, {"id": 423, "start": 2726.38, "end": 2739.34, "text": "Katz, dein Emote. Können wir uns jetzt teilen? Albe, Albe. Das kann man auch machen, ja."}, {"id": 424, "start": 2739.34, "end": 2742.9, "text": "Leute, danke für die ganzen Subs, ich guck noch mal schnell rein, bevor ich jetzt aufgehe."}, {"id": 425, "start": 2742.9, "end": 2753.5, "text": "Wen haben wir denn hier am Start? lolmann.de ist am Start, nice. Warface, Daniel Lull hat"}, {"id": 426, "start": 2753.5, "end": 2762.98, "text": "wieder Subscribed für 25 Monate. Stellt euch das mal vor, Massive, Alter. Makishi ist am"}, {"id": 427, "start": 2762.98, "end": 2773.18, "text": "Start. Alex Vegan, den hab ich schon gesehen, aber trotzdem danke für die ganzen Subs,"}, {"id": 428, "start": 2773.18, "end": 2780.22, "text": "Leute. Massive. Big Brain Subscription hier wieder. Subsraten, wie rum, du hast doch letzten"}, {"id": 429, "start": 2780.22, "end": 2789.02, "text": "Mal schon einen gekriegt. 8Kill, dankeschön, 2 Monate Subscription. Arci, 1004 Leute, wenn"}, {"id": 430, "start": 2789.02, "end": 2798.26, "text": "euch der Stream gefällt und ihr noch ein Prime-Sub am Start habt. Any Primers. Und wenn ihr"}, {"id": 431, "start": 2798.26, "end": 2804.38, "text": "nicht mir gebt, dann gebt mir irgendjemand anderes. Ansonsten schenkt ihr Amazon einfach"}, {"id": 432, "start": 2804.38, "end": 2830.02, "text": "nur Geld. SSL bei Hetzner, was genau ist die Frage? SSL bei Hetzner. Donboy, 3 Monate,"}, {"id": 433, "start": 2830.02, "end": 2839.02, "text": "nice für den Sub. Battlefield 1 ist, stimmt, Battlefield 1 ist free, ja, aber ich werd"}, {"id": 434, "start": 2839.02, "end": 2846.22, "text": "Battlefield 1 trotzdem nicht spielen. Wie gesagt, ich würde die gar nicht sunken zwischen"}, {"id": 435, "start": 2846.22, "end": 2850.54, "text": "PC und Handy, weil du viel zu viele Passwörter auf deinem Handy mitsüngst, die du da nie"}, {"id": 436, "start": 2850.54, "end": 2864.86, "text": "brauchen wirst. Ich würde die 5 Passwörter einfach von Hand eingeben auf dem Handy, meistens"}, {"id": 437, "start": 2864.86, "end": 2869.74, "text": "muss man das ja nur einmal machen und dann ist gut. Bieten die letztes ein Crypt? Äh,"}, {"id": 438, "start": 2869.74, "end": 2873.34, "text": "ich hab noch nie eine Domain verwendet, also ich hab noch nie eine Domain gekauft bei Hetzner,"}, {"id": 439, "start": 2873.34, "end": 2877.42, "text": "muss ich ehrlich sagen. Äh, über die Hetzner Cloud ist es natürlich einfach, so wie bei"}, {"id": 440, "start": 2877.42, "end": 2881.78, "text": "jedem anderen Cloud-Anbieter auch. Du lockst dich ein, startest Let's Encrypt oder nimmst"}, {"id": 441, "start": 2881.78, "end": 2886.58, "text": "einen Web-Server mit Let's Encrypt und es funktioniert. Ähm, Domains weiß ich nicht,"}, {"id": 442, "start": 2886.58, "end": 2891.62, "text": "hab ich noch nie verwendet bei Hetzner. Wahrscheinlich gehts da auch relativ einfach, keine Ahnung,"}, {"id": 443, "start": 2891.62, "end": 2899.18, "text": "weiß ich nicht, hab ich neulich ausprobiert. Subs raten? Ok Leute, weil ihr es seid, wir"}, {"id": 444, "start": 2899.18, "end": 2904.38, "text": "raten jetzt Subs. Also, Moment, muss mal selbst nachgucken, wie viel Subs hab ich denn jetzt?"}, {"id": 445, "start": 2904.38, "end": 2914.58, "text": "Ok, alles klar, also wer am nächsten dran ist, gewinnt. Ab jetzt, wie viele Subs hab"}, {"id": 446, "start": 2914.58, "end": 2940.14, "text": "ich gerade? Ok, 5, 4, 3, 2, 1, Stopp. Also, ich wollt jetzt ja nicht spoilern, ich hab"}, {"id": 447, "start": 2940.14, "end": 2944.54, "text": "relativ wenig gestreamt in letzter Zeit, dementsprechend sind die Zahlen wieder hardcore getropft,"}, {"id": 448, "start": 2944.54, "end": 2955.34, "text": "also schauen wir mal, ob da jemand in der Nähe war. Aktuell ist 221 Subs. Jaja, das"}, {"id": 449, "start": 2955.34, "end": 2961.22, "text": "jetzt ist zu spät, jetzt ist zu spät. Das ist getropft von 350 oder so, aber ja, macht"}, {"id": 450, "start": 2961.22, "end": 2973.98, "text": "nix, selbst schuld, wenn ich nicht spiele, äh, nicht streame. 210 ist schon mal gut,"}, {"id": 451, "start": 2973.98, "end": 2985.46, "text": "also 221, jaja. Wer ist denn am nächsten dran? Ok, 220, der Serious Max, hast du wirklich"}, {"id": 452, "start": 2985.46, "end": 2994.5, "text": "220 tatsächlich? 220, hat jemand 222? Nee. Der Serious Max, dann darfst du dir einen"}, {"id": 453, "start": 2994.5, "end": 3017.5, "text": "aussuchen, der nen Sub bekommt. Du hast ja schon einen. 219, 219 hat keiner. Dann sucht"}, {"id": 454, "start": 3017.5, "end": 3044.82, "text": "der einen aus. Der Sarix, ok, der kriegt einen. Ich überweis Chef jetzt mal kurz, 250. Sollte"}, {"id": 455, "start": 3044.82, "end": 3063.54, "text": "eigentlich, ja, nice, Fock. Fock, alles klar Leute, reicht für heute, ich hau jetzt ab."}, {"id": 456, "start": 3063.54, "end": 3072.42, "text": "Bis morgen früh, geht ganz normal los, wieder so kurz vor 10 oder sowas, 9.30 oder um 10."}, {"id": 457, "start": 3072.42, "end": 3078.62, "text": "Gucken wir mal. Bis dann, machts gut, see you, keck bye."}]}