{"text": "So, jetzt sollte es besser aussehen, jetzt sollte es viel besser aussehen, also viel flüssiger sollte es jetzt sein. Muss man das Karten mal in der Vorschau angucken? Naja, ist das jetzt wirklich flüssiger? Mist Frames. Naja, ich hab keinen, jetzt ist es ok, jetzt. Doch, jetzt ist es gut, jetzt ist es gut, jetzt ist flüssiger als vorher. Naja, ich guck mal wieviel FPS ich hab hier, ja, jetzt ist es gut, jetzt ist es gut, jetzt ist es gut, ich hab ne Donation gekriegt, gleich mal gucken. Tuko, moin Max. Eine kurze Frage ist, der i5-6600k ein Bottle Neck für die Asus 1080. Normalerweise würde ich sagen es sind eher Grafikkarten. Das Bottle Neck. Kommt aber natürlich immer auf das Game ab. Ah! Liege! Liege, Henne! Also ich finde jetzt ist eine ganze Ecke flüssiger als vorher. Zack, ich wollte ihn mal wiederbeleben. Das ist halt immer die Frage, was du haben willst, ne? Also wenn er da so drauf besicht, dass quasi unter 140 FPS nichts geht, also quasi ab 150 FPS geht's los und da musst du auch keine 4K spielen oder sonst was in der Richtung. Da ist in der Regel GPU erstmal der limitierende Faktor. Kommt aber auf das Game an. In der Regel, je höher die Details sind, umso höher die Auflösung ist. Umso mehr hast du das Problem natürlich auf der GPU. Das wird schwierig jetzt zu kriegen. Stickstoffkühler. Ui, hüpf, hüpf, hüpf. Ja na klar, hätt ich mal hier Dreierboss gemacht. Mit einer 1080 und einem halbwegs aktuellen Prozessor bist du in der Regel gut dabei. Guck mal hier, letting's go. Wo sind die? Ah! Ah! Eine Gegner da! Ich kann nicht anwetzen! Die rutschen da wieder voll drüber! Ich muss überhaupt nichts machen! Nein, doch! Jetzt läuft es! Aber ich sehe es in der Vorschau! Das läuft jetzt viel flüssiger! Vorher war es irgendwie... Keine Ahnung! Wenn es hoch kommt, 30 FPS und jetzt sind es halt konstanter 48! Ja, Pupke läuft überall kacke! Ich habe mich ausgeschneibert! Schneuber! Schneuber! Was, der lebt noch? Ich dachte, das ist einfach nur eine Leiche! Auf hier! Yolo durch jetzt! Yolo! Warum ist der jetzt down? Jetzt bin ich hier extra hin gerannt, verrecke wahrscheinlich noch und jetzt geht die Map auf in dem Moment, wo ich verreckt bin! Ja, natürlich! Was sonst? Hdr ist die beste Erfindung seit einer Weile! Ich wünsche mir mehr Hdr-Games! Und das Hdr... Also was ich mir wünsche ist das, was ich... So bei Monitorentwicklung und so... Bei Monitorentwicklung würde ich mir wünschen, dass es 4K 144Hz Hdr-Monitore gibt! Allerdings erwarte ich gar nicht, dass die 4K mit 144Hz können! Ich will, dass die 144Hz und 4K können, aber sie müssen es nicht gleichzeitig können, weißt du, wie ich meine? Also ich will beispielsweise meinen Desktop auf 4K stellen, da reichen mir auch 60Hz, das ist vollkommen in Ordnung! Und ich will, wenn ich spiele, auch in Anbericht der Tatsache, weil ich viel FPS haben will, in Spielen will ich 1080p mit 144Hz haben, alles am gleichen Monitor! Und am besten noch mit Hdr, weil Hdr... Wer sich einmal ein bisschen Hdr-Filme angeguckt hat, das sieht einfach geil aus! Ja, das stimmt, auf den Hdr-Standard müssten sie sich jetzt doch einigen! Jetzt fragt er! LOL! LOL! Aufblade! Naja, was will der Typ? Anstrengend, ey! Das ist geil, ich muss überhaupt nichts machen, ich werde übelst gecarried! Aber ich muss sagen, der Creeping Death, der carried ganz schön und auch der Major Schlumpf! Der Major Schlumpf, der ist ja im Chat! Der ist von einer Skala von 1-10, wie sehr interessiert dich Politik? Kommt drauf an, was für ein Bereich! Ich finde es ist ein ganz schöner Fail, dass es keine Partei so wirklich schafft, mich dafür zu interessieren! Ich bin nicht jemand, der sich... Ich kriege immer Anfälle, wenn die irgendwas vom Internet-Ausbau schreiben! Das ist einfach unglaubwürdig hoch 3! Der erste ist, was er erzählt hat, was angeblich ganz toll wird und so! Hallo Heli, Stern! Ich bin nicht Colonel 100, bekommen Sie das? Ich bin nicht Colonel 100, weil ich auf 360 und PS3 gespielt habe! Ich habe am Ende PC gekriegt, Battlefield 3! Auf das Boarden Leute! Wo ist er? Da ist er! Haha, LOL! Du kannst fragen, was ich gewählt habe! Ich habe ungültig gewählt! Ich war da, aber ich konnte mich nicht überwinden, bei irgendeiner Größe das Kreuz hinzumachen! Ich hatte keinen Bock, mich so in Detail über kleinere Parteien zu informieren, ob da nicht vielleicht auch was dabei ist! Das Problem ist, was ich auch damit habe, ich kann auf die meisten Aussagen nichts mehr geben! Du kannst davon ausgehen, was erzählt wird, wird einfach erzählt, weil es aktuell entweder die Linie ist, was gesagt werden muss oder weil man es gerade am taktisch sinnvollsten hält, es zu sagen! Nicht, weil da irgendjemand davon überzeugt ist oder wirklich vor hat, das zu machen, sondern einzig und allem, weil es gerade am besten passt! Zumindest habe ich den Eindruck, dass das bei vielen so ist! Du siehst ja auch bei den ganzen Aussagen immer Internetausbau bis 2002, bis 2015, bis 2008, bis 2012, bis 2013, 14, 15, 16, 17, jetzt haben wir angeblich bis nächstes Jahr, also quasi bis in drei Monaten, 50 MBit für alle! Wem wollen die das denn wirklich erzählen? Wem wollen sie das ernsthaft erzählen? Das ist totaler Bullshit! Und natürlich, man kann sich das am Ende alles so schön zurechtfaken, dass das stimmt, was man gesagt hat! Das nimmt dann so Ausmaße an, wie dass man zum Beispiel sagt, hey wir meinen ja mit Flächendecken nicht jeden, sondern wir meinen mit Flächendecken bloß so und so viel Prozent der Fläche von Deutschland! Das Problem bei der Sache ist aber, dass vor allem, wenn man sich mal ein Gebiet im Osten anguckt, halt da sehr viel, also nicht Fläche, sondern Haushalte, so und so viele Haushalte in Deutschland angeschlossen sein müssen mit so und so viel! Aber wenn man mal in Osten guckt, ganz viele Landstriche groß sind, also ziemlich viel Land haben und wenig Einwohner, dann heißt das, dass ein riesengroßes Gebiet nichts Gescheites bekommt! Und es gibt Leute, die haben heute noch DSL-Lite oder gar nichts! Und hallo, ich meine wir sind Deutschland im Jahr fast 2018! Das kann doch nicht sein! Oder aber, der nächste Trick ist, den sie immer bei sowas ganz gerne haben, man definiert sich Mobil, Mobilfunk-Technologien mit dabei, als Freifang! So, so nach dem Motto, ja irgendwo in der Nähe gibt es einen LTE-Mast! Und dann gibt es einen Telekom-Hybrid oder so ein Kack! Das wird absichtlich so formuliert, dass man sich wieder schön rauslegen kann! Wird mal jemand sagen, wir haben einen sinnvollen Plan, also sprich nicht einfach nur sagen, sondern quasi auch belegen können, hier wir haben uns Gedanken dazu gemacht und so und so wollen wir das erreichen und das sieht für mich sinnvoll aus! Dem würde ich das auch glauben, wenn jetzt jemand sagt, hier wir wollen Festnetz, also quasi das Anschluss in jeder Wohnung rauskommt bis 2020 mit mindestens 1 Gigabit! Sagen wir mal, dass wir nicht nur hinterher rennen, sondern auch mal gleich ziehen! Wenn das jemand sagen würde und sagt, hier folgenden Plan haben wir dafür, so und so haben wir uns die Finanzierung vorgestellt, wenn das glaubhaft klingt, dann würde ich mich auch überzeugen lassen! Ist ja nicht so, dass ich mich nicht überzeugen lassen will, aber aktuell glaube ich da kein Wort! So und so geht es mir über viele Themen in der Richtung! Will der jetzt auf den Boden hauen oder? Ja! So viel dazu! Prinz ich muss wieder nichts machen, ich kann einfach fett gecarried! Komm her! Oh, der ist... Die wollen hier Leute abwerfen! Zum Glück fliegen die nicht zu den Enkrams, sondern sonst wo hin! Ich glaube die meisten Leute, die AfD gewählt haben, weil das gerade welche im Chat schreiben, sind hauptsächlich welche, die in der Richtung sind! Die entweder enttäuscht waren von anderen oder denen es ähnlich ging, wie ich! Wie gesagt haben wir, sie trauen da keine mehr was zu! Da kommt halt jemand um die Ecke, der noch nicht so vorbelastet ist mit Sachen, die er erzählt hat und nicht gemacht hat, die halt relativ neu sind! Ich glaube viele Leute wollten gar nicht unbedingt die AfD wählen, sondern sie wussten nicht, was sie sonst wählen sollten! So aus Protest einfach! Und was man auch nicht vergessen darf, ich hatte nicht das Gefühl, dass die etablierten Parteien und die Parteien, die an der Regierung waren, sich sonderlich gut, zumindest auch PR-technisch, um die Anliegen der Leute gekümmert haben, was die Leute so bewegt hat! Es mag sein, ich will nicht sagen, dass nichts gemacht wurde oder so, zumindest hätten sich mal ordentlich PR-Leute holen sollen oder Marketing-Leute, die es auch geschafft hätten! Und die schaffen würden den Leuten ordentlich zu verklickern, was sie gemacht haben, wenn sie was gemacht haben! Weil das kam überhaupt nicht raus! Ja, Mr. Freigeist ist nicht ähnlich! Die wenigsten, die AfD gewählt haben, sagen, jawohl, best ever! Umso mehr Leute oder Gruppen, die sich nicht verstanden fühlen, umso radikaler wird das Ganze! Ich bin auch der Ansicht, dass man keine extra Wurst machen sollte für schwule, lesbische Frauen oder für Frauen oder sonst was! Weil umso mehr man es versucht, allen Recht zu machen, umso weniger klappt das! Und ich kenne genug Frauen, auch die in der IT arbeiten, die sagen, sie haben eigentlich gar keinen Bock drauf, dass irgendjemand sagt so nach dem Motto, ja du bist Frau, du musst jetzt besonders gefördert werden, dass du auch mal was auf die Reihe kriegst! Das wollen viele gar nicht! Und viele Schwule wollen das auch nicht! Und wenn man sich natürlich besonders um eine Gruppierung kümmert, egal welche, können dann andere zurecht wieder sagen, hey, warum wird sich um die gekümmert und um uns nicht? Ich finde, man sollte da gar nicht so viel, umso mehr man drüber redet, umso mehr man drüber redet so nach dem Motto, hey, das muss hier gemacht werden, das muss da gemacht werden, sonst was! Auch beim Thema hier, wie irgendwie Leute integriert werden müssen und sonst was! Umso mehr darüber geredet wird und umso mehr extra Wurst gemacht wird, ich finde, umso weniger integriert ist das eigentlich! Wenn du immer wieder darauf hinweisen musst, ja, ihr gehört ja eigentlich gar nicht richtig dazu, deswegen fördern wir euch jetzt und machen wir jetzt, dann weiß ich nicht, ob das dazu führt, dass man sich mehr dazugehörig fühlt! Ist meine Ansicht zu der Sache, aber würde ich jetzt auch nicht weiter ausdehnen! Und was mir in Deutschland, das muss ich doch loswerden, was mir echt auf den Sack geht, ist, dass über viele Sachen einfach nicht gesprochen wird! Und wenn mal über unangenehme Sachen gesprochen wird, da kommt dann gleich wieder sowas raus wie, ja, das sind ja Nazi Ideologien oder das sind ja ganz böse Nazis, alles und sonst was! Hey, keine Ahnung, mag sein, sonst was, aber normalerweise würde ich sagen, wenn jemand ein Argument bringt, egal wie dumm und meinetwegen egal wie Nazi sonst was dieses Argument ist, wenn das Argument scheiße ist, soll es doch einfach sein, einfach aus dem Handgelenk was zu schütteln so nach dem Motto! Guck mal aus, Punkt A, B, C ist dein Argument Schwachsinn, easy, überhaupt kein Problem, dann hättest du dem Typ voll den Wind aus den Segel genommen! Aber, wenn du sagst nach dem Motto, wir diskutieren mit dir da nicht drüber, weil du ein scheiß Nazi bist, kann es sogar sein, dass du stimmt, ja, dann werden sich immer wieder Leute finden, die sagen, so, und jetzt erst recht, die dann quasi auch, die müssen dann quasi diese Leute wieder sagen, ja, die irgendeinen Scheiß vor mich geben! Für die ist das gut, wenn man sagt, hier, wir reden mit dir nicht mehr drüber, kack Nazi, weil die müssen gar nicht beweisen, dass das stimmt, was sie sagen! Die können einfach irgendwas sagen, dann wird erzählt, ja, hier halt die Fresse, scheiß Nazi, und die Anhänger von denen finden es dann auch geil, wenn sie nach dem Motto, jawoll, ich wusste doch, der Typ hat Recht! Würden die mal die Leute in ne Lage bringen, dass die eben begründen müssen, was die da erzählt haben und warum das richtig ist, dann würden sie die viel mehr in Bedrängnis bringen und dann würden die Leute auch sehen, was ein Blödsinn, warum sollte ich das dem überhaupt klauen! Man muss einfach drüber reden, und das ist das Problem, was wir haben, wir reden über nichts! Und zum Thema sowas mit links und rechts, das nimmt sich beides nix, ich war vor ein paar Jahren in Dresden und da war ein ganz tolles Ereignis, wo ich mal wieder gesehen habe, dass beide Seiten den totalen Dachschaden haben! Die Rechten haben irgendwelche Ausländer zusammengeschlagen, kommt in Dresden leider öfters mal vor! So, und was haben die Linken da quasi dann als Antworter drauf gemacht? Die haben nicht etwa die Rechten zusammengeschlagen, die die Ausländer zusammengeschlagen haben, nein, die sind zum nächsten Polizeirevier gefahren und haben es angesteckt! Haben Steine reingeworfen, Molotov Cocktails reingeworfen, was auch immer, weil die Polizei so böse war und nix gemacht hat! Wo ist denn da die Logik dahinter, das ist einfach total bescheuert! Da sieht man radikale von beiden Seiten, das nimmt sich nix! Denen geht's bloß noch vordergründig um sowas! In Wirklichkeit wollen sie alle einfach nur ein bisschen Stress schieben! Bescheuert kann man sein, dass die Antwort darauf ist, wenn Rechte den Ausländer zusammenschlagen, dass man dann das Polizeirevier anzündet! Also da müssen ein paar Chromosome fehlen, da muss geistig richtig zurückgeblieben sein, dass man die richtige Antwort darauf hält! Genug drüber aufgeregt, jetzt werden wir die Runde noch gewinnen! Das ist richtig YOLO Style, fahren wir da jetzt rein! Okay, du bleibst hier stehen, du schießt drauf und ich lege, ich mach die ultimative Legehände! Moment, warum lassen wir das hier stehen? Alter, du sollst das hier stehen lassen! Nicht stehen lassen! Was soll das? Hab ich doch nicht weg, da sehe ich doch nichts mehr! Achso, wir haben es schon, okay, ich vergesse es! Ups! Oh nein, ich werde gleich wieder gekickt vom Server! Was? Soundbuck? Moment, muss ich mal hören, echt? Nö, kein Soundbuck! Was ich auch bedenklich finde ist, was auch noch dazu beiträgt, dass viele Leute Probleme haben, überhaupt zu erkennen, dass es Leute mit anderen Ansichten gibt und zu erkennen, dass es vielleicht in manchen Bereichen überhaupt Probleme gibt. Ich finde, es ist auf die Medien nicht ganz unschuldig dran, denn wenn man heute auf Facebook oder Twitter geht und quasi neu ist, also nur ein paar Tracking Cookies im Browser hat, dann versucht Facebook einem zu erzählen, was einem gefällt. Das ist auch aus Sicht von Facebook vollkommen logisch, dass sie das probieren, weil sie wollen halt, dass man möglichst viel Zeit darauf verbringt. Das Problem, was ich dabei sehe, ist bloß, wenn du einmal quasi in einer speziellen Kategorie drin bist, kriegst du nur noch Sachen empfohlen, die eben deinen Gewohnheiten und dem, was Facebook denkt oder Twitter denkt oder irgendeiner denkt dir gefällt, kriegst du da natürlich vermehrt gezeigt, das heißt, du siehst gar nicht mehr, dass es da noch anderes Zeug gibt. Das halte ich für ein bisschen problematisch. Also jetzt mal als jemand, der Facebook gar nicht verwendet, dafür andere Sachen wie Twitter, aber das halte ich echt für problematisch. Hallo, warum lebt das jetzt noch? Max, was ist ein guter Job für 15 Jahre, wo man halbwegs was verdient? Jetzt egal, wie kacke der Job ist. Keine Ahnung. Keine Ahnung. Ach, Quatsch. Systemadicate, das ist was, das sehe ich komplett anders. Wenn was scheiße ist, man sollte es nicht verbieten. Man sollte einfach alle Leute erkennen lassen, dass es scheiße ist und das in der Bedenkung, in der Bedeutungslosigkeit verschwinden lassen. So wie das mit vielen anderen Sachen auch passiert ist. Verbieten trägt meistens dazu bei, dass es noch relevanter wird. Oder interessanter zumindest, relevanter ist eine andere Frage. Es gibt da viele Sachen, die diskutiert werden sollten, aber was wir nicht machen. Andere Länder aber auch so. Also es ist nicht nur bei uns so. Das haben die Griechen besser gemacht. Am Ende hat es ihnen aber auch nichts gebracht. Ne, jetzt entschärft der Typ auch noch. Fuck. Auch in einer halben Stunde geht Contenders los. Vorletzte Runde würde ich sagen. Guck mal, sind auch schon alle vom Server runter. Vielleicht sogar letzte Runde. Und danach müssen wir den Friseur hausen. Ganz, ganz wichtig. Ob ich ein Traumauto habe? Ich bin allgemein nicht so der Autokennner und Versteher. Ich habe einen alten Opel Agila gerade, den ich kaum verwende. Also Autos. Ich glaube bei Autos bin ich der Falsche. Da kommt ein Panzer. Max, kannst du uns da für die exakten Namen der PC Teile nennen? Für was? Für meinen neuen PC habe ich die Teile noch nicht, weil ich noch die CPU nicht habe. So Leute, ich haus jetzt den Friseur. Ich hoffe euch hat es gefallen. Und spammt mal bitte beim Fabian ein bisschen rum. Debated, overrated, was auch immer. Spammt mal irgendeinen Mist rum. Und macht es gut. Bis zum nächsten Mal. Tschüss. Wahrscheinlich morgen schon.", "segments": [{"id": 1, "start": 0.0, "end": 14.92, "text": "So, jetzt sollte es besser aussehen, jetzt sollte es viel besser aussehen, also viel"}, {"id": 2, "start": 14.92, "end": 16.84, "text": "flüssiger sollte es jetzt sein."}, {"id": 3, "start": 16.84, "end": 27.72, "text": "Muss man das Karten mal in der Vorschau angucken?"}, {"id": 4, "start": 27.72, "end": 36.08, "text": "Naja, ist das jetzt wirklich flüssiger?"}, {"id": 5, "start": 36.08, "end": 37.08, "text": "Mist Frames."}, {"id": 6, "start": 37.08, "end": 51.08, "text": "Naja, ich hab keinen, jetzt ist es ok, jetzt."}, {"id": 7, "start": 51.08, "end": 57.64, "text": "Doch, jetzt ist es gut, jetzt ist es gut, jetzt ist flüssiger als vorher."}, {"id": 8, "start": 57.64, "end": 77.68, "text": "Naja, ich guck mal wieviel FPS ich hab hier, ja, jetzt ist es gut, jetzt ist es gut, jetzt"}, {"id": 9, "start": 77.68, "end": 87.56, "text": "ist es gut, ich hab ne Donation gekriegt, gleich mal gucken."}, {"id": 10, "start": 87.56, "end": 88.56, "text": "Tuko, moin Max."}, {"id": 11, "start": 88.56, "end": 94.4, "text": "Eine kurze Frage ist, der i5-6600k ein Bottle Neck für die Asus 1080."}, {"id": 12, "start": 94.4, "end": 99.3, "text": "Normalerweise würde ich sagen es sind eher Grafikkarten."}, {"id": 13, "start": 99.3, "end": 102.88, "text": "Das Bottle Neck."}, {"id": 14, "start": 102.88, "end": 104.72, "text": "Kommt aber natürlich immer auf das Game ab."}, {"id": 15, "start": 104.72, "end": 105.22, "text": "Ah!"}, {"id": 16, "start": 127.88, "end": 128.38, "text": "Liege!"}, {"id": 17, "start": 128.38, "end": 128.88, "text": "Liege, Henne!"}, {"id": 18, "start": 128.88, "end": 136.2, "text": "Also ich finde jetzt ist eine ganze Ecke flüssiger als vorher."}, {"id": 19, "start": 136.2, "end": 148.2, "text": "Zack, ich wollte ihn mal wiederbeleben."}, {"id": 20, "start": 148.2, "end": 169.48, "text": "Das ist halt immer die Frage, was du haben willst, ne?"}, {"id": 21, "start": 169.48, "end": 176.0, "text": "Also wenn er da so drauf besicht, dass quasi unter 140 FPS nichts geht, also quasi ab"}, {"id": 22, "start": 176.0, "end": 184.0, "text": "150 FPS geht's los und da musst du auch keine 4K spielen oder sonst was in der Richtung."}, {"id": 23, "start": 184.0, "end": 188.88, "text": "Da ist in der Regel GPU erstmal der limitierende Faktor."}, {"id": 24, "start": 188.88, "end": 191.36, "text": "Kommt aber auf das Game an."}, {"id": 25, "start": 191.36, "end": 200.96, "text": "In der Regel, je höher die Details sind, umso höher die Auflösung ist."}, {"id": 26, "start": 200.96, "end": 214.48, "text": "Umso mehr hast du das Problem natürlich auf der GPU."}, {"id": 27, "start": 214.48, "end": 233.04, "text": "Das wird schwierig jetzt zu kriegen."}, {"id": 28, "start": 233.04, "end": 234.04, "text": "Stickstoffkühler."}, {"id": 29, "start": 234.04, "end": 253.52, "text": "Ui, hüpf, hüpf, hüpf."}, {"id": 30, "start": 253.52, "end": 277.84, "text": "Ja na klar, hätt ich mal hier Dreierboss gemacht."}, {"id": 31, "start": 277.84, "end": 288.76, "text": "Mit einer 1080 und einem halbwegs aktuellen Prozessor bist du in der Regel gut dabei."}, {"id": 32, "start": 288.76, "end": 309.24, "text": "Guck mal hier, letting's go."}, {"id": 33, "start": 309.24, "end": 313.24, "text": "Wo sind die? Ah!"}, {"id": 34, "start": 319.24, "end": 321.24, "text": "Ah! Eine Gegner da!"}, {"id": 35, "start": 321.24, "end": 337.24, "text": "Ich kann nicht anwetzen!"}, {"id": 36, "start": 337.24, "end": 341.24, "text": "Die rutschen da wieder voll drüber! Ich muss überhaupt nichts machen!"}, {"id": 37, "start": 341.24, "end": 358.24, "text": "Nein, doch! Jetzt läuft es! Aber ich sehe es in der Vorschau! Das läuft jetzt viel flüssiger! Vorher war es irgendwie... Keine Ahnung! Wenn es hoch kommt, 30 FPS und jetzt sind es halt konstanter 48!"}, {"id": 38, "start": 371.24, "end": 388.24, "text": "Ja, Pupke läuft überall kacke!"}, {"id": 39, "start": 402.24, "end": 408.24, "text": "Ich habe mich ausgeschneibert! Schneuber! Schneuber!"}, {"id": 40, "start": 422.24, "end": 426.24, "text": "Was, der lebt noch? Ich dachte, das ist einfach nur eine Leiche!"}, {"id": 41, "start": 426.24, "end": 431.24, "text": "Auf hier! Yolo durch jetzt! Yolo!"}, {"id": 42, "start": 435.24, "end": 441.24, "text": "Warum ist der jetzt down? Jetzt bin ich hier extra hin gerannt, verrecke wahrscheinlich noch und jetzt geht die Map auf in dem Moment, wo ich verreckt bin!"}, {"id": 43, "start": 441.24, "end": 456.24, "text": "Ja, natürlich! Was sonst?"}, {"id": 44, "start": 456.24, "end": 473.24, "text": "Hdr ist die beste Erfindung seit einer Weile! Ich wünsche mir mehr Hdr-Games! Und das Hdr... Also was ich mir wünsche ist das, was ich... So bei Monitorentwicklung und so..."}, {"id": 45, "start": 473.24, "end": 490.24, "text": "Bei Monitorentwicklung würde ich mir wünschen, dass es 4K 144Hz Hdr-Monitore gibt! Allerdings erwarte ich gar nicht, dass die 4K mit 144Hz können!"}, {"id": 46, "start": 490.24, "end": 505.24, "text": "Ich will, dass die 144Hz und 4K können, aber sie müssen es nicht gleichzeitig können, weißt du, wie ich meine? Also ich will beispielsweise meinen Desktop auf 4K stellen, da reichen mir auch 60Hz, das ist vollkommen in Ordnung!"}, {"id": 47, "start": 505.24, "end": 515.24, "text": "Und ich will, wenn ich spiele, auch in Anbericht der Tatsache, weil ich viel FPS haben will, in Spielen will ich 1080p mit 144Hz haben, alles am gleichen Monitor!"}, {"id": 48, "start": 515.24, "end": 525.24, "text": "Und am besten noch mit Hdr, weil Hdr... Wer sich einmal ein bisschen Hdr-Filme angeguckt hat, das sieht einfach geil aus!"}, {"id": 49, "start": 525.24, "end": 553.24, "text": "Ja, das stimmt, auf den Hdr-Standard müssten sie sich jetzt doch einigen!"}, {"id": 50, "start": 553.24, "end": 559.24, "text": "Jetzt fragt er!"}, {"id": 51, "start": 559.24, "end": 567.24, "text": "LOL! LOL!"}, {"id": 52, "start": 567.24, "end": 581.24, "text": "Aufblade!"}, {"id": 53, "start": 581.24, "end": 601.24, "text": "Naja, was will der Typ?"}, {"id": 54, "start": 601.24, "end": 605.24, "text": "Anstrengend, ey!"}, {"id": 55, "start": 605.24, "end": 631.24, "text": "Das ist geil, ich muss überhaupt nichts machen, ich werde übelst gecarried!"}, {"id": 56, "start": 631.24, "end": 638.24, "text": "Aber ich muss sagen, der Creeping Death, der carried ganz schön und auch der Major Schlumpf!"}, {"id": 57, "start": 638.24, "end": 654.24, "text": "Der Major Schlumpf, der ist ja im Chat!"}, {"id": 58, "start": 654.24, "end": 662.24, "text": "Der ist von einer Skala von 1-10, wie sehr interessiert dich Politik?"}, {"id": 59, "start": 662.24, "end": 666.24, "text": "Kommt drauf an, was für ein Bereich!"}, {"id": 60, "start": 666.24, "end": 672.24, "text": "Ich finde es ist ein ganz schöner Fail, dass es keine Partei so wirklich schafft, mich dafür zu interessieren!"}, {"id": 61, "start": 672.24, "end": 688.24, "text": "Ich bin nicht jemand, der sich... Ich kriege immer Anfälle, wenn die irgendwas vom Internet-Ausbau schreiben!"}, {"id": 62, "start": 688.24, "end": 692.24, "text": "Das ist einfach unglaubwürdig hoch 3!"}, {"id": 63, "start": 692.24, "end": 702.24, "text": "Der erste ist, was er erzählt hat, was angeblich ganz toll wird und so!"}, {"id": 64, "start": 702.24, "end": 724.24, "text": "Hallo Heli, Stern!"}, {"id": 65, "start": 724.24, "end": 752.24, "text": "Ich bin nicht Colonel 100, bekommen Sie das?"}, {"id": 66, "start": 752.24, "end": 762.24, "text": "Ich bin nicht Colonel 100, weil ich auf 360 und PS3 gespielt habe!"}, {"id": 67, "start": 762.24, "end": 778.24, "text": "Ich habe am Ende PC gekriegt, Battlefield 3!"}, {"id": 68, "start": 778.24, "end": 790.24, "text": "Auf das Boarden Leute!"}, {"id": 69, "start": 790.24, "end": 798.24, "text": "Wo ist er?"}, {"id": 70, "start": 798.24, "end": 820.24, "text": "Da ist er!"}, {"id": 71, "start": 820.24, "end": 840.24, "text": "Haha, LOL!"}, {"id": 72, "start": 840.24, "end": 852.24, "text": "Du kannst fragen, was ich gewählt habe!"}, {"id": 73, "start": 852.24, "end": 854.24, "text": "Ich habe ungültig gewählt!"}, {"id": 74, "start": 854.24, "end": 870.24, "text": "Ich war da, aber ich konnte mich nicht überwinden, bei irgendeiner Größe das Kreuz hinzumachen!"}, {"id": 75, "start": 870.24, "end": 884.24, "text": "Ich hatte keinen Bock, mich so in Detail über kleinere Parteien zu informieren, ob da nicht vielleicht auch was dabei ist!"}, {"id": 76, "start": 884.24, "end": 894.24, "text": "Das Problem ist, was ich auch damit habe, ich kann auf die meisten Aussagen nichts mehr geben!"}, {"id": 77, "start": 894.24, "end": 908.24, "text": "Du kannst davon ausgehen, was erzählt wird, wird einfach erzählt, weil es aktuell entweder die Linie ist, was gesagt werden muss oder weil man es gerade am taktisch sinnvollsten hält, es zu sagen!"}, {"id": 78, "start": 908.24, "end": 914.24, "text": "Nicht, weil da irgendjemand davon überzeugt ist oder wirklich vor hat, das zu machen, sondern einzig und allem, weil es gerade am besten passt!"}, {"id": 79, "start": 914.24, "end": 918.24, "text": "Zumindest habe ich den Eindruck, dass das bei vielen so ist!"}, {"id": 80, "start": 918.24, "end": 932.24, "text": "Du siehst ja auch bei den ganzen Aussagen immer Internetausbau bis 2002, bis 2015, bis 2008, bis 2012, bis 2013, 14, 15, 16, 17, jetzt haben wir angeblich bis nächstes Jahr, also quasi bis in drei Monaten, 50 MBit für alle!"}, {"id": 81, "start": 932.24, "end": 938.24, "text": "Wem wollen die das denn wirklich erzählen? Wem wollen sie das ernsthaft erzählen? Das ist totaler Bullshit!"}, {"id": 82, "start": 938.24, "end": 956.24, "text": "Und natürlich, man kann sich das am Ende alles so schön zurechtfaken, dass das stimmt, was man gesagt hat! Das nimmt dann so Ausmaße an, wie dass man zum Beispiel sagt, hey wir meinen ja mit Flächendecken nicht jeden, sondern wir meinen mit Flächendecken bloß so und so viel Prozent der Fläche von Deutschland!"}, {"id": 83, "start": 956.24, "end": 969.24, "text": "Das Problem bei der Sache ist aber, dass vor allem, wenn man sich mal ein Gebiet im Osten anguckt, halt da sehr viel, also nicht Fläche, sondern Haushalte, so und so viele Haushalte in Deutschland angeschlossen sein müssen mit so und so viel!"}, {"id": 84, "start": 969.24, "end": 984.24, "text": "Aber wenn man mal in Osten guckt, ganz viele Landstriche groß sind, also ziemlich viel Land haben und wenig Einwohner, dann heißt das, dass ein riesengroßes Gebiet nichts Gescheites bekommt!"}, {"id": 85, "start": 984.24, "end": 994.24, "text": "Und es gibt Leute, die haben heute noch DSL-Lite oder gar nichts! Und hallo, ich meine wir sind Deutschland im Jahr fast 2018! Das kann doch nicht sein!"}, {"id": 86, "start": 994.24, "end": 1007.24, "text": "Oder aber, der nächste Trick ist, den sie immer bei sowas ganz gerne haben, man definiert sich Mobil, Mobilfunk-Technologien mit dabei, als Freifang!"}, {"id": 87, "start": 1007.24, "end": 1015.24, "text": "So, so nach dem Motto, ja irgendwo in der Nähe gibt es einen LTE-Mast! Und dann gibt es einen Telekom-Hybrid oder so ein Kack!"}, {"id": 88, "start": 1015.24, "end": 1021.24, "text": "Das wird absichtlich so formuliert, dass man sich wieder schön rauslegen kann!"}, {"id": 89, "start": 1021.24, "end": 1033.24, "text": "Wird mal jemand sagen, wir haben einen sinnvollen Plan, also sprich nicht einfach nur sagen, sondern quasi auch belegen können, hier wir haben uns Gedanken dazu gemacht und so und so wollen wir das erreichen und das sieht für mich sinnvoll aus!"}, {"id": 90, "start": 1033.24, "end": 1044.24, "text": "Dem würde ich das auch glauben, wenn jetzt jemand sagt, hier wir wollen Festnetz, also quasi das Anschluss in jeder Wohnung rauskommt bis 2020 mit mindestens 1 Gigabit!"}, {"id": 91, "start": 1044.24, "end": 1048.24, "text": "Sagen wir mal, dass wir nicht nur hinterher rennen, sondern auch mal gleich ziehen!"}, {"id": 92, "start": 1048.24, "end": 1058.24, "text": "Wenn das jemand sagen würde und sagt, hier folgenden Plan haben wir dafür, so und so haben wir uns die Finanzierung vorgestellt, wenn das glaubhaft klingt, dann würde ich mich auch überzeugen lassen!"}, {"id": 93, "start": 1058.24, "end": 1063.24, "text": "Ist ja nicht so, dass ich mich nicht überzeugen lassen will, aber aktuell glaube ich da kein Wort!"}, {"id": 94, "start": 1063.24, "end": 1068.24, "text": "So und so geht es mir über viele Themen in der Richtung!"}, {"id": 95, "start": 1068.24, "end": 1074.24, "text": "Will der jetzt auf den Boden hauen oder?"}, {"id": 96, "start": 1074.24, "end": 1076.24, "text": "Ja!"}, {"id": 97, "start": 1076.24, "end": 1084.24, "text": "So viel dazu!"}, {"id": 98, "start": 1084.24, "end": 1093.24, "text": "Prinz ich muss wieder nichts machen, ich kann einfach fett gecarried!"}, {"id": 99, "start": 1093.24, "end": 1095.24, "text": "Komm her!"}, {"id": 100, "start": 1095.24, "end": 1099.24, "text": "Oh, der ist..."}, {"id": 101, "start": 1099.24, "end": 1108.24, "text": "Die wollen hier Leute abwerfen!"}, {"id": 102, "start": 1108.24, "end": 1120.24, "text": "Zum Glück fliegen die nicht zu den Enkrams, sondern sonst wo hin!"}, {"id": 103, "start": 1120.24, "end": 1133.24, "text": "Ich glaube die meisten Leute, die AfD gewählt haben, weil das gerade welche im Chat schreiben, sind hauptsächlich welche, die in der Richtung sind!"}, {"id": 104, "start": 1133.24, "end": 1138.24, "text": "Die entweder enttäuscht waren von anderen oder denen es ähnlich ging, wie ich!"}, {"id": 105, "start": 1138.24, "end": 1141.24, "text": "Wie gesagt haben wir, sie trauen da keine mehr was zu!"}, {"id": 106, "start": 1141.24, "end": 1150.24, "text": "Da kommt halt jemand um die Ecke, der noch nicht so vorbelastet ist mit Sachen, die er erzählt hat und nicht gemacht hat, die halt relativ neu sind!"}, {"id": 107, "start": 1150.24, "end": 1164.24, "text": "Ich glaube viele Leute wollten gar nicht unbedingt die AfD wählen, sondern sie wussten nicht, was sie sonst wählen sollten!"}, {"id": 108, "start": 1164.24, "end": 1167.24, "text": "So aus Protest einfach!"}, {"id": 109, "start": 1167.24, "end": 1194.24, "text": "Und was man auch nicht vergessen darf, ich hatte nicht das Gefühl, dass die etablierten Parteien und die Parteien, die an der Regierung waren, sich sonderlich gut, zumindest auch PR-technisch, um die Anliegen der Leute gekümmert haben, was die Leute so bewegt hat!"}, {"id": 110, "start": 1194.24, "end": 1204.24, "text": "Es mag sein, ich will nicht sagen, dass nichts gemacht wurde oder so, zumindest hätten sich mal ordentlich PR-Leute holen sollen oder Marketing-Leute, die es auch geschafft hätten!"}, {"id": 111, "start": 1204.24, "end": 1208.24, "text": "Und die schaffen würden den Leuten ordentlich zu verklickern, was sie gemacht haben, wenn sie was gemacht haben!"}, {"id": 112, "start": 1208.24, "end": 1215.24, "text": "Weil das kam überhaupt nicht raus!"}, {"id": 113, "start": 1215.24, "end": 1218.24, "text": "Ja, Mr. Freigeist ist nicht ähnlich!"}, {"id": 114, "start": 1218.24, "end": 1242.24, "text": "Die wenigsten, die AfD gewählt haben, sagen, jawohl, best ever!"}, {"id": 115, "start": 1242.24, "end": 1263.24, "text": "Umso mehr Leute oder Gruppen, die sich nicht verstanden fühlen, umso radikaler wird das Ganze!"}, {"id": 116, "start": 1263.24, "end": 1273.24, "text": "Ich bin auch der Ansicht, dass man keine extra Wurst machen sollte für schwule, lesbische Frauen oder für Frauen oder sonst was!"}, {"id": 117, "start": 1273.24, "end": 1280.24, "text": "Weil umso mehr man es versucht, allen Recht zu machen, umso weniger klappt das!"}, {"id": 118, "start": 1280.24, "end": 1291.24, "text": "Und ich kenne genug Frauen, auch die in der IT arbeiten, die sagen, sie haben eigentlich gar keinen Bock drauf, dass irgendjemand sagt so nach dem Motto, ja du bist Frau, du musst jetzt besonders gefördert werden, dass du auch mal was auf die Reihe kriegst!"}, {"id": 119, "start": 1291.24, "end": 1305.24, "text": "Das wollen viele gar nicht! Und viele Schwule wollen das auch nicht!"}, {"id": 120, "start": 1305.24, "end": 1315.24, "text": "Und wenn man sich natürlich besonders um eine Gruppierung kümmert, egal welche, können dann andere zurecht wieder sagen, hey, warum wird sich um die gekümmert und um uns nicht?"}, {"id": 121, "start": 1315.24, "end": 1325.24, "text": "Ich finde, man sollte da gar nicht so viel, umso mehr man drüber redet, umso mehr man drüber redet so nach dem Motto, hey, das muss hier gemacht werden, das muss da gemacht werden, sonst was!"}, {"id": 122, "start": 1325.24, "end": 1329.24, "text": "Auch beim Thema hier, wie irgendwie Leute integriert werden müssen und sonst was!"}, {"id": 123, "start": 1329.24, "end": 1339.24, "text": "Umso mehr darüber geredet wird und umso mehr extra Wurst gemacht wird, ich finde, umso weniger integriert ist das eigentlich!"}, {"id": 124, "start": 1339.24, "end": 1351.24, "text": "Wenn du immer wieder darauf hinweisen musst, ja, ihr gehört ja eigentlich gar nicht richtig dazu, deswegen fördern wir euch jetzt und machen wir jetzt, dann weiß ich nicht, ob das dazu führt, dass man sich mehr dazugehörig fühlt!"}, {"id": 125, "start": 1351.24, "end": 1359.24, "text": "Ist meine Ansicht zu der Sache, aber würde ich jetzt auch nicht weiter ausdehnen!"}, {"id": 126, "start": 1359.24, "end": 1367.24, "text": "Und was mir in Deutschland, das muss ich doch loswerden, was mir echt auf den Sack geht, ist, dass über viele Sachen einfach nicht gesprochen wird!"}, {"id": 127, "start": 1367.24, "end": 1379.24, "text": "Und wenn mal über unangenehme Sachen gesprochen wird, da kommt dann gleich wieder sowas raus wie, ja, das sind ja Nazi Ideologien oder das sind ja ganz böse Nazis, alles und sonst was!"}, {"id": 128, "start": 1379.24, "end": 1396.24, "text": "Hey, keine Ahnung, mag sein, sonst was, aber normalerweise würde ich sagen, wenn jemand ein Argument bringt, egal wie dumm und meinetwegen egal wie Nazi sonst was dieses Argument ist, wenn das Argument scheiße ist, soll es doch einfach sein, einfach aus dem Handgelenk was zu schütteln so nach dem Motto!"}, {"id": 129, "start": 1396.24, "end": 1405.24, "text": "Guck mal aus, Punkt A, B, C ist dein Argument Schwachsinn, easy, überhaupt kein Problem, dann hättest du dem Typ voll den Wind aus den Segel genommen!"}, {"id": 130, "start": 1405.24, "end": 1424.24, "text": "Aber, wenn du sagst nach dem Motto, wir diskutieren mit dir da nicht drüber, weil du ein scheiß Nazi bist, kann es sogar sein, dass du stimmt, ja, dann werden sich immer wieder Leute finden, die sagen, so, und jetzt erst recht, die dann quasi auch, die müssen dann quasi diese Leute wieder sagen, ja, die irgendeinen Scheiß vor mich geben!"}, {"id": 131, "start": 1424.24, "end": 1432.24, "text": "Für die ist das gut, wenn man sagt, hier, wir reden mit dir nicht mehr drüber, kack Nazi, weil die müssen gar nicht beweisen, dass das stimmt, was sie sagen!"}, {"id": 132, "start": 1432.24, "end": 1444.24, "text": "Die können einfach irgendwas sagen, dann wird erzählt, ja, hier halt die Fresse, scheiß Nazi, und die Anhänger von denen finden es dann auch geil, wenn sie nach dem Motto, jawoll, ich wusste doch, der Typ hat Recht!"}, {"id": 133, "start": 1444.24, "end": 1462.24, "text": "Würden die mal die Leute in ne Lage bringen, dass die eben begründen müssen, was die da erzählt haben und warum das richtig ist, dann würden sie die viel mehr in Bedrängnis bringen und dann würden die Leute auch sehen, was ein Blödsinn, warum sollte ich das dem überhaupt klauen!"}, {"id": 134, "start": 1462.24, "end": 1471.24, "text": "Man muss einfach drüber reden, und das ist das Problem, was wir haben, wir reden über nichts!"}, {"id": 135, "start": 1471.24, "end": 1485.24, "text": "Und zum Thema sowas mit links und rechts, das nimmt sich beides nix, ich war vor ein paar Jahren in Dresden und da war ein ganz tolles Ereignis, wo ich mal wieder gesehen habe, dass beide Seiten den totalen Dachschaden haben!"}, {"id": 136, "start": 1485.24, "end": 1491.24, "text": "Die Rechten haben irgendwelche Ausländer zusammengeschlagen, kommt in Dresden leider öfters mal vor!"}, {"id": 137, "start": 1491.24, "end": 1508.24, "text": "So, und was haben die Linken da quasi dann als Antworter drauf gemacht? Die haben nicht etwa die Rechten zusammengeschlagen, die die Ausländer zusammengeschlagen haben, nein, die sind zum nächsten Polizeirevier gefahren und haben es angesteckt!"}, {"id": 138, "start": 1508.24, "end": 1519.24, "text": "Haben Steine reingeworfen, Molotov Cocktails reingeworfen, was auch immer, weil die Polizei so böse war und nix gemacht hat! Wo ist denn da die Logik dahinter, das ist einfach total bescheuert!"}, {"id": 139, "start": 1519.24, "end": 1524.24, "text": "Da sieht man radikale von beiden Seiten, das nimmt sich nix!"}, {"id": 140, "start": 1524.24, "end": 1533.24, "text": "Denen geht's bloß noch vordergründig um sowas! In Wirklichkeit wollen sie alle einfach nur ein bisschen Stress schieben!"}, {"id": 141, "start": 1533.24, "end": 1550.24, "text": "Bescheuert kann man sein, dass die Antwort darauf ist, wenn Rechte den Ausländer zusammenschlagen, dass man dann das Polizeirevier anzündet! Also da müssen ein paar Chromosome fehlen, da muss geistig richtig zurückgeblieben sein, dass man die richtige Antwort darauf hält!"}, {"id": 142, "start": 1550.24, "end": 1564.24, "text": "Genug drüber aufgeregt, jetzt werden wir die Runde noch gewinnen!"}, {"id": 143, "start": 1564.24, "end": 1582.24, "text": "Das ist richtig YOLO Style, fahren wir da jetzt rein! Okay, du bleibst hier stehen, du schießt drauf und ich lege, ich mach die ultimative Legehände!"}, {"id": 144, "start": 1582.24, "end": 1595.24, "text": "Moment, warum lassen wir das hier stehen? Alter, du sollst das hier stehen lassen! Nicht stehen lassen! Was soll das?"}, {"id": 145, "start": 1612.24, "end": 1617.24, "text": "Hab ich doch nicht weg, da sehe ich doch nichts mehr!"}, {"id": 146, "start": 1617.24, "end": 1626.24, "text": "Achso, wir haben es schon, okay, ich vergesse es! Ups! Oh nein, ich werde gleich wieder gekickt vom Server!"}, {"id": 147, "start": 1626.24, "end": 1645.24, "text": "Was? Soundbuck? Moment, muss ich mal hören, echt? Nö, kein Soundbuck!"}, {"id": 148, "start": 1645.24, "end": 1667.24, "text": "Was ich auch bedenklich finde ist, was auch noch dazu beiträgt, dass viele Leute Probleme haben, überhaupt zu erkennen, dass es Leute mit anderen Ansichten gibt und zu erkennen, dass es vielleicht in manchen Bereichen überhaupt Probleme gibt."}, {"id": 149, "start": 1667.24, "end": 1693.24, "text": "Ich finde, es ist auf die Medien nicht ganz unschuldig dran, denn wenn man heute auf Facebook oder Twitter geht und quasi neu ist, also nur ein paar Tracking Cookies im Browser hat, dann versucht Facebook einem zu erzählen, was einem gefällt."}, {"id": 150, "start": 1693.24, "end": 1703.24, "text": "Das ist auch aus Sicht von Facebook vollkommen logisch, dass sie das probieren, weil sie wollen halt, dass man möglichst viel Zeit darauf verbringt."}, {"id": 151, "start": 1703.24, "end": 1729.24, "text": "Das Problem, was ich dabei sehe, ist bloß, wenn du einmal quasi in einer speziellen Kategorie drin bist, kriegst du nur noch Sachen empfohlen, die eben deinen Gewohnheiten und dem, was Facebook denkt oder Twitter denkt oder irgendeiner denkt dir gefällt, kriegst du da natürlich vermehrt gezeigt, das heißt, du siehst gar nicht mehr, dass es da noch anderes Zeug gibt."}, {"id": 152, "start": 1729.24, "end": 1751.24, "text": "Das halte ich für ein bisschen problematisch. Also jetzt mal als jemand, der Facebook gar nicht verwendet, dafür andere Sachen wie Twitter, aber das halte ich echt für problematisch."}, {"id": 153, "start": 1751.24, "end": 1769.24, "text": "Hallo, warum lebt das jetzt noch?"}, {"id": 154, "start": 1769.24, "end": 1786.24, "text": "Max, was ist ein guter Job für 15 Jahre, wo man halbwegs was verdient? Jetzt egal, wie kacke der Job ist. Keine Ahnung. Keine Ahnung."}, {"id": 155, "start": 1786.24, "end": 1804.24, "text": "Ach, Quatsch. Systemadicate, das ist was, das sehe ich komplett anders. Wenn was scheiße ist, man sollte es nicht verbieten. Man sollte einfach alle Leute erkennen lassen, dass es scheiße ist und das in der Bedenkung, in der Bedeutungslosigkeit verschwinden lassen."}, {"id": 156, "start": 1804.24, "end": 1823.24, "text": "So wie das mit vielen anderen Sachen auch passiert ist. Verbieten trägt meistens dazu bei, dass es noch relevanter wird. Oder interessanter zumindest, relevanter ist eine andere Frage."}, {"id": 157, "start": 1823.24, "end": 1850.24, "text": "Es gibt da viele Sachen, die diskutiert werden sollten, aber was wir nicht machen. Andere Länder aber auch so. Also es ist nicht nur bei uns so."}, {"id": 158, "start": 1850.24, "end": 1864.24, "text": "Das haben die Griechen besser gemacht. Am Ende hat es ihnen aber auch nichts gebracht."}, {"id": 159, "start": 1864.24, "end": 1881.24, "text": "Ne, jetzt entschärft der Typ auch noch. Fuck. Auch in einer halben Stunde geht Contenders los. Vorletzte Runde würde ich sagen. Guck mal, sind auch schon alle vom Server runter. Vielleicht sogar letzte Runde. Und danach müssen wir den Friseur hausen. Ganz, ganz wichtig."}, {"id": 160, "start": 1894.24, "end": 1919.24, "text": "Ob ich ein Traumauto habe? Ich bin allgemein nicht so der Autokennner und Versteher. Ich habe einen alten Opel Agila gerade, den ich kaum verwende."}, {"id": 161, "start": 1924.24, "end": 1929.24, "text": "Also Autos. Ich glaube bei Autos bin ich der Falsche."}, {"id": 162, "start": 1955.24, "end": 1957.24, "text": "Da kommt ein Panzer."}, {"id": 163, "start": 1957.24, "end": 1982.24, "text": "Max, kannst du uns da für die exakten Namen der PC Teile nennen? Für was? Für meinen neuen PC habe ich die Teile noch nicht, weil ich noch die CPU nicht habe. So Leute, ich haus jetzt den Friseur."}, {"id": 164, "start": 1982.24, "end": 2004.24, "text": "Ich hoffe euch hat es gefallen. Und spammt mal bitte beim Fabian ein bisschen rum. Debated, overrated, was auch immer. Spammt mal irgendeinen Mist rum. Und macht es gut. Bis zum nächsten Mal. Tschüss. Wahrscheinlich morgen schon."}]}