{"text": "der ich glaube das ist das einzige ppe-mode was wir nicht haben nein, haben wir nicht, aber poggers haben wir ja leute heute bisschen go weiter lernen als beispielanwendung nehmen wir das gleiche was ich das letzte mal gebaut habe in dotnet wo ich in rust versagt habe das umzubauen ich muss euch aber gleich wobei ich warte ich warte erst mal ich warte erst mal kurz bis das stream richtig angelaufen ist jetzt schon betke hast du nur darauf gewartet dass hier den streamer macht dass du bett das zu schlafen gehen kannst oder wie ist das ich muss mal kurz meine e-mails gucken jetzt würde ich gerade den 2 rechner anhab mail rade shadow legends ich fasse es nicht die geben auch nie auf oder rade shadow legends hi max ich erhielt leider keine reaktion von dir auf die anfrage zu rade shadow legends nein das ist aber auch in ordnung steht dahinter ok da bin ich aber froh da bin ich bin ich beruhigt dass das ok ist ja also leute jetzt wo ihr ein paar leute da sind ich muss euch sagen ich weiß nicht wie das heute klappt wie lange das wie lange das klappt mit dem stream vielleicht kein problem vielleicht geht es auch nicht so lang das liegt daran ich habe immer noch ein bisschen kopfweh und heute morgen musste ich eine wurzelbehandlung über mich ergehen lassen weil ich habe euch ja schon vor ein paar wochen gesagt ich habe irgendwie zahnweh und wir haben das nicht anders hinbekommen alles mögliche probiert ja aber auch wenn es nicht so ausgesehen hat aber anscheinend ging es nicht anders ja und ja durch die behandlung und das auf dem kopf liegen dort habe ich jetzt natürlich noch mehr kopfweh und es hält schon auch den ganzen tag kann ich das ist doch ein twitchy mod warum ist denn das weg wurde das entfernt ja habe ich hinzugefügt ach stimmt das wurde entfernt weil der typ weil der typ den nicht die rechte an seinem gesicht geben wollte oder so ja ja ok ich erinnere mich dunkel da war was ja das ist ja das ist schon zehn jahre her oder so ist schon ewig her ja ich muss sagen so schlimm an sich war es gar nicht aber betäubung hält halt ewig es war heute morgen schon um acht also ist es schon her betäubung ist mittlerweile auch weg es tut ein bisschen weh drumherum an der stelle wo wurzelbehandlung war ist natürlich nichts weil die wurzel ist ja weg ohne nerven merkste nichts ein bisschen weh aber ich habe hauptsächlich kopfweh und ich merke es auch noch ein bisschen ich muss jetzt mal abwarten die nächsten tage ich habe hier noch ich habe hier noch pillen am start aber ich nehme ihr kennt mich ich nehme ungern schmerzmittel poggies lode game danke für den sub falls ich nicht schon gesagt habe ja ist es auch aber ich werde da nicht geweckt ich werde nie von weckern wach ich bin immer schon wach wie viele tabs na ja also man erkennt doch noch was was ist ich habe alternativ hier noch ein paar was machen eigentlich die battlefield spieler zahlen wo wir gerade so dabei sind es hat gepiekt moment hat es gepiekt es hat 24h peak yo yo yo yo massive und new world new world ist weiter am abkacken ok nice gg easy alter die haben so das habe ich noch nie gesehen so ein heftiger festschiss die new world das habe ich also also in diesem ausmaß habe ich das glaube ich noch nie gesehen so ich war mal kurz meine links vm auf weil ich fürchte wir müssen mal kurz updates machen ich habe das nämlich vorhin auf meinen anderen vm gesehen rast rast muss weg leute heute ich habe off screen noch ein bisschen rast mir angeguckt alter das ist so wir was heißt wir so umständlich und anstrengend ich weiß nicht ob sich das lohnt für so alltägliche aufgaben allein schon ein erstes webrequest zu machen ist da wieder eine wissenschaft für sich vielleicht mache ich das jedenfalls anders aber heute machen wir mal ein bisschen go wieder aber das muss weg der rast der rast champ kommt weg und bei der gelegenheit machen wir gerade mal ein update weil ich glaube ich glaube ich muss muss ab ja es ist der bam wusste ich doch schon reality mod gespielt ja ich habe gesagt ich habe ich habe drei leute die ganze runde über runde über gekillt weil ich den rest nicht gesehen habe das ist aber auch was was man im team bzw mit kommt mit coms bzw noch besser mit bekannten spielen muss oder mit online mit festen teammates spielen muss dann geht das auf der anderen seite ich habe vorhin mal kurz reingeguckt da waren gerade mal zwei server noch spielbar von irgendwie 30 bei release also ich weiß nicht wie lange das überlebt ob sich das überhaupt lohnt sich da einzuarbeiten keine ahnung naja heute nicht so ehrlich gesagt heute morgen wurzelbehandlung und kopfweh noch deswegen weiß ich nicht wie lange der stream heute geht vielleicht geht es ja auch ohne probleme ich hatte schon öfters wenn ich angefangen habe zu stream war das kopfweh weg zumindest wichtig ordentlich trinken dabei ich habe jetzt hier noch ein liter wasser stehen zwischendurch mal auffüllen ja hoffe ich auch hoffe ich auch übrigens wenn ich mal ein paar geträgerte linux fans sehen wollt guckt euch einfach die comments unter meinem letzten video an also nicht alle die meisten sind ja vollkommen rational und und schreiben sinnvolle sinnvolle comments ja viele stimmen mir da auch zu aber du hast da auch so ein paar du hast auch so ein paar ganz spezielle leute ja so hier zum beispiel der erste was ich hier sehe und guckt mal guck dann auch nicht an also der ist erst mal der ist erstmal hyper trigger der typ das ist doch bullshit so leute wie du die so ein bullshit erzählen sind mit der grund dass sich linux auf dem desktop nicht durchsetzt also leute merke es ist mal wieder so derjenige der die probleme anspricht ist das problem nicht der auslöser Ja? Logisch. Obvius. Was ist mit Rust? Heute nicht. Ich hab eh schon Kopfschmerz, das halt ich nicht aus mit Rust. Ich hab offstream, ich hab's grad gesagt, da warste wahrscheinlich noch nicht da, ich hab offstream ein bisschen Rust rumgebastelt und das ist mega umständlich. Ich weiß nicht, ob sich das lohnt für so alltägliche Tools und Software. In seinem Bereich, wofür Rust gedacht, ich mein, das wurde nicht umsonst von Marzilla entwickelt, um unter anderem auch ihren Browser memory safe und sicherer zu machen. Da kann ich das verstehen und vielleicht für sicherheitskritisch oder Sachen, die halt besonders stable laufen müssen und performancebar, okay, kann ich alles verstehen. Aber für die 0815 Tools bin ich mir nicht sicher, ob es eine gute Idee ist, Rust zu verwenden. Ja, ich hab daheim in Zabbix. Also wir hatten lange Zeit auf der, also Monitoring Systeme hab ich folgende Erfahrung. Nagios, kenn ich mich tatsächlich relativ gut aus, hab ich mich jahrelang drum gekümmert, schon lange her. Zabbix hatten wir auf der Arbeit jahrelang und ich hab aktuell noch einen bei mir daheim. Da kenn ich mich auch ganz gut aus mittlerweile. Und ansonsten ist die große Frage, was du machen willst. Willst du einfach nur einfache Checks machen, du gucken, ob irgendwie eine Webseite antwortet oder ein Host oben ist und du kannst ja mal ein bisschen dein Anwendungsszenario schreiben, was du damit machen willst. So einfach nur gucken, ob ein Host oben ist, ob ein Port auf ist oder ob auf der Webseite das Richtige drauf steht. Und wenn du keine History brauchst oder keine Custom Checks und größere Sachen, ja, dann gibt es richtig gute Self-hosted Alternativen, die einfach sind. Ansonsten das große Fast ist natürlich dann Prometheus. So als direkte Alternative, auch wenn der Schwerpunkt bei Zabbix und Prometheus jeweils ein bisschen anders liegt. Ja, hab ich auch schon gehört. Hab ich mich aber noch nie großartig mit beschäftigt. Ich weiß nur, das war mal Nagios. Mittlerweile glaubt nimmer. Ja, hat mich jetzt nicht so geschockt. Dann würde ich wahrscheinlich Zabbix vorziehen. Ja, die Sache ist halt, also die Frage ist, was du monitoren willst. Moin Michael, 50 Billiarden lang nicht gesehen. Die Frage ist halt, was du monitoren willst. Willst du eher so klassisches Blackbox Monitoring machen? Von außen halt gucken, pinkt der Host, ist SSH Port offen und sowas. Dafür ist Zabbix ganz nice. Willst du Metriken sammeln? Also interessiert dich zum Beispiel auch sowas wie bei einer Anwendung, wie oft läuft der Garbage Collector oder Zertifikatablauf, Daten und so, wobei das geht mit Zabbix auch. Also interessieren dich eher Metrix, dann eindeutig Prometheus, Grafana. Interessieren dich eher so klassische Blackbox Checks, wie man früher gemonitort hat, dann Zabbix. Man kann natürlich auch beides verbinden, aber dann wird schon ein bisschen Overkill für kleine Installationen. Und wenn du einfach nur ganz simple Sachen machen willst, dann ist das auch nicht schlecht. Das ist aber wirklich nur für kleine Installationen daheim. Also ich denke mal mehr als 100 Checks verkraftet es bestimmt, aber ja, also für daheim ist das, wenn man nix großartig Spezielles braucht und auch keine History braucht, ist das mit das Beste. Ansonsten hängt es davon ab, was man monitorn will. Nein, ich habe kein MacBook. Ich arbeite mit Linux und mit Windows gleichermaßen. Das wird ihr jetzt auch gleich sehen. Ja, aber der Blackbox Exporter ist von Prometheus, der ist vorhanden, ja, sag mal so. Man merkt, dass das nicht dafür gemacht ist. Allein schon das ganze Umlabeln ist jetzt nicht schön, das geht. Aber wenn man nur Blackbox Checks macht, dann ist sowas Klassisches wie Zabbix oder meinetwegen Nagios, vielleicht auch Checkmk oder LibreNMS, wenn es viele SNMP Netzwerkgeräte sind, sicherlich besser. Brauchst du keine mobile Workstation? Nö, brauche ich nicht. Ach so, ich habe ein Notebook von der Arbeit, es ist aber ein Windows Notebook. Also ich habe ein Linux Notebook auf der... Was zum Teufel ist, ist, ist, ist zählt? Was habe ich denn da installiert? Was ist das überhaupt? Low Latency Audio Communication Codec. Ich habe keine Ahnung, warum ich das installiert habe, aber ich leuchte mal wieder, weiß nicht, was das ist. Yes. Update, jetzt. Ja, also ich habe, ich habe von der Arbeit ein Windows Notebook hier liegen, das verwende ich aber so gut wie nie. Und auf der Arbeit habe ich schon ein Linux Notebook. Das werde ich ja wahrscheinlich demnächst ersetzen durch das Windows Ding von hier und dann lasse ich das auf der Arbeit stehen. Also ich brauche keine mobile Workstation, nö, brauche ich nicht. Ich habe mein Handy dabei für mobil unterwegs im Zug, reicht das allemal. Und ansonsten Schreibtisch an der Arbeit, Monitor, richtige Tastatur, Maus, Unterheim, Desktop, PC. Das kann man so kurz gar nicht sagen. Im Prinzip sind die Tools sich relativ ähnlich. Nagios ist in C, Zappix ist in PAP. Im Prinzip sind die Tools sich relativ ähnlich. Das sind beides klassische Monitoring Tools, die hauptsächlich ihre Stärken haben, indem du von Außen Kisten überprüfst. Ja, Zappix und Nagios haben beide Agents, damit kannst du auch Festplattenauslastung und CPU-Auslastung monitoren. Aber so groß ist der Unterschied gar nicht. Konfiguration ist ein bisschen anders. Nagios ist das deutlich ältere, wobei Zappix auch schon relativ alt ist. Ich glaube das ist ehrlich gesagt ein bisschen Geschmackssache. Kommst du mit deinem privaten PC daheim auf die Arbeit? Über Umwege. Ja, über Umwege klappt das ganze. Guck mal, ob es Updates gibt. Ich muss den Gramm hier gerade mal alles zumachen und mal die VM neu starten gerade. Mal kurz gucken, ob es, ich sag gleich was dazu, mal gucken, ob es neue Versionen gibt. GoLands, irgendwas hier. High Charm, jawoll, Updates, mal alles. Und dann wird Rebooted. Wie lernt man am besten mit großen Datenmengen umzugehen? Aller DataFrame. Was sind denn DataFrames? Was verstehst du unter DataFrames? Keine Ahnung. Ich habe jetzt eine grobe Idee, was du meinst. ListenArrays und so weiter. Was ist daran jetzt? Stonks, soll ich mal gucken, was meine Stonks machen? Letzten paar Wochen sind die Stonks tatsächlich wieder hoch. Guck mal kurz. Machen wir mal eine Stonks. 419 Euro sind die hochgegangen die Woche, kann ich mir nicht, aber heute sind sie wieder runtergegangen. Alter, heute sind sie minus 265 Euro runtergegangen. Nicht ganz billig. Ahnungslose Sachen, ich habe nur NFTs. Nicht NFTs, eher ETFs. Nicht NFTs. Leute, das ging ja richtig hoch. In letzter Zeit. Letzten Monat plus 1161. Da will ich mich mal nicht beschweren jetzt. Das ist doch gar nicht mal so übel. Stonks. Nee, nee, nee, nee. Mein Portfolio gibt es nicht zu zeigen. Ich habe einen ETF, einen World ETF, sonst nichts. Wie viel genau, sage ich nicht, aber es ist nur ein World ETF, sonst nichts. Achso, ja, das hier wollte ich noch beantworten. Also ja, ich komme mit meinem PC von daheim auf die Arbeit über Umwege. So einfach geht das nicht. Also Umwege sind Tunnels und Zwei-Faktor-Authentifizierung. Also im Prinzip, sagen wir mal so, es ist nicht wirklich in VPN, aber sowas ähnliches wie VPN. Ja, und wie man gelernt, mit großen Datenmengen umzugehen, ich meine, wo ist das Problem mit Listen und Arrays? Ich habe nichts in Bitcoin verloren, ich habe keine Bitcoins. Was macht denn eigentlich so der, wo wir gerade dabei sind, Bitcoin? Ach so, der Bitcoin-Kuss. Das ist ja auch schon richtig abgekackt. Ja, also ich verstehe das Problem nicht so genau, ich meine, Arrays ist mit zwei Elementen oder drei Millionen Elementen jetzt nicht so der große Unterschied. Das sind halt Arrays und Listen auch nicht. Das wird auch nicht mal großartig langsamer dadurch, weil du per Index drauf zugreifst. Also die Zugriffszeit auf dem Index mit einem Array mit fünf und mit einer Million Elemente ist jetzt nicht so großartig unterschiedlich. Ja, streng genommen schon, weil CPU cache, aber davon reden wir jetzt mal nicht. Also, was ist denn da, hast du ein konkretes Problem, wo es nicht funktioniert? Was ist dein Favorite File Transfer Tool? SCP? R-Sync? R-Sync? Braucht man irgendwas anderes? Nicht WinSCP, alter. Wie redet ihr von WinSCP? R-Sync? R-Sync und SCP? Braucht man noch irgendwas anderes? X-Copy, als nächster kommt irgendwie einer mit einem komischen PowerShell-One-Liner oder sowas. Meinst du sowas oder meinst du sowas wie File Sync, Next Cloud Sync-Sync oder C-File oder was meinst du? Weil, wie gesagt, mein File Transfer Tool R-Sync und SCP. Das riecht ein bisschen nach Python, wenn ich mir das so angucke. Liege ich da richtig? Nee, das brauchst du nie. Also, der Unterschied, ich kann dir das, also ich bin nicht der große Python-Checker, aber ich gehe mal davon aus, dass das dort genauso ist. Also, auf eine Liste und auf einen Array greifst du immer und ausschließlich mit einem Index zu. Liste, Key, ergibt keinen Sinn. Was es gibt, ist, in Python gibt es ein Dictionary, in Java gibt es eine HashMap, in C-Sharp gibt es auch ein Dictionary, in Ruby gibt es, also ein Key-Value-Store, nennen wir es mal. Auf einen Key-Value-Store greifst du mit einem Key, den du definiert hast, zu. Also Arrays und Listen immer per Index und auf Dictionaries oder HashMaps oder wie auch immer man das nennen mag, greifst du mit einem Key deiner Wahl zu, meistens Strings. Also, das hier ist keine Liste, das hier ist eigentlich ein Dictionary und die Syntax in dieser Form ist, ein Dictionary mit einem Value, der eine Liste ist. Gibt es Sprachen ohne Dictionary, Key-Value-Store, ja gut, wenn du eine Sprache ohne alles suchst, nimm C, weil C hat nichts in der Standard-Library, noch nicht mal dynamische Listen, das musst du alle selbst machen. Äh, und die Syntax hier, äh, kann ich mir nicht vorstellen, dass es die überhaupt gibt. Ich meine, das wäre ja quasi, okay vielleicht ist das ja ein Python-Ding oder so, aber das wäre ja quasi, okay vielleicht ist das die Python-Syntax für Nested-Listen, weiß ich nicht, würde mich aber wundern. Du erzeugst einen Array mit Null, mit der Zahl Null, als einziges Element und das gibst du dann als Index in die Liste, das kann ich mir nicht vorstellen, dass es das gibt. Die gibt es in R, okay ja, meinetwegen, da würde ich mich nicht, da wundert mich nichts. Mehrdimensionale Arrays, also ich kann mehrdimensionale Arrays nur mit zweimal Index, dann musst du sowas machen. Aber vielleicht ist das eben ein Python-Ding, also ein Array mit Key ergibt eigentlich keinen Sinn, das erste muss eigentlich ein Diktionary sein. Ansonsten, letztendlich ist es aber auch egal, ich gehe davon aus, dass man das in Python wahrscheinlich sogar überschreiben kann. Kannst du ein Diktionary machen, das Array einträgert, ja kannst du machen, klar, das ist, das sieht dann so aus, wenn du drauf zugreifst, dann machst du ein Diktionary mit String als Key, der Value ist dann halt eine Liste und das ist dann quasi aus der Liste das Item mit dem Key Spalt, also das ist irgendwie eine Geschichte mit Diktionary und geschachteten Arrays. Da hilft aber auch, ist egal, ich kann jetzt viel erzählen, wenn der Tag lang ist, da hilft ehrlich gesagt nur sich die offiziellen Beispiele anzugucken, weil das baut dir die Library, die du verwendest für dich zusammen und da muss man sich an die offiziellen Beispiele halten. In Python hast du halt auch ein bisschen den Nachteil, wenn du nicht irgendwelche Type Annotations oder so benutzt bzw. die Library, das hat, weißt du nicht so genau, wo was steht. Das ist halt tatsächlich der Nachteil von so super dynamischen Sprachen. Da siehst du in deinem Editor nicht so einfach, was was ist. In.NET ist das relativ easy, ich zeig dir das mal ganz schnell, bevor wir mit GO anfangen, ich zeig dir das mal ganz schnell, hausgeliegt, ja Leute, liegt, mein Haus, Keckel, mach mal schon mal GoLand auf, so ich zeig dir das mal ganz kurz in.NET, was ich meine, alter, ich mag das ja immer, wenn Programme laggy aufgehen, so, also guck mal, ignorier mal den ganzen Crap, der hier steht, ich mach mal kurz hier unten ein bisschen Platz, alter, warum recht, what the fuck, warum hab ich grad 93% CPU Last, ah gut, Java IDEs starten, ok, das muss ich verstehen, klar, muss erstmal komplette CPU Auslastung, so, jetzt sind wir wieder bei 0%, alles klar, jetzt sind wir auch nicht mehr laggy, also guck mal, in.NET ist das natürlich schöner, da kannst du sowas hier machen, ich mach jetzt mal das, was du da als Beispiel gepostet hast, ja, also var, nennen wir das mal irgendwie Items oder so, da sagst du dann new, Dictionary und jetzt kannst du angeben, was du als Key verwenden willst, in dem Fall String und dein Value wäre dann eine Liste, oder ein Array, aus, äh, tja, kannst du dir aussuchen, aus, weiß ich, Objects, egal, so, und darauf wirds jetzt folgendermaßen zugreifen, wo ist das Problem, ach, Kekkel, alter, ok, äh, ich hab doppelt zugewies, das kann nicht funktionieren, hast du die Lizenzen gekauft, ja, ich hab, ähm, Text all Desktop Pack, so, und darauf würdest du jetzt so zugreifen, guck, ja, bla bla blub, Index, das ist genau das, was du geschrieben hast, und warum, weil, und in.NET siehst du es halt schönerweise, weil hier kann dir nämlich deine Idee sagen, das möchte hier einen String Key haben, und hier möchte das einen Int Index haben, das ist halt der Vorteil von typisierten Sprachen, das ist halt, wenn du Python super dynamisch machst, nicht so schön ersichtlich, aber im Prinzip ist das wohl so ein ähnliches Objekt, was du vor dir hast, wenn du da mit Key und dann mit Index drauf zugreifen musst, so, ähm, übrigens, wir brauchen Rider, doch, wir müssen den, müssen wir Kekkel aufmachen, ich bin mir nicht, meine Benamung ist immer, nee, das ist nicht Kekkel, oder, cute chat, das sollte ich besser nicht aufmachen, weil da irgendwelche Secrets drinstehen, vermute ich mal, den Postchamp muss ich aufmachen, ach doch, das hatte ich schon offen, ich hab's bloß, ich, ich hab bloß, nee, nee, richtig, wirste mal, so, das brauchen wir aber heute nicht, wie mein ich denn, hier offen, main.go, ach, das ist noch die Meal API, das brauchen wir nicht, brauchen wir ein neues, brauchen wir ein neues Projekt, neues Projekt, go, Postchamp, go, brauch ja auch den richtigen Namen, this window, auf geht's, ja, also, wie gesagt, ich bin heute nicht super scharf aufs Progress machen, wenn ihr irgendwas erklärt haben wollt, Sporgi, danke für den Zap, dann, schieß los, ja, alles klar, so, eine ganz furchtbar wichtige Sache müssen wir noch machen, bevor wir jetzt anfangen, main.go, top package main muss man dann machen, und dann hier, die übliche Geschichte, fmt, print, omega keck, so, Terminal auf, T-marks auf, äh, wir müssen nach go land, projects, Postchamp, go, go run. omega keck, fmt, so, ganz wichtig, themes, sonst dreh ich, dreh ich am Rad, warum nutzt du nicht das IDE Terminal, weil ich das IDE Terminal nicht mag, ich weiß ich, ich find das IDE Terminal laggy, und das crept teilweise den Fokus nicht, wenn man reinklickt und sowas, ich, ich, ich switch, achso, ich switch lieber mit meinen window manager bindings um und benutze das normale Terminal, da ist auch mein Farbschema drinne, und, weiß ich, irgendwie find ich das schöner, mit welchem Framework würdest du heute eine Web Anwendung machen, naja, ihr kennt mich, ich würd eindeutig ASP.NET Core nehmen, Noji Bait, also ihr kennt mich wirklich in dem Fall, meine Abstandslieblingssprache ist C-Sharp, und mein, gerade Stande, ganz im Ernst, ich hab jetzt in letzter Zeit ja relativ, wir haben auch im Stream relativ viel rumgeguckt, Rust, Go, Python, Javascript, und, und Hand aufs Herz, ja, mir muss noch einer eine zweite Sprache zeigen, die an die Kombination, die C-Sharp bietet und dort net rankommt, es ist schnell, es hat eine wahnsinnig gute Standard Library, es hat für fast alles was man so braucht, halbwegs gut maintainte Pakete, da ist Javascript und Go sicherlich besser, aber die wichtigsten Sachen gibt's für dort net auch, du kannst mittlerweile relativ gut Self-Contained Binaries bauen, die Entwickler Tools sind allererste Sahne, da kannst du dich überhaupt nicht beschweren, besser als alle anderen Sprachen die ich kenne, also, so die Kombination, die muss mir noch einer zeigen, ja, also, ich, ich würde die Web-Anwendung mit ASP.NET Core machen, weil im Ernst, spätestens jetzt seit es, guckt euch mal das Beispiel an, ich will jetzt kein extra Projekt machen, ja, spätestens seit es Minimal-APs gibt in dort net, ist es halt super easy, guckt euch das hier mal an, ja, das ist eine C-Sharp beziehungsweise dort net Web-Anwendung in der einfachsten Form, guckt euch mal eine Python Flask Anwendung an oder eine Ruby Sinatra Anwendung oder was auch immer, das ist auch nicht großartig oder eine Express Anwendung, nicht nicht Go, Express GS, guckt euch mal, Moment Leute, wisst ihr was mir gerade auffällt, warum hab ich eigentlich die Dark-Reader und Dark-Theme, warum hab ich eigentlich so bescheuerte Settings für meinen Browser, man, so, viel besser, guckt euch mal Hello World in Express an, guckt euch das an, ja, guckt euch das an und guckt euch das an, also so ein großer Unterschied, ist das jetzt net, also man sieht schon klar, was ja auch die Inspiration war oder guckt man sich mal Ruby Beispiele an zum Beispiel, das ist schon ein bisschen älter, die Webseite kommt mit, ja, da sieht das so aus, das ist schon alles relativ ähnlich, warum soll ich die Cognito-Modus browsen, so und das sind Minimal-APIs, so wie sieht eine Python zum Beispiel, eine Python Flask Anwendung aus, die sieht wahrscheinlich auch nicht viel anders aus Quickstart, ja, guckt, jetzt mal ernsthaft, das ist alles ziemlich ähnlich, so, das heißt viele verbinden im Kopf ja noch mit.NET, Windows Only und riesen Boilerplate und sowas und das ist schon lange nicht mehr so, ich verwende die letzten Jahre über.NET und C-Sharp exklusiv unter Linux, ja, wir können uns auch noch ein Go-Example angucken, ja, genau, ist alles relativ ähnlich, NewBasic.org, was ist das denn, ist alles, bis die Sündagsheilerding hätten sie noch machen sollen, also ist alles relativ ähnlich und in C-Sharp, ja, vielleicht hast du in manchen Fällen ein bisschen mehr Boilerplate als in Python und sonst was, dafür bist du halt irgendwie hundertmal schneller als Python, jetzt nicht übertrieben, ist wirklich so und deswegen sag ich mir muss noch einer mal die bessere Sprache oder das bessere Framework zeigen als die Sharp.NET in Kombi, wenn es um die Kombination geht aus Performance, guter Standard Library und alle möglichen, also das Gesamtpaket ist für mich das beste was es aktuell gibt, ja ich bin.NET Fanboy was das angeht, aber ich meine auch, dass das objektiv so ist, ja, also wie gesagt, ich würd's damit machen und gerade wenn du was kleines im Backend brauchst, nimm die neuen Minimal APIs, scheiß auf Controller und MVC und so ein Crap, nimm Minimal APIs, bau dir drei Restendpunkte und fertig, oder aber nimm CraftQL, wenn du was sehr Daten, was sehr Daten intensiv ist, ach, Microsoft hier bist du bei Google abhängig, Google ist, bei Go bist du von Google abhängig, letztendlich bist du überall von irgend wem abhängig, Google kann auch, ich mein Google hat der History von wir stellen das ein, guckt euch mal den Google Friedhof an, nicht Friedhof, Graveyard, guckt euch den Google Graveyard an, also das können die auch morgen einstellen, und guckt euch,.NET ist open source genauso wie Go, also wenn jetzt einer sagt ja, dann kann die Community weitermachen, ist bei.NET auch so, ja das eine ist sehr von, das eine ist sehr abhängig von Google, das andere ist sehr abhängig von Microsoft, aber auch bei Sprachen wie, was weiß ich hier, JavaScript und so, ich wette mit euch, die sind auch abhängig von ein paar großen Hersteller, die die Hauptcontributor sind, beziehungsweise die Hauptdreiber dahinter, ja, Frage beantwortet, ASP.NET Core, beste, ja, ich bin mir nicht sicher, ob ich mir Rust für Web Anwendungen geben würde, hast du mal ein Video zu ASP.NET Core gemacht, nö, warum, ich mache ja auf YouTube nicht so die Hardcore Technik Videos, was würdest du für Data Science erwähnen, Data Science ist erstmal ein leeres Wort, das ist genauso wie Machine Learning, die Frage ist, was, was ist es, und dann würde ich ganz klar danach gehen, wo es die besseren Libraries gibt, beziehungsweise die Libraries und Funktionen, ja, Kombinationen aus Sprache und Libraries für das, was ich machen will, gut sind, und in Richtung Machine Learning hast du vielleicht gerade so mit TensorFlow und sowas so ein bisschen die Platzhirsche, was Python angeht, Quatsch mit Soße, danke für den Prime-Nap, Prime-Nap, Prime-Sub, ich habe Prime-Nap gesagt, weil ich unten drunter wahrscheinlich Noob gelesen habe, der Prime-Nap, bin ein Noob, in welche Kategorie gehört denn React, React ist Frontend Framework, eigentlich somit das größte und bekannteste Frontend Framework, damit machst du Webseiten auf gut Deutsch, äh, ich fände das nicht so cool, und mit was würdest du eine Desktop App programmieren, Cross-Platform, Mobile fällt dir raus, ja, nein, Windows Only, Tja, Cross-Platform, wahrscheinlich Qt, zwungenermaßen, auf Electron habe ich überhaupt keinen Bock, auch wenn es wahrscheinlich das Logischste wäre, vielleicht würde ich mir auch mal irgendwelche Go-Frameworks angucken, ob die was taugen, da bin ich, da bin ich unschlüssig zur Zeit, Flutter Desktop ist noch Crap, wollen wir nachher angucken, können wir nachher angucken, aber Leute, das muss ich hier aufmachen, sonst sehe ich den Tab nicht, aber das gucken wir nicht jetzt, jetzt basteln wir erst noch ein bisschen, 40 Minuten geschwätzt ist gut, jetzt können wir anfangen, warum verwendest du überhaupt so nett, habe ich glaube ich jetzt schon beantwortet, oder, ich frage mich eher, warum es Leute gibt, die das nicht verwenden, außer prinzipielle Microsoft Abneigung kann ich da, die ich ja auch habe, kann ich mir da eigentlich nichts vorstellen, ok, im Embedded-Bereich muss ich sagen, ist tatsächlich die einzige Sache, wo ich kein.NET verwende und wahrscheinlich auch nicht verwenden würde, kommt aber halt drauf an, es gibt beispielsweise Sachen wie das Nano-Framework für ein ESP, aber da weiß ich nicht, wenn ihr natürlich eine gute Plattform habt, wo das unterstützt wird, ist was anderes, ja, Stream, klar, wir haben total viele ASP.NET Anwendungen schon gemacht und Streamen, Tiny Go, ja Tiny Go, bin ich sehr gespannt drauf, was die noch machen, weiß jetzt nicht, worauf sich das bezieht, ok, dann fangen wir mal an, also switchen wir mal rüber, machen wir den Krempel hier zu, also GoLand auf OmegaCac, meine License wurde renewed, die haben mir gestern sogar 250, oder vor ein paar Tagen, 250 Euro abgebucht, Kackel, alter, wartet mal kurz, weiß nicht, ob da irgendwelche E-Mail-Adressen Leaks und so jetzt kommen, renew license, ach leck mich, ich mach das jetzt nicht, mach ich das nächste Mal, ich mach das das nächste Mal, ich hab mich doch sogar eingeloggt in die, sieht man nicht ob man hier eingeloggt, ach ich bin nicht eingeloggt, ich hab mich nur in Rider eingeloggt oder was, ich hab mich nur in Rider eingeloggt, ich hab mich nicht in der Toolbox eingeloggt, deswegen schnappt das sich meine License nicht, naja gut, das ist natürlich bescheuert gewesen von mir, Typical Flux, dankeschön für den Sub, ja das ist natürlich blöd, also muss ich bis zum nächsten Stream mich nochmal einloggen, ja, Name Leak, Rider UiPack, ich brauch ein ordentliches Theme, sonst dreh ich, sonst dreh ich am Rad, ja, sehr gut, Font, Hack, Hack, 20, sollt ihr schön was erkennen können jetzt, jepp, jepp, jepp, ich weiß nicht warum es mir jetzt danach war, ich wollte es eigentlich komplett aussprechen aber ich weiß nicht ob man das auf Twitch noch darf, ich wollte eigentlich sagen jepp, aber das darf ich nicht, sonst ist Camp Ban, so, Hahn, genau, jepp, jepp, Hahn wollte ich sagen, so ist es, weiß nicht was mir lieber ist, das oder das oder das, es ist auch egal, wen juckt die Farbe, ok, auf gehts, Go Stels, also, dann fangen wir mal an, ähm, das letzte Mal, ups, Open Recent, Pepofetta, also das letzte Mal hatten wir hier, das brauche ich nachher vielleicht noch, ich schiebe das mal auf einen weiteren Desktop, das letzte Mal haben wir hier eine Essence API nachgebaut, heute baue ich mein Kommando Zeilen Tool nach, was ich hier in.NET programmiert habe, aber weniger um das Kommando Zeilen Tool nachzubauen, eher um zu gucken wie man Command Line Parsing ordentlich macht, also wir machen heute, oder wir versuchen es heute mal, Command Line, Command, Command Line, Parser, müssen wir uns angucken, Jason, D, Serializer, das haben wir ja schon gemacht, dann müssen wir uns angucken, Date Time in Python, da bin ich mal gespannt ob das weniger Abfuck als in Go ist, Web Requests, brauche ich noch mal kurz erklären was das Kommando Zeilen Tool, was wir nachbauen eigentlich macht, für alle die es nicht kennen aus den letzten Streams, ich werde es euch nicht groß zeigen, ich werde es nur kurz sagen, und zwar, hier unten kann man vergessen, das ist alles Jason Gedulds, also, das ist ein Kommando Zeilen Tool, wenn man das ausführt, hast du verschiedene Optionen, List, Clear, Duration, Start, Reason, oder kann man da mit Minus Minus und so Argumente in der Shell übergeben, was das macht ist, das schickt an den Prometheus Alert Manager, trägt das eine Silence ein im Monitoring, für das aktuelle System, mit dem aktuellen User, für die aktuelle Zeit, für 15 Minuten, das habe ich für die Arbeit gebaut, das habe ich dort auch schon angekündigt, dass das bald kommt, fanden die Leute wirklich gut, gerade unser Support, der immer Monitoring Meldungen bekommt, wenn irgendjemand vergessen hat, das System in Maintenance zu nehmen, und da kannst du nämlich einfach auf den Server gehen und sagen, Set Down Time, und dann nimmt er das System für 15 Minuten raus, und das ist ein super kleines Beispielprogramm, um so Sachen wie Command Line Parsing und sowas in Goma auszuprobieren, wirst du Cobra für CLI Arcs, ich habe keine Ahnung, ich weiß nicht, was es da gibt, ihr könnt mir mal ein paar, warum nehmen wir nicht einfach Standard Library Parser, also wenn ihr Ahnung von habt, dann könnt ihr mir mal einen Chat schreiben, gute, also erstens, gute Command Line Tools, und was mich noch mehr interessieren würde, sind CLI Tools, die ordentlich vor formatieren können, in der Command Line, also wo ich zum Beispiel eine Tabelle machen kann, also für.NET gibt es sowas wie Specter Console, da kann man zum Beispiel sagen, Table Add Column und Table Render, und dann kann man so eine Tabelle auf der Command Line erzeugen, relativ einfach, sowas nur in Go gibt es garantiert, ich will kein Terminal User Interface, ich will meinen Output formatieren, ich will nicht, dass man da drin was auswählen kann, als Charm, das da, meinst du das, Alter, Cute Frameworks, da sind wir richtig, Leute, Cute Frameworks, jawoll, ach ne, Moment, das ist für interaktiven Kram, ne, das will ich nicht, Network Sync Command Line App, Bubble Tea Terminal User Interface, ne, das will ich nicht, Lip Gloss, your Terminal Style and Layout Toolkit, das könnte ich vielleicht wollen, Charm, Markdown Renderer, was zum, ich will einfach nur eine Tabelle mal, Table Writer, zeig mal her, also im Prinzip suche ich sowas wie, ne, das frage ich mich auch, was es ist, ja, sowas hier, also für Python gibt es das hier, Rich, Tabelle mit Markdown malen, ja, das war ein bisschen umständlich jetzt, da ist dann, kannst du halt auch sowas machen, sowas für Go, weiß ich nicht, ob es das gibt, also ich suche ne Library, wo ich beispielsweise Konsolen Ausgabe easy farbig machen kann und Tabellen malen kann und vielleicht auch mal ne Progress Bar malen kann und sowas für Go, vielleicht, vielleicht kann man das ja hiermit machen, das sieht aber äußerst, äußerst cute aus, alles, ich will halt nix Interaktives, das brauch ich net, New Style Background Padding Top Padding Width, das sind zwei getrennte Use Cases, jaja, ich suche ja auch nicht das gleiche, unbedingt das gleiche für, ich mein Specter Console hat einen Command Line Paser dabei, den verwende ich aber auch nicht, also für.NET verwende ich für Command Line Apps das hier, als Argument Parsing und Help Generator und sowas und Specter Console für farbige Ausgaben, ne ich will was einfaches, ok, also ich würde sagen, nachdem wir uns das letzte Mal so sehr mit Command Line Parsing aufgehalten haben, heben wir uns das für nachher oder irgendwann anders auf, sondern gucken wir uns erstmal was mit Web Request und Daytime Handling an, also was ich machen will ist, ne Moment, wir brauchen noch mehr Sachen, wir gucken es mal kurz hier der Reihe nach durch, also Daytime Handling brauchen wir, die Regex Geschichte lasse ich mal außen vor, so, genau, Username muss ich schon einmal rauskriegen, Username muss ich rauskriegen, die kriegt man denn in Go, das ist das erst, was wir uns angucken können, Golang Current User, yep, Golang Environment Variables, was ist das für ein Operator, oh ich hoffe ich kann das richtig aussprechen, das ist der Null Coalescing Assignment Operator, jetzt weißt du wahrscheinlich Bescheid, oder, jetzt denkst du dir, ach Mensch, hättest du das mal gleich gesagt, jetzt weiß ich sofort was das macht, also, was das macht, Obvious, Completely Obviously, also was das macht ist folgendes, das guckt ob Start Null ist, wenn Start Null ist, dann weist es ihm ein Default Value zu, oder ein Value zu, also im Prinzip ist das die Kurzform von if Start gleich gleich Null, nein, gleich gleich Null, dann Start gleich Date Time Now, ach guck mal, da kannst du ja sogar umwandeln hier, guck, also das ist exakt die Kurzschreibweise dafür, das ist übrigens auch was was ich an C Sharp mag und wie Microsoft damit vorgeht, die bauen, man könnte jetzt ja sagen, hey, also das ist eindeutig der Go, der Go Weg, ja in Go würden die nie sowas einbauen, die in Go sagen, ihr macht doch völlig den if, das mag ich an.NET, dass die sowas einbauen, das ist jetzt kein riesen krasses Feature, aber es ist praktisch, I find das cool, so, also wie kriegt man, wie kriegt man Environment Variablen raus bei Go, OS, OS get enf und dann testen wir mal, ob das funktioniert, ja dann printe ich meinetwegen foo, get ent sudo user, so run sollte nicht funktionieren, ja und jetzt mal mit sudo ausgeführt, aha funktioniert, easy, ok, das ist einfach, das ist, da wäre ich, das hätte ich, ja, das kann man mit leben, also outsour, ja wie kriegt man den current, den current user, user username, user current, error, bloated, alter, bloated, komplett bloated Error Handling, gibt es irgendwo ein Fehlerfall, dass man den User rauskriegen kann, wann genau gibt es den Fehler, dass er den User nicht rauskriegen kann, run, oh warte, ja genau, alter, so, name, wat, wer doch da, ah username, verstehe, wenn es keinen home user gibt und root gelöscht wurde, ja da haben wir glaube ich andere Probleme, übrigens, exceptions sind teilweise echt was feines, das ist ja im Prinzip auch nichts anderes, wie wir werfen exceptions, die dann hochgebabbelt ist und keiner fängt, ja, also es wäre finde ich durchaus, also in dotnet wäre das tatsächlich einfacher gewesen, das Ding hier würde eine exception schmeißen und ich würde die nicht fangen und mein Programm würde abkacken, und gut ist, ja, aber aktuell, das, lassen wir mal bloated Error Handling, außen vor, ok, das muss ich user nennen, weil ansonsten klappt das nicht, also wir haben die Auswahl, so, mein Autor für diese Maintenance ist entweder der sudo user os get nf sudo user oder mein aktueller User, so und jetzt sind wir schon wieder bei der go Geschichte, wie macht man sowas da, mit einem if wahrscheinlich gehe ich mal von aus, oder kann man, geht oder oder, nee, mismatch, type, ach so, das ist username, immer noch mismatch, is not defined on string, nope, also das gibt anscheinend nur die Möglichkeit, ein if zu machen, also muss ich quasi, sudo user, na gut, ich mein, man muss sagen, ich verstehe schon teilweise so, glaub ich langsam so, was die sich dabei denken, dass man es in go eben, ich nenn's mal etwas umständlicher macht, die go Philosophie scheint mir eher zu sein, man soll halt die Sachen gefälligst explizit hinschreiben, ganz ausführlich, was man so macht, also if sudo user, tja, kein leerer string wahrscheinlich, denke ich mal, vermute ich mal, also machen wir sowas hier, gleich, User, wobei brauchen wir doch gar nicht, machen einfach sowas, falls das erlaubt ist, nein, das ist natürlich nicht erlaubt, keckel, nee, Moment, ich hab User doppelt benannt, das verwirrt den, das darf ich auch nicht machen, ah, das geht nicht oder was, also da jetzt username funsnet oder, nee, das heißt, ich muss das irgendeiner Variable zuweisen, ok, system user, das schwierigste ist doch immer eh, wie benennt man diesen Campbell, ach nee, da kommt ja dann noch Error raus, ja ok, system user, username, so und dann environment und der Autor ist sudo user, wenn sudo user nicht null ist, so, das ist jetzt äußerst explizit hingeschrieben, fällt irgendjemand was auf, wie man das eleganter oder kürzer und knackiger in Go machen kann, ja, also mir persönlich wäre ja sowas hier, lieber, aber das gibt es in Go nicht, ich glaube, das ist so der Go, the way in Go, ich glaube, großartig schöner kann man das gar nicht machen oder, wie sieht denn in Go ein ternary operator aus, ok, gibt es nicht, kackel, hätte ich mir denken können, if sudo, Moment, was, chat, ich hab das jetzt copy pasted, aber, weiß nicht so genau, was das, ach so, das kann man in einer Zeile machen, naja, ach so, ok, das ist natürlich schon mal nicht schlecht, wenn das geht und jetzt, ne, ja super, ja, Go, ich weiß, und wie würde man das jetzt machen, was, Komma, naja, schön, ich weiß nicht, ob das ehrlich gesagt so viel schöner ist, in.net könnte man auch sowas machen und dann würde ich sagen, ist, zum Beispiel, und dann würde das das auch checken, man kann sudo user nicht weiter verwenden, ja, das ist klar, das will ich aber auch nicht, ich lass es jetzt einfach mal so, wenn der chat sagt, das ist der Go way, ja, wir sind aber nicht in Rust, in Rust hätt ich dann andere Probleme, ok, also das funzt schon mal, der Autor ist Max und wenn ich jetzt sudo ausführe, müsste der root sein, ach ne, schwachsinn, lul, da muss immer Max sein, der User, weil das erliest der sudo, der User ist Max sowohl bei mir als auch mit root ausgeführt, richtig, Rust one on one quickscope, auf gehts, ok, also das hätten wir schon mal, haben wir schon mal mehr geschafft als in Rust, ok, weiter im Text, oh dns lokaler hostname, da bin ich mal gespannt, da bin ich mal gespannt, ok, ich gucke nicht nach, ich versuch mal, ob ich go verstanden hab, os, host, ne, Leute, oops, falsches Ding, easy, go durchgespielt, go, ach ne, hostname, alter was hat der denn wieder verschmerzen, ah, bestimmt wieder error, bloated error handling, ok, hostname, mal gucken, was der jetzt ausgibt, ob das überhaupt eine richtige hostname, hat das irgendwelche Parameter? ok, hostname, gibt es irgendwie was in, gibt es, ich bräuchte irgendein makro, print, weil in go muss man ja alles printen, dass er nicht abgefuckt ist, dass irgendeine Variable unbenutzt ist für 2 Sekunden, warum eigentlich Doppelpunkt gleich, das ist, dass er die Variable anlegt und gleich den Wert reinschreibt, es ist ein bisschen bescheuert, weil du könntest auch wahr davor schreiben und dann gleich machen, ja, das würde auch funktionieren, warum exakt go der Meinung ist, man braucht für das exakt gleiche 2 unterschiedliche Syntax, ich verstehe es nicht, ich persönlich finde die Variante hier deutlich schöner, aber go Fans finden die hier besser, so, hostname, hostname ist poggers, da bin ich mir mal gar nicht so sicher, ob das hostname poggers ist, ich will nämlich den hostname, ich will den fqdn haben, geht das da drüber auch, fqdn oder so, ne wahrscheinlich nicht, ok, go lang system fqdn, extra package, nope, ah, geil, geht wieder nicht, not pog, ok, ok, ok, ok, naja, ich lasse es erstmal so, weil es könnte sein, dass auf unsere Linux Kisten tatsächlich der fqdn und der hostname exakt das gleiche ist, also dass der komplette fqdn als hostname gesetzt ist, gehe ich sogar von aus ehrlich gesagt, so, da lassen wir das erstmal so, hostname haben wir rausgekriegt, ok, was wir aber machen müssen ist tatsächlich, wir müssen an der Stelle echt mal Error Handling machen, if error, ähm, äh by the way, warum haben die denn Error nicht gemacht, wie irgendein bool währt, dass der gleich einfach so funktioniert, hat bestimmt auch seinen Sinn, äh, if error null, tja, fmt panic, ne wie geht das, panic, panic fmt, kann man panics irgendwie ratieren, und visionell und nicht null, ja das musst du den Typ der go erfunden hat fragen, fmt error, aha, alles klar, und was passiert dann, ich will jetzt eigentlich, eigentlich will ich nur diesen Error durchreichen, wie geht das, ich will eigentlich nur diesen Error durchreichen, fertig, also, ich will quasi das machen, panic, ach ne fmt, error, f und dann einfach error, ok, no pass, Moment, das hat ein result, was hat das für ein result, panic, panic, error, ahja ok, so, ähm, run, ich bin mir nicht sicher, ob wir das irgendwie sinnvoll testen können, ob das, ob das panic funktioniert, weil ich weiß nicht, wie ich das zum failen bringen kann, ne, ich, true davor bringt ja nichts, da steht ja, da steht ja, selbst wenn ich true rein treffe, da steht ja im Error nichts drin, panic null, ja geil, ähm, mich hätte mal interessiert, wie der Error aussieht, zumindest, das sollten wir tatsächlich abfangen, im dotnet Programm würde das an der Stelle übrigens abgefangen werden, da wirft ne exception, ich fang die nicht und es ist Schluss aus, ok, also, passt, hostname, haben wir, schon mehr geschafft, schon mehr geschafft als in go, so und jetzt müssen wir ne silence setzen, alles klar, das, so, jetzt mal gucken, wie wir das nächste hinbekommen in go, da bin ich ja mal gespannt, also, warum, warum, oh ne, shortcut, hab noch meinen comment, comment noch nicht, comment, add keyboard shortcut, control k, control c, remove, wie sieht das mit line up aus, hab ich das schon, ab, ne hab ich auch nicht, meine güde, wichtigsten shortcuts sind nicht gesetzt, down, jawoll, remove, fuck, so, also, wir müssen webrequest machen, fangen wir mal mit dem webrequest an, wie mach ich nen webrequest in ordentlichen, http, get, ne http, post, das ist wahrscheinlich, http, post, sowas wie, gibt es eigentlich sowas wie await in go, bestimmt, das heißt plus anders, da macht man bestimmt in den channel oder so, ja, ok, also, so, also wir posten an diese url und zwar posten wir, hallo autocomplete please, what the fuck, warum gehts autocomplete an der stelle, url, content-typ, application, ach guck mal, der macht autocomplete, das ist ziemlich pork, bodyio reader, what, also, sowas würde nicht gehen oder was, ok, da muss ich mich mal inspirieren lassen, von irgendeinem Beispiel, post, buff, wo ist der buff, ich hab keinen stream, post, zeig ich her, post, url, gibt kein Beispiel, ok, zeig ich her, z-zone, post-request, post-request, ja ja, zeig mir wie ein post geht, da, data, data gleich values, ach das funst oder was, einfach, ein einfacher string funktioniert nicht, ok, also, wait a minute, hat das ding vielleicht ne fertige api, rometoys, alert-manager, api-go, ach es gibt ne fertige client-api, rometoys-go, ihr dann, ne, das ist die api, das will ich nicht, ich will den client haben, gibt es client oder sowas, tatsächlich, rometoys-client, ihr dann, das ist, da nutze ich doch das, da muss ich, wollen wir trotzdem mal gucken wie man das selbst zusammenbauen könnte, wollen wir trotzdem mal gucken wie man den request selbst zusammenbauen könnte anstatt, ja das gucken wir jetzt trotzdem mal, es muss, muss man ja, es wäre ja sinnig, ne, das zu lernen wie das funktioniert, also, wir ignorieren mal prinzipiell wieder alle errors, ach so, ja, ist ok, so, error-handling-ploated, so, also temp, so wir müssen jetzt, wir müssen jetzt diesen, also das passt schon, post-json haben wir, receive-json ist mir jetzt erstmal ziemlich wurscht, so wir müssen jetzt ein silence-objekt anlegen, das heißt wir brauchen einen extra Typ, das lassen wir uns autogenerieren und zwar, alert-manager-swagger, so das ist die api-beschreibung für das was wir machen müssen und wir müssen post-silences machen, so, und was ich gelernt habe ist, dass rider, wenn man copy-pasted, daraus ein go-objekt machen kann, guck mal, ist das nicht nice, silence, muss man gar nichts mal von hand machen, einfach json copy-pasten und der generiert dir, der generiert dir da draus ein go-objekt, das ist sehr praktisch, wahrscheinlich total verbose und man könnte es viel einfacher machen, aber passt ja, matchers-struct, ach ne, passt, ok, so, das heißt ich brauche jetzt hier silence, silence, i kill you, ich bräuchte jetzt hier silence, ne wie geht das, fill all fields, all die brauche ich nicht, matchers, ok, was brauche ich dann, matchers brauche ich, common brauche ich, created by brauche ich, start-time, end-time, ok, alles klar, also, start-time, wir machen mal kurz easy-mode, wir machen mal kurz easy-mode, weil, ach er kennt sogar, dass es ein time-objekt ist, ja wir machen mal time-now für ende und start, einfach nur um zu gucken ob es funktioniert, also unsere maintenance soll jetzt anfangen, was ich bastle, äh folgendes, mach mal ausrufezeichen heute, ich weiß nicht ob das richtig drinne steht, ich habe ein tool gebaut in dotnet vor einer weile für die arbeit, das kommt auf jeden unserer systeme drauf, also über 3000 stück, genau, ähm und dann kannst du vom system aus selbst für das jeweilige system von jetzt für 15 minuten lang eine monitoring-maintenance setzen, dass wenn du wartungsarbeiten angekündigt hast, hast aber vergessen für dieses system eine monitor downtime einzutragen und du willst nicht, dass das monitoring verrückt spielt, weil du server-rebootest, kannst du auf dem system dann set downtime ausführen, dann setzt dir eine für das system mit deinem name drin von jetzt für 15 minuten, das ist ein relativ übersichtliches dotnet-programm hier, also relevant sind ja eigentlich nur die hier, also 100, 180 zeichen, zeilen ist jetzt nicht die welt ja, und das habe ich mir gedacht, das können wir mal in go nachbauen und bisschen lernen wie man sowas in go machen würde, so also matchers, das sollte er zumindest schon mal schicken können, ne kann er nicht schicken, äh das heißt ich muss jetzt wahrscheinlich sagen jason marschall, ne das geht anart, das muss ich in 2 schritten machen, silence jason, war nicht sowas, wir ignorieren mal wieder alle errors, weil error handling bloated, jetzt, jetzt bin ich überfragt, was der von mir will, darf man fragen, welche monitor löse ich, äh prometoys, früher zappix, ganz früher nagios, dann lange zeit zappix und jetzt seit 2 jahren ungefähr, ja 2 jahren, exklusiv nur noch prometoys, vorti, das ist eine sehr gute idee, wir machen einfach mal ein bisschen länger, die add, time minute mal 15, also 15 minuten können wir die eintragen, äh created by, das haben wir doch hier, created by autor, comment haben wir noch nicht, hostname matcher müssen wir noch machen, ähm ok silence das mag er nicht, brauchst einen buffer, das ist aber ganz schön umständlich, ah das ist informdata, bytes new buffer jason data, ok, bytes new buffer, ja ok wenn man das weiß ist doch ganz in ordnung, geht in ordnung, wooploss approved, ja mit datetime ausrechnen bin ich mal gespannt, wie gut das klappt gleich, da so weit sind wir ja noch nicht, weil die zeit stimmt ja noch überhaupt nicht, die zeit muss nämlich in utc umgerechnet werden, das muss ich mir drüber schreiben, dass ich nicht vergesse, weil der alert manager läuft komplett in utc, so also das würde wahrscheinlich jetzt funktionieren denke ich mal, response, error wird ignored, wer braucht sowas, fmt, prindlen, response, ah ne, so, run, response ist null, das heißt es hat schon mal nicht funktioniert, ist aber auch klar, weil ich hab hier kein matcher gesetzt, da alert manager läuft nicht, na dann noch mal ausführen, doch funktioniert oder auch nicht, an anscheinend nicht funktioniert, da müssen wir jetzt tatsächlich schon wieder error handling machen, so viel error handling, so viel error handling, so unprocessable and what the, das nervt mich an go, dass man das nicht mal kurz auskommentieren kann, ohne dass sie dann sonst rumklicken, alter, das ist abfuck, ach ne, das kommt vom unten, der hat gar keinen, moment das, der hat gar keinen error oder, der hat gar keinen error, das hat funktioniert, der response code ist einfach code, status code, response code ist einfach 422, das heißt, da kam nichts sinnvolles zurück, ist ja auch klar, mein request ist ja auch fail, stba42, danke schön für den sub, captain peng, danke für den sub, hab ich gar nicht gesehen, huge subscription hier, es war gar kein prime subscriber, jebaited, so, kannst du naisu raushauen, ja klar kann ich das machen, nachdem du prime gesubbt hast, easy money easy life, ne ich kanns auch so machen, ja, so also weiter, status code, warum ist ein status code von 422 kein error, na ist eigentlich ok, es war ja auch kein error, der request hat ja funktioniert, aber obendrüber die ebene war halt ein fehler, der cloud musst du auch nicht jeden error behandeln, ich mein gerade, ich mein gerade wenn du ne exception bekommst ja und du willst an der stelle wirklich nicht weitermachen, dann machst du halt kein try drum und es kackt ab, du kannst halt in ganz vielen fällen gar nicht sinnvoll weitermachen, also kannst in vielen fällen den error nicht handeln, ich mein guck mal, wenn ich den hostname eintragen will und er kann den hostname nicht auslesen, da bleibt mir nichts anderes übrig als sowas zu machen und das erspare ich mir bei exceptions in der regel, weil ich einfach sag ja dann kackt halt ab an der stelle, es ist wahrscheinlich einfach ein bisschen geschmackssache aber ich also weiß nicht ich bin nur mit dem error handling noch nicht so, noch nicht so hundertprozentig warm ja, status code an den kleinen zurück zu liefern, was für ein status code, ich mein ich könnte ne sinnvolle konsolenausgabe ausgeben aber ich hoffe mal, dass der error sagt irgendwas sinnvolles aus, so also jetzt können wir den kram hier abschicken, so das heißt die matcher sind nicht gesetzt, wie setze ich denn jetzt hier sinnvolle matcher, so ich bin mir nicht ganz sicher, was die ganze syntax hier macht, wir haben nen array von structs, ok das verstehe ich, aber ist das ein anonymer struct, weil der struct hat kein name, das heißt der typ hat kein name, ne der hat wirklich kein name oder moment moment ne matchers ist ein anonymes struct array oder irgendwie sowas, und wofür genau muss da geschweifte klammern am ende noch mal hin, das würde ich ja verstehen aber wozu sind die geschweiften klammern da, was passiert wenn ich da was reinschreibe, keine ahnung, also ohne die geschweiften klammern funktioniert es zumindest schon mal nicht, was da kommt der inhalt hin, ich denke hier schreibe ich jetzt den inhalt rein, ne mache ich anscheinend nicht oder, warte mal, wie schreibe ich denn da jetzt was rein, ich hab kein plan, wie füll ich, wie füll ich das denn jetzt, was der struct, das hatte ich gerade, jetzt will er nix, ich kriege auch kein auto complete, das ist schon mal verdächtig, dass es nicht funktioniert, ok, goleng anonymes struct json, use anonymes struct, so, auf, zeig her, hier, da, new car, also, also, ok, ok leute, das heißt ich mache jetzt, ich mache jetzt einen neuen typ, typ, matcher struct und der enthält das da, sehe ich das soweit richtig, und dann ist das nicht dieser crap, sondern ein array von matchern, ok, es gibt keinen syntaxfehler, scheint schon mal zu passen was ich da gemacht hab, und jetzt, nein nicht nil, slice match, was will der dude von mir, ah, ok, das ist quasi so list syntax, also könnte ich quasi auch noch mehrere rein machen, ahja, ja ohne auto complete wäre ich jetzt aufgeschmissen gewesen, so, also, hostname, ok mal gucken, was muss ich da rein füllen, hostname, nee, name, name, hostname, value, die variable innerhalb von hostname, itsregionsfault ist equals true, ok, true, 0w, easy, so und jetzt sollte ich eine maintenance bekommen, wenn ich das richtig gemacht hab, go run, 200, 200 ist immer gut, 200 und haben wir eine maintenance, active, jawoll, hat funktioniert, poggies, hostname gleich poggers, alles klar, ok, schon mal deutlich einfacher gewesen als in rust, warum ist denn das hier ausgekraut, oh, was hat er jetzt gemacht, hä, unsinnig, die machen wir nix, assync mit channels, alles synchron ist ok, ich kann utc machen, ah, das ist gut zu wissen, aber so einfach ist es mit datetime natürlich nicht, so einfach ist es nicht, wir müssen nämlich das hier machen mit datetime, also sprich, entweder hat der user über die kommandozeile was gesetzt an datetime oder, wobei ich will jetzt keinen, ich hab jetzt keinen bock auf kommandozeilen, auf kommandozeilen, parsing, also das ergibt ja so mal Sinn, er setzt die maintenance und alles ist gut, kann ich das geprinte hier auch wegmachen, äh ja, status code null, was hat er für schmerzen, wo ist das problem, dann nicht, bloated error handling, alles weg, so, aber um datetime müssen wir uns jetzt tatsächlich doch kümmern, weil eine logik brauchen wir nämlich noch für datetime, also machen wir mal sowas hier, also start time, gehen wir mal von aus, wir hätten das aus der kommandozeile bekommen, irgendwie in den optionen, start time now, ok, wir simulieren das mal, ja, also das hier ist irgendwie keine ahnung, start time arc, so, das ist das was, das ist das was bei der kommandozeile reinkommt, so, über kommandozeile hat einer eingegeben, er will um 0.30 und 0 sekunden, also er möchte um 0.30 seine wartungsarbeiten beginnen, so jetzt brauche ich ja folgende logik, erstens muss ich den utc umrechnen und zweitens brauche ich folgende logik, wenn 0.30, also es ist nur mal ums zu erklären warum, also wenn einer um 23.45 sich einloggt, weil er wartungsarbeiten macht, kann es durchaus sein, dass der 0.30 angibt, der meint dann aber nicht 0.30 am aktuellen tag, sondern 0.30 am nächsten tag, also muss ich gucken, ist 0.30 in der vergangenheit, wenn 0.30 in der vergangenheit ist, dann meint er nächsten tag, am ende kommt ja nochmal statusausgabe, wo drin steht, was sache ist, er kann es ja am zweiten verlöschen, wenn das nicht so ist, aber in 99 prozent der fälle ist das so, dann kann man das nicht nämlich sparen, irgendwelche datum sachen und so anzugeben, habe ich mir gedacht, das ist sinnvoller, also gehen wir mal von aus, das hier kommt über kommando zeile rein, wie kriege ich das jetzt gescheit gepasst in ein, in start, in start time, also start time args, also time pass, pass in location, was macht das denn, das hört sich so nach zeitzone an, wenn ich ehrlich bin, pass in location, macht, pass in location ist like pass, no shit, but differs in two important ways, also pass, nimmt utc, wenn es keine timezonen informationen hat und pass in location braucht eine timezone, ok, wie kriege ich eine location, weil ich will immer location europe berlin haben, location ne, ne, location, load location, string, tja, ok das müsste, das müsste europe berlin sein vermute ich mal, goleng, timezone, berlin, wahrscheinlich, stand da, echt, wirklich, habe ich nicht gesehen, hier, oder, oder hier, example, ach guck mal da, null, im example ist es drinnen, keck, keck weh, ich bin mir nicht sicher, ob man das in go machen darf, aber ich glaube, ich brauche die, die time informationen noch an mehreren stellen, deswegen mache ich da eine globale variabler draus, ob das, beziehungsweise, darf man so machen, ne, muss ich da war da vorschreiben jetzt, ok, location, das werde ich gar nicht noch woanders brauchen, ok, pass in location, also ok, zeitparsen, wie kann man sich in go eigentlich in der idee hier, highlighten lassen, arguments, das müsste doch, das normalerweise ist das shift, shift, control, space, arguments, arg, param, parameter, control p ist es, control p, ah, control p, ok, dann, ja, ich verwende in rider die visual studio shortcuts, deswegen weiß ich das nicht, param, eben hatte ich doch, ok, nice, alles klar, ok, layout string, das ist dann wahrscheinlich irgendwie, ja, wahrscheinlich die üblichen geschichten, ne, wait a minute, ach ne, so muss man das machen, hier, was, hä, wa, weh, warum schreibt der da ne Jahreszahl hin, der soll, der soll, ja, ja, ja, schreiben, four digit, hä, kaputt, ok, ich will ja das ja gar nicht, ich mein, ich will, ich will haben, stund, hä, warum stehen da zahlen, minute, what the, die idee macht faxen, wahrscheinlich, ja, was zum toll, 15 uhr 4 und 5 sekunden, ach das sind beispiel, beispieldaten, beispieldaten geben doch überhaupt keinen sinn an der stelle, da müsste sowas stehen wie sowas zum beispiel oder minute, minute, oder ne, klein ist das minute, minute, hä, musste die doku schauen, vielleicht ist das absicht, aber das ist die weird champigste, also die weird champigste variante zum, zum, zum parsen, die ich lange zeit gesehen hab jetzt, ok, warte mal, ähm, ich guck gleich mal in die, so hier kommt jetzt wahrscheinlich der string hin und jetzt kommt hier die location hin, ok, das passt, oder auch nicht, warum, ach so, weil wir der error handling, error handling, keckel, ok, go lang, pass time, jawoll, erklär mal, date, layout, hä, der schreibt das auch so weird champ hin, aber, hä, das versteh ich nicht, sind das magic strings, die quasi als platzhalter fungieren, also sprich, muss ich hier 05 hinschreiben, dass er erkennt, ich mein, sekunden, und wenn ich hier jetzt 04 hinschreiben würde, dann würde er denken, es sind minuten, sind das irgendwelche magic, magic zahlen oder so, das ist keine big brain format angabe, das ist ne ziemlich bescheuerte format angabe, jetzt mal ganz im ernst, ok, würde das überhaupt funktionieren, pkg time constants, wenn du keine auto completion hast, bist du lost hier, moin patrick, die meinen das ernst, das sind keine beispiele, what the fuck, wir sind weiter als in rust, die meinen das ernst, man macht den go keine place halter für datum, für ja, minute, sekunde, sondern man trägt beispielzahlen ein, ok, das ist hardcore weird champ, das ist richtig weird champ, das checkt doch, das checkt keiner, der mal was anderes verwendet hat, ok, es ist der erste 000030, ok, das ist vor allem bei workstation hier, guck, vor allem bei workstation, ich weiß nicht, also das sagt mir jetzt nicht sonderlich zu, muss ich ehrlich sagen, naja gut, machen wir mal weiter, also, irgendeiner hat 0030 angegeben, jetzt hab ich das gepasst und jetzt weiß ich, das ist der erste 000030, das bringt mir ja nix, das heißt ich brauch jetzt sowas wie start time, date oder so, kann man das setzen, date kann man nicht setzen, kann man überhaupt irgendwas setzen, nee, muss ich da jetzt ein neues, muss ich da, moment, muss ich da jetzt irgendwie, ok, ich schreib jetzt einfach mal was hin und dann müssen wir gucken, ob das Sinn macht, also now gibt's ja, so, start time, gleich, time, gibt's hier sowas wie new, date gibt's, date, ok, now, year, das muss aber bestimmt irgendwie schöner gehen, now, month, ich will ja im Prinzip die Zeit plus das Datum von heute, aber ok, now, day, und jetzt will ich start time, hour, ok, das ist ja mal hardcore umständlich, das geht bestimmt einfacher Leute, wenn ihr irgendwie Ahnung habt, wie das einfacher geht, sag Bescheid, also, ich weiß grad nicht wirklich, so, nanoseconds, 0, location, location, das ist ja wirklich, woops, location, location, add, ob add funktioniert, also, start time, add, add date gibt es, also da quasi das gleiche, was will er haben, ja, Monat, Tage, was, Moment, der will den Monat als Int, aber Monat von dem gleichen Objekt ist ein eigener Typ und kein Int, was ist das für ein undurchdachter Schwachsinn, vor allem warum geht add date nicht, aber, aber, time, date, ist dann wieder ein Int und kein Monat, what the fuck, was ist denn, wer hat sich diese API ausgedacht, das ist ja mal richtig gehirnamputiert, alter, wer hat's, das ist ja mal richtig, also das ist wirklich maximal hängen geblieben, und was mach ich jetzt, caste ich das jetzt einfach mal hart zu einem Int oder was, achso, Moment, nee, wir sind ja in Go, Sekunde, äh, caste das mal zum Int oder gucken wir mal was rauskommt, ok, anscheinend, anscheinend funktioniert das, ok, start time, ah, Moment, ich hab nie die, die Topless G baitet uns, da kommt nämlich schon ein Timeobjekt raus, das muss ich erst mal was, immutable, das muss ich ja mal neu zuweisen, äh, was meinst du, wer kostet Geld, ach, vor allem bei Workstation, ja vor allem bei Workstation kostet Geld, so, run, 23, was, wait a minute, wir haben nicht den 23, wir haben den 22, und wir haben auch nicht den 8, ach, das ist schon, weil es auf 0101 steht, oh, abfuck, was das denn man, ok, also dann doch so, nee, das ist, das ist, das, also ich mein, die, die, die.net time API ist, äh, time Geschichte, ähm, ist schon nicht schön, aber das ist auch nicht toll hier, so, also jetzt hab ich die start time, das können wir jetzt mal ausprobieren, das müsste so ja funktionieren, so, da krieg ich nämlich Datum heute, heute 0.30, so, heute 0.30 ist natürlich schon um, deswegen muss ich jetzt gucken, if start time, nein, if start time kleiner now, nee, das geht auch nicht, invalid operator, ok, es gibt kein größer kleiner Vergleich zwischen time, das ist auch dumm, ok, go lang compare time, how to compare time, siehste, krass, erste, ähm, today add before, ok, das ist in Ordnung, mein größer kleiner überschreiben wäre irgendwie cool gewesen, aber ok, wenn das before now ist, dann printe ich erstmal keckel, alles klar, das ist before now, ist ja logisch, es ist ja 0.30 mit heutigem Datum, ist ja schon ein bisschen her, das heißt, wenn das vor dem aktuellen Datum ist, dann will ich es setzen auf, ok, Leute, das muss einfacher gehen, dann will ich es setzen auf, nee, Moment, add, add, ich will nen Tag adden, wie, wie adde ich einen Tag, achso, ich hab ne Idee, einfach so, hä, Null, ok, ich hab ne Idee, einfach so, hä, Null, Null eins, es müsste auch gehen, so, ok, start time und jetzt klappt das oder was, nein, ja, funktioniert, guckt mal, die Zeit ist vor, vor der aktuellen Zeit, dann macht er sie für morgen und die Zeit ist nach der aktuellen Zeit, dann bleibt es auf heute, genau, genauso will ich das haben, das ist gut, alles klar, das ist aber mega hardcore umständlich, zwar im Ernst, das ist wirklich umständlich an der Stelle, irgendjemand fife hat eine Idee, wie das einfacher geht, wenn in der Zwischenzeit eine Zeitumstellung ist, dann passiert nichts, weil sich das alles auf meine Now Variable bezieht, die ich einmal gesetzt hab, aber es ist schon, also, hm, fällt da irgendjemand was Schlaues ein dazu, das muss man irgendwie schöner hinbekommen, ich mein, kann man Dates mal irgendwas, nein, das geht auch nicht, aber das sieht bisschen pipiger aus, viele Zeilen können es ja nicht sein oder, oder macht Pastebin oder so, ja Pastebin, da steht jetzt Rickrolling drin oder so, ok, Vorschlag vom Chat, auf gehts, ok, soweit, wat, äh und wo machst du den Unterschied, ob es heute davor ist oder morgen, weil, das macht er selber, ich checks trotzdem nicht, ach so, das macht er selber, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, aber es muss ja nicht 0h30 sein, es könnte ja auch irgendwie, 18h sein, gehts dann immer noch DURATION HOURS okay also das ja das ist ein bisschen kürzer und das ist vielleicht schöner zu lesen aber ich checks nicht so gut wie mines wobei mines auch schon nicht gut zu checken ist aber ich glaube ich lass jetzt mines erstmal ich mein das versteh ich wenigstens noch halbwegs können wir kurz anschauen ist es das karbon video ja ich hab schon auf ich hab's ich hab schon auf die flur hammer denn 21 wir machen noch eine viertel stunde wir machen auch eine viertel stunde go da gucken uns noch das karbon video an carbon ich verstehe ja nicht so genau wann man carbon verwenden soll weil die ganzen spiele programmierer werden wahrscheinlich weiter c++ verwenden das ist wahrscheinlich nur wenn man keinen bock auf c++ hat aber c++ libraries verwenden muss oder so ja gucken wir gucken wir uns an ok also das das das sollte soweit passen ach ja in viertel stunde haben wir noch zeit wir müssen die sache noch in utc umwandeln ich glaube das ist in dem fall tatsächlich jetzt relativ easy nao machen wir hier mal weg und das machen wir auch oben hin weil das kommt ja später in kommandozeilen argumente parsing kommt mal hier weg das ist wirklich pepega aber ok so also starts at start time utc in utc so duration habe ich noch nicht kann denn ok mal was anderes kann dann go time und duration zusammen rechnen irgendwie wahrscheinlich ok testen wir mal time duration das erinnert mich an an rast von gestern wie ok sag mal ich habe ich habe eine duration von 20 minuten minutes time minutes 20 so kann ich jetzt sagen ne da muss ich moment das muss muss ich muss ich hier oben machen end time ist da time at ach das geht ok das ist gut dass das funktioniert was ist denn jetzt schon wieder dein problem mensch ach moment nee ok einfach so oder was ok end time utc ja das müsste doch jetzt eigentlich funktionieren lass mal kurz in den alert manager gucken nix aktiv ja ja ich brauche meinen delete knopf ich brauche meinen delete knopf so also utc auto comment comment ist jetzt erst mal egal gut wenn ich das jetzt richtig sehe der sollte jetzt eine maintenance setzen oder eine silent setzen für morgen 0 uhr 30 also 23 siebter 0 uhr 30 bis 0 uhr 50 wenn das alles funktioniert warum sagt er ich soll das nicht machen delete ach so geht das auch das ist dann quasi eine duration time minute mal 20 so mies ist die api gar nicht mal muss ich sagen wenn man sich da dran gewöhnt ist das naja das hier oben ist schon eklig aber naja ok gucken wir mal also für morgen 0 uhr 30 bis 0 uhr 50 funktioniert hoffe ich mal panning view ja wir reden ja wir reden ja von utc ja wir reden ja wir reden ja von utc ja ja doch doch doch doch das ist richtig das ist richtig 22 uhr 30 utc ist 0 uhr 30 bei uns zeitzonen abschaffen da bin ich auch dafür zeitzonen sorgen für viel mehr stress als dass es irgendwas bringt dann ist es halt bei ein um 20 uhr mittag und ein beim 12 uhr mittag ist doch egal man gewöhnt sich dran dass 20 uhr mittag ist besser als sommerzeit winterzeit zeitzonen shit ok das war erstaunlich einfach jetzt jetzt hat er die maintenance gesetzt so jetzt fehlt uns natürlich noch ach so die id brauchen wir noch von der maintenance ok gibt es so was wie dynamic in go so irgendwie so dynamic jason ohne dass ich ein extra objekt zum marsch allen und entmarsch allen brauche also sowas wie hier response response response wir zählen alles nur noch in unix timestamps ja da bin ich dabei gibt es sowas wie ok go lang scheiß jason dynamic dynamic jason in go also ich würde jetzt gerne ehrlich gesagt sowas machen jason id aber ich glaube das das geht nicht oder oder kann ich da irgendwelche anonymen structs jetzt für verwenden nö anmarschal into dynamic hell wunderbar map string interface jason raw message ok ich habe keinen plan was der was der dude da treibt da machen lassen wir da jetzt einen typ draus erzeugen und gut ist schwäger wir bekommen als antwort für einen post wo steht die response hier es type struct ja keine ahnung silence response silence id rapper ach keine ahnung silence response heißt das ding jetzt gut ist weil ich brauche die id das heißt wenn ich das jetzt richtig im kopf habe jason die marschal ne entmarschal oder wie heißt das anmarsch ja meinetwegen so body und jetzt sagt man ihm in welchen typ im moment den typ musste man vorher anlegen und da hat er chat gesagt das macht man mit war silence oh gott war fuck alle ich weiß nicht bis funktioniert jetzt gucken wir uns einfach ab was haben wir hier gemacht so macht man das alles klar also dahinter einfach den typ also silence response und dann sagt man ihm hier was war das und man muss man dann und machen und api root ok bites ok direkt davon lesen ging anscheinend nicht ein bisschen umständlich aber ok wobei kann ich nicht einfach sagen bites read read reader new reader irgendwie so less body ach fuck was ist das problem wirklich muss man das wirklich so so extrem umständlich machen bites so gotte hallo so und jetzt ok das ist wirklich krass umständlicher shit so null ist jetzt gut oder schlecht ach ne moment ich ich ich ich print hier auch das falsche ich will ja auch das printen tatsächlich es funktioniert glaube ich ja funst du musst du response body noch klausen wie geht oh der chat sagt es geht auch noch was anderes hier zeigt mal her der chat way wird jetzt ausprobiert jason u decoder body die code in moment das muss trotzdem an das muss ich trotzdem wahrscheinlich anlegen und da muss kommt jetzt was any so unhandelt error keck ok und das funktioniert jetzt tatsächlich das funktioniert ich muss das noch klausen die coolen leute in go sagen doch dann so was oder ach so cool das müsste klaus heißen dann wüsste man das body klaus gibt das nicht in den reader fuck also funktioniert das jetzt oder nicht was hat er denn für schmerzen also er ist damit nicht einverstanden aber ich werde definitiv nicht das da machen das kann ich euch sagen ne ne ne der meckert der meckert darüber wie macht man das richtig ganz ehrlich ich muss es nicht klausen weil selbst wenn es memory liegt ist egal das programm läuft zwei sekunden dann memory liegt halt solls memory liegen ist mir doch egal das wird geschlossen und dann räumt es automatisch auf das wird nicht geklost fertig bleibt so da wird nichts geklost ok das funktioniert so dann können wir jetzt die letzten drei minuten noch gucken ob wir diese ausgabe hier so schön hinkriegen emoji ausgabe ist definitiv das wichtigste überhaupt so das funst schonmal emoji ausgabe so prindeln davor prindeln danach und jetzt müssen wir noch diesen ganzen anderen krempel ausgeben also fmt ja wie mache ich ok das das können wir doch nicht machen weil hier mache ich jetzt ja gleich farbige konsolen ausgabe und sowas aber das können wir machen also fmt prindeln warum gibt es eigentlich keine gescheiten interpolate strings und nur dieses format zeug so monitoring silence created plus silence eigentlich moment moment leute leute ich habe das allerwichtigste vergessen das allerwichtigste was eigentlich heutzutage nirgendswo fehlen darf ja so ist das gut so ist das so muss das sein also ohne rakete kannst du das heute nicht mehr machen sie ist ja auch am streamtitel heute rakete ist einfach so dass das das summa summa emoji was die ganzen coolen leute heute verwenden und vor allem die ganzen krypto bros und die ganzen leute die scammen wollen die haben immer alles nur das geilste für dich und mit rakete ja wir können so eine halbwegs sinngemäße ausgabe machen ja also sprich sagen wir start start ist amt das ganze farbige zeug haben wir hier nicht ok go color terminal das go vielleicht selbst plus start time string leute was der unterschied zwischen string und go string go string ok kann man das jetzt formatieren ne format und da wieder dieser komische layout string meine güte ich will haben ja eigentlich eigentlich will ich das gar nicht haben eigentlich will ich will ich da stehen haben startet in so und so viel minuten gibt es den go lang humanizer gibt es denn so was go humans ok ja weil mein netprogramm gibt aus starts in 4 hours from now oder solche dinger das ist viel praktischer an der stelle als einfach eine zeit go humans einfach 3,2 karsternchen also du brauchst glaube ich auf github und go oder russ projekt da musst du schreiben written in russ written in go und dann kriegst du gar keiner fliegen die sterne time wie formatiert man time times humanize time korrekt das probieren wir jetzt mal schnell aus dann gucken wir dann ist Schluss für heute dann gucken wir uns noch ein paar videos an wie bindet man das ein github go humanize klar sink ja geh fort was jetzt unused import go fuck mich nicht ab please humanize time und wie ging das jetzt noch mal time some time instance also sprich wann starten wir end time a moment start start nicht end time null start start time start time ok zeige ich mal her 2 hours from now genau so will ich das haben probieren noch mal das hatte ich doch vorher das das mag er nicht weil weil er weil ich den error nicht händle ja ich händel nicht den error den close werfen kann und das ich mein laufen tut es ist ein warning hier von von der ide oder was auch immer was trotzdem cringe warnings cringe warnings hat das ding vielleicht irgendwelche sinnigen optionen na mir wäre es nämlich lieber der würde ausgeben starts in one hour 50 minutes und nicht 2 hours from now gibt es da nicht ein paar bessere beispiele für time custom time was will er von mir ich bin nicht der einzige das lesen könnte das lesen können das die meisten würde ich sagen so schwierig ist das ja nicht ja aber das ist keine gescheite time formatierung hat go format human time ich würde schon lieber haben dass da so was steht wie nicht 2 hours from now sondern 2 hours from now stimmt ja nicht wirklich ja es sind ja 1 40 from now moment startzeit startzeit ja doch 2 hours from now moment meine startzeit sind doch nicht 2 hours from now das stimmt doch auch überhaupt nicht guckt mal moment start time sind doch keine 2 hours from now das sind das sind 3 stunden 40 das hat auch mit utc nix zu tun 3 stunden 40 sind das ja das ist aber nicht in utc und selbst wenn was 42 42 nicht 3 40 komm ich auf 3 40 42 ok jetzt verstehe ich das ist in 2 stunden 40 und das ding kann ja aber das ist doof also also die formatierung finde ich finde ich kacke ja das das sollte schon ne das ist dumm das sollte schon genauer dastehen ansonsten ich mein ich kanns auch einfach wir können auch einfach sagen irgendwie zu duration oder so falls das geht oder kann man 2 2 sachen voneinander abziehen kann man kann man in go time now minus geht das warte mal kacke oder was ist das sup sup subtract oder so so kacke string moment ist falsch rum das ist falsch rum start time sup time now ja und da kommt jetzt was raus ein timespan oder was ist denn kacke jetzt überhaupt eine duration ok ja das ist in ordnung format das ding hat keine formatmethode oder was minutes ja man ist das beste das beste was ich machen kann jetzt kann man das kann man das karsten das ist ja nur mit karsten los nee alter muss ich das vorher in karsten oder in string karsten oder was nee was einfach nur strill nee wir sind nicht in python kann man nicht auch eine duration passen doch ich glaube schon da noch irgendwas geschrieben duration doch irgendwas stand doch da duration nee nee kann man nicht add support for duration nee das ist ja was ist eigentlich sein problem mir mal doof gefragt ich meine float 64 ja schön und wie kriege ich das jetzt hin muss ich jetzt sagen dollar v print f print f format so lull backslash n das ist go land ja da das passt so aber naja also naja schön ist was anderes so kann man das rounden irgendwie round math round naja ja so ich mein so könnte man damit leben schön ist es nett was prozent also muss ich das gar nicht selbst round he doesn't know he lacks critical information funktioniert nicht leute ohne so so naja ich will aber null haben geht es auch ja so ist gut so ist gut es startet in 153 minuten also ganz im ernst ordentlich formatiert wäre mir das lieber das da steht startet in zwei stunden 33 minuten oder so wäre mir irgendwie schon deutlich lieber man kann das sicherlich doch doch chat man kann das garantiert von hand machen aber ich bevorzuge es da irgendwelche libraries die dann auch ein gewisser bisschen fehlerfreier sind als das was ich mir jetzt aus den fingern saugen könnte das ist aber enttäuschend ja dass du die times dass die times hier nicht ordentlich formatieren kannst das gefällt mir nicht go humanize time wenn die emojis auch in putty angezeigt ich glaube nicht dass putty so modern ist dass es den neuesten front renderer von windows verwendet also wahrscheinlich eher nicht also das liegt ja daran dass nur die neueren direkt oder wie heißt das direkt direkt wie heißt da krempel für die schriftarten direkt stream ne windows font render direkt irgendwas mit windows zeug direkt right heißt es genau direkt right ja also wenn putty das nicht verwendet führt das schrift rendern wovon ich ausgehe dass es das nicht macht dann wird das mit den emojis nicht funktionieren powershell kann es standardmäßig auch nicht nichts unter windows kann das standardmäßig das einzige was es kann unter windows ist das neue microsoft terminal als geht es mal einst auf chat als könnte das ding hier emojis keckel das glaubt ihr doch selber nicht ja es hat nicht ein emoji wobei ich könnte eigentlich anstatt zu copy pasten einfach windows taste guck hier da ist nichts mit emoji so powershell glaube kann das auch nicht es ist ja der gleiche shit im endeffekt so das einzige was es kann ist das neue windows terminal ach ne da auch nicht da muss man auch in ubuntu oder so starten dass das funktioniert na geil richtige rots weitere grundlinux zu verwenden ok alles klar neue chrome version ist am start leute naja das soll es heute mal gewesen sein mit go lang wir gucken uns jetzt noch das video an mal gucken ob es da irgendetwas gibt es für go garantiert fertige libraries so also das da soll ich mir angucken zeigt mal her go lang das ist das wird im leben nicht c++ kann nur von c++ gekillt werden da bin ich überzeugt von na da kann man sich jetzt drüber schreiten ja was gibt es immer noch microsoft javascript type script apple killed objective c with swift jet brains killed java with kotlin and now google is stepping up to the plate for the biggest challenge of all c++ it just is designed to match the performance of c++ with lvlm while being able to interop with existing c++ code bases that's a big deal because c++ is by far the most prolific language when it comes to building high performance low-level systems ja auch die most shit language is 1983 and it's accumulated a lot of technical debt in the process the creator of c++ once said quote within c++ there is a much smaller and cleaner language struggling to get out the problem with making c++ das hat er aber schön umschrieben und dadurch dass die klinische language out get it wird immer mehr shit obendrauf gebaut better today is that it's such an important language for so many code bases that it needs to focus more on standardization as opposed to evolving the design to what modern developers want it's really hard to change and establish check now ist es nicht auch in niederländer genauso wie der pyson dude like when python 2 into python 3 the changes weren't that extreme but it's still very painful for anybody wanting to and also all the content on the web and stack overflow becomes stale one could argue it's actually a good thing that c++ doesn't try to change too aggressively carbon is designed to be a successor language for c++ which is no small undertaking but google is no stranger to creating programming languages it gave us go and very well liked in the industry at this point carbon doesn't have a good logo or mascot but i'm sure it will get one eventually you might also be wondering why not just use a modern memory safe language like rut näher ich vermute mal ganz einfach weil die leute c++ libraries verwenden wollen bei google und das dann mit rust halt schwierig wird rust und c++ interop ist halt nicht das einzige was du machen kannst ist ein c++ kram in c interface zu exportieren die wollen wahrscheinlich kein c++ verwenden aber sie wollen c++ libraries verwenden so so stelle ich mir den anwendungszweck von carbon vor erst first of all not all c++ developers actually like rust but more importantly carbon is designed for easy adoption by existing c++ codebases and developers it has bidirectional interoperability with c++ which means you can use existing c++ was last and seamlessly or vice versa now i've only been coding for about 12 years which isn't nearly enough time to learn c++ let's take a look at some code anyway to run carbon at this point you'll need to install google's build tool basil as well as llvm to build it to say hello world we have a main function that uses print with a string literal looks pretty simple but if you've never seen a c++ hello world that uses this character out bullshit then it looks like a revolutionary improvement but a bigger feature is the moment moment despite this vomit so high IQ it was llvm to build it to say hello world we have a main function that uses print with a string literal looks sieht eigentlich irgendwie so aus wie ich mir das vorstelle aber ja wir wissen in c++ geht das so nicht allerdings wenn irgendwann in 15 jahren mal alle compiler die string format api unterstützen dann sieht das auch in c++ ganz brauchbar aus falls es jemals der fall sein wird it's pretty simple but if you've never seen a c++ hello world that uses this character then it looks like it's really revolutionary improvement but a bigger feature is the fact that it supports a modern generic system generics allow you to pass types as parameters to classes and functions a common pattern and statically typed languages but c++ takes a different approach that's often misused and abused called templates carbon still supports templates but generics will provide a bunch of advantages in most situations but moment nur durch das jetzt richtig verstehe du kannst jetzt carbon generics und oder templates verwenden ja das macht ja viel besser ja patrick genau das dachte ich mir auch gerade bunch of advantages in most situations but more importantly carbon looks to improve upon memory safety patterns in c++ you can have uninitialized variables which can sometimes be important for performance but more often than not they just result in bugs and memory access bugs can be very dangerous when hackers learn to exploit that carbon has an entire dock on its safety strategy and basically it tries to be as safe as possible without hurting performance or interoperability with c++ and it also ich ich fehle immer noch ein bisschen so wirklich den den einsatzzweck dazu sehen in different modes like debug performance and hardened depending on how much you want to prioritize them carbon hat ja anscheinend kein zwischenschritt in dem es erst carbon zu c++ übersetzt und dann durch einen compiler deiner wahl kloppt wäre das so könnte man damit wenigstens wenigstens sp 32 programmieren also ja also patrick ich glaube auch nicht dass ich das groß durchsetzt memory safety notably it doesn't use mechanisms like baro checking reference counting or garbage collection like you might find in other languages sounds pretty cool so when can i start using it well at this point it's experimental and it's an extremely ambitious project it'll likely be multiple years before this language is production ready now even though google just implemented a hiring freeze employers are already looking to hire carbon developers you just need to have 10 years of carbon experience to apply this has been the code report thanks for watching and i will see you in the next one ja das ist eindeutig jebait liest mal den rest aws react photoshop ja ja thanks for watching and i will see aber damit der witz der geht immer ja du musst irgendwas programmieren viel anders wird das nicht funktionieren am besten ist natürlich wenn du irgendein ziel oder irgendein anwendungszweck hast warum du das ganze lernst ja manche haben sie wollen irgendwie den spiel programmieren manche wollen einfach nur irgendwie eine ordentliche desktop anwendung machen die ihre bilder organisiert was auch immer vielleicht hast du ja irgendein ziel was du machen willst vielleicht willst du auch die next gen blockchain ai machen ja leute wenn ai porn kommt das wird das riesen business ich sag's euch ai generated porn das lernt was die leute geil finden und dann für personalized porn generator das ist das ist da steckt die kohle drin ich sag's euch ai porn gachi was hyper gachi ich dich ja what ich glaube du musst doch noch ein paar tutorials lesen und vor allem die beispiele machen die in den tutorials drinne stehen das wird safe geben ja man die ansätze sind jetzt ja schon da funktioniert noch nicht so richtig gut aber die ansätze sind da und die nächsten paar jahre wird es das geben ja aber die sind alle nicht so nicht so dolle also ich will nicht behaupten dass ich alle gesehen habe weil die das no relax critical information aber das was ich gesehen habe aus strengen wissenschaftlichen blickpunkt natürlich war jetzt noch nicht so der wahnsinn und das was die dort gemacht haben war ja im endeffekt auch eine fertige porn szene nehmen und dann dort das gesichts swappen im endeffekt also das ist ja nochmal was anderes als sachen komplett generieren aber das wird kommen auf jeden fall sag ich euch das ist so sicher wie das arme in der kirche dass sowas gibt ja judo mir hat gute kurse je nachdem welche programmier sprache du machst ja gut keine ahnung also dass der satz war jetzt bescheuert also welche programmier sprache willst du denn lernen ansonsten ich gehe davon aus dass es für die meisten auf judo mir ganz gut ganz gute kurse gibt wie installierst du auf linux eine tage z-datei ist jetzt ist jetzt gerade jebait im chat ansonsten ist es ganz einfach tage z entpacken ist das easieste auf der welt zeigte wie das geht da xfz v blub punkt da punkt jetzt hat so sieht es aus und dann jetzt da kann ich mir merken extrakt den rest auch nicht aber die beste seite bestes seite geht nicht für alles aber für das wichtigste hallo leute hier ist der max und jetzt ist es wirklich passiert 96 tage nach dem upload von meinem video über wenn aus elf dachte sich der geht einfach mein eigenes video an ja das muss ich jetzt mal dick keck wait ach das hatte ich auch wegen gedriggerten linux fans vorher ok also also vergesst sie und vergesst sie plus plus zum einstieg wenn du unter windows hauptsächlich unterwegs bist vergesst auch erst mal linux versuche nicht fünf sachen gleichzeitig zu lernen und sie und sie plus plus ist zum einstieg auch das schlechteste was man nehmen kann meiner meiner meiner ich weiß gibt leute die sehen das anders aber ich sehe das so sucht es die schaap oder pausen aus beides gute einsteigerprogramm ihr sprachen ja aber nicht zum einstieg naja du könntest die beispiele machen die dort bei den tutorials dabei sind ich weiß nicht ob die ob die dort irgendwelche übungsprojekte haben ansonsten musste halt ein bisschen das nachbauen was sie in den tutorials lernst also rein tutorials machen ohne ein bisschen zu üben ist kacke ich mache es ja auch meistens so ich lese immer relativ viel tutorials oder guckt mir relativ viele talks oder tutorial videos an zu einem thema und ich fange erst dann an und dann gucke ich die einzel punkte nach so nachdem ich einen groben überblick habe aber du kannst nicht ein komplettes programmierbuch quasi durchlesen von anfang bis ende und dann erst anfangen also müsstest du musst schon mal so nach ein paar themen immer was kleines machen und dir das mal angucken weil du hast ja da gerade wenn du was neu lernst hast ja alles drinne ja von basic datenstrukturen bis kommando zeilen anwendung bis alles das springt dann sehr hin und her also ich würde immer mal zwischendurch schon so ein paar kleine übungs anwendungen machen muss ja nichts grosses sein kannst du archlinux empfehlen ja beste arch by the way wir wissen ja woran man einen archlinux user erkennt er wird es dir erzählen ich habe noch nie coaching gemacht und nachdem ich mir vorstellen könnte das dauert ein bisschen müsste ich dafür wahrscheinlich zu viel geld verlangen als dass ich das lohnen würde für dich nee dann ganz ehrlich gerade der einstieg den kriegt man wunderbar mit kursen und übungs- und kleinen übungsprojekten hin wenn du brauchst die tutorials wenn du gar keine ahnung hast dann weißt du nämlich noch gar nicht an was zu suchen sollst ja wenn du eine programmiersprache schon kannst und lernst jetzt eine andere dann weißt du nach was du googeln musst ja habt ihr heute gesehen ich habe laufend nach irgendwas gegoogelt wie das mit go funktioniert aber schon weil ich wusste wie das heißt was ich suche wenn du gar keine ahnung hast weißt du nicht an was du googeln willst da was du googeln musst also nee du musst also ein bisschen tutorials und sei froh dass es video kurse sind früher hast du die bücher geholt ja aber du musst ab und zu mal schon ein paar kleine übungs sachen machen das wird nicht anders funktionieren muss dir halt irgendwelche simplen projekte raussuchen irgendwas was überschaubar ist es gibt sehr viele videos dazu so zehn projekte für einsteiger oder einsteiger projekte empfehlungs sachen da gibt es da gibt es was ja von kleinen kommando zeilen anwendungen manche basteln irgendwelche taschenrechner wobei ich sagen muss taschenrechner können ultra komplex sein aber die easy varianten davon nicht oder irgendwas was dateien sortiert du kannst beispielsweise mal ein bubble sort von hand machen so so so kleinigkeiten aber da gibt es viele blog posts und videos mit einsteiger programmierideen ja embeddelt da würde ich auch immer also wenn ich die auswahl habe zwischen c plus plus und c dann würde ich wahrscheinlich weiter so machen wie ich mit arduino mache ich mach c plus plus in c also ich mach zum größten teil c aber mit ein bisschen c plus plus weil mich spätestens wenn wenn wenn ich irgendwo sehe standard mk shared pointer bla bla bla dann ist bei mir schon zu viel c plus plus drinne ja das wird mir rein mit pyson schwierig er hätte mit javascript anfangen müssen weil mit pyson hast du dann plus plus tk was halt naja finde ich nicht nicht der rede wert ist und definitiv auch nicht gelernt werden muss vielleicht könnte man eine kleine webanwendung machen aber dann bräuchte man schon wieder javascript ntml fürs frontend und pyson fürs backend wie du dich am besten darauf vorbereiten kannst dich mal ein bisschen über die laden schlau machen in denen du hinkommst was die dort machen letztendlich du musst du musst nicht programmieren großartig lernen bevor du deine ausbildung anfängst die ausbildung ist dafür da dir was beizubringen was du machen musst ist du musst interesse und eigeninitiative in der ausbildung haben aber dann hast du direkt vor ort leute die du fragen kannst und projekte die du machen musst dann ist es nicht so nach dem motto ich lese den tutorial und weiß nicht was ich damit anfangen soll wenn du das machst kommt dein chef zu dir und sagt hier guck mal wir haben in den script was sich auf 20 servan einloggt und dort ein paket hinkopiert ja blödes beispiel das macht man wahrscheinlich heute nicht mehr mit einem mit einem script aber nur als beispiel und dann sagt er zu die hier nimm dir das mal und baum einen parameter ein wo man den fad eingeben kann wohin das kopiert wird so und dann hast du auch schon ein ziel was du machen musst dann weißt du auch ungefähr wonach du nachgucken musst und dann hast du auch wen du nur fragen kannst ja ne also da würde ich mir jetzt nicht so viel gedanken zu machen im vorfeld ne das ist auf jeden fall nichts für den anfang binary tree inverten muss man auch nicht zum anfang ne wie gesagt das erstens habe ich keine großartigen pies eine ahnung und zweitens wäre das zu teuer und ich habe es auch noch nie gemacht ich habe da erstens kein bock drauf und zweitens dauert es zu lange und wäre deswegen in kombination mit kein bock drauf wie das viel zu teuer ist ja ich weiß aber dann musste zwei frameworks nebeneinander lernen das ist auch nix wo denn du hast überhaupt keine frage chain lore fels jam ich hab das schon gesehen das ist wieder ein klassischer das ist überhaupt nicht das ist nicht deine frage das ist dein tibet versuch microsoft access das ist das was du brauchst um dich in windows einzuloggen deswegen heißt es ja auch access ohne access kannst du dich nicht in windows einloggen das heißt nachdem du jetzt eingeloggt bist und im twitch chat schreibst hast du auch access naja ich muss den tibeter tibeten was bleibt mir denn alles übrig ok chat hast du feste streamzeiten nicht wirklich nee kannst du mir aber follow und dann siehst und kriegste nachricht wenn ich online gehe was ist die bessere alternative zu access diese art der anwendung sind komplett überflüssig und braucht kein mensch wenn du eine anwendung hast die eine datenbank braucht die nicht übers netzwerk oder sonst wie dann nimmst der sq light wenn du eine web anwendung hast wo ein bisschen mehr brummt wo du im zweifelsfall auch die datenbank auf eine extra kiste machen willst nimmst du postgres fertig und wenn du dann ganz spezielle anforderungen hast kannst du mal so was wie wie mongo db redis kasandra was nicht alles gibt influx db und sowas nachdenken aber nur wenn du ganz spezielle sachen machen willst wo postgres nicht nix nix taugt ja ansonsten für einfache sachen sq light uninstall anderes fällt mir da nicht mehr ein wir haben auch auf irgendeinem ibm mainframe haben wir noch db 2 und unsere mainframe entwickler die kommen sich für die krassesten giga chats vor ist echt so wenn du da vorbeigehst die denken echt sie sind die krassesten heckermans auf der welt dann haben sie so eine hässliche fadenkreuz konsole ibm mainframe terminal hier guck so ein terminal ist das mit so einem fadenkreuz drauf wo man was anklickt ganz ganz pains champion das sieht das sieht auch aus wie 1990 nur dass du sowas halt mittlerweile auf dem desktop hast aber wenn ich sowas schon sehe weißt du was ich machen kann wenn einstiegspunkt im eckfall nicht dann verwendest du weder pisen noch sie schab sucht ihr eine sprache raus und fangen mit der an kannst du nicht ernsthaft sie schab pisen und c plus plus gleichzeitig lernen wollte das kann doch nicht dein ernst sein nimm pisen oder nimm sie schab den rest vergesst lass bleiben zum einstieg wir haben auch linux drauf da kannst ja so minimal vms laufen lassen da haben wir auch linux drauf eigentlich c c und c plus plus sind zum einstieg müll verschlüsselungstool für daten unter linux ja normalerweise hätte ich gesagt einfach ich sag immer das falsche nfs oder e-crypt fs ich kann mir immer nicht merken welches das aktuelle ist was man verwenden soll nee nee du willst du willst nicht vera krypten sowas du möchtest ja dateien sinken vermute ich mal ja du möchtest dateien ver du möchtest auf datal so wie ich das verstehe möchtest du auf datal ebene verschlüsseln so dass du sinken kannst weil du sagst auf mehreren rechnern du willst e-crypt fs oder eng fs und ich bin mit nein nein nein nicht lux du willst was was du sinken kannst so wie ich das verstehe du willst e-crypt fs oder eng fs ich kann mir nicht merken was davon das aktuelle ist macht beides ungefähr das gleiche verschlüsselt auf dateiebene datainamen bleiben erhalten je nachdem wie man es einstellt aber es wird nicht ein großer blob draus gemacht sondern da teilweise verschlüsselt das ist das was du haben willst ja du willst e-crypt fs oder eng fs du musst gucken was davon das aktuelle ist ja in der berufsschule oder im betrieb im betrieb kann dir das keiner sagen im betrieb könnte es auch genauso gut java sein deswegen sag ich ja du musst da weil dich schlau machen bei deinem betrieb was der denn hauptsächlich verwendet berufsschule ja du kannst dir den wenn du glück hast kannst dir den plan von einer berufsschule online angucken ansonsten würde ich sagen wahrscheinlich eher c sharp mittlerweile früher haben sie viel c gemacht aber die ganzen boomerlehrer mit c sind mittlerweile weg also wahrscheinlich eher c sharp aber um die berufsschule macht ihr keine gedanken nicht n-crypt fs eng fs meine ich also die berufsschule musst du dir keine gedanken machen die berufsschule hat absolut unterirdisches niveau ihr werdet nach drei jahren immer noch bei print print lese eine zahlein sein das berufsschule kannst du vergessen dann ist die scharpe zahlein ausgestorben ja außer in china in china nicht die die chinesen die stehen unglaublich auf java guckt mal ich kann ich euch zeigen gucken wir uns mal die github trends an nicht today sagen wir mal sagen wir mal week und jetzt gucken wir mal nach china chinesen repo wieso beileid der c ist ok aber c++ ist so der größte abfakt den ich kenne guck hier erstes china chinesen ding und es ist in keine ahnung es ist in gar nichts ok nächstes python ok alles klar c++ ja ok es sieht jetzt so aus als habe ich miss erzählt aber es ist so die chinesen verwenden saumäßig viel java java tatsächlich also diese diese woche keine trending china chinesen repos dabei wim trendet da guck an aber wie gesagt die chinesen stehen total auf auf java auf java wie es die coolen leute sagen auch zu können ist sicherlich nicht verkehrt also das einzige was ich mit c++ mache ist es sei denn der chat zwingt mich in irgendeiner art und weise dazu also in letzter zeit haben wir c++ web assembly gemacht mit ffm pack das war tatsächlich relativ cool und da hat mich c++ auch nicht so stark genervt für microcontroller graben nervt mich c++ immer richtig gerade wenn man anfängt modernes c++ machen zu wollen ist einfach nur ätzend an vielen stellen nicht dass nicht gute sachen dabei werden aber vieles ist einfach so unglaublich umständlich gemacht die ganze daytime ap in c++ also da sind die zeilen sind immer 300 zeichen lang nach rechts bis du dann irgendwie mal millisekunden zu sekunden umgewandelt hast und so was außerdem dauert es wahrscheinlich noch 15 jahre bis alle compiler so neue sachen wie die format api können und so was ich glaube es werde ich in nächster zeit nicht machen nee nee du kannst du kannst prime suppen wenn du willst oder suppen wenn du willst ansonsten kannst du einfach auch nur da sein wie viel ram zieht dein browser ich glaube 16 gigabyte nee nix alter zieht der nix der zielt insgesamt 1,4 g nix nix ist hier angesagt guck mal hier der langweilt sich jetzt hat er sogar noch speicher freigegeben der langweilt sich komplett ja das stimmt ok das verstehe ich das leuchtet ein dann dann kann ich nachvollziehen in unreal kommste halt nicht drumherum habe ich keine ahnung von ich weiß nur du kannst entweder unreal c++ machen oder du brauchst drei monate bis du das gleiche in blueprints zusammen geklickt hast was du auch runter programmieren könntest in einem halben tag geht er nee nee glaube nicht dass der geht ich habe den ewig nicht verwendet nee nee gibt keine spenden ist brauche ich auch nicht so blödsinn das lasst bleiben keck w hd ok leute bei einer bank in frankfurt ihr könnt bitts spenden ich weiß nicht wie viel von bitts ankommen was ist der share bei bitts und sender bitts alles müll ich bin 15 die hohen rakete dankeschön für den sub ich bin nicht 15 massive eine milliarde bitts ich bin 38 bin richtig hardcore boomer ihr müsst nicht spenden ich habe genug geld bin froh wenn ihr am start seid es reicht schon man kann natürlich nie genug haben ich beschwer mich auch nicht achso stimmt überhaupt nicht ich bin 37 aber ich jetzt war aber kein schibet nee nee ich hatte noch kein geburtstag 37 37 37 bin ich noch ja ich mache noch vier tage woche ist das beste was du machen kannst das beste was du machen kannst wenn du mit deiner kohle auskommst meistens machen es da 20 prozent mehr oder weniger auch nicht fett wenn du mit deiner kohle auskommst dann mach vier tage woche oder noch weniger mach so viel dass du gut mit deiner kohle auskommst was machst du die restlichen tage naja youtube und stream zum beispiel und sachen die man so machen muss aber jene muss man das rückwärts lesen in ja nee dankeschön für den primes ab ok also also folgendes ich verpasst nichts jaja reicht überhaupt kein überhaupt kein ding ich meine ich verdiene mit twitch und youtube auch noch was also leider nicht so modern wie man das jetzt bräuchte weil ich mir damals nicht so viel gedanken darüber gemacht habe ich habe zwei klimaanlagen im schlafzimmer und im arbeitszimmer heizungs heizung ist ne gasheizung im keller die auch warmwasser macht was ziemlich monak s ist aktuell vom preis her aber was willst du machen ja ist so omega 0 gas putin gefällt das bestimmt das ist ja quasi so was ja ich hab ich hab heute witziger weise überlegt ob das nicht sinnvoll wäre noch im wohnzimmer oben und im schlafzimmer unten eine klimaanlage einzubauen beziehungsweise die erweitern zu lassen zu meinem außengerät da müsste halt nen rohr hier bei mir durchs arbeitszimmer aber das müsste eigentlich gehen zu irgendwie an der wand oder so wie auf talks tut ja gibt aktuell nichts leute wisst ihr was ich gerade spiele mega nice game also wahrscheinlich nicht für den mainstream das da habe ich jetzt ein paar stunden gespielt gestern richtig nice ich weiß nicht ob das mainstream ist keine ahnung ich glaube den meisten leuten jetzt wird das nicht so gut gefallen das ist das ist cool echt spielt das jeder ja weil katze wahrscheinlich ja es ist aber auch was besonderes also dass es gibt kein anderes spiel dieser art also es gibt so adventure games mit so ein bisschen item sammeln und und abliefern also ein bisschen rätsel ultra light gibt es ja viele aber dass du halt eine katze bist ist halt das gibt es sonst nicht das ist 2014 mal schon ein competitive ups war ein competitive game gezockt ja ich bin der krasseste one on one sniper in modern warfare 2 one on one rust aber nur mit quick scopes also hardscopes kann ich überhaupt nicht ab hardscopes ist wirklich für die richtigen kack noobs quickscope only und aber auch so dass man das scope nicht sieht also ihr wisst ja ein richtiger quickscope ist wenn du in das scope gehst hittest bevor du das fadenkreuz siehst nur so alle anderen rules sind für noobs dann spiele ich nicht gegen euch one on one ansonsten kommt one on one rust easy bis jetzt nicht bis jetzt wurde nicht mal beantwortet ob die katze er oder sie ist ist für das spiel auch total uninteressant kennt jemand der gos und steckdosen flaschen aus zwecks flaschen was also wir haben ja schon gos und steckdosen geflasht aber die aktuellen kann man nicht mehr über die flaschen deswegen ist das nicht so tolle richtig eben klar weil den lol die leute so nett sind und das überhaupt nicht verschwitzt oder toxic ist das ist ein bisschen wie ach ja tatsächlich habe tatsächlich schon competitive spiele gespielt ich habe overwatch gespielt sogar esl turniere und wir haben sogar gewonnen teilweise stellt euch das mal vor wir waren glaube ich was war der beste weekly unser bester weekly platz war glaube ich vierter und deutsches deutsches weekly haben wir sogar ein paar mal gewonnen nicht dass das jetzt super krass oder so gewesen wäre aber immerhin ja wir waren gar nicht schlecht am anfangen von dem game also einer aus meinem ehemaligen overwatch team ist schweizer und ist tatsächlich einer der wenigen schweizer pro gamer die ich kenne geworden und gut der erx hat es auch probiert aber ich glaube das ist auch zu alt schau mal guck nicht zu keck weh glaubt es ist auch abgehakt und von den anderen weiß ich nicht was da draus geworden ist ja ich habe zs go gespielt aber nie somit mit leib und seele und komplett ich meine ich habe am ende wie viel ich habe 200 stunden in cs das ist ja nix 200 stunden in cs da kecken dich ja alle aus dass 200 stunden in cs ist quasi sowie fünf stunden in kot ja ich bin auch weg leute ich gehe jetzt pennen bad good time ja chain law ordentlich gibt welche die gehen in die zehntausende mittlerweile schon 2014 waren tausend stunden gut das jetzt auch outdated overrated gebetet alles klar leute wir sehen uns bis denn zu", "segments": [{"id": 1, "start": 30.0, "end": 55.8, "text": "der"}, {"id": 2, "start": 55.8, "end": 75.76, "text": "ich glaube das ist das einzige ppe-mode was wir nicht haben"}, {"id": 3, "start": 75.76, "end": 80.48, "text": "nein, haben wir nicht, aber poggers haben wir"}, {"id": 4, "start": 80.48, "end": 89.08, "text": "ja leute heute bisschen go weiter lernen als beispielanwendung nehmen wir das gleiche was"}, {"id": 5, "start": 89.08, "end": 93.36, "text": "ich das letzte mal gebaut habe in dotnet wo ich in rust versagt habe das umzubauen"}, {"id": 6, "start": 93.36, "end": 97.16, "text": "ich muss euch aber gleich wobei ich warte ich warte erst mal ich warte erst mal kurz bis"}, {"id": 7, "start": 97.16, "end": 108.92, "text": "das stream richtig angelaufen ist jetzt schon betke hast du nur darauf gewartet dass hier"}, {"id": 8, "start": 108.92, "end": 113.32, "text": "den streamer macht dass du bett das zu schlafen gehen kannst oder wie ist das"}, {"id": 9, "start": 113.32, "end": 119.76, "text": "ich muss mal kurz meine e-mails gucken jetzt würde ich gerade den 2 rechner anhab mail"}, {"id": 10, "start": 119.76, "end": 131.64, "text": "rade shadow legends ich fasse es nicht die geben auch nie auf oder rade shadow legends"}, {"id": 11, "start": 131.64, "end": 140.0, "text": "hi max ich erhielt leider keine reaktion von dir auf die anfrage zu rade shadow legends"}, {"id": 12, "start": 140.0, "end": 152.52, "text": "nein das ist aber auch in ordnung steht dahinter ok da bin ich aber froh da bin ich bin ich"}, {"id": 13, "start": 152.52, "end": 165.24, "text": "beruhigt dass das ok ist ja also leute jetzt wo ihr ein paar leute da sind ich muss euch"}, {"id": 14, "start": 165.24, "end": 170.32, "text": "sagen ich weiß nicht wie das heute klappt wie lange das wie lange das klappt mit dem"}, {"id": 15, "start": 170.32, "end": 175.32, "text": "stream vielleicht kein problem vielleicht geht es auch nicht so lang das liegt daran"}, {"id": 16, "start": 175.32, "end": 179.44, "text": "ich habe immer noch ein bisschen kopfweh und heute morgen musste ich eine wurzelbehandlung"}, {"id": 17, "start": 179.44, "end": 183.0, "text": "über mich ergehen lassen weil ich habe euch ja schon vor ein paar wochen gesagt ich habe"}, {"id": 18, "start": 183.0, "end": 187.16, "text": "irgendwie zahnweh und wir haben das nicht anders hinbekommen alles mögliche probiert"}, {"id": 19, "start": 187.16, "end": 197.48, "text": "ja aber auch wenn es nicht so ausgesehen hat aber anscheinend ging es nicht anders ja"}, {"id": 20, "start": 197.48, "end": 201.68, "text": "und ja durch die behandlung und das auf dem kopf liegen dort habe ich jetzt natürlich"}, {"id": 21, "start": 201.68, "end": 208.32, "text": "noch mehr kopfweh und es hält schon auch den ganzen tag kann ich das ist doch ein twitchy"}, {"id": 22, "start": 208.32, "end": 220.84, "text": "mod warum ist denn das weg wurde das entfernt ja habe ich hinzugefügt ach stimmt das wurde"}, {"id": 23, "start": 220.84, "end": 225.86, "text": "entfernt weil der typ weil der typ den nicht die rechte an seinem gesicht geben wollte"}, {"id": 24, "start": 225.86, "end": 231.56, "text": "oder so ja ja ok ich erinnere mich dunkel da war was ja das ist ja das ist schon zehn"}, {"id": 25, "start": 231.56, "end": 237.32, "text": "jahre her oder so ist schon ewig her ja ich muss sagen so schlimm an sich war es gar nicht"}, {"id": 26, "start": 237.32, "end": 244.24, "text": "aber betäubung hält halt ewig es war heute morgen schon um acht also ist es schon her"}, {"id": 27, "start": 244.24, "end": 248.88, "text": "betäubung ist mittlerweile auch weg es tut ein bisschen weh drumherum an der stelle wo"}, {"id": 28, "start": 248.88, "end": 253.92, "text": "wurzelbehandlung war ist natürlich nichts weil die wurzel ist ja weg ohne nerven merkste"}, {"id": 29, "start": 253.92, "end": 258.24, "text": "nichts ein bisschen weh aber ich habe hauptsächlich kopfweh und ich merke es auch noch ein bisschen"}, {"id": 30, "start": 258.24, "end": 261.88, "text": "ich muss jetzt mal abwarten die nächsten tage ich habe hier noch ich habe hier noch pillen"}, {"id": 31, "start": 261.88, "end": 272.6, "text": "am start aber ich nehme ihr kennt mich ich nehme ungern schmerzmittel poggies lode game"}, {"id": 32, "start": 272.6, "end": 288.64, "text": "danke für den sub falls ich nicht schon gesagt habe ja ist es auch aber ich werde da nicht"}, {"id": 33, "start": 288.64, "end": 294.48, "text": "geweckt ich werde nie von weckern wach ich bin immer schon wach wie viele tabs na ja"}, {"id": 34, "start": 294.48, "end": 298.72, "text": "also man erkennt doch noch was was ist ich habe alternativ hier noch ein paar was machen"}, {"id": 35, "start": 298.72, "end": 307.24, "text": "eigentlich die battlefield spieler zahlen wo wir gerade so dabei sind es hat gepiekt"}, {"id": 36, "start": 307.24, "end": 316.76, "text": "moment hat es gepiekt es hat 24h peak yo yo yo yo massive und new world new world ist"}, {"id": 37, "start": 316.76, "end": 324.4, "text": "weiter am abkacken ok nice gg easy alter die haben so das habe ich noch nie gesehen so"}, {"id": 38, "start": 324.4, "end": 330.24, "text": "ein heftiger festschiss die new world das habe ich also also in diesem ausmaß habe"}, {"id": 39, "start": 330.24, "end": 336.72, "text": "ich das glaube ich noch nie gesehen so ich war mal kurz meine links vm auf weil ich fürchte"}, {"id": 40, "start": 336.72, "end": 341.16, "text": "wir müssen mal kurz updates machen ich habe das nämlich vorhin auf meinen anderen vm gesehen"}, {"id": 41, "start": 341.16, "end": 347.92, "text": "rast rast muss weg leute heute ich habe off screen noch ein bisschen rast mir angeguckt"}, {"id": 42, "start": 347.92, "end": 359.52, "text": "alter das ist so wir was heißt wir so umständlich und anstrengend ich weiß nicht ob sich das"}, {"id": 43, "start": 359.52, "end": 367.44, "text": "lohnt für so alltägliche aufgaben allein schon ein erstes webrequest zu machen ist"}, {"id": 44, "start": 367.44, "end": 374.12, "text": "da wieder eine wissenschaft für sich vielleicht mache ich das jedenfalls anders aber heute"}, {"id": 45, "start": 374.12, "end": 379.16, "text": "machen wir mal ein bisschen go wieder aber das muss weg der rast der rast champ kommt"}, {"id": 46, "start": 379.16, "end": 384.28, "text": "weg und bei der gelegenheit machen wir gerade mal ein update weil ich glaube ich glaube"}, {"id": 47, "start": 384.28, "end": 390.8, "text": "ich muss muss ab ja es ist der bam wusste ich doch schon reality mod gespielt ja ich"}, {"id": 48, "start": 390.8, "end": 395.88, "text": "habe gesagt ich habe ich habe drei leute die ganze runde über runde über gekillt weil"}, {"id": 49, "start": 395.88, "end": 401.24, "text": "ich den rest nicht gesehen habe das ist aber auch was was man im team bzw mit kommt mit"}, {"id": 50, "start": 401.24, "end": 408.48, "text": "coms bzw noch besser mit bekannten spielen muss oder mit online mit festen teammates"}, {"id": 51, "start": 408.48, "end": 412.76, "text": "spielen muss dann geht das auf der anderen seite ich habe vorhin mal kurz reingeguckt"}, {"id": 52, "start": 412.76, "end": 418.72, "text": "da waren gerade mal zwei server noch spielbar von irgendwie 30 bei release also ich weiß"}, {"id": 53, "start": 418.72, "end": 421.92, "text": "nicht wie lange das überlebt ob sich das überhaupt lohnt sich da einzuarbeiten keine"}, {"id": 54, "start": 421.92, "end": 430.72, "text": "ahnung naja heute nicht so ehrlich gesagt heute morgen wurzelbehandlung und kopfweh"}, {"id": 55, "start": 430.72, "end": 433.96, "text": "noch deswegen weiß ich nicht wie lange der stream heute geht vielleicht geht es ja auch"}, {"id": 56, "start": 433.96, "end": 437.88, "text": "ohne probleme ich hatte schon öfters wenn ich angefangen habe zu stream war das kopfweh"}, {"id": 57, "start": 437.88, "end": 446.36, "text": "weg zumindest wichtig ordentlich trinken dabei ich habe jetzt hier noch ein liter wasser"}, {"id": 58, "start": 446.36, "end": 454.08, "text": "stehen zwischendurch mal auffüllen ja hoffe ich auch hoffe ich auch übrigens wenn ich"}, {"id": 59, "start": 454.08, "end": 461.04, "text": "mal ein paar geträgerte linux fans sehen wollt guckt euch einfach die comments unter meinem"}, {"id": 60, "start": 461.04, "end": 468.84, "text": "letzten video an also nicht alle die meisten sind ja vollkommen rational und und schreiben"}, {"id": 61, "start": 468.84, "end": 473.44, "text": "sinnvolle sinnvolle comments ja viele stimmen mir da auch zu aber du hast da auch so ein"}, {"id": 62, "start": 473.44, "end": 478.9, "text": "paar du hast auch so ein paar ganz spezielle leute ja so hier zum beispiel der erste was"}, {"id": 63, "start": 478.9, "end": 484.24, "text": "ich hier sehe und guckt mal guck dann auch nicht an also der ist erst mal der ist erstmal"}, {"id": 64, "start": 484.24, "end": 491.4, "text": "hyper trigger der typ das ist doch bullshit so leute wie du die so ein bullshit erzählen"}, {"id": 65, "start": 491.4, "end": 495.48, "text": "sind mit der grund dass sich linux auf dem desktop nicht durchsetzt also leute merke"}, {"id": 66, "start": 495.48, "end": 503.24, "text": "es ist mal wieder so derjenige der die probleme anspricht ist das problem nicht der auslöser"}, {"id": 67, "start": 503.24, "end": 506.24, "text": "Ja? Logisch. Obvius."}, {"id": 68, "start": 508.64, "end": 510.56, "text": "Was ist mit Rust? Heute nicht."}, {"id": 69, "start": 510.56, "end": 513.32, "text": "Ich hab eh schon Kopfschmerz, das halt ich nicht aus mit Rust."}, {"id": 70, "start": 513.32, "end": 516.52, "text": "Ich hab offstream, ich hab's grad gesagt, da warste wahrscheinlich noch nicht da,"}, {"id": 71, "start": 516.52, "end": 521.08, "text": "ich hab offstream ein bisschen Rust rumgebastelt und das ist mega umständlich."}, {"id": 72, "start": 521.08, "end": 521.96, "text": "Ich weiß nicht,"}, {"id": 73, "start": 521.96, "end": 525.4, "text": "ob sich das lohnt für so alltägliche Tools und Software."}, {"id": 74, "start": 525.4, "end": 528.56, "text": "In seinem Bereich, wofür Rust gedacht, ich mein, das wurde nicht umsonst von"}, {"id": 75, "start": 528.56, "end": 531.44, "text": "Marzilla entwickelt, um unter anderem auch ihren Browser"}, {"id": 76, "start": 531.44, "end": 534.12, "text": "memory safe und sicherer zu machen."}, {"id": 77, "start": 536.72, "end": 539.76, "text": "Da kann ich das verstehen und vielleicht für"}, {"id": 78, "start": 539.76, "end": 542.96, "text": "sicherheitskritisch oder Sachen, die halt besonders stable laufen müssen"}, {"id": 79, "start": 542.96, "end": 545.84, "text": "und performancebar, okay, kann ich alles verstehen."}, {"id": 80, "start": 545.84, "end": 551.72, "text": "Aber für die 0815 Tools bin ich mir nicht sicher,"}, {"id": 81, "start": 551.72, "end": 555.92, "text": "ob es eine gute Idee ist, Rust zu verwenden."}, {"id": 82, "start": 555.92, "end": 558.2, "text": "Ja, ich hab daheim in Zabbix."}, {"id": 83, "start": 558.2, "end": 561.48, "text": "Also wir hatten lange Zeit auf der, also Monitoring Systeme hab ich folgende"}, {"id": 84, "start": 561.48, "end": 564.56, "text": "Erfahrung. Nagios, kenn ich mich tatsächlich relativ gut aus,"}, {"id": 85, "start": 564.56, "end": 566.64, "text": "hab ich mich jahrelang drum gekümmert,"}, {"id": 86, "start": 566.64, "end": 567.92, "text": "schon lange her."}, {"id": 87, "start": 567.92, "end": 570.16, "text": "Zabbix hatten wir auf der Arbeit jahrelang"}, {"id": 88, "start": 570.16, "end": 572.52, "text": "und ich hab aktuell noch einen bei mir daheim."}, {"id": 89, "start": 572.52, "end": 575.12, "text": "Da kenn ich mich auch ganz gut aus mittlerweile."}, {"id": 90, "start": 575.12, "end": 579.52, "text": "Und ansonsten ist die große Frage, was du machen willst."}, {"id": 91, "start": 579.52, "end": 582.92, "text": "Willst du einfach nur einfache Checks machen, du gucken, ob irgendwie eine"}, {"id": 92, "start": 582.92, "end": 586.88, "text": "Webseite antwortet oder ein Host oben ist und"}, {"id": 93, "start": 586.88, "end": 589.52, "text": "du kannst ja mal ein bisschen dein Anwendungsszenario schreiben, was du"}, {"id": 94, "start": 589.52, "end": 590.48, "text": "damit machen willst."}, {"id": 95, "start": 590.48, "end": 593.56, "text": "So einfach nur gucken, ob ein Host oben ist, ob"}, {"id": 96, "start": 593.56, "end": 595.68, "text": "ein Port auf ist oder"}, {"id": 97, "start": 595.68, "end": 598.6, "text": "ob auf der Webseite das Richtige drauf steht."}, {"id": 98, "start": 598.6, "end": 601.92, "text": "Und wenn du keine History brauchst"}, {"id": 99, "start": 601.92, "end": 607.08, "text": "oder keine Custom Checks und größere Sachen, ja,"}, {"id": 100, "start": 607.08, "end": 612.12, "text": "dann gibt es richtig gute Self-hosted Alternativen, die einfach sind."}, {"id": 101, "start": 612.12, "end": 613.36, "text": "Ansonsten"}, {"id": 102, "start": 613.36, "end": 618.16, "text": "das große Fast ist natürlich dann"}, {"id": 103, "start": 618.16, "end": 622.8, "text": "Prometheus."}, {"id": 104, "start": 622.8, "end": 627.2, "text": "So als direkte Alternative, auch wenn der Schwerpunkt bei Zabbix und Prometheus"}, {"id": 105, "start": 627.2, "end": 630.0, "text": "jeweils ein bisschen anders liegt."}, {"id": 106, "start": 630.0, "end": 632.92, "text": "Ja, hab ich auch schon gehört. Hab ich mich aber noch nie großartig mit"}, {"id": 107, "start": 632.92, "end": 636.72, "text": "beschäftigt. Ich weiß nur, das war mal Nagios."}, {"id": 108, "start": 636.72, "end": 639.4, "text": "Mittlerweile glaubt nimmer."}, {"id": 109, "start": 639.4, "end": 643.52, "text": "Ja, hat mich jetzt nicht so geschockt."}, {"id": 110, "start": 643.52, "end": 650.52, "text": "Dann würde ich wahrscheinlich Zabbix vorziehen."}, {"id": 111, "start": 652.92, "end": 654.76, "text": "Ja, die Sache ist halt, also"}, {"id": 112, "start": 654.76, "end": 657.16, "text": "die Frage ist, was du monitoren willst."}, {"id": 113, "start": 657.16, "end": 659.6, "text": "Moin Michael, 50 Billiarden lang nicht gesehen."}, {"id": 114, "start": 659.6, "end": 660.92, "text": "Die Frage ist halt,"}, {"id": 115, "start": 660.92, "end": 662.52, "text": "was du monitoren willst."}, {"id": 116, "start": 662.52, "end": 666.64, "text": "Willst du eher so klassisches Blackbox Monitoring machen?"}, {"id": 117, "start": 666.64, "end": 668.36, "text": "Von außen halt gucken,"}, {"id": 118, "start": 668.36, "end": 670.12, "text": "pinkt der Host,"}, {"id": 119, "start": 670.12, "end": 672.36, "text": "ist SSH Port offen"}, {"id": 120, "start": 672.36, "end": 675.16, "text": "und sowas."}, {"id": 121, "start": 675.16, "end": 678.2, "text": "Dafür ist"}, {"id": 122, "start": 678.2, "end": 682.0, "text": "Zabbix ganz nice."}, {"id": 123, "start": 682.0, "end": 685.64, "text": "Willst du Metriken sammeln? Also interessiert dich zum Beispiel auch"}, {"id": 124, "start": 685.64, "end": 688.4, "text": "sowas wie"}, {"id": 125, "start": 688.4, "end": 691.64, "text": "bei einer Anwendung, wie oft läuft der Garbage Collector"}, {"id": 126, "start": 691.64, "end": 696.68, "text": "oder"}, {"id": 127, "start": 696.68, "end": 698.88, "text": "Zertifikatablauf,"}, {"id": 128, "start": 698.88, "end": 701.96, "text": "Daten und so, wobei das geht mit Zabbix auch."}, {"id": 129, "start": 701.96, "end": 705.88, "text": "Also interessieren dich eher Metrix, dann eindeutig Prometheus, Grafana."}, {"id": 130, "start": 705.88, "end": 708.8, "text": "Interessieren dich eher so klassische Blackbox Checks,"}, {"id": 131, "start": 708.8, "end": 711.2, "text": "wie man früher gemonitort hat, dann Zabbix."}, {"id": 132, "start": 711.2, "end": 713.72, "text": "Man kann natürlich auch beides verbinden, aber dann wird schon ein bisschen"}, {"id": 133, "start": 713.72, "end": 716.2, "text": "Overkill für kleine Installationen."}, {"id": 134, "start": 716.2, "end": 720.48, "text": "Und wenn du einfach nur ganz simple Sachen machen willst,"}, {"id": 135, "start": 720.48, "end": 726.52, "text": "dann ist das auch nicht schlecht."}, {"id": 136, "start": 726.52, "end": 729.68, "text": "Das ist aber wirklich nur für kleine Installationen daheim."}, {"id": 137, "start": 729.68, "end": 733.24, "text": "Also ich denke mal mehr als 100 Checks"}, {"id": 138, "start": 733.24, "end": 737.08, "text": "verkraftet es bestimmt, aber"}, {"id": 139, "start": 737.08, "end": 740.72, "text": "ja, also für daheim ist das, wenn man nix großartig Spezielles braucht und auch"}, {"id": 140, "start": 740.72, "end": 741.92, "text": "keine History braucht,"}, {"id": 141, "start": 741.92, "end": 743.6, "text": "ist das mit das Beste."}, {"id": 142, "start": 743.6, "end": 747.08, "text": "Ansonsten hängt es davon ab, was man monitorn will."}, {"id": 143, "start": 747.08, "end": 749.2, "text": "Nein, ich habe kein MacBook."}, {"id": 144, "start": 749.2, "end": 752.36, "text": "Ich arbeite mit Linux und mit Windows gleichermaßen."}, {"id": 145, "start": 752.36, "end": 753.52, "text": "Das wird ihr jetzt auch gleich sehen."}, {"id": 146, "start": 753.52, "end": 758.6, "text": "Ja, aber der Blackbox Exporter ist von Prometheus, der ist vorhanden, ja, sag mal so."}, {"id": 147, "start": 758.6, "end": 762.12, "text": "Man merkt, dass das nicht dafür gemacht ist."}, {"id": 148, "start": 762.12, "end": 765.44, "text": "Allein schon das ganze Umlabeln"}, {"id": 149, "start": 765.44, "end": 767.12, "text": "ist jetzt nicht schön, das geht."}, {"id": 150, "start": 767.12, "end": 771.32, "text": "Aber wenn man nur Blackbox Checks macht, dann ist sowas Klassisches wie Zabbix oder"}, {"id": 151, "start": 771.32, "end": 775.28, "text": "meinetwegen Nagios, vielleicht auch Checkmk oder LibreNMS, wenn es viele"}, {"id": 152, "start": 775.28, "end": 781.36, "text": "SNMP Netzwerkgeräte sind, sicherlich besser."}, {"id": 153, "start": 781.36, "end": 783.16, "text": "Brauchst du keine mobile Workstation?"}, {"id": 154, "start": 783.16, "end": 787.12, "text": "Nö, brauche ich nicht."}, {"id": 155, "start": 787.12, "end": 790.32, "text": "Ach so, ich habe ein Notebook von der Arbeit, es ist aber ein Windows Notebook."}, {"id": 156, "start": 790.32, "end": 792.6, "text": "Also ich habe ein Linux Notebook auf der..."}, {"id": 157, "start": 792.6, "end": 795.68, "text": "Was zum Teufel ist, ist, ist, ist zählt?"}, {"id": 158, "start": 795.68, "end": 796.96, "text": "Was habe ich denn da installiert?"}, {"id": 159, "start": 796.96, "end": 800.04, "text": "Was ist das überhaupt?"}, {"id": 160, "start": 800.04, "end": 805.48, "text": "Low Latency Audio Communication Codec."}, {"id": 161, "start": 805.48, "end": 809.12, "text": "Ich habe keine Ahnung, warum ich das installiert habe, aber"}, {"id": 162, "start": 809.12, "end": 812.28, "text": "ich leuchte mal wieder, weiß nicht, was das ist."}, {"id": 163, "start": 812.28, "end": 815.0, "text": "Yes."}, {"id": 164, "start": 815.0, "end": 820.08, "text": "Update, jetzt."}, {"id": 165, "start": 820.08, "end": 824.88, "text": "Ja, also ich habe, ich habe von der Arbeit ein Windows Notebook hier liegen, das verwende ich aber so gut wie nie."}, {"id": 166, "start": 824.88, "end": 827.32, "text": "Und auf der Arbeit habe ich schon ein Linux Notebook."}, {"id": 167, "start": 827.32, "end": 831.92, "text": "Das werde ich ja wahrscheinlich demnächst ersetzen durch das Windows Ding von hier und dann lasse ich das auf der Arbeit stehen."}, {"id": 168, "start": 831.92, "end": 836.52, "text": "Also ich brauche keine mobile Workstation, nö, brauche ich nicht."}, {"id": 169, "start": 836.52, "end": 842.36, "text": "Ich habe mein Handy dabei für mobil unterwegs im Zug, reicht das allemal."}, {"id": 170, "start": 842.36, "end": 846.12, "text": "Und ansonsten"}, {"id": 171, "start": 846.12, "end": 849.6, "text": "Schreibtisch an der Arbeit, Monitor,"}, {"id": 172, "start": 849.6, "end": 856.56, "text": "richtige Tastatur, Maus, Unterheim, Desktop, PC."}, {"id": 173, "start": 856.56, "end": 858.64, "text": "Das kann man so kurz gar nicht sagen."}, {"id": 174, "start": 858.64, "end": 862.36, "text": "Im Prinzip sind die Tools sich relativ ähnlich."}, {"id": 175, "start": 862.36, "end": 866.12, "text": "Nagios ist in C, Zappix ist in PAP."}, {"id": 176, "start": 866.12, "end": 868.72, "text": "Im Prinzip sind die Tools sich relativ ähnlich."}, {"id": 177, "start": 868.72, "end": 871.08, "text": "Das sind beides klassische"}, {"id": 178, "start": 871.08, "end": 873.2, "text": "Monitoring Tools,"}, {"id": 179, "start": 873.2, "end": 875.32, "text": "die hauptsächlich"}, {"id": 180, "start": 875.32, "end": 877.64, "text": "ihre Stärken haben, indem du von Außen"}, {"id": 181, "start": 877.64, "end": 881.64, "text": "Kisten überprüfst. Ja, Zappix und Nagios haben beide Agents, damit kannst du auch"}, {"id": 182, "start": 881.64, "end": 885.84, "text": "Festplattenauslastung und CPU-Auslastung monitoren."}, {"id": 183, "start": 885.84, "end": 887.2, "text": "Aber"}, {"id": 184, "start": 887.2, "end": 890.08, "text": "so groß ist der Unterschied gar nicht."}, {"id": 185, "start": 890.08, "end": 892.88, "text": "Konfiguration ist ein bisschen anders."}, {"id": 186, "start": 892.88, "end": 899.88, "text": "Nagios ist das deutlich ältere, wobei Zappix auch schon relativ alt ist."}, {"id": 187, "start": 901.68, "end": 908.68, "text": "Ich glaube das ist ehrlich gesagt ein bisschen Geschmackssache."}, {"id": 188, "start": 910.24, "end": 913.04, "text": "Kommst du mit deinem privaten PC daheim auf die Arbeit?"}, {"id": 189, "start": 913.04, "end": 917.4, "text": "Über Umwege. Ja, über Umwege klappt das ganze."}, {"id": 190, "start": 917.4, "end": 921.32, "text": "Guck mal, ob es Updates gibt. Ich muss den Gramm hier gerade mal alles zumachen und mal die"}, {"id": 191, "start": 921.32, "end": 923.56, "text": "VM neu starten gerade."}, {"id": 192, "start": 923.56, "end": 927.72, "text": "Mal kurz gucken, ob es, ich sag gleich was dazu, mal gucken, ob es neue Versionen gibt."}, {"id": 193, "start": 927.72, "end": 931.88, "text": "GoLands, irgendwas hier."}, {"id": 194, "start": 931.88, "end": 934.32, "text": "High Charm, jawoll, Updates, mal alles."}, {"id": 195, "start": 934.32, "end": 936.84, "text": "Und dann wird Rebooted."}, {"id": 196, "start": 936.84, "end": 940.4, "text": "Wie lernt man am besten mit großen Datenmengen umzugehen? Aller DataFrame."}, {"id": 197, "start": 940.4, "end": 943.0, "text": "Was sind denn DataFrames?"}, {"id": 198, "start": 943.0, "end": 950.0, "text": "Was verstehst du unter DataFrames?"}, {"id": 199, "start": 952.88, "end": 955.56, "text": "Keine Ahnung."}, {"id": 200, "start": 955.56, "end": 958.24, "text": "Ich habe jetzt eine grobe Idee, was du meinst."}, {"id": 201, "start": 958.24, "end": 961.2, "text": "ListenArrays und so weiter."}, {"id": 202, "start": 961.2, "end": 964.6, "text": "Was ist daran jetzt?"}, {"id": 203, "start": 964.6, "end": 967.32, "text": "Stonks, soll ich mal gucken, was meine Stonks machen?"}, {"id": 204, "start": 967.32, "end": 973.36, "text": "Letzten paar Wochen sind die Stonks tatsächlich wieder hoch."}, {"id": 205, "start": 973.36, "end": 974.92, "text": "Guck mal kurz."}, {"id": 206, "start": 974.92, "end": 979.8, "text": "Machen wir mal eine Stonks."}, {"id": 207, "start": 979.8, "end": 986.12, "text": "419 Euro sind die hochgegangen die Woche, kann ich mir nicht, aber heute sind sie wieder runtergegangen."}, {"id": 208, "start": 986.12, "end": 987.8, "text": "Alter, heute sind sie"}, {"id": 209, "start": 987.8, "end": 991.92, "text": "minus 265 Euro runtergegangen."}, {"id": 210, "start": 991.92, "end": 999.88, "text": "Nicht ganz billig."}, {"id": 211, "start": 999.88, "end": 1002.88, "text": "Ahnungslose Sachen, ich habe nur NFTs."}, {"id": 212, "start": 1002.88, "end": 1006.2, "text": "Nicht NFTs, eher ETFs."}, {"id": 213, "start": 1006.2, "end": 1012.56, "text": "Nicht NFTs."}, {"id": 214, "start": 1012.56, "end": 1015.2, "text": "Leute, das ging ja richtig hoch."}, {"id": 215, "start": 1015.2, "end": 1016.56, "text": "In letzter Zeit."}, {"id": 216, "start": 1016.56, "end": 1017.92, "text": "Letzten Monat"}, {"id": 217, "start": 1017.92, "end": 1024.56, "text": "plus 1161."}, {"id": 218, "start": 1024.56, "end": 1031.56, "text": "Da will ich mich mal nicht beschweren jetzt."}, {"id": 219, "start": 1037.68, "end": 1041.88, "text": "Das ist doch gar nicht mal so übel."}, {"id": 220, "start": 1041.88, "end": 1048.36, "text": "Stonks."}, {"id": 221, "start": 1048.36, "end": 1050.92, "text": "Nee, nee, nee, nee."}, {"id": 222, "start": 1050.92, "end": 1053.04, "text": "Mein Portfolio gibt es nicht zu zeigen. Ich habe"}, {"id": 223, "start": 1053.04, "end": 1054.92, "text": "einen ETF,"}, {"id": 224, "start": 1054.92, "end": 1057.68, "text": "einen World ETF, sonst nichts."}, {"id": 225, "start": 1057.68, "end": 1064.64, "text": "Wie viel genau, sage ich nicht, aber es ist nur ein World ETF, sonst nichts."}, {"id": 226, "start": 1064.64, "end": 1067.4, "text": "Achso, ja, das hier wollte ich noch beantworten."}, {"id": 227, "start": 1067.4, "end": 1071.24, "text": "Also ja, ich komme mit meinem PC von daheim auf die Arbeit über Umwege."}, {"id": 228, "start": 1071.24, "end": 1073.08, "text": "So einfach geht das nicht."}, {"id": 229, "start": 1073.08, "end": 1078.08, "text": "Also Umwege sind Tunnels und Zwei-Faktor-Authentifizierung."}, {"id": 230, "start": 1078.08, "end": 1080.0, "text": "Also im Prinzip, sagen wir mal so,"}, {"id": 231, "start": 1080.0, "end": 1082.16, "text": "es ist nicht wirklich in VPN, aber"}, {"id": 232, "start": 1082.16, "end": 1086.36, "text": "sowas ähnliches wie VPN."}, {"id": 233, "start": 1086.36, "end": 1089.88, "text": "Ja, und wie man gelernt, mit großen Datenmengen umzugehen, ich meine,"}, {"id": 234, "start": 1089.88, "end": 1095.08, "text": "wo ist das Problem mit Listen und Arrays?"}, {"id": 235, "start": 1095.08, "end": 1098.76, "text": "Ich habe nichts in Bitcoin verloren, ich habe keine Bitcoins."}, {"id": 236, "start": 1098.76, "end": 1102.04, "text": "Was macht denn eigentlich so der, wo wir gerade dabei sind, Bitcoin?"}, {"id": 237, "start": 1102.04, "end": 1105.2, "text": "Ach so, der Bitcoin-Kuss."}, {"id": 238, "start": 1105.2, "end": 1108.04, "text": "Das ist ja auch"}, {"id": 239, "start": 1108.04, "end": 1113.52, "text": "schon richtig abgekackt."}, {"id": 240, "start": 1113.52, "end": 1116.92, "text": "Ja, also ich verstehe das Problem nicht so genau, ich meine,"}, {"id": 241, "start": 1116.92, "end": 1122.16, "text": "Arrays ist mit zwei Elementen oder drei Millionen Elementen jetzt nicht so der"}, {"id": 242, "start": 1122.16, "end": 1126.28, "text": "große Unterschied. Das sind halt Arrays und Listen auch nicht."}, {"id": 243, "start": 1126.28, "end": 1129.2, "text": "Das wird auch nicht mal großartig langsamer dadurch, weil du per Index"}, {"id": 244, "start": 1129.2, "end": 1130.44, "text": "drauf zugreifst."}, {"id": 245, "start": 1130.44, "end": 1131.68, "text": "Also die Zugriffszeit"}, {"id": 246, "start": 1131.68, "end": 1134.6, "text": "auf dem Index mit einem Array mit fünf und"}, {"id": 247, "start": 1134.6, "end": 1138.52, "text": "mit einer Million Elemente ist jetzt nicht so großartig unterschiedlich."}, {"id": 248, "start": 1138.52, "end": 1147.52, "text": "Ja, streng genommen schon, weil CPU cache, aber davon reden wir jetzt mal nicht."}, {"id": 249, "start": 1147.52, "end": 1157.08, "text": "Also, was ist denn da, hast du ein konkretes Problem, wo es nicht funktioniert?"}, {"id": 250, "start": 1157.08, "end": 1163.24, "text": "Was ist dein Favorite File Transfer Tool?"}, {"id": 251, "start": 1163.24, "end": 1164.32, "text": "SCP?"}, {"id": 252, "start": 1164.32, "end": 1167.0, "text": "R-Sync?"}, {"id": 253, "start": 1167.0, "end": 1168.96, "text": "R-Sync?"}, {"id": 254, "start": 1168.96, "end": 1171.8, "text": "Braucht man irgendwas anderes?"}, {"id": 255, "start": 1171.8, "end": 1175.6, "text": "Nicht WinSCP, alter."}, {"id": 256, "start": 1175.6, "end": 1180.96, "text": "Wie redet ihr von WinSCP?"}, {"id": 257, "start": 1180.96, "end": 1183.32, "text": "R-Sync?"}, {"id": 258, "start": 1183.32, "end": 1192.8, "text": "R-Sync und SCP? Braucht man noch irgendwas anderes?"}, {"id": 259, "start": 1192.8, "end": 1196.92, "text": "X-Copy, als nächster kommt irgendwie einer mit einem komischen PowerShell-One-Liner"}, {"id": 260, "start": 1196.92, "end": 1199.04, "text": "oder sowas."}, {"id": 261, "start": 1199.04, "end": 1203.16, "text": "Meinst du sowas oder meinst du sowas wie"}, {"id": 262, "start": 1203.16, "end": 1204.48, "text": "File Sync,"}, {"id": 263, "start": 1204.48, "end": 1208.64, "text": "Next Cloud Sync-Sync oder C-File oder was meinst du?"}, {"id": 264, "start": 1208.64, "end": 1217.8, "text": "Weil, wie gesagt, mein File Transfer Tool R-Sync und SCP."}, {"id": 265, "start": 1217.8, "end": 1221.68, "text": "Das riecht ein bisschen nach Python, wenn ich mir das so angucke."}, {"id": 266, "start": 1221.68, "end": 1222.68, "text": "Liege ich da richtig?"}, {"id": 267, "start": 1222.68, "end": 1231.0, "text": "Nee, das brauchst du nie."}, {"id": 268, "start": 1231.0, "end": 1239.72, "text": "Also, der Unterschied, ich kann dir das, also ich bin nicht der große Python-Checker, aber"}, {"id": 269, "start": 1239.72, "end": 1241.68, "text": "ich gehe mal davon aus, dass das dort genauso ist."}, {"id": 270, "start": 1241.68, "end": 1251.8, "text": "Also, auf eine Liste und auf einen Array greifst du immer und ausschließlich mit einem Index"}, {"id": 271, "start": 1251.8, "end": 1252.8, "text": "zu."}, {"id": 272, "start": 1252.8, "end": 1256.44, "text": "Liste, Key, ergibt keinen Sinn."}, {"id": 273, "start": 1256.44, "end": 1263.52, "text": "Was es gibt, ist, in Python gibt es ein Dictionary, in Java gibt es eine HashMap, in C-Sharp gibt"}, {"id": 274, "start": 1263.52, "end": 1270.08, "text": "es auch ein Dictionary, in Ruby gibt es, also ein Key-Value-Store, nennen wir es mal."}, {"id": 275, "start": 1270.08, "end": 1275.92, "text": "Auf einen Key-Value-Store greifst du mit einem Key, den du definiert hast, zu."}, {"id": 276, "start": 1275.92, "end": 1282.32, "text": "Also Arrays und Listen immer per Index und auf Dictionaries oder HashMaps oder wie auch"}, {"id": 277, "start": 1282.32, "end": 1288.84, "text": "immer man das nennen mag, greifst du mit einem Key deiner Wahl zu, meistens Strings."}, {"id": 278, "start": 1288.84, "end": 1294.4, "text": "Also, das hier ist keine Liste, das hier ist eigentlich ein Dictionary und die Syntax in"}, {"id": 279, "start": 1294.4, "end": 1302.24, "text": "dieser Form ist, ein Dictionary mit einem Value, der eine Liste ist."}, {"id": 280, "start": 1302.24, "end": 1310.44, "text": "Gibt es Sprachen ohne Dictionary, Key-Value-Store, ja gut, wenn du eine Sprache ohne alles suchst,"}, {"id": 281, "start": 1310.44, "end": 1318.48, "text": "nimm C, weil C hat nichts in der Standard-Library, noch nicht mal dynamische Listen, das musst"}, {"id": 282, "start": 1318.48, "end": 1319.48, "text": "du alle selbst machen."}, {"id": 283, "start": 1319.48, "end": 1328.52, "text": "Äh, und die Syntax hier, äh, kann ich mir nicht vorstellen, dass es die überhaupt gibt."}, {"id": 284, "start": 1328.52, "end": 1339.68, "text": "Ich meine, das wäre ja quasi, okay vielleicht ist das ja ein Python-Ding oder so, aber das"}, {"id": 285, "start": 1339.68, "end": 1343.68, "text": "wäre ja quasi, okay vielleicht ist das die Python-Syntax für Nested-Listen, weiß ich"}, {"id": 286, "start": 1343.68, "end": 1344.84, "text": "nicht, würde mich aber wundern."}, {"id": 287, "start": 1344.84, "end": 1359.2, "text": "Du erzeugst einen Array mit Null, mit der Zahl Null, als einziges Element und das gibst"}, {"id": 288, "start": 1359.2, "end": 1362.64, "text": "du dann als Index in die Liste, das kann ich mir nicht vorstellen, dass es das gibt."}, {"id": 289, "start": 1362.64, "end": 1373.08, "text": "Die gibt es in R, okay ja, meinetwegen, da würde ich mich nicht, da wundert mich nichts."}, {"id": 290, "start": 1373.08, "end": 1379.32, "text": "Mehrdimensionale Arrays, also ich kann mehrdimensionale Arrays nur mit zweimal Index, dann musst du"}, {"id": 291, "start": 1379.32, "end": 1380.32, "text": "sowas machen."}, {"id": 292, "start": 1380.32, "end": 1391.64, "text": "Aber vielleicht ist das eben ein Python-Ding, also ein Array mit Key ergibt eigentlich keinen"}, {"id": 293, "start": 1391.64, "end": 1397.88, "text": "Sinn, das erste muss eigentlich ein Diktionary sein."}, {"id": 294, "start": 1397.88, "end": 1401.52, "text": "Ansonsten, letztendlich ist es aber auch egal, ich gehe davon aus, dass man das in Python"}, {"id": 295, "start": 1401.52, "end": 1403.68, "text": "wahrscheinlich sogar überschreiben kann."}, {"id": 296, "start": 1403.68, "end": 1410.28, "text": "Kannst du ein Diktionary machen, das Array einträgert, ja kannst du machen, klar, das"}, {"id": 297, "start": 1410.28, "end": 1415.4, "text": "ist, das sieht dann so aus, wenn du drauf zugreifst, dann machst du ein Diktionary mit String als"}, {"id": 298, "start": 1415.4, "end": 1422.4, "text": "Key, der Value ist dann halt eine Liste und das ist dann quasi aus der Liste das Item"}, {"id": 299, "start": 1422.4, "end": 1429.76, "text": "mit dem Key Spalt, also das ist irgendwie eine Geschichte mit Diktionary und geschachteten"}, {"id": 300, "start": 1429.76, "end": 1430.76, "text": "Arrays."}, {"id": 301, "start": 1430.76, "end": 1435.72, "text": "Da hilft aber auch, ist egal, ich kann jetzt viel erzählen, wenn der Tag lang ist, da hilft"}, {"id": 302, "start": 1435.72, "end": 1442.68, "text": "ehrlich gesagt nur sich die offiziellen Beispiele anzugucken, weil das baut dir die Library,"}, {"id": 303, "start": 1442.68, "end": 1447.76, "text": "die du verwendest für dich zusammen und da muss man sich an die offiziellen Beispiele"}, {"id": 304, "start": 1447.76, "end": 1448.76, "text": "halten."}, {"id": 305, "start": 1448.76, "end": 1452.2, "text": "In Python hast du halt auch ein bisschen den Nachteil, wenn du nicht irgendwelche Type"}, {"id": 306, "start": 1452.2, "end": 1458.4, "text": "Annotations oder so benutzt bzw. die Library, das hat, weißt du nicht so genau, wo was"}, {"id": 307, "start": 1458.4, "end": 1459.4, "text": "steht."}, {"id": 308, "start": 1459.4, "end": 1463.56, "text": "Das ist halt tatsächlich der Nachteil von so super dynamischen Sprachen."}, {"id": 309, "start": 1463.56, "end": 1472.96, "text": "Da siehst du in deinem Editor nicht so einfach, was was ist."}, {"id": 310, "start": 1472.96, "end": 1487.72, "text": "In.NET ist das relativ easy, ich zeig dir das mal ganz schnell, bevor wir mit GO anfangen,"}, {"id": 311, "start": 1487.72, "end": 1501.28, "text": "ich zeig dir das mal ganz schnell, hausgeliegt, ja Leute, liegt, mein Haus, Keckel, mach mal"}, {"id": 312, "start": 1501.28, "end": 1511.0, "text": "schon mal GoLand auf, so ich zeig dir das mal ganz kurz in.NET, was ich meine, alter,"}, {"id": 313, "start": 1511.0, "end": 1518.6, "text": "ich mag das ja immer, wenn Programme laggy aufgehen, so, also guck mal, ignorier mal den"}, {"id": 314, "start": 1518.6, "end": 1523.6, "text": "ganzen Crap, der hier steht, ich mach mal kurz hier unten ein bisschen Platz, alter, warum"}, {"id": 315, "start": 1523.6, "end": 1533.12, "text": "recht, what the fuck, warum hab ich grad 93% CPU Last, ah gut, Java IDEs starten, ok,"}, {"id": 316, "start": 1533.12, "end": 1540.6, "text": "das muss ich verstehen, klar, muss erstmal komplette CPU Auslastung, so, jetzt sind wir"}, {"id": 317, "start": 1540.6, "end": 1545.32, "text": "wieder bei 0%, alles klar, jetzt sind wir auch nicht mehr laggy, also guck mal, in.NET"}, {"id": 318, "start": 1545.32, "end": 1548.8, "text": "ist das natürlich schöner, da kannst du sowas hier machen, ich mach jetzt mal das, was du"}, {"id": 319, "start": 1548.8, "end": 1555.52, "text": "da als Beispiel gepostet hast, ja, also var, nennen wir das mal irgendwie Items oder so,"}, {"id": 320, "start": 1555.52, "end": 1560.84, "text": "da sagst du dann new, Dictionary und jetzt kannst du angeben, was du als Key verwenden"}, {"id": 321, "start": 1560.84, "end": 1569.08, "text": "willst, in dem Fall String und dein Value wäre dann eine Liste, oder ein Array, aus,"}, {"id": 322, "start": 1569.08, "end": 1585.36, "text": "äh, tja, kannst du dir aussuchen, aus, weiß ich, Objects, egal, so, und darauf wirds jetzt"}, {"id": 323, "start": 1585.36, "end": 1603.84, "text": "folgendermaßen zugreifen, wo ist das Problem, ach, Kekkel, alter, ok, äh, ich hab doppelt"}, {"id": 324, "start": 1603.84, "end": 1609.36, "text": "zugewies, das kann nicht funktionieren, hast du die Lizenzen gekauft, ja, ich hab, ähm,"}, {"id": 325, "start": 1609.36, "end": 1617.36, "text": "Text all Desktop Pack, so, und darauf würdest du jetzt so zugreifen, guck, ja, bla bla blub,"}, {"id": 326, "start": 1617.36, "end": 1623.04, "text": "Index, das ist genau das, was du geschrieben hast, und warum, weil, und in.NET siehst"}, {"id": 327, "start": 1623.04, "end": 1628.88, "text": "du es halt schönerweise, weil hier kann dir nämlich deine Idee sagen, das möchte hier"}, {"id": 328, "start": 1628.88, "end": 1635.48, "text": "einen String Key haben, und hier möchte das einen Int Index haben, das ist halt der Vorteil"}, {"id": 329, "start": 1635.48, "end": 1639.48, "text": "von typisierten Sprachen, das ist halt, wenn du Python super dynamisch machst, nicht so"}, {"id": 330, "start": 1639.48, "end": 1648.16, "text": "schön ersichtlich, aber im Prinzip ist das wohl so ein ähnliches Objekt, was du vor"}, {"id": 331, "start": 1648.16, "end": 1657.48, "text": "dir hast, wenn du da mit Key und dann mit Index drauf zugreifen musst, so, ähm, übrigens,"}, {"id": 332, "start": 1657.48, "end": 1664.92, "text": "wir brauchen Rider, doch, wir müssen den, müssen wir Kekkel aufmachen, ich bin mir"}, {"id": 333, "start": 1664.92, "end": 1674.4, "text": "nicht, meine Benamung ist immer, nee, das ist nicht Kekkel, oder, cute chat, das sollte"}, {"id": 334, "start": 1674.4, "end": 1681.6, "text": "ich besser nicht aufmachen, weil da irgendwelche Secrets drinstehen, vermute ich mal, den Postchamp"}, {"id": 335, "start": 1681.6, "end": 1687.56, "text": "muss ich aufmachen, ach doch, das hatte ich schon offen, ich hab's bloß, ich, ich hab"}, {"id": 336, "start": 1687.56, "end": 1697.36, "text": "bloß, nee, nee, richtig, wirste mal, so, das brauchen wir aber heute nicht, wie mein ich"}, {"id": 337, "start": 1697.36, "end": 1701.6, "text": "denn, hier offen, main.go, ach, das ist noch die Meal API, das brauchen wir nicht, brauchen"}, {"id": 338, "start": 1701.6, "end": 1714.64, "text": "wir ein neues, brauchen wir ein neues Projekt, neues Projekt, go, Postchamp, go, brauch"}, {"id": 339, "start": 1714.64, "end": 1721.68, "text": "ja auch den richtigen Namen, this window, auf geht's, ja, also, wie gesagt, ich bin"}, {"id": 340, "start": 1721.68, "end": 1725.84, "text": "heute nicht super scharf aufs Progress machen, wenn ihr irgendwas erklärt haben wollt, Sporgi,"}, {"id": 341, "start": 1725.84, "end": 1739.8, "text": "danke für den Zap, dann, schieß los, ja, alles klar, so, eine ganz furchtbar wichtige"}, {"id": 342, "start": 1739.8, "end": 1746.64, "text": "Sache müssen wir noch machen, bevor wir jetzt anfangen, main.go, top package main muss"}, {"id": 343, "start": 1746.64, "end": 1756.16, "text": "man dann machen, und dann hier, die übliche Geschichte, fmt, print, omega keck, so, Terminal"}, {"id": 344, "start": 1756.16, "end": 1765.48, "text": "auf, T-marks auf, äh, wir müssen nach go land, projects, Postchamp, go, go run. omega"}, {"id": 345, "start": 1765.48, "end": 1776.2, "text": "keck, fmt, so, ganz wichtig, themes, sonst dreh ich, dreh ich am Rad, warum nutzt du"}, {"id": 346, "start": 1776.2, "end": 1783.4, "text": "nicht das IDE Terminal, weil ich das IDE Terminal nicht mag, ich weiß ich, ich find das IDE"}, {"id": 347, "start": 1783.4, "end": 1790.04, "text": "Terminal laggy, und das crept teilweise den Fokus nicht, wenn man reinklickt und sowas,"}, {"id": 348, "start": 1790.04, "end": 1798.12, "text": "ich, ich, ich switch, achso, ich switch lieber mit meinen window manager bindings um und benutze"}, {"id": 349, "start": 1798.12, "end": 1803.28, "text": "das normale Terminal, da ist auch mein Farbschema drinne, und, weiß ich, irgendwie find ich"}, {"id": 350, "start": 1803.28, "end": 1810.72, "text": "das schöner, mit welchem Framework würdest du heute eine Web Anwendung machen, naja,"}, {"id": 351, "start": 1810.72, "end": 1816.94, "text": "ihr kennt mich, ich würd eindeutig ASP.NET Core nehmen, Noji Bait, also ihr kennt mich"}, {"id": 352, "start": 1816.94, "end": 1823.04, "text": "wirklich in dem Fall, meine Abstandslieblingssprache ist C-Sharp, und mein, gerade Stande, ganz"}, {"id": 353, "start": 1823.04, "end": 1828.4, "text": "im Ernst, ich hab jetzt in letzter Zeit ja relativ, wir haben auch im Stream relativ"}, {"id": 354, "start": 1828.4, "end": 1837.96, "text": "viel rumgeguckt, Rust, Go, Python, Javascript, und, und Hand aufs Herz, ja, mir muss noch"}, {"id": 355, "start": 1837.96, "end": 1845.76, "text": "einer eine zweite Sprache zeigen, die an die Kombination, die C-Sharp bietet und dort"}, {"id": 356, "start": 1845.76, "end": 1851.96, "text": "net rankommt, es ist schnell, es hat eine wahnsinnig gute Standard Library, es hat für"}, {"id": 357, "start": 1851.96, "end": 1856.88, "text": "fast alles was man so braucht, halbwegs gut maintainte Pakete, da ist Javascript und Go"}, {"id": 358, "start": 1856.88, "end": 1866.4, "text": "sicherlich besser, aber die wichtigsten Sachen gibt's für dort net auch, du kannst mittlerweile"}, {"id": 359, "start": 1866.4, "end": 1873.2, "text": "relativ gut Self-Contained Binaries bauen, die Entwickler Tools sind allererste Sahne,"}, {"id": 360, "start": 1873.2, "end": 1878.4, "text": "da kannst du dich überhaupt nicht beschweren, besser als alle anderen Sprachen die ich kenne,"}, {"id": 361, "start": 1878.4, "end": 1895.04, "text": "also, so die Kombination, die muss mir noch einer zeigen, ja, also, ich, ich würde die"}, {"id": 362, "start": 1895.04, "end": 1904.88, "text": "Web-Anwendung mit ASP.NET Core machen, weil im Ernst, spätestens jetzt seit es, guckt"}, {"id": 363, "start": 1904.88, "end": 1909.04, "text": "euch mal das Beispiel an, ich will jetzt kein extra Projekt machen, ja, spätestens seit"}, {"id": 364, "start": 1909.04, "end": 1917.92, "text": "es Minimal-APs gibt in dort net, ist es halt super easy, guckt euch das hier mal an, ja,"}, {"id": 365, "start": 1917.92, "end": 1922.84, "text": "das ist eine C-Sharp beziehungsweise dort net Web-Anwendung in der einfachsten Form,"}, {"id": 366, "start": 1922.84, "end": 1928.92, "text": "guckt euch mal eine Python Flask Anwendung an oder eine Ruby Sinatra Anwendung oder was"}, {"id": 367, "start": 1928.92, "end": 1939.84, "text": "auch immer, das ist auch nicht großartig oder eine Express Anwendung, nicht nicht Go, Express"}, {"id": 368, "start": 1939.84, "end": 1944.4, "text": "GS, guckt euch mal, Moment Leute, wisst ihr was mir gerade auffällt, warum hab ich eigentlich"}, {"id": 369, "start": 1944.4, "end": 1954.72, "text": "die Dark-Reader und Dark-Theme, warum hab ich eigentlich so bescheuerte Settings für"}, {"id": 370, "start": 1954.72, "end": 1963.52, "text": "meinen Browser, man, so, viel besser, guckt euch mal Hello World in Express an, guckt"}, {"id": 371, "start": 1963.52, "end": 1971.6, "text": "euch das an, ja, guckt euch das an und guckt euch das an, also so ein großer Unterschied,"}, {"id": 372, "start": 1971.6, "end": 1981.24, "text": "ist das jetzt net, also man sieht schon klar, was ja auch die Inspiration war oder guckt"}, {"id": 373, "start": 1981.24, "end": 1990.08, "text": "man sich mal Ruby Beispiele an zum Beispiel, das ist schon ein bisschen älter, die Webseite"}, {"id": 374, "start": 1990.08, "end": 2003.08, "text": "kommt mit, ja, da sieht das so aus, das ist schon alles relativ ähnlich, warum soll ich"}, {"id": 375, "start": 2003.08, "end": 2007.96, "text": "die Cognito-Modus browsen, so und das sind Minimal-APIs, so wie sieht eine Python zum"}, {"id": 376, "start": 2007.96, "end": 2012.44, "text": "Beispiel, eine Python Flask Anwendung aus, die sieht wahrscheinlich auch nicht viel anders"}, {"id": 377, "start": 2012.44, "end": 2020.96, "text": "aus Quickstart, ja, guckt, jetzt mal ernsthaft, das ist alles ziemlich ähnlich, so, das heißt"}, {"id": 378, "start": 2020.96, "end": 2026.56, "text": "viele verbinden im Kopf ja noch mit.NET, Windows Only und riesen Boilerplate und sowas"}, {"id": 379, "start": 2026.56, "end": 2030.96, "text": "und das ist schon lange nicht mehr so, ich verwende die letzten Jahre über.NET und"}, {"id": 380, "start": 2030.96, "end": 2042.6, "text": "C-Sharp exklusiv unter Linux, ja, wir können uns auch noch ein Go-Example angucken, ja,"}, {"id": 381, "start": 2042.6, "end": 2051.16, "text": "genau, ist alles relativ ähnlich, NewBasic.org, was ist das denn, ist alles, bis die Sündagsheilerding"}, {"id": 382, "start": 2051.16, "end": 2058.64, "text": "hätten sie noch machen sollen, also ist alles relativ ähnlich und in C-Sharp, ja, vielleicht"}, {"id": 383, "start": 2058.64, "end": 2062.6, "text": "hast du in manchen Fällen ein bisschen mehr Boilerplate als in Python und sonst was, dafür"}, {"id": 384, "start": 2062.6, "end": 2066.64, "text": "bist du halt irgendwie hundertmal schneller als Python, jetzt nicht übertrieben, ist wirklich"}, {"id": 385, "start": 2066.64, "end": 2071.56, "text": "so und deswegen sag ich mir muss noch einer mal die bessere Sprache oder das bessere Framework"}, {"id": 386, "start": 2071.56, "end": 2077.72, "text": "zeigen als die Sharp.NET in Kombi, wenn es um die Kombination geht aus Performance, guter"}, {"id": 387, "start": 2077.72, "end": 2081.64, "text": "Standard Library und alle möglichen, also das Gesamtpaket ist für mich das beste was"}, {"id": 388, "start": 2081.64, "end": 2090.0, "text": "es aktuell gibt, ja ich bin.NET Fanboy was das angeht, aber ich meine auch, dass das"}, {"id": 389, "start": 2090.0, "end": 2097.72, "text": "objektiv so ist, ja, also wie gesagt, ich würd's damit machen und gerade wenn du was"}, {"id": 390, "start": 2097.72, "end": 2104.48, "text": "kleines im Backend brauchst, nimm die neuen Minimal APIs, scheiß auf Controller und MVC"}, {"id": 391, "start": 2104.48, "end": 2111.68, "text": "und so ein Crap, nimm Minimal APIs, bau dir drei Restendpunkte und fertig, oder aber nimm"}, {"id": 392, "start": 2111.68, "end": 2123.64, "text": "CraftQL, wenn du was sehr Daten, was sehr Daten intensiv ist, ach, Microsoft hier bist"}, {"id": 393, "start": 2123.64, "end": 2130.96, "text": "du bei Google abhängig, Google ist, bei Go bist du von Google abhängig, letztendlich"}, {"id": 394, "start": 2130.96, "end": 2137.24, "text": "bist du überall von irgend wem abhängig, Google kann auch, ich mein Google hat der"}, {"id": 395, "start": 2137.24, "end": 2145.16, "text": "History von wir stellen das ein, guckt euch mal den Google Friedhof an, nicht Friedhof,"}, {"id": 396, "start": 2145.16, "end": 2158.68, "text": "Graveyard, guckt euch den Google Graveyard an, also das können die auch morgen einstellen,"}, {"id": 397, "start": 2158.68, "end": 2167.0, "text": "und guckt euch,.NET ist open source genauso wie Go, also wenn jetzt einer sagt ja, dann"}, {"id": 398, "start": 2167.0, "end": 2173.08, "text": "kann die Community weitermachen, ist bei.NET auch so, ja das eine ist sehr von, das eine"}, {"id": 399, "start": 2173.08, "end": 2177.08, "text": "ist sehr abhängig von Google, das andere ist sehr abhängig von Microsoft, aber auch"}, {"id": 400, "start": 2177.08, "end": 2183.96, "text": "bei Sprachen wie, was weiß ich hier, JavaScript und so, ich wette mit euch, die sind auch"}, {"id": 401, "start": 2183.96, "end": 2187.88, "text": "abhängig von ein paar großen Hersteller, die die Hauptcontributor sind, beziehungsweise"}, {"id": 402, "start": 2187.88, "end": 2213.48, "text": "die Hauptdreiber dahinter, ja, Frage beantwortet, ASP.NET Core, beste, ja, ich bin mir nicht"}, {"id": 403, "start": 2213.48, "end": 2222.4, "text": "sicher, ob ich mir Rust für Web Anwendungen geben würde, hast du mal ein Video zu ASP.NET"}, {"id": 404, "start": 2222.4, "end": 2228.64, "text": "Core gemacht, nö, warum, ich mache ja auf YouTube nicht so die Hardcore Technik Videos,"}, {"id": 405, "start": 2228.64, "end": 2232.8, "text": "was würdest du für Data Science erwähnen, Data Science ist erstmal ein leeres Wort,"}, {"id": 406, "start": 2232.8, "end": 2239.76, "text": "das ist genauso wie Machine Learning, die Frage ist, was, was ist es, und dann würde"}, {"id": 407, "start": 2239.76, "end": 2243.72, "text": "ich ganz klar danach gehen, wo es die besseren Libraries gibt, beziehungsweise die Libraries"}, {"id": 408, "start": 2243.72, "end": 2249.72, "text": "und Funktionen, ja, Kombinationen aus Sprache und Libraries für das, was ich machen will,"}, {"id": 409, "start": 2249.72, "end": 2257.6, "text": "gut sind, und in Richtung Machine Learning hast du vielleicht gerade so mit TensorFlow"}, {"id": 410, "start": 2257.6, "end": 2264.56, "text": "und sowas so ein bisschen die Platzhirsche, was Python angeht, Quatsch mit Soße, danke"}, {"id": 411, "start": 2264.56, "end": 2272.6, "text": "für den Prime-Nap, Prime-Nap, Prime-Sub, ich habe Prime-Nap gesagt, weil ich unten"}, {"id": 412, "start": 2272.6, "end": 2278.96, "text": "drunter wahrscheinlich Noob gelesen habe, der Prime-Nap, bin ein Noob, in welche Kategorie"}, {"id": 413, "start": 2278.96, "end": 2285.8, "text": "gehört denn React, React ist Frontend Framework, eigentlich somit das größte und bekannteste"}, {"id": 414, "start": 2285.8, "end": 2300.12, "text": "Frontend Framework, damit machst du Webseiten auf gut Deutsch, äh, ich fände das nicht"}, {"id": 415, "start": 2300.12, "end": 2309.84, "text": "so cool, und mit was würdest du eine Desktop App programmieren, Cross-Platform, Mobile"}, {"id": 416, "start": 2309.84, "end": 2320.96, "text": "fällt dir raus, ja, nein, Windows Only, Tja, Cross-Platform, wahrscheinlich Qt, zwungenermaßen,"}, {"id": 417, "start": 2320.96, "end": 2324.92, "text": "auf Electron habe ich überhaupt keinen Bock, auch wenn es wahrscheinlich das Logischste"}, {"id": 418, "start": 2324.92, "end": 2332.44, "text": "wäre, vielleicht würde ich mir auch mal irgendwelche Go-Frameworks angucken, ob die was taugen,"}, {"id": 419, "start": 2332.44, "end": 2345.0, "text": "da bin ich, da bin ich unschlüssig zur Zeit, Flutter Desktop ist noch Crap, wollen wir"}, {"id": 420, "start": 2345.0, "end": 2355.0, "text": "nachher angucken, können wir nachher angucken, aber Leute, das muss ich hier aufmachen, sonst"}, {"id": 421, "start": 2355.0, "end": 2357.92, "text": "sehe ich den Tab nicht, aber das gucken wir nicht jetzt, jetzt basteln wir erst noch ein"}, {"id": 422, "start": 2357.92, "end": 2363.96, "text": "bisschen, 40 Minuten geschwätzt ist gut, jetzt können wir anfangen, warum verwendest du"}, {"id": 423, "start": 2363.96, "end": 2368.68, "text": "überhaupt so nett, habe ich glaube ich jetzt schon beantwortet, oder, ich frage mich eher,"}, {"id": 424, "start": 2368.68, "end": 2373.28, "text": "warum es Leute gibt, die das nicht verwenden, außer prinzipielle Microsoft Abneigung kann"}, {"id": 425, "start": 2373.28, "end": 2386.16, "text": "ich da, die ich ja auch habe, kann ich mir da eigentlich nichts vorstellen, ok, im Embedded-Bereich"}, {"id": 426, "start": 2386.16, "end": 2391.4, "text": "muss ich sagen, ist tatsächlich die einzige Sache, wo ich kein.NET verwende und wahrscheinlich"}, {"id": 427, "start": 2391.4, "end": 2395.36, "text": "auch nicht verwenden würde, kommt aber halt drauf an, es gibt beispielsweise Sachen wie"}, {"id": 428, "start": 2395.36, "end": 2400.2, "text": "das Nano-Framework für ein ESP, aber da weiß ich nicht, wenn ihr natürlich eine gute Plattform"}, {"id": 429, "start": 2400.2, "end": 2425.2, "text": "habt, wo das unterstützt wird, ist was anderes, ja, Stream, klar, wir haben total viele ASP.NET"}, {"id": 430, "start": 2425.2, "end": 2430.24, "text": "Anwendungen schon gemacht und Streamen, Tiny Go, ja Tiny Go, bin ich sehr gespannt drauf,"}, {"id": 431, "start": 2430.24, "end": 2448.12, "text": "was die noch machen, weiß jetzt nicht, worauf sich das bezieht, ok, dann fangen wir mal"}, {"id": 432, "start": 2448.12, "end": 2472.0, "text": "an, also switchen wir mal rüber, machen wir den Krempel hier zu, also GoLand auf OmegaCac,"}, {"id": 433, "start": 2472.0, "end": 2479.0, "text": "meine License wurde renewed, die haben mir gestern sogar 250, oder vor ein paar Tagen,"}, {"id": 434, "start": 2479.0, "end": 2488.48, "text": "250 Euro abgebucht, Kackel, alter, wartet mal kurz, weiß nicht, ob da irgendwelche E-Mail-Adressen"}, {"id": 435, "start": 2488.48, "end": 2497.88, "text": "Leaks und so jetzt kommen, renew license, ach leck mich, ich mach das jetzt nicht, mach"}, {"id": 436, "start": 2497.88, "end": 2503.88, "text": "ich das nächste Mal, ich mach das das nächste Mal, ich hab mich doch sogar eingeloggt in"}, {"id": 437, "start": 2503.88, "end": 2517.88, "text": "die, sieht man nicht ob man hier eingeloggt, ach ich bin nicht eingeloggt, ich hab mich"}, {"id": 438, "start": 2517.88, "end": 2525.88, "text": "nur in Rider eingeloggt oder was, ich hab mich nur in Rider eingeloggt, ich hab mich"}, {"id": 439, "start": 2525.88, "end": 2534.6, "text": "nicht in der Toolbox eingeloggt, deswegen schnappt das sich meine License nicht, naja"}, {"id": 440, "start": 2534.6, "end": 2539.2, "text": "gut, das ist natürlich bescheuert gewesen von mir, Typical Flux, dankeschön für den"}, {"id": 441, "start": 2539.2, "end": 2545.36, "text": "Sub, ja das ist natürlich blöd, also muss ich bis zum nächsten Stream mich nochmal"}, {"id": 442, "start": 2545.36, "end": 2552.92, "text": "einloggen, ja, Name Leak, Rider UiPack, ich brauch ein ordentliches Theme, sonst dreh"}, {"id": 443, "start": 2552.92, "end": 2576.04, "text": "ich, sonst dreh ich am Rad, ja, sehr gut, Font, Hack, Hack, 20, sollt ihr schön was"}, {"id": 444, "start": 2576.04, "end": 2589.0, "text": "erkennen können jetzt, jepp, jepp, jepp, ich weiß nicht warum es mir jetzt danach war,"}, {"id": 445, "start": 2589.0, "end": 2592.32, "text": "ich wollte es eigentlich komplett aussprechen aber ich weiß nicht ob man das auf Twitch"}, {"id": 446, "start": 2592.32, "end": 2604.28, "text": "noch darf, ich wollte eigentlich sagen jepp, aber das darf ich nicht, sonst ist Camp Ban,"}, {"id": 447, "start": 2604.28, "end": 2625.12, "text": "so, Hahn, genau, jepp, jepp, Hahn wollte ich sagen, so ist es, weiß nicht was mir lieber"}, {"id": 448, "start": 2625.12, "end": 2636.92, "text": "ist, das oder das oder das, es ist auch egal, wen juckt die Farbe, ok, auf gehts, Go Stels,"}, {"id": 449, "start": 2636.92, "end": 2651.24, "text": "also, dann fangen wir mal an, ähm, das letzte Mal, ups, Open Recent, Pepofetta, also das"}, {"id": 450, "start": 2651.24, "end": 2655.36, "text": "letzte Mal hatten wir hier, das brauche ich nachher vielleicht noch, ich schiebe das mal"}, {"id": 451, "start": 2655.36, "end": 2659.24, "text": "auf einen weiteren Desktop, das letzte Mal haben wir hier eine Essence API nachgebaut,"}, {"id": 452, "start": 2659.24, "end": 2663.68, "text": "heute baue ich mein Kommando Zeilen Tool nach, was ich hier in.NET programmiert habe, aber"}, {"id": 453, "start": 2663.68, "end": 2667.56, "text": "weniger um das Kommando Zeilen Tool nachzubauen, eher um zu gucken wie man Command Line Parsing"}, {"id": 454, "start": 2667.56, "end": 2673.88, "text": "ordentlich macht, also wir machen heute, oder wir versuchen es heute mal, Command Line, Command,"}, {"id": 455, "start": 2673.88, "end": 2683.36, "text": "Command Line, Parser, müssen wir uns angucken, Jason, D, Serializer, das haben wir ja schon"}, {"id": 456, "start": 2683.36, "end": 2689.88, "text": "gemacht, dann müssen wir uns angucken, Date Time in Python, da bin ich mal gespannt ob"}, {"id": 457, "start": 2689.88, "end": 2698.88, "text": "das weniger Abfuck als in Go ist, Web Requests, brauche ich noch mal kurz erklären was das"}, {"id": 458, "start": 2698.88, "end": 2704.24, "text": "Kommando Zeilen Tool, was wir nachbauen eigentlich macht, für alle die es nicht kennen aus den"}, {"id": 459, "start": 2704.24, "end": 2710.8, "text": "letzten Streams, ich werde es euch nicht groß zeigen, ich werde es nur kurz sagen, und zwar,"}, {"id": 460, "start": 2710.8, "end": 2717.52, "text": "hier unten kann man vergessen, das ist alles Jason Gedulds, also, das ist ein Kommando Zeilen"}, {"id": 461, "start": 2717.52, "end": 2723.32, "text": "Tool, wenn man das ausführt, hast du verschiedene Optionen, List, Clear, Duration, Start, Reason,"}, {"id": 462, "start": 2723.32, "end": 2729.4, "text": "oder kann man da mit Minus Minus und so Argumente in der Shell übergeben, was das macht ist,"}, {"id": 463, "start": 2729.4, "end": 2737.16, "text": "das schickt an den Prometheus Alert Manager, trägt das eine Silence ein im Monitoring,"}, {"id": 464, "start": 2737.16, "end": 2743.68, "text": "für das aktuelle System, mit dem aktuellen User, für die aktuelle Zeit, für 15 Minuten,"}, {"id": 465, "start": 2743.68, "end": 2747.6, "text": "das habe ich für die Arbeit gebaut, das habe ich dort auch schon angekündigt, dass das"}, {"id": 466, "start": 2747.6, "end": 2751.64, "text": "bald kommt, fanden die Leute wirklich gut, gerade unser Support, der immer Monitoring"}, {"id": 467, "start": 2751.64, "end": 2761.96, "text": "Meldungen bekommt, wenn irgendjemand vergessen hat, das System in Maintenance zu nehmen,"}, {"id": 468, "start": 2761.96, "end": 2766.88, "text": "und da kannst du nämlich einfach auf den Server gehen und sagen, Set Down Time, und"}, {"id": 469, "start": 2766.88, "end": 2773.84, "text": "dann nimmt er das System für 15 Minuten raus, und das ist ein super kleines Beispielprogramm,"}, {"id": 470, "start": 2773.84, "end": 2779.36, "text": "um so Sachen wie Command Line Parsing und sowas in Goma auszuprobieren, wirst du Cobra"}, {"id": 471, "start": 2779.36, "end": 2785.04, "text": "für CLI Arcs, ich habe keine Ahnung, ich weiß nicht, was es da gibt, ihr könnt mir"}, {"id": 472, "start": 2785.04, "end": 2795.56, "text": "mal ein paar, warum nehmen wir nicht einfach Standard Library Parser, also wenn ihr Ahnung"}, {"id": 473, "start": 2795.56, "end": 2809.28, "text": "von habt, dann könnt ihr mir mal einen Chat schreiben, gute, also erstens, gute Command"}, {"id": 474, "start": 2809.28, "end": 2839.24, "text": "Line Tools, und was mich noch mehr interessieren würde, sind CLI Tools, die ordentlich vor"}, {"id": 475, "start": 2839.24, "end": 2848.48, "text": "formatieren können, in der Command Line, also wo ich zum Beispiel eine Tabelle machen kann,"}, {"id": 476, "start": 2848.48, "end": 2858.0, "text": "also für.NET gibt es sowas wie Specter Console, da kann man zum Beispiel sagen, Table Add"}, {"id": 477, "start": 2858.0, "end": 2862.48, "text": "Column und Table Render, und dann kann man so eine Tabelle auf der Command Line erzeugen,"}, {"id": 478, "start": 2862.48, "end": 2875.56, "text": "relativ einfach, sowas nur in Go gibt es garantiert, ich will kein Terminal User Interface,"}, {"id": 479, "start": 2875.56, "end": 2886.52, "text": "ich will meinen Output formatieren, ich will nicht, dass man da drin was auswählen kann,"}, {"id": 480, "start": 2886.52, "end": 2909.52, "text": "als Charm, das da, meinst du das, Alter, Cute Frameworks, da sind wir richtig, Leute,"}, {"id": 481, "start": 2909.52, "end": 2930.68, "text": "Cute Frameworks, jawoll, ach ne, Moment, das ist für interaktiven Kram, ne, das will"}, {"id": 482, "start": 2930.68, "end": 2945.68, "text": "ich nicht, Network Sync Command Line App, Bubble Tea Terminal User Interface, ne, das will"}, {"id": 483, "start": 2945.68, "end": 2952.68, "text": "ich nicht, Lip Gloss, your Terminal Style and Layout Toolkit, das könnte ich vielleicht"}, {"id": 484, "start": 2952.68, "end": 2971.24, "text": "wollen, Charm, Markdown Renderer, was zum, ich will einfach nur eine Tabelle mal, Table"}, {"id": 485, "start": 2971.24, "end": 2977.68, "text": "Writer, zeig mal her, also im Prinzip suche ich sowas wie, ne, das frage ich mich auch,"}, {"id": 486, "start": 2977.68, "end": 2992.28, "text": "was es ist, ja, sowas hier, also für Python gibt es das hier, Rich, Tabelle mit Markdown"}, {"id": 487, "start": 2992.28, "end": 2999.56, "text": "malen, ja, das war ein bisschen umständlich jetzt, da ist dann, kannst du halt auch sowas"}, {"id": 488, "start": 2999.56, "end": 3006.0, "text": "machen, sowas für Go, weiß ich nicht, ob es das gibt, also ich suche ne Library, wo"}, {"id": 489, "start": 3006.0, "end": 3011.72, "text": "ich beispielsweise Konsolen Ausgabe easy farbig machen kann und Tabellen malen kann und vielleicht"}, {"id": 490, "start": 3011.72, "end": 3016.84, "text": "auch mal ne Progress Bar malen kann und sowas für Go, vielleicht, vielleicht kann man das"}, {"id": 491, "start": 3016.84, "end": 3030.0, "text": "ja hiermit machen, das sieht aber äußerst, äußerst cute aus, alles, ich will halt nix"}, {"id": 492, "start": 3030.0, "end": 3040.84, "text": "Interaktives, das brauch ich net, New Style Background Padding Top Padding Width, das"}, {"id": 493, "start": 3040.84, "end": 3046.8, "text": "sind zwei getrennte Use Cases, jaja, ich suche ja auch nicht das gleiche, unbedingt das gleiche"}, {"id": 494, "start": 3046.8, "end": 3052.68, "text": "für, ich mein Specter Console hat einen Command Line Paser dabei, den verwende ich aber auch"}, {"id": 495, "start": 3052.68, "end": 3062.28, "text": "nicht, also für.NET verwende ich für Command Line Apps das hier, als Argument Parsing und"}, {"id": 496, "start": 3062.28, "end": 3072.24, "text": "Help Generator und sowas und Specter Console für farbige Ausgaben, ne ich will was einfaches,"}, {"id": 497, "start": 3072.24, "end": 3076.92, "text": "ok, also ich würde sagen, nachdem wir uns das letzte Mal so sehr mit Command Line Parsing"}, {"id": 498, "start": 3076.92, "end": 3081.88, "text": "aufgehalten haben, heben wir uns das für nachher oder irgendwann anders auf, sondern gucken"}, {"id": 499, "start": 3081.88, "end": 3087.16, "text": "wir uns erstmal was mit Web Request und Daytime Handling an, also was ich machen will ist,"}, {"id": 500, "start": 3087.16, "end": 3090.88, "text": "ne Moment, wir brauchen noch mehr Sachen, wir gucken es mal kurz hier der Reihe nach"}, {"id": 501, "start": 3090.88, "end": 3095.68, "text": "durch, also Daytime Handling brauchen wir, die Regex Geschichte lasse ich mal außen"}, {"id": 502, "start": 3095.68, "end": 3106.0, "text": "vor, so, genau, Username muss ich schon einmal rauskriegen, Username muss ich rauskriegen,"}, {"id": 503, "start": 3106.0, "end": 3112.76, "text": "die kriegt man denn in Go, das ist das erst, was wir uns angucken können, Golang Current"}, {"id": 504, "start": 3112.76, "end": 3124.04, "text": "User, yep, Golang Environment Variables, was ist das für ein Operator, oh ich hoffe ich"}, {"id": 505, "start": 3124.04, "end": 3133.04, "text": "kann das richtig aussprechen, das ist der Null Coalescing Assignment Operator, jetzt"}, {"id": 506, "start": 3133.04, "end": 3136.92, "text": "weißt du wahrscheinlich Bescheid, oder, jetzt denkst du dir, ach Mensch, hättest du das"}, {"id": 507, "start": 3136.92, "end": 3143.36, "text": "mal gleich gesagt, jetzt weiß ich sofort was das macht, also, was das macht, Obvious,"}, {"id": 508, "start": 3143.36, "end": 3151.0, "text": "Completely Obviously, also was das macht ist folgendes, das guckt ob Start Null ist, wenn"}, {"id": 509, "start": 3151.0, "end": 3160.48, "text": "Start Null ist, dann weist es ihm ein Default Value zu, oder ein Value zu, also im Prinzip"}, {"id": 510, "start": 3160.48, "end": 3171.8, "text": "ist das die Kurzform von if Start gleich gleich Null, nein, gleich gleich Null, dann Start"}, {"id": 511, "start": 3171.8, "end": 3184.92, "text": "gleich Date Time Now, ach guck mal, da kannst du ja sogar umwandeln hier, guck, also das"}, {"id": 512, "start": 3184.92, "end": 3190.4, "text": "ist exakt die Kurzschreibweise dafür, das ist übrigens auch was was ich an C Sharp mag"}, {"id": 513, "start": 3190.4, "end": 3197.44, "text": "und wie Microsoft damit vorgeht, die bauen, man könnte jetzt ja sagen, hey, also das ist"}, {"id": 514, "start": 3197.44, "end": 3201.6, "text": "eindeutig der Go, der Go Weg, ja in Go würden die nie sowas einbauen, die in Go sagen,"}, {"id": 515, "start": 3201.6, "end": 3206.8, "text": "ihr macht doch völlig den if, das mag ich an.NET, dass die sowas einbauen, das ist"}, {"id": 516, "start": 3206.8, "end": 3218.2, "text": "jetzt kein riesen krasses Feature, aber es ist praktisch, I find das cool, so, also wie"}, {"id": 517, "start": 3218.2, "end": 3228.88, "text": "kriegt man, wie kriegt man Environment Variablen raus bei Go, OS, OS get enf und dann testen"}, {"id": 518, "start": 3228.88, "end": 3241.56, "text": "wir mal, ob das funktioniert, ja dann printe ich meinetwegen foo, get ent sudo user, so"}, {"id": 519, "start": 3241.56, "end": 3248.88, "text": "run sollte nicht funktionieren, ja und jetzt mal mit sudo ausgeführt, aha funktioniert,"}, {"id": 520, "start": 3248.88, "end": 3265.2, "text": "easy, ok, das ist einfach, das ist, da wäre ich, das hätte ich, ja, das kann man mit"}, {"id": 521, "start": 3265.2, "end": 3272.68, "text": "leben, also outsour, ja wie kriegt man den current, den current user, user username,"}, {"id": 522, "start": 3272.68, "end": 3285.04, "text": "user current, error, bloated, alter, bloated, komplett bloated Error Handling, gibt es irgendwo"}, {"id": 523, "start": 3285.04, "end": 3292.16, "text": "ein Fehlerfall, dass man den User rauskriegen kann, wann genau gibt es den Fehler, dass"}, {"id": 524, "start": 3292.16, "end": 3311.28, "text": "er den User nicht rauskriegen kann, run, oh warte, ja genau, alter, so, name, wat, wer"}, {"id": 525, "start": 3311.28, "end": 3322.4, "text": "doch da, ah username, verstehe, wenn es keinen home user gibt und root gelöscht wurde, ja"}, {"id": 526, "start": 3322.4, "end": 3330.6, "text": "da haben wir glaube ich andere Probleme, übrigens, exceptions sind teilweise echt was feines,"}, {"id": 527, "start": 3330.6, "end": 3335.12, "text": "das ist ja im Prinzip auch nichts anderes, wie wir werfen exceptions, die dann hochgebabbelt"}, {"id": 528, "start": 3335.12, "end": 3343.56, "text": "ist und keiner fängt, ja, also es wäre finde ich durchaus, also in dotnet wäre das tatsächlich"}, {"id": 529, "start": 3343.56, "end": 3347.2, "text": "einfacher gewesen, das Ding hier würde eine exception schmeißen und ich würde die nicht"}, {"id": 530, "start": 3347.2, "end": 3355.72, "text": "fangen und mein Programm würde abkacken, und gut ist, ja, aber aktuell, das, lassen"}, {"id": 531, "start": 3355.72, "end": 3363.92, "text": "wir mal bloated Error Handling, außen vor, ok, das muss ich user nennen, weil ansonsten"}, {"id": 532, "start": 3363.92, "end": 3371.6, "text": "klappt das nicht, also wir haben die Auswahl, so, mein Autor für diese Maintenance ist"}, {"id": 533, "start": 3371.6, "end": 3387.28, "text": "entweder der sudo user os get nf sudo user oder mein aktueller User, so und jetzt sind"}, {"id": 534, "start": 3387.28, "end": 3398.28, "text": "wir schon wieder bei der go Geschichte, wie macht man sowas da, mit einem if wahrscheinlich"}, {"id": 535, "start": 3398.28, "end": 3410.6, "text": "gehe ich mal von aus, oder kann man, geht oder oder, nee, mismatch, type, ach so, das"}, {"id": 536, "start": 3410.6, "end": 3429.2, "text": "ist username, immer noch mismatch, is not defined on string, nope, also das gibt anscheinend"}, {"id": 537, "start": 3429.2, "end": 3440.32, "text": "nur die Möglichkeit, ein if zu machen, also muss ich quasi, sudo user, na gut, ich mein,"}, {"id": 538, "start": 3440.32, "end": 3447.16, "text": "man muss sagen, ich verstehe schon teilweise so, glaub ich langsam so, was die sich dabei"}, {"id": 539, "start": 3447.16, "end": 3455.08, "text": "denken, dass man es in go eben, ich nenn's mal etwas umständlicher macht, die go Philosophie"}, {"id": 540, "start": 3455.08, "end": 3461.88, "text": "scheint mir eher zu sein, man soll halt die Sachen gefälligst explizit hinschreiben,"}, {"id": 541, "start": 3461.88, "end": 3475.32, "text": "ganz ausführlich, was man so macht, also if sudo user, tja, kein leerer string wahrscheinlich,"}, {"id": 542, "start": 3475.32, "end": 3486.28, "text": "denke ich mal, vermute ich mal, also machen wir sowas hier, gleich, User, wobei brauchen"}, {"id": 543, "start": 3486.28, "end": 3490.52, "text": "wir doch gar nicht, machen einfach sowas, falls das erlaubt ist, nein, das ist natürlich"}, {"id": 544, "start": 3490.52, "end": 3498.84, "text": "nicht erlaubt, keckel, nee, Moment, ich hab User doppelt benannt, das verwirrt den, das"}, {"id": 545, "start": 3498.84, "end": 3506.4, "text": "darf ich auch nicht machen, ah, das geht nicht oder was, also da jetzt username funsnet oder,"}, {"id": 546, "start": 3506.4, "end": 3516.96, "text": "nee, das heißt, ich muss das irgendeiner Variable zuweisen, ok, system user, das schwierigste"}, {"id": 547, "start": 3516.96, "end": 3527.84, "text": "ist doch immer eh, wie benennt man diesen Campbell, ach nee, da kommt ja dann noch Error"}, {"id": 548, "start": 3527.84, "end": 3538.32, "text": "raus, ja ok, system user, username, so und dann environment und der Autor ist sudo user,"}, {"id": 549, "start": 3538.32, "end": 3543.92, "text": "wenn sudo user nicht null ist, so, das ist jetzt äußerst explizit hingeschrieben, fällt"}, {"id": 550, "start": 3543.92, "end": 3549.84, "text": "irgendjemand was auf, wie man das eleganter oder kürzer und knackiger in Go machen kann,"}, {"id": 551, "start": 3549.84, "end": 3558.84, "text": "ja, also mir persönlich wäre ja sowas hier, lieber, aber das gibt es in Go nicht, ich"}, {"id": 552, "start": 3558.84, "end": 3564.48, "text": "glaube, das ist so der Go, the way in Go, ich glaube, großartig schöner kann man das"}, {"id": 553, "start": 3564.48, "end": 3581.16, "text": "gar nicht machen oder, wie sieht denn in Go ein ternary operator aus, ok, gibt es nicht,"}, {"id": 554, "start": 3581.16, "end": 3593.08, "text": "kackel, hätte ich mir denken können, if sudo, Moment, was, chat, ich hab das jetzt copy"}, {"id": 555, "start": 3593.08, "end": 3603.8, "text": "pasted, aber, weiß nicht so genau, was das, ach so, das kann man in einer Zeile machen,"}, {"id": 556, "start": 3603.8, "end": 3621.8, "text": "naja, ach so, ok, das ist natürlich schon mal nicht schlecht, wenn das geht und jetzt,"}, {"id": 557, "start": 3621.8, "end": 3645.68, "text": "ne, ja super, ja, Go, ich weiß, und wie würde man das jetzt machen, was, Komma, naja, schön,"}, {"id": 558, "start": 3645.68, "end": 3660.6, "text": "ich weiß nicht, ob das ehrlich gesagt so viel schöner ist, in.net könnte man auch sowas"}, {"id": 559, "start": 3660.6, "end": 3676.44, "text": "machen und dann würde ich sagen, ist, zum Beispiel, und dann würde das das auch checken,"}, {"id": 560, "start": 3676.44, "end": 3681.52, "text": "man kann sudo user nicht weiter verwenden, ja, das ist klar, das will ich aber auch nicht,"}, {"id": 561, "start": 3681.52, "end": 3688.44, "text": "ich lass es jetzt einfach mal so, wenn der chat sagt, das ist der Go way, ja, wir sind"}, {"id": 562, "start": 3688.44, "end": 3694.76, "text": "aber nicht in Rust, in Rust hätt ich dann andere Probleme, ok, also das funzt schon mal,"}, {"id": 563, "start": 3694.76, "end": 3702.24, "text": "der Autor ist Max und wenn ich jetzt sudo ausführe, müsste der root sein, ach ne, schwachsinn,"}, {"id": 564, "start": 3702.24, "end": 3708.08, "text": "lul, da muss immer Max sein, der User, weil das erliest der sudo, der User ist Max sowohl"}, {"id": 565, "start": 3708.08, "end": 3716.0, "text": "bei mir als auch mit root ausgeführt, richtig, Rust one on one quickscope, auf gehts, ok,"}, {"id": 566, "start": 3716.0, "end": 3726.12, "text": "also das hätten wir schon mal, haben wir schon mal mehr geschafft als in Rust, ok, weiter"}, {"id": 567, "start": 3726.12, "end": 3738.48, "text": "im Text, oh dns lokaler hostname, da bin ich mal gespannt, da bin ich mal gespannt, ok,"}, {"id": 568, "start": 3738.48, "end": 3745.44, "text": "ich gucke nicht nach, ich versuch mal, ob ich go verstanden hab, os, host, ne, Leute,"}, {"id": 569, "start": 3745.44, "end": 3765.52, "text": "oops, falsches Ding, easy, go durchgespielt, go, ach ne, hostname, alter was hat der denn"}, {"id": 570, "start": 3765.52, "end": 3778.84, "text": "wieder verschmerzen, ah, bestimmt wieder error, bloated error handling, ok, hostname, mal gucken,"}, {"id": 571, "start": 3778.84, "end": 3782.48, "text": "was der jetzt ausgibt, ob das überhaupt eine richtige hostname, hat das irgendwelche Parameter?"}, {"id": 572, "start": 3782.48, "end": 3799.32, "text": "ok, hostname, gibt es irgendwie was in, gibt es, ich bräuchte irgendein makro, print,"}, {"id": 573, "start": 3799.32, "end": 3804.52, "text": "weil in go muss man ja alles printen, dass er nicht abgefuckt ist, dass irgendeine Variable"}, {"id": 574, "start": 3804.52, "end": 3813.08, "text": "unbenutzt ist für 2 Sekunden, warum eigentlich Doppelpunkt gleich, das ist, dass er die Variable"}, {"id": 575, "start": 3813.08, "end": 3819.48, "text": "anlegt und gleich den Wert reinschreibt, es ist ein bisschen bescheuert, weil du könntest"}, {"id": 576, "start": 3819.48, "end": 3824.36, "text": "auch wahr davor schreiben und dann gleich machen, ja, das würde auch funktionieren,"}, {"id": 577, "start": 3824.36, "end": 3831.68, "text": "warum exakt go der Meinung ist, man braucht für das exakt gleiche 2 unterschiedliche"}, {"id": 578, "start": 3831.68, "end": 3839.4, "text": "Syntax, ich verstehe es nicht, ich persönlich finde die Variante hier deutlich schöner,"}, {"id": 579, "start": 3839.4, "end": 3851.84, "text": "aber go Fans finden die hier besser, so, hostname, hostname ist poggers, da bin ich mir mal gar"}, {"id": 580, "start": 3851.84, "end": 3856.56, "text": "nicht so sicher, ob das hostname poggers ist, ich will nämlich den hostname, ich will den"}, {"id": 581, "start": 3856.56, "end": 3865.32, "text": "fqdn haben, geht das da drüber auch, fqdn oder so, ne wahrscheinlich nicht, ok, go lang"}, {"id": 582, "start": 3865.32, "end": 3895.08, "text": "system fqdn, extra package, nope, ah, geil, geht wieder nicht, not pog, ok, ok, ok, ok,"}, {"id": 583, "start": 3895.08, "end": 3906.88, "text": "naja, ich lasse es erstmal so, weil es könnte sein, dass auf unsere Linux Kisten tatsächlich"}, {"id": 584, "start": 3906.88, "end": 3912.68, "text": "der fqdn und der hostname exakt das gleiche ist, also dass der komplette fqdn als hostname"}, {"id": 585, "start": 3912.68, "end": 3924.08, "text": "gesetzt ist, gehe ich sogar von aus ehrlich gesagt, so, da lassen wir das erstmal so,"}, {"id": 586, "start": 3924.08, "end": 3930.2, "text": "hostname haben wir rausgekriegt, ok, was wir aber machen müssen ist tatsächlich, wir müssen"}, {"id": 587, "start": 3930.2, "end": 3946.56, "text": "an der Stelle echt mal Error Handling machen, if error, ähm, äh by the way, warum haben"}, {"id": 588, "start": 3946.56, "end": 3953.16, "text": "die denn Error nicht gemacht, wie irgendein bool währt, dass der gleich einfach so funktioniert,"}, {"id": 589, "start": 3953.16, "end": 3966.28, "text": "hat bestimmt auch seinen Sinn, äh, if error null, tja, fmt panic, ne wie geht das, panic,"}, {"id": 590, "start": 3966.28, "end": 3978.48, "text": "panic fmt, kann man panics irgendwie ratieren, und visionell und nicht null, ja das musst"}, {"id": 591, "start": 3978.48, "end": 3991.08, "text": "du den Typ der go erfunden hat fragen, fmt error, aha, alles klar, und was passiert"}, {"id": 592, "start": 3991.08, "end": 3997.84, "text": "dann, ich will jetzt eigentlich, eigentlich will ich nur diesen Error durchreichen, wie"}, {"id": 593, "start": 3997.84, "end": 4013.84, "text": "geht das, ich will eigentlich nur diesen Error durchreichen, fertig, also, ich will quasi"}, {"id": 594, "start": 4013.84, "end": 4027.56, "text": "das machen, panic, ach ne fmt, error, f und dann einfach error, ok, no pass, Moment, das"}, {"id": 595, "start": 4027.56, "end": 4046.56, "text": "hat ein result, was hat das für ein result, panic, panic, error, ahja ok, so, ähm, run,"}, {"id": 596, "start": 4046.56, "end": 4050.08, "text": "ich bin mir nicht sicher, ob wir das irgendwie sinnvoll testen können, ob das, ob das panic"}, {"id": 597, "start": 4050.08, "end": 4069.4, "text": "funktioniert, weil ich weiß nicht, wie ich das zum failen bringen kann, ne, ich, true"}, {"id": 598, "start": 4069.4, "end": 4073.12, "text": "davor bringt ja nichts, da steht ja, da steht ja, selbst wenn ich true rein treffe, da steht"}, {"id": 599, "start": 4073.12, "end": 4083.88, "text": "ja im Error nichts drin, panic null, ja geil, ähm, mich hätte mal interessiert, wie der"}, {"id": 600, "start": 4083.88, "end": 4089.88, "text": "Error aussieht, zumindest, das sollten wir tatsächlich abfangen, im dotnet Programm"}, {"id": 601, "start": 4089.88, "end": 4093.24, "text": "würde das an der Stelle übrigens abgefangen werden, da wirft ne exception, ich fang die"}, {"id": 602, "start": 4093.24, "end": 4104.44, "text": "nicht und es ist Schluss aus, ok, also, passt, hostname, haben wir, schon mehr geschafft,"}, {"id": 603, "start": 4104.44, "end": 4111.44, "text": "schon mehr geschafft als in go, so und jetzt müssen wir ne silence setzen, alles klar,"}, {"id": 604, "start": 4111.44, "end": 4121.12, "text": "das, so, jetzt mal gucken, wie wir das nächste hinbekommen in go, da bin ich ja mal gespannt,"}, {"id": 605, "start": 4121.12, "end": 4140.6, "text": "also, warum, warum, oh ne, shortcut, hab noch meinen comment, comment noch nicht, comment,"}, {"id": 606, "start": 4140.6, "end": 4147.92, "text": "add keyboard shortcut, control k, control c, remove, wie sieht das mit line up aus, hab"}, {"id": 607, "start": 4147.92, "end": 4156.68, "text": "ich das schon, ab, ne hab ich auch nicht, meine güde, wichtigsten shortcuts sind nicht"}, {"id": 608, "start": 4156.68, "end": 4168.68, "text": "gesetzt, down, jawoll, remove, fuck, so, also, wir müssen webrequest machen, fangen wir"}, {"id": 609, "start": 4168.68, "end": 4175.08, "text": "mal mit dem webrequest an, wie mach ich nen webrequest in ordentlichen, http, get, ne"}, {"id": 610, "start": 4175.08, "end": 4180.72, "text": "http, post, das ist wahrscheinlich, http, post, sowas wie, gibt es eigentlich sowas"}, {"id": 611, "start": 4180.72, "end": 4193.16, "text": "wie await in go, bestimmt, das heißt plus anders, da macht man bestimmt in den channel"}, {"id": 612, "start": 4193.16, "end": 4209.6, "text": "oder so, ja, ok, also, so, also wir posten an diese url und zwar posten wir, hallo autocomplete"}, {"id": 613, "start": 4209.6, "end": 4223.48, "text": "please, what the fuck, warum gehts autocomplete an der stelle, url, content-typ, application,"}, {"id": 614, "start": 4223.48, "end": 4247.8, "text": "ach guck mal, der macht autocomplete, das ist ziemlich pork, bodyio reader, what, also,"}, {"id": 615, "start": 4247.8, "end": 4260.56, "text": "sowas würde nicht gehen oder was, ok, da muss ich mich mal inspirieren lassen, von"}, {"id": 616, "start": 4260.56, "end": 4278.08, "text": "irgendeinem Beispiel, post, buff, wo ist der buff, ich hab keinen stream, post, zeig ich"}, {"id": 617, "start": 4278.08, "end": 4292.28, "text": "her, post, url, gibt kein Beispiel, ok, zeig ich her, z-zone, post-request, post-request,"}, {"id": 618, "start": 4292.28, "end": 4302.48, "text": "ja ja, zeig mir wie ein post geht, da, data, data gleich values, ach das funst oder was,"}, {"id": 619, "start": 4302.48, "end": 4314.4, "text": "einfach, ein einfacher string funktioniert nicht, ok, also, wait a minute, hat das ding"}, {"id": 620, "start": 4314.4, "end": 4330.28, "text": "vielleicht ne fertige api, rometoys, alert-manager, api-go, ach es gibt ne fertige client-api,"}, {"id": 621, "start": 4330.28, "end": 4352.04, "text": "rometoys-go, ihr dann, ne, das ist die api, das will ich nicht, ich will den client haben,"}, {"id": 622, "start": 4352.04, "end": 4363.48, "text": "gibt es client oder sowas, tatsächlich, rometoys-client, ihr dann, das ist, da nutze ich doch das, da"}, {"id": 623, "start": 4363.48, "end": 4372.12, "text": "muss ich, wollen wir trotzdem mal gucken wie man das selbst zusammenbauen könnte, wollen"}, {"id": 624, "start": 4372.12, "end": 4375.6, "text": "wir trotzdem mal gucken wie man den request selbst zusammenbauen könnte anstatt, ja das"}, {"id": 625, "start": 4375.6, "end": 4379.48, "text": "gucken wir jetzt trotzdem mal, es muss, muss man ja, es wäre ja sinnig, ne, das zu lernen"}, {"id": 626, "start": 4379.48, "end": 4386.16, "text": "wie das funktioniert, also, wir ignorieren mal prinzipiell wieder alle errors, ach so,"}, {"id": 627, "start": 4386.16, "end": 4395.84, "text": "ja, ist ok, so, error-handling-ploated, so, also temp, so wir müssen jetzt, wir müssen"}, {"id": 628, "start": 4395.84, "end": 4400.84, "text": "jetzt diesen, also das passt schon, post-json haben wir, receive-json ist mir jetzt erstmal"}, {"id": 629, "start": 4400.84, "end": 4404.6, "text": "ziemlich wurscht, so wir müssen jetzt ein silence-objekt anlegen, das heißt wir brauchen"}, {"id": 630, "start": 4404.6, "end": 4418.48, "text": "einen extra Typ, das lassen wir uns autogenerieren und zwar, alert-manager-swagger, so das ist"}, {"id": 631, "start": 4418.48, "end": 4423.24, "text": "die api-beschreibung für das was wir machen müssen und wir müssen post-silences machen,"}, {"id": 632, "start": 4423.24, "end": 4436.12, "text": "so, und was ich gelernt habe ist, dass rider, wenn man copy-pasted, daraus ein go-objekt"}, {"id": 633, "start": 4436.12, "end": 4444.96, "text": "machen kann, guck mal, ist das nicht nice, silence, muss man gar nichts mal von hand"}, {"id": 634, "start": 4444.96, "end": 4453.08, "text": "machen, einfach json copy-pasten und der generiert dir, der generiert dir da draus ein go-objekt,"}, {"id": 635, "start": 4453.08, "end": 4460.48, "text": "das ist sehr praktisch, wahrscheinlich total verbose und man könnte es viel einfacher"}, {"id": 636, "start": 4460.48, "end": 4475.32, "text": "machen, aber passt ja, matchers-struct, ach ne, passt, ok, so, das heißt ich brauche"}, {"id": 637, "start": 4475.32, "end": 4488.44, "text": "jetzt hier silence, silence, i kill you, ich bräuchte jetzt hier silence, ne wie geht das,"}, {"id": 638, "start": 4488.44, "end": 4498.32, "text": "fill all fields, all die brauche ich nicht, matchers, ok, was brauche ich dann, matchers"}, {"id": 639, "start": 4498.32, "end": 4505.16, "text": "brauche ich, common brauche ich, created by brauche ich, start-time, end-time, ok, alles"}, {"id": 640, "start": 4505.16, "end": 4515.4, "text": "klar, also, start-time, wir machen mal kurz easy-mode, wir machen mal kurz easy-mode,"}, {"id": 641, "start": 4515.4, "end": 4522.4, "text": "weil, ach er kennt sogar, dass es ein time-objekt ist, ja wir machen mal time-now für ende"}, {"id": 642, "start": 4522.4, "end": 4527.88, "text": "und start, einfach nur um zu gucken ob es funktioniert, also unsere maintenance soll"}, {"id": 643, "start": 4527.88, "end": 4533.08, "text": "jetzt anfangen, was ich bastle, äh folgendes, mach mal ausrufezeichen heute, ich weiß nicht"}, {"id": 644, "start": 4533.08, "end": 4537.68, "text": "ob das richtig drinne steht, ich habe ein tool gebaut in dotnet vor einer weile für"}, {"id": 645, "start": 4537.68, "end": 4545.52, "text": "die arbeit, das kommt auf jeden unserer systeme drauf, also über 3000 stück, genau, ähm"}, {"id": 646, "start": 4545.52, "end": 4552.56, "text": "und dann kannst du vom system aus selbst für das jeweilige system von jetzt für 15 minuten"}, {"id": 647, "start": 4552.56, "end": 4556.76, "text": "lang eine monitoring-maintenance setzen, dass wenn du wartungsarbeiten angekündigt"}, {"id": 648, "start": 4556.76, "end": 4562.92, "text": "hast, hast aber vergessen für dieses system eine monitor downtime einzutragen und du willst"}, {"id": 649, "start": 4562.92, "end": 4567.4, "text": "nicht, dass das monitoring verrückt spielt, weil du server-rebootest, kannst du auf dem"}, {"id": 650, "start": 4567.4, "end": 4572.12, "text": "system dann set downtime ausführen, dann setzt dir eine für das system mit deinem name drin"}, {"id": 651, "start": 4572.12, "end": 4578.2, "text": "von jetzt für 15 minuten, das ist ein relativ übersichtliches dotnet-programm hier, also"}, {"id": 652, "start": 4578.2, "end": 4583.2, "text": "relevant sind ja eigentlich nur die hier, also 100, 180 zeichen, zeilen ist jetzt nicht"}, {"id": 653, "start": 4583.2, "end": 4587.92, "text": "die welt ja, und das habe ich mir gedacht, das können wir mal in go nachbauen und bisschen"}, {"id": 654, "start": 4587.92, "end": 4593.6, "text": "lernen wie man sowas in go machen würde, so also matchers, das sollte er zumindest schon"}, {"id": 655, "start": 4593.6, "end": 4599.32, "text": "mal schicken können, ne kann er nicht schicken, äh das heißt ich muss jetzt wahrscheinlich"}, {"id": 656, "start": 4599.32, "end": 4613.92, "text": "sagen jason marschall, ne das geht anart, das muss ich in 2 schritten machen, silence jason,"}, {"id": 657, "start": 4613.92, "end": 4618.92, "text": "war nicht sowas, wir ignorieren mal wieder alle errors, weil error handling bloated,"}, {"id": 658, "start": 4618.92, "end": 4630.92, "text": "jetzt, jetzt bin ich überfragt, was der von mir will, darf man fragen, welche monitor"}, {"id": 659, "start": 4630.92, "end": 4640.2, "text": "löse ich, äh prometoys, früher zappix, ganz früher nagios, dann lange zeit zappix und"}, {"id": 660, "start": 4640.2, "end": 4651.6, "text": "jetzt seit 2 jahren ungefähr, ja 2 jahren, exklusiv nur noch prometoys, vorti, das ist"}, {"id": 661, "start": 4651.6, "end": 4658.08, "text": "eine sehr gute idee, wir machen einfach mal ein bisschen länger, die add, time minute"}, {"id": 662, "start": 4658.08, "end": 4668.0, "text": "mal 15, also 15 minuten können wir die eintragen, äh created by, das haben wir doch hier, created"}, {"id": 663, "start": 4668.0, "end": 4678.2, "text": "by autor, comment haben wir noch nicht, hostname matcher müssen wir noch machen, ähm ok silence"}, {"id": 664, "start": 4678.2, "end": 4695.96, "text": "das mag er nicht, brauchst einen buffer, das ist aber ganz schön umständlich, ah das ist"}, {"id": 665, "start": 4695.96, "end": 4713.36, "text": "informdata, bytes new buffer jason data, ok, bytes new buffer, ja ok wenn man das weiß"}, {"id": 666, "start": 4713.36, "end": 4742.08, "text": "ist doch ganz in ordnung, geht in ordnung, wooploss approved, ja mit datetime ausrechnen"}, {"id": 667, "start": 4742.08, "end": 4746.24, "text": "bin ich mal gespannt, wie gut das klappt gleich, da so weit sind wir ja noch nicht, weil die"}, {"id": 668, "start": 4746.24, "end": 4751.44, "text": "zeit stimmt ja noch überhaupt nicht, die zeit muss nämlich in utc umgerechnet werden, das"}, {"id": 669, "start": 4751.44, "end": 4754.72, "text": "muss ich mir drüber schreiben, dass ich nicht vergesse, weil der alert manager läuft komplett"}, {"id": 670, "start": 4754.72, "end": 4763.36, "text": "in utc, so also das würde wahrscheinlich jetzt funktionieren denke ich mal, response, error"}, {"id": 671, "start": 4763.36, "end": 4778.96, "text": "wird ignored, wer braucht sowas, fmt, prindlen, response, ah ne, so, run, response ist null,"}, {"id": 672, "start": 4778.96, "end": 4783.0, "text": "das heißt es hat schon mal nicht funktioniert, ist aber auch klar, weil ich hab hier kein"}, {"id": 673, "start": 4783.0, "end": 4796.12, "text": "matcher gesetzt, da alert manager läuft nicht, na dann noch mal ausführen, doch funktioniert"}, {"id": 674, "start": 4796.12, "end": 4807.8, "text": "oder auch nicht, an anscheinend nicht funktioniert, da müssen wir jetzt tatsächlich schon wieder"}, {"id": 675, "start": 4807.8, "end": 4824.68, "text": "error handling machen, so viel error handling, so viel error handling, so unprocessable and"}, {"id": 676, "start": 4824.68, "end": 4834.2, "text": "what the, das nervt mich an go, dass man das nicht mal kurz auskommentieren kann, ohne"}, {"id": 677, "start": 4834.2, "end": 4844.28, "text": "dass sie dann sonst rumklicken, alter, das ist abfuck, ach ne, das kommt vom unten, der"}, {"id": 678, "start": 4844.28, "end": 4852.28, "text": "hat gar keinen, moment das, der hat gar keinen error oder, der hat gar keinen error, das"}, {"id": 679, "start": 4852.28, "end": 4859.4, "text": "hat funktioniert, der response code ist einfach code, status code, response code ist einfach"}, {"id": 680, "start": 4859.4, "end": 4866.08, "text": "422, das heißt, da kam nichts sinnvolles zurück, ist ja auch klar, mein request ist"}, {"id": 681, "start": 4866.08, "end": 4874.16, "text": "ja auch fail, stba42, danke schön für den sub, captain peng, danke für den sub, hab"}, {"id": 682, "start": 4874.16, "end": 4887.56, "text": "ich gar nicht gesehen, huge subscription hier, es war gar kein prime subscriber, jebaited,"}, {"id": 683, "start": 4887.56, "end": 4916.44, "text": "so, kannst du naisu raushauen, ja klar kann ich das machen, nachdem du prime gesubbt hast,"}, {"id": 684, "start": 4916.44, "end": 4940.36, "text": "easy money easy life, ne ich kanns auch so machen, ja, so also weiter, status code, warum"}, {"id": 685, "start": 4940.36, "end": 4946.12, "text": "ist ein status code von 422 kein error, na ist eigentlich ok, es war ja auch kein error,"}, {"id": 686, "start": 4946.12, "end": 4961.12, "text": "der request hat ja funktioniert, aber obendrüber die ebene war halt ein fehler, der cloud musst"}, {"id": 687, "start": 4961.12, "end": 4966.12, "text": "du auch nicht jeden error behandeln, ich mein gerade, ich mein gerade wenn du ne exception"}, {"id": 688, "start": 4966.12, "end": 4970.44, "text": "bekommst ja und du willst an der stelle wirklich nicht weitermachen, dann machst du halt kein"}, {"id": 689, "start": 4970.44, "end": 4978.64, "text": "try drum und es kackt ab, du kannst halt in ganz vielen fällen gar nicht sinnvoll weitermachen,"}, {"id": 690, "start": 4978.64, "end": 4983.24, "text": "also kannst in vielen fällen den error nicht handeln, ich mein guck mal, wenn ich den hostname"}, {"id": 691, "start": 4983.24, "end": 4989.52, "text": "eintragen will und er kann den hostname nicht auslesen, da bleibt mir nichts anderes übrig"}, {"id": 692, "start": 4989.52, "end": 4994.2, "text": "als sowas zu machen und das erspare ich mir bei exceptions in der regel, weil ich einfach"}, {"id": 693, "start": 4994.2, "end": 5006.08, "text": "sag ja dann kackt halt ab an der stelle, es ist wahrscheinlich einfach ein bisschen geschmackssache"}, {"id": 694, "start": 5006.08, "end": 5013.36, "text": "aber ich also weiß nicht ich bin nur mit dem error handling noch nicht so, noch nicht so"}, {"id": 695, "start": 5013.36, "end": 5021.88, "text": "hundertprozentig warm ja, status code an den kleinen zurück zu liefern, was für ein status"}, {"id": 696, "start": 5021.88, "end": 5032.28, "text": "code, ich mein ich könnte ne sinnvolle konsolenausgabe ausgeben aber ich hoffe mal, dass der error"}, {"id": 697, "start": 5032.28, "end": 5040.52, "text": "sagt irgendwas sinnvolles aus, so also jetzt können wir den kram hier abschicken, so das"}, {"id": 698, "start": 5040.52, "end": 5049.04, "text": "heißt die matcher sind nicht gesetzt, wie setze ich denn jetzt hier sinnvolle matcher,"}, {"id": 699, "start": 5049.04, "end": 5058.72, "text": "so ich bin mir nicht ganz sicher, was die ganze syntax hier macht, wir haben nen array"}, {"id": 700, "start": 5058.72, "end": 5068.28, "text": "von structs, ok das verstehe ich, aber ist das ein anonymer struct, weil der struct hat"}, {"id": 701, "start": 5068.28, "end": 5082.4, "text": "kein name, das heißt der typ hat kein name, ne der hat wirklich kein name oder moment"}, {"id": 702, "start": 5082.4, "end": 5094.56, "text": "moment ne matchers ist ein anonymes struct array oder irgendwie sowas, und wofür genau"}, {"id": 703, "start": 5094.56, "end": 5105.2, "text": "muss da geschweifte klammern am ende noch mal hin, das würde ich ja verstehen aber wozu"}, {"id": 704, "start": 5105.2, "end": 5115.6, "text": "sind die geschweiften klammern da, was passiert wenn ich da was reinschreibe, keine ahnung,"}, {"id": 705, "start": 5115.6, "end": 5122.48, "text": "also ohne die geschweiften klammern funktioniert es zumindest schon mal nicht, was da kommt"}, {"id": 706, "start": 5122.48, "end": 5130.72, "text": "der inhalt hin, ich denke hier schreibe ich jetzt den inhalt rein, ne mache ich anscheinend"}, {"id": 707, "start": 5130.72, "end": 5153.92, "text": "nicht oder, warte mal, wie schreibe ich denn da jetzt was rein, ich hab kein plan, wie"}, {"id": 708, "start": 5153.92, "end": 5169.52, "text": "füll ich, wie füll ich das denn jetzt, was der struct, das hatte ich gerade, jetzt will"}, {"id": 709, "start": 5169.52, "end": 5177.28, "text": "er nix, ich kriege auch kein auto complete, das ist schon mal verdächtig, dass es nicht"}, {"id": 710, "start": 5177.28, "end": 5207.08, "text": "funktioniert, ok, goleng anonymes struct json, use anonymes"}, {"id": 711, "start": 5207.08, "end": 5236.88, "text": "struct, so, auf, zeig her, hier, da, new car, also, also, ok, ok leute, das heißt ich"}, {"id": 712, "start": 5236.88, "end": 5250.28, "text": "mache jetzt, ich mache jetzt einen neuen typ, typ, matcher struct und der enthält das da,"}, {"id": 713, "start": 5250.28, "end": 5258.16, "text": "sehe ich das soweit richtig, und dann ist das nicht dieser crap, sondern ein array von"}, {"id": 714, "start": 5258.16, "end": 5264.72, "text": "matchern, ok, es gibt keinen syntaxfehler, scheint schon mal zu passen was ich da gemacht"}, {"id": 715, "start": 5264.72, "end": 5281.56, "text": "hab, und jetzt, nein nicht nil, slice match, was will der dude von mir, ah, ok, das ist"}, {"id": 716, "start": 5281.56, "end": 5288.4, "text": "quasi so list syntax, also könnte ich quasi auch noch mehrere rein machen, ahja, ja ohne"}, {"id": 717, "start": 5288.4, "end": 5295.16, "text": "auto complete wäre ich jetzt aufgeschmissen gewesen, so, also, hostname, ok mal gucken,"}, {"id": 718, "start": 5295.16, "end": 5302.28, "text": "was muss ich da rein füllen, hostname, nee, name, name, hostname, value, die variable"}, {"id": 719, "start": 5302.28, "end": 5315.84, "text": "innerhalb von hostname, itsregionsfault ist equals true, ok, true, 0w, easy, so und jetzt"}, {"id": 720, "start": 5315.84, "end": 5320.2, "text": "sollte ich eine maintenance bekommen, wenn ich das richtig gemacht hab, go run, 200,"}, {"id": 721, "start": 5320.2, "end": 5328.96, "text": "200 ist immer gut, 200 und haben wir eine maintenance, active, jawoll, hat funktioniert,"}, {"id": 722, "start": 5328.96, "end": 5337.48, "text": "poggies, hostname gleich poggers, alles klar, ok, schon mal deutlich einfacher gewesen"}, {"id": 723, "start": 5337.48, "end": 5357.96, "text": "als in rust, warum ist denn das hier ausgekraut, oh, was hat er jetzt gemacht, hä, unsinnig,"}, {"id": 724, "start": 5357.96, "end": 5368.32, "text": "die machen wir nix, assync mit channels, alles synchron ist ok, ich kann utc machen, ah,"}, {"id": 725, "start": 5368.32, "end": 5375.84, "text": "das ist gut zu wissen, aber so einfach ist es mit datetime natürlich nicht, so einfach"}, {"id": 726, "start": 5375.84, "end": 5382.96, "text": "ist es nicht, wir müssen nämlich das hier machen mit datetime, also sprich, entweder"}, {"id": 727, "start": 5382.96, "end": 5391.6, "text": "hat der user über die kommandozeile was gesetzt an datetime oder, wobei ich will jetzt keinen,"}, {"id": 728, "start": 5391.6, "end": 5398.8, "text": "ich hab jetzt keinen bock auf kommandozeilen, auf kommandozeilen, parsing, also das ergibt"}, {"id": 729, "start": 5398.8, "end": 5406.12, "text": "ja so mal Sinn, er setzt die maintenance und alles ist gut, kann ich das geprinte hier"}, {"id": 730, "start": 5406.12, "end": 5420.56, "text": "auch wegmachen, äh ja, status code null, was hat er für schmerzen, wo ist das problem,"}, {"id": 731, "start": 5420.56, "end": 5426.36, "text": "dann nicht, bloated error handling, alles weg, so, aber um datetime müssen wir uns jetzt"}, {"id": 732, "start": 5426.36, "end": 5432.2, "text": "tatsächlich doch kümmern, weil eine logik brauchen wir nämlich noch für datetime, also"}, {"id": 733, "start": 5432.2, "end": 5438.0, "text": "machen wir mal sowas hier, also start time, gehen wir mal von aus, wir hätten das aus"}, {"id": 734, "start": 5438.0, "end": 5448.36, "text": "der kommandozeile bekommen, irgendwie in den optionen, start time now, ok, wir simulieren"}, {"id": 735, "start": 5448.36, "end": 5454.48, "text": "das mal, ja, also das hier ist irgendwie keine ahnung, start time arc, so, das ist das was,"}, {"id": 736, "start": 5454.48, "end": 5458.88, "text": "das ist das was bei der kommandozeile reinkommt, so, über kommandozeile hat einer eingegeben,"}, {"id": 737, "start": 5458.88, "end": 5466.4, "text": "er will um 0.30 und 0 sekunden, also er möchte um 0.30 seine wartungsarbeiten beginnen, so"}, {"id": 738, "start": 5466.4, "end": 5472.96, "text": "jetzt brauche ich ja folgende logik, erstens muss ich den utc umrechnen und zweitens brauche"}, {"id": 739, "start": 5472.96, "end": 5480.68, "text": "ich folgende logik, wenn 0.30, also es ist nur mal ums zu erklären warum, also wenn einer"}, {"id": 740, "start": 5480.68, "end": 5487.44, "text": "um 23.45 sich einloggt, weil er wartungsarbeiten macht, kann es durchaus sein, dass der 0.30"}, {"id": 741, "start": 5487.44, "end": 5492.68, "text": "angibt, der meint dann aber nicht 0.30 am aktuellen tag, sondern 0.30 am nächsten tag,"}, {"id": 742, "start": 5492.68, "end": 5499.32, "text": "also muss ich gucken, ist 0.30 in der vergangenheit, wenn 0.30 in der vergangenheit ist, dann meint"}, {"id": 743, "start": 5499.32, "end": 5504.6, "text": "er nächsten tag, am ende kommt ja nochmal statusausgabe, wo drin steht, was sache ist,"}, {"id": 744, "start": 5504.6, "end": 5507.92, "text": "er kann es ja am zweiten verlöschen, wenn das nicht so ist, aber in 99 prozent der fälle"}, {"id": 745, "start": 5507.92, "end": 5519.8, "text": "ist das so, dann kann man das nicht nämlich sparen, irgendwelche datum sachen und so anzugeben,"}, {"id": 746, "start": 5519.8, "end": 5522.8, "text": "habe ich mir gedacht, das ist sinnvoller, also gehen wir mal von aus, das hier kommt"}, {"id": 747, "start": 5522.8, "end": 5531.68, "text": "über kommando zeile rein, wie kriege ich das jetzt gescheit gepasst in ein, in start,"}, {"id": 748, "start": 5531.68, "end": 5545.4, "text": "in start time, also start time args, also time pass, pass in location, was macht das denn,"}, {"id": 749, "start": 5545.4, "end": 5554.92, "text": "das hört sich so nach zeitzone an, wenn ich ehrlich bin, pass in location, macht, pass"}, {"id": 750, "start": 5554.92, "end": 5569.76, "text": "in location ist like pass, no shit, but differs in two important ways, also pass, nimmt utc,"}, {"id": 751, "start": 5569.76, "end": 5580.24, "text": "wenn es keine timezonen informationen hat und pass in location braucht eine timezone,"}, {"id": 752, "start": 5580.24, "end": 5588.32, "text": "ok, wie kriege ich eine location, weil ich will immer location europe berlin haben, location"}, {"id": 753, "start": 5588.32, "end": 5612.72, "text": "ne, ne, location, load location, string, tja, ok das müsste, das müsste europe berlin sein"}, {"id": 754, "start": 5612.72, "end": 5631.8, "text": "vermute ich mal, goleng, timezone, berlin, wahrscheinlich, stand da, echt, wirklich,"}, {"id": 755, "start": 5631.8, "end": 5642.72, "text": "habe ich nicht gesehen, hier, oder, oder hier, example, ach guck mal da, null, im example"}, {"id": 756, "start": 5642.72, "end": 5648.64, "text": "ist es drinnen, keck, keck weh, ich bin mir nicht sicher, ob man das in go machen darf,"}, {"id": 757, "start": 5648.64, "end": 5653.08, "text": "aber ich glaube, ich brauche die, die time informationen noch an mehreren stellen, deswegen"}, {"id": 758, "start": 5653.08, "end": 5662.28, "text": "mache ich da eine globale variabler draus, ob das, beziehungsweise, darf man so machen,"}, {"id": 759, "start": 5662.28, "end": 5675.24, "text": "ne, muss ich da war da vorschreiben jetzt, ok, location, das werde ich gar nicht noch"}, {"id": 760, "start": 5675.24, "end": 5684.56, "text": "woanders brauchen, ok, pass in location, also ok, zeitparsen, wie kann man sich in go eigentlich"}, {"id": 761, "start": 5684.56, "end": 5693.24, "text": "in der idee hier, highlighten lassen, arguments, das müsste doch, das normalerweise ist das"}, {"id": 762, "start": 5693.24, "end": 5706.12, "text": "shift, shift, control, space, arguments, arg, param, parameter, control p ist es, control"}, {"id": 763, "start": 5706.12, "end": 5717.88, "text": "p, ah, control p, ok, dann, ja, ich verwende in rider die visual studio shortcuts, deswegen"}, {"id": 764, "start": 5717.88, "end": 5746.56, "text": "weiß ich das nicht, param, eben hatte ich doch, ok, nice, alles klar, ok, layout string,"}, {"id": 765, "start": 5746.56, "end": 5755.76, "text": "das ist dann wahrscheinlich irgendwie, ja, wahrscheinlich die üblichen geschichten,"}, {"id": 766, "start": 5755.76, "end": 5769.2, "text": "ne, wait a minute, ach ne, so muss man das machen, hier, was, hä, wa, weh, warum schreibt"}, {"id": 767, "start": 5769.2, "end": 5777.48, "text": "der da ne Jahreszahl hin, der soll, der soll, ja, ja, ja, schreiben, four digit, hä, kaputt,"}, {"id": 768, "start": 5777.48, "end": 5791.88, "text": "ok, ich will ja das ja gar nicht, ich mein, ich will, ich will haben, stund, hä, warum"}, {"id": 769, "start": 5791.88, "end": 5804.08, "text": "stehen da zahlen, minute, what the, die idee macht faxen, wahrscheinlich, ja, was zum"}, {"id": 770, "start": 5804.08, "end": 5816.36, "text": "toll, 15 uhr 4 und 5 sekunden, ach das sind beispiel, beispieldaten, beispieldaten geben"}, {"id": 771, "start": 5816.36, "end": 5821.24, "text": "doch überhaupt keinen sinn an der stelle, da müsste sowas stehen wie sowas zum beispiel"}, {"id": 772, "start": 5821.24, "end": 5835.28, "text": "oder minute, minute, oder ne, klein ist das minute, minute, hä, musste die doku schauen,"}, {"id": 773, "start": 5835.28, "end": 5843.52, "text": "vielleicht ist das absicht, aber das ist die weird champigste, also die weird champigste"}, {"id": 774, "start": 5843.52, "end": 5853.72, "text": "variante zum, zum, zum parsen, die ich lange zeit gesehen hab jetzt, ok, warte mal, ähm,"}, {"id": 775, "start": 5853.72, "end": 5858.2, "text": "ich guck gleich mal in die, so hier kommt jetzt wahrscheinlich der string hin und jetzt"}, {"id": 776, "start": 5858.2, "end": 5865.08, "text": "kommt hier die location hin, ok, das passt, oder auch nicht, warum, ach so, weil wir der"}, {"id": 777, "start": 5865.08, "end": 5878.2, "text": "error handling, error handling, keckel, ok, go lang, pass time, jawoll, erklär mal, date,"}, {"id": 778, "start": 5878.2, "end": 5908.12, "text": "layout, hä, der schreibt das auch so weird champ hin, aber, hä, das versteh ich nicht,"}, {"id": 779, "start": 5908.12, "end": 5920.4, "text": "sind das magic strings, die quasi als platzhalter fungieren, also sprich, muss ich hier 05 hinschreiben,"}, {"id": 780, "start": 5920.4, "end": 5926.2, "text": "dass er erkennt, ich mein, sekunden, und wenn ich hier jetzt 04 hinschreiben würde, dann"}, {"id": 781, "start": 5926.2, "end": 5931.44, "text": "würde er denken, es sind minuten, sind das irgendwelche magic, magic zahlen oder so,"}, {"id": 782, "start": 5931.44, "end": 5938.32, "text": "das ist keine big brain format angabe, das ist ne ziemlich bescheuerte format angabe,"}, {"id": 783, "start": 5938.32, "end": 5953.76, "text": "jetzt mal ganz im ernst, ok, würde das überhaupt funktionieren, pkg time constants, wenn du"}, {"id": 784, "start": 5953.76, "end": 5964.52, "text": "keine auto completion hast, bist du lost hier, moin patrick, die meinen das ernst, das sind"}, {"id": 785, "start": 5964.52, "end": 5981.6, "text": "keine beispiele, what the fuck, wir sind weiter als in rust, die meinen das ernst, man macht"}, {"id": 786, "start": 5981.6, "end": 5990.48, "text": "den go keine place halter für datum, für ja, minute, sekunde, sondern man trägt beispielzahlen"}, {"id": 787, "start": 5990.48, "end": 6001.28, "text": "ein, ok, das ist hardcore weird champ, das ist richtig weird champ, das checkt doch,"}, {"id": 788, "start": 6001.28, "end": 6020.52, "text": "das checkt keiner, der mal was anderes verwendet hat, ok, es ist der erste 000030, ok, das"}, {"id": 789, "start": 6020.52, "end": 6029.04, "text": "ist vor allem bei workstation hier, guck, vor allem bei workstation, ich weiß nicht,"}, {"id": 790, "start": 6029.04, "end": 6034.48, "text": "also das sagt mir jetzt nicht sonderlich zu, muss ich ehrlich sagen, naja gut, machen wir"}, {"id": 791, "start": 6034.48, "end": 6040.92, "text": "mal weiter, also, irgendeiner hat 0030 angegeben, jetzt hab ich das gepasst und jetzt weiß"}, {"id": 792, "start": 6040.92, "end": 6047.82, "text": "ich, das ist der erste 000030, das bringt mir ja nix, das heißt ich brauch jetzt sowas"}, {"id": 793, "start": 6047.82, "end": 6060.64, "text": "wie start time, date oder so, kann man das setzen, date kann man nicht setzen, kann man"}, {"id": 794, "start": 6060.64, "end": 6073.8, "text": "überhaupt irgendwas setzen, nee, muss ich da jetzt ein neues, muss ich da, moment, muss"}, {"id": 795, "start": 6073.8, "end": 6078.8, "text": "ich da jetzt irgendwie, ok, ich schreib jetzt einfach mal was hin und dann müssen wir gucken,"}, {"id": 796, "start": 6078.8, "end": 6094.12, "text": "ob das Sinn macht, also now gibt's ja, so, start time, gleich, time, gibt's hier sowas"}, {"id": 797, "start": 6094.12, "end": 6123.88, "text": "wie new, date gibt's, date, ok, now, year, das muss aber bestimmt irgendwie schöner"}, {"id": 798, "start": 6123.88, "end": 6133.8, "text": "gehen, now, month, ich will ja im Prinzip die Zeit plus das Datum von heute, aber ok,"}, {"id": 799, "start": 6133.8, "end": 6146.8, "text": "now, day, und jetzt will ich start time, hour, ok, das ist ja mal hardcore umständlich,"}, {"id": 800, "start": 6146.8, "end": 6150.28, "text": "das geht bestimmt einfacher Leute, wenn ihr irgendwie Ahnung habt, wie das einfacher"}, {"id": 801, "start": 6150.28, "end": 6158.6, "text": "geht, sag Bescheid, also, ich weiß grad nicht wirklich, so, nanoseconds, 0, location, location,"}, {"id": 802, "start": 6158.6, "end": 6178.24, "text": "das ist ja wirklich, woops, location, location, add, ob add funktioniert, also, start time,"}, {"id": 803, "start": 6178.24, "end": 6198.16, "text": "add, add date gibt es, also da quasi das gleiche, was will er haben, ja, Monat, Tage, was, Moment,"}, {"id": 804, "start": 6198.16, "end": 6203.48, "text": "der will den Monat als Int, aber Monat von dem gleichen Objekt ist ein eigener Typ und"}, {"id": 805, "start": 6203.48, "end": 6209.16, "text": "kein Int, was ist das für ein undurchdachter Schwachsinn, vor allem warum geht add date"}, {"id": 806, "start": 6209.16, "end": 6217.32, "text": "nicht, aber, aber, time, date, ist dann wieder ein Int und kein Monat, what the fuck, was"}, {"id": 807, "start": 6217.32, "end": 6225.4, "text": "ist denn, wer hat sich diese API ausgedacht, das ist ja mal richtig gehirnamputiert, alter,"}, {"id": 808, "start": 6225.4, "end": 6230.44, "text": "wer hat's, das ist ja mal richtig, also das ist wirklich maximal hängen geblieben, und"}, {"id": 809, "start": 6230.44, "end": 6235.16, "text": "was mach ich jetzt, caste ich das jetzt einfach mal hart zu einem Int oder was, achso, Moment,"}, {"id": 810, "start": 6235.16, "end": 6240.72, "text": "nee, wir sind ja in Go, Sekunde, äh, caste das mal zum Int oder gucken wir mal was rauskommt,"}, {"id": 811, "start": 6240.72, "end": 6251.72, "text": "ok, anscheinend, anscheinend funktioniert das, ok, start time, ah, Moment, ich hab nie"}, {"id": 812, "start": 6251.72, "end": 6256.4, "text": "die, die Topless G baitet uns, da kommt nämlich schon ein Timeobjekt raus, das muss ich erst"}, {"id": 813, "start": 6256.4, "end": 6267.48, "text": "mal was, immutable, das muss ich ja mal neu zuweisen, äh, was meinst du, wer kostet"}, {"id": 814, "start": 6267.48, "end": 6278.44, "text": "Geld, ach, vor allem bei Workstation, ja vor allem bei Workstation kostet Geld, so, run,"}, {"id": 815, "start": 6278.44, "end": 6292.08, "text": "23, was, wait a minute, wir haben nicht den 23, wir haben den 22, und wir haben auch nicht"}, {"id": 816, "start": 6292.08, "end": 6304.64, "text": "den 8, ach, das ist schon, weil es auf 0101 steht, oh, abfuck, was das denn man, ok,"}, {"id": 817, "start": 6304.64, "end": 6312.32, "text": "also dann doch so, nee, das ist, das ist, das, also ich mein, die, die, die.net time"}, {"id": 818, "start": 6312.32, "end": 6317.92, "text": "API ist, äh, time Geschichte, ähm, ist schon nicht schön, aber das ist auch nicht toll"}, {"id": 819, "start": 6317.92, "end": 6322.28, "text": "hier, so, also jetzt hab ich die start time, das können wir jetzt mal ausprobieren, das"}, {"id": 820, "start": 6322.28, "end": 6330.28, "text": "müsste so ja funktionieren, so, da krieg ich nämlich Datum heute, heute 0.30, so, heute"}, {"id": 821, "start": 6330.28, "end": 6340.8, "text": "0.30 ist natürlich schon um, deswegen muss ich jetzt gucken, if start time, nein, if"}, {"id": 822, "start": 6340.8, "end": 6349.68, "text": "start time kleiner now, nee, das geht auch nicht, invalid operator, ok, es gibt kein"}, {"id": 823, "start": 6349.68, "end": 6363.56, "text": "größer kleiner Vergleich zwischen time, das ist auch dumm, ok, go lang compare time, how"}, {"id": 824, "start": 6363.56, "end": 6372.04, "text": "to compare time, siehste, krass, erste, ähm, today add before, ok, das ist in Ordnung,"}, {"id": 825, "start": 6372.04, "end": 6380.04, "text": "mein größer kleiner überschreiben wäre irgendwie cool gewesen, aber ok, wenn das before now"}, {"id": 826, "start": 6380.04, "end": 6388.64, "text": "ist, dann printe ich erstmal keckel, alles klar, das ist before now, ist ja logisch,"}, {"id": 827, "start": 6388.64, "end": 6399.64, "text": "es ist ja 0.30 mit heutigem Datum, ist ja schon ein bisschen her, das heißt, wenn das"}, {"id": 828, "start": 6399.64, "end": 6408.04, "text": "vor dem aktuellen Datum ist, dann will ich es setzen auf, ok, Leute, das muss einfacher"}, {"id": 829, "start": 6408.04, "end": 6423.12, "text": "gehen, dann will ich es setzen auf, nee, Moment, add, add, ich will nen Tag adden, wie, wie"}, {"id": 830, "start": 6423.12, "end": 6449.76, "text": "adde ich einen Tag, achso, ich hab ne Idee, einfach so, hä, Null, ok, ich hab ne Idee,"}, {"id": 831, "start": 6449.76, "end": 6479.32, "text": "einfach so, hä, Null, Null eins, es müsste auch gehen, so, ok, start time und jetzt klappt"}, {"id": 832, "start": 6479.32, "end": 6486.12, "text": "das oder was, nein, ja, funktioniert, guckt mal, die Zeit ist vor, vor der aktuellen Zeit,"}, {"id": 833, "start": 6486.12, "end": 6492.56, "text": "dann macht er sie für morgen und die Zeit ist nach der aktuellen Zeit, dann bleibt es"}, {"id": 834, "start": 6492.56, "end": 6499.68, "text": "auf heute, genau, genauso will ich das haben, das ist gut, alles klar, das ist aber mega"}, {"id": 835, "start": 6499.68, "end": 6512.16, "text": "hardcore umständlich, zwar im Ernst, das ist wirklich umständlich an der Stelle, irgendjemand"}, {"id": 836, "start": 6512.16, "end": 6519.6, "text": "fife hat eine Idee, wie das einfacher geht, wenn in der Zwischenzeit eine Zeitumstellung"}, {"id": 837, "start": 6519.6, "end": 6524.0, "text": "ist, dann passiert nichts, weil sich das alles auf meine Now Variable bezieht, die ich einmal"}, {"id": 838, "start": 6524.0, "end": 6546.4, "text": "gesetzt hab, aber es ist schon, also, hm, fällt da irgendjemand was Schlaues ein dazu,"}, {"id": 839, "start": 6546.4, "end": 6554.36, "text": "das muss man irgendwie schöner hinbekommen, ich mein, kann man Dates mal irgendwas, nein,"}, {"id": 840, "start": 6554.36, "end": 6560.56, "text": "das geht auch nicht, aber das sieht bisschen pipiger aus, viele Zeilen können es ja nicht"}, {"id": 841, "start": 6560.56, "end": 6568.32, "text": "sein oder, oder macht Pastebin oder so, ja Pastebin, da steht jetzt Rickrolling drin"}, {"id": 842, "start": 6568.32, "end": 6596.36, "text": "oder so, ok, Vorschlag vom Chat, auf gehts, ok, soweit, wat, äh und wo machst du den"}, {"id": 843, "start": 6596.36, "end": 6614.84, "text": "Unterschied, ob es heute davor ist oder morgen, weil, das macht er selber, ich checks trotzdem"}, {"id": 844, "start": 6614.84, "end": 6640.64, "text": "nicht, ach so, das macht er selber, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 845, "start": 6640.64, "end": 6653.32, "text": "aber es muss ja nicht 0h30 sein, es könnte ja auch irgendwie, 18h sein, gehts dann immer"}, {"id": 846, "start": 6653.32, "end": 6662.32, "text": "noch"}, {"id": 847, "start": 6662.32, "end": 6669.56, "text": "DURATION HOURS okay also das ja das ist ein bisschen kürzer und das ist vielleicht schöner"}, {"id": 848, "start": 6669.56, "end": 6673.86, "text": "zu lesen aber ich checks nicht so gut wie mines wobei mines auch schon nicht gut zu"}, {"id": 849, "start": 6673.86, "end": 6679.52, "text": "checken ist aber ich glaube ich lass jetzt mines erstmal ich mein das versteh ich wenigstens"}, {"id": 850, "start": 6679.52, "end": 6691.8, "text": "noch halbwegs können wir kurz anschauen ist es das karbon video ja ich hab schon auf ich"}, {"id": 851, "start": 6691.8, "end": 6698.52, "text": "hab's ich hab schon auf die flur hammer denn 21 wir machen noch eine viertel stunde wir"}, {"id": 852, "start": 6698.52, "end": 6706.0, "text": "machen auch eine viertel stunde go da gucken uns noch das karbon video an carbon ich verstehe ja"}, {"id": 853, "start": 6706.0, "end": 6715.8, "text": "nicht so genau wann man carbon verwenden soll weil die ganzen spiele programmierer werden"}, {"id": 854, "start": 6715.8, "end": 6724.96, "text": "wahrscheinlich weiter c++ verwenden das ist wahrscheinlich nur wenn man keinen bock auf"}, {"id": 855, "start": 6724.96, "end": 6734.2, "text": "c++ hat aber c++ libraries verwenden muss oder so ja gucken wir gucken wir uns an ok also das"}, {"id": 856, "start": 6734.2, "end": 6738.92, "text": "das das sollte soweit passen ach ja in viertel stunde haben wir noch zeit wir müssen die sache"}, {"id": 857, "start": 6738.92, "end": 6746.32, "text": "noch in utc umwandeln ich glaube das ist in dem fall tatsächlich jetzt relativ easy nao machen"}, {"id": 858, "start": 6746.32, "end": 6753.52, "text": "wir hier mal weg und das machen wir auch oben hin weil das kommt ja später in kommandozeilen"}, {"id": 859, "start": 6753.52, "end": 6767.16, "text": "argumente parsing kommt mal hier weg das ist wirklich pepega aber ok so also starts at start"}, {"id": 860, "start": 6767.16, "end": 6781.36, "text": "time utc in utc so duration habe ich noch nicht kann denn ok mal was anderes kann dann go time"}, {"id": 861, "start": 6781.36, "end": 6789.12, "text": "und duration zusammen rechnen irgendwie wahrscheinlich ok testen wir mal time duration"}, {"id": 862, "start": 6789.12, "end": 6812.36, "text": "das erinnert mich an an rast von gestern wie ok sag mal ich habe ich habe eine duration von 20"}, {"id": 863, "start": 6812.36, "end": 6821.76, "text": "minuten minutes time minutes 20 so kann ich jetzt sagen"}, {"id": 864, "start": 6821.76, "end": 6840.16, "text": "ne da muss ich moment das muss muss ich muss ich hier oben machen end time ist da time at ach das"}, {"id": 865, "start": 6840.16, "end": 6852.04, "text": "geht ok das ist gut dass das funktioniert was ist denn jetzt schon wieder dein problem mensch ach"}, {"id": 866, "start": 6852.04, "end": 6878.32, "text": "moment nee ok einfach so oder was ok end time utc ja das müsste doch jetzt eigentlich funktionieren"}, {"id": 867, "start": 6878.32, "end": 6887.2, "text": "lass mal kurz in den alert manager gucken nix aktiv ja ja ich brauche meinen delete knopf"}, {"id": 868, "start": 6887.2, "end": 6901.76, "text": "ich brauche meinen delete knopf so also utc auto comment comment ist jetzt erst mal egal gut wenn"}, {"id": 869, "start": 6901.76, "end": 6908.44, "text": "ich das jetzt richtig sehe der sollte jetzt eine maintenance setzen oder eine silent setzen für"}, {"id": 870, "start": 6908.44, "end": 6924.88, "text": "morgen 0 uhr 30 also 23 siebter 0 uhr 30 bis 0 uhr 50 wenn das alles funktioniert warum sagt"}, {"id": 871, "start": 6924.88, "end": 6934.32, "text": "er ich soll das nicht machen delete ach so geht das auch das ist dann quasi eine duration time"}, {"id": 872, "start": 6934.32, "end": 6942.48, "text": "minute mal 20 so mies ist die api gar nicht mal muss ich sagen wenn man sich da dran gewöhnt ist"}, {"id": 873, "start": 6942.48, "end": 6950.44, "text": "das naja das hier oben ist schon eklig aber naja ok gucken wir mal also für morgen 0 uhr 30 bis"}, {"id": 874, "start": 6950.44, "end": 6968.32, "text": "0 uhr 50 funktioniert hoffe ich mal panning view ja wir reden ja wir reden ja von utc ja wir reden"}, {"id": 875, "start": 6968.32, "end": 6983.08, "text": "ja wir reden ja von utc ja"}, {"id": 876, "start": 6983.08, "end": 7005.16, "text": "ja doch doch doch doch das ist richtig das ist richtig 22 uhr 30 utc ist 0 uhr 30 bei uns"}, {"id": 877, "start": 7005.16, "end": 7011.64, "text": "zeitzonen abschaffen da bin ich auch dafür zeitzonen sorgen für viel mehr stress als dass"}, {"id": 878, "start": 7011.64, "end": 7016.32, "text": "es irgendwas bringt dann ist es halt bei ein um 20 uhr mittag und ein beim 12 uhr mittag ist"}, {"id": 879, "start": 7016.32, "end": 7023.2, "text": "doch egal man gewöhnt sich dran dass 20 uhr mittag ist besser als sommerzeit winterzeit"}, {"id": 880, "start": 7023.2, "end": 7042.52, "text": "zeitzonen shit ok das war erstaunlich einfach jetzt jetzt hat er die maintenance gesetzt so jetzt"}, {"id": 881, "start": 7042.52, "end": 7050.52, "text": "fehlt uns natürlich noch ach so die id brauchen wir noch von der maintenance ok gibt es so was"}, {"id": 882, "start": 7050.52, "end": 7057.36, "text": "wie dynamic in go so irgendwie so dynamic jason ohne dass ich ein extra objekt zum marsch allen"}, {"id": 883, "start": 7057.36, "end": 7075.4, "text": "und entmarsch allen brauche also sowas wie hier response response response wir zählen"}, {"id": 884, "start": 7075.4, "end": 7086.68, "text": "alles nur noch in unix timestamps ja da bin ich dabei gibt es sowas wie ok go lang scheiß"}, {"id": 885, "start": 7086.68, "end": 7094.52, "text": "jason dynamic dynamic jason in go also ich würde jetzt gerne ehrlich gesagt sowas machen jason"}, {"id": 886, "start": 7094.52, "end": 7105.36, "text": "id aber ich glaube das das geht nicht oder oder kann ich da irgendwelche anonymen structs"}, {"id": 887, "start": 7105.36, "end": 7126.48, "text": "jetzt für verwenden nö anmarschal into dynamic hell wunderbar map string interface jason"}, {"id": 888, "start": 7126.48, "end": 7144.08, "text": "raw message ok ich habe keinen plan was der was der dude da treibt da machen lassen wir"}, {"id": 889, "start": 7144.08, "end": 7151.24, "text": "da jetzt einen typ draus erzeugen und gut ist schwäger wir bekommen als antwort für"}, {"id": 890, "start": 7151.24, "end": 7164.2, "text": "einen post wo steht die response hier"}, {"id": 891, "start": 7164.2, "end": 7175.56, "text": "es type struct ja keine ahnung"}, {"id": 892, "start": 7175.56, "end": 7189.92, "text": "silence response silence id rapper ach keine ahnung silence response heißt das ding jetzt"}, {"id": 893, "start": 7189.92, "end": 7205.36, "text": "gut ist weil ich brauche die id das heißt wenn ich das jetzt richtig im kopf habe jason"}, {"id": 894, "start": 7205.36, "end": 7218.0, "text": "die marschal ne entmarschal oder wie heißt das anmarsch ja meinetwegen so body und jetzt"}, {"id": 895, "start": 7218.0, "end": 7224.6, "text": "sagt man ihm in welchen typ im moment den typ musste man vorher anlegen und da hat er"}, {"id": 896, "start": 7224.6, "end": 7247.72, "text": "chat gesagt das macht man mit war silence oh gott war fuck alle ich weiß nicht bis funktioniert"}, {"id": 897, "start": 7247.72, "end": 7257.12, "text": "jetzt gucken wir uns einfach ab was haben wir hier gemacht so macht man das alles klar"}, {"id": 898, "start": 7257.12, "end": 7263.48, "text": "also dahinter einfach den typ also silence response und dann sagt man ihm hier was war"}, {"id": 899, "start": 7263.48, "end": 7279.12, "text": "das und man muss man dann und machen und api root ok bites ok direkt davon lesen ging anscheinend"}, {"id": 900, "start": 7279.12, "end": 7293.6, "text": "nicht ein bisschen umständlich aber ok"}, {"id": 901, "start": 7293.6, "end": 7309.92, "text": "wobei kann ich nicht einfach sagen bites read read reader new reader irgendwie so less"}, {"id": 902, "start": 7309.92, "end": 7331.32, "text": "body ach fuck was ist das problem"}, {"id": 903, "start": 7331.32, "end": 7354.04, "text": "wirklich muss man das wirklich so so extrem umständlich machen bites so gotte hallo so"}, {"id": 904, "start": 7354.04, "end": 7372.64, "text": "und jetzt ok das ist wirklich krass umständlicher shit so null ist jetzt gut oder schlecht ach"}, {"id": 905, "start": 7372.64, "end": 7380.04, "text": "ne moment ich ich ich ich print hier auch das falsche ich will ja auch das printen tatsächlich"}, {"id": 906, "start": 7380.04, "end": 7395.08, "text": "es funktioniert glaube ich ja funst du musst du response body noch klausen wie geht oh"}, {"id": 907, "start": 7395.08, "end": 7402.12, "text": "der chat sagt es geht auch noch was anderes hier zeigt mal her der chat way wird jetzt"}, {"id": 908, "start": 7402.12, "end": 7415.64, "text": "ausprobiert jason u decoder body die code in moment das muss trotzdem an das muss ich"}, {"id": 909, "start": 7415.64, "end": 7433.4, "text": "trotzdem wahrscheinlich anlegen und da muss kommt jetzt was any so unhandelt error keck"}, {"id": 910, "start": 7433.4, "end": 7450.8, "text": "ok und das funktioniert jetzt tatsächlich das funktioniert ich muss das noch klausen"}, {"id": 911, "start": 7450.8, "end": 7465.56, "text": "die coolen leute in go sagen doch dann so was oder ach so"}, {"id": 912, "start": 7465.56, "end": 7487.44, "text": "cool das müsste klaus heißen dann wüsste man das body klaus gibt das nicht in den reader"}, {"id": 913, "start": 7487.44, "end": 7503.92, "text": "fuck"}, {"id": 914, "start": 7503.92, "end": 7511.2, "text": "also funktioniert das jetzt oder nicht was hat er denn für schmerzen also er ist damit"}, {"id": 915, "start": 7511.2, "end": 7525.16, "text": "nicht einverstanden aber ich werde definitiv nicht das da machen das kann ich euch sagen"}, {"id": 916, "start": 7525.16, "end": 7544.24, "text": "ne ne ne der meckert der meckert darüber wie macht man das richtig ganz ehrlich ich"}, {"id": 917, "start": 7544.24, "end": 7549.12, "text": "muss es nicht klausen weil selbst wenn es memory liegt ist egal das programm läuft"}, {"id": 918, "start": 7549.12, "end": 7554.0, "text": "zwei sekunden dann memory liegt halt solls memory liegen ist mir doch egal das wird geschlossen"}, {"id": 919, "start": 7554.0, "end": 7560.96, "text": "und dann räumt es automatisch auf das wird nicht geklost fertig bleibt so da wird nichts"}, {"id": 920, "start": 7560.96, "end": 7568.08, "text": "geklost ok das funktioniert so dann können wir jetzt die letzten drei minuten noch gucken"}, {"id": 921, "start": 7568.08, "end": 7577.0, "text": "ob wir diese ausgabe hier so schön hinkriegen emoji ausgabe ist definitiv das wichtigste"}, {"id": 922, "start": 7577.0, "end": 7596.08, "text": "überhaupt so das funst schonmal emoji ausgabe so prindeln davor prindeln danach und jetzt"}, {"id": 923, "start": 7596.08, "end": 7607.2, "text": "müssen wir noch diesen ganzen anderen krempel ausgeben also fmt ja wie mache ich ok das"}, {"id": 924, "start": 7607.2, "end": 7612.04, "text": "das können wir doch nicht machen weil hier mache ich jetzt ja gleich farbige konsolen"}, {"id": 925, "start": 7612.04, "end": 7624.56, "text": "ausgabe und sowas aber das können wir machen also fmt prindeln warum gibt es eigentlich"}, {"id": 926, "start": 7624.56, "end": 7634.64, "text": "keine gescheiten interpolate strings und nur dieses format zeug so monitoring silence"}, {"id": 927, "start": 7634.64, "end": 7662.4, "text": "created plus silence eigentlich moment moment leute leute ich habe das allerwichtigste vergessen"}, {"id": 928, "start": 7662.4, "end": 7674.0, "text": "das allerwichtigste was eigentlich heutzutage nirgendswo fehlen darf ja so ist das gut so"}, {"id": 929, "start": 7674.0, "end": 7679.56, "text": "ist das so muss das sein also ohne rakete kannst du das heute nicht mehr machen sie"}, {"id": 930, "start": 7679.56, "end": 7688.92, "text": "ist ja auch am streamtitel heute rakete ist einfach so dass das das summa summa emoji"}, {"id": 931, "start": 7688.92, "end": 7693.6, "text": "was die ganzen coolen leute heute verwenden und vor allem die ganzen krypto bros und"}, {"id": 932, "start": 7693.6, "end": 7697.36, "text": "die ganzen leute die scammen wollen die haben immer alles nur das geilste für dich und"}, {"id": 933, "start": 7697.36, "end": 7710.8, "text": "mit rakete ja wir können so eine halbwegs sinngemäße ausgabe machen ja also sprich"}, {"id": 934, "start": 7710.8, "end": 7718.6, "text": "sagen wir start start ist amt das ganze farbige zeug haben wir hier nicht ok go color terminal"}, {"id": 935, "start": 7718.6, "end": 7740.28, "text": "das go vielleicht selbst plus start time string leute was der unterschied zwischen string"}, {"id": 936, "start": 7740.28, "end": 7759.52, "text": "und go string go string ok kann man das jetzt formatieren ne format und da wieder dieser"}, {"id": 937, "start": 7759.52, "end": 7778.36, "text": "komische layout string meine güte ich will haben ja eigentlich eigentlich will ich das"}, {"id": 938, "start": 7778.36, "end": 7785.72, "text": "gar nicht haben eigentlich will ich will ich da stehen haben startet in so und so viel minuten"}, {"id": 939, "start": 7785.72, "end": 7793.68, "text": "gibt es den go lang humanizer gibt es denn so was go humans ok ja weil mein netprogramm"}, {"id": 940, "start": 7793.68, "end": 7804.32, "text": "gibt aus starts in 4 hours from now oder solche dinger das ist viel praktischer an der stelle"}, {"id": 941, "start": 7804.32, "end": 7814.24, "text": "als einfach eine zeit go humans einfach 3,2 karsternchen also du brauchst glaube ich auf"}, {"id": 942, "start": 7814.24, "end": 7819.12, "text": "github und go oder russ projekt da musst du schreiben written in russ written in go und"}, {"id": 943, "start": 7819.12, "end": 7830.84, "text": "dann kriegst du gar keiner fliegen die sterne time wie formatiert man time times humanize"}, {"id": 944, "start": 7830.84, "end": 7835.56, "text": "time korrekt das probieren wir jetzt mal schnell aus dann gucken wir dann ist Schluss für"}, {"id": 945, "start": 7835.56, "end": 7845.36, "text": "heute dann gucken wir uns noch ein paar videos an wie bindet man das ein github go humanize"}, {"id": 946, "start": 7845.36, "end": 7864.32, "text": "klar sink ja geh fort was jetzt unused import go fuck mich nicht ab please humanize time"}, {"id": 947, "start": 7864.32, "end": 7874.12, "text": "und wie ging das jetzt noch mal time some time instance also sprich wann starten wir"}, {"id": 948, "start": 7874.12, "end": 7887.76, "text": "end time a moment start start nicht end time null start start time start time ok zeige"}, {"id": 949, "start": 7887.76, "end": 7896.68, "text": "ich mal her 2 hours from now genau so will ich das haben probieren noch mal das hatte"}, {"id": 950, "start": 7896.68, "end": 7908.6, "text": "ich doch vorher das das mag er nicht weil weil er weil ich den error nicht händle ja"}, {"id": 951, "start": 7908.6, "end": 7912.84, "text": "ich händel nicht den error den close werfen kann und das ich mein laufen tut es ist ein"}, {"id": 952, "start": 7912.84, "end": 7922.24, "text": "warning hier von von der ide oder was auch immer was trotzdem cringe warnings cringe warnings"}, {"id": 953, "start": 7922.24, "end": 7948.36, "text": "hat das ding vielleicht irgendwelche sinnigen optionen na mir wäre es nämlich lieber der"}, {"id": 954, "start": 7948.36, "end": 7961.68, "text": "würde ausgeben starts in one hour 50 minutes und nicht 2 hours from now gibt es da nicht"}, {"id": 955, "start": 7961.68, "end": 7990.32, "text": "ein paar bessere beispiele für time custom time was will er von mir"}, {"id": 956, "start": 6984.62, "end": 8011.52, "text": "ich bin nicht der einzige das lesen könnte das lesen können das die meisten"}, {"id": 957, "start": 8011.52, "end": 8019.56, "text": "würde ich sagen so schwierig ist das ja nicht ja aber das ist keine gescheite time formatierung"}, {"id": 958, "start": 8019.56, "end": 8027.4, "text": "hat go format human time ich würde schon lieber haben dass da so was steht wie nicht 2 hours"}, {"id": 959, "start": 8027.4, "end": 8050.84, "text": "from now sondern 2 hours from now stimmt ja nicht wirklich ja es sind ja 1 40 from now"}, {"id": 960, "start": 8050.84, "end": 8059.36, "text": "moment startzeit startzeit ja doch 2 hours from now moment meine startzeit sind doch"}, {"id": 961, "start": 8059.36, "end": 8073.8, "text": "nicht 2 hours from now das stimmt doch auch überhaupt nicht guckt mal moment start time"}, {"id": 962, "start": 8073.8, "end": 8084.32, "text": "sind doch keine 2 hours from now das sind das sind 3 stunden 40 das hat auch mit utc"}, {"id": 963, "start": 8084.32, "end": 8110.52, "text": "nix zu tun 3 stunden 40 sind das ja das ist aber nicht in utc und selbst wenn was 42 42"}, {"id": 964, "start": 8110.52, "end": 8119.56, "text": "nicht 3 40 komm ich auf 3 40 42 ok jetzt verstehe ich das ist in 2 stunden 40 und das ding kann"}, {"id": 965, "start": 8119.56, "end": 8127.96, "text": "ja aber das ist doof also also die formatierung finde ich finde ich kacke ja das das sollte"}, {"id": 966, "start": 8127.96, "end": 8145.76, "text": "schon"}, {"id": 967, "start": 8145.76, "end": 8159.36, "text": "ne das ist dumm das sollte schon genauer dastehen ansonsten ich mein ich kanns auch einfach"}, {"id": 968, "start": 8159.36, "end": 8167.36, "text": "wir können auch einfach sagen irgendwie zu duration oder so falls das geht oder kann"}, {"id": 969, "start": 8167.36, "end": 8176.76, "text": "man 2 2 sachen voneinander abziehen kann man kann man in go time now minus geht das"}, {"id": 970, "start": 8176.76, "end": 8206.04, "text": "warte mal kacke oder was ist das sup sup subtract oder so so kacke string moment ist falsch"}, {"id": 971, "start": 8206.04, "end": 8223.92, "text": "rum das ist falsch rum start time sup time now ja und da kommt jetzt was raus ein timespan"}, {"id": 972, "start": 8223.92, "end": 8239.48, "text": "oder was ist denn kacke jetzt überhaupt eine duration ok ja das ist in ordnung format das"}, {"id": 973, "start": 8239.48, "end": 8254.32, "text": "ding hat keine formatmethode oder was minutes ja man ist das beste das beste was ich machen"}, {"id": 974, "start": 8254.32, "end": 8264.52, "text": "kann jetzt kann man das kann man das karsten das ist ja nur mit karsten los nee alter muss"}, {"id": 975, "start": 8264.52, "end": 8279.52, "text": "ich das vorher in karsten oder in string karsten oder was nee was einfach nur strill"}, {"id": 976, "start": 8279.52, "end": 8295.16, "text": "nee wir sind nicht in python kann man nicht auch eine duration passen doch ich glaube"}, {"id": 977, "start": 8295.16, "end": 8310.04, "text": "schon da noch irgendwas geschrieben duration doch irgendwas stand doch da duration nee"}, {"id": 978, "start": 8310.04, "end": 8323.44, "text": "nee kann man nicht add support for duration nee das ist ja was ist eigentlich sein problem"}, {"id": 979, "start": 8323.44, "end": 8337.48, "text": "mir mal doof gefragt ich meine float 64 ja schön und wie kriege ich das jetzt hin muss"}, {"id": 980, "start": 8337.48, "end": 8367.44, "text": "ich jetzt sagen dollar v print f print f format so lull backslash n das ist go land ja da"}, {"id": 981, "start": 8367.44, "end": 8380.56, "text": "das passt so aber naja also naja schön ist was anderes so kann man das rounden irgendwie"}, {"id": 982, "start": 8380.56, "end": 8403.24, "text": "round math round naja ja so ich mein so könnte man damit leben schön ist es nett"}, {"id": 983, "start": 8403.24, "end": 8430.96, "text": "was prozent also muss ich das gar nicht selbst round he doesn't know he lacks critical information"}, {"id": 984, "start": 8430.96, "end": 8447.72, "text": "funktioniert nicht leute ohne so so naja ich will aber null haben geht es auch ja so ist"}, {"id": 985, "start": 8447.72, "end": 8458.48, "text": "gut so ist gut es startet in 153 minuten also ganz im ernst ordentlich formatiert wäre"}, {"id": 986, "start": 8458.48, "end": 8466.48, "text": "mir das lieber das da steht startet in zwei stunden 33 minuten oder so wäre mir irgendwie"}, {"id": 987, "start": 8466.48, "end": 8474.64, "text": "schon deutlich lieber man kann das sicherlich doch doch chat man kann das garantiert von"}, {"id": 988, "start": 8474.64, "end": 8479.88, "text": "hand machen aber ich bevorzuge es da irgendwelche libraries die dann auch ein gewisser bisschen"}, {"id": 989, "start": 8479.88, "end": 8484.32, "text": "fehlerfreier sind als das was ich mir jetzt aus den fingern saugen könnte das ist aber"}, {"id": 990, "start": 8484.32, "end": 8503.52, "text": "enttäuschend ja dass du die times dass die times hier nicht ordentlich formatieren kannst"}, {"id": 991, "start": 8503.52, "end": 8521.24, "text": "das gefällt mir nicht go humanize time wenn die emojis auch in putty angezeigt ich glaube"}, {"id": 992, "start": 8521.24, "end": 8529.04, "text": "nicht dass putty so modern ist dass es den neuesten front renderer von windows verwendet"}, {"id": 993, "start": 8529.04, "end": 8536.92, "text": "also wahrscheinlich eher nicht also das liegt ja daran dass nur die neueren direkt oder"}, {"id": 994, "start": 8536.92, "end": 8548.92, "text": "wie heißt das direkt direkt wie heißt da krempel für die schriftarten"}, {"id": 995, "start": 8548.92, "end": 8560.84, "text": "direkt stream ne windows font render direkt irgendwas mit windows zeug direkt right heißt"}, {"id": 996, "start": 8560.84, "end": 8568.2, "text": "es genau direkt right ja also wenn putty das nicht verwendet führt das schrift rendern"}, {"id": 997, "start": 8568.2, "end": 8573.48, "text": "wovon ich ausgehe dass es das nicht macht dann wird das mit den emojis nicht funktionieren"}, {"id": 998, "start": 8573.48, "end": 8583.64, "text": "powershell kann es standardmäßig auch nicht nichts unter windows kann das standardmäßig"}, {"id": 999, "start": 8583.64, "end": 8594.6, "text": "das einzige was es kann unter windows ist das neue microsoft terminal als geht es mal"}, {"id": 1000, "start": 8594.6, "end": 8609.6, "text": "einst auf chat als könnte das ding hier emojis keckel das glaubt ihr doch selber nicht ja"}, {"id": 1001, "start": 8609.6, "end": 8618.52, "text": "es hat nicht ein emoji wobei ich könnte eigentlich anstatt zu copy pasten einfach windows taste"}, {"id": 1002, "start": 8618.52, "end": 8625.48, "text": "guck hier da ist nichts mit emoji so powershell glaube kann das auch nicht es ist ja der gleiche"}, {"id": 1003, "start": 8625.48, "end": 8633.32, "text": "shit im endeffekt so das einzige was es kann ist das neue windows terminal ach ne da auch"}, {"id": 1004, "start": 8633.32, "end": 8641.16, "text": "nicht da muss man auch in ubuntu oder so starten dass das funktioniert na geil richtige rots"}, {"id": 1005, "start": 8641.16, "end": 8661.56, "text": "weitere grundlinux zu verwenden ok alles klar neue chrome version ist am start leute"}, {"id": 1006, "start": 8661.56, "end": 8665.76, "text": "naja das soll es heute mal gewesen sein mit go lang wir gucken uns jetzt noch das video"}, {"id": 1007, "start": 8665.76, "end": 8677.6, "text": "an mal gucken ob es da irgendetwas gibt es für go garantiert fertige libraries so also"}, {"id": 1008, "start": 8677.6, "end": 8685.6, "text": "das da soll ich mir angucken zeigt mal her go lang das ist das wird im leben nicht c++"}, {"id": 1009, "start": 8685.6, "end": 8689.16, "text": "kann nur von c++ gekillt werden da bin ich überzeugt von"}, {"id": 1010, "start": 8689.16, "end": 8703.76, "text": "na da kann man sich jetzt drüber schreiten ja was gibt es immer noch"}, {"id": 1011, "start": 8703.76, "end": 8709.44, "text": "microsoft javascript type script apple killed objective c with swift jet brains killed java"}, {"id": 1012, "start": 8709.44, "end": 8722.52, "text": "with kotlin and now google is stepping up to the plate for the biggest challenge of all c++ it just"}, {"id": 1013, "start": 8722.52, "end": 8727.76, "text": "is designed to match the performance of c++ with lvlm while being able to interop with existing"}, {"id": 1014, "start": 8727.76, "end": 8733.4, "text": "c++ code bases that's a big deal because c++ is by far the most prolific language when it comes to"}, {"id": 1015, "start": 8733.4, "end": 8740.32, "text": "building high performance low-level systems ja auch die most shit language is 1983 and it's"}, {"id": 1016, "start": 8740.32, "end": 8746.08, "text": "accumulated a lot of technical debt in the process the creator of c++ once said quote within c++"}, {"id": 1017, "start": 8746.08, "end": 8749.96, "text": "there is a much smaller and cleaner language struggling to get out the problem with making"}, {"id": 1018, "start": 8749.96, "end": 8757.28, "text": "c++ das hat er aber schön umschrieben und dadurch dass die klinische language out get it"}, {"id": 1019, "start": 8757.28, "end": 8763.56, "text": "wird immer mehr shit obendrauf gebaut better today is that it's such an important language for so many code bases"}, {"id": 1020, "start": 8763.56, "end": 8767.92, "text": "that it needs to focus more on standardization as opposed to evolving the design to what modern"}, {"id": 1021, "start": 8767.92, "end": 8772.36, "text": "developers want it's really hard to change and establish check now ist es nicht auch in niederländer"}, {"id": 1022, "start": 8775.88, "end": 8777.56, "text": "genauso wie der pyson dude"}, {"id": 1023, "start": 8777.56, "end": 8787.76, "text": "like when python 2 into python 3 the changes weren't that extreme but it's still very painful"}, {"id": 1024, "start": 8787.76, "end": 8793.28, "text": "for anybody wanting to and also all the content on the web and stack overflow becomes stale one"}, {"id": 1025, "start": 8793.28, "end": 8797.56, "text": "could argue it's actually a good thing that c++ doesn't try to change too aggressively carbon"}, {"id": 1026, "start": 8797.56, "end": 8802.68, "text": "is designed to be a successor language for c++ which is no small undertaking but google is no"}, {"id": 1027, "start": 8802.68, "end": 8807.52, "text": "stranger to creating programming languages it gave us go and very well liked in the"}, {"id": 1028, "start": 8807.52, "end": 8811.64, "text": "industry at this point carbon doesn't have a good logo or mascot but i'm sure it will get one"}, {"id": 1029, "start": 8811.64, "end": 8816.04, "text": "eventually you might also be wondering why not just use a modern memory safe language like rut"}, {"id": 1030, "start": 8816.04, "end": 8822.0, "text": "näher ich vermute mal ganz einfach weil die leute c++ libraries verwenden wollen bei google und das"}, {"id": 1031, "start": 8822.0, "end": 8826.92, "text": "dann mit rust halt schwierig wird rust und c++ interop ist halt nicht das einzige was du machen"}, {"id": 1032, "start": 8826.92, "end": 8836.16, "text": "kannst ist ein c++ kram in c interface zu exportieren die wollen wahrscheinlich kein c++ verwenden"}, {"id": 1033, "start": 8836.16, "end": 8845.56, "text": "aber sie wollen c++ libraries verwenden so so stelle ich mir den anwendungszweck von carbon"}, {"id": 1034, "start": 8845.56, "end": 8851.76, "text": "vor erst first of all not all c++ developers actually like rust but more importantly carbon"}, {"id": 1035, "start": 8851.76, "end": 8857.2, "text": "is designed for easy adoption by existing c++ codebases and developers it has bidirectional"}, {"id": 1036, "start": 8857.2, "end": 8862.44, "text": "interoperability with c++ which means you can use existing c++ was last and seamlessly or"}, {"id": 1037, "start": 8862.44, "end": 8866.76, "text": "vice versa now i've only been coding for about 12 years which isn't nearly enough time to learn"}, {"id": 1038, "start": 8866.76, "end": 8871.12, "text": "c++ let's take a look at some code anyway to run carbon at this point you'll need to install"}, {"id": 1039, "start": 8871.12, "end": 8876.36, "text": "google's build tool basil as well as llvm to build it to say hello world we have a main function"}, {"id": 1040, "start": 8876.36, "end": 8881.56, "text": "that uses print with a string literal looks pretty simple but if you've never seen a c++ hello world"}, {"id": 1041, "start": 8881.56, "end": 8885.76, "text": "that uses this character out bullshit then it looks like a revolutionary improvement but a bigger"}, {"id": 1042, "start": 8885.76, "end": 8891.72, "text": "feature is the moment moment despite this vomit so high IQ it was llvm to build it to say hello"}, {"id": 1043, "start": 8891.72, "end": 8895.56, "text": "world we have a main function that uses print with a string literal looks"}, {"id": 1044, "start": 8897.56, "end": 8905.52, "text": "sieht eigentlich irgendwie so aus wie ich mir das vorstelle aber ja wir wissen in c++ geht"}, {"id": 1045, "start": 8905.52, "end": 8913.48, "text": "das so nicht allerdings wenn irgendwann in 15 jahren mal alle compiler die string format api"}, {"id": 1046, "start": 8913.48, "end": 8920.4, "text": "unterstützen dann sieht das auch in c++ ganz brauchbar aus falls es jemals der fall sein wird"}, {"id": 1047, "start": 8920.4, "end": 8926.28, "text": "it's pretty simple but if you've never seen a c++ hello world that uses this character then it looks"}, {"id": 1048, "start": 8926.28, "end": 8931.2, "text": "like it's really revolutionary improvement but a bigger feature is the fact that it supports a"}, {"id": 1049, "start": 8931.2, "end": 8936.16, "text": "modern generic system generics allow you to pass types as parameters to classes and functions a"}, {"id": 1050, "start": 8936.16, "end": 8940.88, "text": "common pattern and statically typed languages but c++ takes a different approach that's often"}, {"id": 1051, "start": 8940.88, "end": 8945.36, "text": "misused and abused called templates carbon still supports templates but generics will provide a"}, {"id": 1052, "start": 8945.36, "end": 8956.24, "text": "bunch of advantages in most situations but moment nur durch das jetzt richtig verstehe du kannst"}, {"id": 1053, "start": 8956.24, "end": 8963.12, "text": "jetzt carbon generics und oder templates verwenden ja das macht ja viel besser"}, {"id": 1054, "start": 8966.76, "end": 8972.16, "text": "ja patrick genau das dachte ich mir auch gerade bunch of advantages in most situations but more"}, {"id": 1055, "start": 8972.16, "end": 8977.56, "text": "importantly carbon looks to improve upon memory safety patterns in c++ you can have uninitialized"}, {"id": 1056, "start": 8977.56, "end": 8981.56, "text": "variables which can sometimes be important for performance but more often than not they just"}, {"id": 1057, "start": 8981.56, "end": 8986.04, "text": "result in bugs and memory access bugs can be very dangerous when hackers learn to exploit that"}, {"id": 1058, "start": 8986.04, "end": 8990.0, "text": "carbon has an entire dock on its safety strategy and basically it tries to be as safe as possible"}, {"id": 1059, "start": 8990.0, "end": 8996.8, "text": "without hurting performance or interoperability with c++ and it also ich ich fehle immer noch"}, {"id": 1060, "start": 8996.8, "end": 9006.68, "text": "ein bisschen so wirklich den den einsatzzweck dazu sehen in different modes like debug performance"}, {"id": 1061, "start": 9006.68, "end": 9010.88, "text": "and hardened depending on how much you want to prioritize them carbon hat ja anscheinend"}, {"id": 1062, "start": 9010.88, "end": 9017.2, "text": "kein zwischenschritt in dem es erst carbon zu c++ übersetzt und dann durch einen compiler deiner"}, {"id": 1063, "start": 9017.2, "end": 9028.42, "text": "wahl kloppt wäre das so könnte man damit wenigstens wenigstens sp 32 programmieren also ja also"}, {"id": 1064, "start": 9028.42, "end": 9032.72, "text": "patrick ich glaube auch nicht dass ich das groß durchsetzt memory safety notably it doesn't use"}, {"id": 1065, "start": 9032.72, "end": 9037.32, "text": "mechanisms like baro checking reference counting or garbage collection like you might find in"}, {"id": 1066, "start": 9037.32, "end": 9042.08, "text": "other languages sounds pretty cool so when can i start using it well at this point it's experimental"}, {"id": 1067, "start": 9042.08, "end": 9046.2, "text": "and it's an extremely ambitious project it'll likely be multiple years before this language"}, {"id": 1068, "start": 9046.2, "end": 9050.16, "text": "is production ready now even though google just implemented a hiring freeze employers"}, {"id": 1069, "start": 9050.16, "end": 9065.2, "text": "are already looking to hire carbon developers you just need to have 10 years of carbon experience"}, {"id": 1070, "start": 9065.2, "end": 9069.44, "text": "to apply this has been the code report thanks for watching and i will see you in the next"}, {"id": 1071, "start": 9069.44, "end": 9077.12, "text": "one ja das ist eindeutig jebait liest mal den rest aws react photoshop ja ja thanks for"}, {"id": 1072, "start": 9077.12, "end": 9080.48, "text": "watching and i will see aber damit der witz der geht immer"}, {"id": 1073, "start": 9080.48, "end": 9095.12, "text": "ja du musst irgendwas programmieren viel anders wird das nicht funktionieren am besten"}, {"id": 1074, "start": 9095.12, "end": 9098.6, "text": "ist natürlich wenn du irgendein ziel oder irgendein anwendungszweck hast warum du das"}, {"id": 1075, "start": 9098.6, "end": 9105.56, "text": "ganze lernst ja manche haben sie wollen irgendwie den spiel programmieren manche wollen einfach"}, {"id": 1076, "start": 9105.56, "end": 9110.64, "text": "nur irgendwie eine ordentliche desktop anwendung machen die ihre bilder organisiert was auch"}, {"id": 1077, "start": 9110.64, "end": 9123.4, "text": "immer vielleicht hast du ja irgendein ziel was du machen willst vielleicht willst du"}, {"id": 1078, "start": 9123.4, "end": 9131.52, "text": "auch die next gen blockchain ai machen ja leute wenn ai porn kommt das wird das riesen"}, {"id": 1079, "start": 9131.52, "end": 9141.24, "text": "business ich sag's euch ai generated porn das lernt was die leute geil finden und dann"}, {"id": 1080, "start": 9141.24, "end": 9154.44, "text": "für personalized porn generator das ist das ist da steckt die kohle drin ich sag's euch"}, {"id": 1081, "start": 9154.44, "end": 9175.4, "text": "ai porn gachi was hyper gachi ich dich ja what ich glaube du musst doch noch ein paar"}, {"id": 1082, "start": 9175.4, "end": 9181.76, "text": "tutorials lesen und vor allem die beispiele machen die in den tutorials drinne stehen"}, {"id": 1083, "start": 9181.76, "end": 9196.16, "text": "das wird safe geben ja man die ansätze sind jetzt ja schon da funktioniert noch nicht"}, {"id": 1084, "start": 9196.16, "end": 9201.92, "text": "so richtig gut aber die ansätze sind da und die nächsten paar jahre wird es das geben"}, {"id": 1085, "start": 9201.92, "end": 9208.0, "text": "ja aber die sind alle nicht so nicht so dolle also ich will nicht behaupten dass ich alle"}, {"id": 1086, "start": 9208.0, "end": 9215.16, "text": "gesehen habe weil die das no relax critical information aber das was ich gesehen habe"}, {"id": 1087, "start": 9215.16, "end": 9224.6, "text": "aus strengen wissenschaftlichen blickpunkt natürlich war jetzt noch nicht so der wahnsinn"}, {"id": 1088, "start": 9224.6, "end": 9231.84, "text": "und das was die dort gemacht haben war ja im endeffekt auch eine fertige porn szene nehmen"}, {"id": 1089, "start": 9231.84, "end": 9242.52, "text": "und dann dort das gesichts swappen im endeffekt also das ist ja nochmal was anderes als sachen"}, {"id": 1090, "start": 9242.52, "end": 9249.76, "text": "komplett generieren aber das wird kommen auf jeden fall sag ich euch das ist so sicher"}, {"id": 1091, "start": 9249.76, "end": 9257.6, "text": "wie das arme in der kirche dass sowas gibt ja judo mir hat gute kurse je nachdem welche"}, {"id": 1092, "start": 9257.6, "end": 9266.68, "text": "programmier sprache du machst ja gut keine ahnung also dass der satz war jetzt bescheuert"}, {"id": 1093, "start": 9266.68, "end": 9272.68, "text": "also welche programmier sprache willst du denn lernen ansonsten ich gehe davon aus"}, {"id": 1094, "start": 9272.68, "end": 9279.04, "text": "dass es für die meisten auf judo mir ganz gut ganz gute kurse gibt wie installierst"}, {"id": 1095, "start": 9279.04, "end": 9290.24, "text": "du auf linux eine tage z-datei ist jetzt ist jetzt gerade jebait im chat ansonsten"}, {"id": 1096, "start": 9290.24, "end": 9297.12, "text": "ist es ganz einfach tage z entpacken ist das easieste auf der welt zeigte wie das geht"}, {"id": 1097, "start": 9297.12, "end": 9320.4, "text": "da xfz v blub punkt da punkt jetzt hat so sieht es aus und dann jetzt"}, {"id": 1098, "start": 8320.06, "end": 9350.76, "text": "da kann ich mir merken extrakt den rest auch nicht aber die beste seite"}, {"id": 1099, "start": 9350.76, "end": 9375.04, "text": "bestes seite geht nicht für alles aber für das wichtigste hallo leute hier ist der max"}, {"id": 1100, "start": 9375.04, "end": 9380.12, "text": "und jetzt ist es wirklich passiert 96 tage nach dem upload von meinem video über wenn"}, {"id": 1101, "start": 9380.12, "end": 9385.08, "text": "aus elf dachte sich der geht einfach mein eigenes video an ja das muss ich jetzt mal"}, {"id": 1102, "start": 9385.08, "end": 9398.44, "text": "dick keck wait ach das hatte ich auch wegen gedriggerten linux fans vorher ok also also"}, {"id": 1103, "start": 9398.44, "end": 9408.0, "text": "vergesst sie und vergesst sie plus plus zum einstieg wenn du unter windows hauptsächlich"}, {"id": 1104, "start": 9408.0, "end": 9413.8, "text": "unterwegs bist vergesst auch erst mal linux versuche nicht fünf sachen gleichzeitig zu"}, {"id": 1105, "start": 9413.8, "end": 9418.08, "text": "lernen und sie und sie plus plus ist zum einstieg auch das schlechteste was man nehmen kann"}, {"id": 1106, "start": 9418.08, "end": 9425.04, "text": "meiner meiner meiner ich weiß gibt leute die sehen das anders aber ich sehe das so sucht"}, {"id": 1107, "start": 9425.04, "end": 9438.56, "text": "es die schaap oder pausen aus beides gute einsteigerprogramm ihr sprachen ja aber nicht"}, {"id": 1108, "start": 9438.56, "end": 9444.36, "text": "zum einstieg naja du könntest die beispiele machen die dort bei den tutorials dabei sind"}, {"id": 1109, "start": 9444.36, "end": 9451.4, "text": "ich weiß nicht ob die ob die dort irgendwelche übungsprojekte haben ansonsten musste halt"}, {"id": 1110, "start": 9451.4, "end": 9458.32, "text": "ein bisschen das nachbauen was sie in den tutorials lernst also rein tutorials machen"}, {"id": 1111, "start": 9458.32, "end": 9464.76, "text": "ohne ein bisschen zu üben ist kacke ich mache es ja auch meistens so ich lese immer relativ"}, {"id": 1112, "start": 9464.76, "end": 9471.12, "text": "viel tutorials oder guckt mir relativ viele talks oder tutorial videos an zu einem thema"}, {"id": 1113, "start": 9471.12, "end": 9475.8, "text": "und ich fange erst dann an und dann gucke ich die einzel punkte nach so nachdem ich"}, {"id": 1114, "start": 9475.8, "end": 9479.62, "text": "einen groben überblick habe aber du kannst nicht ein komplettes programmierbuch quasi"}, {"id": 1115, "start": 9479.62, "end": 9483.68, "text": "durchlesen von anfang bis ende und dann erst anfangen also müsstest du musst schon mal"}, {"id": 1116, "start": 9483.68, "end": 9488.44, "text": "so nach ein paar themen immer was kleines machen und dir das mal angucken weil du hast"}, {"id": 1117, "start": 9488.44, "end": 9493.04, "text": "ja da gerade wenn du was neu lernst hast ja alles drinne ja von basic datenstrukturen"}, {"id": 1118, "start": 9493.04, "end": 9499.8, "text": "bis kommando zeilen anwendung bis alles das springt dann sehr hin und her also ich würde"}, {"id": 1119, "start": 9499.8, "end": 9504.34, "text": "immer mal zwischendurch schon so ein paar kleine übungs anwendungen machen muss ja"}, {"id": 1120, "start": 9504.34, "end": 9528.92, "text": "nichts grosses sein kannst du archlinux empfehlen ja beste arch by the way wir wissen ja woran"}, {"id": 1121, "start": 9528.92, "end": 9541.04, "text": "man einen archlinux user erkennt er wird es dir erzählen"}, {"id": 1122, "start": 9541.04, "end": 9548.56, "text": "ich habe noch nie coaching gemacht und nachdem ich mir vorstellen könnte das dauert ein"}, {"id": 1123, "start": 9548.56, "end": 9555.0, "text": "bisschen müsste ich dafür wahrscheinlich zu viel geld verlangen als dass ich das lohnen"}, {"id": 1124, "start": 9555.0, "end": 9562.76, "text": "würde für dich nee dann ganz ehrlich gerade der einstieg den kriegt man wunderbar mit"}, {"id": 1125, "start": 9562.76, "end": 9572.28, "text": "kursen und übungs- und kleinen übungsprojekten hin wenn du brauchst die tutorials wenn du"}, {"id": 1126, "start": 9572.28, "end": 9575.88, "text": "gar keine ahnung hast dann weißt du nämlich noch gar nicht an was zu suchen sollst ja"}, {"id": 1127, "start": 9575.88, "end": 9580.24, "text": "wenn du eine programmiersprache schon kannst und lernst jetzt eine andere dann weißt du"}, {"id": 1128, "start": 9580.24, "end": 9583.44, "text": "nach was du googeln musst ja habt ihr heute gesehen ich habe laufend nach irgendwas gegoogelt"}, {"id": 1129, "start": 9583.44, "end": 9588.64, "text": "wie das mit go funktioniert aber schon weil ich wusste wie das heißt was ich suche wenn"}, {"id": 1130, "start": 9588.64, "end": 9592.4, "text": "du gar keine ahnung hast weißt du nicht an was du googeln willst da was du googeln musst"}, {"id": 1131, "start": 9592.4, "end": 9601.68, "text": "also nee du musst also ein bisschen tutorials und sei froh dass es video kurse sind früher"}, {"id": 1132, "start": 9601.68, "end": 9606.28, "text": "hast du die bücher geholt ja aber du musst ab und zu mal schon ein paar kleine übungs"}, {"id": 1133, "start": 9606.28, "end": 9611.72, "text": "sachen machen das wird nicht anders funktionieren muss dir halt irgendwelche simplen projekte"}, {"id": 1134, "start": 9611.72, "end": 9619.32, "text": "raussuchen irgendwas was überschaubar ist es gibt sehr viele videos dazu so zehn projekte"}, {"id": 1135, "start": 9619.32, "end": 9624.44, "text": "für einsteiger oder einsteiger projekte empfehlungs sachen da gibt es da gibt es was ja von"}, {"id": 1136, "start": 9624.44, "end": 9628.72, "text": "kleinen kommando zeilen anwendungen manche basteln irgendwelche taschenrechner wobei"}, {"id": 1137, "start": 9628.72, "end": 9632.84, "text": "ich sagen muss taschenrechner können ultra komplex sein aber die easy varianten davon"}, {"id": 1138, "start": 9632.84, "end": 9643.4, "text": "nicht oder irgendwas was dateien sortiert du kannst beispielsweise mal ein bubble sort"}, {"id": 1139, "start": 9643.4, "end": 9649.96, "text": "von hand machen so so so kleinigkeiten aber da gibt es viele blog posts und videos mit"}, {"id": 1140, "start": 9649.96, "end": 9662.8, "text": "einsteiger programmierideen ja embeddelt da würde ich auch immer also wenn ich"}, {"id": 1141, "start": 9662.8, "end": 9666.96, "text": "die auswahl habe zwischen c plus plus und c dann würde ich wahrscheinlich weiter so"}, {"id": 1142, "start": 9666.96, "end": 9672.6, "text": "machen wie ich mit arduino mache ich mach c plus plus in c also ich mach zum größten"}, {"id": 1143, "start": 9672.6, "end": 9677.68, "text": "teil c aber mit ein bisschen c plus plus weil mich spätestens wenn wenn wenn ich irgendwo"}, {"id": 1144, "start": 9677.68, "end": 9685.84, "text": "sehe standard mk shared pointer bla bla bla dann ist bei mir schon zu viel c plus plus"}, {"id": 1145, "start": 9685.84, "end": 9695.52, "text": "drinne ja das wird mir rein mit pyson schwierig er hätte mit javascript anfangen müssen"}, {"id": 1146, "start": 9695.52, "end": 9705.4, "text": "weil mit pyson hast du dann plus plus tk was halt naja finde ich nicht nicht der rede"}, {"id": 1147, "start": 9705.4, "end": 9711.0, "text": "wert ist und definitiv auch nicht gelernt werden muss vielleicht könnte man eine kleine"}, {"id": 1148, "start": 9711.0, "end": 9714.52, "text": "webanwendung machen aber dann bräuchte man schon wieder javascript ntml fürs frontend"}, {"id": 1149, "start": 9714.52, "end": 9728.04, "text": "und pyson fürs backend wie du dich am besten darauf vorbereiten kannst dich mal ein bisschen"}, {"id": 1150, "start": 9728.04, "end": 9733.72, "text": "über die laden schlau machen in denen du hinkommst was die dort machen letztendlich"}, {"id": 1151, "start": 9733.72, "end": 9738.56, "text": "du musst du musst nicht programmieren großartig lernen bevor du deine ausbildung anfängst"}, {"id": 1152, "start": 9738.56, "end": 9743.88, "text": "die ausbildung ist dafür da dir was beizubringen was du machen musst ist du musst interesse"}, {"id": 1153, "start": 9743.88, "end": 9750.32, "text": "und eigeninitiative in der ausbildung haben aber dann hast du direkt vor ort leute die"}, {"id": 1154, "start": 9750.32, "end": 9754.6, "text": "du fragen kannst und projekte die du machen musst dann ist es nicht so nach dem motto"}, {"id": 1155, "start": 9754.6, "end": 9758.48, "text": "ich lese den tutorial und weiß nicht was ich damit anfangen soll wenn du das machst"}, {"id": 1156, "start": 9758.48, "end": 9765.36, "text": "kommt dein chef zu dir und sagt hier guck mal wir haben in den script was sich auf 20"}, {"id": 1157, "start": 9765.36, "end": 9771.36, "text": "servan einloggt und dort ein paket hinkopiert ja blödes beispiel das macht man wahrscheinlich"}, {"id": 1158, "start": 9771.36, "end": 9775.0, "text": "heute nicht mehr mit einem mit einem script aber nur als beispiel und dann sagt er zu"}, {"id": 1159, "start": 9775.0, "end": 9780.4, "text": "die hier nimm dir das mal und baum einen parameter ein wo man den fad eingeben kann wohin das"}, {"id": 1160, "start": 9780.4, "end": 9785.56, "text": "kopiert wird so und dann hast du auch schon ein ziel was du machen musst dann weißt du"}, {"id": 1161, "start": 9785.56, "end": 9789.64, "text": "auch ungefähr wonach du nachgucken musst und dann hast du auch wen du nur fragen kannst"}, {"id": 1162, "start": 9789.64, "end": 9799.72, "text": "ja ne also da würde ich mir jetzt nicht so viel gedanken zu machen im vorfeld ne das"}, {"id": 1163, "start": 9799.72, "end": 9806.68, "text": "ist auf jeden fall nichts für den anfang binary tree inverten muss man auch nicht zum"}, {"id": 1164, "start": 9806.68, "end": 9816.0, "text": "anfang ne wie gesagt das erstens habe ich keine großartigen pies eine ahnung und zweitens"}, {"id": 1165, "start": 9816.0, "end": 9820.04, "text": "wäre das zu teuer und ich habe es auch noch nie gemacht ich habe da erstens kein bock"}, {"id": 1166, "start": 9820.04, "end": 9823.72, "text": "drauf und zweitens dauert es zu lange und wäre deswegen in kombination mit kein bock"}, {"id": 1167, "start": 9823.72, "end": 9838.0, "text": "drauf wie das viel zu teuer ist ja ich weiß aber dann musste zwei frameworks nebeneinander"}, {"id": 1168, "start": 9838.0, "end": 9858.08, "text": "lernen das ist auch nix wo denn du hast überhaupt keine frage chain lore fels jam ich hab das"}, {"id": 1169, "start": 9858.08, "end": 9872.68, "text": "schon gesehen das ist wieder ein klassischer das ist überhaupt"}, {"id": 1170, "start": 9872.68, "end": 9884.8, "text": "nicht das ist nicht deine frage das ist dein tibet versuch microsoft access das ist das"}, {"id": 1171, "start": 9884.8, "end": 9894.2, "text": "was du brauchst um dich in windows einzuloggen deswegen heißt es ja auch access ohne access"}, {"id": 1172, "start": 9894.2, "end": 9898.52, "text": "kannst du dich nicht in windows einloggen das heißt nachdem du jetzt eingeloggt bist"}, {"id": 1173, "start": 9898.52, "end": 9911.92, "text": "und im twitch chat schreibst hast du auch access naja ich muss den tibeter tibeten was"}, {"id": 1174, "start": 9911.92, "end": 9925.56, "text": "bleibt mir denn alles übrig ok chat"}, {"id": 1175, "start": 9925.56, "end": 9942.48, "text": "hast du feste streamzeiten nicht wirklich nee kannst du mir aber follow und dann siehst"}, {"id": 1176, "start": 9942.48, "end": 9953.2, "text": "und kriegste nachricht wenn ich online gehe was ist die bessere alternative zu access"}, {"id": 1177, "start": 9953.2, "end": 9959.04, "text": "diese art der anwendung sind komplett überflüssig und braucht kein mensch wenn du eine anwendung"}, {"id": 1178, "start": 9959.04, "end": 9962.48, "text": "hast die eine datenbank braucht die nicht übers netzwerk oder sonst wie dann nimmst"}, {"id": 1179, "start": 9962.48, "end": 9967.28, "text": "der sq light wenn du eine web anwendung hast wo ein bisschen mehr brummt wo du im zweifelsfall"}, {"id": 1180, "start": 9967.28, "end": 9974.92, "text": "auch die datenbank auf eine extra kiste machen willst nimmst du postgres fertig und wenn"}, {"id": 1181, "start": 9974.92, "end": 9980.84, "text": "du dann ganz spezielle anforderungen hast kannst du mal so was wie wie mongo db redis"}, {"id": 1182, "start": 9980.84, "end": 9986.56, "text": "kasandra was nicht alles gibt influx db und sowas nachdenken aber nur wenn du ganz spezielle"}, {"id": 1183, "start": 9986.56, "end": 9993.48, "text": "sachen machen willst wo postgres nicht nix nix taugt ja ansonsten für einfache sachen"}, {"id": 1184, "start": 9993.48, "end": 10012.36, "text": "sq light uninstall anderes fällt mir da nicht mehr ein wir haben auch auf irgendeinem ibm"}, {"id": 1185, "start": 10012.36, "end": 10022.32, "text": "mainframe haben wir noch db 2 und unsere mainframe entwickler die kommen sich für die krassesten"}, {"id": 1186, "start": 10022.32, "end": 10030.24, "text": "giga chats vor ist echt so wenn du da vorbeigehst die denken echt sie sind die krassesten heckermans"}, {"id": 1187, "start": 10030.24, "end": 10042.16, "text": "auf der welt dann haben sie so eine hässliche fadenkreuz konsole ibm mainframe terminal"}, {"id": 1188, "start": 10042.16, "end": 10054.58, "text": "hier guck so ein terminal ist das mit so einem fadenkreuz drauf wo man was anklickt ganz"}, {"id": 1189, "start": 10054.58, "end": 10062.6, "text": "ganz pains champion das sieht das sieht auch aus wie 1990 nur dass du sowas halt mittlerweile"}, {"id": 1190, "start": 10062.6, "end": 10073.92, "text": "auf dem desktop hast aber wenn ich sowas schon sehe weißt du was ich machen kann wenn einstiegspunkt"}, {"id": 1191, "start": 10073.92, "end": 10080.5, "text": "im eckfall nicht dann verwendest du weder pisen noch sie schab sucht ihr eine sprache"}, {"id": 1192, "start": 10080.5, "end": 10085.68, "text": "raus und fangen mit der an kannst du nicht ernsthaft sie schab pisen und c plus plus"}, {"id": 1193, "start": 10085.68, "end": 10093.96, "text": "gleichzeitig lernen wollte das kann doch nicht dein ernst sein nimm pisen oder nimm sie schab"}, {"id": 1194, "start": 10093.96, "end": 10103.52, "text": "den rest vergesst lass bleiben zum einstieg wir haben auch linux drauf da kannst ja so"}, {"id": 1195, "start": 10103.52, "end": 10110.64, "text": "minimal vms laufen lassen da haben wir auch linux drauf eigentlich c c und c plus plus"}, {"id": 1196, "start": 10110.64, "end": 10123.08, "text": "sind zum einstieg müll verschlüsselungstool für daten unter linux ja normalerweise hätte"}, {"id": 1197, "start": 10123.08, "end": 10137.28, "text": "ich gesagt einfach ich sag immer das falsche nfs oder e-crypt fs ich kann mir immer nicht"}, {"id": 1198, "start": 10137.28, "end": 10144.12, "text": "merken welches das aktuelle ist was man verwenden soll nee nee du willst du willst nicht vera"}, {"id": 1199, "start": 10144.12, "end": 10149.88, "text": "krypten sowas du möchtest ja dateien sinken vermute ich mal ja du möchtest dateien ver"}, {"id": 1200, "start": 10149.88, "end": 10154.4, "text": "du möchtest auf datal so wie ich das verstehe möchtest du auf datal ebene verschlüsseln"}, {"id": 1201, "start": 10154.4, "end": 10160.76, "text": "so dass du sinken kannst weil du sagst auf mehreren rechnern du willst e-crypt fs oder"}, {"id": 1202, "start": 10160.76, "end": 10167.16, "text": "eng fs und ich bin mit nein nein nein nicht lux du willst was was du sinken kannst so"}, {"id": 1203, "start": 10167.16, "end": 10171.16, "text": "wie ich das verstehe du willst e-crypt fs oder eng fs ich kann mir nicht merken was"}, {"id": 1204, "start": 10171.16, "end": 10179.2, "text": "davon das aktuelle ist macht beides ungefähr das gleiche verschlüsselt auf dateiebene"}, {"id": 1205, "start": 10179.2, "end": 10187.84, "text": "datainamen bleiben erhalten je nachdem wie man es einstellt aber es wird nicht ein großer"}, {"id": 1206, "start": 10187.84, "end": 10193.96, "text": "blob draus gemacht sondern da teilweise verschlüsselt das ist das was du haben willst ja du willst"}, {"id": 1207, "start": 10193.96, "end": 10206.28, "text": "e-crypt fs oder eng fs du musst gucken was davon das aktuelle ist ja in der berufsschule"}, {"id": 1208, "start": 10206.28, "end": 10210.96, "text": "oder im betrieb im betrieb kann dir das keiner sagen im betrieb könnte es auch genauso gut"}, {"id": 1209, "start": 10210.96, "end": 10217.64, "text": "java sein deswegen sag ich ja du musst da weil dich schlau machen bei deinem betrieb"}, {"id": 1210, "start": 10217.64, "end": 10223.48, "text": "was der denn hauptsächlich verwendet berufsschule ja du kannst dir den wenn du glück hast kannst"}, {"id": 1211, "start": 10223.48, "end": 10227.8, "text": "dir den plan von einer berufsschule online angucken ansonsten würde ich sagen wahrscheinlich"}, {"id": 1212, "start": 10227.8, "end": 10233.8, "text": "eher c sharp mittlerweile früher haben sie viel c gemacht aber die ganzen boomerlehrer"}, {"id": 1213, "start": 10233.8, "end": 10243.72, "text": "mit c sind mittlerweile weg also wahrscheinlich eher c sharp aber um die berufsschule macht"}, {"id": 1214, "start": 10243.72, "end": 10263.56, "text": "ihr keine gedanken nicht n-crypt fs eng fs meine ich also die berufsschule musst du"}, {"id": 1215, "start": 10263.56, "end": 10268.44, "text": "dir keine gedanken machen die berufsschule hat absolut unterirdisches niveau ihr werdet"}, {"id": 1216, "start": 10268.44, "end": 10287.16, "text": "nach drei jahren immer noch bei print print lese eine zahlein sein das berufsschule kannst"}, {"id": 1217, "start": 10287.16, "end": 10301.08, "text": "du vergessen"}, {"id": 1218, "start": 10301.08, "end": 10331.0, "text": "dann ist die scharpe zahlein ausgestorben"}, {"id": 1219, "start": 10331.0, "end": 10357.24, "text": "ja außer in china in china nicht die die chinesen die stehen unglaublich auf java guckt mal"}, {"id": 1220, "start": 10357.24, "end": 10364.8, "text": "ich kann ich euch zeigen gucken wir uns mal die github trends an nicht today sagen wir"}, {"id": 1221, "start": 10364.8, "end": 10375.76, "text": "mal sagen wir mal week und jetzt gucken wir mal nach china chinesen repo wieso beileid"}, {"id": 1222, "start": 10375.76, "end": 10385.84, "text": "der c ist ok aber c++ ist so der größte abfakt den ich kenne guck hier erstes china chinesen"}, {"id": 1223, "start": 10385.84, "end": 10401.0, "text": "ding und es ist in keine ahnung es ist in gar nichts ok"}, {"id": 1224, "start": 10401.0, "end": 10408.28, "text": "nächstes python ok alles klar c++ ja ok es sieht jetzt so aus als habe ich miss erzählt"}, {"id": 1225, "start": 10408.28, "end": 10421.6, "text": "aber es ist so die chinesen verwenden saumäßig viel java java tatsächlich also diese diese"}, {"id": 1226, "start": 10421.6, "end": 10440.44, "text": "woche keine trending china chinesen repos dabei wim trendet da guck an aber wie gesagt"}, {"id": 1227, "start": 10440.44, "end": 10461.56, "text": "die chinesen stehen total auf auf java auf java wie es die coolen leute sagen"}, {"id": 1228, "start": 10461.56, "end": 10471.68, "text": "auch zu können ist sicherlich nicht verkehrt also das einzige was ich mit c++ mache ist"}, {"id": 1229, "start": 10471.68, "end": 10477.28, "text": "es sei denn der chat zwingt mich in irgendeiner art und weise dazu also in letzter zeit haben"}, {"id": 1230, "start": 10477.28, "end": 10484.56, "text": "wir c++ web assembly gemacht mit ffm pack das war tatsächlich relativ cool und da hat"}, {"id": 1231, "start": 10484.56, "end": 10491.04, "text": "mich c++ auch nicht so stark genervt für microcontroller graben nervt mich c++ immer richtig"}, {"id": 1232, "start": 10491.04, "end": 10498.08, "text": "gerade wenn man anfängt modernes c++ machen zu wollen ist einfach nur ätzend an vielen"}, {"id": 1233, "start": 10498.08, "end": 10509.2, "text": "stellen nicht dass nicht gute sachen dabei werden aber vieles ist einfach so unglaublich"}, {"id": 1234, "start": 10509.2, "end": 10516.76, "text": "umständlich gemacht die ganze daytime ap in c++ also da sind die zeilen sind immer"}, {"id": 1235, "start": 10516.76, "end": 10523.16, "text": "300 zeichen lang nach rechts bis du dann irgendwie mal millisekunden zu sekunden umgewandelt"}, {"id": 1236, "start": 10523.16, "end": 10533.24, "text": "hast und so was außerdem dauert es wahrscheinlich noch 15 jahre bis alle compiler so neue sachen"}, {"id": 1237, "start": 10533.24, "end": 10540.92, "text": "wie die format api können und so was ich glaube es werde ich in nächster zeit nicht"}, {"id": 1238, "start": 10540.92, "end": 10551.56, "text": "machen nee nee du kannst du kannst prime suppen wenn du willst oder suppen wenn du willst"}, {"id": 1239, "start": 10551.56, "end": 10568.68, "text": "ansonsten kannst du einfach auch nur da sein wie viel ram zieht dein browser ich glaube"}, {"id": 1240, "start": 10568.68, "end": 10597.52, "text": "16 gigabyte nee nix alter zieht der nix der zielt insgesamt 1,4 g nix nix ist hier angesagt"}, {"id": 1241, "start": 10597.52, "end": 10609.28, "text": "guck mal hier der langweilt sich jetzt hat er sogar noch speicher freigegeben der langweilt"}, {"id": 1242, "start": 10609.28, "end": 10620.12, "text": "sich komplett ja das stimmt ok das verstehe ich das leuchtet ein dann dann kann ich nachvollziehen"}, {"id": 1243, "start": 10620.12, "end": 10626.44, "text": "in unreal kommste halt nicht drumherum habe ich keine ahnung von ich weiß nur du kannst"}, {"id": 1244, "start": 10626.44, "end": 10632.52, "text": "entweder unreal c++ machen oder du brauchst drei monate bis du das gleiche in blueprints"}, {"id": 1245, "start": 10632.52, "end": 10636.64, "text": "zusammen geklickt hast was du auch runter programmieren könntest in einem halben tag"}, {"id": 1246, "start": 10636.64, "end": 10654.36, "text": "geht er nee nee glaube nicht dass der geht ich habe den ewig nicht verwendet nee nee"}, {"id": 1247, "start": 10654.36, "end": 10666.8, "text": "gibt keine spenden ist brauche ich auch nicht so blödsinn das lasst bleiben keck w hd ok"}, {"id": 1248, "start": 10666.8, "end": 10679.2, "text": "leute bei einer bank in frankfurt ihr könnt bitts spenden ich weiß nicht wie viel von"}, {"id": 1249, "start": 10679.2, "end": 10699.84, "text": "bitts ankommen was ist der share bei bitts"}, {"id": 1250, "start": 10699.84, "end": 10711.4, "text": "und sender bitts alles müll ich bin 15 die hohen rakete dankeschön für den sub"}, {"id": 1251, "start": 10711.4, "end": 10736.24, "text": "ich bin nicht 15 massive eine milliarde bitts ich bin 38 bin richtig hardcore boomer"}, {"id": 1252, "start": 10736.24, "end": 10741.36, "text": "ihr müsst nicht spenden ich habe genug geld bin froh wenn ihr am start seid es reicht"}, {"id": 1253, "start": 10741.36, "end": 10765.72, "text": "schon man kann natürlich nie genug haben ich beschwer mich auch nicht achso stimmt überhaupt"}, {"id": 1254, "start": 10765.72, "end": 10771.6, "text": "nicht ich bin 37 aber ich jetzt war aber kein schibet nee nee ich hatte noch kein geburtstag"}, {"id": 1255, "start": 10771.6, "end": 10780.96, "text": "37 37 37 bin ich noch ja ich mache noch vier tage woche ist das beste was du machen kannst"}, {"id": 1256, "start": 10780.96, "end": 10790.68, "text": "das beste was du machen kannst wenn du mit deiner kohle auskommst meistens machen es"}, {"id": 1257, "start": 10790.68, "end": 10800.0, "text": "da 20 prozent mehr oder weniger auch nicht fett wenn du mit deiner kohle auskommst dann"}, {"id": 1258, "start": 10800.0, "end": 10807.6, "text": "mach vier tage woche oder noch weniger mach so viel dass du gut mit deiner kohle auskommst"}, {"id": 1259, "start": 10807.6, "end": 10813.52, "text": "was machst du die restlichen tage naja youtube und stream zum beispiel und sachen die man"}, {"id": 1260, "start": 10813.52, "end": 10823.76, "text": "so machen muss aber jene muss man das rückwärts lesen in ja nee dankeschön für den primes"}, {"id": 1261, "start": 10823.76, "end": 10840.2, "text": "ab ok also also folgendes ich verpasst nichts jaja reicht überhaupt kein überhaupt kein"}, {"id": 1262, "start": 10840.2, "end": 10848.52, "text": "ding ich meine ich verdiene mit twitch und youtube auch noch was also leider nicht so"}, {"id": 1263, "start": 10848.52, "end": 10852.2, "text": "modern wie man das jetzt bräuchte weil ich mir damals nicht so viel gedanken darüber"}, {"id": 1264, "start": 10852.2, "end": 10858.64, "text": "gemacht habe ich habe zwei klimaanlagen im schlafzimmer und im arbeitszimmer heizungs"}, {"id": 1265, "start": 10858.64, "end": 10866.44, "text": "heizung ist ne gasheizung im keller die auch warmwasser macht was ziemlich monak s ist"}, {"id": 1266, "start": 10866.44, "end": 10885.76, "text": "aktuell vom preis her aber was willst du machen ja ist so omega 0 gas putin gefällt das bestimmt"}, {"id": 1267, "start": 10885.76, "end": 10915.72, "text": "das ist ja quasi so was ja ich hab ich hab heute witziger weise überlegt ob"}, {"id": 1268, "start": 10915.72, "end": 10928.4, "text": "das nicht sinnvoll wäre noch im wohnzimmer oben und im schlafzimmer unten eine klimaanlage"}, {"id": 1269, "start": 10928.4, "end": 10932.84, "text": "einzubauen beziehungsweise die erweitern zu lassen zu meinem außengerät da müsste halt"}, {"id": 1270, "start": 10932.84, "end": 10940.08, "text": "nen rohr hier bei mir durchs arbeitszimmer aber das müsste eigentlich gehen zu irgendwie"}, {"id": 1271, "start": 10940.08, "end": 10948.44, "text": "an der wand oder so wie auf talks tut ja gibt aktuell nichts leute wisst ihr was ich gerade"}, {"id": 1272, "start": 10948.44, "end": 10954.52, "text": "spiele mega nice game also wahrscheinlich nicht für den mainstream das da habe ich"}, {"id": 1273, "start": 10954.52, "end": 10975.52, "text": "jetzt ein paar stunden gespielt gestern richtig nice ich weiß nicht ob das mainstream ist"}, {"id": 1274, "start": 10975.52, "end": 10985.92, "text": "keine ahnung ich glaube den meisten leuten jetzt wird das nicht so gut gefallen das ist"}, {"id": 1275, "start": 10985.92, "end": 11003.92, "text": "das ist cool echt spielt das jeder ja weil katze wahrscheinlich ja"}, {"id": 1276, "start": 11003.92, "end": 11008.96, "text": "es ist aber auch was besonderes also dass es gibt kein anderes spiel dieser art also"}, {"id": 1277, "start": 11008.96, "end": 11017.6, "text": "es gibt so adventure games mit so ein bisschen item sammeln und und abliefern also ein bisschen"}, {"id": 1278, "start": 11017.6, "end": 11023.64, "text": "rätsel ultra light gibt es ja viele aber dass du halt eine katze bist ist halt das gibt es"}, {"id": 1279, "start": 11023.64, "end": 11047.76, "text": "sonst nicht das ist 2014 mal schon ein competitive ups war ein competitive game gezockt ja ich"}, {"id": 1280, "start": 11047.76, "end": 11055.04, "text": "bin der krasseste one on one sniper in modern warfare 2 one on one rust aber nur mit quick"}, {"id": 1281, "start": 11055.04, "end": 11059.76, "text": "scopes also hardscopes kann ich überhaupt nicht ab hardscopes ist wirklich für die"}, {"id": 1282, "start": 11059.76, "end": 11066.76, "text": "richtigen kack noobs quickscope only und aber auch so dass man das scope nicht sieht also"}, {"id": 1283, "start": 11066.76, "end": 11071.96, "text": "ihr wisst ja ein richtiger quickscope ist wenn du in das scope gehst hittest bevor du"}, {"id": 1284, "start": 11071.96, "end": 11078.04, "text": "das fadenkreuz siehst nur so alle anderen rules sind für noobs dann spiele ich nicht"}, {"id": 1285, "start": 11078.04, "end": 11094.04, "text": "gegen euch one on one ansonsten kommt one on one rust easy bis jetzt nicht bis jetzt"}, {"id": 1286, "start": 11094.04, "end": 11098.04, "text": "wurde nicht mal beantwortet ob die katze er oder sie ist ist für das spiel auch total"}, {"id": 1287, "start": 11098.04, "end": 11112.24, "text": "uninteressant kennt jemand der gos und steckdosen flaschen aus zwecks flaschen was also wir"}, {"id": 1288, "start": 11112.24, "end": 11115.24, "text": "haben ja schon gos und steckdosen geflasht aber die aktuellen kann man nicht mehr über"}, {"id": 1289, "start": 11115.24, "end": 11133.04, "text": "die flaschen deswegen ist das nicht so tolle richtig eben klar weil den lol die leute so"}, {"id": 1290, "start": 11133.04, "end": 11138.12, "text": "nett sind und das überhaupt nicht verschwitzt oder toxic ist das ist ein bisschen wie ach"}, {"id": 1291, "start": 11138.12, "end": 11146.08, "text": "ja tatsächlich habe tatsächlich schon competitive spiele gespielt ich habe overwatch gespielt"}, {"id": 1292, "start": 11146.08, "end": 11153.76, "text": "sogar esl turniere und wir haben sogar gewonnen teilweise stellt euch das mal vor wir waren"}, {"id": 1293, "start": 11153.76, "end": 11158.8, "text": "glaube ich was war der beste weekly unser bester weekly platz war glaube ich vierter"}, {"id": 1294, "start": 11158.8, "end": 11162.96, "text": "und deutsches deutsches weekly haben wir sogar ein paar mal gewonnen nicht dass das jetzt"}, {"id": 1295, "start": 11162.96, "end": 11171.36, "text": "super krass oder so gewesen wäre aber immerhin ja wir waren gar nicht schlecht am anfangen"}, {"id": 1296, "start": 11171.36, "end": 11190.64, "text": "von dem game also einer aus meinem ehemaligen overwatch team ist schweizer und ist tatsächlich"}, {"id": 1297, "start": 11190.64, "end": 11199.6, "text": "einer der wenigen schweizer pro gamer die ich kenne geworden und gut der erx hat es"}, {"id": 1298, "start": 11199.6, "end": 11206.8, "text": "auch probiert aber ich glaube das ist auch zu alt schau mal guck nicht zu keck weh glaubt"}, {"id": 1299, "start": 11206.8, "end": 11211.48, "text": "es ist auch abgehakt und von den anderen weiß ich nicht was da draus geworden ist"}, {"id": 1300, "start": 11211.48, "end": 11225.16, "text": "ja ich habe zs go gespielt aber nie somit mit leib und seele und komplett ich meine"}, {"id": 1301, "start": 11225.16, "end": 11231.88, "text": "ich habe am ende wie viel ich habe 200 stunden in cs das ist ja nix 200 stunden in cs da"}, {"id": 1302, "start": 11231.88, "end": 11250.44, "text": "kecken dich ja alle aus dass 200 stunden in cs ist quasi sowie fünf stunden in kot ja"}, {"id": 1303, "start": 11250.44, "end": 11280.32, "text": "ich bin auch weg leute ich gehe jetzt pennen bad good time ja chain law ordentlich gibt"}, {"id": 1304, "start": 11280.32, "end": 11288.32, "text": "welche die gehen in die zehntausende mittlerweile schon 2014 waren tausend stunden gut das jetzt"}, {"id": 1305, "start": 11288.32, "end": 11312.2, "text": "auch outdated overrated gebetet alles klar leute wir sehen uns bis denn zu"}]}