{"text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, bis dahin, tschüss, tschüss, tschüss, tschüss. Sag mal Phipps, du kämpfst auch den ganzen Tag im Channel, oder? Im Channel Chat. Du bist immer am Start. Es ist jetzt nicht so, dass ich mich darüber beschweren will oder so, aber es fällt schon auf. Wine Sirius Max. Chat, noch irgendjemand von heute morgen den Browser-Tab offen gehabt und sich jetzt gewundert, warum auf einmal der Max wieder schwätzt im Hintergrund? Dafür bist du während dem Streaming aktiv? Ja. View-Time, wichtig. Einfach im Hintergrund laufen lassen, wobei ich weiß nicht, ob View-Time irgendwie Twitch richtig ist. Richtig ist. Ja, kann ich mir vorstellen. Ich muss mich mehr hydraten, Leute. Hydrated stayen muss ich. Was ist denn die deutsche Variante? Hydriert? Was heißt denn das? Hydriert? Sagt auch kein Mensch. Bewässert? Befeuchtet? Was ist die deutsche Variante? Das erinnert mich immer wieder an meinen Englisch-Lehrer, der auf Deutsch anstatt Subscription hat er gesagt, subscribieren. Das war eines der wirklich misshandelsten Wörter, die ich je gehört habe. Subscribieren, Alter. Ich weiß nicht, dem ist wahrscheinlich auch nicht das deutsche Wort dazu eingefallen. Aber gut, der war auch ein Jahr vor Rente und ist dann gleich wieder abgehauen danach. Der hat uns ein Jahr ertragen müssen und danach war er weg für immer. Benetzen. Ich muss mal kurz meinen Streamchat refreshen auf der anderen Seite. Die Chatnachrichten kommen ultra verzögert an gerade. Ich muss das mal kurz selbst testen. Achtung. Keck. Ja doch, jetzt kommt es gleichzeitig. Du kannst nur subtrahieren. Ja deine CPU kann auch nicht mal das. Deine CPU kann addieren und subtrahiert damit. Und noch schlimmer, die multipliziert sogar damit und definiert dadurch. Die kann eigentlich nur plus rechnen. Aber mit Overflow, das ist der Trick dabei. 5-Sec-Delay, ich hatte 20-30 Sekunden Unterschied. Hier die letzte Nachricht von Fips, die kam, weiß nicht ob man hier irgendwie die Message, kann ich das hier einschalten? FFZ Control Center, Timestamps oder so. Ich muss mal das dumme E-Mode weg machen, der Bayer. Timestamps. Timestamps. Wie macht man Timestamps an? Ich schwaße es nicht. Timestamps. Ja, hier 18.37 Uhr kam die Message und drüben kam die Message 18.39 Uhr. Nee. 18.37 Uhr, also war eine Minute zwischen den Messages Unterschied. Ne, 17.37 Uhr und da drüben kam sie angeblich auch um 17.37 Uhr. Hä? Das ergibt keinen Sinn, das kam eindeutig später. Man weiß es nicht. Aber mache ich das mal wieder aus, das irritiert hier. Ich kann den Chat? Ne, ich lasse das so oder? Eins größer können wir machen, da könnt ihr es vielleicht einfacher lesen. So, Timestamps füllen die Messages aus. So, also, nachdem wir uns jetzt hier mit den Randerscheinungen und, Alter, der Max Power ging heute Morgen ab, ne, auseinandergesetzt haben, ich zeige euch mal kurz, was wir gestern gemacht haben und dann wo wir heute dran weiter basteln. Ja, hast du das Remake? Hast du das Alarmstufe Rot und Einser Remake oder hast du irgendwas anderes? Es gibt ja genug, die man mittlerweile mit Fan-Patches sogar in 16.9, 4K, sonst was spielt. Alarmstufe Rot gibt es einen 4K-Patch. Oder zumindest in 16.9 High-Res-Patch. Das ist ziemlich nice. Man weiß es. Ja, mal zur Erinnerung, um was es eigentlich geht. Ich habe mir bei Amazon ein Dymo Label Writer 450 gekauft. Noch ohne DRM, so ein Teil hier. Und das Problem damit ist, soll ich euch mal die offizielle Windows-Software zeigen? Ich zeige euch mal, wie painst-champig diese Windows-Software ist. Wobei, so schlimm ist die eigentlich gar nicht. Aber ich will keine, nee, ich zeige, nee doch, nee, die ist eklig, die braucht Admin-Rechte zum installieren, was auch immer. Die zeige ich euch nicht. Ich zeige euch Screenshots davon, ich installiere die nicht. Die sieht schon etwas deplatziert. Hier sieht man ein Video davon. Die sieht schon etwas deplatziert aus, diese Software. So als hätten die, keine Ahnung, war auch immer mit einem Microsoft-Account, keine Ahnung. Also, die sieht schon ziemlich painst-champig aus. So, aber so viele Features will ich nicht haben. Die Sache ist die, guck mal, die können auch Barcodes und QR-Codes inserten. Kann ich auch, kein Ding. Nee, die kann auch nicht viel mehr, als das, was ich gebaut habe. Keg. Die Musik ist ein bisschen laut. Immer noch. Mach mal eins weiter und mal gucken. Ja, das ist okay. Ähm, ja. Und das Problem an diesem Label-Drucker ist, dass die neueren Versionen von Dymo, das ist jetzt unabhängig von dem Drucker, die haben DRM in ihrem Etiketten drinnen. Nämlich, die neueren Drucker von Dymo fressen nur Original-Etiketten, weil die irgendeinen Kopierschutz in Form von einem RFID-Chip im Band drinnen haben. Was auch immer sich die dabei gedacht haben, keine Ahnung. Aber ich hab zum Glück noch einen Drucker, der hat keinen DRM. Aber eine Sache, die mich halt daran stört, ist, du kannst das Ding halt nicht gescheit über das Netzwerk bedienen. Die iOS-App ist mega beschissen. Guckt euch das mal an. Das ist legit die schlecht bewertetste iOS-App, die ich je gesehen hab. Also das musste er erst mal schaffen. 1,3 Sterne. Und die Bewertungen sind nun wirklich absoluter Bodensatz, ist die App. Ja. Android ist auch nicht viel besser. Die haben sich's redlich verdient. 1,8 Sterne und beim anderen 1,3 Sterne. Also die, die Mobile-App ist Müll. Zumal du die Mobile-App gar nicht so einfach verwenden kannst. So. Und was ich mir jetzt gedacht hab, ist folgendes. Ich will weder den Treiber installieren, noch die App. Brother Label Drucker. Sag mal ein. Sag mal ein. Brother Label QL700. 152 Euro. Ok, das ist ungefähr kleiner als das, was ich mir gedacht hab. Brother Label Drucker. Sag mal ein. Sag mal ein. Brother Label QL700. 152 Euro. Ok, das ist ungefähr gleiche Preisklasse. Sieht ähnlich aus. Was ist denn der Unterschied zwischen QL und DT? Schauen wir mal kurz. Business-Drucker, Mobil-Drucker, Etikettendrucker, Industrie-Etiketten. Was muss ich denn da jetzt suchen? Farbetikettendrucker, Desktop-Etikettendrucker. Zu was? QL. Thermo-Direct. Na ja. Haben die ordentliche Linux-Driver? GitHub. Schauen wir mal. Python gibt es. Eine Python-Library. Python-Package. Aha. Hat das ein Web-Interface? Guck mal, die haben ein Web-Interface gebaut. Ja. So kann man das auch machen. Find ich tatsächlich ganz gute Idee. Letztendlich funktioniert das Frontend, was ich baue, aber für mehr oder weniger alle Drucker dieser Art. Solange es Linux-Driver gibt. Haben die ordentliche Linux-Driver? Krupps. Anscheinend. Der Stefan blockt es. Okay, nice. Nice, wenn der Stefan das blockt. Okay, wahrscheinlich kein großer Akt. Na gut. Letztendlich ist es auch egal. Das funktioniert mit allen solchen Druckern. Bloodsnake. Danke für den Sub. Hab ich gar nicht gesehen. Nicht geguckt. So, zumindest den Drucker haben wir ausprobiert letztens im Stream. Haben gecheckt, wie man den unter Linux installiert. Das sah dann so aus. Ja. Guckt. So sah das dann aus. Haben wir gedruckt auf einem sehr aufgeräumten Basteltisch. Benutzst du eine US-Tastatur? Nee. Da. Da hat es gedruckt. Texte einfügen ist noch nicht ready. Aber gleich. So, und was wir gestern gemacht haben ist folgendes. Wir haben einen Web-Editor gebaut für Etiketten. Weil ich schon immer mal ein bisschen Grafikzeuge in JavaScript machen wollte. Ja, guck. Da kannst du zum Beispiel QR-Codes inserten. In dein Etikett. Oder Material-Design-Icons inserten in dein Etikett. Ich versuche automatisch zu tracken und droppen. Lul. Und heute machen wir noch Text. Achso. Und das Wichtigste habe ich ja ganz vergessen euch zu zeigen. KeckW, FFZ. Und man kann Bilder Copy-Pasten. Copy-Image. Bam. Was macht der Kreis? Der ist da. Der ist da, weil das das Test-Shape ist, mit dem ich getestet habe, wie die Library so grob funktioniert um was zu malen. Der hat keinen Sinn, dass der Kreis da ist. Wir bräuchten im Hintergrund eigentlich noch was, was anzeigt, wie groß das Etikett, was ausgewählt wurde, wirklich ist. Eigentlich bräuchten wir hier noch irgendeinen Dropdown. Oh, das Auf- und Schließen geht nicht, Leute. Lul. Warum ist das Auf- und Schließen kaputt? Irgendwas haben wir kaputt gemacht, ja. Keck. Das Auf- und Schließen geht nicht mehr. Ja, eigentlich müssen wir hier oben noch irgendwie ein Selection machen, welche Label. Wobei, das können wir eigentlich hier machen. Da machen wir hier so ein Menü mit irgendeinem Settings-Icon. Ist die Fläche nicht eins zu eins? Nee, aktuell ist die Fläche so groß wie mein Monitor. Eins zu eins können wir aber auch schlecht machen, weil die Labels sind zum Beispiel 86 x 89 Millimeter. Das wäre quasi so. Das ist ein bisschen klein. Aber was wir machen können, ist was, was quasi die gleiche Aspect Ratio hat, ungefähr, wie das Label. Aber halt auf die Größe vom Bildschirm. Und dann mache ich hier, deshalb habe ich mir zumindest gedacht, da machen wir hier so ein Get-Wrecked-Tangle, ein Rechteck hin, wo man sieht, wo das anfängt und wo das aufhört. Aber heute müssen wir uns erstmal darum kümmern. Guck mal, wie viele QR-Codes ich hier eingefügt habe. Erstmal darum kümmern, dass wir noch ein bisschen mehr malen können. Vor allem, dass wir ordentlich Text einfügen können. Aktuell können wir keinen Text einfügen. Wir können bloß QR-Codes einfügen, was ziemlich sinnlos ist. Ja, also Text einfügen müssen wir auf jeden Fall machen. Und wir müssen das auch ein bisschen modularisieren, also das hier muss in eine eigene Component, dass ich das hier als Menü verwenden kann und nicht quasi ein Menü brauche pro Button und sowas. Das ist eklig. Ach ja, und das eine Sache, das machen wir zuerst. Ich muss mal kurz gucken, wie wir das hier gemacht haben. Insert, QR-Code, Insert, Show Icon Browser. Warum geht denn das denn auf und zu? Show Icon Browser. Ich habe keine Ahnung, was ich da mache, aber... Normalerweise sollte... Ah, ich heide das nicht mehr. Moment. Icon Browser, Class, Hidden, wenn nicht Icon Browser geschaut werden soll. So, und ihr stellt fest, es ist laggy. Es ist richtig laggy. Guckt mal, ich zeige euch das mal kurz, wann ich klicke. Habt ihr den Klick gehört? Also sprich, wenn ich klicke, geht es zu, geht es schnell, aber wenn ich klicke zum Aufmachen, das laggt eine Sekunde. Und das liegt daran, weil der 6.800 Icons oder so hier reinrendert. Das ist ein bisschen viel. So, minimal, minimal viel. Aber eine Sache haben wir schon relativ gut gemacht, gestern. Das hier sind SVGs, also sprich, das kannst du skalieren, wie du willst. Und es bleibt immer... Ähnlich, ähnlich groß. Sagt man, wie kriege ich denn den Rand weg? Ihr habt doch, ihr habt doch da sicherlich Plan von. Insert Icon. Legt das, legt das am Viewport? Wie kriege ich den Rand hier drum herum weg? Ist das der Viewport bei einem SVG? Hat es Welt, kein Virtual Scrolling. Als Zusatzpaket schon, ja, das werden wir wahrscheinlich auch verwenden. Ist das hier, was ist denn, wenn ich das auf 0-0 stelle, ist dann der Rand weg? Nee, dann wird es gar nicht angezeigt, okay. Ähm, ach, das liegt hier, Breite Höhe daran, legt das, glaube ich. Das ist ein bisschen davon abhängig. Ja, das liegt an der Breite Höhe, die ich hier, also wenn ich jetzt zum Beispiel, keine Ahnung, 200 mache, dann ist wahrscheinlich, weil er das skaliert... Ja, gut, der muss das immer skalieren. Ach, was weiß ich, ich lasse es jetzt einfach mal auf 100, 100. Zumindest, das ist das erste, was wir machen müssen. Und ich glaube, eine Sache machen wir vorher noch, weil ich glaube, das ist ziemlich einfach. Die Sache ist nämlich, der Drucker, der kann ja nur schwarz-weiß. Und wenn ich Bilder einfüge, die sind in Farbe. Das sieht vielleicht cooler aus, entspricht aber nicht so wirklich der Repräsentation, so wie das dann im Etikett aussieht. Das heißt, wenn ich das Bild einfüge, mache ich noch irgendeinen Cray-Scale-Filter drüber. Ich glaube, das ist ziemlich einfach, das habe ich nämlich schon auf den ihrer Seite gesehen. Guck mal, wo füge ich denn das Image ein? Da. Insert QR-Code, nee. Handle-Paste, da füge ich das Image ein. From-Url-Image, so, dass wir sowas machen können wie Image-Cray-Scale oder sowas. Honva-Cray-Scale. Das muss man auch denen mal wirklich lassen. Die haben ziemlich nice Dokus, also, die verlassen sich nicht darauf, dass ihr Code sich selbst dokumentiert. Es ist richtig gut, du findest dir für fast alles was. So, und man muss einfach sagen, Filter-Cray-Scale und das war's. Also, das heißt, von der Idee her, wenn ich das jetzt richtig mache, sage ich ihm, Image-Cache-Image-Filter-Cray-Scale. So, und das sollte jetzt das einzige sein, was ich machen muss. Wenn ich jetzt CACW-Copy-Paste, ist es schwarz-weiß. Oh, das ist gar nichts mehr. Oder ich hab's kaputt gemacht. Hä? Hab ich das Image dann richtig kopiert? Ah, ich hab das Image dann richtig kopiert. Jetzt ist es grau, okay. Guck, jetzt konvertiert er das in ein schwarz-weißes CACW. Was auch viel besser ist. Das entspricht viel eher dem, wie man das beim Drucker dann auch am Ende sieht. Black and white CACW. So, gut. Was hab ich gesagt? Ach so, das Gelegge machen wir als nächstes, dass das hier so laggy ist. So, dann hab ich was gefunden auf Shithub, nämlich githubs-welt-virtual-list. Macht das File-Browser-Icon schon etwas? Das File-Browser-Icon fügt einen QR-Code ein, das ist Schwachsinn. Nee, das macht noch nichts. Also, du brauchst den File-Browser auch nur am Rande, weil du kannst ja Copy-Paste-Images machen. Aber File-Browser mach ich dann in Pop-Up oder so, wo du Datei öffnen, uploaden machen kannst. Also nicht uploaden, sondern Browser öffnen machen kannst. Das sollte relativ easy werden. Jetzt kümmern wir uns erstmal darum, dass das hier nicht mehr so laggy ist. Weil das ist ja nicht wirklich bedienbar. So, was ich da gefunden hab, ist sowas hier. Guck mal. Svelte-Virtual-List. Und von der Idee her ist das relativ easy. Du installierst das, importierst das, legst eine Liste an und dann sagst du ihm, wie er die Items rendern soll. Und dann checkt er, welches Item ist sichtbar hier im Scroll Viewport und welches nicht. Und er lädt das dann nur rein, wenn es sichtbar ist. Das sollte es deutlich schneller machen. Aber ist das Cray-Scale nicht falsch, weil der Drucker keine Graustufen kann? Doch, der Drucker kann, glaube ich, Graustufen. QR-Code-Scan. Warum? Ich will kein QR-Code-Scan, ich will QR-Code-Generieren. Das funktioniert jetzt schon, den QR-Code-Generieren. Hier, guck mal. Natürlich auch ohne, nur mit Beispieltext. Scannen, warum willst du QR-Code-Scan? Also das mit Cray-Scale kann der Drucker, würde ich jetzt mal sagen, weil es sah zumindest so aus. Guckt euch mal die Beispiele an, die ich hier ausgedruckt habe. Naja. So, das habe ich ausgedruckt. Guck, das sieht schon nach Cray-Scale aus, das grüne hier vom Frosch. Ich meine, der trickst natürlich ein bisschen und lässt weiß vom Etikett und sowas. Also das sieht schon Cray-Scale aus. Aber nur so nach 3-4 unterschiedlichen Stufen, ja wahrscheinlich, aber was soll ich machen? Es muss erstmal so bleiben. Es sieht auf jeden Fall realistischer aus als in Farbe. So, aber jetzt müssen wir erstmal machen, dass es nicht mehr so leckt. Also installieren wir jetzt virtualist. NPM install. Leute, kann man das einfach so hinschreiben oder muss ich das quoteen, wenn da Ads und sonstige Sachen davor sind? Ich quote das mal lieber. Was? Hab ich das gerade richtig gesehen? Bild Android 64? Habt ihr das auch gerade gelesen, dass da was von Android 64 stand? Ich will es gar nicht genau wissen. Hauptsache es funktioniert, es ist mir egal, ob es für Android ist. Ja, aber Skript ist ja nicht plattformspezifisch auf der Ebene. So, virtualist und jetzt fügen wir hier eine Liste ein. Ach, du meinst das Icon QR-Code-Scan. Warte mal, können wir uns ja mal vergleichen. Hier Material-Icons. QR-Code. Also das haben wir und du würdest das verwenden? Hm, ich weiß nicht. Wir scannen ja nicht. Wahrscheinlich ist am besten das hier QR-Code plus, weil wir fügen den QR-Code hinzu. Das können wir übrigens an der Stelle auch mal machen. Aktuell habe ich das ja noch hier embedded, die Icons. Aber wir haben ja eine MDI-Library drinne. Also eigentlich kann ich an der Stelle sagen, eigentlich kann ich an der Stelle sagen, so das ist QR-Code, kann ich sagen Icons QR-Code. Ich weiß nicht. Nee. Oder auch nicht. Okay. Warum nicht? Das mache ich doch hier auch so. Icons, Icon. Keine Ahnung. Vielleicht mal kurz anzeigen lassen. Icons. Morgen KS. Das war vielleicht keine so gute Idee. Icons hier rein zu hauen. Ja, Lock. Wir müssen das unbedingt ein bisschen modularisieren, das ist zu viel. Was? Modular. Ach nee. Das ist, das ist wirklich sehr abartig gemacht, wie ich das ja hier. MDI. Wo sind dann, wo sind dann die QR-Codes Leute hier? QR, QR. Wo ist es denn? Kann man da nichts nicht geschaffen? Alter 6000 der Icons, man. MDI QR-Code vielleicht, ja. Tatsächlich, wahrscheinlich. Kannst du das Icon nicht als Objekt in der Hand nehmen? Tatsächlich, wahrscheinlich. Kannst du das Icon nicht als Objekt importieren? Doch. Für die Verwendung hier unten wäre das tatsächlich sinnvoller. Aber für das, was ich hier mache, nämlich 6000 Icons on the fly generieren, kann ich sie nicht einzeln importieren. Also ich könnte quasi die Icons, die ich brauche in irgendeine Icon-Component rappen oder so. Das wäre vielleicht MDI QR-Code. No. Ähm, wie suche ich denn da drinnen jetzt gescheiter? Weißt du was? Ich mach jetzt, ich mach jetzt die Noob-Variante. Boah. Boah. So. Oder Log. Da sind wir doch. Also QR-Code. QR? QR? Hier. MDI QR-Code. Was ist denn das für eine wirre Schreibweise? MDI QR-Code. What the f... Bin ich jetzt zu... Ach so. Moment. Das ist nicht Console-Log, Leute. Ich bin heute nicht richtig bei der Sache. Ja, das sieht gut aus. Also MDI QR-Code. Das müsste meine extra Icon-Component rappen oder so. Das ist dann schöner. Aber dafür tut es jetzt erstmal. Da haben wir es wieder. QR-Code und das andere ist QR-Code Scan. Leute, was findet ihr besser? Das da oder das da? Oder QR-Code Plus haben wir auch noch zu bieten. Ich bin ja für das normale QR-Code, ehrlich gesagt. Oder das mit dem Plus. Plus, weil wir adden ja. Weil wir adden ja. Da ist was mit dem Plus vielleicht gar nicht verkehrt. Weißt was? Ich ersetz den Kram hier auch gerade nochmal. Ach, scheiß drauf. Das machen wir eh als Icon-Component später. Das ist ja abartig so. Das kann man überhaupt nicht richtig verwenden. Okay. Also, wo sind wir denn stehen geblieben? Was ist denn jetzt die eigentliche Geschichte, die ich machen wollte? Das ist nicht so leckt. Guckt euch das mal an. Das ist echt nicht normal. Dann gehen wir an die Stelle, wo ich die Icons rendere. Hier render ich die Icons. Von der Idee her müsste das so aussehen. Items filtert Icons. Item gleich, wie möchte ich das? Es heißt Icon. Ist schon nicht verkehrt. So, und anstatt ein Each zu machen, rendern wir jetzt mal das Diff da rein. Und mal gucken, wie das dann ausschaut, ob das funktioniert. Nö. Warum nicht? Wo ist das Problem? Aber es geht schnell auf. Aus welchen Gründen funktioniert das jetzt nicht? Wie wäre es, dass man die Label speichern kann? Ja, ja, das muss ich auf jeden Fall noch machen. Warum lädt er nicht zumindest das Icon jetzt? Das verstehe ich nicht. Moment. Icon. Der macht gar nichts hier, oder? Sekunde Leute. Der macht gar nichts? Warum nicht? Warum funktioniert der Krempel nicht? Show Icon. So machen wir das standardmäßig mal true, dass ich das nicht immer wieder einplanten muss. Warum macht der hier nichts? Filtert Icons. Filtert Icons sollte doch eigentlich ein Array sein. Hä? Wait a minute. Warum geht das jetzt? Hä? Ah, weil ich keine Breite habe. Moment, Moment, Moment. Das ergibt keinen Sinn. Das ist in irgendeinem Grid. Moment. Wartet mal. Nee, nee. Das, das, das, ähm. Wartet mal. Das, das, das, das ergibt so keinen Sinn. So. Okay. Alla ja, schon besser. Ja, ja. Das war in irgendeinem Grid, was jetzt mit. Nee, nee. Das kann so nicht funktionieren. Okay. Also. Guckt mal. Es laggt null. Schaut mal hier. Bam, bam. Ups. Falscher Knopf. Ja. Ihr hört es ja im Hintergrund klicken. Also das geht wirklich instant auf und zu. Ja. Nice. Doch das sind alle Elemente. Das sind alle Elemente. Jetzt geht das Scrollen da drin nicht mehr, Leute. Doch, jetzt. Guck mal. Wenn ich Bild hoch, Bild runter scrolle. Ich habe volle Pulle. Wenn ich habe Scrollen. Also das ist schon einiges, was da drinne ist. So. Jetzt würden wir natürlich noch schauen, dass das ordentlich verteilt wird, weil so sieht das ja ziemlich beschissen aus. Also. Icon Name kommt schon immer weg. Das brauchen wir nicht. Das brauchen wir dann zum Durchsuchen. Also. Twitter zum Beispiel. Guck mal. Das Filtern ist jetzt auch viel schneller. Seht ihr das? Twitter. Zack. Ist jetzt viel, viel zackiger jetzt alles. Jetzt müssen wir das natürlich bloß noch als. Äh. Grid wieder machen. Allerdings als Grid pro Zeile. Glaub ich. Am simpel. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja Was hat er denn für schmerzen? Wenn ich da jetzt ein diff drum mache wo ist denn das problem? Ah keine höhe ok. Aber selbst wenn ich selbst wenn ich da ok aber selbst wenn ich da jetzt ein diff rum mache und sag flex dann funktioniert das ja nicht weil der macht ja ein list item quasi pro oder ein diff der muss ja scrollen also ohne scrollen wird das nicht funktionieren svelte hier svelte virtual list row das wird das das funktioniert nicht komm mal hier virtual list row virtual list container style padding da kann ich überhaupt nix dran machen gibt es sowas svelte virtual grid x ne infinite meinst du das was nein reddit gehste weg ich weiß nicht ob uns das was bringt weil ich will ich will ja kein infinite scroll haben ja das hier ist infinite scroll das ist abartig das will ich nicht ich weiß ja genau wie viele items das sind ich will das nicht dynamisch nachladen bis bis zum geht nicht mehr das darf von Anfang an soll das soll das richtig voll die größe also ich habe eine idee wie wir das machen also in flexbox fällt mir als nächstes gescheites ein und ganz ehrlich ich glaube auch dass es mit flexbox nicht gescheit geht weil der das scrollen ja braucht dass der überhaupt erkennt kann ich hier disable disable scroll machen dass er überhaupt erkennt wann was in view ist und wo nicht wir können mal bei denen auf der seite kurz schauen ob wir style custom styles irgendwie machen können oder so item halt start end ne das kann man nicht sonderlich gut style wie ich kann auch nicht mal wenn ich kann auch nicht mal meine meine scrollbar auspländen na das ist na das ist aber fail ich will meine scrollbar auspländen disable scrollbar will ich machen naja das schauen wir uns dann gleich an also ich glaube aber dass ich einfach anstatt anstatt dass wir hier was außen rum machen müsste doch von der idee her nur mal so ich müsste doch eigentlich anstatt ist so dass noch mal moment ne das funk jetzt jetzt weiß ich warum das scheiß nicht funktioniert ich habe hier nur ein item guckt mal leute ich habe nur ein item pro durchlauf und das ist natürlich mist ein item pro durchlauf vielleicht kann ich doch in den crit packen ne dann rennt er da nix mehr wenn ichs in den crit packe noch mal die höhe vielleicht machen ne das änderts das änderts nicht ich muss ich muss das irgendwie segmentieren also ich muss jetzt quasi sagen also nur von der idee keine ahnung wie das funktioniert irgendwie so viel chunk chunker ein großer chunker genau ein chunk so inszener häppchen will ich das haben so in der richtung müsste ich das machen und dann könnte ich das rendern aber wie macht man denn array chunk in javascript ist sowas eingebaut schon array chunk chunked array genau stack overflow split array into chunks auf gehts ne ne ich will ein neues array haben was das macht gibts da was eingebautes mittlerweile vielleicht alter what the hell das ist ja richtig massive five hand zeug moment stack overflow antwort wir copy paste und stack overflow heute wieder das da na gut wisst ihr was wir sind wir sind äußerst stack overflow driven chunk sehr schön also probier mal das mal aus ob das jetzt funktioniert also items packen in 10er blocks so und jetzt noch mal ne schleife drum github copilot das müsste man echt ausprobieren wahrscheinlich hätte github copilot auch für mich gemacht ja das ist richtig so und jetzt kriegen wir hier allerdings ist das nicht ikon sondern ja ikons aber ikons ist schon ist schon besetzt und filtert ikons ist auch schon besetzt dann heißt es jetzt einfach chunk ich weiß nicht wie es anders sein soll so sind da jetzt sind da jetzt alle items drinne zeig mal kurz wo ist das problem jaja gehen wir fort hier mal kurz break drunter warum warum macht er das jetzt nicht untereinander klasse keine ahnung margin 5 ahja ok also 10 stück 10 stück pro zeile das ergibt doch sinn das das das passt doch also nochmal wo war mal hier stehen geblieben ihr ikons ergibt das sinn was ich mache ietsch und da jetzt eine schleife drum funsta funst das moment moment würde das so funktionieren ietsch so und da drinne das da jetzt mal für jedes ikon im chunk so nee moment und da jetzt noch ein grid drum oder dann müsste doch funktionieren ich bin ich bin verwirrt und da jetzt ein grid drum und dann gehts oder oder nicht chat beim easy alles klar mal gucken ob das jetzt irgendwie skaliert oder so ich meine es macht ich meine es macht space dazwischen es gibt schlimmeres das ist bestimmt best practice ja garantiert ist das best practice was ich hier mache ich mache ja prinzipiell nur best practice also was solls denn anderes sein außer best practice das kann ich guckt mal seht ihr wie schnell das jetzt auf und zu geht richtig prog ja huge geschwindigkeit massive speed alter kann das vielleicht was ist denn wenn ich hier die höhe und die breite rausnehme was macht dann dann boah eskaliert leute seht ihr das wtf ah aber hier ist er hier ist er hier ist er nicht schlau genug hier ist er nicht schlau genug das nachzuladen seht ihr das hier ist er nicht schlau genug das da nachzuladen aber ich glaube damit kann ich erstmal leben nee immer 10 pro zeile passt doch eigentlich ist doch ok tatsächlich funst wie kriege ich denn diese hässliche scrollbar hier nebenweg ich fürchte gar nicht ich glaube diese scrollbar muss sein sonst funktioniert wahrscheinlich die virtual list component nicht richtig also ich habe jetzt die disable scrollbar class kann man hier nicht drauf machen das mag er ja nicht boah und ks was jetzt moment das da vielleicht bisschen verkehrt so versuch mal mit css die class von der component zu überschreiben mit der scrollbar wenn ich sage hin dann kann ich nicht scrollen das ist natürlich doof ich will ich will ja scrollen so ich glaube wir müssen es noch mal kurz verraten wir brauchen noch einen repper und disables der funktioniert nicht wenn ich die scrollbar disable guckt euch das mal an der sprocken rip warum weil das flex flex ist weird flex ist das weird flex wartet mal nee moment ok aus irgendwelchen gründen funktioniert jetzt alles klar ich musste ich musste es neu laden aber jetzt geht das scrollen nicht mehr jetzt jetzt geht jetzt geht das scrollen hier drin nicht mehr und es ist auch mega langsam was ist denn da los es leckt wieder wie sau ich check ich check die javascript geschichte net das ist mir zu six hat alter wo ist denn das problem wenn da noch ein diff drum herum ist warum ist das ein problem warum wird das langsam wie sau wenn da noch ein extra diff drum ist mein who cares ob da ein diff drum ist oder nicht check ich net aber wenn ich virtual list so mache dann geht's alles klar nicht nicht dass ich es in irgendeiner Art und Weise verstehen würde aber ok so also was soll ich überschreiben die klasse von so moment was ist denn hier die scrollbar das da oder ja das da also kann ich class monka es die klasse was ist denn das das kann ich auch im leben überschreiben es ist 1.7.d hs go was ist denn das schon wieder für ein schwachsinn aber ich müsste das doch auf das element selekten können oder kann ich nicht kann ich nicht sowas machen kann ich nicht sowas machen für das element das juckt es nicht er kehrt nicht dafür keine ahnung ich habe kein blastenschimmer ich glaube wir können jetzt erstmal mit scrollbar leben ich finde es zwar nicht das ist auf jeden fall nicht aber wie sagt der weißheitsletzter schluss hier aber besser als nix vielleicht bauen wir das einfach selbst jetzt jetzt geht's erstmal weil es schön zackig ist der component eine id geben das geht nicht oder keck weh ne man kann components keine ids geben man kann die rappen in einem diff und dann eine id geben aber der witz ist ja wenn ichs in einem diff rappe dann gehts nicht mehr ich hab keine ahnung warum vielleicht liegt das moment class w12 h12 vielleicht liegt daran das keine höhe und breite hat kann er sein und es ist mega langsam dann auch also das das check ich nicht das das ist java script was daran liegen kann vielleicht macht diese komische virtualist component irgendwas merkt wirkliches ja keine ahnung weil ich mein wo ist das problem ah ok es war zu klein das das funs doch kann ich sowas wie full sagen aha full nice jetzt steckt es da im boden leute es steckt im boden so aber wie krieg ich denn jetzt kann ich es da sagen disable oder scroll scroll ne wie hab ich den kram genannt disable scrollbar nö ich kann kein scrollbar scroll oder overflow overflow hinten geht das wenigstens nö moment warum hat overflow hinten einfluss darauf wie das what alter ich blick ich blick nicht mehr durch java script mann das ist das ist zu high iq für mich zu also wirklich viel viel zu hoher intelligenzquotient der dafür notwendig ist kann man diese diff rappen hab ich ja gemacht so aber disable scrollbar bringt an der stelle schonmal nix leute ich hab keine ahnung wir lassen das jetzt so und irgendwann machen wir selbst wenn mir was besseres eingefallen ist aber das einfügen und so das geht wenigstens alles noch ok aber die suche ist jetzt auch schön schnell nice inline wie inline was inline wo ich hab keine ahnung was das bedeuten soll kann man die virtual list nicht inline im diff rappen ich hab keine ahnung genau das scroll ist auf dem auf dem diff von der liste das hab ich vorhin versucht zu überschreiben aber hab ich nicht auf die reihe bekommen enrixel test hat funktioniert aber ganz ehrlich das ist kleinigkeiten kram das krieg ich immer noch hin jetzt müssen wir uns erstmal ein bisschen essenzielleren features kümmern dass wir das überhaupt sinnvoll sinnvoll verwenden können also wie wärs mit text einfügen text einfügen ist glaube ich somit das wichtigste was man noch braucht dazu müssen wir aber diese sache hier als extra extra component machen weil ansonsten kann ich das hier nicht mehrfach verwenden also machen wir extra component für lip für diesen icon browser icon browser 12 so und dann wird copy pasted der gesamte icon browser was ist denn alles der icon browser das da eigentlich ne ne von dem diff bis zu und das da ne das da ist der icon browser overlay danke für den sub so das hier ist der icon browser ah wisst ihr ich hab ne idee wisst ihr was wir noch machen können rounded können wir es noch machen rounded rounded top doch gleich viel schöner oder leute rounded ecken pock pock ecken so das müssen wir jetzt in extra component machen so und die component heißt icon browser ah jawoll sehr schön was noch keinen einfluss hat weil es in der component noch nix gibt du du du du so icon browser kommt das da rein zack icon filter gibts nicht script let icon filter gleich ne nicht gleich icon filter interessiert mich dass der filter kram irgendwie außerhalb ne wahrscheinlich nicht kann man das kann man das importen so virtual list kommt hier raus virtual list kommt hier raus da oben drüber einfügen dann brauchen wir noch die icons so chunkers so ok das sieht doch schon besser aus filtert icons brauchen wir jetzt noch wo kommt das her filtert icons filtert icons kommt daher eigentlich kann ich mir das alles mal copy pasten und hier rausschmeißen bis auf show icon browser das brauchen wir dann später noch mal kurz hier reinkloppen also icon filter ist leer show icon browser kommt weg so filtert icons schon mal besser ok das einfügen funktioniert zwar natürlich noch nicht weil das event nicht weitergeleitet wird aber jetzt haben wir schon mal eine extra component und das ist ein bisschen ordentlich ja es ist doch deutlich übersichtlicher jetzt den kram hier als das da gut insert icon on click ne da müssen wir in event weitergeben das weiß ich aus dem kopf nicht wie funktioniert das ins welt event event event forwarding event event forwarding event detail texts was ich checks nicht was bin ich hier sehend inner was die katz da macht wo macht die katz was über dem chat die guckt auf euch runter in this case we have to keine ahnung was die mir hiermit sagen wollen hier on message einfach weitergeben easy also im prinzip hätten sie auch gleich sagen können im prinzip gebe ich einfach nur on click weiter fertig sonst nix oder so und jetzt gebe ich on click weiter das bedeutet hier sage ich jetzt an der stelle wo der icon browser ist click on click ja easy spukige musik hier und dann sage ich das da drinnen parent so oh nee mist warum funktioniert es nicht weil achso e moment fuck nee ich muss ich brauche doch ein custom event ich brauche doch ein custom event also wie macht man events dispatcher create event dispatch ok was auch immer das machen wir jetzt einfach mal so wie es da steht dispatcher create event dispatcher kann man es importieren nee import genau lass mich das mal importieren dispatch say hello function function so wie soll das event heißen icon nee oder was weiß ich selected nennen wir das jetzt einfach on wie ist denn hier naming convention für keine ahnung select icon icon so so text es gibt einfach nur das icon als event das kann man wahrscheinlich schöner machen so und jetzt sagen wir hier on click ich hoffe das ergibt sinn was ich hier mache so on click select icon icon ok und jetzt müsste ich hier im parent einen on selected haben genau on selected icon so was fuck warum funktioniert es nicht anzeige ist raus was mache ich falsch was mache ich falsch was was stimmt hier nicht wird das event überhaupt geworfen name ja das event wird moment das ist nicht das hä das ist nicht mein argument was ich übergebe moment detail in details ist ach in details ist das drinne ok also ist das dann monka es man also brauche ich das gar nicht und das ist das standard event was man bekommt jetzt wird es aber jetzt wird es aber wir die detail icon ok ergibt passt passt ja icon ok das brauche ich also ist das hier event das brauche ich ein name so jetzt sollte es funktionieren wieder fack warum ach nee event keck wait ah da ist es wieder ok allah schwere geburt schwere geburt aber ich hab ich hab events auch so gut wie gar nicht bisher benutzt gut jetzt haben wir eine extra komponente für den icon browser er geht auf und zu er ist schnell man kann suchen und ich kann dieses overlay für alles andere benutzen deswegen ist es jetzt auch nicht show icon browser sondern keine ahnung show chat gute idee für namen wie heiß könnte die variable heiß um dieses options menu einfach warum warum warum nennen wir es nicht show shape browser oder so options option browser oder show element browser sowas show icon browser ok keck show so jetzt können wir das machen was wir vorher machen wollen nachdem wir jetzt das in der eigenen komponente ausgelagert haben brauche ich an der stelle hier nicht mehr diesen ganzen code und kann dieses options menu options menu oder es ist ja nicht wirklich ein options menu für alles mögliche verwenden zum beispiel um text einzufügen ich würde sagen text einfügen ist erstmal so mit leute wir brauchen dann auch wir brauchen auch noch nen emoji menu oder mdi icons alleine reichen nicht wir brauchen emojis auf den auf den etiketten aber das machen wir nicht jetzt mal jetzt erstmal text text so also icon browser brauchen wir nicht wir wollen text einfügen insert text ich glaube das gibt es als funktion noch gar nicht das ist das ist so wir was ich hier gebaut habe das muss ich unbedingt alles ein bisschen aufspielen insert text so insert text wenn man das hier klickt so insert text insert text macht auf jeden fall schon mal das da auf und zu moment nicht insert icon alter insert text insert text ist ja das was passiert moment moment jetzt muss ich mal kurz überlegen ne ne ne ne ne show element browser ne ich brauche ne funktion open open element browser so und dann muss ich einstellen für was irgendwie menu oder sowas weil ich muss das jetzt ja umstellen können ich muss das jetzt ja umstellen auf icons oder auf text so element browser das das muss auch als eigene komponente dann gemacht werden ja was weiß ich menu so standardmäßig ist es nix ist es leer ok gibt das sinn was ich da was ich da baue weil ich muss jetzt ja anhand der ja doch ich muss jetzt anhand das menüs auswählen was da reinkommt im endeffekt also anstatt überall wo ich das jetzt von hand reingeschrieben habe also hier kommt das weg überall wo ich das jetzt von hand reingeschrieben habe muss ich jetzt sagen show element browser und dann in dem fall für icon oder icons oder so wo ist das problem is not callable wie warum nicht eigentlich open bescheuerte benahmung deswegen sollte man das nicht schon also ist das müsste man ist nennen das ist das ist sinnvoller also nicht show element sondern ist element browser open oder sowas ist das ist das ding hat einen scheißen armer das brauchen ordentlich das dann erkennt man nämlich auch was es ist ok funktioniert noch alles ja ok nice auf und zu funktioniert noch gachi bass text inserten ok wenn man hier klickt soll das umstellen auf open element für text und jetzt brauchen wir eine extra component für icon browser und jetzt keine ahnung ich nenne es jetzt einfach text text browser wie auch immer so text browser gibt es natürlich noch nicht das legen wir jetzt gerade mal an new file text browser ordentlich groß groß klein kleines welt text browser keck weh whoops was habe ich jetzt gemacht ohje hat es irgendwas schlimmes hat es jetzt jetzt alles zerstört so text browser text browser so was ist was ist denn jetzt schon wieder ah noob schon besser toggle element browser ja er toggelt ja nicht nur es moment ich weiß was der macht es ist nicht open es ist eigentlich switch kategorie oder sowas kann man machen so also jetzt schaltet er das um von obs das ist falsch falsche stelle so das schaltet es jetzt um von icons zu text ok nice und open sollte auch wirklich open sein ja so das heißt das muss ich hier auswählen if kann man das dann irgendwie schöner machen anstatt jetzt hier einfach in if rein zu klatschen also if element browser menü gleich gleich icons dann das da das muss doch irgendwie schöner gehen oder else text browser zum beispiel case nee an der stelle geht kein case so guck jetzt kann ich zwischen den zwei dingern umschalten hier leht er das den für icons und hier leht er das für text und da können wir jetzt rein basteln was wir wollen also was brauche ich denn moment unselected unselected insert text icons und und icon browser nee das funktioniert nicht das hier ist html mit markup zeug zumindest funktioniert es an der stelle das heißt jetzt müssen wir irgendwie uns überlegen wie wir das schick machen text text inserten also wie bauen wir das auf den icon browser hat oben eine suchbar eine suchbar für text ist glaube ich ziemlich ziemlich useless aber ich kopiere ich kopiere es mir trotzdem mal kurz so chunk brauchen wir nicht icon filter brauchen wir nicht so selected brauchen wir aber als event icons brauchen wir wahrscheinlich auch nicht virtual list brauchen wir wahrscheinlich auch nicht so diff den input brauchen wir den input nee den input brauchen wir auch nicht ok also was kommt in das diff rein also text also was brauchen wir wir brauchen ein text was haltet ihr davon wenn wir was ganz simples machen quasi text header so was text was wir einmal in der vorlage machen für header text für text normal und text schmoll so und dementsprechend kriegt das jetzt auch die passenden klassen text xl und wenn man das dann anklickt edit das hier drauf jetzt müssen wir so noch überlegen wie man die raustufen des textes umstellt und wie man den text editierbar macht vielleicht machen wir doch ein input hier oben hin let text vielleicht machen wir doch hier oben was hin ich glaube das ist gar nicht so schlecht und define ist vielleicht doof ja dann sieht man nämlich gleich was man einfügen würde das ist doch schon mal gar nicht verkehrt so text normal text schmoll oder den drop down menu mit verschiedenen größen ja sowas in der richtung ist das ja du siehst du siehst das und kannst es dann anklicken oder erscheint hier drauf mit bold vielleicht noch ja das könnte man könnte man als alternative anbieten noch ja müssen wir gleich mal müssen wir gleich mal gucken also klas normal ist text medium ne text m oder large sekunde lg oder mt ist es lg lg mlg legit xl ne nicht xl sm so da das ist zu klein oder niemand will sowas kleines auf dem etikett haben das sieht doch keine sau das ist das ist nicht keck weit das ist nicht zu erkennen sehr was wir machen wir machen das anders wir lassen text text leer jetzt steht da zwar an die feinden jetzt war mal oder oder text header ja so ist das schöner oder oder text normal oder oder text small jetzt müssen wir noch die klammer an die richtigen stelle machen ja so wenn ich jetzt was eingeben bei spiel text dann kann ich es anklicken schau dir mal den tailwind editor an ich brauche irgendwas was man hier einfach reinhauen kann aber also jetzt irgendwie super krassen was denn den da eben super feature reichen das meinst du nicht super feature reichen text editor muss ja nicht sein das reicht doch eigentlich schon text bspw text die coolen leute nehmen lorem ipsum bei sowas oder die die sagen hat es hat es wischl hat es wischl studio code nicht mittlerweile eingebaut so text header text normal text aber text small ist blöd wir machen lieber text small ist lg und xl ist normal oder 2xl oder xl ist normal und text small ist so ansonsten ist das viel zu fett wie wäre es mit zwei buttons um die font size einfach selbst vergrößern zu können und zu verkleinern ja wir brauchen da oben e-buttons leute wir brauchen wir brauchen keine suchleiste wir brauchen wir brauchen was für graustufen wir brauchen was für die graustufen wir brauchen so einen kleinen color selector hier oben noch jetzt müssen wir mal ausprobieren ob wir da irgendwas gescheites hinkriegen hier diff class flex weird flex diff class 12 12 bg grey gibt geile color picker ich weiß aber ich brauch kein color picker ich brauch drei drei ich brauch fünf fünf buttons mit unterschiedlichen grautönen das ist glaube ich zu grautöne picker im dark theme das können schwierig werden ja rot geht nicht der etikettendrucker ist schwarz weiß oder soll ich einfach color einfügen weil man color einfügen kann deswegen ist es ja auch alles graustufen weiße konturen ja wir können border machen tatsächlich border und wir machen das mal ein bisschen kleiner immer dran wir müssen das mobile auch anklicken können wir müssen das wir müssen das auch mobile anklicken können ein slider ein slider für die schriftgröße ist eigentlich ganz cool ja also was machen wir denn für farben ich mein vier farben oder so reichen ja das hängt dann so schön in der ecke hier oben vielleicht ein bisschen größer ich glaube auf dem smartphone ist das zu klein was haben wir sonst zu bieten acht neun zehn elf zehn vielleicht rot grün blau weiß wie gesagt der etikettendrucker ist schwarz weiß es macht eigentlich außer dass es im web interface optisch schöner aussieht macht es keinen sinn farben anzubieten also graustufen soll wir machen wir machen eine relativ helle so wir machen quasi weiß so weiß dann irgendwie mittel und dann bisschen dunkler und dann sieben oder das reicht ganz ehrlich leute mehr braucht man nicht an graustufen das ist ausreichend weiß ist doch bullshit naja warum vielleicht möchte man so was in hintergrund machen dann weiße schrift drauf und ein ganz schwarz ja das ist tatsächlich sinnvoll bg black ja das doch ok finde ich schick finde ich echt in ordnung wie das ausschaut so jetzt müssen wir noch sagen kürzer pointer hier drauf kürzer pointer mal wie ging das in der studio noch mal alt ne moment alt wie macht man mehrere kürzer noch mal kontrol plus feil was kontrol es ist alt es ist alt so sieht doch eigentlich ganz hübsch aus jetzt können wir noch die color uns speichern oben so color oder mit mausrad kann man rechtecke markieren was echt wie auch immer so also text header normal so da muss noch ein bisschen ein bisschen abstand dazwischen und margin bottom 2 bisschen mehr abstand hängt so aufeinander so das reicht doch als text auswahl oder wollen wir wirklich noch einen button machen für schriftgröße größer und kleiner eigentlich ist das minimalistisch genug so du kannst hier oben reinschreiben keck wie alda lan oder so dann kannst du dann die farbe anklicken und dann klickst hier unten drauf und dann hast du dein text muss doch muss doch eigentlich soweit eigentlich soweit passen testen wir mal ob das mit dem hinzufügen denn überhaupt funktioniert also ich gebe zu das ist usability technisch der label der label maker kann farbig nein kann er nicht der kann nur graustufen deswegen haben nur graustufen am start und selektor ich weiß nicht font selektor das ist aber ganz schön advanced ich wüsste gar nicht wie man den drop down irgendwie gescheit macht wie lässt man sich mit java script überhaupt alle verfügbaren fonts auflisten weiß ich gar nicht js list fonts geht das überhaupt bestimmt die leute wollen bestimmt comic sans drucken ich kann es mir jetzt schon vorstellen und face set check ok das geht nicht weil fingerprinting das geht nicht weil fingerprinting ok da muss ich meine eigenen fonts meine muss irgendwelche web fonts mit liefern ich habe noch nie web fonts included viele für sowas das braucht auch viel zu viel speicher benutzt google fonts das probieren wir aus machen wir gleich ich will erstmal gucken ob das adden prinzipiell funktioniert kursor pointer so zack zack ja die usability ist noch nicht so ganz da aber aber aber schauen wir mal select none ok ist noch nicht so die hyper usability so wie ich mir das vorstelle aber ok ich will jetzt testen ob das funktioniert wenn man das wenn man das anklickt on on click das ist kein search achso da steht noch ein search drin text what on click select icon ist schon mal verkehrt select text text meinte text muss ich übergeben den text habe ich da oben stehen select text text text wobei so reicht doch text ja ja unexpected token darf nicht rum ok der sollt jetzt der sollt jetzt das event schmeißen oder sollt jetzt das event schmeißen das probieren wir mal aus also insert text sollte der jetzt und selected machen insert text macht er das denn insert text der wirft kein event warum nicht moment click text was mache ich denn dafür ein select text man nicht text jetzt wirft er auch das event ok so und wie fügt man jetzt text ein lass lass mich mal raten ok lass mal ran let und insert text das ist hier der text jetzt bräuchte ich beide beides mal text text text shape gleich new konver text aha tja text konfig kek wait keine ahnung konver text zeig her wie funktioniert's ich brauch ein example tutorial tutorial text please text text so was da will ich haben text auch als svg ich glaube das macht er standardmäßig als svg dann kann man es theoretisch noch auf dem canvas resizing dann wenn man das auf dem canvas resizing kann brauche ich hier gar nicht in unterschiedlichen größen sondern vielleicht mit unterschiedlichen styles das werden wir gleich sehen hier text shape moment das hier ist ja auch gar nicht so das ist ja gar nicht der text das hier ist das event event und es ist let text als was data kek wait viel besser nennen wir es so text hier mein text so font size haben wir keine auswahl 30 kalibri was auch immer green nein ja das müssen wir noch mit übergeben machen wir noch nicht schauen wir mal ob das insorten jetzt wenigstens funktioniert nee ach so weil ich kein text gesetzt habe aber ich muss ich muss ich muss insorten layer add text shape ja möglichkeit zum resizen haben wir kann es sein moment ich ich ich trau das oben links in der ecke dann finde ich es wenigstens wieder wartet mal lock text shape ach detail icon schön copy pasted ja das immer moment selectable ja content das brauche ich weil irgendwie mein eigener shit so tracable tracable true so ja man kann hier resizen ist das times new roman nee das ist das kalibri igitt gehst du mal fort alter bäh das will ich nicht haben so wir müssen jetzt die farbe noch übergeben sonst funktioniert das nicht also selected text haben wir wir machen standard beispiel beispiel text da rein weil wenn text leer ist wie wie fängt das an bacon sehr schön bacon das heißt wenn ich das jetzt anklick ohne dass was aus ausgewählt ist ach ich das habe ich die ganze zeit gesucht ich dachte das sieht man hier als als nee kann man nicht ist das ein addon wie machen das das muss mein html machen das geht nicht in ja was kannst du mein html machen ok da fand ich das bacon aber besser bacon pepo fett so und wenn ich jetzt hier was reinschreibe dann geht das ok grün ist jetzt einfach nur weil man es besser sieht der tag der drucker kann kein grün ok also dann brauchen wir hier noch ok ich übergebe mal font weil ich keine ahnung habe ob wir das ein implementieren werden font und color color übergebe ich in ja wie kriege ich eigentlich die color jetzt so ich habe jetzt da drauf geklickt so ich klicke jetzt auf meine colors und jetzt brauche ich ja theoretisch noch noch function irgendwie sowas wie color kann man den text nachträglich editieren aktuell noch nicht aber ich habe mir überlegt man könnte es ja so machen dass wenn man den text anklickt und dieses menü hier aufmacht man das hier einfach ausgefüllt bekommt und die standard dinge halt ändern kann wenn schon eingefügt ist wieder live ja so color wie kriege ich denn jetzt die color hier her was ist das überhaupt für eine color ah obviously rgb2 durch was ne das da das da brauchen wir das ist meine color on click kann man das so machen color gleich ne wait a minute ach ne ich muss das doppelt quaten funktioniert das dann überhaupt anscheinend noch anderlei etat ja also guck mal man kann die größte ja hiermit beeinflussen leute deswegen eigentlich brauchen wir dieses text normal und so gar nicht sondern wir können im prinzip sagen text also text text eigentlich nur text weil text normal und so brauchen wir nicht ok text normal so text bold ne font bold ist das glaube ich so bold und was denn sonst noch underline oder oder was 2xl reicht glaube ich ansonsten wobei 3xl ist schon gut was haben wir sonst auch zu bieten font underline ne gibt es gar nicht ich weiß gar nicht wie man das in tailwind tailwind underline font text decoration man könnte auch icons machen da hast du recht ja vielleicht sogar besser einfach underline wait a minute warum ist es font bold und nicht font underline man sieht die underline einfach nicht wegen den icons unten keck keck wait vielleicht machen wir da wirklich icons wir machen ja noch icons daneben für bold aber wobei zum testen das ist erstmal durchaus ok so das heißt wir müssen uns das jetzt merken boah echt leute ich mach mal nur bold da hab ich nur 2 sachen zum abfackeln jetzt da müsste man sich noch den style merken aber viel wichtiger wie kriege ich das mit der color hin package lock ne im moment nicht package lock du meinst moment meinst du meinst du package lock jetzt irgendwie rpm technisch oder meinst du npm mäßig du meinst npm mäßig ne ich mach auf der arbeit nix mit node wirklich also ich geh mal davon aus ja aber ich weiß es nicht ich mach nix mit node auf der arbeit 과 Also das da, das da setzt jetzt die Color. Testen wir mal ob das auch wirklich die Color setzt. Lock Color, das setzt die Color. So jetzt muss ich Color übergeben. Color, so also von der Idee her bekomme ich jetzt hier noch, noch ein, ein Color im Mode, habe ich im Mode Color im Event mitgeschickt. Schauen wir mal ob es das auch funktioniert. Also ich klick das hier an, sag Text normal, Color, ja hier passt. Ok und nun wie gebe ich die Color hier an? Phil, kann man das als RGB Wert angeben, da bin ich ja mal gespannt. Color, wahrscheinlich nicht, wahrscheinlich muss ich jetzt erstmal RGB Wert zu Hex Schreibweise machen oder sowas. Nee es funktioniert. Es funktioniert Leute. Kunst, PogChamp, Moment, warum ist der Selektor dahinter? Mein Selektor ist da, der ist da, was macht der da? Der ist weg, ok man erkennt es auch nicht wirklich. Gut, also das heißt im Prinzip funktioniert das ganze schon mal, also sagen wir OnClick, OnClick, OnClick, OnClick, so und dann haben wir hier Color, RGB oder RGB wie die coolen Leute sagen, das da und das da, achja Default, Default brauchen wir ja auch noch, so und das da, wobei das ist einfach, das wollte ich gerade sagen, das ist 000, das ist tatsächlich easy. So und wenn ich da jetzt was schreibe, lulululul, schwarz, das da, BÄM, nice guckt mal, es funktioniert. Was ist, das ist schick, das gefällt mir, meine Usability technisch ist das noch nicht, da war jetzt das letzte Schluss, ja da muss man ehrlich sagen, da muss man noch was besseres einfallen. Ja zum Beispiel müssen wir das hier noch selecten, was ausgewählt ist, also anstatt das wir Border so machen, machen wir jetzt mal beispielsweise Border Blue, irgendwie so, ja das es selected ist, guckt mal, also das man weiß was selected ist, 400, 400 war schon ok ja, ne 500, also das man weiß was selected ist, vielleicht sollte man den Border sogar ein bisschen größer machen, ja so ist gut oder, dann erkennt man wenigstens was selected ist, dann erkennt man wenigstens was selected ist, ja, so wie merke ich mir denn jetzt was selected ist, das ist ja, das ist ja richtig eklig, oder im gleichen Pinkton wie die Buttons, das ist auch eine gute Idee, das testen wir mal, Pink, 500 ist das glaube ich, ne 600, damit Pink können wir den Border auch kleiner machen, haben wir 3, ne gibt es nicht oder, gibt es nur, kann ich sagen Border, Sekunde, 3 sowas, eh 3, Magenta Border, ja ich glaube so ist es ganz ok oder, Leute 4 oder 2 Border und Blau oder Magenta, kann man auch 8 Border machen, dann sieht man gar nichts mehr, Abmahnung, das ist nicht Magenta, das ist Pink, 600, 2 Magenta, 4 Magenta, ja, so mal schauen, eh wie merke ich mir denn jetzt, dass das aktiviert wurde, ich mein die Obvious Variante wäre, ähm, Color, äh wäre Border, aber das ist doof, pack die Color Buttons doch in eine eigene Komponente und lass die per Each ausgeben, gib jedem die ID E und gib ihm Class Select, oh 5 Head Time, Leute, Big Brain Time, jetzt gehts aber ab, die Buttons kriegen die ID, ja Moment, das mit der ID ist doch eigentlich viel besser, wir machen das mit der ID hier drin auch, wir merken uns was in Color Selected ist, merken wir uns die ID und hier drinnen in dem Event mappen wir dann die ID auf die eigentliche Color, das ist glaube ich sinnvoller, also das wäre irgendwie, keine Ahnung, das ist Color 1, Leute fangen wir bei 0 oder bei 1 an, eigentlich ist es egal, das ist Color 1, das ist Color 2, das ist Color 3, das ist Color 4, das ist Color 5, kann man aus Javascript abfragen, ne das krieg ich da nicht gescheit raus, so und jetzt kann ich nämlich auch sagen, if, kurz weg, Class Border Pink, 500, 600, gibt das wenn Color gleich gleich 1 ist, ob das funktioniert, hey, schuld dass nur die ID hängen geblieben ist, ja das mit der Komponente machen wir vielleicht noch, oh was jetzt? ja also, ID 3, ID 4, ID 5. So, jetzt kann man den Krempel auch selecten, so ist das doch eigentlich ganz nice, wie findest du Edabit, was, Programming, Edabit, hab ich noch nie gehört, Coding Practice Challenge, keine Ahnung, hab ich noch nie gehört, sagt mir nix, dann steht leider nix zu sagen, so, so ist doch ganz schick, so und jetzt müssen wir das hier drinnen machen, wie macht man das jetzt mit dem Switch, wie macht man das am schönsten, einfach ein if, oder, if Color gleich gleich 1, oh ne da war ein extra Funktion draus, Color ID 2 RGB, if Color gleich 1, Return, oder macht man das mit nem Switch, mit nem Switch ist besser oder, Switch, Color, Value 1, Return, ähm, tja ich weiß es nicht mehr Leute, von oben nach unten wahrscheinlich, so was da, ist das, ist das da, The Javascript Way Leute das zu machen, ok 2, 3, 4, 5, oh jetzt als nächstes haben wir, ne Map, jawoll, wir könnten, wir machen, wir machen ne Map, auf der anderen Seite, ob ich jetzt ne Map ausfülle oder, ich mein wir könnten, Color Map, mal gucken, mal gucken was schöner ist, mal gucken, mal gucken was schöner ist, wobei keine Map, wir machen nen Array, wir machen nen Array, weil ne Map mit nem Index, ne Map mit nem Indizier, also des bescheuert, wir machen nen Array, so, zack, erstes Element, nulltes Element, da müssen wir es auf null, null ändern gleich, so was haben wir als nächstes, das da, äh, das da, seht ihr eigentlich wie Fivehead mein Clipboard Manager ist, dass er das da unten wegnimmt und da oben hinschreibt, so, so, dann muss nämlich die IDs, dann muss ich die IDs noch ändern, null, ich sehe schon, das mit eigener Komponente war doch nicht so, nicht so blöd, was der Chat vorgeschlagen hat, welcher Clipboard Manager, äh, Rofi, Rofi Clip, so und jetzt kann ich einfach sagen, return, Color Map, es ist ja nicht wirklich Color Map, Colors, es ist einfach Colors, so, äh, ID, so, so und wenn ich das jetzt ordentlich gemacht habe, sollte ich bei Color eigentlich jetzt die Farbe zurückbekommen, ok, bla, bla, bla, bla, das da, das da, geht, PogChamp, guck mal, nice, Funst und ist wieder erwartend sogar relativ lesbar, oder, finde, das kann man ziemlich gut lesen, was hier passiert, vielleicht soll ich es anstatt hier Color tatsächlich nochmal Color ID nennen, weil hier, ich nenne es hier überall Color ID, Moment, Multiple Cursors, Multiple Fivehats, bam, jawoll, nice, so, jetzt müssen wir noch übertragen, jetzt müssen wir noch, ähm, hinschreiben ob bold oder nicht, ok Chat, was haltet, also Schriftgröße brauchen wir nicht, oder, hatten wir doch gesagt, Schriftgröße ist unsinnig, also Schriftgröße, Schriftgröße ist unsinnig, weil Schriftgröße können wir damit einstellen, vielleicht machen wir doch, wir machen einen Fontselektor, da muss ich mir aber erstmal überlegen, Google, irgendjemand hat gesagt, Google Fonts, müssen wir uns gleich machen, wir machen, ich habe noch nie einen Fontselektor gemacht, erstmal gucken wie das funktioniert, ähm, Chat, wisst ihr, was noch viel Fiveheadiger wäre, was richtig massive Fiveheadig wäre, aber ich nicht weiß ob sich der Aufwand lohnt, eigentlich wäre es doch viel sinnvoller, man würde den Text gar nicht hier eintragen, sondern, man würde immer Text normal hier drauf droppen und dann könnte man das hier oben doppelt anklicken und dann hier oben drinnen editieren, da weiß ich aber nicht wie es geht, da müsste man irgendeinen Textbox Overlay machen oder sowas, wir bleiben jetzt erstmal dabei, weil da weiß ich, dass das funktioniert, könnte am Ende komisch aussehen, wenn du die Größe immer per Hand machst und dann eventuell keinen Unterschied hast, was, du kannst Content Edible machen, nee kann ich nicht, weil das hier oben ist ein Canvas, was gemalt wird im Hintergrund von Conva, das ist kein HTML Element, das ist Canvas, deswegen kann man da auch solche Sachen mit machen hier, was du mit HTML Elementen hier machen kannst, Small Text, die Library direkt kann das nicht, die sagen, man soll im Textbox Overlayen, das mach ich vielleicht dann irgendwann mal noch, aber nicht jetzt gleich, ok zack, Leute ich muss euch sagen, der Chat verleitet mich dazu Sachen relativ ordentlich zu programmieren, jetzt mach ich das da außen vor, so, Default Color ID ist 0 und dann ist auch die hier selected, das heißt standardmäßig inserte ich das mit weiß, das ist ziemlich blöd, die standard Color ID sollte 4 sein, Schwatz, ok, wie kriegen wir da jetzt einen Font Selector hin, irgendjemand eine Big Brain Idee, wir machen zwar, wir machen zwar, du bist immer noch für 3 Buttons, Bold Italic Underline, ok, dann machen wir das noch, weil es der Chat ist, wie macht es eigentlich Canva.com, von denen kann man bisschen UI klauen, wie machen die das eigentlich, wie machen die das eigentlich, Text, ok die machen das, Dark Reader macht es kaputt, ja die machen es auch so, boah ich glaube das ist mega aufwendig sowas hier zu machen, dass du das hier drinnen editieren kannst, NPM für Font Picker brauche ich nicht, ach die haben hier oben so eine Leiste, die haben hier oben so eine Leiste und hier kann man dann, ach so machen die das, ok, das ist natürlich auch clever, Chat vielleicht sollte ich meine Menüs auch so machen, auf dem Desktop so und auf dem Smartphone so, ist vielleicht die clevere Idee, weil auf dem Desktop hast du hier Platz und auf dem Smartphone hast du hier Platz, das kann man sogar relativ easy machen, das ist ein bisschen CSS und Viewports und sowas, also so, das schreibe ich mir auf, das schreibe ich mir auf fürs nächste Mal, also wir bleiben noch eine Weile on, aber das mache ich heute nicht, hier, Icon Browser, aber hier, keine Ahnung, to do, responsive, LG gleich Menu Left, Smartphone Menu Bottom, irgendwie so, Kellner Kai, danke schön für den, ah nee, ist gar kein Sub, aber schön dass du den Weg her gefunden hast, hab ich mal geguckt, übrigens Subscriptions habe ich mir schon wieder die Hälfte übersehen, Sekunde, BartenderEnter hat Subscribed, danke schön, Overlay, Tanser, BloodSnake, danke Leute für die Subs, voll verdrängt, so, wisst ihr was, ich finde den Standardrahmen, ehrlich gesagt, in weiß, nein Max, wir halten uns jetzt nicht an die Color von den Rahmen in der Textbox auf, das machen wir jetzt nicht, wir machen jetzt Font Selection, nee, nee, nee, machen wir nicht, wir machen erst noch Bold Italic, sonst was, ok, also, da brauchen wir noch was hier, neben dran würde ich sagen, oder Chat, quasi noch mal hier neben dran, was brauchen wir da, was habt ihr gesagt, Bold Italic Underline, also das würde ich quasi sagen, Let, irgendwie Style, gleich, Nix ausgewählt, Moment, das ist, das ist gar nicht so einfach, das brauchen wir, weil du kannst ja mehrere Styles zusammen machen, New Set, oh, Fiveheader, Fiveheader Time, Set, MonkaS, ok, mal schauen, ich mach mal kurz das On-Click weg, das blick ich da nicht mehr durch, so, das ist da auch weg, so, und es hat keinen Rahmen, ich brauch ein eigen Material Design Icon für Italic, oder nee, Bold, brauchen wir, Bold, ja, Seite, Please, funktionieren, High Speed Seite, die gibt es nicht, Underline, Ach, Format, Format, Underline, was haben wir denn da, Underline und dann, wo, wo ist, wo ist Italic, verstehe ich jetzt nicht, da muss es doch Icons für geben, Italic und wo ist Bold, gibt es, ah, ok, dann ist, dann ist easy, also, SVG, wir haben eine Icon Library, aber, vor ich da jetzt wieder rumwurschteln, mach ich das lieber erstmal einfach so von der Hand rein, so, also, Diff, Content, da, Flex, Align Center, nee, Align, Ach, wie ging das nochmal, Justify Center, Justify Center und Items Center, jawoll, sehr gut, was brauchen wir jetzt sonst noch, Format, Italic, SVG, so, Copy Paste wir uns den Krempel mal, ok, und was als letztes noch, was hatte ich nicht, Bold, Italic, Underline, ok, Massive F-Zero Musik, so, Programmieren gleich Copy und Paste, ja, öfters als man denkt, das sieht ziemlich kacke aus mit dem Rahmen drum herum, oder, das sieht ziemlich pains-champelig aus, aber, was willst du machen, mir fällt da grad wenig ein, vielleicht machen wir das ne Zeile unten drunter, vielleicht machen wir das ne Zeile unten drunter, oh, ja, wozu eigentlich ein Component Based Framework, weil ich JavaScript Noob bin und das ich ganz bestimmt nicht mit reinem Vanilla JS hinkriege, so, wirklich schicker finde ich das jetzt auch nicht wenn ich ehrlich bin, ich mach das was der Chat sagt, der Chat meinte, wir splitten das irgendwie auf, also quasi, Chat wie meint ihr das so, das so aufsplitten, so, und das andere dann rechts, oder wie, oder wo, oder was, in Parent Div, einfach justify between adden, ok, wenn der Chat das sagt, dann muss das stimmen, hatte der Chat schon jemals unrecht, Leute, justify between, aha, naja, ok, Leute, zum testen reicht's, schön machen können wir das immer noch, wir dürfen uns jetzt nicht so viel mit gebastelt hier aufhalten, so, also jetzt können wir noch Underline Italic Bold machen, so, und wenn man das jetzt klicken, wenn man das jetzt klicken, dann passiert folgendes, wenn wir jetzt hier anklicken, Underline, dann passiert hier oben, haben wir nämlich style, add, underline, und jetzt, select, das ist usability, echt nicht schön, style, includes, ne, wie kann man checken, Moment, js map includes, wie geht das, has, has, ok, has, underline, ok, das funktioniert nicht, warum nicht, bestimmtfalls Weltlogik, bestimmtfalls Weltlogik, ich wusste es, ich wusste es, Textball kommt weg, brauchen wir nicht mehr, ok, das muss in der eigenen Component, das ist nicht mehr händelbar, so langsam, ich blicke nicht mehr durch, too much untereinander, bold, aber wisst ihr was das cool ist, ich kann jetzt mehrere selecten und von den Farben, von den Farben kann ich nur eins selecten, ist nice, oder, hier kann ich mehrere selecten, aber nicht anselecten, warum nicht anselecten, weil ich nicht, oh ne, please, das ist eklig, ich muss es removeen, wenn es schon drin ist, also ich muss quasi sagen, if, boah, if has bold, also sprich, wenn es schon, wenn es schon hinzugefügt ist, dann muss ich sagen, style, remove, ne, delete, delete ist es, ja, ja, ja, es funktioniert, ok, nice, boah, ist das, i get, can't wait, man, zack, ihr seht, programmieren ist copy pasten, zack, zack, zack, zack, zack, ne, zack, zack, zack, ok, ich kann, fuck, was ist jetzt, nein, hier soll ich italien, so, jetzt kann ich selecten und kann anselecten, nice, huge, massive leiste hier, und color kann ich nur eine selecten, so, so muss das sein, alles klar, ah, Moment, wir können tatsächlich ne Funktion machen, das ist eigentlich total hängen geblieben, das nicht als extra Funktion zu machen, chat, warum sagt ihr denn nichts, wir brauchen ne extra Funktion, toggle, style, style oder name, das kann man doch bestimmt auch schöner machen, oder, has, ne, aber bei, fällt mir jetzt grad nix anderes ein, einfach string, pass und gg, was, keine Ahnung, so, jetzt machen wir nämlich, anstatt das hier, schreiben wir jetzt einfach rein, so, underline, schauen wir mal, ob es funktioniert, ja, easy, easy, jetzt können wir nämlich diesen ganzen Mist hier ersetzen, bold italic, und es funktioniert immer noch, so, so ist gut, nice, so, aber eigentlich wollten wir uns ja angucken, wie man verschiedene Schriften macht, da bin ich jetzt wirklich ein bisschen planlos, ich mache mir zwar einfach testweise hier unten, ich mach mir jetzt testweise mal drei Buttons, so, areal, das ist nur zum ausprobieren, areal, was brauchen wir sonst noch für ne Schrift, comic sans, und die keqw Schrift, so, und wenn ich das hier anklicke, nur zum ausprobieren, wenn ich das hier anklicke, dann sollte sich die Schriftart ändern, ok, wo kriege ich Schriftarten her, google, google fonts, sagt der Chat, google fonts, ja, return, ich will ja nicht return, ich will ja unten drunter noch, guck mal, ich will nicht return, ich will unten drunter noch style gleich style machen, das ist Weltkram, das braucht man, style gleich has name, ah, wir könnten ein tannery, tannery, tannery, wie auch immer man das ausspricht, operator machen, also den da, das ist ne gute Idee, tannery, wie spricht man das richtig aus, pronunciation, tannery, tannery, tannery, ok, ein tannery operator können wir machen, ob es das dann schöner macht, style gleich has name, wenn ja, Moment, das ist Javascript, das funktioniert bestimmt oder, nein das funktioniert nicht, das funktioniert nicht, das hat ja keine return werte das Ding, das muss ich glaube ich so machen, ah ja, ich kann damit leben, Javascript passt schon, Leerzeichen dazwischen, keine Leerzeichen, ich mag ja Leerzeichen vor einem if in der, egal, darf man nicht, gut, also, was soll ich machen, google fonts css import, roboto, roboto ist immer schön, roboto ist immer schön, nimm zum testen einfach zeichen fonts vom betriebssystem, das ist wohl wahr, let font gleich arial, so, wie ändert man den font überhaupt, wie ändert man dann den font überhaupt, style, inline style, jetzt was font, family, ne, Moment, was war ich denn hier, font, family, arial, ok, easy, also hier font, so, das scheint ja zu funktionieren, also on click, ich vergesse immer drum herum die geschweiften klammern zu machen, ok font gleich arial, arial, so, font, roboto und font, was ist die times oder so, ok den in der Mitte hab ich nicht, hab ich nicht roboto installiert, sag mir mal irgendein font, mono, monospace hab ich auf jeden fall drauf, font guck mal, arial, comic, uns und times, also von der idee her tut das, wie macht man das jetzt mit google fonts und die frage ist doch eigentlich viel eher, ich kann doch jetzt nicht, Leute, ich kann doch jetzt nicht 10, 20 fonts laden, oder, so ein font ist doch, na wobei, was da du in dem on click keine parameter und nur ein ausdruck hast würde das auch gehen, font gleich arial und was, discard, so, ne, ah das muss man klammern, ich lass das erstmal so, weil ich muss da bestimmt noch mehr reinschreiben gleich, also was ich kenne ist bei font selector ist sowas hier, gucken wir mal an, wie die das machen hier, rappen wir ein bisschen das user interface von denen mal ab, also die machen das so, überschrift und dann haben sie so ein drop down mit den fonts, ah die laden die fonts dynamisch, 5 header time, haben die irgendwie ganz google fonts integriert oder was, guck mal wer da ist, kennt ihr den, von dem hab ich schon mal was im chat gelesen, guck mal der lädt das, Leute, der lädt das dynamisch nach, oder, hat google fonts irgendwas zum preview generieren ohne dass ich die schriftart laden muss, weil da muss ja die vorschau irgendwie generieren, ich hab das noch nicht, keine ahnung, wie groß die fonts, da weiß ich ordentlich von den label drucker, wir machen 3 fonts, das reicht Leute, roboto, open sans, monzerat, was auch immer, roboto ist eh beste font, roboto, roboto medium 500 beste, roboto medium das will ich haben, selectestyle, css import, style, ah nee, ach moment, null, ah ne, ich hab das noch nicht, so und was muss ich jetzt specifyen, äh, hä, Leute, warum muss ich beides, das verstehe ich jetzt nicht, ich kann doch font family nur einmal setzen, warum muss ich jetzt, ach moment, den hab ich vom letzten mal noch hier drin, den font, wie lösche ich den dann wieder, font family, roboto, brauch ich, font family, roboto, reicht das wenn ich das so lade, dass es nicht mehr dsgvo konform war, ach weil google fonts, wisst ihr, wisst ihr, wie sehr mich das interessiert, ob das dsgvo konform ist oder nicht, also wollen wir hier mal, anscheinend wollen wir hier roboto, roboto, gibt es irgendeinen coolen comic fonts, search, comic, comic neue, das, Leute ich sag's euch, dass wir der renner bei labeldruckern jetzt, nee, nicht robot, roboto, roboto, bam, funst, danke für den sub, da ist er wieder, max powerq, jetzt wo du da bist, danke für die subs, hast du immer noch problem mit dotnet, vielleicht können wir dir helfen mit der, fehlermeldung, warum es bei dir nicht funktioniert unter linux, weil ich, ich kenne ehrlich gesagt wenig was so problemlos cross platform funktioniert, so roboto funktioniert als font, comic neue, das brauchen wir, comic, neue, regular, alles klar, dann nicht, roboto, kann ich dir jetzt eigentlich auch bold machen, font, high IQ chat, jemanden planen, wie macht man das bold, font, wie macht man den css, so in richtig style css das bold, weil ich kann's einfach sagen font bold, ist es jetzt dicker als normal, ist das jetzt pepofettiger, sag mal chat kann das sein, dass ich roboto installiert habe und das deswegen funktioniert, nö, font bold, ok so jetzt haben wir den text von am start, was brauchen wir dann sonst noch, comic, comics, ja comics, comic, neue, unbedingt, regular, import, ich importiere jetzt einfach just for fann massig font krempel weil es geht ok wie heißt das ding comic comic neue neue comic so also hier comic bamm massive comic so was brauche man sonst noch chat eine ordentliche schrift art brauche noch irgendwas was richtig gut für impact impact ist glaube ich gut für labels nie gibt es nicht label in einem guten font für label bresa rief natürlich ist das gut für label schon oder das hier ziemlich passend für label aus tatsächlich sehr rief so das haben wir hier das ist ziemlich gut für label das ist ziemlich gut für label hier oder finde ich nice roboto geht comic ist ehrlich gesagt ziemlicher krabb type right typewriter typewriter gibt es nicht als font type etikett kategorie also wir haben monospace font dabei moment ich habe normales roboto genommen ich will roboto mono haben roboto mono will ich haben 500 ja aber man muss das hier enden ach fai fertig man ändert das hier und dann generiert es einem so einen bundle ja garamond jetzt kommen die ganzen h i q f empfehlung medium 500 ja das ist glaube ich nicht verkehrt als label wisterio danke für den sub ist es der chain law oder ist was anderes jemand anderes max power danke für noch mal hier gehts aber ab ok selekte style selekte style ok style import ok es reicht jetzt drei styles sind genug roboto mono ist das hier noch mono oder zusammengeschrieben ne auseinander so das sind schöne unterschiedliche schriften oder ist das die schrift ist das die richtige ne das ist nicht die richtige was muss ich angeben das ist nicht die richtige schrift da sehe ich was anderes weil wenn ich hier mist angebe dann kommt es gleich heraus wenn ich da drauf klicke warum findet er das jetzt nicht was was mache ich was mache ich verkehrt muss ich mal neu generieren hatte ich nicht hatte ich nicht generiert da ich hat es generiert ok die funs nicht im browser oder wie habe ich irgendwas falsch geschrieben nö oder ist alles richtig keine ahnung lasst ihr schmecken da jetzt weiß ich nicht was der warum das ist die schrift da nicht mag die mag er nicht wurde der font geladen schauen wir mal ich mein er wird zumindest hier reingehauen so wo sieht man das in den dev tools hallo sieht man in den dev tools geladene fonts application net ach hier meinste bei network ob der den request macht zu google ja gut den request muss er ja machen anscheinend und es habe ich jetzt gemacht was habe ich jetzt gemacht und wie kriege ich es wieder weg keine ahnung sei zu neuladen ich weiß wie kriege ich das wieder weg was was so aha also die fonts werden geladen also warum der font nicht geht verstehe ich nicht muss ich vielleicht font weight 500 oder so noch machen probieren ich trage es mal direkt ein nö guckt ach moment es hat doch funktioniert oder war das mal das sieht einfach nur ähnlich aus wie meine default schrift aber das ist doch nicht das ist doch nicht der font hier das sieht doch ganz anders aus text normal nee das ist da nicht guck mal hier geht das t in beide richtungen hier geht das t nach links weil das ist da nicht ok font weight machen wir noch font weight 500 gibt's nicht wird nicht geladen kein bock verstehe ich jetzt nicht aber gut was auch immer low low iq font loading genau das habe ich angegeben hier geht nicht also ich check es nicht weil offensichtlich moment das ist der richtige font das ist die ganze zeit der richtige font das sieht einfach nur klein skaliert nicht so aus ok ist gut funktioniert funktioniert auch schon die ganze zeit keck weight schon die ganze zeit richtig gewesen gibt es nicht eine gute api von excalibur habe ich nicht ausprobiert so was was kann man da jetzt machen wie wird man wie insertet man text und ein try out now achso plus wenn man was entbinden kann bin ich ja auch dabei nee gibt keine api gibt keine richtige api oder doch oh nee i frame api nee hör mal bloß auf ich weiß gar nicht wie man hier text wie insertet man hier überhaupt text leute doppelklick nee ich glaube der dark reader macht es kaputt oder ah der dark reader macht es kaputt mich würde interessieren mit was sie das trauen mit was machen die das ist es in canvas oder ist es webgl oder wie machen die das weiß man was canvas ok vielleicht mit webgl drunter mal schauen nee aber i frame api ist crap dann mache ich lieber mein eigenes text ding so gut jetzt kann man schriftart auswählen wunderbar ja was braucht man mehr oder ist doch ist doch eigentlich ist eigentlich ausreichend mal eigentlich müsste man so eine art drop down machen für die für die schriftart aber drop drop down menüs sind so ziemlich das ekligste was es in javascript gibt drop down das ist richtig ab nicht das da das meine ich nicht select select menü javascript das ist ganz abhaltig das möchte man eigentlich nicht nicht verwenden guck mal das sieht aus wie von 1995 und du kannst es nicht richtig style oder doch custom select aber man kann es eklig style nur excalibur für react ja das ist dann wahrscheinlich aber auch nur die i frame api gewerbt ach nee das zum selbst hausen oder wie das ist die anwendung komplett also so einen so einen font option menü ist schon ist schon eklig warte mal select wir probieren mal was aus so als letzte amtshandlung heute ich kann schon immer richtig denken wir probieren mal was aus so select da wenn ich das schon sehe wir brauchen ja nur drei options oder gass nee vielleicht mache ich ja noch ein paar andere fonts keine ahnung sag mal wie lade ich das jetzt eigentlich coolerweise dynamisch oder ok chat wie ist das eigentlich wenn ich warte mal wir müssen mal kurz die die die tools an die seite machen und den browser fullscreen network so ich importiere jetzt ja hier die fonts nee der lädt alle fonts egal ob ich die an anklicken oder nicht es ist egal ob ich die anklicken oder nicht warte mal ohne cash laden wo ist der disable cash moment der lädt den font erst wenn ich es an klicke sehe ich das richtig ipad das ist gut da kann ich eigentlich eine 3km lange liste machen mit mit fonts und erst wenn du die anklickst wird das ausgewählt ja nur mit dem unterschied dass ich dann keine vorschau anzeigen kann du hast das import script am ende das ist kein problem guck da macht hier diesen import aber wirklich geladen wird das ist das erste mal wenn ich es verwende was cooles ich habe nichts gemacht um das lazy zu loaden aber er macht das einfach ist fortschritt immer so langsam nee das liegt nicht so sehr am stream wenn man sachen macht die man sonst nicht macht ist das meistens nicht sonderlich viel schneller ich hab ja keine ahnung was ich da treibe eigentlich der selektmenü ist wirklich eklig bäh hier ist der font so alles klar aber mal das ding wieder unten hin was meint der chat eben um das schöner noch zu machen was jetzt noch die colors und die font buttons jeweilig in ein eigenes diff dann sieht das mit dem flex auch besser ne font buttons habe ich ja net font font buttons also ich mach irgendeinen ich mach irgendeinen drop down für die für die fonts da fällt mir aber noch nichts ein also was mir vorschwebt ist ja folgendes also wisst ihr wisst ihr was halt wirklich schöner wäre nicht etwa hier irgendwie diesen kram einfügen so sondern jetzt doppelt klicken können das doppelt anklicken können dann kann ich mir hier oben nämlich auch das da sparen und dann mache ich es wirklich so dass das menü wobei das wisst ihr was chat das machen wir jetzt ich probiere das mal ich probiere das mal schnell kriege ich kriege ich auf die schnelle hin das menü links zu platzieren so aktuell sind wir fix am unteren bildschirmrand wie soll das dann auf dem handy gehen auf dem handy bleibt so auf dem desktop geht's links hin also von der idee hier muss ich jetzt einfach nur sagen lg moment ich sollte es vielleicht noch mal kurz so sortieren dass es alles zusammen steht so lg left null right null ist richtig moment wie machen das jetzt kann ich kann ich kann ich so was machen left null und dann breite 48 oder so wie mache ich das denn sticky left top muss ich wahrscheinlich machen null bottom null ach so weil ich hier die höhe drin habe ok ok ok breite 48 ok so würde ich das machen auf dem desktop das eigentlich ziemlich nice idee so würde ich das machen auf dem desktop also vielleicht nicht ganz so hässliche mit ein bisschen ramen oder sowas also so auf dem desktop und unten auf dem auf dem smartphone ok das bedeutet das machen wir jetzt schnell noch so das bedeutet left null ok lg top null nur nur nur lg so ok das ist noch klein das ist schöner kann ich ausprobieren so das auch nur bei lg ist das sinn von dieser seite custom label drucken zu können genau ein minimaler label editor hat zwei kunde erstens weil ich schon immer mal ein bisschen javascript grafik zeug machen wollte und zweitens weil ich einen label drucker gekauft habe der mega beschissene mobile apps hat und ich eigentlich nur eine webseite will und label drauf und print und fertig noch vielleicht speichern und laden ok wie kriege ich das jetzt hin also breite 96 sollte jetzt eigentlich nicht gebraucht werden wie also ich brauche ich muss es jetzt ja eigentlich docken right right zero ha leute bam moment nicht ganz nicht ganz fast so ganz richtig ist es noch nicht höhe ein drittel so hatten wir es vorher auch oder ja so hatten wir es vorher auch ah moment ok lg lg ist höhe dann voll zack guckt mal da huge responsiveness hier poggers aber lg is rounded none und lg ist auch right none geht das kann man das irgendwie überschreiben ja anscheinend nicht ja schön fasted das ist nice dass ihr das gefällt das ist cool das gefällt mir richtig gut guck mal jetzt ist das auch viel besser auf dem desktop zu zu bedienen und so ist es gut zu bedienen auf mobile so ist gut auf mobile so ist gut auf dem desktop richtig prog g mobile desktop mobile desktop wir können es dann aber wir können den desktop view kleiner ein bisschen schöner machen und wisst ihr was wir machen nicht lg wir machen medium obwohl das schon rüber rüber switch ja ab hier kann es schon rüber switchen wo ist mein canvas eigentlich hin sagt leute wo ist mein kett wo ist mein canvas hin aber das canvas verschiebt sich irgendwie ein bisschen ja gut ist auch so breit wie der bildschirm das ist das ist schick doch das gefällt mir das heißt wir das muss jetzt bloß hier in dieser größe ordentlich funktionieren und danach switch das rüber auf die auf die ansicht ja gut wir müssen das canvas noch verschieben dann das muss alles ein bisschen nach rechts rutschen aber das können wir das können wir das nächste mal machen das ist jetzt hat man auch die eigens hier richtig schön drin und da müssen wir ein bisschen weniger dann machen aber nice nice nice exzellent sozusagen das ist wirklich nice so so eine sache sollten wir jetzt aber noch machen und zwar dass man den camp hier unten wieder ausblenden kann hier habe ich das genannt open element browser so das heißt wenn ich switche und der offen ist also if browser menü wenn das gleich menü eintrag ist und das offen ist dann will ich schließen hoffentlich funs das jetzt ja aber jetzt geht aber nicht mehr auf warum geht es jetzt nicht mehr auf hä falls achso ja weil es dann hier zutrifft ähm else so und hier switchte aber ok nice und ich kann auf und zu machen und jetzt zum abschluss für heute noch eine richtig feifett idee kannst du eigentlich auch die font der svg zum pass konf was kannst du auch die font der svg zum pass ich habe keine ahnung was du mir mitteilen möchtest chat verstehe den jemann etikettendrucke obvius ist das so eins eins machen wir jetzt zum grünen abschluss heute svelte transitions was hat er jetzt hier für schmerzen all ready included er ist dumm der checkt es nicht dass ich die endung umbenannt habe keg weight so zum abschluss machen wir jetzt folgendes noch also if if ups if show element browser also ich kann mal is is open so rum geht immer noch schnell und jetzt sagen wir in paid pass mal auf jetzt passiert richtig poggers bäm massive ein und aus fäden menü guckt euch das mal ok das fällt ein bisschen das fällt ein bisschen zu langsam ein und aus muss man natürlich sein das mal duration 70 millisekunden oder 80 oder so 50 50 reicht wobei 50 so schnell das fällt kaum auf 100 ja ich brauche noch out kann man eigentlich out und in in einem machen 195 laut google x das jetzt jebait oder ist das wirklich so oder einfach transition so oder wie dann braucht man das nicht verstehe das ist nur wenn man extra optionen haben will 195 das ist doch viel zu lang für so ein menü man 195 das kommt er ja das kommt er ja ewig vor ein und auch deswegen fühlen sich die ganze material design dinger so lahm an weil die animation lamas faks sind jetzt verstehe ich auch die design geschichten von google das ist viel zu lang da wäre ich verrückt bei aber so ist eigentlich ganz cool fly in ist noch besser ok das war jetzt frei bleib ich gebe dir hätte alter bleib bleib ist das jetzt irgendwie anders swelt fly transition epsilon ist das von wo der los flight quasi das ist schick das ist schick das finde ich gut das ist nice guck mal hier wie es auf wie es rausfährt alter wie der typ der metal of honor warfighter aus dem boden gesporn ist der fährt aus dem boden raus hier poggers und es klappt sogar wieder ein guck mal es ist ziemlich brauchen es ist auch nicht bottom 0 es ist bottom 12 bottom 12 ist es und es ist bei ist immer bottom 12 auch hier jetzt sind sie vielleicht ein bisschen bisschen viel eigens auf einmal oder was mein ihr bis sie viel vielleicht es ist richtig nice wie das hier rausgedingst moment die transition müsste anders sein die transition müsste hier hier eigentlich von links kommen es ist eigentlich auch nice ohne ssr ich mache überhaupt kein ssr gerade ich habe jegliches ssr abgeschaltet mir müsste jetzt irgendwie checken na das ist natürlich blöd meinst du ich soll das gleich von links einfliegen lassen das sieht blöd aus aber hier sieht würde das gut aussehen im moment falsch minus 200 wahrscheinlich hier sieht das halt viel cooler aus und von in groß sieht das von unten gibt es irgendwie die möglichkeit ins welt zu checken swelt media media break points oder sowas media queries welt oh nee da muss ich selbst nachgucken das ist extra klasse dafür nee das will ich nicht ich dachte die hat vielleicht was die haben vielleicht was eingebaut nee das ist pains champ kann ich da nicht irgendwie eine tailwind transition machen oder sowas wie war das nochmal tailwind transition nee die sind aber nicht so schön von der animation her da kannst du ja dann bloß sagen hier is in is out da kannst du glaube einfliegen kannst du kannst du da gar nicht machen da kannst du glaube ich nur ein ein planten faden so wobei doch du kannst du kannst die du kannst eigentlich die position animieren irgendwie naja ganz ehrlich ich glaube wir können auch so damit leben check doch if window inner width größer ja aber ich hätte gerne etwas eingebautes dafür ja das kann ich machen kann ich machen wie würde ich denn das jetzt machen gescheit y 0 was ist eigentlich wenn ich beides minus 200 mache aber kommt von oben reingeflogen ok da kommt so schräg das ist doof ein giveaway ok was soll ich ich give away ich give away subs die muss man aber selbst kaufen quasi für 5 euro mache ich ein sub giveaway ich glaube ich glaube das ist top so und jetzt jetzt müsste ich hier quasi irgendwie checken boah nee oder mir nicht keine ahnung fly x wait a minute moment wie check ich denn jetzt ob ich überhaupt resize muss ich muss ich dann sowas hier machen und resize hätte es da gut haben giveaway würde ich würde ich machen aber da müsste ich erstmal mit hetzner wieder was wieder was an start bringen so ne oder das ergibt keinen sinn was ich da was ich da gerade mache nee ich hab mit hetzner nichts am start aktuell und jetzt window if window inner width größer 1000 200 oder größer 1000 irgendwie keine ahnung größer 1000 dann ist x gleich minus 200 und fly y gleich null und els boah das ist aber mega abartig das muss anders das muss anders gehen und ansonsten umgedreht nee 200 so also nee ah moment ich machs ja auch falsch ich hab ich hab das ja auch noch drin hier fly x fly y so es flyt von unten und es flyt von links ok funktioniert aber schön ist ja schön ist das nicht programmiert setz ist desktop ja das ist tatsächlich besser ja müsste dann eh nicht von dem resize event sein ja aber ich glaube in dem event vom resize steht nicht die neue größe drinne oder doch gucken wir mal das ist javascript worüber wir reden da steht nicht die neue da steht nur das target vom window drinne da steht nicht neue größe drinne das wäre ja auch zu einfach wenn da einfach alte und neue größe in dem event drinne stehen würde da haben sie javascript designer so gedacht nee das machen wir nicht overrated shebaited outdated das machen wir so nicht current target window ja aber window hab ich doch auch so ein legacy feature was sind dann tailwind tailwind break points standardmäßig für md 768 ok ist es größer 768 so das müssen wir jetzt mal ausprobieren ja nice funktioniert genau ok wir können wirklich sowas machen ich keine ahnung ist desktop falls oder was wobei dann ist es ja aber dann ist es ja beim resize check if desktop ok kann ich nicht einfach sowas machen reicht das reicht das nicht ist da ist das nicht im prinzip alles was ich brauche im endeffekt weil er das eh immer neu berechnet bei dem click also einfach hier check if desktop wenn es wenn es desktop ist dann 200 wenn es nicht desktop ist null und dann hier auch if check desktop wenn es wenn es desktop ist nein das ist falsch wenn es desktop ist dann null ansonsten 200 und wenn es desktop ist dann minus 200 und ansonsten null funktioniert das jetzt easy so und jetzt können wirs noch besser machen jetzt können wir nämlich das machen was presery vorgeschlagen hat das wir jetzt einfach gucken was was ich result x y und das wir hier jetzt einfach gucken ist es größer ansonsten dann setzen wir result ah moment moment nee da muss ich ein if machen da muss ich ein if machen das funktioniert glaube ich nicht anders aber jetzt nee result so wenn es desktop ist wenn es desktop desktop kram ist dann will ich dass der das y muss es groß oder klein sein y dass das nee wenn es desktop ist will ich das x minus 200 ist so rum und ansonsten will ich dass es das y nee wartet mal leute ich bin verwirrt wenn es kein desktop ist dann soll das 200 sein ne genau weil man das auch bestimmt deutlich einfacher schreiben kann so und in duration 100 muss ich glaube ich auch noch zurückgeben sonst wird das nix also und geht das jetzt kann ich jetzt einfach sagen check desktop nee das muss weg nee ah ach so weil void moment return so java script stellt ok funst aber das ist das ist kann man das nicht irgendwie einfacher machen ja doch mir könnte es direkt hier reinschreiben größer 768 gibt es nicht die auswahl über den user agent user agent wird auch soweit ich weiß mittlerweile gar nicht mehr großartig abhängig zur plattform übertragen das ist ja auch so dass du firefox und chrome nicht mehr unterscheiden kannst die senden alle das gleiche das welt breakpoints gibt es doch nicht irgendwelche helper für oder so ah da kann man das selbst setzen ok ah nee das brauchen wir jetzt nicht also wenn das wenn das größer ist dann wird das wird das 200 minus 200 ansonsten null und dann machen wir das ganze einfach noch mal und sagen hier null oder 200 und dann kann ich diesen ganzen shit löschen und sag einfach return fertig habe ich jetzt richtig gemacht bam easy so bald werde ich hier richtig zum fulltime frontend full stack def bis sec ops cloud native on prem serverless expert engineer dann kann ich alles zwar nix richtig aber alles schon mal gesehen man sollte es nicht nennen check if desktop oder wir sollten es eher eher nennen keine ahnung transition params oder sowas ich ich nenne es jetzt check desktop ich mein was natürlich richtig was natürlich richtig nice wäre ist wenn wir sowas hätten wie macht man in zwende wo macht man denn ihr helper functions rein wahrscheinlich einfach direkt in source wenn wir sowas hätten wie helper js und dann leute wir haben noch viertel stunde zeit ich kann so ein bisschen dummes zeug machen und dann würden wir quasi sowas wie check if desktop würde man da quasi rein packen und dann diesen part da irgendwie rein rein hauen und dann würde ich sagen import helper oder so ne helper ach so moment das muss ich erst exportieren dass es funktioniert oder ich bin da hört man java script zeug auf wie funktioniert das richtig oder so dann könnten wir hier unser helper zeug rein schreiben und hier würde ich dann echt nicht nennen check if desktop sondern get transition params oder sowas und dann einfach nur noch get check if desktop naja so viel haben wir dadurch jetzt nett gewonnen so viel haben wir dadurch nicht wirklich gekriegt so viel haben wir da jetzt nicht wirklich durchgewonnen nicht das ne das hat es jetzt ehrlich gesagt nicht wirklich gebracht na gut wie dem auch sei wir haben doch heute schon einiges hinbekommen also was haben wir denn gemacht die suche geht jetzt endlich schnell ohne gelege hat eine schöne schöne überplendung entfernen die klammer noch wo da ne das muss doch da sein oder oder meinst du dahinter ne brauchen beides also wir haben das hier schnell gemacht wir haben dafür gesorgt dass heck weh wir haben das sachen dass die bilder die man copy pastet schwarz weiß copy pastet werden wir haben dafür gesorgt dass wir ein mobile und desktop layout haben was so ein bisschen verbesserungswürdig ist aber eigentlich schon ganz gut funktioniert ja wir haben das hier virtuell virtualisiert vom scrolling her dass es nicht leckt wir haben text insert ein bisschen gebaut wobei man das noch verbessern kann also meine selektor warum ist mein selektor immer hinter hinter dem dem krempel selection gibt es sowas konvert set index gibt es sowas how to set correct order of notes using set index ok selection wo sind wir hier selection selection set index 99999999 das die soll immer oben sein die selection qr code inserten und gucken ob es funktioniert nicht warum mein set index ist ganz oben das sollte immer oben drüber sein das ist ein back vielleicht muss er niedriger sein ja man weiß ja nie minus 9000 selection index was macht das string ne das was anderes chat set set index so vielleicht das besser reinfolge von den ads ja aber wofür gibt es denn dann set index set index ist just index of a note in its parent child array ja gut das ist nicht absolut aber ich habe ja nur ein ich habe ja nur einen layer ich habe ja nur einen layer das müsste also doch eigentlich funktionieren gibt es auch die top ist das move to top oh nee das muss ich jetzt immer ausführen oder was leute pass mal auf beste beste idee ihr wollt mich ich wollt ihr wollt mich deabonen wenn ihr das jetzt gleich seht funktioniert easy funst das kann aber nicht dabei sein das kann das kann es eigentlich nett sein das ganz eigentlich also das das wieder strebt mir jetzt schon ja jemand irgendeine andere glorreiche idee gibt es ok es gibt doch bestimmt ein ad event oder sowas von der stage stage edit oder so on stage converse stage events so edit oder sowas muss es doch muss es doch bestimmt geben keyboard event desktop mobile oh ich höre es vor meiner tür alle leute macht vor der tür hört das nicht da will einer rein ja schicko mann gleich springt gleich fertig schicko ist hartnäckig gibt es kein event für on insert oder sowas nein nein nein schicko schicko schicko ist ne katze konver event insert ich hab keine ahnung kannst du die auf einen zweiten layer legen five hat time so machen wir das layer das war mir jetzt sehr gute idee sehr exquisite exzellente idee keine ahnung temp konver layer new stage add temp gleich soll ich den kram ordentlich nennen temp add selection muss man jetzt das oder das zuerst adden das funktioniert nicht umgedreht temp zuerst zeig mal habt ihr meine habt ihr habt ihr meine kratzen geräusche aufgenommen naja ich hab das doch im zweiten anlauf relativ gut getroffen oder schicko mann gleich springt gleich fertig schicko ist hartnäckig doch funktioniert das jetzt hey chat fife header der fife hätte wieder einfach zweiten layer adden den mann als letztes edit massive selection layer ich muss das zeug mal irgendwie sinnvoll benennen ja ne wir nennen es nicht always on top layer wie ist eigentlich die richtige javascript schreibweise ist es ist es always on top layer oder ist es always on top layer was ist der java der beste javascript best practice leute ich komm ja aus der c style programmiersprachen welt da ist es sowas hier vielleicht ist es auch javascript moment moment vielleicht ist es auch mit minus vielleicht ist auch mit minus kebab case ist es kebab ist vielleicht auch kebab keine kebab case geht nicht in dem fall get element by id ja das heißt ja nichts nur weil framework interne sachen so benannt werden bedeutet es ja noch lange nicht dass das empfehlung für alle ist wir sind in der javascript welt das heißt kebab case ja kebab case kebab wie das gibt steht da nicht drin da wäre ein beispiel gut für mit einem minus genau das nennt sich kebab case aber das funktioniert hier anscheinend gar nicht ok js camel case versus snake case was zum teufel ist snake case ist das da unten ok was was sagt was sagt ist der gover flow weiß man nicht ok aber chat richtig richtig clevere idee hier mit dem extra layer da braucht man hier keine extra wurscht mit always on top und so nice finde ich richtig gut gefällt mir und was mir auch gefällt ist dass wir text adden können das finde ich richtig high iq funktionen was übrigens noch nicht funktioniert ist bold und so wie willst du eigentlich am ende deinen canvas zum drucker schicken ich exportiere das canvas als bild und machs in pdf oder als png png oder pdf muss ich mal gucken ich exportiere das und dann schicke ich zum drucker cool wäre auch so ein vorgefertiges layout zu haben ne templates können wir nicht rein machen das ist viel zu viel zu aufwendig ich meine mal seriously was macht man ganz ehrlich der label design prozess wird realistisch betrachtet so aussehen keine ahnung das ist ein geiles label keine ahnung dunkler farbe zack qr code so irgendwie so und vielleicht noch smile oder happy oder so irgendwie so fertig also viel mehr werden die meisten leute wahrscheinlich nicht machen was ich in zukunft viel eher mal einbauen könnte noch ist dass man sowas also was ich auf jeden fall einbauen werde ist dass man es speichern kann speichern und restoren von dem label das auf jeden fall und wisst ihr was man relativ einfach machen könnte ist das template bar machen also dass ich zum beispiel das hier und und den text als template markiere dass man das über einen curl aufruf ändern kann und zum drucker schicken wisst ihr wie ich mein also das dürfte relativ einfach sein dann bräuchte ich auf dem solver nur noch ein node.js wo ich das im hintergrund austausche und dann zum drucker.js dass man das hier die zwei sachen quasi als template markiert dass man dann auch über irgendeinen curl aufruf quasi den text und den qr code switchen kann das dürfte relativ einfach sein farbauswahl bringt nichts die label drucker sind schwarz weiß deswegen kannst du beim text deswegen kannst du hier beim text auch nur zwischen ein paar wenigen farben auswählen achso ja das ist eigentlich eine ganz gute idee was haltet ihr farbauswahl farbauswahl für das emote eventuell chat ich glaube eventuell müssen wir doch noch eine toolbar hier oben machen mit farben und sowas und das nicht und das nicht da drinnen und das nicht hier drinnen machen na schauen wir mal ja ja das kommt auf jeden fall noch hin ich mache dann hier so einen rahmen ich mache einen rahmen mit ein bisschen platz drum herum dass man auch sachen jetzt stellt euch mal vor dass hier stellt euch mal vor dass hier wäre das etikett ja stellt euch mal vor das hier wäre das dass das hier wäre das etikett so ich werde es dann so machen dass ich ein bisschen über den rahmen rausschieben kann weil vielleicht möchte man manchmal sachen abgeschnitten haben oder so aber sowas werde ich sowas werde ich da noch hin malen ich mache hier mit gestrichelt rot gestrichelt oder so rot gestrichelt die wirkliche größe des labels wobei es nicht die wirkliche größe des labels ist sondern so aspect ratio entsprechend zum zur canvas größe also dass es dann irgendwie so hier ist einfach dass du von der weil beim drücken wird eh vorher runter skaliert auf 36 mal 89 mm aber ich mir gefällt das auch das ein und aus fänen finde ich sehr nice ja siehst du leute beim qr code aktuell rückte einfach in qr code ein der muss ja beim qr code braucht ja noch text also wir brauchen für ein qr code auch sowas hier man kann mal aufschreiben ja und da könnte man auch sagen wir können zwischen bar code und qr code auswählen oder sowas also wir könnten beispielsweise genauso wie hier beim text oder wie hier bei den emotes der demo kann auch graustufen aber halt gefaked gefakte graustufen der der lässt einfach den hintergrund weiß und und und drückt daneben schwarz und ja der kann graustufen ja also das wenn man jetzt hier beispielsweise auf qr code klickt dass dann auch sowas hier aufgeht wo man dann auswählen kann will ich in qr code will ich in will ich in barcode haben was gibt es da sonst noch barcode qr code was auch immer alles und dann muss man ja noch den text eingeben der auf den der auf den barcode drauf sollen welch ein label printer 450 das ist noch einer ohne dm dot code was ist dot code so was benutzen leute das kenne ich das ist blindenschrift auf der auf medikamenten packung und sowas das habe ich auch schon gesehen ja ach nee das ist nicht blindenschrift was anderes das benutzt jemand hier dot dot code kann man auch alles einbauen wichtig ist erstmal dass wir so die grundlagen haben dass wir die richtigen edit elemente haben und sowas dann kann man auch ein paar sachen einbauen wenn es ja muss ja nicht total übertreiben dass es noch nicht auf github aber das kommt dann auf github wenn es fertig ist oder wenn es wenn es irgendwie halbwegs funktioniert so wie ich mich kenne wahrscheinlich nie kein quake alles klar leute wir sehen uns im nächsten stream ich gehe jetzt auf badgit time was läuft eigentlich auf deinem normalen computer distro windows in der vm in der vm ist manjaro linux mach mal ausrufezeichen linux oder ausrufezeichen manjaro im chat ist es glaube ich irgendwo habe ich da mal ein bisschen länger was drüber erzählt wir haben auch einen ganzen stream gemacht wo wir das zusammen eingerichtet haben muss beim archiv gucken ok leute wir sehen uns bis denn machts gut cu", "segments": [{"id": 1, "start": 0.0, "end": 7.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, bis dahin, tschüss, tschüss, tschüss, tschüss."}, {"id": 2, "start": 31.0, "end": 34.0, "text": "Sag mal Phipps, du kämpfst auch den ganzen Tag im Channel, oder?"}, {"id": 3, "start": 35.0, "end": 36.0, "text": "Im Channel Chat."}, {"id": 4, "start": 38.0, "end": 39.0, "text": "Du bist immer am Start."}, {"id": 5, "start": 40.0, "end": 45.0, "text": "Es ist jetzt nicht so, dass ich mich darüber beschweren will oder so, aber es fällt schon auf."}, {"id": 6, "start": 45.0, "end": 58.0, "text": "Wine Sirius Max."}, {"id": 7, "start": 75.0, "end": 85.0, "text": "Chat, noch irgendjemand von heute morgen den Browser-Tab offen gehabt und sich jetzt gewundert, warum auf einmal der Max wieder schwätzt im Hintergrund?"}, {"id": 8, "start": 89.0, "end": 91.0, "text": "Dafür bist du während dem Streaming aktiv? Ja."}, {"id": 9, "start": 91.0, "end": 104.0, "text": "View-Time, wichtig. Einfach im Hintergrund laufen lassen, wobei ich weiß nicht, ob View-Time irgendwie Twitch richtig ist. Richtig ist."}, {"id": 10, "start": 107.0, "end": 109.0, "text": "Ja, kann ich mir vorstellen."}, {"id": 11, "start": 109.0, "end": 118.0, "text": "Ich muss mich mehr hydraten, Leute."}, {"id": 12, "start": 125.0, "end": 127.0, "text": "Hydrated stayen muss ich."}, {"id": 13, "start": 127.0, "end": 143.0, "text": "Was ist denn die deutsche Variante? Hydriert? Was heißt denn das? Hydriert? Sagt auch kein Mensch. Bewässert? Befeuchtet?"}, {"id": 14, "start": 147.0, "end": 149.0, "text": "Was ist die deutsche Variante?"}, {"id": 15, "start": 149.0, "end": 159.0, "text": "Das erinnert mich immer wieder an meinen Englisch-Lehrer, der auf Deutsch anstatt Subscription hat er gesagt, subscribieren."}, {"id": 16, "start": 160.0, "end": 168.0, "text": "Das war eines der wirklich misshandelsten Wörter, die ich je gehört habe. Subscribieren, Alter."}, {"id": 17, "start": 169.0, "end": 175.0, "text": "Ich weiß nicht, dem ist wahrscheinlich auch nicht das deutsche Wort dazu eingefallen."}, {"id": 18, "start": 175.0, "end": 190.0, "text": "Aber gut, der war auch ein Jahr vor Rente und ist dann gleich wieder abgehauen danach. Der hat uns ein Jahr ertragen müssen und danach war er weg für immer. Benetzen."}, {"id": 19, "start": 190.0, "end": 211.0, "text": "Ich muss mal kurz meinen Streamchat refreshen auf der anderen Seite. Die Chatnachrichten kommen ultra verzögert an gerade. Ich muss das mal kurz selbst testen. Achtung."}, {"id": 20, "start": 211.0, "end": 232.0, "text": "Keck. Ja doch, jetzt kommt es gleichzeitig. Du kannst nur subtrahieren. Ja deine CPU kann auch nicht mal das. Deine CPU kann addieren und subtrahiert damit."}, {"id": 21, "start": 232.0, "end": 246.0, "text": "Und noch schlimmer, die multipliziert sogar damit und definiert dadurch. Die kann eigentlich nur plus rechnen. Aber mit Overflow, das ist der Trick dabei."}, {"id": 22, "start": 246.0, "end": 266.0, "text": "5-Sec-Delay, ich hatte 20-30 Sekunden Unterschied. Hier die letzte Nachricht von Fips, die kam, weiß nicht ob man hier irgendwie die Message, kann ich das hier einschalten?"}, {"id": 23, "start": 266.0, "end": 293.0, "text": "FFZ Control Center, Timestamps oder so. Ich muss mal das dumme E-Mode weg machen, der Bayer. Timestamps. Timestamps. Wie macht man Timestamps an? Ich schwaße es nicht."}, {"id": 24, "start": 296.0, "end": 315.0, "text": "Timestamps. Ja, hier 18.37 Uhr kam die Message und drüben kam die Message 18.39 Uhr. Nee. 18.37 Uhr, also war eine Minute zwischen den Messages Unterschied."}, {"id": 25, "start": 315.0, "end": 330.0, "text": "Ne, 17.37 Uhr und da drüben kam sie angeblich auch um 17.37 Uhr. Hä? Das ergibt keinen Sinn, das kam eindeutig später. Man weiß es nicht. Aber mache ich das mal wieder aus, das irritiert hier."}, {"id": 26, "start": 330.0, "end": 358.0, "text": "Ich kann den Chat? Ne, ich lasse das so oder? Eins größer können wir machen, da könnt ihr es vielleicht einfacher lesen. So, Timestamps füllen die Messages aus. So, also, nachdem wir uns jetzt hier mit den Randerscheinungen und, Alter, der Max Power ging heute Morgen ab, ne, auseinandergesetzt haben, ich zeige euch mal kurz, was wir gestern gemacht haben und dann wo wir heute dran weiter basteln."}, {"id": 27, "start": 358.0, "end": 385.0, "text": "Ja, hast du das Remake? Hast du das Alarmstufe Rot und Einser Remake oder hast du irgendwas anderes? Es gibt ja genug, die man mittlerweile mit Fan-Patches sogar in 16.9, 4K, sonst was spielt. Alarmstufe Rot gibt es einen 4K-Patch. Oder zumindest in 16.9 High-Res-Patch. Das ist ziemlich nice."}, {"id": 28, "start": 385.0, "end": 410.0, "text": "Man weiß es. Ja, mal zur Erinnerung, um was es eigentlich geht. Ich habe mir bei Amazon ein Dymo Label Writer 450 gekauft. Noch ohne DRM, so ein Teil hier."}, {"id": 29, "start": 410.0, "end": 424.0, "text": "Und das Problem damit ist, soll ich euch mal die offizielle Windows-Software zeigen? Ich zeige euch mal, wie painst-champig diese Windows-Software ist. Wobei, so schlimm ist die eigentlich gar nicht."}, {"id": 30, "start": 424.0, "end": 451.0, "text": "Aber ich will keine, nee, ich zeige, nee doch, nee, die ist eklig, die braucht Admin-Rechte zum installieren, was auch immer. Die zeige ich euch nicht. Ich zeige euch Screenshots davon, ich installiere die nicht. Die sieht schon etwas deplatziert. Hier sieht man ein Video davon. Die sieht schon etwas deplatziert aus, diese Software. So als hätten die, keine Ahnung, war auch immer mit einem Microsoft-Account, keine Ahnung."}, {"id": 31, "start": 451.0, "end": 463.0, "text": "Also, die sieht schon ziemlich painst-champig aus. So, aber so viele Features will ich nicht haben. Die Sache ist die, guck mal, die können auch Barcodes und QR-Codes inserten. Kann ich auch, kein Ding."}, {"id": 32, "start": 463.0, "end": 490.0, "text": "Nee, die kann auch nicht viel mehr, als das, was ich gebaut habe. Keg. Die Musik ist ein bisschen laut. Immer noch. Mach mal eins weiter und mal gucken. Ja, das ist okay."}, {"id": 33, "start": 490.0, "end": 507.0, "text": "Ähm, ja. Und das Problem an diesem Label-Drucker ist, dass die neueren Versionen von Dymo, das ist jetzt unabhängig von dem Drucker, die haben DRM in ihrem Etiketten drinnen."}, {"id": 34, "start": 507.0, "end": 522.0, "text": "Nämlich, die neueren Drucker von Dymo fressen nur Original-Etiketten, weil die irgendeinen Kopierschutz in Form von einem RFID-Chip im Band drinnen haben. Was auch immer sich die dabei gedacht haben, keine Ahnung."}, {"id": 35, "start": 523.0, "end": 531.0, "text": "Aber ich hab zum Glück noch einen Drucker, der hat keinen DRM. Aber eine Sache, die mich halt daran stört, ist, du kannst das Ding halt nicht gescheit über das Netzwerk bedienen."}, {"id": 36, "start": 531.0, "end": 538.0, "text": "Die iOS-App ist mega beschissen. Guckt euch das mal an. Das ist legit die schlecht bewertetste iOS-App, die ich je gesehen hab."}, {"id": 37, "start": 538.0, "end": 549.0, "text": "Also das musste er erst mal schaffen. 1,3 Sterne. Und die Bewertungen sind nun wirklich absoluter Bodensatz, ist die App."}, {"id": 38, "start": 550.0, "end": 555.0, "text": "Ja. Android ist auch nicht viel besser."}, {"id": 39, "start": 555.0, "end": 569.0, "text": "Die haben sich's redlich verdient. 1,8 Sterne und beim anderen 1,3 Sterne. Also die, die Mobile-App ist Müll. Zumal du die Mobile-App gar nicht so einfach verwenden kannst."}, {"id": 40, "start": 570.0, "end": 577.0, "text": "So. Und was ich mir jetzt gedacht hab, ist folgendes. Ich will weder den Treiber installieren, noch die App."}, {"id": 41, "start": 577.0, "end": 591.0, "text": "Brother Label Drucker. Sag mal ein. Sag mal ein. Brother Label QL700. 152 Euro. Ok, das ist ungefähr kleiner als das, was ich mir gedacht hab."}, {"id": 42, "start": 591.0, "end": 608.0, "text": "Brother Label Drucker. Sag mal ein. Sag mal ein. Brother Label QL700. 152 Euro. Ok, das ist ungefähr gleiche Preisklasse."}, {"id": 43, "start": 608.0, "end": 630.0, "text": "Sieht ähnlich aus. Was ist denn der Unterschied zwischen QL und DT? Schauen wir mal kurz. Business-Drucker, Mobil-Drucker, Etikettendrucker, Industrie-Etiketten."}, {"id": 44, "start": 630.0, "end": 651.0, "text": "Was muss ich denn da jetzt suchen? Farbetikettendrucker, Desktop-Etikettendrucker. Zu was? QL. Thermo-Direct."}, {"id": 45, "start": 660.0, "end": 677.0, "text": "Na ja. Haben die ordentliche Linux-Driver? GitHub. Schauen wir mal. Python gibt es. Eine Python-Library."}, {"id": 46, "start": 677.0, "end": 690.0, "text": "Python-Package. Aha. Hat das ein Web-Interface? Guck mal, die haben ein Web-Interface gebaut."}, {"id": 47, "start": 691.0, "end": 700.0, "text": "Ja. So kann man das auch machen. Find ich tatsächlich ganz gute Idee."}, {"id": 48, "start": 700.0, "end": 713.0, "text": "Letztendlich funktioniert das Frontend, was ich baue, aber für mehr oder weniger alle Drucker dieser Art. Solange es Linux-Driver gibt."}, {"id": 49, "start": 713.0, "end": 733.0, "text": "Haben die ordentliche Linux-Driver? Krupps."}, {"id": 50, "start": 733.0, "end": 759.0, "text": "Anscheinend. Der Stefan blockt es. Okay, nice. Nice, wenn der Stefan das blockt."}, {"id": 51, "start": 759.0, "end": 769.0, "text": "Okay, wahrscheinlich kein großer Akt. Na gut. Letztendlich ist es auch egal. Das funktioniert mit allen solchen Druckern."}, {"id": 52, "start": 770.0, "end": 780.0, "text": "Bloodsnake. Danke für den Sub. Hab ich gar nicht gesehen. Nicht geguckt. So, zumindest den Drucker haben wir ausprobiert letztens im Stream."}, {"id": 53, "start": 780.0, "end": 794.0, "text": "Haben gecheckt, wie man den unter Linux installiert. Das sah dann so aus. Ja. Guckt. So sah das dann aus."}, {"id": 54, "start": 794.0, "end": 809.0, "text": "Haben wir gedruckt auf einem sehr aufgeräumten Basteltisch. Benutzst du eine US-Tastatur? Nee. Da. Da hat es gedruckt."}, {"id": 55, "start": 809.0, "end": 825.0, "text": "Texte einfügen ist noch nicht ready. Aber gleich. So, und was wir gestern gemacht haben ist folgendes."}, {"id": 56, "start": 826.0, "end": 833.0, "text": "Wir haben einen Web-Editor gebaut für Etiketten. Weil ich schon immer mal ein bisschen Grafikzeuge in JavaScript machen wollte."}, {"id": 57, "start": 833.0, "end": 845.0, "text": "Ja, guck. Da kannst du zum Beispiel QR-Codes inserten. In dein Etikett. Oder Material-Design-Icons inserten in dein Etikett."}, {"id": 58, "start": 846.0, "end": 855.0, "text": "Ich versuche automatisch zu tracken und droppen. Lul."}, {"id": 59, "start": 855.0, "end": 865.0, "text": "Und heute machen wir noch Text. Achso. Und das Wichtigste habe ich ja ganz vergessen euch zu zeigen. KeckW, FFZ. Und man kann Bilder Copy-Pasten."}, {"id": 60, "start": 866.0, "end": 880.0, "text": "Copy-Image. Bam. Was macht der Kreis? Der ist da. Der ist da, weil das das Test-Shape ist, mit dem ich getestet habe, wie die Library so grob funktioniert um was zu malen."}, {"id": 61, "start": 880.0, "end": 889.0, "text": "Der hat keinen Sinn, dass der Kreis da ist. Wir bräuchten im Hintergrund eigentlich noch was, was anzeigt, wie groß das Etikett, was ausgewählt wurde, wirklich ist."}, {"id": 62, "start": 890.0, "end": 897.0, "text": "Eigentlich bräuchten wir hier noch irgendeinen Dropdown."}, {"id": 63, "start": 898.0, "end": 905.0, "text": "Oh, das Auf- und Schließen geht nicht, Leute. Lul. Warum ist das Auf- und Schließen kaputt?"}, {"id": 64, "start": 905.0, "end": 912.0, "text": "Irgendwas haben wir kaputt gemacht, ja. Keck."}, {"id": 65, "start": 913.0, "end": 916.0, "text": "Das Auf- und Schließen geht nicht mehr."}, {"id": 66, "start": 917.0, "end": 921.0, "text": "Ja, eigentlich müssen wir hier oben noch irgendwie ein Selection machen, welche Label."}, {"id": 67, "start": 922.0, "end": 928.0, "text": "Wobei, das können wir eigentlich hier machen. Da machen wir hier so ein Menü mit irgendeinem Settings-Icon."}, {"id": 68, "start": 928.0, "end": 937.0, "text": "Ist die Fläche nicht eins zu eins? Nee, aktuell ist die Fläche so groß wie mein Monitor."}, {"id": 69, "start": 938.0, "end": 945.0, "text": "Eins zu eins können wir aber auch schlecht machen, weil die Labels sind zum Beispiel 86 x 89 Millimeter."}, {"id": 70, "start": 946.0, "end": 950.0, "text": "Das wäre quasi so. Das ist ein bisschen klein."}, {"id": 71, "start": 950.0, "end": 958.0, "text": "Aber was wir machen können, ist was, was quasi die gleiche Aspect Ratio hat, ungefähr, wie das Label."}, {"id": 72, "start": 959.0, "end": 964.0, "text": "Aber halt auf die Größe vom Bildschirm. Und dann mache ich hier, deshalb habe ich mir zumindest gedacht,"}, {"id": 73, "start": 965.0, "end": 974.0, "text": "da machen wir hier so ein Get-Wrecked-Tangle, ein Rechteck hin, wo man sieht, wo das anfängt und wo das aufhört."}, {"id": 74, "start": 974.0, "end": 976.0, "text": "Aber heute müssen wir uns erstmal darum kümmern."}, {"id": 75, "start": 977.0, "end": 979.0, "text": "Guck mal, wie viele QR-Codes ich hier eingefügt habe."}, {"id": 76, "start": 980.0, "end": 983.0, "text": "Erstmal darum kümmern, dass wir noch ein bisschen mehr malen können."}, {"id": 77, "start": 984.0, "end": 987.0, "text": "Vor allem, dass wir ordentlich Text einfügen können. Aktuell können wir keinen Text einfügen."}, {"id": 78, "start": 988.0, "end": 990.0, "text": "Wir können bloß QR-Codes einfügen, was ziemlich sinnlos ist."}, {"id": 79, "start": 991.0, "end": 996.0, "text": "Ja, also Text einfügen müssen wir auf jeden Fall machen."}, {"id": 80, "start": 996.0, "end": 1005.0, "text": "Und wir müssen das auch ein bisschen modularisieren, also das hier muss in eine eigene Component,"}, {"id": 81, "start": 1006.0, "end": 1011.0, "text": "dass ich das hier als Menü verwenden kann und nicht quasi ein Menü brauche pro Button und sowas. Das ist eklig."}, {"id": 82, "start": 1016.0, "end": 1019.0, "text": "Ach ja, und das eine Sache, das machen wir zuerst."}, {"id": 83, "start": 1019.0, "end": 1025.0, "text": "Ich muss mal kurz gucken, wie wir das hier gemacht haben. Insert, QR-Code, Insert, Show Icon Browser."}, {"id": 84, "start": 1028.0, "end": 1030.0, "text": "Warum geht denn das denn auf und zu?"}, {"id": 85, "start": 1031.0, "end": 1033.0, "text": "Show Icon Browser."}, {"id": 86, "start": 1041.0, "end": 1043.0, "text": "Ich habe keine Ahnung, was ich da mache, aber..."}, {"id": 87, "start": 1043.0, "end": 1049.0, "text": "Normalerweise sollte... Ah, ich heide das nicht mehr. Moment."}, {"id": 88, "start": 1050.0, "end": 1059.0, "text": "Icon Browser, Class, Hidden, wenn nicht Icon Browser geschaut werden soll."}, {"id": 89, "start": 1061.0, "end": 1065.0, "text": "So, und ihr stellt fest, es ist laggy. Es ist richtig laggy."}, {"id": 90, "start": 1065.0, "end": 1072.0, "text": "Guckt mal, ich zeige euch das mal kurz, wann ich klicke. Habt ihr den Klick gehört?"}, {"id": 91, "start": 1073.0, "end": 1078.0, "text": "Also sprich, wenn ich klicke, geht es zu, geht es schnell, aber wenn ich klicke zum Aufmachen, das laggt eine Sekunde."}, {"id": 92, "start": 1079.0, "end": 1086.0, "text": "Und das liegt daran, weil der 6.800 Icons oder so hier reinrendert. Das ist ein bisschen viel."}, {"id": 93, "start": 1086.0, "end": 1095.0, "text": "So, minimal, minimal viel. Aber eine Sache haben wir schon relativ gut gemacht, gestern."}, {"id": 94, "start": 1096.0, "end": 1100.0, "text": "Das hier sind SVGs, also sprich, das kannst du skalieren, wie du willst."}, {"id": 95, "start": 1101.0, "end": 1103.0, "text": "Und es bleibt immer..."}, {"id": 96, "start": 1103.0, "end": 1112.0, "text": "Ähnlich, ähnlich groß. Sagt man, wie kriege ich denn den Rand weg? Ihr habt doch, ihr habt doch da sicherlich Plan von."}, {"id": 97, "start": 1116.0, "end": 1118.0, "text": "Insert Icon."}, {"id": 98, "start": 1118.0, "end": 1131.0, "text": "Legt das, legt das am Viewport? Wie kriege ich den Rand hier drum herum weg? Ist das der Viewport bei einem SVG?"}, {"id": 99, "start": 1131.0, "end": 1148.0, "text": "Hat es Welt, kein Virtual Scrolling. Als Zusatzpaket schon, ja, das werden wir wahrscheinlich auch verwenden."}, {"id": 100, "start": 1149.0, "end": 1153.0, "text": "Ist das hier, was ist denn, wenn ich das auf 0-0 stelle, ist dann der Rand weg?"}, {"id": 101, "start": 1153.0, "end": 1161.0, "text": "Nee, dann wird es gar nicht angezeigt, okay."}, {"id": 102, "start": 1162.0, "end": 1170.0, "text": "Ähm, ach, das liegt hier, Breite Höhe daran, legt das, glaube ich."}, {"id": 103, "start": 1171.0, "end": 1175.0, "text": "Das ist ein bisschen davon abhängig."}, {"id": 104, "start": 1175.0, "end": 1188.0, "text": "Ja, das liegt an der Breite Höhe, die ich hier, also wenn ich jetzt zum Beispiel, keine Ahnung, 200 mache, dann ist wahrscheinlich, weil er das skaliert..."}, {"id": 105, "start": 1189.0, "end": 1195.0, "text": "Ja, gut, der muss das immer skalieren. Ach, was weiß ich, ich lasse es jetzt einfach mal auf 100, 100."}, {"id": 106, "start": 1196.0, "end": 1202.0, "text": "Zumindest, das ist das erste, was wir machen müssen. Und ich glaube, eine Sache machen wir vorher noch, weil ich glaube, das ist ziemlich einfach."}, {"id": 107, "start": 1202.0, "end": 1209.0, "text": "Die Sache ist nämlich, der Drucker, der kann ja nur schwarz-weiß. Und wenn ich Bilder einfüge, die sind in Farbe."}, {"id": 108, "start": 1210.0, "end": 1215.0, "text": "Das sieht vielleicht cooler aus, entspricht aber nicht so wirklich der Repräsentation, so wie das dann im Etikett aussieht."}, {"id": 109, "start": 1216.0, "end": 1220.0, "text": "Das heißt, wenn ich das Bild einfüge, mache ich noch irgendeinen Cray-Scale-Filter drüber."}, {"id": 110, "start": 1221.0, "end": 1225.0, "text": "Ich glaube, das ist ziemlich einfach, das habe ich nämlich schon auf den ihrer Seite gesehen."}, {"id": 111, "start": 1226.0, "end": 1230.0, "text": "Guck mal, wo füge ich denn das Image ein? Da."}, {"id": 112, "start": 1230.0, "end": 1236.0, "text": "Insert QR-Code, nee. Handle-Paste, da füge ich das Image ein."}, {"id": 113, "start": 1237.0, "end": 1244.0, "text": "From-Url-Image, so, dass wir sowas machen können wie Image-Cray-Scale oder sowas."}, {"id": 114, "start": 1245.0, "end": 1250.0, "text": "Honva-Cray-Scale. Das muss man auch denen mal wirklich lassen."}, {"id": 115, "start": 1251.0, "end": 1257.0, "text": "Die haben ziemlich nice Dokus, also, die verlassen sich nicht darauf, dass ihr Code sich selbst dokumentiert."}, {"id": 116, "start": 1257.0, "end": 1260.0, "text": "Es ist richtig gut, du findest dir für fast alles was."}, {"id": 117, "start": 1261.0, "end": 1265.0, "text": "So, und man muss einfach sagen, Filter-Cray-Scale und das war's."}, {"id": 118, "start": 1266.0, "end": 1275.0, "text": "Also, das heißt, von der Idee her, wenn ich das jetzt richtig mache, sage ich ihm, Image-Cache-Image-Filter-Cray-Scale."}, {"id": 119, "start": 1276.0, "end": 1279.0, "text": "So, und das sollte jetzt das einzige sein, was ich machen muss."}, {"id": 120, "start": 1280.0, "end": 1283.0, "text": "Wenn ich jetzt CACW-Copy-Paste, ist es schwarz-weiß."}, {"id": 121, "start": 1283.0, "end": 1286.0, "text": "Oh, das ist gar nichts mehr."}, {"id": 122, "start": 1289.0, "end": 1291.0, "text": "Oder ich hab's kaputt gemacht."}, {"id": 123, "start": 1299.0, "end": 1301.0, "text": "Hä? Hab ich das Image dann richtig kopiert?"}, {"id": 124, "start": 1302.0, "end": 1304.0, "text": "Ah, ich hab das Image dann richtig kopiert."}, {"id": 125, "start": 1307.0, "end": 1309.0, "text": "Jetzt ist es grau, okay."}, {"id": 126, "start": 1309.0, "end": 1314.0, "text": "Guck, jetzt konvertiert er das in ein schwarz-weißes CACW."}, {"id": 127, "start": 1315.0, "end": 1317.0, "text": "Was auch viel besser ist."}, {"id": 128, "start": 1320.0, "end": 1327.0, "text": "Das entspricht viel eher dem, wie man das beim Drucker dann auch am Ende sieht."}, {"id": 129, "start": 1328.0, "end": 1330.0, "text": "Black and white CACW."}, {"id": 130, "start": 1334.0, "end": 1336.0, "text": "So, gut."}, {"id": 131, "start": 1336.0, "end": 1342.0, "text": "Was hab ich gesagt? Ach so, das Gelegge machen wir als nächstes, dass das hier so laggy ist."}, {"id": 132, "start": 1343.0, "end": 1348.0, "text": "So, dann hab ich was gefunden auf Shithub, nämlich githubs-welt-virtual-list."}, {"id": 133, "start": 1349.0, "end": 1352.0, "text": "Macht das File-Browser-Icon schon etwas?"}, {"id": 134, "start": 1353.0, "end": 1356.0, "text": "Das File-Browser-Icon fügt einen QR-Code ein, das ist Schwachsinn."}, {"id": 135, "start": 1357.0, "end": 1363.0, "text": "Nee, das macht noch nichts. Also, du brauchst den File-Browser auch nur am Rande, weil du kannst ja Copy-Paste-Images machen."}, {"id": 136, "start": 1363.0, "end": 1370.0, "text": "Aber File-Browser mach ich dann in Pop-Up oder so, wo du Datei öffnen, uploaden machen kannst."}, {"id": 137, "start": 1371.0, "end": 1375.0, "text": "Also nicht uploaden, sondern Browser öffnen machen kannst. Das sollte relativ easy werden."}, {"id": 138, "start": 1376.0, "end": 1380.0, "text": "Jetzt kümmern wir uns erstmal darum, dass das hier nicht mehr so laggy ist."}, {"id": 139, "start": 1381.0, "end": 1383.0, "text": "Weil das ist ja nicht wirklich bedienbar."}, {"id": 140, "start": 1384.0, "end": 1388.0, "text": "So, was ich da gefunden hab, ist sowas hier. Guck mal. Svelte-Virtual-List."}, {"id": 141, "start": 1388.0, "end": 1392.0, "text": "Und von der Idee her ist das relativ easy."}, {"id": 142, "start": 1393.0, "end": 1401.0, "text": "Du installierst das, importierst das, legst eine Liste an und dann sagst du ihm, wie er die Items rendern soll."}, {"id": 143, "start": 1402.0, "end": 1410.0, "text": "Und dann checkt er, welches Item ist sichtbar hier im Scroll Viewport und welches nicht."}, {"id": 144, "start": 1411.0, "end": 1415.0, "text": "Und er lädt das dann nur rein, wenn es sichtbar ist. Das sollte es deutlich schneller machen."}, {"id": 145, "start": 1415.0, "end": 1421.0, "text": "Aber ist das Cray-Scale nicht falsch, weil der Drucker keine Graustufen kann?"}, {"id": 146, "start": 1422.0, "end": 1424.0, "text": "Doch, der Drucker kann, glaube ich, Graustufen."}, {"id": 147, "start": 1425.0, "end": 1433.0, "text": "QR-Code-Scan. Warum? Ich will kein QR-Code-Scan, ich will QR-Code-Generieren."}, {"id": 148, "start": 1434.0, "end": 1435.0, "text": "Das funktioniert jetzt schon, den QR-Code-Generieren."}, {"id": 149, "start": 1436.0, "end": 1439.0, "text": "Hier, guck mal. Natürlich auch ohne, nur mit Beispieltext."}, {"id": 150, "start": 1440.0, "end": 1441.0, "text": "Scannen, warum willst du QR-Code-Scan?"}, {"id": 151, "start": 1441.0, "end": 1453.0, "text": "Also das mit Cray-Scale kann der Drucker, würde ich jetzt mal sagen, weil es sah zumindest so aus."}, {"id": 152, "start": 1460.0, "end": 1463.0, "text": "Guckt euch mal die Beispiele an, die ich hier ausgedruckt habe."}, {"id": 153, "start": 1465.0, "end": 1466.0, "text": "Naja."}, {"id": 154, "start": 1466.0, "end": 1480.0, "text": "So, das habe ich ausgedruckt. Guck, das sieht schon nach Cray-Scale aus, das grüne hier vom Frosch."}, {"id": 155, "start": 1480.0, "end": 1498.0, "text": "Ich meine, der trickst natürlich ein bisschen und lässt weiß vom Etikett und sowas."}, {"id": 156, "start": 1499.0, "end": 1501.0, "text": "Also das sieht schon Cray-Scale aus."}, {"id": 157, "start": 1501.0, "end": 1510.0, "text": "Aber nur so nach 3-4 unterschiedlichen Stufen, ja wahrscheinlich, aber was soll ich machen?"}, {"id": 158, "start": 1511.0, "end": 1514.0, "text": "Es muss erstmal so bleiben."}, {"id": 159, "start": 1515.0, "end": 1519.0, "text": "Es sieht auf jeden Fall realistischer aus als in Farbe."}, {"id": 160, "start": 1520.0, "end": 1524.0, "text": "So, aber jetzt müssen wir erstmal machen, dass es nicht mehr so leckt."}, {"id": 161, "start": 1524.0, "end": 1531.0, "text": "Also installieren wir jetzt virtualist. NPM install."}, {"id": 162, "start": 1532.0, "end": 1537.0, "text": "Leute, kann man das einfach so hinschreiben oder muss ich das quoteen, wenn da Ads und sonstige Sachen davor sind?"}, {"id": 163, "start": 1538.0, "end": 1540.0, "text": "Ich quote das mal lieber."}, {"id": 164, "start": 1541.0, "end": 1545.0, "text": "Was? Hab ich das gerade richtig gesehen? Bild Android 64?"}, {"id": 165, "start": 1546.0, "end": 1550.0, "text": "Habt ihr das auch gerade gelesen, dass da was von Android 64 stand?"}, {"id": 166, "start": 1550.0, "end": 1555.0, "text": "Ich will es gar nicht genau wissen. Hauptsache es funktioniert, es ist mir egal, ob es für Android ist."}, {"id": 167, "start": 1556.0, "end": 1559.0, "text": "Ja, aber Skript ist ja nicht plattformspezifisch auf der Ebene."}, {"id": 168, "start": 1560.0, "end": 1563.0, "text": "So, virtualist und jetzt fügen wir hier eine Liste ein."}, {"id": 169, "start": 1564.0, "end": 1568.0, "text": "Ach, du meinst das Icon QR-Code-Scan."}, {"id": 170, "start": 1569.0, "end": 1572.0, "text": "Warte mal, können wir uns ja mal vergleichen."}, {"id": 171, "start": 1573.0, "end": 1576.0, "text": "Hier Material-Icons. QR-Code."}, {"id": 172, "start": 1576.0, "end": 1580.0, "text": "Also das haben wir und du würdest das verwenden?"}, {"id": 173, "start": 1581.0, "end": 1583.0, "text": "Hm, ich weiß nicht. Wir scannen ja nicht."}, {"id": 174, "start": 1584.0, "end": 1591.0, "text": "Wahrscheinlich ist am besten das hier QR-Code plus, weil wir fügen den QR-Code hinzu."}, {"id": 175, "start": 1595.0, "end": 1600.0, "text": "Das können wir übrigens an der Stelle auch mal machen. Aktuell habe ich das ja noch hier embedded, die Icons."}, {"id": 176, "start": 1601.0, "end": 1603.0, "text": "Aber wir haben ja eine MDI-Library drinne."}, {"id": 177, "start": 1603.0, "end": 1606.0, "text": "Also eigentlich kann ich an der Stelle sagen,"}, {"id": 178, "start": 1612.0, "end": 1615.0, "text": "eigentlich kann ich an der Stelle sagen, so das ist QR-Code,"}, {"id": 179, "start": 1616.0, "end": 1623.0, "text": "kann ich sagen Icons QR-Code."}, {"id": 180, "start": 1623.0, "end": 1630.0, "text": "Ich weiß nicht. Nee. Oder auch nicht."}, {"id": 181, "start": 1630.0, "end": 1647.0, "text": "Okay. Warum nicht?"}, {"id": 182, "start": 1652.0, "end": 1657.0, "text": "Das mache ich doch hier auch so. Icons, Icon."}, {"id": 183, "start": 1657.0, "end": 1660.0, "text": "Keine Ahnung."}, {"id": 184, "start": 1663.0, "end": 1668.0, "text": "Vielleicht mal kurz anzeigen lassen. Icons."}, {"id": 185, "start": 1669.0, "end": 1671.0, "text": "Morgen KS."}, {"id": 186, "start": 1672.0, "end": 1677.0, "text": "Das war vielleicht keine so gute Idee. Icons hier rein zu hauen."}, {"id": 187, "start": 1677.0, "end": 1682.0, "text": "Ja, Lock. Wir müssen das unbedingt ein bisschen modularisieren, das ist zu viel."}, {"id": 188, "start": 1683.0, "end": 1685.0, "text": "Was?"}, {"id": 189, "start": 1687.0, "end": 1689.0, "text": "Modular. Ach nee."}, {"id": 190, "start": 1690.0, "end": 1696.0, "text": "Das ist, das ist wirklich sehr abartig gemacht, wie ich das ja hier."}, {"id": 191, "start": 1698.0, "end": 1700.0, "text": "MDI."}, {"id": 192, "start": 1700.0, "end": 1706.0, "text": "Wo sind dann, wo sind dann die QR-Codes Leute hier? QR, QR."}, {"id": 193, "start": 1707.0, "end": 1712.0, "text": "Wo ist es denn? Kann man da nichts nicht geschaffen? Alter 6000 der Icons, man."}, {"id": 194, "start": 1717.0, "end": 1721.0, "text": "MDI QR-Code vielleicht, ja. Tatsächlich, wahrscheinlich."}, {"id": 195, "start": 1722.0, "end": 1726.0, "text": "Kannst du das Icon nicht als Objekt in der Hand nehmen?"}, {"id": 196, "start": 1726.0, "end": 1730.0, "text": "Tatsächlich, wahrscheinlich. Kannst du das Icon nicht als Objekt importieren? Doch."}, {"id": 197, "start": 1731.0, "end": 1734.0, "text": "Für die Verwendung hier unten wäre das tatsächlich sinnvoller."}, {"id": 198, "start": 1735.0, "end": 1742.0, "text": "Aber für das, was ich hier mache, nämlich 6000 Icons on the fly generieren, kann ich sie nicht einzeln importieren."}, {"id": 199, "start": 1744.0, "end": 1749.0, "text": "Also ich könnte quasi die Icons, die ich brauche in irgendeine Icon-Component rappen oder so."}, {"id": 200, "start": 1749.0, "end": 1755.0, "text": "Das wäre vielleicht MDI QR-Code."}, {"id": 201, "start": 1756.0, "end": 1758.0, "text": "No."}, {"id": 202, "start": 1759.0, "end": 1763.0, "text": "Ähm, wie suche ich denn da drinnen jetzt gescheiter?"}, {"id": 203, "start": 1764.0, "end": 1768.0, "text": "Weißt du was? Ich mach jetzt, ich mach jetzt die Noob-Variante."}, {"id": 204, "start": 1769.0, "end": 1772.0, "text": "Boah. Boah. So."}, {"id": 205, "start": 1772.0, "end": 1783.0, "text": "Oder Log. Da sind wir doch. Also QR-Code."}, {"id": 206, "start": 1787.0, "end": 1789.0, "text": "QR? QR?"}, {"id": 207, "start": 1789.0, "end": 1802.0, "text": "Hier. MDI QR-Code. Was ist denn das für eine wirre Schreibweise?"}, {"id": 208, "start": 1803.0, "end": 1807.0, "text": "MDI QR-Code."}, {"id": 209, "start": 1807.0, "end": 1819.0, "text": "What the f... Bin ich jetzt zu... Ach so."}, {"id": 210, "start": 1820.0, "end": 1826.0, "text": "Moment. Das ist nicht Console-Log, Leute. Ich bin heute nicht richtig bei der Sache."}, {"id": 211, "start": 1827.0, "end": 1833.0, "text": "Ja, das sieht gut aus. Also MDI QR-Code. Das müsste meine extra Icon-Component rappen oder so."}, {"id": 212, "start": 1833.0, "end": 1839.0, "text": "Das ist dann schöner. Aber dafür tut es jetzt erstmal."}, {"id": 213, "start": 1840.0, "end": 1844.0, "text": "Da haben wir es wieder. QR-Code und das andere ist QR-Code Scan."}, {"id": 214, "start": 1845.0, "end": 1854.0, "text": "Leute, was findet ihr besser? Das da oder das da? Oder QR-Code Plus haben wir auch noch zu bieten."}, {"id": 215, "start": 1854.0, "end": 1864.0, "text": "Ich bin ja für das normale QR-Code, ehrlich gesagt. Oder das mit dem Plus. Plus, weil wir adden ja. Weil wir adden ja."}, {"id": 216, "start": 1864.0, "end": 1884.0, "text": "Da ist was mit dem Plus vielleicht gar nicht verkehrt."}, {"id": 217, "start": 1885.0, "end": 1888.0, "text": "Weißt was? Ich ersetz den Kram hier auch gerade nochmal."}, {"id": 218, "start": 1888.0, "end": 1896.0, "text": "Ach, scheiß drauf. Das machen wir eh als Icon-Component später. Das ist ja abartig so. Das kann man überhaupt nicht richtig verwenden."}, {"id": 219, "start": 1897.0, "end": 1904.0, "text": "Okay. Also, wo sind wir denn stehen geblieben? Was ist denn jetzt die eigentliche Geschichte, die ich machen wollte?"}, {"id": 220, "start": 1904.0, "end": 1921.0, "text": "Das ist nicht so leckt. Guckt euch das mal an. Das ist echt nicht normal."}, {"id": 221, "start": 1921.0, "end": 1933.0, "text": "Dann gehen wir an die Stelle, wo ich die Icons rendere. Hier render ich die Icons."}, {"id": 222, "start": 1934.0, "end": 1938.0, "text": "Von der Idee her müsste das so aussehen. Items filtert Icons."}, {"id": 223, "start": 1938.0, "end": 1952.0, "text": "Item gleich, wie möchte ich das? Es heißt Icon. Ist schon nicht verkehrt. So, und anstatt ein Each zu machen, rendern wir jetzt mal das Diff da rein."}, {"id": 224, "start": 1953.0, "end": 1955.0, "text": "Und mal gucken, wie das dann ausschaut, ob das funktioniert."}, {"id": 225, "start": 1955.0, "end": 1970.0, "text": "Nö. Warum nicht? Wo ist das Problem? Aber es geht schnell auf."}, {"id": 226, "start": 1970.0, "end": 1987.0, "text": "Aus welchen Gründen funktioniert das jetzt nicht? Wie wäre es, dass man die Label speichern kann? Ja, ja, das muss ich auf jeden Fall noch machen."}, {"id": 227, "start": 1988.0, "end": 1991.0, "text": "Warum lädt er nicht zumindest das Icon jetzt? Das verstehe ich nicht."}, {"id": 228, "start": 1991.0, "end": 2005.0, "text": "Moment. Icon. Der macht gar nichts hier, oder? Sekunde Leute."}, {"id": 229, "start": 2005.0, "end": 2022.0, "text": "Der macht gar nichts? Warum nicht? Warum funktioniert der Krempel nicht?"}, {"id": 230, "start": 2022.0, "end": 2035.0, "text": "Show Icon. So machen wir das standardmäßig mal true, dass ich das nicht immer wieder einplanten muss. Warum macht der hier nichts? Filtert Icons."}, {"id": 231, "start": 2036.0, "end": 2048.0, "text": "Filtert Icons sollte doch eigentlich ein Array sein. Hä? Wait a minute. Warum geht das jetzt? Hä? Ah, weil ich keine Breite habe."}, {"id": 232, "start": 2048.0, "end": 2063.0, "text": "Moment, Moment, Moment. Das ergibt keinen Sinn. Das ist in irgendeinem Grid. Moment. Wartet mal. Nee, nee. Das, das, das, ähm. Wartet mal. Das, das, das, das ergibt so keinen Sinn."}, {"id": 233, "start": 2063.0, "end": 2090.0, "text": "So. Okay. Alla ja, schon besser. Ja, ja. Das war in irgendeinem Grid, was jetzt mit. Nee, nee. Das kann so nicht funktionieren. Okay. Also. Guckt mal. Es laggt null. Schaut mal hier. Bam, bam. Ups. Falscher Knopf. Ja. Ihr hört es ja im Hintergrund klicken. Also das geht wirklich instant auf und zu."}, {"id": 234, "start": 2090.0, "end": 2119.0, "text": "Ja. Nice. Doch das sind alle Elemente. Das sind alle Elemente."}, {"id": 235, "start": 2120.0, "end": 2141.0, "text": "Jetzt geht das Scrollen da drin nicht mehr, Leute. Doch, jetzt. Guck mal. Wenn ich Bild hoch, Bild runter scrolle. Ich habe volle Pulle. Wenn ich habe Scrollen. Also das ist schon einiges, was da drinne ist."}, {"id": 236, "start": 2141.0, "end": 2171.0, "text": "So. Jetzt würden wir natürlich noch schauen, dass das ordentlich verteilt wird, weil so sieht das ja ziemlich beschissen aus. Also. Icon Name kommt schon immer weg. Das brauchen wir nicht. Das brauchen wir dann zum Durchsuchen. Also. Twitter zum Beispiel. Guck mal. Das Filtern ist jetzt auch viel schneller. Seht ihr das? Twitter. Zack. Ist jetzt viel, viel zackiger jetzt alles. Jetzt müssen wir das natürlich bloß noch als. Äh. Grid wieder machen. Allerdings als Grid pro Zeile. Glaub ich. Am simpel. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja."}, {"id": 237, "start": 2171.0, "end": 2201.0, "text": "Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja"}, {"id": 238, "start": 2201.0, "end": 2206.52, "text": "Was hat er denn für schmerzen?"}, {"id": 239, "start": 2206.52, "end": 2212.04, "text": "Wenn ich da jetzt ein diff drum mache wo ist denn das problem?"}, {"id": 240, "start": 2212.04, "end": 2216.28, "text": "Ah keine höhe ok."}, {"id": 241, "start": 2216.28, "end": 2225.6, "text": "Aber selbst wenn ich selbst wenn ich da ok aber selbst wenn ich da jetzt ein diff rum"}, {"id": 242, "start": 2225.6, "end": 2230.92, "text": "mache und sag flex dann funktioniert das ja nicht weil der macht ja ein list item quasi"}, {"id": 243, "start": 2230.92, "end": 2241.08, "text": "pro oder ein diff der muss ja scrollen also ohne scrollen wird das nicht funktionieren"}, {"id": 244, "start": 2241.08, "end": 2261.32, "text": "svelte hier svelte virtual list row"}, {"id": 245, "start": 2261.32, "end": 2262.92, "text": "das wird das das funktioniert nicht"}, {"id": 246, "start": 2262.92, "end": 2269.68, "text": "komm mal hier virtual list row virtual list container style padding da kann ich überhaupt"}, {"id": 247, "start": 2269.68, "end": 2283.56, "text": "nix dran machen"}, {"id": 248, "start": 2283.56, "end": 2285.76, "text": "gibt es sowas svelte virtual grid"}, {"id": 249, "start": 2285.76, "end": 2299.32, "text": "x ne infinite meinst du das was nein reddit gehste weg"}, {"id": 250, "start": 2299.32, "end": 2308.52, "text": "ich weiß nicht ob uns das was bringt weil ich will ich will ja kein infinite scroll"}, {"id": 251, "start": 2308.52, "end": 2309.52, "text": "haben"}, {"id": 252, "start": 2309.52, "end": 2317.4, "text": "ja das hier ist infinite scroll das ist abartig das will ich nicht ich weiß ja genau wie"}, {"id": 253, "start": 2317.4, "end": 2324.04, "text": "viele items das sind ich will das nicht dynamisch nachladen bis bis zum geht nicht mehr das"}, {"id": 254, "start": 2324.04, "end": 2328.36, "text": "darf von Anfang an soll das soll das richtig voll die größe also ich habe eine idee wie"}, {"id": 255, "start": 2328.36, "end": 2332.4, "text": "wir das machen also in flexbox fällt mir als nächstes gescheites ein und ganz ehrlich"}, {"id": 256, "start": 2332.4, "end": 2337.52, "text": "ich glaube auch dass es mit flexbox nicht gescheit geht weil der das scrollen ja braucht"}, {"id": 257, "start": 2337.52, "end": 2343.36, "text": "dass der überhaupt erkennt"}, {"id": 258, "start": 2343.36, "end": 2352.28, "text": "kann ich hier disable disable scroll machen"}, {"id": 259, "start": 2352.28, "end": 2358.68, "text": "dass er überhaupt erkennt wann was in view ist und wo nicht wir können mal bei denen"}, {"id": 260, "start": 2358.68, "end": 2367.44, "text": "auf der seite kurz schauen ob wir style custom styles irgendwie machen können oder so item"}, {"id": 261, "start": 2367.44, "end": 2377.12, "text": "halt start end ne das kann man nicht sonderlich gut style"}, {"id": 262, "start": 2377.12, "end": 2385.44, "text": "wie ich kann auch nicht mal wenn ich kann auch nicht mal meine"}, {"id": 263, "start": 2385.44, "end": 2393.84, "text": "meine scrollbar auspländen na das ist na das ist aber fail ich will meine scrollbar auspländen"}, {"id": 264, "start": 2393.84, "end": 2395.76, "text": "disable scrollbar will ich machen"}, {"id": 265, "start": 2395.76, "end": 2402.48, "text": "naja das schauen wir uns dann gleich an also ich glaube aber dass ich einfach anstatt"}, {"id": 266, "start": 2402.48, "end": 2414.44, "text": "anstatt dass wir hier was außen rum machen müsste doch von der idee her nur mal so ich"}, {"id": 267, "start": 2414.44, "end": 2422.12, "text": "müsste doch eigentlich anstatt ist so dass noch mal moment ne das funk jetzt jetzt weiß"}, {"id": 268, "start": 2422.12, "end": 2426.8, "text": "ich warum das scheiß nicht funktioniert ich habe hier nur ein item guckt mal leute ich"}, {"id": 269, "start": 2426.8, "end": 2438.24, "text": "habe nur ein item pro durchlauf und das ist natürlich mist ein item pro durchlauf"}, {"id": 270, "start": 2438.24, "end": 2439.64, "text": "vielleicht kann ich doch in den crit packen"}, {"id": 271, "start": 2439.64, "end": 2444.04, "text": "ne dann rennt er da nix mehr wenn ichs in den crit packe"}, {"id": 272, "start": 2444.04, "end": 2457.32, "text": "noch mal die höhe vielleicht machen ne das änderts das änderts nicht ich muss ich muss"}, {"id": 273, "start": 2457.32, "end": 2464.96, "text": "das irgendwie segmentieren also ich muss jetzt quasi sagen also nur von der idee keine ahnung"}, {"id": 274, "start": 2464.96, "end": 2471.32, "text": "wie das funktioniert irgendwie so viel chunk chunker ein großer chunker genau ein chunk"}, {"id": 275, "start": 2471.32, "end": 2475.72, "text": "so inszener häppchen will ich das haben so in der richtung müsste ich das machen und"}, {"id": 276, "start": 2475.72, "end": 2476.72, "text": "dann könnte ich das rendern"}, {"id": 277, "start": 2476.72, "end": 2488.28, "text": "aber wie macht man denn array chunk in javascript ist sowas eingebaut schon array chunk chunked"}, {"id": 278, "start": 2488.28, "end": 2489.28, "text": "array genau"}, {"id": 279, "start": 2489.28, "end": 2504.56, "text": "stack overflow split array into chunks auf gehts ne ne ich will ein neues array haben"}, {"id": 280, "start": 2504.56, "end": 2505.56, "text": "was das macht"}, {"id": 281, "start": 2505.56, "end": 2511.8, "text": "gibts da was eingebautes mittlerweile vielleicht"}, {"id": 282, "start": 2511.8, "end": 2522.64, "text": "alter what the hell das ist ja richtig massive five hand zeug moment stack overflow antwort"}, {"id": 283, "start": 2522.64, "end": 2526.44, "text": "wir copy paste und stack overflow heute wieder das da na gut"}, {"id": 284, "start": 2526.44, "end": 2534.88, "text": "wisst ihr was wir sind wir sind äußerst stack overflow driven"}, {"id": 285, "start": 2534.88, "end": 2547.96, "text": "chunk sehr schön also probier mal das mal aus ob das jetzt funktioniert also items"}, {"id": 286, "start": 2547.96, "end": 2566.04, "text": "packen in 10er blocks so und jetzt noch mal ne schleife drum github copilot das müsste"}, {"id": 287, "start": 2566.04, "end": 2569.12, "text": "man echt ausprobieren wahrscheinlich hätte github copilot auch für mich gemacht ja das"}, {"id": 288, "start": 2569.12, "end": 2570.12, "text": "ist richtig"}, {"id": 289, "start": 2570.12, "end": 2578.08, "text": "so und jetzt kriegen wir hier allerdings ist das nicht ikon sondern ja ikons aber ikons"}, {"id": 290, "start": 2578.08, "end": 2583.84, "text": "ist schon ist schon besetzt und filtert ikons ist auch schon besetzt dann heißt es jetzt"}, {"id": 291, "start": 2583.84, "end": 2594.08, "text": "einfach chunk ich weiß nicht wie es anders sein soll so sind da jetzt sind da jetzt alle"}, {"id": 292, "start": 2594.08, "end": 2602.84, "text": "items drinne zeig mal kurz wo ist das problem jaja gehen wir fort hier"}, {"id": 293, "start": 2602.84, "end": 2623.88, "text": "mal kurz break drunter warum warum macht er das jetzt nicht untereinander"}, {"id": 294, "start": 2623.88, "end": 2638.16, "text": "klasse keine ahnung margin 5 ahja ok also 10 stück 10 stück pro zeile das ergibt doch"}, {"id": 295, "start": 2638.16, "end": 2667.2, "text": "sinn das das das passt doch also nochmal wo war mal hier stehen geblieben ihr ikons ergibt"}, {"id": 296, "start": 2667.2, "end": 2675.92, "text": "das sinn was ich mache ietsch und da jetzt eine schleife drum funsta funst das moment"}, {"id": 297, "start": 2675.92, "end": 2688.16, "text": "moment würde das so funktionieren ietsch so und da drinne das da jetzt mal für jedes"}, {"id": 298, "start": 2688.16, "end": 2703.8, "text": "ikon im chunk so nee moment und da jetzt noch ein grid drum oder dann müsste doch funktionieren"}, {"id": 299, "start": 2703.8, "end": 2714.8, "text": "ich bin ich bin verwirrt und da jetzt ein grid drum und dann gehts oder oder nicht chat"}, {"id": 300, "start": 2714.8, "end": 2735.64, "text": "beim easy alles klar mal gucken ob das jetzt irgendwie skaliert oder so ich meine es macht"}, {"id": 301, "start": 2735.64, "end": 2741.36, "text": "ich meine es macht space dazwischen es gibt schlimmeres das ist bestimmt best practice"}, {"id": 302, "start": 2741.36, "end": 2746.16, "text": "ja garantiert ist das best practice was ich hier mache ich mache ja prinzipiell nur best"}, {"id": 303, "start": 2746.16, "end": 2751.32, "text": "practice also was solls denn anderes sein außer best practice das kann ich guckt mal"}, {"id": 304, "start": 2751.32, "end": 2763.52, "text": "seht ihr wie schnell das jetzt auf und zu geht richtig prog ja huge geschwindigkeit"}, {"id": 305, "start": 2763.52, "end": 2771.12, "text": "massive speed alter kann das vielleicht was ist denn wenn ich hier die höhe und die"}, {"id": 306, "start": 2771.12, "end": 2785.52, "text": "breite rausnehme was macht dann dann boah eskaliert leute seht ihr das wtf ah aber"}, {"id": 307, "start": 2785.52, "end": 2791.8, "text": "hier ist er hier ist er hier ist er nicht schlau genug hier ist er nicht schlau genug"}, {"id": 308, "start": 2791.8, "end": 2805.24, "text": "das nachzuladen seht ihr das hier ist er nicht schlau genug das da nachzuladen aber"}, {"id": 309, "start": 2805.24, "end": 2816.0, "text": "ich glaube damit kann ich erstmal leben nee immer 10 pro zeile passt doch eigentlich"}, {"id": 310, "start": 2816.0, "end": 2829.92, "text": "ist doch ok tatsächlich funst wie kriege ich denn diese hässliche scrollbar hier nebenweg"}, {"id": 311, "start": 2829.92, "end": 2834.8, "text": "ich fürchte gar nicht ich glaube diese scrollbar muss sein sonst funktioniert wahrscheinlich"}, {"id": 312, "start": 2834.8, "end": 2842.96, "text": "die virtual list component nicht richtig also ich habe jetzt die disable scrollbar class"}, {"id": 313, "start": 2842.96, "end": 2859.28, "text": "kann man hier nicht drauf machen das mag er ja nicht boah und ks was jetzt moment das"}, {"id": 314, "start": 2859.28, "end": 2868.56, "text": "da vielleicht bisschen verkehrt so versuch mal mit css die class von der component zu"}, {"id": 315, "start": 2868.56, "end": 2877.92, "text": "überschreiben mit der scrollbar wenn ich sage hin dann kann ich nicht scrollen das"}, {"id": 316, "start": 2877.92, "end": 2882.68, "text": "ist natürlich doof ich will ich will ja scrollen so ich glaube wir müssen es noch mal kurz"}, {"id": 317, "start": 2882.68, "end": 2892.12, "text": "verraten wir brauchen noch einen repper und disables der funktioniert nicht wenn ich"}, {"id": 318, "start": 2892.12, "end": 2905.52, "text": "die scrollbar disable guckt euch das mal an der sprocken rip warum weil das flex flex"}, {"id": 319, "start": 2905.52, "end": 2932.76, "text": "ist weird flex ist das weird flex wartet mal nee moment ok aus irgendwelchen gründen funktioniert"}, {"id": 320, "start": 2932.76, "end": 2939.12, "text": "jetzt alles klar ich musste ich musste es neu laden aber jetzt geht das scrollen nicht"}, {"id": 321, "start": 2939.12, "end": 2949.88, "text": "mehr jetzt jetzt geht jetzt geht das scrollen hier drin nicht mehr und es ist auch mega"}, {"id": 322, "start": 2949.88, "end": 2961.28, "text": "langsam was ist denn da los es leckt wieder wie sau ich check ich check die javascript"}, {"id": 323, "start": 2961.28, "end": 2978.24, "text": "geschichte net das ist mir zu six hat alter wo ist denn das problem wenn da noch ein diff"}, {"id": 324, "start": 2978.24, "end": 2983.48, "text": "drum herum ist warum ist das ein problem warum wird das langsam wie sau wenn da noch ein"}, {"id": 325, "start": 2983.48, "end": 2993.4, "text": "extra diff drum ist mein who cares ob da ein diff drum ist oder nicht check ich net aber"}, {"id": 326, "start": 2993.4, "end": 3000.52, "text": "wenn ich virtual list so mache dann geht's alles klar nicht nicht dass ich es in irgendeiner"}, {"id": 327, "start": 3000.52, "end": 3008.16, "text": "Art und Weise verstehen würde aber ok so also was soll ich überschreiben die klasse von"}, {"id": 328, "start": 3008.16, "end": 3021.88, "text": "so moment was ist denn hier die scrollbar das da oder ja das da also kann ich class"}, {"id": 329, "start": 3021.88, "end": 3028.56, "text": "monka es die klasse was ist denn das das kann ich auch im leben überschreiben es ist 1.7.d"}, {"id": 330, "start": 3028.56, "end": 3034.48, "text": "hs go was ist denn das schon wieder für ein schwachsinn aber ich müsste das doch auf"}, {"id": 331, "start": 3034.48, "end": 3050.24, "text": "das element selekten können oder kann ich nicht kann ich nicht sowas machen"}, {"id": 332, "start": 3050.24, "end": 3074.16, "text": "kann ich nicht sowas machen für das element das juckt es nicht"}, {"id": 333, "start": 3074.16, "end": 3097.64, "text": "er kehrt nicht dafür keine ahnung ich habe kein blastenschimmer ich glaube wir können"}, {"id": 334, "start": 3097.64, "end": 3101.32, "text": "jetzt erstmal mit scrollbar leben ich finde es zwar nicht das ist auf jeden fall nicht"}, {"id": 335, "start": 3101.32, "end": 3106.52, "text": "aber wie sagt der weißheitsletzter schluss hier aber besser als nix vielleicht bauen"}, {"id": 336, "start": 3106.52, "end": 3113.44, "text": "wir das einfach selbst jetzt jetzt geht's erstmal weil es schön zackig ist der component"}, {"id": 337, "start": 3113.44, "end": 3122.08, "text": "eine id geben das geht nicht oder keck weh ne man kann components keine ids geben man"}, {"id": 338, "start": 3122.08, "end": 3126.56, "text": "kann die rappen in einem diff und dann eine id geben aber der witz ist ja wenn ichs in"}, {"id": 339, "start": 3126.56, "end": 3133.16, "text": "einem diff rappe dann gehts nicht mehr ich hab keine ahnung warum vielleicht liegt das"}, {"id": 340, "start": 3133.16, "end": 3141.4, "text": "moment class w12 h12 vielleicht liegt daran das keine höhe und breite hat kann er sein"}, {"id": 341, "start": 3141.4, "end": 3148.0, "text": "und es ist mega langsam dann auch also das das check ich nicht das das ist java script"}, {"id": 342, "start": 3148.0, "end": 3158.44, "text": "was daran liegen kann vielleicht macht diese komische virtualist component irgendwas merkt"}, {"id": 343, "start": 3158.44, "end": 3171.52, "text": "wirkliches ja keine ahnung weil ich mein wo ist das problem"}, {"id": 344, "start": 3171.52, "end": 3192.36, "text": "ah ok es war zu klein das das funs doch kann ich sowas wie full sagen aha full nice jetzt"}, {"id": 345, "start": 3192.36, "end": 3202.68, "text": "steckt es da im boden leute es steckt im boden so aber wie krieg ich denn jetzt kann ich"}, {"id": 346, "start": 3202.68, "end": 3212.32, "text": "es da sagen disable oder scroll scroll ne wie hab ich den kram genannt disable scrollbar"}, {"id": 347, "start": 3212.32, "end": 3231.4, "text": "nö ich kann kein scrollbar scroll oder overflow overflow hinten geht das wenigstens nö moment"}, {"id": 348, "start": 3231.4, "end": 3238.8, "text": "warum hat overflow hinten einfluss darauf wie das what alter ich blick ich blick nicht"}, {"id": 349, "start": 3238.8, "end": 3249.64, "text": "mehr durch java script mann das ist das ist zu high iq für mich zu also wirklich viel"}, {"id": 350, "start": 3249.64, "end": 3257.64, "text": "viel zu hoher intelligenzquotient der dafür notwendig ist kann man diese diff rappen hab"}, {"id": 351, "start": 3257.64, "end": 3265.92, "text": "ich ja gemacht so aber disable scrollbar bringt an der stelle schonmal nix leute ich hab keine"}, {"id": 352, "start": 3265.92, "end": 3271.72, "text": "ahnung wir lassen das jetzt so und irgendwann machen wir selbst wenn mir was besseres eingefallen"}, {"id": 353, "start": 3271.72, "end": 3288.04, "text": "ist aber das einfügen und so das geht wenigstens alles noch ok aber die suche ist jetzt auch"}, {"id": 354, "start": 3288.04, "end": 3299.96, "text": "schön schnell nice inline wie inline was inline wo ich hab keine ahnung was das bedeuten"}, {"id": 355, "start": 3299.96, "end": 3314.4, "text": "soll kann man die virtual list nicht inline im diff rappen ich hab keine ahnung genau"}, {"id": 356, "start": 3314.4, "end": 3319.16, "text": "das scroll ist auf dem auf dem diff von der liste das hab ich vorhin versucht zu überschreiben"}, {"id": 357, "start": 3319.16, "end": 3330.48, "text": "aber hab ich nicht auf die reihe bekommen enrixel test hat funktioniert aber ganz ehrlich"}, {"id": 358, "start": 3330.48, "end": 3333.96, "text": "das ist kleinigkeiten kram das krieg ich immer noch hin jetzt müssen wir uns erstmal ein"}, {"id": 359, "start": 3333.96, "end": 3339.12, "text": "bisschen essenzielleren features kümmern dass wir das überhaupt sinnvoll sinnvoll"}, {"id": 360, "start": 3339.12, "end": 3355.68, "text": "verwenden können also wie wärs mit text einfügen text einfügen ist glaube ich somit das wichtigste"}, {"id": 361, "start": 3355.68, "end": 3361.92, "text": "was man noch braucht dazu müssen wir aber diese sache hier als extra extra component"}, {"id": 362, "start": 3361.92, "end": 3369.84, "text": "machen weil ansonsten kann ich das hier nicht mehrfach verwenden also machen wir extra component"}, {"id": 363, "start": 3369.84, "end": 3382.12, "text": "für lip für diesen icon browser icon browser 12 so und dann wird copy pasted der gesamte"}, {"id": 364, "start": 3382.12, "end": 3393.48, "text": "icon browser was ist denn alles der icon browser das da eigentlich ne ne von dem diff bis zu"}, {"id": 365, "start": 3393.48, "end": 3409.08, "text": "und das da ne das da ist der icon browser overlay danke für den sub so das hier ist"}, {"id": 366, "start": 3409.08, "end": 3413.28, "text": "der icon browser ah wisst ihr ich hab ne idee wisst ihr was wir noch machen können rounded"}, {"id": 367, "start": 3413.28, "end": 3420.76, "text": "können wir es noch machen rounded rounded top doch gleich viel schöner oder leute rounded"}, {"id": 368, "start": 3420.76, "end": 3437.24, "text": "ecken pock pock ecken so das müssen wir jetzt in extra component machen so und die component"}, {"id": 369, "start": 3437.24, "end": 3446.36, "text": "heißt icon browser ah jawoll sehr schön was noch keinen einfluss hat weil es in der component"}, {"id": 370, "start": 3446.36, "end": 3456.76, "text": "noch nix gibt du du du du so icon browser kommt das da rein zack icon filter gibts nicht"}, {"id": 371, "start": 3456.76, "end": 3472.08, "text": "script let icon filter gleich ne nicht gleich icon filter interessiert mich dass der filter"}, {"id": 372, "start": 3472.08, "end": 3479.16, "text": "kram irgendwie außerhalb ne wahrscheinlich nicht kann man das kann man das importen so"}, {"id": 373, "start": 3479.16, "end": 3489.84, "text": "virtual list kommt hier raus virtual list kommt hier raus da oben drüber einfügen dann"}, {"id": 374, "start": 3489.84, "end": 3507.96, "text": "brauchen wir noch die icons so chunkers so ok das sieht doch schon besser aus filtert"}, {"id": 375, "start": 3507.96, "end": 3517.6, "text": "icons brauchen wir jetzt noch wo kommt das her filtert icons filtert icons kommt daher"}, {"id": 376, "start": 3517.6, "end": 3524.76, "text": "eigentlich kann ich mir das alles mal copy pasten und hier rausschmeißen bis auf show"}, {"id": 377, "start": 3524.76, "end": 3531.2, "text": "icon browser das brauchen wir dann später noch mal kurz hier reinkloppen also icon filter"}, {"id": 378, "start": 3531.2, "end": 3539.96, "text": "ist leer show icon browser kommt weg so filtert icons schon mal besser ok das einfügen funktioniert"}, {"id": 379, "start": 3539.96, "end": 3542.96, "text": "zwar natürlich noch nicht weil das event nicht weitergeleitet wird aber jetzt haben"}, {"id": 380, "start": 3542.96, "end": 3548.48, "text": "wir schon mal eine extra component und das ist ein bisschen ordentlich ja es ist doch"}, {"id": 381, "start": 3548.48, "end": 3563.0, "text": "deutlich übersichtlicher jetzt den kram hier als das da gut insert icon on click ne da"}, {"id": 382, "start": 3563.0, "end": 3566.0, "text": "müssen wir in event weitergeben das weiß ich aus dem kopf nicht wie funktioniert das"}, {"id": 383, "start": 3566.0, "end": 3585.16, "text": "ins welt event event event forwarding event event forwarding event detail texts was ich"}, {"id": 384, "start": 3585.16, "end": 3605.04, "text": "checks nicht was bin ich hier sehend inner was die katz da macht wo macht die katz was"}, {"id": 385, "start": 3605.04, "end": 3615.76, "text": "über dem chat die guckt auf euch runter"}, {"id": 386, "start": 3615.76, "end": 3626.76, "text": "in this case we have to"}, {"id": 387, "start": 3626.76, "end": 3636.76, "text": "keine ahnung was die mir hiermit sagen wollen"}, {"id": 388, "start": 3636.76, "end": 3647.64, "text": "hier on message einfach weitergeben easy also im prinzip hätten sie auch gleich sagen"}, {"id": 389, "start": 3647.64, "end": 3658.72, "text": "können im prinzip gebe ich einfach nur on click weiter fertig sonst nix oder so und"}, {"id": 390, "start": 3658.72, "end": 3663.4, "text": "jetzt gebe ich on click weiter das bedeutet hier sage ich jetzt an der stelle wo der icon"}, {"id": 391, "start": 3663.4, "end": 3678.08, "text": "browser ist click on click ja easy spukige musik hier und dann sage ich das da drinnen"}, {"id": 392, "start": 3678.08, "end": 3700.44, "text": "parent so oh nee mist warum funktioniert es nicht weil achso e moment fuck nee ich muss"}, {"id": 393, "start": 3700.44, "end": 3713.76, "text": "ich brauche doch ein custom event ich brauche doch ein custom event also wie macht man events"}, {"id": 394, "start": 3713.76, "end": 3719.96, "text": "dispatcher create event dispatch ok was auch immer das machen wir jetzt einfach mal so"}, {"id": 395, "start": 3719.96, "end": 3732.8, "text": "wie es da steht dispatcher create event dispatcher kann man es importieren nee import genau lass"}, {"id": 396, "start": 3732.8, "end": 3742.56, "text": "mich das mal importieren dispatch say hello function function so wie soll das event heißen"}, {"id": 397, "start": 3742.56, "end": 3754.0, "text": "icon nee oder was weiß ich selected nennen wir das jetzt einfach on wie ist denn hier"}, {"id": 398, "start": 3754.0, "end": 3767.88, "text": "naming convention für keine ahnung select icon icon so so text es gibt einfach nur das"}, {"id": 399, "start": 3767.88, "end": 3777.24, "text": "icon als event das kann man wahrscheinlich schöner machen so und jetzt sagen wir hier"}, {"id": 400, "start": 3777.24, "end": 3797.0, "text": "on click ich hoffe das ergibt sinn was ich hier mache so on click select icon icon ok"}, {"id": 401, "start": 3797.0, "end": 3809.84, "text": "und jetzt müsste ich hier im parent einen on selected haben genau on selected icon so"}, {"id": 402, "start": 3809.84, "end": 3817.44, "text": "was fuck warum funktioniert es nicht anzeige ist"}, {"id": 403, "start": 3817.44, "end": 3833.76, "text": "raus was mache ich falsch was mache ich falsch was was stimmt hier nicht wird das event überhaupt"}, {"id": 404, "start": 3833.76, "end": 3848.16, "text": "geworfen name ja das event wird moment das ist nicht das hä das ist nicht mein argument"}, {"id": 405, "start": 3848.16, "end": 3863.6, "text": "was ich übergebe moment detail in details ist ach in details ist das drinne ok also"}, {"id": 406, "start": 3863.6, "end": 3874.24, "text": "ist das dann monka es man also brauche ich das gar nicht und das ist das standard event"}, {"id": 407, "start": 3874.24, "end": 3891.12, "text": "was man bekommt jetzt wird es aber jetzt wird es aber wir die detail icon ok ergibt"}, {"id": 408, "start": 3891.12, "end": 3910.2, "text": "passt passt ja icon ok das brauche ich also ist das hier event das brauche ich ein name"}, {"id": 409, "start": 3910.2, "end": 3917.8, "text": "so jetzt sollte es funktionieren wieder fack warum ach nee event keck wait ah da ist es"}, {"id": 410, "start": 3917.8, "end": 3923.28, "text": "wieder ok allah schwere geburt schwere geburt aber ich hab ich hab events auch so gut wie"}, {"id": 411, "start": 3923.28, "end": 3928.4, "text": "gar nicht bisher benutzt gut jetzt haben wir eine extra komponente für den icon browser"}, {"id": 412, "start": 3928.4, "end": 3935.16, "text": "er geht auf und zu er ist schnell man kann suchen und ich kann dieses overlay für alles"}, {"id": 413, "start": 3935.16, "end": 3940.08, "text": "andere benutzen deswegen ist es jetzt auch nicht show icon browser sondern keine ahnung"}, {"id": 414, "start": 3940.08, "end": 3947.04, "text": "show chat gute idee für namen wie heiß könnte die variable heiß um dieses options menu einfach"}, {"id": 415, "start": 3947.04, "end": 3957.16, "text": "warum warum warum nennen wir es nicht show shape browser oder so options option browser"}, {"id": 416, "start": 3957.16, "end": 3984.2, "text": "oder show element browser sowas show icon browser ok keck show so jetzt können wir"}, {"id": 417, "start": 3984.2, "end": 3988.04, "text": "das machen was wir vorher machen wollen nachdem wir jetzt das in der eigenen komponente ausgelagert"}, {"id": 418, "start": 3988.04, "end": 3994.76, "text": "haben brauche ich an der stelle hier nicht mehr diesen ganzen code und kann dieses options"}, {"id": 419, "start": 3994.76, "end": 4000.44, "text": "menu options menu oder es ist ja nicht wirklich ein options menu für alles mögliche verwenden"}, {"id": 420, "start": 4000.44, "end": 4009.64, "text": "zum beispiel um text einzufügen ich würde sagen text einfügen ist erstmal so mit leute"}, {"id": 421, "start": 4009.64, "end": 4016.96, "text": "wir brauchen dann auch wir brauchen auch noch nen emoji menu oder mdi icons alleine reichen"}, {"id": 422, "start": 4016.96, "end": 4022.6, "text": "nicht wir brauchen emojis auf den auf den etiketten aber das machen wir nicht jetzt"}, {"id": 423, "start": 4022.6, "end": 4034.72, "text": "mal jetzt erstmal text text so also icon browser brauchen wir nicht wir wollen text einfügen"}, {"id": 424, "start": 4034.72, "end": 4043.84, "text": "insert text ich glaube das gibt es als funktion noch gar nicht das ist das ist so wir was"}, {"id": 425, "start": 4043.84, "end": 4049.2, "text": "ich hier gebaut habe das muss ich unbedingt alles ein bisschen aufspielen insert text"}, {"id": 426, "start": 4049.2, "end": 4066.32, "text": "so insert text wenn man das hier klickt so insert text insert text macht auf jeden fall"}, {"id": 427, "start": 4066.32, "end": 4087.6, "text": "schon mal das da auf und zu moment nicht insert icon alter insert text insert text ist ja das"}, {"id": 428, "start": 4087.6, "end": 4097.52, "text": "was passiert moment moment jetzt muss ich mal kurz überlegen ne ne ne ne ne show element"}, {"id": 429, "start": 4097.52, "end": 4108.08, "text": "browser ne ich brauche ne funktion open open element browser so und dann muss ich einstellen"}, {"id": 430, "start": 4108.08, "end": 4124.08, "text": "für was irgendwie menu oder sowas weil ich muss das jetzt ja umstellen können ich muss"}, {"id": 431, "start": 4124.08, "end": 4133.8, "text": "das jetzt ja umstellen auf icons oder auf text so element browser das das muss auch"}, {"id": 432, "start": 4133.8, "end": 4140.68, "text": "als eigene komponente dann gemacht werden ja was weiß ich menu so standardmäßig ist"}, {"id": 433, "start": 4140.68, "end": 4153.28, "text": "es nix ist es leer ok gibt das sinn was ich da was ich da baue weil ich muss jetzt ja"}, {"id": 434, "start": 4153.28, "end": 4161.72, "text": "anhand der ja doch ich muss jetzt anhand das menüs auswählen was da reinkommt im"}, {"id": 435, "start": 4161.72, "end": 4166.84, "text": "endeffekt also anstatt überall wo ich das jetzt von hand reingeschrieben habe also"}, {"id": 436, "start": 4166.84, "end": 4172.88, "text": "hier kommt das weg überall wo ich das jetzt von hand reingeschrieben habe muss ich jetzt"}, {"id": 437, "start": 4172.88, "end": 4184.96, "text": "sagen show element browser und dann in dem fall für icon oder icons oder so wo ist das"}, {"id": 438, "start": 4184.96, "end": 4199.76, "text": "problem is not callable wie warum nicht eigentlich open bescheuerte benahmung deswegen sollte"}, {"id": 439, "start": 4199.76, "end": 4206.24, "text": "man das nicht schon also ist das müsste man ist nennen das ist das ist sinnvoller also"}, {"id": 440, "start": 4206.24, "end": 4216.84, "text": "nicht show element sondern ist element browser open oder sowas ist das ist das ding hat"}, {"id": 441, "start": 4216.84, "end": 4225.08, "text": "einen scheißen armer das brauchen ordentlich das dann erkennt man nämlich auch was es"}, {"id": 442, "start": 4225.08, "end": 4232.36, "text": "ist ok funktioniert noch alles ja ok nice auf und zu funktioniert noch gachi bass text"}, {"id": 443, "start": 4232.36, "end": 4243.2, "text": "inserten ok wenn man hier klickt soll das umstellen auf open element für text und jetzt"}, {"id": 444, "start": 4243.2, "end": 4249.12, "text": "brauchen wir eine extra component für icon browser und jetzt keine ahnung ich nenne"}, {"id": 445, "start": 4249.12, "end": 4256.56, "text": "es jetzt einfach text text browser wie auch immer so text browser gibt es natürlich"}, {"id": 446, "start": 4256.56, "end": 4265.16, "text": "noch nicht das legen wir jetzt gerade mal an new file text browser ordentlich groß groß"}, {"id": 447, "start": 4265.16, "end": 4272.4, "text": "klein kleines welt text browser keck weh whoops was habe ich jetzt gemacht ohje hat"}, {"id": 448, "start": 4272.4, "end": 4281.76, "text": "es irgendwas schlimmes hat es jetzt jetzt alles zerstört so text browser text browser"}, {"id": 449, "start": 4281.76, "end": 4311.52, "text": "so was ist was ist denn jetzt schon wieder ah noob schon besser toggle element browser"}, {"id": 450, "start": 4311.52, "end": 4320.28, "text": "ja er toggelt ja nicht nur es moment ich weiß was der macht es ist nicht open es ist eigentlich"}, {"id": 451, "start": 4320.28, "end": 4337.4, "text": "switch kategorie oder sowas kann man machen so also jetzt schaltet er das um von obs das"}, {"id": 452, "start": 4337.4, "end": 4355.08, "text": "ist falsch falsche stelle so das schaltet es jetzt um von icons zu text ok nice und open"}, {"id": 453, "start": 4355.08, "end": 4370.96, "text": "sollte auch wirklich open sein ja so das heißt das muss ich hier auswählen if kann man das"}, {"id": 454, "start": 4370.96, "end": 4375.04, "text": "dann irgendwie schöner machen anstatt jetzt hier einfach in if rein zu klatschen also"}, {"id": 455, "start": 4375.04, "end": 4387.84, "text": "if element browser menü gleich gleich icons dann das da das muss doch irgendwie schöner"}, {"id": 456, "start": 4387.84, "end": 4401.04, "text": "gehen oder else text browser zum beispiel case nee an der stelle geht kein case so guck"}, {"id": 457, "start": 4401.04, "end": 4408.24, "text": "jetzt kann ich zwischen den zwei dingern umschalten hier leht er das den für icons und hier leht"}, {"id": 458, "start": 4408.24, "end": 4415.08, "text": "er das für text und da können wir jetzt rein basteln was wir wollen also was brauche"}, {"id": 459, "start": 4415.08, "end": 4431.6, "text": "ich denn moment unselected unselected insert text icons und und icon browser nee das funktioniert"}, {"id": 460, "start": 4431.6, "end": 4444.36, "text": "nicht das hier ist html mit markup zeug zumindest funktioniert es an der stelle das heißt jetzt"}, {"id": 461, "start": 4444.36, "end": 4451.04, "text": "müssen wir irgendwie uns überlegen wie wir das schick machen text text inserten also"}, {"id": 462, "start": 4451.04, "end": 4455.84, "text": "wie bauen wir das auf den icon browser hat oben eine suchbar eine suchbar für text ist"}, {"id": 463, "start": 4455.84, "end": 4462.28, "text": "glaube ich ziemlich ziemlich useless aber ich kopiere ich kopiere es mir trotzdem mal kurz"}, {"id": 464, "start": 4462.28, "end": 4467.6, "text": "so chunk brauchen wir nicht icon filter brauchen wir nicht so selected brauchen wir aber als"}, {"id": 465, "start": 4467.6, "end": 4473.88, "text": "event icons brauchen wir wahrscheinlich auch nicht virtual list brauchen wir wahrscheinlich"}, {"id": 466, "start": 4473.88, "end": 4485.88, "text": "auch nicht so diff den input brauchen wir den input nee den input brauchen wir auch"}, {"id": 467, "start": 4485.88, "end": 4498.36, "text": "nicht ok also was kommt in das diff rein also text also was brauchen wir wir brauchen ein"}, {"id": 468, "start": 4498.36, "end": 4509.2, "text": "text was haltet ihr davon wenn wir was ganz simples machen quasi text header so was text"}, {"id": 469, "start": 4509.2, "end": 4519.92, "text": "was wir einmal in der vorlage machen für header text für text normal und text schmoll"}, {"id": 470, "start": 4519.92, "end": 4528.04, "text": "so und dementsprechend kriegt das jetzt auch die passenden klassen text xl und wenn man"}, {"id": 471, "start": 4528.04, "end": 4532.72, "text": "das dann anklickt edit das hier drauf jetzt müssen wir so noch überlegen wie man die"}, {"id": 472, "start": 4532.72, "end": 4541.32, "text": "raustufen des textes umstellt und wie man den text editierbar macht vielleicht machen"}, {"id": 473, "start": 4541.32, "end": 4554.56, "text": "wir doch ein input hier oben hin let text vielleicht machen wir doch hier oben was hin"}, {"id": 474, "start": 4554.56, "end": 4574.28, "text": "ich glaube das ist gar nicht so schlecht und define ist vielleicht doof ja dann sieht man"}, {"id": 475, "start": 4574.28, "end": 4583.64, "text": "nämlich gleich was man einfügen würde das ist doch schon mal gar nicht verkehrt so text"}, {"id": 476, "start": 4583.64, "end": 4592.44, "text": "normal text schmoll oder den drop down menu mit verschiedenen größen ja sowas in der"}, {"id": 477, "start": 4592.44, "end": 4598.68, "text": "richtung ist das ja du siehst du siehst das und kannst es dann anklicken oder erscheint"}, {"id": 478, "start": 4598.68, "end": 4604.68, "text": "hier drauf mit bold vielleicht noch ja das könnte man könnte man als alternative anbieten"}, {"id": 479, "start": 4604.68, "end": 4614.08, "text": "noch ja müssen wir gleich mal müssen wir gleich mal gucken also klas normal ist text"}, {"id": 480, "start": 4614.08, "end": 4637.28, "text": "medium ne text m oder large sekunde lg oder mt ist es lg lg mlg legit xl ne nicht xl sm"}, {"id": 481, "start": 4637.28, "end": 4641.24, "text": "so da das ist zu klein oder niemand will sowas kleines auf dem etikett haben das sieht doch"}, {"id": 482, "start": 4641.24, "end": 4652.44, "text": "keine sau das ist das ist nicht keck weit das ist nicht zu erkennen sehr was wir machen"}, {"id": 483, "start": 4652.44, "end": 4658.0, "text": "wir machen das anders wir lassen text text leer jetzt steht da zwar an die feinden jetzt"}, {"id": 484, "start": 4658.0, "end": 4671.24, "text": "war mal oder oder text header ja so ist das schöner oder oder text normal oder oder"}, {"id": 485, "start": 4671.24, "end": 4681.16, "text": "text small jetzt müssen wir noch die klammer an die richtigen stelle machen ja so wenn"}, {"id": 486, "start": 4681.16, "end": 4687.72, "text": "ich jetzt was eingeben bei spiel text dann kann ich es anklicken schau dir mal den tailwind"}, {"id": 487, "start": 4687.72, "end": 4700.16, "text": "editor an ich brauche irgendwas was man hier einfach reinhauen kann aber also jetzt irgendwie"}, {"id": 488, "start": 4700.16, "end": 4712.04, "text": "super krassen was denn den da eben super feature reichen das meinst du nicht super feature"}, {"id": 489, "start": 4712.04, "end": 4720.2, "text": "reichen text editor muss ja nicht sein das reicht doch eigentlich schon text bspw text"}, {"id": 490, "start": 4720.2, "end": 4733.6, "text": "die coolen leute nehmen lorem ipsum bei sowas oder die die sagen hat es hat es wischl hat"}, {"id": 491, "start": 4733.6, "end": 4746.76, "text": "es wischl studio code nicht mittlerweile eingebaut so text header text normal text aber text"}, {"id": 492, "start": 4746.76, "end": 4756.92, "text": "small ist blöd wir machen lieber text small ist lg und xl ist normal oder 2xl oder xl"}, {"id": 493, "start": 4756.92, "end": 4764.08, "text": "ist normal und text small ist so ansonsten ist das viel zu fett wie wäre es mit zwei"}, {"id": 494, "start": 4764.08, "end": 4770.72, "text": "buttons um die font size einfach selbst vergrößern zu können und zu verkleinern ja wir brauchen"}, {"id": 495, "start": 4770.72, "end": 4776.04, "text": "da oben e-buttons leute wir brauchen wir brauchen keine suchleiste wir brauchen wir brauchen"}, {"id": 496, "start": 4776.04, "end": 4780.98, "text": "was für graustufen wir brauchen was für die graustufen wir brauchen so einen kleinen"}, {"id": 497, "start": 4780.98, "end": 4784.88, "text": "color selector hier oben noch jetzt müssen wir mal ausprobieren ob wir da irgendwas gescheites"}, {"id": 498, "start": 4784.88, "end": 4801.76, "text": "hinkriegen hier diff class flex weird flex diff class 12 12 bg grey gibt geile color picker"}, {"id": 499, "start": 4801.76, "end": 4807.12, "text": "ich weiß aber ich brauch kein color picker ich brauch drei drei ich brauch fünf fünf"}, {"id": 500, "start": 4807.12, "end": 4814.52, "text": "buttons mit unterschiedlichen grautönen das ist glaube ich zu grautöne picker im dark"}, {"id": 501, "start": 4814.52, "end": 4822.28, "text": "theme das können schwierig werden ja rot geht nicht der etikettendrucker ist schwarz"}, {"id": 502, "start": 4822.28, "end": 4834.32, "text": "weiß oder soll ich einfach color einfügen weil man color einfügen kann deswegen ist"}, {"id": 503, "start": 4834.32, "end": 4843.44, "text": "es ja auch alles graustufen weiße konturen ja wir können border machen tatsächlich border"}, {"id": 504, "start": 4843.44, "end": 4847.36, "text": "und wir machen das mal ein bisschen kleiner immer dran wir müssen das mobile auch anklicken"}, {"id": 505, "start": 4847.36, "end": 4875.28, "text": "können wir müssen das wir müssen das auch mobile anklicken können ein slider ein slider"}, {"id": 506, "start": 4875.28, "end": 4882.48, "text": "für die schriftgröße ist eigentlich ganz cool ja also was machen wir denn für farben"}, {"id": 507, "start": 4882.48, "end": 4891.64, "text": "ich mein vier farben oder so reichen ja das hängt dann so schön in der ecke hier oben"}, {"id": 508, "start": 4891.64, "end": 4901.16, "text": "vielleicht ein bisschen größer ich glaube auf dem smartphone ist das zu klein was haben"}, {"id": 509, "start": 4901.16, "end": 4909.92, "text": "wir sonst zu bieten acht neun zehn elf zehn vielleicht rot grün blau weiß wie gesagt"}, {"id": 510, "start": 4909.92, "end": 4918.28, "text": "der etikettendrucker ist schwarz weiß es macht eigentlich außer dass es im web interface"}, {"id": 511, "start": 4918.28, "end": 4931.76, "text": "optisch schöner aussieht macht es keinen sinn farben anzubieten"}, {"id": 512, "start": 4931.76, "end": 4940.96, "text": "also graustufen soll wir machen wir machen eine relativ helle so wir machen quasi weiß"}, {"id": 513, "start": 4940.96, "end": 4953.48, "text": "so weiß dann irgendwie mittel und dann bisschen dunkler und dann sieben oder das reicht ganz"}, {"id": 514, "start": 4953.48, "end": 4965.4, "text": "ehrlich leute mehr braucht man nicht an graustufen das ist ausreichend"}, {"id": 515, "start": 4965.4, "end": 4970.68, "text": "weiß ist doch bullshit naja warum vielleicht möchte man so was in hintergrund machen dann"}, {"id": 516, "start": 4970.68, "end": 4979.38, "text": "weiße schrift drauf und ein ganz schwarz ja das ist tatsächlich"}, {"id": 517, "start": 4979.38, "end": 5001.8, "text": "sinnvoll bg black ja das doch ok finde ich schick finde ich echt in ordnung wie das ausschaut"}, {"id": 518, "start": 5001.8, "end": 5012.24, "text": "so jetzt müssen wir noch sagen kürzer pointer hier drauf kürzer pointer"}, {"id": 519, "start": 5012.24, "end": 5024.68, "text": "mal wie ging das in der studio noch mal alt ne moment alt wie macht man mehrere kürzer"}, {"id": 520, "start": 5024.68, "end": 5050.12, "text": "noch mal kontrol plus feil was kontrol es ist alt es ist alt so sieht doch eigentlich"}, {"id": 521, "start": 5050.12, "end": 5064.2, "text": "ganz hübsch aus jetzt können wir noch die color uns speichern oben so color"}, {"id": 522, "start": 5064.2, "end": 5088.48, "text": "oder mit mausrad kann man rechtecke markieren was echt wie auch immer"}, {"id": 523, "start": 5088.48, "end": 5094.44, "text": "so also text header normal so da muss noch ein bisschen ein bisschen abstand dazwischen"}, {"id": 524, "start": 5094.44, "end": 5111.88, "text": "und margin bottom 2 bisschen mehr abstand hängt so aufeinander so das reicht doch als"}, {"id": 525, "start": 5111.88, "end": 5117.96, "text": "text auswahl oder wollen wir wirklich noch einen button machen für schriftgröße größer"}, {"id": 526, "start": 5117.96, "end": 5122.68, "text": "und kleiner eigentlich ist das minimalistisch genug so du kannst hier oben reinschreiben"}, {"id": 527, "start": 5122.68, "end": 5128.16, "text": "keck wie alda lan oder so dann kannst du dann die farbe anklicken und dann klickst"}, {"id": 528, "start": 5128.16, "end": 5136.0, "text": "hier unten drauf und dann hast du dein text muss doch muss doch eigentlich soweit eigentlich"}, {"id": 529, "start": 5136.0, "end": 5147.68, "text": "soweit passen testen wir mal ob das mit dem hinzufügen denn überhaupt funktioniert also"}, {"id": 530, "start": 5147.68, "end": 5153.92, "text": "ich gebe zu das ist usability technisch der label der label maker kann farbig nein kann"}, {"id": 531, "start": 5153.92, "end": 5164.12, "text": "er nicht der kann nur graustufen deswegen haben nur graustufen am start und selektor"}, {"id": 532, "start": 5164.12, "end": 5179.32, "text": "ich weiß nicht font selektor das ist aber ganz schön advanced ich wüsste gar nicht"}, {"id": 533, "start": 5179.32, "end": 5183.36, "text": "wie man den drop down irgendwie gescheit macht wie lässt man sich mit java script überhaupt"}, {"id": 534, "start": 5183.36, "end": 5192.84, "text": "alle verfügbaren fonts auflisten weiß ich gar nicht js list fonts geht das überhaupt"}, {"id": 535, "start": 5192.84, "end": 5196.84, "text": "bestimmt die leute wollen bestimmt comic sans drucken ich kann es mir jetzt schon vorstellen"}, {"id": 536, "start": 5196.84, "end": 5210.92, "text": "und face set check ok das geht nicht weil fingerprinting das geht nicht weil fingerprinting"}, {"id": 537, "start": 5210.92, "end": 5216.28, "text": "ok da muss ich meine eigenen fonts meine muss irgendwelche web fonts mit liefern ich habe"}, {"id": 538, "start": 5216.28, "end": 5223.72, "text": "noch nie web fonts included viele für sowas das braucht auch viel zu viel speicher benutzt"}, {"id": 539, "start": 5223.72, "end": 5228.76, "text": "google fonts das probieren wir aus machen wir gleich ich will erstmal gucken ob das"}, {"id": 540, "start": 5228.76, "end": 5244.04, "text": "adden prinzipiell funktioniert kursor pointer so zack zack ja die usability ist noch nicht"}, {"id": 541, "start": 5244.04, "end": 5255.76, "text": "so ganz da aber aber aber schauen wir mal select none ok ist noch nicht so die hyper"}, {"id": 542, "start": 5255.76, "end": 5259.96, "text": "usability so wie ich mir das vorstelle aber ok ich will jetzt testen ob das funktioniert"}, {"id": 543, "start": 5259.96, "end": 5272.42, "text": "wenn man das wenn man das anklickt on on click das ist kein search achso da steht noch"}, {"id": 544, "start": 5272.42, "end": 5287.72, "text": "ein search drin text what on click select icon ist schon mal verkehrt select text text"}, {"id": 545, "start": 5287.72, "end": 5300.36, "text": "meinte text muss ich übergeben den text habe ich da oben stehen select text text text wobei"}, {"id": 546, "start": 5300.36, "end": 5316.68, "text": "so reicht doch text ja ja unexpected token darf nicht rum ok der sollt jetzt der sollt"}, {"id": 547, "start": 5316.68, "end": 5326.32, "text": "jetzt das event schmeißen oder sollt jetzt das event schmeißen das probieren wir mal"}, {"id": 548, "start": 5326.32, "end": 5333.04, "text": "aus also insert text sollte der jetzt und selected machen insert text macht er das"}, {"id": 549, "start": 5333.04, "end": 5343.56, "text": "denn insert text der wirft kein event warum nicht moment click text was mache ich denn"}, {"id": 550, "start": 5343.56, "end": 5352.0, "text": "dafür ein select text man nicht text jetzt wirft er auch das event ok so und wie fügt"}, {"id": 551, "start": 5352.0, "end": 5359.12, "text": "man jetzt text ein lass lass mich mal raten ok lass mal ran let und insert text das ist"}, {"id": 552, "start": 5359.12, "end": 5378.78, "text": "hier der text jetzt bräuchte ich beide beides mal text text text shape gleich new konver"}, {"id": 553, "start": 5378.78, "end": 5390.2, "text": "text aha tja text konfig kek wait keine ahnung konver text zeig her wie funktioniert's ich"}, {"id": 554, "start": 5390.2, "end": 5399.16, "text": "brauch ein example tutorial tutorial text please text text so was da will ich haben text auch"}, {"id": 555, "start": 5399.16, "end": 5404.8, "text": "als svg ich glaube das macht er standardmäßig als svg dann kann man es theoretisch noch"}, {"id": 556, "start": 5404.8, "end": 5409.52, "text": "auf dem canvas resizing dann wenn man das auf dem canvas resizing kann brauche ich"}, {"id": 557, "start": 5409.52, "end": 5414.64, "text": "hier gar nicht in unterschiedlichen größen sondern vielleicht mit unterschiedlichen styles"}, {"id": 558, "start": 5414.64, "end": 5428.64, "text": "das werden wir gleich sehen hier text shape moment das hier ist ja auch gar nicht so"}, {"id": 559, "start": 5428.64, "end": 5442.24, "text": "das ist ja gar nicht der text das hier ist das event event und es ist let text als was"}, {"id": 560, "start": 5442.24, "end": 5462.0, "text": "data kek wait viel besser nennen wir es so text hier mein text so font size haben wir"}, {"id": 561, "start": 5462.0, "end": 5469.52, "text": "keine auswahl 30 kalibri was auch immer green nein ja das müssen wir noch mit übergeben"}, {"id": 562, "start": 5469.52, "end": 5475.6, "text": "machen wir noch nicht schauen wir mal ob das insorten jetzt wenigstens funktioniert nee"}, {"id": 563, "start": 5475.6, "end": 5483.32, "text": "ach so weil ich kein text gesetzt habe aber ich muss ich muss ich muss insorten layer"}, {"id": 564, "start": 5483.32, "end": 5499.52, "text": "add text shape ja möglichkeit zum resizen haben wir kann es sein moment ich ich ich"}, {"id": 565, "start": 5499.52, "end": 5514.6, "text": "trau das oben links in der ecke dann finde ich es wenigstens wieder wartet mal lock text"}, {"id": 566, "start": 5514.6, "end": 5536.6, "text": "shape ach detail icon schön copy pasted ja das immer moment selectable ja content das"}, {"id": 567, "start": 5536.6, "end": 5552.16, "text": "brauche ich weil irgendwie mein eigener shit so"}, {"id": 568, "start": 5552.16, "end": 5566.56, "text": "tracable tracable true so ja man kann hier resizen ist das times new roman nee das ist"}, {"id": 569, "start": 5566.56, "end": 5572.68, "text": "das kalibri igitt gehst du mal fort alter bäh das will ich nicht haben so wir müssen"}, {"id": 570, "start": 5572.68, "end": 5581.2, "text": "jetzt die farbe noch übergeben sonst funktioniert das nicht also selected text haben wir wir"}, {"id": 571, "start": 5581.2, "end": 5597.36, "text": "machen standard beispiel beispiel text da rein weil wenn text leer ist wie wie fängt"}, {"id": 572, "start": 5597.36, "end": 5612.52, "text": "das an bacon sehr schön bacon das heißt wenn ich das jetzt anklick ohne dass was aus"}, {"id": 573, "start": 5612.52, "end": 5622.92, "text": "ausgewählt ist ach ich das habe ich die ganze zeit gesucht ich dachte das sieht man hier"}, {"id": 574, "start": 5622.92, "end": 5642.84, "text": "als als nee kann man nicht ist das ein addon wie machen das das muss mein html machen das"}, {"id": 575, "start": 5642.84, "end": 5658.28, "text": "geht nicht in ja was kannst du mein html machen ok da fand ich das bacon aber besser bacon"}, {"id": 576, "start": 5658.28, "end": 5670.76, "text": "pepo fett so und wenn ich jetzt hier was reinschreibe dann geht das ok grün ist jetzt einfach"}, {"id": 577, "start": 5670.76, "end": 5677.52, "text": "nur weil man es besser sieht der tag der drucker kann kein grün ok also dann brauchen wir"}, {"id": 578, "start": 5677.52, "end": 5684.88, "text": "hier noch ok ich übergebe mal font weil ich keine ahnung habe ob wir das ein implementieren"}, {"id": 579, "start": 5684.88, "end": 5693.4, "text": "werden font und color color übergebe ich in ja wie kriege ich eigentlich die color jetzt"}, {"id": 580, "start": 5693.4, "end": 5699.88, "text": "so ich habe jetzt da drauf geklickt so ich klicke jetzt auf meine colors und jetzt brauche"}, {"id": 581, "start": 5699.88, "end": 5712.96, "text": "ich ja theoretisch noch noch function irgendwie sowas wie color kann man den text nachträglich"}, {"id": 582, "start": 5712.96, "end": 5718.16, "text": "editieren aktuell noch nicht aber ich habe mir überlegt man könnte es ja so machen"}, {"id": 583, "start": 5718.16, "end": 5723.32, "text": "dass wenn man den text anklickt und dieses menü hier aufmacht man das hier einfach ausgefüllt"}, {"id": 584, "start": 5723.32, "end": 5729.88, "text": "bekommt und die standard dinge halt ändern kann wenn schon eingefügt ist wieder live"}, {"id": 585, "start": 5729.88, "end": 5745.48, "text": "ja so color wie kriege ich denn jetzt die color hier her was ist das überhaupt für"}, {"id": 586, "start": 5745.48, "end": 5754.76, "text": "eine color ah obviously rgb2 durch was ne das da das da brauchen wir das ist meine color"}, {"id": 587, "start": 5754.76, "end": 5782.16, "text": "on click kann man das so machen color gleich ne wait a minute ach ne ich muss das doppelt"}, {"id": 588, "start": 5782.16, "end": 5793.96, "text": "quaten funktioniert das dann überhaupt anscheinend noch anderlei etat ja also guck mal man kann"}, {"id": 589, "start": 5793.96, "end": 5800.72, "text": "die größte ja hiermit beeinflussen leute deswegen eigentlich brauchen wir dieses text"}, {"id": 590, "start": 5800.72, "end": 5810.08, "text": "normal und so gar nicht sondern wir können im prinzip sagen text also text text eigentlich"}, {"id": 591, "start": 5810.08, "end": 5827.48, "text": "nur text weil text normal und so brauchen wir nicht ok text normal"}, {"id": 592, "start": 5827.48, "end": 5841.8, "text": "so text bold ne font bold ist das glaube ich so bold und was denn sonst noch underline"}, {"id": 593, "start": 5841.8, "end": 5853.56, "text": "oder oder was 2xl reicht glaube ich ansonsten wobei 3xl ist schon gut was haben wir sonst"}, {"id": 594, "start": 5853.56, "end": 5867.52, "text": "auch zu bieten font underline ne gibt es gar nicht"}, {"id": 595, "start": 5867.52, "end": 5879.44, "text": "ich weiß gar nicht wie man das in tailwind tailwind underline font text decoration man"}, {"id": 596, "start": 5879.44, "end": 5884.76, "text": "könnte auch icons machen da hast du recht ja vielleicht sogar besser einfach underline"}, {"id": 597, "start": 5884.76, "end": 5909.16, "text": "wait a minute warum ist es font bold und nicht font underline"}, {"id": 598, "start": 5909.16, "end": 5920.64, "text": "man sieht die underline einfach nicht wegen den icons unten keck keck wait vielleicht machen"}, {"id": 599, "start": 5920.64, "end": 5931.24, "text": "wir da wirklich icons wir machen ja noch icons daneben für bold aber wobei zum testen das"}, {"id": 600, "start": 5931.24, "end": 5950.84, "text": "ist erstmal durchaus ok so"}, {"id": 601, "start": 5950.84, "end": 5963.12, "text": "das heißt wir müssen uns das jetzt merken boah echt leute ich mach mal nur bold da hab"}, {"id": 602, "start": 5963.12, "end": 5969.6, "text": "ich nur 2 sachen zum abfackeln jetzt da müsste man sich noch den style merken aber viel wichtiger"}, {"id": 603, "start": 5969.6, "end": 5981.36, "text": "wie kriege ich das mit der color hin package lock ne im moment nicht package lock du meinst"}, {"id": 604, "start": 5981.36, "end": 5987.32, "text": "moment meinst du meinst du package lock jetzt irgendwie rpm technisch oder meinst du npm"}, {"id": 605, "start": 5987.32, "end": 6000.08, "text": "mäßig du meinst npm mäßig ne ich mach auf der arbeit nix mit node wirklich also"}, {"id": 606, "start": 6000.08, "end": 6004.28, "text": "ich geh mal davon aus ja aber ich weiß es nicht ich mach nix mit node auf der arbeit"}, {"id": 607, "start": 6004.28, "end": 6030.2, "text": "과"}, {"id": 608, "start": 6030.2, "end": 6034.24, "text": "Also das da, das da setzt jetzt die Color."}, {"id": 609, "start": 6034.24, "end": 6039.16, "text": "Testen wir mal ob das auch wirklich die Color setzt."}, {"id": 610, "start": 6039.16, "end": 6042.56, "text": "Lock Color, das setzt die Color."}, {"id": 611, "start": 6042.56, "end": 6046.16, "text": "So jetzt muss ich Color übergeben."}, {"id": 612, "start": 6046.16, "end": 6060.16, "text": "Color, so also von der Idee her bekomme ich jetzt hier noch, noch ein, ein Color im Mode,"}, {"id": 613, "start": 6060.16, "end": 6064.76, "text": "habe ich im Mode Color im Event mitgeschickt."}, {"id": 614, "start": 6064.76, "end": 6067.28, "text": "Schauen wir mal ob es das auch funktioniert."}, {"id": 615, "start": 6067.28, "end": 6075.72, "text": "Also ich klick das hier an, sag Text normal, Color, ja hier passt."}, {"id": 616, "start": 6075.72, "end": 6078.6, "text": "Ok und nun wie gebe ich die Color hier an?"}, {"id": 617, "start": 6078.6, "end": 6083.16, "text": "Phil, kann man das als RGB Wert angeben, da bin ich ja mal gespannt."}, {"id": 618, "start": 6083.16, "end": 6089.48, "text": "Color, wahrscheinlich nicht, wahrscheinlich muss ich jetzt erstmal RGB Wert zu Hex Schreibweise"}, {"id": 619, "start": 6089.48, "end": 6090.64, "text": "machen oder sowas."}, {"id": 620, "start": 6090.64, "end": 6097.48, "text": "Nee es funktioniert."}, {"id": 621, "start": 6097.48, "end": 6098.48, "text": "Es funktioniert Leute."}, {"id": 622, "start": 6098.48, "end": 6111.2, "text": "Kunst, PogChamp, Moment, warum ist der Selektor dahinter?"}, {"id": 623, "start": 6111.2, "end": 6116.88, "text": "Mein Selektor ist da, der ist da, was macht der da?"}, {"id": 624, "start": 6116.88, "end": 6122.96, "text": "Der ist weg, ok man erkennt es auch nicht wirklich."}, {"id": 625, "start": 6122.96, "end": 6130.04, "text": "Gut, also das heißt im Prinzip funktioniert das ganze schon mal, also sagen wir OnClick,"}, {"id": 626, "start": 6130.04, "end": 6146.84, "text": "OnClick, OnClick, OnClick, so und dann haben wir hier Color, RGB oder RGB wie die coolen"}, {"id": 627, "start": 6146.84, "end": 6167.0, "text": "Leute sagen, das da und das da, achja Default, Default brauchen wir ja auch noch, so und"}, {"id": 628, "start": 6167.0, "end": 6172.36, "text": "das da, wobei das ist einfach, das wollte ich gerade sagen, das ist 000, das ist tatsächlich"}, {"id": 629, "start": 6172.36, "end": 6173.36, "text": "easy."}, {"id": 630, "start": 6173.36, "end": 6191.8, "text": "So und wenn ich da jetzt was schreibe, lulululul, schwarz, das da, BÄM, nice guckt mal, es"}, {"id": 631, "start": 6191.8, "end": 6192.8, "text": "funktioniert."}, {"id": 632, "start": 6192.8, "end": 6204.72, "text": "Was ist, das ist schick, das gefällt mir, meine Usability technisch ist das noch nicht,"}, {"id": 633, "start": 6204.72, "end": 6210.24, "text": "da war jetzt das letzte Schluss, ja da muss man ehrlich sagen, da muss man noch was besseres"}, {"id": 634, "start": 6210.24, "end": 6211.24, "text": "einfallen."}, {"id": 635, "start": 6211.24, "end": 6222.04, "text": "Ja zum Beispiel müssen wir das hier noch selecten, was ausgewählt ist, also anstatt"}, {"id": 636, "start": 6222.04, "end": 6233.96, "text": "das wir Border so machen, machen wir jetzt mal beispielsweise Border Blue, irgendwie so,"}, {"id": 637, "start": 6233.96, "end": 6243.44, "text": "ja das es selected ist, guckt mal, also das man weiß was selected ist, 400, 400 war schon"}, {"id": 638, "start": 6243.44, "end": 6249.2, "text": "ok ja, ne 500, also das man weiß was selected ist, vielleicht sollte man den Border sogar"}, {"id": 639, "start": 6249.2, "end": 6253.48, "text": "ein bisschen größer machen, ja so ist gut oder, dann erkennt man wenigstens was selected"}, {"id": 640, "start": 6253.48, "end": 6277.56, "text": "ist, dann erkennt man wenigstens was selected ist, ja, so wie merke ich mir denn jetzt was"}, {"id": 641, "start": 6277.56, "end": 6287.2, "text": "selected ist, das ist ja, das ist ja richtig eklig, oder im gleichen Pinkton wie die Buttons,"}, {"id": 642, "start": 6287.2, "end": 6296.44, "text": "das ist auch eine gute Idee, das testen wir mal, Pink, 500 ist das glaube ich, ne 600,"}, {"id": 643, "start": 6296.44, "end": 6304.28, "text": "damit Pink können wir den Border auch kleiner machen, haben wir 3, ne gibt es nicht oder,"}, {"id": 644, "start": 6304.28, "end": 6318.76, "text": "gibt es nur, kann ich sagen Border, Sekunde, 3 sowas, eh 3, Magenta Border, ja ich glaube"}, {"id": 645, "start": 6318.76, "end": 6331.0, "text": "so ist es ganz ok oder, Leute 4 oder 2 Border und Blau oder Magenta, kann man auch 8 Border"}, {"id": 646, "start": 6331.0, "end": 6341.88, "text": "machen, dann sieht man gar nichts mehr, Abmahnung, das ist nicht Magenta, das ist Pink, 600,"}, {"id": 647, "start": 6341.88, "end": 6347.96, "text": "2 Magenta, 4 Magenta, ja, so mal schauen, eh wie merke ich mir denn jetzt, dass das"}, {"id": 648, "start": 6347.96, "end": 6368.04, "text": "aktiviert wurde, ich mein die Obvious Variante wäre, ähm, Color, äh wäre Border, aber"}, {"id": 649, "start": 6368.04, "end": 6374.04, "text": "das ist doof, pack die Color Buttons doch in eine eigene Komponente und lass die per"}, {"id": 650, "start": 6374.04, "end": 6382.12, "text": "Each ausgeben, gib jedem die ID E und gib ihm Class Select, oh 5 Head Time, Leute, Big"}, {"id": 651, "start": 6382.12, "end": 6392.72, "text": "Brain Time, jetzt gehts aber ab, die Buttons kriegen die ID, ja Moment, das mit der ID"}, {"id": 652, "start": 6392.72, "end": 6401.24, "text": "ist doch eigentlich viel besser, wir machen das mit der ID hier drin auch, wir merken"}, {"id": 653, "start": 6401.24, "end": 6412.2, "text": "uns was in Color Selected ist, merken wir uns die ID und hier drinnen in dem Event mappen"}, {"id": 654, "start": 6412.2, "end": 6423.4, "text": "wir dann die ID auf die eigentliche Color, das ist glaube ich sinnvoller, also das wäre"}, {"id": 655, "start": 6423.4, "end": 6429.08, "text": "irgendwie, keine Ahnung, das ist Color 1, Leute fangen wir bei 0 oder bei 1 an, eigentlich"}, {"id": 656, "start": 6429.08, "end": 6442.2, "text": "ist es egal, das ist Color 1, das ist Color 2, das ist Color 3, das ist Color 4, das ist"}, {"id": 657, "start": 6442.2, "end": 6460.12, "text": "Color 5, kann man aus Javascript abfragen, ne das krieg ich da nicht gescheit raus, so"}, {"id": 658, "start": 6460.12, "end": 6486.52, "text": "und jetzt kann ich nämlich auch sagen, if, kurz weg, Class Border Pink, 500, 600, gibt"}, {"id": 659, "start": 6486.52, "end": 6502.08, "text": "das wenn Color gleich gleich 1 ist, ob das funktioniert, hey, schuld dass nur die ID"}, {"id": 660, "start": 6502.08, "end": 6516.8, "text": "hängen geblieben ist, ja das mit der Komponente machen wir vielleicht noch, oh was jetzt?"}, {"id": 661, "start": 6516.8, "end": 6545.08, "text": "ja also, ID 3, ID 4, ID 5."}, {"id": 662, "start": 6545.08, "end": 6554.12, "text": "So, jetzt kann man den Krempel auch selecten, so ist das doch eigentlich ganz nice, wie findest"}, {"id": 663, "start": 6554.12, "end": 6571.4, "text": "du Edabit, was, Programming, Edabit, hab ich noch nie gehört, Coding Practice Challenge,"}, {"id": 664, "start": 6571.4, "end": 6587.76, "text": "keine Ahnung, hab ich noch nie gehört, sagt mir nix, dann steht leider nix zu sagen, so,"}, {"id": 665, "start": 6587.76, "end": 6595.76, "text": "so ist doch ganz schick, so und jetzt müssen wir das hier drinnen machen, wie macht man"}, {"id": 666, "start": 6595.76, "end": 6601.6, "text": "das jetzt mit dem Switch, wie macht man das am schönsten, einfach ein if, oder, if Color"}, {"id": 667, "start": 6601.6, "end": 6629.68, "text": "gleich gleich 1, oh ne da war ein extra Funktion draus, Color ID 2 RGB, if Color gleich 1,"}, {"id": 668, "start": 6629.68, "end": 6638.0, "text": "Return, oder macht man das mit nem Switch, mit nem Switch ist besser oder, Switch, Color,"}, {"id": 669, "start": 6638.0, "end": 6647.4, "text": "Value 1, Return, ähm, tja ich weiß es nicht mehr Leute, von oben nach unten wahrscheinlich,"}, {"id": 670, "start": 6647.4, "end": 6665.36, "text": "so was da, ist das, ist das da, The Javascript Way Leute das zu machen, ok 2, 3, 4, 5, oh"}, {"id": 671, "start": 6665.36, "end": 6677.36, "text": "jetzt als nächstes haben wir, ne Map, jawoll, wir könnten, wir machen, wir machen ne Map,"}, {"id": 672, "start": 6677.36, "end": 6687.6, "text": "auf der anderen Seite, ob ich jetzt ne Map ausfülle oder, ich mein wir könnten, Color"}, {"id": 673, "start": 6687.6, "end": 6691.92, "text": "Map, mal gucken, mal gucken was schöner ist, mal gucken, mal gucken was schöner ist, wobei"}, {"id": 674, "start": 6691.92, "end": 6699.4, "text": "keine Map, wir machen nen Array, wir machen nen Array, weil ne Map mit nem Index, ne Map"}, {"id": 675, "start": 6699.4, "end": 6710.0, "text": "mit nem Indizier, also des bescheuert, wir machen nen Array, so, zack, erstes Element,"}, {"id": 676, "start": 6710.0, "end": 6718.44, "text": "nulltes Element, da müssen wir es auf null, null ändern gleich, so was haben wir als nächstes,"}, {"id": 677, "start": 6718.44, "end": 6727.68, "text": "das da, äh, das da, seht ihr eigentlich wie Fivehead mein Clipboard Manager ist, dass"}, {"id": 678, "start": 6727.68, "end": 6738.72, "text": "er das da unten wegnimmt und da oben hinschreibt, so, so, dann muss nämlich die IDs, dann muss"}, {"id": 679, "start": 6738.72, "end": 6746.84, "text": "ich die IDs noch ändern, null, ich sehe schon, das mit eigener Komponente war doch nicht"}, {"id": 680, "start": 6746.84, "end": 6757.96, "text": "so, nicht so blöd, was der Chat vorgeschlagen hat, welcher Clipboard Manager, äh, Rofi,"}, {"id": 681, "start": 6757.96, "end": 6764.8, "text": "Rofi Clip, so und jetzt kann ich einfach sagen, return, Color Map, es ist ja nicht wirklich"}, {"id": 682, "start": 6764.8, "end": 6779.36, "text": "Color Map, Colors, es ist einfach Colors, so, äh, ID, so, so und wenn ich das jetzt"}, {"id": 683, "start": 6779.36, "end": 6789.08, "text": "ordentlich gemacht habe, sollte ich bei Color eigentlich jetzt die Farbe zurückbekommen,"}, {"id": 684, "start": 6789.08, "end": 6800.44, "text": "ok, bla, bla, bla, bla, das da, das da, geht, PogChamp, guck mal, nice, Funst und ist wieder"}, {"id": 685, "start": 6800.44, "end": 6808.72, "text": "erwartend sogar relativ lesbar, oder, finde, das kann man ziemlich gut lesen, was hier passiert,"}, {"id": 686, "start": 6808.72, "end": 6813.68, "text": "vielleicht soll ich es anstatt hier Color tatsächlich nochmal Color ID nennen, weil"}, {"id": 687, "start": 6813.68, "end": 6824.4, "text": "hier, ich nenne es hier überall Color ID, Moment, Multiple Cursors, Multiple Fivehats,"}, {"id": 688, "start": 6824.4, "end": 6834.96, "text": "bam, jawoll, nice, so, jetzt müssen wir noch übertragen, jetzt müssen wir noch, ähm,"}, {"id": 689, "start": 6834.96, "end": 6840.36, "text": "hinschreiben ob bold oder nicht, ok Chat, was haltet, also Schriftgröße brauchen wir"}, {"id": 690, "start": 6840.36, "end": 6845.2, "text": "nicht, oder, hatten wir doch gesagt, Schriftgröße ist unsinnig, also Schriftgröße, Schriftgröße"}, {"id": 691, "start": 6845.2, "end": 6850.08, "text": "ist unsinnig, weil Schriftgröße können wir damit einstellen, vielleicht machen wir"}, {"id": 692, "start": 6850.08, "end": 6855.0, "text": "doch, wir machen einen Fontselektor, da muss ich mir aber erstmal überlegen, Google, irgendjemand"}, {"id": 693, "start": 6855.0, "end": 6859.48, "text": "hat gesagt, Google Fonts, müssen wir uns gleich machen, wir machen, ich habe noch nie einen"}, {"id": 694, "start": 6859.48, "end": 6869.8, "text": "Fontselektor gemacht, erstmal gucken wie das funktioniert, ähm, Chat, wisst ihr, was"}, {"id": 695, "start": 6869.8, "end": 6879.8, "text": "noch viel Fiveheadiger wäre, was richtig massive Fiveheadig wäre, aber ich nicht weiß ob sich"}, {"id": 696, "start": 6879.8, "end": 6887.84, "text": "der Aufwand lohnt, eigentlich wäre es doch viel sinnvoller, man würde den Text gar nicht"}, {"id": 697, "start": 6887.84, "end": 6893.44, "text": "hier eintragen, sondern, man würde immer Text normal hier drauf droppen und dann könnte"}, {"id": 698, "start": 6893.44, "end": 6899.4, "text": "man das hier oben doppelt anklicken und dann hier oben drinnen editieren, da weiß ich"}, {"id": 699, "start": 6899.4, "end": 6906.56, "text": "aber nicht wie es geht, da müsste man irgendeinen Textbox Overlay machen oder sowas, wir bleiben"}, {"id": 700, "start": 6906.56, "end": 6922.96, "text": "jetzt erstmal dabei, weil da weiß ich, dass das funktioniert, könnte am Ende komisch"}, {"id": 701, "start": 6922.96, "end": 6926.0, "text": "aussehen, wenn du die Größe immer per Hand machst und dann eventuell keinen Unterschied"}, {"id": 702, "start": 6926.0, "end": 6931.92, "text": "hast, was, du kannst Content Edible machen, nee kann ich nicht, weil das hier oben ist"}, {"id": 703, "start": 6931.92, "end": 6942.4, "text": "ein Canvas, was gemalt wird im Hintergrund von Conva, das ist kein HTML Element, das"}, {"id": 704, "start": 6942.4, "end": 6950.0, "text": "ist Canvas, deswegen kann man da auch solche Sachen mit machen hier, was du mit HTML Elementen"}, {"id": 705, "start": 6950.0, "end": 6967.6, "text": "hier machen kannst, Small Text, die Library direkt kann das nicht, die sagen, man soll"}, {"id": 706, "start": 6967.6, "end": 6973.08, "text": "im Textbox Overlayen, das mach ich vielleicht dann irgendwann mal noch, aber nicht jetzt"}, {"id": 707, "start": 6973.08, "end": 6979.4, "text": "gleich, ok zack, Leute ich muss euch sagen, der Chat verleitet mich dazu Sachen relativ"}, {"id": 708, "start": 6979.4, "end": 6993.8, "text": "ordentlich zu programmieren, jetzt mach ich das da außen vor, so, Default Color ID ist"}, {"id": 709, "start": 6993.8, "end": 7001.04, "text": "0 und dann ist auch die hier selected, das heißt standardmäßig inserte ich das mit"}, {"id": 710, "start": 7001.04, "end": 7014.16, "text": "weiß, das ist ziemlich blöd, die standard Color ID sollte 4 sein, Schwatz, ok, wie kriegen"}, {"id": 711, "start": 7014.16, "end": 7030.12, "text": "wir da jetzt einen Font Selector hin, irgendjemand eine Big Brain Idee, wir machen zwar, wir"}, {"id": 712, "start": 7030.12, "end": 7037.6, "text": "machen zwar, du bist immer noch für 3 Buttons, Bold Italic Underline, ok, dann machen wir"}, {"id": 713, "start": 7037.6, "end": 7048.68, "text": "das noch, weil es der Chat ist, wie macht es eigentlich Canva.com, von denen kann man"}, {"id": 714, "start": 7048.68, "end": 7061.8, "text": "bisschen UI klauen, wie machen die das eigentlich, wie machen die das eigentlich, Text, ok die"}, {"id": 715, "start": 7061.8, "end": 7070.92, "text": "machen das, Dark Reader macht es kaputt, ja die machen es auch so, boah ich glaube das"}, {"id": 716, "start": 7070.92, "end": 7078.96, "text": "ist mega aufwendig sowas hier zu machen, dass du das hier drinnen editieren kannst,"}, {"id": 717, "start": 7078.96, "end": 7092.12, "text": "NPM für Font Picker brauche ich nicht, ach die haben hier oben so eine Leiste, die haben"}, {"id": 718, "start": 7092.12, "end": 7099.88, "text": "hier oben so eine Leiste und hier kann man dann, ach so machen die das, ok, das ist natürlich"}, {"id": 719, "start": 7099.88, "end": 7107.76, "text": "auch clever, Chat vielleicht sollte ich meine Menüs auch so machen, auf dem Desktop so"}, {"id": 720, "start": 7107.76, "end": 7115.72, "text": "und auf dem Smartphone so, ist vielleicht die clevere Idee, weil auf dem Desktop hast"}, {"id": 721, "start": 7115.72, "end": 7120.76, "text": "du hier Platz und auf dem Smartphone hast du hier Platz, das kann man sogar relativ"}, {"id": 722, "start": 7120.76, "end": 7128.06, "text": "easy machen, das ist ein bisschen CSS und Viewports und sowas, also so, das schreibe"}, {"id": 723, "start": 7128.06, "end": 7133.96, "text": "ich mir auf, das schreibe ich mir auf fürs nächste Mal, also wir bleiben noch eine Weile"}, {"id": 724, "start": 7133.96, "end": 7158.44, "text": "on, aber das mache ich heute nicht, hier, Icon Browser, aber hier, keine Ahnung, to do,"}, {"id": 725, "start": 7158.44, "end": 7160.48, "text": "responsive, LG gleich Menu Left, Smartphone Menu Bottom, irgendwie so, Kellner Kai, danke"}, {"id": 726, "start": 7160.48, "end": 7164.18, "text": "schön für den, ah nee, ist gar kein Sub, aber schön dass du den Weg her gefunden hast,"}, {"id": 727, "start": 7164.18, "end": 7166.9, "text": "hab ich mal geguckt, übrigens Subscriptions habe ich mir schon wieder die Hälfte übersehen,"}, {"id": 728, "start": 7166.9, "end": 7175.22, "text": "Sekunde, BartenderEnter hat Subscribed, danke schön, Overlay, Tanser, BloodSnake, danke"}, {"id": 729, "start": 7175.22, "end": 7193.62, "text": "Leute für die Subs, voll verdrängt, so, wisst ihr was, ich finde den Standardrahmen,"}, {"id": 730, "start": 7193.62, "end": 7199.86, "text": "ehrlich gesagt, in weiß, nein Max, wir halten uns jetzt nicht an die Color von den Rahmen"}, {"id": 731, "start": 7199.86, "end": 7207.62, "text": "in der Textbox auf, das machen wir jetzt nicht, wir machen jetzt Font Selection, nee, nee,"}, {"id": 732, "start": 7207.62, "end": 7215.26, "text": "nee, machen wir nicht, wir machen erst noch Bold Italic, sonst was, ok, also, da brauchen"}, {"id": 733, "start": 7215.26, "end": 7224.1, "text": "wir noch was hier, neben dran würde ich sagen, oder Chat, quasi noch mal hier neben dran,"}, {"id": 734, "start": 7224.1, "end": 7232.94, "text": "was brauchen wir da, was habt ihr gesagt, Bold Italic Underline, also das würde ich"}, {"id": 735, "start": 7232.94, "end": 7249.3, "text": "quasi sagen, Let, irgendwie Style, gleich, Nix ausgewählt, Moment, das ist, das ist"}, {"id": 736, "start": 7249.3, "end": 7255.14, "text": "gar nicht so einfach, das brauchen wir, weil du kannst ja mehrere Styles zusammen machen,"}, {"id": 737, "start": 7255.14, "end": 7273.1, "text": "New Set, oh, Fiveheader, Fiveheader Time, Set, MonkaS, ok, mal schauen, ich mach mal"}, {"id": 738, "start": 7273.1, "end": 7283.86, "text": "kurz das On-Click weg, das blick ich da nicht mehr durch, so, das ist da auch weg, so, und"}, {"id": 739, "start": 7283.86, "end": 7290.46, "text": "es hat keinen Rahmen, ich brauch ein eigen Material Design Icon für Italic, oder nee,"}, {"id": 740, "start": 7290.46, "end": 7301.58, "text": "Bold, brauchen wir, Bold, ja, Seite, Please, funktionieren, High Speed Seite, die gibt"}, {"id": 741, "start": 7301.58, "end": 7321.46, "text": "es nicht, Underline, Ach, Format, Format, Underline, was haben wir denn da, Underline"}, {"id": 742, "start": 7321.46, "end": 7332.98, "text": "und dann, wo, wo ist, wo ist Italic, verstehe ich jetzt nicht, da muss es doch Icons für"}, {"id": 743, "start": 7332.98, "end": 7349.58, "text": "geben, Italic und wo ist Bold, gibt es, ah, ok, dann ist, dann ist easy, also, SVG, wir"}, {"id": 744, "start": 7349.58, "end": 7355.82, "text": "haben eine Icon Library, aber, vor ich da jetzt wieder rumwurschteln, mach ich das lieber"}, {"id": 745, "start": 7355.82, "end": 7374.26, "text": "erstmal einfach so von der Hand rein, so, also, Diff, Content, da, Flex, Align Center,"}, {"id": 746, "start": 7374.26, "end": 7387.14, "text": "nee, Align, Ach, wie ging das nochmal, Justify Center, Justify Center und Items Center, jawoll,"}, {"id": 747, "start": 7387.14, "end": 7407.02, "text": "sehr gut, was brauchen wir jetzt sonst noch, Format, Italic, SVG, so, Copy Paste wir uns"}, {"id": 748, "start": 7407.02, "end": 7415.62, "text": "den Krempel mal, ok, und was als letztes noch, was hatte ich nicht, Bold, Italic, Underline,"}, {"id": 749, "start": 7415.62, "end": 7432.98, "text": "ok, Massive F-Zero Musik, so, Programmieren gleich Copy und Paste, ja, öfters als man"}, {"id": 750, "start": 7432.98, "end": 7441.78, "text": "denkt, das sieht ziemlich kacke aus mit dem Rahmen drum herum, oder, das sieht ziemlich"}, {"id": 751, "start": 7441.78, "end": 7459.42, "text": "pains-champelig aus, aber, was willst du machen, mir fällt da grad wenig ein, vielleicht machen"}, {"id": 752, "start": 7459.42, "end": 7470.14, "text": "wir das ne Zeile unten drunter, vielleicht machen wir das ne Zeile unten drunter, oh,"}, {"id": 753, "start": 7470.14, "end": 7489.94, "text": "ja, wozu eigentlich ein Component Based Framework, weil ich JavaScript Noob bin und das ich ganz"}, {"id": 754, "start": 7489.94, "end": 7500.02, "text": "bestimmt nicht mit reinem Vanilla JS hinkriege, so, wirklich schicker finde ich das jetzt"}, {"id": 755, "start": 7500.02, "end": 7509.54, "text": "auch nicht wenn ich ehrlich bin, ich mach das was der Chat sagt, der Chat meinte, wir"}, {"id": 756, "start": 7509.54, "end": 7521.3, "text": "splitten das irgendwie auf, also quasi, Chat wie meint ihr das so, das so aufsplitten,"}, {"id": 757, "start": 7521.3, "end": 7545.3, "text": "so, und das andere dann rechts, oder wie, oder wo, oder was, in Parent Div, einfach"}, {"id": 758, "start": 7545.3, "end": 7553.5, "text": "justify between adden, ok, wenn der Chat das sagt, dann muss das stimmen, hatte der Chat"}, {"id": 759, "start": 7553.5, "end": 7574.14, "text": "schon jemals unrecht, Leute, justify between, aha, naja, ok, Leute, zum testen reicht's,"}, {"id": 760, "start": 7574.14, "end": 7580.54, "text": "schön machen können wir das immer noch, wir dürfen uns jetzt nicht so viel mit gebastelt"}, {"id": 761, "start": 7580.54, "end": 7591.38, "text": "hier aufhalten, so, also jetzt können wir noch Underline Italic Bold machen, so, und"}, {"id": 762, "start": 7591.38, "end": 7597.98, "text": "wenn man das jetzt klicken, wenn man das jetzt klicken, dann passiert folgendes, wenn"}, {"id": 763, "start": 7597.98, "end": 7614.74, "text": "wir jetzt hier anklicken, Underline, dann passiert hier oben, haben wir nämlich style, add, underline,"}, {"id": 764, "start": 7614.74, "end": 7629.62, "text": "und jetzt, select, das ist usability, echt nicht schön, style, includes, ne, wie kann"}, {"id": 765, "start": 7629.62, "end": 7643.94, "text": "man checken, Moment, js map includes, wie geht das, has, has, ok, has, underline, ok,"}, {"id": 766, "start": 7643.94, "end": 7657.82, "text": "das funktioniert nicht, warum nicht, bestimmtfalls Weltlogik, bestimmtfalls Weltlogik, ich wusste"}, {"id": 767, "start": 7657.82, "end": 7669.7, "text": "es, ich wusste es, Textball kommt weg, brauchen wir nicht mehr, ok, das muss in der eigenen"}, {"id": 768, "start": 7669.7, "end": 7681.5, "text": "Component, das ist nicht mehr händelbar, so langsam, ich blicke nicht mehr durch, too"}, {"id": 769, "start": 7681.5, "end": 7691.58, "text": "much untereinander, bold, aber wisst ihr was das cool ist, ich kann jetzt mehrere selecten"}, {"id": 770, "start": 7691.58, "end": 7698.02, "text": "und von den Farben, von den Farben kann ich nur eins selecten, ist nice, oder, hier kann"}, {"id": 771, "start": 7698.02, "end": 7709.66, "text": "ich mehrere selecten, aber nicht anselecten, warum nicht anselecten, weil ich nicht, oh"}, {"id": 772, "start": 7709.66, "end": 7719.38, "text": "ne, please, das ist eklig, ich muss es removeen, wenn es schon drin ist, also ich muss quasi"}, {"id": 773, "start": 7719.38, "end": 7740.7, "text": "sagen, if, boah, if has bold, also sprich, wenn es schon, wenn es schon hinzugefügt ist,"}, {"id": 774, "start": 7740.7, "end": 7753.78, "text": "dann muss ich sagen, style, remove, ne, delete, delete ist es, ja, ja, ja, es funktioniert,"}, {"id": 775, "start": 7753.78, "end": 7763.94, "text": "ok, nice, boah, ist das, i get, can't wait, man, zack, ihr seht, programmieren ist copy"}, {"id": 776, "start": 7763.94, "end": 7776.78, "text": "pasten, zack, zack, zack, zack, zack, ne, zack, zack, zack, ok, ich kann, fuck, was"}, {"id": 777, "start": 7776.78, "end": 7782.46, "text": "ist jetzt, nein, hier soll ich italien, so, jetzt kann ich selecten und kann anselecten,"}, {"id": 778, "start": 7782.46, "end": 7791.7, "text": "nice, huge, massive leiste hier, und color kann ich nur eine selecten, so, so muss das"}, {"id": 779, "start": 7791.7, "end": 7804.22, "text": "sein, alles klar, ah, Moment, wir können tatsächlich ne Funktion machen, das ist eigentlich total"}, {"id": 780, "start": 7804.22, "end": 7809.54, "text": "hängen geblieben, das nicht als extra Funktion zu machen, chat, warum sagt ihr denn nichts,"}, {"id": 781, "start": 7809.54, "end": 7827.16, "text": "wir brauchen ne extra Funktion, toggle, style, style oder name, das kann man doch bestimmt"}, {"id": 782, "start": 7827.16, "end": 7838.02, "text": "auch schöner machen, oder, has, ne, aber bei, fällt mir jetzt grad nix anderes ein, einfach"}, {"id": 783, "start": 7838.02, "end": 7849.98, "text": "string, pass und gg, was, keine Ahnung, so, jetzt machen wir nämlich, anstatt das hier,"}, {"id": 784, "start": 7849.98, "end": 7857.66, "text": "schreiben wir jetzt einfach rein, so, underline, schauen wir mal, ob es funktioniert, ja, easy,"}, {"id": 785, "start": 7857.66, "end": 7870.78, "text": "easy, jetzt können wir nämlich diesen ganzen Mist hier ersetzen, bold italic, und es funktioniert"}, {"id": 786, "start": 7870.78, "end": 7876.54, "text": "immer noch, so, so ist gut, nice, so, aber eigentlich wollten wir uns ja angucken, wie"}, {"id": 787, "start": 7876.54, "end": 7882.5, "text": "man verschiedene Schriften macht, da bin ich jetzt wirklich ein bisschen planlos, ich mache"}, {"id": 788, "start": 7882.5, "end": 7889.26, "text": "mir zwar einfach testweise hier unten, ich mach mir jetzt testweise mal drei Buttons,"}, {"id": 789, "start": 7889.26, "end": 7897.86, "text": "so, areal, das ist nur zum ausprobieren, areal, was brauchen wir sonst noch für ne Schrift,"}, {"id": 790, "start": 7897.86, "end": 7912.42, "text": "comic sans, und die keqw Schrift, so, und wenn ich das hier anklicke, nur zum ausprobieren,"}, {"id": 791, "start": 7912.42, "end": 7919.3, "text": "wenn ich das hier anklicke, dann sollte sich die Schriftart ändern, ok, wo kriege ich Schriftarten"}, {"id": 792, "start": 7919.3, "end": 7932.82, "text": "her, google, google fonts, sagt der Chat, google fonts, ja, return, ich will ja nicht return,"}, {"id": 793, "start": 7932.82, "end": 7936.86, "text": "ich will ja unten drunter noch, guck mal, ich will nicht return, ich will unten drunter"}, {"id": 794, "start": 7936.86, "end": 7949.34, "text": "noch style gleich style machen, das ist Weltkram, das braucht man, style gleich has name, ah,"}, {"id": 795, "start": 7949.34, "end": 7955.14, "text": "wir könnten ein tannery, tannery, tannery, wie auch immer man das ausspricht, operator"}, {"id": 796, "start": 7955.14, "end": 7962.46, "text": "machen, also den da, das ist ne gute Idee, tannery, wie spricht man das richtig aus,"}, {"id": 797, "start": 7962.46, "end": 7980.74, "text": "pronunciation, tannery, tannery, tannery, ok, ein tannery operator können wir machen,"}, {"id": 798, "start": 7980.74, "end": 7993.7, "text": "ob es das dann schöner macht, style gleich has name, wenn ja, Moment, das ist Javascript,"}, {"id": 799, "start": 7993.7, "end": 8008.94, "text": "das funktioniert bestimmt oder, nein das funktioniert nicht, das funktioniert nicht, das hat ja"}, {"id": 800, "start": 8008.94, "end": 8015.06, "text": "keine return werte das Ding, das muss ich glaube ich so machen, ah ja, ich kann damit"}, {"id": 801, "start": 8015.06, "end": 8022.02, "text": "leben, Javascript passt schon, Leerzeichen dazwischen, keine Leerzeichen, ich mag ja"}, {"id": 802, "start": 8022.02, "end": 8028.74, "text": "Leerzeichen vor einem if in der, egal, darf man nicht, gut, also, was soll ich machen,"}, {"id": 803, "start": 8028.74, "end": 8037.66, "text": "google fonts css import, roboto, roboto ist immer schön, roboto ist immer schön, nimm"}, {"id": 804, "start": 8037.66, "end": 8056.1, "text": "zum testen einfach zeichen fonts vom betriebssystem, das ist wohl wahr, let font gleich arial, so,"}, {"id": 805, "start": 8056.1, "end": 8078.78, "text": "wie ändert man den font überhaupt, wie ändert man dann den font überhaupt, style, inline"}, {"id": 806, "start": 8078.78, "end": 8094.54, "text": "style, jetzt was font, family, ne, Moment, was war ich denn hier, font, family, arial,"}, {"id": 807, "start": 8094.54, "end": 8117.02, "text": "ok, easy, also hier font, so, das scheint ja zu funktionieren, also on click, ich vergesse"}, {"id": 808, "start": 8117.02, "end": 8138.06, "text": "immer drum herum die geschweiften klammern zu machen, ok font gleich arial, arial, so,"}, {"id": 809, "start": 8138.06, "end": 8150.86, "text": "font, roboto und font, was ist die times oder so, ok den in der Mitte hab ich nicht, hab"}, {"id": 810, "start": 8150.86, "end": 8157.5, "text": "ich nicht roboto installiert, sag mir mal irgendein font, mono, monospace hab ich auf"}, {"id": 811, "start": 8157.5, "end": 8170.34, "text": "jeden fall drauf, font guck mal, arial, comic, uns und times, also von der idee her tut das,"}, {"id": 812, "start": 8170.34, "end": 8181.82, "text": "wie macht man das jetzt mit google fonts und die frage ist doch eigentlich viel eher,"}, {"id": 813, "start": 8181.82, "end": 8188.5, "text": "ich kann doch jetzt nicht, Leute, ich kann doch jetzt nicht 10, 20 fonts laden, oder,"}, {"id": 814, "start": 8188.5, "end": 8202.3, "text": "so ein font ist doch, na wobei, was da du in dem on click keine parameter und nur ein ausdruck"}, {"id": 815, "start": 8202.3, "end": 8229.1, "text": "hast würde das auch gehen, font gleich arial und was, discard, so, ne, ah das muss man"}, {"id": 816, "start": 8229.1, "end": 8242.3, "text": "klammern, ich lass das erstmal so, weil ich muss da bestimmt noch mehr reinschreiben"}, {"id": 817, "start": 8242.3, "end": 8252.26, "text": "gleich, also was ich kenne ist bei font selector ist sowas hier, gucken wir mal an, wie die"}, {"id": 818, "start": 8252.26, "end": 8260.74, "text": "das machen hier, rappen wir ein bisschen das user interface von denen mal ab, also die machen"}, {"id": 819, "start": 8260.74, "end": 8266.3, "text": "das so, überschrift und dann haben sie so ein drop down mit den fonts, ah die laden"}, {"id": 820, "start": 8266.3, "end": 8277.1, "text": "die fonts dynamisch, 5 header time, haben die irgendwie ganz google fonts integriert"}, {"id": 821, "start": 8277.1, "end": 8284.22, "text": "oder was, guck mal wer da ist, kennt ihr den, von dem hab ich schon mal was im chat gelesen,"}, {"id": 822, "start": 8284.22, "end": 8302.66, "text": "guck mal der lädt das, Leute, der lädt das dynamisch nach, oder, hat google fonts irgendwas"}, {"id": 823, "start": 8302.66, "end": 8312.34, "text": "zum preview generieren ohne dass ich die schriftart laden muss, weil da muss ja die vorschau irgendwie"}, {"id": 824, "start": 8312.34, "end": 8326.98, "text": "generieren, ich hab das noch nicht, keine ahnung, wie groß die fonts, da weiß ich ordentlich"}, {"id": 825, "start": 8326.98, "end": 8335.58, "text": "von den label drucker, wir machen 3 fonts, das reicht Leute, roboto, open sans, monzerat,"}, {"id": 826, "start": 8335.58, "end": 8348.94, "text": "was auch immer, roboto ist eh beste font, roboto, roboto medium 500 beste, roboto medium"}, {"id": 827, "start": 8348.94, "end": 8378.54, "text": "das will ich haben, selectestyle, css import, style, ah nee, ach moment, null, ah ne, ich"}, {"id": 828, "start": 8378.54, "end": 8392.54, "text": "hab das noch nicht, so und was muss ich jetzt specifyen, äh, hä, Leute, warum muss ich"}, {"id": 829, "start": 8392.54, "end": 8401.5, "text": "beides, das verstehe ich jetzt nicht, ich kann doch font family nur einmal setzen, warum"}, {"id": 830, "start": 8401.5, "end": 8406.86, "text": "muss ich jetzt, ach moment, den hab ich vom letzten mal noch hier drin, den font, wie lösche"}, {"id": 831, "start": 8406.86, "end": 8426.02, "text": "ich den dann wieder, font family, roboto, brauch ich, font family, roboto, reicht das"}, {"id": 832, "start": 8426.02, "end": 8433.58, "text": "wenn ich das so lade, dass es nicht mehr dsgvo konform war, ach weil google fonts, wisst"}, {"id": 833, "start": 8433.58, "end": 8442.06, "text": "ihr, wisst ihr, wie sehr mich das interessiert, ob das dsgvo konform ist oder nicht, also"}, {"id": 834, "start": 8442.06, "end": 8448.98, "text": "wollen wir hier mal, anscheinend wollen wir hier roboto, roboto, gibt es irgendeinen coolen"}, {"id": 835, "start": 8448.98, "end": 8461.82, "text": "comic fonts, search, comic, comic neue, das, Leute ich sag's euch, dass wir der renner"}, {"id": 836, "start": 8461.82, "end": 8486.78, "text": "bei labeldruckern jetzt, nee, nicht robot, roboto, roboto, bam, funst, danke für den"}, {"id": 837, "start": 8486.78, "end": 8492.54, "text": "sub, da ist er wieder, max powerq, jetzt wo du da bist, danke für die subs, hast du"}, {"id": 838, "start": 8492.54, "end": 8497.22, "text": "immer noch problem mit dotnet, vielleicht können wir dir helfen mit der, fehlermeldung,"}, {"id": 839, "start": 8497.22, "end": 8500.54, "text": "warum es bei dir nicht funktioniert unter linux, weil ich, ich kenne ehrlich gesagt"}, {"id": 840, "start": 8500.54, "end": 8516.26, "text": "wenig was so problemlos cross platform funktioniert, so roboto funktioniert als font, comic neue,"}, {"id": 841, "start": 8516.26, "end": 8546.22, "text": "das brauchen wir, comic, neue, regular, alles klar, dann nicht, roboto, kann ich dir"}, {"id": 842, "start": 8546.22, "end": 8558.74, "text": "jetzt eigentlich auch bold machen, font, high IQ chat, jemanden planen, wie macht man das"}, {"id": 843, "start": 8558.74, "end": 8567.3, "text": "bold, font, wie macht man den css, so in richtig style css das bold, weil ich kann's einfach"}, {"id": 844, "start": 8567.3, "end": 8582.02, "text": "sagen font bold, ist es jetzt dicker als normal, ist das jetzt pepofettiger, sag mal chat kann"}, {"id": 845, "start": 8582.02, "end": 8599.26, "text": "das sein, dass ich roboto installiert habe und das deswegen funktioniert, nö, font bold,"}, {"id": 846, "start": 8599.26, "end": 8606.46, "text": "ok so jetzt haben wir den text von am start, was brauchen wir dann sonst noch, comic, comics,"}, {"id": 847, "start": 8606.46, "end": 8621.3, "text": "ja comics, comic, neue, unbedingt, regular, import, ich importiere jetzt einfach just for"}, {"id": 848, "start": 8621.3, "end": 8634.86, "text": "fann massig font krempel weil es geht ok wie heißt das ding comic comic neue neue comic"}, {"id": 849, "start": 8634.86, "end": 8659.9, "text": "so also hier comic bamm massive comic so was brauche man sonst noch chat eine ordentliche"}, {"id": 850, "start": 8659.9, "end": 8665.18, "text": "schrift art brauche noch irgendwas was richtig gut für impact impact ist glaube ich gut"}, {"id": 851, "start": 8665.18, "end": 8674.74, "text": "für labels nie gibt es nicht label in einem guten font für label bresa rief natürlich"}, {"id": 852, "start": 8674.74, "end": 8695.46, "text": "ist das gut für label schon oder das hier ziemlich passend für label aus tatsächlich"}, {"id": 853, "start": 8695.46, "end": 8712.42, "text": "sehr rief so das haben wir hier das ist ziemlich gut für label das ist ziemlich gut für label"}, {"id": 854, "start": 8712.42, "end": 8720.18, "text": "hier oder finde ich nice roboto geht comic ist ehrlich gesagt ziemlicher krabb type right"}, {"id": 855, "start": 8720.18, "end": 8738.86, "text": "typewriter typewriter gibt es nicht als font type etikett kategorie also wir haben monospace"}, {"id": 856, "start": 8738.86, "end": 8746.26, "text": "font dabei moment ich habe normales roboto genommen ich will roboto mono haben roboto"}, {"id": 857, "start": 8746.26, "end": 8768.38, "text": "mono will ich haben 500 ja aber man muss das hier enden ach fai fertig man ändert das"}, {"id": 858, "start": 8768.38, "end": 8785.26, "text": "hier und dann generiert es einem so einen bundle ja garamond jetzt kommen die ganzen"}, {"id": 859, "start": 8785.26, "end": 8799.58, "text": "h i q f empfehlung medium 500 ja das ist glaube ich nicht verkehrt als label wisterio danke"}, {"id": 860, "start": 8799.58, "end": 8807.5, "text": "für den sub ist es der chain law oder ist was anderes jemand anderes max power danke"}, {"id": 861, "start": 8807.5, "end": 8818.54, "text": "für noch mal hier gehts aber ab ok selekte style selekte style ok style import ok es"}, {"id": 862, "start": 8818.54, "end": 8835.82, "text": "reicht jetzt drei styles sind genug roboto mono ist das hier noch mono oder zusammengeschrieben"}, {"id": 863, "start": 8835.82, "end": 8852.1, "text": "ne auseinander so das sind schöne unterschiedliche schriften oder ist das die schrift ist das"}, {"id": 864, "start": 8852.1, "end": 8864.02, "text": "die richtige ne das ist nicht die richtige was muss ich angeben das ist nicht die richtige"}, {"id": 865, "start": 8864.02, "end": 8880.14, "text": "schrift da sehe ich was anderes weil wenn ich hier mist angebe dann kommt es gleich"}, {"id": 866, "start": 8880.14, "end": 8887.1, "text": "heraus wenn ich da drauf klicke warum findet er das jetzt nicht was was mache ich was mache"}, {"id": 867, "start": 8887.1, "end": 8900.98, "text": "ich verkehrt muss ich mal neu generieren hatte ich nicht hatte ich nicht generiert da ich"}, {"id": 868, "start": 8900.98, "end": 8913.38, "text": "hat es generiert ok die funs nicht im browser oder wie habe ich irgendwas falsch geschrieben"}, {"id": 869, "start": 8913.38, "end": 8931.74, "text": "nö oder ist alles richtig keine ahnung lasst ihr schmecken da jetzt weiß ich nicht was"}, {"id": 870, "start": 8931.74, "end": 8943.98, "text": "der warum das ist die schrift da nicht mag die mag er nicht wurde der font geladen schauen"}, {"id": 871, "start": 8943.98, "end": 8961.02, "text": "wir mal ich mein er wird zumindest hier reingehauen so wo sieht man das in den dev tools hallo"}, {"id": 872, "start": 8961.02, "end": 8971.3, "text": "sieht man in den dev tools geladene fonts application net ach hier meinste bei network ob der den"}, {"id": 873, "start": 8971.3, "end": 8994.82, "text": "request macht zu google ja gut den request muss er ja machen anscheinend und es habe"}, {"id": 874, "start": 8994.82, "end": 9011.42, "text": "ich jetzt gemacht was habe ich jetzt gemacht und wie kriege ich es wieder weg keine ahnung"}, {"id": 875, "start": 9011.42, "end": 9036.94, "text": "sei zu neuladen ich weiß wie kriege ich das wieder weg was was so aha also die fonts werden"}, {"id": 876, "start": 9036.94, "end": 9043.5, "text": "geladen also warum der font nicht geht verstehe ich nicht muss ich vielleicht font weight"}, {"id": 877, "start": 9043.5, "end": 9048.78, "text": "500 oder so noch machen probieren ich trage es mal direkt ein"}, {"id": 878, "start": 9048.78, "end": 9070.28, "text": "nö guckt ach moment es hat doch funktioniert oder war das mal das sieht einfach nur ähnlich"}, {"id": 879, "start": 9070.28, "end": 9076.34, "text": "aus wie meine default schrift aber das ist doch nicht das ist doch nicht der font hier"}, {"id": 880, "start": 9076.34, "end": 9079.9, "text": "das sieht doch ganz anders aus text normal"}, {"id": 881, "start": 9079.9, "end": 9090.7, "text": "nee das ist da nicht guck mal hier geht das t in beide richtungen hier geht das t nach"}, {"id": 882, "start": 9090.7, "end": 9097.9, "text": "links weil das ist da nicht ok font weight machen wir noch font weight 500"}, {"id": 883, "start": 9097.9, "end": 9115.46, "text": "gibt's nicht wird nicht geladen kein bock verstehe ich jetzt nicht aber gut was auch"}, {"id": 884, "start": 9115.46, "end": 9129.9, "text": "immer low low iq font loading genau das habe ich angegeben hier"}, {"id": 885, "start": 9129.9, "end": 9154.78, "text": "geht nicht also ich check es nicht weil offensichtlich moment das ist der richtige font das ist die"}, {"id": 886, "start": 9154.78, "end": 9162.86, "text": "ganze zeit der richtige font das sieht einfach nur klein skaliert nicht so aus ok ist gut"}, {"id": 887, "start": 9162.86, "end": 9170.42, "text": "funktioniert funktioniert auch schon die ganze zeit keck weight schon die ganze zeit richtig"}, {"id": 888, "start": 9170.42, "end": 9193.18, "text": "gewesen gibt es nicht eine gute api von excalibur habe ich nicht ausprobiert so was was kann"}, {"id": 889, "start": 9193.18, "end": 9203.94, "text": "man da jetzt machen wie wird man wie insertet man text und ein try out now achso plus wenn"}, {"id": 890, "start": 9203.94, "end": 9205.94, "text": "man was entbinden kann bin ich ja auch dabei"}, {"id": 891, "start": 9205.94, "end": 9225.82, "text": "nee gibt keine api gibt keine richtige api oder doch"}, {"id": 892, "start": 9225.82, "end": 9234.82, "text": "oh nee i frame api nee hör mal bloß auf ich weiß gar nicht wie man hier text wie insertet"}, {"id": 893, "start": 9234.82, "end": 9247.26, "text": "man hier überhaupt text leute doppelklick nee ich glaube der dark reader macht es kaputt"}, {"id": 894, "start": 9247.26, "end": 9257.82, "text": "oder ah der dark reader macht es kaputt mich würde interessieren mit was sie das"}, {"id": 895, "start": 9257.82, "end": 9275.66, "text": "trauen mit was machen die das ist es in canvas oder ist es webgl oder wie machen die das"}, {"id": 896, "start": 9275.66, "end": 9299.98, "text": "weiß man was canvas ok vielleicht mit webgl drunter mal schauen nee aber i frame api ist"}, {"id": 897, "start": 9299.98, "end": 9307.94, "text": "crap dann mache ich lieber mein eigenes text ding so gut jetzt kann man schriftart auswählen"}, {"id": 898, "start": 9307.94, "end": 9317.06, "text": "wunderbar ja was braucht man mehr oder ist doch ist doch eigentlich ist eigentlich ausreichend"}, {"id": 899, "start": 9317.06, "end": 9331.82, "text": "mal eigentlich müsste man so eine art drop down machen für die für die schriftart aber"}, {"id": 900, "start": 9331.82, "end": 9346.26, "text": "drop drop down menüs sind so ziemlich das ekligste was es in javascript gibt drop down"}, {"id": 901, "start": 9346.26, "end": 9352.1, "text": "das ist richtig ab nicht das da das meine ich nicht select select menü javascript das"}, {"id": 902, "start": 9352.1, "end": 9356.82, "text": "ist ganz abhaltig das möchte man eigentlich nicht nicht verwenden guck mal das sieht aus"}, {"id": 903, "start": 9356.82, "end": 9368.62, "text": "wie von 1995 und du kannst es nicht richtig style oder doch custom select aber man kann"}, {"id": 904, "start": 9368.62, "end": 9382.3, "text": "es eklig style nur excalibur für react ja das ist dann wahrscheinlich aber auch nur"}, {"id": 905, "start": 9382.3, "end": 9394.46, "text": "die i frame api gewerbt ach nee das zum selbst hausen oder wie das ist die anwendung komplett"}, {"id": 906, "start": 9394.46, "end": 9413.1, "text": "also so einen so einen font option menü ist schon ist schon eklig warte mal select wir"}, {"id": 907, "start": 9413.1, "end": 9418.18, "text": "probieren mal was aus so als letzte amtshandlung heute ich kann schon immer richtig denken"}, {"id": 908, "start": 9418.18, "end": 9427.02, "text": "wir probieren mal was aus so select da wenn ich das schon sehe wir brauchen ja nur drei"}, {"id": 909, "start": 9427.02, "end": 9443.94, "text": "options oder gass nee vielleicht mache ich ja noch ein paar andere fonts keine ahnung"}, {"id": 910, "start": 9443.94, "end": 9454.78, "text": "sag mal wie lade ich das jetzt eigentlich coolerweise dynamisch oder ok chat wie ist"}, {"id": 911, "start": 9454.78, "end": 9465.94, "text": "das eigentlich wenn ich warte mal wir müssen mal kurz die die die tools an die seite machen"}, {"id": 912, "start": 9465.94, "end": 9474.66, "text": "und den browser fullscreen network so ich importiere jetzt ja hier die fonts nee der"}, {"id": 913, "start": 9474.66, "end": 9480.54, "text": "lädt alle fonts egal ob ich die an anklicken oder nicht es ist egal ob ich die anklicken"}, {"id": 914, "start": 9480.54, "end": 9494.06, "text": "oder nicht warte mal ohne cash laden wo ist der disable cash moment der lädt den font"}, {"id": 915, "start": 9494.06, "end": 9500.06, "text": "erst wenn ich es an klicke sehe ich das richtig"}, {"id": 916, "start": 9500.06, "end": 9516.7, "text": "ipad das ist gut da kann ich eigentlich eine 3km lange liste machen mit mit fonts und erst"}, {"id": 917, "start": 9516.7, "end": 9526.38, "text": "wenn du die anklickst wird das ausgewählt ja nur mit dem unterschied dass ich dann keine"}, {"id": 918, "start": 9526.38, "end": 9535.06, "text": "vorschau anzeigen kann du hast das import script am ende das ist kein problem guck da"}, {"id": 919, "start": 9535.06, "end": 9543.82, "text": "macht hier diesen import aber wirklich geladen wird das ist das erste mal wenn ich es verwende"}, {"id": 920, "start": 9543.82, "end": 9551.26, "text": "was cooles ich habe nichts gemacht um das lazy zu loaden aber er macht das einfach ist"}, {"id": 921, "start": 9551.26, "end": 9556.9, "text": "fortschritt immer so langsam nee das liegt nicht so sehr am stream wenn man sachen macht"}, {"id": 922, "start": 9556.9, "end": 9564.06, "text": "die man sonst nicht macht ist das meistens nicht sonderlich viel schneller ich hab ja"}, {"id": 923, "start": 9564.06, "end": 9577.58, "text": "keine ahnung was ich da treibe eigentlich der selektmenü ist wirklich eklig bäh hier"}, {"id": 924, "start": 9577.58, "end": 9589.5, "text": "ist der font so alles klar aber mal das ding wieder unten hin was meint der chat eben um"}, {"id": 925, "start": 9589.5, "end": 9594.38, "text": "das schöner noch zu machen was jetzt noch die colors und die font buttons jeweilig in"}, {"id": 926, "start": 9594.38, "end": 9598.38, "text": "ein eigenes diff dann sieht das mit dem flex auch besser ne font buttons habe ich ja net"}, {"id": 927, "start": 9598.38, "end": 9602.62, "text": "font font buttons also ich mach irgendeinen ich mach irgendeinen drop down für die für"}, {"id": 928, "start": 9602.62, "end": 9609.42, "text": "die fonts da fällt mir aber noch nichts ein also was mir vorschwebt ist ja folgendes also"}, {"id": 929, "start": 9609.42, "end": 9613.94, "text": "wisst ihr wisst ihr was halt wirklich schöner wäre nicht etwa hier irgendwie diesen kram"}, {"id": 930, "start": 9613.94, "end": 9620.38, "text": "einfügen so sondern jetzt doppelt klicken können das doppelt anklicken können dann"}, {"id": 931, "start": 9620.38, "end": 9634.06, "text": "kann ich mir hier oben nämlich auch das da sparen und dann mache ich es wirklich so dass"}, {"id": 932, "start": 9634.06, "end": 9639.38, "text": "das menü wobei das wisst ihr was chat das machen wir jetzt ich probiere das mal ich"}, {"id": 933, "start": 9639.38, "end": 9644.88, "text": "probiere das mal schnell kriege ich kriege ich auf die schnelle hin das menü links zu"}, {"id": 934, "start": 9644.88, "end": 9653.62, "text": "platzieren so aktuell sind wir fix am unteren bildschirmrand wie soll das dann auf dem"}, {"id": 935, "start": 9653.62, "end": 9659.26, "text": "handy gehen auf dem handy bleibt so auf dem desktop geht's links hin also von der idee"}, {"id": 936, "start": 9659.26, "end": 9670.02, "text": "hier muss ich jetzt einfach nur sagen lg moment ich sollte es vielleicht noch mal kurz so"}, {"id": 937, "start": 9670.02, "end": 9686.9, "text": "sortieren dass es alles zusammen steht so lg left null right null ist richtig"}, {"id": 938, "start": 9686.9, "end": 9696.82, "text": "moment wie machen das jetzt kann ich kann ich kann ich so was machen left null"}, {"id": 939, "start": 9696.82, "end": 9703.22, "text": "und dann breite 48 oder so"}, {"id": 940, "start": 9703.22, "end": 9718.98, "text": "wie mache ich das denn sticky left top muss ich wahrscheinlich machen null bottom null"}, {"id": 941, "start": 9718.98, "end": 9740.78, "text": "ach so weil ich hier die höhe drin habe ok ok ok breite 48 ok so würde ich das machen"}, {"id": 942, "start": 9740.78, "end": 9745.7, "text": "auf dem desktop das eigentlich ziemlich nice idee so würde ich das machen auf dem desktop"}, {"id": 943, "start": 9745.7, "end": 9750.1, "text": "also vielleicht nicht ganz so hässliche mit ein bisschen ramen oder sowas also so auf"}, {"id": 944, "start": 9750.1, "end": 9756.66, "text": "dem desktop und unten auf dem auf dem smartphone ok das bedeutet das machen wir jetzt schnell"}, {"id": 945, "start": 9756.66, "end": 9769.1, "text": "noch so das bedeutet left null ok lg top null nur nur nur lg so ok das ist noch klein"}, {"id": 946, "start": 9769.1, "end": 9784.34, "text": "das ist schöner kann ich ausprobieren so das auch nur bei lg"}, {"id": 947, "start": 9784.34, "end": 9791.58, "text": "ist das sinn von dieser seite custom label drucken zu können genau ein minimaler label"}, {"id": 948, "start": 9791.58, "end": 9796.98, "text": "editor hat zwei kunde erstens weil ich schon immer mal ein bisschen javascript grafik"}, {"id": 949, "start": 9796.98, "end": 9803.9, "text": "zeug machen wollte und zweitens weil ich einen label drucker gekauft habe der mega"}, {"id": 950, "start": 9803.9, "end": 9809.22, "text": "beschissene mobile apps hat und ich eigentlich nur eine webseite will und label drauf und"}, {"id": 951, "start": 9809.22, "end": 9815.74, "text": "print und fertig noch vielleicht speichern und laden ok wie kriege ich das jetzt hin"}, {"id": 952, "start": 9815.74, "end": 9828.1, "text": "also breite 96 sollte jetzt eigentlich nicht gebraucht werden wie also ich brauche ich"}, {"id": 953, "start": 9828.1, "end": 9848.34, "text": "muss es jetzt ja eigentlich docken right right zero ha leute bam moment nicht ganz nicht"}, {"id": 954, "start": 9848.34, "end": 9865.22, "text": "ganz fast so ganz richtig ist es noch nicht höhe ein drittel so hatten wir es vorher"}, {"id": 955, "start": 9865.22, "end": 9878.14, "text": "auch oder ja so hatten wir es vorher auch ah moment ok lg lg ist höhe dann voll zack"}, {"id": 956, "start": 9878.14, "end": 9901.9, "text": "guckt mal da huge responsiveness hier poggers aber lg is rounded none und lg ist auch right"}, {"id": 957, "start": 9901.9, "end": 9910.62, "text": "none geht das kann man das irgendwie überschreiben ja anscheinend nicht ja schön fasted das"}, {"id": 958, "start": 9910.62, "end": 9917.66, "text": "ist nice dass ihr das gefällt das ist cool das gefällt mir richtig gut guck mal jetzt"}, {"id": 959, "start": 9917.66, "end": 9922.9, "text": "ist das auch viel besser auf dem desktop zu zu bedienen und so ist es gut zu bedienen"}, {"id": 960, "start": 9922.9, "end": 9933.34, "text": "auf mobile so ist gut auf mobile so ist gut auf dem desktop richtig prog g mobile desktop"}, {"id": 961, "start": 9933.34, "end": 9937.5, "text": "mobile desktop wir können es dann aber wir können den desktop view kleiner ein bisschen"}, {"id": 962, "start": 9937.5, "end": 9945.62, "text": "schöner machen und wisst ihr was wir machen nicht lg wir machen medium obwohl das schon"}, {"id": 963, "start": 9945.62, "end": 9962.18, "text": "rüber rüber switch ja ab hier kann es schon rüber switchen wo ist mein canvas eigentlich"}, {"id": 964, "start": 9962.18, "end": 9980.9, "text": "hin sagt leute wo ist mein kett wo ist mein canvas hin aber das canvas verschiebt sich"}, {"id": 965, "start": 9980.9, "end": 9988.34, "text": "irgendwie ein bisschen ja gut ist auch so breit wie der bildschirm das ist das ist schick"}, {"id": 966, "start": 9988.34, "end": 9994.38, "text": "doch das gefällt mir das heißt wir das muss jetzt bloß hier in dieser größe ordentlich"}, {"id": 967, "start": 9994.38, "end": 10006.06, "text": "funktionieren und danach switch das rüber auf die auf die ansicht ja gut wir müssen"}, {"id": 968, "start": 10006.06, "end": 10010.46, "text": "das canvas noch verschieben dann das muss alles ein bisschen nach rechts rutschen aber"}, {"id": 969, "start": 10010.46, "end": 10015.86, "text": "das können wir das können wir das nächste mal machen das ist jetzt hat man auch die"}, {"id": 970, "start": 10015.86, "end": 10020.74, "text": "eigens hier richtig schön drin und da müssen wir ein bisschen weniger dann machen aber"}, {"id": 971, "start": 10020.74, "end": 10035.42, "text": "nice nice nice exzellent sozusagen das ist wirklich nice so so eine sache sollten wir"}, {"id": 972, "start": 10035.42, "end": 10040.3, "text": "jetzt aber noch machen und zwar dass man den camp hier unten wieder ausblenden kann"}, {"id": 973, "start": 10040.3, "end": 10051.58, "text": "hier habe ich das genannt open element browser so das heißt wenn ich switche und der offen"}, {"id": 974, "start": 10051.58, "end": 10068.98, "text": "ist also if browser menü wenn das gleich menü eintrag ist und das offen ist dann will"}, {"id": 975, "start": 10068.98, "end": 10078.18, "text": "ich schließen hoffentlich funs das jetzt ja aber jetzt geht aber nicht mehr auf warum"}, {"id": 976, "start": 10078.18, "end": 10105.34, "text": "geht es jetzt nicht mehr auf hä falls achso ja weil es dann hier zutrifft ähm else so"}, {"id": 977, "start": 10105.34, "end": 10116.98, "text": "und hier switchte aber ok nice und ich kann auf und zu machen und jetzt zum abschluss"}, {"id": 978, "start": 10116.98, "end": 10123.94, "text": "für heute noch eine richtig feifett idee kannst du eigentlich auch die font der svg zum pass"}, {"id": 979, "start": 10123.94, "end": 10135.22, "text": "konf was kannst du auch die font der svg zum pass ich habe keine ahnung was du mir mitteilen"}, {"id": 980, "start": 10135.22, "end": 10159.58, "text": "möchtest chat verstehe den jemann etikettendrucke obvius ist das so eins eins machen wir jetzt"}, {"id": 981, "start": 10159.58, "end": 10166.02, "text": "zum grünen abschluss heute svelte transitions was hat er jetzt hier für schmerzen all ready"}, {"id": 982, "start": 10166.02, "end": 10186.14, "text": "included er ist dumm der checkt es nicht dass ich die endung umbenannt habe keg weight so"}, {"id": 983, "start": 10186.14, "end": 10204.58, "text": "zum abschluss machen wir jetzt folgendes noch also if if ups if show element browser"}, {"id": 984, "start": 10204.58, "end": 10222.22, "text": "also ich kann mal is is open so rum geht immer noch schnell und jetzt sagen wir in paid pass"}, {"id": 985, "start": 10222.22, "end": 10232.34, "text": "mal auf jetzt passiert richtig poggers bäm massive ein und aus fäden menü guckt euch"}, {"id": 986, "start": 10232.34, "end": 10237.1, "text": "das mal ok das fällt ein bisschen das fällt ein bisschen zu langsam ein und aus muss"}, {"id": 987, "start": 10237.1, "end": 10252.86, "text": "man natürlich sein das mal duration 70 millisekunden oder 80 oder so 50 50 reicht wobei 50 so schnell"}, {"id": 988, "start": 10252.86, "end": 10266.18, "text": "das fällt kaum auf 100 ja ich brauche noch out kann man eigentlich out und in in einem"}, {"id": 989, "start": 10266.18, "end": 10287.06, "text": "machen 195 laut google x das jetzt jebait oder ist das wirklich so oder einfach transition"}, {"id": 990, "start": 10287.06, "end": 10299.1, "text": "so oder wie dann braucht man das nicht verstehe das ist nur wenn man extra optionen haben"}, {"id": 991, "start": 10299.1, "end": 10310.02, "text": "will 195 das ist doch viel zu lang für so ein menü man 195 das kommt er ja das kommt"}, {"id": 992, "start": 10310.02, "end": 10315.5, "text": "er ja ewig vor ein und auch deswegen fühlen sich die ganze material design dinger so lahm"}, {"id": 993, "start": 10315.5, "end": 10326.54, "text": "an weil die animation lamas faks sind jetzt verstehe ich auch die design geschichten von"}, {"id": 994, "start": 10326.54, "end": 10340.34, "text": "google das ist viel zu lang da wäre ich verrückt bei aber so ist eigentlich ganz cool fly in"}, {"id": 995, "start": 10340.34, "end": 10356.78, "text": "ist noch besser ok das war jetzt frei bleib ich gebe dir hätte alter bleib bleib ist das"}, {"id": 996, "start": 10356.78, "end": 10370.74, "text": "jetzt irgendwie anders swelt fly transition epsilon ist das von wo der los flight quasi"}, {"id": 997, "start": 10370.74, "end": 10384.34, "text": "das ist schick das ist schick das finde ich gut"}, {"id": 998, "start": 10384.34, "end": 10392.06, "text": "das ist nice guck mal hier wie es auf wie es rausfährt alter wie der typ der metal of"}, {"id": 999, "start": 10392.06, "end": 10400.14, "text": "honor warfighter aus dem boden gesporn ist der fährt aus dem boden raus hier poggers"}, {"id": 1000, "start": 10400.14, "end": 10418.42, "text": "und es klappt sogar wieder ein guck mal"}, {"id": 1001, "start": 10418.42, "end": 10434.94, "text": "es ist ziemlich brauchen es ist auch nicht bottom 0 es ist bottom 12 bottom 12 ist es"}, {"id": 1002, "start": 10434.94, "end": 10444.5, "text": "und es ist bei ist immer bottom 12 auch hier jetzt sind sie vielleicht ein bisschen bisschen"}, {"id": 1003, "start": 10444.5, "end": 10461.74, "text": "viel eigens auf einmal oder was mein ihr bis sie viel vielleicht"}, {"id": 1004, "start": 10461.74, "end": 10470.26, "text": "es ist richtig nice wie das hier rausgedingst moment die transition müsste anders sein"}, {"id": 1005, "start": 10470.26, "end": 10480.54, "text": "die transition müsste hier hier eigentlich von links kommen es ist eigentlich auch nice"}, {"id": 1006, "start": 10480.54, "end": 10487.7, "text": "ohne ssr ich mache überhaupt kein ssr gerade ich habe jegliches ssr abgeschaltet mir müsste"}, {"id": 1007, "start": 10487.7, "end": 10498.38, "text": "jetzt irgendwie checken na das ist natürlich blöd meinst du ich soll das gleich von links"}, {"id": 1008, "start": 10498.38, "end": 10504.06, "text": "einfliegen lassen das sieht blöd aus aber hier sieht würde das gut aussehen im moment"}, {"id": 1009, "start": 10504.06, "end": 10513.86, "text": "falsch minus 200 wahrscheinlich hier sieht das halt viel cooler aus und von in groß sieht"}, {"id": 1010, "start": 10513.86, "end": 10522.02, "text": "das von unten gibt es irgendwie die möglichkeit ins welt zu checken swelt media media break"}, {"id": 1011, "start": 10522.02, "end": 10539.38, "text": "points oder sowas media queries welt oh nee da muss ich selbst nachgucken das ist extra"}, {"id": 1012, "start": 10539.38, "end": 10542.82, "text": "klasse dafür nee das will ich nicht ich dachte die hat vielleicht was die haben vielleicht"}, {"id": 1013, "start": 10542.82, "end": 10566.14, "text": "was eingebaut nee das ist pains champ kann ich da nicht irgendwie eine tailwind transition"}, {"id": 1014, "start": 10566.14, "end": 10582.18, "text": "machen oder sowas wie war das nochmal tailwind transition nee die sind aber nicht so schön"}, {"id": 1015, "start": 10582.18, "end": 10589.78, "text": "von der animation her da kannst du ja dann bloß sagen hier is in is out da kannst du"}, {"id": 1016, "start": 10589.78, "end": 10598.98, "text": "glaube einfliegen kannst du kannst du da gar nicht machen da kannst du glaube ich nur"}, {"id": 1017, "start": 10598.98, "end": 10609.26, "text": "ein ein planten faden so wobei doch du kannst du kannst die du kannst eigentlich die position"}, {"id": 1018, "start": 10609.26, "end": 10622.14, "text": "animieren irgendwie naja ganz ehrlich ich glaube wir können auch so damit leben check"}, {"id": 1019, "start": 10622.14, "end": 10628.9, "text": "doch if window inner width größer ja aber ich hätte gerne etwas eingebautes dafür"}, {"id": 1020, "start": 10628.9, "end": 10657.26, "text": "ja das kann ich machen kann ich machen"}, {"id": 1021, "start": 10657.26, "end": 10672.26, "text": "wie würde ich denn das jetzt machen gescheit y 0 was ist eigentlich wenn ich beides minus"}, {"id": 1022, "start": 10672.26, "end": 10686.94, "text": "200 mache aber kommt von oben reingeflogen ok da kommt so schräg das ist doof ein giveaway"}, {"id": 1023, "start": 10686.94, "end": 10693.7, "text": "ok was soll ich ich give away ich give away subs die muss man aber selbst kaufen quasi"}, {"id": 1024, "start": 10693.7, "end": 10705.7, "text": "für 5 euro mache ich ein sub giveaway ich glaube ich glaube das ist top so und jetzt"}, {"id": 1025, "start": 10705.7, "end": 10717.98, "text": "jetzt müsste ich hier quasi irgendwie checken boah nee oder mir nicht keine ahnung fly x"}, {"id": 1026, "start": 10717.98, "end": 10726.34, "text": "wait a minute moment wie check ich denn jetzt ob ich überhaupt"}, {"id": 1027, "start": 10726.34, "end": 10735.58, "text": "resize muss ich muss ich dann sowas hier machen und resize hätte es da gut haben giveaway"}, {"id": 1028, "start": 10735.58, "end": 10749.62, "text": "würde ich würde ich machen aber da müsste ich erstmal mit hetzner wieder was wieder"}, {"id": 1029, "start": 10749.62, "end": 10757.58, "text": "was an start bringen so ne oder das ergibt keinen sinn was ich da was ich da gerade mache"}, {"id": 1030, "start": 10757.58, "end": 10777.78, "text": "nee ich hab mit hetzner nichts am start aktuell und jetzt window if window inner width größer"}, {"id": 1031, "start": 10777.78, "end": 10787.54, "text": "1000 200 oder größer 1000 irgendwie keine ahnung größer 1000 dann ist x gleich minus"}, {"id": 1032, "start": 10787.54, "end": 10796.3, "text": "200 und fly y gleich null und els boah das ist aber mega abartig das muss anders das"}, {"id": 1033, "start": 10796.3, "end": 10809.38, "text": "muss anders gehen und ansonsten umgedreht nee 200 so also nee ah moment ich machs ja"}, {"id": 1034, "start": 10809.38, "end": 10826.06, "text": "auch falsch ich hab ich hab das ja auch noch drin hier fly x fly y so es flyt von unten"}, {"id": 1035, "start": 10826.06, "end": 10835.14, "text": "und es flyt von links ok funktioniert aber schön ist ja schön ist das nicht programmiert"}, {"id": 1036, "start": 10835.14, "end": 10846.26, "text": "setz ist desktop ja das ist tatsächlich besser ja"}, {"id": 1037, "start": 10846.26, "end": 10852.42, "text": "müsste dann eh nicht von dem resize event sein ja aber ich glaube in dem event vom resize"}, {"id": 1038, "start": 10852.42, "end": 10858.5, "text": "steht nicht die neue größe drinne oder doch gucken wir mal das ist javascript worüber"}, {"id": 1039, "start": 10858.5, "end": 10870.38, "text": "wir reden da steht nicht die neue da steht nur das target vom window drinne da steht"}, {"id": 1040, "start": 10870.38, "end": 10874.7, "text": "nicht neue größe drinne das wäre ja auch zu einfach wenn da einfach alte und neue größe"}, {"id": 1041, "start": 10874.7, "end": 10879.78, "text": "in dem event drinne stehen würde da haben sie javascript designer so gedacht nee das"}, {"id": 1042, "start": 10879.78, "end": 10892.06, "text": "machen wir nicht overrated shebaited outdated das machen wir so nicht current target window"}, {"id": 1043, "start": 10892.06, "end": 10905.26, "text": "ja aber window hab ich doch auch so ein legacy feature was sind dann tailwind tailwind break"}, {"id": 1044, "start": 10905.26, "end": 10921.58, "text": "points standardmäßig für md 768 ok ist es größer 768 so das müssen wir jetzt mal ausprobieren"}, {"id": 1045, "start": 10921.58, "end": 10937.62, "text": "ja nice funktioniert genau ok wir können wirklich sowas machen ich keine ahnung ist"}, {"id": 1046, "start": 10937.62, "end": 10950.54, "text": "desktop falls oder was wobei dann ist es ja aber dann ist es ja beim resize check if"}, {"id": 1047, "start": 10950.54, "end": 10969.9, "text": "desktop ok kann ich nicht einfach sowas machen reicht das reicht das nicht ist da ist das"}, {"id": 1048, "start": 10969.9, "end": 10976.9, "text": "nicht im prinzip alles was ich brauche im endeffekt weil er das eh immer neu berechnet"}, {"id": 1049, "start": 10976.9, "end": 10989.1, "text": "bei dem click also einfach hier check if desktop wenn es wenn es desktop ist dann 200 wenn"}, {"id": 1050, "start": 10989.1, "end": 10997.3, "text": "es nicht desktop ist null und dann hier auch if check desktop wenn es wenn es desktop ist"}, {"id": 1051, "start": 10997.3, "end": 11003.24, "text": "nein das ist falsch wenn es desktop ist dann null ansonsten 200 und wenn es desktop ist"}, {"id": 1052, "start": 11003.24, "end": 11017.98, "text": "dann minus 200 und ansonsten null funktioniert das jetzt easy so und jetzt können wirs noch"}, {"id": 1053, "start": 11017.98, "end": 11026.06, "text": "besser machen jetzt können wir nämlich das machen was presery vorgeschlagen hat das wir"}, {"id": 1054, "start": 11026.06, "end": 11043.66, "text": "jetzt einfach gucken was was ich result x y und das wir hier jetzt einfach gucken ist"}, {"id": 1055, "start": 11043.66, "end": 11060.1, "text": "es größer ansonsten dann setzen wir result ah moment moment nee da muss ich ein if machen"}, {"id": 1056, "start": 11060.1, "end": 11070.22, "text": "da muss ich ein if machen das funktioniert glaube ich nicht anders aber jetzt nee result"}, {"id": 1057, "start": 11070.22, "end": 11081.42, "text": "so wenn es desktop ist wenn es desktop desktop kram ist dann will ich dass der das y muss"}, {"id": 1058, "start": 11081.42, "end": 11100.74, "text": "es groß oder klein sein y dass das nee wenn es desktop ist will ich das x minus 200 ist"}, {"id": 1059, "start": 11100.74, "end": 11122.06, "text": "so rum und ansonsten will ich dass es das y nee wartet mal leute ich bin verwirrt wenn"}, {"id": 1060, "start": 11122.06, "end": 11129.3, "text": "es kein desktop ist dann soll das 200 sein ne genau weil man das auch bestimmt deutlich"}, {"id": 1061, "start": 11129.3, "end": 11136.5, "text": "einfacher schreiben kann so und in duration 100 muss ich glaube ich auch noch zurückgeben"}, {"id": 1062, "start": 11136.5, "end": 11142.14, "text": "sonst wird das nix also und geht das jetzt kann ich jetzt einfach sagen check desktop"}, {"id": 1063, "start": 11142.14, "end": 11165.66, "text": "nee das muss weg nee ah ach so weil void moment return so java script stellt ok funst"}, {"id": 1064, "start": 11165.66, "end": 11172.94, "text": "aber das ist das ist kann man das nicht irgendwie einfacher machen ja doch mir könnte es direkt"}, {"id": 1065, "start": 11172.94, "end": 11184.14, "text": "hier reinschreiben größer 768 gibt es nicht die auswahl über den user agent user agent"}, {"id": 1066, "start": 11184.14, "end": 11189.78, "text": "wird auch soweit ich weiß mittlerweile gar nicht mehr großartig abhängig zur plattform"}, {"id": 1067, "start": 11189.78, "end": 11193.46, "text": "übertragen das ist ja auch so dass du firefox und chrome nicht mehr unterscheiden kannst"}, {"id": 1068, "start": 11193.46, "end": 11203.62, "text": "die senden alle das gleiche das welt breakpoints gibt es doch nicht irgendwelche helper für"}, {"id": 1069, "start": 11203.62, "end": 11228.98, "text": "oder so ah da kann man das selbst setzen ok ah nee das brauchen wir jetzt nicht also"}, {"id": 1070, "start": 11228.98, "end": 11240.74, "text": "wenn das wenn das größer ist dann wird das wird das 200 minus 200 ansonsten null und"}, {"id": 1071, "start": 11240.74, "end": 11246.34, "text": "dann machen wir das ganze einfach noch mal und sagen hier null oder 200 und dann kann"}, {"id": 1072, "start": 11246.34, "end": 11252.86, "text": "ich diesen ganzen shit löschen und sag einfach return fertig habe ich jetzt richtig gemacht"}, {"id": 1073, "start": 11252.86, "end": 11269.54, "text": "bam easy so bald werde ich hier richtig zum fulltime frontend full stack def bis sec ops"}, {"id": 1074, "start": 11269.54, "end": 11279.86, "text": "cloud native on prem serverless expert engineer dann kann ich alles zwar nix richtig aber"}, {"id": 1075, "start": 11279.86, "end": 11294.7, "text": "alles schon mal gesehen"}, {"id": 1076, "start": 11294.7, "end": 11302.02, "text": "man sollte es nicht nennen check if desktop oder wir sollten es eher eher nennen keine"}, {"id": 1077, "start": 11302.02, "end": 11316.06, "text": "ahnung transition params oder sowas ich ich nenne es jetzt check desktop ich mein was"}, {"id": 1078, "start": 11316.06, "end": 11329.02, "text": "natürlich richtig was natürlich richtig nice wäre ist wenn wir sowas hätten wie"}, {"id": 1079, "start": 11329.02, "end": 11332.86, "text": "macht man in zwende wo macht man denn ihr helper functions rein wahrscheinlich einfach"}, {"id": 1080, "start": 11332.86, "end": 11339.06, "text": "direkt in source wenn wir sowas hätten wie helper js und dann leute wir haben noch viertel"}, {"id": 1081, "start": 11339.06, "end": 11344.46, "text": "stunde zeit ich kann so ein bisschen dummes zeug machen und dann würden wir quasi sowas"}, {"id": 1082, "start": 11344.46, "end": 11355.78, "text": "wie check if desktop würde man da quasi rein packen und dann diesen part da irgendwie"}, {"id": 1083, "start": 11355.78, "end": 11379.7, "text": "rein rein hauen und dann würde ich sagen import helper oder so ne helper ach so moment"}, {"id": 1084, "start": 11379.7, "end": 11389.26, "text": "das muss ich erst exportieren dass es funktioniert oder ich bin da hört man java script zeug"}, {"id": 1085, "start": 11389.26, "end": 11404.5, "text": "auf wie funktioniert das richtig oder so dann könnten wir hier unser helper zeug"}, {"id": 1086, "start": 11404.5, "end": 11411.1, "text": "rein schreiben und hier würde ich dann echt nicht nennen check if desktop sondern get"}, {"id": 1087, "start": 11411.1, "end": 11429.82, "text": "transition params oder sowas und dann einfach nur noch get check if desktop naja so viel"}, {"id": 1088, "start": 11429.82, "end": 11437.74, "text": "haben wir dadurch jetzt nett gewonnen so viel haben wir dadurch nicht wirklich gekriegt"}, {"id": 1089, "start": 11437.74, "end": 11446.62, "text": "so viel haben wir da jetzt nicht wirklich durchgewonnen nicht das ne das hat es jetzt"}, {"id": 1090, "start": 11446.62, "end": 11459.14, "text": "ehrlich gesagt nicht wirklich gebracht na gut wie dem auch sei wir haben doch heute schon"}, {"id": 1091, "start": 11459.14, "end": 11464.66, "text": "einiges hinbekommen also was haben wir denn gemacht die suche geht jetzt endlich schnell"}, {"id": 1092, "start": 11464.66, "end": 11479.22, "text": "ohne gelege hat eine schöne schöne überplendung entfernen die klammer noch wo da ne das muss"}, {"id": 1093, "start": 11479.22, "end": 11493.14, "text": "doch da sein oder oder meinst du dahinter ne brauchen beides also wir haben das hier"}, {"id": 1094, "start": 11493.14, "end": 11504.58, "text": "schnell gemacht wir haben dafür gesorgt dass heck weh wir haben das sachen dass die bilder"}, {"id": 1095, "start": 11504.58, "end": 11513.34, "text": "die man copy pastet schwarz weiß copy pastet werden wir haben dafür gesorgt dass wir ein"}, {"id": 1096, "start": 11513.34, "end": 11519.26, "text": "mobile und desktop layout haben was so ein bisschen verbesserungswürdig ist aber eigentlich"}, {"id": 1097, "start": 11519.26, "end": 11527.3, "text": "schon ganz gut funktioniert ja wir haben das hier virtuell virtualisiert vom scrolling"}, {"id": 1098, "start": 11527.3, "end": 11537.1, "text": "her dass es nicht leckt wir haben text insert ein bisschen gebaut wobei man das noch verbessern"}, {"id": 1099, "start": 11537.1, "end": 11552.5, "text": "kann also meine selektor warum ist mein selektor immer hinter hinter dem dem krempel selection"}, {"id": 1100, "start": 11552.5, "end": 11560.02, "text": "gibt es sowas konvert set index gibt es sowas how to set correct order of notes using set"}, {"id": 1101, "start": 11560.02, "end": 11574.58, "text": "index ok selection wo sind wir hier selection selection set index 99999999 das die soll immer"}, {"id": 1102, "start": 11574.58, "end": 11585.5, "text": "oben sein die selection qr code inserten und gucken ob es funktioniert nicht warum mein"}, {"id": 1103, "start": 11585.5, "end": 11602.06, "text": "set index ist ganz oben das sollte immer oben drüber sein das ist ein back vielleicht muss"}, {"id": 1104, "start": 11602.06, "end": 11621.14, "text": "er niedriger sein ja man weiß ja nie minus 9000 selection index was macht das string"}, {"id": 1105, "start": 11621.14, "end": 11650.34, "text": "ne das was anderes chat set set index so vielleicht das besser reinfolge von den ads ja aber wofür"}, {"id": 1106, "start": 11650.34, "end": 11658.22, "text": "gibt es denn dann set index set index ist just index of a note in its parent child array"}, {"id": 1107, "start": 11658.22, "end": 11666.14, "text": "ja gut das ist nicht absolut aber ich habe ja nur ein ich habe ja nur einen layer ich"}, {"id": 1108, "start": 11666.14, "end": 11672.5, "text": "habe ja nur einen layer das müsste also doch eigentlich funktionieren gibt es auch die"}, {"id": 1109, "start": 11672.5, "end": 11682.22, "text": "top ist das move to top oh nee das muss ich jetzt immer ausführen oder was leute pass"}, {"id": 1110, "start": 11682.22, "end": 11688.06, "text": "mal auf beste beste idee ihr wollt mich ich wollt ihr wollt mich deabonen wenn ihr das"}, {"id": 1111, "start": 11688.06, "end": 11716.5, "text": "jetzt gleich seht funktioniert easy funst das kann aber nicht dabei sein das kann das"}, {"id": 1112, "start": 11716.5, "end": 11728.9, "text": "kann es eigentlich nett sein das ganz eigentlich also das das wieder strebt mir jetzt schon"}, {"id": 1113, "start": 11728.9, "end": 11740.18, "text": "ja jemand irgendeine andere glorreiche idee gibt es ok es gibt doch bestimmt ein ad event"}, {"id": 1114, "start": 11740.18, "end": 11759.06, "text": "oder sowas von der stage stage edit oder so on stage converse stage events so edit oder"}, {"id": 1115, "start": 11759.06, "end": 11780.1, "text": "sowas muss es doch muss es doch bestimmt geben keyboard event desktop mobile oh ich höre"}, {"id": 1116, "start": 11780.1, "end": 11794.86, "text": "es vor meiner tür alle leute macht vor der tür hört das nicht da will einer rein ja"}, {"id": 1117, "start": 11794.86, "end": 11810.46, "text": "schicko mann gleich springt gleich fertig schicko ist hartnäckig gibt es kein event für on insert"}, {"id": 1118, "start": 11810.46, "end": 11827.82, "text": "oder sowas nein nein nein schicko schicko schicko ist ne katze konver event insert ich"}, {"id": 1119, "start": 11827.82, "end": 11837.02, "text": "hab keine ahnung kannst du die auf einen zweiten layer legen five hat time so machen wir das"}, {"id": 1120, "start": 11837.02, "end": 11848.94, "text": "layer das war mir jetzt sehr gute idee sehr exquisite exzellente idee keine ahnung temp"}, {"id": 1121, "start": 11848.94, "end": 11870.78, "text": "konver layer new stage add temp gleich soll ich den kram ordentlich nennen temp add selection"}, {"id": 1122, "start": 11870.78, "end": 11888.5, "text": "muss man jetzt das oder das zuerst adden das funktioniert nicht umgedreht temp zuerst zeig"}, {"id": 1123, "start": 11888.5, "end": 11909.42, "text": "mal habt ihr meine habt ihr habt ihr meine kratzen geräusche aufgenommen naja ich hab"}, {"id": 1124, "start": 11909.42, "end": 11915.06, "text": "das doch im zweiten anlauf relativ gut getroffen oder schicko mann gleich springt gleich fertig"}, {"id": 1125, "start": 11915.06, "end": 11934.78, "text": "schicko ist hartnäckig doch funktioniert das jetzt hey chat fife header der fife hätte"}, {"id": 1126, "start": 11934.78, "end": 11945.26, "text": "wieder einfach zweiten layer adden den mann als letztes edit massive selection layer ich"}, {"id": 1127, "start": 11945.26, "end": 11956.22, "text": "muss das zeug mal irgendwie sinnvoll benennen ja ne wir nennen es nicht always on top layer"}, {"id": 1128, "start": 11956.22, "end": 11965.7, "text": "wie ist eigentlich die richtige javascript schreibweise ist es ist es always on top layer"}, {"id": 1129, "start": 11965.7, "end": 11974.42, "text": "oder ist es always on top layer was ist der java der beste javascript best practice leute"}, {"id": 1130, "start": 11974.42, "end": 11983.06, "text": "ich komm ja aus der c style programmiersprachen welt da ist es sowas hier vielleicht ist es"}, {"id": 1131, "start": 11983.06, "end": 11987.1, "text": "auch javascript moment moment vielleicht ist es auch mit minus vielleicht ist auch mit"}, {"id": 1132, "start": 11987.1, "end": 11993.5, "text": "minus kebab case ist es kebab ist vielleicht auch kebab keine kebab case geht nicht in"}, {"id": 1133, "start": 11993.5, "end": 12001.14, "text": "dem fall get element by id ja das heißt ja nichts nur weil framework interne sachen so"}, {"id": 1134, "start": 12001.14, "end": 12005.66, "text": "benannt werden bedeutet es ja noch lange nicht dass das empfehlung für alle ist wir sind"}, {"id": 1135, "start": 12005.66, "end": 12020.3, "text": "in der javascript welt das heißt kebab case ja kebab case kebab wie das gibt steht da"}, {"id": 1136, "start": 12020.3, "end": 12040.26, "text": "nicht drin da wäre ein beispiel gut für mit einem minus genau das nennt sich kebab case"}, {"id": 1137, "start": 12040.26, "end": 12050.06, "text": "aber das funktioniert hier anscheinend gar nicht ok js camel case versus snake case was"}, {"id": 1138, "start": 12050.06, "end": 12058.98, "text": "zum teufel ist snake case ist das da unten ok was was sagt was sagt ist der gover flow"}, {"id": 1139, "start": 12058.98, "end": 12082.34, "text": "weiß man nicht ok aber chat richtig richtig clevere idee hier mit dem extra layer da braucht"}, {"id": 1140, "start": 12082.34, "end": 12092.26, "text": "man hier keine extra wurscht mit always on top und so nice finde ich richtig gut gefällt"}, {"id": 1141, "start": 12092.26, "end": 12100.58, "text": "mir und was mir auch gefällt ist dass wir text adden können das finde ich richtig high"}, {"id": 1142, "start": 12100.58, "end": 12112.34, "text": "iq funktionen was übrigens noch nicht funktioniert ist bold und so wie willst du eigentlich am"}, {"id": 1143, "start": 12112.34, "end": 12120.34, "text": "ende deinen canvas zum drucker schicken ich exportiere das canvas als bild und machs in"}, {"id": 1144, "start": 12120.34, "end": 12134.74, "text": "pdf oder als png png oder pdf muss ich mal gucken ich exportiere das und dann schicke"}, {"id": 1145, "start": 12134.74, "end": 12143.74, "text": "ich zum drucker cool wäre auch so ein vorgefertiges layout zu haben ne templates können wir nicht"}, {"id": 1146, "start": 12143.74, "end": 12148.54, "text": "rein machen das ist viel zu viel zu aufwendig ich meine mal seriously was macht man ganz"}, {"id": 1147, "start": 12148.54, "end": 12155.7, "text": "ehrlich der label design prozess wird realistisch betrachtet so aussehen keine ahnung das ist"}, {"id": 1148, "start": 12155.7, "end": 12170.82, "text": "ein geiles label keine ahnung dunkler farbe zack qr code so irgendwie so und vielleicht"}, {"id": 1149, "start": 12170.82, "end": 12181.66, "text": "noch smile oder happy oder so irgendwie so fertig also viel mehr werden die meisten"}, {"id": 1150, "start": 12181.66, "end": 12187.32, "text": "leute wahrscheinlich nicht machen was ich in zukunft viel eher mal einbauen könnte"}, {"id": 1151, "start": 12187.32, "end": 12191.18, "text": "noch ist dass man sowas also was ich auf jeden fall einbauen werde ist dass man es speichern"}, {"id": 1152, "start": 12191.18, "end": 12201.66, "text": "kann speichern und restoren von dem label das auf jeden fall und wisst ihr was man relativ"}, {"id": 1153, "start": 12201.66, "end": 12209.8, "text": "einfach machen könnte ist das template bar machen also dass ich zum beispiel das hier"}, {"id": 1154, "start": 12209.8, "end": 12214.9, "text": "und und den text als template markiere dass man das über einen curl aufruf ändern kann"}, {"id": 1155, "start": 12214.9, "end": 12221.62, "text": "und zum drucker schicken wisst ihr wie ich mein also das dürfte relativ einfach sein"}, {"id": 1156, "start": 12221.62, "end": 12226.58, "text": "dann bräuchte ich auf dem solver nur noch ein node.js wo ich das im hintergrund austausche"}, {"id": 1157, "start": 12226.58, "end": 12233.58, "text": "und dann zum drucker.js dass man das hier die zwei sachen quasi als template markiert"}, {"id": 1158, "start": 12233.58, "end": 12239.36, "text": "dass man dann auch über irgendeinen curl aufruf quasi den text und den qr code switchen"}, {"id": 1159, "start": 12239.36, "end": 12245.58, "text": "kann das dürfte relativ einfach sein farbauswahl bringt nichts die label drucker sind schwarz"}, {"id": 1160, "start": 12245.58, "end": 12252.66, "text": "weiß deswegen kannst du beim text deswegen kannst du hier beim text auch nur zwischen"}, {"id": 1161, "start": 12252.66, "end": 12266.54, "text": "ein paar wenigen farben auswählen achso ja das ist eigentlich eine ganz gute idee was"}, {"id": 1162, "start": 12266.54, "end": 12272.94, "text": "haltet ihr farbauswahl farbauswahl für das emote eventuell chat ich glaube eventuell"}, {"id": 1163, "start": 12272.94, "end": 12277.62, "text": "müssen wir doch noch eine toolbar hier oben machen mit farben und sowas und das nicht"}, {"id": 1164, "start": 12277.62, "end": 12280.18, "text": "und das nicht da drinnen und das nicht hier drinnen machen"}, {"id": 1165, "start": 12280.18, "end": 12287.18, "text": "na schauen wir mal"}, {"id": 1166, "start": 12287.18, "end": 12299.54, "text": "ja ja das kommt auf jeden fall noch hin ich mache dann hier so einen rahmen ich mache"}, {"id": 1167, "start": 12299.54, "end": 12303.06, "text": "einen rahmen mit ein bisschen platz drum herum dass man auch sachen jetzt stellt euch mal"}, {"id": 1168, "start": 12303.06, "end": 12308.06, "text": "vor dass hier stellt euch mal vor dass hier wäre das etikett ja stellt euch mal vor das"}, {"id": 1169, "start": 12308.06, "end": 12312.62, "text": "hier wäre das dass das hier wäre das etikett so ich werde es dann so machen dass ich ein"}, {"id": 1170, "start": 12312.62, "end": 12315.98, "text": "bisschen über den rahmen rausschieben kann weil vielleicht möchte man manchmal sachen"}, {"id": 1171, "start": 12315.98, "end": 12322.1, "text": "abgeschnitten haben oder so aber sowas werde ich sowas werde ich da noch hin malen ich"}, {"id": 1172, "start": 12322.1, "end": 12329.1, "text": "mache hier mit gestrichelt rot gestrichelt oder so rot gestrichelt die wirkliche größe"}, {"id": 1173, "start": 12329.1, "end": 12336.62, "text": "des labels wobei es nicht die wirkliche größe des labels ist sondern so aspect ratio entsprechend"}, {"id": 1174, "start": 12336.62, "end": 12343.74, "text": "zum zur canvas größe also dass es dann irgendwie so hier ist einfach dass du von der weil beim"}, {"id": 1175, "start": 12343.74, "end": 12351.78, "text": "drücken wird eh vorher runter skaliert auf 36 mal 89 mm aber ich mir gefällt das auch"}, {"id": 1176, "start": 12351.78, "end": 12360.26, "text": "das ein und aus fänen finde ich sehr nice ja siehst du leute beim qr code aktuell rückte"}, {"id": 1177, "start": 12360.26, "end": 12365.82, "text": "einfach in qr code ein der muss ja beim qr code braucht ja noch text also wir brauchen"}, {"id": 1178, "start": 12365.82, "end": 12377.62, "text": "für ein qr code auch sowas hier man kann mal aufschreiben ja und da könnte man auch"}, {"id": 1179, "start": 12377.62, "end": 12384.02, "text": "sagen wir können zwischen bar code und qr code auswählen oder sowas also wir könnten"}, {"id": 1180, "start": 12384.02, "end": 12394.26, "text": "beispielsweise genauso wie hier beim text oder wie hier bei den emotes der demo kann"}, {"id": 1181, "start": 12394.26, "end": 12400.78, "text": "auch graustufen aber halt gefaked gefakte graustufen der der lässt einfach den hintergrund"}, {"id": 1182, "start": 12400.78, "end": 12408.42, "text": "weiß und und und drückt daneben schwarz und ja der kann graustufen ja also das wenn man"}, {"id": 1183, "start": 12408.42, "end": 12412.54, "text": "jetzt hier beispielsweise auf qr code klickt dass dann auch sowas hier aufgeht wo man dann"}, {"id": 1184, "start": 12412.54, "end": 12417.74, "text": "auswählen kann will ich in qr code will ich in will ich in barcode haben was gibt es"}, {"id": 1185, "start": 12417.74, "end": 12425.14, "text": "da sonst noch barcode qr code was auch immer alles und dann muss man ja noch den text eingeben"}, {"id": 1186, "start": 12425.14, "end": 12430.82, "text": "der auf den der auf den barcode drauf sollen welch ein label printer 450 das ist noch"}, {"id": 1187, "start": 12430.82, "end": 12457.38, "text": "einer ohne dm dot code was ist dot code so was benutzen leute das kenne ich das ist"}, {"id": 1188, "start": 12457.38, "end": 12464.46, "text": "blindenschrift auf der auf medikamenten packung und sowas das habe ich auch schon gesehen"}, {"id": 1189, "start": 12464.46, "end": 12477.26, "text": "ja ach nee das ist nicht blindenschrift was anderes das benutzt jemand hier dot dot code"}, {"id": 1190, "start": 12477.26, "end": 12487.22, "text": "kann man auch alles einbauen wichtig ist erstmal dass wir so die grundlagen haben dass wir"}, {"id": 1191, "start": 12487.22, "end": 12491.02, "text": "die richtigen edit elemente haben und sowas dann kann man auch ein paar sachen einbauen"}, {"id": 1192, "start": 12491.02, "end": 12494.42, "text": "wenn es ja muss ja nicht total übertreiben dass es noch nicht auf github aber das kommt"}, {"id": 1193, "start": 12494.42, "end": 12500.5, "text": "dann auf github wenn es fertig ist oder wenn es wenn es irgendwie halbwegs funktioniert"}, {"id": 1194, "start": 12500.5, "end": 12506.98, "text": "so wie ich mich kenne wahrscheinlich nie kein quake alles klar leute wir sehen uns im nächsten"}, {"id": 1195, "start": 12506.98, "end": 12515.02, "text": "stream ich gehe jetzt auf badgit time was läuft eigentlich auf deinem normalen computer"}, {"id": 1196, "start": 12515.02, "end": 12526.34, "text": "distro windows in der vm in der vm ist manjaro linux mach mal ausrufezeichen linux oder ausrufezeichen"}, {"id": 1197, "start": 12526.34, "end": 12529.98, "text": "manjaro im chat ist es glaube ich irgendwo habe ich da mal ein bisschen länger was drüber"}, {"id": 1198, "start": 12529.98, "end": 12534.62, "text": "erzählt wir haben auch einen ganzen stream gemacht wo wir das zusammen eingerichtet haben"}, {"id": 1199, "start": 12534.62, "end": 12543.46, "text": "muss beim archiv gucken ok leute wir sehen uns bis denn machts gut cu"}]}