{"text": "Wovon problem es dir insulinieren buying and using an Blizzard? Ich merke zwar keinen Lüfter, aber ich glaube, die ist auch an. Ich zeige euch mal, was wir heute machen. Ich hatte heute nämlich eine absolut exquisite, 5-Hat-Way-Too-Smart-Idee. Da platzt der Kopf. Clocks HD, ah ja, danke schön. Und zwar, ich zeige euch mal, was ich für eine Idee hatte. Richtig Big Brain. Oh na gut, wie Big Brain das ist, muss ich noch rausstellen, weil ich weiß nicht, ob es funktioniert. Vielleicht ist es auch Massive-Oi. Low Brain kann auch sein. Kann auch sein, dass es nicht funktioniert, aber ich habe die Vermutung, es ist Big Brain. Und zwar, was wir machen, ist folgendes. Also, ich kann euch sagen, wenn es funktioniert, dauert es wahrscheinlich gar nicht so lang. Wir bauen jetzt ja keine komplette Steuerung mit allem möglichen Zeug, sondern nur mal gucken, erstmal, ob es funktioniert. Hacker Man angesagt. Und zwar, also, ich habe, ihr wisst ja, dass ich eine Klimalage habe. Und zwar, ich habe die hier. Moment, ich habe eine Mitsubishi Heavy, ach du Scheiße. ZSS, irgendwas. Ich glaube, die hier, ich bin mir da jetzt aus dem Kopf nicht ganz sicher. Ich glaube, die hier habe ich. Zumindest, nicht ZSS, fast ZSS. Vielleicht muss ich die Musik mal ein bisschen leiser machen. Die Musik ist so cool, so abkühlungsmäßig. Das ist, by the way, richtig Low Brain Musik. Das ist eine Stunde Song of Storms. Wieder gesund. Ja, es geht wieder. Es geht wieder. Ich lasse das aber trotzdem mal doodeln. Ich finde, das strahlt irgendwie was Kühles aus. So, also, ich glaube, das Ding hier habe ich. Und ich habe ja schon mehrere Anläufe gemacht, das Ding irgendwie in meine Heimautomatisierung einzubinden. Einfach so wirklich gut hat nichts funktioniert. Und zwar, es hat mir immer irgendwas gefehlt. Das erste, was ich mir gekauft habe. Moment, mal kurz was aufschreiben. So, genau. Also, das erste, was ich mir gekauft habe, war damals ein Z-Wave. Boah. Moment, ich muss nachgucken. Irgend so ein Z-Wave Steuerding für, das war aber noch zu Zeiten, wo ich keinen Plastenschimmer hatte, wie man sowas am besten macht. Hier, genau. Sowas hatte ich mir mal gekauft. Genau, das ist so ein, das ist ein Z-Wave Gerät, was angeblich alle möglichen Sorten von Klimaanlagen steuern kann. Aber ich habe es nicht hingekriegt damit. Also, an- und ausschalten geht. Rest funktioniert nicht. Also, für das, was der Kram gekostet hat, war das viel zu teuer und ziemlicher Crap. Das hat, glaube ich, 60 Euro oder irgendwie sowas gekostet. Also, viel zu, viel zu teuer eigentlich, der ganze Müll. Irgendwie sowas hier. Ja, zumindest von der Idee her war das ein ganz gutes Gerät, weil das geht über Z-Wave. Ich habe eh viel Z-Wave Geräte, aber die Features waren kacke. So, das nächste, was ich ausprobiert habe zum Klimaanlagensteuern, war ein ProdLink RM Pro oder so in der Richtung hieß das Teil. So eine, nee, RM Mini. So eine Dose. So, das war von der Theorie hier auch ganz gut. Das ist eine Kiste, die schließt an über das WLAN und dann kannst du Infrarot, da ist ein Infrarot-LED drin und du kannst Infrarotsachen schicken. Problem war nur, dass die Steuerungssoftware dafür zum größten Teil kacke war und das Gerät irgendwie teilweise nach einer Woche nicht mehr übers WLAN erreichbar war. Also auch Müll, auch totaler Müll. So, und heute habe ich zufälligerweise was gefunden, nee, stimmt nicht, das habe ich nicht heute gefunden, das habe ich gestern gefunden. Heute kam Amazon an und ich muss mal kurz noch andere Musik machen. Was machen wir hier an? Epic. Was haben wir hier? Legend of Zelda Morning Music. Ah, yes. Ja, das ist schön. Das lasen wir jetzt. So, und gestern habe ich folgendes gefunden, nämlich das Projekt hier auf GitHub. Und dann habe ich mir so durchgelesen, was die alles für Klimaanlagen unterstützen und dann habe ich festgestellt, das müsste eigentlich ziemlich gut, das müsste eigentlich ziemlich gut in einer Klimaanlage funktionieren. Das ist eine Arduino Library, die allerdings auch von ESP32 geht. Die unterstützen allerdings offiziell meine Klimaanlage nicht. Die unterstützen ZJS, ZMS und ZMPS, allerdings nicht ZSS. Das ist absolut Big Brain Benamung von Mitsubishi wieder. Aber ich bin da mal hergegangen und habe mal gesucht bei dem Projekt auf GitHub und da ist mir aufgefallen, dass irgendeiner vor drei Jahren oder so hat einen Merchrequest aufgemacht, um meine Klimaanlage zu supporten. Und der Typ hat es gemercht, allerdings ist es nie im Master angekommen, sondern gammelt in seinem Dev Branch rum, was nicht so das Problem ist. Also das heißt, was wir jetzt heute machen ist folgendes, ich habe hier ein ESP32 liegen und ich habe die billigste Schaltung ever zusammengebaut, nämlich ein ESP32 und mit einer Infrarot-LED dran. Das Ganze sieht folgendermaßen aus, ich zeige euch das mal kurz. Wo habe ich mein Handy? Ach da, ich zeige euch mal kurz, wie das aussieht, das ist absolut Low Brain, das kann jeder selber machen. Ich zeige euch mal kurz die Bilder zu. Wie sieht die Klimaanlage aus? Also ich habe im Schlafzimmer, im Schlafzimmer so ein Ding, im Arbeitszimmer so ein Ding, außen an der Wand vom Haus hängt so ein Ding und halt für jede Sache eine Fernbedienung. Und das kommt uns gleich noch zugute mit der Fernbedienung, weil ich weiß, dass das Infrarot-Fernbedienungen sind, das heißt, das sollte prinzipiell auf jeden Fall funktionieren, die Frage ist, ob diese Library das Ganze steuern kann. So, also hier, Album. Also ich habe das billigste zusammengebaut, was irgendwie ging. Ich habe mir bei Amazon einen 50er-Pack Infrarot-LEDs gekauft, irgendwelche, ich habe keine Ahnung, ob die funktionieren. Das einzige, was ich geguckt habe, dass die nicht instant verrecken, das heißt, die haben, ne hier, die haben Betriebsspannung 2,7 bis 5,5 Volt. So, das sollte also in so einem ESP32 ohne Probleme funktionieren. Und ich habe jetzt nichts anderes gemacht, außer, also das ist wirklich, das ist in dem Fall alles. Ich habe einfach so einen Infrarot-LED genommen. Wie gesagt, kein Schwimmer, ob das klappt, ja. Also es kann durchaus sein, dass es gleich Monka smogt und das Ding durchbrennt. Also ich habe da auch keinen Widerstand oder irgendwas dran gemacht. Ich habe die Infrarot-LED genommen, auf einen GPIO-Pin gepackt, ich glaube, sieht man hier besser, auf einen GPIO-Pin gepackt und hier auf Ground gepackt. Fertig. Kaselin fragt, Gäste WLAN mit WLAN ist da ein bisschen wenig für Projektarbeit. Kommt drauf an, was für ein Projekt. Wenn du Abschlussprojekt meinst, dann kommt es beim Abschlussprojekt weniger darauf an, dass du technisch nicht viel machst, sondern wie du das verkaufst. Ja, Flow 690, da habe ich auch schon dran gehabt. Das iPhone filtert aber das Tablet, das Tablet kann es. Das Tablet kann es. Ich glaube, das iPhone kann es nicht. Also das ist die billigste Schaltung ever, die irgendjemand weltweit zusammengesteckt hat. Das kann man auch nicht mal Schaltung nennen. Wie gesagt, Ground, GPIO, ich glaube, 17 ist das und dann Infrarot-LED vorne dran. Also die Infrarot-LED ist hier, man sieht es nicht so richtig, aber da, guck da. Da ist die Infrarot-LED. Was natürlich sein kann ist, dass, wie gesagt, ich habe da keinen Widerstand und nichts dazwischen. Also was sein kann, dass das Ding durchbrennt. Ihr wisst ja, ich bin nicht der allergrößte Elektronik-Pro. Das heißt auch, ich habe keinen Plastenschimmer, was ich ja überhaupt für einen Widerstand dazwischen machen müsste oder nicht. Also entweder geht es oder es brennt durch. Müssen wir mal scheinen. Müssen wir mal schauen, ja. Quatsch, Widerstand. Wo kommt man da hin? Also mit sowas fangen wir es gar nicht an. Was sind das für LEDs? Ah ja, wenn du das kannst, hier die da. Was für technische Daten, weiß ich nicht. Müssen wir mal hier gucken. Also der Pack ist das hier von Amazon. Sind 50 Stück, also ich glaube, 25 Empfänger und 25 Sender. Ich brauche nur Sender. Als Abschlussprojekt, du kannst das als Abschlussprojekt machen, Gäste WLAN, das ist kein Problem. Du musst halt nur gucken, wie du das Ganze verkaufst. Also wenn du einfach nur in dein Abschlussprojekt schreibst, ich richte ein Gäste WLAN, eine mit WLAN ist das nicht das Problem. Wenn du sowas schreibst wie Estellen Security Concept Gäste Zugang, kannst du dich total darüber auslassen und am Ende sagst du halt, ok, du machst ein abgeschottetes Gäste WLAN mit eigenem WLAN drunter und konfigurierst das richtig. Kannst du machen. Das ist alles nur eine Frage, wie man das der IHK verkauft. Ja, wenn du das als Estellen Security Concept Gäste WLAN verkaufst, kein Problem, funktioniert. Du kannst auch irgendwas sagen wie Anbindung, keine Ahnung von Schulungsraum, Außendien, irgendwas. Du musst halt ein bisschen was aus den Fingern saugen. Also du darfst der IHK nicht sagen, ich installiere einen WLAN mit ein bisschen WLAN unten drunter, sondern du musst der IHK irgendwas sagen, wo du halt als Ergebnis bekommst, dafür brauchen wir ein Gäste WLAN im Endeffekt. Und wenn du das hinkriegst, ist kein Problem. Wie gesagt, ich habe im Endeffekt als Abschlussprojekt auch nur einen OpenVPN eingerichtet. Das war's. Ja, was ich halt im Abschlussprojekt noch gemacht habe ist, ich habe ausgewählt zwischen IPSEC, OpenVPN und, ich weiß es schon gar nicht mehr, L2PT oder irgend so ein Crap. Zumindest, mir war von Anfang an klar, ich möchte OpenVPN machen und dann habe ich halt so eine Entscheidungsmatrix zusammen gefaked, dass halt OpenVPN gewinnt und dann habe ich OpenVPN. Was hast du bekommen? 95%? Achtung, pass auf, meine mündliche. Ja, 95%. Aber ich hatte auch Bonus, weil die haben mir, wie gesagt, die haben meine Abschlussprüfung verloren. Ich glaube, die haben mir Bonuspunkte gegeben dafür, dass die mich morgens so geschockt haben. Na, ich habe es ja schon ein paar Mal erzählt, morgens an dem Tag, wo ich Prüfung hatte, hat mich die Frau von der IRK angerufen, hat gemeint, ich wäre durchgefallen. Da habe ich gemeint, das kann doch nicht sein, ich hatte doch überhaupt keine Prüfung. Und dann kam halt raus, sie haben meine Prüfung verloren. Aber die Story habe ich ja schon ein paar Mal erzählt jetzt. Mega cheap bait, Alter. Ich sage euch Leute, da hättet ihr auch doof geguckt, wenn am Tag der Prüfung euch die IRK anruft und sagt, ihr seid durchgefallen, obwohl ihr noch gar nicht bei der Prüfung war, da hättet ihr auch blöd geguckt. Also wie gesagt, Abschlussprojekt ist immer die Frage, wie du das Ganze verkaufst und dann funktioniert das auch. Glocks hat ihr an 11 Monate abonniert, ich weiß nicht, ob ihr das schon gesehen habt, aber Dankeschön für den Sub. So, Face Gesicht, 5 Monate, huge. Subscription. Widerstand ist zwecklos, exakt. Äh ja, Chuspanelm. Chuspanelm sagt, will uns der Max gerade so BWL-mäßig erklären, dass man die Sachen nur gut verkaufen muss. Ja, wenn du die IRK fragst, wird die IRK nämlich sagen, dass Fachinformatiker kein technischer, sondern ein kaufmännischer Beruf ist. Das ist kein Witz, das sagt die IRK wirklich. Kein Fachinformatiker fühlt sich als Kaufmann, außer Low Brains. Aber die IRK meint, das ist so. Wie verliert man sowas, wenn man die Abschlussprüfung hoch lädt und der Server crasht? Der Server von der IRK ist an 5 Minuten gecrashed, nachdem ich meine Abschlussprüfung hochgeladen hab und ja, meine Abschlussprüfung verloren. Das ganze BWL geschwobbelt immer, ja. Ich bin letztes Jahr, ich bin auf der Arbeit eingeladen zu einem Moment, das muss ich euch vorlesen, ich kann mir so BWL-Kram nicht merken. Ich muss mal gucken, ob ich das anonymisieren muss irgendwie. Ich wurde eingeladen zu öffentliches Review-Ergebnisse vor Projekt, jetzt muss ich mir den Projektnamen ausdenken. Zeuss, keine Ahnung, ich hab mir den Projektnamen ausgedacht. So und das ist, jetzt pass mal auf Invitees, also Leute, die invited sind, 104 Leute sind dazu eingeladen. 104 Leute hören sich irgendein BWL geschwobbelt an. So und zur Vorbereitung zu dieser Präsentation hängt daran ein PDF mit 120 Seiten Projektbeschreibung. Meint ihr wirklich, das liest irgendjemand? Hallo an die Runde, Sie alle haben als Stakeholder, Teammitglied oder Experte Anteil an unserem Vorprojekt genommen. Ich möchte Sie daher ganz herzlich zu diesem öffentlichen Review einladen. Aha, da freu ich mich ja schon wahnsinnig drauf. Da bin ich ja ganz scharf drauf. Ich glaub, da geh ich nicht hin. Das ist mal richtiges BWL-Geschwobbel dann. Also wenn ich noch nicht genug BWL-Geschwobbel habe, dann geb ich mir das mal ne Stunde, oder ich glaub ich sogar 3 Stunden oder irgendwie sowas, dann ist es vorbei. So, ähm, kommen wir mal. Das klingt nach einem exquisiten Event. Leute, habt ihr eigentlich gesehen, wir haben ein neues Emote über BetterTwitchTV. Way too smart. Das ist, wenn man im 5-Hat ist und es nach hinten losgeht. So, ähm, sobald ich im Chat nichts gesehen hab. Ja, also, auf geht's. Wie gesagt, das ist meine Klimaanlage und ich hab dieses Projekt hier gefunden auf GitHub. Das ist ne Arduino-Library, die allerdings auch für den ESP32 funktioniert und die unterstützen meine Klimaanlage nicht direkt, aber es gibt ne Merchrequest, wo das ganze drin ist. Das heißt, wir müssen vorher noch ein bisschen gucken, dass wir Git-mäßig das irgendwie gemercht kriegen. Müssen wir gleich mal schauen. Was viel interessanter ist, wie das ganze hier funktioniert. Ich hab's noch nicht ausprobiert, aber ich könnte mir vorstellen, dass es relativ simpel ist. Das Ding hat direkt ESP32-Support. Das heißt, wir müssen hier einfach nur den Pin angehen, in dem Fall GPIO17, wo das hier dran ist. Äh, was wird gebastelt? Äh, erklär ich gerade. Und zwar, ich hab ne Library gefunden, mit der man Mitsubishi-Klimaanlagen steuern kann. Ich hab ja die Klimaanlage hier und ich hab schon ein paar Anläufe unternommen, die Klimaanlage zu steuern, mit unterschiedlichen Sachen. Es hat nie richtig funktioniert und ich hoffe, mit dieser Library, bzw. mit was selbst gebasteltem funktioniert es jetzt richtig gut. Äh, hoff ich. Hoff ich mal. Äh, Infrarot. Ja, ja. Infrarot. So, und deswegen hab ich das billigste aller Zeiten zusammengebaut. Ich hab ne ESP32 genommen, ne Infrarot-LED. Ähm, GPIO17-Ground. Fertig. Ohne Widerstand, ohne sonst was dazwischen. Das heißt, wahrscheinlich Monka smokes gleich. Müssen wir mal schauen. Aber ich glaube, ich glaube, dass die, dass der ESP32, die NodeMCU, dass das ein Widerstand auf den GPIO-Pins schon standardmäßig drauf hat, dass man sowas hier machen kann. Oder Flo96 hat ausgerechnet, mach mal den Chat auf, dass ich gleich gucken kann. Äh, by the way, ich muss mal hier mein Chat-Log starten. Übersehe ich hier die Hälfte. Also Flo96 hat ausgerechnet. Durchlassspannung 1,5. Äh, durch 1,5 Volt Strom 100 mA. ESP hat 3,3 Volt, also Differenz 3,3 minus 1,5 Volt gleich 1,8 Volt. 18, 18. Was zum Teufel? Ich hab kein 18 Ohm-Widerstand, wo soll ich den hernehmen? Ach komm, das Kabel hat bestimmt schon 18 Ohm, oder? So ein 2 cm Kabel. So, erstmal die ganzen Sachen wieder löschen. Flup. Dass ich meinen Chat mitgeloggt kriege. Äh, der Desktop, der Desktop ist der beste. Also wenn so besser ist, kann ich auch so lassen. Ey, ich frage mich, so was auch mit dem Raspberry Pi geht. Bestimmt, bestimmt. Du musst halt irgendeine fertige Library finden, die auf Raspberry Pi lauffähig ist. Die hier sieht mir nach Arduino beziehungsweise irgendwie Arduino-kompatibel-only aus. Also, Flo96, was muss ich denn für einen Widerstand davor machen? Ich soll den Widerstand weglassen? Exzellent. So, machen wir das. Ich lass den Widerstand weg. Das war eh so geplant, ich seh keinen Widerstand mehr dazwischen gestöpselt. So, äh, machen wir mal die VM an. Flasht du mal deine PS Vita? Ja, hab ich vor. Hab ich doch letztens erst im Stream erzählt. Wollte ich schon lange mal machen. So, als erstes müssen wir uns mal dieses Repo hier klonen von dem Typ. Gut, äh, nochmal eine Frage an den Chat. Hat man verstanden, was ich vor hab? Also, nur mal ganz kurz gesagt. Ich hab einen ESP32 als Controller. Hier, das Teil. ESP32 NodeMCU, GPIO17, ist eine Infrarot-LED dran. Hier ist Ground, hier ist GPIO17. Und das war's. Mehr gibt's nicht. Infrarot-LED und sonst nix. Also, das ist wirklich das unfancyigste an Schaltung, was es war. Das kann man nicht mal Schaltung nehmen, was es was nicht gibt. So, und wenn das funktioniert, dann sollte ich mithilfe dieser Library meine Klimaanlage steuern können. Das Ding unterstützt ESP32. Was es nicht unterstützt, ist meine Klimaanlage. Allerdings gab's ein uralt Pull-Request dafür. Deswegen müssen wir erstmal gucken, dass wir das Git technisch geregelt kriegen. Stream4M, Porgas. Was hier harte Seitenarbeit angesagter. Top 100 Nintendo Songs war mal ganz besser. Entspannender, nicht so. Okay, sehr gut. Also, wie viele Arduinos hast du? Ich hab gar keine Arduinos. Ich hab nur ESP286, ESP32 und ein paar tiny... Wie heißen die Dinger? Ja, so irgendwelche ganz billigen Dinger. So was in der Richtung hab ich noch ein paar, aber die verwende ich für nix. Ich hab jede Menge ESP866, NodeMCUs. Da hab ich mir mal irgendwie ein 20er Packer gekauft. Da hab ich massig rumliegen auch noch 20er D1 Minis, NodeMCU, alle möglichen Dinger. Und dann hab ich noch ein paar ESP32 rumliegen. ESP32 Developer Boards, also so NodeMCU Boards hab ich nicht so viele. Da hab ich 3, 4 oder so noch übrig. Allerdings hab ich noch ein paar ultra low power ESP32 und ich hab mir erst letztens hiervon einen 10er Pack bestellt, weil ich finde das ist das beste ESP32 Board was es gibt. Das ist ultra klein. Das einzige Nachteil bei dem ESP32 Board ist, dass es nicht ganz so viele GPIOs hat wie eine NodeMCU, aber genug. Warum ich finde was das beste ESP32 Board ist, es ist ultra klein und es hat alle nötigen Sachen on Board. Und dazu kommt, dass es einen Anschluss hat für Batterie direkt und dass es optimiert ist für Low Power. Das heißt wenn ich Deep Sleep anmache schaltet das auch alles ab und es verbraucht so gut wie nix im Deep Sleep. Also es braucht unter 20 micro Ampere im Deep Sleep. Das heißt es geht sogar an einer Batterie 1-2 Jahre lang. Was warum nicht DenoMCU? Hab ich schon nie gehört. Was ist denn DenoMCU? Äh? Ach warum nicht Node? Ah ok ich hab den Witz nicht verstanden. Jetzt, jetzt. Hat ein bisschen gedauert. Hat ein bisschen gedauert, ja. DenoMCU. Deno wollte ich auch mal im Stream ausprobieren. Müssen wir mal schauen. So davon habe ich mir als letztes einen 10er Pack gekauft und ESP32 habe ich auch noch ein paar. Heute nehme ich ein stinknormales NodeMCU Board. Das ist auch schon ein bisschen mitgenommen. Guck man sieht ja manche Pins sind schäpp. Und der USB Anschluss fällt ab wenn man zu heftig dran zieht. Wie steuerst du die ESP32 Board? Doch, doch die haben WLAN drauf. Das ist ja gerade das gute da dran. Die ESP32 und die ESP866 die haben alle WLAN. Das ist ja auch der Grund warum die Dinger sich so rasend schnell verbreitet haben. Und der ESP32 das ist eh, wenn man sich mal überlegt was da alles drin steckt ist das ein mega geiles Board. Wenn man sich, machen wir noch mal den da auf. Was hier alles drin steckt in diesem kleinen Fuzz Board. Also in dem ESP32, der ESP32 ist das da. Das die etwas größere Chip hier drauf. Der hat, der hat zwei Dualcore, also das ist fachsinnig zwei Dualcore. Da hat er Dualcore CPU drauf. Mit jeweils 240MHz. Eine Low Power CPU mit 8MHz. Also sind quasi, wenn man ganz übertrieben sagt hat das Ding drei CPU Kerne. Eine ultra Low Power 8MHz. Den man allerdings mit ein bisschen Assembler programmieren muss. Was eklig ist. Das haben wir mal im Stream ausprobiert. Und zwei 240MHz CPUs. Also das Ding hat auch richtig Power. Also es gibt eigentlich kaum bessere Boards als in irgendeiner Art und Weise ESP32. Und die Dinger sind halt mega billig. Also wie gesagt die Tiny Pico sind ein bisschen, bisschen teurer. Weil halt besonders klein. Aber so ESP32 Note MCU. Der Kram kost nix. Die gehen einfach auf Aliexpress. Ähm, nein. Äh. Ein Cent? Die Dinger sind auch Arduino-kompatibel. Das heißt man kann auch Arduino-Libraries ähm verwenden, ja. Das ist, ach ein Stück höchstens pro Kunde. Versand. Ja das ist, das ist ein Schwachsinnangebot. Was auch immer. Ne ne das würde ich kaufen. Lieber sowas hier. Das sieht besser aus. Genau. Wenn man sich so Note MCU-kompatibles Board kauft. Hallo was ist der? Hä? Er zieht neukontenrabatt ab. Okay. Na gut wie dem auch sei. Also ihr kriegt für ungefähr 3, 3 Euro nen Board. Da kannst du dich echt nicht beschweren. Und wer nicht Aliexpress kaufen will, der kann sich auch hier was kaufen. Allerdings sind die ein bisschen teurer. Also hier bezahlste zum Beispiel das sind die ESP82. Hier bezahlste halt das dreifache für nen Board wie bei Aliexpress. Allerdings man kann sich durchaus so mal 3 Boards gönnen für 20 Euro. Das ist okay. Wenn man nicht lange warten will. Das ist halt dann morgen schon da im Endeffekt. Ja. Also es schadet nichts. Wär da Interesse dran ein bisschen was zu programmieren. Ich würde aber auch 3 Stück nehmen, weil man hat einen mal auch relativ schnell kaputt gemacht. Sei es das man zu stark am USB Anschluss zieht und den abbricht oder irgendwie aus Versehen mal drauf tritt oder irgendwie das Ding kurzschließt oder sowas. Die NodeMCUs sind schon relativ verträglich. Also die haben überall auch mal noch nen Widerstand mit dabei. Das ist nicht so. Die sind sowohl 3,3 Volt als auch 5 Volt tolerant. Also man kann eine NodeMCU nicht so schnell kaputt machen. Aber trotzdem wenn man nicht aufpasst gehts trotzdem mal recht schnell in die Hose. Das heißt ich würde immer nen Dreierpack kaufen. So. Aber jetzt fangen wir mal an mit dem ganzen ganzen Kram. Als erstes müssen wir uns das Gitrepo von dem Typ mal klonen. Und dann müssen wir das Comet raussuchen wo sie meine Klimaanlage aus Versehen drauf tritt. Ja kommt vor. Ich bin schon auf einige Elektronikdinger drauf gedreht. Oh. Huge. Ist das schlimmer als Lego Steine. Kommt drauf an auf welche Seite du trittst. Wenn du nicht auf die Pins drückst passiert nicht viel. Paper please. So. Wir machen erstmal nen Projekt für den Microcontroller. Dazu brauchen wir folgendes Addon. Wir können das mal wirklich machen jetzt weil ich glaube das es recht übersichtlich wird. Es ist irgendwie nicht gut abgemischt die Playlist. Mal zu laut mal zu leise. Da kann sie nicht entscheiden. So wir machen das jetzt mal wirklich so dass das das das theoretisch jeder nachmachen könnte wenn er will. Also das hier zusammen stecken traue ich jedem zu. ESP32 nehmen und einfach hier ne zwei Jumperkabel und Infrarot LED dran stöpseln. Also das kriegt wirklich jeder hin. Das hätte meine Oma hingekriegt. Also wer das nicht hinkriegt da glaube ich wirds generell nicht so mit Technik. Das muss jeder hinkriegen sowas hier zusammenzustecken. So und wie man das ganze programmiert ist relativ simpel dadurch dass die NodeMCUs nämlich schon so gut equipped sind dass die auch einen USB Anschluss mitbringen braucht man auch keinen großen Akt mehr zu machen mit Serial auf USB und dann irgendwelche Buttons drücken zum Flaschen und sowas in der Richtung einfach anstöpseln per USB und man kann das ganze flaschen. Jetzt ist natürlich die Frage ok wie programmier ich denn hier jetzt was für und dafür empfehle ich euch Wristle Studio Code und da gibt es ne Extension die nennt sich Platform IO und das ist das mit Abstand einfachste um die gängigen Microcontroller zu programmieren. Damit kann man eigentlich auch fast nichts mehr falsch machen. So erstmal warten bis der Kram installiert ist. Sind da Compiler dabei? Ja es ist alles dabei. Es ist alles dabei. Du siehst ja ich installiert es jetzt das erste Mal. So wenn ihr das ganze installiert habt ploppt automatisch der Willkommen Screen von Platform IO auf und dann kann man sagen neues Projekt und jetzt muss man sein Board auswählen was man hat und ich hab nen ESP32 Node MCU. Framework wir wollen Standard Arduino Zeug verwenden Projekt keine Ahnung Klima Default Location anlegen fertig. So und schon können wir Sachen uploaden auf unseren Microcontroller. Ich muss den ganzen ich muss das allerdings jetzt mal anstöpseln weil ich hab das noch gar nicht angestöpselt. USB. Komm her. Schauen wir mal dass der Kram hier auch weitergeleitet sind die VMs das da? Was? Alter streiten sich schon meine VMs da drum? Wer es fressen darf? Audits Twitch Prime Dankeschön. Exzellent Subscription. So bla bla bla. Yes mir eigentlich vollkommen egal. So jetzt haben wir ein neues Projekt angelegt im Platform IO. Eine Sache die ich noch empfehlen kann wenn man Platform IO verwendet ist am Anfang einmal in die Settings gehen und bei den Platform IO Settings einstellen dass die Extension nur aktiviert wird wenn man ein Platform IO Projekt aufmacht weil ansonsten ploppt die Extension jedes mal auf wenn man Visual Studio Code aufmacht das will man nicht und jetzt ploppt die Extension nur noch auf wenn man eine Platform IO ein Platform IO Projekt aufmacht. So das ist jetzt komplett schon fertig. Platform IO macht das komplett vorkonfiguriert für ein das heißt das ist schon ein komplett fertiges Projekt wir können das jetzt mal beispielsweise machen wir schalten jetzt mal unsere serielle Ausgabe ein und dann schreiben wir in unserer Main Loop mal Print Loop oder so und dann sleepen wir mal für eine Sekunde. So und jetzt kann ich nämlich direkt hier aus der IDE schon raus sagen Upload und der connectet sich zum Controller und lädt das ganze hoch also viel einfacher geht das ganze nicht. Also viel simpler kann man das wirklich nicht mal machen. Ja es ist leider C++ achso man muss übrigens noch sagen Serial Ausgabe will ich mir angucken. So guck plopp also die krasseste Firmware aller Zeiten haben wir uns gerade programmiert die nichts anderes macht außer plopp auszugeben auf der seriellen Schnittstelle. So und jetzt nehmen wir uns das Projekt von GitHub das für die Klimaanlage kein C-Line nee C-Line funktioniert damit nicht so gut. Das habe ich schon mal ausprobiert es gibt für platformer.io gibt es einen C-Line Plugin das ist aber meilenweit hinter dem Mischel Studio Code Plugin. Übrigens by the way ne. Die Musee ist übel schlecht abgemischt. Was wollte ich jetzt sagen. Genau ich bin letztens ein bisschen am Go programmieren für mein Video. Also ich habe ja so eine Videoüberwachungsgeschichte programmiert wo man im Browser meine Security Kameras anzeigen lassen kann. Das habe ich euch ja schon mal gezeigt. Ich gucke mal ob ich euch noch mal zeige. Nee kann ich nicht da sieht man da ist Leak. Nee kann ich doch ich kann es euch zeigen. Muss ich aber schnell wieder zumachen. So hier da sieht man das Katzenklo da unten sieht man die Hofeinfahrt unten und sonst was. Gut was auch immer. Zumindest damit das funktioniert muss man ja irgendwie die Kameras abfragen. Das mache ich über FFmpeg und dann muss ich den ganzen Kram irgendwie per WebRTC in den Browser packen. Und das mache ich über eine Go Library. Straße liegt OMFG. Ja und dafür bin ich gerade ein bisschen am Go programmieren. Und ich sage euch eins Go in Visual Studio Code ist der größte Abfuck aller Zeiten. Prinzipiell funktioniert es allerdings ein Bug wenn man nämlich C und Go Interop macht was eh schon absolut hängen geblieben kompliziert und Performance im Arsch ist in Go aber das Visual Studio Code Go Plugin geht einfach kaputt wenn man C-Go programmiert. Das heißt es gibt zurzeit nichts außer Go Land was ich verwenden kann. Leider kann Go Land dann wiederum kein C richtig. Was auch immer es ist ein bisschen eklig. Aber ich brauche nicht viel Go und ich brauche auch nicht viel C in der Sache. Das sind so irgendwie 2-300 Zeilen die einfach nur die Interop machen zwischen WebRTC Library und FFmpeg. Das ist nicht so viel aber es ist trotzdem eklig und die kriegen es seit Monaten nicht hin. Ich kann euch sogar den Bug Report zeigen. Es gibt keine, weil die Library für WebRTC die ich verwenden will in Go programmiert ist und es gibt nichts Vergleichbares für keine andere Programmiersprache sonst würde ich das nicht verwenden. Hier ist das Issue und da sind die schon seit einem Jahr oder so dabei. Da sind die seit einem Jahr dabei. Guck mal hier. Das ist November, ok das ist nur das Folge Issue. Die sind seit über einem Jahr dabei ihr Visual Studio Plugin zu fixen und das Visual Studio Plugin kann man nicht fixen, weil man irgendwie Änderungen im Go Language Server braucht. Ganz wirres Zeug Alter. Das ist eine Sache da muss man echt Microsoft und.NET loben..NET hat auch so ein paar Sachen wo ich mich frage muss das sein..NET ist zum Beispiel richtig eklig oder war in der Vergangenheit richtig eklig. Wenn du viele Objekte zum Beispiel in irgendeinem Pasa hast oder wo du richtig viele Objekte erstellt. Da war.NET gerade mit garbage collection absolut eklig. Bei einer Sache muss man Microsoft aber echt loben. Ihr Tool Support ist das beste was ich kenne. Ich kenne keine Programmiersprache die besseren Developer Wohlfühl hat wie.NET. Mit Rider unter Linux ist es auch toll. Es gibt eigentlich kaum was besseres. Da kann Ruby einpacken, da kann Python einpacken, da kann Go einpacken, da kann Java einpacken, da kann C++ einpacken. Also das muss man wirklich sagen. Tool Geschichten und wie weich das einfach funktioniert ist.NET wirklich das beste was es gibt. Mono ist ja auch mal voll für den Arsch. Das einzige wofür ich in letzter Zeit Mono verwendet habe ist um auf dem Raspberry Pi Zero was laufen zu lassen. Weil da gibt es ja kein.NET Core für. Ja und NuGet und das kommt ja noch dazu. NuGet finde ich ist mit der Schwächste an diesem ganzen.NET Ökosystem. Weil die fünfmal das Paketformat geändert haben und wieder Dependencies gehandelt werden. Aber das heißt schon was wenn das das Schwächste ist. Aber die ganze was Autocompletion angeht, was CodeAssist angeht, was irgendwelche Compiler Warnungen. Guckt euch mal an wie toll die.NET Compiler Warnungen sind. Wenn du in.NET irgendeinen Scheiß programmierst, dann sagt dir in der Regel zu 95% sagt dir der Compiler irgendwas sinnvolles. Also wenn du zum Beispiel irgendwie ein Typ mit dem anderen zusammenhängen willst als String und das funktioniert nicht, dann sagt dir das der Compiler. Sagt dir hier Typ A und Typ B geht nicht und sowas. Bei C++ sieht die Fehlermeldung ungefähr so aus. So ein paar Klammern hier noch drinnen. So das ist die C++ Fehlermeldung. Und anhand der C++ Fehlermeldung sollste dann irgendwie erkennen ah ok Typ A und Typ B funktioniert nicht zusammen. Das ist die C++ Fehlermeldung. Der.NET steht dann halbwegs was Gescheites drinne. Ruby und in Ruby steht immer drinne. Wie hieß es? Unknown. Ach fuck wie hieß der Standard Ruby Fehler nochmal? Method Unknown oder sowas steht da immer drinne in Ruby. Und du fragst immer was willst du von mir? Ruby. Hab eine irrsinnige IT Support Frage an dich. Hast du einen Moment dafür? Ist echt kurios. Ja schieß los. Java geht auch. So wir müssen jetzt erstmal anfangen. Und zwar. Platformer hat das Projekt aufgesetzt. Wir gehen jetzt in diesen Library Ordner und klonen uns. Ups und klonen uns das Repo mit der Library drin die wir verwenden wollen. Sagen wir geht clone und danach wird es ein bisschen kompliziert weil wenn ich hier nach meiner Klimaanlage suche dann stelle ich fest es gibt einen Merch von 2017 der meine Klimaanlage supportet also als unterstützt hinzufügt in dieser Library. Das witzige ist nur wenn man sich jetzt das Repo geklonet hat und da reingeht und sagt da mal Git log und sucht danach. Ups wenn man jetzt das Richtige noch sucht. Und sucht da mal danach damit man fest schon befindet nichts. Und dann schaut man mal ein bisschen genauer nach und stellt fest ok der Support wurde gemercht allerdings nur in den Dev Branche von dem Typ. Und das hat es nie in Master geschafft. Ich weiß nicht was er da gemacht hat. Deswegen werden wir jetzt mal folgendes machen wir machen mal Git log Dev. Und dann stellen wir fest ach guck mal hier da ist ja das Commit mit dem Support für meine Klimaanlage drin. Können wir uns mal den Diff angucken was der hier gemacht hat. ZS S guck hier Support für meine Klimaanlage drin in diesem Commit. So deswegen probieren wir jetzt mal was. Wir machen das was der Maintainer hätte eigentlich schon längst machen sollen. Wir nehmen den Dev Branche und merchen den mal nach Master und gucken ob das funktioniert. Eine Sache ist daran ein bisschen doof. Wir können danach wahrscheinlich Upstream nichts mehr verwenden aber was juckt es mich so lange meine Klimaanlage zu steuern ist es ok. Wir können es auch Cherry picken allerdings lohnt sich das in diesem Fall nicht so sehr weil es sind mehrere Commits. Da sind hier ein paar Commits drin. Wir merchen den Kram einfach und mal gucken was dann rauskommt. Also was was sagt der Chat hier. Chat hat gerade irgendwie noch was gefragt. Pass auf ich habe eine Batch Datei in die für mich Draw IO Crop Callt. Aha wenn ich diese Datei über CMD aufrufe dann klappt alles wunderbar. Wenn Latex Mk das über Pearl. Pearl Alter. Die gleiche Batch Datei Callt heißt es BadOptionX. Was kurios ist wenn ich in der Batch Datei auch noch PVD Callt dann ist das Laufex Buchstabe groß wenn ich CMD Callt dann klein. Oh das ist Windows. Ich habe keinen Schimmer. Na gut BadOptionX. Es kann sein dass wenn man mit Pearl die Sachen öffnet man das die Argumente anders übergeben muss. Also wenn du in Bash was ausführst ist es ja einfach so und dann Option. Je nach Programmiersprache kann es durchaus sein dass es sowas ist wie OS Run. Keine Ahnung Bloop. Minus X. 1 2 3 so. Kann auch sein dass es in Pearl so ist. Ich habe ehrlich gesagt keinen platzen Schimmer ob das in Pearl so ist oder nicht. Weil ich verwende kein Pearl. So und ja man könnte das auch auf Rebase machen aber ich merge den Kram jetzt. So also probieren wir mal Git Merge Def. Äh ja. Und ich hoffe mal es wird nicht funktionieren es wird irgendwelche Merge Konflikte geben. Ha das war klar. Ok warum lässt sich der Kram nicht mergen? Weil das hier konfliktet. So README ist mir egal. FDTC HEATPUMP IR ist mir auch egal. Was mir nicht egal ist ist das hier. Weil das ist die Datei wo der Support für meine Klimaanlage drin ist. Das heißt wir müssen uns die Merge Konflikte jetzt mal angucken. Glücklicherweise mache ich den ganzen Tag auf der Arbeit fast nichts anderes als Merge Konflikte zu lösen. Das heißt ich kenne mich damit wenigstens aus. Wenn Git einen Merge Konflikt hat dann markiert er das ganze immer hier was miteinander konfliktet. Und an der Stelle möchte uns Git zum Beispiel mitteilen dass dieser Teil konfliktet mit diesem Teil. Das liegt meistens daran weil sich in der gleichen Datei in den gleichen Zeilen halt parallel was geändert hat. Es ist in dem Fall wohl auch so. Ähm. Und jetzt müssen wir den Konflikt irgendwie lösen. Konflikt lösen macht man indem man die Datei in den Zustand bringt wie sie am Ende eben aussehen soll. So und wenn ich mir das ganze hier so angucke würde ich sagen wir brauchen das obere nicht. Und wir brauchen komplett. Komplett das untere. So. Erster Merge Konflikt gelöst. Also übrigens richtig toller Hack. Git add und dann Windows Taste Punkt äh alt alt Punkt. Dann fügt ihr die letzte Datei ein die man geöffnet hat. Git Status. So ein Merge Konflikt haben wir gelöst. Nächster Merge Konflikt. Zum Glück ist das so einfach. Zwei mal Proc map in einer Zeile. Hab ich mich verguckt. Kann sein dass ich mich verguckt hab. Wieso. Das eine ist Model das andere ist Info. Warum benutzt du kein Merge Tool weil ich äh Fan von von Raw Raw Wim bin in dem Fall. Ich finde es ganz ehrlich mit Merge Tool nicht so viel übersichtlicher als dass ich mich an die zusätzliche Bedienung von einem Merge Tool gewöhnen will. Das sieht doch eigentlich gut aus oder. Also Flo 690 ich sehe da jetzt kein Problem drin. Das sieht gut aus. Das hier ist äh achso du meinst weil es zwei mal Proc map ist. Ne das passt. Ne. Oder ne. Du hast recht das sieht irgendwie komisch aus. Ja das sieht nicht richtig aus. Da gebe ich dir recht. Das sieht das sieht das sieht falsch aus ja. Das müsste wahrscheinlich eher sowas hier sein. Aber ich editier jetzt mal nicht. Drehe rum wir gucken einfach ob es funktioniert. Im Zweifelsfall ist es C++ da wundert mich nichts wenn was funktioniert und mich wundert auch nichts wenn was nicht funktioniert. So also nächste Datei mal angucken ob es da irgendwelche Merge Konflikte gibt. So da wollen wir auf jeden Fall das untere haben. Das ist nämlich die ID von meiner Klimaanlage ich habe hier eine Mitsubishi zss. Was brauchen wir hier. Hier brauchen wir beides. Wir brauchen die Klasse weil die Klasse erbt von der Klasse oder. Ne ne ne ne die Klasse erbt von der Klasse das heißt wir brauchen den ganzen Crap hier oben nicht. Sondern können das rausschmeißen bis auf hier unten. Rent nicht so gegen C++. Ich muss nicht gegen C++ renten C++ die qualifiziert sich schon selbst immer. So ich glaube das stimmt so. Jetzt Status. Add. Zack. Die Datei interessiert mich nicht die Datei interessiert mich nicht. Wenn man in a Merge ist bei Git und man irgendeinen Stand auschecken will von der Datei überschreiben will kann man einfach den Stand sagen und dann die Datei dahinter. Und jetzt nimmt er den aktuellen Master Stand weil ich habe kein Interesse die irgendwie Merge Konflikt zu lösen weil die brauche ich eh nicht. So und jetzt sagen wir Git commit und schon haben wir den Dev Branch von dem von dem Kerl zusammengeführt mit dem Master Branch und wir können das ganze verwenden. Jetzt müssen wir nur noch hoffen dass der Crap funktioniert. Das ist jetzt das eigentliche Problem. So. Die haben irgendwie ein Beispiel wie das ganze funktioniert das habe ich mir nämlich im Vorfeld schon angeguckt. Das probieren wir jetzt mal aus. So. Das er ist. So. Bevor wir irgendwas an die Klimaanlage senden. Gucken wir erst mal ob das richtige Modell und alles ausgibt. By the way. Bevor ich jetzt weitermache mit der Klimaanlage habt ihr schon mal eine neueste Errungenschaft gesehen. Das ist das Werkzeug was ich mir letztens im Stream bestellt habe bis heute angekommen. Oder was ich im Stream rausgesucht habe. Ich sag euch. Exzellent. Das macht richtig Spaß das Zeug. Nicht dass man das täglich brauchen würde. So irgendwelche. Wie heißt das eigentlich Maul Schlüssel oder so. Aber wenn man sie mal braucht dann sind das hier nur nur vom feinsten. Und übrigens diese Rohrzange hier oben ist auch toll. Da kann man nämlich hier auf den Knopf drücken. Der ist falsch rum drinnen. Den habe ich rausgenommen und falsch rum wieder reingesteckt. Das sieht auf der anderen Seite genauso aus. Die Rohrzange ist übrigens ganz besonders toll weil die kann man die hat hier so einen Knopf und kann man nach unten drücken. Da kann man die quasi mit einer Hand die Größe sliden. So leicht geht das und dann lässt man den Knopf los und dann ist er wieder fest. Das ist wirklich top. Und hier unten ist die Ratsche mit Ratschenfunktion da kannst du hier dann quasi drehen dran. Richtig richtig richtig nice. Viel zu teuer aber gutes Werkzeug kann man nie genug haben. Und so langsam aber sicher ist meine Werkzeug Sammlung ich will nicht sagen komplett. Komplett ist es nie. Ja tschüss mein Name genau. Aber ich habe jetzt so langsam aber sicher alles was man irgendwie braucht. Einzige was ich noch brauche ist ein ordentliches Teppichmesser so ein ordentliches Cuttermesser. Da habe ich nämlich nichts gescheites wo ich auch die Klinge gescheit wechseln kann. Und was ich auch noch gerne hätte wären so ein kleines Skalpell wo man Sachen mit auspacken kann bzw Sachen zurecht schneiden kann oder sowas. Was kosten die 160€ viel zu teuer. Viel viel zu teuer das ist Werra ja. Aber die haben auch günstigere. Die haben auch günstigere. Shroud kommt wieder auf Twitch echt. Poggers. Ich gucke zwar nicht Shroud aber finde ich immer gut wenn er wieder kommt. Seit Overwatch League von Twitch weg ist habe ich davon gar nichts mehr mitgekriegt. Ich habe jetzt mitgekriegt dass DrDisrespect und Ninja jetzt irgendwie auf YouTube streamen. Juckt mich überhaupt nicht. Aber gerade für DrDisrespect ist es glaube ich ganz gut weil der Kerl ist so krass Mainstream mittlerweile. Also nicht der bekannt halt einfach. Dass YouTube vielleicht sogar die bessere Plattform ist weil einfach der Mainstream und die 0815 Casuals eben auf YouTube sind. Zumindest es lohnt sich nicht wirklich den Preis dafür auszugeben. Aber die haben auch noch eine kleinere Variante. Die haben drei Sets. Die haben einmal die einfache Variante ohne diese Auflage und ohne die Ratschenfunktion. Die kosten dann wahrscheinlich nur 70 Euro oder so. Dann gibt es die mit Auflage und Ratschenfunktion für 160 und es gibt es ganz abgedrehte mit Winkel und hin und her umschaltbare Ratschenfunktion für 270 Euro. Aber das war mir dann doch zu viel für ein paar Schlüssel. By the way Leute. DrDisrespect. Ich habe es gesagt Leute im Stream. Ihr wollt mir das nicht glauben. Ich habe gesagt das wahrscheinlichste ist nach allem dem was wir wissen ein Plattform Wechsel. Und alle der ganze Chat wieder. Mach es im Leben kein Plattform Wechsel. Niemals Plattform Wechsel. Guck dir mal den Stream mal wieder geendet ist. Niemals im Leben Plattform Wechsel kann überhaupt nicht sein. Und ich habe weiterhin drauf bestanden habe ich gesagt Leute. In Anbetracht der Tatsache dass wir nichts wissen und bei allem anderen so viele Annahmen treffen müssen ist Plattform Wechsel nach wie vor das wahrscheinlichste. Und Chat. Wer hatte Recht. Es ist ein Plattform Wechsel. Ob der Plattform Wechsel jetzt natürlich von Anfang an geplant war wage ich mal zu bezweifeln. Da ist auf jeden Fall zwischen ihm und Twitch was gelaufen. Aber im Endeffekt unterm Strich ist es Plattform Wechsel gewesen. Ich hatte Recht. Ich wollte es jetzt nur noch mal hervorheben. Weil mich der Chat so ausgebadet hat. Also nach dem kann überhaupt nicht sein Max. Niemals niemals. Guck dir wie ruhig der Chat auf einmal ist wenn man jetzt erzählt dass sie Mist erzählt haben. Chat. Ja aber das war echt Marketing Move. Keiner mag Klugscheiße. Ja vor allem mag keiner Leute die so tun als wüssten das. Das war ja gerade bei Doktor Disrespect so geil. Da war irgendwie der Slasher am Start so nach dem Motto Twitter. Twitch größtes gehütetes Geheimnis aller Zeiten und ja ich weiß es aber ich sag es euch nicht und keiner bei Twitter sagt es. Da kamen doch irgendwelche anderen Leute die gesagt haben ich hab mit ihm gesprochen. Alles Blödsinn. Alles Schwachsinn. Als wüsste Slasher das. Was geht los. Also wir haben den Kram gemercht. Das passt. Wir haben jetzt theoretisch eine Library die meine Heizung unterstützt. Das heißt probieren wir jetzt mal was hier. Include mit so Bishy. Ja. Heavy. Nee. Welche Datei brauche ich denn überhaupt. Welche. Welche Datei brauche ich. Welcher Datei hat er das eigentlich gemacht. Ja. Ja. Nee. Mit so Bishy Heavy Heatpump IR. Okay. Mit so Bishy Heavy Heatpump IR. Alles klar. So dann schauen wir mal wie sieht das Beispiel von denen aus. Wie geht das mit dem ESP32. Da stand doch hier irgendwo drinnen. ESP32 hier. IR Sender ESP32. Und da muss man jetzt angeben an welchen Pin man das ganze gestöpselt hat. Und Pin ist der hier bei mir. Also da hier da Pin. Das ist GPIO 17. Sieht man jetzt nicht. GPIO Nummern stehen unten drunter. Hast du an der Klimaanlage was verändern müssen. Nein. Das ist ja gerade das Gute daran. Dass der die offiziellen IR Codes quasi nachprogrammiert hat. Ach ja und der Grund. Irgendjemand hat gefragt warum man nicht die Fernbedienungs Codes lernen kann. Das liegt daran. Also es gibt ja so ein paar einfache IR Systeme. Da geht das. Zum Beispiel wenn man eine Fernsehfernbedienung hat und so eine Universalfernbedienung anlernt und so was. Warum das hier nicht geht ist folgendes. Die Klimaanlage schickt ziemlich viel State also nein Schwachsinn. Die Fernbedienung schickt ziemlich viel State mit an die Klimaanlage und das ist auch nicht nur ein Signal sondern das sind mehrere Signale die aufeinander aufbauen. Das heißt das kann man nicht lernen mit einer Universalfernbedienung. Das ist quasi ein eigenes Protokoll was halt Infrarot als Transport verwendet. Das ist nicht einfach irgendwie ein Infrarotsignal wo man quasi sagen kann ok das ist an das ist aus. Das ist ein recht komplexes Protokoll und das hat der Typ halt für die Klimaanlage nachgebaut. Deswegen geht das nicht so einfach mit IR Codes lernen. So wir sind auf GPIO 17 und jetzt machen wir einfach mal das Demoprogramm und gucken ob das Scheiß funktioniert. Was ich nicht weiß ist wie hell diese Infrarot-LED ist und welchen Winkel diese Infrarot-LEDs haben. Also sprich es könnte sein dass das direkt vor dem Gerät hängen muss. Es könnte sein dass es irgendwie durch das halbe Stockwerk geht mit Sichtkontakt. Es könnte sein dass es direkt drauf ausgerichtet werden muss oder nicht. Ich habe keine Ahnung und das steht hier auch nicht dabei was die für einen Winkel haben und sowas. Hier 20 Meter im Leben nicht. Also müssen wir mal. Müssen wir mal schauen. Müssen wir mal ausprobieren. So also Demo das haben wir. Wir copypasten einfach mal die Demo. So das brauchen wir alles. Den ganzen Mist brauchen wir nicht. Wir brauchen nur eine Mitsubishi Heavy SM. Das ist meine Klimaanlage. By the way warum machen wir so ein komisches Array? Das brauchen wir doch gar nicht. C++ ich muss mich konzentrieren. C++ Auto. Auto Auto. Device sowas. 20 Meter brauche ich auch nicht. So Mitsubishi Heavy Device. So wie geht es weiter? Serial Begin. Ok das ist ziemlich. Ja gut wir copypasten einfach mal den Standard. Die Eindrückung ist merkwürdig irgendwie. Ich mag ja persönlich zwei Spaces anstatt vier Spaces. Aber Visual Studio Code ist der Meinung gibt es nicht. Und wenn das Visual Studio Code meint hast du keine Chance. Muss man irgendwie die Zetix umstellen. Ja ich habe zwei Spaces eingestellt aber der C++ Formatter ist der Meinung er autoformatet auf vier Spaces. Ist mir wurscht ganz ehrlich ich kann damit leben. Ich kann es aber einfach auf vier Spaces stellen. Ah ne kann ich nicht. Wir können damit leben dann ist es halt doppelt eingerückt. Ok weiter gehts. Heatpump Model. Ok ok ok wir lassen uns erstmal das Modell von der Klimaanlage ausgeben. Da schauen wir erstmal ob das funktioniert. Bla bla bla bla bla bla. Heatpump Device. Device ist es bei mir in dem Fall. Was ist Buffer? Jigitt sind wir im Jahr 1995 oder was ist das hier? Vor allem warum weiß der das denn zu? Ok ich weiß nicht so genau was der hier treibt aber zumindest sollte jetzt eigentlich auf der Serial Ausgabe der Name meiner Klimaanlage erscheinen wenn ich das jetzt richtig sehe. Und dann machen wir das ganze nochmal und dann sollen wir irgendwelche Modellinfos von der Klimaanlage bekommen. Auch gut. Machen wir. Schauen wir ob das funktioniert. Upload. Äh warum gibt das Blob aus? Das darf kein Blob. Kann das alles Upload nicht funktioniert? Ah das Upload hat nicht funktioniert. Leute es geht nicht. Warum nicht? Ich hab irgendwas falsch gemacht. Ich hab irgendwas beim Merchen gefailt. Ok das muss man nochmal machen. Git Reset Origin Master. Achso ich bin ja doof. Erstmal alles wieder wegschmeißen und nochmal neu Merchen. Ok was hab ich verkehrt gemacht? Was hab ich verkehrt gemacht? Also. Naja hier kann man nicht viel anders machen als das was ich vorhin, als was ich vorhin gemacht hab. Warum kein grafisches Merching Tool? Weil ich Raw Kommando Zeile mag. So hier ist nix mehr drinnen. Verhält einfach beide Klassen. Ja wenn das nicht geht dann mach ich das auch. So. Ah hier unten. Irgendwelche Definition oder so. Ok also das brauchen wir auf jeden Fall nicht. Das ist meins hier. ZMP. Ich lasse das jetzt wirklich mal beides drin. Ich weiß zwar nicht woran er sich gestört hat ehrlich gesagt aber probieren wir mal. Ups. Wo? Ok. Ok. Mal gucken ob es jetzt geht. Leute. MonkaS. MonkaSmoke. Ok. Ok. Ok. Ok. Jetzt gehts. Leute. MonkaS. MonkaSmoke. Das sieht schon mal ganz gut aus. Ha hat funktioniert. So. Konsolen Merch. Beste. Weiß gar nicht was ihr habt. So. Ah guck mal funktioniert. Es funktioniert. Alles Gewöhnungssache. Also ich bin mit keinem Merch Tool bisher richtig warm geworden. Ich hab es ausprobiert mit Wim-Diff. Ich hab es ausprobiert mit diesem Perforce-Dingsda-Ding. Ich hab schon ein bisschen vergessen wie es heißt. Ähm. Und sonst was ich bin mit keinem Merch Tool richtig warm geworden. Und nachdem ich seit Jahren nur stinknormales Git-Merch-Konsole Wim mache. Es ist Gewöhnungssache. Alter SVN. Ihh. Ok also das funktioniert schon mal. Gut also er ist der Meinung meine Klimaanlage ist eine Mitsubishi Heavy ZS. Das ist richtig. Dann irgendwie MT18XC30FS4. Kein Schimmer was das ist. Kein Plastenschimmer. Aber wir probieren jetzt mal aus ob man was an die Klimaanlage setzen kann. So. Und ich hab die LED auf halb 8 neben am Rechner hängen. Also es kann durchaus sein dass es nicht funktioniert jetzt. Ähm. So. Und wenn ich eine Sache gelernt hab. Wenn es um Infrarot Sender geht. Dann. Dass man die Sachen mehrfach schicken muss. Weil das so oft in die Hose geht. Einmal schicken reicht nicht. Ich schick das jetzt 5 mal. Ja 5. 5 mal mit nem Delay. Mit nem Delay von 500 Millisekunden oder so. Dass es auf jeden Fall ankommt. Und dann machen wir mal hier in die Schleife 60 rein. Ich wills eigentlich nur einmal machen und gucken ob es funktioniert. So. Ähm. Send. Gut Upload. Schauen wir mal ob es funktioniert. Wie viel hatte deine Klimaanlage gekostet beziehungsweise was ist dessen Leistung? Leistung weiß ich nicht. Bekostet weiß ich ehrlich gesagt aus dem Kopf auch nicht mehr. Kannst du auch Device Gap machen? Weißt du was Device noch hat? Nee. Info Models denn mehr gibt es nicht. So ich upload mal. Mal gucken was passiert. Ich muss mal kurz die Musik ausmachen. Dass ich höre ob die Klimaanlage piepst oder nicht. Oder ihr das auch hört. Kann man die Klimaanlage so übertakten. Das ist wahrscheinlich gar nicht mal so unwahrscheinlich. Was Bild? So schnell hat es sich hochgeladen. Ah was hab ich kaputt gemacht? Äh. Was hat er für Schmerzen? Was willst du von mir? No matching function call. Das ist aber verdächtig wenn das so im Beispiel drin steht und so nicht funktioniert. Was will der sonst noch? Was will der sonst noch? Clean Mode? Ist das Beispiel? Ah ja ok was war? Clean Mode? Was weiß ich? Falls? Silent Mode? Ich weiß nicht was das macht. 3D Auto CMD? 1KS? Falls? Alles weg. Ok. Alles klar. Upload. Ich weiß nicht was das macht. Ok es passiert nichts. Ich richte das jetzt erst mal auf die Klimaanlage aus. Ich richte das jetzt erst mal auf die Klimaanlage aus. Und dann sehen wir mal weiter. Also Moment. Nochmal uploaden. Und ich halte das jetzt Richtung Klimaanlage. Mal gucken ob es funktioniert. Ha! Ha! Es geht! Habt ihr das gehört? Habt ihr das Piepsen gehört? Leute habt ihr das Piepsen gehört? Es funktioniert? Das ist ja POC like this. Alter dass das einfach geht. Ok ok ok Power on. Ey das stimmt. Das funktioniert. Er hat jetzt eingeschaltet. Oh Heizen ist vielleicht jetzt keine gute Idee. Sekunde cool. Also Heizen ist keine gute Idee. Ich schalte mal wieder um. Hallo kannst du uploaden please? Ich muss auf kühlen schalten. Ok. Jetzt ist es auf kühlen. Ich schalte mal zur Sicherheit mit meiner Fernbedienung aus und wieder ein. Dass es auf jeden Fall auf kühlen steht. Weil ich habe keinen Bock. Das ist jetzt auf den Heizenmodus. Device get wäre nice. Was soll das denn machen? Das ist eine Implementierungssache. So also Power on. Mode cool. Fan. Das ist wie schnell der Lüfter dreht wahrscheinlich ne. Fan auto silent. Jetzt ist die Frage. Ist eins volle Pulle und fünf niedrig oder ist fünf volle Pulle? Ok machen wir Fan 5. Das hier ist bestimmt die Temperatur 24 Grad passt. So das hier ist die Ausrichtung von den Lamellen. Also sprich vertikale Ausrichtung, horizontale Ausrichtung. Also vertikale Einstellungen. Also vertikale Ausrichtung kann man sagen Auto down manual. Ok. M down. Middle. MUP. Alles klar. Swing. Swing ist gut. Swing sieht man garantiert gut auf der Klimaanlage. Ob es wirklich swingt. Links, rechts wollen wir ja auch mal swingen. So und dann kann das Ding. Was kann das Ding noch? Clean Mode. Am besten will der keine Ahnung was das ist. Ah ist das vielleicht für den Pollenfilter? Das für den Pollenfilter, das könnte sein. Silent Mode. False. Das Ding hat einen Silent Mode. Ja das stimmt. Und 3D Auto CMD. Keine Ahnung was das ist. Silent Mode ist Piepsenabschalten das glaube ich nicht. Der hat nämlich den Silent Mode Knopf auf der Fernbedienung und Silent Mode ist das der die, das ist halt besonders leise. Das er den Lüfter und so alles runterfährt. So was jetzt allerdings 3D Auto CMD ist habe ich keine Ahnung. Wie findest du F-Sharp habe ich noch nicht großartig verwendet. Okay so jetzt sollte der angehen. Er sollte wirklich horizontal Swing machen und den Lüfter auf volle Pulle. Schauen wir mal ob das funktioniert. Wieder ausrichten ordentlich. Da geht der Lüfter jetzt volle Pulle? Naja. Ob der Lüfter jetzt volle Pulle ist weiß ich nicht. Ihr habt nix Piepsen gehört das lag an meinem neuesten Geld das hat funktioniert. Ich mach mal aus und mal wieder an und ich muss mal kurz für mich gucken. Ich mach mal Lüfter volle Pulle jetzt mit der Fernbedienung ob das dann irgendwie anders ist. Oh ja. Oh ja das war was anderes. Das war eben definitiv nicht. So jetzt muss ich irgendwie mal diesen komischen Controller ausrichten so das er auf die Klimaanlage zeigt ansonsten wird das nix. Versuch Fan 4. Aber ich bin begeistert das das funktioniert. Vielleicht muss man noch ein bisschen. Ja Fan 4 funktioniert Fan 4 ist volle Pulle. Vielleicht gibt es einfach kein Fan 5. Ich guck mal auf der Fernbedienung. Das hat nur 4. Das hat auch nur 4. 5 gibt es gar nicht. Gibt es nicht. Es gibt kein 5. Das hat nur 4. Das sehe ich auch gerade auf der Fernbedienung. So also das heißt ich kann das Ding jetzt anschalten. Power Mode. Cool. Was kann er sonst noch für Modes? Zeig mal her. Das ist jetzt schon mal ohne Scheiß die beste Steuerung für die Klimaanlage von allen Sachen die ich bisher probiert habe. Das ist besser als dieses Broadcom Ding besser als das Teil was extra für Klimaanlagensteuerung gemacht ist. Was Beschreibung für 3D Auto, Gebläsegeschwindigkeit, Luftstromausrichtung. Ne das wollen wir ja nicht. Auto ist übrigens der übelste Jebait Mode. Den habe ich am Anfang immer verwendet und dann hat die Klimaanlage auf einmal angefangen zu heizen wenn es zu kühl wurde und umgedreht. Das war Fail. Also das habe ich nicht. Okay es gibt Maintenance Mode, Heat, Fan, Dry, Cool. Genau das deckt sich Auto. Das Ding kann kühlen. Das kann trocknen. Wusste ich gar nicht dass es dafür einen extra Knopf gibt. Das kann lüften. Das mit dem Lüften ist tatsächlich ganz nützlich wenn man allergisch gegen Polen ist. Und dann kann man mit der Klimaanlage lüften und die hat einen Polenfilter drin und man kriegt den Scheiß nicht ins Haus. So es kann Heizen und es kann Maintenance Mode machen. Okay. Also mich interessiert aktuell ehrlich gesagt nur Cooling. Fanstufe will ich eins. Die kleinste gibt es auch ein Null. Eins. Silent. Okay ist auch nicht schlecht. Fan eins. So habe ich es. Ich stelle jetzt mal das ein was ich aktuell mit der Fernbedienung eingestellt habe. 24 Grad. Okay. So. Direction. Ich will nicht dass die vertikale. Warte mal vertikal. Was zum Teufel ist vertikal bei der. Was ist da vertikal. Man sieht es jetzt hier leider nicht. Also die Dinger hier können aus vertikal vertikal ist das jetzt so oder was zum Teufel ist davon vertikal. Horizontal ist wahrscheinlich so. Vermute ich jetzt mal. Also sagen wir mal vertikal will ich. Down. Und horizontal will ich auch. Moment rechts links Mitte. Dann ist dann ist horizontal in welche Richtung nach links. Das soll gegen die Mitte links. Das soll ein bisschen gegen die Wand blasen und nach unten. Genau. So. Das ist genau die Einstellung die ich jetzt mit der Fernbedienung habe. Das ist jetzt die gleiche Einstellung die ich wieder. Nice. Nice. Das funktioniert ja richtig gut. Das geht an. So und jetzt gucken wir mal ob wir den Kram wieder ausgeschaltet kriegen. Dann machen wir mal das andere. Senden wir mal nur einmal. Komm. So. Device. Also Power Mode off. Übrigens. Wenn ich off sende ist doch eigentlich kompletter Schwachsinn den anderen Kram auch zu setzen oder. Oder vielleicht muss man um den richtig auszuschalten noch was spezielles. Oder so. Off. So jetzt sollte er ausschalten. Gucken. Jetzt ausschaltet. Ja. Ja. Komplett aus. Das ist ja sehr nice. So einfach hätte ich mir das nicht vorgestellt. Ich meine. Ein popelischer. Ein popelischer ESP32 mit 5 Cent Infrarot LED. Also das Ding kostet 3,50 Euro. Die ganze Hart für die ich hier habe. 3,50 Euro und man kann komplett die Klimaanlage steuern wie man lustig ist. Das ist ja mega nice. So. Jetzt machen wir nochmal Bonus. Ich muss gucken ob ich einen. Einen Sensor habe für die. Ich will nämlich noch Luftfeuchtigkeit machen. Ich will noch Luftfeuchtigkeit machen und Temperatur machen. Das machen wir jetzt auch noch schnell. Ich habe hier nämlich noch einen Sensor dafür und da muss ich aber erstmal Library gucken. Flow 690 glaube ich dir. Aber ich glaube nicht dass das in irgendeine Art und Weise ins Gewicht fällt. Ja nice. Das ist ja so geil. Mit so einer billigen 3,50 Euro Hardware meine Klimaanlage fernsteuern. Massive. Zu geil. Richtig geil. So und jetzt muss ich nochmal schauen. So und jetzt muss ich mal schauen wie man hier meinen Temperatursensor angeschlossen kriegt. Und zwar ich habe hier nämlich gerade noch gesehen ich habe hier neben einem Raspberry Pi Zero noch einen rumfliegen. Da muss ich nämlich kein suchen gehen jetzt und zwar habe ich hier einen. Das ist ein BME 300 irgendwas genau. So einer ist das. Jetzt muss ich gucken wie ich den Kram angeschlossen kriege. Doch doch da ist eine Fernbedienung dabei klar. Wieso machst du das eigentlich bzw. hast du konkret mir eine Ansteuerung vor? Zum Beispiel dass ich von meinem Tablet aus die Klimaanlage einschalten kann oder dass ich sagen wir mal schauen kann der Raumtemperatur ist so und so viel und ich schalte die Klimaanlage wieder aus. Wenn die Raumtemperatur über 25 Grad ist und wenn sie keine Ahnung unter 25 Grad ist und wenn sie irgendwie über 25 Grad ist dann mache ich bis mit ein bisschen Delta dazwischen schalte ich wieder an. Irgendwie sowas. So gibt es da eine Arduino Library für und wie muss ich den Kram überhaupt anschließen? Wie muss ich den Kram anschließen an ESP32? Hier zeig mal her. Okay ich muss jetzt erstmal meinen Board hier rüber holen und anstöpseln. Ich mach das übrigens während das unter Strom ist warum auch nicht. Chaos haha. So oder vielleicht ziehe ich doch mal USB raus. So jetzt die erste Frage bei solchen Sensoren ist, ist der 5 Volt oder ist der 3,3 Volt? Was ist der? Ah beides. Der kann beides. Das ist gut. Der kann beides. Das ist schon mal schön. Da kann ich nämlich einen Pin verwenden der da übrig ist. So wie muss ich den Kram jetzt anschließen? Gibt es da irgendein schönes Diagramm für? Okay also wie muss ich den Kram anschließen? Ach du Scheiße. Das wenn es fertig ist. Also VIN. So VIN. Ich hab leider keine gescheiten Kabel dran. Ich mach euch danach gleich mal ein Foto von. Die Kabel sind alle gelb das heißt ich muss jetzt ein bisschen aufpassen. Also 3,3 Volt. So. Ground ist der nächste. Ich brauch echt mal ne Webcam für sowas. What the fuck. Was ist der dritte bei mir? Ist der dritte Pin? Okay. Ground. Ground. Ist dran. Dann haben wir SCL wo muss. Warte mal SCL da gibt es auch so spezielle Pins wo der Kram dran muss auf der NodeMCO. Pin out. Ich hab die Dinger ewig nicht verwendet da dran. Gibt es da irgendwie so einen speziellen Pin wo der hin muss? Ne oder? Ich glaub das kann man einstellen wie man lustig ist. Ich glaub das kann man einstellen wie man will. Okay. Dann mach ich jetzt mal Leute. Müsst ihr euch mal merken ich mach jetzt SCL. Mach mal. Ich hab mich verstopselt. Und SC. Ach du Scheiße das ist Kacke mit nur gelben Kabeln Alter. Muss nochmal abmachen. Fuck. Okay. Nochmal. Warum hab ich da nur gelbe Kabel an? V in. Geht auf 3,3 Volt. Dann bleibt ja nur noch Ground übrig eigentlich. Der geht auf Ground. Okay. Ich hab alles angeschlossen. Jetzt bin ich ja mal gespannt ob das funktioniert. Das klappt im Leben nicht Alter. Das klappt im Leben nicht. Alter warum klaut mir meine VM? Warum klaut mir meine VM das Device immer? Geh weg. Yes. Serial. Okay passt. Fuck Alter. Was gibt es da aus? Upload Error. Ich glaub das spack grad ein bisschen rum kann das sein. Upload. Hallo Upload. What the fuck? Was hat er für Schmerzen? Ich mach mal die VM aus. Die schnappt mir immer das Teil weg. Ich grad nochmal Strom raus Strom rein. Okay nochmal. Upload. What? Warum kann er immer uploaden jetzt? Ich hab irgendeinen Mist angeschlossen. Deswegen geht das nicht. Ich hab Ground auf 1 richtig und V in hab ich auf 3,3 Volt. Das ist eigentlich okay. Ich stöpsel es mal kurz um. Den Ground mal da oben drauf. Das spackt manchmal nämlich. Nochmal ab. Wieder dran. Aha. So. Das macht nur Probleme wenn man Mist anschlägt. Ah. Okay. Falscher Pin. Was auch immer. Jetzt hat es funktioniert. Alles gut. Ne. Ich hab. Ich hab aus irgendwelchen Gründen den falschen Ground Pin gemacht. Frag mich nicht warum es den falschen Ground Pin gibt. Aber das Problem hatte ich mit dem NodeMCU schon mal. Okay. Dann machen wir den Kram jetzt erstmal hier kurz raus. Und schauen jetzt wie man diesen Kram ausgelesen kriegt. Plopp. Delay. Sekunde. So und jetzt brauch ich irgendeine Arduino Library für meinen Temperatursensor. Übrigens könnte man mal Vollbild machen wieder. So. Habt ihr euch gemerkt welche Pins ich verwendet hab? 26 und 27 glaube ich. Okay. Also. ESP32BME200Library brauchen wir GitHub. Ne. Wir gehen mal in die Suche von Plattformer. Oh was es da gibt. Libraries. Suchen wir einfach. So weiter die Library Suche nochmal. Libraries. Max cheatest du in Battlefield 4. Fuck jetzt kommt es nach all den Jahren raus. Arduino. Die sieht doch gut aus. AdafruitBME280Library. Die sieht doch ganz brauchbar aus. Wo kann man die aufmachen? Hier GitHub. Repository. Hallo. Ja die sieht doch eigentlich ganz brauchbar aus. Welche Desktop Umgebung benutzt ihr? Das ist i3WM. Auch vor sieben Tagen gepflegt. Alles gut. Ja nice. Examples. Also wie benutzt man das ganze? Adafruit, Sensor, BME, Temp. Ne ich will nicht das i2c oder? Ist das i2c? Ne ich will nicht i2c. Ich will Dings verwenden. Das andere. Das andere. Okay. Ich muss den Kram irgendwie ansprechen können. Der BME ist SQC. Aber, aber. Dann müsste ich doch eigentlich an diesen. Ne ich will SPI haben. Ich will SPI haben, weil ich habe SCL und MS Dings da angeschlossen. Okay oder. Die zwei Dinger habe ich angeschlossen. Wie kriegen wir da jetzt die Temperatur raus? Ah ist das? Okay. Ja dann, dann probieren wir das einfach mal aus. Also. Install, Library, Install, Tool, Project, Klimaanlage, Install. Zack. Okay. Also. Dann included wir mal den ganzen Crap hier. Build. Die Version auf Plattform aus 48. Oh. Echt jetzt? Wo steht das? 110? Was haben wir hier für Versions? Oh. Warum ist das so alt? What the fuck? Was ist das für ein Crap? Ne. Mal ein KS. Ist das aktueller? Hätte ich nicht gedacht, dass das so ein Akt ist den Kram auszulesen. Boah das ist, das ist neuer. Dann nehmen wir das. Dann nehmen wir, dann nehmen wir das. Oder wir gucken uns jetzt einfach mal trotzdem, wir gucken uns jetzt mal an, ob das nicht doch funktioniert. Welche Erweiterung benutzt du? Das ist Plattform IO. Wir machen das jetzt einfach mal mit dem Beispiel hier. Also. Okay. Dann probieren wir das mal aus. Also den da. Und dann, wie liest man das aus? Blablabla. Test. Was ist das für Magic? Was, was, was ist das hier für? Für schwarze Magie, Alter. BME. What? Woher soll ich wissen, was das Ding für ne Adresse hat? Monka Giga, Alter. Okay. Upload. Achso, ich muss ja auch erst mal sagen, welchen Pins das überhaupt angeschlossen ist und sowas. Das kann auch so überhaupt nicht funktionieren. Wo sage ich ihm, an welche Pins der verwendet er? Hier so? Das verwirrt mich. Geht das? Okay. What? Welcher Pin ist das jetzt? Was meine Güte, was muss ich denn da überhaupt angeben? Was soll jetzt mal irgendjemand verstehen? Wie gebe ich denn die Pins an? Aber ich muss dem doch sagen, dass... Moment. Da kann ich die aber nicht an irgendwelche Sachen dran machen. SDASCL. Da muss ich die an die richtigen Pins machen, oder? Jaja, aber ich muss da an die richtigen Sensoren anschließen. Hier, guck mal. Ich muss das an die richtigen Pins anschließen. Wo muss ich das denn anschließen, ey? Warum ist das so kompliziert? So ein unglaublicher Kack-Sensor, Alter. Das ist doch nicht der... Ich habe dieses Ding. Ich probiere nicht alles durch. Also genau diesen Sensor habe ich. So sieht das aus. Okay. Also das heißt, ich muss jetzt gucken, wo bei meinem NodeMCU diese Pins sind. Das heißt, ich muss da auf... Die muss ich doch bestimmt setzen. GPIO Pin 22. Das ist nicht die Fault. Das muss man bestimmt einstellen, was er dafür verwenden soll. Ah, Eats Delivery. So, man muss doch bestimmt... Aha! Aha! Okay. Was ist denn hier standardmäßig? SDA. SCL. Was ist denn das hier, die Fault-mäßig? 22. Meine Güte, da muss man... Da kommt doch keiner drauf. Meine Fresse. 21. 21 und 22. Okay. Meine Güte. Komm mal. Okay. Also, ich habe es jetzt verkehrt gesteckt. Ich habe es nämlich auf 27 und 14. Das heißt, ich muss eigentlich auf... Ich muss auf 26 oder... Ach nee, Moment. Gibt es das vielleicht auch nochmal in... Okay. 21 und 22. Also muss ich auf... Wo ist 21? Da drüben. 21. GPIO 21. Und dann haben wir jetzt hier GPIO... Wo ist 22? Ah, da ist das Kleine aufgedruckt. Ah, GPIO 22. Okay. Ich hoffe, ich habe es jetzt richtig dran. SDA. Also, was ist denn? Ich bin jetzt mal dabei. Ich muss mal gucken, ob ich es richtig habe. Ich habe SDA jetzt auf 21. Stimmt das? Ja. Und SCL habe ich jetzt auf... Dumm, wenn man nur gelbe Kabel hat. Habe ich jetzt auf 22. Okay, okay, okay. Gucken, ob das jetzt funktioniert. Ah, ja, ja. Ah, guck mal, das scheint ihn gefunden zu haben. Sonst hätte er gemeckert. Guck mal, sonst hätte er gemeckert, wenn er ihn nicht gefunden hätte. Das scheint... Ich scheine das richtig angeschlossen zu haben. So, wie liest man das jetzt aus? Could not find, bla bla bla. Okay, einfach so. Ja, das ist, das ist ja easy. What für ein Ding? Altitude ist mir doch vollkommen egal. So, und jetzt, ob das jetzt geht, ob der mir jetzt Temperatur und Luftfeuchtigkeit ausgibt? What the fuck? Nicht so ganz. Aber es ist doch sehr merkwürdig, dass der das überhaupt... Wisst ihr, was komisch ist, dass der, dass der, dass die Abfrage funktioniert? Wisst ihr, was echt merkwürdig ist, dass die Abfrage funktioniert? Die Abfrage funktioniert, aber es liefert keine Werte? Das ist komisch, oder? Was, er hat ihn diesmal nicht gefunden? Ah, easy. Jetzt geht's. Jetzt geht's. Wow. Das ist aber nicht gut, oder? Bisschen, äh, bisschen schwankt das Ganze so. Vielleicht sollte ich ihn doch einfach mal an 5 Volt anschließen. Ja, na, die, die, die 24,6, die kommen hin, das ist okay. Ich, Leute, ich schließe ihn doch mal an 5 Volt an, vielleicht ist das... What the fuck, was macht der da dazwischen immer? Wackelkonten? Ne. Der liegt, der liegt ruhig da, wackelt nicht. Ich wackel jetzt mal voll dran. Leute, ich wackel jetzt total, das juckt ihn überhaupt nicht, ja. Ich mach den jetzt mal dran an 5 Volt und dann gucken wir mal, äh, Moment, was davon ist nochmal hier? 3,3. None. Okay. Oh, oh, oh, oi, oi, oi, oi, oi. Mockers, vielleicht sollte man das nicht im Laufende betrieben machen. Okay. Okay. Ich mach mal wieder ab, ist gut. Das dumme ist, ich habe da nur gelbe Kabel dran, ich sehe überhaupt nicht welches Kabel, was ist? Was ist das für ein Kabel jetzt? Browned, okay. Also mit 5V markt das schon mal gar nicht, 5V hat ja gar keinen Bock, boah, wat? Ne, damit grillst du den Note MCO nicht, das Ding ist tatsächlich relativ resistent. Okay, jetzt habe ich dann 5V dran, 24,10, okay, wir probieren mal, ich puste mal, ich puste mal. Und, ja, scheint zu funktionieren, scheint zu funktionieren, ich habe gepustet. Okay, dann machen wir jetzt noch mal Luftfeuchtigkeit, Luftfeuchtigkeit brauchen wir unbedingt noch, exzellent Luftfeuchtigkeit, Pressure ist mir egal, Humidity, Prozent, was, der hat, der ist, irgendwas stimmt, ich lese den Sensor zu schnell aus wahrscheinlich, kann das sein, dass ich den zu schnell auslese, dass man da ein bisschen länger sleepen muss, dass der Probleme hat, wenn man den zu schnell ausliest hintereinander, dass man irgendwie mal sowas macht. Oh, 36 Prozent, das ist aber, das ist ja schon ungesund, na gut, Klimaanlage ist an, Klimaanlage macht trocken, trocken, trocken, es f**k Luft, wir machen Klimaanlage jetzt mal aus, wir probieren das jetzt mal aus, ich, ich, ich leg das jetzt mal neben hin, irgendwo hier so, auf dem Rechner eben hin und wir machen Klimaanlage aus, so und jetzt beobachten wir das ganze mal kurz, das sollte zumindest, also die Temperatur sollte relativ schnell hoch gehen, innerhalb von 5 Minuten oder so, sollte die Temperatur ein bisschen, bisschen höher gehen, Luftfeuchtigkeit sollte dann, naja gut, Luftfeuchtigkeit, Feuchtigkeit muss erst mal herkommen, aber Temperatur sollte auf jeden Fall hoch gehen, Fenster auf, das ist eine gute Idee, ich mach mal kurz das Fenster auf, ich muss ja mal das Licht ausmachen, ja ich mach mal das Fenster auf, draußen ist warm, es ist halt noch geregnet, es kommt sogar, es kommt relativ kühl rein, was für eine Energieverschwendung, ja das stimmt schon, erst mal gekühlt, erst mal gekühlt mit der Klimaanlage und jetzt, jetzt erst mal Fenster auf, ok Fenster ist offen, aber man sieht schon, es geht wieder hoch, Klimaanlage ist aus, geht wieder hoch, ok also wir merken uns jetzt mal, wir sind bei ungefähr 37% und 23,8 Grad und dann schauen wir mal, na gut aber die Temperatur geht klar konstant hoch, übrigens die Luftfeuchtigkeit geht gerade sogar eher runter mit Fenster auf, ne, seht ihr das, das könnte auch noch so Messungengenauigkeit sein, ja das mit den Minus 146 Grad, das ist, das kam garantiert, weil wir den Sensor zu schnell ausgelesen haben, ok aber Temperatur funktioniert, Luftfeuchtigkeit funktioniert auch, wir können das mit Luftfeuchtigkeit ganz einfach ausprobieren, ich mach Fenster wieder zu, der ist relativ genau eigentlich, ich puste einfach mal dran, ich puste einfach mal, puste mal dran, dann sieht man gleich, dass es hoch geht, ich puste, ich puste mal dran, Achtung, ja, ja, Corona S ich hab den Sensor halb im Mund stecken, ok das funktioniert, das funktioniert Leute, das funktioniert, aber es funktioniert, man hatte gesehen, dass es funktioniert, so, gut, ja, sehr schön, das heißt ich hab jetzt, ich kann jetzt meine Klimaanlage steuern und ich hab nen Temperaturluftfeuchtigkeitssensor, das ist doch sehr praktisch, genau das was ich brauch, mal gucken ob die Steuerung noch geht, weil ich hatte die zwischenzeitlich abgeschaltet, warte mal kurz, ganzen kram wieder mal einkommentieren, eile, wat, wat, wat macht der da, warum fehlt da die Hälfte von, wat de, ok, das sagt Power ON, schau mal ob das funktioniert, ich hoffe ich hab es noch aus preset auf die Klimaanlage, alles Okay, das funktioniert nicht mehr, das Senden auf die Klimaanlage. Ich richte das noch mal auf die Klimaanlage aus. Hey, jetzt geht das Senden nicht mehr, was ist das? Okay, aus irgendwelchen Gründen geht das Senden nicht mehr, das ist ja auch geil, Alter. Na gut, das liegt aber garantiert daran, weil ich die LED jetzt an den hinteren Crown Anschluss vom ESP vom NodeMCU gesteckt habe, der hat ja vorher schon Probleme gemacht. Wenn ich den jetzt wieder umstöpsel, dann funktioniert das auf jeden Fall. Gut, also ich würde sagen, Test war trotzdem erfolgreich, weil man sieht hier Temperatur geht instant wieder hoch, Klimaanlage aus, Fenster zu, Bam, Luftfeuchtigkeit ist nach wie vor kacke. Einfach beide ins selbe hier, das geht gerade nicht, weil ich habe kein Board und nichts dran, ich habe bloß die Pins. Da müsste ich irgendwie was dazwischen stöpseln noch. Aber das ist gut, das funktioniert, das hätte ich nicht gedacht. Kannst dich echt nicht beschweren. So ich mach das mal, ich lass das mal im 2 Sekunden Takt auslesen, das sollte doch eigentlich reichen. Upload. Ja, also Leute, 36 Prozent Luftfeuchtigkeit ist das gut oder schlecht für Hals und Atmen und so oder ist das okay oder? PC lustig ist eine gute Idee, das machen wir. Weil ich den besser finde. Sollte zwischen 50 und 60 liegen, okay. Viel zu wenig. Ja, aber was mache ich denn jetzt? Wo kriege ich Luftfeuchtigkeit her? Fenster auf ist ja keine Antwort drauf. Luftbefeuchter. Kann man Luftbefeuchter und Klimaanlage zusammenverwenden? Ja, warum nicht? Spuckt den Sensor an. Ja, dann ist die Luftfeuchtigkeit auf dem Sensor höher, aber insgesamt macht es ja keinen Unterschied. Ich merke das auch, also mir ist die Luft auch hier drin zu trocken. Also sprich, ich merke das an den Augen, dass es anfängt zu brennen nach ein paar, nach einer Weile hier drin und ich merke auch im Hals, dass das ganz trocken wird mit der Zeit. Also würde ich mal sagen, also würde ich mal sagen, muss ich irgendwie gucken, dass ich ein bisschen bessere Luftfeuchtigkeit da hinkriege. Ich probiere mal was aus. Ich mache mal die Tür auf. Ich mache mal die Tür auf. Komm, gleich geht es nur auf hier. Tür auf. Nee, jetzt geht es wieder runter. Es war nur der Luftzug von draußen. Geht wieder runter. Es gibt kleine Ultraschallverdampfer. What the fuck? Aber habt ihr gesehen, wie schnell das hochgeht von 23,5 auf 26,5? Stellt einfach eine Schüssel Wasser ans Fenster. Ja, gut, das Fenster mache ich ja zu. Ja, ich mache jetzt mal die Tür wieder schnell zu. Ja, aber trotzdem, also ich muss sagen, das war ein äußerst erfolgreicher Stream. Wir können die Klimaanlage steuern und vor allem richtig ausführlich. Guckt euch mal an, wie geil das ist, was man bei der Klimaanlage alles einstellen kann. Ich meine, man kann natürlich, man kann alle ausstellen, man kann die unterschiedlichen Modi von der Klimaanlage einstellen. Ich muss mal kurz auf die Fernbedienung gucken, was das für Modi hat. Wartet mal, das muss ich mal kurz ausprobieren. Automatisch hat es, kühlen hat es, wärmen hat es, trocknen hat es, lüften hat es. Genau, das sind die Modi, die der hier auch drinne hat. Cool, Dry, Fan, Heat und Auto gibt es noch. Ah ja, genau. Auto, Cool, Dry, Fan, Heat. Genau, das hat der auch drinne. So, dann kann man die Lüftergeschwindigkeit einstellen von Auto, Silent bis 4, was auch mega geil ist. Ich habe es immer auf 1. Die Temperatur, man kann die Ausrichtung der Lamellen einstellen, so habe ich es nämlich immer eingestellt, dass das nach unten gegen die Wand bläst und nicht zu mir vorne an den Schreibtisch. Und dann haben wir hinten diese komischen Dinger, die ich wahrscheinlich immer auf False stehen lasse. Von Clean Mode bis Silent Mode und sonst was. Richtig geil. Ja, das mit dem Wasser, mit der Luftfeuchtigkeit. Ich werde mir das morgen mal angucken. Ich lasse das hier morgen mal laufen und dann beobachte ich mal, wie die Luftfeuchtigkeit ist jetzt. Jetzt liefert er den ganzen Tag die Klimaanlage und ich gucke mal, ob sich das deckt mit. Ab wann ich merke, dass mir es anfängt in den Augen ein bisschen weh zu tun und im Hals zu kratzen, ob sich das deckt mit mit niedriger Luftfeuchtigkeit, weil ich habe den Eindruck vormittags ist es besser. So und achso, soll ich euch noch mal ein Foto machen, wie das Ding jetzt ausschaut mit dem Sensor dran? Ich mache euch noch mal schnell ein Foto. Wartet mal. Ja, da ist anscheinend höhere Luftfeuchtigkeit. Exzellent Fußbodenluftfeuchtigkeit. So dann uploade ich das mal schnell. Wartet mal. Dass man jetzt sehen kann, wie es aussieht. Post Image, Choose Image, Foto Library. Zack, dann Post, machen wir hier auf Post Image, Post Image Gallery. Ok, es ist keine Gallery, Post Image. 8, 6, F. Ja, so, ich habe es auf den Teppich geschmissen, einfach mal fotografiert. Da hat sich nichts großartig getan, also sprich, das kann wirklich jeder selbst zusammenwursten, wie er will. Die Quali vom iPhone ist aber schlecht gerade, warum ist die so kacke? Naja, also hier ist die Infrarot-LED dran, ich gebe zu dahinten, der Fußboden ist nicht der beste Kontrast. Hier ist die Infrarot-LED dran, der Crown-Anschluss hier, der Crown-Pin buggt irgendwie rum. Ich weiß auch nicht, warum, was der für Schmerzen hat, warum der nicht funktioniert. Hier ist der Sensor dran und der ist halt an den passenden GPO-Pins. Aber trotzdem, man hat jetzt die Möglichkeit damit, die Heizung, die, die, die, die Klimaanlage zu steuern und man hat gleichzeitig noch Luftfeuchtigkeit-Temperaturauswertung, das ist ja eigentlich genau das, was man in Kombination haben will. Das ist ja genau die Kombination, die man haben will, weil man auf Grundlage dieser Werte dann auch darauf reagieren kann, wie man die Klimaanlage einstellt. So und der ganze Mist, der ganze Mist, den kriegt man im Endeffekt, was kosten hier so ein, was kosten hier so ein BME280. Das ist übrigens lustigerweise ist der Sensor, ist der Sensor für die Luftfeuchtigkeit und Temperatur das teuerste an dem ganzen Ding. Der kostet mehr als der als der Controller. Also der Sensor ist teurer als das ganze Board. Was kostet es bei Aliexpress? Schauen wir mal. Wenn man Amazon kauft, wenn man Amazon kauft, ist man bei ungefähr 10 Euro, ein bisschen mehr als 10 Euro für das Ding. Wenn man bei Aliexpress kauft, ist man bei 4,50 Euro. Bei Amazon ein bisschen mehr, bei Amazon ein bisschen eher bei 12 Euro. Amazon 12 Euro, Aliexpress 4,50. Wenn man jetzt mehr, wenn man jetzt ein paar Klimaanlagen hat, lohnt sich das tatsächlich. Kauft man sich drei Stück davon, drei Stück da. Was geben sie zuerst die fehlenden Informationen, was für eine Information fehlt hier? Was? Ah, welche ich nicht haben will, oder was? Ah jetzt. So, dann braucht man noch ESP32 NodeMCU oder irgendein ESP32. Ach, das ist wieder der Kram, der sich hier nicht wieder auswählen lässt. So, Black Pins, ja gelbe Pins. So, hier den Einkaufswagen. So, und dann brauchen wir zum Schluss noch. Na gut, Infrarot-LEDs würde ich nicht, das würde ich bei Amazon.de kaufen. Guck mal hier, 50er Pack, 50er Pack für 12 Euro, weil man kann die auch bei Aliexpress kaufen. Was kosten die da? ER-LED. Wie viel sind das? 100 Stück für 4 Euro. Das ist halt ein bisschen zu viel, aber was Anfahreres gibt es nicht. Die gibt es sogar noch billiger. 3,79, viel, 100 Stücke, viel. So, also, Moment. Was? Warum ist so viel Zeug immer im Warenkorb drin? Das habe ich doch überhaupt nicht reingelegt. Ah, ist das vom letzten Mal noch drinne, ne? Das ist vom letzten Mal noch drinne, wo wir im Stream probiert haben. So, also wenn man Aliexpress einkauft, ist man bei 20 Euro inklusive Versand, allerdings kann man damit 3 Klimaanlagen ausstatten und hat noch 97 Infrarot-LEDs übrig. Also, preislich ist das wirklich die günstigste Lösung und vor allem die beste Lösung, so wie ich das sehe, was die Features anbelangt. Ich meine, das kannst du alles mit dem anderen Zeug nicht machen. Du kannst diese ganzen Settings an der Klimaanlage mit den anderen Sachen nicht einstellen, die ich probiert habe. Und sprich, es bietet die meisten Settings für die Klimaanlage und man hat noch die Möglichkeit, Temperatur und Luftfeuchtigkeit auszulösen, das ist doch super. Da kann man sich nicht beschweren, das war echt erfolgreich heute mal. Zur Abwechslung. So Leute, was gibt es denn sonst noch Neues? Nachdem wir jetzt erstmal fertig sind mit dem Klimaanlagenzeug, habe ich irgendwelche Fragen übersehen. Wahrscheinlich, aber ich habe ja meine Fragen auf VM ausgeschaltet. Monka, Question. Pepega Board. Ja. Was? 3D Auto. Was? Ah, das ist was Auto macht. Also sprich, Auto macht so eine Mischung aus allem oder wie? Ich glaube, die habe ich sogar schon. Ja, die haben wir schon. Genau die. Die habe ich schon. Die ist auch Pock, wenn man mal eine Gartenschere braucht. Dann brauchst du einen 82 Widerstand. Okay. Ach was, das hält das alles aus. Ja, Emax habe ich mittlerweile aufgegeben. Ich habe es eine Weile mal verwendet, aber das war mir den Konfigaufwand nicht wert, weil ich bin jemand, der erst mal anfängt zu basteln. Ich will, dass es dann wirklich exakt das macht, wie ich es haben will und dann bastel ich ewig dran rum und Emax kannst du dich monatelang, jahrelang mit rum basteln. Das habe ich irgendwann sein lassen. Hast du eigentlich hingekriegt, BeatBroad, dass deine Badge-Geschichte funktioniert? Wie gesagt, das war nicht so einfach, das geht nicht so einfach hier, weil das mehrere Signale sind hier aufeinander aufbauen. Das hatten wir schon. Ja und die PS Vita-Flash ich auch mal. So, exzellent. Hat auch gut funktioniert. Leute, wir hatten lange keinen Stream mehr, der tatsächlich so von Anfang bis Ende, wo wir was gemacht haben und es einfach funktioniert hat. Ex, ja. Guck mal, Kyo-Kun ist auch da. Leider ein bisschen spät, weil ich bin jetzt mehr oder weniger fertig. Warum ist mal Minecraft wieder versandt? Das ist dann nur nur kostenlos, weil die halt wollen. Das ist halt irgendwie so ein Mindfactory-Marketing-Ding. Macht das aber nie, ich bezahle lieber die Versandkosten. Lustige Partys. Oh ja, mega lustige Partys AliExpress. Vor allem Sachen von AliExpress, die man sich in der Party in den Mund steckt, Alter. Da ist ja Corona vorprogrammiert. Nee, das ist ein neues Immort. Was empfiehlt uns denn AliExpress heute schön ist wieder. Erreichen Sie Top-Geschwindigkeiten. Shoppen Sie bei Baseus. Ey, was ist das überhaupt? Ein Netzteil, ein USB-Netzteil. Ja, Top-Geschwindigkeit, also die Geschwindigkeiten bei USB-Netzteilen sind absolut entscheidend. Kannst du was zu Plex? Du meinst Plex, oder? Plex? Du meinst Plex, oder? Du meinst Plex. Ist Plex nicht das Ding aus Mario? Dieser Yoshi-Ersatz? Mario? Plesi? Nee, Plesi ist es, nicht Plexi. Das komische Yoshi-Ersatz-Wasserreiter-Ding. Ach, du meinst das Admin-Panel. Ach so. Nee, kann ich nichts zu sagen. Jetzt weiß ich aber, was du meinst. Strahlend und leuchtend. Ah, exzellent. AliExpress ist mal wieder hier. Voll am Puls der Zeit. Wer sich mit eklichen Zangen rumschlagen will, kann Zangen bei AliExpress kaufen. Das Ding sieht schon so aus, als fällt es auseinander, Alter. Das Ding sieht wirklich schon so aus, als geht es gleich morgen kaputt. Oh, Werkzeug Pro. Alter, für 11 Euro? What the f... Ja, was denn jetzt? Trotzdem, billig Zeug. Würde ich mir im Leben nicht in China kaufen. Also Werkzeug ist so ein Ding, das... Elektronikzeug ist toll bei AliExpress zu kaufen, aber Sachen, die auch halten sollen... Eher nicht. Nutzt du öfters WSL im Alltag? Nee. Gar nicht. Wenn ich Linux verwende, verwende ich ein richtiges Linux. WSL verwende ich gar nicht. An sich finde ich WSL einen ganz guten Ansatz. Nachdem ja die ganze Shell-Geschichte unter Windows so verhunzt ist, und selbst PowerShell, PowerShell ist einfach keine gute interaktive Shell, PowerShell ist eine gute Automatisierung, Skripting-Geschichte, aber keine gute interaktive Shell, die holen jetzt ja erst langsam auf mit ihren neuen Kommandozeilen, mit ihrem neuen Terminal Fenster und ein bisschen Zeugs, aber ganz ehrlich, da liegen immer noch Welten zwischen einem Windows-Terminal und einem ordentlichen hier, was weiß ich, irgendeinem x-beliebigen Linux-Terminal-Programm mit ZSH und ordentlichen Sachen drauf. CMDA ist noch das, was am besten funktioniert, ja. Wobei, das musste einrichten, dass es mit WSL funktioniert, aber dann funktioniert es auch. Das Problem an CMDA ist, das kann keine advanceden Sachen, also das kann keine Farbcodes, keine richtigen und sonst was. Also das ist, das fühlt sich alles so gefrickelt unter Windows an. So nix halbes und nix ganzes. Am besten ist es wahrscheinlich immer noch, einen X-Server zu installieren und einen Gnome-Terminal oder so unter WSL zu betreiben. Wobei halt, grafische Programme unter WSL nicht so tolle sind, weil die Windows X-Server sacken. Weil X-Server an sich sacken alle, aber die Windows-Varianten sacken noch mehr. Also es geht, es geht für mich, Kommando-Zeilen-mäßig immer noch nix. Guck mal, hier Luftfeuchtigkeit geht hoch. Guck mal, wie warm es schon wieder ist, 28 Grad fast. Ok, das hängt jetzt auch neben am Rechner, das hängt jetzt auch neben am Rechner. Ich mach das mal anders, wartet mal, ich versuch das mal ein bisschen hoch zu hängen. 27,7. Das ist ganz schön warm hier drin. So, jetzt machen wir mal Klimaanlage an, mal gucken, wie schnell das runter geht. Klimaanlage 24 Grad. Schauen wir mal. Hab wegen dir damals meine Ausbildung zum Fachinformatiker System Integration angefangen. Also jetzt bin ich schon fast durch. Ja, das ist doch schön, wenn das bei dir gut funktioniert. Nice. Was machst du als Abschlussprojekt? Guck, schon geht es runter. Seht ihr, wie schnell das geht mit der Klimaanlage? Kaum ist die an, geht die Temperatur direkt runter und die Luftfeuchtigkeit geht hoch. Kann mir das einer erklären, warum geht die Luftfeuchtigkeit instant so schnell hoch, wenn die Klimaanlage an ist? Ja, das VSCO Terminal kann man auch verwenden. Allerdings, da braucht man eine ordentliche Shell für, das ist ja wirklich nur ein Terminal. Aber schön ist es nicht. Ah, jetzt geht es wieder runter. Hattest du den Sensor gerade in der Hand? Nö, der hängt hier mitten im Raum. Bisschen in die Richtung, wo die Klimaanlage hinpustet. Geht total schnell mit der Temperatur. Guckt mal hier, eben war es noch fast 28 Grad und jetzt sind wir schon bei 26 Grad. Also die Klimaanlage, die haut rein. Da gibt es nichts, das flutscht. Das ist klar, Wilhelm Kramer LP. Drei Stunden, nice. Ja, da ging ja das Stream fast passend für dich. Aber wie schnell die Klimaanlage kühlt, das kommt mir gar nicht so schnell vor, wenn ich in dem Raum sitze. Ich meine, die hat jetzt genau 2 Grad abgekühlt und geht noch weiter. Gibt es da eine Anleitung für dumme für was? Aber ich könnte mir vorstellen, wenn ich die Klimaanlage jetzt noch eine Weile anlasse, dass die Luftfeuchtigkeit immer weiter runter geht. Wenn sich das erstmal eingependelt hat auf der Temperatur, dass es dann anfängt weniger zu werden. Du meinst Anleitung für dumme hier, was ich hier gebaut habe? Ja, du kannst dir den Stream einfach im Wort angucken. Es ist wirklich ziemlich simpel. Ich meine, ich habe die Sachen so angeschlossen hier. Ja, wie auch immer. Post image. Ja, ich weiß jetzt gar nicht mehr, wo ich es habe. Ja, also ich habe einen Temperatursensor angeschlossen und eine Infrarot LED angeschlossen. Also eigentlich kein Hexenwerk. Und dann hier mal ein bisschen ausprobiert, wie man das Ganze bedient. Das ist ja nicht fertig. Ich habe nur geguckt, wie es geht. Ja, ich würde den Sensor gerne auf den Schrank legen, das geht aber nicht. Da muss ich nämlich Wlan einschalten und Wlan kann ich gerade nicht einschalten am Sensor, weil ich das Passwort nicht hier habe. Aber guck mal, wie schnell das kühlt, 3 Grad schon runter. Ich leg das mal ganz woanders hin. Ich leg das mal bei mir auf dem Schreibtisch. Ich leg das mal bei mir auf dem Schreibtisch. Gut, jetzt ist der Monitor. Oh, hier müsste jetzt gut sein. Hier ist gut. Ich denke jetzt hinter dem Monitor am Schreibtisch, da ist halt Abwärme vom Monitor. Toll. Ja, das liegt jetzt hier unten auf dem Rechner drauf. Ich leg das morgen auf den Schrank. Auf dem Schrank ist es am besten. Das ist so ein bisschen am Arsch der Welt. Jetzt geht die Temperatur hoch, weil es auf dem Rechner liegt. Jetzt muss ich es doch ein bisschen in die Luft hängen lassen. Ach, keine Ahnung, ist auch wurscht. Aber man sieht, dass die Klimaanlage echt schnell kühlt. Ich sag, das ging ja ratzfatz 2-3 Grad runter. Was kühlt da? Die Klimaanlage kühlt. Ich muss mir da einen ordentlichen Platz versuchen. Wie groß ist der Raum? Nicht so groß. Weiß nicht, wie viel Quadratmeter. Nicht groß. So ganz normal als Büro halt. Also Büro mit dem Schreibtisch, Sofa und Schrank und Zeug. Warum geht das jetzt so hoch da hinten? Das ist bestimmt die Abwärme vom Rechner. Ich lege es mal auf die Erd. Auf der Erd ist es am besten. Da wird nichts warm. Und die kalte Luft von der Klimaanlage ist auch unten auf der Erd. Ja, guckt, schon geht es ein bisschen weiter runter. Max, mach mal ein Prime95 an. Das gibt es doch nicht für einen ESP-35. Nein, nein, nein, nein. Kein Java-Eye. Hör mal auf. So, sehr schön. Leute, gibt es noch irgendwelche Questions? Weil, ich gehe jetzt gleich auf. Ja, ich lege es auf den Schrank. Ich lege das auf den Schrank. Weil, das passt nämlich. Auf dem Schrank habe ich Sicht auf die Klimaanlage für die Infrarot-LED zum Steuern. Und die Klimaanlage selbst pustet nicht auf den Schrank drauf. Das ist, glaube ich, der optimale Platz, um Luftfeuchtigkeit, Raumtemperatur und Klimaanlagensteuerung zu machen. Wie sollte denn so die Luftfeuchtigkeit sein? Ich meine, das liegt jetzt gerade auf der Erde, das Ding. So. Jetzt haben wir 43% Luftfeuchtigkeit. Das ist doch eigentlich okay. 50-60% ist für Arbeitsräume optimal. Okay, also es dürfte schon auch ein bisschen sein. Wobei ich mir jetzt halt auch vorstellen kann, wenn ich wirklich den ganzen Tag die Klimaanlage laufen habe, dann wird die Luftfeuchtigkeit wahrscheinlich noch runtergehen. Jetzt schwankt es ja auch ein bisschen. Ja. Soll ich mal, ich nehme mal den Sensor und halte ihn so weit, wie es geht. Wobei, nein, weiter kann ich ihn nicht halten. Da, wo die Klimaanlage hin pustet. Jetzt hängt er ein bisschen da, wo die Klimaanlage hin pustet. Guck, wird es auch gleich schon kühler. 24,9, 24,07. Wie gesagt, ich leg das auf den Schrank. Ich muss ja von dort aus sowohl Infrarotsicht auf die, also Sicht auf die Klimaanlage haben, als auch, dass es nicht so viel Luftzug hat. Haub auf dem Schrank ist eigentlich am besten. Ja, top. Okay Leute, wenn es nichts mehr gibt, gehe ich jetzt auf und ins Bett. Dann sehen wir uns vielleicht morgen wieder. Bis dann. T.O.! Mach es gut.", "segments": [{"id": 1, "start": 0.0, "end": 5.0, "text": "Wovon problem es dir insulinieren buying and using an Blizzard?"}, {"id": 2, "start": 35.0, "end": 64.08, "text": "Ich merke zwar keinen Lüfter, aber ich glaube, die ist auch an."}, {"id": 3, "start": 64.08, "end": 72.76, "text": "Ich zeige euch mal, was wir heute machen. Ich hatte heute nämlich eine absolut exquisite,"}, {"id": 4, "start": 72.76, "end": 94.16, "text": "5-Hat-Way-Too-Smart-Idee. Da platzt der Kopf. Clocks HD, ah ja, danke schön. Und zwar,"}, {"id": 5, "start": 94.16, "end": 100.84, "text": "ich zeige euch mal, was ich für eine Idee hatte. Richtig Big Brain. Oh na gut,"}, {"id": 6, "start": 100.84, "end": 105.04, "text": "wie Big Brain das ist, muss ich noch rausstellen, weil ich weiß nicht, ob es funktioniert. Vielleicht"}, {"id": 7, "start": 105.04, "end": 111.52, "text": "ist es auch Massive-Oi. Low Brain kann auch sein. Kann auch sein, dass es nicht funktioniert,"}, {"id": 8, "start": 111.52, "end": 116.2, "text": "aber ich habe die Vermutung, es ist Big Brain. Und zwar, was wir machen, ist folgendes. Also,"}, {"id": 9, "start": 116.2, "end": 120.28, "text": "ich kann euch sagen, wenn es funktioniert, dauert es wahrscheinlich gar nicht so lang. Wir bauen"}, {"id": 10, "start": 120.28, "end": 124.08, "text": "jetzt ja keine komplette Steuerung mit allem möglichen Zeug, sondern nur mal gucken,"}, {"id": 11, "start": 124.08, "end": 135.96, "text": "erstmal, ob es funktioniert. Hacker Man angesagt. Und zwar, also, ich habe, ihr wisst ja,"}, {"id": 12, "start": 135.96, "end": 142.32, "text": "dass ich eine Klimalage habe. Und zwar, ich habe die hier. Moment, ich habe eine Mitsubishi Heavy,"}, {"id": 13, "start": 142.32, "end": 156.12, "text": "ach du Scheiße. ZSS, irgendwas. Ich glaube, die hier, ich bin mir da jetzt aus dem Kopf"}, {"id": 14, "start": 156.12, "end": 164.0, "text": "nicht ganz sicher. Ich glaube, die hier habe ich. Zumindest, nicht ZSS, fast ZSS. Vielleicht"}, {"id": 15, "start": 164.0, "end": 170.88, "text": "muss ich die Musik mal ein bisschen leiser machen. Die Musik ist so cool, so abkühlungsmäßig. Das"}, {"id": 16, "start": 170.88, "end": 181.68, "text": "ist, by the way, richtig Low Brain Musik. Das ist eine Stunde Song of Storms. Wieder gesund. Ja,"}, {"id": 17, "start": 181.68, "end": 186.56, "text": "es geht wieder. Es geht wieder. Ich lasse das aber trotzdem mal doodeln. Ich finde,"}, {"id": 18, "start": 186.56, "end": 200.36, "text": "das strahlt irgendwie was Kühles aus. So, also, ich glaube, das Ding hier habe ich. Und ich"}, {"id": 19, "start": 200.36, "end": 207.44, "text": "habe ja schon mehrere Anläufe gemacht, das Ding irgendwie in meine Heimautomatisierung einzubinden."}, {"id": 20, "start": 207.44, "end": 215.32, "text": "Einfach so wirklich gut hat nichts funktioniert. Und zwar, es hat mir immer irgendwas gefehlt. Das"}, {"id": 21, "start": 215.32, "end": 224.92, "text": "erste, was ich mir gekauft habe. Moment, mal kurz was aufschreiben. So, genau. Also, das erste,"}, {"id": 22, "start": 224.92, "end": 234.28, "text": "was ich mir gekauft habe, war damals ein Z-Wave. Boah. Moment, ich muss nachgucken. Irgend so ein"}, {"id": 23, "start": 234.28, "end": 237.92, "text": "Z-Wave Steuerding für, das war aber noch zu Zeiten, wo ich keinen Plastenschimmer hatte,"}, {"id": 24, "start": 237.92, "end": 251.92, "text": "wie man sowas am besten macht. Hier, genau. Sowas hatte ich mir mal gekauft. Genau, das ist"}, {"id": 25, "start": 251.92, "end": 258.08, "text": "so ein, das ist ein Z-Wave Gerät, was angeblich alle möglichen Sorten von Klimaanlagen steuern"}, {"id": 26, "start": 258.08, "end": 263.28, "text": "kann. Aber ich habe es nicht hingekriegt damit. Also, an- und ausschalten geht. Rest funktioniert"}, {"id": 27, "start": 263.28, "end": 271.84, "text": "nicht. Also, für das, was der Kram gekostet hat, war das viel zu teuer und ziemlicher Crap. Das"}, {"id": 28, "start": 271.84, "end": 277.68, "text": "hat, glaube ich, 60 Euro oder irgendwie sowas gekostet. Also, viel zu, viel zu teuer eigentlich,"}, {"id": 29, "start": 277.68, "end": 283.56, "text": "der ganze Müll. Irgendwie sowas hier. Ja, zumindest von der Idee her war das ein ganz gutes Gerät,"}, {"id": 30, "start": 283.56, "end": 291.08, "text": "weil das geht über Z-Wave. Ich habe eh viel Z-Wave Geräte, aber die Features waren kacke. So,"}, {"id": 31, "start": 291.08, "end": 297.36, "text": "das nächste, was ich ausprobiert habe zum Klimaanlagensteuern, war ein ProdLink RM Pro"}, {"id": 32, "start": 297.36, "end": 307.92, "text": "oder so in der Richtung hieß das Teil. So eine, nee, RM Mini. So eine Dose. So, das war von der"}, {"id": 33, "start": 307.92, "end": 313.64, "text": "Theorie hier auch ganz gut. Das ist eine Kiste, die schließt an über das WLAN und dann kannst du"}, {"id": 34, "start": 313.64, "end": 319.68, "text": "Infrarot, da ist ein Infrarot-LED drin und du kannst Infrarotsachen schicken. Problem war nur,"}, {"id": 35, "start": 319.68, "end": 324.64, "text": "dass die Steuerungssoftware dafür zum größten Teil kacke war und das Gerät irgendwie teilweise"}, {"id": 36, "start": 324.64, "end": 330.16, "text": "nach einer Woche nicht mehr übers WLAN erreichbar war. Also auch Müll, auch totaler Müll. So,"}, {"id": 37, "start": 330.16, "end": 336.56, "text": "und heute habe ich zufälligerweise was gefunden, nee, stimmt nicht, das habe ich nicht heute"}, {"id": 38, "start": 336.56, "end": 343.32, "text": "gefunden, das habe ich gestern gefunden. Heute kam Amazon an und ich muss mal kurz noch andere"}, {"id": 39, "start": 343.32, "end": 361.0, "text": "Musik machen. Was machen wir hier an? Epic. Was haben wir hier? Legend of Zelda Morning Music."}, {"id": 40, "start": 361.0, "end": 374.64, "text": "Ah, yes. Ja, das ist schön. Das lasen wir jetzt. So, und gestern habe ich folgendes gefunden,"}, {"id": 41, "start": 374.64, "end": 379.8, "text": "nämlich das Projekt hier auf GitHub. Und dann habe ich mir so durchgelesen, was die alles für"}, {"id": 42, "start": 379.8, "end": 385.36, "text": "Klimaanlagen unterstützen und dann habe ich festgestellt, das müsste eigentlich ziemlich"}, {"id": 43, "start": 385.36, "end": 394.36, "text": "gut, das müsste eigentlich ziemlich gut in einer Klimaanlage funktionieren. Das ist eine Arduino"}, {"id": 44, "start": 394.36, "end": 399.88, "text": "Library, die allerdings auch von ESP32 geht. Die unterstützen allerdings offiziell meine"}, {"id": 45, "start": 399.88, "end": 409.24, "text": "Klimaanlage nicht. Die unterstützen ZJS, ZMS und ZMPS, allerdings nicht ZSS. Das ist absolut"}, {"id": 46, "start": 409.24, "end": 415.48, "text": "Big Brain Benamung von Mitsubishi wieder. Aber ich bin da mal hergegangen und habe mal gesucht"}, {"id": 47, "start": 415.48, "end": 425.64, "text": "bei dem Projekt auf GitHub und da ist mir aufgefallen, dass irgendeiner vor drei Jahren"}, {"id": 48, "start": 425.64, "end": 433.88, "text": "oder so hat einen Merchrequest aufgemacht, um meine Klimaanlage zu supporten. Und der"}, {"id": 49, "start": 433.88, "end": 438.04, "text": "Typ hat es gemercht, allerdings ist es nie im Master angekommen, sondern gammelt in seinem"}, {"id": 50, "start": 438.04, "end": 442.52, "text": "Dev Branch rum, was nicht so das Problem ist. Also das heißt, was wir jetzt heute machen"}, {"id": 51, "start": 442.52, "end": 450.36, "text": "ist folgendes, ich habe hier ein ESP32 liegen und ich habe die billigste Schaltung ever zusammengebaut,"}, {"id": 52, "start": 450.36, "end": 458.12, "text": "nämlich ein ESP32 und mit einer Infrarot-LED dran. Das Ganze sieht folgendermaßen aus,"}, {"id": 53, "start": 458.12, "end": 474.6, "text": "ich zeige euch das mal kurz. Wo habe ich mein Handy? Ach da, ich zeige euch mal kurz,"}, {"id": 54, "start": 474.6, "end": 480.4, "text": "wie das aussieht, das ist absolut Low Brain, das kann jeder selber machen. Ich zeige euch"}, {"id": 55, "start": 480.4, "end": 501.84, "text": "mal kurz die Bilder zu. Wie sieht die Klimaanlage aus? Also ich habe im Schlafzimmer, im Schlafzimmer"}, {"id": 56, "start": 501.84, "end": 509.12, "text": "so ein Ding, im Arbeitszimmer so ein Ding, außen an der Wand vom Haus hängt so ein Ding"}, {"id": 57, "start": 509.12, "end": 514.52, "text": "und halt für jede Sache eine Fernbedienung. Und das kommt uns gleich noch zugute mit der"}, {"id": 58, "start": 514.52, "end": 520.26, "text": "Fernbedienung, weil ich weiß, dass das Infrarot-Fernbedienungen sind, das heißt, das sollte prinzipiell auf"}, {"id": 59, "start": 520.26, "end": 524.68, "text": "jeden Fall funktionieren, die Frage ist, ob diese Library das Ganze steuern kann. So,"}, {"id": 60, "start": 524.68, "end": 533.0, "text": "also hier, Album. Also ich habe das billigste zusammengebaut, was irgendwie ging. Ich habe"}, {"id": 61, "start": 533.0, "end": 538.12, "text": "mir bei Amazon einen 50er-Pack Infrarot-LEDs gekauft, irgendwelche, ich habe keine Ahnung,"}, {"id": 62, "start": 538.12, "end": 546.28, "text": "ob die funktionieren. Das einzige, was ich geguckt habe, dass die nicht instant verrecken,"}, {"id": 63, "start": 546.28, "end": 558.56, "text": "das heißt, die haben, ne hier, die haben Betriebsspannung 2,7 bis 5,5 Volt. So, das sollte also in so"}, {"id": 64, "start": 558.56, "end": 563.24, "text": "einem ESP32 ohne Probleme funktionieren. Und ich habe jetzt nichts anderes gemacht, außer,"}, {"id": 65, "start": 563.24, "end": 568.92, "text": "also das ist wirklich, das ist in dem Fall alles. Ich habe einfach so einen Infrarot-LED"}, {"id": 66, "start": 568.92, "end": 572.52, "text": "genommen. Wie gesagt, kein Schwimmer, ob das klappt, ja. Also es kann durchaus sein, dass"}, {"id": 67, "start": 572.52, "end": 576.2, "text": "es gleich Monka smogt und das Ding durchbrennt. Also ich habe da auch keinen Widerstand oder"}, {"id": 68, "start": 576.2, "end": 584.72, "text": "irgendwas dran gemacht. Ich habe die Infrarot-LED genommen, auf einen GPIO-Pin gepackt, ich"}, {"id": 69, "start": 584.72, "end": 589.56, "text": "glaube, sieht man hier besser, auf einen GPIO-Pin gepackt und hier auf Ground gepackt. Fertig."}, {"id": 70, "start": 589.56, "end": 597.52, "text": "Kaselin fragt, Gäste WLAN mit WLAN ist da ein bisschen wenig für Projektarbeit. Kommt"}, {"id": 71, "start": 597.52, "end": 602.24, "text": "drauf an, was für ein Projekt. Wenn du Abschlussprojekt meinst, dann kommt es beim Abschlussprojekt"}, {"id": 72, "start": 602.24, "end": 605.64, "text": "weniger darauf an, dass du technisch nicht viel machst, sondern wie du das verkaufst."}, {"id": 73, "start": 605.64, "end": 612.72, "text": "Ja, Flow 690, da habe ich auch schon dran gehabt. Das iPhone filtert aber das Tablet,"}, {"id": 74, "start": 612.72, "end": 617.72, "text": "das Tablet kann es. Das Tablet kann es. Ich glaube, das iPhone kann es nicht. Also das"}, {"id": 75, "start": 617.72, "end": 622.72, "text": "ist die billigste Schaltung ever, die irgendjemand weltweit zusammengesteckt hat. Das kann man"}, {"id": 76, "start": 622.72, "end": 628.96, "text": "auch nicht mal Schaltung nennen. Wie gesagt, Ground, GPIO, ich glaube, 17 ist das und dann"}, {"id": 77, "start": 628.96, "end": 633.0, "text": "Infrarot-LED vorne dran. Also die Infrarot-LED ist hier, man sieht es nicht so richtig,"}, {"id": 78, "start": 633.0, "end": 639.52, "text": "aber da, guck da. Da ist die Infrarot-LED. Was natürlich sein kann ist, dass, wie gesagt,"}, {"id": 79, "start": 639.52, "end": 644.44, "text": "ich habe da keinen Widerstand und nichts dazwischen. Also was sein kann, dass das Ding durchbrennt."}, {"id": 80, "start": 644.44, "end": 651.88, "text": "Ihr wisst ja, ich bin nicht der allergrößte Elektronik-Pro. Das heißt auch, ich habe keinen"}, {"id": 81, "start": 651.88, "end": 654.28, "text": "Plastenschimmer, was ich ja überhaupt für einen Widerstand dazwischen machen müsste"}, {"id": 82, "start": 654.28, "end": 667.08, "text": "oder nicht. Also entweder geht es oder es brennt durch. Müssen wir mal scheinen. Müssen"}, {"id": 83, "start": 667.08, "end": 672.88, "text": "wir mal schauen, ja. Quatsch, Widerstand. Wo kommt man da hin? Also mit sowas fangen"}, {"id": 84, "start": 672.88, "end": 680.96, "text": "wir es gar nicht an. Was sind das für LEDs? Ah ja, wenn du das kannst, hier die da. Was"}, {"id": 85, "start": 680.96, "end": 685.4, "text": "für technische Daten, weiß ich nicht. Müssen wir mal hier gucken. Also der Pack ist das"}, {"id": 86, "start": 685.4, "end": 692.68, "text": "hier von Amazon. Sind 50 Stück, also ich glaube, 25 Empfänger und 25 Sender. Ich brauche"}, {"id": 87, "start": 692.68, "end": 707.16, "text": "nur Sender. Als Abschlussprojekt, du kannst das als Abschlussprojekt machen, Gäste WLAN,"}, {"id": 88, "start": 707.16, "end": 713.64, "text": "das ist kein Problem. Du musst halt nur gucken, wie du das Ganze verkaufst. Also wenn du einfach"}, {"id": 89, "start": 713.64, "end": 718.0, "text": "nur in dein Abschlussprojekt schreibst, ich richte ein Gäste WLAN, eine mit WLAN ist"}, {"id": 90, "start": 718.0, "end": 725.6, "text": "das nicht das Problem. Wenn du sowas schreibst wie Estellen Security Concept Gäste Zugang,"}, {"id": 91, "start": 725.6, "end": 730.16, "text": "kannst du dich total darüber auslassen und am Ende sagst du halt, ok, du machst ein abgeschottetes"}, {"id": 92, "start": 730.16, "end": 737.0, "text": "Gäste WLAN mit eigenem WLAN drunter und konfigurierst das richtig. Kannst du machen. Das ist alles"}, {"id": 93, "start": 737.0, "end": 743.28, "text": "nur eine Frage, wie man das der IHK verkauft. Ja, wenn du das als Estellen Security Concept"}, {"id": 94, "start": 743.28, "end": 749.52, "text": "Gäste WLAN verkaufst, kein Problem, funktioniert. Du kannst auch irgendwas sagen wie Anbindung,"}, {"id": 95, "start": 749.52, "end": 755.92, "text": "keine Ahnung von Schulungsraum, Außendien, irgendwas. Du musst halt ein bisschen was"}, {"id": 96, "start": 755.92, "end": 759.32, "text": "aus den Fingern saugen. Also du darfst der IHK nicht sagen, ich installiere einen WLAN"}, {"id": 97, "start": 759.32, "end": 764.2, "text": "mit ein bisschen WLAN unten drunter, sondern du musst der IHK irgendwas sagen, wo du halt"}, {"id": 98, "start": 764.2, "end": 770.12, "text": "als Ergebnis bekommst, dafür brauchen wir ein Gäste WLAN im Endeffekt. Und wenn du"}, {"id": 99, "start": 770.12, "end": 774.08, "text": "das hinkriegst, ist kein Problem. Wie gesagt, ich habe im Endeffekt als Abschlussprojekt"}, {"id": 100, "start": 774.08, "end": 780.08, "text": "auch nur einen OpenVPN eingerichtet. Das war's. Ja, was ich halt im Abschlussprojekt noch"}, {"id": 101, "start": 780.08, "end": 787.68, "text": "gemacht habe ist, ich habe ausgewählt zwischen IPSEC, OpenVPN und, ich weiß es schon gar"}, {"id": 102, "start": 787.68, "end": 794.72, "text": "nicht mehr, L2PT oder irgend so ein Crap. Zumindest, mir war von Anfang an klar, ich möchte OpenVPN"}, {"id": 103, "start": 794.72, "end": 802.16, "text": "machen und dann habe ich halt so eine Entscheidungsmatrix zusammen gefaked, dass halt OpenVPN gewinnt"}, {"id": 104, "start": 802.16, "end": 810.84, "text": "und dann habe ich OpenVPN. Was hast du bekommen? 95%? Achtung, pass auf, meine mündliche. Ja,"}, {"id": 105, "start": 810.84, "end": 819.76, "text": "95%. Aber ich hatte auch Bonus, weil die haben mir, wie gesagt, die haben meine Abschlussprüfung"}, {"id": 106, "start": 819.76, "end": 824.32, "text": "verloren. Ich glaube, die haben mir Bonuspunkte gegeben dafür, dass die mich morgens so geschockt"}, {"id": 107, "start": 824.32, "end": 827.88, "text": "haben. Na, ich habe es ja schon ein paar Mal erzählt, morgens an dem Tag, wo ich Prüfung"}, {"id": 108, "start": 827.88, "end": 832.2, "text": "hatte, hat mich die Frau von der IRK angerufen, hat gemeint, ich wäre durchgefallen. Da habe"}, {"id": 109, "start": 832.2, "end": 839.16, "text": "ich gemeint, das kann doch nicht sein, ich hatte doch überhaupt keine Prüfung. Und dann"}, {"id": 110, "start": 839.16, "end": 845.88, "text": "kam halt raus, sie haben meine Prüfung verloren. Aber die Story habe ich ja schon ein paar"}, {"id": 111, "start": 845.88, "end": 852.12, "text": "Mal erzählt jetzt. Mega cheap bait, Alter. Ich sage euch Leute, da hättet ihr auch doof"}, {"id": 112, "start": 852.12, "end": 856.84, "text": "geguckt, wenn am Tag der Prüfung euch die IRK anruft und sagt, ihr seid durchgefallen,"}, {"id": 113, "start": 856.84, "end": 863.84, "text": "obwohl ihr noch gar nicht bei der Prüfung war, da hättet ihr auch blöd geguckt. Also"}, {"id": 114, "start": 863.84, "end": 866.84, "text": "wie gesagt, Abschlussprojekt ist immer die Frage, wie du das Ganze verkaufst und dann"}, {"id": 115, "start": 866.84, "end": 871.2, "text": "funktioniert das auch. Glocks hat ihr an 11 Monate abonniert, ich weiß nicht, ob ihr"}, {"id": 116, "start": 871.2, "end": 882.64, "text": "das schon gesehen habt, aber Dankeschön für den Sub. So, Face Gesicht, 5 Monate, huge."}, {"id": 117, "start": 882.64, "end": 899.44, "text": "Subscription. Widerstand ist zwecklos, exakt. Äh ja, Chuspanelm. Chuspanelm sagt, will"}, {"id": 118, "start": 899.44, "end": 903.36, "text": "uns der Max gerade so BWL-mäßig erklären, dass man die Sachen nur gut verkaufen muss."}, {"id": 119, "start": 903.36, "end": 909.08, "text": "Ja, wenn du die IRK fragst, wird die IRK nämlich sagen, dass Fachinformatiker kein"}, {"id": 120, "start": 909.08, "end": 913.0, "text": "technischer, sondern ein kaufmännischer Beruf ist. Das ist kein Witz, das sagt die"}, {"id": 121, "start": 913.0, "end": 922.48, "text": "IRK wirklich. Kein Fachinformatiker fühlt sich als Kaufmann, außer Low Brains. Aber"}, {"id": 122, "start": 922.48, "end": 929.8, "text": "die IRK meint, das ist so. Wie verliert man sowas, wenn man die Abschlussprüfung hoch"}, {"id": 123, "start": 929.8, "end": 934.08, "text": "lädt und der Server crasht? Der Server von der IRK ist an 5 Minuten gecrashed, nachdem"}, {"id": 124, "start": 934.08, "end": 937.72, "text": "ich meine Abschlussprüfung hochgeladen hab und ja, meine Abschlussprüfung verloren."}, {"id": 125, "start": 937.72, "end": 951.48, "text": "Das ganze BWL geschwobbelt immer, ja. Ich bin letztes Jahr, ich bin auf der Arbeit eingeladen"}, {"id": 126, "start": 951.48, "end": 956.88, "text": "zu einem Moment, das muss ich euch vorlesen, ich kann mir so BWL-Kram nicht merken. Ich"}, {"id": 127, "start": 956.88, "end": 976.24, "text": "muss mal gucken, ob ich das anonymisieren muss irgendwie. Ich wurde eingeladen zu öffentliches"}, {"id": 128, "start": 976.24, "end": 986.2, "text": "Review-Ergebnisse vor Projekt, jetzt muss ich mir den Projektnamen ausdenken. Zeuss,"}, {"id": 129, "start": 986.2, "end": 991.68, "text": "keine Ahnung, ich hab mir den Projektnamen ausgedacht. So und das ist, jetzt pass mal"}, {"id": 130, "start": 991.68, "end": 999.28, "text": "auf Invitees, also Leute, die invited sind, 104 Leute sind dazu eingeladen. 104 Leute"}, {"id": 131, "start": 999.28, "end": 1006.92, "text": "hören sich irgendein BWL geschwobbelt an. So und zur Vorbereitung zu dieser Präsentation"}, {"id": 132, "start": 1006.92, "end": 1014.6, "text": "hängt daran ein PDF mit 120 Seiten Projektbeschreibung. Meint ihr wirklich, das liest irgendjemand?"}, {"id": 133, "start": 1014.6, "end": 1025.2, "text": "Hallo an die Runde, Sie alle haben als Stakeholder, Teammitglied oder Experte Anteil an unserem"}, {"id": 134, "start": 1025.2, "end": 1029.96, "text": "Vorprojekt genommen. Ich möchte Sie daher ganz herzlich zu diesem öffentlichen Review"}, {"id": 135, "start": 1029.96, "end": 1037.04, "text": "einladen. Aha, da freu ich mich ja schon wahnsinnig drauf. Da bin ich ja ganz scharf drauf. Ich"}, {"id": 136, "start": 1037.04, "end": 1043.2, "text": "glaub, da geh ich nicht hin. Das ist mal richtiges BWL-Geschwobbel dann. Also wenn ich noch nicht"}, {"id": 137, "start": 1043.2, "end": 1047.2, "text": "genug BWL-Geschwobbel habe, dann geb ich mir das mal ne Stunde, oder ich glaub ich"}, {"id": 138, "start": 1047.2, "end": 1056.4, "text": "sogar 3 Stunden oder irgendwie sowas, dann ist es vorbei. So, ähm, kommen wir mal. Das"}, {"id": 139, "start": 1056.4, "end": 1059.2, "text": "klingt nach einem exquisiten Event. Leute, habt ihr eigentlich gesehen, wir haben ein"}, {"id": 140, "start": 1059.2, "end": 1064.88, "text": "neues Emote über BetterTwitchTV. Way too smart. Das ist, wenn man im 5-Hat ist und"}, {"id": 141, "start": 1064.88, "end": 1085.84, "text": "es nach hinten losgeht. So, ähm, sobald ich im Chat nichts gesehen hab. Ja, also, auf geht's."}, {"id": 142, "start": 1085.84, "end": 1092.16, "text": "Wie gesagt, das ist meine Klimaanlage und ich hab dieses Projekt hier gefunden auf GitHub."}, {"id": 143, "start": 1092.16, "end": 1098.28, "text": "Das ist ne Arduino-Library, die allerdings auch für den ESP32 funktioniert und die unterstützen"}, {"id": 144, "start": 1098.28, "end": 1102.32, "text": "meine Klimaanlage nicht direkt, aber es gibt ne Merchrequest, wo das ganze drin ist. Das"}, {"id": 145, "start": 1102.32, "end": 1109.08, "text": "heißt, wir müssen vorher noch ein bisschen gucken, dass wir Git-mäßig das irgendwie"}, {"id": 146, "start": 1109.08, "end": 1114.6, "text": "gemercht kriegen. Müssen wir gleich mal schauen. Was viel interessanter ist, wie das ganze"}, {"id": 147, "start": 1114.6, "end": 1118.28, "text": "hier funktioniert. Ich hab's noch nicht ausprobiert, aber ich könnte mir vorstellen, dass es relativ"}, {"id": 148, "start": 1118.28, "end": 1123.52, "text": "simpel ist. Das Ding hat direkt ESP32-Support. Das heißt, wir müssen hier einfach nur den"}, {"id": 149, "start": 1123.52, "end": 1130.92, "text": "Pin angehen, in dem Fall GPIO17, wo das hier dran ist. Äh, was wird gebastelt? Äh, erklär"}, {"id": 150, "start": 1130.92, "end": 1135.2, "text": "ich gerade. Und zwar, ich hab ne Library gefunden, mit der man Mitsubishi-Klimaanlagen steuern"}, {"id": 151, "start": 1135.2, "end": 1139.68, "text": "kann. Ich hab ja die Klimaanlage hier und ich hab schon ein paar Anläufe unternommen,"}, {"id": 152, "start": 1139.68, "end": 1143.04, "text": "die Klimaanlage zu steuern, mit unterschiedlichen Sachen. Es hat nie richtig funktioniert und"}, {"id": 153, "start": 1143.04, "end": 1147.48, "text": "ich hoffe, mit dieser Library, bzw. mit was selbst gebasteltem funktioniert es jetzt"}, {"id": 154, "start": 1147.48, "end": 1153.36, "text": "richtig gut. Äh, hoff ich. Hoff ich mal. Äh, Infrarot. Ja, ja. Infrarot. So, und deswegen"}, {"id": 155, "start": 1153.36, "end": 1158.92, "text": "hab ich das billigste aller Zeiten zusammengebaut. Ich hab ne ESP32 genommen, ne Infrarot-LED."}, {"id": 156, "start": 1158.92, "end": 1167.0, "text": "Ähm, GPIO17-Ground. Fertig. Ohne Widerstand, ohne sonst was dazwischen. Das heißt, wahrscheinlich"}, {"id": 157, "start": 1167.0, "end": 1174.24, "text": "Monka smokes gleich. Müssen wir mal schauen. Aber ich glaube, ich glaube, dass die, dass"}, {"id": 158, "start": 1174.24, "end": 1181.24, "text": "der ESP32, die NodeMCU, dass das ein Widerstand auf den GPIO-Pins schon standardmäßig drauf"}, {"id": 159, "start": 1181.24, "end": 1186.56, "text": "hat, dass man sowas hier machen kann. Oder Flo96 hat ausgerechnet, mach mal den Chat"}, {"id": 160, "start": 1186.56, "end": 1192.92, "text": "auf, dass ich gleich gucken kann. Äh, by the way, ich muss mal hier mein Chat-Log starten."}, {"id": 161, "start": 1192.92, "end": 1205.92, "text": "Übersehe ich hier die Hälfte. Also Flo96 hat ausgerechnet. Durchlassspannung 1,5. Äh,"}, {"id": 162, "start": 1205.92, "end": 1211.84, "text": "durch 1,5 Volt Strom 100 mA. ESP hat 3,3 Volt, also Differenz 3,3 minus 1,5 Volt gleich"}, {"id": 163, "start": 1211.84, "end": 1217.36, "text": "1,8 Volt. 18, 18. Was zum Teufel? Ich hab kein 18 Ohm-Widerstand, wo soll ich den hernehmen?"}, {"id": 164, "start": 1217.36, "end": 1233.64, "text": "Ach komm, das Kabel hat bestimmt schon 18 Ohm, oder? So ein 2 cm Kabel. So, erstmal"}, {"id": 165, "start": 1233.64, "end": 1241.8, "text": "die ganzen Sachen wieder löschen. Flup. Dass ich meinen Chat mitgeloggt kriege. Äh,"}, {"id": 166, "start": 1241.8, "end": 1251.36, "text": "der Desktop, der Desktop ist der beste. Also wenn so besser ist, kann ich auch so lassen."}, {"id": 167, "start": 1251.36, "end": 1268.52, "text": "Ey, ich frage mich, so was auch mit dem Raspberry Pi geht. Bestimmt, bestimmt. Du musst halt"}, {"id": 168, "start": 1268.52, "end": 1273.68, "text": "irgendeine fertige Library finden, die auf Raspberry Pi lauffähig ist. Die hier sieht"}, {"id": 169, "start": 1273.68, "end": 1281.84, "text": "mir nach Arduino beziehungsweise irgendwie Arduino-kompatibel-only aus. Also, Flo96,"}, {"id": 170, "start": 1281.84, "end": 1291.24, "text": "was muss ich denn für einen Widerstand davor machen? Ich soll den Widerstand weglassen?"}, {"id": 171, "start": 1291.24, "end": 1296.0, "text": "Exzellent. So, machen wir das. Ich lass den Widerstand weg. Das war eh so geplant, ich"}, {"id": 172, "start": 1296.0, "end": 1305.2, "text": "seh keinen Widerstand mehr dazwischen gestöpselt. So, äh, machen wir mal die VM an. Flasht du"}, {"id": 173, "start": 1305.2, "end": 1311.0, "text": "mal deine PS Vita? Ja, hab ich vor. Hab ich doch letztens erst im Stream erzählt. Wollte"}, {"id": 174, "start": 1311.0, "end": 1315.44, "text": "ich schon lange mal machen. So, als erstes müssen wir uns mal dieses Repo hier klonen"}, {"id": 175, "start": 1315.44, "end": 1319.64, "text": "von dem Typ. Gut, äh, nochmal eine Frage an den Chat. Hat man verstanden, was ich vor"}, {"id": 176, "start": 1319.64, "end": 1328.6, "text": "hab? Also, nur mal ganz kurz gesagt. Ich hab einen ESP32 als Controller. Hier, das Teil."}, {"id": 177, "start": 1328.6, "end": 1340.4, "text": "ESP32 NodeMCU, GPIO17, ist eine Infrarot-LED dran. Hier ist Ground, hier ist GPIO17. Und"}, {"id": 178, "start": 1340.4, "end": 1348.12, "text": "das war's. Mehr gibt's nicht. Infrarot-LED und sonst nix. Also, das ist wirklich das"}, {"id": 179, "start": 1348.12, "end": 1352.52, "text": "unfancyigste an Schaltung, was es war. Das kann man nicht mal Schaltung nehmen, was es"}, {"id": 180, "start": 1352.52, "end": 1360.92, "text": "was nicht gibt. So, und wenn das funktioniert, dann sollte ich mithilfe dieser Library meine"}, {"id": 181, "start": 1360.92, "end": 1372.44, "text": "Klimaanlage steuern können. Das Ding unterstützt ESP32. Was es nicht unterstützt, ist meine"}, {"id": 182, "start": 1372.44, "end": 1376.12, "text": "Klimaanlage. Allerdings gab's ein uralt Pull-Request dafür. Deswegen müssen wir erstmal gucken,"}, {"id": 183, "start": 1376.12, "end": 1384.88, "text": "dass wir das Git technisch geregelt kriegen. Stream4M, Porgas. Was hier harte Seitenarbeit"}, {"id": 184, "start": 1384.88, "end": 1407.04, "text": "angesagter. Top 100 Nintendo Songs war mal ganz besser. Entspannender, nicht so. Okay,"}, {"id": 185, "start": 1407.04, "end": 1416.04, "text": "sehr gut. Also, wie viele Arduinos hast du? Ich hab gar keine Arduinos. Ich hab nur ESP286,"}, {"id": 186, "start": 1416.04, "end": 1426.36, "text": "ESP32 und ein paar tiny... Wie heißen die Dinger? Ja, so irgendwelche ganz billigen"}, {"id": 187, "start": 1426.36, "end": 1431.24, "text": "Dinger. So was in der Richtung hab ich noch ein paar, aber die verwende ich für nix."}, {"id": 188, "start": 1431.24, "end": 1437.92, "text": "Ich hab jede Menge ESP866, NodeMCUs. Da hab ich mir mal irgendwie ein 20er Packer gekauft."}, {"id": 189, "start": 1437.92, "end": 1445.72, "text": "Da hab ich massig rumliegen auch noch 20er D1 Minis, NodeMCU, alle möglichen Dinger."}, {"id": 190, "start": 1445.72, "end": 1452.4, "text": "Und dann hab ich noch ein paar ESP32 rumliegen. ESP32 Developer Boards, also so NodeMCU Boards"}, {"id": 191, "start": 1452.4, "end": 1457.48, "text": "hab ich nicht so viele. Da hab ich 3, 4 oder so noch übrig. Allerdings hab ich noch ein"}, {"id": 192, "start": 1457.48, "end": 1465.36, "text": "paar ultra low power ESP32 und ich hab mir erst letztens hiervon einen 10er Pack bestellt,"}, {"id": 193, "start": 1465.36, "end": 1472.36, "text": "weil ich finde das ist das beste ESP32 Board was es gibt. Das ist ultra klein. Das einzige"}, {"id": 194, "start": 1472.36, "end": 1479.04, "text": "Nachteil bei dem ESP32 Board ist, dass es nicht ganz so viele GPIOs hat wie eine NodeMCU,"}, {"id": 195, "start": 1479.04, "end": 1490.88, "text": "aber genug. Warum ich finde was das beste ESP32 Board ist, es ist ultra klein und es hat alle"}, {"id": 196, "start": 1490.88, "end": 1497.04, "text": "nötigen Sachen on Board. Und dazu kommt, dass es einen Anschluss hat für Batterie direkt"}, {"id": 197, "start": 1497.04, "end": 1501.04, "text": "und dass es optimiert ist für Low Power. Das heißt wenn ich Deep Sleep anmache schaltet"}, {"id": 198, "start": 1501.04, "end": 1505.44, "text": "das auch alles ab und es verbraucht so gut wie nix im Deep Sleep. Also es braucht unter"}, {"id": 199, "start": 1505.44, "end": 1510.16, "text": "20 micro Ampere im Deep Sleep. Das heißt es geht sogar an einer Batterie 1-2 Jahre lang."}, {"id": 200, "start": 1510.16, "end": 1522.92, "text": "Was warum nicht DenoMCU? Hab ich schon nie gehört. Was ist denn DenoMCU? Äh? Ach warum"}, {"id": 201, "start": 1522.92, "end": 1528.64, "text": "nicht Node? Ah ok ich hab den Witz nicht verstanden. Jetzt, jetzt. Hat ein bisschen gedauert. Hat"}, {"id": 202, "start": 1528.64, "end": 1538.36, "text": "ein bisschen gedauert, ja. DenoMCU. Deno wollte ich auch mal im Stream ausprobieren. Müssen"}, {"id": 203, "start": 1538.36, "end": 1543.72, "text": "wir mal schauen. So davon habe ich mir als letztes einen 10er Pack gekauft und ESP32"}, {"id": 204, "start": 1543.72, "end": 1548.92, "text": "habe ich auch noch ein paar. Heute nehme ich ein stinknormales NodeMCU Board. Das ist auch"}, {"id": 205, "start": 1548.92, "end": 1553.04, "text": "schon ein bisschen mitgenommen. Guck man sieht ja manche Pins sind schäpp. Und der USB Anschluss"}, {"id": 206, "start": 1553.04, "end": 1560.32, "text": "fällt ab wenn man zu heftig dran zieht. Wie steuerst du die ESP32 Board? Doch, doch die"}, {"id": 207, "start": 1560.32, "end": 1565.92, "text": "haben WLAN drauf. Das ist ja gerade das gute da dran. Die ESP32 und die ESP866 die haben"}, {"id": 208, "start": 1565.92, "end": 1570.4, "text": "alle WLAN. Das ist ja auch der Grund warum die Dinger sich so rasend schnell verbreitet"}, {"id": 209, "start": 1570.4, "end": 1577.64, "text": "haben. Und der ESP32 das ist eh, wenn man sich mal überlegt was da alles drin steckt"}, {"id": 210, "start": 1577.64, "end": 1583.76, "text": "ist das ein mega geiles Board. Wenn man sich, machen wir noch mal den da auf. Was hier alles"}, {"id": 211, "start": 1583.76, "end": 1589.64, "text": "drin steckt in diesem kleinen Fuzz Board. Also in dem ESP32, der ESP32 ist das da. Das"}, {"id": 212, "start": 1589.64, "end": 1598.96, "text": "die etwas größere Chip hier drauf. Der hat, der hat zwei Dualcore, also das ist fachsinnig"}, {"id": 213, "start": 1598.96, "end": 1605.36, "text": "zwei Dualcore. Da hat er Dualcore CPU drauf. Mit jeweils 240MHz. Eine Low Power CPU mit"}, {"id": 214, "start": 1605.36, "end": 1612.28, "text": "8MHz. Also sind quasi, wenn man ganz übertrieben sagt hat das Ding drei CPU Kerne. Eine ultra"}, {"id": 215, "start": 1612.28, "end": 1616.68, "text": "Low Power 8MHz. Den man allerdings mit ein bisschen Assembler programmieren muss. Was"}, {"id": 216, "start": 1616.68, "end": 1622.76, "text": "eklig ist. Das haben wir mal im Stream ausprobiert. Und zwei 240MHz CPUs. Also das Ding hat auch"}, {"id": 217, "start": 1622.76, "end": 1627.88, "text": "richtig Power. Also es gibt eigentlich kaum bessere Boards als in irgendeiner Art und"}, {"id": 218, "start": 1627.88, "end": 1633.8, "text": "Weise ESP32. Und die Dinger sind halt mega billig. Also wie gesagt die Tiny Pico sind"}, {"id": 219, "start": 1633.8, "end": 1642.24, "text": "ein bisschen, bisschen teurer. Weil halt besonders klein. Aber so ESP32 Note MCU. Der Kram kost"}, {"id": 220, "start": 1642.24, "end": 1663.08, "text": "nix. Die gehen einfach auf Aliexpress. Ähm, nein. Äh. Ein Cent? Die Dinger sind auch"}, {"id": 221, "start": 1663.08, "end": 1678.04, "text": "Arduino-kompatibel. Das heißt man kann auch Arduino-Libraries ähm verwenden, ja. Das"}, {"id": 222, "start": 1678.04, "end": 1688.56, "text": "ist, ach ein Stück höchstens pro Kunde. Versand. Ja das ist, das ist ein Schwachsinnangebot."}, {"id": 223, "start": 1688.56, "end": 1696.44, "text": "Was auch immer. Ne ne das würde ich kaufen. Lieber sowas hier. Das sieht besser aus."}, {"id": 224, "start": 1696.44, "end": 1710.52, "text": "Genau. Wenn man sich so Note MCU-kompatibles Board kauft. Hallo was ist der? Hä? Er zieht"}, {"id": 225, "start": 1710.52, "end": 1721.88, "text": "neukontenrabatt ab. Okay. Na gut wie dem auch sei. Also ihr kriegt für ungefähr 3, 3 Euro"}, {"id": 226, "start": 1721.88, "end": 1727.16, "text": "nen Board. Da kannst du dich echt nicht beschweren. Und wer nicht Aliexpress kaufen will, der kann"}, {"id": 227, "start": 1727.16, "end": 1733.68, "text": "sich auch hier was kaufen. Allerdings sind die ein bisschen teurer. Also hier bezahlste"}, {"id": 228, "start": 1733.68, "end": 1740.48, "text": "zum Beispiel das sind die ESP82. Hier bezahlste halt das dreifache für nen Board wie bei"}, {"id": 229, "start": 1740.48, "end": 1747.84, "text": "Aliexpress. Allerdings man kann sich durchaus so mal 3 Boards gönnen für 20 Euro. Das"}, {"id": 230, "start": 1747.84, "end": 1752.88, "text": "ist okay. Wenn man nicht lange warten will. Das ist halt dann morgen schon da im Endeffekt."}, {"id": 231, "start": 1752.88, "end": 1761.12, "text": "Ja. Also es schadet nichts. Wär da Interesse dran ein bisschen was zu programmieren. Ich"}, {"id": 232, "start": 1761.12, "end": 1764.68, "text": "würde aber auch 3 Stück nehmen, weil man hat einen mal auch relativ schnell kaputt gemacht."}, {"id": 233, "start": 1764.68, "end": 1769.4, "text": "Sei es das man zu stark am USB Anschluss zieht und den abbricht oder irgendwie aus Versehen"}, {"id": 234, "start": 1769.4, "end": 1774.52, "text": "mal drauf tritt oder irgendwie das Ding kurzschließt oder sowas. Die NodeMCUs sind schon relativ"}, {"id": 235, "start": 1774.52, "end": 1778.52, "text": "verträglich. Also die haben überall auch mal noch nen Widerstand mit dabei. Das ist"}, {"id": 236, "start": 1778.52, "end": 1783.72, "text": "nicht so. Die sind sowohl 3,3 Volt als auch 5 Volt tolerant. Also man kann eine NodeMCU"}, {"id": 237, "start": 1783.72, "end": 1787.24, "text": "nicht so schnell kaputt machen. Aber trotzdem wenn man nicht aufpasst gehts trotzdem mal"}, {"id": 238, "start": 1787.24, "end": 1792.24, "text": "recht schnell in die Hose. Das heißt ich würde immer nen Dreierpack kaufen. So. Aber jetzt"}, {"id": 239, "start": 1792.24, "end": 1798.36, "text": "fangen wir mal an mit dem ganzen ganzen Kram. Als erstes müssen wir uns das Gitrepo von"}, {"id": 240, "start": 1798.36, "end": 1805.44, "text": "dem Typ mal klonen. Und dann müssen wir das Comet raussuchen wo sie meine Klimaanlage"}, {"id": 241, "start": 1805.44, "end": 1810.68, "text": "aus Versehen drauf tritt. Ja kommt vor. Ich bin schon auf einige Elektronikdinger drauf"}, {"id": 242, "start": 1810.68, "end": 1832.36, "text": "gedreht. Oh. Huge. Ist das schlimmer als Lego Steine. Kommt drauf an auf welche Seite"}, {"id": 243, "start": 1832.36, "end": 1855.32, "text": "du trittst. Wenn du nicht auf die Pins drückst passiert nicht viel. Paper please. So. Wir"}, {"id": 244, "start": 1855.32, "end": 1865.6, "text": "machen erstmal nen Projekt für den Microcontroller. Dazu brauchen wir folgendes Addon. Wir können"}, {"id": 245, "start": 1865.6, "end": 1871.32, "text": "das mal wirklich machen jetzt weil ich glaube das es recht übersichtlich wird. Es ist irgendwie"}, {"id": 246, "start": 1871.32, "end": 1882.76, "text": "nicht gut abgemischt die Playlist. Mal zu laut mal zu leise. Da kann sie nicht entscheiden."}, {"id": 247, "start": 1882.76, "end": 1892.44, "text": "So wir machen das jetzt mal wirklich so dass das das das theoretisch jeder nachmachen"}, {"id": 248, "start": 1892.44, "end": 1898.64, "text": "könnte wenn er will. Also das hier zusammen stecken traue ich jedem zu. ESP32 nehmen und"}, {"id": 249, "start": 1898.64, "end": 1903.8, "text": "einfach hier ne zwei Jumperkabel und Infrarot LED dran stöpseln. Also das kriegt wirklich"}, {"id": 250, "start": 1903.8, "end": 1909.48, "text": "jeder hin. Das hätte meine Oma hingekriegt. Also wer das nicht hinkriegt da glaube ich"}, {"id": 251, "start": 1909.48, "end": 1914.44, "text": "wirds generell nicht so mit Technik. Das muss jeder hinkriegen sowas hier zusammenzustecken."}, {"id": 252, "start": 1914.44, "end": 1921.4, "text": "So und wie man das ganze programmiert ist relativ simpel dadurch dass die NodeMCUs nämlich"}, {"id": 253, "start": 1921.4, "end": 1924.64, "text": "schon so gut equipped sind dass die auch einen USB Anschluss mitbringen braucht man auch"}, {"id": 254, "start": 1924.64, "end": 1929.88, "text": "keinen großen Akt mehr zu machen mit Serial auf USB und dann irgendwelche Buttons drücken"}, {"id": 255, "start": 1929.88, "end": 1935.16, "text": "zum Flaschen und sowas in der Richtung einfach anstöpseln per USB und man kann das ganze"}, {"id": 256, "start": 1935.16, "end": 1940.08, "text": "flaschen. Jetzt ist natürlich die Frage ok wie programmier ich denn hier jetzt was für"}, {"id": 257, "start": 1940.08, "end": 1945.8, "text": "und dafür empfehle ich euch Wristle Studio Code und da gibt es ne Extension die nennt"}, {"id": 258, "start": 1945.8, "end": 1954.16, "text": "sich Platform IO und das ist das mit Abstand einfachste um die gängigen Microcontroller"}, {"id": 259, "start": 1954.16, "end": 1959.0, "text": "zu programmieren. Damit kann man eigentlich auch fast nichts mehr falsch machen."}, {"id": 260, "start": 1959.0, "end": 1973.48, "text": "So erstmal warten bis der Kram installiert ist. Sind da Compiler dabei? Ja es ist alles"}, {"id": 261, "start": 1973.48, "end": 1980.52, "text": "dabei. Es ist alles dabei. Du siehst ja ich installiert es jetzt das erste Mal. So wenn"}, {"id": 262, "start": 1980.52, "end": 1987.32, "text": "ihr das ganze installiert habt ploppt automatisch der Willkommen Screen von Platform IO auf"}, {"id": 263, "start": 1987.32, "end": 1991.76, "text": "und dann kann man sagen neues Projekt und jetzt muss man sein Board auswählen was man"}, {"id": 264, "start": 1991.76, "end": 2000.72, "text": "hat und ich hab nen ESP32 Node MCU. Framework wir wollen Standard Arduino Zeug verwenden"}, {"id": 265, "start": 2000.72, "end": 2015.08, "text": "Projekt keine Ahnung Klima Default Location anlegen fertig. So und schon können wir Sachen"}, {"id": 266, "start": 2015.08, "end": 2018.76, "text": "uploaden auf unseren Microcontroller. Ich muss den ganzen ich muss das allerdings jetzt"}, {"id": 267, "start": 2018.76, "end": 2033.4, "text": "mal anstöpseln weil ich hab das noch gar nicht angestöpselt. USB. Komm her. Schauen"}, {"id": 268, "start": 2033.4, "end": 2045.6, "text": "wir mal dass der Kram hier auch weitergeleitet sind die VMs das da? Was? Alter streiten"}, {"id": 269, "start": 2045.6, "end": 2054.32, "text": "sich schon meine VMs da drum? Wer es fressen darf? Audits Twitch Prime Dankeschön. Exzellent"}, {"id": 270, "start": 2054.32, "end": 2063.84, "text": "Subscription. So bla bla bla. Yes mir eigentlich vollkommen egal. So jetzt haben wir ein neues"}, {"id": 271, "start": 2063.84, "end": 2070.48, "text": "Projekt angelegt im Platform IO. Eine Sache die ich noch empfehlen kann wenn man Platform"}, {"id": 272, "start": 2070.48, "end": 2080.48, "text": "IO verwendet ist am Anfang einmal in die Settings gehen und bei den Platform IO Settings einstellen"}, {"id": 273, "start": 2080.48, "end": 2086.12, "text": "dass die Extension nur aktiviert wird wenn man ein Platform IO Projekt aufmacht weil"}, {"id": 274, "start": 2086.12, "end": 2092.84, "text": "ansonsten ploppt die Extension jedes mal auf wenn man Visual Studio Code aufmacht das will"}, {"id": 275, "start": 2092.84, "end": 2100.92, "text": "man nicht und jetzt ploppt die Extension nur noch auf wenn man eine Platform IO ein Platform"}, {"id": 276, "start": 2100.92, "end": 2110.44, "text": "IO Projekt aufmacht. So das ist jetzt komplett schon fertig. Platform IO macht das komplett"}, {"id": 277, "start": 2110.44, "end": 2115.48, "text": "vorkonfiguriert für ein das heißt das ist schon ein komplett fertiges Projekt wir können"}, {"id": 278, "start": 2115.48, "end": 2123.56, "text": "das jetzt mal beispielsweise machen wir schalten jetzt mal unsere serielle Ausgabe ein und"}, {"id": 279, "start": 2123.56, "end": 2133.76, "text": "dann schreiben wir in unserer Main Loop mal Print Loop oder so und dann sleepen wir mal"}, {"id": 280, "start": 2133.76, "end": 2140.36, "text": "für eine Sekunde. So und jetzt kann ich nämlich direkt hier aus der IDE schon raus sagen Upload"}, {"id": 281, "start": 2140.36, "end": 2144.12, "text": "und der connectet sich zum Controller und lädt das ganze hoch also viel einfacher geht"}, {"id": 282, "start": 2144.12, "end": 2151.56, "text": "das ganze nicht. Also viel simpler kann man das wirklich nicht mal machen. Ja es ist leider"}, {"id": 283, "start": 2151.56, "end": 2159.44, "text": "C++ achso man muss übrigens noch sagen Serial Ausgabe will ich mir angucken. So guck plopp"}, {"id": 284, "start": 2159.44, "end": 2164.36, "text": "also die krasseste Firmware aller Zeiten haben wir uns gerade programmiert die nichts anderes"}, {"id": 285, "start": 2164.36, "end": 2172.76, "text": "macht außer plopp auszugeben auf der seriellen Schnittstelle. So und jetzt nehmen wir uns"}, {"id": 286, "start": 2172.76, "end": 2180.6, "text": "das Projekt von GitHub das für die Klimaanlage kein C-Line nee C-Line funktioniert damit"}, {"id": 287, "start": 2180.6, "end": 2186.08, "text": "nicht so gut. Das habe ich schon mal ausprobiert es gibt für platformer.io gibt es einen C-Line"}, {"id": 288, "start": 2186.08, "end": 2191.84, "text": "Plugin das ist aber meilenweit hinter dem Mischel Studio Code Plugin. Übrigens by the"}, {"id": 289, "start": 2191.84, "end": 2215.76, "text": "way ne. Die Musee ist übel schlecht abgemischt. Was wollte ich jetzt sagen. Genau ich bin"}, {"id": 290, "start": 2215.76, "end": 2224.4, "text": "letztens ein bisschen am Go programmieren für mein Video. Also ich habe ja so eine Videoüberwachungsgeschichte"}, {"id": 291, "start": 2224.4, "end": 2230.28, "text": "programmiert wo man im Browser meine Security Kameras anzeigen lassen kann. Das habe ich"}, {"id": 292, "start": 2230.28, "end": 2233.76, "text": "euch ja schon mal gezeigt. Ich gucke mal ob ich euch noch mal zeige. Nee kann ich nicht"}, {"id": 293, "start": 2233.76, "end": 2256.6, "text": "da sieht man da ist Leak. Nee kann ich doch ich kann es euch zeigen. Muss ich aber schnell"}, {"id": 294, "start": 2256.6, "end": 2262.0, "text": "wieder zumachen. So hier da sieht man das Katzenklo da unten sieht man die Hofeinfahrt"}, {"id": 295, "start": 2262.0, "end": 2269.36, "text": "unten und sonst was. Gut was auch immer. Zumindest damit das funktioniert muss man ja irgendwie"}, {"id": 296, "start": 2269.36, "end": 2274.4, "text": "die Kameras abfragen. Das mache ich über FFmpeg und dann muss ich den ganzen Kram irgendwie"}, {"id": 297, "start": 2274.4, "end": 2278.96, "text": "per WebRTC in den Browser packen. Und das mache ich über eine Go Library. Straße liegt"}, {"id": 298, "start": 2278.96, "end": 2286.68, "text": "OMFG. Ja und dafür bin ich gerade ein bisschen am Go programmieren. Und ich sage euch eins"}, {"id": 299, "start": 2286.68, "end": 2292.16, "text": "Go in Visual Studio Code ist der größte Abfuck aller Zeiten. Prinzipiell funktioniert es"}, {"id": 300, "start": 2292.16, "end": 2300.28, "text": "allerdings ein Bug wenn man nämlich C und Go Interop macht was eh schon absolut hängen"}, {"id": 301, "start": 2300.28, "end": 2308.4, "text": "geblieben kompliziert und Performance im Arsch ist in Go aber das Visual Studio Code Go Plugin"}, {"id": 302, "start": 2308.4, "end": 2316.8, "text": "geht einfach kaputt wenn man C-Go programmiert. Das heißt es gibt zurzeit nichts außer Go"}, {"id": 303, "start": 2316.8, "end": 2323.12, "text": "Land was ich verwenden kann. Leider kann Go Land dann wiederum kein C richtig. Was auch"}, {"id": 304, "start": 2323.12, "end": 2327.96, "text": "immer es ist ein bisschen eklig. Aber ich brauche nicht viel Go und ich brauche auch"}, {"id": 305, "start": 2327.96, "end": 2333.68, "text": "nicht viel C in der Sache. Das sind so irgendwie 2-300 Zeilen die einfach nur die Interop machen"}, {"id": 306, "start": 2333.68, "end": 2340.08, "text": "zwischen WebRTC Library und FFmpeg. Das ist nicht so viel aber es ist trotzdem eklig"}, {"id": 307, "start": 2340.08, "end": 2349.16, "text": "und die kriegen es seit Monaten nicht hin. Ich kann euch sogar den Bug Report zeigen."}, {"id": 308, "start": 2349.16, "end": 2354.52, "text": "Es gibt keine, weil die Library für WebRTC die ich verwenden will in Go programmiert"}, {"id": 309, "start": 2354.52, "end": 2358.48, "text": "ist und es gibt nichts Vergleichbares für keine andere Programmiersprache sonst würde"}, {"id": 310, "start": 2358.48, "end": 2369.92, "text": "ich das nicht verwenden. Hier ist das Issue und da sind die schon seit einem Jahr oder"}, {"id": 311, "start": 2369.92, "end": 2379.24, "text": "so dabei. Da sind die seit einem Jahr dabei. Guck mal hier. Das ist November, ok das ist"}, {"id": 312, "start": 2379.24, "end": 2387.84, "text": "nur das Folge Issue. Die sind seit über einem Jahr dabei ihr Visual Studio Plugin zu fixen"}, {"id": 313, "start": 2387.84, "end": 2391.4, "text": "und das Visual Studio Plugin kann man nicht fixen, weil man irgendwie Änderungen im"}, {"id": 314, "start": 2391.4, "end": 2396.72, "text": "Go Language Server braucht. Ganz wirres Zeug Alter. Das ist eine Sache da muss man echt"}, {"id": 315, "start": 2396.72, "end": 2403.28, "text": "Microsoft und.NET loben..NET hat auch so ein paar Sachen wo ich mich frage muss das"}, {"id": 316, "start": 2403.28, "end": 2407.08, "text": "sein..NET ist zum Beispiel richtig eklig oder war in der Vergangenheit richtig eklig."}, {"id": 317, "start": 2407.08, "end": 2411.04, "text": "Wenn du viele Objekte zum Beispiel in irgendeinem Pasa hast oder wo du richtig viele Objekte"}, {"id": 318, "start": 2411.04, "end": 2422.08, "text": "erstellt. Da war.NET gerade mit garbage collection absolut eklig. Bei einer Sache muss man Microsoft"}, {"id": 319, "start": 2422.08, "end": 2431.56, "text": "aber echt loben. Ihr Tool Support ist das beste was ich kenne. Ich kenne keine Programmiersprache"}, {"id": 320, "start": 2431.56, "end": 2443.72, "text": "die besseren Developer Wohlfühl hat wie.NET. Mit Rider unter Linux ist es auch toll. Es"}, {"id": 321, "start": 2443.72, "end": 2449.04, "text": "gibt eigentlich kaum was besseres. Da kann Ruby einpacken, da kann Python einpacken, da"}, {"id": 322, "start": 2449.04, "end": 2453.16, "text": "kann Go einpacken, da kann Java einpacken, da kann C++ einpacken. Also das muss man wirklich"}, {"id": 323, "start": 2453.16, "end": 2460.96, "text": "sagen. Tool Geschichten und wie weich das einfach funktioniert ist.NET wirklich das"}, {"id": 324, "start": 2460.96, "end": 2472.0, "text": "beste was es gibt. Mono ist ja auch mal voll für den Arsch. Das einzige wofür ich in letzter"}, {"id": 325, "start": 2472.0, "end": 2478.68, "text": "Zeit Mono verwendet habe ist um auf dem Raspberry Pi Zero was laufen zu lassen. Weil da gibt"}, {"id": 326, "start": 2478.68, "end": 2486.84, "text": "es ja kein.NET Core für. Ja und NuGet und das kommt ja noch dazu. NuGet finde ich ist"}, {"id": 327, "start": 2486.84, "end": 2493.68, "text": "mit der Schwächste an diesem ganzen.NET Ökosystem. Weil die fünfmal das Paketformat geändert"}, {"id": 328, "start": 2493.68, "end": 2500.88, "text": "haben und wieder Dependencies gehandelt werden. Aber das heißt schon was wenn das das Schwächste"}, {"id": 329, "start": 2500.88, "end": 2509.28, "text": "ist. Aber die ganze was Autocompletion angeht, was CodeAssist angeht, was irgendwelche Compiler"}, {"id": 330, "start": 2509.28, "end": 2515.44, "text": "Warnungen. Guckt euch mal an wie toll die.NET Compiler Warnungen sind. Wenn du in.NET"}, {"id": 331, "start": 2515.44, "end": 2521.4, "text": "irgendeinen Scheiß programmierst, dann sagt dir in der Regel zu 95% sagt dir der Compiler"}, {"id": 332, "start": 2521.4, "end": 2531.68, "text": "irgendwas sinnvolles. Also wenn du zum Beispiel irgendwie ein Typ mit dem anderen zusammenhängen"}, {"id": 333, "start": 2531.68, "end": 2535.84, "text": "willst als String und das funktioniert nicht, dann sagt dir das der Compiler. Sagt dir hier"}, {"id": 334, "start": 2535.84, "end": 2541.52, "text": "Typ A und Typ B geht nicht und sowas. Bei C++ sieht die Fehlermeldung ungefähr so aus."}, {"id": 335, "start": 2541.52, "end": 2553.68, "text": "So ein paar Klammern hier noch drinnen. So das ist die C++ Fehlermeldung. Und anhand"}, {"id": 336, "start": 2553.68, "end": 2557.48, "text": "der C++ Fehlermeldung sollste dann irgendwie erkennen ah ok Typ A und Typ B funktioniert"}, {"id": 337, "start": 2557.48, "end": 2562.4, "text": "nicht zusammen. Das ist die C++ Fehlermeldung. Der.NET steht dann halbwegs was Gescheites"}, {"id": 338, "start": 2562.4, "end": 2572.28, "text": "drinne. Ruby und in Ruby steht immer drinne. Wie hieß es? Unknown. Ach fuck wie hieß der"}, {"id": 339, "start": 2572.28, "end": 2576.88, "text": "Standard Ruby Fehler nochmal? Method Unknown oder sowas steht da immer drinne in Ruby."}, {"id": 340, "start": 2576.88, "end": 2584.8, "text": "Und du fragst immer was willst du von mir? Ruby. Hab eine irrsinnige IT Support Frage"}, {"id": 341, "start": 2584.8, "end": 2590.52, "text": "an dich. Hast du einen Moment dafür? Ist echt kurios. Ja schieß los. Java geht auch. So"}, {"id": 342, "start": 2590.52, "end": 2597.4, "text": "wir müssen jetzt erstmal anfangen. Und zwar. Platformer hat das Projekt aufgesetzt. Wir"}, {"id": 343, "start": 2597.4, "end": 2605.96, "text": "gehen jetzt in diesen Library Ordner und klonen uns. Ups und klonen uns das Repo mit der Library"}, {"id": 344, "start": 2605.96, "end": 2612.08, "text": "drin die wir verwenden wollen. Sagen wir geht clone und danach wird es ein bisschen kompliziert"}, {"id": 345, "start": 2612.08, "end": 2620.4, "text": "weil wenn ich hier nach meiner Klimaanlage suche dann stelle ich fest es gibt einen Merch"}, {"id": 346, "start": 2620.4, "end": 2629.84, "text": "von 2017 der meine Klimaanlage supportet also als unterstützt hinzufügt in dieser Library."}, {"id": 347, "start": 2629.84, "end": 2636.32, "text": "Das witzige ist nur wenn man sich jetzt das Repo geklonet hat und da reingeht und sagt"}, {"id": 348, "start": 2636.32, "end": 2642.12, "text": "da mal Git log und sucht danach. Ups wenn man jetzt das Richtige noch sucht. Und sucht"}, {"id": 349, "start": 2642.12, "end": 2646.92, "text": "da mal danach damit man fest schon befindet nichts. Und dann schaut man mal ein bisschen"}, {"id": 350, "start": 2646.92, "end": 2652.6, "text": "genauer nach und stellt fest ok der Support wurde gemercht allerdings nur in den Dev Branche"}, {"id": 351, "start": 2652.6, "end": 2658.84, "text": "von dem Typ. Und das hat es nie in Master geschafft. Ich weiß nicht was er da gemacht"}, {"id": 352, "start": 2658.84, "end": 2665.36, "text": "hat. Deswegen werden wir jetzt mal folgendes machen wir machen mal Git log Dev. Und dann"}, {"id": 353, "start": 2665.36, "end": 2669.64, "text": "stellen wir fest ach guck mal hier da ist ja das Commit mit dem Support für meine Klimaanlage"}, {"id": 354, "start": 2669.64, "end": 2676.28, "text": "drin. Können wir uns mal den Diff angucken was der hier gemacht hat. ZS S guck hier Support"}, {"id": 355, "start": 2676.28, "end": 2682.36, "text": "für meine Klimaanlage drin in diesem Commit. So deswegen probieren wir jetzt mal was. Wir"}, {"id": 356, "start": 2682.36, "end": 2686.52, "text": "machen das was der Maintainer hätte eigentlich schon längst machen sollen. Wir nehmen den"}, {"id": 357, "start": 2686.52, "end": 2691.44, "text": "Dev Branche und merchen den mal nach Master und gucken ob das funktioniert. Eine Sache"}, {"id": 358, "start": 2691.44, "end": 2697.0, "text": "ist daran ein bisschen doof. Wir können danach wahrscheinlich Upstream nichts mehr verwenden"}, {"id": 359, "start": 2697.0, "end": 2702.0, "text": "aber was juckt es mich so lange meine Klimaanlage zu steuern ist es ok. Wir können es auch Cherry"}, {"id": 360, "start": 2702.0, "end": 2706.4, "text": "picken allerdings lohnt sich das in diesem Fall nicht so sehr weil es sind mehrere Commits."}, {"id": 361, "start": 2706.4, "end": 2710.76, "text": "Da sind hier ein paar Commits drin. Wir merchen den Kram einfach und mal gucken was dann rauskommt."}, {"id": 362, "start": 2710.76, "end": 2719.04, "text": "Also was was sagt der Chat hier. Chat hat gerade irgendwie noch was gefragt. Pass auf"}, {"id": 363, "start": 2719.04, "end": 2724.0, "text": "ich habe eine Batch Datei in die für mich Draw IO Crop Callt. Aha wenn ich diese Datei"}, {"id": 364, "start": 2724.0, "end": 2746.92, "text": "über CMD aufrufe dann klappt alles wunderbar. Wenn Latex Mk das über Pearl. Pearl Alter."}, {"id": 365, "start": 2746.92, "end": 2752.0, "text": "Die gleiche Batch Datei Callt heißt es BadOptionX. Was kurios ist wenn ich in der Batch Datei"}, {"id": 366, "start": 2752.0, "end": 2756.36, "text": "auch noch PVD Callt dann ist das Laufex Buchstabe groß wenn ich CMD Callt dann klein. Oh das"}, {"id": 367, "start": 2756.36, "end": 2767.64, "text": "ist Windows. Ich habe keinen Schimmer. Na gut BadOptionX. Es kann sein dass wenn man"}, {"id": 368, "start": 2767.64, "end": 2778.28, "text": "mit Pearl die Sachen öffnet man das die Argumente anders übergeben muss. Also wenn du in Bash"}, {"id": 369, "start": 2778.28, "end": 2785.16, "text": "was ausführst ist es ja einfach so und dann Option. Je nach Programmiersprache kann es"}, {"id": 370, "start": 2785.16, "end": 2797.4, "text": "durchaus sein dass es sowas ist wie OS Run. Keine Ahnung Bloop. Minus X. 1 2 3 so. Kann"}, {"id": 371, "start": 2797.4, "end": 2800.32, "text": "auch sein dass es in Pearl so ist. Ich habe ehrlich gesagt keinen platzen Schimmer ob"}, {"id": 372, "start": 2800.32, "end": 2806.84, "text": "das in Pearl so ist oder nicht. Weil ich verwende kein Pearl. So und ja man könnte das auch"}, {"id": 373, "start": 2806.84, "end": 2812.92, "text": "auf Rebase machen aber ich merge den Kram jetzt. So also probieren wir mal Git Merge"}, {"id": 374, "start": 2812.92, "end": 2820.72, "text": "Def. Äh ja. Und ich hoffe mal es wird nicht funktionieren es wird irgendwelche Merge"}, {"id": 375, "start": 2820.72, "end": 2828.68, "text": "Konflikte geben. Ha das war klar. Ok warum lässt sich der Kram nicht mergen? Weil das"}, {"id": 376, "start": 2828.68, "end": 2835.64, "text": "hier konfliktet. So README ist mir egal. FDTC HEATPUMP IR ist mir auch egal. Was mir nicht"}, {"id": 377, "start": 2835.64, "end": 2841.44, "text": "egal ist ist das hier. Weil das ist die Datei wo der Support für meine Klimaanlage drin"}, {"id": 378, "start": 2841.44, "end": 2847.76, "text": "ist. Das heißt wir müssen uns die Merge Konflikte jetzt mal angucken. Glücklicherweise mache"}, {"id": 379, "start": 2847.76, "end": 2850.72, "text": "ich den ganzen Tag auf der Arbeit fast nichts anderes als Merge Konflikte zu lösen. Das"}, {"id": 380, "start": 2850.72, "end": 2855.76, "text": "heißt ich kenne mich damit wenigstens aus. Wenn Git einen Merge Konflikt hat dann markiert"}, {"id": 381, "start": 2855.76, "end": 2860.96, "text": "er das ganze immer hier was miteinander konfliktet. Und an der Stelle möchte uns Git zum Beispiel"}, {"id": 382, "start": 2860.96, "end": 2869.16, "text": "mitteilen dass dieser Teil konfliktet mit diesem Teil. Das liegt meistens daran weil sich in"}, {"id": 383, "start": 2869.16, "end": 2873.16, "text": "der gleichen Datei in den gleichen Zeilen halt parallel was geändert hat. Es ist in"}, {"id": 384, "start": 2873.16, "end": 2879.16, "text": "dem Fall wohl auch so. Ähm. Und jetzt müssen wir den Konflikt irgendwie lösen. Konflikt"}, {"id": 385, "start": 2879.16, "end": 2883.08, "text": "lösen macht man indem man die Datei in den Zustand bringt wie sie am Ende eben aussehen"}, {"id": 386, "start": 2883.08, "end": 2890.12, "text": "soll. So und wenn ich mir das ganze hier so angucke würde ich sagen wir brauchen das"}, {"id": 387, "start": 2890.12, "end": 2904.84, "text": "obere nicht. Und wir brauchen komplett. Komplett das untere. So. Erster Merge Konflikt"}, {"id": 388, "start": 2904.84, "end": 2911.44, "text": "gelöst. Also übrigens richtig toller Hack. Git add und dann Windows Taste Punkt äh alt"}, {"id": 389, "start": 2911.44, "end": 2919.04, "text": "alt Punkt. Dann fügt ihr die letzte Datei ein die man geöffnet hat. Git Status. So"}, {"id": 390, "start": 2919.04, "end": 2924.88, "text": "ein Merge Konflikt haben wir gelöst. Nächster Merge Konflikt. Zum Glück ist das so einfach."}, {"id": 391, "start": 2924.88, "end": 2929.68, "text": "Zwei mal Proc map in einer Zeile. Hab ich mich verguckt. Kann sein dass ich mich verguckt"}, {"id": 392, "start": 2929.68, "end": 2939.88, "text": "hab. Wieso. Das eine ist Model das andere ist Info. Warum benutzt du kein Merge Tool"}, {"id": 393, "start": 2939.88, "end": 2949.84, "text": "weil ich äh Fan von von Raw Raw Wim bin in dem Fall. Ich finde es ganz ehrlich mit Merge"}, {"id": 394, "start": 2949.84, "end": 2956.8, "text": "Tool nicht so viel übersichtlicher als dass ich mich an die zusätzliche Bedienung von"}, {"id": 395, "start": 2956.8, "end": 2976.76, "text": "einem Merge Tool gewöhnen will. Das sieht doch eigentlich gut aus oder. Also Flo 690"}, {"id": 396, "start": 2976.76, "end": 2989.64, "text": "ich sehe da jetzt kein Problem drin. Das sieht gut aus. Das hier ist äh achso du meinst"}, {"id": 397, "start": 2989.64, "end": 3000.52, "text": "weil es zwei mal Proc map ist. Ne das passt. Ne. Oder ne. Du hast recht das sieht irgendwie"}, {"id": 398, "start": 3000.52, "end": 3014.48, "text": "komisch aus. Ja das sieht nicht richtig aus. Da gebe ich dir recht. Das sieht das sieht"}, {"id": 399, "start": 3014.48, "end": 3020.12, "text": "das sieht falsch aus ja. Das müsste wahrscheinlich eher sowas hier sein. Aber ich editier jetzt"}, {"id": 400, "start": 3020.12, "end": 3024.8, "text": "mal nicht. Drehe rum wir gucken einfach ob es funktioniert. Im Zweifelsfall ist es C++"}, {"id": 401, "start": 3024.8, "end": 3028.28, "text": "da wundert mich nichts wenn was funktioniert und mich wundert auch nichts wenn was nicht"}, {"id": 402, "start": 3028.28, "end": 3034.92, "text": "funktioniert. So also nächste Datei mal angucken ob es da irgendwelche Merge Konflikte gibt."}, {"id": 403, "start": 3034.92, "end": 3044.88, "text": "So da wollen wir auf jeden Fall das untere haben. Das ist nämlich die ID von meiner Klimaanlage"}, {"id": 404, "start": 3044.88, "end": 3059.68, "text": "ich habe hier eine Mitsubishi zss. Was brauchen wir hier. Hier brauchen wir beides. Wir brauchen"}, {"id": 405, "start": 3059.68, "end": 3073.04, "text": "die Klasse weil die Klasse erbt von der Klasse oder. Ne ne ne ne die Klasse erbt von der Klasse"}, {"id": 406, "start": 3073.04, "end": 3078.68, "text": "das heißt wir brauchen den ganzen Crap hier oben nicht. Sondern können das rausschmeißen"}, {"id": 407, "start": 3078.68, "end": 3086.42, "text": "bis auf hier unten. Rent nicht so gegen C++. Ich muss nicht gegen C++ renten C++ die qualifiziert"}, {"id": 408, "start": 3086.42, "end": 3100.68, "text": "sich schon selbst immer. So ich glaube das stimmt so. Jetzt Status. Add. Zack. Die Datei"}, {"id": 409, "start": 3100.68, "end": 3106.08, "text": "interessiert mich nicht die Datei interessiert mich nicht. Wenn man in a Merge ist bei Git"}, {"id": 410, "start": 3106.08, "end": 3110.48, "text": "und man irgendeinen Stand auschecken will von der Datei überschreiben will kann man"}, {"id": 411, "start": 3110.48, "end": 3115.6, "text": "einfach den Stand sagen und dann die Datei dahinter. Und jetzt nimmt er den aktuellen"}, {"id": 412, "start": 3115.6, "end": 3118.76, "text": "Master Stand weil ich habe kein Interesse die irgendwie Merge Konflikt zu lösen weil"}, {"id": 413, "start": 3118.76, "end": 3125.88, "text": "die brauche ich eh nicht. So und jetzt sagen wir Git commit und schon haben wir den Dev"}, {"id": 414, "start": 3125.88, "end": 3130.64, "text": "Branch von dem von dem Kerl zusammengeführt mit dem Master Branch und wir können das ganze"}, {"id": 415, "start": 3130.64, "end": 3136.48, "text": "verwenden. Jetzt müssen wir nur noch hoffen dass der Crap funktioniert. Das ist jetzt"}, {"id": 416, "start": 3136.48, "end": 3144.92, "text": "das eigentliche Problem. So. Die haben irgendwie ein Beispiel wie das ganze funktioniert das"}, {"id": 417, "start": 3144.92, "end": 3155.04, "text": "habe ich mir nämlich im Vorfeld schon angeguckt. Das probieren wir jetzt mal aus. So. Das er"}, {"id": 418, "start": 3155.04, "end": 3160.96, "text": "ist. So. Bevor wir irgendwas an die Klimaanlage senden. Gucken wir erst mal ob das richtige"}, {"id": 419, "start": 3160.96, "end": 3165.88, "text": "Modell und alles ausgibt. By the way. Bevor ich jetzt weitermache mit der Klimaanlage"}, {"id": 420, "start": 3165.88, "end": 3172.24, "text": "habt ihr schon mal eine neueste Errungenschaft gesehen. Das ist das Werkzeug was ich mir"}, {"id": 421, "start": 3172.24, "end": 3175.8, "text": "letztens im Stream bestellt habe bis heute angekommen. Oder was ich im Stream rausgesucht"}, {"id": 422, "start": 3175.8, "end": 3188.6, "text": "habe. Ich sag euch. Exzellent. Das macht richtig Spaß das Zeug. Nicht dass man das täglich"}, {"id": 423, "start": 3188.6, "end": 3195.16, "text": "brauchen würde. So irgendwelche. Wie heißt das eigentlich Maul Schlüssel oder so. Aber"}, {"id": 424, "start": 3195.16, "end": 3199.64, "text": "wenn man sie mal braucht dann sind das hier nur nur vom feinsten. Und übrigens diese"}, {"id": 425, "start": 3199.64, "end": 3205.92, "text": "Rohrzange hier oben ist auch toll. Da kann man nämlich hier auf den Knopf drücken. Der"}, {"id": 426, "start": 3205.92, "end": 3210.44, "text": "ist falsch rum drinnen. Den habe ich rausgenommen und falsch rum wieder reingesteckt. Das sieht"}, {"id": 427, "start": 3210.44, "end": 3218.4, "text": "auf der anderen Seite genauso aus. Die Rohrzange ist übrigens ganz besonders toll weil die"}, {"id": 428, "start": 3218.4, "end": 3221.92, "text": "kann man die hat hier so einen Knopf und kann man nach unten drücken. Da kann man die quasi"}, {"id": 429, "start": 3221.92, "end": 3225.92, "text": "mit einer Hand die Größe sliden. So leicht geht das und dann lässt man den Knopf los"}, {"id": 430, "start": 3225.92, "end": 3233.6, "text": "und dann ist er wieder fest. Das ist wirklich top. Und hier unten ist die Ratsche mit Ratschenfunktion"}, {"id": 431, "start": 3233.6, "end": 3239.48, "text": "da kannst du hier dann quasi drehen dran. Richtig richtig richtig nice. Viel zu teuer"}, {"id": 432, "start": 3239.48, "end": 3246.56, "text": "aber gutes Werkzeug kann man nie genug haben. Und so langsam aber sicher ist meine Werkzeug"}, {"id": 433, "start": 3246.56, "end": 3253.92, "text": "Sammlung ich will nicht sagen komplett. Komplett ist es nie. Ja tschüss mein Name genau. Aber"}, {"id": 434, "start": 3253.92, "end": 3257.68, "text": "ich habe jetzt so langsam aber sicher alles was man irgendwie braucht. Einzige was ich"}, {"id": 435, "start": 3257.68, "end": 3262.32, "text": "noch brauche ist ein ordentliches Teppichmesser so ein ordentliches Cuttermesser. Da habe ich"}, {"id": 436, "start": 3262.32, "end": 3268.6, "text": "nämlich nichts gescheites wo ich auch die Klinge gescheit wechseln kann. Und was ich"}, {"id": 437, "start": 3268.6, "end": 3274.76, "text": "auch noch gerne hätte wären so ein kleines Skalpell wo man Sachen mit auspacken kann"}, {"id": 438, "start": 3274.76, "end": 3284.64, "text": "bzw Sachen zurecht schneiden kann oder sowas. Was kosten die 160€ viel zu teuer. Viel viel"}, {"id": 439, "start": 3284.64, "end": 3291.36, "text": "zu teuer das ist Werra ja. Aber die haben auch günstigere. Die haben auch günstigere."}, {"id": 440, "start": 3291.36, "end": 3298.4, "text": "Shroud kommt wieder auf Twitch echt. Poggers. Ich gucke zwar nicht Shroud aber finde ich"}, {"id": 441, "start": 3298.4, "end": 3302.24, "text": "immer gut wenn er wieder kommt. Seit Overwatch League von Twitch weg ist habe ich davon gar"}, {"id": 442, "start": 3302.24, "end": 3307.16, "text": "nichts mehr mitgekriegt. Ich habe jetzt mitgekriegt dass DrDisrespect und Ninja jetzt irgendwie"}, {"id": 443, "start": 3307.16, "end": 3311.56, "text": "auf YouTube streamen. Juckt mich überhaupt nicht. Aber gerade für DrDisrespect ist es"}, {"id": 444, "start": 3311.56, "end": 3317.28, "text": "glaube ich ganz gut weil der Kerl ist so krass Mainstream mittlerweile. Also nicht der bekannt"}, {"id": 445, "start": 3317.28, "end": 3321.92, "text": "halt einfach. Dass YouTube vielleicht sogar die bessere Plattform ist weil einfach der"}, {"id": 446, "start": 3321.92, "end": 3335.64, "text": "Mainstream und die 0815 Casuals eben auf YouTube sind. Zumindest es lohnt sich nicht wirklich"}, {"id": 447, "start": 3335.64, "end": 3341.12, "text": "den Preis dafür auszugeben. Aber die haben auch noch eine kleinere Variante. Die haben"}, {"id": 448, "start": 3341.12, "end": 3347.2, "text": "drei Sets. Die haben einmal die einfache Variante ohne diese Auflage und ohne die Ratschenfunktion."}, {"id": 449, "start": 3347.2, "end": 3352.92, "text": "Die kosten dann wahrscheinlich nur 70 Euro oder so. Dann gibt es die mit Auflage und"}, {"id": 450, "start": 3352.92, "end": 3359.64, "text": "Ratschenfunktion für 160 und es gibt es ganz abgedrehte mit Winkel und hin und her umschaltbare"}, {"id": 451, "start": 3359.64, "end": 3364.52, "text": "Ratschenfunktion für 270 Euro. Aber das war mir dann doch zu viel für ein paar Schlüssel."}, {"id": 452, "start": 3364.52, "end": 3369.84, "text": "By the way Leute. DrDisrespect. Ich habe es gesagt Leute im Stream. Ihr wollt mir das"}, {"id": 453, "start": 3369.84, "end": 3374.68, "text": "nicht glauben. Ich habe gesagt das wahrscheinlichste ist nach allem dem was wir wissen ein Plattform"}, {"id": 454, "start": 3374.68, "end": 3379.52, "text": "Wechsel. Und alle der ganze Chat wieder. Mach es im Leben kein Plattform Wechsel. Niemals"}, {"id": 455, "start": 3379.52, "end": 3384.52, "text": "Plattform Wechsel. Guck dir mal den Stream mal wieder geendet ist. Niemals im Leben Plattform"}, {"id": 456, "start": 3384.52, "end": 3388.4, "text": "Wechsel kann überhaupt nicht sein. Und ich habe weiterhin drauf bestanden habe ich gesagt"}, {"id": 457, "start": 3388.4, "end": 3393.84, "text": "Leute. In Anbetracht der Tatsache dass wir nichts wissen und bei allem anderen so viele"}, {"id": 458, "start": 3393.84, "end": 3399.8, "text": "Annahmen treffen müssen ist Plattform Wechsel nach wie vor das wahrscheinlichste. Und Chat."}, {"id": 459, "start": 3399.8, "end": 3405.48, "text": "Wer hatte Recht. Es ist ein Plattform Wechsel. Ob der Plattform Wechsel jetzt natürlich von"}, {"id": 460, "start": 3405.48, "end": 3409.8, "text": "Anfang an geplant war wage ich mal zu bezweifeln. Da ist auf jeden Fall zwischen ihm und Twitch"}, {"id": 461, "start": 3409.8, "end": 3415.72, "text": "was gelaufen. Aber im Endeffekt unterm Strich ist es Plattform Wechsel gewesen. Ich hatte"}, {"id": 462, "start": 3415.72, "end": 3423.24, "text": "Recht. Ich wollte es jetzt nur noch mal hervorheben. Weil mich der Chat so ausgebadet hat. Also"}, {"id": 463, "start": 3423.24, "end": 3429.92, "text": "nach dem kann überhaupt nicht sein Max. Niemals niemals. Guck dir wie ruhig der Chat auf einmal"}, {"id": 464, "start": 3429.92, "end": 3440.28, "text": "ist wenn man jetzt erzählt dass sie Mist erzählt haben. Chat. Ja aber das war echt Marketing"}, {"id": 465, "start": 3440.28, "end": 3447.4, "text": "Move. Keiner mag Klugscheiße. Ja vor allem mag keiner Leute die so tun als wüssten"}, {"id": 466, "start": 3447.4, "end": 3452.64, "text": "das. Das war ja gerade bei Doktor Disrespect so geil. Da war irgendwie der Slasher am Start"}, {"id": 467, "start": 3452.64, "end": 3462.4, "text": "so nach dem Motto Twitter. Twitch größtes gehütetes Geheimnis aller Zeiten und ja ich"}, {"id": 468, "start": 3462.4, "end": 3467.76, "text": "weiß es aber ich sag es euch nicht und keiner bei Twitter sagt es. Da kamen doch irgendwelche"}, {"id": 469, "start": 3467.76, "end": 3472.28, "text": "anderen Leute die gesagt haben ich hab mit ihm gesprochen. Alles Blödsinn. Alles Schwachsinn."}, {"id": 470, "start": 3472.28, "end": 3480.4, "text": "Als wüsste Slasher das. Was geht los. Also wir haben den Kram gemercht. Das passt. Wir"}, {"id": 471, "start": 3480.4, "end": 3488.28, "text": "haben jetzt theoretisch eine Library die meine Heizung unterstützt. Das heißt probieren"}, {"id": 472, "start": 3488.28, "end": 3498.64, "text": "wir jetzt mal was hier. Include mit so Bishy. Ja. Heavy. Nee. Welche Datei brauche ich denn"}, {"id": 473, "start": 3498.64, "end": 3511.24, "text": "überhaupt. Welche. Welche Datei brauche ich. Welcher Datei hat er das eigentlich gemacht."}, {"id": 474, "start": 3511.24, "end": 3530.28, "text": "Ja. Ja. Nee. Mit so Bishy Heavy Heatpump IR. Okay. Mit so Bishy Heavy Heatpump IR. Alles"}, {"id": 475, "start": 3530.28, "end": 3538.8, "text": "klar. So dann schauen wir mal wie sieht das Beispiel von denen aus. Wie geht das mit"}, {"id": 476, "start": 3538.8, "end": 3550.76, "text": "dem ESP32. Da stand doch hier irgendwo drinnen. ESP32 hier. IR Sender ESP32. Und da muss"}, {"id": 477, "start": 3550.76, "end": 3555.92, "text": "man jetzt angeben an welchen Pin man das ganze gestöpselt hat. Und Pin ist der hier bei"}, {"id": 478, "start": 3555.92, "end": 3562.42, "text": "mir. Also da hier da Pin. Das ist GPIO 17. Sieht man jetzt nicht. GPIO Nummern stehen"}, {"id": 479, "start": 3562.42, "end": 3566.72, "text": "unten drunter. Hast du an der Klimaanlage was verändern müssen. Nein. Das ist ja gerade"}, {"id": 480, "start": 3566.72, "end": 3572.84, "text": "das Gute daran. Dass der die offiziellen IR Codes quasi nachprogrammiert hat. Ach ja"}, {"id": 481, "start": 3572.84, "end": 3580.04, "text": "und der Grund. Irgendjemand hat gefragt warum man nicht die Fernbedienungs Codes lernen"}, {"id": 482, "start": 3580.04, "end": 3588.76, "text": "kann. Das liegt daran. Also es gibt ja so ein paar einfache IR Systeme. Da geht das."}, {"id": 483, "start": 3588.76, "end": 3592.28, "text": "Zum Beispiel wenn man eine Fernsehfernbedienung hat und so eine Universalfernbedienung anlernt"}, {"id": 484, "start": 3592.28, "end": 3599.48, "text": "und so was. Warum das hier nicht geht ist folgendes. Die Klimaanlage schickt ziemlich"}, {"id": 485, "start": 3599.48, "end": 3606.64, "text": "viel State also nein Schwachsinn. Die Fernbedienung schickt ziemlich viel State mit an die Klimaanlage"}, {"id": 486, "start": 3606.64, "end": 3611.76, "text": "und das ist auch nicht nur ein Signal sondern das sind mehrere Signale die aufeinander"}, {"id": 487, "start": 3611.76, "end": 3617.2, "text": "aufbauen. Das heißt das kann man nicht lernen mit einer Universalfernbedienung. Das ist"}, {"id": 488, "start": 3617.2, "end": 3623.36, "text": "quasi ein eigenes Protokoll was halt Infrarot als Transport verwendet. Das ist nicht einfach"}, {"id": 489, "start": 3623.36, "end": 3629.16, "text": "irgendwie ein Infrarotsignal wo man quasi sagen kann ok das ist an das ist aus. Das"}, {"id": 490, "start": 3629.16, "end": 3634.84, "text": "ist ein recht komplexes Protokoll und das hat der Typ halt für die Klimaanlage nachgebaut."}, {"id": 491, "start": 3634.84, "end": 3645.64, "text": "Deswegen geht das nicht so einfach mit IR Codes lernen. So wir sind auf GPIO 17 und"}, {"id": 492, "start": 3645.64, "end": 3651.36, "text": "jetzt machen wir einfach mal das Demoprogramm und gucken ob das Scheiß funktioniert. Was"}, {"id": 493, "start": 3651.36, "end": 3660.6, "text": "ich nicht weiß ist wie hell diese Infrarot-LED ist und welchen Winkel diese Infrarot-LEDs"}, {"id": 494, "start": 3660.6, "end": 3668.52, "text": "haben. Also sprich es könnte sein dass das direkt vor dem Gerät hängen muss. Es könnte"}, {"id": 495, "start": 3668.52, "end": 3676.52, "text": "sein dass es irgendwie durch das halbe Stockwerk geht mit Sichtkontakt. Es könnte sein dass"}, {"id": 496, "start": 3676.52, "end": 3681.04, "text": "es direkt drauf ausgerichtet werden muss oder nicht. Ich habe keine Ahnung und das steht"}, {"id": 497, "start": 3681.04, "end": 3689.76, "text": "hier auch nicht dabei was die für einen Winkel haben und sowas. Hier 20 Meter im Leben nicht."}, {"id": 498, "start": 3689.76, "end": 3701.36, "text": "Also müssen wir mal. Müssen wir mal schauen. Müssen wir mal ausprobieren. So also Demo"}, {"id": 499, "start": 3701.36, "end": 3708.56, "text": "das haben wir. Wir copypasten einfach mal die Demo. So das brauchen wir alles. Den ganzen"}, {"id": 500, "start": 3708.56, "end": 3714.88, "text": "Mist brauchen wir nicht. Wir brauchen nur eine Mitsubishi Heavy SM. Das ist meine Klimaanlage."}, {"id": 501, "start": 3714.88, "end": 3725.6, "text": "By the way warum machen wir so ein komisches Array? Das brauchen wir doch gar nicht. C++"}, {"id": 502, "start": 3725.6, "end": 3747.68, "text": "ich muss mich konzentrieren. C++ Auto. Auto Auto. Device sowas. 20 Meter brauche ich auch"}, {"id": 503, "start": 3747.68, "end": 3757.84, "text": "nicht. So Mitsubishi Heavy Device. So wie geht es weiter? Serial Begin. Ok das ist ziemlich."}, {"id": 504, "start": 3757.84, "end": 3766.32, "text": "Ja gut wir copypasten einfach mal den Standard. Die Eindrückung ist merkwürdig irgendwie."}, {"id": 505, "start": 3766.32, "end": 3776.12, "text": "Ich mag ja persönlich zwei Spaces anstatt vier Spaces. Aber Visual Studio Code ist"}, {"id": 506, "start": 3776.12, "end": 3784.12, "text": "der Meinung gibt es nicht. Und wenn das Visual Studio Code meint hast du keine Chance. Muss"}, {"id": 507, "start": 3784.12, "end": 3799.28, "text": "man irgendwie die Zetix umstellen. Ja ich habe zwei Spaces eingestellt aber der C++ Formatter"}, {"id": 508, "start": 3799.28, "end": 3817.08, "text": "ist der Meinung er autoformatet auf vier Spaces. Ist mir wurscht ganz ehrlich ich kann damit"}, {"id": 509, "start": 3817.08, "end": 3822.2, "text": "leben. Ich kann es aber einfach auf vier Spaces stellen. Ah ne kann ich nicht. Wir können"}, {"id": 510, "start": 3822.2, "end": 3831.56, "text": "damit leben dann ist es halt doppelt eingerückt. Ok weiter gehts. Heatpump Model. Ok ok ok"}, {"id": 511, "start": 3831.56, "end": 3836.2, "text": "wir lassen uns erstmal das Modell von der Klimaanlage ausgeben. Da schauen wir erstmal"}, {"id": 512, "start": 3836.2, "end": 3841.28, "text": "ob das funktioniert. Bla bla bla bla bla bla. Heatpump Device. Device ist es bei mir in dem"}, {"id": 513, "start": 3841.28, "end": 3853.28, "text": "Fall. Was ist Buffer? Jigitt sind wir im Jahr 1995 oder was ist das hier? Vor allem warum"}, {"id": 514, "start": 3853.28, "end": 3859.44, "text": "weiß der das denn zu? Ok ich weiß nicht so genau was der hier treibt aber zumindest sollte"}, {"id": 515, "start": 3859.44, "end": 3865.48, "text": "jetzt eigentlich auf der Serial Ausgabe der Name meiner Klimaanlage erscheinen wenn ich"}, {"id": 516, "start": 3865.48, "end": 3871.48, "text": "das jetzt richtig sehe. Und dann machen wir das ganze nochmal und dann sollen wir irgendwelche"}, {"id": 517, "start": 3871.48, "end": 3880.16, "text": "Modellinfos von der Klimaanlage bekommen. Auch gut. Machen wir. Schauen wir ob das funktioniert."}, {"id": 518, "start": 3880.16, "end": 3894.24, "text": "Upload. Äh warum gibt das Blob aus? Das darf kein Blob. Kann das alles Upload nicht funktioniert?"}, {"id": 519, "start": 3894.24, "end": 3919.48, "text": "Ah das Upload hat nicht funktioniert. Leute es geht nicht. Warum nicht? Ich hab irgendwas"}, {"id": 520, "start": 3919.48, "end": 3929.2, "text": "falsch gemacht. Ich hab irgendwas beim Merchen gefailt. Ok das muss man nochmal machen. Git"}, {"id": 521, "start": 3929.2, "end": 3947.28, "text": "Reset Origin Master. Achso ich bin ja doof. Erstmal alles wieder wegschmeißen und nochmal"}, {"id": 522, "start": 3947.28, "end": 3954.76, "text": "neu Merchen. Ok was hab ich verkehrt gemacht? Was hab ich verkehrt gemacht? Also."}, {"id": 523, "start": 3977.28, "end": 3984.28, "text": "Naja hier kann man nicht viel anders machen als das was ich vorhin, als was ich vorhin"}, {"id": 524, "start": 3984.28, "end": 3993.64, "text": "gemacht hab. Warum kein grafisches Merching Tool? Weil ich Raw Kommando Zeile mag. So"}, {"id": 525, "start": 3993.64, "end": 3999.36, "text": "hier ist nix mehr drinnen. Verhält einfach beide Klassen. Ja wenn das nicht geht dann"}, {"id": 526, "start": 3999.36, "end": 4023.36, "text": "mach ich das auch. So. Ah hier unten. Irgendwelche Definition oder so. Ok also das brauchen wir"}, {"id": 527, "start": 4023.36, "end": 4034.96, "text": "auf jeden Fall nicht. Das ist meins hier. ZMP. Ich lasse das jetzt wirklich mal beides"}, {"id": 528, "start": 4034.96, "end": 4040.96, "text": "drin. Ich weiß zwar nicht woran er sich gestört hat ehrlich gesagt aber probieren wir mal."}, {"id": 529, "start": 4040.96, "end": 4066.8, "text": "Ups. Wo? Ok. Ok. Mal gucken ob es jetzt geht. Leute. MonkaS. MonkaSmoke. Ok. Ok. Ok. Ok."}, {"id": 530, "start": 4066.8, "end": 4073.6, "text": "Jetzt gehts. Leute. MonkaS. MonkaSmoke. Das sieht schon mal ganz gut aus. Ha hat funktioniert."}, {"id": 531, "start": 4073.6, "end": 4093.92, "text": "So. Konsolen Merch. Beste. Weiß gar nicht was ihr habt. So. Ah guck mal funktioniert."}, {"id": 532, "start": 4093.92, "end": 4098.32, "text": "Es funktioniert. Alles Gewöhnungssache. Also ich bin mit keinem Merch Tool bisher richtig"}, {"id": 533, "start": 4098.32, "end": 4102.44, "text": "warm geworden. Ich hab es ausprobiert mit Wim-Diff. Ich hab es ausprobiert mit diesem"}, {"id": 534, "start": 4102.44, "end": 4110.84, "text": "Perforce-Dingsda-Ding. Ich hab schon ein bisschen vergessen wie es heißt. Ähm. Und"}, {"id": 535, "start": 4110.84, "end": 4118.0, "text": "sonst was ich bin mit keinem Merch Tool richtig warm geworden. Und nachdem ich seit Jahren"}, {"id": 536, "start": 4118.0, "end": 4126.88, "text": "nur stinknormales Git-Merch-Konsole Wim mache. Es ist Gewöhnungssache. Alter SVN. Ihh. Ok"}, {"id": 537, "start": 4126.88, "end": 4145.76, "text": "also das funktioniert schon mal. Gut also er ist der Meinung meine Klimaanlage ist eine"}, {"id": 538, "start": 4145.76, "end": 4154.04, "text": "Mitsubishi Heavy ZS. Das ist richtig. Dann irgendwie MT18XC30FS4. Kein Schimmer was das"}, {"id": 539, "start": 4154.04, "end": 4160.6, "text": "ist. Kein Plastenschimmer. Aber wir probieren jetzt mal aus ob man was an die Klimaanlage"}, {"id": 540, "start": 4160.6, "end": 4165.88, "text": "setzen kann. So. Und ich hab die LED auf halb 8 neben am Rechner hängen. Also es kann durchaus"}, {"id": 541, "start": 4165.88, "end": 4172.64, "text": "sein dass es nicht funktioniert jetzt. Ähm. So. Und wenn ich eine Sache gelernt hab. Wenn"}, {"id": 542, "start": 4172.64, "end": 4183.56, "text": "es um Infrarot Sender geht. Dann. Dass man die Sachen mehrfach schicken muss. Weil das"}, {"id": 543, "start": 4183.56, "end": 4191.52, "text": "so oft in die Hose geht. Einmal schicken reicht nicht. Ich schick das jetzt 5 mal. Ja 5. 5"}, {"id": 544, "start": 4191.52, "end": 4199.6, "text": "mal mit nem Delay. Mit nem Delay von 500 Millisekunden oder so. Dass es auf jeden Fall ankommt. Und"}, {"id": 545, "start": 4199.6, "end": 4204.56, "text": "dann machen wir mal hier in die Schleife 60 rein. Ich wills eigentlich nur einmal machen"}, {"id": 546, "start": 4204.56, "end": 4218.56, "text": "und gucken ob es funktioniert. So. Ähm. Send. Gut Upload. Schauen wir mal ob es funktioniert."}, {"id": 547, "start": 4218.56, "end": 4225.36, "text": "Wie viel hatte deine Klimaanlage gekostet beziehungsweise was ist dessen Leistung? Leistung weiß ich nicht."}, {"id": 548, "start": 4225.36, "end": 4233.08, "text": "Bekostet weiß ich ehrlich gesagt aus dem Kopf auch nicht mehr. Kannst du auch Device Gap"}, {"id": 549, "start": 4233.08, "end": 4242.92, "text": "machen? Weißt du was Device noch hat? Nee. Info Models denn mehr gibt es nicht. So ich"}, {"id": 550, "start": 4242.92, "end": 4248.0, "text": "upload mal. Mal gucken was passiert. Ich muss mal kurz die Musik ausmachen. Dass ich höre"}, {"id": 551, "start": 4248.0, "end": 4252.08, "text": "ob die Klimaanlage piepst oder nicht. Oder ihr das auch hört. Kann man die Klimaanlage"}, {"id": 552, "start": 4252.08, "end": 4260.24, "text": "so übertakten. Das ist wahrscheinlich gar nicht mal so unwahrscheinlich. Was Bild? So"}, {"id": 553, "start": 4260.24, "end": 4283.76, "text": "schnell hat es sich hochgeladen. Ah was hab ich kaputt gemacht? Äh. Was hat er für Schmerzen?"}, {"id": 554, "start": 4283.76, "end": 4306.4, "text": "Was willst du von mir? No matching function call."}, {"id": 555, "start": 4306.4, "end": 4328.96, "text": "Das ist aber verdächtig wenn das so im Beispiel drin steht und so nicht funktioniert. Was will"}, {"id": 556, "start": 4328.96, "end": 4355.36, "text": "der sonst noch? Was will der sonst noch? Clean Mode? Ist das Beispiel?"}, {"id": 557, "start": 4355.36, "end": 4378.72, "text": "Ah ja ok was war? Clean Mode? Was weiß ich? Falls? Silent Mode? Ich weiß nicht was das"}, {"id": 558, "start": 4378.72, "end": 4402.92, "text": "macht. 3D Auto CMD? 1KS? Falls? Alles weg. Ok. Alles klar. Upload. Ich weiß nicht was"}, {"id": 559, "start": 4402.92, "end": 4413.76, "text": "das macht. Ok es passiert nichts. Ich richte das jetzt erst mal auf die Klimaanlage aus."}, {"id": 560, "start": 4413.76, "end": 4420.68, "text": "Ich richte das jetzt erst mal auf die Klimaanlage aus. Und dann sehen wir mal weiter. Also Moment."}, {"id": 561, "start": 4420.68, "end": 4429.32, "text": "Nochmal uploaden. Und ich halte das jetzt Richtung Klimaanlage. Mal gucken ob es funktioniert."}, {"id": 562, "start": 4429.32, "end": 4438.08, "text": "Ha! Ha! Es geht! Habt ihr das gehört? Habt ihr das Piepsen gehört? Leute habt ihr das"}, {"id": 563, "start": 4438.08, "end": 4446.4, "text": "Piepsen gehört? Es funktioniert? Das ist ja POC like this. Alter dass das einfach geht."}, {"id": 564, "start": 4446.4, "end": 4460.16, "text": "Ok ok ok Power on. Ey das stimmt. Das funktioniert. Er hat jetzt eingeschaltet. Oh Heizen ist vielleicht"}, {"id": 565, "start": 4460.16, "end": 4467.8, "text": "jetzt keine gute Idee. Sekunde cool. Also Heizen ist keine gute Idee. Ich schalte mal"}, {"id": 566, "start": 4467.8, "end": 4478.68, "text": "wieder um. Hallo kannst du uploaden please? Ich muss auf kühlen schalten. Ok. Jetzt ist"}, {"id": 567, "start": 4478.68, "end": 4485.56, "text": "es auf kühlen. Ich schalte mal zur Sicherheit mit meiner Fernbedienung aus und wieder ein."}, {"id": 568, "start": 4485.56, "end": 4488.72, "text": "Dass es auf jeden Fall auf kühlen steht. Weil ich habe keinen Bock. Das ist jetzt auf den"}, {"id": 569, "start": 4488.72, "end": 4496.84, "text": "Heizenmodus. Device get wäre nice. Was soll das denn machen? Das ist eine Implementierungssache."}, {"id": 570, "start": 4496.84, "end": 4503.6, "text": "So also Power on. Mode cool. Fan. Das ist wie schnell der Lüfter dreht wahrscheinlich"}, {"id": 571, "start": 4503.6, "end": 4513.68, "text": "ne. Fan auto silent. Jetzt ist die Frage. Ist eins volle Pulle und fünf niedrig oder"}, {"id": 572, "start": 4513.68, "end": 4521.44, "text": "ist fünf volle Pulle? Ok machen wir Fan 5. Das hier ist bestimmt die Temperatur 24 Grad"}, {"id": 573, "start": 4521.44, "end": 4532.36, "text": "passt. So das hier ist die Ausrichtung von den Lamellen. Also sprich vertikale Ausrichtung,"}, {"id": 574, "start": 4532.36, "end": 4543.08, "text": "horizontale Ausrichtung. Also vertikale Einstellungen. Also vertikale Ausrichtung kann man sagen"}, {"id": 575, "start": 4543.08, "end": 4562.16, "text": "Auto down manual. Ok. M down. Middle. MUP. Alles klar. Swing. Swing ist gut. Swing sieht"}, {"id": 576, "start": 4562.16, "end": 4568.36, "text": "man garantiert gut auf der Klimaanlage. Ob es wirklich swingt. Links, rechts wollen wir"}, {"id": 577, "start": 4568.36, "end": 4575.48, "text": "ja auch mal swingen. So und dann kann das Ding. Was kann das Ding noch? Clean Mode. Am"}, {"id": 578, "start": 4575.48, "end": 4583.52, "text": "besten will der keine Ahnung was das ist. Ah ist das vielleicht für den Pollenfilter?"}, {"id": 579, "start": 4583.52, "end": 4600.84, "text": "Das für den Pollenfilter, das könnte sein. Silent Mode. False. Das Ding hat einen Silent"}, {"id": 580, "start": 4600.84, "end": 4613.32, "text": "Mode. Ja das stimmt. Und 3D Auto CMD. Keine Ahnung was das ist. Silent Mode ist Piepsenabschalten"}, {"id": 581, "start": 4613.32, "end": 4618.12, "text": "das glaube ich nicht. Der hat nämlich den Silent Mode Knopf auf der Fernbedienung und"}, {"id": 582, "start": 4618.12, "end": 4622.8, "text": "Silent Mode ist das der die, das ist halt besonders leise. Das er den Lüfter und so"}, {"id": 583, "start": 4622.8, "end": 4634.08, "text": "alles runterfährt. So was jetzt allerdings 3D Auto CMD ist habe ich keine Ahnung."}, {"id": 584, "start": 4652.8, "end": 4665.04, "text": "Wie findest du F-Sharp habe ich noch nicht großartig verwendet. Okay so jetzt sollte"}, {"id": 585, "start": 4665.04, "end": 4670.84, "text": "der angehen. Er sollte wirklich horizontal Swing machen und den Lüfter auf volle Pulle."}, {"id": 586, "start": 4670.84, "end": 4684.16, "text": "Schauen wir mal ob das funktioniert. Wieder ausrichten ordentlich. Da geht der Lüfter"}, {"id": 587, "start": 4684.16, "end": 4703.76, "text": "jetzt volle Pulle? Naja. Ob der Lüfter jetzt volle Pulle ist weiß ich nicht. Ihr habt"}, {"id": 588, "start": 4703.76, "end": 4708.32, "text": "nix Piepsen gehört das lag an meinem neuesten Geld das hat funktioniert. Ich mach mal aus"}, {"id": 589, "start": 4708.32, "end": 4712.48, "text": "und mal wieder an und ich muss mal kurz für mich gucken. Ich mach mal Lüfter volle Pulle"}, {"id": 590, "start": 4712.48, "end": 4726.6, "text": "jetzt mit der Fernbedienung ob das dann irgendwie anders ist. Oh ja. Oh ja das war was anderes."}, {"id": 591, "start": 4726.6, "end": 4735.64, "text": "Das war eben definitiv nicht. So jetzt muss ich irgendwie mal diesen komischen Controller"}, {"id": 592, "start": 4735.64, "end": 4750.4, "text": "ausrichten so das er auf die Klimaanlage zeigt ansonsten wird das nix. Versuch Fan 4. Aber"}, {"id": 593, "start": 4750.4, "end": 4764.12, "text": "ich bin begeistert das das funktioniert. Vielleicht muss man noch ein bisschen. Ja Fan 4 funktioniert"}, {"id": 594, "start": 4764.12, "end": 4773.72, "text": "Fan 4 ist volle Pulle. Vielleicht gibt es einfach kein Fan 5. Ich guck mal auf der Fernbedienung."}, {"id": 595, "start": 4773.72, "end": 4794.8, "text": "Das hat nur 4. Das hat auch nur 4. 5 gibt es gar nicht. Gibt es nicht. Es gibt kein 5."}, {"id": 596, "start": 4794.8, "end": 4800.12, "text": "Das hat nur 4. Das sehe ich auch gerade auf der Fernbedienung. So also das heißt ich"}, {"id": 597, "start": 4800.12, "end": 4806.4, "text": "kann das Ding jetzt anschalten. Power Mode. Cool. Was kann er sonst noch für Modes? Zeig"}, {"id": 598, "start": 4806.4, "end": 4811.64, "text": "mal her. Das ist jetzt schon mal ohne Scheiß die beste Steuerung für die Klimaanlage von"}, {"id": 599, "start": 4811.64, "end": 4815.72, "text": "allen Sachen die ich bisher probiert habe. Das ist besser als dieses Broadcom Ding besser"}, {"id": 600, "start": 4815.72, "end": 4824.92, "text": "als das Teil was extra für Klimaanlagensteuerung gemacht ist. Was Beschreibung für 3D Auto,"}, {"id": 601, "start": 4824.92, "end": 4832.44, "text": "Gebläsegeschwindigkeit, Luftstromausrichtung. Ne das wollen wir ja nicht. Auto ist übrigens"}, {"id": 602, "start": 4832.44, "end": 4838.44, "text": "der übelste Jebait Mode. Den habe ich am Anfang immer verwendet und dann hat die Klimaanlage"}, {"id": 603, "start": 4838.44, "end": 4844.0, "text": "auf einmal angefangen zu heizen wenn es zu kühl wurde und umgedreht. Das war Fail. Also"}, {"id": 604, "start": 4844.0, "end": 4850.28, "text": "das habe ich nicht. Okay es gibt Maintenance Mode, Heat, Fan, Dry, Cool. Genau das deckt"}, {"id": 605, "start": 4850.28, "end": 4859.36, "text": "sich Auto. Das Ding kann kühlen. Das kann trocknen. Wusste ich gar nicht dass es dafür"}, {"id": 606, "start": 4859.36, "end": 4866.84, "text": "einen extra Knopf gibt. Das kann lüften. Das mit dem Lüften ist tatsächlich ganz nützlich"}, {"id": 607, "start": 4866.84, "end": 4875.2, "text": "wenn man allergisch gegen Polen ist. Und dann kann man mit der Klimaanlage lüften und die"}, {"id": 608, "start": 4875.2, "end": 4880.4, "text": "hat einen Polenfilter drin und man kriegt den Scheiß nicht ins Haus. So es kann Heizen"}, {"id": 609, "start": 4880.4, "end": 4884.0, "text": "und es kann Maintenance Mode machen. Okay. Also mich interessiert aktuell ehrlich gesagt"}, {"id": 610, "start": 4884.0, "end": 4899.2, "text": "nur Cooling. Fanstufe will ich eins. Die kleinste gibt es auch ein Null. Eins. Silent. Okay"}, {"id": 611, "start": 4899.2, "end": 4905.64, "text": "ist auch nicht schlecht. Fan eins. So habe ich es. Ich stelle jetzt mal das ein was ich"}, {"id": 612, "start": 4905.64, "end": 4917.52, "text": "aktuell mit der Fernbedienung eingestellt habe. 24 Grad. Okay. So. Direction. Ich will"}, {"id": 613, "start": 4917.52, "end": 4927.32, "text": "nicht dass die vertikale. Warte mal vertikal. Was zum Teufel ist vertikal bei der. Was ist"}, {"id": 614, "start": 4927.32, "end": 4937.52, "text": "da vertikal. Man sieht es jetzt hier leider nicht. Also die Dinger hier können aus vertikal"}, {"id": 615, "start": 4937.52, "end": 4949.2, "text": "vertikal ist das jetzt so oder was zum Teufel ist davon vertikal. Horizontal ist wahrscheinlich"}, {"id": 616, "start": 4949.2, "end": 4965.08, "text": "so. Vermute ich jetzt mal. Also sagen wir mal vertikal will ich. Down. Und horizontal"}, {"id": 617, "start": 4965.08, "end": 4973.44, "text": "will ich auch. Moment rechts links Mitte. Dann ist dann ist horizontal in welche Richtung"}, {"id": 618, "start": 4973.44, "end": 4983.36, "text": "nach links. Das soll gegen die Mitte links. Das soll ein bisschen gegen die Wand blasen"}, {"id": 619, "start": 4983.36, "end": 4988.28, "text": "und nach unten. Genau. So. Das ist genau die Einstellung die ich jetzt mit der Fernbedienung"}, {"id": 620, "start": 4988.28, "end": 5000.08, "text": "habe. Das ist jetzt die gleiche Einstellung die ich wieder. Nice. Nice. Das funktioniert"}, {"id": 621, "start": 5000.08, "end": 5006.68, "text": "ja richtig gut. Das geht an. So und jetzt gucken wir mal ob wir den Kram wieder ausgeschaltet"}, {"id": 622, "start": 5006.68, "end": 5016.36, "text": "kriegen. Dann machen wir mal das andere. Senden wir mal nur einmal. Komm. So. Device. Also"}, {"id": 623, "start": 5016.36, "end": 5022.64, "text": "Power Mode off. Übrigens. Wenn ich off sende ist doch eigentlich kompletter Schwachsinn"}, {"id": 624, "start": 5022.64, "end": 5027.24, "text": "den anderen Kram auch zu setzen oder. Oder vielleicht muss man um den richtig auszuschalten"}, {"id": 625, "start": 5027.24, "end": 5038.92, "text": "noch was spezielles. Oder so. Off. So jetzt sollte er ausschalten. Gucken. Jetzt ausschaltet."}, {"id": 626, "start": 5038.92, "end": 5056.0, "text": "Ja. Ja. Komplett aus. Das ist ja sehr nice. So einfach hätte ich mir das nicht vorgestellt."}, {"id": 627, "start": 5056.0, "end": 5067.56, "text": "Ich meine. Ein popelischer. Ein popelischer ESP32 mit 5 Cent Infrarot LED. Also das Ding"}, {"id": 628, "start": 5067.56, "end": 5077.92, "text": "kostet 3,50 Euro. Die ganze Hart für die ich hier habe. 3,50 Euro und man kann komplett"}, {"id": 629, "start": 5077.92, "end": 5085.16, "text": "die Klimaanlage steuern wie man lustig ist. Das ist ja mega nice. So. Jetzt machen wir"}, {"id": 630, "start": 5085.16, "end": 5094.56, "text": "nochmal Bonus. Ich muss gucken ob ich einen. Einen Sensor habe für die. Ich will nämlich"}, {"id": 631, "start": 5094.56, "end": 5099.0, "text": "noch Luftfeuchtigkeit machen. Ich will noch Luftfeuchtigkeit machen und Temperatur machen."}, {"id": 632, "start": 5099.0, "end": 5102.48, "text": "Das machen wir jetzt auch noch schnell. Ich habe hier nämlich noch einen Sensor dafür"}, {"id": 633, "start": 5102.48, "end": 5114.8, "text": "und da muss ich aber erstmal Library gucken. Flow 690 glaube ich dir. Aber ich glaube nicht"}, {"id": 634, "start": 5114.8, "end": 5123.48, "text": "dass das in irgendeine Art und Weise ins Gewicht fällt. Ja nice. Das ist ja so geil. Mit so"}, {"id": 635, "start": 5123.48, "end": 5139.36, "text": "einer billigen 3,50 Euro Hardware meine Klimaanlage fernsteuern. Massive. Zu geil. Richtig geil."}, {"id": 636, "start": 5139.36, "end": 5163.12, "text": "So und jetzt muss ich nochmal schauen. So und jetzt muss ich mal schauen wie man hier"}, {"id": 637, "start": 5163.12, "end": 5168.2, "text": "meinen Temperatursensor angeschlossen kriegt. Und zwar ich habe hier nämlich gerade noch"}, {"id": 638, "start": 5168.2, "end": 5172.88, "text": "gesehen ich habe hier neben einem Raspberry Pi Zero noch einen rumfliegen. Da muss ich"}, {"id": 639, "start": 5172.88, "end": 5182.04, "text": "nämlich kein suchen gehen jetzt und zwar habe ich hier einen. Das ist ein BME 300 irgendwas"}, {"id": 640, "start": 5182.04, "end": 5195.04, "text": "genau. So einer ist das. Jetzt muss ich gucken wie ich den Kram angeschlossen kriege. Doch"}, {"id": 641, "start": 5195.04, "end": 5199.84, "text": "doch da ist eine Fernbedienung dabei klar. Wieso machst du das eigentlich bzw. hast du"}, {"id": 642, "start": 5199.84, "end": 5206.56, "text": "konkret mir eine Ansteuerung vor? Zum Beispiel dass ich von meinem Tablet aus die Klimaanlage"}, {"id": 643, "start": 5206.56, "end": 5214.32, "text": "einschalten kann oder dass ich sagen wir mal schauen kann der Raumtemperatur ist so und"}, {"id": 644, "start": 5214.32, "end": 5220.16, "text": "so viel und ich schalte die Klimaanlage wieder aus. Wenn die Raumtemperatur über 25 Grad"}, {"id": 645, "start": 5220.16, "end": 5224.88, "text": "ist und wenn sie keine Ahnung unter 25 Grad ist und wenn sie irgendwie über 25 Grad ist"}, {"id": 646, "start": 5224.88, "end": 5230.08, "text": "dann mache ich bis mit ein bisschen Delta dazwischen schalte ich wieder an. Irgendwie"}, {"id": 647, "start": 5230.08, "end": 5243.72, "text": "sowas. So gibt es da eine Arduino Library für und wie muss ich den Kram überhaupt"}, {"id": 648, "start": 5243.72, "end": 5255.52, "text": "anschließen? Wie muss ich den Kram anschließen an ESP32? Hier zeig mal her. Okay ich muss"}, {"id": 649, "start": 5255.52, "end": 5264.44, "text": "jetzt erstmal meinen Board hier rüber holen und anstöpseln. Ich mach das übrigens während"}, {"id": 650, "start": 5264.44, "end": 5270.56, "text": "das unter Strom ist warum auch nicht. Chaos haha. So oder vielleicht ziehe ich doch mal"}, {"id": 651, "start": 5270.56, "end": 5277.48, "text": "USB raus. So jetzt die erste Frage bei solchen Sensoren ist, ist der 5 Volt oder ist der"}, {"id": 652, "start": 5277.48, "end": 5291.08, "text": "3,3 Volt? Was ist der? Ah beides. Der kann beides. Das ist gut. Der kann beides. Das"}, {"id": 653, "start": 5291.08, "end": 5296.2, "text": "ist schon mal schön. Da kann ich nämlich einen Pin verwenden der da übrig ist. So"}, {"id": 654, "start": 5296.2, "end": 5304.6, "text": "wie muss ich den Kram jetzt anschließen? Gibt es da irgendein schönes Diagramm für?"}, {"id": 655, "start": 5304.6, "end": 5320.52, "text": "Okay also wie muss ich den Kram anschließen? Ach du Scheiße. Das wenn es fertig ist. Also"}, {"id": 656, "start": 5320.52, "end": 5330.44, "text": "VIN. So VIN. Ich hab leider keine gescheiten Kabel dran. Ich mach euch danach gleich mal"}, {"id": 657, "start": 5330.44, "end": 5334.04, "text": "ein Foto von. Die Kabel sind alle gelb das heißt ich muss jetzt ein bisschen aufpassen."}, {"id": 658, "start": 5334.04, "end": 5351.0, "text": "Also 3,3 Volt. So. Ground ist der nächste. Ich brauch echt mal ne Webcam für sowas."}, {"id": 659, "start": 5351.0, "end": 5364.92, "text": "What the fuck. Was ist der dritte bei mir? Ist der dritte Pin? Okay. Ground. Ground. Ist"}, {"id": 660, "start": 5364.92, "end": 5375.88, "text": "dran. Dann haben wir SCL wo muss. Warte mal SCL da gibt es auch so spezielle Pins wo"}, {"id": 661, "start": 5375.88, "end": 5386.0, "text": "der Kram dran muss auf der NodeMCO. Pin out. Ich hab die Dinger ewig nicht verwendet da"}, {"id": 662, "start": 5386.0, "end": 5398.68, "text": "dran. Gibt es da irgendwie so einen speziellen Pin wo der hin muss? Ne oder? Ich glaub das"}, {"id": 663, "start": 5398.68, "end": 5409.88, "text": "kann man einstellen wie man lustig ist. Ich glaub das kann man einstellen wie man will."}, {"id": 664, "start": 5409.88, "end": 5429.88, "text": "Okay. Dann mach ich jetzt mal Leute. Müsst ihr euch mal merken ich mach jetzt SCL. Mach"}, {"id": 665, "start": 5429.88, "end": 5441.36, "text": "mal. Ich hab mich verstopselt. Und SC. Ach du Scheiße das ist Kacke mit nur gelben Kabeln"}, {"id": 666, "start": 5441.36, "end": 5463.44, "text": "Alter. Muss nochmal abmachen. Fuck. Okay. Nochmal. Warum hab ich da nur gelbe Kabel"}, {"id": 667, "start": 5463.44, "end": 5475.32, "text": "an? V in. Geht auf 3,3 Volt. Dann bleibt ja nur noch Ground übrig eigentlich. Der geht"}, {"id": 668, "start": 5475.32, "end": 5479.16, "text": "auf Ground. Okay. Ich hab alles angeschlossen. Jetzt bin ich ja mal gespannt ob das funktioniert."}, {"id": 669, "start": 5479.16, "end": 5502.88, "text": "Das klappt im Leben nicht Alter. Das klappt im Leben nicht. Alter warum klaut mir meine"}, {"id": 670, "start": 5502.88, "end": 5523.52, "text": "VM? Warum klaut mir meine VM das Device immer? Geh weg. Yes. Serial. Okay passt. Fuck Alter."}, {"id": 671, "start": 5523.52, "end": 5533.24, "text": "Was gibt es da aus? Upload Error. Ich glaub das spack grad ein bisschen rum kann das sein."}, {"id": 672, "start": 5533.24, "end": 5548.48, "text": "Upload. Hallo Upload. What the fuck? Was hat er für Schmerzen?"}, {"id": 673, "start": 5548.48, "end": 5558.96, "text": "Ich mach mal die VM aus. Die schnappt mir immer das Teil weg. Ich grad nochmal Strom"}, {"id": 674, "start": 5558.96, "end": 5581.48, "text": "raus Strom rein. Okay nochmal. Upload. What? Warum kann er immer uploaden jetzt? Ich hab"}, {"id": 675, "start": 5581.48, "end": 5595.0, "text": "irgendeinen Mist angeschlossen. Deswegen geht das nicht. Ich hab Ground auf 1 richtig"}, {"id": 676, "start": 5595.0, "end": 5609.2, "text": "und V in hab ich auf 3,3 Volt. Das ist eigentlich okay. Ich stöpsel es mal kurz um. Den Ground"}, {"id": 677, "start": 5609.2, "end": 5624.84, "text": "mal da oben drauf. Das spackt manchmal nämlich. Nochmal ab. Wieder dran. Aha. So. Das macht"}, {"id": 678, "start": 5624.84, "end": 5632.76, "text": "nur Probleme wenn man Mist anschlägt. Ah. Okay. Falscher Pin. Was auch immer. Jetzt"}, {"id": 679, "start": 5632.76, "end": 5641.52, "text": "hat es funktioniert. Alles gut. Ne. Ich hab. Ich hab aus irgendwelchen Gründen den falschen"}, {"id": 680, "start": 5641.52, "end": 5645.8, "text": "Ground Pin gemacht. Frag mich nicht warum es den falschen Ground Pin gibt. Aber das"}, {"id": 681, "start": 5645.8, "end": 5651.08, "text": "Problem hatte ich mit dem NodeMCU schon mal. Okay. Dann machen wir den Kram jetzt erstmal"}, {"id": 682, "start": 5651.08, "end": 5664.24, "text": "hier kurz raus. Und schauen jetzt wie man diesen Kram ausgelesen kriegt. Plopp. Delay."}, {"id": 683, "start": 5664.24, "end": 5670.24, "text": "Sekunde. So und jetzt brauch ich irgendeine Arduino Library für meinen Temperatursensor."}, {"id": 684, "start": 5670.24, "end": 5677.44, "text": "Übrigens könnte man mal Vollbild machen wieder. So. Habt ihr euch gemerkt welche Pins ich"}, {"id": 685, "start": 5677.44, "end": 5690.76, "text": "verwendet hab? 26 und 27 glaube ich. Okay. Also. ESP32BME200Library brauchen wir GitHub."}, {"id": 686, "start": 5690.76, "end": 5702.72, "text": "Ne. Wir gehen mal in die Suche von Plattformer. Oh was es da gibt. Libraries. Suchen wir einfach."}, {"id": 687, "start": 5702.72, "end": 5710.6, "text": "So weiter die Library Suche nochmal. Libraries. Max cheatest du in Battlefield 4. Fuck jetzt"}, {"id": 688, "start": 5710.6, "end": 5717.76, "text": "kommt es nach all den Jahren raus. Arduino. Die sieht doch gut aus. AdafruitBME280Library."}, {"id": 689, "start": 5717.76, "end": 5726.08, "text": "Die sieht doch ganz brauchbar aus. Wo kann man die aufmachen? Hier GitHub. Repository."}, {"id": 690, "start": 5726.08, "end": 5739.04, "text": "Hallo. Ja die sieht doch eigentlich ganz brauchbar aus. Welche Desktop Umgebung benutzt ihr?"}, {"id": 691, "start": 5739.04, "end": 5753.6, "text": "Das ist i3WM. Auch vor sieben Tagen gepflegt. Alles gut. Ja nice. Examples. Also wie benutzt"}, {"id": 692, "start": 5753.6, "end": 5760.28, "text": "man das ganze? Adafruit, Sensor, BME, Temp. Ne ich will nicht das i2c oder? Ist das i2c?"}, {"id": 693, "start": 5760.28, "end": 5774.24, "text": "Ne ich will nicht i2c. Ich will Dings verwenden. Das andere. Das andere. Okay. Ich muss den"}, {"id": 694, "start": 5774.24, "end": 5785.88, "text": "Kram irgendwie ansprechen können. Der BME ist SQC. Aber, aber. Dann müsste ich doch"}, {"id": 695, "start": 5785.88, "end": 5797.92, "text": "eigentlich an diesen. Ne ich will SPI haben. Ich will SPI haben, weil ich habe SCL und"}, {"id": 696, "start": 5797.92, "end": 5816.64, "text": "MS Dings da angeschlossen. Okay oder. Die zwei Dinger habe ich angeschlossen. Wie kriegen"}, {"id": 697, "start": 5816.64, "end": 5824.4, "text": "wir da jetzt die Temperatur raus? Ah ist das? Okay. Ja dann, dann probieren wir das einfach"}, {"id": 698, "start": 5824.4, "end": 5835.32, "text": "mal aus. Also. Install, Library, Install, Tool, Project, Klimaanlage, Install. Zack."}, {"id": 699, "start": 5835.32, "end": 5850.08, "text": "Okay. Also. Dann included wir mal den ganzen Crap hier. Build. Die Version auf Plattform"}, {"id": 700, "start": 5850.08, "end": 5871.48, "text": "aus 48. Oh. Echt jetzt? Wo steht das? 110? Was haben wir hier für Versions? Oh. Warum"}, {"id": 701, "start": 5871.48, "end": 5890.08, "text": "ist das so alt? What the fuck? Was ist das für ein Crap? Ne. Mal ein KS. Ist das aktueller?"}, {"id": 702, "start": 5890.08, "end": 5901.4, "text": "Hätte ich nicht gedacht, dass das so ein Akt ist den Kram auszulesen. Boah das ist, das"}, {"id": 703, "start": 5901.4, "end": 5912.96, "text": "ist neuer. Dann nehmen wir das. Dann nehmen wir, dann nehmen wir das. Oder wir gucken uns"}, {"id": 704, "start": 5912.96, "end": 5917.48, "text": "jetzt einfach mal trotzdem, wir gucken uns jetzt mal an, ob das nicht doch funktioniert."}, {"id": 705, "start": 5917.48, "end": 5925.12, "text": "Welche Erweiterung benutzt du? Das ist Plattform IO. Wir machen das jetzt einfach mal mit dem"}, {"id": 706, "start": 5925.12, "end": 5938.76, "text": "Beispiel hier. Also. Okay. Dann probieren wir das mal aus. Also den da. Und dann, wie"}, {"id": 707, "start": 5938.76, "end": 5948.84, "text": "liest man das aus? Blablabla. Test. Was ist das für Magic? Was, was, was ist das hier"}, {"id": 708, "start": 5948.84, "end": 5956.04, "text": "für? Für schwarze Magie, Alter. BME. What? Woher soll ich wissen, was das Ding für ne"}, {"id": 709, "start": 5956.04, "end": 5970.88, "text": "Adresse hat? Monka Giga, Alter. Okay. Upload. Achso, ich muss ja auch erst mal sagen, welchen"}, {"id": 710, "start": 5970.88, "end": 5975.2, "text": "Pins das überhaupt angeschlossen ist und sowas. Das kann auch so überhaupt nicht funktionieren."}, {"id": 711, "start": 5975.2, "end": 5999.32, "text": "Wo sage ich ihm, an welche Pins der verwendet er? Hier so? Das verwirrt mich. Geht das?"}, {"id": 712, "start": 5999.32, "end": 6017.88, "text": "Okay. What? Welcher Pin ist das jetzt? Was meine Güte, was muss ich denn da überhaupt"}, {"id": 713, "start": 6017.88, "end": 6041.24, "text": "angeben? Was soll jetzt mal irgendjemand verstehen? Wie gebe ich denn die Pins an? Aber ich muss"}, {"id": 714, "start": 6041.24, "end": 6052.6, "text": "dem doch sagen, dass... Moment. Da kann ich die aber nicht an irgendwelche Sachen dran"}, {"id": 715, "start": 6052.6, "end": 6082.56, "text": "machen. SDASCL. Da muss ich die an die richtigen Pins machen, oder? Jaja, aber ich muss da"}, {"id": 716, "start": 6082.56, "end": 6093.04, "text": "an die richtigen Sensoren anschließen. Hier, guck mal. Ich muss das an die richtigen Pins"}, {"id": 717, "start": 6093.04, "end": 6112.56, "text": "anschließen. Wo muss ich das denn anschließen, ey? Warum ist das so kompliziert? So ein"}, {"id": 718, "start": 6112.56, "end": 6130.92, "text": "unglaublicher Kack-Sensor, Alter. Das ist doch nicht der..."}, {"id": 719, "start": 6142.56, "end": 6161.84, "text": "Ich habe dieses Ding. Ich probiere nicht alles durch. Also genau diesen Sensor habe ich."}, {"id": 720, "start": 6161.84, "end": 6180.0, "text": "So sieht das aus. Okay. Also das heißt, ich muss jetzt gucken, wo bei meinem NodeMCU diese"}, {"id": 721, "start": 6180.0, "end": 6202.6, "text": "Pins sind. Das heißt, ich muss da auf... Die muss ich doch bestimmt setzen. GPIO Pin"}, {"id": 722, "start": 6202.6, "end": 6214.88, "text": "22. Das ist nicht die Fault. Das muss man bestimmt einstellen, was er dafür verwenden"}, {"id": 723, "start": 6214.88, "end": 6237.32, "text": "soll. Ah, Eats Delivery. So, man muss doch bestimmt... Aha! Aha!"}, {"id": 724, "start": 6237.32, "end": 6257.76, "text": "Okay. Was ist denn hier standardmäßig? SDA. SCL. Was ist denn das hier, die Fault-mäßig?"}, {"id": 725, "start": 6257.76, "end": 6277.68, "text": "22. Meine Güte, da muss man... Da kommt doch keiner drauf. Meine Fresse. 21. 21 und 22."}, {"id": 726, "start": 6277.68, "end": 6287.68, "text": "Okay. Meine Güte. Komm mal. Okay. Also, ich habe es jetzt verkehrt gesteckt. Ich habe"}, {"id": 727, "start": 6287.68, "end": 6298.16, "text": "es nämlich auf 27 und 14. Das heißt, ich muss eigentlich auf... Ich muss auf 26 oder..."}, {"id": 728, "start": 6298.16, "end": 6317.96, "text": "Ach nee, Moment. Gibt es das vielleicht auch nochmal in... Okay. 21 und 22. Also muss ich"}, {"id": 729, "start": 6317.96, "end": 6335.44, "text": "auf... Wo ist 21? Da drüben. 21. GPIO 21. Und dann haben wir jetzt hier GPIO... Wo ist"}, {"id": 730, "start": 6335.44, "end": 6355.48, "text": "22? Ah, da ist das Kleine aufgedruckt. Ah, GPIO 22. Okay. Ich hoffe, ich habe es jetzt"}, {"id": 731, "start": 6355.48, "end": 6366.68, "text": "richtig dran. SDA. Also, was ist denn? Ich bin jetzt mal dabei. Ich muss mal gucken,"}, {"id": 732, "start": 6366.68, "end": 6381.88, "text": "ob ich es richtig habe. Ich habe SDA jetzt auf 21. Stimmt das? Ja. Und SCL habe ich jetzt"}, {"id": 733, "start": 6381.88, "end": 6400.36, "text": "auf... Dumm, wenn man nur gelbe Kabel hat. Habe ich jetzt auf 22. Okay, okay, okay. Gucken,"}, {"id": 734, "start": 6400.36, "end": 6415.2, "text": "ob das jetzt funktioniert. Ah, ja, ja. Ah, guck mal, das scheint ihn gefunden zu haben."}, {"id": 735, "start": 6415.2, "end": 6419.92, "text": "Sonst hätte er gemeckert. Guck mal, sonst hätte er gemeckert, wenn er ihn nicht gefunden"}, {"id": 736, "start": 6419.92, "end": 6427.04, "text": "hätte. Das scheint... Ich scheine das richtig angeschlossen zu haben. So, wie liest man"}, {"id": 737, "start": 6427.04, "end": 6437.76, "text": "das jetzt aus? Could not find, bla bla bla. Okay, einfach so. Ja, das ist, das ist ja easy."}, {"id": 738, "start": 6437.76, "end": 6467.2, "text": "What für ein Ding? Altitude ist mir doch vollkommen egal. So, und jetzt, ob das jetzt geht, ob"}, {"id": 739, "start": 6467.2, "end": 6492.28, "text": "der mir jetzt Temperatur und Luftfeuchtigkeit ausgibt? What the fuck? Nicht so ganz. Aber"}, {"id": 740, "start": 6492.28, "end": 6498.64, "text": "es ist doch sehr merkwürdig, dass der das überhaupt... Wisst ihr, was komisch ist, dass"}, {"id": 741, "start": 6498.64, "end": 6504.08, "text": "der, dass der, dass die Abfrage funktioniert? Wisst ihr, was echt merkwürdig ist, dass"}, {"id": 742, "start": 6504.08, "end": 6514.96, "text": "die Abfrage funktioniert? Die Abfrage funktioniert, aber es liefert keine Werte? Das ist komisch,"}, {"id": 743, "start": 6514.96, "end": 6531.8, "text": "oder? Was, er hat ihn diesmal nicht gefunden? Ah, easy. Jetzt geht's. Jetzt geht's. Wow."}, {"id": 744, "start": 6531.8, "end": 6550.64, "text": "Das ist aber nicht gut, oder? Bisschen, äh, bisschen schwankt das Ganze so. Vielleicht"}, {"id": 745, "start": 6550.64, "end": 6556.08, "text": "sollte ich ihn doch einfach mal an 5 Volt anschließen. Ja, na, die, die, die 24,6, die"}, {"id": 746, "start": 6556.08, "end": 6560.28, "text": "kommen hin, das ist okay. Ich, Leute, ich schließe ihn doch mal an 5 Volt an, vielleicht"}, {"id": 747, "start": 6560.28, "end": 6566.96, "text": "ist das... What the fuck, was macht der da dazwischen immer? Wackelkonten? Ne. Der liegt,"}, {"id": 748, "start": 6566.96, "end": 6570.44, "text": "der liegt ruhig da, wackelt nicht. Ich wackel jetzt mal voll dran. Leute, ich wackel jetzt"}, {"id": 749, "start": 6570.44, "end": 6579.4, "text": "total, das juckt ihn überhaupt nicht, ja. Ich mach den jetzt mal dran an 5 Volt und"}, {"id": 750, "start": 6579.4, "end": 6601.56, "text": "dann gucken wir mal, äh, Moment, was davon ist nochmal hier? 3,3. None. Okay. Oh, oh,"}, {"id": 751, "start": 6601.56, "end": 6610.76, "text": "oh, oi, oi, oi, oi, oi. Mockers, vielleicht sollte man das nicht im Laufende betrieben"}, {"id": 752, "start": 6610.76, "end": 6628.04, "text": "machen. Okay. Okay. Ich mach mal wieder ab, ist gut."}, {"id": 753, "start": 6628.04, "end": 6635.32, "text": "Das dumme ist, ich habe da nur gelbe Kabel dran, ich sehe überhaupt nicht welches Kabel,"}, {"id": 754, "start": 6635.32, "end": 6636.32, "text": "was ist?"}, {"id": 755, "start": 6636.32, "end": 6641.92, "text": "Was ist das für ein Kabel jetzt?"}, {"id": 756, "start": 6641.92, "end": 6645.84, "text": "Browned, okay."}, {"id": 757, "start": 6645.84, "end": 6662.68, "text": "Also mit 5V markt das schon mal gar nicht, 5V hat ja gar keinen Bock, boah, wat?"}, {"id": 758, "start": 6662.68, "end": 6669.24, "text": "Ne, damit grillst du den Note MCO nicht, das Ding ist tatsächlich relativ resistent."}, {"id": 759, "start": 6669.24, "end": 6681.0, "text": "Okay, jetzt habe ich dann 5V dran, 24,10, okay, wir probieren mal, ich puste mal, ich"}, {"id": 760, "start": 6681.0, "end": 6682.0, "text": "puste mal."}, {"id": 761, "start": 6682.0, "end": 6699.76, "text": "Und, ja, scheint zu funktionieren, scheint zu funktionieren, ich habe gepustet."}, {"id": 762, "start": 6699.76, "end": 6704.68, "text": "Okay, dann machen wir jetzt noch mal Luftfeuchtigkeit, Luftfeuchtigkeit brauchen wir unbedingt noch,"}, {"id": 763, "start": 6704.68, "end": 6715.88, "text": "exzellent Luftfeuchtigkeit, Pressure ist mir egal, Humidity, Prozent, was, der hat, der"}, {"id": 764, "start": 6715.88, "end": 6719.84, "text": "ist, irgendwas stimmt, ich lese den Sensor zu schnell aus wahrscheinlich, kann das sein,"}, {"id": 765, "start": 6719.84, "end": 6723.52, "text": "dass ich den zu schnell auslese, dass man da ein bisschen länger sleepen muss, dass"}, {"id": 766, "start": 6723.52, "end": 6726.92, "text": "der Probleme hat, wenn man den zu schnell ausliest hintereinander, dass man irgendwie"}, {"id": 767, "start": 6726.92, "end": 6727.92, "text": "mal sowas macht."}, {"id": 768, "start": 6727.92, "end": 6748.4, "text": "Oh, 36 Prozent, das ist aber, das ist ja schon ungesund, na gut, Klimaanlage ist an, Klimaanlage"}, {"id": 769, "start": 6748.4, "end": 6758.0, "text": "macht trocken, trocken, trocken, es f**k Luft, wir machen Klimaanlage jetzt mal aus, wir probieren"}, {"id": 770, "start": 6758.0, "end": 6764.4, "text": "das jetzt mal aus, ich, ich, ich leg das jetzt mal neben hin, irgendwo hier so, auf dem Rechner"}, {"id": 771, "start": 6764.4, "end": 6781.0, "text": "eben hin und wir machen Klimaanlage aus, so und jetzt beobachten wir das ganze mal kurz,"}, {"id": 772, "start": 6781.0, "end": 6784.68, "text": "das sollte zumindest, also die Temperatur sollte relativ schnell hoch gehen, innerhalb"}, {"id": 773, "start": 6784.68, "end": 6789.28, "text": "von 5 Minuten oder so, sollte die Temperatur ein bisschen, bisschen höher gehen, Luftfeuchtigkeit"}, {"id": 774, "start": 6789.28, "end": 6793.52, "text": "sollte dann, naja gut, Luftfeuchtigkeit, Feuchtigkeit muss erst mal herkommen, aber Temperatur sollte"}, {"id": 775, "start": 6793.52, "end": 6800.08, "text": "auf jeden Fall hoch gehen, Fenster auf, das ist eine gute Idee, ich mach mal kurz das"}, {"id": 776, "start": 6800.08, "end": 6812.88, "text": "Fenster auf, ich muss ja mal das Licht ausmachen, ja ich mach mal das Fenster auf, draußen"}, {"id": 777, "start": 6812.88, "end": 6820.36, "text": "ist warm, es ist halt noch geregnet, es kommt sogar, es kommt relativ kühl rein, was für"}, {"id": 778, "start": 6820.36, "end": 6823.56, "text": "eine Energieverschwendung, ja das stimmt schon, erst mal gekühlt, erst mal gekühlt"}, {"id": 779, "start": 6823.56, "end": 6832.12, "text": "mit der Klimaanlage und jetzt, jetzt erst mal Fenster auf, ok Fenster ist offen, aber"}, {"id": 780, "start": 6832.12, "end": 6846.32, "text": "man sieht schon, es geht wieder hoch, Klimaanlage ist aus, geht wieder hoch, ok also wir merken"}, {"id": 781, "start": 6846.32, "end": 6858.6, "text": "uns jetzt mal, wir sind bei ungefähr 37% und 23,8 Grad und dann schauen wir mal, na gut"}, {"id": 782, "start": 6858.6, "end": 6869.32, "text": "aber die Temperatur geht klar konstant hoch, übrigens die Luftfeuchtigkeit geht gerade"}, {"id": 783, "start": 6869.32, "end": 6887.08, "text": "sogar eher runter mit Fenster auf, ne, seht ihr das, das könnte auch noch so Messungengenauigkeit"}, {"id": 784, "start": 6887.08, "end": 6904.96, "text": "sein, ja das mit den Minus 146 Grad, das ist, das kam garantiert, weil wir den Sensor zu"}, {"id": 785, "start": 6904.96, "end": 6915.04, "text": "schnell ausgelesen haben, ok aber Temperatur funktioniert, Luftfeuchtigkeit funktioniert"}, {"id": 786, "start": 6915.04, "end": 6918.2, "text": "auch, wir können das mit Luftfeuchtigkeit ganz einfach ausprobieren, ich mach Fenster"}, {"id": 787, "start": 6918.2, "end": 6929.52, "text": "wieder zu, der ist relativ genau eigentlich, ich puste einfach mal dran, ich puste einfach"}, {"id": 788, "start": 6929.52, "end": 6948.16, "text": "mal, puste mal dran, dann sieht man gleich, dass es hoch geht, ich puste, ich puste mal"}, {"id": 789, "start": 6948.16, "end": 6961.76, "text": "dran, Achtung, ja, ja, Corona S"}, {"id": 790, "start": 6978.16, "end": 6988.8, "text": "ich hab den Sensor halb im Mund stecken, ok das funktioniert, das funktioniert Leute,"}, {"id": 791, "start": 6988.8, "end": 7016.12, "text": "das funktioniert, aber es funktioniert, man hatte gesehen, dass es funktioniert, so, gut,"}, {"id": 792, "start": 7016.12, "end": 7028.84, "text": "ja, sehr schön, das heißt ich hab jetzt, ich kann jetzt meine Klimaanlage steuern und"}, {"id": 793, "start": 7028.84, "end": 7035.24, "text": "ich hab nen Temperaturluftfeuchtigkeitssensor, das ist doch sehr praktisch, genau das was"}, {"id": 794, "start": 7035.24, "end": 7039.48, "text": "ich brauch, mal gucken ob die Steuerung noch geht, weil ich hatte die zwischenzeitlich"}, {"id": 795, "start": 7039.48, "end": 7058.6, "text": "abgeschaltet, warte mal kurz, ganzen kram wieder mal einkommentieren, eile, wat, wat,"}, {"id": 796, "start": 7058.6, "end": 7075.6, "text": "wat macht der da, warum fehlt da die Hälfte von, wat de, ok, das sagt Power ON, schau"}, {"id": 797, "start": 7075.6, "end": 7085.98, "text": "mal ob das funktioniert, ich hoffe ich hab es noch aus preset auf die Klimaanlage, alles"}, {"id": 798, "start": 7085.98, "end": 7096.46, "text": "Okay, das funktioniert nicht mehr, das Senden auf die Klimaanlage."}, {"id": 799, "start": 7096.46, "end": 7101.74, "text": "Ich richte das noch mal auf die Klimaanlage aus."}, {"id": 800, "start": 7101.74, "end": 7104.94, "text": "Hey, jetzt geht das Senden nicht mehr, was ist das?"}, {"id": 801, "start": 7104.94, "end": 7121.86, "text": "Okay, aus irgendwelchen Gründen geht das Senden nicht mehr, das ist ja auch geil,"}, {"id": 802, "start": 7121.86, "end": 7135.62, "text": "Alter. Na gut, das liegt aber garantiert daran, weil ich die LED jetzt an den hinteren"}, {"id": 803, "start": 7135.62, "end": 7140.34, "text": "Crown Anschluss vom ESP vom NodeMCU gesteckt habe, der hat ja vorher schon Probleme gemacht."}, {"id": 804, "start": 7140.34, "end": 7149.06, "text": "Wenn ich den jetzt wieder umstöpsel, dann funktioniert das auf jeden Fall."}, {"id": 805, "start": 7149.06, "end": 7165.86, "text": "Gut, also ich würde sagen, Test war trotzdem erfolgreich, weil man sieht hier Temperatur"}, {"id": 806, "start": 7165.86, "end": 7172.46, "text": "geht instant wieder hoch, Klimaanlage aus, Fenster zu, Bam, Luftfeuchtigkeit ist nach wie vor kacke."}, {"id": 807, "start": 7172.46, "end": 7181.9, "text": "Einfach beide ins selbe hier, das geht gerade nicht, weil ich habe kein Board und nichts dran,"}, {"id": 808, "start": 7181.9, "end": 7188.58, "text": "ich habe bloß die Pins. Da müsste ich irgendwie was dazwischen stöpseln noch."}, {"id": 809, "start": 7188.58, "end": 7198.06, "text": "Aber das ist gut, das funktioniert, das hätte ich nicht gedacht. Kannst dich echt nicht"}, {"id": 810, "start": 7198.06, "end": 7205.22, "text": "beschweren. So ich mach das mal, ich lass das mal im 2 Sekunden Takt auslesen, das sollte doch"}, {"id": 811, "start": 7205.22, "end": 7233.74, "text": "eigentlich reichen. Upload. Ja, also Leute, 36 Prozent Luftfeuchtigkeit ist das gut oder"}, {"id": 812, "start": 7233.74, "end": 7250.82, "text": "schlecht für Hals und Atmen und so oder ist das okay oder? PC lustig ist eine gute Idee,"}, {"id": 813, "start": 7250.82, "end": 7261.82, "text": "das machen wir. Weil ich den besser finde. Sollte zwischen 50 und 60 liegen, okay. Viel zu wenig."}, {"id": 814, "start": 7261.82, "end": 7271.02, "text": "Ja, aber was mache ich denn jetzt? Wo kriege ich Luftfeuchtigkeit her? Fenster auf ist ja"}, {"id": 815, "start": 7271.02, "end": 7282.5, "text": "keine Antwort drauf. Luftbefeuchter. Kann man Luftbefeuchter und Klimaanlage zusammenverwenden?"}, {"id": 816, "start": 7282.5, "end": 7292.1, "text": "Ja, warum nicht? Spuckt den Sensor an. Ja, dann ist die Luftfeuchtigkeit auf dem Sensor höher,"}, {"id": 817, "start": 7292.1, "end": 7300.7, "text": "aber insgesamt macht es ja keinen Unterschied. Ich merke das auch, also mir ist die Luft auch"}, {"id": 818, "start": 7300.7, "end": 7306.98, "text": "hier drin zu trocken. Also sprich, ich merke das an den Augen, dass es anfängt zu brennen nach"}, {"id": 819, "start": 7306.98, "end": 7313.06, "text": "ein paar, nach einer Weile hier drin und ich merke auch im Hals, dass das ganz trocken wird mit der"}, {"id": 820, "start": 7313.06, "end": 7330.46, "text": "Zeit. Also würde ich mal sagen, also würde ich mal sagen, muss ich irgendwie gucken,"}, {"id": 821, "start": 7330.46, "end": 7340.38, "text": "dass ich ein bisschen bessere Luftfeuchtigkeit da hinkriege. Ich probiere mal was aus. Ich mache mal"}, {"id": 822, "start": 7340.38, "end": 7356.78, "text": "die Tür auf. Ich mache mal die Tür auf. Komm, gleich geht es nur auf hier. Tür auf. Nee,"}, {"id": 823, "start": 7356.78, "end": 7368.3, "text": "jetzt geht es wieder runter. Es war nur der Luftzug von draußen. Geht wieder runter."}, {"id": 824, "start": 7368.3, "end": 7394.94, "text": "Es gibt kleine Ultraschallverdampfer. What the fuck? Aber habt ihr gesehen,"}, {"id": 825, "start": 7394.94, "end": 7405.34, "text": "wie schnell das hochgeht von 23,5 auf 26,5? Stellt einfach eine Schüssel Wasser ans Fenster."}, {"id": 826, "start": 7405.34, "end": 7428.5, "text": "Ja, gut, das Fenster mache ich ja zu. Ja, ich mache jetzt mal die Tür wieder schnell zu. Ja,"}, {"id": 827, "start": 7428.5, "end": 7433.14, "text": "aber trotzdem, also ich muss sagen, das war ein äußerst erfolgreicher Stream. Wir können die"}, {"id": 828, "start": 7433.14, "end": 7438.1, "text": "Klimaanlage steuern und vor allem richtig ausführlich. Guckt euch mal an, wie geil das"}, {"id": 829, "start": 7438.1, "end": 7444.42, "text": "ist, was man bei der Klimaanlage alles einstellen kann. Ich meine, man kann natürlich, man kann"}, {"id": 830, "start": 7444.42, "end": 7449.66, "text": "alle ausstellen, man kann die unterschiedlichen Modi von der Klimaanlage einstellen. Ich muss"}, {"id": 831, "start": 7449.66, "end": 7453.22, "text": "mal kurz auf die Fernbedienung gucken, was das für Modi hat. Wartet mal, das muss ich mal kurz"}, {"id": 832, "start": 7453.22, "end": 7462.06, "text": "ausprobieren. Automatisch hat es, kühlen hat es, wärmen hat es, trocknen hat es, lüften hat es."}, {"id": 833, "start": 7462.06, "end": 7469.94, "text": "Genau, das sind die Modi, die der hier auch drinne hat. Cool, Dry, Fan, Heat und Auto gibt es noch."}, {"id": 834, "start": 7469.94, "end": 7475.22, "text": "Ah ja, genau. Auto, Cool, Dry, Fan, Heat. Genau, das hat der auch drinne. So, dann kann man die"}, {"id": 835, "start": 7475.22, "end": 7481.98, "text": "Lüftergeschwindigkeit einstellen von Auto, Silent bis 4, was auch mega geil ist. Ich habe es immer"}, {"id": 836, "start": 7481.98, "end": 7487.7, "text": "auf 1. Die Temperatur, man kann die Ausrichtung der Lamellen einstellen, so habe ich es nämlich"}, {"id": 837, "start": 7487.7, "end": 7493.86, "text": "immer eingestellt, dass das nach unten gegen die Wand bläst und nicht zu mir vorne an den Schreibtisch."}, {"id": 838, "start": 7493.86, "end": 7498.38, "text": "Und dann haben wir hinten diese komischen Dinger, die ich wahrscheinlich immer auf"}, {"id": 839, "start": 7498.38, "end": 7505.3, "text": "False stehen lasse. Von Clean Mode bis Silent Mode und sonst was. Richtig geil."}, {"id": 840, "start": 7505.3, "end": 7518.58, "text": "Ja, das mit dem Wasser, mit der Luftfeuchtigkeit. Ich werde mir das morgen mal angucken. Ich lasse"}, {"id": 841, "start": 7518.58, "end": 7522.82, "text": "das hier morgen mal laufen und dann beobachte ich mal, wie die Luftfeuchtigkeit ist jetzt."}, {"id": 842, "start": 7522.82, "end": 7530.78, "text": "Jetzt liefert er den ganzen Tag die Klimaanlage und ich gucke mal, ob sich das deckt mit. Ab wann"}, {"id": 843, "start": 7530.78, "end": 7534.5, "text": "ich merke, dass mir es anfängt in den Augen ein bisschen weh zu tun und im Hals zu kratzen,"}, {"id": 844, "start": 7534.5, "end": 7539.98, "text": "ob sich das deckt mit mit niedriger Luftfeuchtigkeit, weil ich habe den Eindruck vormittags ist es besser."}, {"id": 845, "start": 7539.98, "end": 7546.58, "text": "So und achso, soll ich euch noch mal ein Foto machen, wie das Ding jetzt ausschaut mit dem"}, {"id": 846, "start": 7546.58, "end": 7574.94, "text": "Sensor dran? Ich mache euch noch mal schnell ein Foto. Wartet mal."}, {"id": 847, "start": 7574.94, "end": 7594.74, "text": "Ja, da ist anscheinend höhere Luftfeuchtigkeit. Exzellent Fußbodenluftfeuchtigkeit. So dann"}, {"id": 848, "start": 7594.74, "end": 7610.42, "text": "uploade ich das mal schnell. Wartet mal. Dass man jetzt sehen kann, wie es aussieht. Post"}, {"id": 849, "start": 7610.42, "end": 7625.9, "text": "Image, Choose Image, Foto Library. Zack, dann Post, machen wir hier auf Post Image, Post"}, {"id": 850, "start": 7625.9, "end": 7648.5, "text": "Image Gallery. Ok, es ist keine Gallery, Post Image. 8, 6, F. Ja, so, ich habe es auf den"}, {"id": 851, "start": 7648.5, "end": 7652.84, "text": "Teppich geschmissen, einfach mal fotografiert. Da hat sich nichts großartig getan, also sprich,"}, {"id": 852, "start": 7652.84, "end": 7661.14, "text": "das kann wirklich jeder selbst zusammenwursten, wie er will. Die Quali vom iPhone ist aber"}, {"id": 853, "start": 7661.14, "end": 7668.5, "text": "schlecht gerade, warum ist die so kacke? Naja, also hier ist die Infrarot-LED dran, ich gebe"}, {"id": 854, "start": 7668.5, "end": 7673.62, "text": "zu dahinten, der Fußboden ist nicht der beste Kontrast. Hier ist die Infrarot-LED dran, der"}, {"id": 855, "start": 7673.62, "end": 7679.34, "text": "Crown-Anschluss hier, der Crown-Pin buggt irgendwie rum. Ich weiß auch nicht, warum, was der für"}, {"id": 856, "start": 7679.34, "end": 7685.14, "text": "Schmerzen hat, warum der nicht funktioniert. Hier ist der Sensor dran und der ist halt an"}, {"id": 857, "start": 7685.14, "end": 7690.06, "text": "den passenden GPO-Pins. Aber trotzdem, man hat jetzt die Möglichkeit damit, die Heizung,"}, {"id": 858, "start": 7690.06, "end": 7699.34, "text": "die, die, die, die Klimaanlage zu steuern und man hat gleichzeitig noch Luftfeuchtigkeit-Temperaturauswertung,"}, {"id": 859, "start": 7699.34, "end": 7706.94, "text": "das ist ja eigentlich genau das, was man in Kombination haben will. Das ist ja genau die"}, {"id": 860, "start": 7706.94, "end": 7710.7, "text": "Kombination, die man haben will, weil man auf Grundlage dieser Werte dann auch darauf"}, {"id": 861, "start": 7710.7, "end": 7716.38, "text": "reagieren kann, wie man die Klimaanlage einstellt. So und der ganze Mist, der ganze Mist, den"}, {"id": 862, "start": 7716.38, "end": 7724.02, "text": "kriegt man im Endeffekt, was kosten hier so ein, was kosten hier so ein BME280. Das ist"}, {"id": 863, "start": 7724.02, "end": 7728.36, "text": "übrigens lustigerweise ist der Sensor, ist der Sensor für die Luftfeuchtigkeit und Temperatur"}, {"id": 864, "start": 7728.36, "end": 7739.62, "text": "das teuerste an dem ganzen Ding. Der kostet mehr als der als der Controller. Also der"}, {"id": 865, "start": 7739.62, "end": 7759.22, "text": "Sensor ist teurer als das ganze Board. Was kostet es bei Aliexpress? Schauen wir mal."}, {"id": 866, "start": 7759.22, "end": 7775.38, "text": "Wenn man Amazon kauft, wenn man Amazon kauft, ist man bei ungefähr 10 Euro, ein bisschen"}, {"id": 867, "start": 7775.38, "end": 7784.14, "text": "mehr als 10 Euro für das Ding. Wenn man bei Aliexpress kauft, ist man bei 4,50 Euro."}, {"id": 868, "start": 7784.14, "end": 7790.18, "text": "Bei Amazon ein bisschen mehr, bei Amazon ein bisschen eher bei 12 Euro. Amazon 12 Euro,"}, {"id": 869, "start": 7790.18, "end": 7794.94, "text": "Aliexpress 4,50. Wenn man jetzt mehr, wenn man jetzt ein paar Klimaanlagen hat, lohnt"}, {"id": 870, "start": 7794.94, "end": 7802.62, "text": "sich das tatsächlich. Kauft man sich drei Stück davon, drei Stück da. Was geben sie"}, {"id": 871, "start": 7802.62, "end": 7813.94, "text": "zuerst die fehlenden Informationen, was für eine Information fehlt hier? Was? Ah, welche"}, {"id": 872, "start": 7813.94, "end": 7831.58, "text": "ich nicht haben will, oder was? Ah jetzt. So, dann braucht man noch ESP32 NodeMCU oder"}, {"id": 873, "start": 7831.58, "end": 7843.9, "text": "irgendein ESP32. Ach, das ist wieder der Kram, der sich hier nicht wieder auswählen lässt."}, {"id": 874, "start": 7843.9, "end": 7866.98, "text": "So, Black Pins, ja gelbe Pins. So, hier den Einkaufswagen. So, und dann brauchen wir zum"}, {"id": 875, "start": 7866.98, "end": 7874.02, "text": "Schluss noch. Na gut, Infrarot-LEDs würde ich nicht, das würde ich bei Amazon.de kaufen."}, {"id": 876, "start": 7874.02, "end": 7878.7, "text": "Guck mal hier, 50er Pack, 50er Pack für 12 Euro, weil man kann die auch bei Aliexpress"}, {"id": 877, "start": 7878.7, "end": 7904.82, "text": "kaufen. Was kosten die da? ER-LED. Wie viel sind das? 100 Stück für 4 Euro. Das ist halt"}, {"id": 878, "start": 7904.82, "end": 7913.5, "text": "ein bisschen zu viel, aber was Anfahreres gibt es nicht. Die gibt es sogar noch billiger."}, {"id": 879, "start": 7913.5, "end": 7936.42, "text": "3,79, viel, 100 Stücke, viel. So, also, Moment. Was? Warum ist so viel Zeug immer im Warenkorb"}, {"id": 880, "start": 7936.42, "end": 7943.62, "text": "drin? Das habe ich doch überhaupt nicht reingelegt. Ah, ist das vom letzten Mal noch drinne, ne?"}, {"id": 881, "start": 7943.62, "end": 7950.74, "text": "Das ist vom letzten Mal noch drinne, wo wir im Stream probiert haben. So, also wenn man"}, {"id": 882, "start": 7950.74, "end": 7963.42, "text": "Aliexpress einkauft, ist man bei 20 Euro inklusive Versand, allerdings kann man damit 3 Klimaanlagen"}, {"id": 883, "start": 7963.42, "end": 7971.18, "text": "ausstatten und hat noch 97 Infrarot-LEDs übrig. Also, preislich ist das wirklich die günstigste"}, {"id": 884, "start": 7971.18, "end": 7976.38, "text": "Lösung und vor allem die beste Lösung, so wie ich das sehe, was die Features anbelangt."}, {"id": 885, "start": 7976.38, "end": 7980.7, "text": "Ich meine, das kannst du alles mit dem anderen Zeug nicht machen. Du kannst diese ganzen"}, {"id": 886, "start": 7980.7, "end": 7984.9, "text": "Settings an der Klimaanlage mit den anderen Sachen nicht einstellen, die ich probiert"}, {"id": 887, "start": 7984.9, "end": 7993.78, "text": "habe. Und sprich, es bietet die meisten Settings für die Klimaanlage und man hat noch die"}, {"id": 888, "start": 7993.78, "end": 7997.86, "text": "Möglichkeit, Temperatur und Luftfeuchtigkeit auszulösen, das ist doch super. Da kann man"}, {"id": 889, "start": 7997.86, "end": 8005.62, "text": "sich nicht beschweren, das war echt erfolgreich heute mal. Zur Abwechslung. So Leute, was"}, {"id": 890, "start": 8005.62, "end": 8012.42, "text": "gibt es denn sonst noch Neues? Nachdem wir jetzt erstmal fertig sind mit dem Klimaanlagenzeug,"}, {"id": 891, "start": 8012.42, "end": 8015.74, "text": "habe ich irgendwelche Fragen übersehen. Wahrscheinlich, aber ich habe ja meine Fragen"}, {"id": 892, "start": 8015.74, "end": 8043.42, "text": "auf VM ausgeschaltet. Monka, Question. Pepega Board. Ja. Was? 3D Auto. Was? Ah, das ist was"}, {"id": 893, "start": 8043.42, "end": 8069.3, "text": "Auto macht. Also sprich, Auto macht so eine Mischung aus allem oder wie? Ich glaube, die"}, {"id": 894, "start": 8069.3, "end": 8082.62, "text": "habe ich sogar schon. Ja, die haben wir schon. Genau die. Die habe ich schon. Die ist auch"}, {"id": 895, "start": 8082.62, "end": 8099.94, "text": "Pock, wenn man mal eine Gartenschere braucht. Dann brauchst du einen 82 Widerstand. Okay."}, {"id": 896, "start": 8099.94, "end": 8113.1, "text": "Ach was, das hält das alles aus. Ja, Emax habe ich mittlerweile aufgegeben. Ich habe"}, {"id": 897, "start": 8113.1, "end": 8118.46, "text": "es eine Weile mal verwendet, aber das war mir den Konfigaufwand nicht wert, weil ich bin"}, {"id": 898, "start": 8118.46, "end": 8122.86, "text": "jemand, der erst mal anfängt zu basteln. Ich will, dass es dann wirklich exakt das"}, {"id": 899, "start": 8122.86, "end": 8125.98, "text": "macht, wie ich es haben will und dann bastel ich ewig dran rum und Emax kannst du dich"}, {"id": 900, "start": 8125.98, "end": 8137.14, "text": "monatelang, jahrelang mit rum basteln. Das habe ich irgendwann sein lassen. Hast du"}, {"id": 901, "start": 8137.14, "end": 8149.02, "text": "eigentlich hingekriegt, BeatBroad, dass deine Badge-Geschichte funktioniert? Wie gesagt,"}, {"id": 902, "start": 8149.02, "end": 8152.98, "text": "das war nicht so einfach, das geht nicht so einfach hier, weil das mehrere Signale sind"}, {"id": 903, "start": 8152.98, "end": 8160.98, "text": "hier aufeinander aufbauen. Das hatten wir schon. Ja und die PS Vita-Flash ich auch mal."}, {"id": 904, "start": 8160.98, "end": 8169.82, "text": "So, exzellent. Hat auch gut funktioniert. Leute, wir hatten lange keinen Stream mehr,"}, {"id": 905, "start": 8169.82, "end": 8177.42, "text": "der tatsächlich so von Anfang bis Ende, wo wir was gemacht haben und es einfach funktioniert"}, {"id": 906, "start": 8177.42, "end": 8185.94, "text": "hat. Ex, ja. Guck mal, Kyo-Kun ist auch da. Leider ein bisschen spät, weil ich bin jetzt"}, {"id": 907, "start": 8185.94, "end": 8205.58, "text": "mehr oder weniger fertig. Warum ist mal Minecraft wieder versandt? Das ist dann nur nur kostenlos,"}, {"id": 908, "start": 8205.58, "end": 8213.38, "text": "weil die halt wollen. Das ist halt irgendwie so ein Mindfactory-Marketing-Ding. Macht das"}, {"id": 909, "start": 8213.38, "end": 8225.7, "text": "aber nie, ich bezahle lieber die Versandkosten. Lustige Partys. Oh ja, mega lustige Partys"}, {"id": 910, "start": 8225.7, "end": 8235.74, "text": "AliExpress. Vor allem Sachen von AliExpress, die man sich in der Party in den Mund steckt,"}, {"id": 911, "start": 8235.74, "end": 8251.46, "text": "Alter. Da ist ja Corona vorprogrammiert. Nee, das ist ein neues Immort. Was empfiehlt uns"}, {"id": 912, "start": 8251.46, "end": 8259.22, "text": "denn AliExpress heute schön ist wieder. Erreichen Sie Top-Geschwindigkeiten. Shoppen Sie bei"}, {"id": 913, "start": 8259.22, "end": 8271.86, "text": "Baseus. Ey, was ist das überhaupt? Ein Netzteil, ein USB-Netzteil. Ja, Top-Geschwindigkeit,"}, {"id": 914, "start": 8271.86, "end": 8276.94, "text": "also die Geschwindigkeiten bei USB-Netzteilen sind absolut entscheidend. Kannst du was"}, {"id": 915, "start": 8276.94, "end": 8291.7, "text": "zu Plex? Du meinst Plex, oder? Plex? Du meinst Plex, oder? Du meinst Plex. Ist Plex nicht"}, {"id": 916, "start": 8291.7, "end": 8310.98, "text": "das Ding aus Mario? Dieser Yoshi-Ersatz? Mario? Plesi? Nee, Plesi ist es, nicht Plexi. Das"}, {"id": 917, "start": 8310.98, "end": 8321.14, "text": "komische Yoshi-Ersatz-Wasserreiter-Ding. Ach, du meinst das Admin-Panel. Ach so. Nee,"}, {"id": 918, "start": 8321.14, "end": 8327.9, "text": "kann ich nichts zu sagen. Jetzt weiß ich aber, was du meinst. Strahlend und leuchtend. Ah,"}, {"id": 919, "start": 8327.9, "end": 8338.82, "text": "exzellent. AliExpress ist mal wieder hier. Voll am Puls der Zeit. Wer sich mit eklichen"}, {"id": 920, "start": 8338.82, "end": 8345.94, "text": "Zangen rumschlagen will, kann Zangen bei AliExpress kaufen. Das Ding sieht schon so"}, {"id": 921, "start": 8345.94, "end": 8353.3, "text": "aus, als fällt es auseinander, Alter. Das Ding sieht wirklich schon so aus, als geht"}, {"id": 922, "start": 8353.3, "end": 8368.98, "text": "es gleich morgen kaputt. Oh, Werkzeug Pro. Alter, für 11 Euro? What the f... Ja, was"}, {"id": 923, "start": 8368.98, "end": 8380.94, "text": "denn jetzt? Trotzdem, billig Zeug. Würde ich mir im Leben nicht in China kaufen. Also Werkzeug"}, {"id": 924, "start": 8380.94, "end": 8386.06, "text": "ist so ein Ding, das... Elektronikzeug ist toll bei AliExpress zu kaufen, aber Sachen,"}, {"id": 925, "start": 8386.06, "end": 8403.66, "text": "die auch halten sollen... Eher nicht. Nutzt du öfters WSL im Alltag? Nee. Gar nicht."}, {"id": 926, "start": 8403.66, "end": 8415.78, "text": "Wenn ich Linux verwende, verwende ich ein richtiges Linux. WSL verwende ich gar nicht."}, {"id": 927, "start": 8415.78, "end": 8423.18, "text": "An sich finde ich WSL einen ganz guten Ansatz. Nachdem ja die ganze Shell-Geschichte unter"}, {"id": 928, "start": 8423.18, "end": 8428.5, "text": "Windows so verhunzt ist, und selbst PowerShell, PowerShell ist einfach keine gute interaktive"}, {"id": 929, "start": 8428.5, "end": 8432.74, "text": "Shell, PowerShell ist eine gute Automatisierung, Skripting-Geschichte, aber keine gute interaktive"}, {"id": 930, "start": 8432.74, "end": 8438.38, "text": "Shell, die holen jetzt ja erst langsam auf mit ihren neuen Kommandozeilen, mit ihrem"}, {"id": 931, "start": 8438.38, "end": 8443.86, "text": "neuen Terminal Fenster und ein bisschen Zeugs, aber ganz ehrlich, da liegen immer noch Welten"}, {"id": 932, "start": 8443.86, "end": 8448.02, "text": "zwischen einem Windows-Terminal und einem ordentlichen hier, was weiß ich, irgendeinem"}, {"id": 933, "start": 8448.02, "end": 8455.82, "text": "x-beliebigen Linux-Terminal-Programm mit ZSH und ordentlichen Sachen drauf. CMDA ist noch"}, {"id": 934, "start": 8455.82, "end": 8462.02, "text": "das, was am besten funktioniert, ja. Wobei, das musste einrichten, dass es mit WSL funktioniert,"}, {"id": 935, "start": 8462.02, "end": 8465.78, "text": "aber dann funktioniert es auch. Das Problem an CMDA ist, das kann keine advanceden Sachen,"}, {"id": 936, "start": 8465.78, "end": 8471.26, "text": "also das kann keine Farbcodes, keine richtigen und sonst was. Also das ist, das fühlt sich"}, {"id": 937, "start": 8471.26, "end": 8480.62, "text": "alles so gefrickelt unter Windows an. So nix halbes und nix ganzes. Am besten ist es wahrscheinlich"}, {"id": 938, "start": 8480.62, "end": 8485.74, "text": "immer noch, einen X-Server zu installieren und einen Gnome-Terminal oder so unter WSL"}, {"id": 939, "start": 8485.74, "end": 8493.18, "text": "zu betreiben. Wobei halt, grafische Programme unter WSL nicht so tolle sind, weil die Windows"}, {"id": 940, "start": 8493.18, "end": 8498.38, "text": "X-Server sacken. Weil X-Server an sich sacken alle, aber die Windows-Varianten sacken noch"}, {"id": 941, "start": 8498.38, "end": 8513.3, "text": "mehr. Also es geht, es geht für mich, Kommando-Zeilen-mäßig immer noch nix. Guck mal, hier Luftfeuchtigkeit"}, {"id": 942, "start": 8513.3, "end": 8520.86, "text": "geht hoch. Guck mal, wie warm es schon wieder ist, 28 Grad fast. Ok, das hängt jetzt auch"}, {"id": 943, "start": 8520.86, "end": 8525.34, "text": "neben am Rechner, das hängt jetzt auch neben am Rechner. Ich mach das mal anders, wartet"}, {"id": 944, "start": 8525.34, "end": 8549.82, "text": "mal, ich versuch das mal ein bisschen hoch zu hängen. 27,7. Das ist ganz schön warm"}, {"id": 945, "start": 8549.82, "end": 8555.18, "text": "hier drin. So, jetzt machen wir mal Klimaanlage an, mal gucken, wie schnell das runter geht."}, {"id": 946, "start": 8555.18, "end": 8567.38, "text": "Klimaanlage 24 Grad. Schauen wir mal. Hab wegen dir damals meine Ausbildung zum Fachinformatiker"}, {"id": 947, "start": 8567.38, "end": 8572.82, "text": "System Integration angefangen. Also jetzt bin ich schon fast durch. Ja, das ist doch"}, {"id": 948, "start": 8572.82, "end": 8577.58, "text": "schön, wenn das bei dir gut funktioniert. Nice. Was machst du als Abschlussprojekt?"}, {"id": 949, "start": 8577.58, "end": 8583.3, "text": "Guck, schon geht es runter. Seht ihr, wie schnell das geht mit der Klimaanlage? Kaum"}, {"id": 950, "start": 8583.3, "end": 8592.34, "text": "ist die an, geht die Temperatur direkt runter und die Luftfeuchtigkeit geht hoch. Kann mir"}, {"id": 951, "start": 8592.34, "end": 8596.58, "text": "das einer erklären, warum geht die Luftfeuchtigkeit instant so schnell hoch, wenn die Klimaanlage"}, {"id": 952, "start": 8596.58, "end": 8619.22, "text": "an ist? Ja, das VSCO Terminal kann man auch verwenden. Allerdings, da braucht man eine"}, {"id": 953, "start": 8619.22, "end": 8624.5, "text": "ordentliche Shell für, das ist ja wirklich nur ein Terminal. Aber schön ist es nicht."}, {"id": 954, "start": 8624.5, "end": 8632.58, "text": "Ah, jetzt geht es wieder runter. Hattest du den Sensor gerade in der Hand? Nö, der hängt"}, {"id": 955, "start": 8632.58, "end": 8643.42, "text": "hier mitten im Raum. Bisschen in die Richtung, wo die Klimaanlage hinpustet. Geht total"}, {"id": 956, "start": 8643.42, "end": 8649.66, "text": "schnell mit der Temperatur. Guckt mal hier, eben war es noch fast 28 Grad und jetzt sind"}, {"id": 957, "start": 8649.66, "end": 8656.3, "text": "wir schon bei 26 Grad. Also die Klimaanlage, die haut rein. Da gibt es nichts, das flutscht."}, {"id": 958, "start": 8656.3, "end": 8671.9, "text": "Das ist klar, Wilhelm Kramer LP. Drei Stunden, nice. Ja, da ging ja das Stream fast passend"}, {"id": 959, "start": 8671.9, "end": 8676.9, "text": "für dich. Aber wie schnell die Klimaanlage kühlt, das kommt mir gar nicht so schnell"}, {"id": 960, "start": 8676.9, "end": 8684.58, "text": "vor, wenn ich in dem Raum sitze. Ich meine, die hat jetzt genau 2 Grad abgekühlt und"}, {"id": 961, "start": 8684.58, "end": 8698.02, "text": "geht noch weiter. Gibt es da eine Anleitung für dumme für was? Aber ich könnte mir vorstellen,"}, {"id": 962, "start": 8698.02, "end": 8702.58, "text": "wenn ich die Klimaanlage jetzt noch eine Weile anlasse, dass die Luftfeuchtigkeit immer weiter"}, {"id": 963, "start": 8702.58, "end": 8713.7, "text": "runter geht. Wenn sich das erstmal eingependelt hat auf der Temperatur, dass es dann anfängt"}, {"id": 964, "start": 8713.7, "end": 8719.62, "text": "weniger zu werden. Du meinst Anleitung für dumme hier, was ich hier gebaut habe? Ja,"}, {"id": 965, "start": 8719.62, "end": 8723.38, "text": "du kannst dir den Stream einfach im Wort angucken. Es ist wirklich ziemlich simpel. Ich meine,"}, {"id": 966, "start": 8723.38, "end": 8742.42, "text": "ich habe die Sachen so angeschlossen hier. Ja, wie auch immer. Post image. Ja, ich weiß"}, {"id": 967, "start": 8742.42, "end": 8760.98, "text": "jetzt gar nicht mehr, wo ich es habe. Ja, also ich habe einen Temperatursensor angeschlossen"}, {"id": 968, "start": 8760.98, "end": 8766.98, "text": "und eine Infrarot LED angeschlossen. Also eigentlich kein Hexenwerk. Und dann hier mal"}, {"id": 969, "start": 8766.98, "end": 8770.5, "text": "ein bisschen ausprobiert, wie man das Ganze bedient. Das ist ja nicht fertig. Ich habe"}, {"id": 970, "start": 8770.5, "end": 8791.86, "text": "nur geguckt, wie es geht. Ja, ich würde den Sensor gerne auf den Schrank legen, das geht"}, {"id": 971, "start": 8791.86, "end": 8795.02, "text": "aber nicht. Da muss ich nämlich Wlan einschalten und Wlan kann ich gerade nicht einschalten"}, {"id": 972, "start": 8795.02, "end": 8800.74, "text": "am Sensor, weil ich das Passwort nicht hier habe. Aber guck mal, wie schnell das kühlt,"}, {"id": 973, "start": 8800.74, "end": 8804.86, "text": "3 Grad schon runter. Ich leg das mal ganz woanders hin. Ich leg das mal bei mir auf"}, {"id": 974, "start": 8804.86, "end": 8827.74, "text": "dem Schreibtisch. Ich leg das mal bei mir auf dem Schreibtisch. Gut, jetzt ist der Monitor."}, {"id": 975, "start": 8827.74, "end": 8854.38, "text": "Oh, hier müsste jetzt gut sein. Hier ist gut."}, {"id": 976, "start": 8854.38, "end": 8883.82, "text": "Ich denke jetzt hinter dem Monitor am Schreibtisch, da ist halt Abwärme vom Monitor. Toll."}, {"id": 977, "start": 8883.82, "end": 8904.78, "text": "Ja, das liegt jetzt hier unten auf dem Rechner drauf. Ich leg das morgen auf den Schrank."}, {"id": 978, "start": 8904.78, "end": 8910.14, "text": "Auf dem Schrank ist es am besten. Das ist so ein bisschen am Arsch der Welt. Jetzt geht"}, {"id": 979, "start": 8910.14, "end": 8915.34, "text": "die Temperatur hoch, weil es auf dem Rechner liegt. Jetzt muss ich es doch ein bisschen"}, {"id": 980, "start": 8915.34, "end": 8932.46, "text": "in die Luft hängen lassen. Ach, keine Ahnung, ist auch wurscht. Aber man sieht, dass die"}, {"id": 981, "start": 8932.46, "end": 8952.14, "text": "Klimaanlage echt schnell kühlt. Ich sag, das ging ja ratzfatz 2-3 Grad runter. Was"}, {"id": 982, "start": 8952.14, "end": 8967.38, "text": "kühlt da? Die Klimaanlage kühlt. Ich muss mir da einen ordentlichen Platz versuchen."}, {"id": 983, "start": 8967.38, "end": 8971.58, "text": "Wie groß ist der Raum? Nicht so groß. Weiß nicht, wie viel Quadratmeter. Nicht groß."}, {"id": 984, "start": 8971.58, "end": 8978.7, "text": "So ganz normal als Büro halt. Also Büro mit dem Schreibtisch, Sofa und Schrank und Zeug."}, {"id": 985, "start": 8978.7, "end": 9001.9, "text": "Warum geht das jetzt so hoch da hinten? Das ist bestimmt die Abwärme vom Rechner. Ich"}, {"id": 986, "start": 9001.9, "end": 9008.9, "text": "lege es mal auf die Erd. Auf der Erd ist es am besten. Da wird nichts warm. Und die kalte"}, {"id": 987, "start": 9008.9, "end": 9013.54, "text": "Luft von der Klimaanlage ist auch unten auf der Erd. Ja, guckt, schon geht es ein bisschen"}, {"id": 988, "start": 9013.54, "end": 9020.38, "text": "weiter runter. Max, mach mal ein Prime95 an. Das gibt es doch nicht für einen ESP-35."}, {"id": 989, "start": 9020.38, "end": 9030.5, "text": "Nein, nein, nein, nein. Kein Java-Eye. Hör mal auf. So, sehr schön. Leute, gibt es"}, {"id": 990, "start": 9030.5, "end": 9043.5, "text": "noch irgendwelche Questions? Weil, ich gehe jetzt gleich auf. Ja, ich lege es auf den"}, {"id": 991, "start": 9043.5, "end": 9048.94, "text": "Schrank. Ich lege das auf den Schrank. Weil, das passt nämlich. Auf dem Schrank habe ich"}, {"id": 992, "start": 9048.94, "end": 9055.42, "text": "Sicht auf die Klimaanlage für die Infrarot-LED zum Steuern. Und die Klimaanlage selbst pustet"}, {"id": 993, "start": 9055.42, "end": 9060.62, "text": "nicht auf den Schrank drauf. Das ist, glaube ich, der optimale Platz, um Luftfeuchtigkeit,"}, {"id": 994, "start": 9060.62, "end": 9071.82, "text": "Raumtemperatur und Klimaanlagensteuerung zu machen. Wie sollte denn so die Luftfeuchtigkeit"}, {"id": 995, "start": 9071.82, "end": 9077.9, "text": "sein? Ich meine, das liegt jetzt gerade auf der Erde, das Ding. So. Jetzt haben wir 43%"}, {"id": 996, "start": 9077.9, "end": 9100.3, "text": "Luftfeuchtigkeit. Das ist doch eigentlich okay. 50-60% ist für Arbeitsräume optimal."}, {"id": 997, "start": 9100.3, "end": 9105.46, "text": "Okay, also es dürfte schon auch ein bisschen sein. Wobei ich mir jetzt halt auch vorstellen"}, {"id": 998, "start": 9105.46, "end": 9111.86, "text": "kann, wenn ich wirklich den ganzen Tag die Klimaanlage laufen habe, dann wird die Luftfeuchtigkeit"}, {"id": 999, "start": 9111.86, "end": 9135.26, "text": "wahrscheinlich noch runtergehen. Jetzt schwankt es ja auch ein bisschen. Ja. Soll ich mal,"}, {"id": 1000, "start": 9135.26, "end": 9139.86, "text": "ich nehme mal den Sensor und halte ihn so weit, wie es geht. Wobei, nein, weiter kann"}, {"id": 1001, "start": 9139.86, "end": 9158.86, "text": "ich ihn nicht halten. Da, wo die Klimaanlage hin pustet. Jetzt hängt er ein bisschen da,"}, {"id": 1002, "start": 9158.86, "end": 9172.42, "text": "wo die Klimaanlage hin pustet. Guck, wird es auch gleich schon kühler. 24,9, 24,07."}, {"id": 1003, "start": 9172.42, "end": 9176.9, "text": "Wie gesagt, ich leg das auf den Schrank. Ich muss ja von dort aus sowohl Infrarotsicht"}, {"id": 1004, "start": 9176.9, "end": 9183.46, "text": "auf die, also Sicht auf die Klimaanlage haben, als auch, dass es nicht so viel Luftzug hat."}, {"id": 1005, "start": 9183.46, "end": 9198.9, "text": "Haub auf dem Schrank ist eigentlich am besten. Ja, top. Okay Leute, wenn es nichts mehr gibt,"}, {"id": 1006, "start": 9198.9, "end": 9203.74, "text": "gehe ich jetzt auf und ins Bett. Dann sehen wir uns vielleicht morgen wieder. Bis dann."}, {"id": 1007, "start": 9203.74, "end": 9228.04, "text": "T.O.! Mach es gut."}]}