{"text": "publishing Die Benachrichtigung morgens verschickt Twitch irgendwie schneller als abends. Ja, Chat ist auch noch, äh, huge, Vogue. Vogue Chat. Ja ja. So, ich mein, ich bin ja quasi erst, erst off gegangen, ne, wann bin ich off gegangen gestern? 21 Uhr, also, ist gar nicht mehr. 20 Stunden ago, ja. Ne, ich kann nicht rechnen. Was ist 10 Uhr 30, minus 20 Stunden? Minus 10 Stunden ist 0 Uhr und dann minus 10 Stunden minus 4 ist 2, hä? Das ergibt keinen Sinn, oder? Bin ich jetzt... Das ergibt keinen Sinn. Ah, Moment, das ist nicht, weil ich off gegangen bin, das ist, weil ich den Stream gestartet hab. Das ist, weil ich den Stream gestartet hab, also muss ich das plus 6.30 nochmal rechnen. Also, wann bin ich off gegangen? 20, 30 oder so? 21 Uhr? Das ist heut' morgens zu viel, zu viel Quickmaps. 6 Stunden 30, so langen Stremen hatten wir lange... Wollte grad sagen, so langen Stremen hatten wir lange nicht mehr, das ist aber irgendwie ein ziemlicher Kacksatz. Gab's schon lange nicht mehr so einen ausführlichen Stremen. Wollte mir mal, ich guck ja immer ab und zu mal meine Clips durch, ne? Und da ist mir aufgefallen, wenn ich, das ist jetzt viel zu viel, kann ich gar nicht durchgucken. Leute sind hier voll am Clipshorn, hier, guck mal, Endless Scroll. Da kann ich mal auf. Vor allem, warum sowas Endless Scroll sein muss, weiß ich auch nicht. Endless Scroll ist echt das letzte. Wisst ihr, was ich mittlerweile wirklich, wirklich schlimm finde, ist... Keine Ahnung, gehen wir jetzt einfach mal auf Reddit, dann irgendwie PC, Master Race. Was ich mittlerweile wirklich schlimm finde, ist, dass wenn man nicht auf Reddit All schaltet, dass das hier auf dem Desktop Endless Scroll ist, dass es auf einem Safari iOS nicht Endless Scroll ist, allerdings ohne Seiten und sie einen damit überreden wollen, doch die App zu verwenden. Was halt total beknackt ist, weil ich will ja gerade dieses Feature nicht haben. So, das einzige Möglichkeit, die man hat, ist ja hier auf Old Reddit zu gehen. Problem ist, dass Old Reddit halt auch so seine Tücken hat, ja? So, und neuerdings mach ich's einfach... Ach ja, und übrigens auch ne Sache, die mir mega auf den Sack geht, wenn man Twitter mit dem Handy verwendet ist, kann man ne Seite aufmachen und geht dann zurück, dann checkt er nicht, wo man gewesen ist. Ich weiß nicht, ob das auf dem Desktop auch so ist. Mal angenommen, ich bin hier unten, hab mir das angeguckt. Ich mein, auf dem Desktop geht das, ja? Auf dem Desktop kann ich hier klaut sein, auf dem Handy geht das nicht. Dann geh ich zurück und dann bin ich auf dem Handy wieder direkt oben. Richtig fail. Funktioniert überhaupt nicht. Also es gibt eigentlich nur die Chance, Old Reddit zu verwenden oder, was eigentlich ganz gut ist, das Ding. Ja, das kann man auch verwenden. Mittlerweile verwende ich das zum Reddit lesen, einfach weil es mir auf den Keks geht, was die offizielle Redditseite macht. Meinst du Reddit oder wirklich Twitter? Naja, ich bin auf Reddit und ich sag Reddit, also meine ich Reddit, oder? Twitter ist auch so ein Ding für sich, ja? Twitter hat auch so seine Sachen, aber bei Twitter, Twitter ist eine der Seiten, wo ich die Endless-Crawl-Geschichte ver... Oh. Ups. Ach, ich hab Twitter gesagt. Ups. Nee, nee, nee, ich mein Reddit. Twitter, für Twitter versteh ich's noch. Auf Twitter versteh ich... Twitter ist einer der wenigen Seiten, wo ich das mit Endless-Crawl sinnvoll finde. Also es ist ja nicht so, dass alles schwachsinnig ist mit Endless-Crawl, aber Twitter ist okay, weil Twitter ist halt nur mal so ein Timeline-Ding, von oben nach unten, da ist es okay. Und in der Regel interessiert einen auf Twitter nicht, was jemand vor keine Ahnung irgendwie hier gepostet hat, da im September. Das interessiert normalerweise nicht so. Bei Twitter find ich's okay, bei Reddit find ich's voll für'n Arsch, diese ganze Endless-Crawl-Geschichte. Kennt ihr jemanden, einen guten Reddit-Reader für'n Desktop? Ansonsten muss man halt alt-Reddit verwenden. Aber alt-Reddit ist halt hässlich. Und an vielen Stellen auch nicht mehr richtig supportet mit dem neuen Layout und so. Kein guten, ja. Sagt. PC-Noobs need help, Part 2. It's not much better, but it's The Witcher. Naja, gut, es ist halt ein absolut unergonomischer Tisch. Das ist ein Küchentisch, ja. Und der hat ja, der kriegt ja Probleme im Knick, wenn er da hochgucken muss. Nimm mal vor, du sitzt hier, du musst ja auch relativ nah ran rücken, weil, weil Maus und vielleicht Armlehne-Stuhl, und dann, und dann kochen sie ja nach oben die ganze Zeit. Höhenverstellbarer Tisch-Beste, ja. Ich hab ja auch seit jetzt, glaub, mittlerweile 2 oder 3 Jahren einen. Ich verwende ihn nicht so oft, wie ich ihn verwenden sollte. Aber wenn man das mal benutzt, ist das exquisite, excellent. Höhenverstellbarer Tisch. Ich hatte mir ja damals so ein und so ein Gestell gekauft. Genau, ich hatte mir so ein und so ein und so ein. Keine Ahnung welches davon. Wahrscheinlich gar keins davon. Ich hatte mir so eins von so, es ist so und so Dinger hier, hatte ich mir gekauft und hab's unter meinen aktuellen, also elektronisch höhenverstellbar, ne, unter meinen aktuellen Schreibtisch drunter gebaut und danach einfach die Tischbeine abgeschraubt und schon war der alte Schreibtisch, ohne dass man abräumen musste, höhenverstellbar. Was geht jetzt ab? Das ist Pfeilfett, ja, das ist richtig Pfeilfett. So Leute, wir gucken uns jetzt erstmal so zum Einstieg. Wir gucken uns jetzt mal eine Desert Eagle Tactical Nuke in Modern Warfare 2 an. Einfach so, weil's geht und das erste Video ist, was ich aufhab. So. Busy, busy leise der Gute, hä? Wobei, ich laber da eh immer drüber. Man konnte die Desert Eagle so schön spammen, auch in Court 4 schon. Also so ziemlich das, was man wahrscheinlich mit der Pistole RL nicht machen würde. Wer hat das mal gestand? Nein, Black Ops 4 hol ich mir garantiert nicht. Äh ne, 5 oder? 5 sind wir doch jetzt sogar. Ich sag euch, Black Ops 5 für das Jahr werden auch verkaufsmäßig und insgesamt mäßig, also insgesamt, wo die Stonks abwärts gehen. Black Ops 5. Bisher, egal was es war, war ja Call of Duty mehr oder weniger immer erfolgreich und ging immer irgendwo hoch. Und sie haben es auch mit Kack Games geschafft, durch gutes Marketing und schöne Verpackung, das gut zu verkaufen. Also ich predicte einfach mal, dieses Jahr wird der Wendepunkt verkaut werden mit Black Ops 5. Es sei denn, es sei denn, das Game wird überraschend extrem geil, extrem gut. Aber geh ich mal nicht von aus. Sollten sie Black Ops 5 wieder irgendwas, dann predicte ich, dieses Jahr wird der Wendepunkt verkaut werden. 15.000 mittlerweile, hat er wie viele Abos? 250.000, ja. Also okay, dieses Gameplay ist, Gegner stunnen, hinrennen, killen, verstecken und dann wahrscheinlich Chopper, Gunner, Harrier, Nuke oder sowas. Harrier, Chopper, Gunner, Nuke. Gegner wieder. Nee, Peo, Peo, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe. Nee, nee, so habe ich das nicht gesagt. Entweder wird das Game extrem gut, oder aber, wenn es schlecht wird, dann wird es denge ich der Wendepunkt werden verkaut, dass es, dass es nicht mehr weiter nach oben geht. Das es, dass, dass dieses Jahr der Fall sein wird, ist halt nicht für recht wahrscheinlich. Wenn es dieses Jahr sacken wird, die Stonks nicht mehr weiter hochgehen. Ja, Karim kann auch gut sein. Ich müsste mir mal die Verkaufszahlen und solche Geschichten von Modern Warfare angucken, aber so mein Gefühl sagt mir, die waren eigentlich ganz gut, ja. Ich wusste gar nicht, dass man hier in die Ecke überhaupt kam. Okay, das ist eine Nuke. Das ist eine Nuke, wir machen fünf Kills und machen Harrier, Chopper, Karim, Nuke. Komm. Predator... Ach Gott. Jetzt schießt er nicht mal die Richtigen mit seiner Predator ab. Ich sag mal so, das hätte ich auch hingekriegt, das Einzige woran es bei mir gescheitert wäre, ich hätte nicht das Durchhaltevermögen gehabt, solange Desert Eagle Only zu spielen, bis ich ein gutes Gameplay gekriegt hätte. Ich glaube nicht, dass Battle Royale großartig dazu beitragen könnte bei Modern Warfare. Vielleicht ein bisschen, aber man hat es gesehen, das Battle Royale, ich meine, guck dir Firestorm an, das Battle Royale bei weitem nicht mal das ist, wo alle jetzt irgendwie danach lächzen, ja. Das ist auch schon wieder ein bisschen vorbei. Was sag ich gerade, der aktuelle Hype? Auto-Battler ist ja auch, Auto-Battler war ja gar kein richtiger Hype, da war ja gefühlt zwei Wochen und danach war es wieder vorbei. Ja, Escape, Tarkov ist doch auch mehr oder weniger Battle Royale, oder? Oder nicht? Keine Ahnung. Ne, Tarkov ist doch so eine Mischung aus Battle Royale und PUBG-Loot-Inventory-Management-Ding. Okay, das war jetzt ein langweiliges Gameplay. Warum ist Tarkov eigentlich auf einmal so beliebt, das gibt es doch schon drei Jahre oder so. Warum ist Tarkov gerade so beliebt? Versteht das jemand? Ich weiß, es gibt Trops, es gibt Trops und es gibt irgendwelche Achievement-Dinger fürs Gucken oder so, weil das gibt es doch schon richtig lange. Tarkov, das gibt es seit drei Jahren und das hat keinen interessiert bisher, wahrscheinlich nur deswegen. Okay. Gepusht durch große Streamer, ja das muss ja irgendeinen Grund geben, warum die das auf einmal alle gestreamt haben. Naja, zumindest, ich habe mal ganz kurz beim Lost geguckt, zumindest macht das Game den Eindruck, als hat es eine gewisse Tiefe, als kann man das eine Weile spielen. War das Paid-Promotion bei den großen Streamern oder haben die einfach gesagt, wir wollen es mal wieder spielen? Das ist ja der Unterschied, ich meine, Raid Shadow Legends ist Paid-Promotion, schwache Konkurrenz. Wir gucken uns jetzt mal hier einen Speed-Test-Vergleich an, was auch immer er da testet, ich muss mal schauen, ob das überhaupt was Sinnvolles ist, allein schon das Like und Dislike ausgeschaltet sind bei dem Video, ist schon verdächtig, wir gucken mal, wahrscheinlich ist das Video kompletter Crap, erstmal Intro, erstmal Intro, oh, der hört sich ja wahnsinnig motiviert an, ist das Text-to-Speech, der spricht so, wie ich mich gerade fühle, achso, ey, 1,5 funktioniert richtig gut, äh, Moment mal Leute, es ist Chrome, es ist Chrome und es ist Chrome, es ist nicht Chrome, also es ist quasi dreimal Chrome versus einmal nicht Chrome und die größte Frage ist, warum ist der Unterschied zwischen dreimal Chrome so unterschiedlich? Firefox ist auch auf Chrome, nein, ist es nicht, deine Seite-Ladenzeit kann man jetzt schlecht, also zumindest nicht einmal, das müsstest du vielleicht, vielleicht 500 mal machen, dass das halbwegs aussagekräftig wäre, was denn das für bescheuerter Test, das ist ja der bescheuertste Browser-Speedtest, den ich je gesehen habe, das ist wirklich so low-brainer, oi, oi, 3-Hat-Video, als würde Chrome 10 Sekunden hängen, seine Hinterhaltverbindung ist einfach kacke bei dem Refresh oder irgendwo wird es sonst woher geroutet, das liegt doch im Leben nicht an Chrome, da glaubt man nicht wirklich, dass, oh Gott, was ein Schwachsinnstest, das ist eher indisches Internet bei dem, was ein Schwachsinnstest, alter, was ein Schwachsinnstest, das kann ich mir da angucken, das hat 100.000 Views, es wird echt Zeit, dass ich diese 5 Chrome-Tipps während meines Lebens veränderndes Video mache, da krieg ich auch Views, alter, was ein Bullshit, übrigens ich hab den beschleunigt, man hört es aber kaum, weil er so langsam spricht, Nummer 4 wird dich schockieren, oder, nee, nee, geh fort, das kannst du mir nicht fertig angucken, geh weg, geh weg, so, was haben wir dann als nächstes, Downgrade and Lies, achso, da lässt sich über reforged aus, ich weiß nicht, ob ich mir das reforged Video schon geben will, komm, wir geben uns das reforged Video, mittlerweile habt ihr das gesehen, Metacritic reforged, ich hab ja auf Twitter gepostet, dass es für Blizzard richtig gut läuft gerade, du hast das Fazit skippt, ja, das Video war crap, so, ja, am Freitag, oder wann das war, 29, am Mittwoch, da war das Ganze noch 2.3, mittlerweile, passt mal auf, passt mal auf, ist auf 0,5, die haben so verkackt, Blizzard, please, das dürfte so ziemlich, ich weiß nicht, ob es das schlecht bewertetste Game ist auf Metacritic, es ist auf jeden Fall ganz unten mit dabei, 0.5, das ist wirklich für den Arsch, mal gucken, was denn so schlecht ist, also woran sich zum größten Teil gestört wird, ich hab's mir gar nicht, ich hab's weder Pre-Order noch, noch werd ich's mir kaufen, ich wollte es mir eigentlich kaufen, aber jetzt kauf ich nicht, also im größten Teil woran sich dran gestört wird ist eigentlich, also erstens mal die Performance, die Performance muss richtig schlecht sein, FPS Einbrüche ohne Ende, dass sie den alten Client durch den neuen Zwangs ersetzt haben im Battle-Net ist für viele auch ein Unding, dazu kommt, dass vieles was versprochen wurde einfach nicht drin ist, die Cutscenes sind glaube ich bis auf die Intro-Cutscenes und noch irgendwas nicht wirklich Remaked, sondern einfach nur nochmal neu gerendert, die ganzen Sachen, die sie auf der E3 Demo gezeigt haben, also von den neuen Kampagnen-Intros zu dem, wie die Kamera sich bewegt und wie die Missionen aufgebaut werden, dass es noch ein bisschen zusätzliches Story geben soll, ist auch alles nicht drin und die Multiplayer muss voll von Arsch sein, dass du noch nicht mal ein Ranking-System hast, ich mein, wie auch immer man das hinkriegt, es gibt irgendwie kein ordentliches Ranking, kein Clan-System, keine normalen Battle-Net-Chats mehr, es muss wohl einfach voll von Arsch sein, aber wir gucken uns das einfach mal an. Nächstes Stück in der Woche, er! Demo, die machen das Gegenteil von mir. Ich veröffentliche im Jahr 6 Videos und die veröffentliche ich in der Woche 6 Videos. Sag mal, Leute, irgendwie redet er anstrengend, oder? Ja, das UI und das ganze Zeug, das ist auch nicht im Game, das ist nicht drinne, also das, was man hier auf der Demo gesehen hat, gibt es so im Game nicht und am besten ist, dass man sich rausreden will, das beste ist, dass man sich rausreden will, so nach dem Motto, man hat das so gemacht, weil man auf die Fans hören möchte. Die World of Warcraft Lore, da blickt kein Mensch mehr durch, das ist mittlerweile so unglaublich, wir, da kannste nicht mehr, das checkt Blizzard selbst nicht mal mehr. Ach ja und es gibt auch noch ein großes Problem im Multiplayer, was zumindest die Pros sagen ist, dass die neuen Einheiten, also die neuen Models, dass sie zu unterschiedlich zu den alten aussehen, auch von den Umresten her, dass man nicht erkennt, was passiert. Das kann ich halt absolut nicht beurteilen. Ich verstehe halt nicht, warum er das preordert hat. Es gibt überhaupt keinen Grund, das Spiel wird rein digital vertrieben, rein digital. Warum, und das Chat jetzt ernst gemeinte Frage an den, warum sollte ich das preordern? Ich weiß, es gab irgendwie so einen komischen, es gab irgendwie einen preorder Skin oder sowas, aber warum, warum, warum genau sollte ich es preordern? Ja, genau, das braucht halt kein Mensch, dafür würde ich noch nicht preordern. Moment, das hat mit preorder nichts mehr zu tun, das ist, wenn ich die Spoils of War Edition kaufe, gibt für mich überhaupt keinen Sinn zu preordern, zu viel Ungeduld, naja, aber ich kriege es ja auch trotz preorder nicht früher. Ihr müsst mal auf Reddit gucken, wir sind am eskalieren die Leute. Man darf auch nicht vergessen, die Trailer, die sie rausgehauen haben mit den Änderungen, die dann, beziehungsweise mit den, mit den Vorschauen, mit dem Vorschau-Material, diese Trailer gibt es immer noch zu sehen, also sprich, man weiß gar nicht genau, wann man das Game kauft, dass es nicht drin ist. Auf jedem, auf jedem Blizzard Reddit, auf alles, alles, selbst, selbst bei Overwatch sind sie aber rum, vielleicht mehr über WarCraft. Geil oder, aus 4 Stunden werden einfach mal 4 Minuten, die ist richtig schlecht, also ich meine, die im Original gab es diese Cutscene war quasi nicht existent, also das war übrigens auch einer meiner größten Enttäuschungen damals in der WarCraft 3 Kampagne, dass es hier keine coole Cutscene zugab, es gab ein bisschen, also es gab eine 15 Sekunden Cutscene, wo Arthas Illidan platt macht, was heißt, der überlebt ja sogar, aber das war halt keine richtige Cutscene und da haben halt alle drauf gehofft, hey vielleicht gibt es jetzt hier endlich mal eine richtig coole Render-Cutscene für eines der quasi größten Momente aus der Kampagne, aber gibt es nicht, es gibt so ein komisch neu animiertes Ding, ich hoffe, er zeigt es mal, das ist so schlecht geworden, das ist so schlecht geworden, das ist so schlecht geworden. Da muss ich übrigens mal angucken, wie gut die WarCraft 3 Cutscenes heute noch ausschauen, ich meine, man sieht ihnen an, dass sie 20 Jahre alt sind, ja nicht ganz, 17 Jahre, wann kam das raus, 2003 oder so, genau, 2002, 2001, ich weiß es nicht, wann das genau rauskam, es ist auf jeden Fall schon 15 plus Jahre alt, dafür sehen die Cutscenes in 1008 Spielen gerendert wirklich beachtlich gut aus, äh Diablo 4 wird nichts, ich sehe Blizzard kein gutes, also zumindest kein richtig herausragendes Spiel mehr machen in der Richtung, ja, guckt euch mal die Kamera an, hier haben sie das richtig neu in Szene gesetzt und hier ist es einfach Kamera oben drüber und fertig. Ja, guckt mal, wie das ruckelt, Leute, oh wie das ruckelt, ach ja, Custom Maps funktionieren übrigens auch nicht richtig, das habe ich ja vorhin ganz vergessen zu erwähnen. Guckt euch mal, wie der Leiter des Menüs ruckelt. Guckt mal, wie der Leiter des Menus ruckelt. Klan, die sind nicht da. Es gibt auch keine Cross-Region-Spiele. Die neue Battle.net-Integration hat einige Features, aber sie haben viel mehr verloren in dieser Transition, als sie eigentlich gewonnen haben. Dendi Gila hat auch die End-User-License-Aufgabe geändert, sodass alles, was in der Welt-Editor gegründet wurde, die Intellektuellen Fähigkeiten des Blizzards sind. Ja, sie sind immer noch sehr salzig, überlose Dota, aber wenn sie das tun, haben sie ziemlich garantiert, dass sie nie wieder diese Lichtung ausbreiten werden. Das Menü ruckelt wegen Elektronen. Da sind sie selbst dran schuld. Wenn man auch alles im Browser machen muss... Genau. Vielleicht ist das Video auch von mir. Ich promotee mein eigenes Video. Also, sie haben so verkackt. Menü in Elektron war kein Chalk. Nee, nee, das war kein Witz. Ja, das finde ich für mich der größte Fail, dass man gesagt hat, okay, man ersetzt Hardcoded, also man ersetzt den alten Client zwangsgezwungen durch das neue. Vor allem, ich brauche jetzt 30G. Wie groß war das alte Game mit Addon 1,5G oder so? Sie haben es nicht nur einfach verkackt, sie haben das alte auch noch schlechter gemacht. Das musste er erst mal schaffen. Gerade in Russland, ey, ohne Scheiß, in China und Russland ist Warcraft 3 immer noch ziemlich groß. Oder war? Ja, weil die Leute, weil die festgestellt haben, es wollen irgendwie fast alle ihren Kram zurückgeben. Die Antworten da auch nicht drauf. Garantiert nicht. Das ist ja nichts Neues mittlerweile mehr bei Blizzard. Ich finde es halt krass, dass sich das bei Blizzard geändert hat. Früher war das ein Laden, der ganze Games nach jahrelanger Entwicklung einfach eingestellt hat, weil sie ihnen nicht gefallen haben letztendlich zu sowas. Hätte man nicht irgendwie einen Mittelweg finden können? Aber das geht halt nicht, wenn du nur noch Activision-BWL-Köppe oder andere Spiele hast, wie StarCraft Remastered. Ich glaube, das Blamen ist wirklich nicht fair. Ich glaube, das ist eigentlich alles bei Blizzard. Das klassische Team, sie wollten wahrscheinlich dieses Spiel machen, nur weil sie War 3 lieben. Aber sie waren wahrscheinlich mit einem Schussring-Budget und hatten wahrscheinlich keine guten Art-Ressourcen, um in einer effektiven Weise mit Lemon Sky zu koordinieren. Ich glaube, es ist ein Spiel, das wahrscheinlich schlechter aussieht, als das Original, sogar nach einem viel späteren Release-Date. Es ist gebrochen, es ist gebrochen, und das Original kann nicht mehr in der gleichen Weise gespielt werden, weil sie Old-Venet getötet haben. Und wirklich, ein Reddit-User hat einen sehr aufregenden Kommentar geblieben. Blizzard hat immer etwas über absolut flottes Polieren gemacht. In den vergangenen 90er- und 2000er-Jahren war Blizzard ein Name, und das war es auch. Das stimmt. Ja. Aber Microsoft ist ja zurzeit eh so ein bisschen auf dem Trip, dass sie wieder ein bisschen mehr auf Echtzeitstrategie-Sachen setzen. Ich weiß auch nicht so richtig, warum. Vielleicht weil sie sich denken, das spielt sich am besten auf dem PC. Ja, alle recht. Und... Die Sache ist halt auch die, jetzt wo Diablo 4 am Start ist, und es kommt ja auch Path of Exile 2, für mich ist es so, dass nicht irgendwie Path of Exile beweisen müsste, dass es besser sein kann als Diablo. Es ist eher umgedreht. Diablo 4 muss beweisen, dass es auch nur ansatzweise an Path of Exile kratzen kann. Path of Exile hat es lange bewiesen, dass es der bessere Nachfolger als Diablo 2 ist, als Diablo 3. Die müssen das überhaupt nicht mehr beweisen, und Blizzard müsste ein absolutes Meisterwerk mit Diablo 4 releasen, dass die an Path of Exile oder beziehungsweise an das, was sie mit Path of Exile 2 vorhaben, dran kommen. Oder aber, sie müssten es mit Path of Exile 2 extrem krass verkacken, wovon ich aber nicht ausgehe, weil die haben es jetzt geschafft seit 5-7 Jahren, vielleicht schon, ich schon ein bisschen älter, immer gute Erweiterungen zu bringen. Wir gucken uns fast nie Level Cap an, aber das interessiert mich tatsächlich, wenn wieder irgendwelche Leute bei Battlefield abhauen. Mal gucken, um was es in dem Video geht. Der macht ja manchmal ganz gerne Videotitel, woran dann 2 Sekunden was zu sagen, dann ist es wieder weg. Aber mal schauen. Okay, es ist doch kein Video, was da drüber geht. Das Wichtigste zum nächsten Mal. DICE entdeckte die nächste Map, die in Battlefield 5 kommt, mit der 68-Zart-Update. Solomon Islands nimmt Spieler in den Pacific. Die Beachier öffnen die Beach-Terrain, die Menschen um sich herum. Die Update enthält 3 neue Waffen und 2 neue Gadgets. Der Type 11 LMG, Model 37 mit Schockgerät und M2-Karbein werden alle angeboten als Teil Ist der Panzer komplett bescheuert? Warum trifft er den nicht? Nope Panzer! An A-Aim! Ich glaube nicht, dass sie Overwatch 2 richtig verkacken würden, weil Overwatch 2 ist ja nicht Overwatch 2, Overwatch 2 ist Overwatch 1 mit ein bisschen Kampagne, also es ist eigentlich eher Season Pass Overwatch, es ist im Prinzip noch das gleiche, also sprich wenn ihr das alte Overwatch gefällt, dann gefällt ihr wahrscheinlich 2 auch. Oh, so lange noch, so lange bis neues Battlefield, was soll ich denn dazwischen, geht ja gar nicht, was soll ich denn, ich kann jetzt 2 A kein Battlefield mehr spielen. Moment. Okay, wenn der FIFA Director jetzt neuer Battlefield Chef wird, dann, dann, dann, ich weiß gar nicht, was ich da zu sagen soll. Der hat keinen Bock mehr auf den Scheiß. Ja, der hat keinen Bock mehr auf den Kram. Ich hoffe, das stimmt ja, ich bin ja immer noch zuversichtlich, dass was dran ist, dass irgendwo da einer bei Anbet Company 3 arbeitet. Okay, das Restliche von dem Video muss man sich mal angucken, mich hat das eigentlich nur mit Battlefield interessiert. I bought, was, 2TB USB, I got more Malware, ah ne, da hab ich jetzt keinen Bock mehr, using Linux, aber wobei, komm wir gucken uns mal das Malware Video an, was haben wir sonst noch zu bieten. Kennt jemand Tactical Ops, der Counter-Strike-Clone mit UT-Engine? Nö. Es gab mal ganz, ganz früher so nen Unreal Tournament CS-Mod, ist das das? Nee, oder? Das ist schon ural, schon 15, 20 Jahre alt oder so. Ja, das ist auch das blöde Gefühl, was ich habe, selbst wenn sie in Bad Company 3 machen, dass es halt mit Bad Company nix mehr zu tun hat. Moment, wie viel kostet das? Ist das Kanada, Kanadische Dollar oder so? C Dollar? Ich glaube das Video ist langweilig. Ich glaube das ist langweilig. Ne, das glaube ich langweilig. Ok, was haben wir sonst noch für Videos zu bieten? Hat jemand irgendwas, was wir unbedingt im Stream gucken müssen? Was? Media Markt, WTF? Media Markt, Gaming, PC, Fehlkauf, Gaming, Schrott. Ok, das klingt eigentlich ganz gut. Es ist eine Wonne, dass du wieder dabei bist, denn mir ist in letzter Zeit etwas, sagen wir mal, interessantes aufgefallen. Seit einigen Wochen, wenn nicht sogar schon seit Monaten, werden alle paar Tage Artikel veröffentlicht, wo es heißt, dass Media Markt und Saturn wieder neue Gutscheine herausgegeben haben. Wir haben Gutscheine. Dieser Gaming PC hört auf den charmanten Namen Captiva Gaming R48645. Warum? Keine Ahnung. Zuerst wollte ich den Rechner tatsächlich kaufen und testen, aber ich habe da eine bessere Idee. Wieso bauen wir den PC nicht einfach nach in besser? Der Rechner kostet 619 Euro, die eSports für richtige Tastatur und alles haben wahrscheinlich einen Wert von 120 Euro. Deswegen würde der Rechner an sich wahrscheinlich für glatte 600 Euro weggehen. Dafür bekommen wir einen AMD A8 9600 Prozessor. Was sind das? Das ist eine APU, oder? So was ziemlich Altes schon. Wahrscheinlich Platz 1 der Top 10 irrelevantesten CPUs. Ich meine, das ist ein 50 Euro Prozessor. Schreibt mal in die Kommentare, ob ihr überhaupt wusstet, dass diese CPU überhaupt existiert. Keine Ahnung. Das ist so ein Ding abkömmlich von dem, was in der aktuellen PS4 drin ist, oder? Dann muss ich halt so los, aber auch die Grafikkarte finde ich durchaus beeindruckend auf eine merkwürdige Art und Weise. Das ist eine GTX 1050 Ti. Stellt sich natürlich die Frage, wie kommt man eigentlich überhaupt noch im Jahr 2020 an eine so alte Grafikkarte ran? Die Karte ist bald 4 Jahre alt und war im Jahr 2016 und darauf eine wirklich tolle Grafikkarte, aber doch nicht mehr 2020. Der Rest ansonsten ist langweiliger Standard. 120 GB SSD, 1 TB HDD, A320 Mainboard. Man bekommt noch einen Terabyte Platten. Im Vergleich dazu habe ich diesen Rechner hier gebaut. Es gibt so ein paar feine Unterschiede, die muss man nicht machen. Ich habe mich zum Beispiel für eine 512 GB große SSD entschieden. Jetzt müssen wir uns das Video auch nicht weiter angucken, weil wir wissen ja schon, was Sache ist. Wir wissen, dass das ein MediaBug PC ist, der ziemlich crap ist. Ich kriege in der oberen rechten Ecke, das ist mir jetzt schon öfters aufgefallen, immer in der oberen rechten Ecke, aber in der oberen rechten Ecke kriege ich immer Essen angezeigt. Also wenn ich Essen angezeigt kriege, dann meistens in der oberen rechten Ecke. Und ich weiß nicht warum. Was haben wir als nächstes? Using Linux at Work, Applications I use. Da bin ich mal gespannt. Ich habe ja auch so ein paar Sachen. Ich arbeite auch nur mit Linux auf der Arbeit, außer mit meiner Windows VM, die ich brauche, weil wir Outlook verwenden und Skype for Business und so. Wer schon mal in den Genuss gekommen ist von Skype for Business, wird wissen, wie toll Skype for Business ist. Aber mal gucken, was er uns hier vorschlägt. Hallo Nick. Ist das Gimp? Gimp ist abartig. Gut. Er verwendet zumindest schon mal eines, der haben wir ja auch schon ausprobiert, der in Anführung steht Noob Linux Distribution, die wir im Stream zumindest für ganz brauchbar gefunden haben. Also wir hatten ja zwei Sachen. Also bisher muss ich sagen, Elementary war glaube ich ganz gut und Deep in Linux fand ich glaube auch ganz gut, wenn ich das noch so richtig in Erinnerung habe. Der Rest war eher so naja. Also das Slack. Weißt du was ich mich frage? Viele machen es ja mittlerweile so, dass die den Kram sogar hosten lassen irgendwo. Und wenn man, wahrgenommen man ist eine Firma und man sagt man braucht eine Chat Lösung und man hostet die irgendwo bei irgendeinem Anbieter oder in irgendeiner Cloud oder sonst was, warum nimmt man da nicht gleich Discord? Ich weiß, Discord ist halt nicht so Business Style, weil für Gamer und sowas. Aber du hast die gleichen Nachteile, du weißt nicht wer dein Kram mitliest im Endeffekt. Aber dafür funktioniert Discord ordentlich. Meinst du sowas ist wie das Code in der Cloud? Hä? Was meinste? GitLab ist tatsächlich ziemlich gut. Wir wurden ja zwangsumgestellt auf Bitbucket auf der Arbeit. Also ich hatte lange Zeit habe ich selbst eine GitLab Instanz laufen gehabt bei mir. Also für die Leute auf der Arbeit. Also bei mir meine ich nicht bei mir daheim oder so, sondern halt auf einer Kiste bei uns auf der Arbeit, wo ich mich darum gekümmert habe, weil ich gesagt habe GitLab ist von allen Sachen irgendwie finde ich das angenehmste. Zumindest auch zur damaligen Zeit und wir mussten wir mussten Bitbucket verwenden, weil konnte mir keiner so genau erklären, aber wir mussten wir mussten Bitbucket verwenden. Gitea habe ich daheim, ja das ist gut. Open Office. Office. Geh weg. Teufel weiche. Office. Open Office. Ja tschüss mein Name, ich kann es aber einfach nur gerade installieren. Was ist das? Was ist das? Ah Gimp. Glimps. Was ist der Unterschied zwischen Gimp und Glimps? Glimps. Ein Gimp-Fork. Ich hätte nicht gedacht, dass sich das irgendjemand freiwillig antut Gimp zu forken. Es gibt Sachen, man lernt nie aus. Die haben sich wegen den Namen gestritten, okay. Ja das Icon ist nicer, da kann man sich jetzt drüber streiten, ob das ein guter Grund ist. Und der Name? Gimp. Meine Güte, man kann sich doch über alles aufregen. Ich weiß, früher war Gimp in Online-Games eine Beleidigung. Gimp vergimpter Speck oder irgendwas. Aber trotzdem, dass das 2020 jetzt irgendwie, dass man das wegen forkt. Juck mich überhaupt nicht. Ja das kann er ja machen. Ich hoffe, dass SYNK das da aber nicht seine Arbeitssachen hätten. Ah ja doch. Yolo. Scheiß drauf. Ich weiß halt nicht, wer was, aber egal. Einfach mal gesynkt in irgendeine Cloud. Ja, guter Mann. Firefox. Huge. Warum? Hier, Serious Max, genau das habe ich mich auch gerade gefragt. Warum hat er auf seinem Arbeitsrechner Steam drauf? Genau das habe ich mich auch gerade gefragt. Was macht er mit Steam? Dash habe ich auch nie was von gehört. Es bestimmt irgendeinen Cloud. Es garantiert irgendeinen Cloud Password Manager und ich würde ihm leben nicht. Warum? Warum kommen Leute auf die Idee, Cloud Password Manager zu verwenden? Wenn man sie selbst taustet, ok, verstehe ich noch. Aber warum Cloud Password Manager? Komfort? Ja klar, mir ist schon klar warum. Aber was reitet einen? Ich meine, so viel Komfort kann es doch eigentlich gar nicht geben, dass ich irgendeinem Cloud Dienstleister Zugang zu meinem Leben überlasse. Das werde ich nie verstehen. Das werde ich nie verstehen. Wie kann man einen Cloud Password Manager verwenden und sich danach wirklich beschweren, dass uns irgendwelche Accounts nicht mehr... Nein, verstehe ich nicht. Wallpaper Engine gibt es nicht für Linux. Nicht, dass mir bewusst wäre. Das will ich gar nicht. Ich habe das bei mir auch, teilweise habe ich Sachen im Chrome hinterlegt zum automatisch ausfüllen, aber zum größten Teil will ich gar nicht, dass es automatisch ausgefüllt wird, weil die ganzen automatisch ausfüllten Dinge oftmals ein bisschen doof sind, in welche Felder sie was eintragen und ich habe schon erlebt, dass zumindest das Chrome automatisch ausfüllt Dinge, manchmal private Informationen automatisch ausfüllt in Feldern, die gar nicht diese Informationen enthalten sollen. Ich habe mir gedacht, aber ne, bin ich nicht. Okay, es ist... Okay, irgendwie verwendet er nichts, was mir gefällt. Ich verwende KeyPass, ja. Und für KeyPass gibt es Plugins, die das machen können, was du schreibst, der Dekan, aber ich mache die gute alte Copy-Paste-Taktik. Der nutzt die Sachen, because it looks nice, ja. Er ist halt auch Product-Owner. Ja, da von Technik kein Schimmer. Wobei das nicht unbedingt, dass ich das eine und das andere ausschließe, ne. Warum schwankt eigentlich meine Viewerzahl gerade so extrem von 190 zu 230 hin und her? Was ist da... Warum? Was ist mit Twitch gerade los? Was hältst du von LastPass? Ich halte prinzipiell von allen Cloud-basierten Passwort-Managern, die man selbst haust, in nichts. Ich weiß, dass LastPass ziemlich beliebt ist und wahrscheinlich auch nicht die schlechteste Variante ist, aber ich verwende aus Prinzip nichts, wo ich... Passwörter, ich meine, man darf nicht vergessen, Passwörter sind so die Grundlage für alles, was man online hat, ja. Für alles. Und jeder Account hat irgendwie eine Kombination aus Username und Passwort. Vielleicht hat man Glück an 2x Cloud-Anifizierung, aber trotzdem, warum sollte ich diese Login-Geschichten einem Cloud-Dienstleister anvertrauen? Viele Cloud-Dienstleister sagen, sie haben selbst keine Möglichkeit, das Passwort zu sehen, weil es kleinzeit verschlüsselt wird, aber ganz ehrlich, ich sage Leute, rechts oben Essen. Immer rechts oben ist Essen. Immer. Aber ich habe keine Ahnung, ob das stimmt, was die sagen. Und vor allem bei Mobile-Clients, also sprich, wenn man jetzt von iOS oder Android, Windows-V lassen wir mal aus und vor, Passwort-Managern schon ausgeht, dann kann es auch durchaus sein, dass die App wunderbar toll funktioniert, der Hersteller irgendwie verkauft wird und ich ein Update kriege, was dann auf einmal doch meine Passwörter überträgt. Das ist theoretisch überhaupt kein Problem. Und ich weiß nicht, also ich bin nach wie vor, ich bin bei KeyPass hängen geblieben. Na gut, wir haben hier, ich habe hier natürlich keine Passwort-Datenbank auf dem Account gerade. Sowas wie Bitwarn selbst gehostet ist auch okay, wenn man was ist, was man online haben will und die ein bisschen polischtere App haben möchte, aber ich fahre mit KeyPass echt ganz gut. Würdest du deine KeyPass-Datei zum Beispiel zu Google Drive hochladen? Nö. Nö, würde ich nicht. Bitwarn hat einen Security-Audit bekommen. Ja, hier nPass und die anderen, die haben auch alle Security-Audits bekommen, aber warum sollte ich, prinzipiell ist es doch ganz einfach. Wenn mein Passwort quasi meinen Hoheitsbereich nicht verlässt, dann habe ich ganz viele Angriffsszenarien schon mal, die sind gar nicht möglich. Die gehen halt einfach nicht. Und selbst wenn ich, sagen wir, ich lade meinen KeyPass auf Google Drive hoch und ich weiß, okay, KeyPass ist sicher, hat keine Probleme, ich kann das ohne Probleme bei Google Drive hochladen, dann könnte ich das machen, aber wer sagt mir denn, dass in 30 Jahren, vielleicht jetzt übertrieben, in 10 Jahren, der Kram immer noch sicher ist? Vielleicht wurden ja irgendwelche Schwachstellen in der Zwischenzeit erkannt. Also am besten ist, einfach den ganzen Kram erst gar nicht in die Cloud laden. Einfach gar nicht, einfach gar nicht in die Cloud laden. Wie benutzt du KeyPass auf dem iPhone? Gar nicht. Gar nicht. Also es gibt die Möglichkeit, das zu sünden, beispielsweise über den Next Cloud oder irgendwie SYNCthing oder C-File, irgendwas. Kann man machen. Aber ich wende das gar nicht. Ich bin eh mit den wenigsten Sachen eingeloggt auf meinem iPhone. Das Einzige, wo ich eingeloggt bin, ist Twitch. Und das muss man sich eh einmal in der App einloggen. Also sprich, das bringt über. Was ist mit Twitch los? Die Zuschauerzahlen schwanken von 180 zu 234. What? Was, was, was, was, was war Twitch wieder kaputt? Leute, PTF. Kennst du zufällig Passwortmanager, die ähnlich convenient sind wie LastPass, die man selbst ausgelt? Ja, angeblich ist Bitwarden RS selbst hosted gar nicht schlecht. Weiß ich aber auch nur vom Hörensagen. Weil ich es selbst noch nie verwendet hab. Keine Ahnung. Aber ein Projekt hat nicht umsonst 2,8K Sterne auf GitHub. Also gar so scheiße kann das nicht sein. Scheint ganz okay zu sein. KeyPass Nextcloud ist auch mal klar. Du kannst ohne Probleme deinen KeyPass sinken. Hab ich ja gerade gesagt, gibt's ja verschiedene Varianten, wie du das machen kannst. Muss ich halt wirklich, man muss sich halt überlegen, braucht man echt seinen kompletten Passwort Safe Mobile? Weil unterm Strich, was verwendet man denn Mobile? Du verwendest vielleicht einen Messenger. Die haben alle eine eigene App, in der du dich einmalig authentifizieren musst und dann geht's halt. Twitch, YouTube, da meldest du dich auch einmal an und dann nie wieder. Was sind denn eure Anwendungszwecke für Passwortmanager auf Mobile? Ich hab keinen. Wenn ich einen hätte, dann würde ich mir vielleicht überlegen, aber ich hab aktuell keinen. Einkaufen am Handy im Browser, da hab ich die Amazon App und bei der Amazon App bin ich eingeloggt und es funktioniert. Und dazu kommt, dass das Amazon Passwort tatsächlich eins ist, was ich mir merken kann. Wenn man woanders ist und sich allen noch ein bisschen am Fremden rechnet. Okay, ja, verstehe ich, mache ich nicht, aber verstehe ich. Extra Safe fürs Handy, wo weniger drin ist, das ist auch eine gute Idee, ja. Dann muss es 1, 2, 3, 4, 5, 6 sein. Scheiße, Passwort Leak. Okay, also ich sehe, es gibt tatsächlich Anwendungszwecke dafür, ja, okay. Ja, leuchtet ein. Wie gesagt, hat mich jetzt nur interessiert, weil ich halt irgendwie keinen Anwendungszweck dafür hab. Okay, also die Programme, die er hier verwendet, sind echt nicht so mal ein Fall. Was haben wir sonst noch so zu bieten? 5 Linux-Distros in 2020, ja, da bin ich ja gespannt, was er da vorschlägt. Wir haben ja schon viele Linux-Distros hier im Stream ausprobiert. Uns wirklich gefallen hat mir, glaube ich, nur Elementary OS, also als Noob Desktop-Distro, nur Elementary OS und letztens Deepin, China Linux. Am besten finde ich ja natürlich immer noch meinen Manjaro mit i3. Was nutzt du für eine Lösung für Kontakt und Kalender? Nutzt du Google Kalender? Nee, dafür verwende ich tatsächlich die CalDAV-Geschichten aus Nextcloud. Es ist nicht der Weisheitsletzter Schluss, aber es funktioniert ganz gut. Zumal es direkt eins zu eins ohne Zusatzsoftware in iOS gut funktioniert. Und unter Android gibt es einen CalDAV-Sync, der ist auch ganz gut. Leider gibt es für Windows Nix Gescheites. CubeOS haben wir uns ja nicht angeguckt, nee. Ja, Ubiqui, diese Sachen finde ich auch, es ist eine coole Geschichte. Hast du lokale Nextcloud? Ich habe die nur lokal. Meine Nextcloud ist nicht online erreichbar. Ich mache das einfach so, wenn ich etwas zu Synken habe, was jetzt nicht so wahnsinnig viel ist, da Synke ich das halt, wenn ich daheim im WLAN bin. Ich habe ganz selten mal bisher das Bedürfnis gehabt, dass ich unterwegs gesagt habe, ach Mist, könnte ich jetzt mal auf meine Nextcloud zugreifen. Die ganzen Geräte, die man heute hat, die haben genug Speicher, dass man einen Tag überlebt ohne Probleme und es wenn man daheim im WLAN ist Synken kann. Es gibt im Prinzip, du machst eine Handvoll Photos vielleicht, ja. Ich habe schon öfters mal ein paar kleine Audiosachen aufgenommen mit dem Handy. Aber ansonsten gibt es nicht viel, was ich Synken muss. Notizen, ja. Wie syncst du dann Kalenderkontakte mobil über CalDAV? Das ist überhaupt kein Ding. Oder iOS kannst du direkt hinzufügen. Wobei ich ehrlich gesagt gar nicht weiß, ob das unter iOS 13 noch so gut funktioniert. Da gab es nämlich mal irgendwelche Probleme, habe ich letztens gelesen. Aber du kannst es ohne Probleme hier, die CalDAV-Geschichte von Nextcloud synken. Für Android gibt es hier CalDAV Sync, Android gibt es ein gutes Plugin. Das da, ich weiß nicht, ist es das da? Das da ist es glaube ich. Ich glaube das da. Ist ganz okay, wobei es zig andere Varianten gibt und Apps, die es direkt können. Und du kannst unter iOS direkt einbinden. Unter iOS ist es standardmäßig ein bisschen besser integriert, weil du hast Kontakte, Kalender und die To Do App unterstützen das alles. Das ist eigentlich ganz praktisch. Leider das größte Problem ist, dass es auf dem Desktop kaum gescheite Anwendungen gibt. So bescheuer das jetzt klingen mag, aber eine ordentliche PIM-Lösung mit CalDAV-Integration gibt es nicht so viele. Am besten sind die tatsächlich unter Mac OS, die es gibt. Da ist das relativ verbreitet. Aber für Windows und Linux gibt es sehr wenig. Thunderbird kann es ein bisschen, aber die Bedienung von Thunderbird ist zum größten Teil eine absolute Zumutung. Windows kann es standardmäßig nicht. Was ja auch übrigens total lächerlich ist, dass Windows standardmäßig keine To Do App dabei hat. Und die einzige To Do App, die es für Windows offiziell gibt, nur mit irgendeinem komischen Outlook Konto oder was das ist, funktioniert, was dann auch total hängen geblieben ist. Unter Mac hat man da tatsächlich die beste Auswahl, aber es gibt eins, zwei, die ganz gut sind. Ansonsten muss man Thunderbird verwenden für Kontakte und Kalender. Es gibt schlimmeres, aber sonderlich schön ist Thunderbird auch nicht. Was ich eine Weile unter Windows verwendet habe, ist das Ding, weil das noch mit die beste CalDAV-Integration für Windows hat. Da steht zwar Mail, aber ich verwende das eigentlich nur dafür. Die Integration hier ist ganz gut, aber es ging mir irgendwann auch auf den Sack. Ich bin jetzt bei Thunderbird gelandet, weil Thunderbird ist halt Cross-Platform für Linux und Windows. Das heißt, ich habe das einmal ordentlich eingerichtet und verwende jetzt halt mein Kalender- und Kontakte-Kram aus Thunderbird. Was ich für Notizen verwende und kleine To Do's ist mittlerweile das da. Das ist auch nicht der Weisheitsletzter Schluss so wirklich. Ich meine, das ist eine Elektronen-Anwendung. Aber das ist ganz nice. Die haben viele Funktionen eingebaut, die sehr praktisch sind und die auch Cross-Platform funktionieren. Also sprich, die Notifications funktionieren mittlerweile komplett Cross-Platform. Man kriegt auch nicht einfach so 12.000 Sterne auf GitHub. Das ist ganz nice. Ich kann euch das nochmal kurz zeigen auf meiner Linux-VM. Ja, es ist eine Elektron, aber irgendwo gerechtfertigt in dem Fall, dass es Elektron ist. Denn man darf nicht vergessen, die bieten eine App an wirklich für jede Plattform. Die haben Apps für Windows, Mac OS, Linux, Android, iOS. Also umfangreicher kann es nicht sein und da kann ich verstehen, dass man auf Elektron setzt. Eben einfach aus dem Grund, dass der Mist überall ohne Probleme funktioniert. So, ich kann es euch mal kurz zeigen. Ich glaube, ich habe es hier irgendwie... Ah nee, ich habe es gar nicht installiert. Dann installieren wir es jetzt einfach mal. Das ist tatsächlich ganz nützlich. Ja, ja, ja, ja. Ah, yes, yes, yes. Wir akzeptieren einfach mal alles. Oh, ich glaube, das müssen wir zusätzlich installieren, sonst macht das nichts. Macht das nicht. Ah nee, macht okay. Windows kann doch auch... Nein, kann es nicht. Das konnte... Windows 10 konnte das mal über Trick 17... Ähm, ähm, ähm, Kalender. Man konnte mal über Trick 17 hier ein iCloud-Konto hinzufügen. Und das konnte man umbiegen auf seinen eigenen CalDAF-Server, weil iCloud intern CalDAF verwendet. Aber wirklich gut funktioniert es nicht. Warum es nicht einfach eine Möglichkeit gibt, CalDAF zu adden, bei Windows verstehe ich nicht. Das ist das einzige halbwegs standardisierte Protokoll, was es für Kalender und Kontakte überhaupt gibt. Es ist eklig, es ist alt, es ist XML-basiert, aber ansonsten gibt es halt nichts großartig. Ja, ich installiere das mal, da kann ich es euch gleich zeigen. Aber das ist tatsächlich für Notizen finde ich aktuell das Beste, weil es gibt es für jede Plattform. Und es hat plattformabhängige Implementierungen für Notifications und sowas. Das ist ja praktisch, sprich, ich kann beispielsweise ein To-Do anlegen und hinschreiben, hey, ich hätte gerne Benachrichtigungen heute Abend um 15.30 Uhr, dass ich noch einkaufen gehen muss. Und dann kann ich das beispielsweise auf meinem Lidungsrechner, auf der Arbeit, kann ich das To-Do anlegen. Ich sinke das Ganze und wenn ich im Zug sitze, 15.30 Uhr, kriege ich dann dort eine Notification, dass ich noch einkaufen muss. Das ist cool, das funktioniert mit anderen Lösungen so problemlos cross-Plattform nicht. Deswegen verzeihe ich es der Geschichte auch, dass sie elektronbasiert ist und halt unnütz viel Arbeitsspeicher frisst. Wenn man da weniger Bedenken hat und auf Cloud-Lösungen setzen möchte, die extern laufen, dann ist es kein Ding. Also sprich, wenn man sagt, hey, ich verwende Google-Kalender oder ich verwende irgendwas, was bei Office dabei ist oder sonst was. Wenn man das machen will, ist überhaupt kein Problem, dann geht das einfacher. Aber ich lege halt Wert darauf, dass der Kram, den ich da reinschreibe, nicht in der Cloud landet, sondern bei mir bleibt. Gesynkt wird das über Nextcloud. Aber ich wollte mal in nächster Zeit mal Dings probieren, Syncthing. Und das da, das haben die einfach nur hingeschrieben, weil es sich gut liest. Letztendlich ist das Plain Text, das sind Textdateien, die kann man syncen mit allem, was man will. Es ist vollkommen egal, es muss nicht Nextcloud oder Dropbox sein, es kann alles sein. Es kann alles sein, was Text, es kann auch C-File sein, es kann alles sein, was Textdateien syncen. Ach ja, und der Webklipper ist auch sehr cool. Der Webklipper ist übrigens sehr praktisch. Und dann noch ein weiteres Tool, was ich verwende für Browser. Nein, nein, ich nicht Fokus, Flocus heißt das. Für Bookmarksync, allerdings nur für spezielle Ordner, ist das hier, wie gesagt, auch so viel Schere gibt man nicht ohne weiteres. Das ist ein Browser-Plugin, da kann man für Nextcloud seine Bookmarks syncen. Und jetzt nicht, dass man ein extra Programm braucht, wo man dann seine Bookmarks drin verwaltet. Nein, man kann ganz einfach die Standard Bookmark-Funktion in einem Browser verwenden und die dann syncen lassen. Das ist sehr praktisch, auch ordnerbasiert. Das ist wirklich cool, das ist echt nützlich. Ja, und das hier kann ich nur empfehlen. Mal gucken, ob der Kram jetzt installiert ist. Nee, der ist immer noch am rumrödeln, was auch immer er da macht. Also das kann ich euch als Notizprogramm echt nur empfehlen. Was hältst du von der iOS-Intern-Kalender ab? Ich finde die ganz okay, also mir reicht sie, ich habe keine extra Kalender-App. Ich habe mal vor einer Weile, habe ich als Kalender-App, was war das? Habe ich mal eine andere verwendet, dass ich besser meine Business, quasi in Anführung meine Business und privaten Kalender besser trennen kann? Was hatte ich denn da? Aber das verwende ich nicht mehr, das war aber auch ganz gut. Das könnte das gewesen sein, aber ich glaube, das war was anderes. Ja gut, der ist halt dabei. Nee, keine Ahnung, das finde ich nicht mehr. Das andere war auch ganz okay, aber ich verwende die Standard-iOS-Studio-App. Was macht der denn hier? Die Standard-iOS-To-Do-App, die Standard-iOS-Kalender und die Standard-iOS-Kontakte. Kennst du Windows für Two-Factor-Authentification? Nö, habe ich noch nicht verwendet. Das sagt mir jetzt auch gar nichts. Nutzt du eigentlich irgendeinen besonderen E-Mail-Anbieter? Nö, ich habe seit 25 Jahren oder so eine private E-Mail-Adresse bei GMX. Und seit ich YouTube-Gedöns mache, habe ich insgesamt drei Google-Mail-Adressen und fertig, reicht. Eine für Business-Gedöns, unabhängig vom Google-Account, dann die Google-Account und dann was zum Ausprobieren. Und für Android-App-Store-Geschichten und so. Ja gut, es gab 1995 noch nicht so viele Anbieter außer GMX in Deutschland. Oder Freenet gab es noch. Und Web.de gab es dann auch noch irgendwann. Die Online-E-Mail-Adresse hatte ich auch, weil die online halt beim Provider dabei war, habe ich aber nie verwendet. Hey, was streamst du hier so? Also aktuell gucken wir uns eigentlich nur ein paar technisch-bezogene YouTube-Videos an, wie wir das jeden Sonntagmorgen machen. Wobei was heißt nicht nur technisch-bezogene, alles was einem so unterkommt. Zum, wie es im Titel steht, aufwachen. Genau, ich wollte euch ja mal das Notizprogramm zeigen. Also, das ist eigentlich ziemlich praktisch. Es unterstützt standardmäßig hier Plain-Text-Notes und kann Markdown-Rendern. Das mache ich aber immer aus. Und das Beste für euch natürlich jetzt gleich am Anfang. Das Ding hat ein, Moment, wo ist es? Das Ding hat ein Darkseam. Das ist schon mal wichtig. Ohne Darkseam geht ja bekanntlicherweise nichts. Hast du auch so eine tolle Unity-E-Mail-Adresse? Vielleicht, keine Ahnung, habe ich noch nie ausprobiert. Was ist denn das für ein Application-Lauter? Das ist ROFI, nennt sich das Ding, oder ROFI. Das da, ist das, das da. So, und, das wollte ich euch jetzt zeigen, genau. Man kann einstellen, dass man Synken will zu zum Beispiel Nextcloud. Oder, dass man Synken will, wenn man Filesystem einstellt, ist auch okay. Dann kann man, dann Synkt das automatisch. Hier kann man halt Nextcloud direkt angeben. Gibt man seine Nextcloud-Instance, dann kann man seine Notes Synken. Und der Web-Klipper ist auch sehr nice. Da kann man nämlich direkt quasi einen Snapshot von der Webseite darin speichern, in Notizen. Und was ich halt sehr praktisch finde, ist, dass man hier sagen kann, zum Beispiel, New to do. Und hier kann man direkt jetzt auswählen, wann das Ganze alarmieren soll. Und wenn man das Synkt, haben sie das so gemacht, dass diese Alarm auf allen unterstützten Plattformen funktioniert. Also sprich, wenn ich das jetzt Synken würde in meine Cloud. Cloud ist jetzt bescheuert, wenn ich einfach Filesynk mache, ja, irgendwo hin. Was auch immer ich für einen Anbieter verwende. Und mein Smartphone Synkt sich auch. Dann kriege ich dort quasi für die Plattform funktionierend Notification. Das ist wirklich sehr praktisch. Also das Ding hier kann ich empfehlen. Ja, das ist die Anwendung, die ich gerade aufhab. Das Ding kann ich empfehlen. Ein bisschen doof ist natürlich, aber mit irgendeinem Tod muss man sterben, dass der Kram halt... Dass der Kran halt ordentlich RAM braucht, ja. Das Ding braucht halt irgendwie jetzt erstmal 400 MB RAM, weil es halt elektronenkacke ist. Aber es ist halt nun mal so. Was willst du machen? Ach ja, was auch noch praktisch ist, dass man den so einstellen kann, dass er standardmäßig im Hintergrund läuft, anstatt dass er sich schließt. Was natürlich für Notifications ganz praktisch ist, ja. Und ich hab das bei mir privat auf dem anderen Account eigentlich immer auf und auch immer laufen. Irgendwohin muss man ja mit seinen 16 GB RAM. Wobei, hab ich überhaupt 8 oder 16? Ich kann mir das immer nicht merken. Ich hab, wie viel RAM? 16, okay. Wenn man sich sein eigenes RAM schon nicht merkt, kann man nicht merken, wie viel RAM man hat. Ach, deswegen kriege ich die... Deswegen schwankt die Viewerzahl so, weil ich gerade irgendwie auf Twitch vorgeschlagen wäre. Kann das sein? Weil ich wundere mich die ganze Zeit schon. Das schwankt normalerweise sonntags um die 200 und aktuell schwankt das so um 180 bis 250 voll random hin und her. Und ich denke mir die ganze Zeit so, was ist mit Twitch los? Aber jetzt weiß ich es. Huge Twitch Empfehlung. So, was haben wir denn sonst noch zu bieten? Das Video haben wir irgendwann schon mal geguckt. Ich glaube 5 Linux Distros to watch in 2020. Mal gucken, was der uns empfiehlt. Oh, der hört sich aber Huge Residenz Sleeper an, oder? Nee, da schlafe ich wieder ein Bein und da wären wir nicht wach von. Definitiv wären wir da nicht wach von. Instant Sleep. Eigentlich jeden Sonntag bist du bei den Vorschlägen. Oha, Poggers. Das Warcraft 3 Video haben wir uns schon ans angeguckt. Aus meinem Ryzen PC habe ich nicht bestellt. Nextcloud Hub haben wir gestern ausprobiert im Stream. Muss Diablo 4 bald Angst vor Pass of Exile 2 haben? Lustigerweise habe ich das ja vorhin schon mal kurz angesprochen. Ich denke eher, dass es umgedreht ist. Ich glaube es ist komplett umgedreht. Pass of Exile 2 muss keine Angst haben vor Diablo 4. Also eher andersrum. Wenn hier einer was zeigen muss, dann ist es Blizzard mit Diablo 4 und nicht mit Pass of Exile 2. Pass of Exile hat die letzten 7 Jahre gezeigt, dass es der bessere Nachfolger ist. Und es ist aktuell das einzige Spiel, was ich halbwegs spiele. Muss Diablo 4 bald Angst vor Pass of Exile 2 haben? Ich sage es insofern eher andersrum. Mit sehr viel Glück muss Pass of Exile Angst haben vor Diablo 4. Beziehungsweise muss Pass of Exile eher keine Angst haben vor Diablo 4. Der Titel sagt, ob Diablo 4 Angst haben muss vor Pass of Exile. Was so viel heißt wie Diablo 4 ist quasi das, was angegriffen wird. Dabei ist es umgedreht. Wenn einer angreifen muss, dann ist es Blizzard mit Diablo und nicht Grinding Gear Games. Ich komme in Pass of Exile nicht mehr weiter, das ist doof. In Pass of Exile weiterkommen ist in der Regel einfach easy Grinding. Einfach im Kreisel grind machen, bis du Zeug hast und dann ein bisschen trainen. Aber ich bin in Pass of Exile auch nicht der große Pro, weil ich habe auch erst wieder angefangen. Mal gucken, was die GameStar dazu sagt. Du scheinst verwirrt, war das schon eh mal anders. Ich habe vorhin auch gesagt, dass Twitter wie Reddit ist oder sowas in der Richtung. Pass of Exile 2 gegen Diablo 4 wird das größte Hack-and-Slay-Duell seit Jahren. Und ein verdammt interessantes. Ich muss mir eine Sache revidieren, die ich schon mal erzählt habe in ein paar Streams. Da habe ich gesagt, ich gucke die Videos von Maurice Weber nicht gerne. Mittlerweile gucke ich von ihm und Dimitri am liebsten die Videos. Man kann seine Meinung auch ändern. Eigentlich gucke ich die beiden am liebsten mittlerweile. Wahrscheinlich, weil er ein bisschen ausgefallen spricht, hat mir das am Anfang nicht gefallen. Mittlerweile gucke ich die Videos von ihm. Und wie heißt der andere denn? Der da? Ich glaube, der da ist es. Genau, der da. Und Maurice gucke ich eigentlich die Videos am liebsten. Diablo 3 hat einfach gesackt. Ja. Das finde ich halt komplett verkehrt rum. Die müssen sich nicht beweisen. Path of Exile hat die letzten 7 Jahre bewiesen, dass sie besser sind. Wenn einer was beweisen muss, dann ist es eben Diablo 4. Zum Beispiel zur Horroratmosphäre aus den ersten beiden Teilen. Auf den ersten Blick sehen sich Diablo 4 und Path of Exile 2 sogar überraschend ähnlich. In Sachen Gameplay unterscheiden sie sich jedoch teils gravierend. Also schauen wir uns doch mal an, was sich die Macher von Path of Exile 2 so ausgedacht haben. Wie sieht es eigentlich mit Diablo Immortal eigentlich aus? So gerade so. Gibt es da was Neues? Nee, oder? Wie sieht eigentlich die Bewertung aus von den... Oh, besser. Oder haben sie das erstmal auf Eis gelegt? Release? Wann ist denn Release? Nee, gibt's nicht. Testest du Diablo Immortal da mal im Stream? Nee, wahrscheinlich nicht. Dein Diablo ist auch übelst langweilig zum Zugucken. Zuerst. Path of Exile 2 integriert sich nahtlos ins bestehende Path of Exile. Zwar bringt das Spiel eine neue Story-Kampagne, die 20 Jahre nach dem ersten Teil angesiedelt ist. Doch beide Titel teilen sich dasselbe Ende. Also die Story, muss ich mal sagen. Also ein Punkt in Path of Exile, der mir immer voll am Arsch vorbeigegangen ist, ist die Story. Ich hab so ungefähr eine Ahnung, was passiert in der Path of Exile Story. So nach dem Motto, erstmal ist mal ausgestoßener und dann rettet man die Welt. Und dann macht man irgendwie diesen Ober-Inquisitor, oder was das war, platt. Der... Ach, was auch immer. Und danach sind irgendwie die Götter am Start, die rumstelzen. Was auch immer. Die Path of Exile Story ist jetzt nicht unbedingt die große Stärke von diesem Game. Jaja, es gibt eine Story. Es gibt eine. Es gibt eine. ... Heldenfortschritte und... Ja, ein halt, gut. Der jumpt ja auch auf einmal auf... Der ist auf einmal... Auf einmal da. Und einer tut einer things dann. Mikrotransaktionen aus dem Vorgänger bleiben bestehen. Ja, Moment mal. Diesen Ansatz kennen wir doch ausgerechnet von Blizzard. Das klingt nach dem Modell von Overwatch 2. Und das musste dafür bereits einige Kritik einstecken. Ja, nur mit dem Unterschied, dass Path of Exile in den letzten sieben Jahren gezeigt hat, dass sie sowas halt gut können. Und Path of Exile hat immer noch eines der besten F2P-Modelle. Du kannst Path of Exile ohne Probleme, ohne jegliches Geld spielen. Aber es ist schon nützlich, wenn man Geld reinsteckt. Weniger von den Skins, sondern die Kistenplätze braucht man eigentlich. Ohne Kistenplätze ist Path of Exile... ... sehr... ... eklig zu spielen, ja. Aber man braucht es nicht unbedingt. Und witzigerweise ist Path of Exile eines der Games... ... den ich im F2P-Modell gerne Geld gebe. Im Vergleich zu allen anderen. ... dass ich bei Path of Exile 2 am Ende gar nicht um eine richtige Fortsetzung... ... sondern um cleveres Marketing... Path of Exile hat Mikrotransaktionen. Klar. Die müssen irgendwie Geld verdienen. Kostet ja nichts. ... aber diese Frage ist nicht ganz unkompliziert. Die ersten Spielberichten von der Exile-Konzefolge fühlt sich Path of Exile 2 tatsächlich wie ein neues Spiel an. Und macht sowohl optisch als auch spielmechanisch mehr neu als Overwatch 2. Die Grafik wirkt zwar nicht revolutionär aufgewertet... ... wir kennen aber trotzdem an vielen Stellen große und kleine Verbesserungen. Zum Beispiel bleiben Pfeile jetzt... Aber die Path of Exile F2P-Modell ist wirklich fair. Ich weiß nicht, was mittlerweile die Inventarplätze kosten. Ich hab mir das ja schon vor 5 Jahren gekauft. Du kaufst ja ein paar Inventarplätze. Und diesen komischen... Du kannst dir das dann auch kaufen. Du kannst dir nicht Inventarplätze... ... äh, Kisten-Taps. Und dann kann man sich ja noch kaufen. Kisten-Taps oder farbige Kisten-Taps oder beschriftbare oder Crafting-Kisten-Taps. Irgendwie sowas. Kauf sie Kisten-Taps und danach musst du dir nie wieder irgendwas kaufen. Vorkommen egal. Und du kommst mit deutlich weniger Geld hin als bei einem Vollpreisspiel. Und du kannst Zeit reinstecken mehr als bei fast jedem anderen Vollpreisspiel. Unsere Rüstung klebt weniger steif am Charakter und die Animationen... Welches Spiel hast du am meisten Geld reingesteckt? Hm. Weil, wüsste ich drüber nachdenken. Keine Ahnung. Achso, ja. Äh... Am meisten Geld ausgegeben habe ich wahrscheinlich Dark Edge of Camelot, weil ich da irgendwie, äh... Keine Ahnung, 10 Jahre den Monats-Abo hatte. Ja, da habe ich wahrscheinlich am meisten Geld für ausgegeben. MMO. Mit, ich glaube, 10 oder 12 Euro im Monat. Also da habe ich ja allein schon, ähm... Über 1000 Euro ausgegeben für die Jahres-Abos. Da kann man sich jetzt drüber streiten. Ich muss euch ehrlich sagen... Pass of Exile ist... Ist sehr, also vor allem im späteren Game... Ist das sehr wirr. Also wirr in Form von, wenn du zuguckst... Also wenn du dich neben jemanden stellst, der da spielt... Da denkst du, alter, was passiert da auf dem Bildschirm gerade? Der rennt mit 500 Movement Speed quer über die Map und um ihn herum stirbt alles. So sieht ungefähr Pass of Exile Endgame aus. Ähm... Da checkst du nichts mehr, aber nichtsdestotrotz... Ist Pass of Exile nicht... Nicht so anstrengend zu gucken wie Diablo 3, finde ich. Pass of Exile fällt halt einfach alles um ohne größere... Ohne größere, ähm... Ohne dass es größer halt großartig nervt, ja? Du läufst halt einfach geradeaus und es fällt alles um. So, das ist Pass of Exile Endgame. Diablo 3 ist eher Bildschirm wackelt... Es flimmert, es gibt Lichteffekte und sonst was. Das hast du in Pass of Exile halt eher nicht. Du läufst halt rein, Gegnergruppe stirbt... Gegnergruppe stirbt, du läufst rein, Gegnergruppe stirbt, du läufst rein... Was heißt, du läufst rein? Du läufst vorbei, Gegnergruppe stirbt, du läufst vorbei, Gegnergruppe stirbt... Ähm... Du kriegst bei Pass of Exile Endgame weniger Augenbluten als bei Diablo 3. Wobei es bestimmt bisschen Geschmackssache ist. Also das hier ist jetzt... Ähm... Was die da zeigen ist hier Pass of Exile Noobstyle, ne? Das ist irgendwo ganz am Anfang. Da tut sich schon nichts. Warte mal, pass mal auf. Ähm... Wie heißt dieser... Wie heißt dieser Riesen? Cyclone? PoE... Cyclone... Bild... Da wo... Da wo die jetzt mittlerweile schon irgendwelche... Ähm... Leuchteffekte haben... Ihr müsst euch das mal... Also da kriegst du echt absolut Anfälle, wenn du da zuguckst. Das geht noch! Das geht noch, ja? Das ist, das ist doch, das ist doch human gerade. Das geht noch, das geht noch viel schlimmer. Da, da sieht man ja noch richtig was. Braucht man, braucht man schönes, schönes Gameplay davon, wo man nicht mehr durchblickt, was passiert. Ups. Ja, hier ist so, hier, hier kommt man der Sache näher. Hier kommt man der Sache näher. Der, der, der klickt noch viel zu lange Items an. Vor was? Was ist das? Ja, genau, sowas. Genau, sowas, Alter. Sowas, Alter. Da bist du halt, das ist halt vorbei, ja? Da ist vorbei. Ich spiele ja in Path of Exile, äh, Noob-Style Summoner-Bild, weil es einfach Brain-Afk im Kreisel-Kreiten ist. Und du beschwörst dann einfach Dinge und läufst geradeaus. So, also jetzt, huge, anspruchsvoll ist es nicht. Ja, gut, Path of Exile Skill Tree ist ja auch da, ist ja auch Wahnsinn. Ups. Übelst nice. Ja, Leute. Also wer schon mal immer zwei Wochen an einem Build bauen will, hat mit Path of Exile viel Spaß. Path of Exile Skill Tree, easy. Allerdings ist es, ist es, es sieht schlimmer aus als es ist. Es sieht schlimmer aus als es ist. Es gibt ja dafür sogar schon Optimierungstools, die das Beste für einen, das Beste für einen machen, wo man dann angeben kann, ich hätte gern so und so, und dann sagt er, dieser Weg von Nodes ist besser. Aber es gibt dem, es gibt dem Skillsystem viel Tiefe und so kam Path of Exile halt schon raus mit diesem, mit diesem Skill Tree und mittlerweile, ich, ich plicke ja selbst noch nicht hundertprozentig durch. Mittlerweile haben sie mindestens zwei Sachen noch eingebaut, die das noch komplexer machen. Es gibt quasi so Art Ascendant Master Level, also da kannst du quasi noch mal, da kannst du quasi noch mal aufleveln mit Special, mit Special Skills. Hier, kannst du dann noch mal auswählen, was du haben willst. Wobei, dafür muss man so spezielle Dungeons durchspielen, dass man, dass man das kriegen kann. Und jetzt haben sie noch irgendwie so eine, so Götter, Götterselection, was man auswählen kann. Das hier, ne, äh. Jetzt haben sie noch das hier, wo du noch Zeug auswählen kannst. Also Path of Exile Skill und Building ist echt eine Wissenschaft für sich. Wie gehabt, verbessert ihr eure Fähigkeitsedelsteine mit mehreren Unterstützungsjuwelen, wie z.B. Mehrfachschuss. Ach ja, und, und, wo wir gerade beim Thema Path of Exile sind. Im Path of Exile ist einfach los spielen und irgendwas skillen meistens keine allzu gute Idee, weil man kann nur sehr beschränkt respekten. Man kriegt in der Main Quest ein paar Respektpunkte, das reicht, um sein Bild, äh, schon, äh, gut anzupassen, aber grundlegende Bild ändern kann man nicht. Also, man kann jetzt z.B. in Path of Exile nicht sagen, ähm, ich würde gerne, keine Ahnung, ich hab jetzt irgendwie hier oben gespeckt für, für, äh, mehr, mehr, mehr stärkere Minions und hier irgendwie gespeckt. Und dann kann man nicht sagen, ich mach jetzt irgendwie Melee-Build und geh hier runter. Das, das, das funktioniert nicht, dafür hat man nicht genug Respektpunkte. Dann ist es einfach, einen neuen Charakter anzufangen. Man kann respekten durch, ähm, man kann respekten durch Orbs, also durch Währung, kann man respekten in Path of Exile, aber ich behaupte jetzt einfach mal, ohne dass ich durchgerechnet hab, vielleicht weiß das ja einer von euch besser, dann kann man einfach mal, wenn man auf der Suche kommt, dass man auf der Suche kommt, dass man auf der Suche kommt, dass man auf der Suche kommt, dass man auf der maintaining Tap, vielleicht weiß das ja einer von euch besser, das lohnt sich nicht! Ich glaube es ist deutlich sinniger, wenn man einen neuen Charakter anfängt, anstatt, äh Kohle in adob of regret zu stecken! Vermutlich jetzt einfach mal so! Ich hab bisher immer neuen Charakter angefangen, wenn ich ein anderes skilln wollte! Hast du schon mal Niho gespielt? Nee, aber klingt irgendwie nach! Game! Als erfahrener Spieler lohnt sich das immer. Yecht? Echt, Respecken lohnt sich? In Passive Age, warum lohnt sich Respecken? Als erfahrener Spieler bist du doch in zwei Tagen auf fast Endgame, oder? Aha, in vier Stunden zum Leveln kann man locker das Doppelte im Endgame verdienen. Ihr setzt diese Supportsteine jetzt nicht mehr in Items ein. Stattdessen sockelt ihr nur noch die Grundfähigkeit in eure Ausrüstung. Und deren Edelstein hat dann eigene Sockel. Ab wann ist Endgame? Ja, das ist eine coole Sache in Pass of Exile. Das ist eigentlich ziemlich fließend. Ich bin ja bei Weitem noch nicht wirklich endgame-mäßig in der aktuellen Season. Dafür spiele ich auch viel zu wenig. Es gibt jetzt so einen neuen, nee, nee, nee, nicht Akt 5. Die Endgame ist nach der Story, wenn du Maps craftest und Gedöns machst. Es gibt jetzt zig neue Sachen in dem Game. Wie gesagt, ich habe auch erst wieder angefangen. Es gibt jetzt irgendwie so einen komischen neuen Challenge-Dungeon oder sowas. Und es gibt so eine Art Rift-Geschichte wie in Diablo. Dann gibt es nach wie vor die ganze Map-Geschichte. Dann gibt es noch irgendwie so eine Map-Enhancement-Enchanting-Geschichte oder sowas, wo ich auch keinen Plan habe, was es genau ist. Da gibt es so viel Zeug. Und eins, was Pass of Exile richtig gut macht, ist, der Übergang ist komplett fließend. Von Anfang bis Endgame. Das ist komplett fließend. Da gibt es nicht so eine Geschichte mit so nach dem Motto, jetzt bist du fertig, jetzt fängt Endgame an. Das ist sehr schön fließend gemacht. Pass of Exile 2 Wie viele neue Akte kommen nochmal in Pass of Exile 2? Keine Ahnung, mal gucken, ob man das sagt. Wahrscheinlich erst mal drei, so wie ich die kenne. Aber ich weiß es nicht. Ja, okay. Boah, das gibt ja noch mehr Cluster-Fuck. Das gibt ja noch mehr Cluster-Fuck. Aktuell ist es so, in Pass of Exile kannst du nur in der Rüstung und ich glaube in der Zweihandwaffe sechs Säckel haben. Und in Passive Exile ist es so, man bekommt keine Skills aus dem Skilltree, also, wer jetzt gedacht hat... Das stimmt ja gar nicht, was ich gesagt hab. Wer gedacht hat, hier bekommt man seine Skills in dem Skilltree, das stimmt ja gar nicht. Das ist passiv. Das sind nur Passivfähigkeiten und ein paar Modifier für aktive Fähigkeiten. Das ist alles passiv. In Passive Exile kriegt man seine Skills durch Juwelen, die man sockelt. Und je nachdem, wie man die verbindet miteinander, also sprich, je nachdem, welche Farbe der jeweilige Skill hat und wie die Sockel miteinander verlinkt sind, kann man da richtig abgedrehte Sachen produzieren, ja. Du kannst dann zum Beispiel sagen, ok, ich sockel jetzt, ich sockel jetzt einen aktiven Skill, mit dem ich Zombies beschwören kann. So, dann sockel ich noch ein weiteres Gem dazu, was mir ermöglicht, dass die Dinger ne Aura haben. Dann sockel ich mir weiteren Sockel dazu, dafür sorg, dass die Feuerdamage kriegen und einen weiteren Sockel, der mehr Critdamage macht, mehr Leben, mehr sonst was, sowas in der Richtung, ja. Und man kann auch Skills übelst geil pimpen, so nach dem Motto, eine Frostwave, heißt das Ding Frostwave, nach vorne und da kannst du dann drei Stück draus machen und sowas. Also, das, alles in allem ist das Skillsystem in Passive Exile schon ziemlich komplex, aber das macht's auch, macht's auch erst, erst richtig nice. Jetzt gibt es viel weniger Druck, sich auf ein oder zwei Primärattacken zu konzentrieren und mehr Freiheit zum Experimentieren. Gleichermaßen wird das System für Einsteiger weniger fummelig und besser planbar, weil alle Itemtypen grundlegend immer die gleichen Sockel haben. Ein Bogen zum Beispiel immer für vier Geschicklichkeitsfähigkeiten. Profis können die dann weiter modifizieren, sodass der alte Tiefgang erhalten bleibt. Außerdem könnt ihr keine falschen Edelsteine mehr einsetzen. Ein Mehrfachschussjuwel passt jetzt einfach nicht mehr in eine Nahkampfattacke. Dazu kommen völlig neue Fähigkeiten wie Gestaltwandlung. So wird es neue Skill-Gems geben, mit denen ihr eure Helden zu Wehrwölfen und Wehrbeeren machen könnt und dann entspricht... Das erinnert mich an Diablo 2. Beste in Diablo 2 war allerdings beim Truide, ähm, wie hieß denn das? Elemental Truide, also mit Vulkan und sowas. War beste in Diablo 2. Cowlevel Runs mit als Elemental, wie hieß denn das? Vulkanic Pillar oder so, kann das sein? Das weiß ich gar nicht mehr. Diablo 2 Truide Volcano. Ja, Volcano Truide, beste in Diablo 2. Cowlevel Runs, von morgens bis abends. Das ebenfalls Gestaltwandlung mit dem Druiden bringt. Und beide Spiele wollen auf flüssige Wechsel selbst mitten zwischen zwei Hieben setzen. Nur, dass in Diablo 4 jede Gestalt an bestimmte Fähigkeiten gebunden ist. Ein Ansturm macht uns etwa immer zum Wehrbär. In Path of Exile können die Tierformen dagegen alle passenden normalen Attacken nutzen. Als Wehrwolf etwa die gleiche Sprungattacke, wie sie auch ein bewaffneter Krieger einsetzt. Was mehr Vielfalt erlaubt, aber auch etwas beliebiger ist als komplett eigene Wehrwolf-Attacken. Dafür gibt's auch ungewöhnliche... Man muss auch sagen, dass das Balancing in Path of Exile nicht so der Wahnsinn ist, weil... Inwieweit das jetzt relevant ist, muss man wissen, weil es gibt für alle Charaktere gute Skillungen. Aber es hat schon seinen Grund, dass gerade 29% Witches sind und davon die meisten Summoner-Bills spielen. Das hat schon seinen Grund. Summoner-Bills in Path of Exile sind einfach die Noob-Bills. Deswegen spiele ich ja auch eins. Weil man einfach nichts machen muss. Das ist halt billig. Du kannst super leveln und du brauchst nicht viele Items. Zum Beispiel wurde eine spezielle Katzenform erwähnt, die der neuen Beastmaster-Klasse vorbehalten ist. Die nerven doch immer mal die Meta-Bills. Ja, das stimmt, aber Summoner-Bills sind immer noch übelst OP. Ich glaube, sie haben im letzten Patch, wo ich noch nicht gespielt habe, Specters genervt und ich glaube Zombies genervt. Ich bin nicht ganz sicher, aber ich habe jetzt erst danach wieder angefangen und Summoner-Bills sind immer noch übelst OP. Dabei handelt es sich um eine von 19 neuen Ascendancies. Also den erweiterten Charakterklassen, mit denen ihr eure Figuren aufmotzen und beide spezialisieren könnt. Ja, das gibt es ja jetzt schon. Zusammen mit den 19 existierenden Ascendancies kommt Path of Exile so als stolze 38 erweiterte Klasse. Okay, das ist cool. Furchtbar viel ist zu denen aber noch nicht bekannt. Neben dem Beastmaster wurden weitere Spezialisierungen für die Waldläuferin vorgestellt. Von der eine aktiv zwischen Einzel- und Flächenschaden für Fernangriffe wechseln kann. Die andere benutzt Nahkampfspezialangriffe für Schwerter und Äxte, auch mit dem Bogen. Erste Hinweise auf neue Waffengattungen, vermutlich Stangenwaffen und Armbrüste, gibt es auch. Konkreter wurden die Entwickler schon bei den Bossgegnern. Die sollen diesmal schon früh im Spiel deutlich vielfältiger und kniffliger werden. Was schreiben die auf ihrer Webseite? Hä? Was? Was ist? Zu viel Mathe? Was? Bevor ich ein bisschen Angst habe mit Diablo 4 ist das Blizzard wieder die Komplexität rausstreichend. Ja, das war ja auch das Problem bei Diablo 3. Denn auf deren Webseite behaupten die allen ernstes zu viel Mathe in Diablo 3. What? Was gab es denn in Diablo 3 zu viel Mathe? Mal davon abgesehen, dass das Game fast alles für dich ausgerechnet hat, was wichtig war. Okay, ja Blizzard. Keine Ahnung, was mit Blizzard los ist. Was? Diablo Shared World? Das ist so halbes MMO. Gut, das kann, also das kann Path of Exile auch gebrauchen, weil die Path of Exile Grafik ist scheiße. Aber sie ist zweckmäßig und gut, es läuft wenigstens okay. Sieben? Okay. Path of Exile als es rausgekommen ist, war halt drei. Und mittlerweile zehn. Moment, es gab so ein Intro und ach nee, das ist jetzt für Path of Exile 2. Das sieht original aus, wie die... Das ist doch Path of Exile, der erste Boss. Das auch, das ist der Boss zwischen Act 1 und 2. Oh komm mal, Triss. Ja, die sind clever bei Crying Gear Games. So muss das machen, das fand ich schon auch bei Woe Add-ons immer übelst low brain von Blizzard, dass die mit jedem Add-on das alte Add-on überflüssig gemacht haben. Du hast so viel Contentbrach liegen lassen dadurch. Du musst das so machen, du musst beides am Leben halten, weil umso mehr Content, umso besser hältst du deine Spieler bei Laune. Joa. Path of Exile hat so viel Inhalt, das kann man schon als Maingame spielen. Oh, hör auf. Ach stimmt, die Ankündigung war lustig. Die haben ja gesagt Path of Exile Mobile und da haben sie sich noch ein bisschen lustig gemacht über Diablo Mobile. Das ist recht schwierig geworden, die einfach so anzukündigen, meinte Wilson. Man wollte daher lieber erstmal die große Fortsetzung vorstellen und dann das Mobile Spiel hinterher. Ist wahrscheinlich auch schlauer so. Und Wilson setzt noch einen drauf. Wir haben das Ding nicht an irgendeinen externen Wickel herausgehauen, sagt er, sondern bauen es komplett intern. Ein Schelm, wer da an Blizzards Partnerschaft mit dem chinesischen Studio NetEase für Diablo Immortal denkt. In Path of Exiles Mobile Trailer kriegt einer der Entwickler dann auch noch den Titel Mobile Sündenbock. Nur für den Fall, dass die Ankündigung vielleicht doch nicht so gut ankommt. Ganz im Ernst versprechen die Macher aber, dass die Mobilfassung keinerlei Kompromisse bei Tiefgang und Komplexität macht. Ich glaub das denen sogar. Womit sie auch ganz nüchtern betrachtet einen anderen Ansatz verfolgt, als das vereinfachtere Diablo Immortal. Dass das ganz gut wird. Ich kann mir auch sogar vorstellen, dass Diablo Immortal ganz gut wird. Könnte ich mir auch vorstellen. Aber die haben es halt taktisch sehr ungeschickt gemacht. Das Einzige, ich hab's schon ein paar Mal gesagt im Stream. Das Einzige, dass nur eine Sache hätten sie machen müssen. Bei ihrem Diablo Immortal Disaster. Sie hätten einfach Diablo 4 mit einem Mini Teaser am Ende zeigen müssen. Das hätte gereicht. Es hätte niemand mehr über Diablo Immortal gelästert. Die hätten Immortal zeigen sollen. Und dann zum Ende, wenn die Präsentation fertig war. Hätten die sagen müssen, ach übrigens Leute. Noch eine Sache gibt's hier, wollten wir euch noch zeigen. Dann hätten sie einfach 30 Sekunden, wie bei Elder Scrolls, 30 Sekunden Diablo 4 Teaser gespielt. Und alle wären happy gewesen. Auf die Frage, ob man nicht doch ab und zu darüber nachdenkt, Part of Exile etwas zu vereinfachen. Hat Chris Wilson eine recht eindeutige Antwort. Blizzard beherrscht den Casual-Sektor. Dagegen kommt man nicht an. Überhaupt zeigt Rhinelingir Games die gnadenlose Identität von Part of Exile sehr wichtig. Intern gebe es hitzige Diskussionen darüber. Man sollte es auf keinen Fall vereinfachen. Einen tiefen Talentbaum des Spiels, der mehr an eine Art Talent-Universum steigt. Nicht doch irgendwie für Neueinsteiger weniger Furcht einsteigen. Das ist das Beste am Part of Exile. Einerseits, so Wilson, wäre jetzt ein idealer Zeitpunkt. Um neuen Spielern über Vereinfachungen an diesem System den Spieleinstieg zu erleichtern. Zum Endgame hin könnte man ja immer noch alle Optionen beibehalten. Ohne Spieler direkt von Beginn an damit zu erschlagen. Andererseits ist aber genau dieser Talentbaum eines der Alleinstellungsmerkmale von Part of Exile. Das zu ändern, könnte viele Fans enttäuschen. Und so bleibt Part of Exile auch mit seiner Fortsetzung bockschwer, gnadenlos und teuflisch. Der Pass of Exile ist nicht schwer, muss man ehrlich sagen. Vor allem wenn man einen Brain-Dead-Noob-Summoner-Build spielt, wie ich mir ausgesucht habe, das ist nicht schwer. Du läufst geradeaus, lässt deine Minions alles killen und ab und zu machst du mal eine Attacke, wenn es dir zu langweilig wird. Hauptsächlich guckst du einfach nur, dass du nicht zu viel Damage kassierst und deine Minions machen alles kaputt. Also mit meinem aktuellen Zombie-Summoner-Build ist es total einfach. Ich caste meine Zombies, ich renne in den Raum rein, ich laufe so lange im Kreis bis die Gegner tot sind. Ich laufe einfach nur im Kreis, dass ich nicht gekillt werde. Das ist wirklich nicht schwer. Die Casions lesen keine Build-Guides durch, ja das ist ein Problem. Aber das sollte eigentlich jeder mit ein bisschen Hirn und ein bisschen Erfahrung in Action-RPGs oder RPGs gelernt haben. Dass wenn ein Spiel nicht gerade komplett neu ist, man am besten sich ein paar Skill-Guides durchliest, weil man sonst einfach 100 Stunden in den Sand steckt und sich verskillt. Komplex, während man bei Diablo eben leichter einsteigen, einfach drauf los spielen und den hervorragenden Spielfluss genießen kann. Auch mal ohne ewig lang seinen Charakter zu planen, sich jeden Fortschritt... Charakter, das verstehe ich halt nicht, warum da viele Leute was dagegen haben. Für mich ist fast die Hälfte, was an RPGs beziehungsweise auch an Action-RPGs oder Spiele mit gewitzer Komplexität, wo es Charakter-Erstellungen gibt, bei MMOs ja. Für mich ist 30, 40, 50% der Zeit oder des Reizes liegt eigentlich im optimalen Charakter-Build. Und weniger im Game oder Main-Story an sich. Ja gut, Eax, aber du machst es ja absichtlich. Machst nicht, weil du zu blöd bist, Guides zu lesen. Du sagst ja ganz bewusst, will ich nicht. Was? Achso, Ancient Stinks. Also ich freue mich ehrlich gesagt nur auf Path of Exile 2. Wie sieht es bei euch aus? Diablo 4 juckt mich gar nicht. Das war der Eindruck von der BlizzCon und unser Detail-Video mit 27 vertiefenden Fakten zum Spiel. Wir werden auch künftig über die besten kommenden Action-RPGs berichten. Mit einem Abo bleibe ich also immer auf den laufenden. Nachdem wir ein paar im Chat haben, die Path of Exile spielen, war eine Frage. Ich habe jetzt Jahre nicht gespielt und davor waren nicht diese Witch-Summoner-Builds OP in Path of Exile, sondern Totem-Builds waren OP in Path of Exile. Was ja auch Summoner-Builds sind. Taugen Totem-Builds aktuell noch oder sucken die in Path of Exile? Was ja. Sind immer noch okay. Ja ich weiß es, man konnte irgendwie, ganz am Anfang konnte man so ein übelst OP Totem-Build machen. Da gab es irgendwie, wie konntest du plus Totem, plus Totem, plus Totem und dann irgendwie die passende Skill-Kombination und du konntest quasi afk gehen. Du bist in den Raum rein, hast Totem gecastet, bist auf den Desktop geswitcht, so nach dem Motto. Diablo 4 wird anders als ihr denkt. Okay, das müssen wir uns nochmal angucken. Zumindest wird mich mein... Moment, das ist ja schon alt, das Game. Nee, nee, das müssen wir uns nicht gucken. Battlefield Top Plays, Leute, haben wir lange keins mehr geguckt. Komm, da gucken wir jetzt noch eins. Ja, ich bin zwar zwei Stunden noch nicht, ich... Ich muss mal übelst aufs Klo, aber Battlefield Top Plays gucken wir jetzt noch eins. Und ich könnte wetten, ich weiß schon wieder genau, was der Typ sagt, weil der Kommentator sagt immer das gleiche, jedes Mal. So nach dem Motto, das ist auch eine seltene Waffe, die sieht man nicht so oft, aber ein netter Killstreak ist das trotzdem. Sowas in der Richtung, immer, immer das gleiche. Gekommnet. What? Das war Glück, ey, das war übelst Glück, dass das noch reingehauen hat. Der hat's ja schon selbst aufgegeben. Das ist ein ziemlich krasser Grünstich, den das Ganze hier hatten. Boah, das war tatsächlich nice. Boah, das war tatsächlich nice, aber das ist so... 50% gut, gut predicted, 50% Skill, da ist aber auch 50% Glück dabei. Was ist vielversprechender, Path of Exile oder Lost Ark? Naja, für mich als Path of Exile Spieler, Path of Exile, beste. Lost Ark, gibt's das nicht schon seit 3 Jahren oder so? Okay, ey, das war aber auch, das war auch wieder sehr glücklich, ey. 10% Luck, 20% Skill, wie ging das weiter? 15% irgendwie Concentrated Power, ach, keine Ahnung. Power of Will, genau, ja, ja. Das haben sie ja in Battlefield 5 auch ein bisschen verkackt, ne, das ganze, das ganze Jet-Gameplay. Allein schon dadurch, dass du keinen Starten und Landen mehr hast. Es gibt keinen Start und Landen in Battlefield 5, nee, gibt's nicht. Das Einzige, was es gibt, ist jetzt auf der letzten, auf der letzten Pacific Map gibt es jetzt, vorher gab es das nicht. Help, ist die Samsung 970 EVO Plus gut? Naja, also ich hab hier eine Samsung 970 EVO, dann, die ist okay, die ist gut, da vermute ich mal, dass die Plus auch gut ist. Was ist denn der Unterschied zwischen EVO und EVO Plus? Vielleicht ist es auch Apple-Logik, dass Plus schlechter ist als ohne Plus. Corsair, Moment, der Name erinnert mich daran, dass ich noch was deinstallieren wollte. Kann ich jetzt aber hier gar nicht. Oh, das wäre nice gewesen, wenn er das noch hittet. Nee, Corsair RGB von der Tastatur, ja, aber ich hab ja keine Corsair Tastatur mehr, deswegen müsste ich das mal löschen. Oh, der war nice, der war cool. Hele ist OP, change my mind. No shit, da wäre jetzt nicht drauf gekommen. Oh, da wurd ich immer, da wurd ich immer angeschissen, wenn ich Battlefield-Gameplays gebracht hab. Max, warum gewilfst du nicht? Max, warum trägst du Gameplays von Leuten, die nicht richtig reviven? Der hat keinen Bock zu reviven, der will die Gegner wegspringen. Der letzte war geil. Pocko, ja. So was, so ein Crab geht halt nur in Battlefield 3 und 4. Das kannst du einfach vergessen. Vor allem 2% Leben. Das kommt erst mal. Ist das ein Eurofighter? Das ist Glück, das ist huge Glück, das ist einfach nur Glück, aber trotzdem geil anzusehen. Das ist nicht Impress, das ist Glück. Das ist nicht, dass der in irgendeiner Art und Weise das prediktet hätte. Ha, net niemals, also never, never. Es ist geil zu sehen, aber da kann man nicht davon sprechen, so nach dem Motto, das hat er geaimt. Der hat einfach in die Richtung geschossen, wo er vermutet, da könnte was kommen aus der Ecke und dann ist er reingeflogen. Das ist, nee, nee, nee. Die Musik im Hintergrund. Moment mal, das hat mit prediktet nichts zu tun. Prediktet ist, ich sehe einen Gegner und predikte, wo der hinmuft. Das war ja, ich predikte, es kommt eventuell aus dieser Richtung irgendwas, was ich jetzt noch nicht mal sehen kann und schieße da mal auf gut Glück hin. Aber das ist schon ein Unterschied. Backrage. Oh, schöne Headshots. Oder auch nicht. Bam. Und erst noch mal schön mit dem Defi in your face. Richtiges 3-Head-Gegner, ja. Die Gegner sind wieder so unglaublich hintot. Die Weihnachtsnoups. Ich glaube, in Battlefield 4 gibt es keine Weihnachtsnoups mehr, das Game ist zu alt. Das sind einfach richtige, echte, echte Noups. Warum gibt es überhaupt noch so viele Noups in alten Battlefield-Games? Ich dachte, Noups spielen das neueste. Mit Role-Spieler. Wobei Battlefield ist halt auch so ein Ding, da kann jeder mal doof aussehen. Battlefield kommt immer auch ganz entscheidend darauf an, wie gut das eigene Team drückt und sowas. Also sprich, du kannst auch als richtig guter Spieler teilweise, wenn das Gegner-Team, dein eigenes Team und dich quasi rausdrückt aus der Position, du kannst auch permanent auf den Sack kriegen. Das geht auch. Aber manche von denen sind echt planlos. Wenn du Gegner siehst, die an dir vorbeilaufen, quasi dreimal um dich im Kreis und dich nicht attacken, dann weißt du schon, was da los ist. Das ist ein Boomer-Alarm, genau. Die Musik! Zielen auf Dreiecke! Ich kann Battlefield 3 nicht an Stream spielen, weil dann alle nachjoinen und nichts anderes machen, wie die Games versauen. Und es gibt so wenige Surfer, dass man ohne Probleme findet, worauf man ist. Was ist mit dem los? Da wird es sehr schlecht bei. Das sind halt wieder richtige PP-Gerr-Gegner jetzt. Huge Gegner! Max, guck dir mal ein Play an. Okay, ich gucke mir da ein Play an. Wehe, das ist irgendein Porn-Pick oder sowas. A-E-K, beste. Warum hat er gerade keinen Damage von der Nate gekriegt hinter ihm? Spray, Spray, Spray, Spray, Spray. Der ist da hinten hier, der da, der rechts. Was ein PP-Gerr-Gegner. Ich brauche erst mal 30 Sekunden zu checken, dass ein Gegner vor ihm steht. Was ist mit dem Gegner los? Hardline! Okay, jetzt gucken wir uns mal den Clip an von MrTommyMXR. Okay, es ist Battlefield. Ich habe erst mal auf gut Glück zugemacht, weil ich nicht wusste, was da drin ist in dem Video. Okay, Sound gibt es nicht. 4 Sekunden, was könntest du jetzt mit dem Chat Tolles machen? Da ist ja nichts. Okay, gucken wir mal. What? Hast du den gesehen? Ich sehe den nicht. Wo ist er? Ich sehe da keinen Gegner. Okay, die Auflösung ist jetzt auch nicht so gut, aber wo ist er? Ach da, hier. Ja, ja, hier, guckt, da. Da ist er. Gut, die Auflösung ist jetzt auch nicht die beste, aber man sieht es. Da ist er, jawoll. Aber nice. Huge Roadkill. Was? Und jetzt guckt ihr zum Kontrast Battlefield 5 an. Okay. Hat er wenigstens Sound? Warum ladet ihr alle Clips ohne Sound hoch? Ach so, ist es ein GIF? Hä? What? Ja, Battlefield. Das ist nicht Battlefield 5, das ist Battlefield 1, oder? Das ist Battlefield 5. Ich kann den nicht auseinanderhalten. Das ist Battlefield 1, oder? Das ist 1. 5? Ah, das sieht alles so gleich aus. Das ist geil. Das ist kacke, Alter. So, jetzt kommen hier die ganzen User Clips an. Oh, guck mal, man kann hier auf HD stellen. Da erkennt man wenigstens mal was. Da haben sie doch keinen Sound, oder? Ah, jetzt wird erstmal hier der grasse Flank ausgepackt. Huge Big Brain Flank. Eleven Head Flank. Der Gegner hat es halt auch richtig drauf gehabt mit dem Treffen. Bam. Das ist Battlefield 1. Ja, ja, das erkenne ich jetzt auch gerade. Zack. Oh, den hast du nice noch erwischt, ja. Wollte der dich gerade Chargen? Sehe ich das richtig? Sehe ich das richtig? Wollte der dich Chargen und ist vorbei gerannt? Guckt euch mal an, wie er vorbeischaut. Schaut mal. Jetzt, jetzt. Und dann, das geile ist, der wollte sich ja mit seinem Bayonett ownen und dann melest ihn ihn auch kaputt. Ich weiß, dass es schwierig ist, die Chargen, aber ich finde es trotzdem lustig aus. Das ist richtig geiler Clip hier. Und noch die Legehennen gemacht. Und noch die Legehennen gemacht. Sogar noch hier Objective Play. Was, noch ein Battlefield 3 Clip jetzt? Jetzt aber geht es hier aber. TV, Missile und Jet. Ja, auch nice. Wobei, so Sachen habe ich schon öfters gesehen. So Sachen habe ich schon öfters gesehen. Genau, ich mache auch ein Battlefield Top Play Serie. Dann sage ich auch einfach jedes Video das gleich und kriege 150.000 Views. Noch ein Roadkill, Max. Jetzt kommen mir die ganzen Clips an. Gucken wir auch noch mal, noch mal Roadkill. What? Moment, Moment, Moment. Das habe ich nicht gecheckt. Das ging zu schnell für mich. Ah, da ist er. Ich sehe ihn. Ich sehe ihn. Da schwimmt er. Ich dachte man wird automatisch aus dem Heli rausgeworfen, wenn man ins Wasser taucht. Flup. Was haben wir hier noch? Moment, bist du im Stacheldraht gespornen oder hat dich jemand gekillt? Du bist im Stacheldraht gestorben, oder? Ach, Instant Headshot. Na gut, das kann passieren. Das kann passieren. Das ist ja in Ordnung, dass sich ein Gegner Instant Headshotted. Ja, nice Clips, Leute. Ich muss aufs Klo. Ich glaube, ich gehe jetzt auf. Ich war gestern 6,5 Stunden on. Dann machen wir heute ein bisschen kürzer. Also wir sehen uns, Leute. Was ist eigentlich aus dem Friseur geworden? Eben geht es gut. Wir sehen uns, Leute. Macht's gut. See you.", "segments": [{"id": 1, "start": 30.0, "end": 51.12, "text": "publishing"}, {"id": 2, "start": 51.12, "end": 75.48, "text": "Die Benachrichtigung morgens verschickt Twitch irgendwie schneller als abends."}, {"id": 3, "start": 75.48, "end": 87.2, "text": "Ja, Chat ist auch noch, äh, huge, Vogue."}, {"id": 4, "start": 87.2, "end": 95.88, "text": "Vogue Chat."}, {"id": 5, "start": 95.88, "end": 107.16, "text": "Ja ja."}, {"id": 6, "start": 107.16, "end": 134.32, "text": "So, ich mein, ich bin ja quasi erst, erst off gegangen, ne, wann bin ich off gegangen"}, {"id": 7, "start": 134.32, "end": 157.6, "text": "gestern? 21 Uhr, also, ist gar nicht mehr. 20 Stunden ago, ja. Ne, ich kann nicht rechnen."}, {"id": 8, "start": 157.6, "end": 167.2, "text": "Was ist 10 Uhr 30, minus 20 Stunden? Minus 10 Stunden ist 0 Uhr und dann minus 10 Stunden"}, {"id": 9, "start": 167.2, "end": 175.36, "text": "minus 4 ist 2, hä? Das ergibt keinen Sinn, oder? Bin ich jetzt... Das ergibt keinen Sinn."}, {"id": 10, "start": 175.36, "end": 180.2, "text": "Ah, Moment, das ist nicht, weil ich off gegangen bin, das ist, weil ich den Stream gestartet"}, {"id": 11, "start": 180.2, "end": 187.32, "text": "hab. Das ist, weil ich den Stream gestartet hab, also muss ich das plus 6.30 nochmal rechnen."}, {"id": 12, "start": 187.32, "end": 199.6, "text": "Also, wann bin ich off gegangen? 20, 30 oder so? 21 Uhr? Das ist heut' morgens zu viel,"}, {"id": 13, "start": 199.6, "end": 211.6, "text": "zu viel Quickmaps. 6 Stunden 30, so langen Stremen hatten wir lange... Wollte grad sagen,"}, {"id": 14, "start": 211.6, "end": 217.76, "text": "so langen Stremen hatten wir lange nicht mehr, das ist aber irgendwie ein ziemlicher Kacksatz."}, {"id": 15, "start": 217.76, "end": 225.12, "text": "Gab's schon lange nicht mehr so einen ausführlichen Stremen. Wollte mir mal, ich guck ja immer"}, {"id": 16, "start": 225.12, "end": 230.76, "text": "ab und zu mal meine Clips durch, ne? Und da ist mir aufgefallen, wenn ich, das ist jetzt"}, {"id": 17, "start": 230.76, "end": 236.2, "text": "viel zu viel, kann ich gar nicht durchgucken. Leute sind hier voll am Clipshorn, hier, guck"}, {"id": 18, "start": 236.2, "end": 243.88, "text": "mal, Endless Scroll. Da kann ich mal auf. Vor allem, warum sowas Endless Scroll sein"}, {"id": 19, "start": 243.88, "end": 250.32, "text": "muss, weiß ich auch nicht. Endless Scroll ist echt das letzte. Wisst ihr, was ich mittlerweile"}, {"id": 20, "start": 250.32, "end": 258.84, "text": "wirklich, wirklich schlimm finde, ist... Keine Ahnung, gehen wir jetzt einfach mal auf Reddit,"}, {"id": 21, "start": 258.84, "end": 269.2, "text": "dann irgendwie PC, Master Race. Was ich mittlerweile wirklich schlimm finde, ist, dass wenn man"}, {"id": 22, "start": 269.2, "end": 277.24, "text": "nicht auf Reddit All schaltet, dass das hier auf dem Desktop Endless Scroll ist, dass es"}, {"id": 23, "start": 277.24, "end": 288.28, "text": "auf einem Safari iOS nicht Endless Scroll ist, allerdings ohne Seiten und sie einen damit"}, {"id": 24, "start": 288.28, "end": 293.76, "text": "überreden wollen, doch die App zu verwenden. Was halt total beknackt ist, weil ich will"}, {"id": 25, "start": 293.76, "end": 298.16, "text": "ja gerade dieses Feature nicht haben. So, das einzige Möglichkeit, die man hat, ist ja"}, {"id": 26, "start": 298.16, "end": 302.6, "text": "hier auf Old Reddit zu gehen. Problem ist, dass Old Reddit halt auch so seine Tücken"}, {"id": 27, "start": 302.6, "end": 309.36, "text": "hat, ja? So, und neuerdings mach ich's einfach... Ach ja, und übrigens auch ne Sache, die mir"}, {"id": 28, "start": 309.36, "end": 314.48, "text": "mega auf den Sack geht, wenn man Twitter mit dem Handy verwendet ist, kann man ne Seite"}, {"id": 29, "start": 314.48, "end": 319.48, "text": "aufmachen und geht dann zurück, dann checkt er nicht, wo man gewesen ist. Ich weiß nicht,"}, {"id": 30, "start": 319.48, "end": 324.4, "text": "ob das auf dem Desktop auch so ist. Mal angenommen, ich bin hier unten, hab mir das angeguckt."}, {"id": 31, "start": 324.4, "end": 327.0, "text": "Ich mein, auf dem Desktop geht das, ja? Auf dem Desktop kann ich hier klaut sein, auf"}, {"id": 32, "start": 327.0, "end": 331.12, "text": "dem Handy geht das nicht. Dann geh ich zurück und dann bin ich auf dem Handy wieder direkt"}, {"id": 33, "start": 331.12, "end": 335.28, "text": "oben. Richtig fail. Funktioniert überhaupt nicht. Also es gibt eigentlich nur die Chance,"}, {"id": 34, "start": 335.28, "end": 341.92, "text": "Old Reddit zu verwenden oder, was eigentlich ganz gut ist, das Ding. Ja, das kann man auch"}, {"id": 35, "start": 341.92, "end": 347.96, "text": "verwenden. Mittlerweile verwende ich das zum Reddit lesen, einfach weil es mir auf den"}, {"id": 36, "start": 347.96, "end": 357.12, "text": "Keks geht, was die offizielle Redditseite macht. Meinst du Reddit oder wirklich Twitter?"}, {"id": 37, "start": 357.12, "end": 365.96, "text": "Naja, ich bin auf Reddit und ich sag Reddit, also meine ich Reddit, oder? Twitter ist auch"}, {"id": 38, "start": 365.96, "end": 370.24, "text": "so ein Ding für sich, ja? Twitter hat auch so seine Sachen, aber bei Twitter, Twitter"}, {"id": 39, "start": 370.24, "end": 383.0, "text": "ist eine der Seiten, wo ich die Endless-Crawl-Geschichte ver... Oh. Ups. Ach, ich hab Twitter gesagt."}, {"id": 40, "start": 383.0, "end": 394.12, "text": "Ups. Nee, nee, nee, ich mein Reddit. Twitter, für Twitter versteh ich's noch. Auf Twitter"}, {"id": 41, "start": 394.12, "end": 398.64, "text": "versteh ich... Twitter ist einer der wenigen Seiten, wo ich das mit Endless-Crawl sinnvoll"}, {"id": 42, "start": 398.64, "end": 403.4, "text": "finde. Also es ist ja nicht so, dass alles schwachsinnig ist mit Endless-Crawl, aber"}, {"id": 43, "start": 403.4, "end": 408.72, "text": "Twitter ist okay, weil Twitter ist halt nur mal so ein Timeline-Ding, von oben nach unten,"}, {"id": 44, "start": 408.72, "end": 413.56, "text": "da ist es okay. Und in der Regel interessiert einen auf Twitter nicht, was jemand vor keine"}, {"id": 45, "start": 413.56, "end": 421.2, "text": "Ahnung irgendwie hier gepostet hat, da im September. Das interessiert normalerweise"}, {"id": 46, "start": 421.2, "end": 426.2, "text": "nicht so. Bei Twitter find ich's okay, bei Reddit find ich's voll für'n Arsch, diese"}, {"id": 47, "start": 426.2, "end": 432.36, "text": "ganze Endless-Crawl-Geschichte. Kennt ihr jemanden, einen guten Reddit-Reader für'n"}, {"id": 48, "start": 432.36, "end": 440.08, "text": "Desktop? Ansonsten muss man halt alt-Reddit verwenden. Aber alt-Reddit ist halt hässlich."}, {"id": 49, "start": 440.08, "end": 455.8, "text": "Und an vielen Stellen auch nicht mehr richtig supportet mit dem neuen Layout und so. Kein"}, {"id": 50, "start": 455.8, "end": 470.88, "text": "guten, ja. Sagt. PC-Noobs need help, Part 2. It's not much better, but it's The Witcher."}, {"id": 51, "start": 470.88, "end": 483.72, "text": "Naja, gut, es ist halt ein absolut unergonomischer Tisch. Das ist ein Küchentisch, ja. Und der"}, {"id": 52, "start": 483.72, "end": 489.64, "text": "hat ja, der kriegt ja Probleme im Knick, wenn er da hochgucken muss. Nimm mal vor, du sitzt"}, {"id": 53, "start": 489.64, "end": 499.36, "text": "hier, du musst ja auch relativ nah ran rücken, weil, weil Maus und vielleicht Armlehne-Stuhl,"}, {"id": 54, "start": 499.36, "end": 506.4, "text": "und dann, und dann kochen sie ja nach oben die ganze Zeit. Höhenverstellbarer Tisch-Beste,"}, {"id": 55, "start": 506.4, "end": 512.28, "text": "ja. Ich hab ja auch seit jetzt, glaub, mittlerweile 2 oder 3 Jahren einen. Ich verwende ihn nicht"}, {"id": 56, "start": 512.28, "end": 521.0, "text": "so oft, wie ich ihn verwenden sollte. Aber wenn man das mal benutzt, ist das exquisite,"}, {"id": 57, "start": 521.0, "end": 529.16, "text": "excellent. Höhenverstellbarer Tisch. Ich hatte mir ja damals so ein und so ein Gestell gekauft."}, {"id": 58, "start": 529.16, "end": 542.68, "text": "Genau, ich hatte mir so ein und so ein und so ein. Keine Ahnung welches davon. Wahrscheinlich"}, {"id": 59, "start": 542.68, "end": 544.64, "text": "gar keins davon. Ich hatte mir so eins von so, es ist so und so Dinger hier, hatte ich"}, {"id": 60, "start": 544.64, "end": 550.12, "text": "mir gekauft und hab's unter meinen aktuellen, also elektronisch höhenverstellbar, ne, unter"}, {"id": 61, "start": 550.12, "end": 556.08, "text": "meinen aktuellen Schreibtisch drunter gebaut und danach einfach die Tischbeine abgeschraubt"}, {"id": 62, "start": 556.08, "end": 559.36, "text": "und schon war der alte Schreibtisch, ohne dass man abräumen musste, höhenverstellbar."}, {"id": 63, "start": 559.36, "end": 581.84, "text": "Was geht jetzt ab? Das ist Pfeilfett, ja, das ist richtig Pfeilfett. So Leute, wir gucken"}, {"id": 64, "start": 581.84, "end": 586.76, "text": "uns jetzt erstmal so zum Einstieg. Wir gucken uns jetzt mal eine Desert Eagle Tactical Nuke"}, {"id": 65, "start": 586.76, "end": 589.76, "text": "in Modern Warfare 2 an. Einfach so, weil's geht und das erste Video ist, was ich aufhab."}, {"id": 66, "start": 589.76, "end": 608.4, "text": "So. Busy, busy leise der Gute, hä? Wobei, ich laber da eh immer drüber."}, {"id": 67, "start": 608.4, "end": 630.12, "text": "Man konnte die Desert Eagle so schön spammen, auch in Court 4 schon. Also so ziemlich das,"}, {"id": 68, "start": 630.12, "end": 646.2, "text": "was man wahrscheinlich mit der Pistole RL nicht machen würde."}, {"id": 69, "start": 646.2, "end": 660.56, "text": "Wer hat das mal gestand? Nein, Black Ops 4 hol ich mir garantiert nicht. Äh ne, 5 oder?"}, {"id": 70, "start": 660.56, "end": 671.48, "text": "5 sind wir doch jetzt sogar. Ich sag euch, Black Ops 5 für das Jahr werden"}, {"id": 71, "start": 671.48, "end": 681.52, "text": "auch verkaufsmäßig und insgesamt mäßig, also insgesamt, wo die Stonks abwärts gehen."}, {"id": 72, "start": 681.52, "end": 688.96, "text": "Black Ops 5. Bisher, egal was es war, war ja Call of Duty"}, {"id": 73, "start": 688.96, "end": 693.08, "text": "mehr oder weniger immer erfolgreich und ging immer irgendwo hoch. Und sie haben es auch"}, {"id": 74, "start": 693.08, "end": 700.04, "text": "mit Kack Games geschafft, durch gutes Marketing und schöne Verpackung, das gut zu verkaufen."}, {"id": 75, "start": 700.04, "end": 704.52, "text": "Also ich predicte einfach mal, dieses Jahr wird der Wendepunkt verkaut werden mit Black"}, {"id": 76, "start": 704.52, "end": 711.48, "text": "Ops 5. Es sei denn, es sei denn, das Game wird überraschend extrem geil, extrem gut."}, {"id": 77, "start": 711.48, "end": 720.72, "text": "Aber geh ich mal nicht von aus. Sollten sie Black Ops 5 wieder irgendwas, dann predicte"}, {"id": 78, "start": 720.72, "end": 723.04, "text": "ich, dieses Jahr wird der Wendepunkt verkaut werden."}, {"id": 79, "start": 723.04, "end": 749.0, "text": "15.000 mittlerweile, hat er wie viele Abos? 250.000, ja."}, {"id": 80, "start": 749.0, "end": 754.76, "text": "Also okay, dieses Gameplay ist, Gegner stunnen, hinrennen, killen, verstecken und dann wahrscheinlich"}, {"id": 81, "start": 754.76, "end": 768.96, "text": "Chopper, Gunner, Harrier, Nuke oder sowas. Harrier, Chopper, Gunner, Nuke. Gegner wieder."}, {"id": 82, "start": 768.96, "end": 780.92, "text": "Nee, Peo, Peo, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe, Poe."}, {"id": 83, "start": 780.92, "end": 785.2, "text": "Nee, nee, so habe ich das nicht gesagt. Entweder wird das Game extrem gut, oder aber, wenn"}, {"id": 84, "start": 785.2, "end": 789.44, "text": "es schlecht wird, dann wird es denge ich der Wendepunkt werden verkaut, dass es, dass"}, {"id": 85, "start": 789.44, "end": 794.48, "text": "es nicht mehr weiter nach oben geht. Das es, dass, dass dieses Jahr der Fall sein wird,"}, {"id": 86, "start": 794.48, "end": 796.16, "text": "ist halt nicht für recht wahrscheinlich."}, {"id": 87, "start": 796.16, "end": 804.42, "text": "Wenn es dieses Jahr sacken wird, die Stonks nicht mehr weiter hochgehen."}, {"id": 88, "start": 804.42, "end": 825.38, "text": "Ja, Karim kann auch gut sein."}, {"id": 89, "start": 825.38, "end": 829.76, "text": "Ich müsste mir mal die Verkaufszahlen und solche Geschichten von Modern Warfare angucken,"}, {"id": 90, "start": 829.76, "end": 835.66, "text": "aber so mein Gefühl sagt mir, die waren eigentlich ganz gut, ja."}, {"id": 91, "start": 835.66, "end": 841.62, "text": "Ich wusste gar nicht, dass man hier in die Ecke überhaupt kam."}, {"id": 92, "start": 841.62, "end": 852.78, "text": "Okay, das ist eine Nuke."}, {"id": 93, "start": 852.78, "end": 856.14, "text": "Das ist eine Nuke, wir machen fünf Kills und machen Harrier, Chopper, Karim, Nuke."}, {"id": 94, "start": 856.14, "end": 857.14, "text": "Komm."}, {"id": 95, "start": 857.14, "end": 858.14, "text": "Predator..."}, {"id": 96, "start": 858.14, "end": 859.14, "text": "Ach Gott."}, {"id": 97, "start": 859.14, "end": 864.14, "text": "Jetzt schießt er nicht mal die Richtigen mit seiner Predator ab."}, {"id": 98, "start": 864.14, "end": 876.22, "text": "Ich sag mal so, das hätte ich auch hingekriegt, das Einzige woran es bei mir gescheitert wäre,"}, {"id": 99, "start": 876.22, "end": 880.38, "text": "ich hätte nicht das Durchhaltevermögen gehabt, solange Desert Eagle Only zu spielen, bis ich"}, {"id": 100, "start": 880.38, "end": 881.38, "text": "ein gutes Gameplay gekriegt hätte."}, {"id": 101, "start": 881.38, "end": 891.38, "text": "Ich glaube nicht, dass Battle Royale großartig dazu beitragen könnte bei Modern Warfare."}, {"id": 102, "start": 891.38, "end": 895.62, "text": "Vielleicht ein bisschen, aber man hat es gesehen, das Battle Royale, ich meine, guck dir Firestorm"}, {"id": 103, "start": 895.62, "end": 899.86, "text": "an, das Battle Royale bei weitem nicht mal das ist, wo alle jetzt irgendwie danach lächzen,"}, {"id": 104, "start": 899.86, "end": 900.86, "text": "ja."}, {"id": 105, "start": 900.86, "end": 901.86, "text": "Das ist auch schon wieder ein bisschen vorbei."}, {"id": 106, "start": 901.86, "end": 907.02, "text": "Was sag ich gerade, der aktuelle Hype?"}, {"id": 107, "start": 907.02, "end": 913.18, "text": "Auto-Battler ist ja auch, Auto-Battler war ja gar kein richtiger Hype, da war ja gefühlt"}, {"id": 108, "start": 913.18, "end": 914.82, "text": "zwei Wochen und danach war es wieder vorbei."}, {"id": 109, "start": 914.82, "end": 922.1, "text": "Ja, Escape, Tarkov ist doch auch mehr oder weniger Battle Royale, oder?"}, {"id": 110, "start": 922.1, "end": 925.1, "text": "Oder nicht?"}, {"id": 111, "start": 925.1, "end": 928.1, "text": "Keine Ahnung."}, {"id": 112, "start": 928.1, "end": 938.14, "text": "Ne, Tarkov ist doch so eine Mischung aus Battle Royale und PUBG-Loot-Inventory-Management-Ding."}, {"id": 113, "start": 938.14, "end": 963.26, "text": "Okay, das war jetzt ein langweiliges Gameplay."}, {"id": 114, "start": 963.26, "end": 970.18, "text": "Warum ist Tarkov eigentlich auf einmal so beliebt, das gibt es doch schon drei Jahre oder so."}, {"id": 115, "start": 970.18, "end": 971.62, "text": "Warum ist Tarkov gerade so beliebt?"}, {"id": 116, "start": 971.62, "end": 972.62, "text": "Versteht das jemand?"}, {"id": 117, "start": 972.62, "end": 980.74, "text": "Ich weiß, es gibt Trops, es gibt Trops und es gibt irgendwelche Achievement-Dinger fürs"}, {"id": 118, "start": 980.74, "end": 992.1, "text": "Gucken oder so, weil das gibt es doch schon richtig lange."}, {"id": 119, "start": 992.1, "end": 998.06, "text": "Tarkov, das gibt es seit drei Jahren und das hat keinen interessiert bisher, wahrscheinlich"}, {"id": 120, "start": 998.06, "end": 999.06, "text": "nur deswegen."}, {"id": 121, "start": 999.06, "end": 1000.06, "text": "Okay."}, {"id": 122, "start": 1000.06, "end": 1003.9, "text": "Gepusht durch große Streamer, ja das muss ja irgendeinen Grund geben, warum die das"}, {"id": 123, "start": 1003.9, "end": 1005.38, "text": "auf einmal alle gestreamt haben."}, {"id": 124, "start": 1005.38, "end": 1016.18, "text": "Naja, zumindest, ich habe mal ganz kurz beim Lost geguckt, zumindest macht das Game den"}, {"id": 125, "start": 1016.18, "end": 1018.58, "text": "Eindruck, als hat es eine gewisse Tiefe, als kann man das eine Weile spielen."}, {"id": 126, "start": 1018.58, "end": 1029.5, "text": "War das Paid-Promotion bei den großen Streamern oder haben die einfach gesagt, wir wollen"}, {"id": 127, "start": 1029.5, "end": 1030.5, "text": "es mal wieder spielen?"}, {"id": 128, "start": 1030.5, "end": 1035.34, "text": "Das ist ja der Unterschied, ich meine, Raid Shadow Legends ist Paid-Promotion, schwache"}, {"id": 129, "start": 1035.34, "end": 1036.34, "text": "Konkurrenz."}, {"id": 130, "start": 1036.34, "end": 1047.54, "text": "Wir gucken uns jetzt mal hier einen Speed-Test-Vergleich an, was auch immer er da testet, ich muss"}, {"id": 131, "start": 1047.54, "end": 1053.18, "text": "mal schauen, ob das überhaupt was Sinnvolles ist, allein schon das Like und Dislike ausgeschaltet"}, {"id": 132, "start": 1053.18, "end": 1063.3, "text": "sind bei dem Video, ist schon verdächtig, wir gucken mal, wahrscheinlich ist das Video"}, {"id": 133, "start": 1063.3, "end": 1079.78, "text": "kompletter Crap, erstmal Intro, erstmal Intro, oh, der hört sich ja wahnsinnig motiviert"}, {"id": 134, "start": 1079.78, "end": 1109.1, "text": "an, ist das Text-to-Speech, der spricht so, wie ich mich gerade fühle, achso, ey, 1,5"}, {"id": 135, "start": 1109.1, "end": 1126.5, "text": "funktioniert richtig gut, äh, Moment mal Leute, es ist Chrome, es ist Chrome und es"}, {"id": 136, "start": 1126.5, "end": 1136.54, "text": "ist Chrome, es ist nicht Chrome, also es ist quasi dreimal Chrome versus einmal nicht"}, {"id": 137, "start": 1136.54, "end": 1143.14, "text": "Chrome und die größte Frage ist, warum ist der Unterschied zwischen dreimal Chrome so"}, {"id": 138, "start": 1143.14, "end": 1144.14, "text": "unterschiedlich?"}, {"id": 139, "start": 1144.14, "end": 1161.34, "text": "Firefox ist auch auf Chrome, nein, ist es nicht, deine Seite-Ladenzeit kann man jetzt"}, {"id": 140, "start": 1161.34, "end": 1169.14, "text": "schlecht, also zumindest nicht einmal, das müsstest du vielleicht, vielleicht 500 mal"}, {"id": 141, "start": 1169.14, "end": 1184.42, "text": "machen, dass das halbwegs aussagekräftig wäre, was denn das für bescheuerter Test,"}, {"id": 142, "start": 1184.42, "end": 1192.38, "text": "das ist ja der bescheuertste Browser-Speedtest, den ich je gesehen habe, das ist wirklich"}, {"id": 143, "start": 1192.38, "end": 1207.14, "text": "so low-brainer, oi, oi, 3-Hat-Video, als würde Chrome 10 Sekunden hängen, seine Hinterhaltverbindung"}, {"id": 144, "start": 1207.14, "end": 1213.58, "text": "ist einfach kacke bei dem Refresh oder irgendwo wird es sonst woher geroutet, das liegt doch"}, {"id": 145, "start": 1213.58, "end": 1222.66, "text": "im Leben nicht an Chrome, da glaubt man nicht wirklich, dass, oh Gott, was ein Schwachsinnstest,"}, {"id": 146, "start": 1222.66, "end": 1238.02, "text": "das ist eher indisches Internet bei dem, was ein Schwachsinnstest, alter, was ein Schwachsinnstest,"}, {"id": 147, "start": 1238.02, "end": 1249.06, "text": "das kann ich mir da angucken, das hat 100.000 Views, es wird echt Zeit, dass ich diese 5"}, {"id": 148, "start": 1249.06, "end": 1255.7, "text": "Chrome-Tipps während meines Lebens veränderndes Video mache, da krieg ich auch Views, alter,"}, {"id": 149, "start": 1255.7, "end": 1265.38, "text": "was ein Bullshit, übrigens ich hab den beschleunigt, man hört es aber kaum, weil er so langsam"}, {"id": 150, "start": 1265.38, "end": 1275.42, "text": "spricht, Nummer 4 wird dich schockieren, oder, nee, nee, geh fort, das kannst du mir nicht"}, {"id": 151, "start": 1275.42, "end": 1280.86, "text": "fertig angucken, geh weg, geh weg, so, was haben wir dann als nächstes, Downgrade and"}, {"id": 152, "start": 1280.86, "end": 1287.1, "text": "Lies, achso, da lässt sich über reforged aus, ich weiß nicht, ob ich mir das reforged"}, {"id": 153, "start": 1287.1, "end": 1294.54, "text": "Video schon geben will, komm, wir geben uns das reforged Video, mittlerweile habt ihr"}, {"id": 154, "start": 1294.54, "end": 1300.62, "text": "das gesehen, Metacritic reforged, ich hab ja auf Twitter gepostet, dass es für Blizzard"}, {"id": 155, "start": 1300.62, "end": 1311.06, "text": "richtig gut läuft gerade, du hast das Fazit skippt, ja, das Video war crap, so, ja, am"}, {"id": 156, "start": 1311.06, "end": 1329.34, "text": "Freitag, oder wann das war, 29, am Mittwoch, da war das Ganze noch 2.3, mittlerweile, passt"}, {"id": 157, "start": 1329.34, "end": 1344.98, "text": "mal auf, passt mal auf, ist auf 0,5, die haben so verkackt, Blizzard, please, das dürfte"}, {"id": 158, "start": 1344.98, "end": 1349.22, "text": "so ziemlich, ich weiß nicht, ob es das schlecht bewertetste Game ist auf Metacritic, es ist"}, {"id": 159, "start": 1349.22, "end": 1374.18, "text": "auf jeden Fall ganz unten mit dabei, 0.5, das ist wirklich für den Arsch, mal gucken,"}, {"id": 160, "start": 1374.18, "end": 1381.18, "text": "was denn so schlecht ist, also woran sich zum größten Teil gestört wird, ich hab's"}, {"id": 161, "start": 1381.18, "end": 1383.94, "text": "mir gar nicht, ich hab's weder Pre-Order noch, noch werd ich's mir kaufen, ich wollte"}, {"id": 162, "start": 1383.94, "end": 1387.66, "text": "es mir eigentlich kaufen, aber jetzt kauf ich nicht, also im größten Teil woran sich dran"}, {"id": 163, "start": 1387.66, "end": 1392.86, "text": "gestört wird ist eigentlich, also erstens mal die Performance, die Performance muss"}, {"id": 164, "start": 1392.86, "end": 1399.46, "text": "richtig schlecht sein, FPS Einbrüche ohne Ende, dass sie den alten Client durch den neuen"}, {"id": 165, "start": 1399.46, "end": 1407.06, "text": "Zwangs ersetzt haben im Battle-Net ist für viele auch ein Unding, dazu kommt, dass vieles"}, {"id": 166, "start": 1407.06, "end": 1411.54, "text": "was versprochen wurde einfach nicht drin ist, die Cutscenes sind glaube ich bis auf die"}, {"id": 167, "start": 1411.54, "end": 1418.78, "text": "Intro-Cutscenes und noch irgendwas nicht wirklich Remaked, sondern einfach nur nochmal neu"}, {"id": 168, "start": 1418.78, "end": 1427.38, "text": "gerendert, die ganzen Sachen, die sie auf der E3 Demo gezeigt haben, also von den neuen"}, {"id": 169, "start": 1427.38, "end": 1435.38, "text": "Kampagnen-Intros zu dem, wie die Kamera sich bewegt und wie die Missionen aufgebaut werden,"}, {"id": 170, "start": 1435.38, "end": 1439.34, "text": "dass es noch ein bisschen zusätzliches Story geben soll, ist auch alles nicht drin und"}, {"id": 171, "start": 1439.34, "end": 1443.82, "text": "die Multiplayer muss voll von Arsch sein, dass du noch nicht mal ein Ranking-System"}, {"id": 172, "start": 1443.82, "end": 1450.46, "text": "hast, ich mein, wie auch immer man das hinkriegt, es gibt irgendwie kein ordentliches Ranking,"}, {"id": 173, "start": 1450.46, "end": 1456.1, "text": "kein Clan-System, keine normalen Battle-Net-Chats mehr, es muss wohl einfach voll von Arsch"}, {"id": 174, "start": 1456.1, "end": 1457.46, "text": "sein, aber wir gucken uns das einfach mal an."}, {"id": 175, "start": 1486.1, "end": 1503.06, "text": "Nächstes Stück in der Woche, er!"}, {"id": 176, "start": 1503.06, "end": 1507.14, "text": "Demo, die machen das Gegenteil von mir."}, {"id": 177, "start": 1507.14, "end": 1511.18, "text": "Ich veröffentliche im Jahr 6 Videos und die veröffentliche ich in der Woche 6 Videos."}, {"id": 178, "start": 1511.18, "end": 1528.7, "text": "Sag mal, Leute, irgendwie redet er anstrengend, oder?"}, {"id": 179, "start": 1528.7, "end": 1546.5, "text": "Ja, das UI und das ganze Zeug, das ist auch nicht im Game, das ist nicht drinne, also"}, {"id": 180, "start": 1546.5, "end": 1551.98, "text": "das, was man hier auf der Demo gesehen hat, gibt es so im Game nicht und am besten ist,"}, {"id": 181, "start": 1551.98, "end": 1557.42, "text": "dass man sich rausreden will, das beste ist, dass man sich rausreden will, so nach dem Motto,"}, {"id": 182, "start": 1557.42, "end": 1560.18, "text": "man hat das so gemacht, weil man auf die Fans hören möchte."}, {"id": 183, "start": 1560.18, "end": 1584.18, "text": "Die World of Warcraft Lore, da blickt kein Mensch mehr durch, das ist mittlerweile so"}, {"id": 184, "start": 1584.18, "end": 1588.1, "text": "unglaublich, wir, da kannste nicht mehr, das checkt Blizzard selbst nicht mal mehr."}, {"id": 185, "start": 1588.1, "end": 1606.62, "text": "Ach ja und es gibt auch noch ein großes Problem im Multiplayer, was zumindest die Pros sagen"}, {"id": 186, "start": 1606.62, "end": 1614.94, "text": "ist, dass die neuen Einheiten, also die neuen Models, dass sie zu unterschiedlich zu den"}, {"id": 187, "start": 1614.94, "end": 1619.02, "text": "alten aussehen, auch von den Umresten her, dass man nicht erkennt, was passiert."}, {"id": 188, "start": 1619.02, "end": 1621.3, "text": "Das kann ich halt absolut nicht beurteilen."}, {"id": 189, "start": 1621.3, "end": 1636.1, "text": "Ich verstehe halt nicht, warum er das preordert hat."}, {"id": 190, "start": 1636.1, "end": 1641.82, "text": "Es gibt überhaupt keinen Grund, das Spiel wird rein digital vertrieben, rein digital."}, {"id": 191, "start": 1641.82, "end": 1649.94, "text": "Warum, und das Chat jetzt ernst gemeinte Frage an den, warum sollte ich das preordern?"}, {"id": 192, "start": 1649.94, "end": 1655.34, "text": "Ich weiß, es gab irgendwie so einen komischen, es gab irgendwie einen preorder Skin oder"}, {"id": 193, "start": 1655.34, "end": 1660.38, "text": "sowas, aber warum, warum, warum genau sollte ich es preordern?"}, {"id": 194, "start": 1660.38, "end": 1674.78, "text": "Ja, genau, das braucht halt kein Mensch, dafür würde ich noch nicht preordern."}, {"id": 195, "start": 1674.78, "end": 1683.22, "text": "Moment, das hat mit preorder nichts mehr zu tun, das ist, wenn ich die Spoils of War Edition"}, {"id": 196, "start": 1683.22, "end": 1696.66, "text": "kaufe, gibt für mich überhaupt keinen Sinn zu preordern, zu viel Ungeduld, naja, aber"}, {"id": 197, "start": 1696.66, "end": 1698.58, "text": "ich kriege es ja auch trotz preorder nicht früher."}, {"id": 198, "start": 1698.58, "end": 1711.02, "text": "Ihr müsst mal auf Reddit gucken, wir sind am eskalieren die Leute."}, {"id": 199, "start": 1711.02, "end": 1732.62, "text": "Man darf auch nicht vergessen, die Trailer, die sie rausgehauen haben mit den Änderungen,"}, {"id": 200, "start": 1732.62, "end": 1741.38, "text": "die dann, beziehungsweise mit den, mit den Vorschauen, mit dem Vorschau-Material, diese"}, {"id": 201, "start": 1741.38, "end": 1745.14, "text": "Trailer gibt es immer noch zu sehen, also sprich, man weiß gar nicht genau, wann man"}, {"id": 202, "start": 1745.14, "end": 1746.7, "text": "das Game kauft, dass es nicht drin ist."}, {"id": 203, "start": 1746.7, "end": 1754.86, "text": "Auf jedem, auf jedem Blizzard Reddit, auf alles, alles, selbst, selbst bei Overwatch"}, {"id": 204, "start": 1754.86, "end": 1784.78, "text": "sind sie aber rum, vielleicht mehr über WarCraft."}, {"id": 205, "start": 1784.78, "end": 1794.94, "text": "Geil oder, aus 4 Stunden werden einfach mal 4 Minuten, die ist richtig schlecht, also"}, {"id": 206, "start": 1794.94, "end": 1801.34, "text": "ich meine, die im Original gab es diese Cutscene war quasi nicht existent, also das war übrigens"}, {"id": 207, "start": 1801.34, "end": 1805.26, "text": "auch einer meiner größten Enttäuschungen damals in der WarCraft 3 Kampagne, dass es"}, {"id": 208, "start": 1805.26, "end": 1813.38, "text": "hier keine coole Cutscene zugab, es gab ein bisschen, also es gab eine 15 Sekunden Cutscene,"}, {"id": 209, "start": 1813.38, "end": 1819.3, "text": "wo Arthas Illidan platt macht, was heißt, der überlebt ja sogar, aber das war halt"}, {"id": 210, "start": 1819.3, "end": 1822.66, "text": "keine richtige Cutscene und da haben halt alle drauf gehofft, hey vielleicht gibt es jetzt"}, {"id": 211, "start": 1822.66, "end": 1828.74, "text": "hier endlich mal eine richtig coole Render-Cutscene für eines der quasi größten Momente aus"}, {"id": 212, "start": 1828.74, "end": 1834.66, "text": "der Kampagne, aber gibt es nicht, es gibt so ein komisch neu animiertes Ding, ich hoffe,"}, {"id": 213, "start": 1834.66, "end": 1845.18, "text": "er zeigt es mal, das ist so schlecht geworden, das ist so schlecht geworden, das ist so schlecht"}, {"id": 214, "start": 1845.18, "end": 1846.18, "text": "geworden."}, {"id": 215, "start": 1846.18, "end": 1874.9, "text": "Da muss ich übrigens mal angucken, wie gut die WarCraft 3 Cutscenes heute noch ausschauen,"}, {"id": 216, "start": 1874.9, "end": 1881.22, "text": "ich meine, man sieht ihnen an, dass sie 20 Jahre alt sind, ja nicht ganz, 17 Jahre, wann"}, {"id": 217, "start": 1881.22, "end": 1890.46, "text": "kam das raus, 2003 oder so, genau, 2002, 2001, ich weiß es nicht, wann das genau rauskam,"}, {"id": 218, "start": 1890.46, "end": 1896.38, "text": "es ist auf jeden Fall schon 15 plus Jahre alt, dafür sehen die Cutscenes in 1008 Spielen"}, {"id": 219, "start": 1896.38, "end": 1905.3, "text": "gerendert wirklich beachtlich gut aus, äh Diablo 4 wird nichts, ich sehe Blizzard kein"}, {"id": 220, "start": 1905.3, "end": 1920.78, "text": "gutes, also zumindest kein richtig herausragendes Spiel mehr machen in der Richtung, ja, guckt"}, {"id": 221, "start": 1920.78, "end": 1925.3, "text": "euch mal die Kamera an, hier haben sie das richtig neu in Szene gesetzt und hier ist"}, {"id": 222, "start": 1925.3, "end": 1928.82, "text": "es einfach Kamera oben drüber und fertig."}, {"id": 223, "start": 1955.3, "end": 1970.58, "text": "Ja, guckt mal, wie das ruckelt, Leute, oh wie das ruckelt, ach ja, Custom Maps funktionieren"}, {"id": 224, "start": 1970.58, "end": 1972.98, "text": "übrigens auch nicht richtig, das habe ich ja vorhin ganz vergessen zu erwähnen."}, {"id": 225, "start": 1972.98, "end": 1986.5, "text": "Guckt euch mal, wie der Leiter des Menüs ruckelt."}, {"id": 226, "start": 1986.5, "end": 2005.74, "text": "Guckt mal, wie der Leiter des Menus ruckelt."}, {"id": 227, "start": 2005.74, "end": 2007.74, "text": "Klan, die sind nicht da."}, {"id": 228, "start": 2007.74, "end": 2009.74, "text": "Es gibt auch keine Cross-Region-Spiele."}, {"id": 229, "start": 2009.74, "end": 2011.74, "text": "Die neue Battle.net-Integration"}, {"id": 230, "start": 2011.74, "end": 2013.74, "text": "hat einige Features,"}, {"id": 231, "start": 2013.74, "end": 2015.74, "text": "aber sie haben viel mehr verloren"}, {"id": 232, "start": 2015.74, "end": 2017.74, "text": "in dieser Transition, als sie eigentlich gewonnen haben."}, {"id": 233, "start": 2017.74, "end": 2019.74, "text": "Dendi Gila hat auch"}, {"id": 234, "start": 2019.74, "end": 2021.74, "text": "die End-User-License-Aufgabe geändert,"}, {"id": 235, "start": 2021.74, "end": 2023.74, "text": "sodass alles, was in der Welt-Editor gegründet wurde,"}, {"id": 236, "start": 2023.74, "end": 2025.74, "text": "die Intellektuellen Fähigkeiten des Blizzards sind."}, {"id": 237, "start": 2025.74, "end": 2027.74, "text": "Ja, sie sind immer noch sehr salzig,"}, {"id": 238, "start": 2027.74, "end": 2029.74, "text": "überlose Dota, aber wenn sie das tun,"}, {"id": 239, "start": 2029.74, "end": 2031.74, "text": "haben sie ziemlich garantiert,"}, {"id": 240, "start": 2031.74, "end": 2033.74, "text": "dass sie nie wieder diese Lichtung ausbreiten werden."}, {"id": 241, "start": 2033.74, "end": 2035.74, "text": "Das Menü ruckelt wegen Elektronen."}, {"id": 242, "start": 2035.74, "end": 2037.74, "text": "Da sind sie selbst dran schuld."}, {"id": 243, "start": 2037.74, "end": 2039.74, "text": "Wenn man auch alles im Browser machen muss..."}, {"id": 244, "start": 2049.74, "end": 2051.74, "text": "Genau."}, {"id": 245, "start": 2051.74, "end": 2053.74, "text": "Vielleicht ist das Video auch von mir."}, {"id": 246, "start": 2053.74, "end": 2055.74, "text": "Ich promotee mein eigenes Video."}, {"id": 247, "start": 2055.74, "end": 2057.74, "text": "Also, sie haben so verkackt."}, {"id": 248, "start": 2063.74, "end": 2065.74, "text": "Menü in Elektron war kein Chalk."}, {"id": 249, "start": 2065.74, "end": 2087.74, "text": "Nee, nee, das war kein Witz."}, {"id": 250, "start": 2095.74, "end": 2099.74, "text": "Ja, das finde ich für mich der größte Fail,"}, {"id": 251, "start": 2099.74, "end": 2101.74, "text": "dass man gesagt hat, okay,"}, {"id": 252, "start": 2101.74, "end": 2103.74, "text": "man ersetzt Hardcoded,"}, {"id": 253, "start": 2103.74, "end": 2105.74, "text": "also man ersetzt den alten Client"}, {"id": 254, "start": 2105.74, "end": 2107.74, "text": "zwangsgezwungen durch das neue."}, {"id": 255, "start": 2113.74, "end": 2115.74, "text": "Vor allem, ich brauche jetzt 30G."}, {"id": 256, "start": 2115.74, "end": 2117.74, "text": "Wie groß war das alte Game"}, {"id": 257, "start": 2117.74, "end": 2143.74, "text": "mit Addon 1,5G oder so?"}, {"id": 258, "start": 2143.74, "end": 2145.74, "text": "Sie haben es nicht nur einfach verkackt,"}, {"id": 259, "start": 2145.74, "end": 2147.74, "text": "sie haben das alte auch noch schlechter gemacht."}, {"id": 260, "start": 2147.74, "end": 2149.74, "text": "Das musste er erst mal schaffen."}, {"id": 261, "start": 2151.74, "end": 2153.74, "text": "Gerade in Russland, ey, ohne Scheiß,"}, {"id": 262, "start": 2153.74, "end": 2155.74, "text": "in China und Russland"}, {"id": 263, "start": 2155.74, "end": 2157.74, "text": "ist Warcraft 3 immer noch ziemlich groß."}, {"id": 264, "start": 2157.74, "end": 2173.74, "text": "Oder war?"}, {"id": 265, "start": 2187.74, "end": 2191.74, "text": "Ja, weil die Leute, weil die festgestellt haben,"}, {"id": 266, "start": 2191.74, "end": 2217.74, "text": "es wollen irgendwie fast alle ihren Kram zurückgeben."}, {"id": 267, "start": 2221.74, "end": 2225.74, "text": "Die Antworten da auch nicht drauf."}, {"id": 268, "start": 2225.74, "end": 2227.74, "text": "Garantiert nicht."}, {"id": 269, "start": 2233.74, "end": 2235.74, "text": "Das ist ja nichts Neues mittlerweile"}, {"id": 270, "start": 2235.74, "end": 2237.74, "text": "mehr bei Blizzard."}, {"id": 271, "start": 2247.74, "end": 2249.74, "text": "Ich finde es halt krass,"}, {"id": 272, "start": 2249.74, "end": 2251.74, "text": "dass sich das bei Blizzard geändert hat."}, {"id": 273, "start": 2251.74, "end": 2253.74, "text": "Früher war das ein Laden,"}, {"id": 274, "start": 2253.74, "end": 2255.74, "text": "der ganze Games nach jahrelanger Entwicklung"}, {"id": 275, "start": 2255.74, "end": 2257.74, "text": "einfach eingestellt hat,"}, {"id": 276, "start": 2257.74, "end": 2259.74, "text": "weil sie ihnen nicht gefallen haben letztendlich"}, {"id": 277, "start": 2259.74, "end": 2261.74, "text": "zu sowas."}, {"id": 278, "start": 2261.74, "end": 2263.74, "text": "Hätte man nicht irgendwie einen Mittelweg finden können?"}, {"id": 279, "start": 2265.74, "end": 2267.74, "text": "Aber das geht halt nicht,"}, {"id": 280, "start": 2267.74, "end": 2269.74, "text": "wenn du nur noch Activision-BWL-Köppe"}, {"id": 281, "start": 2269.74, "end": 2279.74, "text": "oder andere Spiele hast, wie StarCraft Remastered."}, {"id": 282, "start": 2279.74, "end": 2281.74, "text": "Ich glaube, das Blamen ist wirklich nicht fair."}, {"id": 283, "start": 2281.74, "end": 2283.74, "text": "Ich glaube, das ist eigentlich alles bei Blizzard."}, {"id": 284, "start": 2283.74, "end": 2285.74, "text": "Das klassische Team,"}, {"id": 285, "start": 2285.74, "end": 2287.74, "text": "sie wollten wahrscheinlich dieses Spiel machen,"}, {"id": 286, "start": 2287.74, "end": 2289.74, "text": "nur weil sie War 3 lieben."}, {"id": 287, "start": 2289.74, "end": 2291.74, "text": "Aber sie waren wahrscheinlich mit einem Schussring-Budget"}, {"id": 288, "start": 2291.74, "end": 2293.74, "text": "und hatten wahrscheinlich keine guten Art-Ressourcen,"}, {"id": 289, "start": 2293.74, "end": 2295.74, "text": "um in einer effektiven Weise mit Lemon Sky"}, {"id": 290, "start": 2295.74, "end": 2297.74, "text": "zu koordinieren."}, {"id": 291, "start": 2297.74, "end": 2299.74, "text": "Ich glaube, es ist ein Spiel,"}, {"id": 292, "start": 2299.74, "end": 2301.74, "text": "das wahrscheinlich schlechter aussieht,"}, {"id": 293, "start": 2301.74, "end": 2303.74, "text": "als das Original,"}, {"id": 294, "start": 2303.74, "end": 2305.74, "text": "sogar nach einem viel späteren Release-Date."}, {"id": 295, "start": 2305.74, "end": 2307.74, "text": "Es ist gebrochen, es ist gebrochen,"}, {"id": 296, "start": 2307.74, "end": 2309.74, "text": "und das Original kann nicht mehr"}, {"id": 297, "start": 2309.74, "end": 2311.74, "text": "in der gleichen Weise gespielt werden,"}, {"id": 298, "start": 2311.74, "end": 2313.74, "text": "weil sie Old-Venet getötet haben."}, {"id": 299, "start": 2313.74, "end": 2315.74, "text": "Und wirklich, ein Reddit-User"}, {"id": 300, "start": 2315.74, "end": 2317.74, "text": "hat einen sehr aufregenden Kommentar geblieben."}, {"id": 301, "start": 2317.74, "end": 2319.74, "text": "Blizzard hat immer etwas"}, {"id": 302, "start": 2319.74, "end": 2321.74, "text": "über absolut flottes Polieren gemacht."}, {"id": 303, "start": 2321.74, "end": 2323.74, "text": "In den vergangenen 90er- und 2000er-Jahren"}, {"id": 304, "start": 2323.74, "end": 2325.74, "text": "war Blizzard ein Name,"}, {"id": 305, "start": 2325.74, "end": 2327.74, "text": "und das war es auch."}, {"id": 306, "start": 2327.74, "end": 2329.74, "text": "Das stimmt."}, {"id": 307, "start": 2357.74, "end": 2359.74, "text": "Ja."}, {"id": 308, "start": 2373.74, "end": 2375.74, "text": "Aber Microsoft"}, {"id": 309, "start": 2375.74, "end": 2377.74, "text": "ist ja zurzeit eh so ein bisschen auf dem Trip,"}, {"id": 310, "start": 2377.74, "end": 2379.74, "text": "dass sie"}, {"id": 311, "start": 2381.74, "end": 2383.74, "text": "wieder ein bisschen mehr auf"}, {"id": 312, "start": 2383.74, "end": 2385.74, "text": "Echtzeitstrategie-Sachen setzen."}, {"id": 313, "start": 2385.74, "end": 2387.74, "text": "Ich weiß auch nicht so richtig, warum."}, {"id": 314, "start": 2391.74, "end": 2393.74, "text": "Vielleicht weil sie sich denken,"}, {"id": 315, "start": 2393.74, "end": 2395.74, "text": "das spielt sich am besten auf dem PC."}, {"id": 316, "start": 2411.74, "end": 2413.74, "text": "Ja, alle recht."}, {"id": 317, "start": 2413.74, "end": 2415.74, "text": "Und..."}, {"id": 318, "start": 2417.74, "end": 2419.74, "text": "Die Sache ist halt auch die,"}, {"id": 319, "start": 2419.74, "end": 2421.74, "text": "jetzt wo Diablo 4"}, {"id": 320, "start": 2421.74, "end": 2423.74, "text": "am Start ist, und es kommt ja auch"}, {"id": 321, "start": 2423.74, "end": 2425.74, "text": "Path of Exile 2, für mich ist es so,"}, {"id": 322, "start": 2425.74, "end": 2427.74, "text": "dass"}, {"id": 323, "start": 2427.74, "end": 2429.74, "text": "nicht irgendwie Path of Exile beweisen müsste,"}, {"id": 324, "start": 2429.74, "end": 2431.74, "text": "dass es besser sein kann als Diablo."}, {"id": 325, "start": 2431.74, "end": 2433.74, "text": "Es ist eher umgedreht."}, {"id": 326, "start": 2433.74, "end": 2435.74, "text": "Diablo 4 muss beweisen, dass es auch nur"}, {"id": 327, "start": 2435.74, "end": 2437.74, "text": "ansatzweise an Path of Exile kratzen kann."}, {"id": 328, "start": 2437.74, "end": 2439.74, "text": "Path of Exile hat es lange"}, {"id": 329, "start": 2439.74, "end": 2441.74, "text": "bewiesen, dass es der bessere Nachfolger"}, {"id": 330, "start": 2441.74, "end": 2443.74, "text": "als Diablo 2 ist, als Diablo 3."}, {"id": 331, "start": 2443.74, "end": 2445.74, "text": "Die müssen das überhaupt nicht mehr"}, {"id": 332, "start": 2445.74, "end": 2447.74, "text": "beweisen, und"}, {"id": 333, "start": 2447.74, "end": 2449.74, "text": "Blizzard müsste"}, {"id": 334, "start": 2449.74, "end": 2451.74, "text": "ein absolutes"}, {"id": 335, "start": 2453.74, "end": 2455.74, "text": "Meisterwerk mit"}, {"id": 336, "start": 2455.74, "end": 2457.74, "text": "Diablo 4 releasen, dass die an"}, {"id": 337, "start": 2457.74, "end": 2459.74, "text": "Path of Exile oder beziehungsweise an das,"}, {"id": 338, "start": 2459.74, "end": 2461.74, "text": "was sie mit Path of Exile 2 vorhaben, dran kommen."}, {"id": 339, "start": 2461.74, "end": 2463.74, "text": "Oder aber, sie"}, {"id": 340, "start": 2463.74, "end": 2465.74, "text": "müssten es mit Path of Exile 2 extrem"}, {"id": 341, "start": 2465.74, "end": 2467.74, "text": "krass verkacken, wovon ich aber nicht ausgehe,"}, {"id": 342, "start": 2467.74, "end": 2469.74, "text": "weil die haben es jetzt geschafft seit"}, {"id": 343, "start": 2469.74, "end": 2471.74, "text": "5-7 Jahren,"}, {"id": 344, "start": 2471.74, "end": 2473.74, "text": "vielleicht schon,"}, {"id": 345, "start": 2473.74, "end": 2475.74, "text": "ich schon ein bisschen älter,"}, {"id": 346, "start": 2477.74, "end": 2479.74, "text": "immer gute Erweiterungen zu bringen."}, {"id": 347, "start": 2485.74, "end": 2487.74, "text": "Wir gucken uns fast nie"}, {"id": 348, "start": 2487.74, "end": 2489.74, "text": "Level Cap an,"}, {"id": 349, "start": 2489.74, "end": 2491.74, "text": "aber das interessiert mich tatsächlich,"}, {"id": 350, "start": 2491.74, "end": 2493.74, "text": "wenn wieder irgendwelche Leute"}, {"id": 351, "start": 2493.74, "end": 2495.74, "text": "bei Battlefield abhauen."}, {"id": 352, "start": 2495.74, "end": 2497.74, "text": "Mal gucken, um was es in dem Video geht."}, {"id": 353, "start": 2497.74, "end": 2499.74, "text": "Der macht ja manchmal ganz gerne Videotitel,"}, {"id": 354, "start": 2499.74, "end": 2501.74, "text": "woran dann 2 Sekunden was zu sagen, dann ist es wieder weg."}, {"id": 355, "start": 2501.74, "end": 2503.74, "text": "Aber mal schauen."}, {"id": 356, "start": 2513.74, "end": 2515.74, "text": "Okay, es ist doch"}, {"id": 357, "start": 2515.74, "end": 2517.74, "text": "kein Video, was da drüber geht."}, {"id": 358, "start": 2517.74, "end": 2519.74, "text": "Das Wichtigste zum nächsten Mal."}, {"id": 359, "start": 2519.74, "end": 2521.74, "text": "DICE entdeckte die nächste Map, die in Battlefield 5 kommt,"}, {"id": 360, "start": 2521.74, "end": 2523.74, "text": "mit der 68-Zart-Update."}, {"id": 361, "start": 2523.74, "end": 2525.74, "text": "Solomon Islands nimmt Spieler"}, {"id": 362, "start": 2525.74, "end": 2527.74, "text": "in den Pacific."}, {"id": 363, "start": 2527.74, "end": 2529.74, "text": "Die Beachier öffnen die Beach-Terrain,"}, {"id": 364, "start": 2529.74, "end": 2531.74, "text": "die Menschen um sich herum."}, {"id": 365, "start": 2533.74, "end": 2535.74, "text": "Die Update enthält 3 neue Waffen"}, {"id": 366, "start": 2535.74, "end": 2537.74, "text": "und 2 neue Gadgets."}, {"id": 367, "start": 2537.74, "end": 2539.74, "text": "Der Type 11 LMG, Model 37"}, {"id": 368, "start": 2539.74, "end": 2541.74, "text": "mit Schockgerät und M2-Karbein"}, {"id": 369, "start": 2541.74, "end": 2543.74, "text": "werden alle angeboten als Teil"}, {"id": 370, "start": 2543.74, "end": 2546.38, "text": "Ist der Panzer komplett bescheuert? Warum trifft er den nicht?"}, {"id": 371, "start": 2546.38, "end": 2567.86, "text": "Nope Panzer! An A-Aim!"}, {"id": 372, "start": 2576.38, "end": 2604.18, "text": "Ich glaube nicht, dass sie Overwatch 2 richtig verkacken würden, weil Overwatch 2 ist ja nicht Overwatch 2, Overwatch 2 ist Overwatch 1 mit ein bisschen Kampagne, also es ist eigentlich eher Season Pass Overwatch, es ist im Prinzip noch das gleiche, also sprich wenn ihr das alte Overwatch gefällt, dann gefällt ihr wahrscheinlich 2 auch."}, {"id": 373, "start": 2606.38, "end": 2628.18, "text": "Oh, so lange noch, so lange bis neues Battlefield, was soll ich denn dazwischen, geht ja gar nicht, was soll ich denn, ich kann jetzt 2 A kein Battlefield mehr spielen."}, {"id": 374, "start": 2636.38, "end": 2656.18, "text": "Moment. Okay, wenn der FIFA Director jetzt neuer Battlefield Chef wird, dann, dann, dann, ich weiß gar nicht, was ich da zu sagen soll."}, {"id": 375, "start": 2666.38, "end": 2676.18, "text": "Der hat keinen Bock mehr auf den Scheiß."}, {"id": 376, "start": 2676.18, "end": 2699.98, "text": "Ja, der hat keinen Bock mehr auf den Kram."}, {"id": 377, "start": 2706.18, "end": 2734.98, "text": "Ich hoffe, das stimmt ja, ich bin ja immer noch zuversichtlich, dass was dran ist, dass irgendwo da einer bei Anbet Company 3 arbeitet."}, {"id": 378, "start": 2736.18, "end": 2755.98, "text": "Okay, das Restliche von dem Video muss man sich mal angucken, mich hat das eigentlich nur mit Battlefield interessiert."}, {"id": 379, "start": 2755.98, "end": 2770.78, "text": "I bought, was, 2TB USB, I got more Malware, ah ne, da hab ich jetzt keinen Bock mehr, using Linux, aber wobei, komm wir gucken uns mal das Malware Video an, was haben wir sonst noch zu bieten."}, {"id": 380, "start": 2770.78, "end": 2792.58, "text": "Kennt jemand Tactical Ops, der Counter-Strike-Clone mit UT-Engine? Nö. Es gab mal ganz, ganz früher so nen Unreal Tournament CS-Mod, ist das das? Nee, oder? Das ist schon ural, schon 15, 20 Jahre alt oder so."}, {"id": 381, "start": 2792.58, "end": 2802.38, "text": "Ja, das ist auch das blöde Gefühl, was ich habe, selbst wenn sie in Bad Company 3 machen, dass es halt mit Bad Company nix mehr zu tun hat."}, {"id": 382, "start": 2802.38, "end": 2817.98, "text": "Moment, wie viel kostet das? Ist das Kanada, Kanadische Dollar oder so? C Dollar?"}, {"id": 383, "start": 2817.98, "end": 2836.98, "text": "Ich glaube das Video ist langweilig. Ich glaube das ist langweilig."}, {"id": 384, "start": 2836.98, "end": 2852.98, "text": "Ne, das glaube ich langweilig. Ok, was haben wir sonst noch für Videos zu bieten? Hat jemand irgendwas, was wir unbedingt im Stream gucken müssen?"}, {"id": 385, "start": 2852.98, "end": 2868.98, "text": "Was? Media Markt, WTF? Media Markt, Gaming, PC, Fehlkauf, Gaming, Schrott. Ok, das klingt eigentlich ganz gut."}, {"id": 386, "start": 2868.98, "end": 2888.98, "text": "Es ist eine Wonne, dass du wieder dabei bist, denn mir ist in letzter Zeit etwas, sagen wir mal, interessantes aufgefallen. Seit einigen Wochen, wenn nicht sogar schon seit Monaten, werden alle paar Tage Artikel veröffentlicht, wo es heißt, dass Media Markt und Saturn wieder neue Gutscheine herausgegeben haben."}, {"id": 387, "start": 2888.98, "end": 2908.98, "text": "Wir haben Gutscheine. Dieser Gaming PC hört auf den charmanten Namen Captiva Gaming R48645. Warum? Keine Ahnung."}, {"id": 388, "start": 2908.98, "end": 2937.98, "text": "Zuerst wollte ich den Rechner tatsächlich kaufen und testen, aber ich habe da eine bessere Idee. Wieso bauen wir den PC nicht einfach nach in besser? Der Rechner kostet 619 Euro, die eSports für richtige Tastatur und alles haben wahrscheinlich einen Wert von 120 Euro. Deswegen würde der Rechner an sich wahrscheinlich für glatte 600 Euro weggehen. Dafür bekommen wir einen AMD A8 9600 Prozessor."}, {"id": 389, "start": 2937.98, "end": 2943.98, "text": "Was sind das? Das ist eine APU, oder? So was ziemlich Altes schon."}, {"id": 390, "start": 2943.98, "end": 2956.98, "text": "Wahrscheinlich Platz 1 der Top 10 irrelevantesten CPUs. Ich meine, das ist ein 50 Euro Prozessor. Schreibt mal in die Kommentare, ob ihr überhaupt wusstet, dass diese CPU überhaupt existiert."}, {"id": 391, "start": 2956.98, "end": 2979.98, "text": "Keine Ahnung. Das ist so ein Ding abkömmlich von dem, was in der aktuellen PS4 drin ist, oder?"}, {"id": 392, "start": 2979.98, "end": 2988.98, "text": "Dann muss ich halt so los, aber auch die Grafikkarte finde ich durchaus beeindruckend auf eine merkwürdige Art und Weise."}, {"id": 393, "start": 2988.98, "end": 3014.98, "text": "Das ist eine GTX 1050 Ti. Stellt sich natürlich die Frage, wie kommt man eigentlich überhaupt noch im Jahr 2020 an eine so alte Grafikkarte ran? Die Karte ist bald 4 Jahre alt und war im Jahr 2016 und darauf eine wirklich tolle Grafikkarte, aber doch nicht mehr 2020. Der Rest ansonsten ist langweiliger Standard. 120 GB SSD, 1 TB HDD, A320 Mainboard."}, {"id": 394, "start": 3014.98, "end": 3029.98, "text": "Man bekommt noch einen Terabyte Platten. Im Vergleich dazu habe ich diesen Rechner hier gebaut. Es gibt so ein paar feine Unterschiede, die muss man nicht machen. Ich habe mich zum Beispiel für eine 512 GB große SSD entschieden."}, {"id": 395, "start": 3029.98, "end": 3049.98, "text": "Jetzt müssen wir uns das Video auch nicht weiter angucken, weil wir wissen ja schon, was Sache ist. Wir wissen, dass das ein MediaBug PC ist, der ziemlich crap ist."}, {"id": 396, "start": 3049.98, "end": 3065.98, "text": "Ich kriege in der oberen rechten Ecke, das ist mir jetzt schon öfters aufgefallen, immer in der oberen rechten Ecke, aber in der oberen rechten Ecke kriege ich immer Essen angezeigt."}, {"id": 397, "start": 3065.98, "end": 3084.98, "text": "Also wenn ich Essen angezeigt kriege, dann meistens in der oberen rechten Ecke. Und ich weiß nicht warum."}, {"id": 398, "start": 3084.98, "end": 3099.98, "text": "Was haben wir als nächstes? Using Linux at Work, Applications I use. Da bin ich mal gespannt. Ich habe ja auch so ein paar Sachen. Ich arbeite auch nur mit Linux auf der Arbeit, außer mit meiner Windows VM, die ich brauche, weil wir Outlook verwenden und Skype for Business und so."}, {"id": 399, "start": 3099.98, "end": 3112.98, "text": "Wer schon mal in den Genuss gekommen ist von Skype for Business, wird wissen, wie toll Skype for Business ist. Aber mal gucken, was er uns hier vorschlägt."}, {"id": 400, "start": 3112.98, "end": 3138.98, "text": "Hallo Nick. Ist das Gimp? Gimp ist abartig."}, {"id": 401, "start": 3138.98, "end": 3153.98, "text": "Gut. Er verwendet zumindest schon mal eines, der haben wir ja auch schon ausprobiert, der in Anführung steht Noob Linux Distribution, die wir im Stream zumindest für ganz brauchbar gefunden haben."}, {"id": 402, "start": 3153.98, "end": 3167.98, "text": "Also wir hatten ja zwei Sachen. Also bisher muss ich sagen, Elementary war glaube ich ganz gut und Deep in Linux fand ich glaube auch ganz gut, wenn ich das noch so richtig in Erinnerung habe. Der Rest war eher so naja."}, {"id": 403, "start": 3167.98, "end": 3188.98, "text": "Also das Slack."}, {"id": 404, "start": 3188.98, "end": 3207.98, "text": "Weißt du was ich mich frage? Viele machen es ja mittlerweile so, dass die den Kram sogar hosten lassen irgendwo. Und wenn man, wahrgenommen man ist eine Firma und man sagt man braucht eine Chat Lösung und man hostet die irgendwo bei irgendeinem Anbieter oder in irgendeiner Cloud oder sonst was, warum nimmt man da nicht gleich Discord?"}, {"id": 405, "start": 3207.98, "end": 3223.98, "text": "Ich weiß, Discord ist halt nicht so Business Style, weil für Gamer und sowas. Aber du hast die gleichen Nachteile, du weißt nicht wer dein Kram mitliest im Endeffekt. Aber dafür funktioniert Discord ordentlich."}, {"id": 406, "start": 3223.98, "end": 3247.98, "text": "Meinst du sowas ist wie das Code in der Cloud? Hä? Was meinste?"}, {"id": 407, "start": 3247.98, "end": 3261.98, "text": "GitLab ist tatsächlich ziemlich gut. Wir wurden ja zwangsumgestellt auf Bitbucket auf der Arbeit. Also ich hatte lange Zeit habe ich selbst eine GitLab Instanz laufen gehabt bei mir. Also für die Leute auf der Arbeit."}, {"id": 408, "start": 3261.98, "end": 3272.98, "text": "Also bei mir meine ich nicht bei mir daheim oder so, sondern halt auf einer Kiste bei uns auf der Arbeit, wo ich mich darum gekümmert habe, weil ich gesagt habe GitLab ist von allen Sachen irgendwie finde ich das angenehmste."}, {"id": 409, "start": 3272.98, "end": 3289.98, "text": "Zumindest auch zur damaligen Zeit und wir mussten wir mussten Bitbucket verwenden, weil konnte mir keiner so genau erklären, aber wir mussten wir mussten Bitbucket verwenden."}, {"id": 410, "start": 3289.98, "end": 3310.98, "text": "Gitea habe ich daheim, ja das ist gut. Open Office. Office. Geh weg. Teufel weiche. Office."}, {"id": 411, "start": 3310.98, "end": 3329.98, "text": "Open Office."}, {"id": 412, "start": 3329.98, "end": 3343.98, "text": "Ja tschüss mein Name, ich kann es aber einfach nur gerade installieren. Was ist das? Was ist das?"}, {"id": 413, "start": 3343.98, "end": 3360.98, "text": "Ah Gimp. Glimps. Was ist der Unterschied zwischen Gimp und Glimps? Glimps."}, {"id": 414, "start": 3360.98, "end": 3374.98, "text": "Ein Gimp-Fork. Ich hätte nicht gedacht, dass sich das irgendjemand freiwillig antut Gimp zu forken. Es gibt Sachen, man lernt nie aus."}, {"id": 415, "start": 3374.98, "end": 3386.98, "text": "Die haben sich wegen den Namen gestritten, okay. Ja das Icon ist nicer, da kann man sich jetzt drüber streiten, ob das ein guter Grund ist."}, {"id": 416, "start": 3386.98, "end": 3398.98, "text": "Und der Name? Gimp. Meine Güte, man kann sich doch über alles aufregen. Ich weiß, früher war Gimp in Online-Games eine Beleidigung."}, {"id": 417, "start": 3398.98, "end": 3421.98, "text": "Gimp vergimpter Speck oder irgendwas. Aber trotzdem, dass das 2020 jetzt irgendwie, dass man das wegen forkt."}, {"id": 418, "start": 3421.98, "end": 3436.98, "text": "Juck mich überhaupt nicht. Ja das kann er ja machen. Ich hoffe, dass SYNK das da aber nicht seine Arbeitssachen hätten."}, {"id": 419, "start": 3436.98, "end": 3457.98, "text": "Ah ja doch. Yolo. Scheiß drauf. Ich weiß halt nicht, wer was, aber egal. Einfach mal gesynkt in irgendeine Cloud. Ja, guter Mann. Firefox. Huge."}, {"id": 420, "start": 3457.98, "end": 3482.98, "text": "Warum? Hier, Serious Max, genau das habe ich mich auch gerade gefragt. Warum hat er auf seinem Arbeitsrechner Steam drauf?"}, {"id": 421, "start": 3482.98, "end": 3496.98, "text": "Genau das habe ich mich auch gerade gefragt. Was macht er mit Steam? Dash habe ich auch nie was von gehört. Es bestimmt irgendeinen Cloud."}, {"id": 422, "start": 3496.98, "end": 3503.98, "text": "Es garantiert irgendeinen Cloud Password Manager und ich würde ihm leben nicht. Warum? Warum kommen Leute auf die Idee, Cloud Password Manager zu verwenden?"}, {"id": 423, "start": 3503.98, "end": 3520.98, "text": "Wenn man sie selbst taustet, ok, verstehe ich noch. Aber warum Cloud Password Manager?"}, {"id": 424, "start": 3520.98, "end": 3537.98, "text": "Komfort? Ja klar, mir ist schon klar warum. Aber was reitet einen? Ich meine, so viel Komfort kann es doch eigentlich gar nicht geben, dass ich irgendeinem Cloud Dienstleister Zugang zu meinem Leben überlasse."}, {"id": 425, "start": 3537.98, "end": 3548.98, "text": "Das werde ich nie verstehen. Das werde ich nie verstehen. Wie kann man einen Cloud Password Manager verwenden und sich danach wirklich beschweren, dass uns irgendwelche Accounts nicht mehr..."}, {"id": 426, "start": 3548.98, "end": 3561.98, "text": "Nein, verstehe ich nicht. Wallpaper Engine gibt es nicht für Linux. Nicht, dass mir bewusst wäre. Das will ich gar nicht."}, {"id": 427, "start": 3561.98, "end": 3569.98, "text": "Ich habe das bei mir auch, teilweise habe ich Sachen im Chrome hinterlegt zum automatisch ausfüllen, aber zum größten Teil will ich gar nicht, dass es automatisch ausgefüllt wird,"}, {"id": 428, "start": 3569.98, "end": 3578.98, "text": "weil die ganzen automatisch ausfüllten Dinge oftmals ein bisschen doof sind, in welche Felder sie was eintragen und ich habe schon erlebt,"}, {"id": 429, "start": 3578.98, "end": 3588.98, "text": "dass zumindest das Chrome automatisch ausfüllt Dinge, manchmal private Informationen automatisch ausfüllt in Feldern, die gar nicht diese Informationen enthalten sollen."}, {"id": 430, "start": 3588.98, "end": 3603.98, "text": "Ich habe mir gedacht, aber ne, bin ich nicht."}, {"id": 431, "start": 3603.98, "end": 3630.98, "text": "Okay, es ist... Okay, irgendwie verwendet er nichts, was mir gefällt."}, {"id": 432, "start": 3630.98, "end": 3659.98, "text": "Ich verwende KeyPass, ja. Und für KeyPass gibt es Plugins, die das machen können, was du schreibst, der Dekan,"}, {"id": 433, "start": 3659.98, "end": 3669.98, "text": "aber ich mache die gute alte Copy-Paste-Taktik. Der nutzt die Sachen, because it looks nice, ja. Er ist halt auch Product-Owner."}, {"id": 434, "start": 3669.98, "end": 3674.98, "text": "Ja, da von Technik kein Schimmer. Wobei das nicht unbedingt, dass ich das eine und das andere ausschließe, ne."}, {"id": 435, "start": 3674.98, "end": 3685.98, "text": "Warum schwankt eigentlich meine Viewerzahl gerade so extrem von 190 zu 230 hin und her? Was ist da... Warum? Was ist mit Twitch gerade los?"}, {"id": 436, "start": 3685.98, "end": 3694.98, "text": "Was hältst du von LastPass? Ich halte prinzipiell von allen Cloud-basierten Passwort-Managern, die man selbst haust, in nichts."}, {"id": 437, "start": 3694.98, "end": 3701.98, "text": "Ich weiß, dass LastPass ziemlich beliebt ist und wahrscheinlich auch nicht die schlechteste Variante ist,"}, {"id": 438, "start": 3701.98, "end": 3715.98, "text": "aber ich verwende aus Prinzip nichts, wo ich... Passwörter, ich meine, man darf nicht vergessen, Passwörter sind so die Grundlage für alles, was man online hat, ja."}, {"id": 439, "start": 3715.98, "end": 3723.98, "text": "Für alles. Und jeder Account hat irgendwie eine Kombination aus Username und Passwort. Vielleicht hat man Glück an 2x Cloud-Anifizierung,"}, {"id": 440, "start": 3723.98, "end": 3732.98, "text": "aber trotzdem, warum sollte ich diese Login-Geschichten einem Cloud-Dienstleister anvertrauen?"}, {"id": 441, "start": 3732.98, "end": 3742.98, "text": "Viele Cloud-Dienstleister sagen, sie haben selbst keine Möglichkeit, das Passwort zu sehen, weil es kleinzeit verschlüsselt wird, aber ganz ehrlich,"}, {"id": 442, "start": 3742.98, "end": 3751.98, "text": "ich sage Leute, rechts oben Essen. Immer rechts oben ist Essen. Immer. Aber ich habe keine Ahnung, ob das stimmt, was die sagen."}, {"id": 443, "start": 3751.98, "end": 3759.98, "text": "Und vor allem bei Mobile-Clients, also sprich, wenn man jetzt von iOS oder Android, Windows-V lassen wir mal aus und vor,"}, {"id": 444, "start": 3759.98, "end": 3765.98, "text": "Passwort-Managern schon ausgeht, dann kann es auch durchaus sein, dass die App wunderbar toll funktioniert,"}, {"id": 445, "start": 3765.98, "end": 3772.98, "text": "der Hersteller irgendwie verkauft wird und ich ein Update kriege, was dann auf einmal doch meine Passwörter überträgt. Das ist theoretisch überhaupt kein Problem."}, {"id": 446, "start": 3772.98, "end": 3781.98, "text": "Und ich weiß nicht, also ich bin nach wie vor, ich bin bei KeyPass hängen geblieben."}, {"id": 447, "start": 3781.98, "end": 3787.98, "text": "Na gut, wir haben hier, ich habe hier natürlich keine Passwort-Datenbank auf dem Account gerade."}, {"id": 448, "start": 3787.98, "end": 3795.98, "text": "Sowas wie Bitwarn selbst gehostet ist auch okay, wenn man was ist, was man online haben will und die ein bisschen polischtere App haben möchte,"}, {"id": 449, "start": 3795.98, "end": 3801.98, "text": "aber ich fahre mit KeyPass echt ganz gut."}, {"id": 450, "start": 3801.98, "end": 3815.98, "text": "Würdest du deine KeyPass-Datei zum Beispiel zu Google Drive hochladen? Nö."}, {"id": 451, "start": 3815.98, "end": 3822.98, "text": "Nö, würde ich nicht. Bitwarn hat einen Security-Audit bekommen. Ja, hier nPass und die anderen, die haben auch alle Security-Audits bekommen,"}, {"id": 452, "start": 3822.98, "end": 3832.98, "text": "aber warum sollte ich, prinzipiell ist es doch ganz einfach. Wenn mein Passwort quasi meinen Hoheitsbereich nicht verlässt,"}, {"id": 453, "start": 3832.98, "end": 3839.98, "text": "dann habe ich ganz viele Angriffsszenarien schon mal, die sind gar nicht möglich. Die gehen halt einfach nicht."}, {"id": 454, "start": 3839.98, "end": 3853.98, "text": "Und selbst wenn ich, sagen wir, ich lade meinen KeyPass auf Google Drive hoch und ich weiß, okay, KeyPass ist sicher, hat keine Probleme, ich kann das ohne Probleme bei Google Drive hochladen,"}, {"id": 455, "start": 3853.98, "end": 3864.98, "text": "dann könnte ich das machen, aber wer sagt mir denn, dass in 30 Jahren, vielleicht jetzt übertrieben, in 10 Jahren, der Kram immer noch sicher ist?"}, {"id": 456, "start": 3864.98, "end": 3867.98, "text": "Vielleicht wurden ja irgendwelche Schwachstellen in der Zwischenzeit erkannt."}, {"id": 457, "start": 3867.98, "end": 3872.98, "text": "Also am besten ist, einfach den ganzen Kram erst gar nicht in die Cloud laden."}, {"id": 458, "start": 3872.98, "end": 3881.98, "text": "Einfach gar nicht, einfach gar nicht in die Cloud laden. Wie benutzt du KeyPass auf dem iPhone? Gar nicht."}, {"id": 459, "start": 3881.98, "end": 3889.98, "text": "Gar nicht. Also es gibt die Möglichkeit, das zu sünden, beispielsweise über den Next Cloud oder irgendwie SYNCthing oder C-File, irgendwas."}, {"id": 460, "start": 3889.98, "end": 3896.98, "text": "Kann man machen. Aber ich wende das gar nicht. Ich bin eh mit den wenigsten Sachen eingeloggt auf meinem iPhone."}, {"id": 461, "start": 3896.98, "end": 3901.98, "text": "Das Einzige, wo ich eingeloggt bin, ist Twitch. Und das muss man sich eh einmal in der App einloggen."}, {"id": 462, "start": 3901.98, "end": 3910.98, "text": "Also sprich, das bringt über. Was ist mit Twitch los? Die Zuschauerzahlen schwanken von 180 zu 234. What?"}, {"id": 463, "start": 3910.98, "end": 3918.98, "text": "Was, was, was, was, was war Twitch wieder kaputt? Leute, PTF."}, {"id": 464, "start": 3918.98, "end": 3923.98, "text": "Kennst du zufällig Passwortmanager, die ähnlich convenient sind wie LastPass, die man selbst ausgelt?"}, {"id": 465, "start": 3923.98, "end": 3934.98, "text": "Ja, angeblich ist Bitwarden RS selbst hosted gar nicht schlecht. Weiß ich aber auch nur vom Hörensagen."}, {"id": 466, "start": 3934.98, "end": 3940.98, "text": "Weil ich es selbst noch nie verwendet hab. Keine Ahnung."}, {"id": 467, "start": 3940.98, "end": 3949.98, "text": "Aber ein Projekt hat nicht umsonst 2,8K Sterne auf GitHub. Also gar so scheiße kann das nicht sein."}, {"id": 468, "start": 3949.98, "end": 3961.98, "text": "Scheint ganz okay zu sein."}, {"id": 469, "start": 3961.98, "end": 3966.98, "text": "KeyPass Nextcloud ist auch mal klar. Du kannst ohne Probleme deinen KeyPass sinken."}, {"id": 470, "start": 3966.98, "end": 3970.98, "text": "Hab ich ja gerade gesagt, gibt's ja verschiedene Varianten, wie du das machen kannst."}, {"id": 471, "start": 3970.98, "end": 3976.98, "text": "Muss ich halt wirklich, man muss sich halt überlegen, braucht man echt seinen kompletten Passwort Safe Mobile?"}, {"id": 472, "start": 3976.98, "end": 3982.98, "text": "Weil unterm Strich, was verwendet man denn Mobile? Du verwendest vielleicht einen Messenger."}, {"id": 473, "start": 3982.98, "end": 3988.98, "text": "Die haben alle eine eigene App, in der du dich einmalig authentifizieren musst und dann geht's halt."}, {"id": 474, "start": 3988.98, "end": 3993.98, "text": "Twitch, YouTube, da meldest du dich auch einmal an und dann nie wieder."}, {"id": 475, "start": 3993.98, "end": 4000.98, "text": "Was sind denn eure Anwendungszwecke für Passwortmanager auf Mobile? Ich hab keinen."}, {"id": 476, "start": 4000.98, "end": 4004.98, "text": "Wenn ich einen hätte, dann würde ich mir vielleicht überlegen, aber ich hab aktuell keinen."}, {"id": 477, "start": 4004.98, "end": 4010.98, "text": "Einkaufen am Handy im Browser, da hab ich die Amazon App und bei der Amazon App bin ich eingeloggt und es funktioniert."}, {"id": 478, "start": 4010.98, "end": 4017.98, "text": "Und dazu kommt, dass das Amazon Passwort tatsächlich eins ist, was ich mir merken kann."}, {"id": 479, "start": 4017.98, "end": 4027.98, "text": "Wenn man woanders ist und sich allen noch ein bisschen am Fremden rechnet. Okay, ja, verstehe ich, mache ich nicht, aber verstehe ich."}, {"id": 480, "start": 4027.98, "end": 4036.98, "text": "Extra Safe fürs Handy, wo weniger drin ist, das ist auch eine gute Idee, ja."}, {"id": 481, "start": 4036.98, "end": 4054.98, "text": "Dann muss es 1, 2, 3, 4, 5, 6 sein. Scheiße, Passwort Leak."}, {"id": 482, "start": 4054.98, "end": 4059.98, "text": "Okay, also ich sehe, es gibt tatsächlich Anwendungszwecke dafür, ja, okay. Ja, leuchtet ein."}, {"id": 483, "start": 4059.98, "end": 4071.98, "text": "Wie gesagt, hat mich jetzt nur interessiert, weil ich halt irgendwie keinen Anwendungszweck dafür hab."}, {"id": 484, "start": 4071.98, "end": 4075.98, "text": "Okay, also die Programme, die er hier verwendet, sind echt nicht so mal ein Fall."}, {"id": 485, "start": 4075.98, "end": 4083.98, "text": "Was haben wir sonst noch so zu bieten? 5 Linux-Distros in 2020, ja, da bin ich ja gespannt, was er da vorschlägt."}, {"id": 486, "start": 4083.98, "end": 4087.98, "text": "Wir haben ja schon viele Linux-Distros hier im Stream ausprobiert."}, {"id": 487, "start": 4087.98, "end": 4097.98, "text": "Uns wirklich gefallen hat mir, glaube ich, nur Elementary OS, also als Noob Desktop-Distro, nur Elementary OS und letztens Deepin, China Linux."}, {"id": 488, "start": 4097.98, "end": 4103.98, "text": "Am besten finde ich ja natürlich immer noch meinen Manjaro mit i3."}, {"id": 489, "start": 4103.98, "end": 4107.98, "text": "Was nutzt du für eine Lösung für Kontakt und Kalender? Nutzt du Google Kalender?"}, {"id": 490, "start": 4107.98, "end": 4112.98, "text": "Nee, dafür verwende ich tatsächlich die CalDAV-Geschichten aus Nextcloud."}, {"id": 491, "start": 4112.98, "end": 4118.98, "text": "Es ist nicht der Weisheitsletzter Schluss, aber es funktioniert ganz gut."}, {"id": 492, "start": 4118.98, "end": 4124.98, "text": "Zumal es direkt eins zu eins ohne Zusatzsoftware in iOS gut funktioniert."}, {"id": 493, "start": 4124.98, "end": 4129.98, "text": "Und unter Android gibt es einen CalDAV-Sync, der ist auch ganz gut."}, {"id": 494, "start": 4129.98, "end": 4134.98, "text": "Leider gibt es für Windows Nix Gescheites."}, {"id": 495, "start": 4134.98, "end": 4147.98, "text": "CubeOS haben wir uns ja nicht angeguckt, nee."}, {"id": 496, "start": 4147.98, "end": 4152.98, "text": "Ja, Ubiqui, diese Sachen finde ich auch, es ist eine coole Geschichte."}, {"id": 497, "start": 4152.98, "end": 4158.98, "text": "Hast du lokale Nextcloud? Ich habe die nur lokal."}, {"id": 498, "start": 4158.98, "end": 4164.98, "text": "Meine Nextcloud ist nicht online erreichbar. Ich mache das einfach so, wenn ich etwas zu Synken habe,"}, {"id": 499, "start": 4164.98, "end": 4168.98, "text": "was jetzt nicht so wahnsinnig viel ist, da Synke ich das halt, wenn ich daheim im WLAN bin."}, {"id": 500, "start": 4168.98, "end": 4173.98, "text": "Ich habe ganz selten mal bisher das Bedürfnis gehabt, dass ich unterwegs gesagt habe,"}, {"id": 501, "start": 4173.98, "end": 4178.98, "text": "ach Mist, könnte ich jetzt mal auf meine Nextcloud zugreifen."}, {"id": 502, "start": 4178.98, "end": 4184.98, "text": "Die ganzen Geräte, die man heute hat, die haben genug Speicher, dass man einen Tag überlebt ohne Probleme"}, {"id": 503, "start": 4184.98, "end": 4189.98, "text": "und es wenn man daheim im WLAN ist Synken kann."}, {"id": 504, "start": 4189.98, "end": 4193.98, "text": "Es gibt im Prinzip, du machst eine Handvoll Photos vielleicht, ja."}, {"id": 505, "start": 4193.98, "end": 4197.98, "text": "Ich habe schon öfters mal ein paar kleine Audiosachen aufgenommen mit dem Handy."}, {"id": 506, "start": 4197.98, "end": 4202.98, "text": "Aber ansonsten gibt es nicht viel, was ich Synken muss. Notizen, ja."}, {"id": 507, "start": 4202.98, "end": 4206.98, "text": "Wie syncst du dann Kalenderkontakte mobil über CalDAV? Das ist überhaupt kein Ding."}, {"id": 508, "start": 4206.98, "end": 4211.98, "text": "Oder iOS kannst du direkt hinzufügen."}, {"id": 509, "start": 4211.98, "end": 4215.98, "text": "Wobei ich ehrlich gesagt gar nicht weiß, ob das unter iOS 13 noch so gut funktioniert."}, {"id": 510, "start": 4215.98, "end": 4221.98, "text": "Da gab es nämlich mal irgendwelche Probleme, habe ich letztens gelesen."}, {"id": 511, "start": 4221.98, "end": 4227.98, "text": "Aber du kannst es ohne Probleme hier, die CalDAV-Geschichte von Nextcloud synken."}, {"id": 512, "start": 4227.98, "end": 4233.98, "text": "Für Android gibt es hier CalDAV Sync, Android gibt es ein gutes Plugin."}, {"id": 513, "start": 4233.98, "end": 4238.98, "text": "Das da, ich weiß nicht, ist es das da? Das da ist es glaube ich."}, {"id": 514, "start": 4238.98, "end": 4243.98, "text": "Ich glaube das da."}, {"id": 515, "start": 4243.98, "end": 4248.98, "text": "Ist ganz okay, wobei es zig andere Varianten gibt und Apps, die es direkt können."}, {"id": 516, "start": 4248.98, "end": 4253.98, "text": "Und du kannst unter iOS direkt einbinden."}, {"id": 517, "start": 4253.98, "end": 4258.98, "text": "Unter iOS ist es standardmäßig ein bisschen besser integriert, weil du hast Kontakte,"}, {"id": 518, "start": 4258.98, "end": 4263.98, "text": "Kalender und die To Do App unterstützen das alles."}, {"id": 519, "start": 4263.98, "end": 4268.98, "text": "Das ist eigentlich ganz praktisch."}, {"id": 520, "start": 4268.98, "end": 4273.98, "text": "Leider das größte Problem ist, dass es auf dem Desktop kaum gescheite Anwendungen gibt."}, {"id": 521, "start": 4273.98, "end": 4282.98, "text": "So bescheuer das jetzt klingen mag, aber eine ordentliche PIM-Lösung mit CalDAV-Integration gibt es nicht so viele."}, {"id": 522, "start": 4282.98, "end": 4287.98, "text": "Am besten sind die tatsächlich unter Mac OS, die es gibt."}, {"id": 523, "start": 4287.98, "end": 4292.98, "text": "Da ist das relativ verbreitet. Aber für Windows und Linux gibt es sehr wenig."}, {"id": 524, "start": 4292.98, "end": 4301.98, "text": "Thunderbird kann es ein bisschen, aber die Bedienung von Thunderbird ist zum größten Teil eine absolute Zumutung."}, {"id": 525, "start": 4301.98, "end": 4306.98, "text": "Windows kann es standardmäßig nicht. Was ja auch übrigens total lächerlich ist,"}, {"id": 526, "start": 4306.98, "end": 4312.98, "text": "dass Windows standardmäßig keine To Do App dabei hat."}, {"id": 527, "start": 4312.98, "end": 4318.98, "text": "Und die einzige To Do App, die es für Windows offiziell gibt, nur mit irgendeinem komischen Outlook Konto oder was das ist,"}, {"id": 528, "start": 4318.98, "end": 4324.98, "text": "funktioniert, was dann auch total hängen geblieben ist."}, {"id": 529, "start": 4324.98, "end": 4329.98, "text": "Unter Mac hat man da tatsächlich die beste Auswahl, aber es gibt eins, zwei, die ganz gut sind."}, {"id": 530, "start": 4329.98, "end": 4333.98, "text": "Ansonsten muss man Thunderbird verwenden für Kontakte und Kalender."}, {"id": 531, "start": 4333.98, "end": 4337.98, "text": "Es gibt schlimmeres, aber sonderlich schön ist Thunderbird auch nicht."}, {"id": 532, "start": 4337.98, "end": 4344.98, "text": "Was ich eine Weile unter Windows verwendet habe, ist das Ding, weil das noch mit die beste CalDAV-Integration für Windows hat."}, {"id": 533, "start": 4344.98, "end": 4350.98, "text": "Da steht zwar Mail, aber ich verwende das eigentlich nur dafür."}, {"id": 534, "start": 4350.98, "end": 4354.98, "text": "Die Integration hier ist ganz gut, aber es ging mir irgendwann auch auf den Sack."}, {"id": 535, "start": 4354.98, "end": 4360.98, "text": "Ich bin jetzt bei Thunderbird gelandet, weil Thunderbird ist halt Cross-Platform für Linux und Windows."}, {"id": 536, "start": 4360.98, "end": 4367.98, "text": "Das heißt, ich habe das einmal ordentlich eingerichtet und verwende jetzt halt mein Kalender- und Kontakte-Kram aus Thunderbird."}, {"id": 537, "start": 4367.98, "end": 4373.98, "text": "Was ich für Notizen verwende und kleine To Do's ist mittlerweile das da."}, {"id": 538, "start": 4373.98, "end": 4378.98, "text": "Das ist auch nicht der Weisheitsletzter Schluss so wirklich. Ich meine, das ist eine Elektronen-Anwendung."}, {"id": 539, "start": 4378.98, "end": 4385.98, "text": "Aber das ist ganz nice. Die haben viele Funktionen eingebaut, die sehr praktisch sind und die auch Cross-Platform funktionieren."}, {"id": 540, "start": 4385.98, "end": 4389.98, "text": "Also sprich, die Notifications funktionieren mittlerweile komplett Cross-Platform."}, {"id": 541, "start": 4389.98, "end": 4397.98, "text": "Man kriegt auch nicht einfach so 12.000 Sterne auf GitHub."}, {"id": 542, "start": 4397.98, "end": 4403.98, "text": "Das ist ganz nice. Ich kann euch das nochmal kurz zeigen auf meiner Linux-VM."}, {"id": 543, "start": 4403.98, "end": 4408.98, "text": "Ja, es ist eine Elektron, aber irgendwo gerechtfertigt in dem Fall, dass es Elektron ist."}, {"id": 544, "start": 4408.98, "end": 4412.98, "text": "Denn man darf nicht vergessen, die bieten eine App an wirklich für jede Plattform."}, {"id": 545, "start": 4412.98, "end": 4417.98, "text": "Die haben Apps für Windows, Mac OS, Linux, Android, iOS."}, {"id": 546, "start": 4417.98, "end": 4423.98, "text": "Also umfangreicher kann es nicht sein und da kann ich verstehen, dass man auf Elektron setzt."}, {"id": 547, "start": 4423.98, "end": 4428.98, "text": "Eben einfach aus dem Grund, dass der Mist überall ohne Probleme funktioniert."}, {"id": 548, "start": 4428.98, "end": 4431.98, "text": "So, ich kann es euch mal kurz zeigen. Ich glaube, ich habe es hier irgendwie..."}, {"id": 549, "start": 4431.98, "end": 4434.98, "text": "Ah nee, ich habe es gar nicht installiert. Dann installieren wir es jetzt einfach mal."}, {"id": 550, "start": 4434.98, "end": 4437.98, "text": "Das ist tatsächlich ganz nützlich."}, {"id": 551, "start": 4437.98, "end": 4440.98, "text": "Ja, ja, ja, ja."}, {"id": 552, "start": 4440.98, "end": 4443.98, "text": "Ah, yes, yes, yes."}, {"id": 553, "start": 4443.98, "end": 4445.98, "text": "Wir akzeptieren einfach mal alles."}, {"id": 554, "start": 4445.98, "end": 4450.98, "text": "Oh, ich glaube, das müssen wir zusätzlich installieren, sonst macht das nichts. Macht das nicht."}, {"id": 555, "start": 4450.98, "end": 4453.98, "text": "Ah nee, macht okay."}, {"id": 556, "start": 4453.98, "end": 4456.98, "text": "Windows kann doch auch... Nein, kann es nicht."}, {"id": 557, "start": 4456.98, "end": 4461.98, "text": "Das konnte... Windows 10 konnte das mal über Trick 17..."}, {"id": 558, "start": 4461.98, "end": 4465.98, "text": "Ähm, ähm, ähm, Kalender."}, {"id": 559, "start": 4465.98, "end": 4472.98, "text": "Man konnte mal über Trick 17 hier ein iCloud-Konto hinzufügen."}, {"id": 560, "start": 4472.98, "end": 4478.98, "text": "Und das konnte man umbiegen auf seinen eigenen CalDAF-Server, weil iCloud intern CalDAF verwendet."}, {"id": 561, "start": 4478.98, "end": 4483.98, "text": "Aber wirklich gut funktioniert es nicht."}, {"id": 562, "start": 4483.98, "end": 4488.98, "text": "Warum es nicht einfach eine Möglichkeit gibt, CalDAF zu adden, bei Windows verstehe ich nicht."}, {"id": 563, "start": 4488.98, "end": 4493.98, "text": "Das ist das einzige halbwegs standardisierte Protokoll, was es für Kalender und Kontakte überhaupt gibt."}, {"id": 564, "start": 4493.98, "end": 4503.98, "text": "Es ist eklig, es ist alt, es ist XML-basiert, aber ansonsten gibt es halt nichts großartig."}, {"id": 565, "start": 4503.98, "end": 4505.98, "text": "Ja, ich installiere das mal, da kann ich es euch gleich zeigen."}, {"id": 566, "start": 4505.98, "end": 4511.98, "text": "Aber das ist tatsächlich für Notizen finde ich aktuell das Beste, weil es gibt es für jede Plattform."}, {"id": 567, "start": 4511.98, "end": 4517.98, "text": "Und es hat plattformabhängige Implementierungen für Notifications und sowas."}, {"id": 568, "start": 4517.98, "end": 4521.98, "text": "Das ist ja praktisch, sprich, ich kann beispielsweise ein To-Do anlegen und hinschreiben,"}, {"id": 569, "start": 4521.98, "end": 4532.98, "text": "hey, ich hätte gerne Benachrichtigungen heute Abend um 15.30 Uhr, dass ich noch einkaufen gehen muss."}, {"id": 570, "start": 4532.98, "end": 4541.98, "text": "Und dann kann ich das beispielsweise auf meinem Lidungsrechner, auf der Arbeit, kann ich das To-Do anlegen."}, {"id": 571, "start": 4541.98, "end": 4548.98, "text": "Ich sinke das Ganze und wenn ich im Zug sitze, 15.30 Uhr, kriege ich dann dort eine Notification, dass ich noch einkaufen muss."}, {"id": 572, "start": 4548.98, "end": 4553.98, "text": "Das ist cool, das funktioniert mit anderen Lösungen so problemlos cross-Plattform nicht."}, {"id": 573, "start": 4553.98, "end": 4561.98, "text": "Deswegen verzeihe ich es der Geschichte auch, dass sie elektronbasiert ist und halt unnütz viel Arbeitsspeicher frisst."}, {"id": 574, "start": 4561.98, "end": 4571.98, "text": "Wenn man da weniger Bedenken hat und auf Cloud-Lösungen setzen möchte, die extern laufen, dann ist es kein Ding."}, {"id": 575, "start": 4571.98, "end": 4579.98, "text": "Also sprich, wenn man sagt, hey, ich verwende Google-Kalender oder ich verwende irgendwas, was bei Office dabei ist oder sonst was."}, {"id": 576, "start": 4579.98, "end": 4585.98, "text": "Wenn man das machen will, ist überhaupt kein Problem, dann geht das einfacher."}, {"id": 577, "start": 4585.98, "end": 4591.98, "text": "Aber ich lege halt Wert darauf, dass der Kram, den ich da reinschreibe, nicht in der Cloud landet, sondern bei mir bleibt."}, {"id": 578, "start": 4591.98, "end": 4594.98, "text": "Gesynkt wird das über Nextcloud."}, {"id": 579, "start": 4594.98, "end": 4603.98, "text": "Aber ich wollte mal in nächster Zeit mal Dings probieren, Syncthing."}, {"id": 580, "start": 4603.98, "end": 4610.98, "text": "Und das da, das haben die einfach nur hingeschrieben, weil es sich gut liest."}, {"id": 581, "start": 4610.98, "end": 4618.98, "text": "Letztendlich ist das Plain Text, das sind Textdateien, die kann man syncen mit allem, was man will."}, {"id": 582, "start": 4618.98, "end": 4622.98, "text": "Es ist vollkommen egal, es muss nicht Nextcloud oder Dropbox sein, es kann alles sein."}, {"id": 583, "start": 4622.98, "end": 4626.98, "text": "Es kann alles sein, was Text, es kann auch C-File sein, es kann alles sein, was Textdateien syncen."}, {"id": 584, "start": 4626.98, "end": 4632.98, "text": "Ach ja, und der Webklipper ist auch sehr cool. Der Webklipper ist übrigens sehr praktisch."}, {"id": 585, "start": 4632.98, "end": 4640.98, "text": "Und dann noch ein weiteres Tool, was ich verwende für Browser."}, {"id": 586, "start": 4640.98, "end": 4644.98, "text": "Nein, nein, ich nicht Fokus, Flocus heißt das."}, {"id": 587, "start": 4644.98, "end": 4651.98, "text": "Für Bookmarksync, allerdings nur für spezielle Ordner, ist das hier, wie gesagt, auch so viel Schere gibt man nicht ohne weiteres."}, {"id": 588, "start": 4651.98, "end": 4656.98, "text": "Das ist ein Browser-Plugin, da kann man für Nextcloud seine Bookmarks syncen."}, {"id": 589, "start": 4656.98, "end": 4660.98, "text": "Und jetzt nicht, dass man ein extra Programm braucht, wo man dann seine Bookmarks drin verwaltet."}, {"id": 590, "start": 4660.98, "end": 4666.98, "text": "Nein, man kann ganz einfach die Standard Bookmark-Funktion in einem Browser verwenden und die dann syncen lassen."}, {"id": 591, "start": 4666.98, "end": 4676.98, "text": "Das ist sehr praktisch, auch ordnerbasiert. Das ist wirklich cool, das ist echt nützlich."}, {"id": 592, "start": 4676.98, "end": 4678.98, "text": "Ja, und das hier kann ich nur empfehlen. Mal gucken, ob der Kram jetzt installiert ist."}, {"id": 593, "start": 4678.98, "end": 4681.98, "text": "Nee, der ist immer noch am rumrödeln, was auch immer er da macht."}, {"id": 594, "start": 4681.98, "end": 4684.98, "text": "Also das kann ich euch als Notizprogramm echt nur empfehlen."}, {"id": 595, "start": 4684.98, "end": 4690.98, "text": "Was hältst du von der iOS-Intern-Kalender ab? Ich finde die ganz okay, also mir reicht sie, ich habe keine extra Kalender-App."}, {"id": 596, "start": 4690.98, "end": 4698.98, "text": "Ich habe mal vor einer Weile, habe ich als Kalender-App, was war das?"}, {"id": 597, "start": 4698.98, "end": 4709.98, "text": "Habe ich mal eine andere verwendet, dass ich besser meine Business, quasi in Anführung meine Business und privaten Kalender besser trennen kann?"}, {"id": 598, "start": 4709.98, "end": 4716.98, "text": "Was hatte ich denn da? Aber das verwende ich nicht mehr, das war aber auch ganz gut."}, {"id": 599, "start": 4716.98, "end": 4722.98, "text": "Das könnte das gewesen sein, aber ich glaube, das war was anderes."}, {"id": 600, "start": 4722.98, "end": 4741.98, "text": "Ja gut, der ist halt dabei. Nee, keine Ahnung, das finde ich nicht mehr."}, {"id": 601, "start": 4741.98, "end": 4748.98, "text": "Das andere war auch ganz okay, aber ich verwende die Standard-iOS-Studio-App. Was macht der denn hier?"}, {"id": 602, "start": 4748.98, "end": 4760.98, "text": "Die Standard-iOS-To-Do-App, die Standard-iOS-Kalender und die Standard-iOS-Kontakte."}, {"id": 603, "start": 4760.98, "end": 4767.98, "text": "Kennst du Windows für Two-Factor-Authentification? Nö, habe ich noch nicht verwendet."}, {"id": 604, "start": 4767.98, "end": 4774.98, "text": "Das sagt mir jetzt auch gar nichts."}, {"id": 605, "start": 4774.98, "end": 4789.98, "text": "Nutzt du eigentlich irgendeinen besonderen E-Mail-Anbieter? Nö, ich habe seit 25 Jahren oder so eine private E-Mail-Adresse bei GMX."}, {"id": 606, "start": 4789.98, "end": 4799.98, "text": "Und seit ich YouTube-Gedöns mache, habe ich insgesamt drei Google-Mail-Adressen und fertig, reicht."}, {"id": 607, "start": 4799.98, "end": 4807.98, "text": "Eine für Business-Gedöns, unabhängig vom Google-Account, dann die Google-Account und dann was zum Ausprobieren."}, {"id": 608, "start": 4807.98, "end": 4812.98, "text": "Und für Android-App-Store-Geschichten und so."}, {"id": 609, "start": 4812.98, "end": 4830.98, "text": "Ja gut, es gab 1995 noch nicht so viele Anbieter außer GMX in Deutschland. Oder Freenet gab es noch."}, {"id": 610, "start": 4830.98, "end": 4841.98, "text": "Und Web.de gab es dann auch noch irgendwann."}, {"id": 611, "start": 4841.98, "end": 4850.98, "text": "Die Online-E-Mail-Adresse hatte ich auch, weil die online halt beim Provider dabei war, habe ich aber nie verwendet."}, {"id": 612, "start": 4850.98, "end": 4859.98, "text": "Hey, was streamst du hier so? Also aktuell gucken wir uns eigentlich nur ein paar technisch-bezogene YouTube-Videos an, wie wir das jeden Sonntagmorgen machen."}, {"id": 613, "start": 4859.98, "end": 4865.98, "text": "Wobei was heißt nicht nur technisch-bezogene, alles was einem so unterkommt."}, {"id": 614, "start": 4865.98, "end": 4870.98, "text": "Zum, wie es im Titel steht, aufwachen."}, {"id": 615, "start": 4870.98, "end": 4873.98, "text": "Genau, ich wollte euch ja mal das Notizprogramm zeigen."}, {"id": 616, "start": 4873.98, "end": 4880.98, "text": "Also, das ist eigentlich ziemlich praktisch. Es unterstützt standardmäßig hier Plain-Text-Notes und kann Markdown-Rendern."}, {"id": 617, "start": 4880.98, "end": 4885.98, "text": "Das mache ich aber immer aus. Und das Beste für euch natürlich jetzt gleich am Anfang."}, {"id": 618, "start": 4885.98, "end": 4890.98, "text": "Das Ding hat ein, Moment, wo ist es? Das Ding hat ein Darkseam."}, {"id": 619, "start": 4890.98, "end": 4895.98, "text": "Das ist schon mal wichtig. Ohne Darkseam geht ja bekanntlicherweise nichts."}, {"id": 620, "start": 4895.98, "end": 4900.98, "text": "Hast du auch so eine tolle Unity-E-Mail-Adresse? Vielleicht, keine Ahnung, habe ich noch nie ausprobiert."}, {"id": 621, "start": 4900.98, "end": 4907.98, "text": "Was ist denn das für ein Application-Lauter? Das ist ROFI, nennt sich das Ding, oder ROFI."}, {"id": 622, "start": 4907.98, "end": 4912.98, "text": "Das da, ist das, das da."}, {"id": 623, "start": 4912.98, "end": 4916.98, "text": "So, und, das wollte ich euch jetzt zeigen, genau."}, {"id": 624, "start": 4916.98, "end": 4926.98, "text": "Man kann einstellen, dass man Synken will zu zum Beispiel Nextcloud. Oder, dass man Synken will, wenn man Filesystem einstellt, ist auch okay."}, {"id": 625, "start": 4926.98, "end": 4930.98, "text": "Dann kann man, dann Synkt das automatisch. Hier kann man halt Nextcloud direkt angeben."}, {"id": 626, "start": 4930.98, "end": 4933.98, "text": "Gibt man seine Nextcloud-Instance, dann kann man seine Notes Synken."}, {"id": 627, "start": 4933.98, "end": 4937.98, "text": "Und der Web-Klipper ist auch sehr nice."}, {"id": 628, "start": 4937.98, "end": 4943.98, "text": "Da kann man nämlich direkt quasi einen Snapshot von der Webseite darin speichern, in Notizen."}, {"id": 629, "start": 4943.98, "end": 4948.98, "text": "Und was ich halt sehr praktisch finde, ist, dass man hier sagen kann, zum Beispiel, New to do."}, {"id": 630, "start": 4948.98, "end": 4952.98, "text": "Und hier kann man direkt jetzt auswählen, wann das Ganze alarmieren soll."}, {"id": 631, "start": 4952.98, "end": 4960.98, "text": "Und wenn man das Synkt, haben sie das so gemacht, dass diese Alarm auf allen unterstützten Plattformen funktioniert."}, {"id": 632, "start": 4960.98, "end": 4963.98, "text": "Also sprich, wenn ich das jetzt Synken würde in meine Cloud."}, {"id": 633, "start": 4963.98, "end": 4968.98, "text": "Cloud ist jetzt bescheuert, wenn ich einfach Filesynk mache, ja, irgendwo hin."}, {"id": 634, "start": 4968.98, "end": 4970.98, "text": "Was auch immer ich für einen Anbieter verwende."}, {"id": 635, "start": 4970.98, "end": 4973.98, "text": "Und mein Smartphone Synkt sich auch."}, {"id": 636, "start": 4973.98, "end": 4978.98, "text": "Dann kriege ich dort quasi für die Plattform funktionierend Notification."}, {"id": 637, "start": 4978.98, "end": 4981.98, "text": "Das ist wirklich sehr praktisch."}, {"id": 638, "start": 4981.98, "end": 4985.98, "text": "Also das Ding hier kann ich empfehlen."}, {"id": 639, "start": 4985.98, "end": 4988.98, "text": "Ja, das ist die Anwendung, die ich gerade aufhab. Das Ding kann ich empfehlen."}, {"id": 640, "start": 4988.98, "end": 4999.98, "text": "Ein bisschen doof ist natürlich, aber mit irgendeinem Tod muss man sterben, dass der Kram halt..."}, {"id": 641, "start": 4999.98, "end": 5002.98, "text": "Dass der Kran halt ordentlich RAM braucht, ja."}, {"id": 642, "start": 5002.98, "end": 5007.98, "text": "Das Ding braucht halt irgendwie jetzt erstmal 400 MB RAM, weil es halt elektronenkacke ist."}, {"id": 643, "start": 5007.98, "end": 5009.98, "text": "Aber es ist halt nun mal so. Was willst du machen?"}, {"id": 644, "start": 5009.98, "end": 5015.98, "text": "Ach ja, was auch noch praktisch ist, dass man den so einstellen kann, dass er standardmäßig im Hintergrund läuft,"}, {"id": 645, "start": 5015.98, "end": 5017.98, "text": "anstatt dass er sich schließt."}, {"id": 646, "start": 5017.98, "end": 5019.98, "text": "Was natürlich für Notifications ganz praktisch ist, ja."}, {"id": 647, "start": 5019.98, "end": 5026.98, "text": "Und ich hab das bei mir privat auf dem anderen Account eigentlich immer auf und auch immer laufen."}, {"id": 648, "start": 5026.98, "end": 5030.98, "text": "Irgendwohin muss man ja mit seinen 16 GB RAM. Wobei, hab ich überhaupt 8 oder 16?"}, {"id": 649, "start": 5030.98, "end": 5032.98, "text": "Ich kann mir das immer nicht merken."}, {"id": 650, "start": 5032.98, "end": 5036.98, "text": "Ich hab, wie viel RAM? 16, okay."}, {"id": 651, "start": 5036.98, "end": 5045.98, "text": "Wenn man sich sein eigenes RAM schon nicht merkt, kann man nicht merken, wie viel RAM man hat."}, {"id": 652, "start": 5045.98, "end": 5047.98, "text": "Ach, deswegen kriege ich die..."}, {"id": 653, "start": 5047.98, "end": 5051.98, "text": "Deswegen schwankt die Viewerzahl so, weil ich gerade irgendwie auf Twitch vorgeschlagen wäre."}, {"id": 654, "start": 5051.98, "end": 5055.98, "text": "Kann das sein?"}, {"id": 655, "start": 5055.98, "end": 5058.98, "text": "Weil ich wundere mich die ganze Zeit schon."}, {"id": 656, "start": 5058.98, "end": 5068.98, "text": "Das schwankt normalerweise sonntags um die 200 und aktuell schwankt das so um 180 bis 250 voll random hin und her."}, {"id": 657, "start": 5068.98, "end": 5072.98, "text": "Und ich denke mir die ganze Zeit so, was ist mit Twitch los?"}, {"id": 658, "start": 5072.98, "end": 5074.98, "text": "Aber jetzt weiß ich es."}, {"id": 659, "start": 5074.98, "end": 5078.98, "text": "Huge Twitch Empfehlung."}, {"id": 660, "start": 5078.98, "end": 5080.98, "text": "So, was haben wir denn sonst noch zu bieten?"}, {"id": 661, "start": 5080.98, "end": 5084.98, "text": "Das Video haben wir irgendwann schon mal geguckt."}, {"id": 662, "start": 5084.98, "end": 5094.98, "text": "Ich glaube 5 Linux Distros to watch in 2020. Mal gucken, was der uns empfiehlt."}, {"id": 663, "start": 5094.98, "end": 5110.98, "text": "Oh, der hört sich aber Huge Residenz Sleeper an, oder?"}, {"id": 664, "start": 5110.98, "end": 5120.98, "text": "Nee, da schlafe ich wieder ein Bein und da wären wir nicht wach von. Definitiv wären wir da nicht wach von."}, {"id": 665, "start": 5120.98, "end": 5124.98, "text": "Instant Sleep."}, {"id": 666, "start": 5124.98, "end": 5126.98, "text": "Eigentlich jeden Sonntag bist du bei den Vorschlägen."}, {"id": 667, "start": 5126.98, "end": 5129.98, "text": "Oha, Poggers."}, {"id": 668, "start": 5129.98, "end": 5132.98, "text": "Das Warcraft 3 Video haben wir uns schon ans angeguckt."}, {"id": 669, "start": 5132.98, "end": 5135.98, "text": "Aus meinem Ryzen PC habe ich nicht bestellt."}, {"id": 670, "start": 5135.98, "end": 5140.98, "text": "Nextcloud Hub haben wir gestern ausprobiert im Stream."}, {"id": 671, "start": 5140.98, "end": 5144.98, "text": "Muss Diablo 4 bald Angst vor Pass of Exile 2 haben?"}, {"id": 672, "start": 5144.98, "end": 5150.98, "text": "Lustigerweise habe ich das ja vorhin schon mal kurz angesprochen. Ich denke eher, dass es umgedreht ist."}, {"id": 673, "start": 5150.98, "end": 5155.98, "text": "Ich glaube es ist komplett umgedreht."}, {"id": 674, "start": 5155.98, "end": 5163.98, "text": "Pass of Exile 2 muss keine Angst haben vor Diablo 4."}, {"id": 675, "start": 5163.98, "end": 5165.98, "text": "Also eher andersrum."}, {"id": 676, "start": 5165.98, "end": 5172.98, "text": "Wenn hier einer was zeigen muss, dann ist es Blizzard mit Diablo 4 und nicht mit Pass of Exile 2."}, {"id": 677, "start": 5172.98, "end": 5179.98, "text": "Pass of Exile hat die letzten 7 Jahre gezeigt, dass es der bessere Nachfolger ist."}, {"id": 678, "start": 5179.98, "end": 5183.98, "text": "Und es ist aktuell das einzige Spiel, was ich halbwegs spiele."}, {"id": 679, "start": 5183.98, "end": 5191.98, "text": "Muss Diablo 4 bald Angst vor Pass of Exile 2 haben?"}, {"id": 680, "start": 5191.98, "end": 5195.98, "text": "Ich sage es insofern eher andersrum."}, {"id": 681, "start": 5195.98, "end": 5200.98, "text": "Mit sehr viel Glück muss Pass of Exile Angst haben vor Diablo 4."}, {"id": 682, "start": 5200.98, "end": 5205.98, "text": "Beziehungsweise muss Pass of Exile eher keine Angst haben vor Diablo 4."}, {"id": 683, "start": 5205.98, "end": 5210.98, "text": "Der Titel sagt, ob Diablo 4 Angst haben muss vor Pass of Exile."}, {"id": 684, "start": 5210.98, "end": 5215.98, "text": "Was so viel heißt wie Diablo 4 ist quasi das, was angegriffen wird."}, {"id": 685, "start": 5215.98, "end": 5217.98, "text": "Dabei ist es umgedreht."}, {"id": 686, "start": 5217.98, "end": 5225.98, "text": "Wenn einer angreifen muss, dann ist es Blizzard mit Diablo und nicht Grinding Gear Games."}, {"id": 687, "start": 5225.98, "end": 5229.98, "text": "Ich komme in Pass of Exile nicht mehr weiter, das ist doof."}, {"id": 688, "start": 5229.98, "end": 5235.98, "text": "In Pass of Exile weiterkommen ist in der Regel einfach easy Grinding."}, {"id": 689, "start": 5235.98, "end": 5241.98, "text": "Einfach im Kreisel grind machen, bis du Zeug hast und dann ein bisschen trainen."}, {"id": 690, "start": 5241.98, "end": 5246.98, "text": "Aber ich bin in Pass of Exile auch nicht der große Pro, weil ich habe auch erst wieder angefangen."}, {"id": 691, "start": 5246.98, "end": 5251.98, "text": "Mal gucken, was die GameStar dazu sagt."}, {"id": 692, "start": 5251.98, "end": 5254.98, "text": "Du scheinst verwirrt, war das schon eh mal anders."}, {"id": 693, "start": 5254.98, "end": 5260.98, "text": "Ich habe vorhin auch gesagt, dass Twitter wie Reddit ist oder sowas in der Richtung."}, {"id": 694, "start": 5260.98, "end": 5265.98, "text": "Pass of Exile 2 gegen Diablo 4 wird das größte Hack-and-Slay-Duell seit Jahren."}, {"id": 695, "start": 5265.98, "end": 5268.98, "text": "Und ein verdammt interessantes."}, {"id": 696, "start": 5268.98, "end": 5275.98, "text": "Ich muss mir eine Sache revidieren, die ich schon mal erzählt habe in ein paar Streams."}, {"id": 697, "start": 5275.98, "end": 5279.98, "text": "Da habe ich gesagt, ich gucke die Videos von Maurice Weber nicht gerne."}, {"id": 698, "start": 5279.98, "end": 5289.98, "text": "Mittlerweile gucke ich von ihm und Dimitri am liebsten die Videos."}, {"id": 699, "start": 5289.98, "end": 5291.98, "text": "Man kann seine Meinung auch ändern."}, {"id": 700, "start": 5291.98, "end": 5295.98, "text": "Eigentlich gucke ich die beiden am liebsten mittlerweile."}, {"id": 701, "start": 5295.98, "end": 5301.98, "text": "Wahrscheinlich, weil er ein bisschen ausgefallen spricht, hat mir das am Anfang nicht gefallen."}, {"id": 702, "start": 5301.98, "end": 5303.98, "text": "Mittlerweile gucke ich die Videos von ihm."}, {"id": 703, "start": 5303.98, "end": 5308.98, "text": "Und wie heißt der andere denn?"}, {"id": 704, "start": 5308.98, "end": 5311.98, "text": "Der da? Ich glaube, der da ist es. Genau, der da."}, {"id": 705, "start": 5311.98, "end": 5316.98, "text": "Und Maurice gucke ich eigentlich die Videos am liebsten."}, {"id": 706, "start": 5316.98, "end": 5328.98, "text": "Diablo 3 hat einfach gesackt."}, {"id": 707, "start": 5328.98, "end": 5338.98, "text": "Ja."}, {"id": 708, "start": 5338.98, "end": 5345.98, "text": "Das finde ich halt komplett verkehrt rum."}, {"id": 709, "start": 5345.98, "end": 5347.98, "text": "Die müssen sich nicht beweisen."}, {"id": 710, "start": 5347.98, "end": 5350.98, "text": "Path of Exile hat die letzten 7 Jahre bewiesen, dass sie besser sind."}, {"id": 711, "start": 5350.98, "end": 5353.98, "text": "Wenn einer was beweisen muss, dann ist es eben Diablo 4."}, {"id": 712, "start": 5353.98, "end": 5357.98, "text": "Zum Beispiel zur Horroratmosphäre aus den ersten beiden Teilen."}, {"id": 713, "start": 5357.98, "end": 5362.98, "text": "Auf den ersten Blick sehen sich Diablo 4 und Path of Exile 2 sogar überraschend ähnlich."}, {"id": 714, "start": 5362.98, "end": 5365.98, "text": "In Sachen Gameplay unterscheiden sie sich jedoch teils gravierend."}, {"id": 715, "start": 5365.98, "end": 5370.98, "text": "Also schauen wir uns doch mal an, was sich die Macher von Path of Exile 2 so ausgedacht haben."}, {"id": 716, "start": 5370.98, "end": 5376.98, "text": "Wie sieht es eigentlich mit Diablo Immortal eigentlich aus?"}, {"id": 717, "start": 5376.98, "end": 5389.98, "text": "So gerade so. Gibt es da was Neues?"}, {"id": 718, "start": 5389.98, "end": 5394.98, "text": "Nee, oder?"}, {"id": 719, "start": 5394.98, "end": 5398.98, "text": "Wie sieht eigentlich die Bewertung aus von den..."}, {"id": 720, "start": 5398.98, "end": 5410.98, "text": "Oh, besser."}, {"id": 721, "start": 5410.98, "end": 5413.98, "text": "Oder haben sie das erstmal auf Eis gelegt?"}, {"id": 722, "start": 5413.98, "end": 5415.98, "text": "Release? Wann ist denn Release?"}, {"id": 723, "start": 5415.98, "end": 5418.98, "text": "Nee, gibt's nicht."}, {"id": 724, "start": 5418.98, "end": 5420.98, "text": "Testest du Diablo Immortal da mal im Stream?"}, {"id": 725, "start": 5420.98, "end": 5423.98, "text": "Nee, wahrscheinlich nicht."}, {"id": 726, "start": 5423.98, "end": 5426.98, "text": "Dein Diablo ist auch übelst langweilig zum Zugucken."}, {"id": 727, "start": 5426.98, "end": 5431.98, "text": "Zuerst. Path of Exile 2 integriert sich nahtlos ins bestehende Path of Exile."}, {"id": 728, "start": 5431.98, "end": 5435.98, "text": "Zwar bringt das Spiel eine neue Story-Kampagne, die 20 Jahre nach dem ersten Teil angesiedelt ist."}, {"id": 729, "start": 5435.98, "end": 5438.98, "text": "Doch beide Titel teilen sich dasselbe Ende."}, {"id": 730, "start": 5438.98, "end": 5440.98, "text": "Also die Story, muss ich mal sagen."}, {"id": 731, "start": 5440.98, "end": 5446.98, "text": "Also ein Punkt in Path of Exile, der mir immer voll am Arsch vorbeigegangen ist, ist die Story."}, {"id": 732, "start": 5446.98, "end": 5451.98, "text": "Ich hab so ungefähr eine Ahnung, was passiert in der Path of Exile Story."}, {"id": 733, "start": 5451.98, "end": 5457.98, "text": "So nach dem Motto, erstmal ist mal ausgestoßener und dann rettet man die Welt."}, {"id": 734, "start": 5457.98, "end": 5461.98, "text": "Und dann macht man irgendwie diesen Ober-Inquisitor, oder was das war, platt."}, {"id": 735, "start": 5461.98, "end": 5463.98, "text": "Der... Ach, was auch immer."}, {"id": 736, "start": 5463.98, "end": 5466.98, "text": "Und danach sind irgendwie die Götter am Start, die rumstelzen."}, {"id": 737, "start": 5466.98, "end": 5467.98, "text": "Was auch immer."}, {"id": 738, "start": 5467.98, "end": 5471.98, "text": "Die Path of Exile Story ist jetzt nicht unbedingt die große Stärke von diesem Game."}, {"id": 739, "start": 5471.98, "end": 5475.98, "text": "Jaja, es gibt eine Story. Es gibt eine. Es gibt eine."}, {"id": 740, "start": 5475.98, "end": 5481.98, "text": "..."}, {"id": 741, "start": 5481.98, "end": 5482.98, "text": "Heldenfortschritte und..."}, {"id": 742, "start": 5482.98, "end": 5487.98, "text": "Ja, ein halt, gut. Der jumpt ja auch auf einmal auf... Der ist auf einmal... Auf einmal da."}, {"id": 743, "start": 5487.98, "end": 5490.98, "text": "Und einer tut einer things dann."}, {"id": 744, "start": 5490.98, "end": 5493.98, "text": "Mikrotransaktionen aus dem Vorgänger bleiben bestehen."}, {"id": 745, "start": 5493.98, "end": 5498.98, "text": "Ja, Moment mal. Diesen Ansatz kennen wir doch ausgerechnet von Blizzard."}, {"id": 746, "start": 5498.98, "end": 5501.98, "text": "Das klingt nach dem Modell von Overwatch 2."}, {"id": 747, "start": 5501.98, "end": 5504.98, "text": "Und das musste dafür bereits einige Kritik einstecken."}, {"id": 748, "start": 5504.98, "end": 5509.98, "text": "Ja, nur mit dem Unterschied, dass Path of Exile in den letzten sieben Jahren gezeigt hat, dass sie sowas halt gut können."}, {"id": 749, "start": 5509.98, "end": 5513.98, "text": "Und Path of Exile hat immer noch eines der besten F2P-Modelle."}, {"id": 750, "start": 5513.98, "end": 5517.98, "text": "Du kannst Path of Exile ohne Probleme, ohne jegliches Geld spielen."}, {"id": 751, "start": 5517.98, "end": 5521.98, "text": "Aber es ist schon nützlich, wenn man Geld reinsteckt."}, {"id": 752, "start": 5521.98, "end": 5525.98, "text": "Weniger von den Skins, sondern die Kistenplätze braucht man eigentlich."}, {"id": 753, "start": 5525.98, "end": 5529.98, "text": "Ohne Kistenplätze ist Path of Exile..."}, {"id": 754, "start": 5529.98, "end": 5531.98, "text": "... sehr..."}, {"id": 755, "start": 5531.98, "end": 5533.98, "text": "... eklig zu spielen, ja."}, {"id": 756, "start": 5533.98, "end": 5535.98, "text": "Aber man braucht es nicht unbedingt."}, {"id": 757, "start": 5535.98, "end": 5539.98, "text": "Und witzigerweise ist Path of Exile eines der Games..."}, {"id": 758, "start": 5539.98, "end": 5543.98, "text": "... den ich im F2P-Modell gerne Geld gebe."}, {"id": 759, "start": 5543.98, "end": 5545.98, "text": "Im Vergleich zu allen anderen."}, {"id": 760, "start": 5545.98, "end": 5549.98, "text": "... dass ich bei Path of Exile 2 am Ende gar nicht um eine richtige Fortsetzung..."}, {"id": 761, "start": 5549.98, "end": 5551.98, "text": "... sondern um cleveres Marketing..."}, {"id": 762, "start": 5551.98, "end": 5554.98, "text": "Path of Exile hat Mikrotransaktionen. Klar. Die müssen irgendwie Geld verdienen. Kostet ja nichts."}, {"id": 763, "start": 5554.98, "end": 5556.98, "text": "... aber diese Frage ist nicht ganz unkompliziert."}, {"id": 764, "start": 5556.98, "end": 5562.98, "text": "Die ersten Spielberichten von der Exile-Konzefolge fühlt sich Path of Exile 2 tatsächlich wie ein neues Spiel an."}, {"id": 765, "start": 5562.98, "end": 5566.98, "text": "Und macht sowohl optisch als auch spielmechanisch mehr neu als Overwatch 2."}, {"id": 766, "start": 5566.98, "end": 5569.98, "text": "Die Grafik wirkt zwar nicht revolutionär aufgewertet..."}, {"id": 767, "start": 5569.98, "end": 5573.98, "text": "... wir kennen aber trotzdem an vielen Stellen große und kleine Verbesserungen."}, {"id": 768, "start": 5573.98, "end": 5575.98, "text": "Zum Beispiel bleiben Pfeile jetzt..."}, {"id": 769, "start": 5575.98, "end": 5578.98, "text": "Aber die Path of Exile F2P-Modell ist wirklich fair."}, {"id": 770, "start": 5578.98, "end": 5581.98, "text": "Ich weiß nicht, was mittlerweile die Inventarplätze kosten."}, {"id": 771, "start": 5581.98, "end": 5583.98, "text": "Ich hab mir das ja schon vor 5 Jahren gekauft."}, {"id": 772, "start": 5583.98, "end": 5585.98, "text": "Du kaufst ja ein paar Inventarplätze."}, {"id": 773, "start": 5585.98, "end": 5587.98, "text": "Und diesen komischen..."}, {"id": 774, "start": 5587.98, "end": 5590.98, "text": "Du kannst dir das dann auch kaufen. Du kannst dir nicht Inventarplätze..."}, {"id": 775, "start": 5590.98, "end": 5592.98, "text": "... äh, Kisten-Taps."}, {"id": 776, "start": 5592.98, "end": 5594.98, "text": "Und dann kann man sich ja noch kaufen."}, {"id": 777, "start": 5594.98, "end": 5597.98, "text": "Kisten-Taps oder farbige Kisten-Taps oder beschriftbare oder Crafting-Kisten-Taps."}, {"id": 778, "start": 5597.98, "end": 5598.98, "text": "Irgendwie sowas."}, {"id": 779, "start": 5598.98, "end": 5603.98, "text": "Kauf sie Kisten-Taps und danach musst du dir nie wieder irgendwas kaufen."}, {"id": 780, "start": 5603.98, "end": 5605.98, "text": "Vorkommen egal."}, {"id": 781, "start": 5605.98, "end": 5611.98, "text": "Und du kommst mit deutlich weniger Geld hin als bei einem Vollpreisspiel."}, {"id": 782, "start": 5611.98, "end": 5616.98, "text": "Und du kannst Zeit reinstecken mehr als bei fast jedem anderen Vollpreisspiel."}, {"id": 783, "start": 5616.98, "end": 5619.98, "text": "Unsere Rüstung klebt weniger steif am Charakter und die Animationen..."}, {"id": 784, "start": 5619.98, "end": 5622.98, "text": "Welches Spiel hast du am meisten Geld reingesteckt?"}, {"id": 785, "start": 5628.98, "end": 5629.98, "text": "Hm."}, {"id": 786, "start": 5630.98, "end": 5632.98, "text": "Weil, wüsste ich drüber nachdenken. Keine Ahnung."}, {"id": 787, "start": 5632.98, "end": 5633.98, "text": "Achso, ja."}, {"id": 788, "start": 5633.98, "end": 5634.98, "text": "Äh..."}, {"id": 789, "start": 5634.98, "end": 5639.98, "text": "Am meisten Geld ausgegeben habe ich wahrscheinlich Dark Edge of Camelot, weil ich da irgendwie, äh..."}, {"id": 790, "start": 5639.98, "end": 5641.98, "text": "Keine Ahnung, 10 Jahre den Monats-Abo hatte."}, {"id": 791, "start": 5645.98, "end": 5648.98, "text": "Ja, da habe ich wahrscheinlich am meisten Geld für ausgegeben. MMO."}, {"id": 792, "start": 5648.98, "end": 5652.98, "text": "Mit, ich glaube, 10 oder 12 Euro im Monat."}, {"id": 793, "start": 5652.98, "end": 5655.98, "text": "Also da habe ich ja allein schon, ähm..."}, {"id": 794, "start": 5655.98, "end": 5660.98, "text": "Über 1000 Euro ausgegeben für die Jahres-Abos."}, {"id": 795, "start": 5673.98, "end": 5675.98, "text": "Da kann man sich jetzt drüber streiten."}, {"id": 796, "start": 5675.98, "end": 5677.98, "text": "Ich muss euch ehrlich sagen..."}, {"id": 797, "start": 5677.98, "end": 5679.98, "text": "Pass of Exile ist..."}, {"id": 798, "start": 5679.98, "end": 5682.98, "text": "Ist sehr, also vor allem im späteren Game..."}, {"id": 799, "start": 5682.98, "end": 5684.98, "text": "Ist das sehr wirr."}, {"id": 800, "start": 5684.98, "end": 5686.98, "text": "Also wirr in Form von, wenn du zuguckst..."}, {"id": 801, "start": 5686.98, "end": 5689.98, "text": "Also wenn du dich neben jemanden stellst, der da spielt..."}, {"id": 802, "start": 5689.98, "end": 5692.98, "text": "Da denkst du, alter, was passiert da auf dem Bildschirm gerade?"}, {"id": 803, "start": 5694.98, "end": 5699.98, "text": "Der rennt mit 500 Movement Speed quer über die Map und um ihn herum stirbt alles."}, {"id": 804, "start": 5699.98, "end": 5702.98, "text": "So sieht ungefähr Pass of Exile Endgame aus."}, {"id": 805, "start": 5702.98, "end": 5703.98, "text": "Ähm..."}, {"id": 806, "start": 5703.98, "end": 5706.98, "text": "Da checkst du nichts mehr, aber nichtsdestotrotz..."}, {"id": 807, "start": 5706.98, "end": 5709.98, "text": "Ist Pass of Exile nicht..."}, {"id": 808, "start": 5709.98, "end": 5712.98, "text": "Nicht so anstrengend zu gucken wie Diablo 3, finde ich."}, {"id": 809, "start": 5712.98, "end": 5715.98, "text": "Pass of Exile fällt halt einfach alles um ohne größere..."}, {"id": 810, "start": 5715.98, "end": 5718.98, "text": "Ohne größere, ähm..."}, {"id": 811, "start": 5720.98, "end": 5722.98, "text": "Ohne dass es größer halt großartig nervt, ja?"}, {"id": 812, "start": 5722.98, "end": 5724.98, "text": "Du läufst halt einfach geradeaus und es fällt alles um."}, {"id": 813, "start": 5724.98, "end": 5726.98, "text": "So, das ist Pass of Exile Endgame."}, {"id": 814, "start": 5726.98, "end": 5729.98, "text": "Diablo 3 ist eher Bildschirm wackelt..."}, {"id": 815, "start": 5729.98, "end": 5732.98, "text": "Es flimmert, es gibt Lichteffekte und sonst was."}, {"id": 816, "start": 5732.98, "end": 5734.98, "text": "Das hast du in Pass of Exile halt eher nicht."}, {"id": 817, "start": 5734.98, "end": 5736.98, "text": "Du läufst halt rein, Gegnergruppe stirbt..."}, {"id": 818, "start": 5736.98, "end": 5738.98, "text": "Gegnergruppe stirbt, du läufst rein, Gegnergruppe stirbt, du läufst rein..."}, {"id": 819, "start": 5738.98, "end": 5739.98, "text": "Was heißt, du läufst rein?"}, {"id": 820, "start": 5739.98, "end": 5743.98, "text": "Du läufst vorbei, Gegnergruppe stirbt, du läufst vorbei, Gegnergruppe stirbt..."}, {"id": 821, "start": 5743.98, "end": 5744.98, "text": "Ähm..."}, {"id": 822, "start": 5744.98, "end": 5751.98, "text": "Du kriegst bei Pass of Exile Endgame weniger Augenbluten als bei Diablo 3."}, {"id": 823, "start": 5752.98, "end": 5754.98, "text": "Wobei es bestimmt bisschen Geschmackssache ist."}, {"id": 824, "start": 5756.98, "end": 5757.98, "text": "Also das hier ist jetzt..."}, {"id": 825, "start": 5757.98, "end": 5758.98, "text": "Ähm..."}, {"id": 826, "start": 5758.98, "end": 5760.98, "text": "Was die da zeigen ist hier Pass of Exile Noobstyle, ne?"}, {"id": 827, "start": 5760.98, "end": 5762.98, "text": "Das ist irgendwo ganz am Anfang."}, {"id": 828, "start": 5762.98, "end": 5764.98, "text": "Da tut sich schon nichts."}, {"id": 829, "start": 5764.98, "end": 5766.98, "text": "Warte mal, pass mal auf."}, {"id": 830, "start": 5766.98, "end": 5767.98, "text": "Ähm..."}, {"id": 831, "start": 5767.98, "end": 5768.98, "text": "Wie heißt dieser..."}, {"id": 832, "start": 5768.98, "end": 5769.98, "text": "Wie heißt dieser Riesen?"}, {"id": 833, "start": 5769.98, "end": 5770.98, "text": "Cyclone?"}, {"id": 834, "start": 5771.98, "end": 5772.98, "text": "PoE..."}, {"id": 835, "start": 5772.98, "end": 5773.98, "text": "Cyclone..."}, {"id": 836, "start": 5773.98, "end": 5774.98, "text": "Bild..."}, {"id": 837, "start": 5774.98, "end": 5775.98, "text": "Da wo..."}, {"id": 838, "start": 5775.98, "end": 5777.98, "text": "Da wo die jetzt mittlerweile schon irgendwelche..."}, {"id": 839, "start": 5777.98, "end": 5778.98, "text": "Ähm..."}, {"id": 840, "start": 5778.98, "end": 5780.98, "text": "Leuchteffekte haben..."}, {"id": 841, "start": 5781.98, "end": 5782.98, "text": "Ihr müsst euch das mal..."}, {"id": 842, "start": 5782.98, "end": 5785.98, "text": "Also da kriegst du echt absolut Anfälle, wenn du da zuguckst."}, {"id": 843, "start": 5786.98, "end": 5787.98, "text": "Das geht noch!"}, {"id": 844, "start": 5787.98, "end": 5788.98, "text": "Das geht noch, ja?"}, {"id": 845, "start": 5788.98, "end": 5792.98, "text": "Das ist, das ist doch, das ist doch human gerade."}, {"id": 846, "start": 5794.98, "end": 5796.98, "text": "Das geht noch, das geht noch viel schlimmer."}, {"id": 847, "start": 5797.98, "end": 5800.98, "text": "Da, da sieht man ja noch richtig was."}, {"id": 848, "start": 5805.98, "end": 5810.98, "text": "Braucht man, braucht man schönes, schönes Gameplay davon, wo man nicht mehr durchblickt, was passiert."}, {"id": 849, "start": 5812.98, "end": 5813.98, "text": "Ups."}, {"id": 850, "start": 5813.98, "end": 5816.98, "text": "Ja, hier ist so, hier, hier kommt man der Sache näher."}, {"id": 851, "start": 5816.98, "end": 5818.98, "text": "Hier kommt man der Sache näher."}, {"id": 852, "start": 5820.98, "end": 5823.98, "text": "Der, der, der klickt noch viel zu lange Items an."}, {"id": 853, "start": 5826.98, "end": 5827.98, "text": "Vor was?"}, {"id": 854, "start": 5827.98, "end": 5828.98, "text": "Was ist das?"}, {"id": 855, "start": 5831.98, "end": 5833.98, "text": "Ja, genau, sowas."}, {"id": 856, "start": 5838.98, "end": 5840.98, "text": "Genau, sowas, Alter."}, {"id": 857, "start": 5840.98, "end": 5842.98, "text": "Sowas, Alter."}, {"id": 858, "start": 5843.98, "end": 5845.98, "text": "Da bist du halt, das ist halt vorbei, ja?"}, {"id": 859, "start": 5845.98, "end": 5847.98, "text": "Da ist vorbei."}, {"id": 860, "start": 5852.98, "end": 5858.98, "text": "Ich spiele ja in Path of Exile, äh, Noob-Style Summoner-Bild, weil es einfach Brain-Afk im Kreisel-Kreiten ist."}, {"id": 861, "start": 5860.98, "end": 5863.98, "text": "Und du beschwörst dann einfach Dinge und läufst geradeaus."}, {"id": 862, "start": 5863.98, "end": 5866.98, "text": "So, also jetzt, huge, anspruchsvoll ist es nicht."}, {"id": 863, "start": 5866.98, "end": 5870.98, "text": "Ja, gut, Path of Exile Skill Tree ist ja auch da, ist ja auch Wahnsinn."}, {"id": 864, "start": 5870.98, "end": 5897.98, "text": "Ups."}, {"id": 865, "start": 5900.98, "end": 5903.86, "text": "Übelst nice. Ja, Leute."}, {"id": 866, "start": 5905.3, "end": 5910.42, "text": "Also wer schon mal immer zwei Wochen an einem Build bauen will, hat mit Path of Exile viel Spaß."}, {"id": 867, "start": 5914.98, "end": 5916.98, "text": "Path of Exile Skill Tree, easy."}, {"id": 868, "start": 5919.18, "end": 5923.82, "text": "Allerdings ist es, ist es, es sieht schlimmer aus als es ist. Es sieht schlimmer aus als es ist."}, {"id": 869, "start": 5924.58, "end": 5928.62, "text": "Es gibt ja dafür sogar schon Optimierungstools, die das Beste für einen,"}, {"id": 870, "start": 5928.62, "end": 5934.78, "text": "das Beste für einen machen, wo man dann angeben kann, ich hätte gern so und so, und dann sagt er, dieser Weg von Nodes ist besser."}, {"id": 871, "start": 5936.34, "end": 5941.94, "text": "Aber es gibt dem, es gibt dem Skillsystem viel Tiefe und so kam Path of Exile halt schon raus mit diesem,"}, {"id": 872, "start": 5942.42, "end": 5947.5, "text": "mit diesem Skill Tree und mittlerweile, ich, ich plicke ja selbst noch nicht hundertprozentig durch."}, {"id": 873, "start": 5947.86, "end": 5952.82, "text": "Mittlerweile haben sie mindestens zwei Sachen noch eingebaut, die das noch komplexer machen. Es gibt quasi so Art"}, {"id": 874, "start": 5952.82, "end": 5958.1, "text": "Ascendant Master Level, also da kannst du quasi noch mal,"}, {"id": 875, "start": 5959.86, "end": 5962.34, "text": "da kannst du quasi noch mal aufleveln"}, {"id": 876, "start": 5963.26, "end": 5965.26, "text": "mit Special, mit Special Skills."}, {"id": 877, "start": 5966.26, "end": 5968.58, "text": "Hier, kannst du dann noch mal auswählen, was du haben willst."}, {"id": 878, "start": 5968.94, "end": 5975.18, "text": "Wobei, dafür muss man so spezielle Dungeons durchspielen, dass man, dass man das kriegen kann. Und jetzt haben sie noch irgendwie so eine, so Götter,"}, {"id": 879, "start": 5975.18, "end": 5982.78, "text": "Götterselection, was man auswählen kann. Das hier, ne, äh."}, {"id": 880, "start": 5986.54, "end": 5993.98, "text": "Jetzt haben sie noch das hier, wo du noch Zeug auswählen kannst. Also Path of Exile Skill und Building ist"}, {"id": 881, "start": 5994.38, "end": 5996.38, "text": "echt eine Wissenschaft für sich."}, {"id": 882, "start": 5996.38, "end": 6001.9, "text": "Wie gehabt, verbessert ihr eure Fähigkeitsedelsteine mit mehreren Unterstützungsjuwelen, wie z.B. Mehrfachschuss."}, {"id": 883, "start": 6001.9, "end": 6007.74, "text": "Ach ja, und, und, wo wir gerade beim Thema Path of Exile sind. Im Path of Exile ist einfach los spielen"}, {"id": 884, "start": 6008.54, "end": 6015.1, "text": "und irgendwas skillen meistens keine allzu gute Idee, weil man kann nur sehr beschränkt respekten."}, {"id": 885, "start": 6015.58, "end": 6020.46, "text": "Man kriegt in der Main Quest ein paar Respektpunkte, das reicht, um sein Bild, äh,"}, {"id": 886, "start": 6020.46, "end": 6028.86, "text": "schon, äh, gut anzupassen, aber grundlegende Bild ändern kann man nicht. Also, man kann jetzt z.B. in Path of Exile nicht sagen,"}, {"id": 887, "start": 6029.58, "end": 6039.1, "text": "ähm, ich würde gerne, keine Ahnung, ich hab jetzt irgendwie hier oben gespeckt für, für, äh, mehr, mehr, mehr stärkere Minions"}, {"id": 888, "start": 6039.1, "end": 6043.5, "text": "und hier irgendwie gespeckt. Und dann kann man nicht sagen, ich mach jetzt irgendwie Melee-Build und geh hier runter."}, {"id": 889, "start": 6043.5, "end": 6049.34, "text": "Das, das, das funktioniert nicht, dafür hat man nicht genug Respektpunkte. Dann ist es einfach, einen neuen Charakter anzufangen."}, {"id": 890, "start": 6049.34, "end": 6060.3, "text": "Man kann respekten durch, ähm, man kann respekten durch Orbs, also durch Währung, kann man respekten in Path of Exile, aber"}, {"id": 891, "start": 6061.82, "end": 6066.14, "text": "ich behaupte jetzt einfach mal, ohne dass ich durchgerechnet hab, vielleicht weiß das ja einer von euch besser,"}, {"id": 892, "start": 6066.14, "end": 6071.58, "text": "dann kann man einfach mal, wenn man auf der Suche kommt, dass man auf der Suche kommt, dass man auf der Suche kommt,"}, {"id": 893, "start": 6071.58, "end": 6074.62, "text": "dass man auf der Suche kommt, dass man auf der maintaining Tap, vielleicht weiß das ja einer von euch besser,"}, {"id": 894, "start": 6074.62, "end": 6079.74, "text": "das lohnt sich nicht! Ich glaube es ist deutlich sinniger, wenn man einen neuen Charakter anfängt, anstatt,"}, {"id": 895, "start": 6079.74, "end": 6086.46, "text": "äh Kohle in adob of regret zu stecken! Vermutlich jetzt einfach mal so!"}, {"id": 896, "start": 6086.46, "end": 6090.06, "text": "Ich hab bisher immer neuen Charakter angefangen, wenn ich ein anderes skilln wollte!"}, {"id": 897, "start": 6091.18, "end": 6095.02, "text": "Hast du schon mal Niho gespielt? Nee, aber klingt irgendwie nach!"}, {"id": 898, "start": 6095.02, "end": 6096.14, "text": "Game!"}, {"id": 899, "start": 6099.42, "end": 6101.42, "text": "Als erfahrener Spieler lohnt sich das immer. Yecht?"}, {"id": 900, "start": 6101.42, "end": 6107.42, "text": "Echt, Respecken lohnt sich? In Passive Age, warum lohnt sich Respecken?"}, {"id": 901, "start": 6107.42, "end": 6115.42, "text": "Als erfahrener Spieler bist du doch in zwei Tagen auf fast Endgame, oder?"}, {"id": 902, "start": 6115.42, "end": 6128.42, "text": "Aha, in vier Stunden zum Leveln kann man locker das Doppelte im Endgame verdienen."}, {"id": 903, "start": 6128.42, "end": 6135.42, "text": "Ihr setzt diese Supportsteine jetzt nicht mehr in Items ein."}, {"id": 904, "start": 6135.42, "end": 6138.42, "text": "Stattdessen sockelt ihr nur noch die Grundfähigkeit in eure Ausrüstung."}, {"id": 905, "start": 6138.42, "end": 6141.42, "text": "Und deren Edelstein hat dann eigene Sockel."}, {"id": 906, "start": 6141.42, "end": 6144.42, "text": "Ab wann ist Endgame? Ja, das ist eine coole Sache in Pass of Exile."}, {"id": 907, "start": 6144.42, "end": 6150.42, "text": "Das ist eigentlich ziemlich fließend. Ich bin ja bei Weitem noch nicht wirklich endgame-mäßig in der aktuellen Season."}, {"id": 908, "start": 6150.42, "end": 6152.42, "text": "Dafür spiele ich auch viel zu wenig."}, {"id": 909, "start": 6152.42, "end": 6162.42, "text": "Es gibt jetzt so einen neuen, nee, nee, nee, nicht Akt 5. Die Endgame ist nach der Story, wenn du Maps craftest und Gedöns machst."}, {"id": 910, "start": 6162.42, "end": 6166.42, "text": "Es gibt jetzt zig neue Sachen in dem Game. Wie gesagt, ich habe auch erst wieder angefangen."}, {"id": 911, "start": 6166.42, "end": 6171.42, "text": "Es gibt jetzt irgendwie so einen komischen neuen Challenge-Dungeon oder sowas."}, {"id": 912, "start": 6171.42, "end": 6174.42, "text": "Und es gibt so eine Art Rift-Geschichte wie in Diablo."}, {"id": 913, "start": 6174.42, "end": 6177.42, "text": "Dann gibt es nach wie vor die ganze Map-Geschichte."}, {"id": 914, "start": 6177.42, "end": 6183.42, "text": "Dann gibt es noch irgendwie so eine Map-Enhancement-Enchanting-Geschichte oder sowas, wo ich auch keinen Plan habe, was es genau ist."}, {"id": 915, "start": 6183.42, "end": 6185.42, "text": "Da gibt es so viel Zeug."}, {"id": 916, "start": 6185.42, "end": 6191.42, "text": "Und eins, was Pass of Exile richtig gut macht, ist, der Übergang ist komplett fließend."}, {"id": 917, "start": 6191.42, "end": 6196.42, "text": "Von Anfang bis Endgame. Das ist komplett fließend."}, {"id": 918, "start": 6196.42, "end": 6200.42, "text": "Da gibt es nicht so eine Geschichte mit so nach dem Motto, jetzt bist du fertig, jetzt fängt Endgame an."}, {"id": 919, "start": 6200.42, "end": 6203.42, "text": "Das ist sehr schön fließend gemacht."}, {"id": 920, "start": 6203.42, "end": 6206.42, "text": "Pass of Exile 2"}, {"id": 921, "start": 6206.42, "end": 6210.42, "text": "Wie viele neue Akte kommen nochmal in Pass of Exile 2? Keine Ahnung, mal gucken, ob man das sagt."}, {"id": 922, "start": 6210.42, "end": 6213.42, "text": "Wahrscheinlich erst mal drei, so wie ich die kenne."}, {"id": 923, "start": 6213.42, "end": 6215.42, "text": "Aber ich weiß es nicht."}, {"id": 924, "start": 6215.42, "end": 6216.42, "text": "Ja, okay."}, {"id": 925, "start": 6232.42, "end": 6234.42, "text": "Boah, das gibt ja noch mehr Cluster-Fuck."}, {"id": 926, "start": 6234.42, "end": 6235.42, "text": "Das gibt ja noch mehr Cluster-Fuck."}, {"id": 927, "start": 6235.42, "end": 6244.42, "text": "Aktuell ist es so, in Pass of Exile kannst du nur in der Rüstung und ich glaube in der Zweihandwaffe sechs Säckel haben."}, {"id": 928, "start": 6244.42, "end": 6250.88, "text": "Und in Passive Exile ist es so, man bekommt keine Skills aus dem Skilltree, also, wer jetzt gedacht hat..."}, {"id": 929, "start": 6252.4, "end": 6258.26, "text": "Das stimmt ja gar nicht, was ich gesagt hab. Wer gedacht hat, hier bekommt man seine Skills in dem Skilltree, das stimmt ja gar nicht."}, {"id": 930, "start": 6258.82, "end": 6259.7, "text": "Das ist passiv."}, {"id": 931, "start": 6260.7, "end": 6265.0, "text": "Das sind nur Passivfähigkeiten und ein paar Modifier für aktive Fähigkeiten."}, {"id": 932, "start": 6265.36, "end": 6270.3, "text": "Das ist alles passiv. In Passive Exile kriegt man seine Skills durch Juwelen, die man sockelt."}, {"id": 933, "start": 6270.3, "end": 6285.84, "text": "Und je nachdem, wie man die verbindet miteinander, also sprich, je nachdem, welche Farbe der jeweilige Skill hat und wie die Sockel miteinander verlinkt sind, kann man da richtig abgedrehte Sachen produzieren, ja."}, {"id": 934, "start": 6285.84, "end": 6292.34, "text": "Du kannst dann zum Beispiel sagen, ok, ich sockel jetzt, ich sockel jetzt einen aktiven Skill, mit dem ich Zombies beschwören kann."}, {"id": 935, "start": 6292.34, "end": 6298.86, "text": "So, dann sockel ich noch ein weiteres Gem dazu, was mir ermöglicht, dass die Dinger ne Aura haben."}, {"id": 936, "start": 6298.86, "end": 6307.62, "text": "Dann sockel ich mir weiteren Sockel dazu, dafür sorg, dass die Feuerdamage kriegen und einen weiteren Sockel, der mehr Critdamage macht, mehr Leben, mehr sonst was, sowas in der Richtung, ja."}, {"id": 937, "start": 6308.78, "end": 6317.06, "text": "Und man kann auch Skills übelst geil pimpen, so nach dem Motto, eine Frostwave, heißt das Ding Frostwave, nach vorne und da kannst du dann drei Stück draus machen und sowas."}, {"id": 938, "start": 6317.7, "end": 6326.92, "text": "Also, das, alles in allem ist das Skillsystem in Passive Exile schon ziemlich komplex, aber das macht's auch, macht's auch erst, erst richtig nice."}, {"id": 939, "start": 6326.92, "end": 6333.22, "text": "Jetzt gibt es viel weniger Druck, sich auf ein oder zwei Primärattacken zu konzentrieren und mehr Freiheit zum Experimentieren."}, {"id": 940, "start": 6333.22, "end": 6341.22, "text": "Gleichermaßen wird das System für Einsteiger weniger fummelig und besser planbar, weil alle Itemtypen grundlegend immer die gleichen Sockel haben."}, {"id": 941, "start": 6341.22, "end": 6349.42, "text": "Ein Bogen zum Beispiel immer für vier Geschicklichkeitsfähigkeiten. Profis können die dann weiter modifizieren, sodass der alte Tiefgang erhalten bleibt."}, {"id": 942, "start": 6349.42, "end": 6356.92, "text": "Außerdem könnt ihr keine falschen Edelsteine mehr einsetzen. Ein Mehrfachschussjuwel passt jetzt einfach nicht mehr in eine Nahkampfattacke."}, {"id": 943, "start": 6356.92, "end": 6366.22, "text": "Dazu kommen völlig neue Fähigkeiten wie Gestaltwandlung. So wird es neue Skill-Gems geben, mit denen ihr eure Helden zu Wehrwölfen und Wehrbeeren machen könnt und dann entspricht..."}, {"id": 944, "start": 6366.22, "end": 6381.22, "text": "Das erinnert mich an Diablo 2. Beste in Diablo 2 war allerdings beim Truide, ähm, wie hieß denn das? Elemental Truide, also mit Vulkan und sowas."}, {"id": 945, "start": 6381.22, "end": 6391.22, "text": "War beste in Diablo 2. Cowlevel Runs mit als Elemental, wie hieß denn das? Vulkanic Pillar oder so, kann das sein?"}, {"id": 946, "start": 6391.22, "end": 6404.22, "text": "Das weiß ich gar nicht mehr. Diablo 2 Truide Volcano. Ja, Volcano Truide, beste in Diablo 2."}, {"id": 947, "start": 6404.22, "end": 6407.22, "text": "Cowlevel Runs, von morgens bis abends."}, {"id": 948, "start": 6407.22, "end": 6415.22, "text": "Das ebenfalls Gestaltwandlung mit dem Druiden bringt. Und beide Spiele wollen auf flüssige Wechsel selbst mitten zwischen zwei Hieben setzen."}, {"id": 949, "start": 6415.22, "end": 6421.22, "text": "Nur, dass in Diablo 4 jede Gestalt an bestimmte Fähigkeiten gebunden ist. Ein Ansturm macht uns etwa immer zum Wehrbär."}, {"id": 950, "start": 6421.22, "end": 6425.22, "text": "In Path of Exile können die Tierformen dagegen alle passenden normalen Attacken nutzen."}, {"id": 951, "start": 6425.22, "end": 6430.22, "text": "Als Wehrwolf etwa die gleiche Sprungattacke, wie sie auch ein bewaffneter Krieger einsetzt."}, {"id": 952, "start": 6430.22, "end": 6437.22, "text": "Was mehr Vielfalt erlaubt, aber auch etwas beliebiger ist als komplett eigene Wehrwolf-Attacken. Dafür gibt's auch ungewöhnliche..."}, {"id": 953, "start": 6437.22, "end": 6442.22, "text": "Man muss auch sagen, dass das Balancing in Path of Exile nicht so der Wahnsinn ist, weil..."}, {"id": 954, "start": 6442.22, "end": 6451.22, "text": "Inwieweit das jetzt relevant ist, muss man wissen, weil es gibt für alle Charaktere gute Skillungen."}, {"id": 955, "start": 6451.22, "end": 6457.22, "text": "Aber es hat schon seinen Grund, dass gerade 29% Witches sind und davon die meisten Summoner-Bills spielen."}, {"id": 956, "start": 6457.22, "end": 6462.22, "text": "Das hat schon seinen Grund. Summoner-Bills in Path of Exile sind einfach die Noob-Bills."}, {"id": 957, "start": 6462.22, "end": 6466.22, "text": "Deswegen spiele ich ja auch eins. Weil man einfach nichts machen muss."}, {"id": 958, "start": 6466.22, "end": 6472.22, "text": "Das ist halt billig. Du kannst super leveln und du brauchst nicht viele Items."}, {"id": 959, "start": 6472.22, "end": 6477.22, "text": "Zum Beispiel wurde eine spezielle Katzenform erwähnt, die der neuen Beastmaster-Klasse vorbehalten ist."}, {"id": 960, "start": 6477.22, "end": 6481.22, "text": "Die nerven doch immer mal die Meta-Bills. Ja, das stimmt, aber Summoner-Bills sind immer noch übelst OP."}, {"id": 961, "start": 6481.22, "end": 6490.22, "text": "Ich glaube, sie haben im letzten Patch, wo ich noch nicht gespielt habe, Specters genervt und ich glaube Zombies genervt."}, {"id": 962, "start": 6490.22, "end": 6495.22, "text": "Ich bin nicht ganz sicher, aber ich habe jetzt erst danach wieder angefangen und Summoner-Bills sind immer noch übelst OP."}, {"id": 963, "start": 6495.22, "end": 6499.22, "text": "Dabei handelt es sich um eine von 19 neuen Ascendancies."}, {"id": 964, "start": 6499.22, "end": 6503.22, "text": "Also den erweiterten Charakterklassen, mit denen ihr eure Figuren aufmotzen und beide spezialisieren könnt."}, {"id": 965, "start": 6503.22, "end": 6504.22, "text": "Ja, das gibt es ja jetzt schon."}, {"id": 966, "start": 6504.22, "end": 6511.22, "text": "Zusammen mit den 19 existierenden Ascendancies kommt Path of Exile so als stolze 38 erweiterte Klasse."}, {"id": 967, "start": 6511.22, "end": 6512.22, "text": "Okay, das ist cool."}, {"id": 968, "start": 6512.22, "end": 6514.22, "text": "Furchtbar viel ist zu denen aber noch nicht bekannt."}, {"id": 969, "start": 6514.22, "end": 6518.22, "text": "Neben dem Beastmaster wurden weitere Spezialisierungen für die Waldläuferin vorgestellt."}, {"id": 970, "start": 6518.22, "end": 6523.22, "text": "Von der eine aktiv zwischen Einzel- und Flächenschaden für Fernangriffe wechseln kann."}, {"id": 971, "start": 6523.22, "end": 6528.22, "text": "Die andere benutzt Nahkampfspezialangriffe für Schwerter und Äxte, auch mit dem Bogen."}, {"id": 972, "start": 6528.22, "end": 6533.22, "text": "Erste Hinweise auf neue Waffengattungen, vermutlich Stangenwaffen und Armbrüste, gibt es auch."}, {"id": 973, "start": 6533.22, "end": 6536.22, "text": "Konkreter wurden die Entwickler schon bei den Bossgegnern."}, {"id": 974, "start": 6536.22, "end": 6540.22, "text": "Die sollen diesmal schon früh im Spiel deutlich vielfältiger und kniffliger werden."}, {"id": 975, "start": 6540.22, "end": 6543.22, "text": "Was schreiben die auf ihrer Webseite?"}, {"id": 976, "start": 6543.22, "end": 6546.22, "text": "Hä? Was? Was ist? Zu viel Mathe?"}, {"id": 977, "start": 6546.22, "end": 6555.22, "text": "Was? Bevor ich ein bisschen Angst habe mit Diablo 4 ist das Blizzard wieder die Komplexität rausstreichend."}, {"id": 978, "start": 6555.22, "end": 6557.22, "text": "Ja, das war ja auch das Problem bei Diablo 3."}, {"id": 979, "start": 6557.22, "end": 6562.22, "text": "Denn auf deren Webseite behaupten die allen ernstes zu viel Mathe in Diablo 3."}, {"id": 980, "start": 6562.22, "end": 6565.22, "text": "What? Was gab es denn in Diablo 3 zu viel Mathe?"}, {"id": 981, "start": 6565.22, "end": 6569.22, "text": "Mal davon abgesehen, dass das Game fast alles für dich ausgerechnet hat, was wichtig war."}, {"id": 982, "start": 6573.22, "end": 6575.22, "text": "Okay, ja Blizzard."}, {"id": 983, "start": 6575.22, "end": 6578.22, "text": "Keine Ahnung, was mit Blizzard los ist."}, {"id": 984, "start": 6598.22, "end": 6600.22, "text": "Was? Diablo Shared World?"}, {"id": 985, "start": 6600.22, "end": 6606.22, "text": "Das ist so halbes MMO."}, {"id": 986, "start": 6606.22, "end": 6613.22, "text": "Gut, das kann, also das kann Path of Exile auch gebrauchen, weil die Path of Exile Grafik ist scheiße."}, {"id": 987, "start": 6613.22, "end": 6617.22, "text": "Aber sie ist zweckmäßig und gut, es läuft wenigstens okay."}, {"id": 988, "start": 6626.22, "end": 6628.22, "text": "Sieben? Okay."}, {"id": 989, "start": 6628.22, "end": 6631.22, "text": "Path of Exile als es rausgekommen ist, war halt drei."}, {"id": 990, "start": 6631.22, "end": 6633.22, "text": "Und mittlerweile zehn."}, {"id": 991, "start": 6633.22, "end": 6649.22, "text": "Moment, es gab so ein Intro und ach nee, das ist jetzt für Path of Exile 2."}, {"id": 992, "start": 6664.22, "end": 6667.22, "text": "Das sieht original aus, wie die..."}, {"id": 993, "start": 6668.22, "end": 6671.22, "text": "Das ist doch Path of Exile, der erste Boss."}, {"id": 994, "start": 6672.22, "end": 6676.22, "text": "Das auch, das ist der Boss zwischen Act 1 und 2."}, {"id": 995, "start": 6676.22, "end": 6685.22, "text": "Oh komm mal, Triss."}, {"id": 996, "start": 6695.22, "end": 6698.22, "text": "Ja, die sind clever bei Crying Gear Games."}, {"id": 997, "start": 6698.22, "end": 6705.22, "text": "So muss das machen, das fand ich schon auch bei Woe Add-ons immer übelst low brain von Blizzard,"}, {"id": 998, "start": 6705.22, "end": 6708.22, "text": "dass die mit jedem Add-on das alte Add-on überflüssig gemacht haben."}, {"id": 999, "start": 6708.22, "end": 6711.22, "text": "Du hast so viel Contentbrach liegen lassen dadurch."}, {"id": 1000, "start": 6711.22, "end": 6736.22, "text": "Du musst das so machen, du musst beides am Leben halten, weil umso mehr Content, umso besser hältst du deine Spieler bei Laune."}, {"id": 1001, "start": 6741.22, "end": 6743.22, "text": "Joa."}, {"id": 1002, "start": 6771.22, "end": 6780.22, "text": "Path of Exile hat so viel Inhalt, das kann man schon als Maingame spielen."}, {"id": 1003, "start": 6782.22, "end": 6785.22, "text": "Oh, hör auf."}, {"id": 1004, "start": 6786.22, "end": 6790.22, "text": "Ach stimmt, die Ankündigung war lustig."}, {"id": 1005, "start": 6790.22, "end": 6798.22, "text": "Die haben ja gesagt Path of Exile Mobile und da haben sie sich noch ein bisschen lustig gemacht über Diablo Mobile."}, {"id": 1006, "start": 6798.22, "end": 6803.22, "text": "Das ist recht schwierig geworden, die einfach so anzukündigen, meinte Wilson."}, {"id": 1007, "start": 6807.22, "end": 6813.22, "text": "Man wollte daher lieber erstmal die große Fortsetzung vorstellen und dann das Mobile Spiel hinterher."}, {"id": 1008, "start": 6813.22, "end": 6815.22, "text": "Ist wahrscheinlich auch schlauer so."}, {"id": 1009, "start": 6815.22, "end": 6818.22, "text": "Und Wilson setzt noch einen drauf."}, {"id": 1010, "start": 6818.22, "end": 6824.22, "text": "Wir haben das Ding nicht an irgendeinen externen Wickel herausgehauen, sagt er, sondern bauen es komplett intern."}, {"id": 1011, "start": 6824.22, "end": 6830.22, "text": "Ein Schelm, wer da an Blizzards Partnerschaft mit dem chinesischen Studio NetEase für Diablo Immortal denkt."}, {"id": 1012, "start": 6830.22, "end": 6835.22, "text": "In Path of Exiles Mobile Trailer kriegt einer der Entwickler dann auch noch den Titel Mobile Sündenbock."}, {"id": 1013, "start": 6835.22, "end": 6839.22, "text": "Nur für den Fall, dass die Ankündigung vielleicht doch nicht so gut ankommt."}, {"id": 1014, "start": 6839.22, "end": 6844.22, "text": "Ganz im Ernst versprechen die Macher aber, dass die Mobilfassung keinerlei Kompromisse bei Tiefgang und Komplexität macht."}, {"id": 1015, "start": 6844.22, "end": 6846.22, "text": "Ich glaub das denen sogar."}, {"id": 1016, "start": 6846.22, "end": 6850.22, "text": "Womit sie auch ganz nüchtern betrachtet einen anderen Ansatz verfolgt, als das vereinfachtere Diablo Immortal."}, {"id": 1017, "start": 6850.22, "end": 6852.22, "text": "Dass das ganz gut wird."}, {"id": 1018, "start": 6852.22, "end": 6856.22, "text": "Ich kann mir auch sogar vorstellen, dass Diablo Immortal ganz gut wird."}, {"id": 1019, "start": 6856.22, "end": 6857.22, "text": "Könnte ich mir auch vorstellen."}, {"id": 1020, "start": 6857.22, "end": 6861.22, "text": "Aber die haben es halt taktisch sehr ungeschickt gemacht."}, {"id": 1021, "start": 6861.22, "end": 6864.22, "text": "Das Einzige, ich hab's schon ein paar Mal gesagt im Stream."}, {"id": 1022, "start": 6864.22, "end": 6867.22, "text": "Das Einzige, dass nur eine Sache hätten sie machen müssen."}, {"id": 1023, "start": 6867.22, "end": 6871.22, "text": "Bei ihrem Diablo Immortal Disaster."}, {"id": 1024, "start": 6871.22, "end": 6876.22, "text": "Sie hätten einfach Diablo 4 mit einem Mini Teaser am Ende zeigen müssen."}, {"id": 1025, "start": 6876.22, "end": 6877.22, "text": "Das hätte gereicht."}, {"id": 1026, "start": 6877.22, "end": 6881.22, "text": "Es hätte niemand mehr über Diablo Immortal gelästert."}, {"id": 1027, "start": 6881.22, "end": 6883.22, "text": "Die hätten Immortal zeigen sollen."}, {"id": 1028, "start": 6883.22, "end": 6886.22, "text": "Und dann zum Ende, wenn die Präsentation fertig war."}, {"id": 1029, "start": 6886.22, "end": 6888.22, "text": "Hätten die sagen müssen, ach übrigens Leute."}, {"id": 1030, "start": 6888.22, "end": 6891.22, "text": "Noch eine Sache gibt's hier, wollten wir euch noch zeigen."}, {"id": 1031, "start": 6891.22, "end": 6898.22, "text": "Dann hätten sie einfach 30 Sekunden, wie bei Elder Scrolls, 30 Sekunden Diablo 4 Teaser gespielt."}, {"id": 1032, "start": 6898.22, "end": 6900.22, "text": "Und alle wären happy gewesen."}, {"id": 1033, "start": 6900.22, "end": 6906.22, "text": "Auf die Frage, ob man nicht doch ab und zu darüber nachdenkt, Part of Exile etwas zu vereinfachen."}, {"id": 1034, "start": 6906.22, "end": 6909.22, "text": "Hat Chris Wilson eine recht eindeutige Antwort."}, {"id": 1035, "start": 6909.22, "end": 6912.22, "text": "Blizzard beherrscht den Casual-Sektor."}, {"id": 1036, "start": 6912.22, "end": 6914.22, "text": "Dagegen kommt man nicht an."}, {"id": 1037, "start": 6914.22, "end": 6918.22, "text": "Überhaupt zeigt Rhinelingir Games die gnadenlose Identität von Part of Exile sehr wichtig."}, {"id": 1038, "start": 6918.22, "end": 6920.22, "text": "Intern gebe es hitzige Diskussionen darüber."}, {"id": 1039, "start": 6920.22, "end": 6923.22, "text": "Man sollte es auf keinen Fall vereinfachen."}, {"id": 1040, "start": 6923.22, "end": 6929.22, "text": "Einen tiefen Talentbaum des Spiels, der mehr an eine Art Talent-Universum steigt."}, {"id": 1041, "start": 6929.22, "end": 6932.22, "text": "Nicht doch irgendwie für Neueinsteiger weniger Furcht einsteigen."}, {"id": 1042, "start": 6932.22, "end": 6934.22, "text": "Das ist das Beste am Part of Exile."}, {"id": 1043, "start": 6934.22, "end": 6937.22, "text": "Einerseits, so Wilson, wäre jetzt ein idealer Zeitpunkt."}, {"id": 1044, "start": 6937.22, "end": 6941.22, "text": "Um neuen Spielern über Vereinfachungen an diesem System den Spieleinstieg zu erleichtern."}, {"id": 1045, "start": 6941.22, "end": 6944.22, "text": "Zum Endgame hin könnte man ja immer noch alle Optionen beibehalten."}, {"id": 1046, "start": 6944.22, "end": 6947.22, "text": "Ohne Spieler direkt von Beginn an damit zu erschlagen."}, {"id": 1047, "start": 6947.22, "end": 6952.22, "text": "Andererseits ist aber genau dieser Talentbaum eines der Alleinstellungsmerkmale von Part of Exile."}, {"id": 1048, "start": 6952.22, "end": 6955.22, "text": "Das zu ändern, könnte viele Fans enttäuschen."}, {"id": 1049, "start": 6955.22, "end": 6960.22, "text": "Und so bleibt Part of Exile auch mit seiner Fortsetzung bockschwer, gnadenlos und teuflisch."}, {"id": 1050, "start": 6960.22, "end": 6963.22, "text": "Der Pass of Exile ist nicht schwer, muss man ehrlich sagen."}, {"id": 1051, "start": 6963.22, "end": 6968.22, "text": "Vor allem wenn man einen Brain-Dead-Noob-Summoner-Build spielt, wie ich mir ausgesucht habe, das ist nicht schwer."}, {"id": 1052, "start": 6968.22, "end": 6974.22, "text": "Du läufst geradeaus, lässt deine Minions alles killen und ab und zu machst du mal eine Attacke, wenn es dir zu langweilig wird."}, {"id": 1053, "start": 6974.22, "end": 6980.22, "text": "Hauptsächlich guckst du einfach nur, dass du nicht zu viel Damage kassierst und deine Minions machen alles kaputt."}, {"id": 1054, "start": 6980.22, "end": 6987.22, "text": "Also mit meinem aktuellen Zombie-Summoner-Build ist es total einfach."}, {"id": 1055, "start": 6987.22, "end": 6991.22, "text": "Ich caste meine Zombies, ich renne in den Raum rein, ich laufe so lange im Kreis bis die Gegner tot sind."}, {"id": 1056, "start": 6991.22, "end": 6994.22, "text": "Ich laufe einfach nur im Kreis, dass ich nicht gekillt werde."}, {"id": 1057, "start": 6994.22, "end": 6998.22, "text": "Das ist wirklich nicht schwer."}, {"id": 1058, "start": 6998.22, "end": 7001.22, "text": "Die Casions lesen keine Build-Guides durch, ja das ist ein Problem."}, {"id": 1059, "start": 7001.22, "end": 7007.22, "text": "Aber das sollte eigentlich jeder mit ein bisschen Hirn und ein bisschen Erfahrung in Action-RPGs oder RPGs gelernt haben."}, {"id": 1060, "start": 7007.22, "end": 7015.22, "text": "Dass wenn ein Spiel nicht gerade komplett neu ist, man am besten sich ein paar Skill-Guides durchliest, weil man sonst einfach 100 Stunden in den Sand steckt und sich verskillt."}, {"id": 1061, "start": 7015.22, "end": 7022.22, "text": "Komplex, während man bei Diablo eben leichter einsteigen, einfach drauf los spielen und den hervorragenden Spielfluss genießen kann."}, {"id": 1062, "start": 7022.22, "end": 7026.22, "text": "Auch mal ohne ewig lang seinen Charakter zu planen, sich jeden Fortschritt..."}, {"id": 1063, "start": 7026.22, "end": 7030.22, "text": "Charakter, das verstehe ich halt nicht, warum da viele Leute was dagegen haben."}, {"id": 1064, "start": 7030.22, "end": 7040.22, "text": "Für mich ist fast die Hälfte, was an RPGs beziehungsweise auch an Action-RPGs oder Spiele mit gewitzer Komplexität, wo es Charakter-Erstellungen gibt, bei MMOs ja."}, {"id": 1065, "start": 7040.22, "end": 7051.22, "text": "Für mich ist 30, 40, 50% der Zeit oder des Reizes liegt eigentlich im optimalen Charakter-Build."}, {"id": 1066, "start": 7051.22, "end": 7055.22, "text": "Und weniger im Game oder Main-Story an sich."}, {"id": 1067, "start": 7061.22, "end": 7066.22, "text": "Ja gut, Eax, aber du machst es ja absichtlich. Machst nicht, weil du zu blöd bist, Guides zu lesen."}, {"id": 1068, "start": 7066.22, "end": 7069.22, "text": "Du sagst ja ganz bewusst, will ich nicht."}, {"id": 1069, "start": 7080.22, "end": 7081.22, "text": "Was?"}, {"id": 1070, "start": 7083.22, "end": 7085.22, "text": "Achso, Ancient Stinks."}, {"id": 1071, "start": 7085.22, "end": 7094.22, "text": "Also ich freue mich ehrlich gesagt nur auf Path of Exile 2. Wie sieht es bei euch aus? Diablo 4 juckt mich gar nicht."}, {"id": 1072, "start": 7115.22, "end": 7120.22, "text": "Das war der Eindruck von der BlizzCon und unser Detail-Video mit 27 vertiefenden Fakten zum Spiel."}, {"id": 1073, "start": 7120.22, "end": 7126.22, "text": "Wir werden auch künftig über die besten kommenden Action-RPGs berichten. Mit einem Abo bleibe ich also immer auf den laufenden."}, {"id": 1074, "start": 7126.22, "end": 7130.22, "text": "Nachdem wir ein paar im Chat haben, die Path of Exile spielen, war eine Frage."}, {"id": 1075, "start": 7130.22, "end": 7146.22, "text": "Ich habe jetzt Jahre nicht gespielt und davor waren nicht diese Witch-Summoner-Builds OP in Path of Exile, sondern Totem-Builds waren OP in Path of Exile."}, {"id": 1076, "start": 7146.22, "end": 7153.22, "text": "Was ja auch Summoner-Builds sind. Taugen Totem-Builds aktuell noch oder sucken die in Path of Exile?"}, {"id": 1077, "start": 7153.22, "end": 7154.22, "text": "Was ja."}, {"id": 1078, "start": 7155.22, "end": 7156.22, "text": "Sind immer noch okay."}, {"id": 1079, "start": 7158.22, "end": 7163.22, "text": "Ja ich weiß es, man konnte irgendwie, ganz am Anfang konnte man so ein übelst OP Totem-Build machen."}, {"id": 1080, "start": 7163.22, "end": 7170.22, "text": "Da gab es irgendwie, wie konntest du plus Totem, plus Totem, plus Totem und dann irgendwie die passende Skill-Kombination und du konntest quasi afk gehen."}, {"id": 1081, "start": 7170.22, "end": 7175.22, "text": "Du bist in den Raum rein, hast Totem gecastet, bist auf den Desktop geswitcht, so nach dem Motto."}, {"id": 1082, "start": 7175.22, "end": 7182.22, "text": "Diablo 4 wird anders als ihr denkt. Okay, das müssen wir uns nochmal angucken. Zumindest wird mich mein... Moment, das ist ja schon alt, das Game."}, {"id": 1083, "start": 7186.22, "end": 7187.22, "text": "Nee, nee, das müssen wir uns nicht gucken."}, {"id": 1084, "start": 7190.22, "end": 7193.22, "text": "Battlefield Top Plays, Leute, haben wir lange keins mehr geguckt. Komm, da gucken wir jetzt noch eins."}, {"id": 1085, "start": 7196.22, "end": 7198.22, "text": "Ja, ich bin zwar zwei Stunden noch nicht, ich..."}, {"id": 1086, "start": 7198.22, "end": 7205.22, "text": "Ich muss mal übelst aufs Klo, aber Battlefield Top Plays gucken wir jetzt noch eins."}, {"id": 1087, "start": 7206.22, "end": 7213.22, "text": "Und ich könnte wetten, ich weiß schon wieder genau, was der Typ sagt, weil der Kommentator sagt immer das gleiche, jedes Mal."}, {"id": 1088, "start": 7214.22, "end": 7219.22, "text": "So nach dem Motto, das ist auch eine seltene Waffe, die sieht man nicht so oft, aber ein netter Killstreak ist das trotzdem."}, {"id": 1089, "start": 7220.22, "end": 7222.22, "text": "Sowas in der Richtung, immer, immer das gleiche."}, {"id": 1090, "start": 7222.22, "end": 7225.22, "text": "Gekommnet."}, {"id": 1091, "start": 7234.22, "end": 7236.22, "text": "What?"}, {"id": 1092, "start": 7237.22, "end": 7240.22, "text": "Das war Glück, ey, das war übelst Glück, dass das noch reingehauen hat."}, {"id": 1093, "start": 7241.22, "end": 7243.22, "text": "Der hat's ja schon selbst aufgegeben."}, {"id": 1094, "start": 7243.22, "end": 7251.22, "text": "Das ist ein ziemlich krasser Grünstich, den das Ganze hier hatten."}, {"id": 1095, "start": 7273.22, "end": 7278.22, "text": "Boah, das war tatsächlich nice."}, {"id": 1096, "start": 7278.22, "end": 7305.22, "text": "Boah, das war tatsächlich nice, aber das ist so..."}, {"id": 1097, "start": 7308.22, "end": 7314.22, "text": "50% gut, gut predicted, 50% Skill, da ist aber auch 50% Glück dabei."}, {"id": 1098, "start": 7315.22, "end": 7321.22, "text": "Was ist vielversprechender, Path of Exile oder Lost Ark? Naja, für mich als Path of Exile Spieler, Path of Exile, beste."}, {"id": 1099, "start": 7321.22, "end": 7337.22, "text": "Lost Ark, gibt's das nicht schon seit 3 Jahren oder so?"}, {"id": 1100, "start": 7351.22, "end": 7366.22, "text": "Okay, ey, das war aber auch, das war auch wieder sehr glücklich, ey."}, {"id": 1101, "start": 7366.22, "end": 7381.22, "text": "10% Luck, 20% Skill, wie ging das weiter? 15% irgendwie Concentrated Power, ach, keine Ahnung."}, {"id": 1102, "start": 7381.22, "end": 7395.22, "text": "Power of Will, genau, ja, ja."}, {"id": 1103, "start": 7396.22, "end": 7404.22, "text": "Das haben sie ja in Battlefield 5 auch ein bisschen verkackt, ne, das ganze, das ganze Jet-Gameplay."}, {"id": 1104, "start": 7404.22, "end": 7429.22, "text": "Allein schon dadurch, dass du keinen Starten und Landen mehr hast."}, {"id": 1105, "start": 7429.22, "end": 7433.22, "text": "Es gibt keinen Start und Landen in Battlefield 5, nee, gibt's nicht."}, {"id": 1106, "start": 7434.22, "end": 7439.22, "text": "Das Einzige, was es gibt, ist jetzt auf der letzten, auf der letzten Pacific Map gibt es jetzt, vorher gab es das nicht."}, {"id": 1107, "start": 7440.22, "end": 7450.22, "text": "Help, ist die Samsung 970 EVO Plus gut? Naja, also ich hab hier eine Samsung 970 EVO, dann, die ist okay, die ist gut, da vermute ich mal, dass die Plus auch gut ist."}, {"id": 1108, "start": 7451.22, "end": 7454.22, "text": "Was ist denn der Unterschied zwischen EVO und EVO Plus?"}, {"id": 1109, "start": 7454.22, "end": 7459.22, "text": "Vielleicht ist es auch Apple-Logik, dass Plus schlechter ist als ohne Plus."}, {"id": 1110, "start": 7460.22, "end": 7471.22, "text": "Corsair, Moment, der Name erinnert mich daran, dass ich noch was deinstallieren wollte."}, {"id": 1111, "start": 7471.22, "end": 7484.22, "text": "Kann ich jetzt aber hier gar nicht."}, {"id": 1112, "start": 7485.22, "end": 7490.22, "text": "Oh, das wäre nice gewesen, wenn er das noch hittet."}, {"id": 1113, "start": 7490.22, "end": 7501.22, "text": "Nee, Corsair RGB von der Tastatur, ja, aber ich hab ja keine Corsair Tastatur mehr, deswegen müsste ich das mal löschen."}, {"id": 1114, "start": 7501.22, "end": 7519.22, "text": "Oh, der war nice, der war cool."}, {"id": 1115, "start": 7519.22, "end": 7534.22, "text": "Hele ist OP, change my mind."}, {"id": 1116, "start": 7549.22, "end": 7554.22, "text": "No shit, da wäre jetzt nicht drauf gekommen."}, {"id": 1117, "start": 7555.22, "end": 7562.22, "text": "Oh, da wurd ich immer, da wurd ich immer angeschissen, wenn ich Battlefield-Gameplays gebracht hab."}, {"id": 1118, "start": 7563.22, "end": 7567.22, "text": "Max, warum gewilfst du nicht? Max, warum trägst du Gameplays von Leuten, die nicht richtig reviven?"}, {"id": 1119, "start": 7567.22, "end": 7584.22, "text": "Der hat keinen Bock zu reviven, der will die Gegner wegspringen."}, {"id": 1120, "start": 7585.22, "end": 7593.22, "text": "Der letzte war geil."}, {"id": 1121, "start": 7593.22, "end": 7617.22, "text": "Pocko, ja."}, {"id": 1122, "start": 7617.22, "end": 7624.22, "text": "So was, so ein Crab geht halt nur in Battlefield 3 und 4."}, {"id": 1123, "start": 7625.22, "end": 7631.22, "text": "Das kannst du einfach vergessen."}, {"id": 1124, "start": 7632.22, "end": 7634.22, "text": "Vor allem 2% Leben."}, {"id": 1125, "start": 7634.22, "end": 7647.22, "text": "Das kommt erst mal. Ist das ein Eurofighter?"}, {"id": 1126, "start": 7648.22, "end": 7654.22, "text": "Das ist Glück, das ist huge Glück, das ist einfach nur Glück, aber trotzdem geil anzusehen."}, {"id": 1127, "start": 7654.22, "end": 7681.22, "text": "Das ist nicht Impress, das ist Glück. Das ist nicht, dass der in irgendeiner Art und Weise das prediktet hätte."}, {"id": 1128, "start": 7681.22, "end": 7688.22, "text": "Ha, net niemals, also never, never. Es ist geil zu sehen, aber da kann man nicht davon sprechen, so nach dem Motto, das hat er geaimt."}, {"id": 1129, "start": 7689.22, "end": 7695.22, "text": "Der hat einfach in die Richtung geschossen, wo er vermutet, da könnte was kommen aus der Ecke und dann ist er reingeflogen."}, {"id": 1130, "start": 7696.22, "end": 7698.22, "text": "Das ist, nee, nee, nee."}, {"id": 1131, "start": 7699.22, "end": 7707.22, "text": "Die Musik im Hintergrund."}, {"id": 1132, "start": 7707.22, "end": 7715.22, "text": "Moment mal, das hat mit prediktet nichts zu tun. Prediktet ist, ich sehe einen Gegner und predikte, wo der hinmuft."}, {"id": 1133, "start": 7716.22, "end": 7724.22, "text": "Das war ja, ich predikte, es kommt eventuell aus dieser Richtung irgendwas, was ich jetzt noch nicht mal sehen kann und schieße da mal auf gut Glück hin."}, {"id": 1134, "start": 7725.22, "end": 7735.22, "text": "Aber das ist schon ein Unterschied."}, {"id": 1135, "start": 7735.22, "end": 7741.22, "text": "Backrage. Oh, schöne Headshots. Oder auch nicht. Bam."}, {"id": 1136, "start": 7742.22, "end": 7744.22, "text": "Und erst noch mal schön mit dem Defi in your face."}, {"id": 1137, "start": 7745.22, "end": 7751.22, "text": "Richtiges 3-Head-Gegner, ja."}, {"id": 1138, "start": 7752.22, "end": 7761.22, "text": "Die Gegner sind wieder so unglaublich hintot."}, {"id": 1139, "start": 7761.22, "end": 7788.22, "text": "Die Weihnachtsnoups. Ich glaube, in Battlefield 4 gibt es keine Weihnachtsnoups mehr, das Game ist zu alt. Das sind einfach richtige, echte, echte Noups."}, {"id": 1140, "start": 7788.22, "end": 7798.22, "text": "Warum gibt es überhaupt noch so viele Noups in alten Battlefield-Games?"}, {"id": 1141, "start": 7799.22, "end": 7809.22, "text": "Ich dachte, Noups spielen das neueste."}, {"id": 1142, "start": 7809.22, "end": 7821.22, "text": "Mit Role-Spieler. Wobei Battlefield ist halt auch so ein Ding, da kann jeder mal doof aussehen."}, {"id": 1143, "start": 7822.22, "end": 7826.22, "text": "Battlefield kommt immer auch ganz entscheidend darauf an, wie gut das eigene Team drückt und sowas."}, {"id": 1144, "start": 7827.22, "end": 7836.22, "text": "Also sprich, du kannst auch als richtig guter Spieler teilweise, wenn das Gegner-Team, dein eigenes Team und dich quasi rausdrückt aus der Position, du kannst auch permanent auf den Sack kriegen."}, {"id": 1145, "start": 7836.22, "end": 7842.22, "text": "Das geht auch. Aber manche von denen sind echt planlos."}, {"id": 1146, "start": 7843.22, "end": 7849.22, "text": "Wenn du Gegner siehst, die an dir vorbeilaufen, quasi dreimal um dich im Kreis und dich nicht attacken, dann weißt du schon, was da los ist."}, {"id": 1147, "start": 7850.22, "end": 7858.22, "text": "Das ist ein Boomer-Alarm, genau."}, {"id": 1148, "start": 7858.22, "end": 7866.22, "text": "Die Musik!"}, {"id": 1149, "start": 7866.22, "end": 7880.22, "text": "Zielen auf Dreiecke!"}, {"id": 1150, "start": 7880.22, "end": 7895.22, "text": "Ich kann Battlefield 3 nicht an Stream spielen, weil dann alle nachjoinen und nichts anderes machen, wie die Games versauen."}, {"id": 1151, "start": 7895.22, "end": 7913.22, "text": "Und es gibt so wenige Surfer, dass man ohne Probleme findet, worauf man ist."}, {"id": 1152, "start": 7913.22, "end": 7928.22, "text": "Was ist mit dem los? Da wird es sehr schlecht bei."}, {"id": 1153, "start": 7928.22, "end": 7949.22, "text": "Das sind halt wieder richtige PP-Gerr-Gegner jetzt."}, {"id": 1154, "start": 7949.22, "end": 7964.22, "text": "Huge Gegner!"}, {"id": 1155, "start": 7965.22, "end": 7971.22, "text": "Max, guck dir mal ein Play an."}, {"id": 1156, "start": 7971.22, "end": 7996.22, "text": "Okay, ich gucke mir da ein Play an. Wehe, das ist irgendein Porn-Pick oder sowas."}, {"id": 1157, "start": 7996.22, "end": 8006.22, "text": "A-E-K, beste. Warum hat er gerade keinen Damage von der Nate gekriegt hinter ihm?"}, {"id": 1158, "start": 8007.22, "end": 8017.22, "text": "Spray, Spray, Spray, Spray, Spray. Der ist da hinten hier, der da, der rechts. Was ein PP-Gerr-Gegner."}, {"id": 1159, "start": 8017.22, "end": 8026.22, "text": "Ich brauche erst mal 30 Sekunden zu checken, dass ein Gegner vor ihm steht."}, {"id": 1160, "start": 8027.22, "end": 8035.22, "text": "Was ist mit dem Gegner los?"}, {"id": 1161, "start": 8035.22, "end": 8050.22, "text": "Hardline!"}, {"id": 1162, "start": 8050.22, "end": 8072.22, "text": "Okay, jetzt gucken wir uns mal den Clip an von MrTommyMXR."}, {"id": 1163, "start": 8072.22, "end": 8081.22, "text": "Okay, es ist Battlefield. Ich habe erst mal auf gut Glück zugemacht, weil ich nicht wusste, was da drin ist in dem Video."}, {"id": 1164, "start": 8082.22, "end": 8089.22, "text": "Okay, Sound gibt es nicht. 4 Sekunden, was könntest du jetzt mit dem Chat Tolles machen? Da ist ja nichts."}, {"id": 1165, "start": 8090.22, "end": 8099.22, "text": "Okay, gucken wir mal."}, {"id": 1166, "start": 8099.22, "end": 8108.22, "text": "What? Hast du den gesehen? Ich sehe den nicht."}, {"id": 1167, "start": 8109.22, "end": 8115.22, "text": "Wo ist er? Ich sehe da keinen Gegner."}, {"id": 1168, "start": 8116.22, "end": 8120.22, "text": "Okay, die Auflösung ist jetzt auch nicht so gut, aber wo ist er?"}, {"id": 1169, "start": 8120.22, "end": 8129.22, "text": "Ach da, hier. Ja, ja, hier, guckt, da."}, {"id": 1170, "start": 8130.22, "end": 8135.22, "text": "Da ist er. Gut, die Auflösung ist jetzt auch nicht die beste, aber man sieht es."}, {"id": 1171, "start": 8136.22, "end": 8145.22, "text": "Da ist er, jawoll. Aber nice. Huge Roadkill."}, {"id": 1172, "start": 8145.22, "end": 8152.22, "text": "Was? Und jetzt guckt ihr zum Kontrast Battlefield 5 an. Okay. Hat er wenigstens Sound?"}, {"id": 1173, "start": 8153.22, "end": 8166.22, "text": "Warum ladet ihr alle Clips ohne Sound hoch? Ach so, ist es ein GIF?"}, {"id": 1174, "start": 8166.22, "end": 8177.22, "text": "Hä? What? Ja, Battlefield. Das ist nicht Battlefield 5, das ist Battlefield 1, oder?"}, {"id": 1175, "start": 8178.22, "end": 8184.22, "text": "Das ist Battlefield 5. Ich kann den nicht auseinanderhalten. Das ist Battlefield 1, oder? Das ist 1."}, {"id": 1176, "start": 8184.22, "end": 8205.22, "text": "5? Ah, das sieht alles so gleich aus. Das ist geil."}, {"id": 1177, "start": 8206.22, "end": 8210.22, "text": "Das ist kacke, Alter. So, jetzt kommen hier die ganzen User Clips an."}, {"id": 1178, "start": 8210.22, "end": 8215.22, "text": "Oh, guck mal, man kann hier auf HD stellen. Da erkennt man wenigstens mal was."}, {"id": 1179, "start": 8216.22, "end": 8224.22, "text": "Da haben sie doch keinen Sound, oder? Ah, jetzt wird erstmal hier der grasse Flank ausgepackt."}, {"id": 1180, "start": 8225.22, "end": 8229.22, "text": "Huge Big Brain Flank. Eleven Head Flank."}, {"id": 1181, "start": 8230.22, "end": 8235.22, "text": "Der Gegner hat es halt auch richtig drauf gehabt mit dem Treffen."}, {"id": 1182, "start": 8235.22, "end": 8246.22, "text": "Bam. Das ist Battlefield 1. Ja, ja, das erkenne ich jetzt auch gerade."}, {"id": 1183, "start": 8247.22, "end": 8254.22, "text": "Zack. Oh, den hast du nice noch erwischt, ja."}, {"id": 1184, "start": 8254.22, "end": 8264.22, "text": "Wollte der dich gerade Chargen? Sehe ich das richtig? Sehe ich das richtig? Wollte der dich Chargen und ist vorbei gerannt?"}, {"id": 1185, "start": 8264.22, "end": 8290.22, "text": "Guckt euch mal an, wie er vorbeischaut. Schaut mal. Jetzt, jetzt."}, {"id": 1186, "start": 8290.22, "end": 8297.22, "text": "Und dann, das geile ist, der wollte sich ja mit seinem Bayonett ownen und dann melest ihn ihn auch kaputt."}, {"id": 1187, "start": 8298.22, "end": 8304.22, "text": "Ich weiß, dass es schwierig ist, die Chargen, aber ich finde es trotzdem lustig aus."}, {"id": 1188, "start": 8305.22, "end": 8313.22, "text": "Das ist richtig geiler Clip hier. Und noch die Legehennen gemacht."}, {"id": 1189, "start": 8313.22, "end": 8320.22, "text": "Und noch die Legehennen gemacht. Sogar noch hier Objective Play."}, {"id": 1190, "start": 8321.22, "end": 8327.22, "text": "Was, noch ein Battlefield 3 Clip jetzt? Jetzt aber geht es hier aber."}, {"id": 1191, "start": 8328.22, "end": 8338.22, "text": "TV, Missile und Jet. Ja, auch nice. Wobei, so Sachen habe ich schon öfters gesehen."}, {"id": 1192, "start": 8338.22, "end": 8348.22, "text": "So Sachen habe ich schon öfters gesehen."}, {"id": 1193, "start": 8349.22, "end": 8352.22, "text": "Genau, ich mache auch ein Battlefield Top Play Serie."}, {"id": 1194, "start": 8353.22, "end": 8357.22, "text": "Dann sage ich auch einfach jedes Video das gleich und kriege 150.000 Views."}, {"id": 1195, "start": 8358.22, "end": 8362.22, "text": "Noch ein Roadkill, Max. Jetzt kommen mir die ganzen Clips an."}, {"id": 1196, "start": 8362.22, "end": 8372.22, "text": "Gucken wir auch noch mal, noch mal Roadkill."}, {"id": 1197, "start": 8373.22, "end": 8377.22, "text": "What? Moment, Moment, Moment. Das habe ich nicht gecheckt. Das ging zu schnell für mich."}, {"id": 1198, "start": 8378.22, "end": 8381.22, "text": "Ah, da ist er. Ich sehe ihn. Ich sehe ihn. Da schwimmt er."}, {"id": 1199, "start": 8382.22, "end": 8389.22, "text": "Ich dachte man wird automatisch aus dem Heli rausgeworfen, wenn man ins Wasser taucht."}, {"id": 1200, "start": 8389.22, "end": 8405.22, "text": "Flup. Was haben wir hier noch?"}, {"id": 1201, "start": 8406.22, "end": 8411.22, "text": "Moment, bist du im Stacheldraht gespornen oder hat dich jemand gekillt?"}, {"id": 1202, "start": 8411.22, "end": 8418.22, "text": "Du bist im Stacheldraht gestorben, oder?"}, {"id": 1203, "start": 8419.22, "end": 8425.22, "text": "Ach, Instant Headshot. Na gut, das kann passieren. Das kann passieren."}, {"id": 1204, "start": 8425.22, "end": 8443.22, "text": "Das ist ja in Ordnung, dass sich ein Gegner Instant Headshotted."}, {"id": 1205, "start": 8444.22, "end": 8449.22, "text": "Ja, nice Clips, Leute."}, {"id": 1206, "start": 8449.22, "end": 8457.22, "text": "Ich muss aufs Klo. Ich glaube, ich gehe jetzt auf. Ich war gestern 6,5 Stunden on."}, {"id": 1207, "start": 8458.22, "end": 8475.22, "text": "Dann machen wir heute ein bisschen kürzer."}, {"id": 1208, "start": 8475.22, "end": 8484.22, "text": "Also wir sehen uns, Leute."}, {"id": 1209, "start": 8485.22, "end": 8488.22, "text": "Was ist eigentlich aus dem Friseur geworden? Eben geht es gut."}, {"id": 1210, "start": 8488.22, "end": 8504.22, "text": "Wir sehen uns, Leute. Macht's gut. See you."}]}