{"text": "So So Leute, spontan gestriemt, so, ich habe nämlich gerade eine Stunde Sport gemacht, weil schon mal die zweite Runde heute, bald ist nicht mehr Pepo Fett angesagt und eigentlich wollte ich gar nicht streamen, ich habe mir gedacht, komm, lockst du dich mal ein bisschen Perce of Exile ein und grindest immer ein bisschen vor dich hin, aber da habe ich mir gedacht, nee, eigentlich müsstest du auch streamen, deswegen habe ich mir gedacht, ich mache jetzt einfach mal außer der Reihe streamen, wo ich ein bisschen vor mich hin grinde und ein paar Fragen im Chat beantworte, was auch immer, das ist kein stream, richtig, ich spiele nämlich einfach ein bisschen Perce of Exile und ich beantworte ein paar Fragen im Chat, nicht zum Spiel oder auch zum Spiel, wenn ihr wollt, aber ich bin eigentlich nicht wahnsinniger Perce of Exile Pro, alle möglichen Sachen, was ihr wissen wollt, Fachinformatiker, Ausbildung, IT Zeug, Router Konfiguration, was euch einfällt, ist mir vollkommen egal und nebenbei Kreisel grinde ich ein bisschen und spiele jetzt zwei Akte von der Kampagne durch, wohlgemerkt erwarte mich soviel Kampagne, Perce of Exile hat eine Story, die geht mir sonstwo vorbei, die Story ist auch mega schlecht, ich rush einfach durch, dass ich mal im Endgame ankomme, erklär mal Informatik, easy, hab kein Problem, guck dir Watt auf YouTube an, dauert 5 Minuten, so, nachdem ich die letzte Season nicht gespielt hab, brauch ich so ein bisschen ein Guide, wie man noch mal Act 9 möglichst schnell durchgespielt hat, weil ich keinen Schürmer mehr hab, wie es genau ging. Kannst du löten? Ja, kann ich, wenn wir gerade beim Thema sind, ich kann dir mal eine Lötstation zeigen, das ist eigentlich auch richtig dämlicher Anmachspruch, oder? Ich kann dir mal eine Lötstation zeigen, aber jetzt im wahrsten Sinne des Wortes, ich kann dir mal eine Lötstation zeigen. Das Ding, was ist kleiner, Nano oder Pico? Ich kann mir das nicht merken, das da, die ist super, kann ich empfehlen. Kannst du mir Flussmittel empfehlen? Nö, nee, ehrlich gesagt nicht, ich hab das ganz normale 0815 Lötzin, was Zinn, Blei und Flussmittel in einem ist. Ich habe mir mal vor einem Jahr oder so, für kleine SMD Teile, hab ich mir so eine Paste gekauft, das ist quasi so ein Gel, das schmiert man drauf. Warte mal, Lötpaste, wie heißt denn das? Ja, so was in der Richtung. So was in der Richtung war das, ich weiß nicht mal, wie das genau hieß, was ich mir geholt hab, das ist im Prinzip eine Paste, so eine Flussmittel, Harz, was auch immer, Paste mit Zinnkugeln drinne und damit kann man quasi die SMD Teile, also SMD sind diese kleinen, sind surface mounted, also das was ihr habt, das sowie normale Boards heutzutage aussehen, also sprich hier, das sind SMD Bauteile, so was hier und die fixiert man einfach mit dieser, mit so einer Paste, mit so einer Paste auf dem Board und dann kann man sich überlegen, ob man das zum Beispiel mit einem Heißluftgebläse quasi festmacht, das ist ganz gut, aber ich kann dir kein spezielles empfehlen, weil ich das noch nicht verwendet hab. Als Lötzin hab ich wirklich das ganz, das ganz billige hier Lötzin 10 Meter Rolle, keine Ahnung, so was ganz billiges, ja. Man kann es in den Backofen stellen, ja das stimmt, allerdings ist, ist sowas hier, sowas hier besser als Backofen. Jaja Lötzin würd ich das, 0815 Noob Lötzin, also quasi Zinn, Pley und Flussmittel in einem, ja das lässt sich viel besser löten, ich hatte mal die Ehre, weil ich nicht geguckt hab, also Pley-freies Lötzin zu kaufen, das fließt nicht richtig, das braucht höhere Temperaturen, das ist eklig. Also das für normalen Heimgebrauch, das normale Lötzin ist am besten. Das mit Pley, Zinn und Zeug halt, ne. So ich lock mich mal ein, ich weiß gar nicht wo ich genau aufgehört hab. Hast du dir mal funktionale Programmierungen Haskell angeschaut, ein bisschen eher lang, gezwungenermaßen, by the way ich muss mal gucken, dass es nicht zu laut ist. Ich glaub ich hab das Game zu laut gestellt, mal kurz gucken. Ne geht da eigentlich, oder? Da ist ok. Joa, also hast du dir mal, ich mach mal kurz hier den Chat auf, dass ich dann hier, dass wenn ich mich, wenn ich hier was vorlese da ich dann hier zeigen kann. Also Haskell, ne, nur mal in Not getrunken, ein bisschen eher lang, weil wir eine Software hatten, die eher lang programmiert ist, aber nicht wirklich, ne, ne, hab ich keine großartige Ahnung von. Der User 32DLL sagt, ich muss bald in meiner Ausbildung ein Jahr im Support arbeiten, irgendwelche Tipps, in welchem Support muss zu arbeiten. Also wie gesagt, ich spiel nebenbei einfach ein bisschen die Kampagne weiter, wenn ihr was wissen wollt, haut einfach irgendwelche Fragen raus. Wenn das Game zu, wenn das Game zu laut ist, dann kann ich ein bisschen leiser machen. Ich rush jetzt einfach durch die letzten zwei Akte durch, dass ich endlich mal Endgame anfangen kann. Exzellent. Ich brauch neue Boots. Ja, welch, in was für einem Support musst du arbeiten? Hotline oder In-House, irgendwelche PCs anschließen oder so. Also Hotline kann ich dir nicht wirklich was raten, das hab ich nie gemacht, da hab ich immer einen riesen Bogen drum gemacht. Hast du Ahnung, von RGB-Lüftern Corsair RGB hab? Nö. Ich hab mal eine Corsair Tastatur und ich fand die Corsair, also die Bedienung dieser Corsair RGB Software so grausam, dass ich jetzt eine andere Tastatur hab. Aber es lag nicht an der RGB Software, es lag an anderen Problemen bei der Tastatur. Ich mach mal kurz nen Ticken leiser. Das ist schon sehr repetiv, repetativ, repetiv, wie auch immer man das genau sagt. Bekomme mein Lüfter nicht gesteuert. Ich wusste gar nicht, dass Corsair extra, was? Corsair RGB-Lüfter, die haben extra RGB-Lüfter? Oh, wow. Die wollen mich bashen, Alter. Was ist hier los? Ich lass mich nicht bashen. Huge aim. Es gibt ernsthaft Corsair Lüfter, die sich RGB, what the fuck? Ja, hab ich schon nie gesehen. Ehrlich gesagt, keine Ahnung, wie man die steuert. Machen die, encoden die das irgendwie übers PWM-Signal oder was? Und außerdem, warum ist das so krass teuer? What the fuck? Alter, ist das teuer. 130 Euro für drei Lüfter. Ist das irgendwie mit Diamantkugellager oder was? IQ. Da sind neben dem PWM-Stecker extra RGB-Stecker drin. Also ich find richtig big brain wäre es, wenn die das irgendwie modulieren würden über das PWM-Signal. Also quasi über das PWM-Signal noch irgendwie so ein bisschen Daten rüber senden können. Das wäre doch exzellent. Ohne extra Kabel. Mit extra Kabel kann doch jeder. Nee, aber woran das liegen kann, dass du deinen RGB-Lüfter nicht steuern kannst, weiß ich nicht. Ich weiß nur, dass ich diese... Quatsch, da sind wir ja schon. Ich weiß nur, dass ich diese RGB-Steuerung von Corsair ganz grausam fand. Kein Twitch-POE-Aufwelle. Hey, das ist der erste Char dieses Seasons und ich hab noch nicht mal die Kampagne durchgespielt. Also da gibt's nicht wirklich viel an Gier zu sehen. So, und es ist halt schon drei Monate her oder so, wo ich, nee, vier oder fünf Monate, keine Ahnung, wo ich die letzten paar Akte gespielt hab. Ich weiß nicht mehr, wo ich hin muss, deswegen guck ich mir nebenbei einfach hier die... Enter Descent and head straight up. Descent via Supply. Ach, der Kram ist das. Okay, dann weiß ich jetzt wieder, was ich machen muss. Dann weiß ich jetzt wieder, was ich machen muss. Wobei so schlecht abführt, anfangs ist der gar nicht. Der ist eigentlich ganz okay. Crap. Crap. Kann man alles sellen. Aber ich sell später alles auf einmal. Ich hab übrigens richtig Glück gehabt, ne? Ich hab, ich glaub in Act 3 hab ich gleich mal ein Enlightened Support-Gem getroppt, das ist 22 Chaos Orbs wert. Also sprich, ich kann mir von dem einen Drop schon Early Endgame-Ausrüstung einfach mal kaufen, ohne dass ich selbst was machen muss. Wenn du nicht Blood Aqueducts farmen willst, dann rufst du durch jede Zone, nimmst aber Desert jedes Juni bis zu Minen. Also ich kann mich noch ungefähr dran erinnern. Ich muss jetzt in die Wüste, dann muss ich diese komischen Pantheon-Dinger noch killen für die Skillpoints. Und dann die Story einfach abschließen und fertig. Ich kann mich nicht mehr so lange erinnern, das ist drei Monate her. Und davor hab ich jahrelang nicht gespielt. Die ersten paar Akte krieg ich noch aus dem Kopf zusammen. Übrigens, by the way, ne? Weil mich gestern jemand gefragt hat mit Passive Building. Ich bin ja in dem Game jetzt auch noch relativ nubelig. Ich hab mir einfach ein gutes Bild rausgesucht und hab das in Passive Building nachgebaut und das geht einfach, es ist einfach Easy Mode. Ich drücke einfach rechtsklick alles stirbt. Easy as fuck. Moment. User32DLL sagt, Moment ich kann das jetzt mal einplenden. Inhouse support, inhouse IT support ist ne große Firma wo ich in der Zentrale arbeite. Ist dann mit Ticket-System, mit CS reparieren, Drucker. Oh Gott. Puh. Ja da hab ich leider keine guten Tipps für. Ähm. Lass mal überlegen, was könnte ich, mir konnten euch nicht sterben, was könnte ich, was gibt, was könnte man da für Tipps geben? Was könnte man da für Tipps geben? Also ich musste das zum Glück nie machen. Vielleicht, dass man sich nicht so voll schwätzen lassen sollte von irgendwelchen Usern. Weil User neigen dazu zu denken sie wissen was Sache ist, aber sie wissen es in der Regel nicht. Das ist jetzt aber so universell. Ich mein jeder kennt's. Ihr verwendet YouTube, ihr spielt Pass of Exile was auch immer und ihr sagt euch an jeder Ecke, Alter warum haben die das so dumm gemacht, das wäre doch total einfach das besser zu machen. Und ähm dann ist man in dem Fall User und meint zu wissen man weiß wie es geht hat aber ehrlich gesagt von den Hintergründen keine Ahnung warum es so ist. Im Falle von YouTube vermute ich aber allerdings was anderes. Im Falle von YouTube vermute ich, dass die YouTube UI Typen einfach unfähig sind. Wobei ich mir das nicht vorstellen kann, man würde jetzt eigentlich vermuten das sollten die besten sein die es auf der Welt so gibt oder mit die besten aber irgendwie sind sie es nicht. Irgendwas auch nicht. Schonmal Crimdon John gespielt, nee. Crimdon hat mich abgeschreckt das es kein Online Modus hat. Also kein Online Modus mit quasi Closed Online Servern oder ist das mittlerweile anders. Ah jetzt kann ich mich wieder dran erinnern. Ich muss jetzt hier weiter rennen bis ich an so einer Barriere ankomme glaube. Bis ich an so einer Barriere ankomme. Jaja ich erinnere mich dunkel noch. Ja. Genau das hat mich an Crimdon ein bisschen abgeschreckt das es keine Closed Online Server hat und wenn ich online spiele will ich Closed Online Server haben. Nicht das die Leute sich irgendwelche Items offline cheaten und dann online alles wegownen oder sowas. Doof. Das ist blöd. Ja End of Function Zero ich meinte jetzt eigentlich so eher die Kombination aus Frontend Entwicklern und Designern also. Bei YouTube ist es halt mittlerweile echt wir. Ich kann verstehen warum sie die ursprünglichen Kanäle abgeschafft haben wie sie waren. Du ich weiß gar nicht. Kennt einer von euch noch die YouTube Channels von 2010. Kann sich da noch jemand dran erinnern. Da konntest du die Sidebar konntest du customisern das Banner customisern. Die rechte Sidebar customisern konntest 5-6 Sachen auf diesem auf deinem Channel customisern. Das war richtig nice inklusive links und alle möglichen. Ja. Richtig richtig cool. Und das haben sie dann abgeschafft das kann konnte ich verstehen weil sie gesagt haben ok Smartphone wird immer wichtiger und sie wollten halt nicht alles doppelt und dreifach entwickeln müssen weil das sah halt auf dem Smartphone kacke aus das Layout. Das konnte ich verstehen. Allerdings was ich nicht verstehen konnte war das hin und her was sie mit Google Plus gemacht haben und das heute die Set. Ok das bringt ein paar Fusings. Und was ich heute was ich auch nicht verstehen kann ist. Das so wie es heute ist dass du auf YouTube Settings hast dass du im YouTube Account Settings hast dass du im Kanal Center Settings hast dass du im Studio Settings hast dass du extern auf Google also von YouTube runter den Google Account Settings hast. Also da blickt wirklich keiner mehr durch. Video Antworten das war auch cool ja. Und was ich ja persönlich immer noch ein bisschen vermisse. Was ich ja noch ein bisschen vermisse immer noch auf YouTube ist das Private Message System. Das Private Message System war echt geil. Die Annotations ja die Annotations waren auch ganz nützlich. Was ich persönlich auch schade finde was sie jetzt abgeschafft hat ist den YouTube Editor. Oh fuck nicht Stärme. Der Editor der war an sich jetzt nicht super geil oder so aber das Coole am Editor war man konnte wenn man was hochgeladen hat beispielsweise wenn man was hochgeladen hat wenn man ein Unboxing oder so hochgeladen hat und hat aus Versehen auf einem Zettel noch seine Anschrift gehabt dann konnte man das kurz im YouTube Editor anklicken die die 5 Sekunden rausschneiden und direkt wieder rendern lassen ohne neu hochzuladen. Das war echt praktisch. Und das ist halt Müll jetzt. So genau jetzt muss man irgendwie hier hin und dann zurück in die Stadt wenn ich das richtig in Erinnerung habe. Muss jetzt irgendwie mit dem Typ reden. Ne mit dem Typ musste man nicht reden. Leute warum kriege ich keine Quests rechts angezeigt. Wo ist meine Questanzeige. Kann man die ausblenden habe ich das irgendwie jetzt verdrückt wo ist meine Questanzeige. Das kann man überhaupt nicht ausblenden oder. Das kann man auch gar nicht ausblenden. Alter das ist übelster Crap alles. Das ist auch übelster Crap. Noch mehr Crap. Das ist auch Crap. Aber wo sind meine Questanzeige denn. Warum ist die Questanzeige weg. Verstehe. Jetzt ist. Moment ich bin verwirrt. Was muss ich nochmal machen. Ok warte mal ich muss doch nochmal in die Guide gucken das ist zu lange her da ich das gemacht habe. Das habe ich gemacht. Defeat. Speak habe ich gemacht. Achso da muss ich noch mit dem anderen Typ in der Stadt reden. Ok. Und dann wieder hin. Excellent Quest. Excellent. So und jetzt muss ich wieder zurück na. Ja genau ja ja habe ich. Ah jetzt genau. So und was war jetzt als nächstes. Jetzt muss ich dieses dieses Sanddingen killen. Also die ersten 5 Acts kriege ich komplett ohne irgendwie eine Guide zu gucken hin. Das ist total simpel. Weil ich. Den kann ich mir irgendwie besser merken aber die letzten Acts habe ich jetzt schon so lange nicht mal gemacht. Foothills brauche ich. Oh was ist das. Was ich ja in Persow Exile echt nice finde ist. Dass irgendwie jedes Season ist ein anderes Bild fortem. Sandpit kann ich Sandpit nicht den Boss jetzt schon machen. Doch oder. Da muss ich ich muss jetzt nicht Foothills ich kann schon Sandpit den Boss machen. Oh Alter da macht er Damage. Macht er so viel Damage. Lull. Ach genau jetzt muss man ja hinterher rennen. Der Boss war übelst Resident Sleeper da konnte überhaupt nichts. Und ich glaube man musste alle Skorpione killen weil er sonst nicht weiter läuft. Residen Sleeper Boss. Gut ich meine ich mache auch OP Damage. Was will der machen. Angeblich ist das Bild Endgame mäßig. Ziemlich. Ressourcen intensiv. Also weil es so viele Effekte hat. Alter. Alter jetzt ist er Skorpion. Ist er gut hier. Ist das Chaos ist das Chaos Damage. Ich habe Scheiß Chaos Resis. Was Akt 6 ist ein Schlauch. Es ist alles. Eigentlich mein Problem mit den letzten zwei Akten ist nur dass ich die so selten gemacht habe bzw. dass es noch so lange her ist. Da ich mich da nicht mehr dran erinnern kann. Die anderen sind nicht. Eigentlich ist die Kampagne übelst kurz. Also wenn man einfach nur durch rennt. Ich habe mir ja ein paar Speedruns schonmal angeguckt. Die meisten rennen durch das komplette Game durch. Dann Farmen die hier anfangen. Anfang dieses Actes wird ein bisschen gefarbt ein paar Level und dann wird wieder durch gerannt. Ich weiß nicht was der Weltrekord ist für die Kampagne. 2,5 Stunden oder so wahrscheinlich. Bis Akt 10. 2,5 Stunden 3 Stunden oder so. Keine Ahnung was der Weltrekord ist. Kann er jetzt mal stehen bleiben ich will ihn killen. Easy. Auf extra here mal ein bisschen schneller. Saug sie aus. So talk die was. Reduced Chaos Damage. Das ist gut das nehmen wir mal. Wie es die Leute selbst time outen. Eigentlich die sinnloseste Funktion er war. Aber irgendwie machen es trotzdem genug. Ja was ich an dem Game halt wirklich nice finde warum ich es auch immer mal wieder spiele jetzt. Schon seit einer Weile ist. Es ist jede Season ist irgendwie was anderes angesagt. Von davor habe ich irgendwie. Aber ich spiele immer nur Noob Builds. Es sind immer nur Kack Noob Builds. Ich gucke mir das vorher im Forum im Streams auf Reddit sonst wo an. Was die aktuellen Noob Builds sind. Und dann spiele ich nur Noob Builds. Easy Mode Builds spiele ich immer nur. Vorletzte Season das Necromancer Build war auch übelst Noob Build. Einfach ein paar Zombies casten und quer über die Map rennen und gut war. Das könnte ich jetzt eigentlich auch schon machen klar. Ach nee das kommt erst noch. Wie geht es denn hier lang. Die Level Generierung die Random Level Generierung ist manchmal komisch. Ich habe das Gefühl man kann man kann eigentlich kaum falsch laufen so doof es klingt. Wenn man die Map einfach nur lang genug abläuft in eine Richtung habe ich das Gefühl spawnt der Ausgang automatisch immer. Das ist gerade bei diesen riesen Dungeon Levels ist das finde ich ziemlich kommt einem zumindest so vor. Man läuft einfach die ganze Zeit in eine Richtung und irgendwann spawnt der Ausgang. Also so als würde die Map nicht beim Betreten komplett generiert sondern als würde die Map on the fly generiert. Aber das stimmt wahrscheinlich nicht. Das wäre irgendwie beknackt aber kommt mir irgendwie so vor. Gibt es aber bestimmt schon 30 Milliarden Analysen zu. Okay so viel zu man kann sich nicht verlaufen. Wo ist denn der Ausgang hier. Foothills muss ich. Wo ist hier Foothills wo geht es hier lang. Ist hier erstmal alles schreddern. Ach nee die hier oben muss ich killen. Das war doch auch das ist doch auch irgendeine Leak Mechanic hier. Das habe ich bis heute nicht gecheckt wie das funktioniert. Das ist eines der 30 Milliarden Passive Exile End Game Mechanics die ich nicht checke. Au wow Monka. Okay vielleicht sollte man nicht so viel stehen bleiben. Wow ich habe meine spells nicht gestartet. Moment. Ach man muss die Wand kaputt machen. Und dann rein und innen die Baschen oder. Okay was auch immer. Ich musste die Mechanics letzte Leak nicht machen weil ich hatte einfach meine Zombies die haben alles gekillt. Muss ich denn jetzt hier machen überhaupt. Ich musste hier unten die Baschen. What the fuck warum machen die so viel Damage. Okay vielleicht sollte man sich mal lieber bewegen. So und da habe ich keinen Plastenschimmer was ich hier machen muss. Ich habe keinen Plan. Das ist irgendwie so eine Art Kartenspiel oder so. Wo man Items bekommen kann wenn man es richtig macht. Ich habe keinen Plastenschimmer wie es funktioniert. Null Plan. Absolut Null Plan. Absolut keine Ahnung was ich da mache. Sucked. Sucked. Bini Inni Bitor ich spiele trotzdem Noob Spellslinger im Bild. Weißt du was das Noob Bild ist weil alle überall rumheulen dass das OP ist. Und dass das wohl genervt wird. Macht das immer so. League davor habe ich nicht gespielt und die League davor habe ich das größte Noob Necromancer Bild ever gespielt. Ach Quatsch Moment. Sag mal. Bin ich jetzt blöd. Wo geht es denn hier raus. Wo geht es denn hier raus. Wird doch da. Ah Moment ich muss was Tiri Desert und gar nicht Oasis ach so. Ich bin im falschen Gebiet. Alter RIP. Sag mir das doch mal einer. Total sinnlos jetzt hier die Map geklärt den Ausgang gesucht dabei ist er gar nicht hier. Hier Foothills. Wo sind die Foothills. Wie gesagt ich habe mal einen Speedrun angeguckt und ich weiß nicht wo der Weltrekord ist aber die sind übelst krass drauf. Speedruns muss man sagen das ist hier eine Sache das wird sogar vom Hersteller gefördert das gibt ab und zu mal so offizielle Time Attack Leaks. Ah hier muss ich lang. Genau und jetzt muss ich Boiling Lake. Upper Riot Part. Exzellent. Upper Riot Part. Guck mal tropfen schon die ersten Maps. Es gibt sich am letzten so eine ich glaube von Masset war das sogar auf Twitch habe ich die hatten die hatten so ein Speedrun. Speedrun League Event über drei Tage mit verschiedenen Goals was weiß ich irgendwie bis zum ersten Boss dreimal hintereinander dann irgendwie bis zum ersten bis zur Hälfte der Kampagne und sowas und die Leute sind abgegangen Alter sag ich euch die haben das die haben das gefühlt die haben die können das Blindfolded spielen. Wo ist eigentlich meine Quest Anzeige? Also ich weiß was ich machen muss ich muss dieses eine Viech killen. Wo ist meine Quest Anzeige hin? Nein nein nein nein nein. Ich hab die immer rechts gehabt die Quest und außerdem wenn ich die weg mache sind die auch nicht da. Hab ich die aus Versehen ausgeblendet irgendwie vorhand? Ich muss mal gucken ich glaube ich hab meine Quest Anzeige aus Versehen ausgeblendet. Muss gleich mal in den Settings schauen wenn ich den Schritt hier fertig hab. Aber ich clear das mal mal gucken wo ich ich hab's irgendwie aus Versehen hab ich die Quest Anzeige ausgeblendet. Options. Wo kann man das überhaupt einstellen UI? Aha okay schon viel besser. Schon viel besser. Jetzt weiß ich wenigstens was ich machen muss. Dann hätte ich vorher auch nicht ewig eine Zone abgecrimet weil da hätte ich gesehen wo ich hin muss. Exzellent. Wo ist der kack Boss? Was sind Boss-Baschen? Hab ich den übersehen? Yo Max was ist das für ein Skill auf deinem Coo? Irgendein Enduring Cry? Das tauntet Gegner aber das gibt einen Massive Boost was Life Rack angeht. Hä? Sag mal wo ist denn der Boss? Kill the Basilisk. Oben rechts. Ja ich war ja oben rechts bis er am Map rannt. Hab ich den übersehen? Wtf? Er hat dran vorbei gerannt irgendwie. Bin da oben rechts. Hä? Lul. Weiter rechts. Ah kommen wir da Sachen her. Komm mal nen riesen Kackhaufen. Jetzt schreckt Boss. Oh was soll das? Versteinerungstelz. Ich glaub es geht los hier. Ok sehr gut fertig. Wtf? Wtf? Warum haben die grad 5x das gleiche? Das kann doch nicht sein das ist doch. Ok ich guck mir die Tropfs gar nicht an ich schmeiß die immer in Dumpfordner rein und gut ist guck ich mir später an. Weil aktuell mach ich eh so viel Damage das hat überhaupt keinen Sinn da irgendwie was am Gear zu ändern. Wtf? Moment das kann doch nicht sein das die alles das gleiche gedroppt haben. Es sind aber unterschiedliches Gear. Ok das ist entweder der größte Zufall ever oder das ist diese Mirror Geschichte. Also sprich es gibt sowas das wenn eine Sache tropft dann tropft automatisch ne zweite Sache auch noch. Ok das können wir verkaufen weil dafür. Ah ein Skillbuch sehr gut. Weil dafür gibts Fusings. So was müssen wir als nächstes skillen. Das haben wir geskillt. Ich glaub die Life Nodes müssen wir skillen hier unten. Genug Leben kann man immer also man kann nie genug Leben haben in dem Game. Also alles hier komplett. Ok exellent machen wir. Increase. Enemys cannot leech life from you. 8% increase maximum life. Ok alles klar. Wenn mirrored ist steht das immer dabei. Ja genau und wenns mirrored ist sind die Items auch gespiegelt. Dann ist das einmal die Schuhe so rum einmal die Schuhe so rum. Was muss ich jetzt als nächstes eigentlich machen. Foothills. Foothills. Ich hab Hunger. Foothills und dann enter the tunnel. Tunnel ist glaub oben irgendwo. Durch den Berg. Ach Rick das hab ich mich schon gefragt wie das funktioniert weil ich hab das im stream gesehen. Kleiner Tipp du kannst den Walkway auf linksklick binden dann verwendest du den automatisch wenn du rum bist. Ich hab mich nämlich schon gewundert wie die das hier im stream teilweise machen. Das die quasi permanent beim laufen. Ich dachte ich dachte schon die haben im Hintergrund irgendwelche Makros an oder so. Haben sie aber gar nicht. Ich hab schon gleich hier Hexor vermutet aber sind sie gar nicht. Alter der ingame chat ich lese den ingame chat gar nicht. Leute der ingame chat ist hardcore pepega. Ich blende den jetzt aus. Alter ich schwör meine maps sind leer. Ich glaube ich komme. Der ingame chat ist massive pepega. Richtig hängen geblieben. Das ist wirklich mein huge brain. Die Gegner die Leute im chat sind absolut low brain. Warum bin ich überhaupt im deutschen chat drinne. Ich geh da jetzt raus. Dead left the dude ist am start. Hier der tunnel. Ah ok. Oh ich muss noch Labyrinth stealth machen stimmt. Ich kanns vergessen das machen wir gleich noch wenn wir das hier fertig haben. Äh Moment wie lief man noch mal chat global. Wobei einfach chat ausmachen. Oder chat. Frage an den twitch chat soll ich zur entertainment zweck in den chat anlassen. Weil da ist halt sehr viel low brain geschiss drinne. Oder soll ich ausschalten. Ein paar scrolls kann man gebrauchen. Aber rick das war ein guter tipp. Ich hab mich schon gefragt wie die das im stream machen. Anlassen ist mega witzig. Ich weiß gar nicht warum ich im deutschen chat bin ehrlich gesagt. Normaler weile bin ich im global englischen chat. Und gestern hatten sie da irgendwelche riesen diskussionen über black life matters und haben sich die einen rassismus kommentare die klinke in die hand gegeben. Da ging es dem chat quasi darum wer schafft es noch provokantere sachen zu schreiben. So war halt der global englische chat. Weiß ich was die im deutschen chat machen. Kann man da rüber jumpen. Oh exzellent. Jump soar. Komm mal es will mich schnetzeln aber es kann nicht weil ich zu viel life rack hab. Lull. Lull lull lull lull lull. Exzellent. Und wenn ich hier durch bin. Acquire was journal. Acquire hab ich. Enter query. Quarry. Quarry. War das nicht in mw2 map. Ich enter jetzt quarry. Und dann gehe ich das labyrinth machen. Weil ich bin eigentlich richtig low brain da ich das labyrinth nicht gemacht hab. Ähm meine frage ist mal ich hab ja ein paar leute im chat die ein bisschen plan anscheinend haben noch von dem game. Also deutlich mehr als ich. Lohnt sich das jetzt hier überhaupt die sachen zu craften. Also was ich gemacht hab ich hab ich hab schon mal ein paar low level tiers quasi äh. Entsaftet und in so nen. Vorrats tank gepumpt. Aber meine vorrats tanks sind voll. Lohnt sich das jetzt eher die noch im zweiten vorrats tank dahin zu stellen weil ich brauch keine crafts aktuell. Also ich ich muss gerade nichts craften. Soll ich soll ich den kram jetzt einfach stehen lassen. Keine ahnung ehrlich gesagt. Weil ich kann jetzt zwar die ultra nicen sachen craften. Garten layout von reddit. Exzellent. Wer ich mir angucken. Ja. Ah stimmt. Genau also bevor ich jetzt den kram quasi verschwende dann storage tanks und gedöns. Lohnt sich der kram eigentlich. Dann crafte ich mir storage tanks ja. Ist besser. Ähm kann man das austauschen also kann ich jetzt den da. Wait a minute wo hab ich wo hab ich mein craft da. Ich könnt den doch jetzt dahinter daneben stellen. Hier ab machen. Und da dran machen. Und jetzt könnt ich ja ok passt. Nee. Hä? Und wo ist das Problem. Ah. Ach ich kann das mit mehreren tanks verbinden. Nee. Das verbindet sich immer nur mit einem tank. Das ist mit beiden verbunden aber das kabel geht nur an eins dran. Das kabel das kabel geht doch eindeutig nur hier dran. Ja hats. Ach reicht das wenn das daneben steht oder wie. Ach jetzt ist beides gelingt. Ach so. Ok dann geht das doch einfacher. Genau jetzt kann ich den restlichen kram. Soll ich lieber noch mehr zeug craften oder soll ich kondensen. Ich crafte noch mehr kram hier. Ah excellent. Äh ich solls vielleicht machen. More ks was what is happening. Die dinger sacken doch und es lohnt sich doch in der regel gar nicht aufzuheben. Außer ich hab diesen craft mit dem unic drinnen. Ne brauch ich alles nicht. Storage tank disperser brauchen wir bestimmt auch öfter sicherlich auch noch ein paar tank können wir auch noch craften. Du kannst links posten. Das müsste standardmäßig funktionieren. Darfste darfste auch ja. Excellent. Das war klar ne das schon optimiertes garten layout gibt. Was sonst. Aber das ist ein typisch perso wechsel da gibt es von allem optimierte sachen. Ich hab übrigens die seeds nicht im inf weil ich bescheuert bin. Ich hab die seeds in meiner truhe weil ich nicht geguckt hab. Gabs nach 12 stunden nach release ja das holt mich nicht. Das finde ich im perso wechsel geil da gibt es so viele so viele leute die instant zeug optimisern. Eigentlich richtig nice. Oh. Waren uns gleich wieder zurück in den garten. Das zeug planten. So plant excellent. Volle geplantet. Weiter gehts. Hätte ich mal früher gewusst dass man dass man bis zu vier sachen in so einem pylon anschließen kann. Tier 2 seed. Was ist was zum teufel ist mit dem chat los. Kennt sich wer mit den hunden zack wachsig aus. Die haben echt. Das ist natürlich der ort wo man sowas fragt ist in einem online game im main chat. Da kriegt man immer die besten tips was sowas anbelangt. Also das ist das optimierte garten. Das muss man mal angucken in der hoffnung ich sterbe nicht. Aber selbst wenn passiert ja nichts großartig wenn man stirbt. Sag mal bring ich das durcheinander. Oder hatte perso wechsel bei release. Items die man reparieren musste. Oder bring ich das mit Diablo 3 durcheinander. So 2000 2013 oder so als es rausgekommen ist. Oder bring ich das mit Diablo 3 durcheinander. Was macht ein timeout. Naja es wirft dich kurz raus aus dem chat. So das ist das optimierte garten layout. P ist ein pylon disperser disperser horty crafters. Ah big brain das muss ich das muss ich mir mal garen setup garen layout garen. Exzellent. Das so wow was ist es storage. Die leute sind so krass drauf ey was perso wechsel angeht. Das hast du schon 12 stunden nach release. Ich hab letztens einen gesehen im stream. Der hat gecraftet mit dem garten zeug. Und ich hab überhaupt nicht gecheckt was der macht. Der hat gecraftet und hat gesagt ok jetzt blockier ich jetzt hier den einen prefix drauf und dann kräfte ich mir den anderen prefix. Und ich weiß genau dass es nur zwei prefix zur auswahl gibt. Und danach blockier ich das irgendwie mit einem craft von meinem table. Und dann mach ich irgendwie noch nen extra essence craft wie heißt das andere catalyst craft oder so drauf. Und dann geh ich nochmal in den garten und dann mach ich nen craft drauf. Und dann gibt es nur noch einen mod der auf das item kommen kann. Und das craft ich mir drauf. Und ich hab vor dem stream gesessen und hab einfach nur da gesessen und hab gedacht was? Was macht er? Also es war ein englischer stream deswegen hab ich versucht es halbwegs wiederzugeben. Ich hab keine ahnung gehabt was er macht. Also ich hab's schon verstanden letztendlich was er macht. Aber ich habe nicht die in game mechanics dazu kapiert. Also was ich kapiert habe ist ja du kannst verschiedene sachen blocken auf dem item und wenn du dann craftest dann hast du ne größere chance das zu kriegen was du willst. Und manchmal craftest du gezielt fast was du nicht willst weil du das dann wieder wegcraften kannst und dann hast du die chance quasi sehr hoch dass du das kriegst was du willst und so komische dinger. Das hat schon alles eingeleucht aber es war richtig big brain. Es war excellent. Aber alles in allem muss man sagen man braucht das in dem game nicht unbedingt wenn man noob builds spielt so wie ich. Also wie vor 2 liegt das necromancer zombie build. Ich konnte tier 15 maps machen absolut easy mode. Und ich hab einfach wie verrückt maps gefarbt und hab mir dann recht gutes gear gekauft und fertig durchgespielt. Also das spiel ist nicht schwer in dem sinn. Wenn man allerdings die einzelheiten kapieren will ist das ein hardcore big brain game. Oder wenn man quasi bei dem league start direkt vorne mit dabei sein will oder solche sachen. Das ist ultra big brain dann. So wir machen jetzt das labyrinth. Das hab ich nämlich noch gar nicht gemacht. Also das zweite labyrinth hab ich noch gar nicht gemacht. Also erklärung. Es gibt nämlich die haben sich nämlich gedacht die leute über pass or fax sein haben sich gedacht der skill tree ist noch nicht groß genug. Also chat ich glaub das gefühl verstehen wir alle. Der skill tree der reicht nicht. Der hat zu wenig möglichkeiten. Und deswegen haben die sich gedacht wir müssen noch für jede klasse 3 aufstiegs upgrade trees schaffen. Also sprich jede startklasse hat 3 möglichkeiten. Also beispielsweise wenn man witch spielt kann man einmal hier necro specken. Man kann element damage und occult damage oder irgendwie sowas. Also 3 verschiedene upgrade pfade gibt es da noch. Das ist halt der necromancer upgrade fad und damit man das specken kann muss man durch so ein komisches labyrinth durch. So und das labyrinth muss man 4 mal durchspielen immer ein bisschen schwerer. Ich mach jetzt das zweite. Und das letzte kann man nur durchspielen wenn man in endgame areas 6 dungeons vorher gemacht hat. Also der grind ist real. Ja und das kommt ja auch noch dazu. Es gibt jetzt neue gems die den skill tree erweitern. Also wenn du am rand des skill trees bist und dort was sockelst dann erweitert das den skill tree noch mal. Ich hab schon ein paar skill things. Später gucken was ich dann eigentlich genau sockeln muss. Achja und der quiff bei dem labyrinth ist, dass wenn man stirbt muss man von vorne anfangen. Also das ist quasi die mini hardcore variante. Also sprich wenn man jetzt hier drin stirbt muss ich wieder von vorne anfangen in dem labyrinth. Aber ich bin maßlos overleveled für dieses ding das sollte eigentlich kein problem sein. Ja der echte gl der kennt sich aus wie es aussieht. Ja da gibt es noch mehr. Es gibt so ein endlos dungeon das ist ein bisschen wie rifts in diablo. Ist doch rifts in diablo oder? Und dort gibt es dann auch verschiedene bereiche wo man dann verschiedene, also es gibt dann einen kälte bereich, einen hitze bereich und sonst was. Da hat man dann wieder unterschiedliche chancen verschiedene items zu droppen wenn man es haben will. Oder drops zu bekommen. So und hier sieht man wo wir im labyrinth gerade sind. Das heißt wenn wir hier durch die tür gehen kommen wir in dieses gebiet. Machen wir einfach mal. Da rush ich aber jetzt wirklich nur durch weil es lohnt sich für mich überhaupt nicht hier. Es gibt keine xp richtig. Ich will einfach nur möglichst schnell durch. Oh mokka spikes. Mokka spikes. Lull. Er ist mal durch rennen. Ja ich wollte zu schnell durch. So nächste location. Trial ok. Ich charge immer durch durch die traps. Gerade mit dem instant heal zwischendurch ist kein Ding. So man muss den boss dreimal killen und beim dritten mal hat man es geschafft. Aber das sagt er kann nix. Zum übelsten Kack noob. Ich glaube das labyrinth war mal schwer als es neu war. Und auch das allerletzte labyrinth ist nicht schwer. Vielleicht, vielleicht nicht ist das aber vielleicht erzähle ich auch Mist. Weil das allerletzte labyrinth habe ich halt nur einmal bis jetzt gespielt wo ich mein massive op zombie necro hatte. Kommt man hier vielleicht auch ohne fallen stels durch. Nee man muss fallen stels machen ok. Ich sage ich sprich bei dir eigentlich aus. Ich sage ich sage. Richtiger Kack noob. Big brain. Nee. Moment hier gehts gar nicht weiter. Ah da hinten gehts bestimmt lang he. Ah yes. Exzellent. So. Ohne minimap kann man das game nicht spielen. Izaro. Ach izaro stimmt der sprecher sagt er manchmal. Ja ist recht. Wobei ich mir die Sachen selten anhöre. Ah. Warum muss das labyrinth diesmal so labyrinthig sein. Normalerweise ist das gar nicht so labyrinthig sonst sondern einfach durch rushbar. Nein den kram will ich überhaupt nicht. Ich will einfach nur den ausgang haben. Muss ich jetzt wieder zurück laufen. Ah da unten gehts lang guck mal da unten gehts lang hier. Lockt. Warum ist das locked. Ah weil hebel vergessen zu drücken. Jetzt aber. Moment da war ich doch schon. Moment da unten ist ja auch nix. Wait a minute. Wo gehts denn hier lang. Ich bin verwirrt. Bin ich in der Sackgasse gelandet kann das sein. Aber ich kann nicht in der Sackgasse nach dem Trial gelandet sein. Ach nee da gehts ja weiter. Wenn du ohne plan ein Bild zusammen bastelst. Ja das ist eigentlich das größte Fehler die man in passive exile machen kann. Find ich. Wenn man schon kein Plan von dem Game hat wie ich dann sucht man sich wenigstens ein OP Bild raus und ist glücklich. Aber das unterscheidet den Noob in passive exile vom Noob in online games. Der Noob in online games kommt nicht auf die Idee sich einen Guide durchzulesen und sich ein OP Bild rauszusuchen. Der Noob in passive exile weiß dass er ein Noob ist und sucht sich ein OP Bild raus für easy mode. Oder aber Leute machen es absichtlich. Das ist ja wieder was anderes. Dann weißt du aber dass du es absichtlich machst. Das ist ja was anderes na. Wenn man Builds ausprobiert und das absichtlich machts ja was anderes. Aber es gibt viele Leute die gimpen sich absichtlich. Moment ist das jetzt besser oder schlechter. Ach ne die sacken weil du nur zwei Charges hast. Crap. Oh Sägeplätters. Auch wenn man Plan hat sucht man sich ein Bild raus. Ja es gibt schon ein paar richtige Big Brains hier in dem Game. Die auch gute Builds zusammen basteln. Ich glaube wenn man eine Weile gespielt hat wird man dann. Ich mein so ein 100% neues Build wird man mit halt die Sachen auf seinen Spielstil irgendwie anpassen. Weil man halt weiß was man macht. Ich denke mal dass auch in Path of Exile die Möglichkeiten der richtig guten Skill Kombination beschränkt sind. Dann hast du keine Ahnung 20 30 Sachen die vielleicht spielbar sind im Endgame. Der Rest sind Varianten davon. Oder vielleicht sogar noch weniger und der Rest sind Varianten von. Oh ne jetzt labert er wieder. Oh ne ne ich geh in die andere Richtung ich hab kein Bock auf Labyrinth Stels. Ich will einfach ins nächste Gebiet. Kockier easy. Gut dass wir da unten nicht langgegangen sind. PoE Kreiselkrain so siehts aus. So erstmal die ganzen Müll hier reinschmeißen. Wegdampen. Jetzt mal alles weg. Next. Wieder Noob Boss bashen. Äh Moment was muss ich ins backen. Äh ich muss mal nach. Ich bin mir grad nicht sicher wo ich weitermachen muss im Skilltree. Isarro Noob. Guck mal einer das macht noch immer richtig Damage. Und jetzt ist er schon wieder down. Oder auch fast fast down. Was? Ah der weiß noch nicht dass er down ist. Der muss ja erst noch seine drei Animationen ausführen. So was muss ich jetzt specken als nächstes. Ähm. Ah hier. Da. Live Nodes. Live Nodes muss ich specken. Stimmt. Hier muss ich jetzt lang. Und dann auf Soul of Steel. Exzellent. High IQ Exil Sheet. Was? Das ist High IQ Exil Sheet. Ja. Das ist das optimale Pass of Exile Garden Setup. So wir sind gleich durch. 2 von 3 Bosskämpfen haben wir schon. Diese Prophecy Dinger. Das hab ich auch nur zur Hälfte kapiert. Ähm. Oh Leute ich hab ich muss grad mal was gucken. Wartet mal. Ich glaub ich übersteuere wieder kann das sein? Weil ich hatte Teams an und immer wenn ich Teams an hatte verstellt das mein Mikrofon. Alter. Wo soll ich mir denn erst. Naja E-Girls.gg. Der Ingame Chat ist wieder pepega extrem. Ja. Das muss doch sein. Ingame Chats in MMOs sind immer pepega Chat. Oh wie es schleift. Wie gesagt ich hab gefragt ich soll den Ingame Chat zur Belustigung anlassen hat der Twitch gesagt. Da mach ich das. Ich mach die Chats. Ich mach aber auch in MMOs die Chats nicht aus. Weil ich find die immer lustig. MMO Chats die sind halt so die Leute meinen das da meistens nicht ernst. Die machen das entweder nur zum provozieren oder zum rumtrollen oder halt einfach nur zum Entertainment Faktor und Bullshit labern. Auf Twitter ist es wieder was anderes. Auf Twitter meinen die Leute immer den ganzen Shit ernst den sie schreiben. Deswegen hab ich jetzt auch die Twitter Tags ausgeschaltet. Wenn man nämlich auf Twitter sein Gebiet auf Andorra setzt bekommt man keine Twitter Trends mehr. Und Twitter Trends ist in letzter Zeit das nervigste was es gibt. Ich will keine Twitter Trends mehr. Ich will Twitter verwenden aber ehrlich gesagt würde ich Twitter gerne wieder ganz normal benutzen ohne mir den ganzen Tag die irgendwelche politisch motivierten Ansichten von irgendwelchen Leuten durchlesen zu müssen. Egal von welcher Seite jetzt geht mir alles auf den Sack mittlerweile. Die sollen mal alle wieder normal werden im Kopf. Ja gehen wir da lang. Das ist echt pfeifen. Ja also kann ich euch nur empfehlen stellt euren Twitter Gebiet auf Andorra um zu gehen. Ihr habt keine Twitter Trends mehr. Doch doch es gibt Browser Plugins wo du Twitter filtern kannst aber da hab ich keinen Bock drauf gehabt mir eins rauszusuchen. Ich bin bei Browser Addons mittlerweile ziemlich vorsichtig geworden wenn es nicht riesengroße Browser Addons sind. Weil ich hab einmal mir so fast schon Keylogger eingefangen als Browser Addon. Es gab nämlich ein Addon das hat auf allen Webseiten Twitch Emotes eingeplendet und da dachte ich mir was kann schon schief gehen. Und dieser Typ hat das Addon verkauft an Chinesen und die Chinesen haben dann Keylogger eingebaut. Oder vermutlich einen Keylogger eingebaut nachdem er das Addon verkauft hat. Und Google hat das halt erst ein paar Wochen später gemerkt. Ja und das war halt Fail. Ich mein es hatte keine Auswirkungen zumindest keine die ich gemerkt habe aber trotzdem war es halt ziemlich MonkaS. Guck mal Noob Zaro wird gebashed jetzt. Mit One Shotted. Kack Noob Alter. Zwei Mal draufgegasste Down. Die Auto Updates für Addons unbedingt deaktivieren. Ja außer halt für sowas wie Uplog oder so da ist es ja wichtig dass man Auto Updates macht. So guck mal was es in den Schatztun gibt. Jede Menge To...ok warum nicht. Ist ja fast die Aim Trainer. Halbe Aim Trainer hier. Ok mehr hab ich nicht. So habe ich irgendwas dabei was ich versuchen kann zu zu Enhancen? Clothes or Boots? Eigentlich nicht. Äh kann irgendwas passieren wenn ich die versuche zu Upgrade? Nee oder kann eigentlich nichts passieren. Increase Attack and Cast if you kill. Oh das ist ziemlich gut. Das ist sogar ziemlich gut. Huge Addon. So was speckern wir denn jetzt? Zweites Labyrinth was speckern wir jetzt? Was sagt mein Pass of Building was ich specken...was ich specken will? Das haben wir schon zum Leveln gespeckt und jetzt gehen wir hier rüber auf Minion Damage und ja gut das bringt mir jetzt ehrlich gesagt noch nichts. Das bringt mir erst was wenn ich auf meine Endgame Spells gewechselt hab. Hätte ich mir jetzt auch sparen können. Kann ich nicht irgendwas specken was mir jetzt direkt was bringt? Das bringt halbwegs was. Achja by the way Minion Damage bringt mir was weil ich hab nen Skill das mein Minion Damage konverte zu Damage für mich. Das heißt Minion Damage Minion Damage ist top. Maximum Mana also Mana Probleme hab ich gar keine. Minion Damage Minion Damage. Ich speck jetzt einfach das da. Kann man das Respecken mit nem ganz normalen Respeck Orb oder wie Respeckt man das? Oder muss man nochmal durchs Labyrinth durch und kann dann dort Respecken wie man will. 5 Respeck Points ja gut Respeck Points hab ich genug. Auf der anderen Seite kann ich das erstmal weglassen. Das ist ja nicht so als hätte ich jetzt irgendwie Damage Probleme. Wobei nee Skillen kann ich das nur im Labyrinth ne. Moment was geht ich jetzt? Was mach ich denn hier eigentlich jetzt gerade? Ich klick gerade den Passive Building rum anstatt richtig hängen geblieben. Was war denn jetzt ursprünglich drinnen? Don't save. Was speckt der Dude? Das bringt mir immer überhaupt nix. Voll pepega. Increased Damage. Na gut das ist ok. Increased Skill Effect Minion Steal. Ich skill das und das weil den Kram muss ich später eh skillen. Ich skill die 2 Sachen und beim nächsten Lab ach nee Moment. Komm ich skill jetzt einfach das und gut ist da muss ich nachher nicht Respecken scheiß drauf. Ich hab eh absolut keine Probleme mit Damage. Bist du deine Endgame Gems schon am Level? Teilweise nicht alle nee nee sollte ich wahrscheinlich machen. Aber die Dinger leveln doch so schnell. Die leveln doch so schnell bis zu nem brauchbaren Ding bis zu nem brauchbaren Level oder? Oder mal ganz nachher was hab ich denn vielleicht kauf ich mir die einfach schon auf Level 20? Ich hab ja genug Currency gerade dank DUNK DROP. Der Endgame Chat ist wirklich richtig pepega gerade. Monarch S. Ok wo sind wir denn stehengeblieben? Story. Story mäßig. Was muss ich jetzt als nächstes machen? Das haben wir gemacht Enter Tunnel, Aquaria, Waypoint, Labyrinth. Query haben wir Waypoint. Ah hier. Ok Enter und Explore. Ok also Refinery. Refinery muss ich jetzt. Das ist irgendwo oben. Da kann ich mich doch dran erinnern. Das ist oben auf der Map. Also teilweise level ich mein Endgame Zeug schon weil das was ich jetzt gerade verwende kann ich auch für mein Endgame Kram brauchen. Aber ich sollte mir wirklich. Wobei ich hab gar keinen Platz gerade für meine. Ach stimmt. Ach jetzt genau jetzt weiß ich wieder was du meinst. Man kann ja im zweiten Slot. Im zweiten Slot kann man ja seine Endgame Gears leveln. Stimmt das ist richtig big brain. Da muss ich erstmal gucken was ich eigentlich genau für Endgame Sachen brauch. Oder wie gesagt ich kauf mir die Dinger einfach level 20. Ok was soll ich in der Refinery machen irgendwas killen. Im Zweifelsfall in Path of Exile immer irgendwas killen. Alter kann ich zwar da bleiben. Null. Äh. Ok da unten gehts weiter. P.P. Gegners. Ah gehts weiter. Weil warum hab ich den Kram aufgehoben. Warum zeigt denn das mein Loot Filter eigentlich so Highlighted an wegen Item Level vielleicht. Alter Crap was war ich damit. Ach ich kann mich jetzt wieder erinnern. Genau jetzt muss ich den Boss killen wo so Stromdinger daneben stehen. Ich erinnere mich wie der Dunkel. Hier irgendwo ne. Ja. Auch wieder Kack Loot Boss kann auch nix. Au au au au. Aha Monkeys. Easy easy blocked. Genau. So und jetzt muss ich zurück. Ah da kann ich mich auch noch dran erinnern. Das ist auf der anderen Seite vom Waypoint gewesen. Übrigens die Bros die gehen immer nicht auf Town Portal sondern die quitten zum Characters Select und ähm. Lassen sich so in die Stadt porten. Moment. Muss ich runter. Jetzt muss ich runter irgendwo. Und dann ist der Akt auch schon fertig. Aber erstmal hier nochmal durch. Noch den anderen Boss killen für den Skillpoint. Die einzigen Quests die sich in dem Game lohnen sind Skillpoint Quests. Rest Sackt. Brauchen wir nicht. Wow. Pepega Boss macht Damage. Warum macht Pepega Boss Damage? Muss man ein bisschen sich bewegen. Gut bewegen wir uns halt ein bisschen. Die meisten Boss sind ja wirklich nicht schwierig. Das hat gelackt. Lagos. Oh. Komm jetzt hier. Verrecken. By the way ich hab keine Ahnung von der Path of Exile Story ne. Also falls mich irgendjemand fragen wollt könnt ihr gleich sagen lassen. Ich hab keine Ahnung was eigentlich passiert. So. Saug saug saus. Gib Skillpoint. Excellent. Nur zum Grinden da. Ja so siehts aus. Was juckt was juckt mich die Story. Die Story ist auch echt schlecht. Also das ist ein Punkt da punktet Path of Exile wirklich nicht. Die Story Sackt. Ich hab mir mal so ne Story Zusammenfassungsvideo angeguckt. Also wer das verbrochen hat ey. Ich eh ja hab ich mir anguckt aber ohne Scheiß Elevencore wer die Story verbrochen hat der ist nicht mehr ganz bei Sinn. Das überhaupt Story zu nennen ist ja wirklich lächerlicher. So wer gibt mir jetzt die Skillpoints. Irgendjemand gibt mir noch Skillpoints. Wer gibt mir Skillpoints. Ah. Excellent. Ein Skillpoint. Das ist gar nicht mal schlecht das Schild. Naja. Boots ohne Movement Speed. Das Sackt. Ok. Die haben Movement Speed aber keine anderen guten Stats. All resists aber der Rest ist kacke. Na gut. Machste nix. Kannste immer nur gute Drops haben. So. Muss jetzt noch mit irgendjemand reden dass ich hier irgendwas kriege. Sag mal dieses andere Quest hier. Die andere Quest bringt mir nix Gescheites. Das ist was wo es ein Respec Buch gibt. Ne das brauchen wir nicht. Und by the way eine Sache haben die Path of Exile Entwickler echt gemeistert. Der Stash ne der Stash war nicht schon immer so groß. Ups. Was mach ich denn hier für ein Kack. Da muss ich gar nicht hin. Ich hab mir Pay to Win Stash Tabs gekauft. Aber in einer Sache was ich sagen wollte in einer Sache sind die Path of Exile Entwickler echt gut. Die können wahnsinnig gut recyceln. Die Bosse die wir jetzt hier killen müssen die haben wir schon zweimal vorher gekillt. Oder dreimal vorher sogar schon. Ne dreimal gesehen und zweimal gekillt haben wir die Bosse die jetzt hier kommen vorher schon. Also die können wirklich gut recyceln die Path of Exile Entwickler. Also wer auch immer mir den Tipp gegeben hat mit den Enduring Cry auf linke Maustaste zu legen. Das war Massive Big Brain. Aha neue Seeds. Erstmal hier ein bisschen Vollspeed durchrushen. Das coole an dem Bild ist auch man braucht keine Mana Flasche. Aua. Man braucht keine Mana Flasche und dementsprechend kann man Damage Flasche zweimal Speed Flasche mitnehmen. Am besten natürlich hat die Damage Flasche auch nochmal extra Speed. Man könnte auch 3 Speed Flaschen für die Kampagne mitnehmen. Oh Poggers Boss. Down. F. Ja du hast schon recht Elephant Core. Die übernehmen es nicht die über. Was ist das für ein Layout? Meine Güte. Die übernehmen es nicht komplett aber gerade diese 3 Bosse die jetzt hier kommen die sind schon. Außer das die Farbe sich ein bisschen geändert hat ist an den Fights jetzt nicht so ne große Unterschied. Oh Monkeys. Das war ganz schön viel Damage. Lul. Ja Chaos Damage Resies konnte ich mir noch nicht leisten ja. Mach ich dann wenn ich im Endgame angekommen bin dann kaufe ich mir ein bisschen ordentliches Gear. Ich hatte ja glücklicherweise nen Tropf der ein bisschen was wert ist. Der Ingame Chat. Ja Chat ich lese den Ingame Chat nicht. Kann man mal gebrauchen. Gucken wir mal ob wir da was Gescheites rauskriegen. Ich lese den Ingame Chat nicht. Ich habe den Ingame Chat eigentlich nur zur Belustigung offen. Und solange sie nicht irgendwelches Monkertoss wegschreiben muss ich ihn auch nicht ausblenden. Ach guck mal da gehts ja schon lang hab ich nicht gesehen. Ja in jedem MMO es gibt in jedem MMO so ein paar Chats die besonders pepega sind. In World of Warcraft war das der Prachland Chat. Den kenn sogar ich als jemand der kaum WoW gespielt hat der Prachland Chat. Das war noch die Zeit wo man die Spiele auf Deutsch gespielt hat. Da war das der Prachland Chat. Weiß gar nicht ob sich das jetzt schon lohnt hier. Aber können wir mal machen geht ja schnell. Monker Hack'n Slay. Oh guck mal der hält ein paar Spells aus. Was erlaubt er sich denn jetzt mehrere Spells auszuhalten? Ich glaube Uninstall ist raus. Uninstall ist ausgeführt. Worum es in dem Game geht Gegner baschen, looten, besseres Loot bekommen um besser Gegner baschen zu können und um besseres Loot zu bekommen um wieder mehr Gegner baschen zu können. Ich glaube ich hab das jetzt ganz gut zusammengefasst. Äh hab ich Mobs übersehen? Ah egal. Oh was denn das? Exzellent. Hab ich noch keine. Exzellent. Reduced Charges. Oh das ist gut. Falls man mal. Oh wow wow. Hoh gerade noch mal rechtzeitig Knopf gedrückt da. Ähm kann man richtig wenn man hier Damage kriegt kriegt man ordentlich kann man ordentlich Life Flask spammen hier. Da sind wir richtig. Wo bleibt der Timeout? Du hast angeblich einen Timeout bekommen steht zumindest da. Vielleicht ist es aber auch nur gebaited oder es geht gar nicht. Das ist eigentlich ganz nett für den Anfang. Das schöne ist da können wir noch ein bisschen was draufcraften klar. Ist jetzt nicht so geil. Äh Sucked. Ach jetzt muss ich die Bosse noch mal baschen. Alles klar. Exzellent Boss Bashers. Da rennen wir jetzt mal einfach durch so schnell wir können. Ja und eine Sache muss man auch noch sagen worum es geht. Also ich fang jetzt nicht mit Perce of Exile Story an weil die ist wirklich schlecht. Der Übergang von der Kampagne zum Endgame ist wirklich gut gemacht. Das fängt erstmal ein bisschen leichter an wie es am Ende der Kampagne war und hat aber richtig richtig viel tiefer eigentlich. Wie der Atlas funktioniert am Ende was es für unterschiedliche Maps gibt wie man das ganze zusammen sammeln muss die Atlas Bosse die es zwischendurch gibt. Das Endgame ist wirklich gut durchdacht in dem Spiel. Das macht echt Bock. Guck hier ist wieder der gleiche Boss den wir schon zweimal gekillt haben. Jetzt wollen die auch noch dass ich Mechanics mache. Hier werden keine Mechanics gemacht. Hier werden einfach Attack Move gespammt. Ja Sonnt du bist wieder da. Vielleicht warst du auch nicht weg. Sebaro warum gibt es Timeout Anfragen. Ich dachte die Leute werden gleich Timeoutet. Oh warum kann ich das nicht. Oh mir fehlt Dex. Ich habe zu wenig Dex um das ganze weiter zu leveln. Was aber nicht wirklich schlimm ist weil ich glaube das Game brauche ich später gar nicht mehr. Wo geht es zum Boss. Boss please. Boss please. Wo geht es lang. Ah da. Perfekt. Den Boss haben wir auch schon zweimal gekillt. Schon wieder ein Boss der will dass ich Mechanics mache. Sowas aber auch. Jetzt werden aber keine Mechanics mehr gemacht. Jetzt wird einfach nur Attack Moved. Was. Schon wieder. Jetzt aber. Jetzt schreckt. Sebaro das kann sein dass es nicht funktioniert. Ja ich weiß auch nicht warum. Aber Twitch buggt ja manchmal ein bisschen rum was die Kanalpunkte commands angeht. Kann schon sein dass es kaputt ist. Aber ich sehe es im Chat das Timeout das angeblich getimeoutet wurde. Was in sich heißt das wirklich getimeoutet wurde. Es steht aber da. Twitch big brain. Alter move dich. Ich habe übelst Hunger. Ich muss mir gleich mal was zu essen holen. Dann gucken wir nochmal die in alter Traditionen Barbecue Pit Boys Video und ich esse was dabei. Im letzten Stream haben sich die Leute schon beschwert dass es kein Barbecue Pit Boys Video gab. Und das wollen wir ja nicht hier. Habe ich Gegner vergessen. Ach da. Easy. Das ist kein Auto Timeout ach so. Ich dachte die Timeouten die Leute automatisch. Die ganzen die Sacken die Sacken in der Regel übelst die Unix die man kriegt hier. Da ist nichts gescheit Spy. Absoluter Crap für mich. Und das für mich auch absoluter. Naja so schlecht ist das gar nicht. Aber brauche ich nicht. Auch Crap. Wo ist deine Umfrage? Nutella mit oder ohne Butter. Also ich weiß nicht ob man eine Umfrage machen muss aber ich kann ja was zu Nutella mit und ohne Butter sagen. Wer Nutella mit Butter isst ist eklig. Nutella mit Butter Sackt. Change my mind. Ist ja gut jetzt. Game kriegt schonmal ein. Game wieder Crap Crap Crap Crap. Mit Butter nee das ist doch voll eklig. Nutella ist ist süß und fettig genug. Und wenn du da noch Butter drunter machst dann wirds einfach nur bappig klebrig und eklig. Nee nee nee nee nee. Der Chat hat absolut kein Geschmack aber das ist ja nix neues Chat. Gerade der Twitch Chat ist ja bekannt dafür kein Geschmack so. Und ich dachte mein Twitch Chat ist besser. Hab ich irgendwas vergessen zu killen? Angeblich ist hier was? Ach da. Oh ich Pepega. Nix mitbekommen. War aber knapp. Das war aber knapp. Kommt auf. Oh jetzt sits Big Brain im Chat. Kommt auf die Unterlage an. Auf dem Brötchen definitiv. Ohne aber auf so einem richtigen Vollkornbrot. Wer ist auch schon Vollkornbrot? Ja ok vielleicht. Vielleicht. Ich lass mir's gefallen. Auf manchen Unterlagen mag das noch erträglich sein. Sucked. Sucked extrem. Verkauf ich aber wenn ich schon aufgehoben hab. Ach lul all. Lululululululululululululul. So next Boss. Garden stealth. Garden Warfare. Garden Warfare Das ist eigentlich das neue Garden Warfare Spiel, da kam doch vor ein paar Wochen oder paar Monaten ein neues raus. Lohnt sich das? Pepo Fett, guck mal hier. Ey lass mich in Ruhe, das Bild ist mir im Weg, ich seh nix mehr, das war keine gute Idee das Bild jetzt einzublenden, Monkey Ass, ich seh nix, wo ist der Boss, oh ich glaub ich verreck jetzt, ah im Moment das Zeug muss man ja killen, man muss ja die Dinger hier killen, lull und jetzt ist es auch easy auf einmal, kaum macht man es richtig, so jetzt kann ich jetzt die Mode wieder ausblenden. So, dann gehen wir nochmal kurz in die Stadt, schmeißen unser ganzes Loot einfach sinnlos in die Kiste und machen den Boss und gehen zum letzten Storyabschnitt, komm scheiß drauf das mit den Seeds machen wir dann, Seed, so gehts schneller als das rauszufischen, was jetzt Warum wurde Bless RNG, warum wurde Bless RNG Removed? Ah, Twitch Band Streamer Today. Ah, okay. Okay, das ist natürlich ne Sache, die ich definitiv nicht gut heißen kann. Inwieweit das Emote damit jetzt zu tun hat, ist fragwürdig, allerdings, nachdem das ja das Face von diesem Dude ist, kann ich verstehen. Kann ich verstehen. Darf ich da drüber nicht reden? Natürlich darf ich da drüber reden. Kann ich nachvollziehen, dass Twitch das Removed hat? Kann ich verstehen, ja. Oh, noch mal Pepofet. Alter, was ist das für ein Fisch? Den Boss kann ich mich überhaupt nicht mehr erinnern. Oh, da verrecke ich jetzt bestimmt. Ich weiß überhaupt nicht, was ich hier machen muss. Einfach Damage machen. Einfach Damage machen. Easy Mode. Damage machen und Zeug ausweichen. Au. Au. Monkeys. Man machte so viel Damage. Aber das Gute ist, in dem Game ist es nicht schlimm, weil man stirbt, es passiert überhaupt nichts. What the fuck? Das ist Chaos Damage. Ich habe keine Chaos Resies. Konnte ich mir noch nicht leisten, Chaos Resies. Aber er ist gleich down. Gebannte, über gebannte Leute und Twitch reden ist verboten. Na, dann frage ich mich, wie sie das einhalten wollen. Ich meine, wenn du überlegst, wie teilweise Daffron, XQC, sonst was, wer alles gebannt war und wenn du da nicht drüber reden darfst, dann... Na ja, gut. Twitch, du hast es schon. Ja, ich glaube das war es. Okay Leute, letztes 식 Quatsch-Gerüche. caps. Ja, ich glaube es war's. Okay Leute, letzter Akt der Story, dann haben wir es endlich geschafft, uns in dem Endgame und ich kann dieses sinnlose Storydialog rumklicken weglassen. Okay, also was mussten wir nochmal im letzten Akt machen? Der letzte Akt war ziemlich kurz, wenn ich mich richtig erinnere. Umfragen kann nur ich machen, ja für was soll ich denn eine Umfrage machen? Soll ich wirklich eine Umfrage machen für Nutella mit oder ohne? Also wenn du das haben willst, mache ich das natürlich, weil du hast eh mal 5000 Punkte gebracet. Ja, gut, also. Wenn der Knäherbär fragt, Nutella mit oder ohne Butter, mit, ohne, allow multiple answers ist ziemlich doof. So, excellent, dass der Knäherbär seine Umfrage kriegt, muss sein. Vote, äh nicht vote, also ohne natürlich bei mir, in meinem Fall ohne. Mit slash vote, excellent, wusste ich nicht, dass das funktioniert. Ich bin ja auch Twitch Noob, ich mein, nur weil ich seit 2 Jahren jetzt auf Twitch streame, heißt das nicht, dass ich weiß, wie Twitch funktioniert. Okay, die Umfrage ist knapper, als ich mir das gedacht hab. Es ist deutlich knapper, als ich das vermutet hätte. WTF, mit, chat, ich glaube, der Chat stimmt nur mit ab, um mich zu triggern, dass ich äh sage, es ist eklig, mit, ich weiß auch nicht, wer das macht, aber der Chat macht das anscheinend, das sind die, das sind die Weeps im Chat, die essen das alle mit Butter wahrscheinlich, ne, das ist Baro nicht, okay, dann stimmt das schonmal nicht. Ja, ja, ja, ja, ja, Chat, ich hab Hunger, ich ess mal kurz was, bevor ich durch den nächsten Akt fertig durchrushe, ähm, okay, genau, der letzte Akt war ziemlich kurz, man musste eigentlich nur, nur in 3 Gebiete rein und so, und das wars dann, das war ziemlich, ziemlich easy, kann ich mich noch dran erinnern, ähm, nummer, POE, nicht Smill, Skill, Book of Skill, gucken, dass ich keine Quests übersehen hab, die Skill Points geben, Akt 10, äh, okay, machen wir, machen wir gleich, Leute, ich ess mal schnell was, dabei gucken wir uns natürlich ein richtig schönes Kokona Video an, BBQ Pit Boys, hell yeah, real easy Roast Beef, ha, ha, ha, Chicken Trag Egg, Dick, ne, Dickens, Cider, alles klar, das haben wir schon gesehen, das ist, das ist der Schweinebauch, den sie mit dem Teppichmesser eingeritzt haben, ja, der, Chicken Dragon Eggs, alles klar, das gucken wir uns jetzt an, und ich ess kurz was, da gehts weiter, Sebaro, was ist, was, hä, der Sebaro hat grad Umfrage erstellt, wo ich ja nicht mal weiß, was die Umfrage beheißen soll, soll Max mal in die Slots gehen, was sind die Slots, was ist das, was sind Slots, Sebaro ist das irgendwas Anstößiges, Poker of Dead, Slots, okay Sebaro, ich hab keine Ahnung, ne, Ich hab legit keinen Plassen Schimmer, was du meinst, ich kenn den Azitwitch, ach, meinst du Casino, Casino Content oder was, ja ganz bestimmt mach ich Casino Content, alter, was kommt als nächstes, was kommt als nächstes, als nächstes kann ich an Schach spielen, da spiel ich Schach, das wär doch mal was, exzellent, exquisiter Zug, ihr glaubt's gar nicht, Chess, Chess ist auf Twitch übelst angesagt zur Zeit, Chess geht voll ab, guckt euch das an, ja, high IQ, Chess, so jetzt muss ich aber was essen, ich hab Hunger, ich guck jetzt Chicken Dragon Eggs, hohoho, was exqc spielt Chess, exqc, okay, ich hätte exqc jetzt nicht als Big Brain Chess Spieler eingeschätzt, aber okay, ich muss was essen, ich hab übelst Hunger, beeil mich auch, Exzellent, Bacon, Bacon Strips, Bacon Strips, Bacon Strips, okay Big Brain Umfrage, ist das heute ein Stream, eindeutig nein, da steht sogar schon im Titel, dass es kein Stream ist, wie kann das da ein Stream sein, oder wollt ihr mir sagen, ich Chebate euch mit dem Titel, hab ich euch jemals Chebated Chat, sowas würde ich nie machen in den Twitch Chat, also ist das eindeutig kein Stream, so, Chicken Dragon Eggs, ich finde es geil wie er das sagt, Jalapeno, Jalapeno, Jalapeno, Jalapeno, es wäre jetzt mal nur so ein kleiner Vorschlag, ich weiß es gehört zum Programm, aber wenn man ein kleineres Messer nimmt, dann wäre das deutlich einfacher das aus der Pepperoni zu machen, einfach zu machen, benutzt eure alte Hickory oder welches Knife ihr hattet, einfach zu machen, jetzt nehmen wir einen normalen Plastikwaffel, denn was wir hier machen wollen, ist, dass wir das ausflatten wollen, und das macht ihr für ein paar Gründe, eine ist, damit ihr eine konsistente Fertigkeit der Fertigkeit habt, damit es abends kocht, und ihr könnt es auch zerstören, erstmal schön hemmern, dass der sogar einen ordentlichen Hammer dafür verwendet, dass der nicht mit einem Stück Holz draufklopft, wundert mich jetzt eigentlich, oder mal zumindest mit einem Pistolengriff hätte man draufklopfen können, also ich glaube Pistolengriff wäre der richtige Kokona Weg gewesen, es ist jetzt etwaARY! Sie wollen einiges übrig? Natürlich. Okay, nun... Schreddende Zwiebeln und Schredden. Nimm sie, sie melt besser und schneller. Lege sie da rein. Du willst den Zwiebeln benutzen, das ist perfekt für das. Und er sieht aus wie ein Ei, oder? Ein weißer... Perfekt! Schraub ein Ei. Sonst. Jetzt. Ich nehme den Eier von dem Drogon. Und... Dann wird das Ei aus dem Zwiebeln. Und dann wird das Ei aus dem Zwiebeln. Genau so. Genau so. Ja, das Flieger da wird verschwunden. Genau so. So, wir machen... ...ein guter... ...ein guter Schraub. Und das wird es zusammenhalten. Du brauchst keine Stange oder so. Du brauchst einfach Bacon. Und wie viele von euch wissen... Warte mal. Timeoutet ein das Game eigentlich nach einer Weile? Okay, ne. Timeoutet ein nicht. Bacon... ...wie es kocht... ...konstruiert. Wie ein Zwiebeln. Wie ein Schlag. Je länger es kocht, desto stärker wird es. Und wir werden es zusammenhalten. Das ist eine gute Qualität. Das ist eine gute Qualität, Bacon. Das ist eine gute Qualität, Bacon. Wie groß war das Hähnchen? Wahrscheinlich gene-manipuliert. Haha. In den USA geht alles. In den USA geht alles. Du hast recht, Rick. PoE-Timeoutet nicht. Weil ich hab letztens afk 4 oder 5 Stunden rumgestanden und ich war nicht getimeoutet. Jetzt wo du es sagst... ...ist so timeoutet nie. Warum auch? Macht ja weder Bandbreite noch sonst was. Was nicht nennenswert. Und sie können ihren Investor-Leuten wahrscheinlich besser Playtime erzählen, wenn sie nicht timeouten. Ne, wir gucken uns das komplett an. Ich will sehen, wie er das einwickelt. Moment, ich hab übrigens meine Emotes vollkommen falsch platziert. Oh, das ist gut. Das ist spicy. Und innen steckt noch die Pepperoni mit Cheese. Ja, KioKorn. Warte was, Essen. Fahrenheit, NA-Einheiten. NA-Einheiten. Aber gut aussehen tut's. Also, Chat... ...muss man sagen. Es sieht wirklich gut aus. Da läuft sogar noch der Käse raus. Boah, nice. Craygasm Grill. Also, wäre das Messer jetzt vielleicht einen Ticken schärfer und er wird nicht so viel draufdrücken. Da wird der Käse auch drin bleiben. Aber wer bin ich, dass ich das überhaupt in Erwägung ziehe hier das zu kritisieren. Ich hab übrigens erst die Hälfte von meinem Essen gegessen. Wir müssen noch ein Video gucken. Nice. Wie gut, dass sie noch ein Video gemacht haben. Was gibt's bei mir? Brötchen mit Salami. Und dann noch zwei, also ein halbes, also ein Stück Brot halbiert mit Frischkäse drauf. Und bisschen Neisbeeren, also nichts wahnsinnig advancedes jetzt. Kein Dragon Egg, leider kein Dragon Egg. Nee, auch keine Diät. Es reicht mir schon, dass ich ein bisschen Sport mache in letzter Zeit. Schon genug Pepo-Fett gerade am Start. Das lag schon ein bisschen lang an der Luft. Wie braun das ist. Der muss aufpassen, dass er mit seinem Bart nicht in den Grill kommt. Das ist der Corona-Filter. Das Fleisch war zu lang an der Luft, deswegen esse ich ein bisschen braun. Spätestens wenn du vom Grill kommst, siehst du es nicht mehr. Was? Moment, Moment. Warum mischt er das nicht mit der Machete? Ich weiß es nicht. Ich weiß es nicht. Ich weiß es nicht. Warum mischt er das nicht mit der Machete? Ich hab jetzt erwartet, das wird mit der Machete gemischt. Was soll das? Das ist aber nicht wahrer Coconut Style. SPG ist Salt, Pepper, Garlic? Salt, Pepper, Garlic? Salt, Pepper, Garlic ist das glaube ich, SPG. Also Salz, Pfeffer, Knoblauch. Das ist ein sehr schweres Fleisch. Ansonsten bräuchst du es, richtig? Sehr langsam kochen oder wir zeigen dir einen Trick. Jetzt machen wir ein paar Schläge. Vielleicht 1 1⁄3 tief in es. Wir wollen nicht alles durchgehen und es aufstecken. Ich muss euch was gestehen. Ich hab fertig gegessen. Und ich hab noch Hunger. Ich glaube, ich geh mal jetzt noch kurz was holen. Ich bin gleich wieder da. Soll ich was kleines? Keine Ahnung. Gönn dir Döner-Teller. Döner-Teller hab ich heute Mittag gegessen. Ein halbes Inch dicken Schläge. Soll ich noch mal was machen? Also, wir müssen jetzt und wir haben es gelesen. Also wir haben es gelesen. Wir haben es gelesen. Wir haben es gelesen. Wir haben es gelesen. Wir haben es gelesen. Wir haben es gelesen. Wir haben uns gelesen. upside-down-現象 appetite- Kw! Jawohl! Das Leben ist schnell. Das Leben ist sehr selten. Wir sind am Rennen. Wir sind mit denями ch menor schcore longtime geplant. Da war ich changes 50rum und ich warum? und why would ya ya Christinafi Anna st eine M Unter? Lion So und nachdem mein erstes, erste Hälfte vom Essen so gesund war, wie gesagt, habe ich ein Brötchen mit Salami ohne Butter drunter und jeweils zwei halbe Stückchen Brot mit Frischkäse habe ich mir jetzt noch Lidl Apfelkuchenstückchen geholt, ein kleines Stückchen, ja, exzellent. Das Fleisch sieht wirklich nicht gut aus, das hat zu lange rumgestanden. Wie lange sollen wir dem jetzt da eigentlich zugucken, wie er den Kram da mariniert? Ich will sehen, wie das auf den Grill kommt, Alter. Ich will jetzt Fleisch, Wiesenhof, Wiesenhof-Brutzler, Wiesenhof hat auch Corona. So, jetzt auch das Kuchenstück und dann ist es fertig. So, jetzt auch das Kuchenstück und dann ist der Max satt und ready für Akt 10. Akt 10 geht schnell, keine Ahnung, halb Stunde oder so. Man kann das mehrere Mal während dem Kochen machen und es kann ein paar Stunden dauern, depends an welcher Temperatur du hast. Wieder, wir wollen langsam, 300 Grad Fahrenheit, das hilft, die Moistur zu behalten. Wir drücken das aus, naja, es ist wirklich nicht erbärmlich und natürlich weiß jeder, der diese Eier gekocht hat, genau, wovon ich spreche, oder? Okay, ein bisschen mehr. Oh, das sieht echt gut aus. Ich habe jetzt nichts mehr zu tun, aber ich habe es einfach aufgemacht, wie ein Künstler. Nehmt eure Zeit, es ist in der Detail. Oh, wir haben da ein Stück glücklicher Gras, mit dem Dank an Bob Ross. Du kannst es so lange wie du willst behalten, das ist ein PIT-Master Privilege. Schiebe die Klappe wieder auf und nicht lange dauern. Oh ja. Exzellent. Jetzt haben wir eine Seite Zwiebeln und ein paar Friesen. Wir drücken das aus, fangen mit dem Heaten an, denn dieses Gras ist fast fertig. Und im Wunder der Zeit, dieses Barbecue Gras-Bef ist fertig. Du willst es zu einer internen Temperatur von ca. 120 Grad kochen, oder? Pretty much rare. Sebarro, so ein fettes Stück Fleisch kostet dich mehr als 5 Euro. Essen gehen ist mittlerweile so extrem teuer. Wir sind teilweise nicht mehr ganz dicht. Letztens, ein halbes Jahr oder so her, war ich mal Ente essen, weil ich mir gedacht habe, ich habe ewig keine Ente, also nicht China-Ente, sondern ganz, nicht Ente. Ganz essen, soll ich so Gänse braten. Dann habe ich am Ende, glaube ich, 28 Euro oder so ausgegeben. Und was habe ich gekriegt? Ein paar Scheiben, für mich viel zu wenige Scheiben, Entenbraten mit Soße und einen Semmelknödel. Einen Semmelknödel! Wollt ihr mich veräppeln? Ich gehe schnell mal hin. Ich glaube, dass es am besten schmeckt, das, was er gerade abgeschnitten hat. Das von der Seite, mit der Haut von außen, schmeckt, glaube ich, am besten. Sieht aus wie ein Finger, sieht aus wie eine Hand. Ich glaube, die müssten ihre Machete ein bisschen schärfen. Guck mal, die Machete geht da kaum durch, ohne richtig fest drauf zu drücken. Die sollen sich mal auf YouTube angucken, das Schärfst... Wie war das auch vor ein paar Jahren, was voll im Trend war auf die YouTube-Videos? Heißes Messer durch Cola-Flasche. Das Video solltet ihr sich mal angucken. Kennt ihr das noch? Heißes Messer durch Cola-Flasche? Das war vor ein paar Jahren voll angesagt, das hat irgendwie jeder auf YouTube lange gemacht. Genau, 1000 Grad heißes Messer durch Cola-Flasche. Genau das war's. Tee from the future abonniert, 6 Monate, exzellent. Fast so lange her wie deine Cod-Video, dann nicht ganz so lange. Meine Cod-Videos sind ja 8 Jahre her und das andere ist glaube ich nur 3 Jahre her. Ok, fertig gegessen Leute, exzellent, weiter geht's. Also, ich muss mal kurz ein bisschen aufrefreshen, wie Akt 10 lief, dass wir möglichst schnell durchkommen. Den Dude retten. Square, ok, ich glaube ich weiß wieder wie es funktioniert. Also, Akt 10 ist kurz. Du hast mich geprägt. Ich hoffe auch, dass du auf der Arbeit des Poggas sagst. Oder wenigstens bashen, bashen, alter, bashen. Zu irgendwas muss es ja gut gewesen sein. Ich hab letztens auch wieder aus Versehen auf der Arbeit was losgelassen. Auch irgendwelche sinnlosen Twitch-Emotes. Wurde ich wieder merkwürdig angeguckt bzw. merkwürdig angehört über Teams. Einmal im Monat Safe Call, so ist das richtig. So gehört sich das. So muss das sein. Ja, genau Nelly Pogs, so sieht es aus. So, jetzt muss man rechts runter und dann, dann kommt man auf so einen Platz. Und dort musste man dann glaube ich diesen einen Boss nochmal machen. Denen man vor drei Akten auch schon mal gemacht hat. Kein Bock in Garten zu gehen. Gartenstelz. Das Spiel will das für Gartenstelz machen. Streamt eigentlich der Friseur. Der Friseur hat viel, hat sehr viel gestreamt. Aber aktuell ist er irgendwie bei komischen Mobile Games hängen geblieben und streamt gerade wenig. Der Fabian hat die letzten Jahre lang extrem viel gestreamt. Teilweise 11 Stunden am Stück oder sowas. Aber in letzter Zeit ist er immer so am Start. Weil Mobile Games keck weh. Ich meine Mobile Games, Alter, was ist da los? Hätte ich nie gedacht, dass der Fabian mal der Mobile Games-Sochter wird. Ich meine jeder wie er will. Also Fabian ist ja eh wurscht, der lässt sich ja prinzipiell nichts sagen. Übrigens, übelst kacke Unic wieder. Aber ich glaube diese Liga könnte es sich sogar lohnen Unics zumindest ein paar aufzuheben. Weil es gibt ein Crafting Rezept, da kann man Unic zu einem Unic Ring machen. Und da gibt es ein paar ganz gute. Alter, könnt ihr mir sterben, please? Achso, das ist da unten. Vor lauter Effekten, ich sehe den Gegner gerade gar nicht mehr. Oh, jetzt habe ich den Chat geguckt und schon bin ich verreckt. Der Fabian sieht, ne mittlerweile sieht er nicht mehr aus wie 23. Der Fabian sah 10 Jahre lang aus wie 23, mittlerweile sieht er aus wie 24. Oh fuck, ich muss mal Zeug casten. Na doch, er sieht jetzt schon ein bisschen älter aus. Aber wir sind beide 35 darf man nicht vergessen, wir sind ziemlich gleich alt. Der Master Krabber übrigens auch. Aber heute, ich meine, wo ist der Unterschied schon großartig? Gerade in der heutigen Zeit und online, ich meine, ich bin im Kopf auch irgendwie stehen geblieben als ich 23 war. Ich bin heute 35, sache auf der Arbeit Pog und Poggers und stream auf Twitch und poste den ganzen Tag irgendwelche Meme Bildchen. Achso, was sagt Alter schon großartig aus? Ich bin übrigens falsch gelaufen. Ja, 35, kein Witz. Lol, lolololol, lololol, Moment, wo müssen wir jetzt hin? Waypoint. Respectpoints, brauchen wir nicht. Labyrinth Trial, das brauchen wir. Das war Waypoint-Crab. Wo ist der Waypoint? Waypoint-Crab so an. Was ist hier? Waypoint? Nope. Kein Waypoint, hier auch kein Waypoint. Wenn ich in den Chat gucke, bin ich immer halbtot danach. Die Akte sind das Schlimmste. Es geht. Die ersten kann ich ja mittlerweile schon auswendig. Aber die letzten zwei ist schon eine Weile her. Ich hab die letzte Liga ja ausgesetzt. Deswegen muss ich mal kurz mal ein bisschen in den Guide gucken. Übrigens sind sie faul geworden in den letzten Akten. Es gibt kaum noch Voice Acting. Ah, da ist der Waypoint. Excellent. Und da müssen wir rein. Also wir müssen das Osu-Ware-Labyrinth-Trial und Respec-Points. Juckt mich ehrlich gesagt nicht. Aber die Trial müssen wir finden. Da oben ist ein Garden Warfare-Action. Aha, sehr gut. Der Chat ist still. Heute ist ja auch kein Technik-Laber-Stream, wo es irgendwas Großartiges gibt. Aber falls ihr irgendwelche Fragen habt, sei es zur Ausbildung, zu irgendwelche Technik-Sachen, oder sei es zu irgendeiner Router-Konfig, ihr könnt mich heute echt alles fragen. Meinen wegen sogar wie viel mein Schiss liegt, aber das weiß ich nicht. So advanced ist mein Klo noch nicht, das wiegen zu können. Also wer will sowas schon wissen? Außer irgendwelche komischen Leute. Aber wir wissen, dass es im Internet ganz viele komische Leute gibt. Chat besteht nur aus Big-Brain-Leuten, die müssen nichts fragen. Stimmt, stimmt. Ach, da oben ist das Trial. Ich bin vorbeigerannt. Da ist das Trial. Wo muss man lang? Ja, Game, lass mich einfach durch. Man kann die meisten Sachen hier einfach durchrennen, juckt überhaupt nicht. Das Game will, dass man hier wahnsinnige Big-Brain-Movement-Einlagen macht, dabei einfach durchrennen und gut ist. Sachte und stirbt wahrscheinlich, klar. Ja, noch. Nee, später auch. Selbst in den Map Labyrinth-Challenges kann man eigentlich durchrennen. Es gibt übrigens einen richtig guten Tipp, der wirklich was bringt, weil man später, für das allerletzte Labyrinth, muss man auch wieder Labyrinth-Trials sammeln. Und es gibt einen Chatraum, da kann man reingehen. Ich glaube, Trade Chat 870 oder 820 oder Global 820, da posten die Leute, wenn sie Trials gefunden haben und man kann in ihr Game joinen. Das ist richtig nice. Okay, haben wir gemacht. Torched Quartz oben rechts. Global 820, genau. Das ist richtig praktisch. Dann hat man das innerhalb von einem Abend zusammen, die Trials. Ich versuche gerade übrigens Chat zu lesen und zu spielen, das klappt nicht. Wie sind deine Kochskills auf einer Skala 1 bis 10? Früher habe ich ziemlich viel gekocht. Allerdings jetzt auch kein wahnsinnig Big-Brain, französische Spezialküche, sonst was Zeug. So normales Zeug, ja. Also von Spaghetti bis Schnitzel zu sonst was, also so normale Sachen. Also das kriege ich heute auch noch ohne Probleme hin. Ich würde mal sagen, so vier, vier. Meine Kochskills eher so, vielleicht sogar fünf. Ich weiß nicht, wie gut der Durchschnittskochmensch so ist. Aber bei advanceden Sachen hört es dann auf. Was muss ich jetzt eigentlich drin machen? Ach genau, ich sage es doch. Wir müssen den gleichen Boss nochmal killen, den wir schon mal gekillt haben. Weil das Game besonders gut im Recyceln ist. Excellent Recycler. Aha, oh. Guck mal, ein Delirium-Portal. Das war in der letzten League die Hauptmechanik. Oh, Game, ruckel nicht so. Nicht ruckeln, please, Path of Exile. Also für die Optik muss man sagen, hat das Game keine allzu gute Performance. Die Performance ist absolut in Ordnung zu 95%, aber manchmal hast du richtig krasse Slowdowns. Jetzt ruckelt es zum Beispiel zwischendurch. Ich glaube, das legt sich in dem Frame-Counter gar nicht so wirklich nieder, weil er bloß alle 2-3 Sekunden aktualisiert. Aber das hat immer zwischendrin richtige Slowdowns. Grafikkarte oder GPU, CPU oder Grafikkarte, ich habe ehrlich gesagt keine Ahnung, woran das in dem Game liegt. Die Garen-Warfare-Geschichte nicht gemacht. So, mal gucken, was es für Drops gibt. Aha. Da kann aber nichts Gutes mehr bei rauskommen, so wirklich. Aber ich liefere mal den ganzen Crap in der Stadt ab. Verwendest du schon den Vulcan-Renderer? Nö, wusste gar nicht, dass es einen Vulcan-Renderer gibt. War mir nicht bewusst, dass es einen Vulcan-Renderer gibt. Ist der denn besser? Komm, wir machen das später, ja. Erstmal alles wegkloppen. Erstmal alles wegkloppen. Ich will jetzt die Story durchkriegen. Volke läuft bei mir viel besser als Diode X, okay. Oh, ein Unset-Ring, Poggers. Schon der zweite. Mal gucken, was für eine Socke. Wieder ein grüner. Okay, mal gucken, wie der ist. Der suckt. Was ein Crap-Ring. Aber den können wir im Garten, den reforgen wir im Garten mal. Und gucken, ob da was halbwegs Gescheites bei rauskommt. Unset-Rings brauche ich nämlich ein paar fürs Endgame. Bis dann, Renax. Was ist eigentlich dieser Garten? Das ist die Mechanik von der aktuellen League. Also, das Game, es droppen Samen, die kann man da pflanzen. Und wenn man die dann eine Weile quasi in diesem Garten stehen lässt, dann wachsen die. Und wenn die gewachsen sind, gehen sie kaputt und kommen Mops raus. Wenn man die Mops killt, kriegt man neue Samen, paar Drops. Und bekommt quasi Saft. Mit dem Saft kann man dann Sachen craften. Eigentlich total unnütz kompliziert gemacht, wenn man es so will. Alter, wo geht es denn hier weiter? Kann doch nicht sein. Ich bin hier schon komplett am Durch... Ah, das ist immer... Exzellent. Max spielt Passive-Exerl, ja. Ich hatte die Auswahl heute zu streamen oder Kreisel-Grind zu machen. Und ich habe gesagt, okay, ich habe heute mehr Bock auf Kreisel-Grind. Aber ich mache einfach zum Kreisel-Grind den Stream an. Wir müssen skillen. Skillen. So, was gab es denn? Den da, den da. Und dann, ich bin mir nicht mal ganz sicher, was muss man skillen? Was müssen wir skillen? Ja. Soul of Steel müssen wir skillen. Also quasi hier runter dann. Ah, die Defense sieht doch jetzt schon ganz brauchbar aus. Voll die Mobile-Game-Mechanik. Ja. Eigentlich schon, ja. Eigentlich ist es so richtig Mobile-Game-Mechanik. So, mal gucken, ob wir den Ring jetzt zu irgendwas halbwegs brauchbaren craften können. So, hier. Hier. Hier. Ja. Ja, Game ist ja gut. Mehr Effekte, please. Mehr Effekte. Es sind noch zu wenige Effekte. Zu wenige Effekte. Freue mich auf die Switch-Version. Ihr werdet lachen, es gibt eine PS4-Version. Ich weiß nicht, ob es eine Xbox-Version gibt. Spielst du HC? Nee, nee, nee. Ganz normal. Softcore. Harvest-Standard. Softcore. So, mal gucken, ob wir den Ring jetzt zu irgendwas gescheite machen. So, mal gucken, ob wir den Ring jetzt zu irgendwas gescheit craften können. Was haben wir denn hier zur Auswahl? Three Sockets. Okay, drei Sockel geht nicht. Reforge. Reforge a rare item with attack modify. Okay, das können wir mal ausprobieren. Es ist immer noch kacke. Wobei, so schlecht ist er gar nicht mehr. Aber plus 128 Accuracy-Rating ist halt... Können wir die Sockel-Farbe noch ändern? Weil ich glaube, ich brauche keinen grünen Sockel. Ich glaube, ich brauche einen blauen Sockel später. Kannst du die Bitrate erhöhen? Oh, sorry Leute, das habe ich ja voll vergessen. Ja klar. Warum habe ich... Das müsst ihr mir ja sagen, ey. Das Game sieht übelst kacke aus ansonsten. Jetzt sieht das gut aus. Vielleicht viel besser. Hab schon mal geschrieben, da muss mich zu... Sebaro, mein Chef hätte jetzt gesagt, da hättest du mich energischer darauf hinweisen müssen. Ja, das habe ich ganz vergessen am Anfang. Der Stream sah übelst räudig aus. Kann man die Sockel... Okay, das Ding hat zumindest viele Resis. Das ist schon mal okay. Kann man die Sockel... Hier kann man die Sockel nicht reforgen. Sockelfarbe. Stimmt, stimmt, ja klar. Erst so, ich muss erst mal gucken, was ich eigentlich brauche. Genau. Skills. Blau. Blauen brauche ich und... Auch noch irgendwas. Okay, auf jeden Fall einen blauen. Aber das kann ich später machen. Das muss ich jetzt nicht machen. 101 Lifeforce will be lost. Nein, nein, nein, Kollege. Storage Tank. Crafting. Bam. Storage Tank. Excellent. Kann man nie genug haben. Wie gesagt, das optimale Garenlayout braucht viele Items. Und irgendwie noch Dispenser. So. Rest kann kondensiert werden. Mal hier. Okay, gut. Ach, ich deb, ich habe meine Seeds ja wieder in der Kiste vergessen. Richtig low brain. Seeds, wo sind sie? Oder auch nicht? Aber Seeds, nicht Seeds. Excellent. Lohnt sich das überhaupt? Komm, ich mache jetzt gar nicht lange mit irgendwelchem Loot rum. Das wird jetzt gedumpt. Fertig. Nein, nein, nein. Seeds wieder reingeschmissen wollte ich noch gar nicht. Gut. Man darf sie auch nicht so lange Zeit lassen, weil ansonsten ist die Resette die Map wieder. So ist gut. Alles klar, weiter geht's. Bei mir ist immer noch 4900. Was? Echt? Eigentlich sollte das jetzt hochgehen. Eigentlich sollte die Stream-Qualität jetzt hochkommen, aber ich mache es mal runter. Geht sie denn runter? Ah, das Nvidia-Ding kann glaube ich nicht. Ich muss mir den Big Brain Seed-Layout machen. Ja, ich weiß, habe ich schon. Ich habe schon das optimale Seed-Layout hier am Start. Der Nvidia-Decoder kann die Bitrate nicht dynamisch ändern. Okay, das ist jetzt der erste Nachteil, den ich an dem Nvidia-Decoder gefunden habe. Ja, anscheinend. Geht nicht. Das ist für Einsteiger, du brauchst das hier. Ich starte den Stream einfach mal kurz neu. Hattest du den nicht sonst auch immer? Nee, nicht immer. Ich habe den erst seit 2-3 Wochen. Wo ist jetzt der große Unterschied? Oh. PoE-Extreme-Layout. Ja, die über 3 ist wieder voll, die Leute. Leute, ich starte einfach den Stream schnell neu. Dann haben wir nämlich bessere Quali. Dann pixelt der Scheiß nicht mehr so.", "segments": [{"id": 1, "start": 0.0, "end": 16.86, "text": "So"}, {"id": 2, "start": 16.86, "end": 40.34, "text": "So Leute, spontan gestriemt, so, ich habe nämlich gerade eine Stunde Sport gemacht,"}, {"id": 3, "start": 40.34, "end": 50.94, "text": "weil schon mal die zweite Runde heute, bald ist nicht mehr Pepo Fett angesagt und eigentlich"}, {"id": 4, "start": 50.94, "end": 54.18, "text": "wollte ich gar nicht streamen, ich habe mir gedacht, komm, lockst du dich mal ein bisschen"}, {"id": 5, "start": 54.18, "end": 59.98, "text": "Perce of Exile ein und grindest immer ein bisschen vor dich hin, aber da habe ich mir"}, {"id": 6, "start": 59.98, "end": 63.3, "text": "gedacht, nee, eigentlich müsstest du auch streamen, deswegen habe ich mir gedacht,"}, {"id": 7, "start": 63.3, "end": 67.9, "text": "ich mache jetzt einfach mal außer der Reihe streamen, wo ich ein bisschen vor mich hin"}, {"id": 8, "start": 67.9, "end": 74.74, "text": "grinde und ein paar Fragen im Chat beantworte, was auch immer, das ist kein stream, richtig,"}, {"id": 9, "start": 74.74, "end": 80.66, "text": "ich spiele nämlich einfach ein bisschen Perce of Exile und ich beantworte ein paar Fragen im Chat,"}, {"id": 10, "start": 80.66, "end": 86.06, "text": "nicht zum Spiel oder auch zum Spiel, wenn ihr wollt, aber ich bin eigentlich nicht wahnsinniger"}, {"id": 11, "start": 86.06, "end": 90.66, "text": "Perce of Exile Pro, alle möglichen Sachen, was ihr wissen wollt, Fachinformatiker, Ausbildung,"}, {"id": 12, "start": 90.66, "end": 97.34, "text": "IT Zeug, Router Konfiguration, was euch einfällt, ist mir vollkommen egal und nebenbei Kreisel"}, {"id": 13, "start": 97.34, "end": 102.82, "text": "grinde ich ein bisschen und spiele jetzt zwei Akte von der Kampagne durch, wohlgemerkt erwarte"}, {"id": 14, "start": 102.82, "end": 107.58, "text": "mich soviel Kampagne, Perce of Exile hat eine Story, die geht mir sonstwo vorbei, die Story"}, {"id": 15, "start": 107.58, "end": 115.42, "text": "ist auch mega schlecht, ich rush einfach durch, dass ich mal im Endgame ankomme, erklär mal"}, {"id": 16, "start": 115.42, "end": 122.5, "text": "Informatik, easy, hab kein Problem, guck dir Watt auf YouTube an, dauert 5 Minuten, so,"}, {"id": 17, "start": 122.5, "end": 127.94, "text": "nachdem ich die letzte Season nicht gespielt hab, brauch ich so ein bisschen ein Guide,"}, {"id": 18, "start": 127.94, "end": 133.94, "text": "wie man noch mal Act 9 möglichst schnell durchgespielt hat, weil ich keinen Schürmer mehr hab,"}, {"id": 19, "start": 133.94, "end": 139.62, "text": "wie es genau ging. Kannst du löten? Ja, kann ich, wenn wir gerade beim Thema sind, ich kann"}, {"id": 20, "start": 139.62, "end": 145.7, "text": "dir mal eine Lötstation zeigen, das ist eigentlich auch richtig dämlicher Anmachspruch, oder? Ich"}, {"id": 21, "start": 145.7, "end": 149.1, "text": "kann dir mal eine Lötstation zeigen, aber jetzt im wahrsten Sinne des Wortes, ich kann dir"}, {"id": 22, "start": 149.1, "end": 162.14, "text": "mal eine Lötstation zeigen. Das Ding, was ist kleiner, Nano oder Pico? Ich kann mir"}, {"id": 23, "start": 162.14, "end": 169.54, "text": "das nicht merken, das da, die ist super, kann ich empfehlen. Kannst du mir Flussmittel empfehlen?"}, {"id": 24, "start": 169.54, "end": 181.02, "text": "Nö, nee, ehrlich gesagt nicht, ich hab das ganz normale 0815 Lötzin, was Zinn, Blei"}, {"id": 25, "start": 181.02, "end": 188.46, "text": "und Flussmittel in einem ist. Ich habe mir mal vor einem Jahr oder so, für kleine SMD"}, {"id": 26, "start": 188.46, "end": 196.06, "text": "Teile, hab ich mir so eine Paste gekauft, das ist quasi so ein Gel, das schmiert man"}, {"id": 27, "start": 196.06, "end": 209.58, "text": "drauf. Warte mal, Lötpaste, wie heißt denn das? Ja, so was in der Richtung. So was in"}, {"id": 28, "start": 209.58, "end": 212.86, "text": "der Richtung war das, ich weiß nicht mal, wie das genau hieß, was ich mir geholt hab,"}, {"id": 29, "start": 212.86, "end": 222.98, "text": "das ist im Prinzip eine Paste, so eine Flussmittel, Harz, was auch immer, Paste mit Zinnkugeln"}, {"id": 30, "start": 222.98, "end": 231.58, "text": "drinne und damit kann man quasi die SMD Teile, also SMD sind diese kleinen, sind surface mounted,"}, {"id": 31, "start": 231.58, "end": 236.62, "text": "also das was ihr habt, das sowie normale Boards heutzutage aussehen, also sprich hier, das"}, {"id": 32, "start": 236.62, "end": 245.7, "text": "sind SMD Bauteile, so was hier und die fixiert man einfach mit dieser, mit so einer Paste,"}, {"id": 33, "start": 245.7, "end": 253.38, "text": "mit so einer Paste auf dem Board und dann kann man sich überlegen, ob man das zum Beispiel"}, {"id": 34, "start": 253.38, "end": 258.66, "text": "mit einem Heißluftgebläse quasi festmacht, das ist ganz gut, aber ich kann dir kein spezielles"}, {"id": 35, "start": 258.66, "end": 264.9, "text": "empfehlen, weil ich das noch nicht verwendet hab. Als Lötzin hab ich wirklich das ganz,"}, {"id": 36, "start": 264.9, "end": 274.98, "text": "das ganz billige hier Lötzin 10 Meter Rolle, keine Ahnung, so was ganz billiges, ja. Man"}, {"id": 37, "start": 274.98, "end": 287.82, "text": "kann es in den Backofen stellen, ja das stimmt, allerdings ist, ist sowas hier, sowas hier"}, {"id": 38, "start": 287.82, "end": 298.78, "text": "besser als Backofen. Jaja Lötzin würd ich das, 0815 Noob Lötzin, also quasi Zinn,"}, {"id": 39, "start": 298.78, "end": 302.7, "text": "Pley und Flussmittel in einem, ja das lässt sich viel besser löten, ich hatte mal die"}, {"id": 40, "start": 302.7, "end": 310.9, "text": "Ehre, weil ich nicht geguckt hab, also Pley-freies Lötzin zu kaufen, das fließt nicht richtig,"}, {"id": 41, "start": 310.9, "end": 316.22, "text": "das braucht höhere Temperaturen, das ist eklig. Also das für normalen Heimgebrauch,"}, {"id": 42, "start": 316.22, "end": 329.06, "text": "das normale Lötzin ist am besten. Das mit Pley, Zinn und Zeug halt, ne. So ich lock mich"}, {"id": 43, "start": 329.06, "end": 337.22, "text": "mal ein, ich weiß gar nicht wo ich genau aufgehört hab. Hast du dir mal funktionale Programmierungen"}, {"id": 44, "start": 337.22, "end": 342.1, "text": "Haskell angeschaut, ein bisschen eher lang, gezwungenermaßen, by the way ich muss mal"}, {"id": 45, "start": 342.1, "end": 348.7, "text": "gucken, dass es nicht zu laut ist. Ich glaub ich hab das Game zu laut gestellt, mal kurz"}, {"id": 46, "start": 348.7, "end": 368.86, "text": "gucken. Ne geht da eigentlich, oder? Da ist ok. Joa, also hast du dir mal, ich mach mal"}, {"id": 47, "start": 368.86, "end": 374.14, "text": "kurz hier den Chat auf, dass ich dann hier, dass wenn ich mich, wenn ich hier was vorlese"}, {"id": 48, "start": 374.14, "end": 379.5, "text": "da ich dann hier zeigen kann. Also Haskell, ne, nur mal in Not getrunken, ein bisschen"}, {"id": 49, "start": 379.5, "end": 384.82, "text": "eher lang, weil wir eine Software hatten, die eher lang programmiert ist, aber nicht"}, {"id": 50, "start": 384.82, "end": 392.18, "text": "wirklich, ne, ne, hab ich keine großartige Ahnung von. Der User 32DLL sagt, ich muss"}, {"id": 51, "start": 392.18, "end": 400.18, "text": "bald in meiner Ausbildung ein Jahr im Support arbeiten, irgendwelche Tipps, in welchem Support"}, {"id": 52, "start": 400.18, "end": 404.66, "text": "muss zu arbeiten. Also wie gesagt, ich spiel nebenbei einfach ein bisschen die Kampagne"}, {"id": 53, "start": 404.66, "end": 409.7, "text": "weiter, wenn ihr was wissen wollt, haut einfach irgendwelche Fragen raus. Wenn das Game zu,"}, {"id": 54, "start": 409.7, "end": 413.66, "text": "wenn das Game zu laut ist, dann kann ich ein bisschen leiser machen. Ich rush jetzt einfach"}, {"id": 55, "start": 413.66, "end": 421.22, "text": "durch die letzten zwei Akte durch, dass ich endlich mal Endgame anfangen kann. Exzellent."}, {"id": 56, "start": 421.22, "end": 435.98, "text": "Ich brauch neue Boots. Ja, welch, in was für einem Support musst du arbeiten? Hotline"}, {"id": 57, "start": 435.98, "end": 455.46, "text": "oder In-House, irgendwelche PCs anschließen oder so. Also Hotline kann ich dir nicht wirklich"}, {"id": 58, "start": 455.46, "end": 459.42, "text": "was raten, das hab ich nie gemacht, da hab ich immer einen riesen Bogen drum gemacht."}, {"id": 59, "start": 459.42, "end": 467.5, "text": "Hast du Ahnung, von RGB-Lüftern Corsair RGB hab? Nö. Ich hab mal eine Corsair Tastatur"}, {"id": 60, "start": 467.5, "end": 474.94, "text": "und ich fand die Corsair, also die Bedienung dieser Corsair RGB Software so grausam, dass"}, {"id": 61, "start": 474.94, "end": 479.3, "text": "ich jetzt eine andere Tastatur hab. Aber es lag nicht an der RGB Software, es lag an anderen"}, {"id": 62, "start": 479.3, "end": 490.74, "text": "Problemen bei der Tastatur. Ich mach mal kurz nen Ticken leiser. Das ist schon sehr repetiv,"}, {"id": 63, "start": 490.74, "end": 501.46, "text": "repetativ, repetiv, wie auch immer man das genau sagt. Bekomme mein Lüfter nicht gesteuert."}, {"id": 64, "start": 501.46, "end": 511.3, "text": "Ich wusste gar nicht, dass Corsair extra, was? Corsair RGB-Lüfter, die haben extra RGB-Lüfter?"}, {"id": 65, "start": 511.3, "end": 520.9, "text": "Oh, wow. Die wollen mich bashen, Alter. Was ist hier los? Ich lass mich nicht bashen."}, {"id": 66, "start": 520.9, "end": 542.3, "text": "Huge aim. Es gibt ernsthaft Corsair Lüfter, die sich RGB, what the fuck? Ja, hab ich schon"}, {"id": 67, "start": 542.3, "end": 548.06, "text": "nie gesehen. Ehrlich gesagt, keine Ahnung, wie man die steuert. Machen die, encoden die"}, {"id": 68, "start": 548.06, "end": 553.54, "text": "das irgendwie übers PWM-Signal oder was? Und außerdem, warum ist das so krass teuer? What"}, {"id": 69, "start": 553.54, "end": 565.26, "text": "the fuck? Alter, ist das teuer. 130 Euro für drei Lüfter. Ist das irgendwie mit Diamantkugellager"}, {"id": 70, "start": 565.26, "end": 581.66, "text": "oder was? IQ. Da sind neben dem PWM-Stecker extra RGB-Stecker drin. Also ich find richtig"}, {"id": 71, "start": 581.66, "end": 586.34, "text": "big brain wäre es, wenn die das irgendwie modulieren würden über das PWM-Signal. Also"}, {"id": 72, "start": 586.34, "end": 590.54, "text": "quasi über das PWM-Signal noch irgendwie so ein bisschen Daten rüber senden können."}, {"id": 73, "start": 590.54, "end": 611.66, "text": "Das wäre doch exzellent. Ohne extra Kabel. Mit extra Kabel kann doch jeder. Nee, aber"}, {"id": 74, "start": 611.66, "end": 615.38, "text": "woran das liegen kann, dass du deinen RGB-Lüfter nicht steuern kannst, weiß ich nicht. Ich"}, {"id": 75, "start": 615.38, "end": 620.82, "text": "weiß nur, dass ich diese... Quatsch, da sind wir ja schon. Ich weiß nur, dass ich diese"}, {"id": 76, "start": 620.82, "end": 629.02, "text": "RGB-Steuerung von Corsair ganz grausam fand. Kein Twitch-POE-Aufwelle. Hey, das ist der"}, {"id": 77, "start": 629.02, "end": 632.5, "text": "erste Char dieses Seasons und ich hab noch nicht mal die Kampagne durchgespielt. Also"}, {"id": 78, "start": 632.5, "end": 643.98, "text": "da gibt's nicht wirklich viel an Gier zu sehen. So, und es ist halt schon drei Monate her"}, {"id": 79, "start": 643.98, "end": 648.18, "text": "oder so, wo ich, nee, vier oder fünf Monate, keine Ahnung, wo ich die letzten paar Akte"}, {"id": 80, "start": 648.18, "end": 651.5, "text": "gespielt hab. Ich weiß nicht mehr, wo ich hin muss, deswegen guck ich mir nebenbei einfach"}, {"id": 81, "start": 651.5, "end": 656.7, "text": "hier die... Enter Descent and head straight up. Descent via Supply. Ach, der Kram ist"}, {"id": 82, "start": 656.7, "end": 661.7, "text": "das. Okay, dann weiß ich jetzt wieder, was ich machen muss. Dann weiß ich jetzt wieder,"}, {"id": 83, "start": 661.7, "end": 670.74, "text": "was ich machen muss. Wobei so schlecht abführt, anfangs ist der gar nicht. Der ist eigentlich"}, {"id": 84, "start": 670.74, "end": 685.58, "text": "ganz okay. Crap. Crap. Kann man alles sellen. Aber ich sell später alles auf einmal. Ich"}, {"id": 85, "start": 685.58, "end": 691.82, "text": "hab übrigens richtig Glück gehabt, ne? Ich hab, ich glaub in Act 3 hab ich gleich mal"}, {"id": 86, "start": 691.82, "end": 700.26, "text": "ein Enlightened Support-Gem getroppt, das ist 22 Chaos Orbs wert. Also sprich, ich kann"}, {"id": 87, "start": 700.26, "end": 708.78, "text": "mir von dem einen Drop schon Early Endgame-Ausrüstung einfach mal kaufen, ohne dass ich selbst was"}, {"id": 88, "start": 708.78, "end": 726.62, "text": "machen muss. Wenn du nicht Blood Aqueducts farmen willst,"}, {"id": 89, "start": 726.62, "end": 731.1, "text": "dann rufst du durch jede Zone, nimmst aber Desert jedes Juni bis zu Minen. Also ich"}, {"id": 90, "start": 731.1, "end": 736.06, "text": "kann mich noch ungefähr dran erinnern. Ich muss jetzt in die Wüste, dann muss ich diese"}, {"id": 91, "start": 736.06, "end": 745.18, "text": "komischen Pantheon-Dinger noch killen für die Skillpoints. Und dann die Story einfach"}, {"id": 92, "start": 745.18, "end": 753.94, "text": "abschließen und fertig. Ich kann mich nicht mehr so lange erinnern, das ist drei Monate"}, {"id": 93, "start": 753.94, "end": 759.42, "text": "her. Und davor hab ich jahrelang nicht gespielt. Die ersten paar Akte krieg ich noch aus dem"}, {"id": 94, "start": 759.42, "end": 766.46, "text": "Kopf zusammen. Übrigens, by the way, ne? Weil mich gestern jemand gefragt hat mit Passive"}, {"id": 95, "start": 766.46, "end": 770.58, "text": "Building. Ich bin ja in dem Game jetzt auch noch relativ nubelig. Ich hab mir einfach"}, {"id": 96, "start": 770.58, "end": 775.38, "text": "ein gutes Bild rausgesucht und hab das in Passive Building nachgebaut und das geht einfach,"}, {"id": 97, "start": 775.38, "end": 785.82, "text": "es ist einfach Easy Mode. Ich drücke einfach rechtsklick alles stirbt. Easy as fuck. Moment."}, {"id": 98, "start": 785.82, "end": 793.5, "text": "User32DLL sagt, Moment ich kann das jetzt mal einplenden. Inhouse support, inhouse"}, {"id": 99, "start": 793.5, "end": 798.7, "text": "IT support ist ne große Firma wo ich in der Zentrale arbeite. Ist dann mit Ticket-System,"}, {"id": 100, "start": 798.7, "end": 807.58, "text": "mit CS reparieren, Drucker. Oh Gott. Puh. Ja da hab ich leider keine guten Tipps für."}, {"id": 101, "start": 807.58, "end": 820.26, "text": "Ähm. Lass mal überlegen, was könnte ich, mir konnten euch nicht sterben, was könnte"}, {"id": 102, "start": 820.26, "end": 828.14, "text": "ich, was gibt, was könnte man da für Tipps geben? Was könnte man da für Tipps geben?"}, {"id": 103, "start": 828.14, "end": 839.38, "text": "Also ich musste das zum Glück nie machen. Vielleicht, dass man sich nicht so voll schwätzen"}, {"id": 104, "start": 839.38, "end": 844.3, "text": "lassen sollte von irgendwelchen Usern. Weil User neigen dazu zu denken sie wissen was"}, {"id": 105, "start": 844.3, "end": 854.46, "text": "Sache ist, aber sie wissen es in der Regel nicht. Das ist jetzt aber so universell. Ich"}, {"id": 106, "start": 854.46, "end": 861.14, "text": "mein jeder kennt's. Ihr verwendet YouTube, ihr spielt Pass of Exile was auch immer und"}, {"id": 107, "start": 861.14, "end": 864.9, "text": "ihr sagt euch an jeder Ecke, Alter warum haben die das so dumm gemacht, das wäre doch total"}, {"id": 108, "start": 864.9, "end": 871.66, "text": "einfach das besser zu machen. Und ähm dann ist man in dem Fall User und meint zu wissen"}, {"id": 109, "start": 871.66, "end": 875.26, "text": "man weiß wie es geht hat aber ehrlich gesagt von den Hintergründen keine Ahnung warum"}, {"id": 110, "start": 875.26, "end": 880.22, "text": "es so ist. Im Falle von YouTube vermute ich aber allerdings was anderes. Im Falle von"}, {"id": 111, "start": 880.22, "end": 886.26, "text": "YouTube vermute ich, dass die YouTube UI Typen einfach unfähig sind. Wobei ich mir das nicht"}, {"id": 112, "start": 886.26, "end": 889.1, "text": "vorstellen kann, man würde jetzt eigentlich vermuten das sollten die besten sein die es"}, {"id": 113, "start": 889.1, "end": 895.26, "text": "auf der Welt so gibt oder mit die besten aber irgendwie sind sie es nicht. Irgendwas auch"}, {"id": 114, "start": 895.26, "end": 914.34, "text": "nicht. Schonmal Crimdon John gespielt, nee. Crimdon hat mich abgeschreckt das es kein"}, {"id": 115, "start": 914.34, "end": 920.9, "text": "Online Modus hat. Also kein Online Modus mit quasi Closed Online Servern oder ist das"}, {"id": 116, "start": 920.9, "end": 926.7, "text": "mittlerweile anders. Ah jetzt kann ich mich wieder dran erinnern. Ich muss jetzt hier"}, {"id": 117, "start": 926.7, "end": 932.46, "text": "weiter rennen bis ich an so einer Barriere ankomme glaube. Bis ich an so einer Barriere"}, {"id": 118, "start": 932.46, "end": 943.16, "text": "ankomme. Jaja ich erinnere mich dunkel noch. Ja. Genau das hat mich an Crimdon ein bisschen"}, {"id": 119, "start": 943.16, "end": 948.78, "text": "abgeschreckt das es keine Closed Online Server hat und wenn ich online spiele will ich Closed"}, {"id": 120, "start": 948.78, "end": 952.86, "text": "Online Server haben. Nicht das die Leute sich irgendwelche Items offline cheaten und dann"}, {"id": 121, "start": 952.86, "end": 966.5, "text": "online alles wegownen oder sowas. Doof. Das ist blöd. Ja End of Function Zero ich meinte"}, {"id": 122, "start": 966.5, "end": 972.06, "text": "jetzt eigentlich so eher die Kombination aus Frontend Entwicklern und Designern also. Bei"}, {"id": 123, "start": 972.06, "end": 976.9, "text": "YouTube ist es halt mittlerweile echt wir. Ich kann verstehen warum sie die ursprünglichen"}, {"id": 124, "start": 976.9, "end": 981.46, "text": "Kanäle abgeschafft haben wie sie waren. Du ich weiß gar nicht. Kennt einer von euch"}, {"id": 125, "start": 981.46, "end": 988.02, "text": "noch die YouTube Channels von 2010. Kann sich da noch jemand dran erinnern. Da konntest"}, {"id": 126, "start": 988.02, "end": 994.3, "text": "du die Sidebar konntest du customisern das Banner customisern. Die rechte Sidebar customisern"}, {"id": 127, "start": 994.3, "end": 1000.7, "text": "konntest 5-6 Sachen auf diesem auf deinem Channel customisern. Das war richtig nice"}, {"id": 128, "start": 1000.7, "end": 1008.22, "text": "inklusive links und alle möglichen. Ja. Richtig richtig cool. Und das haben sie dann abgeschafft"}, {"id": 129, "start": 1008.22, "end": 1013.82, "text": "das kann konnte ich verstehen weil sie gesagt haben ok Smartphone wird immer wichtiger und"}, {"id": 130, "start": 1013.82, "end": 1017.42, "text": "sie wollten halt nicht alles doppelt und dreifach entwickeln müssen weil das sah halt auf dem"}, {"id": 131, "start": 1017.42, "end": 1024.94, "text": "Smartphone kacke aus das Layout. Das konnte ich verstehen. Allerdings was ich nicht verstehen"}, {"id": 132, "start": 1024.94, "end": 1032.62, "text": "konnte war das hin und her was sie mit Google Plus gemacht haben und das heute die Set. Ok"}, {"id": 133, "start": 1032.62, "end": 1040.26, "text": "das bringt ein paar Fusings. Und was ich heute was ich auch nicht verstehen kann ist. Das"}, {"id": 134, "start": 1040.26, "end": 1046.18, "text": "so wie es heute ist dass du auf YouTube Settings hast dass du im YouTube Account Settings hast"}, {"id": 135, "start": 1046.18, "end": 1053.7, "text": "dass du im Kanal Center Settings hast dass du im Studio Settings hast dass du extern"}, {"id": 136, "start": 1053.7, "end": 1062.3, "text": "auf Google also von YouTube runter den Google Account Settings hast. Also da blickt wirklich"}, {"id": 137, "start": 1062.3, "end": 1070.66, "text": "keiner mehr durch. Video Antworten das war auch cool ja. Und was ich ja persönlich immer"}, {"id": 138, "start": 1070.66, "end": 1075.98, "text": "noch ein bisschen vermisse. Was ich ja noch ein bisschen vermisse immer noch auf YouTube"}, {"id": 139, "start": 1075.98, "end": 1093.54, "text": "ist das Private Message System. Das Private Message System war echt geil. Die Annotations"}, {"id": 140, "start": 1093.54, "end": 1100.14, "text": "ja die Annotations waren auch ganz nützlich. Was ich persönlich auch schade finde was sie"}, {"id": 141, "start": 1100.14, "end": 1106.06, "text": "jetzt abgeschafft hat ist den YouTube Editor. Oh fuck nicht Stärme. Der Editor der war"}, {"id": 142, "start": 1106.06, "end": 1112.06, "text": "an sich jetzt nicht super geil oder so aber das Coole am Editor war man konnte wenn man"}, {"id": 143, "start": 1112.06, "end": 1116.26, "text": "was hochgeladen hat beispielsweise wenn man was hochgeladen hat wenn man ein Unboxing"}, {"id": 144, "start": 1116.26, "end": 1124.26, "text": "oder so hochgeladen hat und hat aus Versehen auf einem Zettel noch seine Anschrift gehabt"}, {"id": 145, "start": 1124.26, "end": 1129.58, "text": "dann konnte man das kurz im YouTube Editor anklicken die die 5 Sekunden rausschneiden"}, {"id": 146, "start": 1129.58, "end": 1139.54, "text": "und direkt wieder rendern lassen ohne neu hochzuladen. Das war echt praktisch. Und das"}, {"id": 147, "start": 1139.54, "end": 1147.78, "text": "ist halt Müll jetzt. So genau jetzt muss man irgendwie hier hin und dann zurück in"}, {"id": 148, "start": 1147.78, "end": 1160.02, "text": "die Stadt wenn ich das richtig in Erinnerung habe. Muss jetzt irgendwie mit dem Typ reden."}, {"id": 149, "start": 1160.02, "end": 1170.1, "text": "Ne mit dem Typ musste man nicht reden. Leute warum kriege ich keine Quests rechts angezeigt."}, {"id": 150, "start": 1170.1, "end": 1178.42, "text": "Wo ist meine Questanzeige. Kann man die ausblenden habe ich das irgendwie jetzt verdrückt wo"}, {"id": 151, "start": 1178.42, "end": 1189.38, "text": "ist meine Questanzeige. Das kann man überhaupt nicht ausblenden oder. Das kann man auch gar"}, {"id": 152, "start": 1189.38, "end": 1211.3, "text": "nicht ausblenden. Alter das ist übelster Crap alles."}, {"id": 153, "start": 1211.3, "end": 1239.66, "text": "Das ist auch übelster Crap. Noch mehr Crap. Das ist auch Crap. Aber wo sind meine Questanzeige"}, {"id": 154, "start": 1239.66, "end": 1259.78, "text": "denn. Warum ist die Questanzeige weg. Verstehe. Jetzt ist. Moment ich bin verwirrt. Was muss"}, {"id": 155, "start": 1259.78, "end": 1266.78, "text": "ich nochmal machen. Ok warte mal ich muss doch nochmal in die Guide gucken das ist zu"}, {"id": 156, "start": 1266.78, "end": 1275.54, "text": "lange her da ich das gemacht habe. Das habe ich gemacht. Defeat. Speak habe ich gemacht."}, {"id": 157, "start": 1275.54, "end": 1279.66, "text": "Achso da muss ich noch mit dem anderen Typ in der Stadt reden. Ok. Und dann wieder hin."}, {"id": 158, "start": 1279.66, "end": 1304.86, "text": "Excellent Quest. Excellent. So und jetzt muss ich wieder zurück na. Ja genau ja ja habe"}, {"id": 159, "start": 1304.86, "end": 1311.66, "text": "ich. Ah jetzt genau. So und was war jetzt als nächstes. Jetzt muss ich dieses dieses"}, {"id": 160, "start": 1311.66, "end": 1328.42, "text": "Sanddingen killen. Also die ersten 5 Acts kriege ich komplett ohne irgendwie eine Guide"}, {"id": 161, "start": 1328.42, "end": 1333.42, "text": "zu gucken hin. Das ist total simpel. Weil ich. Den kann ich mir irgendwie besser merken"}, {"id": 162, "start": 1333.42, "end": 1340.9, "text": "aber die letzten Acts habe ich jetzt schon so lange nicht mal gemacht. Foothills brauche"}, {"id": 163, "start": 1340.9, "end": 1356.62, "text": "ich. Oh was ist das. Was ich ja in Persow Exile echt nice finde ist. Dass irgendwie"}, {"id": 164, "start": 1356.62, "end": 1364.66, "text": "jedes Season ist ein anderes Bild fortem. Sandpit kann ich Sandpit nicht den Boss jetzt"}, {"id": 165, "start": 1364.66, "end": 1371.1, "text": "schon machen. Doch oder. Da muss ich ich muss jetzt nicht Foothills ich kann schon Sandpit"}, {"id": 166, "start": 1371.1, "end": 1391.66, "text": "den Boss machen. Oh Alter da macht er Damage. Macht er so viel Damage. Lull. Ach genau jetzt"}, {"id": 167, "start": 1391.66, "end": 1397.5, "text": "muss man ja hinterher rennen. Der Boss war übelst Resident Sleeper da konnte überhaupt"}, {"id": 168, "start": 1397.5, "end": 1408.1, "text": "nichts. Und ich glaube man musste alle Skorpione killen weil er sonst nicht weiter läuft. Residen"}, {"id": 169, "start": 1408.1, "end": 1416.66, "text": "Sleeper Boss. Gut ich meine ich mache auch OP Damage. Was will der machen. Angeblich"}, {"id": 170, "start": 1416.66, "end": 1428.74, "text": "ist das Bild Endgame mäßig. Ziemlich. Ressourcen intensiv. Also weil es so viele"}, {"id": 171, "start": 1428.74, "end": 1440.7, "text": "Effekte hat. Alter. Alter jetzt ist er Skorpion. Ist er gut hier. Ist das Chaos ist das Chaos"}, {"id": 172, "start": 1440.7, "end": 1463.74, "text": "Damage. Ich habe Scheiß Chaos Resis. Was Akt 6 ist ein Schlauch. Es ist alles. Eigentlich"}, {"id": 173, "start": 1463.74, "end": 1468.02, "text": "mein Problem mit den letzten zwei Akten ist nur dass ich die so selten gemacht habe bzw."}, {"id": 174, "start": 1468.02, "end": 1474.7, "text": "dass es noch so lange her ist. Da ich mich da nicht mehr dran erinnern kann. Die anderen"}, {"id": 175, "start": 1474.7, "end": 1482.58, "text": "sind nicht. Eigentlich ist die Kampagne übelst kurz. Also wenn man einfach nur durch rennt."}, {"id": 176, "start": 1482.58, "end": 1486.9, "text": "Ich habe mir ja ein paar Speedruns schonmal angeguckt. Die meisten rennen durch das komplette"}, {"id": 177, "start": 1486.9, "end": 1492.38, "text": "Game durch. Dann Farmen die hier anfangen. Anfang dieses Actes wird ein bisschen gefarbt"}, {"id": 178, "start": 1492.38, "end": 1496.14, "text": "ein paar Level und dann wird wieder durch gerannt. Ich weiß nicht was der Weltrekord"}, {"id": 179, "start": 1496.14, "end": 1505.5, "text": "ist für die Kampagne. 2,5 Stunden oder so wahrscheinlich. Bis Akt 10. 2,5 Stunden 3"}, {"id": 180, "start": 1505.5, "end": 1512.74, "text": "Stunden oder so. Keine Ahnung was der Weltrekord ist. Kann er jetzt mal stehen bleiben ich"}, {"id": 181, "start": 1512.74, "end": 1530.5, "text": "will ihn killen. Easy. Auf extra here mal ein bisschen schneller. Saug sie aus. So talk"}, {"id": 182, "start": 1530.5, "end": 1541.78, "text": "die was. Reduced Chaos Damage. Das ist gut das nehmen wir mal. Wie es die Leute selbst"}, {"id": 183, "start": 1541.78, "end": 1546.62, "text": "time outen. Eigentlich die sinnloseste Funktion er war. Aber irgendwie machen es trotzdem"}, {"id": 184, "start": 1546.62, "end": 1552.66, "text": "genug. Ja was ich an dem Game halt wirklich nice finde warum ich es auch immer mal wieder"}, {"id": 185, "start": 1552.66, "end": 1558.42, "text": "spiele jetzt. Schon seit einer Weile ist. Es ist jede Season ist irgendwie was anderes"}, {"id": 186, "start": 1558.42, "end": 1565.78, "text": "angesagt. Von davor habe ich irgendwie. Aber ich spiele immer nur Noob Builds. Es sind"}, {"id": 187, "start": 1565.78, "end": 1570.38, "text": "immer nur Kack Noob Builds. Ich gucke mir das vorher im Forum im Streams auf Reddit"}, {"id": 188, "start": 1570.38, "end": 1579.38, "text": "sonst wo an. Was die aktuellen Noob Builds sind. Und dann spiele ich nur Noob Builds."}, {"id": 189, "start": 1579.38, "end": 1586.82, "text": "Easy Mode Builds spiele ich immer nur. Vorletzte Season das Necromancer Build war auch übelst"}, {"id": 190, "start": 1586.82, "end": 1590.82, "text": "Noob Build. Einfach ein paar Zombies casten und quer über die Map rennen und gut war."}, {"id": 191, "start": 1590.82, "end": 1606.66, "text": "Das könnte ich jetzt eigentlich auch schon machen klar. Ach nee das kommt erst noch."}, {"id": 192, "start": 1606.66, "end": 1623.38, "text": "Wie geht es denn hier lang. Die Level Generierung die Random Level Generierung ist manchmal"}, {"id": 193, "start": 1623.38, "end": 1629.54, "text": "komisch. Ich habe das Gefühl man kann man kann eigentlich kaum falsch laufen so doof"}, {"id": 194, "start": 1629.54, "end": 1635.18, "text": "es klingt. Wenn man die Map einfach nur lang genug abläuft in eine Richtung habe ich"}, {"id": 195, "start": 1635.18, "end": 1642.02, "text": "das Gefühl spawnt der Ausgang automatisch immer. Das ist gerade bei diesen riesen Dungeon"}, {"id": 196, "start": 1642.02, "end": 1648.14, "text": "Levels ist das finde ich ziemlich kommt einem zumindest so vor. Man läuft einfach die ganze"}, {"id": 197, "start": 1648.14, "end": 1652.66, "text": "Zeit in eine Richtung und irgendwann spawnt der Ausgang. Also so als würde die Map nicht"}, {"id": 198, "start": 1652.66, "end": 1659.94, "text": "beim Betreten komplett generiert sondern als würde die Map on the fly generiert. Aber"}, {"id": 199, "start": 1659.94, "end": 1663.66, "text": "das stimmt wahrscheinlich nicht. Das wäre irgendwie beknackt aber kommt mir irgendwie"}, {"id": 200, "start": 1663.66, "end": 1673.9, "text": "so vor. Gibt es aber bestimmt schon 30 Milliarden Analysen zu. Okay so viel zu man kann sich"}, {"id": 201, "start": 1673.9, "end": 1687.22, "text": "nicht verlaufen. Wo ist denn der Ausgang hier. Foothills muss ich. Wo ist hier Foothills"}, {"id": 202, "start": 1687.22, "end": 1698.74, "text": "wo geht es hier lang. Ist hier erstmal alles schreddern. Ach nee die hier oben muss ich"}, {"id": 203, "start": 1698.74, "end": 1705.86, "text": "killen. Das war doch auch das ist doch auch irgendeine Leak Mechanic hier. Das habe ich"}, {"id": 204, "start": 1705.86, "end": 1711.1, "text": "bis heute nicht gecheckt wie das funktioniert. Das ist eines der 30 Milliarden Passive Exile"}, {"id": 205, "start": 1711.1, "end": 1724.94, "text": "End Game Mechanics die ich nicht checke. Au wow Monka. Okay vielleicht sollte man nicht"}, {"id": 206, "start": 1724.94, "end": 1749.94, "text": "so viel stehen bleiben. Wow ich habe meine spells nicht gestartet. Moment. Ach man muss"}, {"id": 207, "start": 1749.94, "end": 1757.46, "text": "die Wand kaputt machen. Und dann rein und innen die Baschen oder. Okay was auch immer."}, {"id": 208, "start": 1757.46, "end": 1764.42, "text": "Ich musste die Mechanics letzte Leak nicht machen weil ich hatte einfach meine Zombies"}, {"id": 209, "start": 1764.42, "end": 1778.22, "text": "die haben alles gekillt. Muss ich denn jetzt hier machen überhaupt. Ich musste hier unten"}, {"id": 210, "start": 1778.22, "end": 1784.62, "text": "die Baschen. What the fuck warum machen die so viel Damage. Okay vielleicht sollte man"}, {"id": 211, "start": 1784.62, "end": 1789.1, "text": "sich mal lieber bewegen. So und da habe ich keinen Plastenschimmer was ich hier machen"}, {"id": 212, "start": 1789.1, "end": 1799.26, "text": "muss. Ich habe keinen Plan. Das ist irgendwie so eine Art Kartenspiel oder so. Wo man Items"}, {"id": 213, "start": 1799.26, "end": 1802.42, "text": "bekommen kann wenn man es richtig macht. Ich habe keinen Plastenschimmer wie es funktioniert."}, {"id": 214, "start": 1802.42, "end": 1825.7, "text": "Null Plan. Absolut Null Plan. Absolut keine Ahnung was ich da mache. Sucked. Sucked."}, {"id": 215, "start": 1825.7, "end": 1841.46, "text": "Bini Inni Bitor ich spiele trotzdem Noob Spellslinger im Bild. Weißt du was das Noob Bild ist weil"}, {"id": 216, "start": 1841.46, "end": 1850.06, "text": "alle überall rumheulen dass das OP ist. Und dass das wohl genervt wird. Macht das immer"}, {"id": 217, "start": 1850.06, "end": 1855.42, "text": "so. League davor habe ich nicht gespielt und die League davor habe ich das größte Noob"}, {"id": 218, "start": 1855.42, "end": 1866.46, "text": "Necromancer Bild ever gespielt. Ach Quatsch Moment. Sag mal. Bin ich jetzt blöd. Wo geht"}, {"id": 219, "start": 1866.46, "end": 1886.22, "text": "es denn hier raus. Wo geht es denn hier raus. Wird doch da. Ah Moment ich muss was Tiri Desert"}, {"id": 220, "start": 1886.22, "end": 1896.3, "text": "und gar nicht Oasis ach so. Ich bin im falschen Gebiet. Alter RIP. Sag mir das doch mal einer."}, {"id": 221, "start": 1896.3, "end": 1903.74, "text": "Total sinnlos jetzt hier die Map geklärt den Ausgang gesucht dabei ist er gar nicht"}, {"id": 222, "start": 1903.74, "end": 1930.1, "text": "hier. Hier Foothills. Wo sind die Foothills. Wie gesagt ich habe mal einen Speedrun angeguckt"}, {"id": 223, "start": 1930.1, "end": 1937.9, "text": "und ich weiß nicht wo der Weltrekord ist aber die sind übelst krass drauf. Speedruns muss"}, {"id": 224, "start": 1937.9, "end": 1941.66, "text": "man sagen das ist hier eine Sache das wird sogar vom Hersteller gefördert das gibt ab"}, {"id": 225, "start": 1941.66, "end": 1956.78, "text": "und zu mal so offizielle Time Attack Leaks. Ah hier muss ich lang. Genau und jetzt muss"}, {"id": 226, "start": 1956.78, "end": 1983.7, "text": "ich Boiling Lake. Upper Riot Part. Exzellent. Upper Riot Part. Guck mal tropfen schon die"}, {"id": 227, "start": 1983.7, "end": 1997.78, "text": "ersten Maps. Es gibt sich am letzten so eine ich glaube von Masset war das sogar auf Twitch"}, {"id": 228, "start": 1997.78, "end": 2009.18, "text": "habe ich die hatten die hatten so ein Speedrun. Speedrun League Event über drei Tage mit"}, {"id": 229, "start": 2009.18, "end": 2013.54, "text": "verschiedenen Goals was weiß ich irgendwie bis zum ersten Boss dreimal hintereinander"}, {"id": 230, "start": 2013.54, "end": 2018.74, "text": "dann irgendwie bis zum ersten bis zur Hälfte der Kampagne und sowas und die Leute sind"}, {"id": 231, "start": 2018.74, "end": 2023.66, "text": "abgegangen Alter sag ich euch die haben das die haben das gefühlt die haben die können"}, {"id": 232, "start": 2023.66, "end": 2046.42, "text": "das Blindfolded spielen. Wo ist eigentlich meine Quest Anzeige? Also ich weiß was ich"}, {"id": 233, "start": 2046.42, "end": 2059.74, "text": "machen muss ich muss dieses eine Viech killen. Wo ist meine Quest Anzeige hin? Nein nein"}, {"id": 234, "start": 2059.74, "end": 2063.9, "text": "nein nein nein. Ich hab die immer rechts gehabt die Quest und außerdem wenn ich die"}, {"id": 235, "start": 2063.9, "end": 2067.46, "text": "weg mache sind die auch nicht da. Hab ich die aus Versehen ausgeblendet irgendwie vorhand?"}, {"id": 236, "start": 2067.46, "end": 2071.98, "text": "Ich muss mal gucken ich glaube ich hab meine Quest Anzeige aus Versehen ausgeblendet. Muss"}, {"id": 237, "start": 2071.98, "end": 2080.98, "text": "gleich mal in den Settings schauen wenn ich den Schritt hier fertig hab. Aber ich clear"}, {"id": 238, "start": 2080.98, "end": 2085.78, "text": "das mal mal gucken wo ich ich hab's irgendwie aus Versehen hab ich die Quest Anzeige ausgeblendet."}, {"id": 239, "start": 2085.78, "end": 2099.58, "text": "Options. Wo kann man das überhaupt einstellen UI? Aha okay schon viel besser. Schon viel"}, {"id": 240, "start": 2099.58, "end": 2105.26, "text": "besser. Jetzt weiß ich wenigstens was ich machen muss. Dann hätte ich vorher auch nicht"}, {"id": 241, "start": 2105.26, "end": 2131.58, "text": "ewig eine Zone abgecrimet weil da hätte ich gesehen wo ich hin muss. Exzellent. Wo ist"}, {"id": 242, "start": 2131.58, "end": 2141.22, "text": "der kack Boss? Was sind Boss-Baschen? Hab ich den übersehen? Yo Max was ist das für"}, {"id": 243, "start": 2141.22, "end": 2151.1, "text": "ein Skill auf deinem Coo? Irgendein Enduring Cry? Das tauntet Gegner aber das gibt einen"}, {"id": 244, "start": 2151.1, "end": 2165.94, "text": "Massive Boost was Life Rack angeht. Hä? Sag mal wo ist denn der Boss? Kill the Basilisk."}, {"id": 245, "start": 2165.94, "end": 2183.38, "text": "Oben rechts. Ja ich war ja oben rechts bis er am Map rannt. Hab ich den übersehen? Wtf?"}, {"id": 246, "start": 2183.38, "end": 2207.18, "text": "Er hat dran vorbei gerannt irgendwie. Bin da oben rechts. Hä? Lul. Weiter rechts. Ah"}, {"id": 247, "start": 2207.18, "end": 2221.38, "text": "kommen wir da Sachen her. Komm mal nen riesen Kackhaufen. Jetzt schreckt Boss. Oh was soll"}, {"id": 248, "start": 2221.38, "end": 2244.46, "text": "das? Versteinerungstelz. Ich glaub es geht los hier. Ok sehr gut fertig. Wtf? Wtf? Warum"}, {"id": 249, "start": 2244.46, "end": 2256.02, "text": "haben die grad 5x das gleiche? Das kann doch nicht sein das ist doch. Ok ich guck mir"}, {"id": 250, "start": 2256.02, "end": 2261.94, "text": "die Tropfs gar nicht an ich schmeiß die immer in Dumpfordner rein und gut ist guck"}, {"id": 251, "start": 2261.94, "end": 2266.1, "text": "ich mir später an. Weil aktuell mach ich eh so viel Damage das hat überhaupt keinen"}, {"id": 252, "start": 2266.1, "end": 2279.78, "text": "Sinn da irgendwie was am Gear zu ändern. Wtf? Moment das kann doch nicht sein das die alles"}, {"id": 253, "start": 2279.78, "end": 2291.34, "text": "das gleiche gedroppt haben. Es sind aber unterschiedliches Gear. Ok das ist entweder der größte Zufall"}, {"id": 254, "start": 2291.34, "end": 2298.3, "text": "ever oder das ist diese Mirror Geschichte. Also sprich es gibt sowas das wenn eine Sache"}, {"id": 255, "start": 2298.3, "end": 2303.18, "text": "tropft dann tropft automatisch ne zweite Sache auch noch. Ok das können wir verkaufen"}, {"id": 256, "start": 2303.18, "end": 2314.54, "text": "weil dafür. Ah ein Skillbuch sehr gut. Weil dafür gibts Fusings. So was müssen wir als"}, {"id": 257, "start": 2314.54, "end": 2321.94, "text": "nächstes skillen. Das haben wir geskillt. Ich glaub die Life Nodes müssen wir skillen"}, {"id": 258, "start": 2321.94, "end": 2327.46, "text": "hier unten. Genug Leben kann man immer also man kann nie genug Leben haben in dem Game."}, {"id": 259, "start": 2327.46, "end": 2336.62, "text": "Also alles hier komplett. Ok exellent machen wir. Increase. Enemys cannot leech life from"}, {"id": 260, "start": 2336.62, "end": 2347.94, "text": "you. 8% increase maximum life. Ok alles klar. Wenn mirrored ist steht das immer dabei."}, {"id": 261, "start": 2347.94, "end": 2353.14, "text": "Ja genau und wenns mirrored ist sind die Items auch gespiegelt. Dann ist das einmal die"}, {"id": 262, "start": 2353.14, "end": 2367.14, "text": "Schuhe so rum einmal die Schuhe so rum. Was muss ich jetzt als nächstes eigentlich machen."}, {"id": 263, "start": 2367.14, "end": 2386.98, "text": "Foothills. Foothills. Ich hab Hunger. Foothills und dann enter the tunnel. Tunnel ist glaub"}, {"id": 264, "start": 2386.98, "end": 2403.1, "text": "oben irgendwo. Durch den Berg. Ach Rick das hab ich mich schon gefragt wie das funktioniert"}, {"id": 265, "start": 2403.1, "end": 2407.38, "text": "weil ich hab das im stream gesehen. Kleiner Tipp du kannst den Walkway auf linksklick"}, {"id": 266, "start": 2407.38, "end": 2410.9, "text": "binden dann verwendest du den automatisch wenn du rum bist. Ich hab mich nämlich schon"}, {"id": 267, "start": 2410.9, "end": 2417.7, "text": "gewundert wie die das hier im stream teilweise machen. Das die quasi permanent beim laufen."}, {"id": 268, "start": 2417.7, "end": 2425.34, "text": "Ich dachte ich dachte schon die haben im Hintergrund irgendwelche Makros an oder so. Haben sie"}, {"id": 269, "start": 2425.34, "end": 2433.7, "text": "aber gar nicht. Ich hab schon gleich hier Hexor vermutet aber sind sie gar nicht. Alter"}, {"id": 270, "start": 2433.7, "end": 2437.86, "text": "der ingame chat ich lese den ingame chat gar nicht. Leute der ingame chat ist hardcore"}, {"id": 271, "start": 2437.86, "end": 2443.82, "text": "pepega. Ich blende den jetzt aus. Alter ich schwör meine maps sind leer. Ich glaube ich"}, {"id": 272, "start": 2443.82, "end": 2456.54, "text": "komme. Der ingame chat ist massive pepega. Richtig hängen geblieben. Das ist wirklich"}, {"id": 273, "start": 2456.54, "end": 2467.3, "text": "mein huge brain. Die Gegner die Leute im chat sind absolut low brain. Warum bin ich überhaupt"}, {"id": 274, "start": 2467.3, "end": 2486.9, "text": "im deutschen chat drinne. Ich geh da jetzt raus. Dead left the dude ist am start. Hier"}, {"id": 275, "start": 2486.9, "end": 2495.42, "text": "der tunnel. Ah ok. Oh ich muss noch Labyrinth stealth machen stimmt. Ich kanns vergessen"}, {"id": 276, "start": 2495.42, "end": 2499.5, "text": "das machen wir gleich noch wenn wir das hier fertig haben. Äh Moment wie lief man noch"}, {"id": 277, "start": 2499.5, "end": 2510.14, "text": "mal chat global. Wobei einfach chat ausmachen. Oder chat. Frage an den twitch chat soll"}, {"id": 278, "start": 2510.14, "end": 2514.98, "text": "ich zur entertainment zweck in den chat anlassen. Weil da ist halt sehr viel low brain geschiss"}, {"id": 279, "start": 2514.98, "end": 2528.74, "text": "drinne. Oder soll ich ausschalten. Ein paar scrolls kann man gebrauchen. Aber rick das"}, {"id": 280, "start": 2528.74, "end": 2536.66, "text": "war ein guter tipp. Ich hab mich schon gefragt wie die das im stream machen. Anlassen ist"}, {"id": 281, "start": 2536.66, "end": 2540.9, "text": "mega witzig. Ich weiß gar nicht warum ich im deutschen chat bin ehrlich gesagt. Normaler"}, {"id": 282, "start": 2540.9, "end": 2545.62, "text": "weile bin ich im global englischen chat. Und gestern hatten sie da irgendwelche riesen"}, {"id": 283, "start": 2545.62, "end": 2553.98, "text": "diskussionen über black life matters und haben sich die einen rassismus kommentare die klinke"}, {"id": 284, "start": 2553.98, "end": 2560.58, "text": "in die hand gegeben. Da ging es dem chat quasi darum wer schafft es noch provokantere sachen"}, {"id": 285, "start": 2560.58, "end": 2569.06, "text": "zu schreiben. So war halt der global englische chat. Weiß ich was die im deutschen chat"}, {"id": 286, "start": 2569.06, "end": 2579.18, "text": "machen. Kann man da rüber jumpen. Oh exzellent. Jump soar. Komm mal es will mich schnetzeln"}, {"id": 287, "start": 2579.18, "end": 2595.22, "text": "aber es kann nicht weil ich zu viel life rack hab. Lull. Lull lull lull lull lull. Exzellent."}, {"id": 288, "start": 2595.22, "end": 2604.14, "text": "Und wenn ich hier durch bin. Acquire was journal. Acquire hab ich. Enter query. Quarry. Quarry."}, {"id": 289, "start": 2604.14, "end": 2611.14, "text": "War das nicht in mw2 map. Ich enter jetzt quarry. Und dann gehe ich das labyrinth machen. Weil"}, {"id": 290, "start": 2611.14, "end": 2616.86, "text": "ich bin eigentlich richtig low brain da ich das labyrinth nicht gemacht hab. Ähm meine"}, {"id": 291, "start": 2616.86, "end": 2622.14, "text": "frage ist mal ich hab ja ein paar leute im chat die ein bisschen plan anscheinend haben"}, {"id": 292, "start": 2622.14, "end": 2628.5, "text": "noch von dem game. Also deutlich mehr als ich. Lohnt sich das jetzt hier überhaupt die sachen"}, {"id": 293, "start": 2628.5, "end": 2633.02, "text": "zu craften. Also was ich gemacht hab ich hab ich hab schon mal ein paar low level tiers"}, {"id": 294, "start": 2633.02, "end": 2641.9, "text": "quasi äh. Entsaftet und in so nen. Vorrats tank gepumpt. Aber meine vorrats tanks sind"}, {"id": 295, "start": 2641.9, "end": 2648.78, "text": "voll. Lohnt sich das jetzt eher die noch im zweiten vorrats tank dahin zu stellen weil"}, {"id": 296, "start": 2648.78, "end": 2656.1, "text": "ich brauch keine crafts aktuell. Also ich ich muss gerade nichts craften. Soll ich soll"}, {"id": 297, "start": 2656.1, "end": 2674.18, "text": "ich den kram jetzt einfach stehen lassen. Keine ahnung ehrlich gesagt. Weil ich kann"}, {"id": 298, "start": 2674.18, "end": 2682.54, "text": "jetzt zwar die ultra nicen sachen craften. Garten layout von reddit. Exzellent. Wer ich"}, {"id": 299, "start": 2682.54, "end": 2695.14, "text": "mir angucken. Ja. Ah stimmt. Genau also bevor ich jetzt den kram quasi verschwende dann"}, {"id": 300, "start": 2695.14, "end": 2706.5, "text": "storage tanks und gedöns. Lohnt sich der kram eigentlich. Dann crafte ich mir storage tanks"}, {"id": 301, "start": 2706.5, "end": 2723.86, "text": "ja. Ist besser. Ähm kann man das austauschen also kann ich jetzt den da. Wait a minute"}, {"id": 302, "start": 2723.86, "end": 2732.54, "text": "wo hab ich wo hab ich mein craft da. Ich könnt den doch jetzt dahinter daneben stellen. Hier"}, {"id": 303, "start": 2732.54, "end": 2750.3, "text": "ab machen. Und da dran machen. Und jetzt könnt ich ja ok passt. Nee. Hä? Und wo ist das"}, {"id": 304, "start": 2750.3, "end": 2769.1, "text": "Problem. Ah. Ach ich kann das mit mehreren tanks verbinden. Nee. Das verbindet sich"}, {"id": 305, "start": 2769.1, "end": 2785.06, "text": "immer nur mit einem tank. Das ist mit beiden verbunden aber das kabel geht nur an eins"}, {"id": 306, "start": 2785.06, "end": 2798.46, "text": "dran. Das kabel das kabel geht doch eindeutig nur hier dran. Ja hats. Ach reicht das wenn"}, {"id": 307, "start": 2798.46, "end": 2813.66, "text": "das daneben steht oder wie. Ach jetzt ist beides gelingt. Ach so. Ok dann geht das doch einfacher."}, {"id": 308, "start": 2813.66, "end": 2821.82, "text": "Genau jetzt kann ich den restlichen kram. Soll ich lieber noch mehr zeug craften oder"}, {"id": 309, "start": 2821.82, "end": 2846.46, "text": "soll ich kondensen. Ich crafte noch mehr kram hier. Ah excellent. Äh ich solls vielleicht"}, {"id": 310, "start": 2846.46, "end": 2867.46, "text": "machen. More ks was what is happening. Die dinger sacken doch und es lohnt sich doch"}, {"id": 311, "start": 2867.46, "end": 2872.66, "text": "in der regel gar nicht aufzuheben. Außer ich hab diesen craft mit dem unic drinnen."}, {"id": 312, "start": 2872.66, "end": 2882.1, "text": "Ne brauch ich alles nicht. Storage tank disperser brauchen wir bestimmt auch öfter sicherlich"}, {"id": 313, "start": 2882.1, "end": 2905.34, "text": "auch noch ein paar tank können wir auch noch craften. Du kannst links posten. Das müsste"}, {"id": 314, "start": 2905.34, "end": 2922.18, "text": "standardmäßig funktionieren. Darfste darfste auch ja. Excellent. Das war klar ne das schon"}, {"id": 315, "start": 2922.18, "end": 2927.7, "text": "optimiertes garten layout gibt. Was sonst. Aber das ist ein typisch perso wechsel da"}, {"id": 316, "start": 2927.7, "end": 2952.7, "text": "gibt es von allem optimierte sachen. Ich hab übrigens die seeds nicht im inf weil ich"}, {"id": 317, "start": 2952.7, "end": 2959.9, "text": "bescheuert bin. Ich hab die seeds in meiner truhe weil ich nicht geguckt hab. Gabs nach"}, {"id": 318, "start": 2959.9, "end": 2963.9, "text": "12 stunden nach release ja das holt mich nicht. Das finde ich im perso wechsel geil da gibt"}, {"id": 319, "start": 2963.9, "end": 2984.34, "text": "es so viele so viele leute die instant zeug optimisern. Eigentlich richtig nice. Oh."}, {"id": 320, "start": 2984.34, "end": 3009.58, "text": "Waren uns gleich wieder zurück in den garten. Das zeug planten. So plant excellent. Volle"}, {"id": 321, "start": 3009.58, "end": 3015.78, "text": "geplantet. Weiter gehts. Hätte ich mal früher gewusst dass man dass man bis zu vier sachen"}, {"id": 322, "start": 3015.78, "end": 3028.58, "text": "in so einem pylon anschließen kann. Tier 2 seed. Was ist was zum teufel ist mit dem"}, {"id": 323, "start": 3028.58, "end": 3037.7, "text": "chat los. Kennt sich wer mit den hunden zack wachsig aus. Die haben echt. Das ist natürlich"}, {"id": 324, "start": 3037.7, "end": 3044.7, "text": "der ort wo man sowas fragt ist in einem online game im main chat. Da kriegt man immer die"}, {"id": 325, "start": 3044.7, "end": 3054.38, "text": "besten tips was sowas anbelangt. Also das ist das optimierte garten. Das muss man mal"}, {"id": 326, "start": 3054.38, "end": 3058.06, "text": "angucken in der hoffnung ich sterbe nicht. Aber selbst wenn passiert ja nichts großartig"}, {"id": 327, "start": 3058.06, "end": 3066.3, "text": "wenn man stirbt. Sag mal bring ich das durcheinander. Oder hatte perso wechsel bei release. Items"}, {"id": 328, "start": 3066.3, "end": 3075.86, "text": "die man reparieren musste. Oder bring ich das mit Diablo 3 durcheinander. So 2000 2013"}, {"id": 329, "start": 3075.86, "end": 3087.42, "text": "oder so als es rausgekommen ist. Oder bring ich das mit Diablo 3 durcheinander. Was macht"}, {"id": 330, "start": 3087.42, "end": 3096.42, "text": "ein timeout. Naja es wirft dich kurz raus aus dem chat. So das ist das optimierte garten"}, {"id": 331, "start": 3096.42, "end": 3103.22, "text": "layout. P ist ein pylon disperser disperser horty crafters. Ah big brain das muss ich"}, {"id": 332, "start": 3103.22, "end": 3113.34, "text": "das muss ich mir mal garen setup garen layout garen. Exzellent. Das so wow was ist es storage."}, {"id": 333, "start": 3113.34, "end": 3121.34, "text": "Die leute sind so krass drauf ey was perso wechsel angeht. Das hast du schon 12 stunden"}, {"id": 334, "start": 3121.34, "end": 3127.22, "text": "nach release. Ich hab letztens einen gesehen im stream. Der hat gecraftet mit dem garten"}, {"id": 335, "start": 3127.22, "end": 3134.3, "text": "zeug. Und ich hab überhaupt nicht gecheckt was der macht. Der hat gecraftet und hat gesagt"}, {"id": 336, "start": 3134.3, "end": 3138.66, "text": "ok jetzt blockier ich jetzt hier den einen prefix drauf und dann kräfte ich mir den"}, {"id": 337, "start": 3138.66, "end": 3143.38, "text": "anderen prefix. Und ich weiß genau dass es nur zwei prefix zur auswahl gibt. Und danach"}, {"id": 338, "start": 3143.38, "end": 3147.82, "text": "blockier ich das irgendwie mit einem craft von meinem table. Und dann mach ich irgendwie"}, {"id": 339, "start": 3147.82, "end": 3157.06, "text": "noch nen extra essence craft wie heißt das andere catalyst craft oder so drauf. Und dann"}, {"id": 340, "start": 3157.06, "end": 3160.58, "text": "geh ich nochmal in den garten und dann mach ich nen craft drauf. Und dann gibt es nur"}, {"id": 341, "start": 3160.58, "end": 3166.18, "text": "noch einen mod der auf das item kommen kann. Und das craft ich mir drauf. Und ich hab vor"}, {"id": 342, "start": 3166.18, "end": 3172.82, "text": "dem stream gesessen und hab einfach nur da gesessen und hab gedacht was? Was macht er?"}, {"id": 343, "start": 3172.82, "end": 3179.58, "text": "Also es war ein englischer stream deswegen hab ich versucht es halbwegs wiederzugeben."}, {"id": 344, "start": 3179.58, "end": 3185.22, "text": "Ich hab keine ahnung gehabt was er macht. Also ich hab's schon verstanden letztendlich"}, {"id": 345, "start": 3185.22, "end": 3193.18, "text": "was er macht. Aber ich habe nicht die in game mechanics dazu kapiert. Also was ich kapiert"}, {"id": 346, "start": 3193.18, "end": 3196.94, "text": "habe ist ja du kannst verschiedene sachen blocken auf dem item und wenn du dann craftest"}, {"id": 347, "start": 3196.94, "end": 3201.28, "text": "dann hast du ne größere chance das zu kriegen was du willst. Und manchmal craftest du gezielt"}, {"id": 348, "start": 3201.28, "end": 3204.94, "text": "fast was du nicht willst weil du das dann wieder wegcraften kannst und dann hast du"}, {"id": 349, "start": 3204.94, "end": 3209.66, "text": "die chance quasi sehr hoch dass du das kriegst was du willst und so komische dinger. Das"}, {"id": 350, "start": 3209.66, "end": 3219.5, "text": "hat schon alles eingeleucht aber es war richtig big brain. Es war excellent. Aber alles in"}, {"id": 351, "start": 3219.5, "end": 3223.98, "text": "allem muss man sagen man braucht das in dem game nicht unbedingt wenn man noob builds"}, {"id": 352, "start": 3223.98, "end": 3232.54, "text": "spielt so wie ich. Also wie vor 2 liegt das necromancer zombie build. Ich konnte tier"}, {"id": 353, "start": 3232.54, "end": 3238.42, "text": "15 maps machen absolut easy mode. Und ich hab einfach wie verrückt maps gefarbt und"}, {"id": 354, "start": 3238.42, "end": 3244.1, "text": "hab mir dann recht gutes gear gekauft und fertig durchgespielt. Also das spiel ist nicht"}, {"id": 355, "start": 3244.1, "end": 3248.74, "text": "schwer in dem sinn. Wenn man allerdings die einzelheiten kapieren will ist das ein hardcore"}, {"id": 356, "start": 3248.74, "end": 3255.06, "text": "big brain game. Oder wenn man quasi bei dem league start direkt vorne mit dabei sein will"}, {"id": 357, "start": 3255.06, "end": 3261.02, "text": "oder solche sachen. Das ist ultra big brain dann. So wir machen jetzt das labyrinth. Das"}, {"id": 358, "start": 3261.02, "end": 3265.42, "text": "hab ich nämlich noch gar nicht gemacht. Also das zweite labyrinth hab ich noch gar nicht"}, {"id": 359, "start": 3265.42, "end": 3277.66, "text": "gemacht. Also erklärung. Es gibt nämlich die haben sich nämlich gedacht die leute"}, {"id": 360, "start": 3277.66, "end": 3282.58, "text": "über pass or fax sein haben sich gedacht der skill tree ist noch nicht groß genug. Also"}, {"id": 361, "start": 3282.58, "end": 3289.7, "text": "chat ich glaub das gefühl verstehen wir alle. Der skill tree der reicht nicht. Der hat zu"}, {"id": 362, "start": 3289.7, "end": 3295.94, "text": "wenig möglichkeiten. Und deswegen haben die sich gedacht wir müssen noch für jede klasse"}, {"id": 363, "start": 3295.94, "end": 3305.9, "text": "3 aufstiegs upgrade trees schaffen. Also sprich jede startklasse hat 3 möglichkeiten. Also"}, {"id": 364, "start": 3305.9, "end": 3311.1, "text": "beispielsweise wenn man witch spielt kann man einmal hier necro specken. Man kann element"}, {"id": 365, "start": 3311.1, "end": 3315.26, "text": "damage und occult damage oder irgendwie sowas. Also 3 verschiedene upgrade pfade gibt es"}, {"id": 366, "start": 3315.26, "end": 3320.86, "text": "da noch. Das ist halt der necromancer upgrade fad und damit man das specken kann muss man"}, {"id": 367, "start": 3320.86, "end": 3326.86, "text": "durch so ein komisches labyrinth durch. So und das labyrinth muss man 4 mal durchspielen"}, {"id": 368, "start": 3326.86, "end": 3331.1, "text": "immer ein bisschen schwerer. Ich mach jetzt das zweite. Und das letzte kann man nur durchspielen"}, {"id": 369, "start": 3331.1, "end": 3341.98, "text": "wenn man in endgame areas 6 dungeons vorher gemacht hat. Also der grind ist real. Ja und"}, {"id": 370, "start": 3341.98, "end": 3346.22, "text": "das kommt ja auch noch dazu. Es gibt jetzt neue gems die den skill tree erweitern. Also"}, {"id": 371, "start": 3346.22, "end": 3351.94, "text": "wenn du am rand des skill trees bist und dort was sockelst dann erweitert das den skill tree"}, {"id": 372, "start": 3351.94, "end": 3357.62, "text": "noch mal. Ich hab schon ein paar skill things. Später gucken was ich dann eigentlich genau"}, {"id": 373, "start": 3357.62, "end": 3367.86, "text": "sockeln muss. Achja und der quiff bei dem labyrinth ist, dass wenn man stirbt muss man von vorne"}, {"id": 374, "start": 3367.86, "end": 3377.18, "text": "anfangen. Also das ist quasi die mini hardcore variante. Also sprich wenn man jetzt hier"}, {"id": 375, "start": 3377.18, "end": 3384.14, "text": "drin stirbt muss ich wieder von vorne anfangen in dem labyrinth. Aber ich bin maßlos overleveled"}, {"id": 376, "start": 3384.14, "end": 3398.82, "text": "für dieses ding das sollte eigentlich kein problem sein. Ja der echte gl der kennt sich"}, {"id": 377, "start": 3398.82, "end": 3407.34, "text": "aus wie es aussieht. Ja da gibt es noch mehr. Es gibt so ein endlos dungeon das ist ein"}, {"id": 378, "start": 3407.34, "end": 3414.22, "text": "bisschen wie rifts in diablo. Ist doch rifts in diablo oder? Und dort gibt es dann auch"}, {"id": 379, "start": 3414.22, "end": 3418.42, "text": "verschiedene bereiche wo man dann verschiedene, also es gibt dann einen kälte bereich, einen"}, {"id": 380, "start": 3418.42, "end": 3421.58, "text": "hitze bereich und sonst was. Da hat man dann wieder unterschiedliche chancen verschiedene"}, {"id": 381, "start": 3421.58, "end": 3427.22, "text": "items zu droppen wenn man es haben will. Oder drops zu bekommen. So und hier sieht man wo"}, {"id": 382, "start": 3427.22, "end": 3430.54, "text": "wir im labyrinth gerade sind. Das heißt wenn wir hier durch die tür gehen kommen wir in"}, {"id": 383, "start": 3430.54, "end": 3444.9, "text": "dieses gebiet. Machen wir einfach mal. Da rush ich aber jetzt wirklich nur durch weil"}, {"id": 384, "start": 3444.9, "end": 3453.38, "text": "es lohnt sich für mich überhaupt nicht hier. Es gibt keine xp richtig. Ich will einfach"}, {"id": 385, "start": 3453.38, "end": 3473.62, "text": "nur möglichst schnell durch. Oh mokka spikes. Mokka spikes. Lull. Er ist"}, {"id": 386, "start": 3473.62, "end": 3498.38, "text": "mal durch rennen. Ja ich wollte zu schnell durch. So nächste location. Trial ok. Ich"}, {"id": 387, "start": 3498.38, "end": 3503.94, "text": "charge immer durch durch die traps. Gerade mit dem instant heal zwischendurch ist kein"}, {"id": 388, "start": 3503.94, "end": 3508.3, "text": "Ding. So man muss den boss dreimal killen und beim dritten mal hat man es geschafft."}, {"id": 389, "start": 3508.3, "end": 3528.98, "text": "Aber das sagt er kann nix. Zum übelsten Kack noob. Ich glaube das labyrinth war mal schwer"}, {"id": 390, "start": 3528.98, "end": 3538.26, "text": "als es neu war. Und auch das allerletzte labyrinth ist nicht schwer. Vielleicht, vielleicht"}, {"id": 391, "start": 3538.26, "end": 3541.82, "text": "nicht ist das aber vielleicht erzähle ich auch Mist. Weil das allerletzte labyrinth"}, {"id": 392, "start": 3541.82, "end": 3546.74, "text": "habe ich halt nur einmal bis jetzt gespielt wo ich mein massive op zombie necro hatte."}, {"id": 393, "start": 3546.74, "end": 3558.1, "text": "Kommt man hier vielleicht auch ohne fallen stels durch. Nee man muss fallen stels machen"}, {"id": 394, "start": 3558.1, "end": 3577.38, "text": "ok. Ich sage ich sprich bei dir eigentlich aus. Ich sage ich sage. Richtiger Kack noob."}, {"id": 395, "start": 3577.38, "end": 3590.3, "text": "Big brain. Nee. Moment hier gehts gar nicht weiter. Ah da hinten gehts bestimmt lang"}, {"id": 396, "start": 3590.3, "end": 3615.5, "text": "he. Ah yes. Exzellent. So. Ohne minimap kann man das game nicht spielen. Izaro. Ach izaro"}, {"id": 397, "start": 3615.5, "end": 3621.26, "text": "stimmt der sprecher sagt er manchmal. Ja ist recht. Wobei ich mir die Sachen selten anhöre."}, {"id": 398, "start": 3621.26, "end": 3629.54, "text": "Ah. Warum muss das labyrinth diesmal so labyrinthig sein. Normalerweise ist das gar nicht so labyrinthig"}, {"id": 399, "start": 3629.54, "end": 3641.34, "text": "sonst sondern einfach durch rushbar. Nein den kram will ich überhaupt nicht. Ich will"}, {"id": 400, "start": 3641.34, "end": 3652.86, "text": "einfach nur den ausgang haben. Muss ich jetzt wieder zurück laufen. Ah da unten gehts lang"}, {"id": 401, "start": 3652.86, "end": 3660.62, "text": "guck mal da unten gehts lang hier. Lockt. Warum ist das locked. Ah weil hebel vergessen"}, {"id": 402, "start": 3660.62, "end": 3681.58, "text": "zu drücken. Jetzt aber. Moment da war ich doch schon. Moment da unten ist ja auch nix."}, {"id": 403, "start": 3681.58, "end": 3690.66, "text": "Wait a minute. Wo gehts denn hier lang. Ich bin verwirrt. Bin ich in der Sackgasse gelandet"}, {"id": 404, "start": 3690.66, "end": 3696.1, "text": "kann das sein. Aber ich kann nicht in der Sackgasse nach dem Trial gelandet sein. Ach"}, {"id": 405, "start": 3696.1, "end": 3704.34, "text": "nee da gehts ja weiter. Wenn du ohne plan ein Bild zusammen bastelst. Ja das ist eigentlich"}, {"id": 406, "start": 3704.34, "end": 3710.18, "text": "das größte Fehler die man in passive exile machen kann. Find ich. Wenn man schon kein"}, {"id": 407, "start": 3710.18, "end": 3715.94, "text": "Plan von dem Game hat wie ich dann sucht man sich wenigstens ein OP Bild raus und ist glücklich."}, {"id": 408, "start": 3715.94, "end": 3727.58, "text": "Aber das unterscheidet den Noob in passive exile vom Noob in online games. Der Noob"}, {"id": 409, "start": 3727.58, "end": 3732.1, "text": "in online games kommt nicht auf die Idee sich einen Guide durchzulesen und sich ein OP Bild"}, {"id": 410, "start": 3732.1, "end": 3737.38, "text": "rauszusuchen. Der Noob in passive exile weiß dass er ein Noob ist und sucht sich ein OP"}, {"id": 411, "start": 3737.38, "end": 3744.7, "text": "Bild raus für easy mode. Oder aber Leute machen es absichtlich. Das ist ja wieder"}, {"id": 412, "start": 3744.7, "end": 3751.22, "text": "was anderes. Dann weißt du aber dass du es absichtlich machst. Das ist ja was anderes"}, {"id": 413, "start": 3751.22, "end": 3755.54, "text": "na. Wenn man Builds ausprobiert und das absichtlich machts ja was anderes. Aber es gibt viele"}, {"id": 414, "start": 3755.54, "end": 3765.62, "text": "Leute die gimpen sich absichtlich. Moment ist das jetzt besser oder schlechter. Ach"}, {"id": 415, "start": 3765.62, "end": 3794.02, "text": "ne die sacken weil du nur zwei Charges hast. Crap. Oh Sägeplätters. Auch wenn man Plan"}, {"id": 416, "start": 3794.02, "end": 3798.38, "text": "hat sucht man sich ein Bild raus. Ja es gibt schon ein paar richtige Big Brains hier in"}, {"id": 417, "start": 3798.38, "end": 3806.18, "text": "dem Game. Die auch gute Builds zusammen basteln. Ich glaube wenn man eine Weile gespielt hat"}, {"id": 418, "start": 3806.18, "end": 3813.06, "text": "wird man dann. Ich mein so ein 100% neues Build wird man mit halt die Sachen auf seinen"}, {"id": 419, "start": 3813.06, "end": 3820.18, "text": "Spielstil irgendwie anpassen. Weil man halt weiß was man macht. Ich denke mal dass auch"}, {"id": 420, "start": 3820.18, "end": 3825.66, "text": "in Path of Exile die Möglichkeiten der richtig guten Skill Kombination beschränkt sind."}, {"id": 421, "start": 3825.66, "end": 3831.7, "text": "Dann hast du keine Ahnung 20 30 Sachen die vielleicht spielbar sind im Endgame. Der Rest"}, {"id": 422, "start": 3831.7, "end": 3844.18, "text": "sind Varianten davon. Oder vielleicht sogar noch weniger und der Rest sind Varianten von."}, {"id": 423, "start": 3844.18, "end": 3850.26, "text": "Oh ne jetzt labert er wieder. Oh ne ne ich geh in die andere Richtung ich hab kein Bock"}, {"id": 424, "start": 3850.26, "end": 3856.82, "text": "auf Labyrinth Stels. Ich will einfach ins nächste Gebiet. Kockier easy. Gut dass wir"}, {"id": 425, "start": 3856.82, "end": 3865.34, "text": "da unten nicht langgegangen sind. PoE Kreiselkrain so siehts aus. So erstmal die ganzen Müll"}, {"id": 426, "start": 3865.34, "end": 3877.98, "text": "hier reinschmeißen. Wegdampen. Jetzt mal alles weg. Next. Wieder Noob Boss bashen."}, {"id": 427, "start": 3877.98, "end": 3886.58, "text": "Äh Moment was muss ich ins backen. Äh ich muss mal nach. Ich bin mir grad nicht sicher"}, {"id": 428, "start": 3886.58, "end": 3891.42, "text": "wo ich weitermachen muss im Skilltree. Isarro Noob. Guck mal einer das macht noch immer"}, {"id": 429, "start": 3891.42, "end": 3901.42, "text": "richtig Damage. Und jetzt ist er schon wieder down. Oder auch fast fast down. Was? Ah der"}, {"id": 430, "start": 3901.42, "end": 3907.42, "text": "weiß noch nicht dass er down ist. Der muss ja erst noch seine drei Animationen ausführen."}, {"id": 431, "start": 3907.42, "end": 3916.18, "text": "So was muss ich jetzt specken als nächstes. Ähm. Ah hier. Da. Live Nodes. Live Nodes"}, {"id": 432, "start": 3916.18, "end": 3924.42, "text": "muss ich specken. Stimmt. Hier muss ich jetzt lang. Und dann auf Soul of Steel. Exzellent."}, {"id": 433, "start": 3924.42, "end": 3929.74, "text": "High IQ Exil Sheet. Was? Das ist High IQ Exil Sheet. Ja. Das ist das optimale Pass"}, {"id": 434, "start": 3929.74, "end": 3948.14, "text": "of Exile Garden Setup. So wir sind gleich durch. 2 von 3 Bosskämpfen haben wir schon."}, {"id": 435, "start": 3948.14, "end": 3956.94, "text": "Diese Prophecy Dinger. Das hab ich auch nur zur Hälfte kapiert. Ähm. Oh Leute ich hab"}, {"id": 436, "start": 3956.94, "end": 3960.74, "text": "ich muss grad mal was gucken. Wartet mal. Ich glaub ich übersteuere wieder kann das"}, {"id": 437, "start": 3960.74, "end": 3966.66, "text": "sein? Weil ich hatte Teams an und immer wenn ich Teams an hatte verstellt das mein Mikrofon."}, {"id": 438, "start": 3966.66, "end": 3992.58, "text": "Alter. Wo soll ich mir denn erst. Naja E-Girls.gg. Der Ingame Chat ist wieder pepega extrem."}, {"id": 439, "start": 3992.58, "end": 4008.1, "text": "Ja. Das muss doch sein. Ingame Chats in MMOs sind immer pepega Chat. Oh wie es schleift."}, {"id": 440, "start": 4008.1, "end": 4022.34, "text": "Wie gesagt ich hab gefragt ich soll den Ingame Chat zur Belustigung anlassen hat der Twitch"}, {"id": 441, "start": 4022.34, "end": 4028.5, "text": "gesagt. Da mach ich das. Ich mach die Chats. Ich mach aber auch in MMOs die Chats nicht"}, {"id": 442, "start": 4028.5, "end": 4033.58, "text": "aus. Weil ich find die immer lustig. MMO Chats die sind halt so die Leute meinen das"}, {"id": 443, "start": 4033.58, "end": 4038.14, "text": "da meistens nicht ernst. Die machen das entweder nur zum provozieren oder zum rumtrollen oder"}, {"id": 444, "start": 4038.14, "end": 4043.66, "text": "halt einfach nur zum Entertainment Faktor und Bullshit labern. Auf Twitter ist es wieder"}, {"id": 445, "start": 4043.66, "end": 4047.58, "text": "was anderes. Auf Twitter meinen die Leute immer den ganzen Shit ernst den sie schreiben."}, {"id": 446, "start": 4047.58, "end": 4056.46, "text": "Deswegen hab ich jetzt auch die Twitter Tags ausgeschaltet. Wenn man nämlich auf Twitter"}, {"id": 447, "start": 4056.46, "end": 4061.22, "text": "sein Gebiet auf Andorra setzt bekommt man keine Twitter Trends mehr. Und Twitter Trends"}, {"id": 448, "start": 4061.22, "end": 4067.34, "text": "ist in letzter Zeit das nervigste was es gibt. Ich will keine Twitter Trends mehr. Ich will"}, {"id": 449, "start": 4067.34, "end": 4072.42, "text": "Twitter verwenden aber ehrlich gesagt würde ich Twitter gerne wieder ganz normal benutzen"}, {"id": 450, "start": 4072.42, "end": 4078.06, "text": "ohne mir den ganzen Tag die irgendwelche politisch motivierten Ansichten von irgendwelchen Leuten"}, {"id": 451, "start": 4078.06, "end": 4082.42, "text": "durchlesen zu müssen. Egal von welcher Seite jetzt geht mir alles auf den Sack mittlerweile."}, {"id": 452, "start": 4082.42, "end": 4095.26, "text": "Die sollen mal alle wieder normal werden im Kopf. Ja gehen wir da lang. Das ist echt"}, {"id": 453, "start": 4095.26, "end": 4100.18, "text": "pfeifen. Ja also kann ich euch nur empfehlen stellt euren Twitter Gebiet auf Andorra um"}, {"id": 454, "start": 4100.18, "end": 4108.14, "text": "zu gehen. Ihr habt keine Twitter Trends mehr. Doch doch es gibt Browser Plugins wo du Twitter"}, {"id": 455, "start": 4108.14, "end": 4115.06, "text": "filtern kannst aber da hab ich keinen Bock drauf gehabt mir eins rauszusuchen. Ich bin"}, {"id": 456, "start": 4115.06, "end": 4119.78, "text": "bei Browser Addons mittlerweile ziemlich vorsichtig geworden wenn es nicht riesengroße Browser"}, {"id": 457, "start": 4119.78, "end": 4128.58, "text": "Addons sind. Weil ich hab einmal mir so fast schon Keylogger eingefangen als Browser"}, {"id": 458, "start": 4128.58, "end": 4133.78, "text": "Addon. Es gab nämlich ein Addon das hat auf allen Webseiten Twitch Emotes eingeplendet"}, {"id": 459, "start": 4133.78, "end": 4139.1, "text": "und da dachte ich mir was kann schon schief gehen. Und dieser Typ hat das Addon verkauft"}, {"id": 460, "start": 4139.1, "end": 4145.42, "text": "an Chinesen und die Chinesen haben dann Keylogger eingebaut. Oder vermutlich einen Keylogger"}, {"id": 461, "start": 4145.42, "end": 4150.78, "text": "eingebaut nachdem er das Addon verkauft hat. Und Google hat das halt erst ein paar Wochen"}, {"id": 462, "start": 4150.78, "end": 4159.82, "text": "später gemerkt. Ja und das war halt Fail. Ich mein es hatte keine Auswirkungen zumindest"}, {"id": 463, "start": 4159.82, "end": 4167.06, "text": "keine die ich gemerkt habe aber trotzdem war es halt ziemlich MonkaS. Guck mal Noob"}, {"id": 464, "start": 4167.06, "end": 4194.42, "text": "Zaro wird gebashed jetzt. Mit One Shotted. Kack Noob Alter. Zwei Mal draufgegasste Down."}, {"id": 465, "start": 4194.42, "end": 4201.54, "text": "Die Auto Updates für Addons unbedingt deaktivieren. Ja außer halt für sowas wie Uplog oder so"}, {"id": 466, "start": 4201.54, "end": 4208.26, "text": "da ist es ja wichtig dass man Auto Updates macht. So guck mal was es in den Schatztun"}, {"id": 467, "start": 4208.26, "end": 4220.5, "text": "gibt. Jede Menge To...ok warum nicht. Ist ja fast die Aim Trainer. Halbe Aim Trainer"}, {"id": 468, "start": 4220.5, "end": 4234.42, "text": "hier. Ok mehr hab ich nicht. So habe ich irgendwas dabei was ich versuchen kann zu"}, {"id": 469, "start": 4234.42, "end": 4247.26, "text": "zu Enhancen? Clothes or Boots? Eigentlich nicht. Äh kann irgendwas passieren wenn ich"}, {"id": 470, "start": 4247.26, "end": 4255.82, "text": "die versuche zu Upgrade? Nee oder kann eigentlich nichts passieren. Increase Attack and Cast"}, {"id": 471, "start": 4255.82, "end": 4270.18, "text": "if you kill. Oh das ist ziemlich gut. Das ist sogar ziemlich gut. Huge Addon. So was"}, {"id": 472, "start": 4270.18, "end": 4275.98, "text": "speckern wir denn jetzt? Zweites Labyrinth was speckern wir jetzt? Was sagt mein Pass"}, {"id": 473, "start": 4275.98, "end": 4284.14, "text": "of Building was ich specken...was ich specken will? Das haben wir schon zum Leveln gespeckt"}, {"id": 474, "start": 4284.14, "end": 4290.42, "text": "und jetzt gehen wir hier rüber auf Minion Damage und ja gut das bringt mir jetzt ehrlich"}, {"id": 475, "start": 4290.42, "end": 4295.02, "text": "gesagt noch nichts. Das bringt mir erst was wenn ich auf meine Endgame Spells gewechselt"}, {"id": 476, "start": 4295.02, "end": 4308.78, "text": "hab. Hätte ich mir jetzt auch sparen können. Kann ich nicht irgendwas specken was mir jetzt"}, {"id": 477, "start": 4308.78, "end": 4317.58, "text": "direkt was bringt? Das bringt halbwegs was. Achja by the way Minion Damage bringt mir"}, {"id": 478, "start": 4317.58, "end": 4326.1, "text": "was weil ich hab nen Skill das mein Minion Damage konverte zu Damage für mich. Das heißt"}, {"id": 479, "start": 4326.1, "end": 4337.86, "text": "Minion Damage Minion Damage ist top. Maximum Mana also Mana Probleme hab ich gar keine."}, {"id": 480, "start": 4337.86, "end": 4350.54, "text": "Minion Damage Minion Damage. Ich speck jetzt einfach das da. Kann man das Respecken mit"}, {"id": 481, "start": 4350.54, "end": 4359.34, "text": "nem ganz normalen Respeck Orb oder wie Respeckt man das? Oder muss man nochmal durchs Labyrinth"}, {"id": 482, "start": 4359.34, "end": 4365.98, "text": "durch und kann dann dort Respecken wie man will. 5 Respeck Points ja gut Respeck Points"}, {"id": 483, "start": 4365.98, "end": 4372.86, "text": "hab ich genug. Auf der anderen Seite kann ich das erstmal weglassen. Das ist ja nicht"}, {"id": 484, "start": 4372.86, "end": 4380.5, "text": "so als hätte ich jetzt irgendwie Damage Probleme. Wobei nee Skillen kann ich das nur im Labyrinth"}, {"id": 485, "start": 4380.5, "end": 4389.62, "text": "ne. Moment was geht ich jetzt? Was mach ich denn hier eigentlich jetzt gerade? Ich klick"}, {"id": 486, "start": 4389.62, "end": 4397.62, "text": "gerade den Passive Building rum anstatt richtig hängen geblieben. Was war denn jetzt ursprünglich"}, {"id": 487, "start": 4397.62, "end": 4423.46, "text": "drinnen? Don't save. Was speckt der Dude? Das bringt mir immer überhaupt nix. Voll pepega."}, {"id": 488, "start": 4423.46, "end": 4437.7, "text": "Increased Damage. Na gut das ist ok. Increased Skill Effect Minion Steal. Ich skill das und"}, {"id": 489, "start": 4437.7, "end": 4444.86, "text": "das weil den Kram muss ich später eh skillen. Ich skill die 2 Sachen und beim nächsten Lab"}, {"id": 490, "start": 4444.86, "end": 4450.26, "text": "ach nee Moment. Komm ich skill jetzt einfach das und gut ist da muss ich nachher nicht"}, {"id": 491, "start": 4450.26, "end": 4462.58, "text": "Respecken scheiß drauf. Ich hab eh absolut keine Probleme mit Damage. Bist du deine Endgame"}, {"id": 492, "start": 4462.58, "end": 4471.42, "text": "Gems schon am Level? Teilweise nicht alle nee nee sollte ich wahrscheinlich machen. Aber"}, {"id": 493, "start": 4471.42, "end": 4477.5, "text": "die Dinger leveln doch so schnell. Die leveln doch so schnell bis zu nem brauchbaren Ding"}, {"id": 494, "start": 4477.5, "end": 4482.02, "text": "bis zu nem brauchbaren Level oder? Oder mal ganz nachher was hab ich denn vielleicht kauf"}, {"id": 495, "start": 4482.02, "end": 4498.22, "text": "ich mir die einfach schon auf Level 20? Ich hab ja genug Currency gerade dank DUNK DROP."}, {"id": 496, "start": 4498.22, "end": 4515.06, "text": "Der Endgame Chat ist wirklich richtig pepega gerade. Monarch S. Ok wo sind wir denn stehengeblieben?"}, {"id": 497, "start": 4515.06, "end": 4528.18, "text": "Story. Story mäßig. Was muss ich jetzt als nächstes machen? Das haben wir gemacht"}, {"id": 498, "start": 4528.18, "end": 4537.74, "text": "Enter Tunnel, Aquaria, Waypoint, Labyrinth. Query haben wir Waypoint. Ah hier. Ok Enter"}, {"id": 499, "start": 4537.74, "end": 4561.34, "text": "und Explore. Ok also Refinery. Refinery muss ich jetzt. Das ist irgendwo oben. Da kann"}, {"id": 500, "start": 4561.34, "end": 4568.74, "text": "ich mich doch dran erinnern. Das ist oben auf der Map. Also teilweise level ich mein"}, {"id": 501, "start": 4568.74, "end": 4571.98, "text": "Endgame Zeug schon weil das was ich jetzt gerade verwende kann ich auch für mein Endgame"}, {"id": 502, "start": 4571.98, "end": 4576.66, "text": "Kram brauchen. Aber ich sollte mir wirklich. Wobei ich hab gar keinen Platz gerade für"}, {"id": 503, "start": 4576.66, "end": 4582.74, "text": "meine. Ach stimmt. Ach jetzt genau jetzt weiß ich wieder was du meinst. Man kann ja im zweiten"}, {"id": 504, "start": 4582.74, "end": 4589.02, "text": "Slot. Im zweiten Slot kann man ja seine Endgame Gears leveln. Stimmt das ist richtig big brain."}, {"id": 505, "start": 4589.02, "end": 4596.02, "text": "Da muss ich erstmal gucken was ich eigentlich genau für Endgame Sachen brauch. Oder wie"}, {"id": 506, "start": 4596.02, "end": 4615.02, "text": "gesagt ich kauf mir die Dinger einfach level 20. Ok was soll ich in der Refinery machen"}, {"id": 507, "start": 4615.02, "end": 4623.62, "text": "irgendwas killen. Im Zweifelsfall in Path of Exile immer irgendwas killen. Alter kann"}, {"id": 508, "start": 4623.62, "end": 4647.78, "text": "ich zwar da bleiben. Null. Äh. Ok da unten gehts weiter."}, {"id": 509, "start": 4647.78, "end": 4669.5, "text": "P.P. Gegners. Ah gehts weiter."}, {"id": 510, "start": 4669.5, "end": 4684.66, "text": "Weil warum hab ich den Kram aufgehoben. Warum zeigt denn das mein Loot Filter eigentlich"}, {"id": 511, "start": 4684.66, "end": 4700.14, "text": "so Highlighted an wegen Item Level vielleicht. Alter Crap was war ich damit. Ach ich kann"}, {"id": 512, "start": 4700.14, "end": 4705.34, "text": "mich jetzt wieder erinnern. Genau jetzt muss ich den Boss killen wo so Stromdinger daneben"}, {"id": 513, "start": 4705.34, "end": 4718.22, "text": "stehen. Ich erinnere mich wie der Dunkel. Hier irgendwo ne. Ja. Auch wieder Kack Loot"}, {"id": 514, "start": 4718.22, "end": 4742.7, "text": "Boss kann auch nix. Au au au au. Aha Monkeys. Easy easy blocked. Genau. So und jetzt muss"}, {"id": 515, "start": 4742.7, "end": 4753.14, "text": "ich zurück. Ah da kann ich mich auch noch dran erinnern. Das ist auf der anderen Seite"}, {"id": 516, "start": 4753.14, "end": 4760.42, "text": "vom Waypoint gewesen. Übrigens die Bros die gehen immer nicht auf Town Portal sondern"}, {"id": 517, "start": 4760.42, "end": 4773.82, "text": "die quitten zum Characters Select und ähm. Lassen sich so in die Stadt porten. Moment."}, {"id": 518, "start": 4773.82, "end": 4779.94, "text": "Muss ich runter. Jetzt muss ich runter irgendwo. Und dann ist der Akt auch schon fertig. Aber"}, {"id": 519, "start": 4779.94, "end": 4786.26, "text": "erstmal hier nochmal durch. Noch den anderen Boss killen für den Skillpoint. Die einzigen"}, {"id": 520, "start": 4786.26, "end": 4797.5, "text": "Quests die sich in dem Game lohnen sind Skillpoint Quests. Rest Sackt. Brauchen wir nicht. Wow."}, {"id": 521, "start": 4797.5, "end": 4808.42, "text": "Pepega Boss macht Damage. Warum macht Pepega Boss Damage? Muss man ein bisschen sich bewegen."}, {"id": 522, "start": 4808.42, "end": 4817.3, "text": "Gut bewegen wir uns halt ein bisschen. Die meisten Boss sind ja wirklich nicht schwierig."}, {"id": 523, "start": 4817.3, "end": 4841.74, "text": "Das hat gelackt. Lagos. Oh. Komm jetzt hier. Verrecken."}, {"id": 524, "start": 4841.74, "end": 4852.78, "text": "By the way ich hab keine Ahnung von der Path of Exile Story ne. Also falls mich irgendjemand"}, {"id": 525, "start": 4852.78, "end": 4856.26, "text": "fragen wollt könnt ihr gleich sagen lassen. Ich hab keine Ahnung was eigentlich passiert."}, {"id": 526, "start": 4856.26, "end": 4874.1, "text": "So. Saug saug saus. Gib Skillpoint. Excellent. Nur zum Grinden da. Ja so siehts aus. Was juckt"}, {"id": 527, "start": 4874.1, "end": 4878.58, "text": "was juckt mich die Story. Die Story ist auch echt schlecht. Also das ist ein Punkt da punktet"}, {"id": 528, "start": 4878.58, "end": 4883.7, "text": "Path of Exile wirklich nicht. Die Story Sackt. Ich hab mir mal so ne Story Zusammenfassungsvideo"}, {"id": 529, "start": 4883.7, "end": 4896.38, "text": "angeguckt. Also wer das verbrochen hat ey. Ich eh ja hab ich mir anguckt aber ohne Scheiß"}, {"id": 530, "start": 4896.38, "end": 4901.58, "text": "Elevencore wer die Story verbrochen hat der ist nicht mehr ganz bei Sinn. Das überhaupt"}, {"id": 531, "start": 4901.58, "end": 4911.94, "text": "Story zu nennen ist ja wirklich lächerlicher. So wer gibt mir jetzt die Skillpoints. Irgendjemand"}, {"id": 532, "start": 4911.94, "end": 4920.66, "text": "gibt mir noch Skillpoints. Wer gibt mir Skillpoints. Ah. Excellent. Ein Skillpoint. Das ist gar"}, {"id": 533, "start": 4920.66, "end": 4934.18, "text": "nicht mal schlecht das Schild. Naja. Boots ohne Movement Speed. Das Sackt. Ok. Die haben"}, {"id": 534, "start": 4934.18, "end": 4941.38, "text": "Movement Speed aber keine anderen guten Stats. All resists aber der Rest ist kacke. Na gut."}, {"id": 535, "start": 4941.38, "end": 4953.1, "text": "Machste nix. Kannste immer nur gute Drops haben. So. Muss jetzt noch mit irgendjemand reden"}, {"id": 536, "start": 4953.1, "end": 4962.94, "text": "dass ich hier irgendwas kriege. Sag mal dieses andere Quest hier. Die andere Quest bringt"}, {"id": 537, "start": 4962.94, "end": 4973.78, "text": "mir nix Gescheites. Das ist was wo es ein Respec Buch gibt. Ne das brauchen wir nicht."}, {"id": 538, "start": 4973.78, "end": 4979.78, "text": "Und by the way eine Sache haben die Path of Exile Entwickler echt gemeistert. Der Stash"}, {"id": 539, "start": 4979.78, "end": 4982.86, "text": "ne der Stash war nicht schon immer so groß. Ups. Was mach ich denn hier für ein Kack."}, {"id": 540, "start": 4982.86, "end": 4999.02, "text": "Da muss ich gar nicht hin. Ich hab mir Pay to Win Stash Tabs gekauft. Aber in einer Sache"}, {"id": 541, "start": 4999.02, "end": 5002.5, "text": "was ich sagen wollte in einer Sache sind die Path of Exile Entwickler echt gut. Die können"}, {"id": 542, "start": 5002.5, "end": 5007.98, "text": "wahnsinnig gut recyceln. Die Bosse die wir jetzt hier killen müssen die haben wir schon"}, {"id": 543, "start": 5007.98, "end": 5013.26, "text": "zweimal vorher gekillt. Oder dreimal vorher sogar schon. Ne dreimal gesehen und zweimal"}, {"id": 544, "start": 5013.26, "end": 5019.5, "text": "gekillt haben wir die Bosse die jetzt hier kommen vorher schon. Also die können wirklich"}, {"id": 545, "start": 5019.5, "end": 5037.58, "text": "gut recyceln die Path of Exile Entwickler. Also wer auch immer mir den Tipp gegeben hat"}, {"id": 546, "start": 5037.58, "end": 5059.66, "text": "mit den Enduring Cry auf linke Maustaste zu legen. Das war Massive Big Brain. Aha neue"}, {"id": 547, "start": 5059.66, "end": 5072.1, "text": "Seeds. Erstmal hier ein bisschen Vollspeed durchrushen. Das coole an dem Bild ist auch"}, {"id": 548, "start": 5072.1, "end": 5077.54, "text": "man braucht keine Mana Flasche. Aua. Man braucht keine Mana Flasche und dementsprechend kann"}, {"id": 549, "start": 5077.54, "end": 5083.5, "text": "man Damage Flasche zweimal Speed Flasche mitnehmen. Am besten natürlich hat die Damage Flasche"}, {"id": 550, "start": 5083.5, "end": 5088.1, "text": "auch nochmal extra Speed. Man könnte auch 3 Speed Flaschen für die Kampagne mitnehmen."}, {"id": 551, "start": 5088.1, "end": 5106.46, "text": "Oh Poggers Boss. Down. F. Ja du hast schon recht Elephant Core. Die übernehmen es nicht"}, {"id": 552, "start": 5106.46, "end": 5112.78, "text": "die über. Was ist das für ein Layout? Meine Güte. Die übernehmen es nicht komplett aber"}, {"id": 553, "start": 5112.78, "end": 5116.44, "text": "gerade diese 3 Bosse die jetzt hier kommen die sind schon. Außer das die Farbe sich"}, {"id": 554, "start": 5116.44, "end": 5134.94, "text": "ein bisschen geändert hat ist an den Fights jetzt nicht so ne große Unterschied. Oh Monkeys."}, {"id": 555, "start": 5134.94, "end": 5146.38, "text": "Das war ganz schön viel Damage. Lul. Ja Chaos Damage Resies konnte ich mir noch nicht leisten"}, {"id": 556, "start": 5146.38, "end": 5151.94, "text": "ja. Mach ich dann wenn ich im Endgame angekommen bin dann kaufe ich mir ein bisschen ordentliches"}, {"id": 557, "start": 5151.94, "end": 5158.98, "text": "Gear. Ich hatte ja glücklicherweise nen Tropf der ein bisschen was wert ist. Der Ingame"}, {"id": 558, "start": 5158.98, "end": 5163.9, "text": "Chat. Ja Chat ich lese den Ingame Chat nicht. Kann man mal gebrauchen. Gucken wir mal ob"}, {"id": 559, "start": 5163.9, "end": 5168.62, "text": "wir da was Gescheites rauskriegen. Ich lese den Ingame Chat nicht. Ich habe den Ingame"}, {"id": 560, "start": 5168.62, "end": 5174.66, "text": "Chat eigentlich nur zur Belustigung offen. Und solange sie nicht irgendwelches Monkertoss"}, {"id": 561, "start": 5174.66, "end": 5195.9, "text": "wegschreiben muss ich ihn auch nicht ausblenden. Ach guck mal da gehts ja schon lang hab ich"}, {"id": 562, "start": 5195.9, "end": 5207.42, "text": "nicht gesehen. Ja in jedem MMO es gibt in jedem MMO so ein paar Chats die besonders"}, {"id": 563, "start": 5207.42, "end": 5212.7, "text": "pepega sind. In World of Warcraft war das der Prachland Chat. Den kenn sogar ich als"}, {"id": 564, "start": 5212.7, "end": 5219.34, "text": "jemand der kaum WoW gespielt hat der Prachland Chat. Das war noch die Zeit wo man die Spiele"}, {"id": 565, "start": 5219.34, "end": 5229.9, "text": "auf Deutsch gespielt hat. Da war das der Prachland Chat. Weiß gar nicht ob sich das jetzt schon"}, {"id": 566, "start": 5229.9, "end": 5247.38, "text": "lohnt hier. Aber können wir mal machen geht ja schnell. Monker Hack'n Slay. Oh guck mal"}, {"id": 567, "start": 5247.38, "end": 5250.58, "text": "der hält ein paar Spells aus. Was erlaubt er sich denn jetzt mehrere Spells auszuhalten?"}, {"id": 568, "start": 5250.58, "end": 5271.58, "text": "Ich glaube Uninstall ist raus. Uninstall ist ausgeführt. Worum es in dem Game geht Gegner"}, {"id": 569, "start": 5271.58, "end": 5276.74, "text": "baschen, looten, besseres Loot bekommen um besser Gegner baschen zu können und um besseres"}, {"id": 570, "start": 5276.74, "end": 5282.9, "text": "Loot zu bekommen um wieder mehr Gegner baschen zu können. Ich glaube ich hab das jetzt ganz"}, {"id": 571, "start": 5282.9, "end": 5298.58, "text": "gut zusammengefasst. Äh hab ich Mobs übersehen? Ah egal. Oh was denn das? Exzellent. Hab ich"}, {"id": 572, "start": 5298.58, "end": 5310.42, "text": "noch keine. Exzellent. Reduced Charges. Oh das ist gut. Falls man mal. Oh wow wow. Hoh"}, {"id": 573, "start": 5310.42, "end": 5318.98, "text": "gerade noch mal rechtzeitig Knopf gedrückt da. Ähm kann man richtig wenn man hier Damage"}, {"id": 574, "start": 5318.98, "end": 5333.06, "text": "kriegt kriegt man ordentlich kann man ordentlich Life Flask spammen hier. Da sind wir richtig."}, {"id": 575, "start": 5333.06, "end": 5342.18, "text": "Wo bleibt der Timeout? Du hast angeblich einen Timeout bekommen steht zumindest da. Vielleicht"}, {"id": 576, "start": 5342.18, "end": 5351.18, "text": "ist es aber auch nur gebaited oder es geht gar nicht. Das ist eigentlich ganz nett für"}, {"id": 577, "start": 5351.18, "end": 5356.06, "text": "den Anfang. Das schöne ist da können wir noch ein bisschen was draufcraften klar."}, {"id": 578, "start": 5356.06, "end": 5373.34, "text": "Ist jetzt nicht so geil. Äh Sucked. Ach jetzt muss ich die Bosse noch mal baschen. Alles"}, {"id": 579, "start": 5373.34, "end": 5377.66, "text": "klar. Exzellent Boss Bashers. Da rennen wir jetzt mal einfach durch so schnell wir können."}, {"id": 580, "start": 5377.66, "end": 5385.26, "text": "Ja und eine Sache muss man auch noch sagen worum es geht. Also ich fang jetzt nicht"}, {"id": 581, "start": 5385.26, "end": 5390.18, "text": "mit Perce of Exile Story an weil die ist wirklich schlecht. Der Übergang von der Kampagne zum"}, {"id": 582, "start": 5390.18, "end": 5395.5, "text": "Endgame ist wirklich gut gemacht. Das fängt erstmal ein bisschen leichter an wie es am"}, {"id": 583, "start": 5395.5, "end": 5401.78, "text": "Ende der Kampagne war und hat aber richtig richtig viel tiefer eigentlich. Wie der Atlas"}, {"id": 584, "start": 5401.78, "end": 5406.9, "text": "funktioniert am Ende was es für unterschiedliche Maps gibt wie man das ganze zusammen sammeln"}, {"id": 585, "start": 5406.9, "end": 5413.46, "text": "muss die Atlas Bosse die es zwischendurch gibt. Das Endgame ist wirklich gut durchdacht"}, {"id": 586, "start": 5413.46, "end": 5422.26, "text": "in dem Spiel. Das macht echt Bock. Guck hier ist wieder der gleiche Boss den wir schon"}, {"id": 587, "start": 5422.26, "end": 5431.54, "text": "zweimal gekillt haben. Jetzt wollen die auch noch dass ich Mechanics mache. Hier werden"}, {"id": 588, "start": 5431.54, "end": 5452.1, "text": "keine Mechanics gemacht. Hier werden einfach Attack Move gespammt. Ja Sonnt du bist wieder"}, {"id": 589, "start": 5452.1, "end": 5466.3, "text": "da. Vielleicht warst du auch nicht weg. Sebaro warum gibt es Timeout Anfragen. Ich dachte"}, {"id": 590, "start": 5466.3, "end": 5472.18, "text": "die Leute werden gleich Timeoutet. Oh warum kann ich das nicht. Oh mir fehlt Dex. Ich"}, {"id": 591, "start": 5472.18, "end": 5476.22, "text": "habe zu wenig Dex um das ganze weiter zu leveln. Was aber nicht wirklich schlimm ist weil ich"}, {"id": 592, "start": 5476.22, "end": 5496.98, "text": "glaube das Game brauche ich später gar nicht mehr. Wo geht es zum Boss. Boss please. Boss"}, {"id": 593, "start": 5496.98, "end": 5510.1, "text": "please. Wo geht es lang. Ah da. Perfekt. Den Boss haben wir auch schon zweimal gekillt."}, {"id": 594, "start": 5510.1, "end": 5530.74, "text": "Schon wieder ein Boss der will dass ich Mechanics mache. Sowas aber auch. Jetzt werden aber"}, {"id": 595, "start": 5530.74, "end": 5543.22, "text": "keine Mechanics mehr gemacht. Jetzt wird einfach nur Attack Moved. Was. Schon wieder. Jetzt"}, {"id": 596, "start": 5543.22, "end": 5552.54, "text": "aber. Jetzt schreckt. Sebaro das kann sein dass es nicht funktioniert. Ja ich weiß auch"}, {"id": 597, "start": 5552.54, "end": 5557.22, "text": "nicht warum. Aber Twitch buggt ja manchmal ein bisschen rum was die Kanalpunkte commands"}, {"id": 598, "start": 5557.22, "end": 5564.82, "text": "angeht. Kann schon sein dass es kaputt ist. Aber ich sehe es im Chat das Timeout das angeblich"}, {"id": 599, "start": 5564.82, "end": 5571.1, "text": "getimeoutet wurde. Was in sich heißt das wirklich getimeoutet wurde. Es steht aber da. Twitch"}, {"id": 600, "start": 5571.1, "end": 5590.82, "text": "big brain. Alter move dich. Ich habe übelst Hunger. Ich muss mir gleich mal was zu essen"}, {"id": 601, "start": 5590.82, "end": 5598.42, "text": "holen. Dann gucken wir nochmal die in alter Traditionen Barbecue Pit Boys Video und ich"}, {"id": 602, "start": 5598.42, "end": 5602.58, "text": "esse was dabei. Im letzten Stream haben sich die Leute schon beschwert dass es kein Barbecue"}, {"id": 603, "start": 5602.58, "end": 5611.94, "text": "Pit Boys Video gab. Und das wollen wir ja nicht hier. Habe ich Gegner vergessen. Ach"}, {"id": 604, "start": 5611.94, "end": 5624.82, "text": "da. Easy. Das ist kein Auto Timeout ach so. Ich dachte die Timeouten die Leute automatisch."}, {"id": 605, "start": 5624.82, "end": 5636.22, "text": "Die ganzen die Sacken die Sacken in der Regel übelst die Unix die man kriegt hier. Da"}, {"id": 606, "start": 5636.22, "end": 5649.42, "text": "ist nichts gescheit Spy. Absoluter Crap für mich. Und das für mich auch absoluter. Naja"}, {"id": 607, "start": 5649.42, "end": 5664.74, "text": "so schlecht ist das gar nicht. Aber brauche ich nicht. Auch Crap. Wo ist deine Umfrage?"}, {"id": 608, "start": 5664.74, "end": 5674.3, "text": "Nutella mit oder ohne Butter. Also ich weiß nicht ob man eine Umfrage machen muss aber"}, {"id": 609, "start": 5674.3, "end": 5678.7, "text": "ich kann ja was zu Nutella mit und ohne Butter sagen. Wer Nutella mit Butter isst ist eklig."}, {"id": 610, "start": 5678.7, "end": 5694.46, "text": "Nutella mit Butter Sackt. Change my mind. Ist ja gut jetzt. Game kriegt schonmal ein."}, {"id": 611, "start": 5694.46, "end": 5713.02, "text": "Game wieder Crap Crap Crap Crap. Mit Butter nee das ist doch voll eklig. Nutella ist"}, {"id": 612, "start": 5713.02, "end": 5716.58, "text": "ist süß und fettig genug. Und wenn du da noch Butter drunter machst dann wirds einfach"}, {"id": 613, "start": 5716.58, "end": 5726.54, "text": "nur bappig klebrig und eklig. Nee nee nee nee nee. Der Chat hat absolut kein Geschmack"}, {"id": 614, "start": 5726.54, "end": 5734.14, "text": "aber das ist ja nix neues Chat. Gerade der Twitch Chat ist ja bekannt dafür kein Geschmack"}, {"id": 615, "start": 5734.14, "end": 5749.26, "text": "so. Und ich dachte mein Twitch Chat ist besser. Hab ich irgendwas vergessen zu killen? Angeblich"}, {"id": 616, "start": 5749.26, "end": 5777.22, "text": "ist hier was? Ach da. Oh ich Pepega. Nix mitbekommen. War aber knapp. Das war aber"}, {"id": 617, "start": 5777.22, "end": 5790.54, "text": "knapp. Kommt auf. Oh jetzt sits Big Brain im Chat. Kommt auf die Unterlage an. Auf"}, {"id": 618, "start": 5790.54, "end": 5794.66, "text": "dem Brötchen definitiv. Ohne aber auf so einem richtigen Vollkornbrot. Wer ist auch"}, {"id": 619, "start": 5794.66, "end": 5804.3, "text": "schon Vollkornbrot? Ja ok vielleicht. Vielleicht. Ich lass mir's gefallen. Auf manchen Unterlagen"}, {"id": 620, "start": 5804.3, "end": 5816.26, "text": "mag das noch erträglich sein. Sucked. Sucked extrem. Verkauf ich aber wenn ich schon aufgehoben"}, {"id": 621, "start": 5816.26, "end": 5842.62, "text": "hab. Ach lul all. Lululululululululululululul. So next Boss. Garden stealth. Garden Warfare."}, {"id": 622, "start": 5842.62, "end": 5845.42, "text": "Garden Warfare"}, {"id": 623, "start": 5845.42, "end": 5854.88, "text": "Das ist eigentlich das neue Garden Warfare Spiel, da kam doch vor ein paar Wochen oder"}, {"id": 624, "start": 5854.88, "end": 5856.9, "text": "paar Monaten ein neues raus."}, {"id": 625, "start": 5856.9, "end": 5857.9, "text": "Lohnt sich das?"}, {"id": 626, "start": 5857.9, "end": 5866.5, "text": "Pepo Fett, guck mal hier."}, {"id": 627, "start": 5866.5, "end": 5889.3, "text": "Ey lass mich in Ruhe, das Bild ist mir im Weg, ich seh nix mehr, das war keine gute Idee"}, {"id": 628, "start": 5889.3, "end": 5907.7, "text": "das Bild jetzt einzublenden, Monkey Ass, ich seh nix, wo ist der Boss, oh ich glaub ich"}, {"id": 629, "start": 5907.7, "end": 5919.78, "text": "verreck jetzt, ah im Moment das Zeug muss man ja killen, man muss ja die Dinger hier"}, {"id": 630, "start": 5919.78, "end": 5927.38, "text": "killen, lull und jetzt ist es auch easy auf einmal, kaum macht man es richtig, so jetzt"}, {"id": 631, "start": 5927.38, "end": 5928.58, "text": "kann ich jetzt die Mode wieder ausblenden."}, {"id": 632, "start": 5928.58, "end": 5940.14, "text": "So, dann gehen wir nochmal kurz in die Stadt, schmeißen unser ganzes Loot einfach sinnlos"}, {"id": 633, "start": 5940.14, "end": 5948.78, "text": "in die Kiste und machen den Boss und gehen zum letzten Storyabschnitt, komm scheiß drauf"}, {"id": 634, "start": 5948.78, "end": 5969.94, "text": "das mit den Seeds machen wir dann, Seed, so gehts schneller als das rauszufischen, was"}, {"id": 635, "start": 5969.94, "end": 5986.54, "text": "jetzt"}, {"id": 636, "start": 5986.54, "end": 5989.82, "text": "Warum wurde Bless RNG, warum wurde Bless RNG Removed?"}, {"id": 637, "start": 5996.14, "end": 6000.02, "text": "Ah, Twitch Band Streamer Today."}, {"id": 638, "start": 6002.46, "end": 6003.18, "text": "Ah, okay."}, {"id": 639, "start": 6007.58, "end": 6012.58, "text": "Okay, das ist natürlich ne Sache, die ich definitiv nicht gut heißen kann."}, {"id": 640, "start": 6012.58, "end": 6026.58, "text": "Inwieweit das Emote damit jetzt zu tun hat, ist fragwürdig, allerdings, nachdem das ja das Face von diesem Dude ist, kann ich verstehen."}, {"id": 641, "start": 6030.58, "end": 6031.58, "text": "Kann ich verstehen."}, {"id": 642, "start": 6032.58, "end": 6035.58, "text": "Darf ich da drüber nicht reden? Natürlich darf ich da drüber reden."}, {"id": 643, "start": 6035.58, "end": 6044.58, "text": "Kann ich nachvollziehen, dass Twitch das Removed hat? Kann ich verstehen, ja."}, {"id": 644, "start": 6051.58, "end": 6058.58, "text": "Oh, noch mal Pepofet. Alter, was ist das für ein Fisch? Den Boss kann ich mich überhaupt nicht mehr erinnern."}, {"id": 645, "start": 6058.58, "end": 6064.58, "text": "Oh, da verrecke ich jetzt bestimmt. Ich weiß überhaupt nicht, was ich hier machen muss."}, {"id": 646, "start": 6065.58, "end": 6068.58, "text": "Einfach Damage machen. Einfach Damage machen. Easy Mode."}, {"id": 647, "start": 6071.58, "end": 6073.58, "text": "Damage machen und Zeug ausweichen."}, {"id": 648, "start": 6075.58, "end": 6083.58, "text": "Au. Au. Monkeys. Man machte so viel Damage. Aber das Gute ist, in dem Game ist es nicht schlimm, weil man stirbt, es passiert überhaupt nichts."}, {"id": 649, "start": 6083.58, "end": 6087.58, "text": "What the fuck? Das ist Chaos Damage. Ich habe keine Chaos Resies."}, {"id": 650, "start": 6089.58, "end": 6091.58, "text": "Konnte ich mir noch nicht leisten, Chaos Resies."}, {"id": 651, "start": 6093.58, "end": 6095.58, "text": "Aber er ist gleich down."}, {"id": 652, "start": 6095.58, "end": 6103.58, "text": "Gebannte, über gebannte Leute und Twitch reden ist verboten. Na, dann frage ich mich, wie sie das einhalten wollen."}, {"id": 653, "start": 6104.58, "end": 6110.58, "text": "Ich meine, wenn du überlegst, wie teilweise Daffron, XQC, sonst was, wer alles gebannt war und wenn du da nicht drüber reden darfst, dann..."}, {"id": 654, "start": 6112.58, "end": 6114.58, "text": "Na ja, gut. Twitch, du hast es schon."}, {"id": 655, "start": 6114.58, "end": 6127.34, "text": "Ja, ich glaube das war es. Okay Leute, letztes 식"}, {"id": 656, "start": 6127.58, "end": 6128.58, "text": "Quatsch-Gerüche."}, {"id": 657, "start": 6129.58, "end": 6130.58, "text": "caps."}, {"id": 658, "start": 6130.58, "end": 6143.26, "text": "Ja, ich glaube es war's."}, {"id": 659, "start": 6143.26, "end": 6151.98, "text": "Okay Leute, letzter Akt der Story, dann haben wir es endlich geschafft, uns in dem Endgame"}, {"id": 660, "start": 6151.98, "end": 6156.86, "text": "und ich kann dieses sinnlose Storydialog rumklicken weglassen."}, {"id": 661, "start": 6156.86, "end": 6159.9, "text": "Okay, also was mussten wir nochmal im letzten Akt machen?"}, {"id": 662, "start": 6159.9, "end": 6162.54, "text": "Der letzte Akt war ziemlich kurz, wenn ich mich richtig erinnere."}, {"id": 663, "start": 6162.54, "end": 6171.46, "text": "Umfragen kann nur ich machen, ja für was soll ich denn eine Umfrage machen?"}, {"id": 664, "start": 6171.46, "end": 6174.3, "text": "Soll ich wirklich eine Umfrage machen für Nutella mit oder ohne?"}, {"id": 665, "start": 6174.3, "end": 6179.46, "text": "Also wenn du das haben willst, mache ich das natürlich, weil du hast eh mal 5000 Punkte"}, {"id": 666, "start": 6179.46, "end": 6180.46, "text": "gebracet."}, {"id": 667, "start": 6180.46, "end": 6188.46, "text": "Ja, gut, also."}, {"id": 668, "start": 6188.46, "end": 6212.7, "text": "Wenn der Knäherbär fragt, Nutella mit oder ohne Butter, mit, ohne, allow multiple answers"}, {"id": 669, "start": 6212.7, "end": 6213.7, "text": "ist ziemlich doof."}, {"id": 670, "start": 6213.7, "end": 6225.26, "text": "So, excellent, dass der Knäherbär seine Umfrage kriegt, muss sein."}, {"id": 671, "start": 6225.26, "end": 6231.42, "text": "Vote, äh nicht vote, also ohne natürlich bei mir, in meinem Fall ohne."}, {"id": 672, "start": 6231.42, "end": 6239.74, "text": "Mit slash vote, excellent, wusste ich nicht, dass das funktioniert."}, {"id": 673, "start": 6239.74, "end": 6244.3, "text": "Ich bin ja auch Twitch Noob, ich mein, nur weil ich seit 2 Jahren jetzt auf Twitch streame,"}, {"id": 674, "start": 6244.3, "end": 6246.02, "text": "heißt das nicht, dass ich weiß, wie Twitch funktioniert."}, {"id": 675, "start": 6246.02, "end": 6263.46, "text": "Okay, die Umfrage ist knapper, als ich mir das gedacht hab."}, {"id": 676, "start": 6263.46, "end": 6266.14, "text": "Es ist deutlich knapper, als ich das vermutet hätte."}, {"id": 677, "start": 6266.14, "end": 6283.82, "text": "WTF, mit, chat, ich glaube, der Chat stimmt nur mit ab, um mich zu triggern, dass ich"}, {"id": 678, "start": 6283.82, "end": 6290.62, "text": "äh sage, es ist eklig, mit, ich weiß auch nicht, wer das macht, aber der Chat macht"}, {"id": 679, "start": 6290.62, "end": 6302.14, "text": "das anscheinend, das sind die, das sind die Weeps im Chat, die essen das alle mit Butter"}, {"id": 680, "start": 6302.14, "end": 6305.1, "text": "wahrscheinlich, ne, das ist Baro nicht, okay, dann stimmt das schonmal nicht."}, {"id": 681, "start": 6305.1, "end": 6317.38, "text": "Ja, ja, ja, ja, ja, Chat, ich hab Hunger, ich ess mal kurz was, bevor ich durch den nächsten"}, {"id": 682, "start": 6317.38, "end": 6326.3, "text": "Akt fertig durchrushe, ähm, okay, genau, der letzte Akt war ziemlich kurz, man musste"}, {"id": 683, "start": 6326.3, "end": 6333.06, "text": "eigentlich nur, nur in 3 Gebiete rein und so, und das wars dann, das war ziemlich, ziemlich"}, {"id": 684, "start": 6333.06, "end": 6342.66, "text": "easy, kann ich mich noch dran erinnern, ähm, nummer, POE, nicht Smill, Skill, Book of"}, {"id": 685, "start": 6342.66, "end": 6349.42, "text": "Skill, gucken, dass ich keine Quests übersehen hab, die Skill Points geben, Akt 10, äh,"}, {"id": 686, "start": 6349.42, "end": 6353.46, "text": "okay, machen wir, machen wir gleich, Leute, ich ess mal schnell was, dabei gucken wir uns"}, {"id": 687, "start": 6353.46, "end": 6369.98, "text": "natürlich ein richtig schönes Kokona Video an, BBQ Pit Boys, hell yeah, real easy Roast"}, {"id": 688, "start": 6369.98, "end": 6382.5, "text": "Beef, ha, ha, ha, Chicken Trag Egg, Dick, ne, Dickens, Cider, alles klar, das haben wir"}, {"id": 689, "start": 6382.5, "end": 6386.38, "text": "schon gesehen, das ist, das ist der Schweinebauch, den sie mit dem Teppichmesser eingeritzt"}, {"id": 690, "start": 6386.38, "end": 6394.38, "text": "haben, ja, der, Chicken Dragon Eggs, alles klar, das gucken wir uns jetzt an, und ich"}, {"id": 691, "start": 6394.38, "end": 6417.1, "text": "ess kurz was, da gehts weiter, Sebaro, was ist, was, hä, der Sebaro hat grad Umfrage"}, {"id": 692, "start": 6417.1, "end": 6421.94, "text": "erstellt, wo ich ja nicht mal weiß, was die Umfrage beheißen soll, soll Max mal in die"}, {"id": 693, "start": 6421.94, "end": 6440.78, "text": "Slots gehen, was sind die Slots, was ist das, was sind Slots, Sebaro ist das irgendwas"}, {"id": 694, "start": 6440.78, "end": 6466.18, "text": "Anstößiges, Poker of Dead, Slots, okay Sebaro, ich hab keine Ahnung, ne,"}, {"id": 695, "start": 6466.18, "end": 6480.66, "text": "Ich hab legit keinen Plassen Schimmer, was du meinst, ich kenn den Azitwitch, ach, meinst"}, {"id": 696, "start": 6480.66, "end": 6489.62, "text": "du Casino, Casino Content oder was, ja ganz bestimmt mach ich Casino Content, alter,"}, {"id": 697, "start": 6489.62, "end": 6496.38, "text": "was kommt als nächstes, was kommt als nächstes, als nächstes kann ich an Schach spielen,"}, {"id": 698, "start": 6496.38, "end": 6504.54, "text": "da spiel ich Schach, das wär doch mal was, exzellent, exquisiter Zug, ihr glaubt's"}, {"id": 699, "start": 6504.54, "end": 6513.14, "text": "gar nicht, Chess, Chess ist auf Twitch übelst angesagt zur Zeit, Chess geht voll ab, guckt"}, {"id": 700, "start": 6513.14, "end": 6521.98, "text": "euch das an, ja, high IQ, Chess, so jetzt muss ich aber was essen, ich hab Hunger, ich"}, {"id": 701, "start": 6521.98, "end": 6547.66, "text": "guck jetzt Chicken Dragon Eggs, hohoho, was exqc spielt Chess, exqc, okay, ich hätte"}, {"id": 702, "start": 6547.66, "end": 6553.46, "text": "exqc jetzt nicht als Big Brain Chess Spieler eingeschätzt, aber okay, ich muss was essen,"}, {"id": 703, "start": 6553.46, "end": 6576.42, "text": "ich hab übelst Hunger, beeil mich auch, Exzellent, Bacon, Bacon Strips, Bacon Strips, Bacon Strips,"}, {"id": 704, "start": 6576.42, "end": 6587.86, "text": "okay Big Brain Umfrage, ist das heute ein Stream, eindeutig nein, da steht sogar schon"}, {"id": 705, "start": 6587.86, "end": 6591.5, "text": "im Titel, dass es kein Stream ist, wie kann das da ein Stream sein, oder wollt ihr mir"}, {"id": 706, "start": 6591.5, "end": 6605.3, "text": "sagen, ich Chebate euch mit dem Titel, hab ich euch jemals Chebated Chat, sowas würde"}, {"id": 707, "start": 6605.3, "end": 6610.74, "text": "ich nie machen in den Twitch Chat, also ist das eindeutig kein Stream, so, Chicken Dragon"}, {"id": 708, "start": 6610.74, "end": 6630.9, "text": "Eggs, ich finde es geil wie er das sagt, Jalapeno, Jalapeno, Jalapeno, Jalapeno,"}, {"id": 709, "start": 6630.9, "end": 6655.14, "text": "es wäre jetzt mal nur so ein kleiner Vorschlag, ich weiß es gehört zum Programm, aber wenn"}, {"id": 710, "start": 6655.14, "end": 6662.58, "text": "man ein kleineres Messer nimmt, dann wäre das deutlich einfacher das aus der Pepperoni"}, {"id": 711, "start": 6685.14, "end": 6703.26, "text": "zu machen, einfach zu machen, benutzt eure alte Hickory oder welches Knife ihr hattet, einfach"}, {"id": 712, "start": 6703.26, "end": 6712.7, "text": "zu machen, jetzt nehmen wir einen normalen Plastikwaffel, denn was wir hier machen wollen,"}, {"id": 713, "start": 6712.7, "end": 6718.1, "text": "ist, dass wir das ausflatten wollen, und das macht ihr für ein paar Gründe, eine ist,"}, {"id": 714, "start": 6718.1, "end": 6723.06, "text": "damit ihr eine konsistente Fertigkeit der Fertigkeit habt, damit es abends kocht, und"}, {"id": 715, "start": 6723.06, "end": 6734.78, "text": "ihr könnt es auch zerstören, erstmal schön hemmern, dass der sogar einen ordentlichen"}, {"id": 716, "start": 6734.78, "end": 6737.5, "text": "Hammer dafür verwendet, dass der nicht mit einem Stück Holz draufklopft, wundert mich"}, {"id": 717, "start": 6737.5, "end": 6743.02, "text": "jetzt eigentlich, oder mal zumindest mit einem Pistolengriff hätte man draufklopfen können,"}, {"id": 718, "start": 6743.02, "end": 6771.02, "text": "also ich glaube Pistolengriff wäre der richtige Kokona Weg gewesen,"}, {"id": 719, "start": 6771.02, "end": 6784.9, "text": "es ist jetzt etwaARY!"}, {"id": 720, "start": 6784.9, "end": 6786.9, "text": "Sie wollen einiges übrig?"}, {"id": 721, "start": 6786.9, "end": 6788.9, "text": "Natürlich."}, {"id": 722, "start": 6788.9, "end": 6790.9, "text": "Okay, nun..."}, {"id": 723, "start": 6790.9, "end": 6792.9, "text": "Schreddende Zwiebeln und Schredden."}, {"id": 724, "start": 6792.9, "end": 6795.9, "text": "Nimm sie, sie melt besser und schneller."}, {"id": 725, "start": 6797.9, "end": 6799.9, "text": "Lege sie da rein."}, {"id": 726, "start": 6799.9, "end": 6801.9, "text": "Du willst den Zwiebeln benutzen, das ist perfekt für das."}, {"id": 727, "start": 6801.9, "end": 6803.9, "text": "Und er sieht aus wie ein Ei, oder?"}, {"id": 728, "start": 6803.9, "end": 6805.9, "text": "Ein weißer..."}, {"id": 729, "start": 6805.9, "end": 6807.9, "text": "Perfekt!"}, {"id": 730, "start": 6807.9, "end": 6809.9, "text": "Schraub ein Ei."}, {"id": 731, "start": 6809.9, "end": 6811.9, "text": "Sonst."}, {"id": 732, "start": 6811.9, "end": 6813.9, "text": "Jetzt."}, {"id": 733, "start": 6813.9, "end": 6815.9, "text": "Ich nehme den Eier von dem Drogon."}, {"id": 734, "start": 6815.9, "end": 6817.9, "text": "Und..."}, {"id": 735, "start": 6817.9, "end": 6819.9, "text": "Dann wird das Ei aus dem Zwiebeln."}, {"id": 736, "start": 6819.9, "end": 6821.9, "text": "Und dann wird das Ei aus dem Zwiebeln."}, {"id": 737, "start": 6821.9, "end": 6823.9, "text": "Genau so."}, {"id": 738, "start": 6823.9, "end": 6825.9, "text": "Genau so."}, {"id": 739, "start": 6825.9, "end": 6827.9, "text": "Ja, das Flieger da wird verschwunden."}, {"id": 740, "start": 6827.9, "end": 6829.9, "text": "Genau so."}, {"id": 741, "start": 6829.9, "end": 6831.9, "text": "So, wir machen..."}, {"id": 742, "start": 6831.9, "end": 6833.9, "text": "...ein guter..."}, {"id": 743, "start": 6833.9, "end": 6835.9, "text": "...ein guter Schraub."}, {"id": 744, "start": 6835.9, "end": 6837.9, "text": "Und das wird es zusammenhalten."}, {"id": 745, "start": 6837.9, "end": 6839.9, "text": "Du brauchst keine Stange oder so."}, {"id": 746, "start": 6839.9, "end": 6841.9, "text": "Du brauchst einfach Bacon."}, {"id": 747, "start": 6841.9, "end": 6843.9, "text": "Und wie viele von euch wissen..."}, {"id": 748, "start": 6843.9, "end": 6845.9, "text": "Warte mal."}, {"id": 749, "start": 6845.9, "end": 6847.9, "text": "Timeoutet ein das Game eigentlich nach einer Weile?"}, {"id": 750, "start": 6847.9, "end": 6849.9, "text": "Okay, ne."}, {"id": 751, "start": 6849.9, "end": 6851.9, "text": "Timeoutet ein nicht."}, {"id": 752, "start": 6851.9, "end": 6853.9, "text": "Bacon..."}, {"id": 753, "start": 6853.9, "end": 6855.9, "text": "...wie es kocht..."}, {"id": 754, "start": 6855.9, "end": 6857.9, "text": "...konstruiert."}, {"id": 755, "start": 6857.9, "end": 6859.9, "text": "Wie ein Zwiebeln."}, {"id": 756, "start": 6859.9, "end": 6861.9, "text": "Wie ein Schlag."}, {"id": 757, "start": 6861.9, "end": 6863.9, "text": "Je länger es kocht, desto stärker wird es."}, {"id": 758, "start": 6863.9, "end": 6865.9, "text": "Und wir werden es zusammenhalten."}, {"id": 759, "start": 6865.9, "end": 6867.9, "text": "Das ist eine gute Qualität."}, {"id": 760, "start": 6867.9, "end": 6869.9, "text": "Das ist eine gute Qualität, Bacon."}, {"id": 761, "start": 6869.9, "end": 6871.9, "text": "Das ist eine gute Qualität, Bacon."}, {"id": 762, "start": 6871.9, "end": 6873.9, "text": "Wie groß war das Hähnchen?"}, {"id": 763, "start": 6873.9, "end": 6875.9, "text": "Wahrscheinlich gene-manipuliert."}, {"id": 764, "start": 6875.9, "end": 6877.9, "text": "Haha."}, {"id": 765, "start": 6885.9, "end": 6887.9, "text": "In den USA geht alles."}, {"id": 766, "start": 6887.9, "end": 6889.9, "text": "In den USA geht alles."}, {"id": 767, "start": 6889.9, "end": 6891.9, "text": "Du hast recht, Rick. PoE-Timeoutet nicht."}, {"id": 768, "start": 6891.9, "end": 6893.9, "text": "Weil ich hab letztens afk"}, {"id": 769, "start": 6893.9, "end": 6895.9, "text": "4 oder 5 Stunden rumgestanden und ich war nicht getimeoutet."}, {"id": 770, "start": 6895.9, "end": 6897.9, "text": "Jetzt wo du es sagst..."}, {"id": 771, "start": 6897.9, "end": 6899.9, "text": "...ist so timeoutet nie."}, {"id": 772, "start": 6899.9, "end": 6901.9, "text": "Warum auch?"}, {"id": 773, "start": 6901.9, "end": 6903.9, "text": "Macht ja weder Bandbreite noch sonst was."}, {"id": 774, "start": 6903.9, "end": 6905.9, "text": "Was nicht nennenswert."}, {"id": 775, "start": 6907.9, "end": 6909.9, "text": "Und sie können ihren Investor-Leuten"}, {"id": 776, "start": 6909.9, "end": 6911.9, "text": "wahrscheinlich besser Playtime erzählen,"}, {"id": 777, "start": 6911.9, "end": 6913.9, "text": "wenn sie nicht timeouten."}, {"id": 778, "start": 6919.9, "end": 6921.9, "text": "Ne, wir gucken uns das komplett an."}, {"id": 779, "start": 6921.9, "end": 6925.9, "text": "Ich will sehen, wie er das einwickelt."}, {"id": 780, "start": 6941.9, "end": 6943.9, "text": "Moment, ich hab übrigens meine"}, {"id": 781, "start": 6943.9, "end": 6947.9, "text": "Emotes vollkommen falsch platziert."}, {"id": 782, "start": 6947.9, "end": 6949.9, "text": "Oh, das ist gut."}, {"id": 783, "start": 6949.9, "end": 6951.9, "text": "Das ist spicy."}, {"id": 784, "start": 6957.9, "end": 6959.9, "text": "Und innen steckt noch die"}, {"id": 785, "start": 6959.9, "end": 6981.9, "text": "Pepperoni mit Cheese."}, {"id": 786, "start": 6985.9, "end": 6987.9, "text": "Ja, KioKorn."}, {"id": 787, "start": 6987.9, "end": 6989.9, "text": "Warte was, Essen."}, {"id": 788, "start": 7003.9, "end": 7005.9, "text": "Fahrenheit, NA-Einheiten."}, {"id": 789, "start": 7005.9, "end": 7017.9, "text": "NA-Einheiten."}, {"id": 790, "start": 7025.9, "end": 7027.9, "text": "Aber gut aussehen tut's."}, {"id": 791, "start": 7027.9, "end": 7029.9, "text": "Also, Chat..."}, {"id": 792, "start": 7029.9, "end": 7035.9, "text": "...muss man sagen."}, {"id": 793, "start": 7037.9, "end": 7039.9, "text": "Es sieht wirklich gut aus."}, {"id": 794, "start": 7047.9, "end": 7049.9, "text": "Da läuft sogar noch der Käse raus."}, {"id": 795, "start": 7049.9, "end": 7055.9, "text": "Boah, nice."}, {"id": 796, "start": 7061.9, "end": 7063.9, "text": "Craygasm Grill."}, {"id": 797, "start": 7073.9, "end": 7075.9, "text": "Also, wäre das Messer jetzt"}, {"id": 798, "start": 7075.9, "end": 7077.9, "text": "vielleicht einen Ticken schärfer"}, {"id": 799, "start": 7077.9, "end": 7079.9, "text": "und er wird nicht so viel draufdrücken."}, {"id": 800, "start": 7079.9, "end": 7081.9, "text": "Da wird der Käse auch drin bleiben."}, {"id": 801, "start": 7083.9, "end": 7085.9, "text": "Aber wer bin ich, dass ich das überhaupt"}, {"id": 802, "start": 7085.9, "end": 7087.9, "text": "in Erwägung ziehe hier"}, {"id": 803, "start": 7087.9, "end": 7089.9, "text": "das zu kritisieren."}, {"id": 804, "start": 7099.9, "end": 7101.9, "text": "Ich hab übrigens erst die Hälfte von meinem Essen gegessen."}, {"id": 805, "start": 7101.9, "end": 7107.9, "text": "Wir müssen noch ein Video gucken."}, {"id": 806, "start": 7113.9, "end": 7115.9, "text": "Nice. Wie gut, dass sie noch ein Video gemacht haben."}, {"id": 807, "start": 7115.9, "end": 7117.9, "text": "Was gibt's bei mir?"}, {"id": 808, "start": 7119.9, "end": 7121.9, "text": "Brötchen mit Salami."}, {"id": 809, "start": 7121.9, "end": 7123.9, "text": "Und dann noch zwei,"}, {"id": 810, "start": 7123.9, "end": 7125.9, "text": "also ein halbes,"}, {"id": 811, "start": 7125.9, "end": 7127.9, "text": "also ein Stück Brot halbiert"}, {"id": 812, "start": 7127.9, "end": 7129.9, "text": "mit Frischkäse drauf. Und bisschen"}, {"id": 813, "start": 7129.9, "end": 7131.9, "text": "Neisbeeren, also nichts wahnsinnig"}, {"id": 814, "start": 7131.9, "end": 7133.9, "text": "advancedes jetzt."}, {"id": 815, "start": 7137.9, "end": 7139.9, "text": "Kein Dragon Egg, leider kein Dragon Egg."}, {"id": 816, "start": 7143.9, "end": 7145.9, "text": "Nee, auch keine Diät."}, {"id": 817, "start": 7145.9, "end": 7147.9, "text": "Es reicht mir schon, dass ich ein bisschen Sport mache"}, {"id": 818, "start": 7147.9, "end": 7149.9, "text": "in letzter Zeit. Schon genug"}, {"id": 819, "start": 7149.9, "end": 7159.9, "text": "Pepo-Fett gerade am Start."}, {"id": 820, "start": 7173.9, "end": 7175.9, "text": "Das lag schon ein bisschen lang an der Luft."}, {"id": 821, "start": 7175.9, "end": 7179.9, "text": "Wie braun das ist."}, {"id": 822, "start": 7181.9, "end": 7183.9, "text": "Der muss aufpassen, dass er mit seinem Bart nicht"}, {"id": 823, "start": 7183.9, "end": 7185.9, "text": "in den Grill kommt."}, {"id": 824, "start": 7193.9, "end": 7195.9, "text": "Das ist der Corona-Filter."}, {"id": 825, "start": 7195.9, "end": 7197.9, "text": "Das Fleisch war zu lang an der Luft,"}, {"id": 826, "start": 7197.9, "end": 7199.9, "text": "deswegen esse ich ein bisschen braun."}, {"id": 827, "start": 7199.9, "end": 7201.9, "text": "Spätestens wenn du vom Grill kommst,"}, {"id": 828, "start": 7201.9, "end": 7203.9, "text": "siehst du es nicht mehr."}, {"id": 829, "start": 7211.9, "end": 7213.9, "text": "Was?"}, {"id": 830, "start": 7213.9, "end": 7215.9, "text": "Moment, Moment."}, {"id": 831, "start": 7215.9, "end": 7217.9, "text": "Warum mischt er das nicht mit der Machete?"}, {"id": 832, "start": 7217.9, "end": 7219.9, "text": "Ich weiß es nicht."}, {"id": 833, "start": 7219.9, "end": 7221.9, "text": "Ich weiß es nicht."}, {"id": 834, "start": 7221.9, "end": 7223.9, "text": "Ich weiß es nicht."}, {"id": 835, "start": 7223.9, "end": 7225.9, "text": "Warum mischt er das nicht mit der Machete?"}, {"id": 836, "start": 7227.9, "end": 7229.9, "text": "Ich hab jetzt erwartet, das wird mit der Machete"}, {"id": 837, "start": 7229.9, "end": 7231.9, "text": "gemischt."}, {"id": 838, "start": 7231.9, "end": 7233.9, "text": "Was soll das?"}, {"id": 839, "start": 7233.9, "end": 7235.9, "text": "Das ist aber nicht"}, {"id": 840, "start": 7235.9, "end": 7237.9, "text": "wahrer Coconut Style."}, {"id": 841, "start": 7243.9, "end": 7245.9, "text": "SPG ist"}, {"id": 842, "start": 7245.9, "end": 7247.9, "text": "Salt, Pepper, Garlic?"}, {"id": 843, "start": 7247.9, "end": 7249.9, "text": "Salt, Pepper, Garlic?"}, {"id": 844, "start": 7251.9, "end": 7253.9, "text": "Salt, Pepper, Garlic"}, {"id": 845, "start": 7253.9, "end": 7255.9, "text": "ist das glaube ich, SPG."}, {"id": 846, "start": 7255.9, "end": 7257.9, "text": "Also Salz, Pfeffer, Knoblauch."}, {"id": 847, "start": 7257.9, "end": 7259.9, "text": "Das ist ein sehr schweres Fleisch."}, {"id": 848, "start": 7259.9, "end": 7261.9, "text": "Ansonsten bräuchst du es,"}, {"id": 849, "start": 7261.9, "end": 7263.9, "text": "richtig?"}, {"id": 850, "start": 7263.9, "end": 7265.9, "text": "Sehr langsam kochen"}, {"id": 851, "start": 7265.9, "end": 7267.9, "text": "oder wir zeigen dir einen Trick."}, {"id": 852, "start": 7267.9, "end": 7269.9, "text": "Jetzt machen wir ein paar Schläge."}, {"id": 853, "start": 7269.9, "end": 7271.9, "text": "Vielleicht 1 1⁄3"}, {"id": 854, "start": 7271.9, "end": 7273.9, "text": "tief in es."}, {"id": 855, "start": 7273.9, "end": 7275.9, "text": "Wir wollen nicht alles durchgehen und es aufstecken."}, {"id": 856, "start": 7275.9, "end": 7277.9, "text": "Ich muss euch was gestehen."}, {"id": 857, "start": 7277.9, "end": 7279.9, "text": "Ich hab fertig gegessen."}, {"id": 858, "start": 7279.9, "end": 7281.9, "text": "Und ich hab noch Hunger."}, {"id": 859, "start": 7281.9, "end": 7283.9, "text": "Ich glaube,"}, {"id": 860, "start": 7283.9, "end": 7285.9, "text": "ich geh mal jetzt noch kurz was holen."}, {"id": 861, "start": 7285.9, "end": 7287.9, "text": "Ich bin gleich wieder da."}, {"id": 862, "start": 7287.9, "end": 7289.9, "text": "Soll ich was kleines?"}, {"id": 863, "start": 7289.9, "end": 7291.9, "text": "Keine Ahnung."}, {"id": 864, "start": 7291.9, "end": 7293.9, "text": "Gönn dir Döner-Teller."}, {"id": 865, "start": 7293.9, "end": 7295.9, "text": "Döner-Teller hab ich heute Mittag gegessen."}, {"id": 866, "start": 7295.9, "end": 7303.9, "text": "Ein halbes Inch dicken Schläge."}, {"id": 867, "start": 7303.9, "end": 7307.9, "text": "Soll ich noch mal was machen?"}, {"id": 868, "start": 7307.9, "end": 7309.9, "text": "Also, wir müssen jetzt"}, {"id": 869, "start": 7309.9, "end": 7311.9, "text": "und wir haben es gelesen."}, {"id": 870, "start": 7311.9, "end": 7313.9, "text": "Also wir haben es gelesen."}, {"id": 871, "start": 7313.9, "end": 7315.9, "text": "Wir haben es gelesen."}, {"id": 872, "start": 7315.9, "end": 7317.9, "text": "Wir haben es gelesen."}, {"id": 873, "start": 7317.9, "end": 7319.9, "text": "Wir haben es gelesen."}, {"id": 874, "start": 7319.9, "end": 7321.9, "text": "Wir haben es gelesen."}, {"id": 875, "start": 7321.9, "end": 7323.9, "text": "Wir haben es gelesen."}, {"id": 876, "start": 7323.9, "end": 7325.9, "text": "Wir haben uns gelesen."}, {"id": 877, "start": 7325.9, "end": 7327.9, "text": "upside-down-現象"}, {"id": 878, "start": 7327.9, "end": 7329.9, "text": "appetite- Kw!"}, {"id": 879, "start": 7329.9, "end": 7331.9, "text": "Jawohl!"}, {"id": 880, "start": 7331.9, "end": 7333.9, "text": "Das Leben ist schnell."}, {"id": 881, "start": 7333.9, "end": 7335.9, "text": "Das Leben ist sehr selten."}, {"id": 882, "start": 7335.9, "end": 7337.9, "text": "Wir sind am Rennen."}, {"id": 883, "start": 7337.9, "end": 7339.9, "text": "Wir sind mit denями ch menor schcore longtime geplant."}, {"id": 884, "start": 7339.9, "end": 7341.9, "text": "Da war ich changes 50rum und ich warum?"}, {"id": 885, "start": 7341.9, "end": 7343.9, "text": "und why would ya ya"}, {"id": 886, "start": 7343.9, "end": 7345.9, "text": "Christinafi"}, {"id": 887, "start": 7345.9, "end": 7348.22, "text": "Anna"}, {"id": 888, "start": 7348.22, "end": 7349.88, "text": "st eine"}, {"id": 889, "start": 7349.88, "end": 7351.88, "text": "M Unter?"}, {"id": 890, "start": 7351.88, "end": 7353.86, "text": "Lion"}, {"id": 891, "start": 7353.86, "end": 7360.86, "text": "So und nachdem mein erstes, erste Hälfte vom Essen so gesund war, wie gesagt, habe ich"}, {"id": 892, "start": 7383.86, "end": 7390.7, "text": "ein Brötchen mit Salami ohne Butter drunter und jeweils zwei halbe Stückchen Brot mit"}, {"id": 893, "start": 7390.7, "end": 7403.7, "text": "Frischkäse habe ich mir jetzt noch Lidl Apfelkuchenstückchen geholt, ein kleines Stückchen, ja, exzellent."}, {"id": 894, "start": 7403.7, "end": 7432.46, "text": "Das Fleisch sieht wirklich nicht gut aus, das hat zu lange rumgestanden."}, {"id": 895, "start": 7432.46, "end": 7438.62, "text": "Wie lange sollen wir dem jetzt da eigentlich zugucken, wie er den Kram da mariniert?"}, {"id": 896, "start": 7438.62, "end": 7446.46, "text": "Ich will sehen, wie das auf den Grill kommt, Alter."}, {"id": 897, "start": 7446.46, "end": 7453.98, "text": "Ich will jetzt Fleisch, Wiesenhof, Wiesenhof-Brutzler, Wiesenhof hat auch Corona."}, {"id": 898, "start": 7453.98, "end": 7481.78, "text": "So, jetzt auch das Kuchenstück und dann ist es fertig."}, {"id": 899, "start": 7481.78, "end": 7489.22, "text": "So, jetzt auch das Kuchenstück und dann ist der Max satt und ready für Akt 10."}, {"id": 900, "start": 7489.22, "end": 7505.5, "text": "Akt 10 geht schnell, keine Ahnung, halb Stunde oder so."}, {"id": 901, "start": 7505.5, "end": 7517.54, "text": "Man kann das mehrere Mal während dem Kochen machen und es kann ein paar Stunden dauern,"}, {"id": 902, "start": 7517.54, "end": 7519.3, "text": "depends an welcher Temperatur du hast."}, {"id": 903, "start": 7519.3, "end": 7526.58, "text": "Wieder, wir wollen langsam, 300 Grad Fahrenheit, das hilft, die Moistur zu behalten."}, {"id": 904, "start": 7526.58, "end": 7531.5, "text": "Wir drücken das aus, naja, es ist wirklich nicht erbärmlich und natürlich weiß jeder,"}, {"id": 905, "start": 7531.5, "end": 7536.5, "text": "der diese Eier gekocht hat, genau, wovon ich spreche, oder?"}, {"id": 906, "start": 7536.5, "end": 7541.5, "text": "Okay, ein bisschen mehr."}, {"id": 907, "start": 7541.5, "end": 7550.5, "text": "Oh, das sieht echt gut aus."}, {"id": 908, "start": 7550.5, "end": 7561.5, "text": "Ich habe jetzt nichts mehr zu tun, aber ich habe es einfach aufgemacht, wie ein Künstler."}, {"id": 909, "start": 7561.5, "end": 7564.5, "text": "Nehmt eure Zeit, es ist in der Detail."}, {"id": 910, "start": 7564.5, "end": 7573.5, "text": "Oh, wir haben da ein Stück glücklicher Gras, mit dem Dank an Bob Ross."}, {"id": 911, "start": 7573.5, "end": 7581.5, "text": "Du kannst es so lange wie du willst behalten, das ist ein PIT-Master Privilege."}, {"id": 912, "start": 7581.5, "end": 7589.5, "text": "Schiebe die Klappe wieder auf und nicht lange dauern."}, {"id": 913, "start": 7589.5, "end": 7590.5, "text": "Oh ja."}, {"id": 914, "start": 7590.5, "end": 7593.5, "text": "Exzellent."}, {"id": 915, "start": 7593.5, "end": 7599.5, "text": "Jetzt haben wir eine Seite Zwiebeln und ein paar Friesen."}, {"id": 916, "start": 7599.5, "end": 7605.5, "text": "Wir drücken das aus, fangen mit dem Heaten an, denn dieses Gras ist fast fertig."}, {"id": 917, "start": 7605.5, "end": 7611.5, "text": "Und im Wunder der Zeit, dieses Barbecue Gras-Bef ist fertig."}, {"id": 918, "start": 7611.5, "end": 7618.5, "text": "Du willst es zu einer internen Temperatur von ca. 120 Grad kochen, oder?"}, {"id": 919, "start": 7618.5, "end": 7621.5, "text": "Pretty much rare."}, {"id": 920, "start": 7621.5, "end": 7629.5, "text": "Sebarro, so ein fettes Stück Fleisch kostet dich mehr als 5 Euro."}, {"id": 921, "start": 7629.5, "end": 7637.5, "text": "Essen gehen ist mittlerweile so extrem teuer."}, {"id": 922, "start": 7637.5, "end": 7640.5, "text": "Wir sind teilweise nicht mehr ganz dicht."}, {"id": 923, "start": 7640.5, "end": 7646.5, "text": "Letztens, ein halbes Jahr oder so her, war ich mal Ente essen, weil ich mir gedacht habe,"}, {"id": 924, "start": 7646.5, "end": 7651.5, "text": "ich habe ewig keine Ente, also nicht China-Ente, sondern ganz, nicht Ente."}, {"id": 925, "start": 7651.5, "end": 7655.5, "text": "Ganz essen, soll ich so Gänse braten."}, {"id": 926, "start": 7655.5, "end": 7663.5, "text": "Dann habe ich am Ende, glaube ich, 28 Euro oder so ausgegeben."}, {"id": 927, "start": 7663.5, "end": 7667.5, "text": "Und was habe ich gekriegt?"}, {"id": 928, "start": 7667.5, "end": 7674.5, "text": "Ein paar Scheiben, für mich viel zu wenige Scheiben, Entenbraten mit Soße und einen Semmelknödel."}, {"id": 929, "start": 7674.5, "end": 7677.5, "text": "Einen Semmelknödel!"}, {"id": 930, "start": 7677.5, "end": 7681.5, "text": "Wollt ihr mich veräppeln?"}, {"id": 931, "start": 7681.5, "end": 7706.5, "text": "Ich gehe schnell mal hin."}, {"id": 932, "start": 7706.5, "end": 7711.5, "text": "Ich glaube, dass es am besten schmeckt, das, was er gerade abgeschnitten hat."}, {"id": 933, "start": 7711.5, "end": 7716.5, "text": "Das von der Seite, mit der Haut von außen, schmeckt, glaube ich, am besten."}, {"id": 934, "start": 7716.5, "end": 7726.5, "text": "Sieht aus wie ein Finger, sieht aus wie eine Hand."}, {"id": 935, "start": 7726.5, "end": 7734.5, "text": "Ich glaube, die müssten ihre Machete ein bisschen schärfen."}, {"id": 936, "start": 7734.5, "end": 7743.5, "text": "Guck mal, die Machete geht da kaum durch, ohne richtig fest drauf zu drücken."}, {"id": 937, "start": 7743.5, "end": 7747.5, "text": "Die sollen sich mal auf YouTube angucken, das Schärfst..."}, {"id": 938, "start": 7747.5, "end": 7752.5, "text": "Wie war das auch vor ein paar Jahren, was voll im Trend war auf die YouTube-Videos?"}, {"id": 939, "start": 7752.5, "end": 7758.5, "text": "Heißes Messer durch Cola-Flasche."}, {"id": 940, "start": 7758.5, "end": 7760.5, "text": "Das Video solltet ihr sich mal angucken."}, {"id": 941, "start": 7760.5, "end": 7764.5, "text": "Kennt ihr das noch? Heißes Messer durch Cola-Flasche?"}, {"id": 942, "start": 7764.5, "end": 7769.5, "text": "Das war vor ein paar Jahren voll angesagt, das hat irgendwie jeder auf YouTube lange gemacht."}, {"id": 943, "start": 7769.5, "end": 7772.5, "text": "Genau, 1000 Grad heißes Messer durch Cola-Flasche."}, {"id": 944, "start": 7772.5, "end": 7777.5, "text": "Genau das war's."}, {"id": 945, "start": 7777.5, "end": 7783.5, "text": "Tee from the future abonniert, 6 Monate, exzellent."}, {"id": 946, "start": 7783.5, "end": 7786.5, "text": "Fast so lange her wie deine Cod-Video, dann nicht ganz so lange."}, {"id": 947, "start": 7786.5, "end": 7794.5, "text": "Meine Cod-Videos sind ja 8 Jahre her und das andere ist glaube ich nur 3 Jahre her."}, {"id": 948, "start": 7794.5, "end": 7797.5, "text": "Ok, fertig gegessen Leute, exzellent, weiter geht's."}, {"id": 949, "start": 7797.5, "end": 7802.5, "text": "Also, ich muss mal kurz ein bisschen aufrefreshen, wie Akt 10 lief,"}, {"id": 950, "start": 7802.5, "end": 7807.5, "text": "dass wir möglichst schnell durchkommen."}, {"id": 951, "start": 7807.5, "end": 7810.5, "text": "Den Dude retten."}, {"id": 952, "start": 7810.5, "end": 7813.5, "text": "Square, ok, ich glaube ich weiß wieder wie es funktioniert."}, {"id": 953, "start": 7813.5, "end": 7818.5, "text": "Also, Akt 10 ist kurz."}, {"id": 954, "start": 7818.5, "end": 7820.5, "text": "Du hast mich geprägt."}, {"id": 955, "start": 7820.5, "end": 7824.5, "text": "Ich hoffe auch, dass du auf der Arbeit des Poggas sagst."}, {"id": 956, "start": 7824.5, "end": 7831.5, "text": "Oder wenigstens bashen, bashen, alter, bashen."}, {"id": 957, "start": 7831.5, "end": 7834.5, "text": "Zu irgendwas muss es ja gut gewesen sein."}, {"id": 958, "start": 7834.5, "end": 7837.5, "text": "Ich hab letztens auch wieder aus Versehen auf der Arbeit was losgelassen."}, {"id": 959, "start": 7837.5, "end": 7841.5, "text": "Auch irgendwelche sinnlosen Twitch-Emotes."}, {"id": 960, "start": 7841.5, "end": 7853.5, "text": "Wurde ich wieder merkwürdig angeguckt bzw. merkwürdig angehört über Teams."}, {"id": 961, "start": 7853.5, "end": 7857.5, "text": "Einmal im Monat Safe Call, so ist das richtig."}, {"id": 962, "start": 7857.5, "end": 7861.5, "text": "So gehört sich das."}, {"id": 963, "start": 7861.5, "end": 7873.5, "text": "So muss das sein."}, {"id": 964, "start": 7873.5, "end": 7886.5, "text": "Ja, genau Nelly Pogs, so sieht es aus."}, {"id": 965, "start": 7886.5, "end": 7890.5, "text": "So, jetzt muss man rechts runter und dann,"}, {"id": 966, "start": 7890.5, "end": 7892.5, "text": "dann kommt man auf so einen Platz."}, {"id": 967, "start": 7892.5, "end": 7896.5, "text": "Und dort musste man dann glaube ich diesen einen Boss nochmal machen."}, {"id": 968, "start": 7896.5, "end": 7904.5, "text": "Denen man vor drei Akten auch schon mal gemacht hat."}, {"id": 969, "start": 7904.5, "end": 7907.5, "text": "Kein Bock in Garten zu gehen."}, {"id": 970, "start": 7907.5, "end": 7909.5, "text": "Gartenstelz."}, {"id": 971, "start": 7909.5, "end": 7915.5, "text": "Das Spiel will das für Gartenstelz machen."}, {"id": 972, "start": 7915.5, "end": 7917.5, "text": "Streamt eigentlich der Friseur."}, {"id": 973, "start": 7917.5, "end": 7922.5, "text": "Der Friseur hat viel, hat sehr viel gestreamt."}, {"id": 974, "start": 7922.5, "end": 7927.5, "text": "Aber aktuell ist er irgendwie bei komischen Mobile Games hängen geblieben"}, {"id": 975, "start": 7927.5, "end": 7931.5, "text": "und streamt gerade wenig."}, {"id": 976, "start": 7931.5, "end": 7934.5, "text": "Der Fabian hat die letzten Jahre lang extrem viel gestreamt."}, {"id": 977, "start": 7934.5, "end": 7948.5, "text": "Teilweise 11 Stunden am Stück oder sowas."}, {"id": 978, "start": 7948.5, "end": 7951.5, "text": "Aber in letzter Zeit ist er immer so am Start."}, {"id": 979, "start": 7951.5, "end": 7960.5, "text": "Weil Mobile Games keck weh."}, {"id": 980, "start": 7960.5, "end": 7964.5, "text": "Ich meine Mobile Games, Alter, was ist da los?"}, {"id": 981, "start": 7964.5, "end": 7971.5, "text": "Hätte ich nie gedacht, dass der Fabian mal der Mobile Games-Sochter wird."}, {"id": 982, "start": 7971.5, "end": 7973.5, "text": "Ich meine jeder wie er will."}, {"id": 983, "start": 7973.5, "end": 7978.5, "text": "Also Fabian ist ja eh wurscht, der lässt sich ja prinzipiell nichts sagen."}, {"id": 984, "start": 7978.5, "end": 7983.5, "text": "Übrigens, übelst kacke Unic wieder."}, {"id": 985, "start": 7983.5, "end": 7988.5, "text": "Aber ich glaube diese Liga könnte es sich sogar lohnen Unics zumindest ein paar aufzuheben."}, {"id": 986, "start": 7988.5, "end": 7993.5, "text": "Weil es gibt ein Crafting Rezept, da kann man Unic zu einem Unic Ring machen."}, {"id": 987, "start": 7993.5, "end": 8004.5, "text": "Und da gibt es ein paar ganz gute."}, {"id": 988, "start": 8004.5, "end": 8007.5, "text": "Alter, könnt ihr mir sterben, please?"}, {"id": 989, "start": 8007.5, "end": 8014.5, "text": "Achso, das ist da unten."}, {"id": 990, "start": 8014.5, "end": 8022.5, "text": "Vor lauter Effekten, ich sehe den Gegner gerade gar nicht mehr."}, {"id": 991, "start": 8022.5, "end": 8030.5, "text": "Oh, jetzt habe ich den Chat geguckt und schon bin ich verreckt."}, {"id": 992, "start": 8030.5, "end": 8034.5, "text": "Der Fabian sieht, ne mittlerweile sieht er nicht mehr aus wie 23."}, {"id": 993, "start": 8034.5, "end": 8043.5, "text": "Der Fabian sah 10 Jahre lang aus wie 23, mittlerweile sieht er aus wie 24."}, {"id": 994, "start": 8043.5, "end": 8058.5, "text": "Oh fuck, ich muss mal Zeug casten."}, {"id": 995, "start": 8058.5, "end": 8065.5, "text": "Na doch, er sieht jetzt schon ein bisschen älter aus."}, {"id": 996, "start": 8065.5, "end": 8070.5, "text": "Aber wir sind beide 35 darf man nicht vergessen, wir sind ziemlich gleich alt."}, {"id": 997, "start": 8070.5, "end": 8076.5, "text": "Der Master Krabber übrigens auch."}, {"id": 998, "start": 8076.5, "end": 8082.5, "text": "Aber heute, ich meine, wo ist der Unterschied schon großartig?"}, {"id": 999, "start": 8082.5, "end": 8091.5, "text": "Gerade in der heutigen Zeit und online, ich meine, ich bin im Kopf auch irgendwie stehen geblieben als ich 23 war."}, {"id": 1000, "start": 8091.5, "end": 8106.5, "text": "Ich bin heute 35, sache auf der Arbeit Pog und Poggers und stream auf Twitch und poste den ganzen Tag irgendwelche Meme Bildchen."}, {"id": 1001, "start": 8106.5, "end": 8109.5, "text": "Achso, was sagt Alter schon großartig aus?"}, {"id": 1002, "start": 8109.5, "end": 8113.5, "text": "Ich bin übrigens falsch gelaufen."}, {"id": 1003, "start": 8113.5, "end": 8118.5, "text": "Ja, 35, kein Witz."}, {"id": 1004, "start": 8118.5, "end": 8128.5, "text": "Lol, lolololol, lololol,"}, {"id": 1005, "start": 8128.5, "end": 8132.5, "text": "Moment, wo müssen wir jetzt hin?"}, {"id": 1006, "start": 8132.5, "end": 8138.5, "text": "Waypoint."}, {"id": 1007, "start": 8138.5, "end": 8140.5, "text": "Respectpoints, brauchen wir nicht."}, {"id": 1008, "start": 8140.5, "end": 8146.5, "text": "Labyrinth Trial, das brauchen wir."}, {"id": 1009, "start": 8146.5, "end": 8161.5, "text": "Das war Waypoint-Crab. Wo ist der Waypoint? Waypoint-Crab so an."}, {"id": 1010, "start": 8161.5, "end": 8179.5, "text": "Was ist hier? Waypoint? Nope. Kein Waypoint, hier auch kein Waypoint."}, {"id": 1011, "start": 8179.5, "end": 8186.5, "text": "Wenn ich in den Chat gucke, bin ich immer halbtot danach."}, {"id": 1012, "start": 8186.5, "end": 8192.5, "text": "Die Akte sind das Schlimmste. Es geht. Die ersten kann ich ja mittlerweile schon auswendig."}, {"id": 1013, "start": 8192.5, "end": 8197.5, "text": "Aber die letzten zwei ist schon eine Weile her. Ich hab die letzte Liga ja ausgesetzt."}, {"id": 1014, "start": 8197.5, "end": 8205.5, "text": "Deswegen muss ich mal kurz mal ein bisschen in den Guide gucken."}, {"id": 1015, "start": 8205.5, "end": 8216.5, "text": "Übrigens sind sie faul geworden in den letzten Akten. Es gibt kaum noch Voice Acting."}, {"id": 1016, "start": 8216.5, "end": 8220.5, "text": "Ah, da ist der Waypoint. Excellent. Und da müssen wir rein."}, {"id": 1017, "start": 8220.5, "end": 8240.5, "text": "Also wir müssen das Osu-Ware-Labyrinth-Trial und Respec-Points. Juckt mich ehrlich gesagt nicht."}, {"id": 1018, "start": 8240.5, "end": 8256.5, "text": "Aber die Trial müssen wir finden. Da oben ist ein Garden Warfare-Action. Aha, sehr gut."}, {"id": 1019, "start": 8256.5, "end": 8267.5, "text": "Der Chat ist still. Heute ist ja auch kein Technik-Laber-Stream, wo es irgendwas Großartiges gibt."}, {"id": 1020, "start": 8267.5, "end": 8275.5, "text": "Aber falls ihr irgendwelche Fragen habt, sei es zur Ausbildung, zu irgendwelche Technik-Sachen,"}, {"id": 1021, "start": 8275.5, "end": 8282.5, "text": "oder sei es zu irgendeiner Router-Konfig, ihr könnt mich heute echt alles fragen."}, {"id": 1022, "start": 8282.5, "end": 8288.5, "text": "Meinen wegen sogar wie viel mein Schiss liegt, aber das weiß ich nicht."}, {"id": 1023, "start": 8288.5, "end": 8293.5, "text": "So advanced ist mein Klo noch nicht, das wiegen zu können."}, {"id": 1024, "start": 8293.5, "end": 8297.5, "text": "Also wer will sowas schon wissen? Außer irgendwelche komischen Leute."}, {"id": 1025, "start": 8297.5, "end": 8302.5, "text": "Aber wir wissen, dass es im Internet ganz viele komische Leute gibt."}, {"id": 1026, "start": 8302.5, "end": 8308.5, "text": "Chat besteht nur aus Big-Brain-Leuten, die müssen nichts fragen."}, {"id": 1027, "start": 8308.5, "end": 8313.5, "text": "Stimmt, stimmt."}, {"id": 1028, "start": 8313.5, "end": 8326.5, "text": "Ach, da oben ist das Trial. Ich bin vorbeigerannt. Da ist das Trial."}, {"id": 1029, "start": 8326.5, "end": 8334.5, "text": "Wo muss man lang? Ja, Game, lass mich einfach durch."}, {"id": 1030, "start": 8334.5, "end": 8339.5, "text": "Man kann die meisten Sachen hier einfach durchrennen, juckt überhaupt nicht."}, {"id": 1031, "start": 8339.5, "end": 8343.5, "text": "Das Game will, dass man hier wahnsinnige Big-Brain-Movement-Einlagen macht,"}, {"id": 1032, "start": 8343.5, "end": 8347.5, "text": "dabei einfach durchrennen und gut ist."}, {"id": 1033, "start": 8347.5, "end": 8354.5, "text": "Sachte und stirbt wahrscheinlich, klar."}, {"id": 1034, "start": 8354.5, "end": 8358.5, "text": "Ja, noch. Nee, später auch."}, {"id": 1035, "start": 8358.5, "end": 8363.5, "text": "Selbst in den Map Labyrinth-Challenges kann man eigentlich durchrennen."}, {"id": 1036, "start": 8363.5, "end": 8368.5, "text": "Es gibt übrigens einen richtig guten Tipp, der wirklich was bringt,"}, {"id": 1037, "start": 8368.5, "end": 8376.5, "text": "weil man später, für das allerletzte Labyrinth, muss man auch wieder Labyrinth-Trials sammeln."}, {"id": 1038, "start": 8376.5, "end": 8381.5, "text": "Und es gibt einen Chatraum, da kann man reingehen."}, {"id": 1039, "start": 8381.5, "end": 8390.5, "text": "Ich glaube, Trade Chat 870 oder 820 oder Global 820, da posten die Leute,"}, {"id": 1040, "start": 8390.5, "end": 8394.5, "text": "wenn sie Trials gefunden haben und man kann in ihr Game joinen."}, {"id": 1041, "start": 8394.5, "end": 8403.5, "text": "Das ist richtig nice. Okay, haben wir gemacht. Torched Quartz oben rechts."}, {"id": 1042, "start": 8403.5, "end": 8406.5, "text": "Global 820, genau. Das ist richtig praktisch."}, {"id": 1043, "start": 8406.5, "end": 8419.5, "text": "Dann hat man das innerhalb von einem Abend zusammen, die Trials."}, {"id": 1044, "start": 8419.5, "end": 8425.5, "text": "Ich versuche gerade übrigens Chat zu lesen und zu spielen, das klappt nicht."}, {"id": 1045, "start": 8425.5, "end": 8428.5, "text": "Wie sind deine Kochskills auf einer Skala 1 bis 10?"}, {"id": 1046, "start": 8428.5, "end": 8431.5, "text": "Früher habe ich ziemlich viel gekocht."}, {"id": 1047, "start": 8431.5, "end": 8435.5, "text": "Allerdings jetzt auch kein wahnsinnig Big-Brain,"}, {"id": 1048, "start": 8435.5, "end": 8440.5, "text": "französische Spezialküche, sonst was Zeug."}, {"id": 1049, "start": 8440.5, "end": 8443.5, "text": "So normales Zeug, ja."}, {"id": 1050, "start": 8443.5, "end": 8448.5, "text": "Also von Spaghetti bis Schnitzel zu sonst was, also so normale Sachen."}, {"id": 1051, "start": 8448.5, "end": 8451.5, "text": "Also das kriege ich heute auch noch ohne Probleme hin."}, {"id": 1052, "start": 8451.5, "end": 8457.5, "text": "Ich würde mal sagen, so vier, vier."}, {"id": 1053, "start": 8457.5, "end": 8461.5, "text": "Meine Kochskills eher so, vielleicht sogar fünf."}, {"id": 1054, "start": 8461.5, "end": 8465.5, "text": "Ich weiß nicht, wie gut der Durchschnittskochmensch so ist."}, {"id": 1055, "start": 8465.5, "end": 8473.5, "text": "Aber bei advanceden Sachen hört es dann auf."}, {"id": 1056, "start": 8473.5, "end": 8479.5, "text": "Was muss ich jetzt eigentlich drin machen?"}, {"id": 1057, "start": 8479.5, "end": 8481.5, "text": "Ach genau, ich sage es doch."}, {"id": 1058, "start": 8481.5, "end": 8484.5, "text": "Wir müssen den gleichen Boss nochmal killen, den wir schon mal gekillt haben."}, {"id": 1059, "start": 8484.5, "end": 8488.5, "text": "Weil das Game besonders gut im Recyceln ist."}, {"id": 1060, "start": 8488.5, "end": 8497.5, "text": "Excellent Recycler."}, {"id": 1061, "start": 8497.5, "end": 8498.5, "text": "Aha, oh."}, {"id": 1062, "start": 8498.5, "end": 8500.5, "text": "Guck mal, ein Delirium-Portal."}, {"id": 1063, "start": 8500.5, "end": 8503.5, "text": "Das war in der letzten League die Hauptmechanik."}, {"id": 1064, "start": 8503.5, "end": 8507.5, "text": "Oh, Game, ruckel nicht so."}, {"id": 1065, "start": 8507.5, "end": 8513.5, "text": "Nicht ruckeln, please, Path of Exile."}, {"id": 1066, "start": 8513.5, "end": 8518.5, "text": "Also für die Optik muss man sagen, hat das Game keine allzu gute Performance."}, {"id": 1067, "start": 8518.5, "end": 8522.5, "text": "Die Performance ist absolut in Ordnung zu 95%,"}, {"id": 1068, "start": 8522.5, "end": 8528.5, "text": "aber manchmal hast du richtig krasse Slowdowns."}, {"id": 1069, "start": 8528.5, "end": 8533.5, "text": "Jetzt ruckelt es zum Beispiel zwischendurch."}, {"id": 1070, "start": 8533.5, "end": 8538.5, "text": "Ich glaube, das legt sich in dem Frame-Counter gar nicht so wirklich nieder,"}, {"id": 1071, "start": 8538.5, "end": 8541.5, "text": "weil er bloß alle 2-3 Sekunden aktualisiert."}, {"id": 1072, "start": 8541.5, "end": 8546.5, "text": "Aber das hat immer zwischendrin richtige Slowdowns."}, {"id": 1073, "start": 8546.5, "end": 8550.5, "text": "Grafikkarte oder GPU, CPU oder Grafikkarte,"}, {"id": 1074, "start": 8550.5, "end": 8553.5, "text": "ich habe ehrlich gesagt keine Ahnung, woran das in dem Game liegt."}, {"id": 1075, "start": 8553.5, "end": 8567.5, "text": "Die Garen-Warfare-Geschichte nicht gemacht."}, {"id": 1076, "start": 8567.5, "end": 8573.5, "text": "So, mal gucken, was es für Drops gibt."}, {"id": 1077, "start": 8573.5, "end": 8577.5, "text": "Aha."}, {"id": 1078, "start": 8577.5, "end": 8582.5, "text": "Da kann aber nichts Gutes mehr bei rauskommen, so wirklich."}, {"id": 1079, "start": 8582.5, "end": 8588.5, "text": "Aber ich liefere mal den ganzen Crap in der Stadt ab."}, {"id": 1080, "start": 8588.5, "end": 8591.5, "text": "Verwendest du schon den Vulcan-Renderer?"}, {"id": 1081, "start": 8591.5, "end": 8600.5, "text": "Nö, wusste gar nicht, dass es einen Vulcan-Renderer gibt."}, {"id": 1082, "start": 8600.5, "end": 8605.5, "text": "War mir nicht bewusst, dass es einen Vulcan-Renderer gibt."}, {"id": 1083, "start": 8605.5, "end": 8610.5, "text": "Ist der denn besser?"}, {"id": 1084, "start": 8610.5, "end": 8612.5, "text": "Komm, wir machen das später, ja."}, {"id": 1085, "start": 8612.5, "end": 8617.5, "text": "Erstmal alles wegkloppen."}, {"id": 1086, "start": 8617.5, "end": 8618.5, "text": "Erstmal alles wegkloppen."}, {"id": 1087, "start": 8618.5, "end": 8627.5, "text": "Ich will jetzt die Story durchkriegen."}, {"id": 1088, "start": 8627.5, "end": 8632.5, "text": "Volke läuft bei mir viel besser als Diode X, okay."}, {"id": 1089, "start": 8632.5, "end": 8634.5, "text": "Oh, ein Unset-Ring, Poggers."}, {"id": 1090, "start": 8634.5, "end": 8636.5, "text": "Schon der zweite."}, {"id": 1091, "start": 8636.5, "end": 8637.5, "text": "Mal gucken, was für eine Socke."}, {"id": 1092, "start": 8637.5, "end": 8638.5, "text": "Wieder ein grüner."}, {"id": 1093, "start": 8638.5, "end": 8640.5, "text": "Okay, mal gucken, wie der ist."}, {"id": 1094, "start": 8640.5, "end": 8642.5, "text": "Der suckt."}, {"id": 1095, "start": 8642.5, "end": 8643.5, "text": "Was ein Crap-Ring."}, {"id": 1096, "start": 8643.5, "end": 8647.5, "text": "Aber den können wir im Garten, den reforgen wir im Garten mal."}, {"id": 1097, "start": 8647.5, "end": 8652.5, "text": "Und gucken, ob da was halbwegs Gescheites bei rauskommt."}, {"id": 1098, "start": 8652.5, "end": 8664.5, "text": "Unset-Rings brauche ich nämlich ein paar fürs Endgame."}, {"id": 1099, "start": 8664.5, "end": 8670.5, "text": "Bis dann, Renax."}, {"id": 1100, "start": 8670.5, "end": 8672.5, "text": "Was ist eigentlich dieser Garten?"}, {"id": 1101, "start": 8672.5, "end": 8677.5, "text": "Das ist die Mechanik von der aktuellen League."}, {"id": 1102, "start": 8677.5, "end": 8683.5, "text": "Also, das Game, es droppen Samen, die kann man da pflanzen."}, {"id": 1103, "start": 8683.5, "end": 8687.5, "text": "Und wenn man die dann eine Weile quasi in diesem Garten stehen lässt,"}, {"id": 1104, "start": 8687.5, "end": 8688.5, "text": "dann wachsen die."}, {"id": 1105, "start": 8688.5, "end": 8691.5, "text": "Und wenn die gewachsen sind, gehen sie kaputt und kommen Mops raus."}, {"id": 1106, "start": 8691.5, "end": 8694.5, "text": "Wenn man die Mops killt, kriegt man neue Samen, paar Drops."}, {"id": 1107, "start": 8694.5, "end": 8697.5, "text": "Und bekommt quasi Saft."}, {"id": 1108, "start": 8697.5, "end": 8699.5, "text": "Mit dem Saft kann man dann Sachen craften."}, {"id": 1109, "start": 8699.5, "end": 8705.5, "text": "Eigentlich total unnütz kompliziert gemacht, wenn man es so will."}, {"id": 1110, "start": 8705.5, "end": 8707.5, "text": "Alter, wo geht es denn hier weiter?"}, {"id": 1111, "start": 8707.5, "end": 8708.5, "text": "Kann doch nicht sein."}, {"id": 1112, "start": 8708.5, "end": 8709.5, "text": "Ich bin hier schon komplett am Durch..."}, {"id": 1113, "start": 8709.5, "end": 8710.5, "text": "Ah, das ist immer..."}, {"id": 1114, "start": 8710.5, "end": 8711.5, "text": "Exzellent."}, {"id": 1115, "start": 8711.5, "end": 8713.5, "text": "Max spielt Passive-Exerl, ja."}, {"id": 1116, "start": 8713.5, "end": 8717.5, "text": "Ich hatte die Auswahl heute zu streamen oder Kreisel-Grind zu machen."}, {"id": 1117, "start": 8717.5, "end": 8720.5, "text": "Und ich habe gesagt, okay, ich habe heute mehr Bock auf Kreisel-Grind."}, {"id": 1118, "start": 8720.5, "end": 8723.5, "text": "Aber ich mache einfach zum Kreisel-Grind den Stream an."}, {"id": 1119, "start": 8723.5, "end": 8725.5, "text": "Wir müssen skillen."}, {"id": 1120, "start": 8725.5, "end": 8726.5, "text": "Skillen."}, {"id": 1121, "start": 8726.5, "end": 8727.5, "text": "So, was gab es denn?"}, {"id": 1122, "start": 8727.5, "end": 8728.5, "text": "Den da, den da."}, {"id": 1123, "start": 8728.5, "end": 8731.5, "text": "Und dann, ich bin mir nicht mal ganz sicher, was muss man skillen?"}, {"id": 1124, "start": 8731.5, "end": 8734.5, "text": "Was müssen wir skillen?"}, {"id": 1125, "start": 8734.5, "end": 8735.5, "text": "Ja."}, {"id": 1126, "start": 8735.5, "end": 8738.5, "text": "Soul of Steel müssen wir skillen."}, {"id": 1127, "start": 8738.5, "end": 8742.5, "text": "Also quasi hier runter dann."}, {"id": 1128, "start": 8742.5, "end": 8747.5, "text": "Ah, die Defense sieht doch jetzt schon ganz brauchbar aus."}, {"id": 1129, "start": 8747.5, "end": 8750.5, "text": "Voll die Mobile-Game-Mechanik."}, {"id": 1130, "start": 8750.5, "end": 8751.5, "text": "Ja."}, {"id": 1131, "start": 8751.5, "end": 8752.5, "text": "Eigentlich schon, ja."}, {"id": 1132, "start": 8752.5, "end": 8755.5, "text": "Eigentlich ist es so richtig Mobile-Game-Mechanik."}, {"id": 1133, "start": 8755.5, "end": 8761.5, "text": "So, mal gucken, ob wir den Ring jetzt zu irgendwas halbwegs brauchbaren craften können."}, {"id": 1134, "start": 8761.5, "end": 8764.5, "text": "So, hier."}, {"id": 1135, "start": 8764.5, "end": 8765.5, "text": "Hier."}, {"id": 1136, "start": 8765.5, "end": 8766.5, "text": "Hier."}, {"id": 1137, "start": 8766.5, "end": 8767.5, "text": "Ja."}, {"id": 1138, "start": 8767.5, "end": 8776.5, "text": "Ja, Game ist ja gut."}, {"id": 1139, "start": 8776.5, "end": 8777.5, "text": "Mehr Effekte, please."}, {"id": 1140, "start": 8777.5, "end": 8778.5, "text": "Mehr Effekte."}, {"id": 1141, "start": 8778.5, "end": 8779.5, "text": "Es sind noch zu wenige Effekte."}, {"id": 1142, "start": 8779.5, "end": 8780.5, "text": "Zu wenige Effekte."}, {"id": 1143, "start": 8780.5, "end": 8781.5, "text": "Freue mich auf die Switch-Version."}, {"id": 1144, "start": 8781.5, "end": 8782.5, "text": "Ihr werdet lachen, es gibt eine PS4-Version."}, {"id": 1145, "start": 8782.5, "end": 8783.5, "text": "Ich weiß nicht, ob es eine Xbox-Version gibt."}, {"id": 1146, "start": 8783.5, "end": 8784.5, "text": "Spielst du HC?"}, {"id": 1147, "start": 8784.5, "end": 8785.5, "text": "Nee, nee, nee."}, {"id": 1148, "start": 8785.5, "end": 8786.5, "text": "Ganz normal."}, {"id": 1149, "start": 8786.5, "end": 8787.5, "text": "Softcore."}, {"id": 1150, "start": 8787.5, "end": 8788.5, "text": "Harvest-Standard."}, {"id": 1151, "start": 8788.5, "end": 8789.5, "text": "Softcore."}, {"id": 1152, "start": 8789.5, "end": 8809.5, "text": "So, mal gucken, ob wir den Ring jetzt zu irgendwas gescheite machen."}, {"id": 1153, "start": 8809.5, "end": 8820.5, "text": "So, mal gucken, ob wir den Ring jetzt zu irgendwas gescheit craften können."}, {"id": 1154, "start": 8820.5, "end": 8822.5, "text": "Was haben wir denn hier zur Auswahl?"}, {"id": 1155, "start": 8822.5, "end": 8823.5, "text": "Three Sockets."}, {"id": 1156, "start": 8823.5, "end": 8828.5, "text": "Okay, drei Sockel geht nicht."}, {"id": 1157, "start": 8828.5, "end": 8831.5, "text": "Reforge."}, {"id": 1158, "start": 8831.5, "end": 8834.5, "text": "Reforge a rare item with attack modify."}, {"id": 1159, "start": 8834.5, "end": 8835.5, "text": "Okay, das können wir mal ausprobieren."}, {"id": 1160, "start": 8835.5, "end": 8845.5, "text": "Es ist immer noch kacke."}, {"id": 1161, "start": 8845.5, "end": 8854.5, "text": "Wobei, so schlecht ist er gar nicht mehr."}, {"id": 1162, "start": 8854.5, "end": 8865.5, "text": "Aber plus 128 Accuracy-Rating ist halt..."}, {"id": 1163, "start": 8865.5, "end": 8867.5, "text": "Können wir die Sockel-Farbe noch ändern?"}, {"id": 1164, "start": 8867.5, "end": 8869.5, "text": "Weil ich glaube, ich brauche keinen grünen Sockel."}, {"id": 1165, "start": 8869.5, "end": 8872.5, "text": "Ich glaube, ich brauche einen blauen Sockel später."}, {"id": 1166, "start": 8872.5, "end": 8878.5, "text": "Kannst du die Bitrate erhöhen?"}, {"id": 1167, "start": 8878.5, "end": 8881.5, "text": "Oh, sorry Leute, das habe ich ja voll vergessen."}, {"id": 1168, "start": 8881.5, "end": 8882.5, "text": "Ja klar."}, {"id": 1169, "start": 8882.5, "end": 8884.5, "text": "Warum habe ich..."}, {"id": 1170, "start": 8884.5, "end": 8887.5, "text": "Das müsst ihr mir ja sagen, ey."}, {"id": 1171, "start": 8887.5, "end": 8889.5, "text": "Das Game sieht übelst kacke aus ansonsten."}, {"id": 1172, "start": 8889.5, "end": 8892.5, "text": "Jetzt sieht das gut aus."}, {"id": 1173, "start": 8892.5, "end": 8894.5, "text": "Vielleicht viel besser."}, {"id": 1174, "start": 8894.5, "end": 8896.5, "text": "Hab schon mal geschrieben, da muss mich zu..."}, {"id": 1175, "start": 8896.5, "end": 8898.5, "text": "Sebaro, mein Chef hätte jetzt gesagt,"}, {"id": 1176, "start": 8898.5, "end": 8910.5, "text": "da hättest du mich energischer darauf hinweisen müssen."}, {"id": 1177, "start": 8910.5, "end": 8911.5, "text": "Ja, das habe ich ganz vergessen am Anfang."}, {"id": 1178, "start": 8911.5, "end": 8919.5, "text": "Der Stream sah übelst räudig aus."}, {"id": 1179, "start": 8919.5, "end": 8922.5, "text": "Kann man die Sockel..."}, {"id": 1180, "start": 8922.5, "end": 8925.5, "text": "Okay, das Ding hat zumindest viele Resis."}, {"id": 1181, "start": 8925.5, "end": 8927.5, "text": "Das ist schon mal okay."}, {"id": 1182, "start": 8927.5, "end": 8933.5, "text": "Kann man die Sockel..."}, {"id": 1183, "start": 8933.5, "end": 8938.5, "text": "Hier kann man die Sockel nicht reforgen."}, {"id": 1184, "start": 8938.5, "end": 8946.5, "text": "Sockelfarbe."}, {"id": 1185, "start": 8946.5, "end": 8948.5, "text": "Stimmt, stimmt, ja klar."}, {"id": 1186, "start": 8948.5, "end": 8951.5, "text": "Erst so, ich muss erst mal gucken, was ich eigentlich brauche."}, {"id": 1187, "start": 8951.5, "end": 8952.5, "text": "Genau."}, {"id": 1188, "start": 8952.5, "end": 8959.5, "text": "Skills."}, {"id": 1189, "start": 8959.5, "end": 8960.5, "text": "Blau."}, {"id": 1190, "start": 8960.5, "end": 8962.5, "text": "Blauen brauche ich und..."}, {"id": 1191, "start": 8962.5, "end": 8964.5, "text": "Auch noch irgendwas."}, {"id": 1192, "start": 8964.5, "end": 8965.5, "text": "Okay, auf jeden Fall einen blauen."}, {"id": 1193, "start": 8965.5, "end": 8967.5, "text": "Aber das kann ich später machen."}, {"id": 1194, "start": 8967.5, "end": 8972.5, "text": "Das muss ich jetzt nicht machen."}, {"id": 1195, "start": 8972.5, "end": 8974.5, "text": "101 Lifeforce will be lost."}, {"id": 1196, "start": 8974.5, "end": 8975.5, "text": "Nein, nein, nein, Kollege."}, {"id": 1197, "start": 8975.5, "end": 8976.5, "text": "Storage Tank."}, {"id": 1198, "start": 8976.5, "end": 8977.5, "text": "Crafting."}, {"id": 1199, "start": 8977.5, "end": 8979.5, "text": "Bam."}, {"id": 1200, "start": 8979.5, "end": 8980.5, "text": "Storage Tank."}, {"id": 1201, "start": 8980.5, "end": 8982.5, "text": "Excellent."}, {"id": 1202, "start": 8982.5, "end": 8984.5, "text": "Kann man nie genug haben."}, {"id": 1203, "start": 8984.5, "end": 8992.5, "text": "Wie gesagt, das optimale Garenlayout braucht viele Items."}, {"id": 1204, "start": 8992.5, "end": 8995.5, "text": "Und irgendwie noch Dispenser."}, {"id": 1205, "start": 8995.5, "end": 8996.5, "text": "So."}, {"id": 1206, "start": 8996.5, "end": 9000.5, "text": "Rest kann kondensiert werden."}, {"id": 1207, "start": 9000.5, "end": 9025.5, "text": "Mal hier."}, {"id": 1208, "start": 9025.5, "end": 9037.5, "text": "Okay, gut."}, {"id": 1209, "start": 9037.5, "end": 9041.5, "text": "Ach, ich deb, ich habe meine Seeds ja wieder in der Kiste vergessen."}, {"id": 1210, "start": 9041.5, "end": 9047.5, "text": "Richtig low brain."}, {"id": 1211, "start": 9047.5, "end": 9053.5, "text": "Seeds, wo sind sie?"}, {"id": 1212, "start": 9053.5, "end": 9060.5, "text": "Oder auch nicht?"}, {"id": 1213, "start": 9060.5, "end": 9071.5, "text": "Aber Seeds, nicht Seeds."}, {"id": 1214, "start": 9071.5, "end": 9072.5, "text": "Excellent."}, {"id": 1215, "start": 9072.5, "end": 9073.5, "text": "Lohnt sich das überhaupt?"}, {"id": 1216, "start": 9073.5, "end": 9075.5, "text": "Komm, ich mache jetzt gar nicht lange mit irgendwelchem Loot rum."}, {"id": 1217, "start": 9075.5, "end": 9077.5, "text": "Das wird jetzt gedumpt."}, {"id": 1218, "start": 9077.5, "end": 9078.5, "text": "Fertig."}, {"id": 1219, "start": 9078.5, "end": 9079.5, "text": "Nein, nein, nein."}, {"id": 1220, "start": 9079.5, "end": 9086.5, "text": "Seeds wieder reingeschmissen wollte ich noch gar nicht."}, {"id": 1221, "start": 9086.5, "end": 9089.5, "text": "Gut."}, {"id": 1222, "start": 9089.5, "end": 9096.5, "text": "Man darf sie auch nicht so lange Zeit lassen, weil ansonsten ist die Resette die Map wieder."}, {"id": 1223, "start": 9096.5, "end": 9114.5, "text": "So ist gut."}, {"id": 1224, "start": 9114.5, "end": 9117.5, "text": "Alles klar, weiter geht's."}, {"id": 1225, "start": 9117.5, "end": 9119.5, "text": "Bei mir ist immer noch 4900."}, {"id": 1226, "start": 9119.5, "end": 9120.5, "text": "Was?"}, {"id": 1227, "start": 9120.5, "end": 9121.5, "text": "Echt?"}, {"id": 1228, "start": 9121.5, "end": 9137.5, "text": "Eigentlich sollte das jetzt hochgehen."}, {"id": 1229, "start": 9137.5, "end": 9140.5, "text": "Eigentlich sollte die Stream-Qualität jetzt hochkommen, aber ich mache es mal runter."}, {"id": 1230, "start": 9140.5, "end": 9146.5, "text": "Geht sie denn runter?"}, {"id": 1231, "start": 9146.5, "end": 9149.5, "text": "Ah, das Nvidia-Ding kann glaube ich nicht."}, {"id": 1232, "start": 9149.5, "end": 9152.5, "text": "Ich muss mir den Big Brain Seed-Layout machen."}, {"id": 1233, "start": 9152.5, "end": 9153.5, "text": "Ja, ich weiß, habe ich schon."}, {"id": 1234, "start": 9153.5, "end": 9156.5, "text": "Ich habe schon das optimale Seed-Layout hier am Start."}, {"id": 1235, "start": 9156.5, "end": 9163.5, "text": "Der Nvidia-Decoder kann die Bitrate nicht dynamisch ändern."}, {"id": 1236, "start": 9163.5, "end": 9168.5, "text": "Okay, das ist jetzt der erste Nachteil, den ich an dem Nvidia-Decoder gefunden habe."}, {"id": 1237, "start": 9168.5, "end": 9169.5, "text": "Ja, anscheinend."}, {"id": 1238, "start": 9169.5, "end": 9170.5, "text": "Geht nicht."}, {"id": 1239, "start": 9170.5, "end": 9183.5, "text": "Das ist für Einsteiger, du brauchst das hier."}, {"id": 1240, "start": 9183.5, "end": 9188.5, "text": "Ich starte den Stream einfach mal kurz neu."}, {"id": 1241, "start": 9188.5, "end": 9193.5, "text": "Hattest du den nicht sonst auch immer?"}, {"id": 1242, "start": 9193.5, "end": 9194.5, "text": "Nee, nicht immer."}, {"id": 1243, "start": 9194.5, "end": 9202.5, "text": "Ich habe den erst seit 2-3 Wochen."}, {"id": 1244, "start": 9202.5, "end": 9207.5, "text": "Wo ist jetzt der große Unterschied?"}, {"id": 1245, "start": 9207.5, "end": 9208.5, "text": "Oh."}, {"id": 1246, "start": 9208.5, "end": 9209.5, "text": "PoE-Extreme-Layout."}, {"id": 1247, "start": 9209.5, "end": 9214.5, "text": "Ja, die über 3 ist wieder voll, die Leute."}, {"id": 1248, "start": 9214.5, "end": 9219.5, "text": "Leute, ich starte einfach den Stream schnell neu."}, {"id": 1249, "start": 9219.5, "end": 9222.5, "text": "Dann haben wir nämlich bessere Quali."}, {"id": 1250, "start": 9222.5, "end": 9225.5, "text": "Dann pixelt der Scheiß nicht mehr so."}]}