{"text": "So mal gucken ob das jetzt funst. Näh, fuck. Scheiß funst nicht richtig. Näh, Unity Media spackt übelst rum, guckt euch das mal an. Das ist kaputt, das schwankt übertrieben. Ich hab runtergestellt auf 2000, guckt mal wie das einbricht, seht ihr das? Das ist nicht normal, Null, 500. Das ist doch nicht euer Ernst, ich hab keine Ahnung was mit Unity Media abgeht. Voll für'n Arsch, oh, ich schaff konstante 670kb, ohohohoh, 705kb, das kann sich doch keiner angucken, das verschmiert wie Sau. Die probieren jetzt aus was maximal Upload geht, das ist das erste mal das Problem mit Unity Media hab, seit ich streamen wollt, komisch, jetzt wo ich die Telekom nicht mehr am Start hab, fangen sie an kacke zu werden. Ok, 670kb geht, stellen wir mal ein bisschen höher, machen wir 1000, ja das muss auch gehen, vielleicht kann ich den Twitch-Surfer noch wechseln. Ok, 1000, 1000 geht auch, 1000 geht auch, ich war mal davon abgesehen, das ruckelt halt viel Sau, wenn ich irgendwas aufmach jetzt, na, ah, schmiert halt, ah, ich muss ein paar Seite reloaden, aber hören tut er mich, na, ne Jun, ich hab genug Upload, guckt euch das mal an, ich hab genug Upload, aber da kommt ein Viertel davon an, ich mein es kann doch nicht sein, dass es einbricht mit einem Embit, the fuck, das ist im Arsch, ja können wir heute wahrscheinlich nix machen großartig, weil man sieht ja nix, das sieht halt kacke aus mit so einer Bitrate, was ist das hier, hast du den Router, ja den Router hab ich ein und ausgeschaltet, also meinen Mikrotik-Router nicht, warum auch, aber dieses komische Unity Media Modem hab ich ein und ausgeschaltet, naja aber sobald ich was bewege werdet ihr sehen, es pixelt wie Sau, na, glaubst mir, war geil, sauber, na, na, na, na, na, na, na, ich stream gleich zu einem anderen Tweet, aber ey Leute ich hab auf speedtest schon übelsten, guckt euch das mal an, ich hab hier gerade schon mal probiert wir nehmen jetzt mal irgendwie Change Server, wir nehmen mal was nach Würzburg oder so, ist halt voll für'n Arsch, jetzt Tröckels wahrscheinlich klar wieder. Down ist super, kein Problem, aber passt mal auf, Upload jetzt, Upload müssten 5, 5 Ambit müssten Upload sein, kackt jetzt schon ab, Lulve, ja, voll für den Arsch, es müssten 5 Ambit Upload sein, ok wir stellen es mal auf 2, das geht, ne, 720p bringt auch nichts, ok das ist jetzt besser, oder, aber es, Alter.", "segments": [{"id": 1, "start": 0.0, "end": 10.6, "text": "So mal gucken ob das jetzt funst."}, {"id": 2, "start": 10.6, "end": 37.76, "text": "Näh, fuck."}, {"id": 3, "start": 37.76, "end": 50.96, "text": "Scheiß funst nicht richtig."}, {"id": 4, "start": 50.96, "end": 54.68, "text": "Näh, Unity Media spackt übelst rum, guckt euch das mal an."}, {"id": 5, "start": 54.68, "end": 75.0, "text": "Das ist kaputt, das schwankt übertrieben."}, {"id": 6, "start": 75.0, "end": 81.6, "text": "Ich hab runtergestellt auf 2000, guckt mal wie das einbricht, seht ihr das?"}, {"id": 7, "start": 81.6, "end": 99.8, "text": "Das ist nicht normal, Null, 500."}, {"id": 8, "start": 99.8, "end": 119.64, "text": "Das ist doch nicht euer Ernst, ich hab keine Ahnung was mit Unity Media abgeht."}, {"id": 9, "start": 119.64, "end": 139.96, "text": "Voll für'n Arsch, oh, ich schaff konstante 670kb, ohohohoh, 705kb, das kann sich doch"}, {"id": 10, "start": 139.96, "end": 142.08, "text": "keiner angucken, das verschmiert wie Sau."}, {"id": 11, "start": 142.08, "end": 151.28, "text": "Die probieren jetzt aus was maximal Upload geht, das ist das erste mal das Problem mit"}, {"id": 12, "start": 151.28, "end": 160.24, "text": "Unity Media hab, seit ich streamen wollt, komisch, jetzt wo ich die Telekom nicht mehr"}, {"id": 13, "start": 160.24, "end": 163.6, "text": "am Start hab, fangen sie an kacke zu werden."}, {"id": 14, "start": 163.6, "end": 173.4, "text": "Ok, 670kb geht, stellen wir mal ein bisschen höher, machen wir 1000, ja das muss auch gehen,"}, {"id": 15, "start": 173.4, "end": 176.2, "text": "vielleicht kann ich den Twitch-Surfer noch wechseln."}, {"id": 16, "start": 176.2, "end": 202.04, "text": "Ok, 1000, 1000 geht auch, 1000 geht auch, ich war mal davon abgesehen, das ruckelt halt"}, {"id": 17, "start": 202.04, "end": 216.16, "text": "viel Sau, wenn ich irgendwas aufmach jetzt, na, ah, schmiert halt, ah, ich muss ein paar"}, {"id": 18, "start": 216.16, "end": 231.48, "text": "Seite reloaden, aber hören tut er mich, na, ne Jun, ich hab genug Upload, guckt euch das"}, {"id": 19, "start": 231.48, "end": 243.52, "text": "mal an, ich hab genug Upload, aber da kommt ein Viertel davon an, ich mein es kann doch"}, {"id": 20, "start": 243.52, "end": 256.56, "text": "nicht sein, dass es einbricht mit einem Embit, the fuck, das ist im Arsch, ja können wir"}, {"id": 21, "start": 256.56, "end": 262.44, "text": "heute wahrscheinlich nix machen großartig, weil man sieht ja nix, das sieht halt kacke"}, {"id": 22, "start": 262.44, "end": 269.24, "text": "aus mit so einer Bitrate, was ist das hier, hast du den Router, ja den Router hab ich"}, {"id": 23, "start": 269.24, "end": 275.88, "text": "ein und ausgeschaltet, also meinen Mikrotik-Router nicht, warum auch, aber dieses komische Unity"}, {"id": 24, "start": 275.88, "end": 286.4, "text": "Media Modem hab ich ein und ausgeschaltet, naja aber sobald ich was bewege werdet ihr"}, {"id": 25, "start": 286.4, "end": 314.2, "text": "sehen, es pixelt wie Sau, na, glaubst mir, war geil, sauber, na, na, na, na, na, na, na,"}, {"id": 26, "start": 314.2, "end": 321.72, "text": "ich stream gleich zu einem anderen Tweet, aber ey Leute ich hab auf speedtest schon übelsten,"}, {"id": 27, "start": 321.72, "end": 327.98, "text": "guckt euch das mal an, ich hab hier gerade schon mal probiert wir nehmen jetzt mal irgendwie"}, {"id": 28, "start": 327.98, "end": 333.96, "text": "Change Server, wir nehmen mal was nach Würzburg oder so, ist halt voll für'n Arsch, jetzt"}, {"id": 29, "start": 333.96, "end": 344.12, "text": "Tröckels wahrscheinlich klar wieder."}, {"id": 30, "start": 344.12, "end": 350.36, "text": "Down ist super, kein Problem, aber passt mal auf, Upload jetzt, Upload müssten 5, 5"}, {"id": 31, "start": 350.36, "end": 376.08, "text": "Ambit müssten Upload sein, kackt jetzt schon ab, Lulve, ja, voll für den Arsch, es müssten"}, {"id": 32, "start": 376.08, "end": 397.68, "text": "5 Ambit Upload sein, ok wir stellen es mal auf 2, das geht, ne, 720p bringt auch nichts,"}, {"id": 33, "start": 397.68, "end": 426.44, "text": "ok das ist jetzt besser, oder, aber es, Alter."}]}